{"title": "Dogma", "full_text": "DOGMA\n\nEXT ASBURY PARK BOARDWALK - DAY\n\nJersey spring day. Beyond the wooden planks that make up the aged fun pier,\nthe ocean waves crash into the sandy shoreline.\n\nAn OLD MAN stares at the empty beach. Sun-worshipers hours away from\nbesmirching the dunes. His features are simple. He wears an old overcoat.\nHis face belies good years gone by - a face that has seen more sunrises\nthan one would suspect. He inhales the crisp, salty air and lets a small,\nsatisfied smile cross his face.\n\nBehind him. a large arcade with steel shuttered doors sits on the\nboardwalk. Three young boys skate around by on roller blades, passing a\nstreet hockey ball between them proficiently. The Old Man views them\nbriefly. checks his watch, and looks back toward the ocean.\n\nThe skates of the three hockey playing youths skid to a halt. We pan up to\ntheir faces - now cold and dispassionate. They look at one another and nod.\n\nTheir skates glide out of frame.\n\nP.O.V. SKATERS - The Old Man leans on the railing that overlooks the beach.\nWe get closer and closer to him until...\n\nOne of the skaters checks him hard into the railing. The Old Man exhales\nviolently and falls to his knees. The two other skaters begin savagely\nbeating on him with their hockey sticks, as he crumbles beneath them.\nRepeatedly their blades crash down hard on his head.\n\nOC VOICE\n\nI don't understand - how can you base your lack of belief in God on the\nwritings Lewis Caroll?\n\nThe three skaters cease their beating and check the Old Man's pulse.\nSatisfied, they skate away, leaving his crumpled form on the boardwalk.\n\nINT AIRPORT - DAY\n\nLOKI walks beside a NUN in a semi-busy terminal. They pass through the\nmetal detectors. The Nun carries a donation can.\n\nLOKI\n\nLeaving 'Alice in Wonderland' aside, look closely at 'Through the Looking\nGlass' - particularly 'The Walrus and the Carpenter' poem: what's the\nmetaphorical meaning?\n\nNUN\n\nI wasn't aware there was one.\n\n                                   LOKI\n\nOh, but there is - it colorfully details the sham that is organized\nreligion. The Walrus - with his girth and good-nature - obviously refers to\neither the Buddha, or - with his tusks - the lovable Hindu elephant god,\nLord Ganesha. This takes care of the Eastern religions. The Carpenter is an\nobvious reference to Jesus Christ, who was purportedly raised the son of a\ncarpenter. He represents the Western religions. And in the poem. what do\nthey do? They dupe all the oysters into followmg them. Then. when the\noysters collective guard is down. the Walrus and the Carpenter shuck and\ndevour the helpless creatures, en masse. I don't know what that says to\nyou, but to me it says that following faiths based on these mythological\nfigures insures the destruction of one's inner-being.\n\nBARTLEBY sits amongst a row of seats by one of the arrival gates. He eats\npopcorn and stares at...\n\nA steady stream of TRAVELERS, exiting the gate, meeting lovedones, family.\n\n                                  OC LOKI\n\nOrganized religion destroys who we are or who we can be by inhibiting our\nactions and decisions out of fear of an intangible parent-figure who shakes\na finger at us from thousands of years ago and says \"No, no!\"\n\nBartleby smiles at the meet-and-greets, warmed. Loki saddles up beside him,\nkneeling on one of the seats, facing the Nun.\n\n                                   LOKI\n\n'Through the Looking Glass' - a children's tale? I think not.\n\n                                    NUN\n\n(really dazed)\n\nI've... I've never really thought about it like that...\n\n(beat; shocked; off her cassock)\n\nWhat have I been doing with my life...?'.\n\n                                   LOKI\n\nDon't look back. Just get out there and taste life.\n\n(off donation can)\n\nLeave this for the unenlightened. Poverty is for the gullible - it's\nanother way the church is trying to control you. You take that money you've\nbeen collecting for your parish reconstruction and go get yourself a nice\npiece of ass. You deserve it.\n\nThe Nun nods at him, and saunters off, obviously grappling with something.\nA passerby tries to stick money in her can, but she yanks it away. Loki\nfaces the proper direction in his seat and plops down beside the\nstill-transfixed Bartleby.\n\n                                 BARTLEBY\n\n                               (looking OC)\n\nHere's what I don't get about you: you know for a fact that there is a God.\nYou've been in his presence, he's talked to you personally. And yet I just\nheard you claim to be an atheist.\n\n                                   LOKI\n\nC'mon man - you know I don't believe any of that shit I was telling her. I\njust like to fuck with the clergy; keep 'em on their toes. When her head\nstops spinning, she'll be facing the way of the Just again. But oh. will\nshe have a bunch to confess.\n\n(looks around)\n\nNow here's what I don't get about you: why do you feel the need to come\nhere all the time?\n\n                                 BARTLEBY\n\n(off travelers)\n\nI like to watch. This is humanity at it's best. Look at them.\n\nA reunited FAMILY share a group hug and move on, making way for two young\nLOVERS to embrace and kiss passionately.\n\n                                OC BARTLEBY\n\nAll that tension, all that anger and mistrust, forgotten for one perfect\nmoment when they come off that plane. See those two? The guy doesn't even\nknow that the girl cheated on him while he was away.\n\nOC LOKI\n\nShe did?\n\nBartleby and Loki continue to watch the arrivals.\n\n                                 BARTLEBY\n\nUh-huh. Twice. But it doesn't matter at this moment because they're both so\nrelieved to be with one another. I like that. I just wish they could all\nfeel that way more offen.\n\n                                   LOKI\n\nMaybe if someone gave them free bags of peanuts more often they would. Now\nwhat was so friggin' important that I had to miss cartoons this morning? If\nit was to share in your half-assed obsessions with Hallmark moments, I'm\ngoing to slug you.\n\n                                 BARTLEBY\n\n(still looking OC)\n\nYou're never going to believe this: we're going home.\n\n                                   LOKI\n\n(off Bartleby's popcorn)\n\nLet me have some?\n\n                                 BARTLEBY\n\n(pulls out envelope)\n\nLook what somebody sent us in the mail.\n\n(hands him a newspaper article and corn)\n\n                                   LOKI\n\nDid you say we're going home?\n\n(reads)\n\n\"Cardinal Glick Cuts Ribbon on 'Catholicism - Wow!\"\n\nCampaign.\"\n\n(to Bartleby)\n\nAnd?\n\nBARTLEBY\n\nKeep reading.\n\n                                   LOKI\n\n(reads)\n\n\"Updating the church... television spots... Papal consent...\nrededication...\n\n(to Bartleby)\n\nAgain - and?\n\n                                 BARTLEBY\n\n(snatches article) Give me this\n\n(getting up; reading)\n\n\"The Re-dedication of Saint Michael's Church on it's hundredth anniversary\nis the kickoff of a new campaign that seeks to bring the Catholic Church\nback into the mainstream. With a papal sanction, the archway entrance to\nthe centuryold, Jersey shore house of worship will serve as a passageway of\npleanry indulgence, which - according to Catholic beliefs - offers all who\npass through it's arches a morally clean slate.\"\n\n(looks at Loki)\n\nYou still don't get it, do you?\n\n                                   LOKI\n\nNo, I don't get it. Are we leaving now?\n\nThey start walking.\n\n                                 BARTLEBY\n\nIf you walk through the church's front door on the day of the Re-dedication\nceremony, your soul is wiped clean of any and all existing sin, moreso than\nthe sacrament of penance could ever offer. It's a plenary indulgence, man!\nI don't know why I never thought of this before.\n\n                                   LOKI\n\n(spits out chewed popcorn into trash can)\n\nSounds thin. Sounds like someone made it up.\n\n                                 BARTLEBY\n\nIt's rarely employed, but it's legitimate. It has a papal sanction for\nGod's sake.\n\n                                   LOKI\n\nSo you're saying you and I can walk through this doorway and go back home?\n\n                                 BARTLEBY\n\nNo - by passing through the doors, our sins are\n\nforgiven. Then all we have to do is die...\n\n                                   LOKI\n\nWait. wait, wait - Die? I don't want to die.\n\n(chews popcorn)\n\n                                 BARTLEBY\n\n(steps on conveyor belt)\n\nYou'd rather stay down here for a few more eons?\n\n                                   LOKI\n\nNo, but we don't even know if we can die. And what if we can, but this\narchway thing doesn't pan out? What then? Hell? Fuck that.\n\n(spits out chewed popcorn into napkin)\n\n                                 BARTLEBY\n\nImpossible. If we cut off our wings and transubstantiate to complete human\nform then we become mortal. And if we die with clean souls, there's no way\nto keep us out. They have to let us in.\n\nLOKI\n\n(beat)\n\nWho sent this thing?\n\n                                 BARTLEBY\n\nI don't know. Somebody who's looking out for us,\n\nI guess. Does it matter? All that matters is that\n\nafter all these years, we've found a loophole. He\n\ncan't keep us out anymore. And once we're back\n\nin, I'm sure He'll just forgive and forget.\n\nThey pass the Nun. who leans against a wall, still dazed.\n\n                                   LOKI\n\nYeah, but this plenary' indulgence thing is a church law, not Divine\nMandate. Church laws are fallible because they're created by man.\n\n                                 BARTLEBY\n\nOne of the last sacred promises imparted to Peter the first Pope by the Son\nof God before He left was \"Whatever you hold true on earth...\"\n\n                                   LOKI\n\n\" ...I'll hold true in Heaven.\"\n\n                                 BARTLEBY\n\nSo if the Pope says it's so, God must adhere. It's dogmatic law.\n\n                                   LOKI\n\n(beat; extends hand)\n\nLet it never be said that your anal retentive attention to detail never\nyielded positive results.\n\n                                 BARTLEBY\n\n(accepts hand)\n\nYou can't be anal retentive if you don't have an anus.\n\n                                   LOKI\n\nThere's just one thing I think I should do before we leave - something\nthat'Il get us back on His good side.\n\nBARTLEBY\n\nWhat's that?\n\nLoki smiles and starts rifling through his pockets. He extracts a magazine\narticle.\n\n                                   LOKI\n\nThis is something I've been dreaming about for five years now. Read.\n\nThe crumpled article displays a Barney-like gold-hued cow, alongside\nvarious profit charts and text.\n\n                                OC BARTLEBY\n\n                                 (reading)\n\n\"Mooby the Golden Calf- Creating an Empire Out of Simplicity.\"\n\nLoki wipes his mouth and nods to the article.\n\nLOKI\n\nI want to hit them.\n\n                                 BARTLEBY\n\nAre you nuts?!\n\n(crumples article)\n\nWe're mere days away from getting back, and you want to jeopardize it\nbecause you have a soft spot for the good ol' days?!\n\n                                   LOKI\n\nWhat better way to show I've repented than by resuming the position I\ndenied... thanks to you.\n\n                                 BARTLEBY\n\nA killing spree is not going to make things better for us.\n\n                                   LOKI\n\nWe're not talking about killing here. We're talking about Divine Justice.\nWe're talking about punishing the wicked, raining down fire and brimstone.\nHe's all about that. I just know he'd want this done.\n\n                                 BARTLEBY\n\nThere hasn't been an Angel of Death since you quit. Doesn't that mean\nanything to you? Besides, what if you're wrong?\n\n                                   LOKI\n\nIf I'm wrong, it won't matter. Like you said - we pass through the arch and\nwe're forgiven anyway\n\nThey step up to an elevator and press the button.\n\n                                 BARTLEBY\n\n(considering it)\n\nWell... he does hate competition.\n\n(reading article)\n\nAnd this Mooby deninitely falls under that heading.\n\n                                   LOKI\n\nThe church we have to go to is where?\n\n                                 BARTLEBY\n\nNew ]ersey. The Rededication is in four days.\n\nThe doors open. They get on. Other people are inside as well.\n\n                                   LOKI\n\nOur last four days on earth. If I had a dick, I'd go get laid. But we can\ndo the next best thing.\n\nBARTLEBY\n\nWhat's that?\n\nLOKI\n\nLet's kill people.\n\nA guy beside Loki reacts. Loki smiles at him as the elevator doors close.\n\nOPENING CREDITS\n\nBetween black cards with white credits there are shots of the OLD MAN from\nthe boardwalk being wheeled into a hospital on a gurney, being treated in\nthe emergeny room, being hooked up to life support system, and finally\nresting in an intensive care wing.\n\nEXT ST. STEPHEN'S PARISH - DAY\n\nThe church sits on a grassy knoll in Mc Henry - a suburb of Chicago. Some\nkids tear by on bikes and egg it.\n\n                                 OC PRIEST\n\nThe greater Illinois chapter of the Right to Life foundation will be\nholding it's bi-annual softball game against the Cook County Pro-Choice\nleague next Sunday at two.\n\nINT ST. STEPHEN'S PARISH - DAY\n\nThe PRIEST speaks from the lectern, addressing semi-filled rows of the\nfaithful.\n\n                                  PRIEST\n\nThose who find the weekly demonstration outside of\n\nthe Twelfth Street Planned Parenthood Clinic hard to make due to work\nschedules are urged to show their support in the fight against the\nthoughtless and wanton destruction of life by cheering on our boys on the\nfield. Refreshments. as always, will be served.\n\nDollying down the rows while the Priest rattles on. we pass the\nparishoners. Some listen intently, others are nodding off. One\nsurreptitiously listens to a Walk-man; a man and a woman quietly argue\nwhile their kid colors in a coloring book, going off the page and marking\nthe pew; two kids play cards; one guy leafs through a copy of Hustler\nhidden by his hymnal book.\n\n                                 OC PRIEST\n\nToday's second collection will be donated to the John Doe Jersey Life Fund.\nFor those of you who haven't been following the news, an unidentified\nhomeless man who was accosted and severely beaten at the New Jersey shore\nlast Tuesday lies in critical but stable condition in one of that area's\nhospitals. He lacks identification and police have had no luck in tracking\ndown any possible family. While he shows no signs of recovery, the\nArch-Bishop of the Trenton Diocese has disputed the state's decision to\nremove the indigent man from life support systems, asking that Catholics\nall over the country join in this protest against Euthanasia. And finally -\nwill whoever keeps parking in my spot, stop doing that. Thank you. Now,\nplease rise for the recession of faith. We believe in one God, the\nfather...\n\nAs the congregation flatly joins in the prayer, we stop on BETHANY - a\nbeautiful twenty-something woman who struggles to stay awake. She checks\nher watch and exhales softly.\n\n                                 OC VOICE\n\nI don't really want to be here.\n\nENT PLANNED PARENTHOOD CLINIC - DAY\n\nA small gaggle of signcarrying RIght-to-Lifer's march in front of the\nsterile looking building.\n\n                                 OC VOICE\n\nBut then again, I guess nobody ever does... except maybe you.\n\nINT BETHANY'S OFFICE - DAY\n\nThe source of the voice - a GIRL - sits beside Bethany's desk, stretching\nout her gum. Bethany offers her an understanding smile.\n\n                                   GIRL\n\nYou know, I've done this three times now; and each time the counselor tells\nme I should be more careful in the future, I should show' some\nresponsibility. Gotta tell you, though - this is the first time the\ncounselor wasn't some ugly as hell old bitch. It's kind of hard to take\nabortion advice from a woman who's too gross to get laid in the first\nplace.\n\n                                  BETHANY\n\nI'm not here to lecture you - I'm here to make sure you really want to go\nthrough with this.\n\n                                   GIRL\n\nI'd rather go back to that night when my idiot bovfriend swore up and down\nhe was sterile. Short of that, there aren't many choices left, now are\nthere?\n\n                                  BETHANY\n\nEver think about having it?\n\n                                   GIRL\n\n                                  (beat)\n\nWhat woman doesn't on some level.\n\nBETHANY\n\nI never did.\n\nGIRL\n\n                               (incredulous)\n\nYou had an abortion?\n\n                                  BETHANY\n\n(lights a smoke)\n\nMy first year in college. All through high school, I'd dated the same guy -\nWalter Flanagan. We were really in love, right? So much so. that we decided\nto go Carnegie Mellon together... that's this college in Pittsburgh. So\nthere we are -away at school, and there's suddenly no parents to worry\nabout anymore, so we're screwing like rabbits - just constanly doing it.\nAnd I wound up getting pregnant. So he begs me to have it. He says we\nshould quit school and get married, and I'm telling him that that'lI screw\nup our educations. We fought about it for a week - my arguement being there\nwas no rush to have kids, you know? We could always have a baby in a couple\nof years - after school. So I got the abortion against his wishes... I\nmean, what the hell - it was my body, right? After graduation, we got\nmarried and immediately set about trying to have kids. We tried like hell\nfor the first six months, and... nothing. So I went to a gynocologist to\nsee if everything was okay on my end.\n\n                                  (beat)\n\n                                It wasn't.\n\n(takes a drink)\n\nMy uteran wall had this fissure. It seems that the doctor who performed the\nprocedure on me years before had somehow botched it. I'd never be able to\nhave a child.\n\nThe Girl's face says it all. Bethany takes a drag and continues.\n\n                                  BETHANY\n\nSo there I am - devastated. And now I have to go home to break the news to\nmy husband who years before had begged me to have the baby - his baby. And\nafter I explain it to him through my tears, he sits on the couch and rubs\nhis eyes. And in the calmest, most rational voice I've ever heard anybody\nuse in my life, he asks me for a divorce. And I fought him, you know? I\ntried to talk him out of it; told him there were alternatives - like we\ncould adopt. And all he said was he wanted a wife who could have his\nchildren.\n\nGIRL\n\n                                  (beat)\n\nWhat happened?\n\n                                  BETHANY\n\nHe remarried. He had two kids in two years with his new wife. We never\nspoke again. And now I do this.\n\n                                   GIRL\n\nThat's like... such a sad story.\n\n                                  BETHANY\n\nI dated this guy a year or two ago - he was really into comic books. He\ntold me I had the stock superhero story -I wanted to prevent a wrong that\nhad happened to me from ever happening to anyone else. Kind of like Batman,\nhe said. The only difference is I don't put on tights to do it... unless\nall my other clothes are in the wash.\n\n(smiles and puts out her smoke)\n\nSo... let's go over your paperwork.\n\nEXT CLINIC - DAY\n\nA well-dressed LIZ maneuvers through the small thrall of Right-to-lifer's.\nThey shake their placards at her accusingly.\n\n                                PROTESTOR 1\n\nYou should be ashamed of yourself!\n\nPROTESTOR 2\n\nChild killer!\n\n                                    LIZ\n\n(looking over their shoulders)\n\nHOLY SHIT!! IT'S THE POPE!!\n\nAs the thrall turns excitedly in an effort try to spy the imaginary\npontiff, Liz ducks inside the clinic.\n\nINT CLINIC COFFEE ROOM - DAY\n\nA NEWSPAPER HEADLINE fills the frame - \"CHURCH SAYS NO TO DEATH OF JOHN\nDOE\". It's lowered to reveal Bethany, reading. Liz enters and hangs up her\ncoat.\n\n                                    LIZ\n\nJesus! You're a Catholic, aren't you? Can't you talk\n\nto them or something?\n\n                                  BETHANY\n\nThey hate me more than you, no doubt. At least you have an excuse - you're\n]ewish,\n\nyou don't know any better.\n\n                                    LIZ\n\nI don't think they'd accept that one - we already used it as our excuse for\nkilling Christ. So where were you yesterday morning - a bunch of us went\nout for brunch?\n\nBETHANY\n\nI went to church.\n\n                                    LIZ\n\nThat kills me. You and church. We work in a field that specializes in\npissing off the cloth and you add insult to injury by breaking bread with\nthem every week.\n\n                                  BETHANY\n\nI sit there every Sunday and I feel nothing. I can remember sitting in\nchurch when I was a kid and being moved - like everything meant something,\nlike I was important. And the stories of all these holy people were so\ninspiring. Now I sit there and think about my checking, and what I'm going\nto wear to work the next day.\n\n                                    LIZ\n\nSo then why do you still go?\n\n                                  BETHANY\n\n(beat)\n\nYou wouldn't believe me if I told you.\n\n                                    LIZ\n\nYou think I'm going to mock your religious beliefs? We're friends, Bethany\n- I may mock you for being a divorce' at twenty five who's never had an\norgasm, but I'd never mock you for having faith.\n\n                                  BETHANY\n\nThat's just it - I don't. I don't think I have any faith left.\n\n                                    LIZ\n\n(making coffee)\n\nI had a girl in here once - 'bout fifteen. She told me that faith is like a\nglass of water. When you're young, the glass is full, and it's easy to fill\nup. But the older you get, the bigger the glass gets, and the same amount\nof water doesn't fill the glass anymore. Periodically, the glass has to be\nrefilled.\n\n                                  BETHANY\n\nA fifteen year old who came in here said that?\n\n                                    LIZ\n\nShe had gotten knocked up by her pastor.\n\n                                  BETHANY\n\nJesus! See? A minister knocks up a teenager -isn't anyone afraid of the\nLord's wrath anymore?\n\n                                    LIZ\n\nThat would require faith, and that commodity lately seems reserved only for\nthe psychotic zealots that hang around outside.\n\n(collects her things to leave)\n\nSo what are you doing tonight?\n\n                                  BETHANY\n\nWatching T.V.\n\n                                    LIZ\n\nGirl, you need a man. If only for ten minutes.\n\n                                  BETHANY\n\nIt's been my experience that the average male is never a man - not even for\nten minutes in his entire life span.\n\n                                    LIZ\n\nUh-oh - that sounds militant. You thinking of joining the other side?\n\n                                  BETHANY\n\nCouldn't do it. Women are insane.\n\n                                    LIZ\n\nThen girl, you better get back to church and ask God for a third option.\n\nBETHANY\n\nI think God is dead.\n\n                                    LIZ\n\nThe sign of a true Catholic.\n\nLiz exits with her coffee. Bethany stares after her.\n\nINT A QUAINT SUBURBAN HOME - DAY\n\nThe Stygian Triplets kneel on one knee before a high-backed leather chair,\nupon which Sits a shadowy figure who we see from behind. They appear to be\nin a den or library.\n\n                              SHADOWY FIGURE\n\nAll proceeds according to plan. No doubt, the powers will attempt to\ncontact the Last Scion. You know where she is. She must be elliminated\nbefoie she enters the frav. When she is negated, there will be nothing to\ninterfere with our plan. Shuffle her loose her mortal coil, that we may\nobtain our final glory.\n\n                                  (beat)\n\nGo.\n\nThe Stygian Triplets rise and skate off.\n\nINT BETHANY'S KITCHIEN - NIGHT\n\nThe fridge door opens and Bethany glances around inside. She pulls out a\nchocolate cake and closes the door.\n\nINT BETHANY'S LIVING ROOM - NIGHT\n\nBethany sits on the couch, eating cake with a fork and watching the OC t.v.\nThe theme song to Filmation's 'Batman and Robin' cartoon can be heard. She\nsips some milk from a glass and has some more cake.\n\nINT BETHANY'S BEDROOM - NIGHT\n\nBethany's in bed, staring up at the ceiling. From the darkness, a creaking\nfloor board is heard. Bethany reacts, grabbing a bat from under her pillow.\nShe peers into the darkness, defensively wielding her bat.\n\nSuddenly, the room explodes in flames. A huge fire that appears to be\nshooting out from the floor ignites mere feet from Bethany's bed. Bethany\nleaps back, taking a beat to stare, mesmerized. Looking closely, one can\nsee an anthropomorphic form standing in the blaze.\n\n                                   VOICE\n\n(powerful; booming)\n\nBEHOLD THE METATRON - HERALD OF THE ALMIGHTY AND\n\nVOICEOF THE ONE TRUE GOD!\n\nThe Voice repeats itself. Bethany darts out of bed and dashes out of the\nroom, quickly returning with a fire extinguisher. While the voice is in\nmid-sentence, she blasts the thing with the contents of the canister,\nswirling the nozzle around to hit all the flames. The booming Voice\nsputters and starts coughing, losing it's impressive edge. Bethany stops\nsquirting and turns on her bedside lamp.\n\nA choking, drenched, and coughing androgynous figure in a suit waves her\naway. The figure coughs up some of the extinguisher's contents and drops to\nthe floor, hacking. It is METATRON. Bethany stares, shocked.\n\n                                 METATRON\n\n(between coughs)\n\nSweet. ..Jesus! Did you... have to empty...the whole can?!\n\nBethany grabs her bat again and holds it up, this time offensively.\n\n                                  BETHANY\n\nWHO THE FUCK ARE YOU AND WHAT THE FUCK ARE YOU DOING IN MY ROOM?!\n\n                                 METATRON\n\n(slowly rising to it's feet)\n\nI'm the one... who's soaked and... she's the one who's pissed. That's rich!\n\n                                  BETHANY\n\n(reaching for phone, still holding bat)\n\nI'm calling the cops! Breaking and entering, attempted arson... they're\ngoing to lock you up for life...!\n\n                                 M ETATRON\n\n(wiping off clothes)\n\nNo dial tone.\n\n                                  BETHANY\n\n(ear to phone)\n\nYou cut the phone lines...\n\n(even more offensive with bat)\n\nGet the fuck out of here, now!\n\n                                 METATRON\n\nOr you'll what - hit me with that fish?\n\nThe bat Bethany held is now a salmon. She drops it to the floor and freaks.\n\n                                 METATRON\n\nNow just sit down on the bed and shut up!\n\n                                  BETHANY\n\nOh God - you're going to rape me...\n\n                                 METATRON\n\nI'm not going to rape you.\n\n(to itself; off clothes)\n\nLook at my suit...!\n\n                                  BETHANY\n\nTake whatever you want, just don't kill or rape me...\n\n                                 METATRON\n\nEnough with the raping already! I couldn't rape you if I wanted to.\n\n(unzips pants and pulls them off)\n\nAngels are ill-equipped.\n\nBethany stares. There, before her, stands the exposed Metatron. There is\nnothing where some sexual genitalia should be - it's as smooth and\nanatomically impaired as a Ken doll.\n\n                                 METATRON\n\nSee? I'm as anatomically impaired as a Ken doll.\n\n(rings out pants)\n\nYou meat-puppets and your arrogance - you think everyone's just waiting to\nrape you.\n\n                                  BETHANY\n\nWh..what are you?\n\n                                 METATRON\n\nI'm pissed is what I am. You go around drenching everyone that comes into\nyour room with flameretardent chemicals? No wonder you don't get laid.\n\n(pulls pants back on)\n\nGo get me a towel, will you?\n\nBethany blinks. She exits the room and comes back with a towel. She holds\nit out to Metatron who grabs it and starts toweling off.\n\n                                 METATRON\n\n(taking off jacket)\n\nStand back.\n\nBethany steps back. Metatron flexes and huge fucking wings extend from it's\nback, dripping water. Bethany goes wide-eyed and cowers against the wall.\n\n                                 METATRON\n\n(tosses towel away)\n\nLike I was saying - I am the Metatron.\n\nBethany stares, saying nothing, pinned against the wall. Metatron looks\ninsulted.\n\n                                 METATRON\n\nMetatron. Don't tell me the name doesn't ring a bell?\n\nBethany remains silent and wideyed. Metatron gets testy.\n\n                                 METATRON\n\nYou people. If there isn't a movie about it, it's not worth knowing, right?\n\n                                  (beat)\n\nI am a seraphim.\n\n(beat)\n\nThe highest choir of angels?\n\n(beat)\n\nYou do know what an angel is, don't you?\n\nBethany slowly nods.\n\n                                 METATRON\n\nMetatron acts as the voice of God. Any documented occasion when some yahoo\nclaims to have spoken with God, they're speaking to me. Or they're speaking\nto themselves.\n\n                                 BET HANY\n\n                                  (beat)\n\nWhy doesn't God speak for himself?\n\n                                 METATRON\n\nAh. So glad you decided to join the conversation. To answer that - human\nbeings have neither the aural nor the psychological capacity to withstand\nthe awesome\n\npower of God's true voice. Were you to hear it, you're mind would cave in\nand your heart would explode within your chest. We went through five Adam's\nbefore we figured that out.\n\n                                  BETHANY\n\nAre you going to kill me?\n\n                                Ni ETATRON\n\nI could for what you did to this suit. Unfortunately I can't. You're\ncalled.\n\n                                 BETH ANY\n\n                                  (beat)\n\nCalled how? How called?\n\n                                 METATRON\n\nAll that from two words. Color this angel impressed.\n\n                                  BETHANY\n\n(beat)\n\nHow do I know you're an angel?\n\n                                 METATRON\n\nOh, you mean besides the fiery entrance and the expansive wingspan? You\npeople kill me. Fine. You want more proof? How about a tequila?\n\n(snaps fingers)\n\nINT MEXICAN BAR - NIGHT\n\nBethany and Metatron sit at a table. Bethany immediately clutches at her\npajamas. Metatron waves a WAITER over.\n\n                                  BETHANY\n\nWhere the hell are we?!\n\n                                 METATRON\n\nThe only place one can go for good tequila.\n\n(to Waiter)\n\nDos tequilas, por favor. And an empty glass.\n\n                                  WAITER\n\nSi.\n\nThe Waiter turns to leave. Metatron yanks a smoke from his pocket as he\ngoes.\n\n                                 METATRON\n\nGracias, senor.\n\n                                  BETHANY\n\nWe're in Mexico?!\n\n                                 METATRON\n\nActually, we're in the Chilli's down the street from your house, but it was\n                         still an impressive trick\n\n(lights smoke)\n\nYou don't mind that I lost the wings, do you? I'm trying to keep our\nprofile low.\n\n                                  BETHANY\n\nI suppose it would be too cliche to observe aloud that this is the weirdest\ndream I've ever had.\n\n                                 METATRON\n\nCan you imagine how insulting it is to converse with a person and have them\ninsist you're a dream? If I had an ego, it'd be bruised.\n\n                                  BETHANY\n\nWhat do you want with me?\n\n                                 METATRON\n\nI'm to charge you with a holy crusade.\n\n(pause)\n\nYou do know what a crusade is, don't you?\n\n                                  BETHANY\n\n(sarcastically)\n\nUh, yeah.\n\n                                 METATRON\n\nDon't give me that. Last time I charged someone with a crusade they had to\nlook the word up.\n\n                                  BETHANY\n\nWhy am I supposed to go on a crusade?\n\n                                 METATRON\n\nYour's is a heritage divine. Also, you didn't seem to be doing much lately.\n\nThe Waiter arrives with their drinks.\n\n                                 METATRON\n\nOh - Gracias!\n\n(he leaves; off the tequila)\n\nOne of the only things your people have mastered since you crawled from the\nprimordial ooze.\n\n(sips)\n\n                                  BETHANY\n\nI work in an abortion clinic.\n\n                                 METATRON\n\n(spits tequila into empty glass)\n\nMoses was a drunk. Look what he accomplished. And no one's even asking you\nto part an ocean. All you have to do is go to New Jersey.\n\n                                 BETH ANY\n\nNew ]ersey.\n\n                                 METATRON\n\nSure. Go to New Jersey and visit and small church on a very important day.\nAgreed?\n\n                                  BETHANY\n\nThat doesn't sound like a crusade.\n\n                                 METATRON\n\nAside from the fine print, that's it.\n\n                                  BETHANY\n\nWhat's the fine print?\n\n                                 METATRON\n\n(mumbles into glass)\n\nstopacoupleofangelsfromenteringandthusnegatingallexistence.\n\nDamn, this is good tequila.\n\n(sips)\n\n                                  BETHANY\n\nWait, wait, wait. Repeat that.\n\n                                 METATRON\n\nDamn, this is good tequila?\n\n                                  BETHANY\n\nThe first part.\n\n                                 METATRON\n\n(spits into empty glass)\n\nDetails. Stop a couple of angels from entering and thus negating all\nexistence. God, I hate when people need it spelled out for them.\n\n                                  BETHANY\n\nClarify that.\n\n                                 METATRON\n\nThat's the problem with you people - you need every-thing clarified. No\nleaps of faith whatsoever. Alright -vou want the whole secret origin? Here\ngoes: Back in the old days, God was vengeful and hot-tempered, and his\nwrath was bore by the Angel of Death - name of Loki. When Sodom and\nGommorah were destroyed? That was Loki. When the waters wiped out\neverything with the exception of Noah and his menagerie? That was Loki. And\nhe was good at what he did. But one day, he refused to bear God's wrath any\nlonger.\n\n                                  BETHANY\n\nWhy?\n\n                                 METATRON\n\nBecause he listened to his friend - a Grigori by the name of Bartleby.\n\n                                  BETHANY\n\nGrigori?\n\n                                 METATRON\n\nOne of the choirs of angels. They're called Watchers. Guess what they do?\n\n                                  BETHANY\n\nSo they're like Guardian angels?\n\n                                 METATRON\n\nExactly like that, but different. So one day, Loki's wiping out all the\nfirst born of Egypt...\n\n                                  BETHANY\n\nThe Tenth Plague.\n\n                                 METATRON\n\nSee? Tell a person you're the Metatron and they stare at you blankiy;\nmention something out of a Charlton Heston movie and they're suddenly\ntheology scholars. May I continue uninterrupted?\n\n(Bethany nods)\n\nSo once he's done with the first born, Loki takes his friend Bartleby out\nfor a post-slaughter drink. And over many rounds, they get into this\ndiscussion about whether or not murder in the name of God is okay. Now,\nBartleby can run circles around Loki intellectually, not to mention the\nfact that Loki's more than half in the bag, and in the end, Bartleby\nconvinces Loki to quit his position and take a lesser one - one that\ndoesn't involve slaughter. So - very inebriated - Loki tells God he quits:\nthrows down his fiery sword, gives him the finger - which ruins it for the\nrest of us. because from that day forward, God decreed that angels could no\nlonger imbibe alcohol. Hence all the spitting.\n\n                                  BETHANY\n\nSounds reasonable.\n\n                                 METATRON\n\nMaybe to you, but I'm a lush by nature.\n\n                                  BETHANY\n\nI mean about the angel of Death's resignation.\n\n                                 METATRON\n\nFor a liberal, yes, but this is the Angel of Death we're talking about. The\nAngel of Death can't be a conscientious objector. The Angel of Death is\ncharged with meting out whatever justice God demands. So for their\ninsolence, God decreed that neither Loki nor Bartleby would ever be allowed\nback into Paradise.\n\n                                  BETHANY\n\nWere they sent to Hell?\n\n                                 METATRON\n\nWorse. Wisconsin. For the entire span of human history. And when the world\nends, they'll sit outside the gates for eternity.\n\n                                  BETHANY\n\nAnd what's this have to do with me?\n\n                                 METATRON\n\nSomebody's clued them in to a loophole in Catholic dogma that would allow\nthem to reenter Heaven.\n\n                                  BETHANY\n\nSo what? They beat the system. Good for them.\n\n                                 METATRON\n\nIt's not that simple. If they get in, they will have reversed God's decree.\nNow listen up because this part is very important: existence in all it's\nform and splendor functions solely on one principle: God is infallible. To\nprove God wrong would undo reality and everything that is. Up would become\ndown, black would become white, existence would become nothingness. In\nessence - if they are allowed to enter that church, they'll unmake the\nworld.\n\n                                  BETHANY\n\nAre these guys that bitter?\n\n                                 METATRON\n\nNo, that's the stupid part: they have no idea what their actions will\nresult in. As far as they know, they're just going home. Isn't that sweet?\n\n                                  BETHANY\n\nIf this is so major, why are you talking to me? Why doesn't God do\nsomething?\n\n                                 METATRON\n\nHe could. He could blink them out of existence, destroy that church, turn\nthem into plants. But He'd rather see you take care of this one personally.\n\n                                  BETHANY\n\nWhy me?\n\n                                 METATRON\n\nBecause of who you are.\n\n                                  BETHANY\n\nAnd who am I?\n\n                                 METATRON\n\nThe girl in the p.j.'s. Don't ask so many questions just serve your\npurpose.\n\n                                  BETHANY\n\nI'll pass.\n\n                                 METATRON\n\nI beg your pardon?\n\n                                  BETHANY\n\nWhen some asshole abortion doctor destroyed my uterus -where was God? When\nmy\n\nhusband decided he couldn't be with a wife that couldn't bear his children\n- where was\n\nGod? Now all the sudden, after all these years of quiet noninvolvement in\nmy life, He\n\nsends one of His lackey's my way who tells me I should save the world, and\nas what -\n\nsome sort of test? To Hell with Him.\n\n                                 METATRON\n\nDo yourself a favor Bethany - do the world a favor: let go of your petty\ncrap. It's served you precious little in the past, and it serves you even\nless now when the fate of existence\n\nhangs in the balance. Don't allow eons of history and life to get blinked\nout of being just because you have a grudge against your creator.\n\n                                  BETHANY\n\nA grudge? Do you know why I work in that clinic? It's my own private way of\nsaying\n\n\"fuck you\" to God.\n\n                                 METATRON\n\nAnd any other day I'd say that's your business and your life, and enjoy\nyourself and goodnight. But this isn't about you - this is about eve~body.\nSo you lost the abiliry to make life. You're being offered the chance to\nplay mother to the world by acting like one and protecting it - saving it.\n\n(swigs her drink and spits it out)\n\nBut I can't make you. You'll do what you will. However, if you should\ndecide to stop being selfish and accept your responsibility, you won't be\nalone. You'll have support.\n\n                                  BETHANY\n\nWhat, more angels?\n\n                                 NIETATRON\n\nProphets - although they don't quite get it yet. You'll know them right\naway - one speaks, the other listens. The one who speaks - and he will at\ngreat lengths, whether you want him to or not - will make mention of\nhimself as a prophet. The other one won't say anything, but he'll be\nhelpful\n\njust the same.\n\n(looks at watch)\n\nI have to go. You'll do what you will, but try to remember that we're\nworking in a time frame here.\n\nMetatron moves to exit.\n\n                                  BETHANY\n\n(beat)\n\nHey.\n\n(Metatron turns)\n\nYou work for God.\n\n                                 METATRON\n\nThey tell me it's God. If it's not, I'm going to be severely pissed - what\nwith all these years of bossing people around on his behalf and\nexpectorating perfectly good tequila.\n\n                                  BETHANY\n\nWhat's he like? God?\n\n                                 METATRON\n\n(thinks)\n\nLonely. But funny. He's got a great sense of humor.\n\n                                  BETHANY\n\nI'll bet.\n\n                                 METATRON\n\nLook at sex. Sex is funny. One time I asked him why you people had to look\nso stupid while procreating. He said if you didn't, you'd do it all the\ntime, just for fun.\n\n                                  BETHANY\n\nBut we do.\n\n                                 METATRON\n\nI know. And you all look so damn stupid doing it. It kills us upstairs.\n\n                                  BETHANY\n\nSex is a joke in Heaven?\n\n                                 METATRON\n\nThe way I understand it, it's mostly a joke down here too.\n\nAnd with that, Nietatron is gone. Bethany looks at her drink. A three-man\nmariachi band surround her and begin playing Prince's 'Little Red\nCorvette'.\n\nINT BETHANY'S BEDROOM - NIGHT\n\nBethany startles awake. The radio on her night-table plays 'Little Red\nCorvette'. She lays back down.\n\nINT BETHANY'S OFFICE - DAY\n\nBethany sits at her desk, staring into space. A twenty-something girl\nspeaks, butBethany's not really listening. She's extremely preoccupied.\n\nINT CLINIC - NIGHT\n\nBethany shuts off the lights in the various rooms. She packs up her bag and\nturns on the alarm.\n\nEXT CLINIC - NIGHT\n\nBethany exits and locks the door behind her. She starts walking.\n\nAs her feet tread lightly toward her car, three small shadows move toward\nher.\n\nBethany throws her bag on her car roof and rumages through her purse for\nher keys. She hears something and stops. Roller blades can be heard moving\nslowly across the asphalt of the parking lot. Bethany turns quickly.\n\nNobody's there. She looks around, a bit peturbed.\n\n                                  BETHANY\n\n(calling into the darkness)\n\nGod, what time do you people quit and go home?! Let's just save it for\ntomorrow, alright?\n\nThere's no response. Then there's the noise of wood being tapped against\nthe ground. Bethany peers into the darkness, looking for the source.\n\nSuddenly, a skater whips past her, slamming his stick into the back of her\nknee. Bethany goes down. Another skater whips in and slashes at her, but\nshe ducks. The stick hits the car door above her. She rifles through her\npurse madly until another skater whips by, dragging her purse away with his\nstick. Bethany looks up.\n\nThe Stygian Triplets are lined up menacingly, a few feet from her. They tap\ntheir hockey sticks in unison on the ground. Bethany jumps up and faces\nthem defensively. The Triplets emit an unholy shriek and charge at her.\n\nAnd from out of nowhere, a large figure swoops down from above, landing on\nthe ground between Bethany and her menacers. The Triplets stop short and\nregard the figure curiously. The large figure whips into a defensive\nstance, Batman-style.\n\nThe Stygian Triplets look to one another. They shrug and charge anew.\n\nFrom behind the rock-still large figure, a smaller figure leaps into the\nstreetlight, shrieking, flying through the air, busting into a flying kick.\nHe lands before the middle Triplet and open-palm punches him twice in the\nface, grabbing his stick from the falling child's hand and tossing it into\nthe air behind him.\n\nThe stick sails through the night air and is snatched by the grip of the\nlarge figure, who twirls it under his arm, and then back Out like a sai. He\nswings it out before him, knocking the other two Triplets off balance. The\nsmaller figure back flips into the larger figure's arms and kicks his feet\ninto the faces of the two wobbling Triplets. They go down, and the smaller\nfigure leaps forward with a shriek, landing between the fallen pair, elbows\ninto their backs.\n\nThe flrst struck Triplet leaps out of the darkness at the large figure,\nscreaming something unholy. The large figure catches the kid by the throat\nand quickly\n\nhead butts him, tossing him to the side. The large figure sways for a beat\nand then shakes it off.\n\nThe small figure collects the hockey sticks and throws them into the\ndistance. He kicks at the falien Triplets as they scurry away.\n\n                               SMALL FIGURE\n\n(calling after them)\n\nGO BACK TO YOUR PAPER ROUTES, YOU PUNK FUCKS!\n\n(more to himself)\n\nSnoogans.\n\nThe large figure saddles up beside the small figure. They look at one\nanother and shake hands.\n\n                               SMALL FIGURE\n\nDude, I know they were just kids, but we kicked their fucking asses!\n\nBethany stares, mystified. She grabs her purse from the ground.\n\n                                  BETHANY\n\nWhere... where did you learn to do... that stuff?!\n\n                               SMALL FIGURE\n\nFrom this comic book some guys made about us. Long story.\n\n                                  BETHANY\n\n(beat)\n\nI don't know what to say... or think.\n\nThe figures turn into the light, revealing the faces of the heroes for the\nfirst time - two very familiar faces.\n\n                               SMALL FIGURE\n\nSay you'll offer us sex as a reward.\n\n                                  BETHANY\n\nWho are you?\n\nThe large figure lights up a smoke. The small one extends his hand.\n\n                               SMALL FIGURE\n\nJay. And this is my business associate, Silent Bob.\n\n                                 BIETHANY\n\nWell thank you for being out here so late... Come to think of it, what are\nyou doing out here so late?\n\n(freezes)\n\nWait a second are you protestors?\n\n                                    JAY\n\nWhat's a protestor?\n\n                                  BETHANY\n\nYou're not with the Fight-to-Lifer's?\n\n                                    JAY\n\nYou mean those fucks with the signs and pictures of dead babies? Shit no.\nMe and Silent Bob are pro-choice:a woman 5 body is her own fucking\nbusiness.\n\n                                  BETHANY\n\nThen - I don't mean to sound ungrateful - but what are you doing hanging\naround?\n\n                                    JAY\n\nWe're here to pick up chicks.\n\n                                  BETHANY\n\n(a bit stunned)\n\nExcuse me?\n\n                                    JAY\n\nWe figure an abortion clinic is a good place to meet loose women. Why else\nwould they be there unless they like to fuck.\n\n                                  BETHANY\n\n(taken aback)\n\nOh. Right. Well, I should be going. Thanks for the rescue... I think.\n\n                                    JAY\n\n(shocked)\n\nWait, wait, wait - we just saved your ass, and you're just going to take\noff? What the shit is that?\n\n                                  BETHANY\n\nI had a weird night last night, and now tonight's not shaping up to be any\nbetter. I think I should go home, take some percosets, and lay down.\n\n(opens her car door)\n\n                                    JAY\n\n(to Silent Bob)\n\nHow about that shit? Fuck this town, man - I'm going back to Jersey and\nselling weed~\n\n(they start walking)\n\nAt least there I can get turned down while trying to make myself a profit.\n\nBethany freezes. Metatron's words echo in her ear. She shakes her head.\n\n                                  BETHANY\n\n(to herself)\n\nYou've gotta be kidding me.\n\n(thinks for a beat; then) Hey! Wait!\n\nShe runs up to them. They whip around and raise their fists defensively.\n\n                                  BETHANY\n\nSorry.\n\n(beat)\n\nWould you... I can't believe I'm doing this...\n\n(inhales deeply)\n\nWould you... like to have a drink with me?\n\nJay's face lights up. He punches Silent Bob in the arm.\n\n                                    JAY\n\nSee?! I told you if we hung around outside that place we'd get laid! Thank\nyou!\n\n(looking skyward)\n\nThank you, God!\n\nINT SEEDY GUN SHOP - NIGHT\n\nVarious guns are laid out atop a glass case.\n\n                                OC SALESMAN\n\nNow this piece is nice. It's not lightweight, but one look at it and nobody\n- I mean nobody - is going to fuck with you. Try it on.\n\nLoki picks up the gun. Bartleby and the SALESMAN look at him.\n\n                                   LOKI\n\nIt's a lot more compact than the flaming sword, I'll say that much.\n\n                                 BARTLEBY\n\nIt's the weapon of choice these days.\n\n                                   LOKI\n\nIt seems unimpressive. At least the sword looked intimidating. How can I\nstrike fear into the hearts of the wicked with this?\n\n                                 SALESMAN\n\nOh, I get it. You want to become a vigilante, right? Like Batman or\nsomething.\n\n                                   LOKI\n\nBatman never uses guns.\n\n(off gun)\n\nI don't know. It feels impersonal.\n\n                                 BARTLEBY\n\nThen don't use a gun. Just lay the place to waste like Sodom and Gommorah.\nNow that was something.\n\n                                   LOKI\n\nOh yeah, for you maybe. You got to stand there and read. I had to do all\nthe work.\n\n                                 BARTLEBY\n\nWhat work? You lit a few fires.\n\n                                   LOKI\n\nI rained down sulfur, man. There's a subtle difference.\n\n                                 BARTLEBY\n\nSure.\n\n                                   LOKI\n\nAre you kidding me? Any moron with a pack of matches can start a fire.\nRaining down sulfur takes a huge level of endurance. Mass genocide is the\nmost exhausting activity one can engage in, next to soccer.\n\n(to Salesman)\n\nI'll take this one.\n\n                                 SALESMAN\n\nFive seventy five to walk with it right now.\n\nLoki starts sifting through his wallet.\n\n                                 BARTLEBY\n\nSoccer?\n\nINT DINER - NIGHT\n\nAn English muffin is covered with a knife-full of jam. Bethany raises the\nbread to her mouth and takes a bite. She glances at the OC pair and stops\nchewing.\n\nJay and Silent Bob study her intently. Jay smiles widely, anticipatory, and\nnods.\n\nAll three sit at a small table near a window. Bethany puts the English\nmuffin down and brushes off her hands. Jay's feet are moving a mile a\nminute.\n\n                                  BETHANY\n\nAre you both from around here?\n\n                                    JAY\n\nI'm hard as hell.\n\n                                  BETHANY\n\nDo you live in the city?\n\n                                    JAY\n\nDo you have a friend for Silent Bob, or are you going to do us both? If so,\nI'm first. I hate sloppy seconds.\n\n                                  BETHANY\n\nYou're a man of principle. Where do you come from?\n\n                                    JAY\n\nWe used to live in a small town in Jersey. Real small town. We practically\nknew everybody.\n\n                                  BETHANY\n\nWhat brought you to McHenry?\n\n                                    JAY\n\nHollywood.\n\n                                  BETHANY\n\n(beat)\n\nHollywood?\n\n                                    JAY\n\nOh yeah. See, we used to sell smoke in front of this video store. And one\nday this fuck wants to rent a video. So we did, only we didn't have\nanyplace to watch it. So we went to the mall and popped it into a VCR at\nMacy's and sat on the floor and watched it. It was called 'Sixteen\nCandles'. Did you ever see it?\n\n                                  BETHANY\n\nYes.\n\n                                    JAY\n\nSo the next day we rented 'The Breakfast Club', and then 'Weird Science'\nwhere these two fucks have a chick that'll do anything for them and they\ndon't do nothing because it's a PG movie. But then we got thrown out of\nMacy's when we watched 'Pretty in Pink', because of this bitch.\n\n(points to Silent Bob)\n\n                                  BETHANY\n\n(to Silent Bob)\n\nWhat'd you do?\n\n                                    JAY\n\nYou know how at the end the red-headed bitch gets together with her dream\nguy at the prom?\n\n(Bethany nods)\n\nWell pussy here starts fuckin' sobbing all sorts of loud and shit. And the\nmanager's like \"Get the hell out of here!\" And I'm like \"Fuck you, you bald\ncocksucker! I'll kick your lard..\n\n                                  BETHANY\n\n(speeding him along)\n\nSo what exactly brought you to Illinois?\n\n                                    JAY\n\nOh yeah. See, all these movies take place in a town called Shermer, in\nIllinois. And there's all this fine bush running around, and we could kick\nall the dude's asses because they're all whiney pussies. Except Judd Nelson\n- he was harsh. But best of all, there was no one selling weed. So I says\nto Silent Bob \"Man, we could live phat if we were the blunt-connection in\nShermer, Illinois!\" So we collected some cash we were owed, and caught a\nbus. But when we got here,\n\nyou know what we found Out? There is no Shermer in Illinois. What kind of\nshit is that?! Fucking movies are bullshit!\n\n                                  BETHANY\n\nAnd now you live here?\n\n                                    JAY\n\nFuck that. This berg sucks. Everyone talks with a stupid accent so you\ndon't know what they're saying, and it's too fuckin' cold. We were talking\nabout taking off. Until we met you, that is.\n\n(kisses her hand)\n\n                                  BETHANY\n\n(retracts her hand)\n\nRight. So how much longer are you staying here?\n\n                                    JAY\n\nUntil you're ready to skip out and make with the sex.\n\n                                  BETHANY\n\nNo. How long are you staying in McHenry?\n\n                                    JAY\n\nWe're leaving tomorrow.\n\n                                  BETHANY\n\nWhere are you going next?\n\n                                    JAY\n\n(to Silent Bob)\n\nJesus - this broad asks alot of questions.\n\n(to Bethany)\n\nBack to Jersey. We've been going straight for like five\n\nyears now. It's about time for us to retire or something. Enjoy our salad\nyears. No more adventures.\n\n                                  BETHANY\n\nI see.\n\n(sips her coffee)\n\n                                    JAY\n\nYeah. So do you do anal? Is it true that chicks fart if you blast them in\nthe ass?\n\n                                  BETHANY\n\nI didn't ask you out for sex.\n\n                                    JAY\n\nI'll take head.\n\n                                  BETHANY\n\nI don't know why, but...\n\n(composes herself)\n\n...I want to go with you.\n\n                                    JAY\n\nWhat, like steady? You wanna be my girlfriend?\n\n(shrugs to Silent Bob)\n\nAlright, but Silent Bob has to live with us and you pay the rent.\n\n                                  BETHANY\n\nNo, I want to go with you to New Jersey.\n\n                                    JAY\n\nReally? You're the only chick I ever met that wanted to go to Jersey. Most\nchicks try to get out.\n\n                                  BETHANY\n\nWhen can we leave?\n\n                                    JAY\n\nWait a second! What is this shit? Are we going fuck or not?\n\n                                  BETHANY\n\nYou're going to lead me somewhere.\n\n                                    JAY\n\nMe lead you? Lady, I don't even know where I am half the time. If we're not\ngoing to fuck then what the hell did you ask me out for?\n\n                                  BETHANY\n\nSomeone told me I'd meet you, and you'd take me somewhere I was supposed to\ngo. I didn't believe it until you said that thing in the parking lot.\n\n                                    JAY\n\nWhat the hell are you babbling about? All I know is we saved your ass from\nsome angry fucking dwarfs and you promised us se~..\n\n(to Silent Bob)\n\nDidn't this crazy bitch promise us sex?\n\n(to Bethany)\n\n...and now you're telling me that I'm supposed to take you somewhere, and\nyou don't even know where it is?\n\n                                  BETHANY\n\n(beat)\n\nDo you believe in God?\n\n                                    JAY\n\n(horrified)\n\nHoly shit - you're a Jehovah's Witness! All the fine chicks that come out\nof that place, and we gotta get the one Jesus freak!\n\n(to Silent Bob, getting up)\n\nLet's go...\n\n                                  BETHANY\n\n(grabbing his sleeve)\n\nNo. wait...\n\n                                    JAY\n\n(pulling back)\n\nI'll scream rape.\n\n                                  BETHANY\n\nI can pay you.\n\n                                    JAY\n\n(quickly sitting back down)\n\nPay?\n\n                                  BETHANY\n\nFor being my guide. You were going to leave anyway; all I'm asking is to\ntag along and see where it leads. I'll pay a hundred bucks and all\nexpenses.\n\n                                    JAY\n\n(thinks; to Silent Bob)\n\nI feel like I'm Han Solo, and you're Chewie, and she's Ben Kenobi, and\nwe're in that fucked up bar.\n\n(to Bethany)\n\nWhat about sex?\n\n                                  BETHANY\n\nNo sex.\n\n                                    JAY\n\nAlright, but let's say we're caught in a situation where we've got like\nfive minutes to live, like a bomb or something is gonna go off - would you\nfuck us then?\n\n                                  BETHANY\n\nIn that highly unlikely situation?\n\n(beat)\n\nYeah, sure.\n\n                                    JAY\n\nYeah? You slut. Noonch.\n\n(to Silent Bob)\n\nWhat do you think?\n\nSilent Bob shrugs. Jay stands up.\n\n                                    JAY\n\nAlright. But I'll drive.\n\nEXT MAIN HIGHWAY - NIGHT\n\nBethany's car roars overhead, speeding down the road, reving awfully\nloudly.\n\nINT BETHANY'S CAR - NIGHT\n\nThe speedometer reads ninety five.\n\nJay drives, eyes glued to the road. happy as hell. Silent Bob smokes to his\nright. Bethany sits pinned against the back seat, wearing an uncomfortable\nand dubious look. She struggles to lean forward. The engine still races.\n\n                                  BETHANY\n\n(yelling over engine noise)\n\nWhat gear are you in?\n\n                                    JAY\n\n(not looking back)\n\nGear?\n\nEXT HIGHWAY - NIGHT\n\nJay, Silent Bob, and Bethany sit on and against the car. The hood is open\nand smoke billows out.\n\n                                    JAY\n\n(defensively)\n\nWell what do I know from shifting?! Like I ever drove before!\n\nSilent Bob shrugs and smokes. Bethany walks away, shaking her head.\n\n                                    JAY\n\nChicks.\n\nSilent Bob nods and extracts a tool from his jacket. He begins working on\nthe engine as a cross~ountry bus races by.\n\nINT BUS - NIGHT\n\nBartleby and Loki sit in the back. Bartleby reads a map and Loki stares at\nthe gun in his lap. A COUPLE makes out in the seat in front of them.\n\n                                 BARTLEBY\n\nWe have to pass through three more states to get to New Jersey: Indianna,\nOhio, and Pennsylvania.\n\n                                   LOKI\n\nWith a very important stop in Cleveland.\n\n                                 BARTLEBY\n\nOh right. The Angel of Death Returns. Sounds like a bad movie.\n\n                                   LOKI\n\nMovies are bullshit. And don't start with me, airight. The last time you\nbugged me about my job, you got us sentenced to life in Wisconsin.\n\n(looks out window)\n\nAll this time we've been down here, why didn't we ever leave the Cheese?\n\n                                 BARTLEBY\n\nHe said to stay where he put us. We feared worse punishment if we disobeyed\nHim again.\n\n                                   LOKI\n\nWhere were we afraid He'd send us?\n\n                                 BARTLEBY\n\nNew Jersey.\n\n                                   LOKI\n\nNow that, my friend. is irony.\n\n                                 BARTLEBY\n\n(beat)\n\nYou know, maybe you're wrong about this slaughter. How can you even be sure\nof what incurs the Lord's wrath these days? Times change. Remember when\neating meat on Friday was supposed to be a Hellworthy tresspass? Or when\npeople weren't even supposed to shop on Sundays?\n\n                                   LOKI\n\nThat stuff was small potatoes. The major sins never change. And believe me\n- I can spot a commandment breaker a mile away.\n\n                                 BARTLEBY\n\nSure.\n\n                                   LOKI\n\nYou don't believe me?\n\n(looks around; eyes fall on kissing couple)\n\nThere. There's one.\n\n                                 BARTLEBY\n\n(off couple)\n\nSo what? They're kissing.\n\n                                   LOKI\n\nAdultery.\n\n                                 BARTLEBY\n\nThat's a stretch. How do you know they're not dating?\n\n                                   LOKI\n\nYou'd know better than me - let's hear it.\n\n                                 BARTLEBY\n\nOh, I know the truth. But let's see how boned up on the job you really are.\n\n                                   LOKI\n\nA test?\n\n                                 BARTLEBY\n\nOf sorts. So what's your proof?\n\n                                   LOKI\n\nHe's wearing a wedding band.\n\n                                 BARTLEBY\n\nSo? Maybe that's his wife.\n\n                                   LOKI\n\nNo married man kisses his wife like that. You get married and the passion\ndies, man. Don't you ever watch talk shows?\n\n                                 BARTLEBY\n\nWhat are you talking about?\n\n                                   LOKI\n\nA guy makes his best plays when wooing. When the object of his desire is\nwon, there's no need to expend the effort anymore. He relaxes, satisfied\nwith the spoils of victory, which he then decides isn't so victorious\nbecause he's saddled with a life-mate.\n\n                                 BARTLEBY\n\nVery romantic sentiment.\n\n                                   LOKI\n\nThat's the problem - romance. You think about it :back in the old days,\nnobody got married out of quote, unquote, love. People married for\nproperty', dowries, or to procreate - to immortalize oneself through\noffspring. When did all this love stuff start? What the hell happened to\nthe status quo?\n\n                                 BARTLEBY\n\nThe Troubadors.\n\n                                   LOKI\n\nLionel Richie's old group?\n\n                                 BARTLEBY\n\nNo, that's the Commodores. The Troubadors were wandering minstrels and\ndramatists that sang melodramatic and sappy songs of undying love.\n\n                                   LOKI\n\nSounds like the Commodores.\n\n                                 BARTLEBY\n\nThe Troubadors made 'love' fashionable. And their influence altered the\nbalance in a significant fashion. Until them, people got married because\nthey had to. After them, people started 'falling in love'. Romantic\ncourtships became the norm. What started out as simple entertainment made\nsuch a dramatic impact as to forever alter the way society operates.\n\n                                   LOKI\n\nThat's human beings for you - easily misled. From the Garden of Eden to the\n'Thigh Master' - thev believe what they're told. I'm telling you - one day\nthey're all going to watch one too many John Hughes flicks and start\nlooking for Shermer, Illinois.\n\n                                 BARTLEBY\n\nBe fair. Humans are dumb, but not that dumb.\n\n(off couple)\n\nSo is it adultery or not?\n\n                                   LOKI\n\n(thinks; to couple)\n\nExcuse me.\n\nThe Couple stops kissing. The MAN looks at Loki.\n\n                                   LOKI\n\nAre you married?\n\n                                    MAN\n\n(puzzled)\n\nWhy?\n\n                                   LOKI\n\nJust curious.\n\n                                    MAN\n\n(holds up ring finger)\n\nWhat do you think?\n\nThe Man shakes his head and goes back to kissing. Bartleby offers Loki a\n\"Satisfled?' expression. Loki taps the Man on the shoulder.\n\n                                    MAN\n\n(breaks kiss; pissed)\n\nWhat?!\n\n                                   LOKI\n\nTo her?\n\n                                    MAN\n\nWhat?\n\n                                   LOKI\n\nAre you married to her?\n\n                                    MAN\n\nNot that it's any of your fucking business, but no! Why?!\n\nLoki looks at Bartleby. Bartleby rolls his eyes. Loki calmly shoots the man\nin the head. Screaming ensues.\n\nEXT HIGHWAY - NIGHT\n\nThe bus skids to a halt. People flock off in a panic. scattering. After a\nbeat, Bartleby and Loki deboard and stand there alone.\n\n                                 BARTLEBY\n\nYou're such an asshole.\n\n                                   LOKI\n\nDon't blame me, man. Blame the Commodores.\n\n                                 BARTLEBY\n\nTroubadors.\n\nEXT ROADSIDE OF HIGHWAY - DAWN\n\nSilent Bob still tools around under the hood, Jay hands him various\nwrenches. Bethany steams off to the side.\n\n                                    JAY\n\n(to Silent Bob)\n\nShe's pissed, dude. She'll never fuck us now. Well,\n\nmaybe you, but definitely not me.\n\n(beat)\n\nLet me know how she is.\n\n                                  BETHANY\n\n(turns on him)\n\nNobody is fucking me! You got that?!\n\n                                    JAY\n\nAt least not in this car.\n\n                                  BETHANY\n\n(sighs)\n\nI'm sorry I dragged you to that diner. I don't know what I was thinking.\nBut being that I've decided to go home and not to New Jersey, this is where\nyou two get off.\n\n                                    JAY\n\nYou're breaking up with us?\n\n                                  BETHANY\n\nGood luck with finding Molly Ringwald, or whoever it is vou're looking for.\nSorry for the inconvenience. Good bye.\n\nBethany starts walking away. Jay stares at her, shocked.\n\n                                    JAY\n\n(to Bethany)\n\nWho the hell do you think you are, lady? You can't go around breaking\npeople's hearts like that! We fell in love with you! Guys like us don't\njust fall out of the sky, you know!\n\nOn cue, a naked black MAN falls from the sky. landing between the two\nparties. Bethany and Jay stare at him. The Man is face down, sooty, and\nashen - as if he's just been in a fire. Bethany drops to her knees and\nrolls him over, feeling for a pulse. Jay looks down, then looks skyward as\nSilent Bob joins him.\n\n                                    JAY\n\n(yelling up)\n\nA beautiful, naked woman doesn't just fall from the sky, you know?!\n\n(beat; to Silent Bob)\n\nWas worth a try.\n\nSilent Bob nods. Bethany presses her ear to the man's chest.\n\n                                  BETHANY\n\nNo heartbeat.\n\n                                    JAY\n\nDo you think he fell from a plane? Like 'Alive'? Did you ever see that\nflick?\n\n                                  BETHANY\n\n(starts CPR'ing him)\n\nI think there would have been more of a mess if he fell from that high.\n\n                                    MAN\n\nNot necessarily.\n\nBethany, Jay, and Silent Bob leap back. The man sits up and rubs his face.\n\n                                    JAY\n\nKILL IT!! KILL IT!!\n\n                                    MAN\n\nThat sounds familiar.\n\n                                  BETHANY\n\nJesus, are you okay?\n\n                                    MAN\n\nRufus. And yes, I'm fine.\n\n                                    JAY\n\nHe's the fuckin' undead!! Cut his head off!!\n\n                                   RUFUS\n\n(getting up with Bethany's help)\n\nWhat happened to your car? You clock ninety in first gear or something?\n\n                                    JAY\n\nMind your own fucking business!\n\n                                   RUFUS\n\n(to Jay)\n\nListen, goldie-locks, what I just did was not easy and it ga\\e me a fucking\nmigraine. Now if you don't pipe down, I'm going to rip your balls off.\n\n                                    JAY\n\n(hiding behind Silent Bob)\n\nI knew it! Mother fucker wants to eat my brain!\n\n                                  BETHANY\n\nI think he was aiming a bit further south.\n\n(to Rufus)\n\nSpeaking of which, you're awfully nude - Rufus, is it?\n\n                                   RUFUS\n\nRufus it is, Miss.\n\n(to Silent Bob)\n\nHey, tubby... how's about lending a brother your coat 'till I can find my\nown threads?\n\nJay looks at Silent Bob.\n\n                                    JAY\n\nDude, he fell out of thin air!\n\nSilent Bob shrugs and passes his coat to Rufus. Jay bugs.\n\n                                    JAY\n\nDude, his dick is gonna be rubbing all over the inside of your armor!\n\n                                   RUFUS\n\n(to Silent Bob)\n\nI'll do my best to tuck it back, brother.\n\nSilent Bob nods. Something OC catches his eye. He stares OC and exits.\n\n                                  BETHANY\n\nWhere exactly did you fall from?\n\n                                   RUFUS\n\nSome might say grace.\n\n                                    JAY\n\n(to Silent Bob)\n\nDude, he's talking about your mom.\n\nJay turns to see that Silent Bob isn't there.\n\nSilent Bob peers at a large bush at the road side. The bush rustles\nslightly.\n\n                                OC BETHANY\n\nYou know, normally I'd have a hard time with this, but somehow you falling\nout of the sky seems to go hand in glove with some of the other stuff I've\nbeen deaiing with.\n\n                                 OC RUFUS\n\nBelieve me - you ain't seen nothing yet.\n\nSilent Bob peers closer at the bush. Suddenly - a Stygian Triplet leaps out\nat him, pinning him to the ground with his hockey stick.\n\nThe other two Triplets leap on top of Jay and BETHANY\n\nRufus grabs the one off Bethany and hurls him to the side.\n\nJay manages to reach into his jacket and pull out a copy of Penthouse. He\nrolls it up and starts beating the kid in the head with it.\n\nSilent Bob gets his hands under the stick that pins him and pushes it up\nhard, into the Triplet's forhead, knocking him off. He rushes to Jay's side\nand plies the other Triplet from his throat, hurling him OC.\n\nThe Triplet Silent Bob fought 'punctures' the air with his stick and rips\ndownward, creating a 'hole'. He grabs his friend and leaps into it,\ndisappearing.\n\nJay and Silent Bob look at eachother, blink, and embrace passionately.\n\nThe Triplet that Rufus threw rushes Rufus from behind - hockey stick in\nlancing position. Without looking back, Rufus reaches behind himself,\ngrabbing the stick and swinging it (and the Triplet) over his head in an\narch, letting go. The last Triplet goes sailing through the 'hole', and it\nseals shut.\n\nBethany, Jay and Silent Bob are in various wide-eyed states of shock.\n\n                                    JAY\n\nAlright - what's with you, lady?! That's the second time you got attacked\nby the fucking Mighty Ducks!\n\n                                   RUFUS\n\n(wiping off hands)\n\nMan, they're onto you bad, already. I got here just in time.\n\n                                  BETHANY\n\nHow can you be so composed? We were almost killed.\n\n                                   RUFUS\n\nDeath is a worry of the living. The dead only worry about decay and\nnecrophiliacs.\n\n                                    JAY\n\nSee! I told you he was the undead!\n\n                                  RU FUS\n\nNot the undead, the dead. I died. Christ told me the secret to resurrection\nonce when we were at a wedding in Canna, but I got drunk and forgot it.\n\n                                  BETHANY\n\n                               (incredulous)\n\nWait. wait, wait - Christ? You knew Christ?\n\n                                   RUFUS\n\nKnew him? I saw him naked.\n\n                                  BETHANY\n\nLet me guess - you're another angel?\n\n                                   RUFUS\n\nNo, I'm a man - just like you and him.\n\n(looks at Jay)\n\nWell, maybe not like him. At least I was a man. Been dead for nearly two\nthousand years. Here.\n\n(pulls rolled up paper from behind his ear)\n\n                                    JAY\n\nNo wonder he saw Jesus - homey's rockin' the ganj.\n\n                                  BETHANY\n\n(unrollingit)\n\nIt's not a joint.\n\n(looks at it)\n\nI can't read this.\n\n                                   RUFUS\n\nIt's Sanskiit. It says \"Rufus - see you in two years. Jesus.\" Freaked me\nout because he basically told me when my number was up. Took the flavor out\nof the remaining years. Look, we gotta keep moving. If we stay in one place\nlong enough, those things are liable to come back. What say we continue\nthis discussion over something to eat?\n\n                                  BETHANY\n\n(snaps)\n\nWAIT A SECOND!\n\n(inhales deeply)\n\nI'm a rational woman, okay. All I want to know is where you, and those...\nkids came from?!\n\n                                   RUFUS\n\nThey came from Hell. I came from Heaven.\n\n(walking away)\n\nLet's start walking.\n\n                                    JAY\n\nWalk? Do you know how far we are from anywhere?\n\n                                   RUFUS\n\nBack in the old days with J.C., we walked everywhere. Did you ever hear of\na fat apostle?\n\n(exits)\n\nBethany looks to Jay and Silent Bob for some guidance or stability.\n\n                                    JAY\n\nWhat's an apostle?\n\nBethany shakes her head and exits. Jay and Silent Bob shrug at each other.\n\nEXT MOOBY CORP. BUILDING - DAWN\n\nA large office building in downtown Cleveland. The city. hasn't started up\nyet. A pickup truck pulls curbside in front of the structure. Bartleby and\nLoki jump out of the back and pat the side of the truck. offering waved\nthank-you's to the driver. As the truck pulls away, Loki pulls out the\narticle and looks at it. He looks up at the building and nods to Bartleby,\nsmiling. They head toward the front doors.\n\nINT QUAlNT SUBURBAN HOUSE - DAWN\n\nA ringing phone is answered by the unseen figure in the chair. We move from\nthe seated Figure, passing by the dead bodies of the home's original\nowners, and come to a stop on the bruised and worn Stygian Triplets seated\non a couch. They look scared.\n\n                                  FIGURE\n\nHello?... No, they're not in right now... I'm the phone guy... I'll leave\nthem a message... Bye.\n\nThe Figure hangs up the phone and rises.\n\n                                  FIGURE\n\nYou say the girl has already met the prophets?\n\nThe Stygian Triplets nod.\n\n                                  FIGURE\n\nShe grows closer to learning her true identity. If that happens, our plan\nis jeopardized. I can't afford to go into the field - that might compromise\nus further. The best course of action is to insure that our parcel is not\nfound. And being that I can't even trust you enough to kill a girl, I'm\nleft with no choice but to seek outside assistance in guarding our package.\n\n(sighs)\n\nI'm going to have to summon the Golgothan.\n\nThe Figure exits. The Stygian Triplets register shock.\n\nEXT FAST FOOD JOINT - DAWN\n\nRufus - now wearing some funky new clothes - carries a tray of fast food to\nan outdoor table. Sitting already are Bethany, Jay, and Silent Bob.\n\n                                   RUFUS\n\n(off new clothes)\n\nIt's amazing the shit people throw out. Didn't I tell you I'd find some\nthreads?\n\nA car full of teens whip past them.\n\n                                   TEEN\n\n(yelling from passing car)\n\nGARBAGE PICKER!\n\n                                   RUFUS\n\n(waves to them)\n\nThank you.\n\n(to group)\n\nWhat's that mean?\n\n                                    JAY\n\nIt means they saw you pull that shit out of that dumpster.\n\n                                   RUFUS\n\nSo it's a good thing, then.\n\n(handing coat back to Silent Bob)\n\nI appreciate the loan, brother. You can have this back.\n\n                                    JAY\n\n(to Silent Bob)\n\nLucky you.\n\n                                   RUFUS\n\n(off food)\n\nDamn, I remember when all we used to have for breakfast was fish and goat's\nmilk. What do you call this shit?\n\n                                  BETHANY\n\n(to Rufus)\n\nEgg McMuffin. Now how about you start explaining some things to me.\n\n                                   RUFUS\n\nLike what?\n\n                                  BETHANY\n\nLike - for starters - who the hell are those kids that keep attacking me?\n\n                                   RUFUS\n\nNasty little bastards called the Stygian Triplets. They're not really\nrelated. When they were alive they were a trio of kids that snatched a\nneighbor's toddler and smashed it's skull in - \"just to see what it looked\nlike\" I believe was their defense. They were killed in a car wreck on the\nway to a detention center.\n\n                                  BETHANY\n\nSo they're dead too?\n\n                                   RUFUS\n\nYou'd be surprised how many dead people are just walking around - we're\nstubborn bastards. Thing is, those kids are supposed to be in Hell. Which\nmeans that someone wants you out of the picture so badly they're willing to\nsummon demons.\n\n                                  BETHANY\n\nIs it those two angels I'm supposed to stop?\n\n                                   RUFUS\n\nCouldn't be. They're not evil - they're just stupid.\n\n                                    JAY\n\n(to Bethany)\n\nWait a minute - are you going to listen to this shit? We don't even know\nwho this guy is. For all you know, he's in with those fucks. They both\nshowed up at the same time.\n\n                                  BETHANY\n\nI hate to say it - but he does have a point. How did you know where to find\nus?\n\n                                   RUFUS\n\nYou know what the dead do with most of their time? They watch the living.\nEspecially in the shower.\n\n                                    JAY\n\n(to Silent Bob)\n\nI can't wait to die.\n\n                                  BETHANY\n\nAnd why are you watching me?\n\n                                   RUFUS\n\nBecause you're the one who's going to help me get some changes made in that\nbook you all hold so much stock in.\n\n                                    JAY\n\nHustler?\n\n                                   RUFUS\n\nThe Bible.\n\n                                  BETHANY\n\nWhat's your beef with the Bible?\n\n                                   RUFUS\n\nI'm not in it.\n\n                                    JAY\n\nNeither are any of us, but you don't hear us bitching.\n\n                                   RUFUS\n\nBut I'm supposed to be in it. I was the Thirteenth Apostle.\n\n                                  BETHANY\n\nI've been going to church my entire life and I've never heard of a\nthirteenth apostle named Rufus.\n\n                                   RUFUS\n\nSee? You know all about the other twelve Apostles -white boys, I might add.\nBut no mention of Rufus. And why? Cause I'm a black man. But that's just my\npet peeve. I mainly want to correct a major error that you people are\nbasing a faith on.\n\n                                  BETHANY\n\nWhat's that?\n\n                                   RUFUS\n\nJesus wasn't white; He was black.\n\nRufus bites into his sandwhich. Bethany, Jay and Silent Bob look at him and\nthen each other.\n\n                                    JAY\n\nBullshit. I've seen pictures of Jesus, and He has blonde hair and blue\neyes.\n\n                                   RUFUS\n\n(wiping hands)\n\nThat's what's particularly insulting. Between the time when He established\nthe faith and the church started to officially organize, the powers-that-be\ndecided that while the message of Christ was integral, the fact that He was\nblack was a detriment. So all renderings were ordered to be Eurocentric,\neven though the brother was blacker than Jesse.\n\n                                  BETHANY\n\nIf that's true, then why'd He get written about while you were left out?\n\n                                   RUFUS\n\nWell He is the Son of God, right? It's kind of hard to have the New\nTestament without him. So you fudge a few facts and put a spin on His\nethnicity. Leaving me out's okay because there's still Twelve apostles to\nchoose from.\n\n                                    JAY\n\nI don't buy it.\n\n                                   RUFUS\n\nThat's what the good people of Antioch were saying when they stoned my ass.\n\n                                  BETHANY\n\nYou were martyred?\n\n                                   RUFUS\n\nThat's one way of putting it. Another way is to say I was bludgeoned to\nshit by big rocks. See - Christ told us Apostles to go out into the world\nand spread His word. Antioch was already garnering a big Christian\nfollowing, so I got sent there. And was a big hit. They loved hearing about\nJesus' message, and how He was the Redeemer. But when I mentioned He was\nblack, the whole town turned on me - called me a liar and shit. I pressed\nthe point, and before I know it, I'm wearing stones - although not to\naccessonze.\n\n                                 BETH ANY\n\nWhy didn't you just let the point go when you saw how they were reacting?\n\n                                   RUFUS\n\nBecause it's part of the facts. White folks only want to hear the good\nshit: life eternal, a place in God's kingdom. As soon as they hear they're\ngetting all this from a black Jesus, they freak. And that - my friends - is\ncalled Hypocrisy. Folks just can't accept a black Savior.\n\n(to Silent Bob)\n\nYou going to eat that hash brown?\n\n                                  BETHANY\n\nSo you went to Heaven?\n\n                                   RUFUS\n\nShit yeah; it was the least the brother could do. I gave up my sheep and\nfollowed His ass around Jerusalem for three years. And in all that time,\ndid I ever get laid? Hell no! But I didn't bitch, because I was into His\nmessage. And while the message is what counts, folks should know that He\nwas black. That's why I'm going to help you find stop those angels from\ngetting to that church in exchange for you helping me with my campaign.\n\n                                  BETHANY\n\nHow do you know about that?\n\n                                   RUFUS\n\nHeaven's a pretty boring place, and anything that breaks the tedium is\nnews. The unmaking of existence is what you might consider a great\ntediumbreaker. Besides, there isn't much I don't know about you.\n\n                                  BETHANY\n\nI find that hard to believe.\n\n                                   RUFUS\n\nWhen you were five you let a kid from next door piss on your hand.\n\n                                    JAY\n\n(shocked)\n\nYou did that?\n\n                                  BETHANY\n\nYeah... but I never told anyone about it.\n\n                                   RUFUS\n\nNeither did he. He died of Leukemia two years later. His name was...\n\n                                  BETHANY\n\n...BryanJohnson.\n\n                                   RUFUS\n\nYour exploits - no matter how inane - are well-known in Heaven. Probably in\nHell, too.\n\nBethany rubs her temples and exits OC. Rufus watches her go.\n\n                                    JAY\n\n(intrigued)\n\nTell me something about me.\n\n                                   RUFUS\n\n(preoccupied with the OC Bethany)\n\nYou masturbate more than anybody else on the planet.\n\n                                    JAY\n\nShit, everyone knows that. Tell me something nobody knows.\n\n                                   RUFUS\n\nYou think about guys when you do it.\n\nRufus gets up and exits. Silent Bob looks at Jay, shocked.\n\n                                    JAY\n\nNot all the time!\n\nBethany sits on a swing in the kiddie-jungle gym, shaking her head. Rufus\njoins her.\n\n                                   RUFUS\n\nI'm sorty if I spooked you.\n\n                                  BETHANY\n\nI just feel... violated. Like my life isn't mine exclusively.\n\n                                   RUFUS\n\nThat's the way it goes with celebrities.\n\n                                  BETHANY\n\nWhat are you talking about? I'm a nobody. I'm just a quiet girl from the\nsuburbs who counsels pregnant teens.\n\n                                   RUFUS\n\nYou sound like Christ. He had the same reaction when He found out who He\nwas, minus the quiet girl from the 'burbs angle. And like Him, I'm sure\nyou'll come to terms and do what you're supposed to.\n\n                                  BETHANY\n\nWhy not get the pope or someone holy like that?\n\n                                   RUFUS\n\nJust because a guy wears a funny hat, doesn't make him the right man for\nthe job. Only certain hands can deliver the world from the brink of\ndestruction. last time it was Jesus - this time it's you.\n\n                                  BETHANY\n\nWhy me?\n\n                                   RUFUS\n\nCan't say yet. But the question is - are your hands capable enough to carry\nthe burden. It all rides on you.\n\n                                  BFTRANY\n\n(rubbing her temples)\n\nTwo thirds of me wants to forget about this and go home. You know,\nyesterday I wasn't sure God even existed. And now I'm upto my ass in\nChristian Mythology.\n\n                                   RUFUS\n\nGod hates it when it's referred to as Mythology.\n\n                                  BFTHANY\n\nWell then let's ask the quote, unquote 'prophets' what we should call it\ninstead.\n\n(looking OC; concerned)\n\nNow where did those two assholes go?\n\nINT STRIP JOINT\n\nIt's your typical strip club. One woman on a stage and a crowd of men\npaying way-too-much attention. The place is dimly lit with red lights and\nchock full of smoke. Off to one side, a dee-jay spins records, blasting the\nmusic. The crowd is rather thin.\n\nJay and Silent Bob sit at the stage. their eyes glued on...\n\nThe DANCER - a gorgeous, shapely vixen with very little clothing on, and\ngrowing littler by the second.\n\nJay pokes Silent Bob, who produces a wad of bills. They skim off a nice\npile and stow the rest. They spread their piles neatly on the bar. The\nDancer smiles and starts dancing toward them. Jay holds up a five-spot and\nperforms his own little seductive dance ~th it. He stands at the edge of\nthe stage, ~'rating. The Dancer slinks over and Jay stuffs the five in her\nG-string. She rubs his head and slinks away. Jay humps Silent Bob's chair,\nexcitedly. Bethany and Rufus come up from behind them. Bethany hits Jay.\n\n                                  BETHANY\n\n(shouting above the music)\n\nWhat are you doing?\n\n                                    JAY\n\nProving to this bastard that I ain't gay.\n\n                                  BETHANY\n\nWhat?\n\n                                   RUFUS\n\nLong story - forget it. But we should get moving. How can we get to New\nJersey?\n\n                                  BETHANY\n\nI had a car.\n\nShe slaps Jay upside the head, but - riveted by the Dancer - he doesn't\nfeel it.\n\n                                  BETHANY\n\n(to Rufus)\n\nWe could go by train.\n\n                                   RUFUS\n\n(looking OC)\n\nSounds cool.\n\n                                  BETHANY\n\nThere's a phone out there. I'll call for reservations.\n\nRufus is now also riveted by a table dancer off to the side.\n\n                                  BETHANY\n\nNo, it's okay. I can handle it.\n\nRufus half-nods. Bethany shakes her head and exits.\n\nThe Dancer gyrates on the stage, revealing more and more of herself.\n\nJay pounds on the stage, hoots, and dances, flashing more bills.\n\nACROSS THE STAGE a small GANG of bandanna-wearing, angry-looking blacks\nwatch the OC Jay with little amusement. The Dancer dances toward them.\n\n                                    JAY\n\n(banging on stage)\n\nSweet thing!\n\n(Hashes another five)\n\nLook what I found! Snoog!\n\nThe Dancer smiles as she approaches Jay, but is interrupted by more\nbanging.\n\nThe GANG LEADER has his foot on the stage. He produces a ten dollar bill\nfrom his jacket and casually holds it up. The other three members of his\nposse smile and slap hands.\n\nThe Dancer shrugs at the shocked Jay and changes direction, heading toward\nthe Gang. Jay casts a horrified look at Silent Bob.\n\nThe Gang Leader leans forward, preparing to tip when we hear an obnoxiously\nloud throat~learing.\n\nJay holds aloft a twenty, smiling and nodding.\n\nThe Dancer shrugs at the Gang Leader and again switches direction. The Gang\nLeader looks at his posse, who shake their heads at him, disappointedly.\n\nThe Stage becomes a bidding table, as - on one side - the Gang Leader\nproduces two twenties. On the other side, jay - staring at the Gang Leader\n- produces three twenties. The Gang Leader hits his posse up for more cash.\nJay hits Silent Bob up for more cash. The Dancer stays in the middle,\ngyrating and sizing up the best offer.\n\nJay then produces the creme'de Ia creme': three hundred dollar bills. He\nsneers at the OC Gang Leader. The Dancer heads over to jay and wraps her\nlegs around him from the stage, gyrating against his groin. Jay stares at\nthe Gang Leader, a victorious smirk on his face.\n\nThe Gang Leader shakes his head angrily and jumps out of his seat,\nproducing a gun from his jacket. He fires into the ceiling. The music\nscratches to a halt and the other viewers scatter toward the door. The Gang\nLeader points his piece at Jay, his posse backing him up.\n\n                                GANG LEADER\n\nYou a smart ass, ain'tcha, white boy? Come in here and ruin my good time.\n\n                                    JAY\n\nIt's a free country. The bitch just came to the man with the most.\n\n                                  DANCER\n\nBitch?\n\n                                    JAY\n\nNo offense, baby.\n\n                                GANG LEADER\n\nThe bitch is gonna be leaving with the man with the most - the man with the\nmost led in his piece. While you and tubby are leaving with the most led in\nyour dead fucking carcasses, know what I'm sayin?\n\n                                    JAY\n\n(to Dancer)\n\nStep to the side, baby. I've gotta slap this pussyass, Nino Brown wanna-be\ndown.\n\n                                  DANCER\n\n(to Gang Leader)\n\nCome on, Kane. This isn't necessary.\n\n                                GANG LEADER\n\nShut the fuck up and back away from the midget!\n\nThe Dancer moves to the side.\n\n                                GANG LEADER\n\n(to Jay)\n\nNow I believe you were about to apologize. I believe you were about to\nintone some pleas for mercy. You were about to say \"Please, Mister Kane, I\ndidn't mean to disrespect you in your club. Please accept my most humble\napology.\n\nBethany comes back and sees the mess. She moves to rush to Jay's side, but\nRufus holds her back An OC Jay laughs.\n\nJay leans on Silent Bob, laughing. The Gang stares back, angrily.\n\n                                    JAY\n\nYou want an apology?\n\n                                GANG LEADER\n\n(cocks gun)\n\nGive me at least one \"I'm sorry,\" and ltll put a kill shot through that\nthick fucking skull of your's. Otherwise we go slow and long in the pain\ndispensation.\n\n                                    JAY\n\n(beat; zips jacket closed)\n\nKnow what I'm doing?\n\n                                GANG LEADER\n\nNo. What you doing?\n\n                                    JAY\n\nI'm closing my jacket, so that when we start this up, I don't get your\nfilthy fucking brain guts all over my shirt. You know why?\n\n                                GANG LEADER\n\nWhy?\n\n                                    JAY\n\nBecause you can't get shit stains out of flannel. What I'm saying is that\nyou got shit for brains.\n\nThe Gang Leader and his posse stare silently for a moment.\n\n                                GANG LEADER\n\nWell I appreciate you breaking that down for me, but I got it without the\nexplanation.\n\n                                    JAY\n\nNo. No, I don't think you did get it. See, there's gonna he some nine's\nfiring in here, and when the bullets stop flyin', your cunt-lip ass is\ngonna be all holes and smoke. You think you can draw on me and walk away?\nFuck that. And fuck you - you punk-ass monkey bitch! Yeah, I called you a\nmonkey! Maybe if you kiss my dick all nice before I cap you, I'll bring a\ncoconut to your funeral and lay it on your grave; stick a straw through it\nand stick the other end in the ground. Your lips'll reach.\n\nThe Gang stares, mystified. Rufus and Bethany can't move they're so\nfrightened.\n\n                                    JAY\n\nYou think every white boy cowers at your ass? Shit, if I don't fucking\nplant you - watermelon - my muscle here will.\n\n(thumbs at Silent Bob)\n\nWhat do you think he is? My boy friend? I love chicks. So he's gotta be\nwith me for one reason: to watch my back. Silent Bob doesn't talk in words\n- he speaks in bullets. Re's all quiet cause he's thinking about how he's\ngonna take you and your bitches out quick enough to piss on the bullets in\nyour bodies before they cool down. You know why? Because he likes to see\nthe hot steam coming off them when he sprays them down. Come to think of\nit, I~m tired of talking to your dumb ass; you probably don't even\nunderstand big words like 'piss'. Tell you what - I'll let him explain it\nto you.\n\n(to Silent Bob)\n\nSilent Bob - shoot these punk-monkey bitches.\n\nSilent Bob slowly raises his hands in a surrender fashion. Jay looks at\nhim.\n\n                                    JAY\n\nWhat are you waiting for?!\n\nSilent Bob shrugs.\n\n                                    JAY\n\n(flabbergasted)\n\nYOU DON'T RAVE A GUN?!?\n\nSilent Bob kind of nods\n\n                                    JAY\n\n(shocked)\n\nWHAT THE FUCK DO YOU MEAN? ALL THIS TIME WE'VE BEEN TOGETHER, AND YOU DON'T\nHAVE A GUN?!?\n\nSilent Bob indicates the negative, sheepishly.\n\n                                    JAY\n\nTHAT'S JUST FUCKING GREAT! DO YOU THINK I\n\nWOULD'VE SAID ALL THAT IF I'D KNOWN YOU\n\nDIDN'T HAVE A GUN?!?\n\n(beat)\n\nHUNHH?!?\n\nSilent Bob raises his eyebrows remorsefully. The Gang snickers and smiles.\n\nGANG LEADER\n\nWhat was that about a coconut?\n\nJay shakes his head and glowers at Silent Bob.\n\n                                    JAY\n\nNo gun! What the fuck kind of muscle are you?! All this time and you got no\ngun!\n\nGANG LEADER\n\nOh boys! We have some unfinished business here.\n\n                                    JAY\n\n(sheepishly)\n\nCan we talk this over?\n\n                                GANG LEADER\n\nTell you what - you got thirty seconds. Then I cap you. Talk all you like.\n\nBethany goes to make a move, but Rufus holds her back, shaking his head. He\nputs a finger to his lips to quiet her and points back toward the action,\nsmiling.\n\nJay fumes.\n\n                                    JAY\n\n(to Silent Bob)\n\nI can't believe you.\n\n(to Gang Leader)\n\nDo me a favor.\n\n(points to Silent Bob)\n\nShoot this piece of shit first.\n\n(to Silent Bob; disgusted)\n\nNo gun!\n\nSuddenly, they both snap into a momentary trance. Zombie-like, Jay and\nSilent Bob step to the turntables behind them. Jay puts on headphones and\nbegins scratching a record. A familiar tune begins.\n\nThe Gang watches, perplexed.\n\nSilent Bob whips around, microphone in his hand, and begins to sing.\n\n                                SILENT BOB\n\nHEY, HEY, HEY!!! IT'S FAT ALBERT!\n\nAND I'M GONNA SING A SONG FOR YOU!!\n\nAND BILL'S GONNA TELL YOU A THING OR TWO!!\n\nWE'LL HAVE SOME FUN, NOW!\n\nWITH BILL AND ALL THE GANG!\n\nLEARNING FROM EACH OTHER -\n\nWHILE WE DO OUR THANG!\n\nThe Gang slowly goes from perplexity to enjoyment. The Gang Leader softens\nand smiles, adding a slight nod of approval. Jay provides back-up.\n\n                                    JAY\n\nNA , NA, NA! GON NA HAVE A GOOD TIME!\n\n                                SILENT BOB\n\n(as Fat Albert)\n\nHEY! HEY! HEY!\n\n                                    JAY\n\nNA. NA. NA! GONNA HAVE A GOOD TIME!\n\nBethany and Rufus look on. amazed.\n\n                                   RUFUS\n\nI thought she looked familiar.\n\n                                  BETHANY\n\nWho?\n\n                                   RUFUS\n\n(he nods toward the stage)\n\nSerendipity.\n\nBethany looks to the stage.\n\nThe Dancer is the SERENDIPITY in question. She wipes sweat from her brow.\n\nINT. MOOBY CORP. BOARDROOM - DAY\n\nOh, this isn't your standard boardroom; this is Mooby Corp., home of Mooby,\nthe Golden Calf - which can only be described as a bovine variation on\nBarney: sickeningly simple and very non-threatening. A large table sits in\nthe middle, a media center behind the huge chair at the head. The walls are\nadorned with framed posters of Mooby, playing with kids, mouth agape in a\nstupid smile. At the center of the table is a large, gold plated statue of\nthe insipid creature.\n\nDoors open and the boardroom fills with suits - six men, one woman. They\nchatter and take their seats. After a beat, WHITLAND, the CEO, enters,\ntaking his place at the head of the conference table.\n\n                                 WHITLAND\n\nGood morning, shoppers.\n\n(slaps a file on table)\n\nHas anyone seen the over-night's?\n\nAn anticipatory hush fills the room.\n\n                                 WHITLAND\n\nWe creamed 'em.\n\nA cheer and applause goes up from the group. Whitland smiles.\n\n                                 WHITLAND\n\n(reading from file)\n\nAnd last night was a rerun, which says to me that with the six months we\nhave to ready and promote the 'Very Nlooby Christmas' pay-per-view special,\nwe can produce history-making numbers. The record is held by that\nshock-jock's New Year's thing, but I see no reason why our little cash cow\ncan't supercede those numbers and...\n\n(stops and sniffs the air)\n\nDo I smell onions?\n\nBartleby and Loki sit behind the thrall on a black leather couch. Loki is\ncarving something out of an onion, while Bartleby looks on.\n\nWhitland and the rest of the board stare at them.\n\n                                 WHITLAND\n\nI didn't realize we had guests. Who are these gentlemen with?\n\nThe other suits shrug and look to one another for an answer nobody has.\n\n                                 WHITLAND\n\n(to Bartleby and Loki)\n\nExcuse me.\n\nLoki continues carving. Bartleby looks at his friend and shakes his head.\nLoki lifts his head without looking up.\n\n                                   LOKI\n\n(very distracted)\n\nHmm?\n\n                                 WHITLAND\n\nMay I ask what you're doing in my boardroom?\n\n                                   LOKI\n\n(still preoccupied)\n\nMy friend just has a few words for you, and then we'll be on our way.\nHeading to Jersey, you see. Now -by the decor, I assume I'm guessing\ncorrectly that this is the corporate headquarters for Mooby Productions\nInternational?\n\n                                 WHITLAND\n\nYou guess correctly. Now, may I ask who the fuck you are and - again - what\nthe fuck you're doing in our conference room?\n\n                                   LOKI\n\n(to Bartleby, still not looking up)\n\nYou may proceed, mon ami'.\n\n                                 BARTLEBY\n\nI can't believe you.\n\n(to Whitland)\n\nI just want to start off by apologizing. My friend here has a penchant\ntoward the dramatic, so he's making me do this. Usually, I don't even\ninvolve myself in his affairs, but he hasn't done this in awhile, so he\nwants...\n\n                                   LOKI\n\n(frustrated)\n\nJust read 'em their rights already.\n\n                                 BARTLEBY\n\n(sighs; circling the table)\n\nMooby, the Golden Calf. Created by Nancy Goidruff -a former kindergarten\nteacher - in nineteen eighty nine to fill a gap in the Saturday morning\nschedule on local network K-REL Bought by the Complex Corporation in\nnineteen ninety one and broadcast nationally as the 'The Mooby Fun-Time\nHour', it picked up a large following of children, ages three to eight, and\nspawns sixteen records, two theatrical films, eight prime-time specials, a\nlibrary of priced-to-own video cassettes, and bicoastal theme parks dubbed\n'MoobyWorld'.\n\n(beat)\n\nDid I miss anything?\n\nWhitland and company stare for a beat.\n\n                                 WHITLAND\n\nYou forgot 'Mooby Magazine'. Is there a point to this?\n\n                                 BARTLEBY\n\n(grimly)\n\nYou and your board are idolators.\n\nWhitland and company stare dumbfounded. Loki finishes carving and stands\nbeside Bartleby.\n\n                                   LOKI\n\n(to Bartleby)\n\nHow could your forget the magazine?\n\nBartleby rolls his eyes. Loki turns to the Whitland and holds up the\nsculpture.\n\n                                   LOKI\n\nIt's you.\n\n(sets sculpture on table)\n\nDo you know much about voo-doo? Fascinating practice, very close to\nSatanism, but not really much of a religion - no doctrine of faith. Just an\narrangements of superstitions, the most well- known of which is the voo-doo\ndoll.\n\n(sneezes; waits; continues)\n\nA mock-up of an individual is subjected to various pokes and prods, and the\ndesired result is that the individual will feel the effects.\n\n                                 WHITLAND\n\n(to nearest board member)\n\nCall security - now.\n\nLoki throws the knife at the table, severing the phone cord.\n\n                                   LOKI\n\nAll lines are currently down.\n\n                                 BARTLEBY\n\n(to Whitland)\n\nAgain -. I apologize for my friend's...\n\n                                   LOKI\n\n(frustrated)\n\nWould you just get on with it?!\n\n                                 BARTLEBY\n\n(miffed; to Whitland)\n\nYou are responsible for raising an icon that draws worship from the Lord.\nYou've broken the first commandment, but more than that, I'm afraid none of\nyou passes for a decent human being. Your continued existence is a mockery\nof morality.\n\n(looks to Loki; Loki nods)\n\nLike you - Mister Bernard.\n\n(stands behind board member)\n\nLast year you cheated on your wife of seventeen years, eight times - twice\nwith prostitutes. You even had sex with her best friend while she was at\nher garden club meeting and you were supposed to be watching your kids.\n\n                                   LOKI\n\nIn the bed you and your wife share, no less.\n\nThe board member stares in disbelief. Loki nods to Bartleby and he moves\non.\n\n                                  BARTLBY\n\nAnd you, Mister Newman.\n\nLoki sifts through compact discs. He pulls out one entitled 'Mooby Mania'\nand pops it into a player. A simple children's song echoes through the\nroom.\n\n                                 BARTLEBY\n\nYou got your girlfriend drunk at last year's Christmas party, and then paid\na kid from the mailroom to have sex with her while she was passed out, just\nso you could break up with her - guilt free - when she sobbingly confessed\nthe next morning that she cheated on you. She killed herself three months\nlater. You sent flowers to her wake.\n\nThe board member's face is frozen. Bartleby shakes his head and moves\nquickly around the table.\n\n                                 BARTLEBY\n\n(not liking his job)\n\nMister Pereira disowned his gay son; Mister Turran put his mother in a\nthird-rate nursing home and used the profits from the sale of her house to\npurchase an oriental rug for himself; Mister Barker flew to the Phillipines\non the company account to have sex with an eleven year old boy; Mister\nBloom okayed the production of Mooby dolls from what he knew were unsafe\nand toxic materials because it was less costly.\n\nBartleby stops at the female Board member and looks at her, relieved.\n\n                                 BARTLEBY\n\nYou, on the other hand, are an innocent. You lead a good life and have\nnever misused your power here.\n\nShe stares at Bartleby. Loki pats her on the back and urges Bartleby on.\n\n                                 BARTLEBY\n\nBut you, Mister Whitland. You have more skeletons in your closet than this\nassembled party. I can't even mention them aloud.\n\nBartleby leans over and whispers something unheard into Whitland's ear.\nWhitland goes green. Bartleby steps back. Loki stands beside Whitland.\n\n                                   LOKI\n\nYou're her father, you sick fuck.\n\nWhitland begins sobbing.\n\n                                 BARTLEBY\n\n(to Loki)\n\nCan I go now?\n\n                                   LOKI\n\n(cheerily rubbing his head)\n\nGo on, you crazy kid.\n\nBartlebv exits. Loki turns menacingly on the others.\n\n                                   LOKI\n\nWith the exception of Miss Pryce, there is not a decent human being amongst\nyou. Do you know what makes a human being decent?\n\n(beat)\n\nFear. And therein lies the problem. None of you has anything to fear\nanymore. You rest comfortably in seats of inscrutable power, hiding behind\nyour false idol, far from judgement - lives shrouded in secrecy even from\none another. But not from God.\n\nLoki goes to exit but pauses. He turns around.\n\n                                   LOKI\n\nI forgot my little voo-doo doll.\n\n(looks at Whitland)\n\nWow. It really does look just like you. Maybe, if I believed enough...\n\nLoki begins moaning menacingly, slowly waving an open palm over the figure.\nWhitland looks at it horrified, then at Loki, then back at the figure. He\nsweats and shifts in his seat - eyes pinned on the figure. Loki lets out a\nshriek and smashes the figure with his fist. Whitland freezes, eyes closed.\nSlowly, he opens his eyes - unharmed.\n\n                                   LOKI\n\nI don't believe in voo-doo.\n\nLoki swiftly exits. The Board Members sit in awed silence. Then the doors\nburst open and Loki storms back in.\n\n                                   LOKI\n\nBut I do believe in this.\n\nGun blazing, he takes out the male board members, including Whitland, in a\nflurry of bullets. The remaining female Board Member covers her head with\nher arms. Loki hangs his arm at his side and touches her hair.\n\n                                   LOKI\n\n(smiling)\n\nIt's okay. You've done nothing wrong. They were bad men. You are a pure\nsoul.\n\nShe looks at him, terrified. He smiles back. Then his expression hardens.\n\n                                   LOKI\n\nBut you didn't say 'God Bless You' when I sneezed.\n\nHe quickly puts the gun to her head. She slams her eyes shut.\n\n                                OC BARTLEBY\n\n(cautionary)\n\nLoki!\n\nLoki freezes and looks OC. He grimaces and holsters his piece.\n\n                                   LOKI\n\n(to woman)\n\nSorry. Force of habit.\n\nHe surveys his handiwork and exits. The female Board Member slowly opens\nher eyes and looks around.\n\nINT STRIP JOINT - LATER\n\nJay and the Gang Leader sit together at a table, surrounded by the other\ngangsters and Silent Bob. They laugh and chug their '40's.\n\n                                GANG LEADER\n\n(to Gang)\n\nWatch this shit.\n\n(to Jay)\n\nDo it again, G. Do the Mush-mouth.\n\n                                    JAY\n\n(swigs his beer; as 'Mush-mouth')\n\nHey-buh, Fat-buh, Al-buh-bert.\n\nThe Gang laughs hysterically.\n\n                                GANGSTER 1\n\nFat Albert like a mother fucker and shit!\n\nBethany, Rufus, and Serendipity huddle around a table further away.\n\n                                   RUFUS\n\n(elated)\n\nI forgot you were down here! How long now?\n\n                                SERENDIPITY\n\nThree years this August. What about you - is this another temporary\nexpulsion? You and your 'Christ was down' campaign?\n\n                                  BETHANY\n\nWhat does that mean - another expulsion? I thought you came down here\nspecifically to help me?\n\nSERENDIPITY\n\nIs that what he told you? Rufus gets thrown out constantly; at least once a\nmonth, ethereal time. They always bring him back, but only after a few days\nof peace and quiet - free from that black nationalist rhetoric.\n\n                                   RUFUS\n\n(joking)\n\nArtsy-fartsy bitch.\n\n                                SERENDIPITY\n\nWho you calling artsy-fartsy?\n\n                                   RUFUS\n\n(to Bethany)\n\nSerendipity here used to hang with us sometimes back in Jerusalem.\n\n                                  BETHANY\n\nLet me guess - the fourteenth apostle; left out of the bible because she's\na woman.\n\n                                   RUFUS\n\nThe girl's not a woman.\n\n(to Serendipity)\n\nNo offense.\n\n                                  BETHANY\n\nOh, those weren't tits I saw Jay cozying up to?\n\n                                SERENDIPITY\n\n(tugs on boobs)\n\nWhat, these? You should know better than anyone at this table that tits\ndon't make a woman.\n\n                                   RUFUS\n\nHell, the tubby, coat-wearing mother fucker's got tits - don't make him a\nwoman.\n\n                                SERENDIPITY\n\nAside from an intuitive knack for accessorizing, what traditionally defines\na woman falls between two things : her legs. But as you can see...\n\nSerendipity stands and unbuttons her jeans, dropping them slightly,\nrevealing yet another smooth, sexless crotch, quite like Metatron's.\n\n                                SERENDIPITY\n\nI lack definition.\n\n                                  OC JAY\n\nHey! They're getting a free show!\n\nSerendipity pulls her pants back up and sits down, smiling at the OC party.\n\n                                  BETHANY\n\n(weary)\n\nOh God. Another angel. Like Metatron.\n\n                                SERENDIPITY\n\nHow do you know Metatron?\n\n(to Rufus)\n\nHow does she know Metatron?\n\n                                   RUFUS\n\nThis is the last Scion.\n\n                                SERENDIPITY\n\n(beat)\n\nYou're kidding.\n\n                                   RUFUS\n\nDon't you see the resemblance?\n\n                                SERENDIPITY\n\n(stares at Bethany)\n\nA bit.\n\n(suddenly nervous)\n\nOh shit. If she's been tapped, then something's up.\n\n                                  BETHANY\n\nI'm confused.\n\n                                   RUFUS\n\nBethany, Serendipity here isn't technically an angel, nor is she by any\nmeans a human being like I was and you are.\n\nSERENDIPITY\n\nAmen to that.\n\n(swigs her beer and spits it out)\n\n                                  BETHANY\n\nThen who is she?\n\n                                SERENDIPITY\n\nNot who - what. I haven't always been part of the anthropomorphic club. I\nused to be an abstract.\n\n                                  BETHANY\n\nNow I'm really lost.\n\n                                   RUFUS\n\nSerendipity's an idea.\n\n                                SERENDIPITY\n\nTry all ideas.\n\n                                  BETHANY\n\nMeaning?\n\n                                SERENDIPITY\n\nI'm a muse, stupid.\n\nBethany stares at her for a beat, then at Rufus. Rufus nods affirmatively.\n\n                                  BETHANY\n\nI can't take much more of this.\n\n(downs her beer)\n\n                                   RUFUS\n\n(to Serendipity)\n\nShe's now met a seraphim, a dead man, and a muse.\n\nYou can appreciate her frame of mind.\n\n                                  BETHANY\n\n(to Serendipity)\n\nSo you - what - inspire people?\n\n                                SERENDIPITY\n\nWhat just went down with your friends over there-you don't think they\nthought of that themselves? I knew Kane's weak spot for Fat Albert and\npassed it along to the boys.\n\n                                   RUFUS\n\nIf she hadn't interceded, they'd be chalk lines right now.\n\n                                  BETHANY\n\nYou made them sing that song?\n\n                                SERENDIPITY\n\nI offered them a solution out of the hole they dug for themselves.\nThankfully, they took it.\n\n                                  BETHANY\n\nAre you kidding? Those two are so dense, they wouldn't get a good idea if\nit was given to them in a specially marked box.\n\n                                SERENDIPITY\n\nDense people are the most open to suggestion - it's vou so-called\nintelligent folks that have a hard time accepting a good idea.\n\n                                   RUFUS\n\nAin't that the truth.\n\n                                  BETHANY\n\nProve it. Give me a good idea.\n\n                                SERENDIPITY\n\nIf I do, and you accept it, then you'll have confirmation that you are - as\nyou say - dense.\n\n                                  BETHANY\n\n(beat)\n\nAlright. So you're a muse. So what kind of people do you inspire - besides\nstupid ones?\n\n                                SERENDIPITY\n\nI used to specialize in entertainment - literature, theatre, so forth.\n\n                                  BETHANY\n\nMovies?\n\n                                SERENDIPITY\n\nIn some cases, I'd do everything but bang starlets on the casting couch.\n\n                                  BETHANY\n\nWhat have I seen that you've been involved with?\n\n                                SERENDIPITY\n\nOff the top of my head - everything. Well almost everything. For example:\nI'm responsible for nine of the ten top grossing films of all time.\n\n                                  BETHANY\n\nNine?\n\n                                SERENDIPITY\n\nThe one about the kid, by himself in his house; burglars trying to get in\nand he fights them off?\n\n(Bethany nods)\n\nI had nothing to do with that one. Somebody sold their soul to Satan to get\nthe grosses up on that piece of shit.\n\n                                   RUFUS\n\nWhich brings us to the next logical question - what are you doing\nstripping?\n\n                                SERENDIPITY\n\nWell you remember why I left, right?\n\n                                   RUFUS\n\nYou were tired of doing all the work and getting none of the credit for\nyour ideas.\n\n                                SERENDIPITY\n\nAnd sick of watching incapable people take brilliant inspiration and turn\nout real trash.\n\n(to Bethany)\n\nSo I opted to quit being a muse and write for myself. I gave my two weeks\nnotice. got a body, fifty bucks, and got sent out into the world to make my\nfortune.\n\n                                  BETHANY\n\nSo what happened?\n\n                                SERENDIPITY\n\nWriter's block.\n\n                                   RUFUS\n\nWriter's block?\n\n                                SERENDIPITY\n\nCan you believe it? Me - a muse, for God's sake! I sit down in front of the\ntypewriter, and what do I get? Nothing. Blank page. 1 can't even write a\ngrocery list.\n\n                                  BETHANY\n\nWhat about what you did with Jay and Silent Bob? You inspired them.\n\n                                SERENDIPITY\n\nThat's the cosmic joke. I can give out a zillion and nine ideas a second,\nbut I can't keep any for myself. Her quirky sense of humor.\n\n                                  BETHANY\n\nWhose?\n\n                                SERENDIPITY\n\nGod's.\n\n                                  BETHANY\n\nYou're saying God's a woman.\n\n                                SERENDIPITY\n\nWas there ever a doubt in your mind?\n\n                                  BETHANY\n\nThe possibility never presented itself. He's always referred to as a Him.\n\n                                SERENDIPITY\n\nI didn't write it that way My job stops at the idea stage. The person that\nholds the pen adds their own perspective, and all the pen-holders were men.\nOne of the drawbacks to being intangible is that you have no say in the\neditorial process.\n\n                                   RUFUS\n\nAnother one's that you can't jerk off.\n\n                                SERENDIPITY\n\n(to Bethany)\n\nSee. these being male-dominated times, the Pharisees and High Priests felt\nthreatened by the idea of a woman lording over them and controlling their\nfates. so they made sure that She became a He Doesn't stop with God - the\nwhole book is slanted and gender-biased: a woman's responsible for the\nfirst sin, the fall of man, and the expulsion from Eden. a woman cuts\nSampson's coif of power, a woman asks for the head of John the Baptist.\nRead that book again some time - women are painted as bigger antagonists\nthan the fucking Egyptians and Romans combined.\n\n                                  BETHANY\n\n(stunned)\n\nGod is a woman...\n\n                                SERENDIPITY\n\nI don't know what the big surprise is - women are the only gender that can\ncreate life, just like God created the universe. Who else but a mother\ncould have the infinite patience with impudent children that God has with\nhumanity. A woman can give birth to and nurture both sexes, so\npsychologists theorize that women are the only gender both sexes can feel\ncompletely comfortable with; and the faithful - both male and female - feel\nat ease with God. In time of trial, our first instinct is to implore the\naid of the Almighty, just as when you're a child, the only person who can\nmake it all better is...\n\n                                  BETHANY\n\n...mom. God, it makes sense.\n\n                                   RUFUS\n\n(to Serendipity)\n\nShit, you still have a knack for words.\n\n                                SERENDIPITY\n\nNot really useful in my new line of work.\n\n                                   RUFUS\n\nWhat about that? Why'd you choose stripping?\n\n                                SERENDIPITY\n\nIn an effort to create something artistic that I could claim as my own.\nSee, I've been able to fool myself into thinking this isn't stripping, it's\ndancing; and at least dancing is artistic. But She won't even give me that\nmuch - the way God designed dance, it's the only creative act which results\nin no tangible product. Unlike paintings, poems, movies or most other arts\nforms. when the dance is over, there's nothing to show for it - nothing to\nsave and enjoy... or sell.\n\n(takes a drink)\n\nBelieve me, the irony wasn't lost on this muse.\n\n                                   RUFUS\n\nHow long are you going to keep this up?\n\n                                SERENDIPITY\n\nBelieve me, I think about eating crow and going back to the grind from time\nto time. But I'd hate to give Her the satisfaction of my playing the\nprodigal. And it sucks because I can't stand being flesh anymore -\nespecially this halfway crap. Not only do I have to take care of the\naesthetic - the showers, the haircutting, the pit-shaving - but I can't\ntake advantage of the benefits - like getting laid or using my period as an\nexcuse not to get laid...\n\n(conspiratorily to Bethany)\n\n...the only true boon to having a period, from what I understand.\n\n                                   RLFLS\n\nWell we could sure use your help. We need someone with good ideas. You\nremember a couple of angels named Loki and Bartleby?\n\nSERENDIPITY\n\nSure - the angel of death and his squeamish pal with a conscience.\n\n                                   RUFUS\n\nThey found a way back.\n\n                                SERENDIPITY\n\n(shocked)\n\nGod no. Not the plenary indulgence loop hole?\n\n                                  BETHANY\n\nYou know about that?\n\n                                SERENDIPITY\n\nI always knew that thing was a bad idea. Leave it to the Catholics to\ndestroy existence.\n\n                                   RUFUS\n\nBethany's Catholic.\n\n                                SERENDIPITY\n\nMy condolences.\n\n                                  BETHANY\n\nWhat do you have against Catholics?\n\n                                SERENDIPITY\n\nEver been to a Catholic mass?\n\n                                  BETHANY\n\nOnce or twice.\n\n                                SERENDIPITY\n\nIt's like bad sex - up, down, up, down, kneel, leave.\n\nAnd the whole time you'd rather be watching t.v.\n\nYou people don't celebrate your faith - you mourn it.\n\n                                  BETHANY\n\nSo if we're so wrong, then what's the right religion?\n\n                                SERENDIPITY\n\nWhen are you people going to learn? It's not about right or wrong - it's a\nquestion of faith. It doesn't matter what you believe in - just that you\nbelieve.\n\nJay and Silent Bob join them, wearing bandannas.\n\n                                    JAY\n\nLook! They made me and Silent Bob part of the gang!\n\nSuddenly, the doors behind them blast open, pouring light into the onc~im\nroom. A huge figure stands in the doorway, backlit and acting as a sepia\nfilter - the light and vapors surrounding him are brown.\n\n                                  FIGURE\n\n(deep, gutteral hiss)\n\nNot born... shit into existence.\n\nOur group stares at the OC brute. Jay sniffs the air.\n\n                                    JAY\n\nWho farted?\n\n                                SERENDIPITY\n\nSweet Christ, someone wants you bad.\n\n                                  BETHANY\n\nWhat do you mean? What's that smell?\n\n                                   RUFUS\n\nDon't tell me that's who I think it is.\n\n                                SERENDIPITh\n\nThe stench should say it all.\n\n                                  BETHANY\n\nWho the hell is it?!\n\n                                SERENDIPITY\n\nAn excremental - the Golgothan.\n\n                                  BETHANY\n\nA what?\n\n                                   RUFUS\n\nA shit-demon.\n\nThe Golgothan moves slowly from the door, toward the group.\n\n                                  NO-MAN\n\nNo... man. ..of...woman.. born...\n\nThe Gang join the others. They hold and cover their noses.\n\n                                GANG LEADER\n\n(to Jay; loading his piece)\n\nFriend of your's?\n\n                                    JAY\n\n(to group)\n\nIs this smelly fuck with us?\n\n                                   RUFUS\n\nHe's coming for Bethany.\n\n                                    JAY\n\n(to Gang Leader)\n\nSmoke that mother fucker like it ain't no thang!\n\n                                GANG LEADER\n\nI knew I'd get to wax someone today. Represent!\n\nThe Gang charges OC, guns blazing, while we hold on the group. Suddenly,\nthe room is filled with screams and wet, slurpy noises. The group goes from\nstaring wide-eyed, to shielding themselves. The noise stops and Jay and\nSilent Bob look up.\n\nThe Gang lay about NoMan in trashed, dead positions. They are covered in\nmurky, creamy crap - their wide, white eyes frozen in horror. NoMan scoops\na finger-full of muck off the leader and eats it, smiling.\n\nOur heroes start backing up slowly, as to not be noticed.\n\n                                    JAY\n\n(to Silent Bob)\n\nI guess we're in charge of the gang now.\n\n                                  BETHANY\n\nWhat the fuck happened?!?\n\n                                SERENDIPITY\n\nGo for the bar. We might have a few seconds - his short-term memory's for\nshit.\n\n                                    JAY\n\nSo's the rest of him.\n\n                                   RUFUS\n\nNo chance of taking him down?\n\n                                SERENDIPITY\n\nGee. I don't know. Let's ask the gangstas.\n\n                                   RUFUS\n\nYou're right; let's book.\n\nThey dash. NoMan snaps to attention and throws it's arm at them, launching\na huge glob of shit through the air.\n\n                                    JAY\n\n(running; seeing it coming)\n\nSHIT!!!\n\nEveryone leaps behind the bar. The shit flies over them and slams against\nthe mirror above. Immediately, it stretches - Blob-like - over the entire\nframe, and burns in an acidic fashion.\n\nJay stares, horrified.\n\n                                    JAY\n\nNow that... is some powerful shit.\n\nSerendipity pulls at the floor, yanking open a door.\n\n                                SERENDIPITY\n\nQuick! Get in!\n\nBethany, Rufus, jay and Silent Bob leap into the darkness. Serendipity\nfollows, pulling the door shut on top of them.\n\nINT BASEMENT\n\nOur heroes cower beneath the floor door.\n\n                                    JAY\n\nWhat is that thing?\n\n                                SERENDIPITY\n\nYou ever hear of Golgotha?\n\n                                  BETHANY\n\nSkull place. The hill where Christ was crucified.\n\n                                SERENDIPITY\n\n(peering above)\n\nYeah, well it wasn't just Christ up there - the Romans crucified everybody\non that hill. Ahd Christ excluded, they were all criminals - killers,\nbrigands, thieves, rapists. And whenever the crucified expired, their\nbodies would naturally lose muscle control, spilling bowel and bladder in\nthe process. And the result is that walking pile of crap up there: the\nGolgothan Shit-Demon - Hell's chief assassin. And he's here for you,\ngirlie.\n\nSilent Bob stares at a crack in the doors. A milky drop of shit drips\nthrough it.\n\n                                  BETHANY\n\nWhat are we doing down here, then?. Any second now he'll be blasting\nthrough that door!\n\n                                SERENDIPITY\n\nShit's brainless. If we can sit tight for a couple of minutes, he'll forget\nwhat he came for.\n\nSuddenly another drop falls. Then another. Then a steady stream. Silent Bob\ntaps Rufus and points. Rufus reacts.\n\n                                   RUFUS\n\n(indicating trickling shit)\n\nLooks like it's been taking memory training courses...\n\n                                SERENDIPITY\n\n(off trickle)\n\nJUMP!!!\n\nThe five leap from their perch on the steps, just as the doors explode,\ndumping a torrent of crap on the steps. The body of muck morphs into NoMan\nanew. NoMan lumbers toward them. The group, attempting to gain their\nbearings on the floor, crawls backwards. NoMan pulls a piece of himself\noff, rolling it around in It's hands.\n\n                                SERENDIPITY\n\nIf anybody still remembers any prayers, I suggest you start whipping them\nout.\n\nSilent Bob stares wide-eyed up at the approaching demon. And then,\nsomething occurs to him. He stops backing up and stands. The others\ncontinue moving back.\n\n                                  BETHANY\n\nBob, get down! Jay!\n\n                                    JAY\n\n(to Silent Bob)\n\nYou tubby retard! Get your ass back on the floor!\n\nSilent Bob stands like a statue in the Golgothan's path. The demon snarls a\nsmile, moving ever closer. Silent Bob reaches into his coat and pulls a\nsmall canister out. He points it at the beast. A mist shoots out into the\nface of the Golgothan. It pauses, looking confused. The shitball in It's\nhand drops to the floor, and then so does It.\n\nBethany, Rufus, Serendipity, and Jay climb to their feet and crowd around\nSilent Bob. They look to the fallen, unconscious behemoeth, then to Silent\nBob.\n\n                                  BETHANY\n\n(off Bob's canister)\n\nWhat was that?\n\nSilent Bob holds the can out to them: it's a small, trial size can of Glade\nAir Freshener. Jay looks at it, then at Silent Bob.\n\n                                  BETHANY\n\n(reading can)\n\n'Knocks strong odors out.'\n\n                                   RUFUS\n\nWay to go. tubby.\n\n                                  BETHANY\n\nWhy would you ever carrs this?\n\nJay farts. Silent Bob sprays the freshener at his ass. The others look at\njay.\n\n                                    JAY\n\nWhat?!\n\n                                   RUFUS\n\n(to Serendipity)\n\nWho has dominion over this thing?\n\n                                SERENDIPITY\n\nOnly Lucifer can order a killing. But something doesn't make sense: this\nthing never travels alone - with it's intelligence level, Lucifer'd never\nallow it. It usually has some kind of backup.\n\n                                   RUFUS\n\nCan you get some answers?\n\n                                SERENDIPITY\n\nI can give it a shot.\n\n                                  BETHANY\n\nWhat's going on?\n\n                                   RUFUS\n\nSerendipity's going to talk to that demon.\n\n                                    JAY\n\nCool! Can we watch?\n\n                                SERENDIPITY\n\nNot a good idea. Demon's can wreak havoc on the weak-minded.\n\n                                    JAY\n\nFuck you - weak-minded! Me and Silent Bob can talk to him in his own\nlanguage! See...?\n\n(makes the universal metal sign)\n\nhe'd understand this.\n\n                                SERENDIPITY\n\n(shakes her head; to Rufus)\n\nWhoever sent this might send mor~. I suggest you take the princess and get\nas far away as possible.\n\n(to Bethany)\n\nI'll do what I can to extract some info from shit-boy here. If there's\nanything helpful. I'll get it to you somehow.\n\n                                  BETHANY\n\n(hugs her)\n\nThank you. And... you're a great dancer.\n\n                                SERENDIPITY\n\nI'm a better juggler.\n\n(to jay and Silent Bob)\n\nYou know you're supposed to be prophets. right? Start acting like prophets.\nYou should have seen that thing coming.\n\n                                    JAY\n\n(to Bethany)\n\nWhy the hell are we getting yelled at?!\n\n                                SERENDIPITY\n\nJust watch out for Bethany. Go.\n\nBethany leads Jay and Silent Bob up the stairs.\n\n                                    JAY\n\n(to Silent Bob)\n\nMan, bitch thinks just 'cause she's good-looking, she can tell us what to\ndo.\n\n                                  BETHANY\n\nShe told me that if you behave, she'll give you head.\n\n                                    JAY\n\n(excited)\n\nYeah?.\n\n                                  BETHANY\n\nOh, a demon'd have a field day with you.\n\nSerendipity and Rufus watch them disappear up the steps.\n\n                                  OC JAY\n\n(beat)\n\nShut up.\n\n                                OC BETHANY\n\nYou shut up.\n\n                                SERENDIPITY\n\n(to Rufus)\n\nNice girl.\n\n                                   RUFUS\n\nComes from good stock.\n\n                                SERENDIPITY\n\nYou haven't told her yet?\n\n                                   RUFUS\n\nNot the right time.\n\n                                SERENDIPITY\n\nHow uncanny is the resemblance? Those eves, the lips...\n\n                                   RUFUS\n\nThe nails.\n\nSerendipity looks at Rufus. He smiles. She hits him, laughing. He cracks\nup.\n\n                                SERENDIPITY\n\nBlasphemer.\n\nThen, the OC Golgothan makes a groggy, grumbling noise.\n\n                                SERENDIPITY\n\nShit. You'd better go. I'll take care of the trash.\n\n                                   RUFUS\n\n(hugs her)\n\nGood luck.\n\nRufus runs up the steps. Serendipity tunrs on the Golgothan.\n\n                                SERENDIPITY\n\nAlright, Stinky - let's see what you know.\n\nEXT CHURCH -DAY\n\nA suited MAN stands at a podium, addressing a small thrall of reporters.\n\n                                    MAN\n\nAnd now, to speak on behalf of his Holiness' 'Catholicism - Wow!' campaign,\nladies and gentlemen of the press, I give you the driving force behind the\nmovement - Cardinal Glick.\n\nThe reporters clap as CARDINAL GLICK takes to the podium. He strikes one as\nmore of an agent than a man of the cloth as he removes his Wayfarers.\n\n                                   GLICK\n\nThank you, Mister Flanagan - one of this parish's chief patrons, who\ndonated the stained-glass likeness of Our Lady of Gleeful Misery that\nwelcomes you as you enter the church every Sunday.\n\n(off index cards)\n\nLadies and Gentlemen of the press - few would deny that the Catholic Church\nhas fallen behind somewhat in the times. Catholicism usually strikes the\naverage person as an old-fashioned remedy for the ills - both moral and\npsychological - of a society that has since left it's stringent rules and\nornate rituals on the heap with 45's and eight track cassettes. And in an\neffort to disprove that, the Church has appointed this year as a time of\nrenewal, both of faith and of style. So, it is with great pleasure, that I\npresent you and your parish - mere days away from it's centennial\ncelebration - and the continental United States, via Satellite with the\nfirst of man revamps that the 'Catholicism -Wow!' campaign will unveil over\nthe next year.\n\n                                (applause)\n\nNow, what does this mean for the average church-goer? Are we going to throw\nout the rule book and adopt a hippie mentality in regards to our faith? No.\nWe're simply talking about a few minor alterations to both the aesthetic\nand theoretical aspects of a religion that boasts one of the highest\nmembership numbers on the planet.\n\nA few applause ring out. Glick smiles.\n\n                                   GLICK\n\nThank you, thank you. So what are we talking about here. Well, for\nexample...\n\n(pulls out crucifix)\n\nwhile it has been a time-honored and traditional symboL of our faith, we\nhave decided to retire the highly recognizable, yet wholely depressing\nsymbol of our Lord, Jesus Christ, crucified. Why? Well, look at it. Would\nyou relish being a member of a group that uses a man nailed to two pieces\nof wood as it's masthead? Of course not - who would? I've got enough\ndowners in my daily routine without having to deal with this visual\neverytime I go to worship. lnstead, the church is going to adopt this new,\nmore soothing and inspiring sigil, which we feel is in-line with our new\noutlook.\n\nGlick pulls a cover off an object to his right - a two foot figure of\nChrist smiling and giving the 'thumbs up'. The crowd buzzes.\n\n                                   GLICK\n\nSee? Isn't this better? How could you not feel just great walking into a\nchurch and seeing this behind the priest - a positive reinforcement that\nwhatever we do, God thinks is 'a~kay'. I love this thing, it's so...\n\n                                REPORTER I\n\n(interupting)\n\nCardinal Glick - has the church given any thought to it's position on john\nDoe Jersey? Will he be given the right to die with dignity?\n\nAnother buzz rises from the crowd. Glick rolls his eyes.\n\n                                   GLICK\n\nC'mon people. We're not here to talk about that. It's an issue we stand\nfirm on - euthanasia is a big no-no, just like abortion. Murder's murder.\nWhy won't you people accept that? Besides, we're here to talk about this\nlittle guy - your friend and mine... the happy Jesus. Can't you just see it\non chains around people's necks, and as the new background in avant garde,\nMTV videos?\n\nINT BUS TERNIINAL - DAY\n\nThe image of the 'Happy jesus' - thumbs up and all - is captured on a t.v.\nmonitor, a label reading U\\'E VIA SATELLITE - RED BANK. NEW JERSEY' at the\nbottom of the screen. Bartleby and Loki look up at it, then at one another.\n\n                                   LOKI\n\nAnd you say Siskel and Ebert have no influence over this culture.\n\n                                 BARTLEBY\n\nWe're getting out of here at just the right time. These people are nuts.\n\n                                   LOKI\n\n(off t.v.)\n\nAnd that's the church we're heading to?\n\n                                 BARTLEBY\n\n(steps to ticket window)\n\nIf you want to go home...\n\n(to WOMAN in window)\n\nTwo tickets to New Jersey, please.\n\n                                   WOMAN\n\nJersey's sold out, sir.\n\n                                 BARTLEBY\n\nAre you sure?\n\n                                   WOMAN\n\nThe computer says.\n\n                                   LOKI\n\nCome on - how many people can possibly be going to New Jersey?\n\n                                   WOMAN\n\nEnough to fill a bus.\n\n                                 BARTLEBY\n\n(to Loki)\n\nYou had to drag that judgement out. You couldn't just hit and run.\n\n(to Woman)\n\nWhen's the next one?\n\n                                   WOMAN\n\nSame time tomorrow.\n\n                                 BARTLEBY\n\nWhat?! Doesn't this place warrant at least two buses a day?\n\n                                   WOMAN\n\nI take it you've never been to the Garden State. Next.\n\nBartleby and Loki look around.\n\n                                   LOKI\n\nThere's no one else here.\n\n                                   WOMAN\n\nThen I guess it's lunch time.\n\n(she shuts her window)\n\n                                   LOKI\n\nWe should have learned to drive a long time ago. Infinite celestial power\nand we can't catch a bus.\n\n                                 BARTLEBY\n\nJust shut up, this is your fault.\n\n                                   LOKI\n\nYou can either lament over our mass transit folly, or you can listen to my\nsuggestion.\n\n                                 BARTLEBY\n\nIt's your suggestions that prevent us from negotiating what should be a\nsimple matter of catching or staying on a bus!\n\n                                   LOKI\n\nWhy fall victim to gravity when we can just as easily rise above?\n\n                                 BARTLEBY\n\n(stares at him)\n\nFly?\n\n                                   LOKI\n\nWe got wings, right? Let's use them.\n\n                                 OC VOICE\n\nI wouldn't suggest that.\n\nThe pair spin and gawk.\n\nAZRAEL leans in the doorway. He removes his hat, revealing two stubby\nhorns.\n\n                                  AZRAEL\n\nYou wouldn't want to stand out, now would you?\n\nINT STRIP JOINT BASEMENT - DUSK\n\nNoMan is tied to a chair in the middle of the floor. Serendipity draws a\ncircle around him with lipstick. Once finished. she takes a glass of water\nand throws it into No Man's face. It roars to life. The Golgothan shakes of\nhis daze, turning his attention on Serendipity.\n\n                                   NoMAN\n\nThe Muse. They told us you were up here.\n\n                                SERENDIPITY\n\nMatter of perspective. NoMan. I like to think of it as 'down here'. I have\na few questions for you, sir.\n\n                                   NoMan\n\nFree us from these binds, that you may have answers.\n\n                                SERENDIPITY\n\n(heads toward it)\n\nOkay.\n\n(stops; sarcastic)\n\nOh wait. I'm smarter than that.\n\nNoMan lets out a bellow.\n\n                                SERENDIPITY\n\nFace it, big guy - I'm not releasing you until I get answers. This can go\nhard or easy. The sooner I get what I want, the sooner you'll be free. Now,\nyou can start by telling me why you're on this plane?\n\n                                   NoMAN\n\n(beat)\n\nLiquidate the Last Scion.\n\n                                SERENDIPITY\n\nSee? That wasn't so hard. Now - who sent you? Was it Lucifer?\n\nNoMan laughs in a sinister fashion.\n\n                                   NoMAN\n\nOur master is no one and all. For a time, he will be prince of this world -\nand the fate of those who dwell in it will be at the mercy of his whimsy.\nAnd then he will sever reality and crush existence, like a thumb punctures\na fontanell, giving peace to those who've been without for so long.\n\n                                SERENDIPITY\n\nDid Bartleby and Loki send you?\n\n                                   NoMAN\n\nResist no further, Muse. Deliver over to us the conflicted one, that this\nworld may die screaming. No power - divine or inherited - threatens the\ncrusade. You cannot win. Soon will rise of the cry of the abandonned,\nbegging your God to put an end to the madness. And only as being becomes\nnot, will they know that the God of Abraham lay dormant while the dream\nperished in a blink. Your God is not dead - He's brain dead.\n\n                                SERENDIPITY\n\nShe, you chauvinist bastard - She's brain dead. And no She's not. Stop\ntrying to be so spooky. Tell me who sent vou, or I'll use whatever\ninfluence I have below' to make Hell even worse for you.\n\n                                   NoMAN\n\nYou speak of Azrael.\n\n(he laughs)\n\nWe pity you. Muse. You're still playing the old game. The one that could\nhave made good on your threat is gone.\n\n                                SERENDIPITY\n\nWhat do you mean. gone? He escaped?\n\n                                   NoMAN\n\nNo soul escapes Hell, but one.\n\n(beat - as if It's heard something)\n\nWould that I could cross the threshold of your confining circle, I would\ncrush your half-life throat. But my Master does not abandon me to this\nmockery of a prison. We will come back for the girl. And when we do, it\nwill take more than fragrant mist to keep our hands from crushing her head.\n\nNoMan goes stiff and then limp. His body begins to melt.\n\nINT TOY STORE - DAY\n\nAzrael leads Bartleby and Loki through the aisles, passing tons of stuffed\nanimals.\n\n                                 BARTLEBY\n\nJesus Christ, Azrael - how'd you get out of Hell?\n\n                                  AZRAEL\n\nI told them I was coming up on a routine possession. I don't have much\ntime. If they figure out my ruse, they'll come looking for me.\n\n                                 BARTLEIBY\n\nYou lied?\n\n                                   LOKI\n\nGo figure. Him. A demon.\n\n(to Azrael)\n\nWhy'd you bring us in here?\n\n                                  AZRAEL\n\nBecause you two fucks are inches away from getting yourselves caught. Going\naround killing people, about to uncase your wings... don't you have any\nidea what's going on?\n\n                                   LOKI\n\nWe're going back home.\n\n                                  AZRAEL\n\nAre you so clueless as to think you can just waltz back into Heaven?\n\n                                 BARTLEBY\n\nWhy not? We're going back clean.\n\n                                  AZ RAEL\n\nLet me let you in on a little secret, okay: everyone is looking for you.\nBoth sides - above and below. The orders are to terminate you on sight.\n\n                                 BARTLEBY\n\n(shocked)\n\nWhy?\n\n                                  AZRAEL\n\nYou're pissing people off, that's why! Word on the grapevine is that God's\npissed off at your presumption, and I know Lucifer's pissed because you\nassholes might just succeed where he's failed so many times, making him\nlook bad.\n\n                                 BARTLEBY\n\nSo they're going to kill us?!?\n\n                                  AZRAEL\n\nThey're going to try'. That's why you have to travel incognito - tone down\nyour behavior, stay off their respective radars. Go about this thing more\nsubtly. Quit killing people - that's high profile. And for God's sake,\ndon't uncase your wings until you have to transubstantiate. Because the\nminute you let them flap, legions of thrones and hordes of demons will\nfight each other over who gets to kill you first.\n\n(looksOC)\n\nShhhh!\n\nA WOMAN and her small DAUGHTER walk past. While the Woman looks at the\nitems on the top shelf, Loki pulls off Azrael's hat and taps the Daughter\non the shoulder. He points to Azrael's horns. The Woman pulls the Daughter\nfurther down the aisle, oblivious to the trio.\n\n                                 DAUGHTER\n\nMommy, that man had horns.\n\nAzrael grabs his hat and puts it back on.\n\n                                  AZRAEL\n\nThat's the kind of shit I'm talking about!\n\n                                   LOKI\n\nOh, lighten up.\n\n                                 BARTLEBY\n\n(still reeling)\n\nI can't believe they want to kill us.\n\n                                  AZRAEL\n\nBelieve it, boys. They've even got the Last Scion looking for you.\n\n                                   LOKI\n\nYou're kidding!\n\n                                  AZRAEL\n\nThis is big. I'm telling you. Your re-entry is a thorn in a lot of sides,\nand they'll stop at nothing to prevent it.\n\n                                   LOKI\n\nIf that's the case, then why aren't you hunting for us too?\n\n                                  AZRAEL\n\nBecause I want to see you go back. You were both given a raw deal; almost\nas raw as mine. If you make it back, then I figure there's hope for me.\n\n(looks around)\n\nIn the meantime, I suggest you find an alternate mode of transportation. If\nanything else comes up, I'll contact you.\n\n                                 BARTLEBY\n\nThank you, Azrael. You're a true friend.\n\n                                  AZRAEL\n\nWould you expect anything less from a demon. I have to get back to the Pit,\nbefore they get suspicious.\n\n(turns to leave)\n\n                                   LOKI\n\nHey Az - what's it like down there. Is it as bad as they say?\n\n                                  AZRAEL\n\nGive you a hint: they've been playing 'Mrs. Doubtfire' continuously for two\nyears now.\n\n(exits)\n\n                                   LOKI\n\n(looks at Bartleby)\n\nShit man - that is punishment.\n\nEXT CONTRYSIDE - NIGHT\n\nThe Train chugs through the darkness.\n\nINT TRAIN - NIGHT\n\nBethany and Rufus sit across from one another. They stare out the window.\n\n                                   RUFUS\n\nHow you coping, kid?\n\n                                  BETHANY\n\nIt's weird. just when I think I've got a handle on things. something\nwholely unbelievable presents itself. Sometimes I wish I had just stayed\nhome.\n\n                                   RUFUS\n\nYou sound like the Man.\n\n                                  BETHANY\n\n(beat)\n\nWhat was He like?\n\n                                   RUFUS\n\nJesus? Black.\n\n                                  BETHANY\n\nBesides that.\n\n                                   RUFUS\n\nThe brother was centered. I mean, He was God, right? But I think He felt\nleft out because He was more than human, you know? We used to sit around\nthe fire - me and the other guys - and we'd be talking about what ass-holes\nthe Romans were or getting laid...\n\n                                  BETHANY\n\nSome things never change.\n\n                                   RUFUS\n\n...and He'd just sit there listening and smiling. We'd ask Him why He never\njoined in the convo, but He said He just liked to hear us talk; about\nanything. Said it was like music. I think He just wished He had unimportant\nshit to talk about himself.\n\n                                  BETHANY\n\nHow does He feel now?\n\n                                   RUFUS\n\nHe still digs humanity, but it bothers Him to see the shit that gets\ncarried out in His name - wars, bigotry, but especially the factioning of\nall the religions. He said humanity took a good idea and, like always,\nbuilt a belief structure on it.\n\n                                  BETHANY\n\nHaving beliefs isn't good?\n\n                                   RUFUS\n\nI think it's better to have ideas. You can change an idea. Changing a\nbelief is trickier. Life should malleable and progressive; working from\nidea to idea permits that. Beliefs anchor you to certain points and limit\ngrowth; new ideas can't generate. Life becomes stagnant. That was one thing\nthe Man hated - still life. He wanted everyone to be as enthralled with\nliving as He was. Maybe it had\n\nsomething to do with knowing when He was going to die. but Christ had this\nvitality that I've never encountered in another person since. You know what\nI'm saving?\n\n                                  BETHANY\n\nHe was big on life?\n\n                                   RUFUS\n\nIt was more than that. He was the only person I ever knew who never engaged\nin that most ancient of life-affirming activities.\n\n                                  BETHANY\n\nSex.\n\n                                   RUFUS\n\nDebate. That's the only way people know how to reaffirm that they're alive\n- by debating. In all it's forms. People spend their whole lives debating:\nwe fight about who's right and who's wrong, we fight ourselves, we fight\neach other, we fight death, we fight over beliefs, we fight over fights. We\nbelieve that to stop debating - in any fashion -is to stop living and give\nup. People say that life's a struggle, but it's not. Life is living. I'm\neven guilty of it myself, the way I go on about Christ's ethnicity,\nfighting for the truth to come out. And I'm dead. Even in death, the only\nway I know how to live is through debate. That's sad, isn't it?\n\n                                 BETIIANY\n\nNot if you believe it's important for people to know.\n\n                                   RUFUS\n\nA belief's a dangerous thing, Bethany. People die for it. People kill for\nit. The whole of existence is in jeopardy right now because of the Catholic\nBelief structure regarding this plenary indulgence bullshit. And whether\nthey know it or not, Bartleby and Loki are exploiting that belief, and if\nthey're successful, you, me. all of this... ends in a heartbeat.\n\n(beat)\n\nAll over a belief.\n\nBethany nods. Rufus looks around.\n\n                                   RUFUS\n\nI haven't seen the moron twins in awhile.\n\n                                  BETHANY\n\nThey went to the lounge car to smoke.\n\n(getting up)\n\nI'll go find them; make sure they're not getting into any trouble.\n\n                                   RUFUS\n\nI'm going to catch a few z's. Forgot how tiring living can be.\n\nBethanv heads off Rufus looks out the window, then shuts his eyes.\n\nINT LOUNGE CAR - NIGHT\n\nBethany enters and spots jay and Silent Bob, talking to an unseen party.\n\n                                  BETHANY\n\nYou two aren't getting into any trouble, are you?\n\n                                    JAY\n\nNope. Just about to smoke a bowl with our new friends. You in?\n\n                                  BETHANY\n\nAnd who are your new friends?\n\n                                    JAY\n\nThey just got in at the last stop.\n\nSilent Bob moves over, revealing the new friends.\n\n                                    JAY\n\nThis is Larry and Barry.\n\nBartleby and Loki smile at Bethany.\n\n                                   LOKI\n\nJay tells us you're going to sleep with him.\n\nEXT TRAIN TRACKS - NIGHT\n\nThe train rushes over head.\n\nINT LOUNGE CAR - LATER\n\nLoki, Jay, and Silent Bob pass a joint under the table and take quick hits,\ntrying to remain casual. Jay pounds the table happily.\n\nBartleby and Bethany lay on either side of the table in their booth.\n\n                                  BETHANY\n\nYou can smoke up with them if you want. You don't have to keep me company.\n\n                                 BARTLEBY\n\nIt's a long trip. There'll be plenty of time later.\n\n(beat)\n\nSo why are you heading to Jersey?\n\n                                  BETRANY\n\nThere's just this thing there I'm supposed to do. How about you?\n\n                                 BARTLEBY\n\nWe're going home.\n\n                                  BETHANY\n\nDo you two live together?\n\n                                 BARTLEBY\n\nUnfortunately. Do you live with those guys?\n\n                                 B ETHANY\n\nGod, no. Not they just sort of adopted me.\n\n                                 BARTLEBY\n\nThey're funny as hell. The big one never says a word.\n\n                                  BETHANY\n\nI wish the little one would take a cue from him. But they're okay, as far\nas stoner's go.\n\n                                 BARTLEBY\n\nLo... Larry's taken an immediate shine to them, and he usually hates\npeople.\n\n                                 BETIIANY\n\nHow long've you two been together?\n\n                                 BARTLEBY\n\nAwhile. He's great company. He can be a little flaky sometimes, but we've\ngot a lot in common.\n\n                                  BETHANY\n\nHow'd you meet?\n\n                                 BARTLEBY\n\nWe were stationed together.\n\n                                  BETHANY\n\nSee? That's beautiful. And everyone's always up-in-arms about this\n'out-in-the-military' issue.\n\n                                 BARTLEBY\n\nWhat do you mean?\n\n                                  BETHANY\n\nWell there's all that macho bullshit about it being 'This Man's Army'. And\nyou two meet and hook up while in the service, which is so special -\nbecause it's so hard to meet anyone you can seriously relate to...\n\n                                 BARTLEBY\n\n(catches on)\n\nYou think we're lovers?! Oh no. No, we're not gay.\n\n                                  BETHANY\n\n(laughs)\n\nOh God, I'm sorry'. I just assumed...\n\n                                 BARTLEBY\n\nNo. We live together and all, but at the end of the night, I go to my room.\nand he goes to his.\n\n(beat)\n\nWhy? Do I come off as gay?\n\n                                  BETHANY\n\n(laughing)\n\nNo, not at all. I'm sorry. My ex-husband kind of fouled up my relationship\nawareness barometer.\n\n                                 BARTLEBY\n\nYou're divorced?\n\n                                  BETHANY\n\nThat's the nice way of putting it. I consider it being dumped.\n\n                                 BARTLEBY\n\nI was dumped once. More or less.\n\n                                  BETHANY\n\nIt's terrible, isn't it? Don't you constantly question your value - like\nwhy was I so easy to cast aside? Didn't I have merit?\n\n                                 BARTLEBY\n\nAnd you wonder if the other party's going to come to their senses and call\nyou back.\n\n                                 BETIIANY\n\nThe worst is that I still think like a couple. After all these years, I\nstill have the 'we' mentality.\n\n                                 BARTLEBY\n\nMine grew out of what was really a stupid misunderstanding. A\nmisunderstanding that grew into a total withdrawl of communication.\nAbandonment. And even though it was years ago, there's not a day that goes\nby that I don't wonder what went wrong. And then it hits me - I was\nreplaced by someone. A lot of someones.\n\n                                 BET HANY\n\nAnd they always tell you it'll hurt less with time...\n\n                                 BARTLEBY\n\n...when actually, it hurts more.\n\n                                  BETHANY\n\n(beat)\n\nYou know what we need? We need some drinks. A lot of drinks. Do you agree?\n\n                                 BARTLEBY\n\nWhole-heartedly.\n\nINT TRAIN CAR - NIGHT\n\nRufus continues to slumber.\n\nINT LOUNGE CAR - NIGHT\n\nJay is asleep on Silent Bob's shoulder, drooling slightly. Loki talks with\nSilent Bob.\n\n                                   LOKI\n\nI'm telling you, man - it's all about organized religion and society's\nbattle against it. The Rebels are fighting the Empire, right? Now the\nEmpire is led by whom? Darth Vader? No. It's led by the Emperor. And the\nEmperor is a practitioner of the Force, albeit the Dark Side of the Force.\nAnd the Force is basically a religion.\n\n(Silent Bob nods)\n\nSo the entire galaxy is under Imperial rule, and the Imperial government is\nrun by this old religion. What you have, then, is a theocratic government -\na government run by the church. So Luke, Han, and Leia are fighting that\ngovernment to liberate the galaxy from the pious grip of what is, in\nessence, holy mother church.\n\nSilent Bob nods in understanding.\n\nBethany and Bartleby slump in their booth, the table loaded with empty\nglasses. Bethany is quite tipsy. Bartleby sips his drinks, and\nsurreptitiously spits it out.\n\n                                 BARTLEBY\n\nYou're saying you still go to church?\n\n                                  BETHANY\n\n(laughs)\n\nEvery Sunday.\n\n                                 BARTLEBY\n\nDoes it do anything for you?\n\n                                  BETHANY\n\n(thinks)\n\nGives me time to balance my check book every week.\n\n                                 BARTLEBY\n\nSee? That's what I'm talking about. People don't go to church and feel\nspiritual. They go to church and feel bored. But they keep going. Every\nweek. Out of habit.\n\n                                  BETHANY\n\nOr in habit, if you're a nun.\n\n                                 BARTLEBY\n\nOh... that wasn't very funny at all.\n\n                                  BETHANY\n\nA friend of mine told me that church is like bad sex:it's messy and there's\nno foreplay...\n\n(starts laughing)\n\nNo. that's not it. I am so buzzed.\n\n                                 BARTLEBY\n\nWhen do you think you lost your faith?\n\n                                  BETHANY\n\nI remember the exact moment. I was on the phone with my mother, and she was\ntrying to counsel me through what was happening to me and my marriage. And\nshe said something like \"There's always a plan.\" And I... just got so\nangry. I mean, I know she was talking about God, right - God had a plan.\nBut I was like \"What about my plans?\" You know? Like, don't they count for\nanything? I had planned to grow old with my husband and have a family -\nwasn't that plan good enough for God?\n\n(beat)\n\nApparently not.\n\n(swigs her drink)\n\nHow about you? When did you lose your faith?\n\n                                 BARTLEBY\n\nMe? Years ago. One day, God just stopped listening. I kept talking, but I\ngot the distinct impression that He wasn't listening anymore.\n\n                                  BETHANY\n\nShe. And how do you know She was listening in the first place?\n\n                                 BARTLEBY\n\n(thinks)\n\nI guess I don't.\n\n                                  BETHANY\n\nI hate thoughts like that. But they occur to you with age. When you're a\nkid, you never question the whole faith thing - God's in Heaven, and\nHe's... She's always got her eye on you. I'd give anything to feel that way\nagain. Which is why I guess I let myself get talked into this pilgrimage. I\nneeded proof. And the opportunity presented itself to find out if it is\nlike they told us in Catholic school. And I gotta tell you - the last few\ndays, I've come across some interesting people that lend toward convincing\nme.\n\n                                 BARTLEBY\n\nWhere's this pilgrimage to?\n\nINT TRAIN CAR - NIGHT\n\nRufus stirs. He looks around and stretches.\n\nINT LOUNGE CAR - NIGHT\n\nBethany and Bartleby continue their discussion.\n\n                                  BETHANY\n\nYou'd never believe me if I told you.\n\n                                 BARTLEBY\n\nTry me.\n\n                                  BETHANY\n\nAlright. But I warned you. Okay - I'm going to this church in New Jersey.\n\n                                 BARTLEBY\n\nReally...\n\nINT TRAIN CAR - NIGHT\n\nRufus heads toward the back of the car. He opens the door between the cars\nand exits.\n\nINT LOUNGE CAR - NIGHT\n\nBethany and Bartleby talk further. Bartleby's intrigued.\n\n                                  BETHANY\n\nI was told that I'm supposed to stop a couple of angels from entering the\nchurch. They're trying...\n\n(laughing)\n\nThis sounds so stupid... They're trying to get back into Heaven.\n\nINT TRAIN CAR - NIGHT\n\nRufus passes through another car and opens the door at the end.\n\nINT LOUNGE CAR - NIGHT\n\nBartleby grows very tense. Bethany rattles on, half-toasted.\n\n                                  BETHANY\n\nSee, they got tossed out of Heaven years ago, right? And if they get back\nin, it proves God wrong. And since God is infallible, to prove Her wrong\nwould...\n\n(laughing hard)\n\n..would unmake existence! I feel so stupid just saying it.\n\nBartleby's eyes are wide. He looks scared. Then, a calm falls over him.\n\n                                  BETRANY\n\n(laughing)\n\nBut the thing I don't get... is how do I stop an angel? Two, even! I guess\nI'm supposed to talk them out of it or something.\n\nBartleby surreptitiously slides a knife off the table.\n\n                                 BARTLEBY\n\nMaybe you're supposed to kill them?\n\nBethany breaks into hysterics.\n\nINT TRAIN CAR - NIGHT\n\nRufus pulls open another door and exits.\n\nINT LOUNGE CAR - NIGHT\n\nBethany's still cracking up, oblivious to the on-the-defensive Bartleby.\n\n                                  BETHANY\n\nOh yeah! Kill them! Even if that was the case... I mean. how do you kill an\nangel?\n\n                                 BARTLEBY\n\nI don't imagine it's much different...\n\n(slowly lifts the knife)\n\n...from killing a human...\n\nThe door behind them slides open. Rufus steps in.\n\n                                   RUFUS\n\nWhere the hell is everybody? I wake up, and...\n\nHe sees Bartleby. They both freeze.\n\n                                 BARTLEBY\n\nThe Apostle!\n\n                                   RUFUS\n\nHoly shit!\n\n                                  BETHANY\n\n(stumbling to her feet)\n\nRufus, I want you to meet my friend, Barry...\n\nBartleby leaps out of the booth and grabs Bethany, holding the knife to her\nthroat.\n\n                                  BETHANY\n\n(chuckiing)\n\nBarry! Don't be such a show off!\n\n                                   RUFUS\n\nTake it easy, Bartleby. Just let her go and let's talk about this.\n\n                                 BARTLEBY\n\nAfter all this time, this is what it comes down to -slaughtered by this\nmeat puppet?!\n\n                                   RUFUS\n\nThere doesn't have to be a slaughter. We can work this out...\n\n                                  BETHANY\n\nIs that a knife?\n\n                                 BARTLEBY\n\nOh. we can work it out, alright. I'm going to work the blade in and out of\nher thorax!\n\n(calling over shoulder)\n\nLoki!\n\nLoki catches the action and reacts.\n\n                                   LOKI\n\nHoly shit - the Apostle!\n\nHe leaps from the table. Jay stirs and wakes up.\n\n                                    jAY\n\n(half asleep)\n\nI didn't come in you, I swear...\n\n(looks around)\n\nBartleby, with Bethany in hand, faces off against Rufus. Loki joins them.\n\n                                   LOKI\n\n(to Rufus)\n\nWhat are you doing here?\n\n                                 BARTLEBY\n\nThey're here to thwart our journey home, my friend. This one just told me\nthat she's supposed to stop a couple of angels from entering a church.\n\n                                   LOKI\n\nYou think she was talking about us?\n\n                                 BARTLEBY\n\nI'd say there was a pretty good chance. What do you say, Rufus - we're to\nbe liquidated?\n\n                                   RUFUS\n\nIt doesn't have to go down like that! You haven't thought about the\nconsequences of re-entry!\n\n                                   LOKI\n\nConsequences, schmonsequences.\n\n                                 BARTLEBY\n\nI have to agree with him. No one - not you, and especially not this\nfinite-lifer - no one is going to impede us. We're going home, regardless\nof whose pride it may hurt!\n\n                                   RUFUS\n\nIt's not a question of pride, it's...\n\n                                 BARTLEBY\n\nLoki - kill the girl\n\n                                   LOKI\n\n(beat)\n\nWhat are you, high?\n\n                                 BARTLEBY\n\nDo it!\n\n                                   LOKI\n\nI can't kill her if she hasn't done anything, you know that. And it looks\nlike she's 'on the job', so to speak...\n\n                                 BARTLEBY\n\nFine! I'll kill her myself...\n\nA hand lands on Bartleby's shoulder.\n\n                                    JAY\n\n(oblivious to the situation)\n\nHey man - now it's your turn. We got enough for a fatty boom-batty, biggety\nblunt!\n\nBartleby turns the knife on him.\n\n                                    JAY\n\n(not quite getting it yet)\n\nWe having cake or something?\n\nLoki backhands Jay, stunning him.\n\n                                    JAY\n\n(dazed)\n\nIn grates...\n\nJay drops to the floor, out cold. Silent Bob grabs Loki and hurls him down\nthe aisle. Rufus grabs Bartleby's knife hand. They struggle. Bethany\ncollapses.\n\n                                   RUFUS\n\nTUBBY! THE DOOR!\n\nSilent Bob jumps over Loki and opens the back door of the car. He grabs\nLoki by the collar.\n\n                                   LOKI\n\nWait, man! Can't we talk about this?!\n\nHe throws Loki out the door, off the train.\n\nRufus squeezes Bartleby's hand. Bartleby drops the knife and punches Rufus\nin the face. Bethany jumps on Bartleby's back, covering his eyes. They\ncareen down the aisle, toward Silent Bob. He pulls Bethany off Bartleby's\nback and kicks him out the back door, off the train. He quickly slams the\ndoor closed and leans against it.\n\nThe Bartender stares at him.\n\nSilent Bob brushes off his coat and thumbs toward the door.\n\n                                SILENT BOB\n\nNo ticket.\n\nRufus rubs his jaw. Bethany crawls up beside him, breathing heavily.\n\n                                 BETH ANY\n\nI should have known something was wrong when he paid for all the drinks.\n\nINT UNDERGROUND GARAGE - NIGHT\n\nA door is kicked open. Loki enters, brushing himself off. Bartleby follows.\n\n                                   LOKI\n\nThe Apostle is here!\n\n                                 BARTLEBY\n\nI noticed.\n\n                                   LOKI\n\nIf that's the case, then chick with him must be...\n\n                                 BARTLEBY\n\nThe Scion, I'd imagine.\n\n(leans against the wall; slides down)\n\n                                   LOKI\n\n(in a panic)\n\nWell, shit man! Maybe we should rethink this whole thing! I mean, you heard\nthe guy - he said there were consequences. Azrael tells us we're marked.\nMaybe there's more to this than we thought about.\n\nBartleby leans against the wall, sitting on the ground. His demeanor has\nchanged. He stares into space.\n\n                                 BARTLEBY\n\nThere sure is.\n\n(beat)\n\nIt's them.\n\n                                   LOKI\n\n(beat)\n\nWhat?\n\n                                 BARTLEBY\n\n(shakes his head)\n\nThem.\n\n                                   LOKI\n\n(thinks)\n\nThe movie about the giant ants?\n\n                                 BARTLEBY\n\nThem - the humans. It's what it all comes down to. you know? Us against\nhumanity... kind of like that giant ant movie.\n\n                                   LOKI\n\n(beat)\n\nAre you alright?\n\n                                 BARTLEBY\n\nI'm better than alright. I've had an epiphany, my friend.\n\n                                   LOKI\n\nAn... epiphany. Yes, well... that'll happen.\n\n                                 BARTLEBY\n\nWhen that sweet, innocent girl let her mission slip, I suddenly understood\nit all - everything. For the first time in all these eons, I get it.\n\n                                   LOKI\n\n(beat)\n\nGet what?\n\n                                 BARTLEBY\n\nIn the beginning, it was just us and Him. Angels and God. And then He\ncreated the humans. And He gave them more than He ever gave us. Our's was\ndesigned to be a life of servitude and worship - adoration. But He gave the\nhumans more - He gave them a choice. They can choose to ignore God, choose\nto acknowledge Him. All this time we've been down here, everyday I felt the\nabsence of the Divine presence. And it pained me... as I'm sure it must\nhave pained you sometimes, even though you'd gloss over it with jokes. But\nwe feel his absence, and why? Because of the way He made us -as servants.\nHad we been given free will, we could ignore the pain... like them.\n\n                                   LOKI\n\nYou know - maybe you should take a nap or something.\n\n                                 BARTLEBY\n\nLoki, don't you get it? It's the humans - it's always the humans. They were\ngiven paradise; they threw it away. They were given this planet; they\ndestroyed it. They were favored best among all His endeavors; and some of\nthem don't even believe He exists. Their ego-mania corroded Hell and made\nit dark and crimson.\n\n(looks at Loki)\n\nI asked you to lay down your sword years ago - why?\n\nBecause I felt sorry for them. And where did it get us?\n\nThrown out.\n\n(smiles)\n\nWe've paid our debt. Don't you think it's time we went home? And to do\nthat, I think we have to dispatch our would-be dispatchers.\n\n                                   LOKI\n\nWait, wait, wait - kill them?! You're talking about the Last Scion, for\nChrist's sake! And what about Jay and Bob - I mean, those guys were\nalright.\n\n                                 BARTLEBY\n\nDon't, my friend. Don't let your sympathies get the best of you, as they\ndid me way back when. Scion or not, she's just a human. And regardless, our\nsins are forgiven by passing through that arch. No harm, no foul.\n\n                                   LOKI\n\nThat sounds thin.\n\n                                 BARTLEBY\n\nFine. We'll cover ourselves. We'll take out a slew of people. Maybe amidst\nthe body count, He won't notice.\n\n                                   LOKI\n\nOh, that's being realistic.\n\nBartleby reaches out and grabs Loki, slamming him against the wall.\n\n                                 BARTLEBY\n\nI'm going home, Loki. And nobody - not even the Almighty Himself - is going\nto make that otherwise.\n\nBartleby releases Loki and smiles. He exits. Loki watches him.\n\n                                   LOKI\n\nShit.\n\nHe follows.\n\nEXT CAMP FIRE - NIGHT\n\nAnother Newspaper headline regarding 'John Doe Jersey' fills the frame. It\nis lowered to reveal Jay, Bethany, and Rufus sitting around a makeshift\nfire in the middle of nowhere. Jay rolls a joint. Silent Bob reads the\npaper.\n\n                                  BETHANY\n\nI don't understand why we couldn't stay on the train. You threw those guys\noff.\n\n                                   RUFUS\n\nA very basic strategy - if your enemies know where you are, then don't be\nthere.\n\n                                  BETHANY\n\nAnd what's with that? Why are we enemies? The guy almost gutted me, for\nGod's sake!\n\n                                    JAY\n\nHe had the knife at your throat. To gut you, he'd have to have the knife at\nyour stomach.\n\n                                  BETHANY\n\nSemantics! Semantics that don't even answer mv question.\n\n                                   RUFUS\n\nWell, I know I'd perceive the person sent to kill me as my enemy.\n\n                                  BETHANY\n\nWhat do you mean, kill? I wasn't asked to kill them -just stop them from\ngoing into that church.\n\n                                   RUFUS\n\nAnd how were you going to do that? Preoccupy them with a game of Bingo?\n\n                                  BETHANY\n\nI've never killed anything before in my life!\n\n                                    JAY\n\nI'll do it.\n\n                                   RUFUS\n\nShut the fuck up, little man - you couldn't kill a pint of ice cream, let\nalone an angel.\n\n                                    JAY\n\nFuck you - I can kill an angel as good as the next guy.\n\n                                   RUFUS\n\nOh yeah? How' would you do it?\n\n                                    JAY\n\nI'd give him a Van Damme neck-break, like in 'Hard Target'. D'jou see that\nflick?\n\n                                   RUFUS\n\n(ignoring jay; to Bethany)\n\nKilling an angel's a two-step process - first you have to cut off their\nwings. which then makes them human. From that point on, it's the same as\nkilling anything else - head or heart, take your pick.\n\n                                  BETHANY\n\nYou say it as if it's easy.\n\n                                   RUFUS\n\n(oblivious to Jay)\n\nProblem is, I don't think we could pull it off even if we wanted to. All\nthis time away from the Divine Presence should have made those two weaker -\nand those guys felt far from weak. Either that or someone's protecting them\n- someone with juice.\n\n                                  BETHANY\n\nSo then we're screwed?\n\n(shrugs)\n\nShit, that's the best news l've heard in days.\n\n                                   RUFUS\n\nThis doesn't excuse you from tryng to stop them.\n\n                                  BETHANY\n\nCount me out. You're telling me they're unstopable, I'm exhausted - both\npsychologically and physically, the odds are against us. I say we kick back\nand wait for the end -a little non~xistence might be just what the doctor\nordered.\n\n                                    JAY\n\nI'm with her. I don't care about dying, so long as we're all going to die.\n\n                                   RUFUS\n\nWhat are you babbling about now?\n\n                                    JAY\n\nIf I was the only one, that'd bother me because every-one else would go on\nliving, having a good time without me. But if we all go at once, that'd be\nokay, because I know I'm not missing anything.\n\n                                  BETHANY\n\nSee? You know it's right when even he's making sense.\n\n                                    JAY\n\nBesides, she said if we were in a situation where we were going to die in\nlike five minutes, she'd have sex with me and Silent Bob.\n\n                                   RUFUS\n\nSo you're suggesting she throw in the towel and let eons of work and\nhistory get blinked out of existence just so you can get laid?\n\n                                    JAY\n\n(thinks)\n\nNo. Just so me and Silent Bob could get laid.\n\n                                  BETHANY\n\nNow that we're all but in total agreement on this, I'd just like to finally\nknow - why me?\n\n                                    JAY\n\nBecause you've got nice tits.\n\n                                  BETHANY\n\nI wasn't talking to you!\n\n(to Rufus)\n\nWhy me? Why do I have to do this? Nobody's come\n\nclean on that. Out of everyone on the whole god-damned planet. How come I\ngot tapped?\n\nRufus looks at her. He shrugs.\n\n                                   RUFUS\n\nFamily ties.\n\n                                    JAY\n\nThat show's funny as hell.\n\n                                   RUFUS\n\nShut up.\n\n(to Bethany)\n\nDo you know what the Apocryphal books are?\n\nBethany shakes her head no.\n\n                                   RUFUS\n\nMost of that information in the Bible came from the Dead Sea Scrolls -\nancient text discovered in a cave ages ago. And when the Sanskrit was\ntranslated, they discovered data that conflicted with the lore church\nofficials had already established as the basis of their religion. They\ncouldn't refute centuries of dogma, so they thought it best to leave\ncertain passages out - sometimes whole books. Those books make up the\nApocrypha.\n\n                                  BETHANY\n\nWhat's this have to do with me?\n\n                                   RUFUS\n\nYou've never gotten the complete picture. If they had compiled the material\ntogether like they were supposed to, you'd get the whole story. But by\nleaving text out, the church has presented you people with an extremely\nsterile and unmoving account of religious history. The Creation. the entire\nOld Testament, the history of Christ...\n\n(let's her take it in)\n\nForget about my whole black angle for a minute...\n\n                                    JAY\n\nWe might if you'd quit bringing it up.\n\nRufus backhands Jay. Silent Bob holds jay back. Rufus continues, oblivous\nto Jay.\n\n                                   RUFUS\n\nHe goes from twelve years old to thirty. Whole volumes of text about the\neighteen year struggle with His Divine nature prior to His acceptance of it\nwere thown out, forever lost to the faithful.\n\n                                  BETHANY\n\nI don't buy it. Integral material like that would give people a better\nunderstanding of the nature of God. Why leave it out?\n\n                                   RUFUS\n\nBecause it was all closely tied in with His family.\n\n                                  BETHANY\n\nHis mother and father?\n\n                                   RUFUS\n\nHis brothers and sisters.\n\n                                  BETHANY\n\n(beat)\n\nWait, wait, wait - Jesus didn't have any brothers or sisters. Mary was a\nvirgin - that's why it's called the Immaculate Conception.\n\n                                   RUFUS\n\nMary gave birth to Christ without having known a man's touch - that's true.\nBut she did have a husband. And do you really think he'd have stayed\nmarried to her all those years if he wasn't getting laid? The nature of God\nand the Virgin Birth - those are leaps of faith. But believing a wife never\nhumped her husband - that's just gullibility.\n\n                                  BETHANY\n\n(sudden realization)\n\nMARY AND JOSEPH HAD SEX?!?\n\n                                   RUFUS\n\nAll the time, from what I understand. Jesus used to tell me stories about\nhearing them through the walls when He was a kid.\n\n(beat)\n\nSo you ask why you got tapped. I'll tell you why: a Christ was the\nsalvation of this world once before. And you're the closest thing to a\nChrist that still walks.\n\n                                  BETHANY\n\nMeaning?\n\n                                   RUFUS\n\nThe blood that flows in your veins shares a chromosome or two at the\ngenetic level with the man you call Jesus.\n\n(hand on her shoulder)\n\nYou're His great-grand-niece.\n\nBethany's jaw drops. A high-pitched squeak of a word escapes her lips.\n\n                                    JAY\n\n(takes a hit from his joint)\n\nSo... that would make Bethany part black.\n\n(to Silent Bob)\n\nMan, this is just like when Vader told Luke he was his father.\n\n                                   RUFUS\n\nI just wish I knew what the hell we're supposed to do now?\n\n                                 OC VOICE\n\nYou must go to the Dagobah system and find Yoda - the Jedi Master who\ninstructed me.\n\nEveryone turns around. Metatron leans against a tree.\n\n                                 METATRON\n\nGod. l've always wanted to say that.\n\n                                   RUFUS\n\nThe voice.\n\n                                 NIETATRON\n\n(mimicking his shock)\n\nThe Apostle!\n\n(sits down with them)\n\n                                  BETHANY\n\nNow you show up! Where were you when that psychotic bastard had a knife to\nmy throat?\n\n                                 METATRON\n\nI told you you'd be in capable hands - you're not dead are you?\n\n                                   RUFUS\n\nWhat are you doing here anyw'ay?\n\n                                 METATRON\n\nI felt left out. Everyone's sitting around coming clean, I thought I'd join\nin with a confession of mine own.\n\n                                    JAY\n\nNow who's this mother fucker?\n\n                                   RUFUS\n\nThis is the Voice of God - show some respect.\n\n                                    JAY\n\nThe Voice of God? Where's the rest of Him?\n\n                                 METATRON\n\nFunny you should mention that - we're not sure.\n\n                                  BETHANY\n\nExcuse me?\n\n                                 METATRON\n\nDidn't it ever occur to you that this Bartleby/Loki situation was well\nwithin the realm of His control?\n\n                                   RUFUS\n\nIf that's the case, then why was Bethany tapped?\n\n                                 METATRON\n\nYou know those constitutionals He likes to take?\n\n                                  BETHANY\n\nConstitutionals?\n\n                                   RUFUS\n\nI think we're beyond euphemisms at this point.\n\n(to Bethany)\n\nGod's a skee-ball fanatic.\n\n                                 METATRON\n\nLet's not altogether blow some of the mystery that surrounds Him, alright?\n\n(to Bethany)\n\nYes - the Lord has quite a fancy for the game; been playing it for years -\nHe assumes a human form once a month and indulges. Doesn't tell anyone\nwhere He's playing; just goes away for a couple of hours. It's quite\nunderstandable - a small exercise in hand/eye coordination has been proven\nas a highly effective means of therapeutic relaxation. And from what I\nunderstand, He always gives his free points away to neighborhood children.\nIsn't that sweet?\n\n                                  BETHANY\n\nBut She hasn't come back from one of those day-trips, is what you're\ngetting at?\n\n                                 METATRON\n\n(to Rufus)\n\n'She'? I take it she's met the Muse.\n\n(to Bethany)\n\nNo, 'She' hasn't. And we've been unable to locate Her.\n\n                                   RUFUS\n\nMaybe He was killed? Human form has that drawback.\n\n                                M ETAT RON\n\nNo - there's a different sort of foul-play afoot, children. Whomever has\nset the renegade angels on their path and is keeping them quite\nwell-hidden. is also responsible for the Lord's whereabouts. Were He to be\nkilled in human form, He'd have immediately returned to Paradise. Somebody\nknew enough to keep the body alive, but incapacitate Him in another fashion\n- He's trapped in a body.\n\n                                   RUFUS\n\nSo God's not dead...\n\n                                    JAY\n\nHe's brain dead.\n\n                                 METATRON\n\nSo it would seem. And as omnipotent as we are above, I have to admit that\nwe're more or less lost without His presence. We've had our people looking\neverywhere for Him. And I tapped her, because I thought we might be able to\nsmoke out whoever's behind this. But whoever it is has been clever enough\nto send some lackeys after you, as opposed to showing up themselves.\n\n                                   RUFUS\n\nCan it be Lucifer?\n\n                                 METATRON\n\nThankfully they seem oblivious to the situation in the nether-regions. I\nknow they're not responsible - at least not Lucifer. If he was, he'd have\nmade his move by now to conquer Heaven. And I know he's not responsible for\nBartleby and Loki because he'd have just as much to lose by their return as\neveryone else.\n\n                                   RUFUS\n\nThen what about the Golgothan and the Triplets?\n\n                                 METATRON\n\nDon't be stupid - demons aren't exclusive to Hell. Anybody can summon one.\n\n                                    JAY\n\n(excited)\n\nYeah?\n\nSilent Bob hands Jay his newspaper and points. Jay reads.\n\n                                  BETHANY\n\nDon't encourage them. And why did you lie to me? You said I was tapped as a\ntest?\n\n                                 METATRON\n\nNo, you said that - I just didn't correct you. You were shocked enough -\nhow do you think you would've taken it if I told you the face of God\nbelonged on the back of a milk carton?\n\n                                   RUFUS\n\nSo what do we do now?\n\n                                M ETAT RON\n\nI say we get drunk, kids - because I'm all out of ideas.\n\n                                    JAY\n\n(off paper)\n\nWhy don't we just ask this guy to close the church?\n\n                                 METATRON\n\nI beg your pardon?\n\n                                    JAY\n\nHere.\n\n(hands group the paper)\n\n                                  BETHANY\n\n(reading)\n\n'Glick Takes Heat for Campaign'?\n\n                                    JAY\n\nIt's the guy in charge of the church thing.\n\n                                  BETHANY\n\n(reading)\n\n'Cardinal Glick has come under fire for the blatant pandering and\nquestionable direction of his church-sanctioned 'Catholicism - Wow!'\ncampaign. When asked about his motivations for decommisioning the\ntraditional baptismal fonts in favor of the proposed Olympic sized\nlap-pools beneath parish floors, Click responded \"Come on - who doesn't\nlike a pool party?\"\n\n                                    JAY\n\nMaybe you could tell him to shut down the church. If it's closed on that\nday, those guys can't get blessed or whatever - right?\n\n                                 METATRON\n\nGood Lord - he's got a point.\n\n                                  BETHANY\n\nI think Silent Bob had a point. But sure - we can go to him and explain the\nsituation somehow.\n\n                                   RUFUS\n\n'We'? You're back in?\n\n                                  BETHANY\n\nWell, mine is a heritage Divine... and I wouldn't want to let down the\nfamily.\n\n(smiles)\n\n                                 METATRON\n\n(off Silent Bob)\n\nWell, well, well - the prophets finally live up to their titles.\n\nSilent Bob shrugs. Jay is trying to look down Serendipity's shirt. She\nback-hands him.\n\nTELEVISION SCREEN - COMMERCIAL\n\nTwo cartoon ALTAR BOYS sift through their bowls of cereal.\n\n                                  ALTAR 1\n\nThe same boring cereal again?\n\nA cheesy CARTOON CHRIST floats down from above.\n\n                                  CHRIST\n\nMan cannot live on boring cereal alone!\n\n                                ALTAR I & 2\n\nIT'S JESUS!\n\nJesus pulls a box of HOSTIES cereal from his sash.\n\n                                  CHRIST\n\nWhy not try Hosties!\n\nCL on cereal pouring into a bowl. It's shaped like Eucharistic hosts. Milk\nfollows.\n\n                                 CHRIST VO\n\nNew Hosties is fortified with vitamins and minerals, topped off with an\nangelic kiss of frosting that stays crispy in milk!\n\nChrist's hands on their shoulders, the Altar Boys down their cereal\nhappily.\n\n                                  CHRIST\n\nHosties is an important part of any nutritious breakfast, and each one is\nblessed by a high ranking Vatican Monsignor - good for the body, and good\nfor the soul. But make sure you've confessed beforehand...\n\nAltar 2 clutches at his throat, gasping.\n\n                                  ALTAR 2\n\nI... I touched... m..myself! I'm...s...sorry...\n\n                                  CHRIST\n\n(smiling benignly)\n\nYou're forgiven.\n\nAltar 2 stops choking and continues eating, happily.\n\n                                  CHRIST\n\nSo try a bowl of Hosties! And don't just take my word for it...\n\nA cartoon POPE pops out of the box, eating a spoonful of cereal.\n\n                                   POPE\n\nThey're Heavenly!\n\nINT CLICK'S OFFICE - DLSK\n\nA hand switches off the t.v. Pan up to Cardinal Click, all smiles.\n\n                                   GLICK\n\nWell...? Doesn't it pop?\n\nBethany. Rufus, lay and Silent Bob are at a total loss for words.\n\n                                    JAY\n\n(After a long beat)\n\nDoes it come in chocolate flavor?\n\nThe Cardinal picks up a golf putter and begins putting into an overturned\nglass.\n\n                                   GLICK\n\nYou see? Now this one's got vision!\n\n(to Jay)\n\nWe're rolling out the flavors in September. Big cereal month with the kids,\nback to school and all.\n\n                                  BETHANY\n\nIt's a bit... startling.\n\n                                   GLICK\n\nExactly! And that's what we're looking to do - shake these people up a bit,\nget them motivated. That's the whole point of the campaign. Mass attendance\nis at an all-time low in this country. And it's not like we're losing them\nto the Protestants or Baptists - people aren't practicing at any\ndenomination these days. If we can sell them some show - let 'em know the\nCatholic church has some panache, we can win them back -even get some new\nones. Fill them pews, people - that's the key. And cross-promoting - like\nwith the cereal tie-in grabs the little ones as well. Hook 'em while\nthey're young.\n\n(sits at his desk, lights smoke)\n\n                                   RUFUS\n\nKind of like the tobacco industry?\n\n                                   GLICK\n\nOh - if only we had their numbers. But we are aiming for the same\ndemographic, even though mine is the soulsaving biz. And if I have to play\na bit of the devil to bring them closer to the Lord, then I'll wear the\ncloven hooves and carry the pitch fork.\n\nJay and Silent Bob adjourn themselves from the group and approach a hat\nrack, where the Cardinal's CASSOCK and MITER hang. Jay nudges Silent Bob.\n\n                                OC BFTHANY\n\nWe really appreciate you seeing us this late in the day, your Emminence. My\nfriends and I have been traveling all night in hopes of getting a chance to\ntalk to you about the Saint Michael's Re-Dedication ceremony.\n\nThe Cardinal blows smoke rings.\n\n                                   GLICK\n\nYou'd like to help out in some way?\n\n                                  BETHANY\n\nWe'd like you to cancel the ceremony and the re\n\ndedication.\n\n                                   GLICK\n\n(pauses mid-ash-tap)\n\nI beg your pardon?\n\nSilent Bob stands alone by the coat rack. Jay leaps into the frame, cassock\ntied around his shoulder like a cape. He strikes a Superman pose.\n\n                                OC BETHANY\n\nThere's going to be a world of trouble if tomorrow's ceremony goes forward\nas planned.\n\nThe Cardinal leans back in his chair.\n\n                                   CLICK\n\nWhat is this - a threat? Are you planning some sort of demonstation?\n\n(pause)\n\nAre you pro-choicers?\n\n                                  BETHANY\n\nNo, the trouble's not from us. It's from these renegade angels who've been\nstuck on earth since the plagues...\n\nRufus side-kicks Bethany, nonchalantly.\n\n                                  BETHANY\n\nUh... these guys who think they're renegade angels.\n\n                                  RUFL'S\n\nSee padre, it goes down like this - the boys believe that by passing\nthrough the archway they can get to Heaven. Granted, it's far-fetched, but\nthe brothers are convinced it's the truth.\n\nSilent Bob watches as the Miter appears slowly from behind the partition,\nresembling a shark fin. It 'swims' to and fro, menacingly. Silent Bob\nshakes his head.\n\n                                 OC GLICK\n\nAnd you want me to call off the ceremony... for that?\n\nBethany leans forward in her seat.\n\n                                  BETHANY\n\nWell. they're very passionate about it. Dangerously so. They could turn\nviolent if they walk through that arch and nothing happens.\n\n                                   RUFUS\n\nThese guys could blow, and if they do, they're going to take some people\nwith them. Call this thing off.\n\n                                   CLICK\n\n(beat)\n\nWho sent you? Someone from the Council of Churches, right? Somebody's upset\nthat we're getting so much publicity- is that it? Who was it? Rabbi Sloss?\n\n                                   RLFLS\n\nWe were sent by Him who is called I Am.\n\n                                   GLICK\n\nCute.\n\n(standing)\n\nTime to go. kids. Play time with the Cardinal is over.\n\n                                   RUFUS\n\n(to Bethany)\n\nWorked for Moses.\n\n                                  BETHANY\n\nStay out of this.\n\n(to Glick)\n\nYour Emminence, it's not a joke. These guys are an accident waiting to\nhappen. And if the re-edication ceremony goes on as planned...\n\n                                   GLICK\n\n...then these loonies will show up and go nuts, thus endangering the lives\nof all assembled, including the Governor, the press, me, the leaders of the\nCouncil of Churches. Heck, let's not stop there, maybe even God Himself.\n\n                                  BETHANY\n\nYou can't say Himself; it could be a woman.\n\n                                   GLICK\n\n(rubs temples)\n\nYour passion for all topics insignificant, including the gender of our\nalmighty lord, tests my patience, people. Now I'm a very important man with\nvery important matters that demand my attention, so if you'll please...\n\n                                   RUFUS\n\nI'm telling you man. this ceremony is a mistake.\n\n                                   GLICK\n\nThe Catholic Church does not make mistakes.\n\n                                   RUFUS\n\nWhat about the church's silent consent to the slave trade?\n\n                                  BETHANY\n\nAnd it's platform of non-involvement during the Holocaust?\n\n                                   CLICK\n\n(beat)\n\nAlright, those were mistakes. But one can hardly hold the current\nincarnation of Holy Mother Church responsible for oversights of old. Now\nI've indulged you for more time than I should have. Please go.\n\n                                  BETHANY\n\nBut tomorrow...\n\n                                   CLICK\n\n(losing it)\n\nTomorrow goes off without a hitch! Do I make myself clear?! I did not labor\ntwo years and exhaust eve~ ounce of my being to insure that this ceremony\nbe a cornerstone in the most important liturgical event since Vatican Two\njust to cancel it at the zero hour at the insistence of a wandering band of\npranksters who've targeted me as the focus of their evening's merriment!\nThis occasion is important for the congregation of this parish, for the\nmassive crowds coming for the plenary indulgence, for me, for his Holiness\nthe Pope, and - most importantly - for the 'Catholicism - Wow!' campaign!\nAnd neither you, nor any other influence short of the hand of God...\n\n(glares at Bethany)\n\n... HIM -self will prevent it from occurring successfully!\n\nHe violently grabs the Miter/shark fin 'swimming' behind the partition.\n\n                                   GLICK\n\nAND TAKEOFF MY GODDAMN HAT!!!\n\n]ay slowly looks over the partition.\n\nEXT SEASHORE\n\nThe sun slowly rises. The day has arrived.\n\nEXT TURNPIKE - EARLY MORNING\n\nAmidst very little traffic, two figures emerge from the shadows on the\nPennsylvania side. Bartleby and Loki step purposefully past the green sign\nthat welcomes motorists to New Jersey.\n\nINT BAR - DAWN\n\nThe place is empty, except for Bethany, Rufus, Jay and Silent Bob and A\nBARTENDER.\n\n                                  BETHANY\n\nI can almost see the headlines - if there were going to be any - \"Existence\nErased - Thanks to some prick in a scarlet cape.\n\n                                   RUFUS\n\nIt's a crime that a guy like him even gets to wear a scarlet cape.\n\n                                    JAY\n\nThat ain't no crime. You wanna see a crime? Look what we stole from the guy\nin the dress.\n\n(to Silent Bob)\n\nHand it over.\n\nSilent Bob pulls a golf club from out of his coat.\n\n                                  BETHANY\n\nOh my God. We're going straight to Hell, I know it.\n\n                                   RUFUS\n\nYou stole the Cardinal's driver?\n\n                                    JAY\n\nI told him to. You know how much these things are worth? That's at least a\ncouple of sodas and a pack of smokes right there.\n\n                                  BETHANY\n\nWhat do we do now?\n\n                                   RUFUS\n\nLet them keep it. In a couple of hours, it won't matter anyway.\n\n                                  BETHANY\n\nNot that - about Bartleby and Loki!\n\n                                   RUFUS\n\nWe have no choice but to try to kill them.\n\n                                  BETHANY\n\n(to Rufus)\n\nBut you said they couldn't be killed.\n\n                                 OC VOICE\n\nCorrection : they won't be killed.\n\nThe gang turns to see Azrael sitting at the bar.\n\n                                  AZRAEL\n\nAnd just to insure that, we're all going to sit tight, right here, until\nthe two idiots pass through that arch.\n\n                                    JAY\n\nHey...!\n\n                                  BETHANY\n\nHe wasn't talking about you two.\n\n                                 OC VOICE\n\nThere's only one idiot here, .Azrael...\n\nBethany and Rufus react, as does the very surprised Azrael. Serendipity\nstands in the doorway.\n\n                                SERENDIPITY\n\nAnd that's you.\n\n                                  AZRAEL\n\nThe Muse. Just in time to join us for a drink.\n\n                                 BARTENDER\n\n(suddenly noticing Azrael)\n\nHey. Where'd you come from?\n\n                                  AZRAEL\n\nNothingness. And that's where I'm returning to in approximately...\n\n(checks watch)\n\n...onehour.\n\n                                 BARTENDER\n\nAlright Plato - sounds like you've had enough drinks already. Let's go.\n\n                                  AZRAEL\n\nCome on Barkeep - just one drink for the road. Then I'm gone.\n\nSerendipity joins Bethany and Rufus. She whispers.\n\n                                SERENDIPITY\n\nI was trying to find you - to tell you I'd figured out who was behind all\nthis.\n\n                                   RUFUS\n\nIs that who I think it is?\n\n                                SERENDIPITY\n\nNone other than.\n\n                                  BETHANY\n\nWho is it?\n\n                                SERENDIPITY\n\nThat's my worst suspicions confirmed.\n\nThe Bartender relents.\n\n                                 BARTENDER\n\nAlright - one drink. Then you're gone.\n\n                                  AZRAEL\n\nGimme a Holy Bartender.\n\n                                 BARTENDER\n\nNever heard of it.\n\n                                  AZRAEL\n\n(to the group)\n\nHe doesn't know how to make a Holy Bartender.\n\nYou know - don't you, Muse?\n\n                                SERENDIPITY\n\nAzrael... don't.\n\n                                  AZRAEL\n\n(ignoring her)\n\nAnybody? Well - I know how to make a Holy Bartender.\n\nAzrael pulls an Uzi from his coat and blows a dozen holes in the Bartender.\nThe Stygian Triplets burst through the doors and everyone jumps to their\nfeet, with the exception of the Bartender, who dies.\n\n                                  AZRAEL\n\nGet it?\n\n                                SERENDIPITY\n\nSweet Jesus, Azrael - why?!?\n\n                                   RUFUS\n\n(rushing him)\n\nC'mon, demon - let's see you try that shit on a brother whose already dead!\n\nThe Stygian Triplets cross their sticks in front of Rufus to block him as\nAzrael trains his Uzi on Bethany.\n\n                                  AZRAEL\n\n(joining them)\n\nYou maintain that kind of an attitude and you and the barkeep won't be the\nonly corpses in the room -the Christ-Bitch will join you.\n\n                                SERENDIPITY\n\nI can't believe you're behind this. Are you really that stupid?! Do you\nknow what's going to happen if those two jerks enter that church?!\n\n                                  AZRAEL\n\nI'm actually counting on it. And if my calculations are correct, the pawns\nare moving in to check-mate as we speak.\n\nEveryone stares at Azrael, with the exception of Jay. He suddenly laughs.\n\n                                    JAY\n\nI get it! Holy Bartender! That's a good one!\n\nEXT SAINT MICHAEL'S CHURCH - MORNING\n\nA formidable crowd of parishoners surrounds a small stage, ten yards from\nthe front of the church. Banners hang every~ere, heralding 'Catholicism -\nWow!' as well as the Centennial of Saint Michael's. The media eats it up.\n\nCardinal Glick stands at the podium, all smiles. He's in mid-speech.\n\n                                   GLICK\n\nI'd also like to acknowledge this great state's Governor, Elizabeth Dalton,\nfor coming out an helping us ring in the first hundred years of this little\nparish True. she's a Protestant - but we won't hold that against her.\n\n(crowd laughs)\n\nNow, let me just give you a bit of history on this particular little\nhundred years young House of God...\n\n                                OC BARTLEBY\n\nThis is no longer God's House. God doesn't live here anymore.\n\nThe crowd turns, aghast. Bartleby pushes his way through them, sheepishly\nfollowed by Loki.\n\n                                 BARTLEBY\n\nHe's grown weary of your superficial faith and has turned a deaf ear to\nyour lip-service prayers. He is no longer amused, and has abandonned you -\nHis favorites - to the whim of judgement. Hypocrites and charlatans -\nprepare to taste God's wrath!\n\n                                   LOKI\n\n(whispering)\n\nMaybe we should just go.\n\n                                 BARTLEBY\n\nYou wanted your body count, you got it. This lot is rife with sin. We'll\njudge them all!\n\nGlick grabs a COP from the crowd and pushes him toward the pair.\n\n                                   CLICK\n\nThese are the two I was warned about, Officer McChee. Please assist them\noff the church grounds.\n\nThe Cop grabs Bartleby's arm.\n\n                                    COP\n\nAlright mouthpiece, let's leave the nice Cardinal alone and go for a\nride...\n\nBartleby grabs the cops hand on his shoulder.\n\n                                 BARTLEBY\n\nMister McGhee, don't make me angry. You wouldn't like me when I'm angry.\n\n                                    COP\n\nIs that so? Well, let's just...\n\nBartleby throws his other hand forward and twists the Cop's head around in\none brisk motion. Loki's eyes bug out. The crowd takes flight.\n\n                                 BARTLEBY\n\n(releasing dead Cop)\n\nLadies and Gentlemen - you have been judged as guilty of violations against\nour Almighty Lord. And this very day - I assure you - you will all pay for\nyour tresspasses... in blood.\n\n(to Loki)\n\nWings. Now.\n\n                                   LOKI\n\nI'm not so sure...\n\n                                 BARTLEBY\n\nDO IT!\n\nINT BAR - LATER\n\nAzrael still hosts his captive audience, uzi trained on the mortals. The\nStygian Triplets surround them, brandishing their sticks.\n\n                                  BETHANY\n\nYou're a muse too?\n\n                                SERENDIPITY\n\nFormer muse. He was kicked out.\n\n                                  AZRAEL\n\nTell them, Serendipity. Tell them how I was slighted by the Almighty.\n\n                                SERENDIPITY\n\nYou got what you deserved, you yellow shithead.\n\n                                  AZRAEL\n\nEver the apple polisher. I'd hoped that when you left Paradise, you did it\nfinally because you couldn't tolerate the injustice that was visited upon\nyour own brother.\n\n                                  BETHANY\n\nHe's your brother?!\n\n                                SERENDIPITY\n\nNot technically. We were created at the same time.\n\n                                  AZRAEL\n\nTo compliment one another. Two spirits of pure inspiration.\n\n                                 BARTLEBY\n\nSo what happened?\n\n                                  AZRAEL\n\nYes. What. Lucifer got restless and started his little war for the throne.\nHeaven became divided into two factions - the faithful and the renegades.\nThe ethereal planes were chaotic with battle, angel against angel. And when\nit was all over, Cod cast the rebels into perdition.\n\n                                SERENDIPITY\n\nBut Azrael refused to fight. He wouldn't ally himself to God or Lucifer. He\nremained in the middle, waiting to see who came out victorious.\n\n                                    JAY\n\nWhat are you - some kind of fucking chicken?!\n\n                                  AZRAEL\n\nI was an artist! I was inspiration! A muse has no place in battle! Our job\nis to create - not destroy!\n\n                                SERENDIPITY\n\nSo after the fallen were banished to Hell, God turned on those that\nwouldn't fight, and my brother here was sent down with the demons.\nSomething he considers a grave injustice.\n\n                                  AZRAEL\n\nDon't tell me that you never questioned the judgement, Serendipity; that\nyou don't think the Almighty acted too rashly?\n\n                                SERENDIPITY\n\nYou've been waiting for millions of years to ask me that, haven't you? It's\nbeen on your mind since the moment you fell. It's been gnawing at you this\nlong.\n\n                                  AZRAEL\n\nWell?\n\n                                SERENDIPITY\n\nNo, Azrael. It never bothered me, and I'll tell you why:\n\nyou stood behind your office, you prick. So you were an artist - big deal.\nElvis was an artist, but that didn't stop him from joining the service in\ntime of war. That's why he's the King... and you're a schmuck.\n\n                                  BETHANY\n\nSo all this is about revenge?! You're going to unmake existence because you\nhave a grudge against God?!\n\n                                  AZRAEL\n\nAfter the first million years, revenge was the farthest thing from my mind.\nSelf-preservation became the only necessity.\n\n                                   RUFUS\n\nMeaning?\n\n                                  AZRAEL\n\nEscape. Escape from Hell became my all-consuming reason. So I studied the\nreligions and waited for my opportunity to present itself; which flnallv\ndid. in the form of the plenary indulgence And while I couldn't exercise it\nmyself. I knew the perfect vessels through which I could free myself from\ntorment.\n\n                                   RUFUS\n\nBartleby and Loki.\n\n                                  AZRAEL\n\nAfter that, it was a simple matter or waiting for a church to celebrate\ntheir Centennial, and when that finally happened, applying some of the old\ninspiration tactics - bv sending the pair an article laced with ideas. An\nincantation I picked up in the Pit kept them cloaked and off Heaven's\nradars, and aside from the Triplets and the Gologothan, no soul in Hell had\na clue as to what was going on.\n\n(smiles)\n\nWon't proud Lucifer weep when he realizes I triumphed over the Power in a\nway he never dared or dreamed.\n\n(shakes it off)\n\nBut no plan, no matter how intricate, could succeed if the Almighty was in\nthe realm of the quick. So I dispatched Him in a fairly ingenious fashion.\n\n                                  BETHANY\n\nHow so?\n\n                                  AZRAEL\n\nOh no. I've seen way to many Bond movies to know that you never reveal all\nthe details of your plan - no matter how close you may think you are to\nsuccess. Suffice it to say, the Catholics have been even more helpful in\ninsuring my success than by just supplying the clean-slate archwav.\n\n(gets up)\n\nThe only X-Factor was the involvement of the Last Scion. I'm amazed that\nsomeone up there would have the balls to make a move without the Lord's\nsay-so. Believe me - I sweated when you stumbled upon my boys on that\ntrain. But alas, here you are - powerless to stop the inevitable.\n\n                                  BETHANY\n\nLook, asshole - I don't know if anyone explained the rules to you, but if\nyou succeed, everything gets blinked out of existence - even you.\n\n                                  AZRAEL\n\n(beat)\n\nHuman, have you ever been to Hell? I think not. Do you know that once Hell\nwas nothing more than the absence of Cod? And if you'd ever been in His\npresence. then you'd realize that's punishment enough. But then your kind\ncame along - and made it so much worse.\n\n                                  BETHANY\n\nHumans aren't capable of one hundredth the evil a shitbag demon like\nyourself is.\n\n                                  AZRAEL\n\nEvil is an abstract; it's a human construct. But true to his irresponsible\nnature. man won t own up to being the engineer of evil, so he blames his\ndark deeds on my ilk. But his selfishness is limitless, and it's not enough\nfor him to shadow his own existence. He turned Hell into a suffering Pitt -\nfire, wailing, darkness - the kind of place anyone would do anything to get\nout of. And why? Because he lacks the ability to forgive himself. It is\nbeyond your abilities to simply make recompense for and regret the sins you\ncommit. No - you choose rather to create a psychodrama and dwell in a\nfoundless belief that God could never forgive your 'grievous offenses'. So\nyou bring your guilt and inner-decay with you to Hell - where the horrid\nimaginations of so many gluttons-for-punishment give birth to the sickness\nthat has infected the abyss since the first one of your kind arrived there,\nbegging to be 'punished'. And in doing so, they've transformed the cold and\nsolitude to pain and misery. I've spent eons privy to the flames, inhaling\nthe decay, hearing the wail of the damned. I know what effect such horrors\nhave on the delicate psyche of an angelic beihg.\n\n(beat)\n\nWould you like to glimpse pain eternal? Look...\n\nAzrael places his hand over Bethany's eyes. For about ten seconds, we see\nsome of the most fucked up and disturbing imagery that can be crammed into\n240 frames of film.\n\nAzrael pulls his hand away. Bethany is fried, convulsing uncontrolably.\n\n                                  AZRAEL\n\nI'd rather not exist than go back to that. And if everyone has to go down\nwith me, so be it.\n\n                                SERENDIPITY\n\n(holding up Bethany)\n\nYou're still thinking only about yourself, you fuckmg child.\n\n                                  AZRAEL\n\nNow, now, now. Things are getting too tense in here. What say we watch a\nlittle t.v.\n\n(grabs remote control)\n\n                                    JAY\n\nPut on channel nine - 'Davey and Goliath'!\n\nA Stygian Triplet smacks him with it's hockey stick.\n\n                                    JAY\n\nHey!\n\n                                  AZRAEL\n\nI was thinking more along the lines of current events.\n\nOn the T.V. - a sweaty and panicked REPORTER barks into the camera,\nobscuring the chaos behind him. Screams are heard.\n\n                                 REPORTER\n\n...I repeat - men with huge fucking wings have laid waste to St.\nMichael's... Bullets don't seem to affect them... police who were on the\nscene are dead... The remaining crowd has dropped to their knees,\nidentifying this as the fabled Apocalypse.. I'm not a man of faith, but I'm\ninclined to agree with them..\n\n(looking OC)\n\nNO! DON'T COME ANY CLOSER!!\n\n(pulls gun)\n\nPLEASE!! Please...\n\nHe puts the gun in his mouth and fires. The screen goes blank.\n\n                                  AZRAEL\n\n(snapping off tv.)\n\nYou see that? And I told them to keep a low profile. I'd be pissed, but in\na couple of minutes, it won't matter anymore.\n\nWhile he speaks, Serendipity looks to Silent Bob. Silent Bob snaps to\nattention, and locks eyes with Serendipity. He looks to the golf club, then\nback at her. He nods.\n\nAzrael suddenly catches the exchange between the two.\n\n                                  AZRAEL\n\nNow what was that all about?\n\n                                SERENDIPITY\n\nHunhh? Oh. nothing. I had something in my eye.\n\n                                  AZRAEL\n\n(getting up)\n\nBullshit. What are you trying to do, Serendipity -get the guy killed? Now\nwho's the fucking child? What did you tell him - to hit me with the golf\nclub? Are you serious?\n\n(picks up golf club)\n\nI'm a fucking demon, and you'd have him assault me with athletic equipment?\n\n(hands club to Silent Bob)\n\nWell, here then - take it. Call it a gift.\n\n(stands back and hits his own chest)\n\nTake a shot - take your best shot. C'mon - c'mon, bright boy.\n\nThe Stygian Triplets snicker. Silent Bob stares at Azrael, perplexed.\n\n                                  AZRAEL\n\nDon't you know anything?\n\nSilent Bob looks to Serendipity. She nods. He shrugs and swings the club\nwith all his might into Azrael's chest - which caves in, blowing muck and\nshit everywhere.\n\nRufus, Jay, and Serendipity turn on their captors, grabbing the Stygian\nTriplets by the throats.\n\n                                SERENDIPITY\n\nBETHANY! BLESS THE SINK!\n\n                                  BETHANY\n\nWHAT?!?\n\n                                SERENDIPITY\n\nDO IT!\n\nBethany leaps over the bar, pushing over the dead bartender, and blesses\nthe melting-ice filled sink. Serendipity urges Rufus and Jay to follow her,\nwith the Triplets in hand. They submerge them - head first - in the sink.\nCruddy steam and muck blows out of the water. The Triplets convulse and\nfall still.\n\nAzrael clutches at his sucking chest wound, dropping to his knees. He grabs\nSilent Bob's leg. Silent Bob kicks him onto his back and out cold.\n\n                                    JAY\n\n(joining Silent Bob)\n\nWhat the fuck have you been eating?\n\nSilent Bob shrugs.\n\n                                  BETHANY\n\nWhat just happened?\n\n                                SERENDIPITY\n\n(collecting hockey sticks)\n\nHe said it himself - he's a demon. You hit a demon with an instrument of\nGod - the pure side's always going to do the most damage.\n\n                                    JAY\n\nSilent Bob's an instrument of God?!\n\n                                SERENDIPITY\n\nNo - but the driver is.\n\n                                  BETHANY\n\n(catching on)\n\nAnd Glick's the kind of asshole that would bless his own clubs for a better\ngame. And the sink...?\n\n                                SERENDIPITY\n\nYou've got that Divine heritage going for you - sanctifing is just one of\nthe fringe benefits.\n\n                                  BETHANY\n\nRemind me to try the water-to-wine thing at my next party.\n\n(to Jay)\n\nHow far away is this church?\n\n                                    JAY\n\nThree towns over - about five miles.\n\n                                  BETHANY\n\nWe've gotta make tracks, people - there isn't much time left. Rufus, grab\nhis gun.\n\n                                   RUFUS\n\nTen steps ahead of you.\n\n                                  BETHANY\n\n(going through dead bartender's pockets)\n\nWe can take the bartender's car - I don't think he'll be needing it\nanymore.\n\nBethany and Serendipity rush out.\n\n                                    JAY\n\nWe gonna make it?\n\n                                   RUFUS\n\nWas Jesus down?\n\nRufus and Jay exit. Silent Bob stares down at Azrael's body. Jay comes back\nand yanks him out the door.\n\nEXT STREET - DAY\n\nCardinal Click runs to a pay phone. Sweating and bloody, he looks a mess.\nHe presses '0' and looks around wildly - particularly skyward.\n\n                                   GLICK\n\n(to God)\n\nLook, if you didn't like the cereal thing, we could've gone in a different\ndirection!\n\n(to phone)\n\nOPERATOR! SEND MORE POLICE TO SAINT MICHAEL'S PARISH - NOW!! PEOPLE ARE\nGETTING KILLED BY...!\n\nAs he speaks, a large shadow falls over him from above. It grows larger,\nenveloping Click. He drops the receiver, drops to his knees, and screams.\n\nEXT SAINT MICHAEL'S - DAY\n\nBethany, Jay, Serendipity, Silent Bob, and Rufus stare OC, horrified.\n\n                                    JAY\n\nHoly shit.\n\nBodies, bodies everywhere - partial, whole, bloody - hanging, burning,\nupended. No one is left standing. It's a scene straight out of Hell.\nBethany buries her face in Rufus' chest.\n\n                                    JAY\n\nSee? And people wonder why I don't go to church.\n\n                                  BETHANY\n\nAre we too late?\n\n                                SERENDIPITY\n\nTo save these poor schmucks, yes. But we still exist.\n\n                                  BETHANY\n\nWhere are they?\n\n                                   RUFUS\n\nThey could already be in the church.\n\n                                SERENDIPITY\n\nWhich means that if they come out, nobody touches them.\n\n                                    JAY\n\nAre you shitting me? The brother here is going to shred them with his\nSchwarzenneger special - ain't you, homey?\n\n                                SERENDIPITY\n\nIf they've passed through that arch, they come out clean. And if they die,\nthey go straight up - and we know what happens then.\n\n                                    JAY\n\nWhat if they just kill themselves?\n\n                                  BETHANY\n\nThey can't - it's a mortal sin. You die with a mortal sin on your soul and\nyou burn. They'd go to hell, and that's not what they're after.\n\n                                    JAY\n\nSo then what the fuck are we supposed to do?! Just wait for a solution to\nfall out of the sky?!\n\nOn cue, a body plummets out of the sky and hits the ground before the\ngroup, quite like Rufus had, way back at the start. This body, however,\nbursts apart like a body would if dropped from a large height. Jay looks at\nRufus.\n\n                                    JAY\n\nFriend of your's?\n\n                                   RUFUS\n\n'fraid not.\n\n                                 OC VOICE\n\nIt was a Cardinal.\n\nThey all turn to see Loki, leaning against a body or two, drinking from a\nbottle of champagne. His wings lie beside him, filthy - blood spattered and\nashen. He looks exhausted. Rufus trains the gun on him.\n\n                                   LOKI\n\nKind of hard to tell with his face like that, but the Rosaries are a dead\ngiveaway.\n\n                                    JAY\n\n(goes for the Uzi)\n\nIT'S ONE OF THEM!! KILL IT!!!\n\n                                  BETHANY\n\n(struggling to stop him)\n\nNO...!\n\nShe slaps the Uzi out of Jay's grip. It clatters to the side.\n\n                                  BETHANY\n\n(to Jay)\n\nDon't you listen?! We can't touch them!\n\n                                    JAY\n\nI wasn't gonna touch him, I was gonna shoot him!\n\n                                   LOKI\n\n(looking skyward)\n\nHe's been at it for awhile now.\n\nIn the distance above - a mere shadow against the sky - something winged\nsoars and stops, releasing what looks like a very panicky human being.\n\n                                  OC LOKI\n\nWe ran out of parishoners, so he just started picking up anyone off the\nstreet. You're looking at eons of repression getting purged. If only we'd\nbeen able to jerk off.\n\nLoki drags himself a few feet backwards.\n\n                                   LOKI\n\nI'd step back if I were you.\n\nThey jump back just as the body hits the ground and explodes. Bethany\ncharges at Loki, grabs his lapels, and shakes him furiously.\n\n                                  BETHANY\n\nWHY?!? WHAT THE FUCK DO YOU HOPE TO PROVE?!? ALL THESE PEOPLE - WHY?!?\n\n                                    JAY\n\n(to Rufus)\n\nI thought we weren't supposed to touch them?\n\n                                   RUFUS\n\nI think our Bethan's about hit her ceiling.\n\nLoki slaps Bethany away, non-chalantly.\n\n                                   LOKI\n\nThis wasn't my idea. alright? I just wanted to go home.\n\n(takes a big champagne swig)\n\nWe both wanted to go home. But he snapped. When he realized who you were\nand what you'd have to do, he just lost it.\n\n(smiles)\n\nYou know what's funny about it? He never could stand to see me work. He\nsaid he always felt son~' for you people - that you didn't know any better.\n\n(looks up)\n\nNow look at him.\n\n                                    JAY\n\nThis guy's drunker than hell.\n\n                                SERENDIPITY\n\nWhich means he's human now - his wings have been cut off.\n\n(slapping Loki to sober him up)\n\nLoki! Loki!\n\n                                   LOKI\n\n(recognizing her)\n\nThe Muse. Haven't seen you in a long time. What's with the tits?\n\n                                SERENDIPITY\n\nLoki - have you walked through the arch yet? C'mon. tell me! Have you gone\nin and come out through the archway yet?!\n\n                                   VOICE\n\nNo.\n\nBartleby lands beside them, draping his wings at his sides, brushing\nhimself off.\n\n                                 BARTLEBY\n\nWe were awaiting your arrival.\n\n                                SERENDIPITY\n\nBartleby - listen to me! You can't go through with this! Azrael was just\nusing you! If you go back this way...\n\nBartleby slaps her down.\n\n                                 BARTLEBY\n\nI've become aware of the reprocussions, Muse. I know what I'm doing.\n\nBethany leaps at him, all fists and fury.\n\n                                  BETHANY\n\nYOU FUCK! YOU SICK, TWISTED FUCK!! LOOK WHAT YOU'VE DONE!! LOOK AT All\nyou've\n\ndone...!\n\nBartleby subdues her. He strokes her hair.\n\n                                 BARTLEBY\n\nBethany - you of all people should understand what I'm t~'ing to accomplish\nhere. You too have been abandonned. You know what it's like to be cast\naside. But while you've only felt the devastating effects for a few years,\nI've dealt with it for millenia. And while you never see your ex-husband or\nhow blissful he is with his new wife...\n\n(picks up her face and smiles at her)\n\nAnd he is...\n\n(drops her head)\n\n..seeing you people everywhere. everyday, trapped on this perfect little\nworld He created for you... it's a constant reminder that though my kind\ncame first, your kind was most revered. And your kind knows forgiveness,\nwhile my kind knows regret. A lesson must be taught. All are accountable...\neven God.\n\n(steps back)\n\nSoon a cadre of police will arrive, just in time to kill us as we exit the\nchurch. And then this failed experiment called existence will cease to be.\n\nLoki stumbles to his feet.\n\n                                   LOKI\n\nI can't... let you do this, Bartleby...\n\n(he sways as if drunk)\n\nI didn't know we... would end existence...\n\n                                 BARTLEBY\n\n(to Bethany)\n\nMy compatriot. Genocide takes a lot out of him. He's weakened. And more\nimportantly. he's now a human being. A condition that carries two\nliabilities: a conscience...\n\nBartleby pulls a knife and guts Loki. He stares at Bartleby as he dies,\nconfused and betrayed. Serendipity nods to Rufus and Silent Bob.\n\n                                 BARTLEBY\n\n..and a short life span.\n\n(in a whisper; to Loki)\n\nSorry, old friend - but you lost the faith.\n\nRufus and Serendipity and Silent Bob jump Bartleby and start throwing\npunches. Silent Bob bites his wing. Jay grabs Bethany and pulls her behind\na bush.\n\n                                  BETHANY\n\n(peering out from behind)\n\nHe's lost it! We're fucked! We're absolutely fucked!\n\n                                    JAY\n\n(pulling off clothes)\n\nI hear you.\n\n                                  BETHANY\n\nI can't believe this shit! We're on the brink of nonexistence and God's\nstill nowhere to be found! What the fuck kind of deity gets kidnapped?!\n\n                                    JAY\n\n(pulling open pants)\n\nAmen to that.\n\n                                  BETHANY\n\n(suddenly notices him)\n\nWhat the hell are you doing?!\n\n                                    JAY\n\nI'd say we've got about five minutes left to live; the whole world's going\nto end. You said you'd fuck me.\n\n                                  BETHANY\n\nAre you a complete lunatic?! Everyone's out there battling that thing and\nyou want to cower back here and jump my bones?! We have to go down\nfighting!\n\n                                    JAY\n\nNo - no time for that foreplay stuff, just sex.\n\n                                  BETHANY\n\nYou pig...!\n\n                                    JAY\n\nWhat?! It's all over; nobody's gonna beat that thing! Now we can either lay\nhere all comatose like that\n\nJohn Doe Jersey bastard behind us, or we can make with the love.\n\nBethany freezes.\n\n                                  BETHANY\n\n(finally!)\n\nWhat did you say?!\n\n                                    JAY\n\n'Make with the love'? I just said that to be sensitive. Usually I call it\nboning.\n\n                                  BETHANY\n\nNo - about John Doe Jersey?\n\n                                    JAY\n\nThat guy - the one that they won't take off life support - John Doe Jersey.\nThis is where he's at.\n\n                                  BETHANY\n\nWhat? Where?\n\n                                    JAY\n\nSaint Michael's hospital - over there.\n\n(points behind them)\n\nThere, across the street, sits a HOSPITAL.\n\n                                  BETHANY\n\n(thinks)\n\nWhere's the nearest boardwalk?\n\n                                    JAY\n\nLook, I ain't got time to win you a prize or something, we gotta get to it\nbefore...\n\n                                  BETHANY\n\nWHERE IS IT?!?\n\n                                    JAY\n\n(scared)\n\nAsbury Park. About five miles away.\n\n                                  BETHANY\n\nYou ever been there?!\n\n                                    JAY\n\n(really scared)\n\nOnce. I was banging this girl who worked at the carousel. She wanted to do\nit on the ride, but I got sick and started puking...\n\n                                  BETHANY\n\n(grabs his face)\n\nDO THEY HAVE SKEE-BALL THERE?!?\n\n                                    JAY\n\n(piss-scared; high pitched)\n\n...yes.\n\nBethany kisses Jay hard on the lips, jumps up and looks over the bush.\n\n                                    JAY\n\n(warming up)\n\nNow that's more like it.\n\nRufus and Serendipity battle Bartleby, his wings thrashing about. Silent\nBob is getting back on his feet.\n\n                                  BETHANY\n\nBOB!\n\nSilent Bob looks to Bethany. She waves him over and bends back down to Jay\nwho half-closes his eyes, and puckers his lips. Bethany pinches his lips\ntogether and raises jay to his feet, ust as Silent Bob arri\\'es.\n\n                                  BETHANY\n\n(to Jay)\n\nWhatever you do - stall Bartleby from going into that church!\n\n(to Silent Bob)\n\nBob - come with me!\n\n(they exit)\n\n               \n\n\n\nDogma\nWriters :   Kevin Smith\nGenres :   Comedy  Fantasy  Adventure\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Bartleby (Affleck) and Loki (Damon) are fallen angels, banished for eternity from Heaven to Wisconsin for insubordination after an inebriated Loki (with Bartleby's encouragement) resigned as the Angel of Death. When the trendy Cardinal Glick (Carlin) announces that he is rededicating his cathedral in Red Bank, New Jersey in the image of the \"Buddy Christ\", the angels see their salvation: Anyone entering the cathedral during the rededication festivities will receive a plenary indulgence; all punishment for sin will be remitted, permitting direct entry into Heaven. They receive encouragement from an unexpected source: Azrael (Lee), a demon, once a Muse, also banished from Heaven (for refusing to take sides in the battle between God and Lucifer); and the Stygian Triplets (Barret Hackney, Jared Pfennigwerth, and Kitao Sakurai), three teenage hoodlums who serve Azrael in Hell.\nBethany Sloane (Fiorentino)—a downhearted, infertile, divorced abortion clinic employee—attends a service at her church in Illinois. Donations are being solicited to help a hospitalized, comatose homeless man—known only as John Doe Jersey (Cort)—who was beaten senseless outside a skee ball arcade in New Jersey by the Triplets. Later that day, Metatron (Rickman)—the Voice of God—appears to Bethany in a pillar of fire and declares that she is the last relative of Jesus Christ. He explains that Bartleby and Loki cannot be allowed to succeed: By re-entering Heaven, they would be overruling the word of God, thereby disproving the fundamental concept of God's omnipotence, and nullifying all of existence. She, together with two prophets who will appear to her, must stop the angels and save the universe.\nNow a target, Bethany is attacked by the Triplets, and is rescued by the two foretold prophets—drug-dealing stoners named Jay and Silent Bob (Mewes and Smith). Azrael then summons a Golgothan (a vile creature made of human excrement) to find and kill Bethany, but Silent Bob immobilizes it with aerosol deodorant. Other allies in Bethany's mission are Rufus (Rock), the thirteenth apostle (never mentioned in the Bible, he says, because he is black), and Serendipity (Hayek), the fickle Muse of creative inspiration, now working in a strip club in search of inspiration of her own.\nOn a train to New Jersey, a drunken Bethany reveals her mission to Bartleby, who tries to kill her; a melee ensues, and Silent Bob throws the angels off the train. Bartleby and Loki now realize the potential consequences of their scheme; and while Loki wants no part of destroying all existence, Bartleby remains angry at God for his expulsion—and for granting free will to humans while demanding servitude of angels—and to Loki's horror, resolves to proceed.\nBethany and her allies discuss the situation: Who is really behind the angels' plan, and why has God not intervened? Metatron explains that God's whereabouts are unknown; he disappeared while visiting New Jersey in human form to play skee ball. At the cathedral, the group attempts in vain to persuade Cardinal Glick to cancel the celebration; Jay angrily steals Glick's golf club.\nAt a nearby bar, Azrael captures Bethany and her protectors and reveals that he is the mastermind behind the angels' plan—he would rather not exist at all than spend eternity in Hell. Silent Bob kills Azrael with Glick's blessed golf club. Serendipity tells Bethany to bless the bar sink, turning its contents to holy water, and Jay, Rufus and Serendipity drown the Triplets in it. Bartleby and Loki reach the cathedral; Bartleby kills all the celebrants, and when Loki attempts to stop him he tears off Loki's wings, making him mortal. When the protectors block Bartleby's entry into the church, Bartleby kills Loki and fights off Rufus, Serendipity and Bob, but as he flees, Jay shoots off his wings with a machine gun.\nDuring his latest of several attempts to seduce Bethany, Jay mentions John Doe Jersey. Realizing that the homeless man is the mortal form that God assumed, Bethany and Bob race to the hospital. Bethany disconnects John Doe's life support, liberating God, but killing herself. As Bartleby again attempts to enter the cathedral, God manifests before him as a woman (Morissette), and kills him with the power of her voice. When Bob arrives with Bethany's lifeless body, God resurrects her and conceives a child within her womb. God, Metatron, Rufus, and Serendipity return to Heaven, leaving Bethany and the two prophets to reflect on what has happened."}