{"title": "Dune", "full_text": "DUNE\n\n                                        SEVENTH DRAFT\n\n                                        DAVID LYNCH\n                                        December 9, 1983\n--\n1.   ARRAKIS - A SCENE FROM SPACE\n\n     Also known as DUNE, home of the Fremen, former\n     Zenzunni wanderers.\n\n1A.  INT. ROCK LEDGE - SIETCH TABR - NIGHT\n\n     BLACK\n\n     FADE IN to the dark eyes of the mysterious face of\n     the REVEREND MOTHER RAMALLO, who sits against smooth\n     black rock. Her eyes are deep blue-within-blue and\n     her skin is a haunting translucent white. Her voice\n     ECHOES as if in a great cavern.\n\n                 REVEREND MOTHER RAMALLO\n               We are the secret of the Universe.\n\n           RESPONSE OF TWENTY THOUSAND VOICES\n               Bi-la kaifa.\n\n                 REVEREND MOTHER RAMALLO\n               We are the secret of the Universe. We know\n               of spice...the spice called melange...the\n               greatest treasure in the Universe. It\n               exists on only one planet - ours Arrakis,\n               Dune. We know of spice and the Bene\n               Gesserit sisterhood's selective breeding\n               plan of ninety generations to produce the\n               Kwisatz Haderach, the one the spice will\n               awaken.\n\n           RESPONSE OF TWENTY THOUSAND VOICES\n               Bi-la kaifa.\n\n                 REVEREND MOTHER RAMALLO\n               And now the prophecy...\n\n     Silence...then a powerful low organ NOTE resounding\n     in the cavernous space.\n\n            REVEREND MOTHER RAMALLO (CONT'D)\n               He will come...the voice from the outer\n               world, bringing the holy war, the Jihad,\n               which will cleanse the Universe and bring\n               us out of darkness. He will have been born\n               of a Bene Gesserit mother.\n--\n     The Reverend Mother continues speaking of the\n     Prophecy, but we do not hear it. The huge wind organ\n     BLOWS louder and louder, obscuring her voice.\n\n     The picture FADES.\n\n1B.  KAITAIN - A SCENE FROM SPACE\n\n     Home planet of House Corrino and Shadam IV, Emperor\n     of the known universe.\n\n2.   INT. DROP - NIGHT\n\n     FADE IN to:\n\n     ...interior of one drop of water. The image changes\n     subtly.\n\n2A.  EXT. - DROP - NIGHT\n\n     PULL BACK to a shot revealing the outside of the\n     drop. There is a distant ROARING and within the drop\n     we can see the distorted image of a space ship\n     landing on a sophisticated landing field.\n\n3.   (Deleted)\n\n3A. EXT. LANDING FIELD - EMPEROR'S PALACE - NIGHT\n\n     On the dark landing field, chemicals spill out of\n     the ship in troughs and tank-suited Guildsmen begin\n     to swarm out of a hatch opening.\n\n4. through 6.  (Deleted)\n\n7.   INT. THRONE ROOM - EMPEROR'S PALACE - NIGHT\n\n     The EMPEROR is surrounded by crowds of COURTIERS in\n     his Throne Room.\n\n     Suddenly a GUARD enters from a small door and\n     quickly crosses to ANOTHER GUARD. A warning SOUND\n     begins. The Emperor turns nervously. Guards quickly\n     begin to clear the large room. Several women are\n     rushed toward us to a door beyond. One of the woman,\n     IRULAN, stops and turns back for a worried, caring\n     look to her father, the Emperor.\n\n                         IRULAN\n               Father.\n--\n                         EMPEROR\n               Irulan.\n\n     She sees that SARDAUKAR OFFICERS are surrounding him\n     now, speaking to him. Irulan turns and leaves. The\n     Emperor moves away from his officers to the center\n     of the now-empty room. He drops his golden robe from\n     his shoulders. He stands in his elegant black\n     uniform, thinking.\n\n     The Reverend Mother is ushered in and the Sardaukar\n     Officers leave her alone with the Emperor.\n\n                         EMPEROR\n                    (quickly)\n               A Third Stage Guild Navigator will be here\n               within minutes!\n\n                     REVEREND MOTHER\n               We felt his presence.\n\n                         EMPEROR\n               I shall want telepathy during his visit\n               and a report when we're finished.\n\n                     REVEREND MOTHER\n               Their minds are so.... They move in\n               strange directions....\n\n                         EMPEROR\n               Yes?\n\n                     REVEREND MOTHER\n               Forced spice evolution of humans changes\n               many things.... I must sit close to him.\n\n                         EMPEROR\n               He will not permit anyone but me to see\n               him. You must be outside this room.... Do\n               what you can.\n\n                     REVEREND MOTHER\n               I am your Truthsayer, my lord...\n                    (sensing something outside the room)\n               He is here, my lord.\n\n     Under the carved inscription \"Law is the Ultimate\n     Science\", the doors to the Emperor's chambers slide\n     open and FIFTY GUILDSMEN wheel in a forty-foot long\n     giant black box. One of the Guildsmen addresses the\n     Emperor through a translating device.\n\n                   TANKED GUILDSMEN #1\n               The Bene Gesserit witch must leave.\n--\n     The Emperor looks to the Reverend Mother.\n\n                         EMPEROR\n               Leave us.\n\n                     REVEREND MOTHER\n               Yes, my Lord.\n\n                         EMPEROR\n                    (after she has gone)\n               We are alone...\n\n8.   INT. HALLWAY - EMPEROR'S PALACE - NIGHT\n\n     The Reverend Mother enters through doors and takes a\n     seat on a chair just outside the door. She closes\n     her eyes.\n\n9.   INT. THRONE ROOM - EMPEROR'S PALACE - NIGHT\n\n     Inside the Emperor's chamber, the TANK-SUITED\n     GUILDSMEN are arranging themselves in a \"V\"\n     formation around the box. Suddenly the box opens,\n     slowly and beautifully revealing a huge, thick glass\n     tank. Inside the tank floats a THIRD STAGE NAVIGATOR\n     twenty feet long, much like a cross between a pasty,\n     pale human being and a fleshy grasshopper.\n\n     The tank is filled with swirling orange spice-gas,\n     and Guildsmen continuously vacuum up the toxic\n     chemical spills dripping from under the tank.\n     Suddenly the Guild Navigator swims towards the\n     Emperor. His head is enormous and fleshy, like a\n     huge grasshopper head -- the eyes are totally deep\n     blue. His voice is a high, fleshy whispering and an\n     intricate electrical apparatus in the front of the\n     tank translates into English and broadcasts it into\n     the room.\n\n                        NAVIGATOR\n               We have just folded space from Ix...\n\n                         EMPEROR\n                    (extremely nervous)\n               Yes?... How was your journey?\n\n                        NAVIGATOR\n                    (after a long pause)\n               Many machines on Ix... new machines.\n\n                         EMPEROR\n               Oh yes?\n--\n                        NAVIGATOR\n               Better than those on Richesse.. You are\n               transparent... I see many things... I see\n               plans within plans.\n\n                         EMPEROR\n               Is there a problem?... Usually there is a\n               problem when one of you makes a visit.\n\n     No answer.\n\n                        NAVIGATOR\n                    (finally)\n               The answer is within the problem...\n\n10.  INT. HALLWAY - EMPEROR'S PALACE - NIGHT\n\n     Outside the Emperor's chamber the Reverend Mother\n     sits, her eyes closed, straining.\n\n11.  INT. THRONE ROOM - EMPEROR'S PALACE - REVEREND\nMOTHER'S MENTAL IMAGE - NIGHT\n\n     A very blurred scene of the Emperor with the Guild\n     Navigator. She is not getting the English version\n     but a much different language version which is\n     fascinating to listen to. A lilting, sing-song\n     monologue.\n\n12.  INT. THRONE ROOM - EMPEROR'S PALACE - NIGHT\n\n                        NAVIGATOR\n               I see two Great Houses -- House Atreides,\n               House Harkonnen -- feuding... I see you\n               behind it.\n\n                         EMPEROR\n               Yes.\n\n     The Navigator breathes the spice-gas heavily and\n     swishes gently in his tank.\n\n                        NAVIGATOR\n               You must share with us.\n--\n                         EMPEROR\n               The Atreides house is building a secret\n               army!... using a technique unknown to\n               us... a technique involving sound. The\n               Duke is becoming more popular in the\n               Landsraad... he could threaten me.... I\n               have ordered House Atreides to occupy\n               Arrakis to mine the spice... thus\n               replacing their enemies the Harkonnens....\n               House Atreides will not refuse because of\n               the tremendous power they think they will\n               gain. Then, at an appointed time Baron\n               Harkonnen will return to Arrakis and\n               launch a sneak attack on House Atreides...\n               I have promised the Baron five legions of\n               my Sardaukar terror troops.\n\n                        NAVIGATOR\n               So the Harkonnens will rid you of House\n               Atreides...\n\n                         EMPEROR\n               Yes.\n\n13.  INT. HALLWAY - EMPEROR'S PALACE - NIGHT\n\n     Outside, the Reverend Mother is seeing the scene\n     mentally. She suddenly sees and flinches.\n\n14.  INT. THRONE ROOM - EMPEROR'S PALACE - REVEREND\nMOTHER'S MENTAL IMAGE - NIGHT\n\n     The Guild Navigator turns toward her and comes very\n     close to her. We hear the Navigator speak to her.\n\n                        NAVIGATOR\n                    (to Reverend Mother, mentally)\n               Reverend Mother... I will give you the\n               Tleilaxu Path.\n\n                 REVEREND MOTHER (V.O.)\n                    (an excited whisper)\n               A chance for escape? But for whom?\n\n15.  INT. THRONE ROOM - EMPEROR'S PALACE - NIGHT\n\n                         EMPEROR\n               Can you hear me?... If this visit has\n               anything to do with spice...\n--\n     The Guild Navigator shudders and swishes quite\n     violently in his tank.\n\n                        NAVIGATOR\n               LISTEN TO ME!! The spice must flow... the\n               spice has given me accelerated evolution\n               for four thousand years... it has enabled\n               you to live two hundred years... the spice\n               helps make the sapho juice, which gives\n               the red-lipped mentats the ability to be\n               living computers... the secret side of\n               spice... the water of life.\n\n16.  INT. HALLWAY - EMPEROR'S PALACE  - NIGHT\n\n                 REVEREND MOTHER (V.O.)\n               He shouldn't speak of this...\n\n15.  BACK TO SCENE\n\n                        NAVIGATOR\n               ...gives the Bene Gesserit sisterhood the\n               metaphysical ability to see beyond...to\n               have superior powers... Our power to fold\n               space is in the spice... Without us, your\n               empire would be lost on isolated scattered\n               planets... You would be lost.\n\n                         EMPEROR\n               I can assure you...\n\n                        NAVIGATOR\n               Do not interrupt!!! Do not speak lightly\n               of the spice... ONE SMALL POINT...\n\n16.  BACK TO SCENE\n\n                 REVEREND MOTHER (V.O.)\n               Here it comes...\n\n17.  INT. THRONE ROOM - EMPEROR'S PALACE - NIGHT\n\n                        NAVIGATOR\n               We ourselves... foresee a slight problem\n               within House Atreides.... Paul.... Paul\n               Atreides.\n\n                         EMPEROR\n               You mean, of course, Duke Leto Atreides...\n               his father.\n--\nPage missing\n--\n24.  EXT. CASTLE CALADAN - NIGHT\n\n     High on the rock cliff stands Castle Caladan, Its\n     appearance us dark and medieval. There is a window\n     on the seaward wall lit from within...\n\n25.  INT. TRAINING ROOM - CASTLE CALADAN - NIGHT\n\n     ...by a drifting glowglobe. Paul sits at an L-shaped\n     table studying filmbooks and maps of Arrakis and the\n     Universe.\n\n25A. INSERT - FILMBOOK\n\n     We SEE vast star fields and galaxies.\n\n25.  BACK TO SCENE\n\n                          PAUL\n                    (whispering)\n               Here we are now... nineteen light years\n               beyond...\n\n25A. INSERT - FILMBOOK\n\n     We SEE the galaxies move as we HEAR a HUM.\n\n                       PAUL (V.O.)\n                    (whispering)\n               ... beyond Epsilon Alangue... is Arrakis.\n\n     We HOLD on this, then we see Arrakis grow larger in\n     the filmbook screen and we SEE it is a planet of\n     vast deserts.\n\n25.  BACK TO SCENE\n\n                          PAUL\n                    (whispering again)\n               It does look dry....\n\n25A. INSERT - FILMBOOK\n\n     The picture grows larger again, and we see the\n     Arrakeen Valley.\n--\n                     FILMBOOK (V.O.)\n               Each day the palms along the outer wall of\n               the Palace at Arrakeen consume enough\n               water to sustain the lives of one hundred\n               men. The palms were placed by the\n               Harkonnens to flaunt their water wealth in\n               front of the city Fremen.\n\n25.  BACK TO SCENE\n\n                          PAUL\n               Where are the Harkonnens from here?\n\n25A. INSERT - FILMBOOK\n\n     The star fields and galaxies move slightly then.\n\n                       PAUL (V.O.)\n                    (whispering)\n               There!... Geidi Prime and the Baron\n               Harkonnen... the enemy.\n\n25.  BACK TO SCENE\n\n     In the background, FOOTSTEPS grow louder, pounding\n     on thick wooden floors. THUFIR HAWAT, GURNEY HALLECK\n     and DR. YUEH enter. Paul has his back to the door.\n     Thufir suddenly looks perturbed when he notices\n     this.\n\n                          PAUL\n                    (without turning)\n               I know, Thufir, I'm sitting with my back\n               to the door.\n\n     Hawat suppresses a smile.\n\n                      PAUL (CONT'D)\n               I heard you, Dr. Yueh and Gurney coming\n               down the hall.\n\n                         THUFIR\n               Those sounds could be imitated.\n\n                          PAUL\n               I'd know the difference.\n\n     Paul rises and turns to face them.\n--\n                         THUFIR\n                    (inner voice)\n               Yes. Perhaps he would at that.\n\n                          PAUL\n               My father sent you to test me. Music then?\n\n     Thufir scowls.\n\n                         GURNEY\n               No music. I'm packing this for the\n               crossing. Shield practice.\n\n                          PAUL\n               Shield practice? Gurney... we had practice\n               -- this morning..... I'm not in the mood.\n\n                         GURNEY\n                    (angered)\n               Not in the mood?! Mood's a thing for\n               cattle and love play... not fighting.\n\n                          PAUL\n               I'm sorry Gurney.\n\n                         GURNEY\n               Not sorry enough.\n\n     Gurney draws his knife.\n\n25B. SHIELD EFFECT - THE FIGHT\n\n     Gurney activates his body shield, sending a\n     shimmering FORCE FIELD around his body. He advances\n     swiftly toward Paul. Paul snaps on his FORCE FIELD,\n     draws his knife and jumps back, collecting himself\n     hurriedly for the fight.\n\n                         GURNEY\n                    (his voice sounding strange through\n                    the forcefield)\n               Guard yourself for true!\n\n     Gurney leaps high, then forward, pressing a furious\n     attack. Paul falls back. The shield edges CRACK\n     loudly as they touch each other.\n\n                          PAUL\n                    (inner voice)\n               What's gotten into Gurney? He's not\n               faking.\n     Paul presses forward and the fight moves quickly\n     around the room. The smell of ozone grows stronger\n     as the shields hit and SPARK off one another. Paul\n     directs a parry downwards, turns, and leads Gurney\n     against the table, plunging at just the right moment\n     to pin Gurney against the table top with his blade\n     right at Gurney's neck.\n\n                          PAUL\n                    (strange shielded voice)\n               Is this what you seek?\n\n                         GURNEY\n                    (strange shielded voice)\n               Good... the slow blade penetrates the\n               shield... but look down.\n\n     Paul looks and sees Gurney's blade at his groin.\n\n                     GURNEY (CONT'D)\n               We'd have joined each other in death.\n               However, you did seem to finally get the\n               \"mood\".\n\n                          PAUL\n               Would you really have drawn my blood?\n\n                         GURNEY\n               If you'd fought one whit below your\n               abilities I'd have scratched you a good\n               one.\n\n     Paul stands and snaps off his shield as does Gurney.\n\n25.  BACK TO SCENE\n\n                          PAUL\n               Things have been so serious here lately.\n\n                         GURNEY\n               Yes. I sensed the play in you lad, but\n               this can no longer be play. Tomorrow we\n               leave for Arrakis! Arrakis is real. The\n               Harkonnens are real.\n\n     Thufir, Yueh, Gurney and Paul stare at each other\n     for a moment in silence. Dr. Yueh moves forward and\n     begins to take Paul's pulse rate and to collect\n     other data with a small black machine.\n\n                          PAUL\n               Dr. Yueh, do you have any information on\n               the worms of Arrakis?\n--\n                        DR. YUEH\n               I have obtained a filmbook on a small\n               specimen... only 125 meters long.\n\n                          PAUL\n               Only?!\n\n     They smile at each other.\n\n                        DR. YUEH\n               There are have been documented sightings\n               of worms as large as 450 meters in the\n               deep desert -- far from where we'll be in\n               Arakeen.... The desert belt and the south\n               polar regions are marked forbidden....\n               Why?\n\n                          PAUL\n               The storms and the worms. Is it true, that\n               the sand can blow at seven hundred\n               kilometers per hour?\n\n                          YUEH\n               It can render flesh to dust in minutes.\n               And these dry winds can generate\n               tremendous static electricity in the\n               atmosphere. Our body shields won't have\n               enough power to operate in the open air on\n               Arrakis.\n\n                          PAUL\n               Well, how do the Fremen survive there?\n\n                          YUEH\n               We don't know much about the Fremen...\n               They live in the deep desert... some of\n               them in the cities and they have blue-\n               within-blue eyes...\n\n                          PAUL\n                    (smiling)\n               The eyes -- yes, yes... saturation of the\n               blood by the spice -- melange. Could the\n               spice affect us in other ways?\n\n                         THUFIR\n               Many dangers exist on Arrakis. For one, we\n               know the Harkonnens would not have given\n               up their CHOAM company contract so easily.\n\n                          PAUL\n                    (rising)\n               The Harkonnens are our enemies, yes... but\n               behind them, I suspect, is the Emperor.\n--\n                         THUFIR\n               You will make a formidable Duke!\n\n     Paul bows.\n\n                     THUFIR (CONT'D)\n               Now remember... the first step in avoiding\n               a trap is knowing of its existence.\n\n                          PAUL\n               I know.  But if it is a trap then why are\n               we going?\n\n                         THUFIR\n               We have our new army.\n                    (in the same breath)\n               Dr. Yueh, put the weirding module on him.\n\n     Thufir, noticing a SQUAD OF GUARDS at the other end\n     of the training room, calls out to them.\n\n                     THUFIR (CONT'D)\n               Clear and lock the room.\n\n     Gurney activates a series of locks.  LIGHTS GLOWS\n     above each doorway.\n\n                     THUFIR (CONT'D)\n               Activate a fighter.\n\n25C. ROBOT FIGHT\n\n     Suddenly a FIGHTER ROBOT lowers from the ceiling.\n     As the robot begins to rotate and go through several\n     frightening, complicated movements, Dr. Yueh places\n     a plastic device around Paul's neck.  He tightens it\n     around the Adam's apple above Paul's voice box.\n     Paul turns and emits a very strange, powerful sound\n     through the weirding module as he rushes towards the\n     robot.\n\n                         GURNEY\n                    (to Yueh)\n               Precise control....\n\n26.  INT. HALLWAY - CASTLE CALADAN - NIGHT\n\n     The hallway is empty in the foreground but in the\n     distance a changing of the guard is seen.\n--\n26A. through 26B.   (Deleted)\n\n27.  INT. HALLWAY - CASTLE CALADAN - NIGHT\n\n     Paul walks down the stairway.  In the distance,\n     moving troops are packing Atreides belongings.\n     Beyond, Paul sees some troops carrying a large\n     bull's head.  The horns are covered with dried\n     blood.\n\n                          PAUL\n               The bull that killed my grandfather... is\n               this an evil omen?\n\n     Suddenly, DUNCAN IDAHO appears from behind the giant\n     black head.\n\n                          PAUL\n                    (happily)\n               Duncan!\n\n                         DUNCAN\n               Paul.\n                    (they shake hands)\n               I was on my way to say goodbye to you.  I\n               have to go on ahead.\n\n                          PAUL\n               Why?  I wish you were coming with us.\n\n                         DUNCAN\n               It's something for your father.  He wants\n               to talk to you.\n                    (places hand on Paul's chest)\n               I'll see you in Arrakis.  May the hand of\n               God be with you.\n\n                          PAUL\n               May the hand of God be with us all,\n               Duncan.\n\n28.  EXT. CLIFF WALL - CASTLE CALADAN - NIGHT\n\n     Paul walks to meet his father near the wall.\n\n                          PAUL\n                    (diffident)\n               Father.\n\n                        DUKE LETO\n               Thank you for joining me, Paul.\n                    (voice tired)\n               It will be good to get to our new home and\n               have all this upset behind us.\n--\n28A. (Deleted)\n\n28B. DUKE LETO AND PAUL AGAINST SEA\n\n     They look out over the sea.  A huge wave crashes\n     below.\n\n     The Duke turns to Paul.\n\n                   DUKE LETO (CONT'D)\n                    (inner voice)\n               My son.\n                    (out loud)\n               Thufir Hawat has served House Atreides\n               three generations....  He swears you are\n               the finest student he's ever taught.\n               Yueh, Gurney and Duncan say the same....\n               It makes me feel very proud...\n\n                          PAUL\n               I want you to be proud of me.\n\n     Paul smiles up at his father.  The WIND blows the\n     Duke's hair and behind him stands the castle and the\n     green and black Atreides banner against the night\n     sky beyond.  The RAIN starts again -- lightly.  Paul\n     takes a closer look at the Atreides banner moving in\n     the wind.\n\n                        DUKE LETO\n                    (studying the dark sea below)\n               I'll miss the sea... but a person needs\n               new experiences... they jar something deep\n               inside, allowing him to grow.  Without\n               change, something sleeps inside us... and\n               seldom awakens... The sleeper must awaken.\n\n     Paul's attention goes to his father's hand where he\n     sees the Duke's signet ring.  Again he smiles at his\n     father.\n\n                                                FADE TO:\n\n29. through 29A.    (Deleted)\n\n30.  INT. PAUL'S ROOM - CASTLE CALADAN - NIGHT\n\n     Paul is sweating during his sleep and WHISPERS as if\n     struggling with some disturbing thought.\n--\n                          PAUL\n               Arrakis... Dune... Desert\n               Planet...Arrakis... Desert Planet...\n               moving... moving.\n\n31.  DARK WATER - MENTAL IMAGE\n\n     We see Paul's dream. It is very dark.\n\n                       PAUL (V.O.)\n               Arrakis... Dune... Desert Planet.\n\n     Suddenly a drop falls into the black, and white hot\n     widening rings appear on the dark water's surface.\n\n     Darkness again. Two moons rise in the darkness. As\n     the second appears:\n\n                          VOICE\n               The second moon, your moon...\n\n31A. INT. RESERVOIR - SIETCH TABR - NIGHT\n\n     Dark again. A figure turns toward Paul. It is a\n     BEAUTIFUL GIRL in deep shadow. She speaks.\n\n                     BEAUTIFUL GIRL\n               Tell me of your homeworld, Usul.\n\n32.  INT. PAUL'S ROOM - CASTLE CALADAN - NIGHT\n\n     CU Paul's face in fitful sleep.\n\n33.  EXT. COURTYARD - CASTLE CALADAN - NIGHT\n\n     In a small stone courtyard, the back-lit figure of a\n     woman moves towards us through the heavy RAIN and\n     darkness. As she nears us, the large, protective\n     glowglobe overtakes her and in an instant we see a\n     beautiful woman -- JESSICA.\n\n                         JESSICA\n                    (inner voice)\n               I  know she has come to test him... no man\n               has ever been tested with the box... only\n               Bene Gesserit women. I may lose my son.\n\n     The doors open, she meets the Reverend Mother Gaius\n     Helen Mohiam (the Emperor's truthsayer) and takes\n     her back toward the Castle. The rain rushes loudly\n     into the storm drains.\n--\n34.  INT. PAUL'S ROOM - CASTLE CALADAN - NIGHT\n\n                          PAUL\n                    (whispering again)\n               Arrakis... Dune... Desert planet...\n               moving... moving.\n\n     CU Paul's face.\n\n     Paul's eyes snap open. He hears footsteps outside\n     his door. As the door opens he closes his eyes,\n     however, and he pretends to be asleep. Jessica and\n     the Reverend Mother enter and stand in the doorway\n     looking at him.\n\n                     REVEREND MOTHER\n               We'll salvage what we can... but I can\n               tell you.. dear God... for the father...\n               nothing.\n\n     Jessica turns to the Reverend Mother, stunned! She\n     turns back to look at Paul. Her hands tremble.\n\n                REVEREND MOTHER (CONT'D)\n               Did you really think that you could bear\n               the Kwisatz Haderach?... How dare you!\n\n                     REVEREND MOTHER\n               My greatest student... and my greatest\n               disappointment.... He's awake!... He's\n               listening to us.\n                    (considering)\n               Good... Ready yourself, young Paul\n               Atreides... I want to see you in your\n               mother's chamber in one quarter of an\n               hour.\n\n     She turns and walks away. Jessica remains at the\n     door and calls out to Paul in the darkness.\n\n                         JESSICA\n               Paul?... This is very important...\n\n     Jessica leaves, closing the door behind her. Paul\n     sits up in bed.\n\n                          PAUL\n               Kwisatz Haderach?... For the father...\n               nothing?\n\n35.  INT. JESSICA'S CHAMBER - CASTLE CALADAN - NIGHT\n\n     Jessica and the Reverend Mother enter. It is quite\n     dark. Jessica WHISPERS a code number and a glowglobe\n     LIGHTS on a very dim setting.\n--\n                     REVEREND MOTHER\n                    (angrily)\n               Jessica... You were told to bear only\n               daughters to the Atreides... Jessica!\n\n                         JESSICA\n               It meant so much to him...\n\n                     REVEREND MOTHER\n               You thought only of a Duke's desire for a\n               son?... Desires don't figure in this! An\n               Atreides daughter could have been wed to a\n               Harkonnen heir and sealed the breach. We\n               may lose both blood lines now.\n\n                         JESSICA\n               I vowed never to regret my decision. I'll\n               pay for my own mistakes.\n\n                     REVEREND MOTHER\n               And your son will pay with you.\n\n42.  INT. DUKE LETO'S QUARTERS - CASTLE CALADAN - NIGHT\n\n     Under a dim glowglobe, the DUKE is writing a note on\n     a scroll-like piece of paper.\n\n     Finishing reading, the Duke seals the message in a\n     cylinder and presses his signet ring, with a red\n     hawk symbol of House of Atreides, into a hole, which\n     seals the cylinder with a swift HISSING.\n\n     He pauses, studying the metal tube. With a VOICE\n     COMMAND, he extinguishes the glowglobe above him. He\n     leans back in his chair as lightning flashes outside\n     the window.\n\n     FADE TO:\n\n35.  BACK TO SCENE\n\n     Paul enters the room and Jessica closes the door\n     behind them.\n\n                         JESSICA\n               Paul, this is the Reverend Mother Gaius\n               Helen Mohiam. She is going to... observe\n               you...\n                    (to Reverend Mother)\n               Please...\n--\n                     REVEREND MOTHER\n               Jessica, you know it must be done. I\n               enjoin you to stand guard at the door and\n               practice the meditation of peace.\n\n                         JESSICA\n               Your Reverence.\n\n                          PAUL\n                    (inner voice)\n               What does she fear?\n                    (out loud)\n               What about my Father?\n\n                         JESSICA\n               Paul... please, Paul... listen to the\n               Reverend Mother and do what she tells you.\n\n     Jessica leaves the room. The Reverend Mother speaks\n     to Paul using The Voice, a Bene Gesserit training\n     which permits an adept to control others merely by\n     selected tone shadings of the voice. It sounds as if\n     two people are talking -- one normal and the other\n     gutteral and slightly electronic. The effect is\n     strange, yet subtle.\n\n                     REVEREND MOTHER\n                    (using The Voice)\n               Now you come here.\n\n     Paul finds he cannot help but obey her, yet he\n     fights her controlling him.\n\n                          PAUL\n                    (inner voice)\n               She's using The Voice.\n                    (out loud)\n               No.\n\n     She sees him struggling.\n\n                     REVEREND MOTHER\n                    (inner voice)\n               Some strength there. Surprising!\n                    (out loud)\n               Come here.\n\n     The Reverend Mother holds up a green metal cube.\n\n                REVEREND MOTHER (CONT'D)\n               See this... Put your right hand in the\n               box.\n\n     Paul stares at the hole in the box.\n--\n                          PAUL\n               What's in the box?\n\n                     REVEREND MOTHER\n               Pain.\n\n     Just then, she raises one hand to his neck. Paul\n     sees a glint of metal. He tries to back away.\n\n                REVEREND MOTHER (CONT'D)\n                    (The Voice)\n               STOP! Put your hand in the box.\n\n     Paul's hand goes in. Fear passes over his face.\n\n                          PAUL\n                    (inner voice)\n               The Voice again.\n\n                     REVEREND MOTHER\n               I hold at your neck the gom jabbar. Don't\n               pull away or you'll feel that poison. A\n               Duke's son must know about many poisons --\n               this one kills only animals.\n\n                          PAUL\n               Are you suggesting a Duke's son is an\n               animal?\n\n                     REVEREND MOTHER\n               Let us say I suggest you may be human.\n               Your awareness may be powerful enough to\n               control your instincts. Your instincts\n               will be to remove your hand from the box.\n               If you do so you will die. You will feel\n               an itching -- there... see? Now the\n               itching becomes burning... heat, upon\n               heat, upon heat.\n\n                          PAUL\n                    (whispering)\n               It burns.\n\n                     REVEREND MOTHER\n               SILENCE... SILENCE.\n\n                          PAUL\n                    (inner voice)(struggling to compose\n                    himself)\n               I must not fear. Fear is the mind-killer.\n               Fear is the little death that brings total\n               obliteration. I will face my fear... I\n               will permit it to pass over me and through\n               me.\n--\n     The Reverend Mother moves her face up to his. Her\n     ancient face with its metal teeth gleaming inches\n     away breathes hotly. She is smiling.\n\n                     REVEREND MOTHER\n               You feel the flesh crisping?\n\n36.  THE HAND - PAUL'S MENTAL IMAGE\n\n     Paul's inner mind sees his hand on fire with all\n     sorts of sores. The skin is bubbling.\n\n37.  INT. JESSICA'S CHAMBER - CASTLE CALADAN - NIGHT\n\n                     REVEREND MOTHER\n               Flesh dropping off.\n\n38.  THE HAND - PAUL'S MENTAL IMAGE\n\n     He pictures this. The destruction of his hand is\n     complete -- now only blood spurts out and burns.\n\n39.  INT. JESSICA'S CHAMBER - CASTLE CALADAN - NIGHT\n\n     Paul's face registers extreme pain.\n\n                          PAUL\n                    (cannot help the explosion)\n               THE PAIN!\n\n                     REVEREND MOTHER\n               NO!! ENOUGH!! Kull wahad! No woman child\n               ever withstood that much. I must have\n               wanted you to fail. Take your hand out of\n               the box and look at it, young human.... Do\n               it!\n\n     Paul pulls his hand out of the box. No sign of\n     anything wrong. He turns his hand, flexes his\n     fingers. He looks to the Reverend Mother.\n\n                REVEREND MOTHER (CONT'D)\n                    (explaining)\n               Pain by nerve induction... A human can\n               resist any pain. Our test is crisis and\n               observation.\n\n                          PAUL\n               I see the truth of it.\n--\n                     REVEREND MOTHER\n                    (inner voice)\n               Could he be the one?... Maybe... but will\n               he be ours to control?\n                    (out loud)\n               You know when people speak the truth?\n\n                          PAUL\n               I know it.\n\n     Suddenly the Reverend Mother holds her hand against\n     Paul's head. She closes her eyes.\n\n40.  INT. RESERVOIR - SIETCH TABR - NIGHT - REVEREND\nMOTHER'S MENTAL IMAGE\n\n     She sees a blurred image of Paul's earlier dream.\n     She sees the beautiful girl turn. She hears a\n     muffled voice say \"Tell me of your homeworld, Usul\".\n\n41.  INT. JESSICA'S CHAMBER - CASTLE CALADAN - NIGHT\n\n                     REVEREND MOTHER\n               Your mother wants you to tell me about\n               your dreams. I only want to know one\n               thing.... Do they come true?\n\n                          PAUL\n               Not all of them... I know which ones will.\n\n                     REVEREND MOTHER\n               Perhaps you are the Kwisatz Haderach.\n\n                          PAUL\n               What is it?\n\n                     REVEREND MOTHER\n                    (profoundly)\n               The person who can be many places at\n               once... the one who bridges space and\n               time.... He will look where we cannot.\n\n                          PAUL\n               Where?\n\n                     REVEREND MOTHER\n               Do you know of the Water of Life?... the\n               Truthsayer drug?\n\n                          PAUL\n               I have heard of it.\n--\n                     REVEREND MOTHER\n               It is very dangerous... very painful. The\n               Bene Gesserit sisterhood drink it to see\n               within.... There is a place terrifying to\n               us... to women. It is said a man will\n               come... the Kwisatz Haderach... he will go\n               where we cannot... Many men have tried...\n\n                          PAUL\n               Did they try and fail?\n\n                     REVEREND MOTHER\n               They tried and died....\n                    (she calls out loudly)\n               Jessica!\n\n     Jessica enters immediately and sees with great\n     relief that Paul is still active.\n\n                     REVEREND MOTHER\n               I sense your teachings in him. Ignore the\n               regular order of training. His safety\n               requires The Voice.\n\n                          PAUL\n               I've heard enough of my safety... What\n               about my father?... I heard you talking.\n               You speak as if he was dead. Well, he\n               isn't!\n\n                         JESSICA\n               Paul!\n\n     She tries to hold him.\n\n                          PAUL\n               Well he isn't... and he won't die... Tell\n               me he won't die!\n\n                     REVEREND MOTHER\n               What can be done has been done.\n\n                          PAUL\n               MOTHER! Tell me!\n\n     The Reverend Mother covers herself and moves quickly\n     to the door.\n--\n42A. Through 45.    (Deleted)\n\n46.  EXT. GEIDI PRIME - DAY\n\n     HOME PLANET OF HOUSE HARKONNEN - As seen from space,\n     the black planet as we saw it in Paul's filmbook.\n\n47.  EXT. GEIDI PRIME - DAY\n\n     The surface of the planet is a vast sea of black\n     oil. A small cable car traverses high above the sea\n     toward a gigantic black city in the shape of a\n     rectangular box over 100 stories high. Before the\n     city there are rows of huge black towering steel\n     heads atop massive furnaces. SMOKE billows out of\n     their mouths.\n\n48.  INT. CABLE CAR - GIEDI PRIME - DAY\n\n     Inside the cable car stands PITER. In one hand he\n     holds the cylinder with DUKE Leto's ring imprint.\n\n                          PITER\n               It is by will alone I set my mind in\n               motion.\n               It is by the juice of Sapho that thoughts\n               acquire speed -\n               The lips acquire stains -\n               The stains become a warning -\n               It is by will alone I set my mind in\n               motion.\n\n48A. INT. GREEN PORCELAIN ROOM - GEIDI PRIME\n\n     Somewhere in the interior of Geidi Prime, we are in\n     a green porcelain room. Two large Harkonnen\n     soldiers, using large hoses, are washing down the\n     walls and floors of the room. WE MOVE DOWN into the\n     water rushing along the floor towards troughs.\n     Closer, WE SEE bits of flesh, hair, and blood.\n\n49.  EXT. GEIDI PRIME - DAY\n\n     The car zooms past gigantic faces, and the furnaces\n     far below ROAR with tremendous power. The city now\n     looms gigantic and overpowering -- millions of\n     electrical cables stretch off the top into dark\n     energy taps above the city.\n--\n50.  INT. GEIDI PRIME - DAY\n\n     Inside the city the cable car passes into a huge\n     inner chamber filled with open-topped lime green\n     porcelain rooms with tremendous electrical lines\n     criss-crossing above.\n\n51.  (Deleted)\n\n52.  INT. BARON'S ROOM - GEIDI PRIME - DAY\n\n     In front of a huge steam boiler, the cable car stops\n     and Piter gets out, steps down steel stairs and\n     enters a porcelain room where the Baron is being\n     treated by a DOCTOR for sores on his face and body.\n     The doctor uses a lasbeam on a big sore on the\n     Baron's lips. The Baron is sickly and hugely fat and\n     sweaty and looks like he has been sickly for some\n     time. He turns to Piter as he enters the room.\n\n                          PITER\n               My Lord!\n\n                          BARON\n               Piter.\n\n     Piter moves up to the Baron.\n\n                          PITER\n               The Atreides will be leaving Caladan soon,\n               Baron, and I have here your answer from\n               Duke Leto.\n\n                          BARON\n               What does Leto say, Piter?\n\n                          PITER\n               He wishes to inform you that Vendetta --\n               as he puts it, using the ancient tongue,\n               the art of Kanly -- is still alive. He\n               does not wish to meet or speak with you.\n\n                          BARON\n                    (swallowing; angry)\n               I made my peace gesture... the forms of\n               Kanly have been obeyed.\n\n     He throws down the cylinder.\n\n                          PITER\n               As you instructed me, I have enlightened\n               your nephews concerning my plan t...\n--\n                          BARON\n               My plan!\n\n                          PITER\n               The plan to crush the Atreides.  Feyd,\n               Rabban... go quietly... no other great\n               house of the Landsraad must ever know of\n               the Emperor's aid to the Baron.  The\n               entire Landsraad would turn against the\n               Baron and the Emperor.\n\n                         DOCTOR\n               Put the pick in there Pete\n               And turn it round real neat.\n\n     His assistant does so.\n\n     Rabban breaks open a squood (living food).  The\n     squood makes a tiny SCREAM, then Rabban drinks the\n     blood and bodily fluids.  He throws the empty\n     container of tiny animal meat into the dark water\n     trough running through the center of the room.\n     Across the room, TWO HARKONNEN SOLDIERS enter,\n     holding big guns on a BOY who is wearing white\n     pants.  The Baron smiles when he sees the boy, who\n     is deeply afraid.  The guards force the boy to\n     arrange violet flowers on a stand by the far wall\n     opposite the Baron.\n\n                          BARON\n                    (as the Baron watches the boy)\n               You're so beautiful my Baron\n               Your skin, love to me\n               Your diseases lovingly cared for\n               For all eternity.\n\n                          BARON\n               I will have Arrakis back for myself... he\n               who controls the Spice, controls the\n               universe... and what Piter didn't tell you\n               is we have control of someone who is very\n               close to Duke Leto.  This person... this\n               traitor... will be worth more to us than\n               ten legions of Sardaukar.\n\n                          FEYD\n               Who is the traitor?\n\n                          BARON\n                    (laughs)\n               I won't tell you who the traitor is or\n               when we'll attack.  However, the Duke will\n               die before these eyes and he'll know that\n               it is I -- Baron Vladimir Harkonnen -- who\n               encompasses his doom.\n--\n     The Baron gives a hand signal and seven gates in the\n     wall open, emitting tremendous SOUNDS.  Suddenly the\n     Baron begins to float straight up, twenty-five feet\n     in the air.  It is a frightening sight.  He floats\n     down under the giant, humming electrical tube light\n     and rubs his head and body with a black fluid which\n     drips from tiny holes in either side of the pink\n     glow.  Feyd and Rabban watch nervously.  The\n     Attendants stand completely still with fear.\n\n     The Baron swoops down to the Boy, who stands\n     petrified.  The Harkonnen guards smile nervously as\n     they step slightly backwards.  The boy begins\n     SCREAMING as the Baron pulls the boy's heart plug,\n     located in his chest.  The violet flowers are bumped\n     and disarrayed by the violence which ensues.  Then\n     the Baron turns smiling to Feyd as the SOUNDS\n     continue to roar.\n\n52A. through 52B.   (Deleted)\n\n52C. EXT. ATREIDES SHIP - CALADAN - DAY\n\n     A DRUM CORPS pounds out a powerful cadence in front\n     of a water and cannon show as the Duke, Paul and\n     Jessica mount the steel stairs to their ship.  In\n     the doorway, they turn back for a final look.\n\n     The Duke places a hand on Paul's shoulder.  We see\n     the signet ring.  Jessica is there.  She tries to\n     get Paul to look at her but he scowls and turns to\n     his father.\n\n                         JESSICA\n                    (turning away)\n                    (inner voice)\n               I must not fear.  Fear is the mind-\n               killer... the little death that brings\n               total obliteration...\n\n     The door of the spaceship closes.\n\n53.  EXT. HEIGHLINER - SPACE\n\n     3,415 Atreides ships are approaching the Guild\n     Heighliner, which is staggeringly colossal.  The\n     Atreides ships look like dots next to the sun.  The\n     Duke's ship enters the frame and moves toward the\n     Heighliner.\n\n53A. through 54.    (Deleted)\n--\n55.  INT. ATREIDES SHIP - SPACE\n\n     Paul, Jessica and Duke Leto look out the forward\n     viewing glass as tiny lights move outside in the\n     darkness. They hear and feel their ship stop with a\n     huge, echoing, metallic jolt. They look at each\n     other in the silence which follows.\n\n                        DUKE LETO\n               Soon they'll begin to fold space.\n\n                          PAUL\n                    (inner voice)\n               Far off in the control rooms....\n               Travelling without moving.\n\n     They wait.\n\n56.  (Deleted)\n\n57.  INT. CONTROL ROOM - HEIGHLINER - SPACE\n\n     We pass through electrical shields into a 2,000-foot\n     high control room filled with orange spice gas. On\n     the floor are large gratings covering an exhaust and\n     filtering system. Tons of spice gas are being\n     converted into the clouds of gas along a wall of\n     machinery. From within a dark metal tunnel comes a\n     Guild Navigator. He exits the tunnel and swims\n     through the gas 1,000 feet to a six-dimensional\n     layered miniature replica of the entire Universe.\n     The Navigator emits a long piece of light from his\n     mouth which travels to one edge of the Universe and\n     changes into a likeness of the planet Caladan. The\n     Navigator turns and emits another piece of light\n     which travels to the opposite side of the Universe.\n     It changes into a likeness of Arrakis. The Navigator\n     begins to put his slender fingers in amongst the\n     stars and he emits SOUNDS and bursts of light into\n     the mass of stars and galaxies. The Universe begins\n     to vibrate and elongate, then to curve. Electrical\n     lightening traverses from Caladan to Arrakis as the\n     Universe bends into a U-shape. Arrakis submerges\n     deep into the light. The navigator swims to the\n     point where Arrakis disappeared. He begins to pull\n     and tear a hole in the Universe. Stars like sparks\n     and SOUNDS and rings of light appear, along with a\n     roaring WIND. The Navigator swims deep into this\n     hole through the rings of light. The Navigator\n     becomes more and more transparent, until he's lost\n     in darkness. The sounds fade.\n--\n58. through 60.     (Deleted)\n\n60A. EXT. HEIGHLINER - ABOVE ARRAKIS - SPACE\n\n     Suddenly, the real planet Arrakis appears and the\n     giant Heighliner materializes above it.\n\n61. through 63A.    (Deleted)\n\n63B.      EXT. ARRAKEEN - DAY\n\n     Through a brownish-orange haze appears the dusty\n     valley of Arrakeen.\n\n64.  INT./EXT. THE ATREIDES SHIP - DAY ARRAKEEN\n\n     The Atreides ship has landed at Arrakeen. The door\n     is open - the family walk down the steps - DUKE LETO\n     with his dog - PAUL and JESSICA.\n\n64A. through 64C.   (Deleted)\n\n65.  EXT. GROUNDS - ARRAKEEN PALACE - DAY\n\n     ... clusters of troops standing at attention around\n     the enormous dark, cool doorway as the Duke, Paul\n     and Jessica enter the Palace.\n\n65A. through 65B.   (Deleted)\n\n65C. EXT. PALACE - ARRAKEEN - DAY\n\n     The Atreides banner is raised on the top of the\n     Palace.\n\n66.  (Deleted)\n--\n67.  INT. MILITARY SUB-BASEMENT ROOM - ARRAKEEN PALACE -\nDAY\n\n     Atreides army soldiers milling, YELLING noisily.\n\n68.  INT. PASSAGEWAY - ARRAKEEN PALACE - DAY.\n\n     In a darkened passageway, fans turn, casting deep,\n     slow-moving shadows. SOUNDS ECHO in the distance.\n\n69.  INT. COMMUNICATIONS ROOM - ARRAKEEN PALACE - DAY\n\n     A room of technicians and electronic gear. The\n     SIGNALS are being heard and interpreted.\n\n                   ATREIDES TECHNICIAN\n               Harkonnens.\n\n70.  EXT. BLACK ROCK - ARRAKEEN - DAY\n\n     Far in the distance in deep black rock, Harkonnen\n     spies move, carrying strange electronic equipment.\n\n71.  (Deleted)\n\n72.  INT. PASSAGEWAY - ARRAKEEN PALACE - DAY\n\n     Thufir marches down a hallway with a squad of TROOPS\n     with electronic gadgetry, LIGHTS and SOUNDS going\n     constantly.\n\n                         THUFIR\n                    (into a radio microphone)\n               Why isn't the shield up yet?\n\n73.  INT. GENERATOR ROOM - ARRAKEEN PALACE - DAY\n\n     Down in the basement, Atreides engineers are\n     removing a complicated device from heavy machinery.\n     A MAN radios back to Thufir.\n\n                   ATREIDES RADIO MAN\n               We found and removed another sabotage\n               device. I think it will go up now.\n--\n     The engineers activate a series of atometric\n     Holtzman generators. Suddenly SOUNDS begin. The\n     machines start; at first low, then they WHINE\n     upwards to a high pitch. When the pitch is steady, a\n     series of levers are pulled.\n\n74.  EXT. PALACE - ARRAKEEN - DAY\n\n     Just after the second set of levers is pulled, a\n     huge house shield is seen going up in a box shape,\n     encompassing the Palace with SHIMMERING protection.\n\n75.  EXT. WINDOW - ARRAKEEN PALACE - DAY\n\n     From a small window, Thufir observes the shield with\n     a critical eye.\n\n                         THUFIR\n                    (inner voice; worried)\n               We found these sabotage devices too\n               easily...\n\n76.  INT. GREAT HALL - ARRAKEEN PALACE - DAY\n\n     Two giant glowglobes drift into the Great Hall where\n     Jessica and Dr. Yueh stand watching a giant bull's\n     head is being hung above the massive fireplace. The\n     MOVING TROOPS are unpacking crates and organizing\n     furnishings. Jessica watches them. Distant SOUNDS\n     reverberate inside an elaborate air vent beside\n     them.\n\n                        DR. YUEH\n               Listen here.... You can here the people of\n               Arrakeen outside.... Can you here the cry\n               \"Soo Soo Sook\" of the water sellers?\n\n                         JESSICA\n               So many reminders of the scarcity of\n               water.\n\n                        DR. YUEH\n               Have you noticed the line of palms along\n               the wall... the Harkonnen put them in...\n               to flaunt their water wealth in front of\n               these people.... Each day those palms take\n               enough water to sustain the life of one\n               hundred men.\n\n                         JESSICA\n               The way you say Harkonnen... I didn't know\n               you had so much reason to hate them.\n\n                        DR. YUEH\n                    (swiftly)\n               My wife... you didn't know my wife...\n               they...\n--\n                         JESSICA\n                    (out loud)\n               Forgive me...\n                    (inner voice)\n               ... His wife was Bene Gesserit too... the\n               signs are al over him.... They must have\n               killed here.\n\n     Jessica sees a droplet of sweat break out on Yueh's\n     cheek.\n\n                        DR. YUEH\n               I'm sorry I'm unable to talk about it.\n\n     Above them a series of iron curtains begins to open\n     over deep rock window slots, sending  narrow shafts\n     of light down across the room. TWO ATREIDES WOMEN in\n     uniform approach.\n\n                    ATREIDES WOMAN #1\n                    (referring to several robed figures\n                    standing in the room)\n               My lady... the local people... the maids\n               and servants await your inspection. Hawat\n               has cleared them.\n\n     Dr. Yueh turns to Jessica.\n\n                        DR. YUEH\n               The Harkonnens may have tampered\n               medically.... please wait.\n\n     He turns a yellow light on a moves it over the\n     crowd. The yellow light beam plays over the blue-\n     within-blue eyes. One of the women, the Shadout\n     Mapes, watches Jessica continuously. Yueh's hand\n     shakes slightly.\n\n                         JESSICA\n                    (inner voice; noticing Yueh's hands)\n               He's hiding something -- holding something\n               back.\n                    (She studies his face closely.)\n               It's not just his wife... He's a good man\n               though. He's probably trying to save my\n               feelings...\n                    (We see her mouth.)\n               I could use The Voice... make him tell\n               me... It would only shame him.\n                    (We see her eyes.)\n               I must place more trust in my friends.\n                    (We see Yueh turn toward her,\n                    fearful.)\n--\n77.  INT. PASSAGEWAY - ARRAKEEN PALACE - DAY\n\n     Paul wanders through the darkened passageways alone,\n     his footsteps echoing as goes. He takes pleasure\n     observing the details of the rock Palace but all the\n     while he feels an uneasiness -- a feeling of fear\n     builds in him.\n\n78.  INT. PAUL'S BEDROOM - ARRAKEEN PALACE - DAY\n\n     Paul enters a small bedroom and sits down on the\n     bed. He opens the filmbook, and activates it.\n\n78A. INSERT - FILMBOOK\n\n     We SEE a gigantic carryall lower down above a spice\n     harvester and pick it up off the desert floor as a\n     narrator speaks over.\n\n                     NARRATOR (V.O.)\n               One carryall handles four spice mining\n               teams; however, it will fly only two\n               harvesters at a time. Today, we have nine\n               hundred and thirty harvesters and nine\n               hundred and eighty-one carryalls....\n\n78.  BACK TO SCENE\n\n     Paul looks up. Across the room he sees a tray of\n     small pastries which have been laid out. He goes to\n     them and scans them with his poison detector, which\n     he carries on his belt. A pleasant tone SOUNDS and\n     the word \"safe\" appears in green light. Paul takes a\n     pastry bites it and turns back towards the bed.\n     Suddenly he stops. He looks at the pastry.\n\n                          PAUL\n                    (inner voice)\n               Spice...\n\n     As he continues eating he notices the sunlight\n     through the slates over the window begins to GLOW\n     white hot. Paul's eyes are intense as the light\n     GLOWS brilliantly.\n\n                      PAUL (CONT'D)\n                    (whispering inner voice)\n               Terrible purpose.... What is it?\n\n78B. INSERT - RED DROPLETS\n\n     Some red droplets appear rushing through the white\n     light. Three images follow:\n\n     MENTAL IMAGES:\n\n79.  INT. CONTROL ROOM - EMPEROR'S PALACE - DAY\n\n     A blurred Guild Navigator.\n--\nPage Missing\n--\n                      SHADOUT MAPES\n               I am the Shadout Mapes... the housekeeper.\n\n                          PAUL\n               A Fremen... Could she be the operator?\n               No...\n\n                      SHADOUT MAPES\n               I must cleanse the way between us.... You\n               saved my life... and we  Fremen pay our\n               debts. It's known to us that you've a\n               traitor in your midst. Who it is we cannot\n               say but we're certain of it.\n\n                          PAUL\n                    (inner voice)\n               A traitor...\n\n     Before he can speak the Shadout Mapes is gone --\n     running off down the passageway. Jessica enters.\n\n                      PAUL (CONT'D)\n                    (looks to Jessica)\n               There is a traitor among us.\n\n80A. (Deleted)\n\n81.  INT. PASSAGEWAY - ARRAKEEN PALACE - DAY\n\n     Running TROOPS storm down the hallway with\n     electronic gear and big stun guns.\n--\n82.  INT. PASSAGEWAY - ARRAKEEN PALACE - DAY\n\n     Thufir walks quickly toward SEVERAL TROOPS.\n\n                         THUFIR\n               Set up a sonar probe immediately!\n\n83.  INT. AUTOPSY ROOM - ARRAKEEN PALACE - DAY\n\n     Dr. Yueh sticks his head out the doorway as SEVERAL\n     TROOPERS run past.\n\n84.  INT. OBSERVATION ROOM - ARRAKEEN PALACE - DAY\n\n     Duke Leto is calling on a radio phone. GENERALS\n     surround him, as well as Gurney.\n\n                        DUKE LETO\n                    (on phone)\n               Thufir?... anything?... keep looking.\n                    (Inner voice)\n               ...and a traitor... God help us.\n\n85.  INT. SUB-SUB-SUB-BASEMENT - ARRAKEEN PALACE - DAY\n\n     TROOPS come off an elevator. The glow-span indicates\n     the very bottom floor of 18 sub-floors. The ground\n     is uneven rock and the ceiling is low. The troops\n     fan out shining chemical lamps here and there. A\n     soldier suddenly stops. Ahead in his light is a dead\n     Harkonnen -- bloody vomit dried around his mouth. He\n     lies beside an electronic device.\n\n86.  INT. AUTOPSY ROOM - ARRAKEEN PALACE - DAY\n\n     Dr. Yueh covers his face with his hands in a\n     darkened room... sobbing.\n\n86A. EXT. WALL - ARRAKEEN PALACE - NIGHT\n\n     SEARCHLIGHTS sweep over the faces of City Fremen who\n     are sitting or moving solemnly around the outer wall\n     of the Palace. Some are chanting \"Mahdi\" and \"Lisan\n     al-Gaib.\" Others hold up one open hand as a sign\n     they feel the messiah is near. A slow-moving spike-\n     backed dog sucks ants up out of a small anthill; he\n     snorts.\n\n86B. INT. GREAT HALL - ARRAKEEN PALACE - NIGHT\n\n     In the darkened Hall we can HEAR the distant sound\n     of the Fremen reverberating.\n--\n87.  INT. OBSERVATION ROOM - ARRAKEEN PALACE - DAY\n\n     Duke Leto sits with Paul, Thufir, EIGHT GENERALS and\n     SIX SUB-LIEUTENANTS. The Duke's small dog wanders\n     under the table and rests his head on the Duke's\n     boot. In front of Thufir is a device FLASHING\n     brilliant light bursts over his face. The others are\n     all talking among themselves. Suddenly Thufir's face\n     turns brilliant red (as red as his sapho-stained\n     lips) and he begins speaking rapidly into the\n     machine in code using a strained high voice.\n--\n                         THUFIR\n                    (Mentat voice)\n               Sector 6 - 80 -- copy the sixth -- the\n               summit -- the eight the quadrant over the\n               ninth plus eighty -- four circles -- weave\n               the eighty and call the fourth copy --\n               enter nine -- seven by seven a seven the\n               seven call seven B seven -- enter the\n               circles call the sixth copy the sixth over\n               the summit.... eight.\n\n     The machine FLASHES several bright irregular\n     SIGNALS. Then it stops and HUMS. The blood leaves\n     Thufir's face.\n\n                     THUFIR (CONT'D)\n                    (very fast and casually)\n               Eight.... Thufir Hawat... Mentat... Master\n               of Assassins.\n\n     The hum stops. Thufir turns to Duke Leto. He looks\n     up. Everyone is quiet now.\n\n                     THUFIR (CONT'D)\n               The Palace is now secure. The city of\n               Arrakeen is under martial law... we have\n               troops here headquartered underground on\n               sub-floors six through ten. The rest of\n               the troops are stationed in Arrakeen and\n               we have some on the airfield. Our new army\n               is still training, but everything is\n               shielded.... With the shielding, we are\n               impenetrable. Dr. Kynes is waiting, Sire,\n               for your inspection of spice mining\n               operations, but since the attempt of the\n               young master, I am against your leaving\n               the Palace.\n\n                        DUKE LETO\n                    (very angry)\n               The attempt failed... Harkonnen captives\n               have already been taken. We must crush the\n               Harkonnen machine on Arrakis.... You all\n               know what to do.\n                    (Turning towards Gurney)\n               ...Gurney! We desperately need more spice\n               miners... many are threatening to leave on\n               the next shuttle. We need spice drivers,\n               weather scanners, dune men ... any with\n               open sand experience. You must persuade\n               them to enlist with us.\n--\n                         GURNEY\n               They shall come all for violence: their\n               faces shall sup as the east wind. And they\n               shall gather the captivity of the sand.\n\n                        DUKE LETO\n                    (squints at Gurney)\n               Very moving, Gurney. On your way... and\n               take care of Dr. Kynes until Paul and I\n               arrive. We will not be prisoners here in\n               this place.\n\n                         GURNEY\n                    (artfully easing the Duke's anger)\n               Behold as a wild ass in the desert go I\n               forth to my work.\n\n     Gurney strides off. Thufir sits, contemplating. Paul\n     and Duke Leto smile at each other and shake their\n     heads.\n\n88.  INT. JESSICA'S CHAMBER - ARRAKEEN PALACE - DAY\n\n     Jessica is sitting in a small room, smiling, reading\n     a note. It reads \"I miss you. Leto.\" She sets the\n     note down. She begins to tremble. She becomes\n     fearful. In her mind she SEES quick images:\n\n     MENTAL IMAGES\n\n89.  INT. CONTROL ROOM - HEIGHLINER\n\n     A blurred Guild Navigator.\n\n89A. INT. MAKER ROOM - SEITCH TABR - NIGHT\n\n     Paul dead on a stone floor.\n\n89B. EXT. ARRAKEEN PALACE - NIGHT\n\n     Fire burning.\n\n90.  INT. JESSICA'S CHAMBER - ARRAKEEN PALACE - DAY\n\n     Jessica continues to tremble.\n\n                         JESSICA\n                    (inner voice)\n               I must speak with you Leto!\n--\n91.  INT. PASSAGEWAY - ARRAKEEN PALACE - DAY\n\n     Outside in the passageway, feet suddenly move\n     quietly toward the door to Jessica's room.\n\n92.  INT. JESSICA'S CHAMBER - ARRAKEEN PALACE - DAY\n\n     Jessica HEARS this and looks up just as the Shadout\n     Mapes silently enters her room.\n\n                         JESSICA\n                    (staring at the blue-eyed woman --\n                    waiting for possible danger.)\n               Yes?\n\n                      SHADOUT MAPES\n               I am the Shadout Mapes, your housekeeper,\n               Noble Born. What are your orders.\n\n                         JESSICA\n               You may refer to me as \"my lady.\" I am not\n               noble born. I'm the bound concubine of\n               Duke Leto -- mother of the heir\n               designate.... \"Shadout\"... that's an\n               ancient word.\n\n                          MAPES\n                    (strangely asked)\n               You know the ancient tongues?\n\n                         JESSICA\n               I know the Bhotani Jib and Chakobsa, all\n               the hunting languages.\n\n                          MAPES\n               As the legend says.\n\n                         JESSICA\n                    (inner voice)\n               That's it! The Missionaria Protectiva has\n               been here planting protective legends\n               against a day of Bene Gesserit need. And\n               that day has come. I must play out this\n               sham.\n                    (out loud)\n               I know the Dark things and the way of the\n               Great Mother. Miseces prejin.\n\n     Mapes takes a step backward to flee.\n\n                    JESSICA (CONT'D)\n               I know many things. I know you came\n               prepared for violence with a weapon in\n               your bodice.\n--\n                          MAPES\n               My lady, I... the weapon was sent as a\n               gift if you should prove to be the one.\n\n                         JESSICA\n               And the means of my death should I prove\n               otherwise.\n                    (inner voice)\n               Now we will see which way the decision\n               tips.\n\n     Slowly Mapes reaches into her dress and brings out a\n     sheathed knife. She unleashes it.\n\n                          MAPES\n               Do you know this my lady?\n\n                         JESSICA\n                    (inner voice)\n               It could only be one thing....\n                    (out loud)\n               It's a crysknife.\n\n                          MAPES\n               Say it not lightly...\n                    (very slowly)\n               Do you know its meaning?\n\n                         JESSICA\n                    (inner voice)\n               Here is why this Fremen has taken service\n               with me, to ask that one question. Delay\n               is as dangerous as the wrong answer.\n               Shadout is Chakobsa... knife, in Chakobsa\n               is... maker of death.\n                    (out loud)\n               It's a maker...\n\n     Mapes SCREAMS with elation and grief.\n\n                    JESSICA (CONT'D)\n                    (inner voice)\n               Maker?... Maker is the key word... the\n               tooth of the worm? That was close...\n                    (out loud)\n               Did you think that I, knowing the\n               mysteries of the Great Mother, would not\n               know the maker?\n\n                          MAPES\n               My lady, when one has lived with prophecy\n               for so long, the moment of revelation is a\n               shock.\n\n     Mapes sheathes the blade... slowly\n--\n                         JESSICA\n                    (inner voice)\n               There's more here... yes!\n                    (out loud)\n               Mapes, you've sheathed that blade\n               unblooded.\n\n     With a GASP Mapes drops the knife into Jessica's\n     hands and opens her blouse.\n\n                          MAPES\n               Take the water of my life!\n\n     Jessica withdraws the knife from the sheath and,\n     with the blade, scratches a line just above Mapes'\n     right breast.\n\n                     MAPES (CONT'D)\n               You are ours.... You are the one.\n\n     Jessica's eyes stare ahead. She knows these words\n     ring with truth.\n\n93.  INT. TUNNEL - OBSERVATION ROOM - ARRAKEEN PALACE -\nDAY\n\n     The Duke, Paul and SEVERAL ARMED GUARDS enter a\n     tunnel to a `thopter landing pad which is\n     illuminated by a shaft of light coming from a\n     chimney-like exit above. DR. KYNES and his Fremen\n     guard are standing next to Gurney.\n\n                          KYNES\n                    (to Gurney)\n               So, this is Leto the Just...\n\n                         GURNEY\n                    (sharply)\n               I hope I made myself clear. You may call\n               him \"The Duke,\" \"My lord,\" or \"Sire.\" And\n               there is a more ancient term you might\n               keep in mind -- \"Noble Born.\"\n\n                          KYNES\n                    (inner voice)\n               Play out your little comedy while you can\n               off-worlders...\n\n     Gurney turns and activates a device...\n\n93A. INSERT - ORNITHOPTER OPENING\n\n     ...which causes the ornithopter behind to fold open\n     ready for flight.\n--\n93B. INT. TUNNEL - OBSERVATION ROOM - ARRAKEEN PALACE -\nDAY\n\n     The two parties meet and are introduced.\n\n                        DUKE LETO\n               So you are Dr. Kynes, the Imperial\n               Ecologist?\n\n                          KYNES\n                    (turning to Gurney)\n               I prefer the more ancient term,\n               planetologist... Noble Born.\n\n                        DUKE LETO\n               This is my son, Paul.\n\n                          PAUL\n               Are you a Fremen?\n\n                          KYNES\n               I am a servant of the His Majesty the\n               Emperor. I have served His Majesty on\n               Arrakis long enough for my eyes to change.\n\n                          PAUL\n                    (inner voice)\n               He's hiding something.\n\n                        DUKE LETO\n               I understand we have you to thank for\n               these stillsuits, Doctor.\n\n                          KYNES\n               They are Fremen suits. I hope they fit\n               well, my lord.\n\n                          PAUL\n               \"Your gift is a blessing of the river.\"\n\n     Kynes' FREMEN GUARDS, hearing this are siezed with\n     agitation. Kynes QUIETS them, then studies Paul.\n\n                          KYNES\n                    (inner voice)\n               The Mahdi will greet you with holy words\n               and your gifts will be a blessing.\n                    (spoken, nonchalantly)\n               Most of the desert natives here are a\n               superstitious lot. They mean no harm. With\n               your permission, I will check the security\n               of your suits.\n\n     Gurney and the guard move forward warily.\n\n                         GURNEY\n                    (angrily)\n               The Duke is to be addresses as...\n--\n     Kynes comes forward and adjusts the Duke's suit,\n     checking seals and pulling on straps.\n\n                          KYNES\n               Basically...\n\n                         GURNEY\n                    (leaping forward to protect his Duke)\n               Sire!\n\n                        DUKE LETO\n               It's all right Gurney.\n\n     Gurney steps back.\n\n                         GURNEY\n               Yes, Sire.\n\n                          KYNES\n               It's a high-efficiency filter and heat\n               exchange system. Perspiration passes\n               through the first layer and is gathered in\n               the second. The salt is separated.\n               Breathing and walking provide the pumping\n               action. The reclaimed water circulates to\n               catchpockets from which you can drink\n               through this tube at your neck. Urine and\n               feces are processed in the thigh pads.\n               Should you be in the open desert, remember\n               to breathe in through your mouth, out\n               through the nose tubes.\n\n     The Duke is now properly fitted. Kynes places the\n     noseplug into his nose.\n\n                     KYNES (CONT'D)\n               With a Fremen suit in good working order,\n               one can sustain life for weeks, even in\n               the deep desert.\n\n     He removes the noseplug.\n\n                        DUKE LETO\n               My thanks.\n\n                          KYNES\n               With your permission...\n\n     Kynes turns to Paul, running his hands over the\n     slick fabric. He stands back with a puzzled\n     expression.\n--\n                          KYNES\n               You've worn a stillsuit before?\n\n                          PAUL\n               No.\n\n                          KYNES\n     Your suit is fitted desert fashion. Who told you how\n     to do that?\n\n                          PAUL\n               No one. It... seemed the proper way.\n\n                          KYNES\n               That it is.\n                    (inner voice)\n               He shall know your ways as if born to\n               them.\n\n     Kyne's Fremen guard are watching Paul very closely\n     now.\n\n                         GURNEY\n               We're wasting time, Sire.\n\n     Duke Leto, Dr. Kynes, Gurney and Paul enter the\n     ornithopter...\n\n88. Through 89B.    (Deleted)\n\n90.  INT. JESSICA'S CHAMBER - ARRAKEEN PALACE - DAY\n\n     Jessica trembles.\n\n                         JESSICA\n                    (inner voice)\n               I must speak with you Leto!\n\n91. Through 92.          (Deleted)\n\n93C. EXT. ATREIDES ORNITHOPTER - TUNNEL - ARRAKEEN PALACE\n- DAY\n\n     ...and the thopter turns slowly as it goes up into\n     the light.\n\n93D. (Deleted)\n--\n93E. EXT. ATREIDES ORNITHOPTER - DAY\n\n     From outside the Palace's atomic shield we see the\n     blur of the ornithopter pass through a porthole and\n     come out perfect like a gleaming jewel.\n\n93F. Through 94.    (Deleted)\n\n94A. INT. ATREIDES ORNITHOPTER - DAY\n\n                          KYNES\n               Southeast over the Shield Wall. That's\n               where I told your sandmaster to\n               concentrate his harvesting.\n\n95.  EXT. ATREIDES ORNITHOPTER - DAY\n\n     They crest the top of the wall which opens out into\n     a black, level expanse of rock, cratered and\n     fractured. On the other side is the huge, seemingly\n     endless plain of sand, the Great Desert. In the hazy\n     distance, flashes of light can be seen.\n\n96.  INT. ATREIDES ORNITHOPTER - DAY\n\n                          PAUL\n               Will we see a worm?\n\n                          KYNES\n               Where there is spice and spice mining\n               there are always worms.\n\n                          PAUL\n               Always?\n\n                          KYNES\n               Always.\n\n                          PAUL\n               Why do they come?\n\n                          KYNES\n               To protect their territory. Vibrations\n               attract them.\n--\n                          PAUL\n                    (inner voice)\n               I've registered him now... a knife is a\n               sheath on his left arm... He's strong... a\n               person born to command... He's hiding many\n               things.\n                    (out loud, suddenly)\n               Is there a relationship between the worms\n               and the spice?\n\n     Kynes turns instantly and stares at Paul. Gurney\n     sees the wonder in Kynes' eyes.\n\n                         GURNEY\n               The young master is a trained Mentat, an\n               advanced student of Prana Bindu has\n               studied under some of the finest teachers\n               in the Universe.\n\n     Kynes takes a second look at young Paul.\n\n                          KYNES\n               As I said... they defend the spice sands.\n               As to their relationship with the spice...\n               who knows.\n\n97. Through 97A.    (Deleted)\n\n98.  INT. ATREIDES ORNITHOPTER - DAY\n\n                         GURNEY\n               Dust cloud ahead, Sire.\n\n                          KYNES\n               That's it... spice mining... no other\n               cloud quite like it. See the spotters over\n               it? They're watching for wormsign... the\n               telltale sand waves. Seismic probes on the\n               surface, too Sire... worms can travel too\n               deep for their waves to show... Looks like\n               a good patch of spice.\n\n                        DUKE LETO\n               Wormsign? Is it wormsign?\n--\n                          KYNES\n               Yes!... worm. Big one! You've got sharp\n               eyes Sire.... May I?\n\n     Kynes grabs the microphone and dials in the correct\n     frequency.\n\n98A. through 99.    (Deleted)\n\n100. INT. ATREIDES ORNITHOPTER\n\n     From the window, we see that the sand below is\n     rippling, like water with a big fish just under the\n     surface.\n\n                          KYNES\n                    (into radio, after having found the\n                    frequency)\n               Calling Harvester Pad Nine. Wormsign!\n\n          STATIC... then a voice.\n\n                          VOICE\n                    (over radio)\n               Who calls Pad Nine?\n\n                         GURNEY\n                    (quickly)\n               Don't mention the Duke... This is an\n               uncoded channel.\n\n                          KYNES\n               Unlisted flight northeast of you...\n               wormsign on intercept course... estimated\n               contact fifteen minutes.\n\n                          VOICE\n                    (over radio)\n               Have sighting confirmed. Stand by for fix.\n               Contact in sixteen minutes minus. Very\n               precise estimate. Who is on that unlisted\n               flight?\n\n     Kynes clicks off the radio.\n\n                        DUKE LETO\n               What happens now?\n\n                          KYNES\n               The carryall will come and lift off the\n               spice harvester. Try and get in close over\n               the harvester... you'll find this\n               interesting Sire.\n--\n     The Duke accelerates the ornithopter in the\n     direction of the harvester. Paul can SEE...\n\n101. EXT. HARVESTER - DESERT - DAY\n\n     ...huge amounts of sand being spewn out of the\n     gigantic stack atop the metal and plasteel\n     harvester.\n\n102. INT. ATREIDES ORNITHOPTER - DAY\n\n                          KYNES\n               They'll work until the very last minute.\n\n     The yellow cloud of the harvester envelops them. The\n     Duke flies up to get a closer look.\n\n                          VOICE\n                    (over radio)\n               Spotter control... no sign of the\n               carryall... it isn't answering.\n\n     Everyone looks at one another.\n\n                         GURNEY\n               The worm is eight minutes away, Sire.\n\n                          VOICE\n                    (over radio)\n               Spotter control -- give me a report by the\n               numbers.\n\n     Over the radio MANY VOICES report they have no\n     contact with the carryall.\n\n                        DUKE LETO\n               Damn it... Harkonnens.\n\n     He punches a control button and grabs a microphone.\n\n                   DUKE LETO (CONT'D)\n                    (into microphone)\n               We are coming down to take you off the\n               harvester... All spotters are ordered to\n               comply.\n\n                          VOICE\n                    (over radio)\n               Ordered by whom?\n--\n                        DUKE LETO\n                    (angrily)\n               Duke Leto Atreides....\n\n     Gurney and Paul turn to each other, worried.\n\n                          VOICE\n                    (over radio)\n               Yes... yes, Sire!\n\n                        DUKE LETO\n               How many men do you have?\n\n                          VOICE\n                    (over radio)\n               Full crew -- twenty-six men -- but Sire,\n               we can't leave this spice...\n\n                        DUKE LETO\n               Damn the spice! Get out of there.\n\n103. EXT. HARVESTER - DESERT - DAY\n\n     All the spotters begin landing and the Duke descends\n     directly in front of the harvester which has stopped\n     mining yet emits a tremendous rythmic GRINDING\n     noise. No one is coming out.\n\n104. INT./EXT. ATREIDES ORNITHOPTER/DESERT - DAY\n\n     Gurney nervously scans the sky for enemy ships. A\n     very low, powerful SOUND starts now and the ground\n     begins to shake.\n\n105. EXT. HARVESTER - DESERT - DAY\n\n     A hatch opens and MEN come pouring out.\n\n106. INT. ATREIDES ORNITHOPTER - DESERT - DAY\n\n                        DUKE LETO\n                    (yelling at the men)\n               Two men in each of the spotters... You!...\n               over here... run!!\n\n     The ground is really shaking now.  A tremendous low\n     THUNDERING sound grows along with a high rasping\n     HISS.\n\n                          KYNES\n                    (to Paul and Gurney -- yelling over\n                    the noise)\n               I can't see him yet but he's very close...\n--\n                        DUKE LETO\n                    (out loud to himself as he watches\n                    the men scrambling)\n               Damn sloppy -- really damn sloppy.\n\n     FOUR MEN begin tumbling into the Duke's machine.\n\n                         GURNEY\n               Come on boys... come on.\n                    (Then, to the Duke)\n               We're going to be heavy, Sire.\n\n     The men press on Gurney and Paul.  Paul can feel the\n     fear. The sound is a horrible ROAR and deeper\n     RUMBLING now and the `thopter is vibrating and\n     shaking violently.  The air suddenly begins to SPARK\n     with static electricity.\n\n                          KYNES\n                    (nervous)\n               Here he is... We've got to go.\n\n     The Duke closes the doorways, surveys the area one\n     last time, then takes the controls.\n\n106A.     INT. ATREIDES ORNITHOPTER - DAY\n\n     The ship strains and lifts off -- slowly.\n\n     Paul sees the brown powder clumped on the suits of\n     the men... their bluish eyes.  He smells the spice.\n     He begins to feel its affect.\n\n                          PAUL\n                    (inner voice as a blinding light\n                    comes and goes)\n               Spice!... pure un-refined spice!\n\n                          KYNES\n                    (murmuring)\n               Bless the Maker and his water... Bless the\n               coming and going of him.  May his passage\n               cleanse the world.\n\n                        DUKE LETO\n                    (yelling)\n               What's that you're saying?\n\n                          KYNES\n               Nothing.\n\n     A spice miner turns and sees Kynes, who remains\n     silent.\n--\n                     SPICE MINER #1\n                    (astonished)\n               Liet!\n\n                     SPICE MINER #2\n               Shhhhh.\n\n     Paul hears this, then looks to Kynes -- locks on his\n     image.\n\n                          PAUL\n                    (inner voice)\n               Liet?\n\n                          KYNES\n                    (pointing down and yelling)\n               You are about to witness something few\n               have seen -- watch!  Watch!\n\n     Paul looks down as the Duke banks over the\n     harvester.\n\n107. EXT. HARVESTER - DESERT - DAY\n\nStatic electricity is IGNITING in the air and the sand is\nswirling around the harvester.  Then they see it.  A wide\nhole emerges from the sand, glistening spokes within it.\nThe hole is twice the size of the harvester.  Suddenly\nthe machine turns and slides into the hole, parts of it\nEXPLODING.  The SOUND is deafening.  The Duke's ship is\nWHINING to stay aloft.\n\n108. INT. ATREIDES ORNITHOPTER - DAY\n\n                         GURNEY\n               Gods, what a monster.\n\n                        DUKE LETO\n               Someone is going to pay for this... I\n               promise.\n\n                          KYNES\n                    (inner voice -- as he studies the\n                    Duke)\n               This Duke is more concerned over his men\n               than the spice!  I must admit... against\n               all better judgement... I like this Duke.\n\n                                        FADE TO:\n\n109. through 113B.  (Deleted)\n--\n114. INT. OBSERVATION ROOM - ARRAKEEN PALACE - NIGHT\n\n     Duke Leto walks into the room.  The NIGHT GUARD\n     comes to attention as he passes.  DUNCAN IDAHO,\n     wearing a dark, dusty stillsuit, emerges from the\n     shadows.  DUKE LETO and DUNCAN meet at the foot of\n     the steps.  The men embrace and separate.\n\n                        DUKE LETO\n                    (happily)\n               Duncan!  What have you discovered about\n               the Fremen, Duncan -- tell me.  Why\n               haven't we heard from you?\n\n                         DUNCAN\n               My lord... I suspect so much.  I think\n               they are the allies we seek... they are\n               strong and fierce... they do not give\n               their loyalty easily or quickly....  As\n               you know, the Imperium has never been able\n               to take a census of the Fremen.  Everyone\n               thinks that there are but few -- wandering\n               here and there in the desert.... My lord,\n               I suspect an incredible secret has been\n               kept on this planet... that the Fremen\n               exist in vast numbers... vast numbers...\n               and it is they that control Arrakis.\n\n115. through 116.   (Deleted)\n\n116A.     NEW SCENE - SHADOUT MAPES ALONG PASSAGE\n\n117. INT. PAUL'S SUB-BASEMENT ROOM - ARRAKEEN PALACE -\nNIGHT\n\n                    DUKE LETO'S VOICE\n               Guard.  Open the door.\n\n     Paul is in a fitful sleep.  Leto enters and smiles\n     at his son.\n\n                        DUKE LETO\n               Sleep well... my son.\n\n     The Duke smiles at Paul then leaves the room, but\n     after he goes, Paul strains with all his might to\n     lift himself to call out.\n\n                          PAUL\n                    (struggling painfully)\n               Father!... father... drugged...\n--\n122. INT. BARON'S QUARTERS - HARKONNEN SHIP - NIGHT\n\n     The BARON's face --  expressionless.  The SOUND of\n     his ship screams in the background.  The DOCTOR is\n     seated beside him.\n\n118  INT. SUB-BASEMENT PASSAGEWAY - ARRAKEEN PALACE -\nNIGHT\n\n     The Duke walks down the steps to a very narrow\n     passageway.  The passageway becomes very dark.\n\n     Suddenly the Duke hears a strange MEWLING sound.  He\n     turns down an even darker passageway.  He can hear\n     the shield WHINING in the distance.  He almost has\n     to feel his way.  Up ahead he sees a shape.  He\n     bends down and sees the SHADOUT MAPES dying on the\n     cold stone floor in the darkness.  She tries to\n     speak but cannot.  She falls.  Suddenly the Duke\n     HEARS the shield generator start whining down.\n\n                        DUKE LETO\n               What happened?  What?\n                    (as Mapes dies)\n               The shield!\n\n     The Duke reaches to activate his shield be a large\n     dart is shot into his shoulder.  The Duke lurches\n     upwards then tumbles to the ground.  Out of the\n     darkness comes Dr. Yueh.  The dart drops and\n     CLATTERS as if a dream.\n\n                   DUKE LETO (CONT'D)\n                    (mind racing -- struggling)\n               Yueh!\n                    (inner voice)\n               He's sabotaged the house generators, we're\n               wide open.\n\n                          YUEH\n                    (with self-disgust)\n               I've brought House Atreides down.  I've\n               destroyed the new army's weirding modules.\n\n                        DUKE LETO\n                    (hoarse whisper)\n               ... Why?\n\n     The generator WHINES lower and lower\n--\n                          YUEH\n               I wish to kill a man... not you, my dear\n               Duke, but the Baron....  You were dead\n               already... but you will be close to the\n               Baron before you die.  You will be tied\n               and drugged but you can still attack.\n               When you see the Baron you will have a new\n               poison tooth.  He will want you close so\n               he can gloat over you.  One bite on this\n               tooth and a strong exile...\n\n                        DUKE LETO\n               Refuse...\n\n                          YUEH\n               No! -- You mustn't... for in return I will\n               save the lives of your Paul and Jessica.\n\n     Yueh removes the Duke's signet ring and shows it to\n     him.\n\n                      YUEH (CONT'D)\n               For Paul...\n\n     He implants the tooth.\n\n     Yueh becomes more and more blurred.  His image\n     begins to fade.  His lips move in the darkness.  The\n     generator WHINE is low and going lower and lower.\n\n                      YUEH (CONT'D)\n               When you see the Baron, remember the\n               tooth!  The tooth!\n\n119. (Deleted)\n\n119A.     INT. COMMUNICATIONS ROOM - ARRAKEEN PALACE -\nNIGHT\n\n     ATREIDES GUARD #1 comes running down the steps and\n     up to the CAPTAIN and a TECHNICIAN.\n\n                    ATREIDES GUARD #1\n               The shield is down!  The shield is down!\n\n                 ATREIDES GUARD CAPTAIN\n               Harkonnen...\n                    (turns and shouts)\n               Get that shield up!\n--\n119B.     EXT. LANDING FIELD - ARRAKEEN - NIGHT\n\n     A warning TONE begins.  TROOPS begin pouring onto\n     the field.\n\n119C.     EXT. ROCK - LANDING FIELD - ARRAKEEN - NIGHT\n\n     Troops race toward their ships.\n\n119D.     (Deleted)\n\n119E.     INT. GUARD HOUSE - ARRAKEEN PALACE - NIGHT\n\n                     ATREIDES GUARD\n               The shield!  The shield!\n\n120. INT. PASSAGEWAY - ARRAKEEN PALACE - NIGHT\n\n     A loud warning TONE vibrates.  Thufir turns away\n     from the doorway of a small room where he's\n     horrified to SEE...\n\n120A.     INSERT\n\n     ... a chemical FIRE consuming the thousands of\n     Atreides weirding modules.\n\n121. through 121A.  (Deleted)\n\n123. EXT. PALACE - ARRAKEEN - NIGHT\n\n     A thousand Harkonnen ships dive over Arrakeen and\n     the Palace.  Giant deep thunderous EXPLOSIONS\n     shatter the land.  Billowing SMOKE clouds column\n     upwards, forming a black wriggling death curtain\n     around the Palace.\n\n124. INT. PASSAGEWAY - ARRAKEEN PALACE - NIGHT\n\n     Troops are running through the passageway, right and\n     left.  SMOKE is everywhere and the horrible SOUNDS\n     of the explosions continue.  The SOUNDS of stone\n     crunching, shifting, and breaking.  SCREAMS.  A wall\n     of stone suddenly cracks open.  A burst of air and\n     dust shoots out, HISSING.  The Duke's dog runs\n     through the passageway WHINING with fear.\n--\n125. (Deleted)\n\n125A.     EXT. HARKONNEN SHIP - LANDING FIELD - ARRAKEEN\n- NIGHT\n\n     Sardaukar rush out of a Harkonnen ship.  Their\n     electrically distorted faces come screaming toward\n     us.\n\n125B.     (Deleted)\n\n126. EXT. LANDING FIELD - ARRAKEEN - NIGHT\n\n     Harkonnen hammer ships thunder the ground, sending\n     cracks and fissures throughout the landing field.\n     Harkonnen scare SIRENS scream.\n\n126A.     EXT. HAMMER SHIPS - ARRAKEEN - NIGHT\n\n     Atreides soldiers run from the hammer ships.\n\n129. EXT. GROUNDS - ARRAKEEN PALACE - NIGHT\n\n     FIRE and SMOKE.  SCREAMS.  An ATREIDES SOLDIER's\n     head is hit with a large white hot piece of\n     explosion.  Through the black smoke, large SARDAUKAR\n     chase after THREE SOLDIERS and them with hydraulic\n     knife-guns.  One blade enters the back of one man's\n     head and comes out his nose.  Tremendous NOISE of\n     battle.  Gurney and a squad of TROOPERS climb\n     through bodies and thick smoke.  Gurney has the\n     Duke's dog safely inside his coat.  The little dog's\n     head sticks out -- looking about.  Gurney strokes\n     the dog's neck when the reach safety behind some\n     rock.  Small glimpses, as the smoke moves this way\n     or that, let them see thousands of Sardaukar\n     fighting.\n\n                         GURNEY\n               LONG LIVE DUKE LETO!\n\n                        TROOPERS\n               Long live Duke Leto!\n\n     The CRY from the men rings out as they attack with\n     frenzy equalling that of the Sardaukar.\n\n127. INT. AUTOPSY ROOM - ARRAKEEN PALACE - NIGHT\n\n     The distant HAMMERING of the Harkonnen hammer ship.\n     Jessica's eyes open and she sees two big boots but\n     they seem to be floating above the stone floor she\n     is lying on.  She is gagged and tied.  She looks up.\n     She sees the huge Baron Harkonnen staring down at\n     her.  In the distance she HEARS the battle raging.\n--\n                          BARON\n               The drug was timed.  Dr. Yueh has been\n               very valuable to us....  What a pity you\n               must remain gagged.  We can't let\n               ourselves be swayed by your witch's Voice,\n               now, can we?\n\n                         JESSICA\n                    (inner voice)\n               Leto... where are you?\n\n86.  INT. A ROOM - ARRAKEEN PALACE - DAY\n\n     Dr. Yueh covers his face with his hands in a\n     darkened room... sobbing.\n\n127. BACK TO SCENE\n\n     The Baron floats across the room with suspensor-\n     borne lightness.\n\n                          BARON\n               Goodbye, Jessica and goodbye to your sweet\n               son....  I want to spit once on your\n               head... just some spittle on your face --\n               what a luxury.\n\n     He spits on her cheek.  The Baron floats out of the\n     room into the passageway.\n\n                     BARON (CONT'D)\n               We were ordered to kill them... so kill\n               them.\n\n129. BACK TO SCENE - BATTLE\n\n127. BACK TO SCENE\n\n                          NEFUD\n               What are your orders, Piter?\n\n                          PITER\n               Take them to the desert, as the traitor\n               suggested and worms will destroy the\n               evidence.  Their bodies must never be\n               found.\n--\n129. BACK TO SCENE - BATTLE\n\n127. BACK TO SCENE\n\n                          PITER\n                    (whispering to Jessica, rubbing the\n                    spittle around on her face with his\n                    hand, delicately)\n               I'd thought of many pleasures with you.\n               It is perhaps better that you die in the\n               innards of a worm.  Desire clouds my\n               reason....  That is not good... that is\n               bad.\n\n129. BACK TO SCENE\n\n128. INT. SUB-BASEMENT PASSAGEWAY - ARRAKEEN PALACE -\nNIGHT - SHIELD\n     EFFECT\n\n     Duncan Idaho kills a Sardaukar soldier and rushes\n     forward frantically.  His eyes blaze intensely.  He\n     yells out to the other Atreides soldiers.\n\n                         DUNCAN\n               They're on this floor somewhere....\n\n     The soldiers disappear, searching in another\n     direction.  Duncan runs, pounding, down the\n     passageway -- his eyes searching in every doorway.\n     Suddenly twelve huge Sardaukar round a corner on a\n     quick march.  Duncan turns his shield up and charges\n     them.  Behind them he sees Paul and Jessica bound in\n     straps and being carried.\n\n     Duncan attacks and fights valiantly but he is\n     outnumbered.  In the fight the lights are blown out\n     and Duncan is killed by a slow stunner pellet\n     through the head.  Paul strains to help.\n\n                          PAUL\n                    (seeing Duncan)\n               Duncan!!  Duncan!!\n\n     Paul and Jessica are carried off, quickly, through\n     the darkness.  The battle SOUNDS thundering.\n--\n128A.     DUNCAN'S BODY - INT. SUB-BASEMENT PASSAGEWAY -\nARRAKEEN PALACE\n     - NIGHT - SHIELD EFFECT\n\n     Duncan's dead, shielded body slides sparking in the\n     dark against the passageway walls.\n\n129. BACK TO SCENE - BATTLE - RABBAN ON BRIDGE\n\n131C.     (Deleted)\n\n132. EXT. PALACE - ARRAKEEN - NIGHT\n\n     FIRE and SMOKE.\n\n133. INT. OBSERVATION ROOM - ARRAKEEN PALACE - NIGHT\n\n     The Baron's face, the light of FIRE and EXPLOSIONS\n     playing over it.  The Baron turns as Piter ushers in\n     the traitor Yueh.\n\n                          BARON\n                    (to Yueh - quietly)\n               You wish now to join your wife, is that\n               it, traitor?\n\n     A sudden flash of hope crosses Yueh's face.\n\n                          YUEH\n               She lives?\n\n     The Baron smiles, almost sympathetically.\n\n                          BARON\n               You wish to join her... join her, then.\n\n     Piter moves to Yueh, a knife glistening in his hand.\n     It flashes into his back.  A GASP escapes Yueh's\n     throat, a sad look passing over his face, as if to\n     say \"I thought as much.\"  He stands stiffly, then\n     falls gasping.  He tastes his own blood, then dies.\n\n                          BARON\n               Take him away.\n\n144. EXT. GROUNDS - ARRAKEEN PALACE - NIGHT\n\n     Black smoke palms.\n--\n145. EXT. LANDING FIELD - ARRAKEEN PALACE - NIGHT\n\n     Rabban strides in front of his uncle's ship,\n     carrying Kynes over his shoulder.  Harkonnen and\n     Sardaukar SOLDIERS stand at attention.  Rabban tears\n     off Kynes' stillsuit. Kynes falls.\n\n                         RABBAN\n               He was in the Palace with the Atreides...\n               I also say he was a spy for the Emperor.\n                    (looking up to the troops)\n               Go now!  Take him to his desert to die.\n               Go!\n\n129A.     EXT. HARKONNEN ORNITHOPTER - NIGHT\n\n     The small `thopter climbs toward the Shield Wall\n     through a SMOKEY atmosphere illuminated by distant\n     EXPLOSIONS.\n\n130. INT. HARKONNEN ORNITHOPTER - NIGHT\n\n                         JESSICA\n                    (inner voice)\n               Yueh's sign.  He's left a satchell.\n\n     Jessica and Paul, bound by cabin straps, lie in the\n     back, the two guards at the controls.  Outside,\n     `thopters and ships fly past them toward the city.\n     The distant FIRES play over Jessica's face as she\n     sees Yueh's triangular tattoo scratched in the cabin\n     roof.\n\n                   HARKONNEN GUARD #1\n               I'd like to have some fun before we kill\n               her.\n\n                   HARKONNEN GUARD #2\n                    (laughing)\n               Of course... what did you think?\n\n     Jessica looks to Paul.\n\n                          PAUL\n                    (struggling to use The Voice)\n               Don't touch my mother...\n\n                         JESSICA\n                    (inner voice)\n               Oh great mother!  He's trying the voice.\n               The Reverend Mother said it could save\n               him.\n\n                   HARKONNEN GUARD #1\n               Did you hear a noise from the little one?\n--\n                   HARKONNEN GUARD #2\n               I didn't hear anything.\n\n                   HARKONNEN GUARD #1\n               No?\n\n                   HARKONNEN GUARD #2\n               No.\n\n     He turns and hits Paul in the shoulder with a\n     stungun.  Paul recovers and starts taking long,\n     calming breaths.\n\n                         JESSICA\n                    (inner voice)\n               The calming exercise.\n\n                   HARKONNEN GUARD #1\n               The little one!\n                    (they laugh)\n\n     Suddenly, Guard #1 reaches around and puts his hand\n     up Jessica's skirt.  He starts breathing hard.  Paul\n     clears his throat.\n\n                          PAUL\n                    (using The Voice)\n               Remove her gag!\n\n                         JESSICA\n                    (inner voice)\n               Excellent!\n\n     Guard #1 finds himself removing Jessica's gag.\n     Guard #2 turns away from his controls but seems\n     powerless to stop him.  Once, it's off Jessica\n     smiles seductively and writhes on the `thopter\n     floor.\n\n                    JESSICA (CONT'D)\n                    (The Voice)\n               There's no need to fight over me.\n\n     The two men stare at one another a moment.  Then\n     Guard #1's hand, glinting silver, flashes into Guard\n     #2's chest, killing him.  Guard #1 pulls the knife\n     out, smiling.  The ornithopter begins to veer off\n     into a dangerous nose dive.\n\n                   HARKONNEN GUARD #1\n               Now?\n\n                         JESSICA\n                    (The Voice)\n               First cut my son's bonds.\n--\n     Guard #1 slowly cuts Paul's big straps, never taking\n     his eyes off Jessica.  The ornithopter gets closer\n     and closer to the top jagged surface of the Shield\n     Wall.\n\n                    JESSICA (CONT'D)\n                    (The Voice)\n               That's it.\n\n     The blade cuts through the strap holding Paul's\n     legs.  Paul kicks upwards extremely powerfully and\n     his foot breaks through the man's chest cavity and\n     drives his heart up into his head, spewing blood out\n     the man's mouth.  Paul grabs the controls but it's\n     too late.  The ship falls into the rock.\n\n130A.     EXT. HARKONNEN ORNITHOPTER - DESERT - NIGHT\n\n     The `thopter slides across the rock, shearing off a\n     wing.  Suddenly they are beyond the rock three miles\n     above the great desert and plummeting fast toward\n     the dunes below.\n\n130. BACK TO SCENE\n\n     Paul pulls desperately on the controls and manages\n     to keep the ship aloft and flying into the deep\n     desert.\n\n                         JESSICA\n               Oh, my God!\n\n131. through 131A.  (Deleted)\n\n131B.     EXT. PALACE - ARRAKEEN - NIGHT\n\n     CU violently burning palm.\n\n133. BACK TO SCENE\n\n     Nefud exits - TWO HARKONNENS wheel in the stretcher,\n     and swing it round - one of the GUARDS hands Piter\n     his knife back - the Guards exit and the door closes\n     - Piter moves up to Duke Leto and leans over him\n     moving his knife across the Duke's face.\n\n     The Baron flies down to the stretcher.\n\n                          BARON\n               Duke Leto Atreides.  Someone's torn the\n               insignia off your uniform.  Such\n               carelessness.\n\n     Leto shows no sign that he has heard.\n--\n                          PITER\n               It was Feyd.\n\n     Leto's POV:  The Baron and his Mentat are only DIM\n     FARAWAY SHAPES.  Their voices reach Leto as if\n     travelling across a greater distance.  The Baron\n     looks to Leto and then moves to him, looking him\n     over.\n\n                          BARON\n               It was Feyd?\n                    (laughing)\n               It was Feyd!  Where is the ducal signet\n               ring?  I must have his ring.\n\n                          PITER\n               The ring?... he was brought to us as is,\n               Baron.  I...\n\n                          BARON\n               You killed the doctor too soon, you fool!\n\n                        DUKE LETO\n                    (inner voice)\n               Yueh... Yueh... dead... Paul and Jessica\n               safe... the tooth!\n\n                          PITER\n               He's coming round, my Lord.\n\n     The Baron moves from behind a table stacked with\n     dirty dishes and foodstuffs and goes to Leto.\n\n                        DUKE LETO\n                    (inner voice)\n               Wait... he must be near...\n\n                          BARON\n               Where is your ring?\n\n     The Baron's face is now very close to Duke Leto's.\n\n                     BARON (CONT'D)\n               You do not answer!\n\n                        DUKE LETO\n                    (very faint)\n               A... little... closer....  The... water...\n               of my life... for Paul.\n\n     The Baron briefly wonders at these words and then\n     turns to Piter.\n--\n                          BARON\n               He's crying!\n                    (he hits Duke Leto)\n               He's crying!  He's crying, Piter.  What\n               does he mean?\n\n     Piter moves forward.  The Baron sees a suculent\n     piece of chicken skin on the table.  He picks up the\n     plate, then the chicken skin.\n\n     Leto's POV:  It's grown HAZY again.  The Baron is\n     beginning to move away, reaching for the small piece\n     of chicken skin.  Piter leans close to Leto.\n\n                        DUKE LETO\n               Now!\n\n     We hear a CRUNCH, hear a tumultuous RUSHING SOUND as\n     Piter's face is pushed forcibly away.  The Baron is\n     turning, a dumbfounded look on his face.  He drops\n     the plate, and backs away.\n\n     There is a tremendous ROARING.  Bits of visions of\n     Caladan rush through Leto's ever-darkening\n     consciousness --\n\n     MENTAL IMAGES:\n\n134. through 134A.  (Deleted)\n\n134B.     EXT. CLIFF WALL - CALADAN - DAY\n\n     The Atreides banner, the green of it, then the\n     black.  The blackness flaps; then all fades to\n     SILENCE.\n\n135. INT. HARKONNEN ORNITHOPTER - NIGHT\n\n     As they fly deeper into the desert with the ship\n     shuddering and straining, Jessica suddenly cries out\n     with tremendous premonition and fear.\n\n                         JESSICA\n               Leto!  Leto!\n\n     Tears course down her cheeks as Paul turns to her.\n\n                    JESSICA (CONT'D)\n                    (to Paul)\n               Leto!  He's dead!  He's dead...\n--\n                          PAUL\n               I know\n                    (inner voice)\n               I have NO FEELINGS!!  Why?\n\n136. INT. OBSERVATION ROOM - ARRAKEEN PALACE - NIGHT\n\n     Duke Leto and Piter lie dead.\n\n137. INT. ARRAKEEN PALACE - NIGHT\n\n     The Baron floats near the ceiling in a small\n     passageway.  He is ecstatic.\n\n                          BARON\n                    (screaming)\n               I'm alive!!!  I'm alive!!!\n\n137A.     INT. HARKONNEN `THOPTER - NIGHT\n\n     Paul is fighting the controls of the Harkonnen\n     `thopter.\n\n137B.     CLEAN POV\n\n     Harkonnen `thopter lights on dunes.\n\n137A.     BACK TO SCENE\n\n                          PAUL\n               I can't maintain any altitude... we'll\n               never reach the safety of rock.  Maybe\n               that small rock.\n\n                         JESSICA\n               Where are we do you think?\n\n                          PAUL\n               The South Polar regions... the forbidden\n               area.  We must make it to that rock...\n\n137C.     EXT. HARKONNEN `THOPTER - DEEP DESERT - NIGHT\n\n     The `thopter violently hits the sands and flips up -\n     - almost turning over.  It falls slowly back,  then\n     slides down the side of a dune.\n--\n137D.     EXT. HARKONNEN ORNITHOPTER - DESERT - NIGHT\n\n                          PAUL\n               Hurry!\n\n     He jumps out of his seat.\n\n                         JESSICA\n               Bring these satchels!\n\n     She hands him one.\n\n                          PAUL\n                    (at doorway)\n               Hurry -- This crashing may bring a worm.\n\n     As Paul puts the satchel over his shoulder, he feels\n     something.  He looks at his father's ring.  He\n     stares at it silently, then closes his hand around\n     it.  They jump outside.\n\n                         JESSICA\n                    (starting to cry)\n               A million deaths are not enough for\n               Yueh...\n\n                          PAUL\n                    (inner voice)(reacting to his\n                    mother's tears)\n               Where are my feelings... I feel for no\n               one...\n\n138. EXT. ROCK - DESERT - NIGHT\n\n     Paul and Jessica running.  Paul pulls Jessica to a\n     place in the wall where a small overhang offers\n     shelter.  Jessica falls to the ground.  She CRIES,\n     pouring out her grief, but soon the sound of it is\n     carried away by the building rush of WIND.  Paul\n     turns and looks out to the open desert, this portion\n     of which is a dust ocean.\n\n138A.     PAUL'S POV:\n\n     The Mouse Moon has risen.\n\n     Ripples of dust undulate tide-like in the light of\n     the moon.  The WHISPERING grains billow up like the\n     foam of waves as they hit the rock.\n\n138. BACK TO SCENE\n\n     Paul turns, his face illuminated by the two moons\n     above.  His eyes lock on the moon which has the\n     image of the mouse.\n--\n                          PAUL\n                    (inner voice)\n               The second moon... from the dreams...\n\n138B.     INT. PAUL'S EYE - NIGHT\n\n     We move into Paul's eye, where the mouse moon appear\n     and revolves slowly.  The moon begins to explode.\n     The pieces of the moon soar toward us burning with\n     white-hot flames.  Within the flames we see...\n\n139. (Deleted)\n\n139A.     EXT. ARRAKEEN PALACE - NIGHT\n\n     ... the burning Palace of Arrakeen.  We move closer\n     to it.\n\n189B.     INT. OBSERVATION ROOM - ARRAKEEN PALACE - NIGHT\n\n     We then see Duke Leto's face.  The Baron leans over\n     the Duke and clutches the skin on the Duke's face.\n     He begins pulling it.  The skin on the Duke's race\n     slowly rips open -- making a hideous tearing SOUND.\n     Black SMOKE issues forth from the hole which teats\n     larger.\n\n                       PAUL (V.O.)\n                    (distorted)\n               House Atreides is ruined.\n                    (less distorted)\n               This moon holds my past.\n\n139C.     INT. VESTIBULE - OBSERVATION ROOM - NIGHT\n\n     Inside and through the SMOKE Paul sees Feyd tear the\n     Red Duke insignia off his father's uniform.  He sees\n     Feyd laughing.  The moving, now-brilliant red hawk\n     insignia becomes...\n\n139D.     EXT. CASTLE CALADAN - NIGHT\n\n     ... a burning meteor ROARING over the castle on\n     Caladan.  The meteor crashes in the black sea.\n\n                       PAUL (V.O.)\n               This moon holds my future.\n--\n139E.     INT. WATER - NIGHT\n\n     Foaming confusion turning into a small, twisting\n     fetus under the sea.  Its eyes closed.  Moving close\n     to it, its eyes snap open.  Through the eyes is the\n     pale white face of JESSICA.\n\n139F.     EXT. SHIELD WALL - DESERT - NIGHT\n\n     There is a huge soaring WIND sound and beyond\n     JESSICA the dunes roll like ocean waves.\n\n139G.     EXT. MOUSE MOON - NIGHT\n\n     The moon continues to spew out pieces of moving\n     images which are seen then disappear as fast as\n     sparks.  The broken, burning pieces float eerily\n     toward us over the undulating dunes below.  One\n     image floats closer.  It is a hand folded into a\n     fist.\n\n                       PAUL (V.O.)\n               I am only a seed...\n\n     The fist begins to open.\n\n                    DUKE LETO (V.O.)\n               The seed must grow.\n\n     The hand opens fully with slow blue fluid pulsating\n     out the very center of the palm.  The hand floats\n     eerily forward.\n\n                    DUKE LETO (V.O.)\n               The sleeper must awaken.\n\n139H.     EXT. WATER - NIGHT\n\n     The last image which passes is foaming and spitting\n     dark blue water.  As the image passes, the black\n     smoke trailing behind it obscures the picture to\n     blackness.\n\n140. EXT. ROCK - DESERT - NIGHT\n\n     Through the darkness we move to Paul's clenched\n     hand.  It opens, revealing the signet ring in the\n     very center of his palm.  Paul looks upward to the\n     moons of Arrakis.  He looks back to the ring, then\n     to his mother.\n\n                          PAUL\n               Listen to me!... you wanted to know about\n               my dreams... and I've just had a waking\n               dream... do you know why?...\n--\n                         JESSICA\n               Calm yourself/\n\n                          PAUL\n               The spice!  It's in everything here.  The\n               air, the soil, the food...  It's like the\n               Truthsayer drug.....  It's a poison!!!!\n               You knew the spice would change me.  But\n               thanks to your teachings it's changed my\n               consciousness.  I can see it... I can see\n               it.\n\n                         JESSICA\n                    (inner voice)\n               Is he....?\n\n                          PAUL\n               You carry my unborn sister in your womb!\n\n                         JESSICA\n                    (inner voice)\n               He knows.\n\n                          PAUL\n               You and your Bene Gesserit sisterhood...\n               I'm not your Kwisatz Haderach...  I'm\n               something different, something unexpected!\n                    (inner voice)\n               I'm a seed.\n                    (out load)\n               I am so much more...  You don't begin to\n               know me...\n\n141. through 142A.  (Deleted)\n\n142B.     EXT. ROCK - DESERT - NIGHT\n\n     Paul's head goes down.  He places the ring on his\n     finger.\n\n                          PAUL\n                    (inner voice)\n               Father... now I have become a killer and I\n               will continue to kill until I have avenged\n               your death.\n                    (out loud)\n               Father!\n\n     Jessica cries as she stares at her son.\n\n143. through 143A.  (Deleted)\n--\n145. BACK TO SCENE\n\n     Rabban stops up the ramp.  He wears a large smile.\n     His thick head sweats and sweat runs down his thick\n     neck.  He goes inside and the doors swing closed.\n\n146. INT. HARKONNEN SHIP - NIGHT\n\n     He enters the ship and moves down within to the\n     Baron's headquarters, passing two dwarves cooking a\n     dead legless cow which hangs from chains.  Rabban\n     tears out the cow's tongue and eats it.  Then he\n     exits through a door which closes behind him.\n\n147. INT. BARON'S QUARTERS - HARKONNEN SHIP - NIGHT\n\n     The Baron is flying wildly, circling the outside of\n     a large steel shower, while Nefud and a DWARF play a\n     strange instrument producing maniacal, perverse,\n     screaming MUSIC.  The Baron SEES Rabban enter, but\n     continues to fly around the shower.\n\n                          BARON\n                    (very excited)\n               Rabban!!... we're knee deep in Atreides\n               blood!  We've gutted them.  We've gutted\n               them!\n                    (laughs)\n\n     The Baron floats to Rabban and begins lovingly\n     massaging Rabban's massive neck as he speaks to him.\n\n                          BARON\n               Rabban, Rabban...  I place you in charge\n               of Arrakis.  It's yours to squeeze, as I\n               promised.  I want you to squeeze and\n               squeeze and squeeze.\n                    (massaging in rhythm)\n               Give me spice!  Drive them into utter\n               submission.  You must not show the\n               slightest pity or mercy... as only you\n               can...  Never stop!\n                    (releasing him)\n               Go....  Show no mercy!\n\n                         RABBAN\n               Yes, my lord Baron.\n\n     Rabban leaves just as Feyd steps out of the shower.\n     The Baron turns to him lovingly.\n--\n                          BARON\n                    (to Feyd)\n               And when we've crushed these people enough\n               I'll send in you Feyd... they'll cheer you\n               as a rescuer... lovely Feyd... really a\n               lovely boy.\n                    (suddenly he smiles and screams)\n               Where's my doctor?\n\n148. INT. HARKONNEN SHIP - NIGHT\n\n     As Rabban leaves, he looks into one room of the\n     ship.  Behind the glass porthole sits Thufir Hawat\n     bound head and foot, his eyes darting this way and\n     that.\n\n148A.     EXT. ROCK - DESERT - NIGHT\n\n     Paul and Jessica are in stillsuits.  Paul is looking\n     through a Fremkit.  He finds a paper with Dr. Yueh's\n     mark on it.\n\n                          PAUL\n                    (inner voice)\n               Yueh's left the plans for the weirding\n               modules.\n\n148B.     EXT. MOONS - ARRAKEEN - DESERT - NIGHT\n\n     The moons have moved further across the sky.\n\n148A.     BACK TO SCENE\n\n     Suddenly Paul turns and studies his mother.  A\n     stronger WIND comes up.\n\n                          PAUL\n               We have to get to that mountain of rock.\n               We have entered the time when all will\n               turn against us and seek our lives...\n\n     Jessica gets up.  They make their way up the crest\n     of a dune by a small rock.\n\n                      PAUL (CONT'D)\n               It's further than I thought... a worm is\n               sure to come....  I'll plant a thumper,\n               that should divert it.\n--\n     Paul moves off into the shadows.  Suddenly, Jessica\n     SEES a burst of LIGHTNING illuminate the mountain of\n     rock in the distant and the vast dunes before them.\n\n                    JESSICA (CONT'D)\n                    (inner voice)(as Paul leaves to light\n                    the thumper)\n               ...the night is a tunnel... a hole into\n               tomorrow... if we're to have a tomorrow...\n\n149. through 151.   (Deleted)\n\n151A.     EXT. DEEP DESERT - NIGHT\n\n     Paul plants the thumper which begins a powerful\n     rhythmic noise.  He turns to Jessica.\n\n                          PAUL\n                    (returning)\n               Remember... walk without rhythm and we\n               won't attract a worm... it'll go to the\n               thumper.\n\n                         JESSICA\n                    (puts in her noseplug)\n               I'm ready.\n\n     Paul and Jessica move into camera and exit right.\n\n151B.     EXT. DEEP DESERT AND ROCKS - NIGHT\n\n     Another burst of LIGHTNING.  The distant rock seems\n     to have grown no larger.  Their muscles begin to\n     ache.  Suddenly they HEAR the thumper start behind\n     them.\n\n                          PAUL\n               Keep going...\n\n152. EXT. DEEP DESERT AND ROCKS - NIGHT (LATER)\n\n     Their breathing becomes very labored.  The sand\n     moves like slow water, forever rolling down and up.\n     Then they hear the worm, the low thundering HISS\n     shaking the tonnage of sand.  The thumper stops.\n     Paul turns.\n\n                          PAUL\n               Faster!!\n--\n                         JESSICA\n                    (screaming)\n               It's deafening!\n\n     Their bodies ache and they feel like dropping, yet\n     the cliff is still a good distance away.  The worm\n     SOUND grows louder and Paul turns to look.\n\n153. EXT. WORM - DESERT - NIGHT\n\n     A flash of LIGHTNING.  The worm is now coming toward\n     them.  The mound of sand over the worm is enormous\n     and is approaching at a terrifyingly fast speed.\n     The power of this worm is awesome.\n\n153A.     EXT. DEEP DESERT - NIGHT\n\n                          PAUL\n                    (screaming)\n               Run!\n\n                         JESSICA\n               I can't... I can't.\n\n     She turns to see.  Then she runs.\n\n153B.     EXT. DRUM SAND - DEEP DESERT - NIGHT\n\n     All at once their feet tromp down on firmer sand.\n     The SOUND is very loud.\n\n                          PAUL\n               Drum sand!\n\n     The DRUMMING sound ECHOES deep within the ground.\n     Jessica falls.  Paul stops and drags her up.  They\n     run again.  The worm SOUND becomes unbearably loud.\n     Static electricity SPARKS giant bolts of pure white\n     LIGHTNING and the air turns to ozone.  Finally they\n     find rock.  Behind them the SOUND of the worm\n     changes.  They turn.\n\n154. EXT. WORM - DEEP DESERT - NIGHT\n\n     The gigantic head of the worm is just breaking\n     through the sand.  The mouth begins to open in an\n     eighty-foot circle of teeth and darkness.  The mouth\n     arches forward searching for them.\n\n155. EXT. BASE OF THE CLIFF - DEEP DESERT - NIGHT\n\n     Paul and Jessica climb up and up inside a narrow\n     slit of rock.\n--\n155A.     INT. ROCK CLIFF - DESERT - NIGHT\n\n     The worm's mouth climbs higher also but it cannot\n     penetrate the narrow opening in the rock.\n\n156. EXT. ROCK CLIFF - NIGHT\n\n     Paul and Jessica have scrambled upwards a couple of\n     hundred feet.\n\n156A.     EXT. WORM AND ROCK - NIGHT\n\n     Still the worm stretches up to them.  Suddenly the\n     worm begins BANGING on the rock.  Huge SHUDDERS\n     drive through the black stone.  Over and over again\n     the worm mindlessly hits at the rock.\n\n156B.     EXT. ROCK CLIFF - NIGHT\n\n     Paul and Jessica crouch further back in the tiny\n     passageway of safety, but a solid back wall of rock\n     prevents them from moving back any more.\n\n156C.     INT. ROCK CLIFF - NIGHT\n\n     The breath from the worm is like a hurricane of\n     WIND.\n\n                          PAUL\n                    (inner voice)\n               Cinnamon... the spice!\n                    (out loud)\n               Do you smell it?\n\n                         JESSICA\n               Yes...\n\n                          PAUL\n                    (inner voice)\n               I know the secret.  The worm is the\n               spice... the spice is the worm.\n\n157. (Deleted)\n\n157A.     EXT. ROCK CLIFF - DEEP DESERT - NIGHT\n\n     Suddenly a colossal section of the rock wall cracks\n     and topples off into the worm's mouth.  Instantly\n     the worm pulls back.  A huge FIRE roars deep within\n     the worm consuming the rock.\n--\n158. INT. ROCK CLIFF - DEEP DESERT - NIGHT\n\n     The worm now can get even closer to Paul and\n     Jessica.  It looms up again and crushes its mouth up\n     against the rock.\n\n158A.     EXT. ROCK CLIFF - DEEP DESERT - NIGHT\n\n     Another fissure opens, and suddenly half the rock\n     wall protecting them splits off entirely and\n     falls... taking Paul with it.\n\n158B.     EXT. WORM AND ROCK - NIGHT\n\n     ...against the worm.\n\n159. EXT. ROCK CLIFF - DEEP DESERT - NIGHT\n\n     Paul is knocked off the cliff and falls straight\n     down two hundred feet.  His feet skid along the face\n     of rock.  He bounces and brakes.  He hits and jumps.\n     He careens from one boulder, flies upside down,\n     rights himself then tumbles and skids into the sand.\n     Unhurt, he jumps up and scrambles up another part of\n     the rock to safety.\n\n160. EXT. ROCK CLIFF - DEEP DESERT - NIGHT\n\n                         JESSICA\n               Paul!\n\n     She presses against the narrow ledge that is left\n     after the worm assault.\n\n161. EXT. BASE OF THE CLIFF - DEEP DESERT - NIGHT\n\n     The worm is just coming up again when distant\n     THUMPING is heard.  The worm, as if charmed by the\n     sound, turns and moves off towards it.\n\n                          PAUL\n                    (inner voice)\n               A thumper.\n\n161A.     (Deleted)\n\n162. EXT. ROCK CLIFF - DEEP DESERT - NIGHT\n\n     Jessica climbs further up and manages to get over to\n     a place where she can meet up with Paul, who is now\n     climbing back.\n--\n                         JESSICA\n                    (crying)\n               What's happened?...  Why did it leave?\n\n                          PAUL\n                    (breathing heavily)\n               Someone started another thumper....  We're\n               not alone.\n\n     They climb upwards until the ledge ends at the mouth\n     of a dark crevice.  Paul and Jessica try to see into\n     the inky black hole.\n\n163. EXT. CREVICE - DEEP DESERT - NIGHT\n\n     Slowly Paul and Jessica enter, inching forward.  A\n     low moan of WIND comes up.  Paul can see nothing,\n     then suddenly he SEES stars above and SEES the hint\n     of stairs cut into the rock.\n\n                         JESSICA\n                    (whispering)\n               Man-carved steps.\n\n                          PAUL\n                    (whispering)\n               Yes...\n\n     They climb the steps and enter an extremely narrow\n     dark channel of stone.  As they make their way\n     through the rock, suddenly there is a burst of\n     lightning which illuminates a whole troop of Fremen\n     standing silently in front of them.\n\n164. EXT. FREMEN PLACE - DEEP DESERT - NIGHT\n\n                         STILGAR\n               Perhaps these are the ones Mapes told us\n               of.\n\n                         STILGAR\n                    (to Jessica)\n               Are you trained in the ways of the desert?\n\n                         JESSICA\n               No, but many consider my training\n               valuable.\n\n                         STILGAR\n               I will take the boy-man... he shall have\n               sanctuary in my tribe...\n--\n     A LOW NOTE on a dip stick is blown by one of the\n     Fremen tribe.  Jessica shifts, Paul sees it, and\n     just as Stilgar begins a reach for his weapon,\n     Jessica turns, slashes out, utters a SOUND, whirls\n     again and with rock behind her holds Stilgar\n     helpless in front of her -- her hand at his throat.\n     Paul moves on her first move.  He races up a rocky\n     incline.\n\n165. EXT. CLIFF - FREMEN PLACE - DEEP DESERT - NIGHT\n\n     He then jumps higher up and presses himself between\n     two rocks on a low cliff overlooking the rest of the\n     Fremen troop.\n\n166. EXT. FREMEN PLACE - DEEP DESERT - NIGHT\n\n     The troop starts shooting projectile weapons in\n     Paul's direction.\n\n                         STILGAR\n               Stop!  Get back!!  She has the weirding\n               way.  Why didn't you tell us!  Great\n               gods... if you can do this to the\n               strongest of us you're worth ten times\n               your weight of water.  As a leader of my\n               people I give you my bond: teach us this\n               weirding way and you both shall have\n               sanctuary.  Your water shall mingle with\n               our water.\n\n                         JESSICA\n               Then I will teach you our way of\n               battle....  you have the word bond of a\n               Bene Gesserit.\n\n                        A FREMEN\n               It is the legend.\n\n167. EXT. CLIFF - FREMEN PLACE - DEEP DESERT - NIGHT\n\n     Up on the rock, Paul turns.  He takes a step, then\n     notices a small figure standing in front of him.  It\n     is a girl.\n\n                          CHANI\n               I am Chani, daughter of Liet....  I would\n               not have permitted you to harm my tribe.\n\n                          PAUL\n                    (inner voice)\n               From my dream... so beautiful.  Liet....\n               is this Kynes' daughter?\n\n     Paul stares at her in wonder.\n--\n                          CHANI\n               Come with me.  I'll show you an easier way\n               down.\n\n     They exit.\n\n168. EXT. FREMEN PLACE - DEEP DESERT - NIGHT\n\n                         STILGAR\n                    (to Paul, as they meet)\n               You have strength... real strength... You\n               shall be known as Usul, which is the\n               strength of the base of the pillar.  This\n               is your secret name in our troop.  But you\n               must choose the name of manhood which we\n               will call you openly.\n\n                          PAUL\n                    (thinking)\n               What do you call the mouse shadow in the\n               second moon?\n\n                         STILGAR\n               We call that one Muad'dib.\n\n                          PAUL\n               Could I be known as Paul Muad'dib?\n\n                         STILGAR\n               You are Paul Muad'dib, and your mother\n               shall be a Sayyadina among us....  We\n               welcome you.\n\n     Wind blows a cloud of dust through the rock.  High\n     above the moon with the mouse shadow glows\n     brilliantly.  It dissolves into the sun.\n\n168A.     EXT. DEEP DESERT - DAY\n\n     Paul, Jessica and the Fremen march through the\n     dunes.\n\n171. through 171B.  (Deleted)\n\n172. EXT. DEEP DESERT - DUSK/SUNSET\n\n     HEAT WAVES and sand dunes.  Mysterious SOUNDS echo\n     in the distance as the giant sun is setting.\n\n     Chani takes Paul to the top of a dune.  They stare\n     at the sunset and a huge rock outcropping in the\n     distance.\n--\n                          CHANI\n               Seitch Tabr.\n\n     Paul looks at the rock, then turns to her.\n\n                     CHANI (CONT'D)\n               Tell me of your homeworld, Usul.\n\n     These words rend Paul's soul.  He cannot speak.  He\n     reaches out and touches her hand - her cheek.\n\n173. (Deleted)\n\n174. INT. ENTRANCE - SIETCH TABR - NIGHT\n\n     The Fremen troop enters into a large square room\n     with slot passageways going off in various\n     directions.\n\n175. INT. PASSAGEWAY - SIETCH TABR - NIGHT\n\n     They all move down one of the passageways which are\n     beautifully but very plainly cut with lasguns.  They\n     are like passages in the pyramids, dark with sharp\n     turns and inclines upwards or downwards, some very\n     steep and long, and others descending hundreds of\n     feet.  There is a strong, moaning WIND.\n\n176. through 177.   (Deleted)\n\n178. INT. PASSAGEWAY/STAIRS - SIETCH TABR - NIGHT\n\n     A quiet WIND can be heard -- deep and moaning.\n\n                         JESSICA\n               Moisture...\n\n     She looks at Paul.  He, too, notices.\n\n                          PAUL\n               Wind traps... huge ones.\n\n     Down a long, sloping, narrow passageway they go\n     until they reach a stairway cut into the stone.  It\n     is very dark and gets increasingly darker as they\n     descend.  The WIND sound grows.  The air grows\n     colder and damper.  Paul and Jessica share another\n     questioning look.  At the bottom of the stairs they\n     pass through a narrow slot doorway which suddenly\n     opens out on something so totally unexpected it\n     shocks Paul.\n--\n179. INT. RESERVOIR  -SIETCH TABR - NIGHT\n\n     It is enormous, deep reservoir of black water\n     sitting silently in the depths of this sietch and\n     stretching out into the darkness.\n\n                          PAUL\n                    (inner voice)\n               Water on Arrakis!!!\n               I have seen this place in a dream.\n                    (out loud)\n               A treasure.\n\n                         STILGAR\n               Greater than treasure, Usul.  We have\n               thousands of such caches.  Only a few of\n               us know them all.  When we have enough...\n               we shall change the face of Arrakis.\n               Listen!...\n\n     There is the sound of water dripping.  The lights\n     are extinguished - reflections play on Paul's face.\n\n                    STILGAR (CONT'D)\n               The Rocks of Arrakis hold many secrets.\n\n179A. through 180   (Deleted)\n\n180A.     REVISED SCENE - HALL OF RITES\n\n     Thousands of Fremen wait below.  Paul enters a rock\n     ledge, guided by two monks, which is crowded with\n     Fremen and old Fremen Monks.  Below the crowds\n     continue to watch and wait while a giant wind organ\n     moans.  A Monk steps up to Paul.\n\n                          MONK\n               We sense that you may be the \"voice from\n               the outer world\".  Both moons told us of\n               you.  You must pass tests before we will\n               know... you must conquer the beast of the\n               desert, both his outer and his deadly\n               inner powers.\n                    (moves back)\n               Speak to us... from the outer world.\n\n     Paul turns and gathers courage to address the\n     multitude below.\n\n                          PAUL\n                    (inner voice)\n               I am only a seed.\n                    (out loud)\n               I am Usul... Paul Muad'dib.\n--\n                         CROWDS\n                    (loud murmur)\n               Muad'dib!\n\n                          MONK\n               The legend.\n\n                          PAUL\n                    (inner voice)\n               No one ever dreamed there would be so\n               many.\n                    (out loud)\n               Our shared enemy the Harkonnens, are once\n               again in control of Arrakis.  Stilgar,\n               your leader, has asked me and my mother to\n               crush the Harkonnens.  We must do more\n               than this.  We must totally destroy all\n               spice production on Arrakis.  The Guild\n               and the entire universe depends on spice.\n\n               \"He who can destroy a thing, controls a\n               thing\".\n\n               I will take one hundred of your warriors\n               and train them.  This one hundred will\n               train the thousands that remain.  When the\n               spice flow stops, all eyes will turn to\n               Arrakis.  The Baron and the Emperor\n               himself will be forced to deal with us.\n               Arrakis will become the center of the\n               Universe.\n                    (inner voice)\n               The dream unfolds.\n\n181. through 181A.  (Deleted)\n\n182. INT. TRAINING ROOM - SIETCH TABR - DAY\n\n     Large room with a low ceiling.  A drummer playing\n     makes a low ECHOING MUSICAL HIT.  A big block of\n     stone is moved across coarse sand -- back and forth\n     -- fast.  A rhythm is started -- powerful.  Paul\n     enters, pauses and looks to Jessica - he stands in\n     front of over 100 Fremen men.  Jessica sits behind\n     him alongside Stilgar.\n\n     A large rock obelisk has been placed near Paul for\n     this demonstration.\n\n                          PAUL\n               The weirding way has long been a Bene\n               Gesserit secret.  With my mother's help,\n               my father isolated an element of the\n               weirding way and externalised it.\n--\n                          PAUL (CONT'D)\n               Because of the Harkonnen treachery, my\n               father's armies were never able to fully\n               develop this new form.  This is what I\n               will teach you.  You will be the fiercest\n               and most feared fighters in the Universe.\n\n               Our way of battle is built on rhythm.  You\n               understand rhythm like this but you do not\n               yet understand the rhythm of the higher\n               sounds, sounds that heal and build...\n               sounds that destroy.  Motion is the base.\n               You understand the motion... but you do\n               not yet understand the motion that heals\n               and builds... motions that destroy...\n\n               Orato!\n                    (he moves forward)\n               This obelisk is of your hardest stone.\n               Kick it...\n                    (he does -- the rock doesn't move)\n               Hit it...\n                    (he does -- the rock doesn't move)\n               Yell at it...\n\n                          ORATO\n               Break!\n\n     The Fremen laugh -- the rock doesn't move.\n\n     A Fremen with a lasgun tries to cut it.  Paul\n     motions him back, slightly.\n\n                          PAUL\n               Move back!\n\n     Paul also moves back.  He switches on his weirding\n     module.  He opens his mouth and makes a small SOUND,\n     which the module amplifies.\n\n                          PAUL\n               Chuksa!\n\n     The sound shatters the obelisk to pieces.  The one\n     hundred Fremen YELL with surprise and awe.\n\n                       100 FREMEN\n               Achiii!\n--\n                          PAUL\n               This is part of the weirding way that we\n               will teach you.  Some thoughts have a\n               certain sound... that being the equivalent\n               to a form.  Through sound and motion you\n               will be able to paralyze nerves, shatter\n               bones, set fires, suffocate an enemy or\n               burst his organs....  We will kill until\n               no Harkonnen breathes Arrakeen air.\n\n                       100 FREMEN\n               Muad'dib!\n\n                          PAUL\n                    (inner voice)\n               To avenge my father, I will turn you into\n               killing machines.\n\n     Stilgar turns to Jessica.\n\n                         STILGAR\n               Sayyadina.  Our Reverend Mother tells me\n               she is too old... She has been calling\n               through space and time for you to come and\n               let her rest.  She asks that you pass\n               within.\n\n                         JESSICA\n                    (inner voice)\n               They want me to take the Water of Life...\n               the Truthsayer drug... so dangerous,\n               yet... we must move swiftly if we're to\n               secure our place among these Fremen.\n                    (out loud)\n               I will try to pass within.\n\n                         STILGAR\n               Death may be the result....  Are you sure?\n\n                         JESSICA\n                    (inner voice)\n               I must do this for Paul, but what of my\n               unborn child?\n\n                                        DISSOLVE TO:\n\n183. through 187.   (Deleted)\n--\n188. INT. ROCK LEDGE - HALL OF RITES - SIETCH TABR -\nNIGHT\n\n     Fremen carry the Fremen REVEREND MOTHER RAMALLO in\n     on a litter.  The old Reverend Mother is old a frail\n     yet extremely beautiful and mysterious.  She turns\n     to Paul and Jessica with a strange look.\n\n                 REVEREND MOTHER RAMALLO\n                    (to Jessica, in an ancient voice)\n               So you are the ones.\n\n     She turns away towards the monks who are very busy\n     blowing horns and waving pots of burning spice,\n     purifying the area of the rite.  Several Fremen blow\n     on dip sticks and a FEMALE CHOIR begins a haunting\n     chorale as the giant pipe organ blows beautiful low\n     notes below.\n\n     Paul looks to his mother.\n\n     He then sees Chani.\n\n     CU Chani.\n\n     CU Paul -- he cannot stop looking at her.\n\n     Stilgar motions to Paul.\n\n                         STILGAR\n                    (whispering to Paul)\n               Do you know the Water of Life?... Come...\n               ...Watch... the mystery of mysteries...\n               the end and the beginning.\n\n     He shows Paul through a narrow passageway -- almost\n     a slot through the stone to a small room.  Through\n     an opening in the stone wall, Paul is shown a very\n     strange and somewhat horrifying scene.\n\n189. INT. BABY WORM - MAKER ROOM - SIETCH TABR - NIGHT\n\n     A thirty-foot baby worm is being lowered into a\n     stone chamber.  The chamber is then covered with a\n     wire top.  Valves are turned and water rushes into\n     the chamber.  The worm begins to writhe violently\n     and leap and bang against the bars above.  The worm\n     begins to turn inside out from the mouth back and it\n     begins to gag.  Some monks and watermasters quickly\n     drain the stone chamber and wrench the worm out\n     using large steel hooks.  They hold the worm above a\n     large tub.  A watermaster-reed man runs a long reed\n     in to the worm, causing it to spasm and gag up a\n     beautiful deep blue bile as it dies.\n\n189A.     INT. MAKER ROOM - SIETCH TABR - NIGHT\n\n     The bile and worm water are combined in ceremonial\n     containers.  Paul turns to Stilgar.\n--\n                         STILGAR\n               The Water of Life.\n\n                          PAUL\n                    (inner voice)\n               The most lethal poison in the Universe.\n\n     Then we HEAR from Paul's memory his conversation\n     with the Reverend Mother:\n\n                     REVEREND MOTHER\n               ... Many men have tried.\n\n                          PAUL\n               Did they try and fail?\n\n                     REVEREND MOTHER\n               They tried and died.\n\n190. INT. ROCK LEDGE - HALL OF RITES - SIETCH TABR -\nNIGHT\n\n     Stilgar and Paul return to the ledge above the Hall\n     of Rites.  A MONK PRIEST steps forward, addresses\n     the crowd, silencing them.  The other monks move\n     back carrying their smoking cleansing bags.\n\n                         MONK #1\n               One among us has consented to enter the\n               rite.  She will attempt to pass within\n               that we not lose the strength of our\n               Reverend Mother.\n\n                          PAUL\n                    (inner voice)(turning to his mother)\n               What if she should fail?\n\n     He brings the jug close to Jessica.\n\n                         MONK #1\n               Drink!\n\n     Jessica drinks.\n\n                         JESSICA\n                    (inner voice)\n               The ultimate awareness spectrum narcotic.\n               I must transform the poison configuration\n               within my body... the blue must be made\n               clean.\n\n     She swallows.  Her body contorts and spasms\n     violently.  She screams.  The Reverend Mother\n     screams with her.\n--\n191  (Deleted)\n\n192. INT. ROCK LEDGE - HALL OF RITES - SIETCH TABR -\nNIGHT\n\n     We see Jessica sitting, shoulders tight and spasming\n     -- straining, her eyelids half-closed and\n     flickering.\n\n193. (Deleted)\n\n194. INT. ROCK LEDGE - HALL OF RITES - SIETCH TABR -\nNIGHT\n\n     The old Reverend Mother slowly extends a hand toward\n     Jessica's shoulder.\n\n195. JESSICA - MENTAL IMAGE\n\n     Inside Jessica, we see the Reverend Mother Ramallo's\n     hand descend through the dark void.  Shimmering\n     water starts to ripple, lightly stirring an image of\n     Jessica.\n\n     As the hand penetrates, something deep within her\n     starts to GLOW.  It is a fetus, a female.  The\n     Reverend Mother Ramallo's hand flinches as it\n     touches the fetus.  The fetus sparks to life -\n     screaming and rapidly spasming upwards on its\n     umbilical cord.\n\n195A.     (Deleted)\n\n196. INT. ROCK LEDGE - WALL OF RITES - SIETCH TABR -\nNIGHT\n\n                 REVEREND MOTHER RAMALLO\n                    (whispering urgently into Jessica's\n                    ear)\n               You should have told us.\n\n197. JESSICA'S MENTAL IMAGE - FETUS\n\n             REVEREND MOTHER RAMALLO (V.O.)\n                    (gasping)\n               Great Mother!  This changes both!  What\n               have we done?\n--\n197A.     INT. THE TUNNEL - NIGHT\n\n     Jessica and the fetus rush mentally through a dark\n     strangely worm-like tunnel until suddenly, a gaping\n     black hole appears.  A horrible WIND, SPARKS and\n     circles of expanding light issues from it.\n\n                      JESSICA (V.O)\n                    (inner voice)(fearful)\n               No!  This is the place where we cannot\n               look.  The place only for the eyes of the\n               Kwisatz Haderach.\n\n197B.     THE FETUS - NIGHT\n\n     The fetus twists down the tunnel to join Jessica,\n     her umbilical cord trailing behind.  She SCREAMS as\n     she looks into the hole.\n\n197C.     THE NAVIGATOR - NIGHT\n\n     She and Jessica see a shape moving deep within the\n     windy hole.  It is a Third Stage Navigator, ROARING.\n\n                         JESSICA\n               What is this?...  Is this what kills the\n               men who enter here?\n\n     She quickly takes the fetus back up the tunnel.  As\n     they move:\n\n                 JESSICA (V.O.)(CONT'D)\n                    (inner voice)\n               Now my daughter and I are both Reverend\n               Mothers.\n\n             REVEREND MOTHER RAMALLO (V.O.)\n                    (distant)\n               I've been a long time waiting for you.\n               Here is my life.\n\n198. INT. ROCK LEDGE - HALL OF RITES - SIETCH TABR -\nNIGHT\n\n     The old Reverend Mother Ramallo slumps forward onto\n     the stone, dead.  The crowd waits.  The corpse is\n     tenderly removed.  Jessica very slowly opens her\n     eyes and looks about her.  The monk holds the jug to\n     her lips.\n\n                          MONK\n               Change it that we may all drink of it.\n--\n     Jessica spews water into the spout.  The monk swirls\n     the jug, sniffs at the spout and then drinks.\n\n                      MONK (CONT'D)\n               It is changed!\n\n                          PAUL\n                    (inner voice)\n               She did it!\n\n199. INT. HALL OF RITES - SIETCH TABR - NIGHT\n\n     The Fremen suddenly turn their attention to Paul....\n     They whisper \"It is the prophecy!\"  They soon begin\n     to CHANT... \"Muad'dib....  Muad'dib\" over and over\n     again.  The chanting sounds fill the hall along with\n     the ghostly wind organ.\n\n200. (Deleted)\n\n201. INT. HALL OF RITES - SIETCH TABR - NIGHT\n\n     Down below, the crowds continue CHANTING \"Muad'dib,\n     Muad'dib.\"\n\n202. INT. ROCK LEDGE - HALL OF RITES - SIETCH TABR -\nNIGHT\n\n     Paul continues to stare at Chani.  He moves to her.\n     Chani turns.  Paul is at her side.  Their eyes meet\n     and lock.\n\n                          CHANI\n                    (whispering)\n               Come with me.\n\n203. INT. PASSAGEWAY ON ROCK LEDGE - SIETCH TABR - NIGHT\n\n     At the end of the dark black corridor, Chani turns\n     and she and Paul fall together in a long kiss filled\n     with love.\n\n                          PAUL\n               Chani....  I love you... I've always loved\n               you....\n--\n204. through 209.   (Deleted)\n\n169. INT. STAIRCASE - GEIDI PRIME - DAY\n\n     The Baron and Feyd descend several steps into a\n     darker area of Geidi Prime.  Feyd is carrying a\n     strange creature in a small wire cage.  The Baron is\n     floating as he descends.\n\n                          BARON\n                    (takes a drink)\n               Feyd, even though he's aging, Thufir is\n               one of the finest Mentats in the\n               Universe... and he's mine, Feyd... all\n               mine....  Quiet now.\n\n                          FEYD\n               I will.\n\n170. INT. BASEMENT ROOM - GEIDI PRIME - DAY\n\n     Nefud stands eating candies behind Thufir's chair.\n     Nefud has a stun gun, even though Thufir's hands are\n     tied.  The Baron enters with Feyd.\n\n                          BARON\n               Oh Thufir, I see they've installed your\n               heart plug already....  Don't be angry.\n               Everyone gets one here.  But this is not\n               why we're here.  We've brought you a\n               little cat, Thufir.  You must care for it\n               if you wish to live.  A poison has been\n               introduced into you, Thufir Hawat.  By\n               milking this smooth little cat body each\n               day you receive your antidote... it must\n               be done each day....  Also, you must do\n               something for me if you wish to live.  You\n               know I lost Piter, my dear Mentat...\n\n     Thufir gives the Baron a weak, wide-eyed stare.\n\n                          FEYD\n               All I can see is an Atreides that I want\n               to kill.\n\n                          BARON\n               Feyd, no, no!  Thufir's a Harkonnen now,\n               aren't you Thufir?\n\n                         THUFIR\n                    (inner voice)\n               My dear Duke... how I have failed you.\n--\n211. INT. JESSICA'S ROOM - SIETCH TABR - NIGHT\n\n     Jessica's face shows signs of straining.  Women move\n     around her, Chani and Harah at her side, helping her\n     give birth.  Suddenly ALIA is born and her freshly-\n     born moist body is held up in front of Jessica.\n     Alia's eyes snap open, burning brightly.\n\n                          HARAH\n               What will you call her?\n\n                         JESSICA\n               Alia.\n\n     As they lift Alia for Jessica to see...\n\n                          ALIA\n               Mother.\n\n210. INT. TRAINING ROOM - SIETCH TABR - NIGHT\n\n     Paul walks down the steps into the training room -\n     followed by Harah's two sons.  He pauses at the foot\n     of the steps.\n\n                          PAUL\n               Activate your weirding modules...\n\n     Paul activates his, and the Fremens follow suit.\n\n                          PAUL\n               Set the range for two meters.\n\n     Paul walks down the line of Fremen.\n\n                          PAUL\n               Korba...\n                    (points to robot)\n               The arm...\n\n                          KORBA\n                    (aiming the module)\n               Chuuk-sa...\n\n                          PAUL\n               Motion... Chuuk-sa...\n\n                          KORBA\n               Chuuuk-sa...\n\n     He fires the module and the arm of the robot is shot\n     off.  Paul smiles and hits him on the shoulder -\n     Paul walks on.\n--\n                          PAUL\n               Stilgar...\n\n     One of the FREMEN calls out to Paul.\n\n                        A FREMEN\n               Muad'dib!...\n\n     The word `Muad'dib' causes a tremendous power to\n     build.  The module shakes violently in his hand - it\n     suddenly fires upwards, and the wall explodes.\n\n                          PAUL\n                    (inner voice)\n               My own name is a killing word.  Will it be\n               a healing word as well?\n\n211A.     NEW SCENE\n\n                         STILGAR\n                    (to Paul as he applies red colour to\n                    the shoulders of several large Fremen\n                    men)\n               Usul... these are fifteen of our fiercest\n               fighters to serve you as your guard... the\n               Fedaykin.\n\n     He pauses, then holds up his brilliantly red hand.\n\n212. (Deleted)\n\n213. EXT. DESERT - DAY\n\n     An EXPLOSION.  Paul turns and his eyes are totally\n     blue.  He lifts binoculars to them and looks.  He\n     sees the Fremen fighters below charging at the\n     Harkonnens.  As the Fremen run they make powerful\n     SOUNDS with their weirding modules, exploding\n     everything in their path and catching things on\n     fire.\n\n213A.     EXT. CARRYALL - DESERT - DAY\n\n     In the distance, a huge spice carryall is shot down\n     and it falls to the ground EXPLODING more violently\n     on impact.\n\n213. BACK TO SCENE\n\n                          PAUL\n               Now!\n--\n     Stilgar signals, and Fremen run behind them.\n\n                      PAIL (CONT'D)\n                    (to Stilgar)\n               They're even better on the battlefield\n               than in the training rooms!!\n                    (inner voice)\n               Sound... as a weapon.  If only you could\n               see them, father.\n\n     Paul smiles as he looks at the battle in the\n     distance.\n\n                      PAUL (CONT'D)\n                    (his V.O. from the past)\n               When the spice flow stops, the entire\n               Universe will turn to Arrakis.  The Baron\n               and the Emperor himself will be forced to\n               deal with us.\n\n214. INT. PASSAGEWAYS - ARRAKEEN - DAY\n\n     Rabban stares dumbfounded as many Harkonnen wounded\n     and dead are brought through the passageway beyond.\n     Rabban grabs a Harkonnen and asks:\n\n                         RABBAN\n               What happened?  What happened to you?\n               What is he saying?\n\n                    WOUNDED HARKONNEN\n               Muad'dib!...  Muad'dib!... Muad'dib!...\n               Muad'dib!\n\n     Rabban pushes him away.\n\n                   A HARKONNEN SOLDIER\n               He's been repeating that name ever since\n               we found him.\n\n                         RABBAN\n               Who is this Muad'dib?\n\n215. EXT. DEEP DESERT - DAY\n\n     HEAT WAVES; dunes.  A big thumper is forced into the\n     sands.  A RHYTHM is heard pounding on Fremen hand\n     drums and rhythm instruments.  Feet scramble.  Black\n     stillsuited Fedaykin warrior bodyguards gather.\n     Stilgar turns.\n--\n                         STILGAR\n                    (to Paul)\n               Usul... It is time you become a\n               sandrider... and travel as a Fremen.  Take\n               the kiswa maker hook of our sietch and\n               ride as a leader of men.\n\n216. (Deleted)\n\n217. EXT. DEEP DESERT - DAY\n\n     As Paul leaves the troop to plant the second\n     thumper:\n\n                     STILGAR (V.O.)\n               Two thumpers are planted.  The worm may\n               not surface for the first - he will rise\n               for the second.  Remember, when the worm\n               approaches, you must be utterly still...\n               and close enough to plant the hook firmly\n               under a ring segment....  The worm will\n               turn to lift this exposed area as far from\n               the abrasive sand as possible and it will\n               take you with it -- to the top.  Do not\n               get too close as he approaches... the sand\n               will engulf you....  Wait till the head of\n               the worm passes -- then go... quickly.\n\n                    STILGAR & FREMEN\n               Shai-Hulud... Shai-Hulud.\n\n     In the distance the telltale SOUND of the worm's\n     approach begins.  This worm is deep underground and\n     the sound is low and the ground trembles violently.\n\n                          PAUL\n                    (inner voice)\n               Only the very strong ones travel this\n               deep....\n\n     The SOUND and VIBRATIONS continue to build.  In the\n     distance, the Fedaykin and Stilgar watch.\n\n                         STILGAR\n                    (to the others)\n               Usul has called a big one.  Again... it is\n               the legend.\n\n218. (Deleted)\n--\n219. EXT. DEEP DESERT - DAY\n\n     HEAT WAVES... dunes RHYTHM.  THUNDEROUS approach of\n     the worm.  Paul still cannot see the worm, but the\n     sound begins to drown out the Fremen rhythm\n     instruments and the sand begins to VIBRATE.\n     Suddenly, Paul SEES...\n\n219A.     EXT. WORM - DEEP DESERT - DAY\n\n     ...a mountain of sands rise up, towering, thundering\n     -- lightning SPARKS fissuring throughout the air\n     above the worm.\n\n     The mountain approaches at a terrifying speed.\n     Then, the worm appears -- rushing.  The mouth, at\n     first a small opening, begins to widen -- exposing a\n     thousand glistening teeth.\n\n219B.     EXT. DESERT - DAY\n\n     Paul freezes.  He lets the worm get closer and\n     closer.  The HEAT WAVES distort the gigantic form,\n     making it more hideous -- more foreign.  He moves\n     forward.  The others watch anxiously.  This worm is\n     big.  It is so much larger than imaged.  Its top\n     towers 125 feet in the air.  The segments are each\n     ten feet wide.\n\n219C.     EXT. VERTICAL SECTION OF WORM - DESERT - DAY\n\n     Paul gets close and running alongside, he plants the\n     hook under a segment and pulls back.  The SOUND is\n     excruciatingly loud.  The sand is so deep and more\n     is being thrown out beneath the body of the worm.\n     Paul gets caught in it and falls. He narrowly\n     escapes being sucked under the beast.  He gets up --\n     runs again and plants the hook once more.  He runs\n     faster, bending the segment open to expose the\n     tender flesh.\n\n219D.     EXT. FULL-SIZE SECTION OF WORM - DESERT - DAY\n\n     Suddenly the worm begins to turn.  Paul pulls\n     himself up the body as it turns -- holding onto the\n     hook.  Soon he is fifty -- sixty -- seventy feet off\n     the ground -- going higher.  The giant worm gets the\n     second thumper and Paul at that moment climbs to the\n     top.  He plants the second hook.\n\n                          PAUL\n                    (inner voice)\n               A sandrider!...\n\n     Paul works the hooks into the breathing holes along\n     the body...\n--\n219E.     EXT. DESERT - DAY\n\n     ...causing the great beast to make a slow turn\n     toward Stilgar and the bodyguard.  They set\n     themselves and as the worm passes...\n\n219F.     EXT. FULL-SIZE SECTION OF WORM - DESERT - DAY\n\n     ...they all clamber on, climbing up the sides to the\n     top.\n\n                          PAUL\n                    (yelling)\n               Long live the fighters!\n\n     They return the traditional CALL and Paul steers the\n     maker in a giant circle.  They head out across the\n     dunes.\n\n219G.     (Deleted)\n\n219I.     EXT. DESERT - DAY\n\n     Rabban and Harkonnens in the desert.  Rabban\n     observes tremendous destruction of his spice\n     harvesters and carryalls.\n\n219K.     EMPEROR'S WORLD REPORT\n\n                          VOICE\n               Seventeen Great Houses of the Lansraad\n               have reported a significant delay in\n               delivery of spice per CHOAM agreement.\n               This constitutes a serious violation of\n               CHOAM codes.  Contact Baron Vladimir\n               Harkonnen immediately.\n\n219H.     INT. GREAT HALL - ARRAKEEN PALACE - DAY\n\n     A furious Rabban sirs in a black steel tub in the\n     Great Hall.  A squad of TROOPS stands at attention\n     in front of him, listening to his screaming fit.\n\n                         RABBAN\n               Falsify the reports.  We can't hide it\n               all, tell them we've lost only two hundred\n               harvesters... and forty carryalls... and\n               don't let my uncle know about the\n               destruction of the spice silos....  I will\n               catch this Muad'dib and suck the blood\n               from him!!  SUCK THE BLOOD FROM HIM!!!\n--\n219J. through 222.  (Deleted)\n\n226A.     EXT. HARVESTER - DESERT - DAY\n\n     SMOKE billows from a burning harvester.\n\n226B.     EXT. DESERT - DAY\n\n     Fighting is going on between Fremen and some\n     smugglers.  Paul moves down a smokey dune with\n     Stilgar followed by Fremen and Fedaykin.\n\n                          PAUL\n               We surprised a band of smugglers.\n\n                         STILGAR\n                    (racing into thick smoke)\n               Too bad... thought they were Harkonnen.\n\n     Paul and Stilgar move through the smoke.  A man runs\n     up with a maula pistol aimed at Paul but Paul spins\n     and punctures the man's chest with a sound from his\n     weirding module.  Paul turns and a large figure\n     comes through the smoke.  They surprise each other.\n     The figure holds a gun.\n\n                          PAUL\n               Gurney!...\n\n     The figure stops -- stunned.\n\n                      PAUL (CONT'D)\n               You've no need of your weapons with me\n               Gurney Halleck.\n\n                         GURNEY\n                    (peering; whisper of hope)\n               Paul!!  Paul!!\n\n                          PAUL\n               Don't you trust your own eyes.\n\n                         GURNEY\n               They said you were dead.  They said...\n\n     Paul shows him the signet ring on his fingers.\n     Gurney moves forward, his eyes tearing, and the two\n     embrace each other and pound each other on the back.\n\n                         GURNEY\n               You young pup!  You young pup!\n--\n227. NEW SCENE - WORLD REPORT\n\n                          VOICE\n               Stand-by... warning... we have just\n               received a coded threat from the Guild.\n               Spice production is in serious jeopardy...\n               Giedi Prime supplying false reports...\n               Guild to visit Emperor in one standard\n               day.\n\n228. INT. THRONE ROOM - EMPEROR'S PALACE - NIGHT\n\n     The Emperor sits on his throne.  Behind him are his\n     Sardaukar officers.  In front of him are several\n     Guildsmen.  One holds a large electrical apparatus\n     up to the face plate of another which translates his\n     strange voice into English.\n\n                   TANKED GUILDSMAN #2\n               Emperor Shaddam IV... You have one last\n               chance to take matters into your own hands\n               and bring the situation under the control\n               on Arrakis.\n\n                         EMPEROR\n               What do you mean one last...\n\n                   TANKED GUILDSMAN #2\n               Do not speak!...  Listen!...  You do not\n               have more than this one chance....  I\n               represent the entire Guild in this\n               matter....  You have failed to kill the\n               Atreides heir... Paul.\n\n                         EMPEROR\n               But he was said to...\n\n                   TANKED GUILDSMEN #2\n                    (moans like a cow)\n               Noooooo... he is not dead.  He is not\n               eaten by worms as you have wanted to\n               believe.  He is not missing.  He is in the\n               deep desert with the Fremen.  The Spice is\n               in great danger.  We are not asking... we\n               are telling... remedy the situation or you\n               will live out your life in a pain\n               amplifier.\n\n     The Guildsmen turn and leave.\n\n                         EMPEROR\n               Who is this Paula Atreides to the Guild?\n               And why?\n\n222A.     INT. JESSICA'S ROOM - SIETCH TABR - DAY\n\n     Jessica sits with Harah.\n--\n                          HARAH\n               Your Reverence, I don't wish to upset you,\n               but the other women...\n\n223. INT. PASSAGEWAY - SIETCH TABR - DAY\n\n     At the end of the passageway, standing alone --\n     staring with powerful intense blue-within-blue eyes\n     -- is ALIA.  She's listening mentally.\n\n                      HARAH (V.O.)\n               ...they don't like Alia around.  She\n               frightens them.  It is the strangeness of\n               your daughter.\n\n224. INT. JESSICA'S ROOM - SIETCH TABR - DAY\n\n                         JESSICA\n               It's the way she speaks of things...\n\n     Alia is listening - then exits.\n\n225. INT. PASSAGEWAY - SIETCH TABR - DAY\n\n     Alia listens mentally.\n\n                     JESSICA (V.O.)\n               ...beyond her years and of things no child\n               could know -- things of the past.\n                    (pause)\n\n     Alia begins walking.  She appears to be angry.\n\n                 JESSICA (V.O.)(CONT'D)\n               A daughter who knew at birth everything I\n               know...\n\n226. INT. JESSICA'S ROOM - SIETCH TABR - DAY\n\n                          HARAH\n               But Your Reverence, they won't have her\n               around them.\n\n     Alia enters.\n\n                          ALIA\n                    (screaming little adult voice)\n               Harah!  Would they deny me the right to\n               use this mind?...\n--\n                      ALIA (CONT'D)\n                    (using The Voice)\n               Would they deny me the right to use this\n               voice?...\n\n     Harah's head nearly bursts with pain and she SCREAMS\n     as if she were dying.\n\n                         JESSICA\n               Alia!\n\n226A.     (Deleted)\n\n228. BACK TO SCENE - EMPEROR'S THRONE ROOM\n\n                         EMPEROR\n                    (firmly)\n               I want fifty legions of Sardaukar on\n               Arrakis at once.\n\n                  SARDAUKAR OFFICER #1\n               Fifty legions?...\n                    (he looks at the other officers with\n                    worry)\n               That's our entire reserves as well.\n\n                         EMPEROR\n               This is genocide...  the deliberate and\n               systematic destruction of all life on\n               Arrakis.\n\n228A.     NEW SCENE\n\n     Ships over Arrakis.\n\n229. through 230.   (Deleted)\n\n231. INT. PAUL'S ROOM - SIETCH\n\n     There is a growing, powerful sound of a worm\n     approaching as Paul and Chani are lying together in\n     the darkness of their sleeping chamber.  Paul's eyes\n     snap open and he sees Chani looking down at him (the\n     last image of the future in the desert).\n\n                          CHANI\n               You were calling my name... it frightened\n               me.\n--\nPage Missing\n--\n     In the hollow of a huge dune, Paul stops with Chani.\n     They share a look into each other's eyes.  Paul\n     turns towards the Fedaykin and nods.  They move in\n     quickly to tie and wrap Paul in Fremen rope.  They\n     move back and wait quietly.  Chani moves in very\n     close to Paul.  She holds a glass vial of the blue\n     water of life.\n\n                          PAUL\n               Hurry!  All I see is darkness.\n\n                          CHANI\n               Paul... I will love you forever... in life\n               or in death... let Shai-Hulud judge now.\n                    (whispering)\n               You are my life.\n\n     She pours the blue liquid into Paul's mouth.  Slow\n     move into Paul's face as:\n\n                          PAUL\n                    (inner voice)\n               Now... the test of the water of life...\n               what is it that waits for me in this\n               darkness?\n\n233A.     INT. PAUL'S MIND\n\n     Fade to black then dissolves to dark blue fluid.  A\n     blue drop falls into the blue fluid - a huge low\n     thud - then quiet.\n\n233B.     EXT. DESERT - NIGHT\n\n     Cut to Paul screaming horribly in the desert.\n\n235. INT. JESSICA'S ROOM - SIETCH TABR - NIGHT\n\n     Alia walks forward in the very dark room.  Blood\n     rushes from her nose.  She forces herself to walk to\n     Jessica's bed.  She finds that Jessica's nose is\n     bleeding also.  Jessica wakes in pain.  They stare\n     at each other in the darkness.\n\n                         JESSICA\n               ALIA!\n\n                          ALIA\n               Mother - help me!\n\n                         JESSICA\n                    (struggling)\n               Alia!  What is it?\n--\n                          ALIA\n               It's Paul.  He's taken the Water of Life.\n\n233C.     INT. PAUL'S MIND\n\n     Cut to quiet black - dissolve again to blue -\n     another drop - low thud - quietness - fade to black.\n\n245A.     EXT. EMPEROR'S SPACESHIP - SPACE\n\n     The Emperor's space ship soars towards us.\n\n246. INT. EMPEROR'S SPACE SHIP - SPACE\n\n     The Reverend Mother Helen Mohiam is on the floor,\n     bleeding from the nose and weak from pain.  The\n     Emperor looks on in horror.\n\n233D.     INT. PAUL'S MIND\n\n     Suddenly screaming towards us is white rings, stars\n     and a huge Guild Navigator.\n\n233E.     EXT. DESERT - NIGHT\n\n     Cut to Paul's eyes - tightly closed, oozing fresh\n     blood.\n\n233F.     EXT. DESERT - NIGHT\n\n     SCREAMING SOUND.  Paul's mouth opens and a giant\n     wind is stirred on the desert.\n\n234. (Deleted)\n\n235A.     INT. PAUL'S MIND\n\n     Navigator chewing giant eye and spewing blood and\n     light and sounds.  Paul's mouth double exposes over\n     Navigator and eye.  The sound from Paul's mouth\n     destroys the Navigator and opens the Alam.\n     Navigator bursts into a huge light ring and we\n     quickly travel through ring after ring and masses of\n     liquid stars.  The light increases until it is\n     blinding and then in the light...\n--\n235B.     EXT. FLOWER BLOSSOMING\n\n     A golden flower blossoms and glows brilliantly -\n     suddenly the powerful sound of an approaching worm.\n\n236. through 239.   (Deleted)\n\n240. EXT. DESERT - NIGHT\n\n     Chani and the Fedaykin freeze and watch in horror as\n     seven giant worms converge on them.  The worms break\n     the desert surface and rise, towering over them.\n     The worms hover and wait.\n\n                                        DISSOLVE TO:\n\n241. through 245.   (Deleted)\n\n240A.     EXT. DESERT - DAY\n\n     Chani looks to the Fedaykin, then they look at Paul\n     who lies motionless.  She cuts the rope bonds with\n     her crysknife.  Her fingers tremble as does the\n     whole of the desert.\n\n     Paul's eyes snap open.  He sits up slowly.  Chani\n     stares at him in awe.\n\n                          CHANI\n               Paul... Paul.\n240B.     EXT. WAVE CRASHING\n\n     A huge wave crashes and Paul sees the image of his\n     father.  Paul slowly gets to his knees, then stands.\n\n240C.     EXT. DESERT - NIGHT\n\n                          PAUL\n               Father!...  Father!  THE SLEEPER HAS\n               AWAKENED.\n\n     Giant echoes of this phrase reverberate across the\n     vast desert.  The worms bend back into the sand and\n     leave with thundering power.\n\n     MUSIC FULL.\n\n247. through 250.   (Deleted)\n--\n251. EXT. ROCK LEDGE - HALL OF RITES - SIETCH TABR -\nNIGHT\n\n     The Rock Ledge of Sietch Tabr is filled with\n     Fedaykin and monks; Chani, Jessica, Gurney and\n     Stilgar stand together near the back.  Paul moves\n     out on the Rock Ledge overlooking the Hall of Rites\n     which is crowded with Fremen warriors who chant\n     \"Maud'Dib\" along with the powerful sounds of the\n     WIND ORGAN and FREMEN war DRUMS.\n\n     Paul raises his open hand.  SILENCE.  Only the organ\n     continues with a soft low NOTE.  The Fremen wait.\n\n                          PAUL\n               Arrakis... Dune... Desert Planet.\n\n     A quiet, haunting MOAN of recognition of a master\n     rises from the Fremen.\n\n                      PAUL (CONT'D)\n                    (loud)\n               Your time has come.\n                    (inner voice)\n               Father... our time has come.\n                    (out loud again)\n               A storm is coming -- our storm... and when\n               it comes it will shake the Universe.\n               Emperor... we come for you.\n\n     A thunderous ROAR arises.  War DRUMS pound.  The\n     ORGAN blows hurricaine of power through the sietch.\n\n                          PAUL\n                    (he raises crysknife)\n               Long live the fighters!\n\n                         STILGAR\n               Long live the fighters!\n\n     Fremen carrying weapons begin moving out in long\n     lines from the Hall as the war DRUMS pound.\n\n251A. through 252B. (Deleted)\n\n265. INT. HARKONNEN `THOPTER - DAY\n\n     In one `thopter sits the Baron Harkonnen.  He is\n     flown down to the Emperor's ship.\n\n253. EXT. ROCK OUTCROPPING - DEEP DESERT - DAY\n\nA sietch door opens and Fremen warriors stream out.\n--\n254. (Deleted)\n\n255. EXT. DEEP DESERT - DAY\n\n     The WIND is howling and is starting to blow the\n     sand.  Dark sand clouds form in the distance.\n\n256. EXT. ROCK OUTCROPPING - DEEP DESERT - DAY\n\n     Another sietch door opens and hundreds and thousands\n     more Fremen pour out.\n\n257. EXT. SHIELD WALL - ARRAKEEN - DAY\n\n     Paul, Stilgar and Gurney watch the Emperor's\n     enormous ship on the Arrakeen landing field below.\n\n257A. through 258.  (Deleted)\n\n260. EXT. DEEP DESERT - DAY\n\n     Thousands of Fremen are running, planting thumpers\n     as they go.\n\n259. INT. COMMUNICATION ROOM - ARRAKEEN - DAY\n\n                          PAUL\n               Gurney, when the storm hits... set off the\n               atomics.  I want an opening through the\n               entire Shield Wall.  Stilgar?  Do we have\n               wormsign?\n\n     Stilgar and Gurney laugh.\n\n                         STILGAR\n               Usul... We have wormsign, the likes of\n               which even God has never seen.\n\n     Paul smiles.\n\n261. EXT. DEEP DESERT - DAY\n\n     Looking down over the huge desert it looks like a\n     living sea of wormsign.  Everywhere ripples appear\n     and worms are surfacing.\n--\n261A.     EXT. DEEP DESERT - DAY\n\n     Thousands of Fremen are running, positioning\n     themselves to mount and ride.\n\n262. EXT. DESERT - DAY\n\n     Dust clouds grow faster and the speed of the WIND\n     increases.  Sand particles hit at a rock outcropping\n     and up close they sound like giant warrior drummers\n     pounding before battle.\n\n263. EXT. HARKONNEN SHIPS - DESERT - NIGHT\n\n     Suddenly above come hundreds of SCREAMING space\n     ships zooming down across the desert floor and\n     towards the landing field.\n\n264. (Deleted)\n\n266. EXT. DESERT - DAY\n\n     The storm is howling now.  Sand blasts against rock\n     and rips pieces away.\n\n267. INT. STEEL TENT - EMPEROR'S SPACE SHIP - DAY\n\n                         EMPEROR\n               Bring in that floating fat man... the\n               Baron.\n\n     The Baron is brought in.  Distant warning SIGNALS\n     begin.  The Baron is fighting to contain his fear\n     because RABBAN'S HEAD SITS ALL BLOODY ON THE FLOOR\n     in front of him.  Finally the Emperor speaks.\n\n                         EMPEROR\n               Why have you brought me here?\n\n                          BARON\n               Your Highness... There must be some\n               mistake... I never requested your\n               presence.\n\n                         EMPEROR\n               Ah?  But your lack of action demanded it.\n               Your dreadful mismanagement, your bad\n               judgement in assigning to Rabban --\n                    (he gestures toward the head)\n               -- the governorship....  You forced me to\n               come here and set things straight...\n               personally.\n--\n                         A VOICE\n               Bring in the messenger.\n\n     Alia is brought in by the Sardaukar soldiers.  She\n     is smiling.\n\n                          ALIA\n               I am the messenger from Muad'dib.  Poor\n               Emperor, I'm afraid my brother won't be\n               very pleased with you.\n\n                         EMPEROR\n               Silence!...  I do not court your brother's\n               pleasure.\n\n     Suddenly the Reverend Mother looks horrified and\n     grabs her throat.\n\n                     REVEREND MOTHER\n                    (struggling, speaking)\n               Kill this child!!  She's an abomination!!\n               Kill her.\n                    (points to Alia, who is smiling at\n                    her)\n               Get out of my mind!!!\n\n                          ALIA\n               Not until you tell them both who I really\n               am.\n\n                     REVEREND MOTHER\n                    (strained speech void of emotion)\n               Sister of Paul Muad'dib.\n\n     The Reverend Mother slumps.  The Baron's mouth flies\n     open.  The Emperor's face goes pale, his lips\n     tremble.\n\n                         EMPEROR\n               Paul's sister... Paul is Muad'dib?!\n\n     He turns quickly and looks at the two Guild agents\n     present in the room.  They stare at him icily.  Alia\n     is smiles happily.\n\n268. INT. COMMUNICATION ROOM - ARRAKEEN - DAY\n\n     Paul smiles.\n\n                          PAUL\n                    (laughs)(to Gurney and Stilgar)\n               Alia keeps pace with the storm.\n--\n     Gurney and Stilgar don't understand.  Suddenly\n     enormous dust clouds and LIGHTNING sweep up over the\n     Shield Wall.\n\n                          PAUL\n               Gurney, now!\n\n     Gurney gives a hand signal and...\n\n                         GURNEY\n                    (they put on their hoods)\n               Atomics!\n\n269. EXT. SHIELD WALL - ARRAKEEN - DAY\n\n     ...TWENTY EXPLOSIONS of hydrogen bomb intensity go\n     off in a row, cutting a huge gorge through the width\n     of the massive Shield Wall.  As the EXPLOSIONS go\n     off, a WIND howls, destroying much of Arrakeen and\n     covering the rest with tons of sand.  Sand rips at\n     the Palace and the Emperor's ship.\n\n270. INT. STEEL TENT - EMPEROR'S SPACE SHIP - DAY\n\n     Alia smiles as they HEAR the tremendous roaring,\n     atomic screams of the explosions.  The Emperor's\n     ship's warning SIGNALS are now close and loud.\n\n                          ALIA\n               My brother is coming... with many Fremen\n               warriors.\n\n     A Sardaukar rushes in.\n\n                  SARDAUKAR OFFICER #2\n               The Shield Wall is gone.\n\n                         EMPEROR\n               Impossible!\n\n                          ALIA\n               Not impossible.  I told you... He is here\n               now.\n\n                  SARDAUKAR OFFICER #2\n               Majesty, into the ship!\n\n                         EMPEROR\n                    (to his officers)(rising)\n               Release the Sardaukar.  Baron... give this\n               little abomination to the storm.\n\n     They all leave the room, including the Sardaukars.\n--\n270A. through 271.  (Deleted)\n\n272. INT. STEEL TENT - EMPEROR'S SPACE SHIP - DAY\n\n                          BARON\n               I have her, Majesty!\n\n     The Baron floats down to her.  Alia turns to him --\n     still smiling.  With a flash of her hand she reaches\n     out and swipes at the Baron's face.  He CRIES OUT in\n     pain.  She pulls his suspensor plugs and pushes him\n     back, then slowly shows him the tiny needle she\n     holds in her hand.  He spins crazily as he screams\n     from the poison.\n\n273. EXT. SHIELD WALL - ARRAKEEN - DAY\n\n     Worms, each with hundreds of Fremen on them, come\n     slithering through the newly-formed canyon in the\n     Shield Wall.\n\n273A.     EXT. WORMS - SHIELD WALL - ARRAKEEN - DAY\n\n     Paul rides the lead worm with Gurney and Stilgar by\n     his side.  The storm is howling and blowing with\n     horrifying intensity.\n\n273B.     INT. EMPEROR'S SPACE SHIP - CONTROL ROOM - DAY\n\n     The Emperor and his Sardaukar officers in a darkened\n     room where they are horrified to see on the screens\n     the hundreds of worms which are coming into the\n     Arrakeen valley.  All their faces show fear.\n\n272. BACK TO SCENE\n     INT. EMPEROR'S SPACE SHIP - GREEN THRONE ROOM - DAY\n\n     Suddenly the wall behind Alia and the spinning Baron\n     is completely blown away by a BLAST.\n\n     The Baron floats and spins out into the storm.\n\n274. EXT. ARRAKEEN - DAY\n\n     As the worms enter the Arrakeen basin they meet the\n     Sardaukar.  The Sardaukar don't have a chance -- the\n     worms suck them up by the hundreds.  The Fremen on\n     the worm's backs fire weapons, killing the few\n     Sardaukar the worms leave behind.\n\n275. EXT. LANDING FIELD - ARRAKEEN - DAY\n\n     The space ships which were recently airborne are now\n     crashing because of the storm.\n--\n272A.     NEW SCENE\n\n     The Baron floats and spins high in the dust clouds\n     of the storm over the Arrakeen Valley.\n\n274A.     NEW SCENE\n\n     The worm, that Paul, Gurney and Stilgar are riding,\n     suddenly rears up.  Its mouth opens.  The Baron\n     appears as a tiny spinning shape.  He flies directly\n     into the mouth of this collosal worm and is\n     devoured.\n\n277. EXT. STEEL TENT - LANDING FIELD - ARRAKEEN - DAY\n\n     A thousand Fremen battle Sardaukar outside the\n     Emperor's tent.  They soon overpower them and rush\n     into the giant steel structure.\n\n278. EXT. LANDING FIELD - ARRAKEEN - DAY\n\n     The entire airfield is now filled with wild worms,\n     Fremen, and dead or dying Sardaukar.\n\n276. EXT. LANDING FIELD - ARRAKEEN - DAY\n\n     Alia moves dreamily among the dying Sardaukar.\n\n279. through 280.   (Deleted)\n\n281. INT. GREAT HALL - ARRAKEEN PALACE - DAY\n\n     Paul enters the Palace hall and the first thing he\n     sees is the giant bull's head.  The horns have been\n     blown off and the Atreides banner has been stuffed\n     and wired into the mouth.\n\n     A WIND moans through the Palace.\n\n     Paul turns.  Gurney and several guards bring in the\n     Emperor, Irulan, the Reverend Mother, Sardaukar\n     generals, Guildsmen, Feyd and Thufir.  The Fedaykin\n     and Fremen troops line the walls.\n\n     Paul's eyes meet Feyd's -- Feyd gives him an evil\n     smile.\n\n     Paul turns and looks at the Emperor, who stares back\n     defiantly.  Paul moves his gaze to Irulan, who\n     lowers her eyes.  He then sees his old teacher,\n     Thufir Hawat, whose tired eyes wander helplessly.\n--\n                          PAUL\n               Gurney... I see Thufir Hawat among the\n               captives.  Let him stand free.\n\n                         GURNEY\n               My Lord?\n\n                          PAUL\n               Let him stand free!\n\n     The Emperor turns nervously to Feyd, who passes a\n     golden dagger to Thufir.\n\n                          FEYD\n                    (to Thufir)\n               The antidote...\n\n                         GURNEY\n                    (gestures to Thufir)\n               Thufir.  Come.\n\n     Thufir approaches Paul, concealing the knife.  They\n     come face to face.  The Emperor seems strangely\n     tense at this moment.  Paul notices this.  He looks\n     Thufir over.\n\n                      PAUL (CONT'D)\n                    (inner voice)\n               A knife....\n                    (out loud)\n               In payment of the many years of service to\n               my family, you may know ask of me anything\n               you wish.  Anything at all.\n                    (quietly)\n               Do you need my life, old friend?\n\n     He turns his back on him.\n\n                      PAUL (CONT'D)\n                    (quiet)\n               It is yours.\n\n     Thufir's eyes grow sad and wide.\n\n                          PAUL\n               I mean this, Thufir.  If you are to\n               strike, do it now.\n\n     Thufir's hand rises, as Jessica gasps, but the old\n     Mentat pulls his heart plug out with a quick tearing\n     motion.  Paul turns and catches him as he sags.\n\n     His head lolls back and he looks up to Paul\n     urgently.\n--\n                     THUFIR (CONT'D)\n               Three... generations... of you...\n\n     His breath escapes him and he is dead.\n\n                          PAUL\n                    (to the guards)\n               Carry this noble Atreides warrior away.\n               Do him all honor.\n\n     The guards do as they are instructed.\n\n                          PAUL\n               Emperor Shadam the IV... there are Guild\n               Heighliners above us containing many Great\n               Houses of the Lansraad....  SEND THEM\n               BACK!\n\n                         EMPEROR\n               How dare you speak to me...\n\n                      GUILDSMAN #2\n                    (speaking into electric microphone)\n               Stop your speaking!!\n\n                          PAUL\n                    (to the Guildsmen)\n               Good.  You have some idea of what I would\n               do but I will tell it to one who has never\n               been seen... one who hides deep in the\n               Heighliner control rooms.  He will hear it\n               first.\n\n                      GUILDSMEN #3\n                    (fear)\n               No!\n\n     Paul smiles as we move closer and closer to him.\n\n282. INT. CONTROL ROOM - HEIGHLINER - SPACE\n\n     Suddenly we are in the Heighliner control room, near\n     the floor in the chemical spills.  We move up into\n     the orange gas.  THUNDERING begins to shake the\n     Heighliner.\n\n                       PAUL (V.O.)\n               Where are you....  Let me see you or there\n               will be no spice.\n--\n     We move into very thick gas and there is a ROARING.\n     Suddenly Paul sees the Third Stage Navigator.\n\n                   PAUL (V.O.)(CONT'D)\n               You know what I'm about to say is true....\n               I have the power to destroy the spice\n               forever.\n\n     The Guild Navigator's mouth stretches back in a\n     horrible MOAN.  The moan becomes more pained and\n     grows louder and louder.\n\n283. INT. GREAT HALL - ARRAKEEN PALACE - DAY\n\n     The Guildsmen in the room are MOANING and SCREAMING\n     and swarming out towards the doorway -- the Fremen\n     stop them.  The Emperor and all are amazed and\n     frightened.  There is a long hush.  The old Reverend\n     Mother then turns and glares at Paul.\n\n                      PAUL (CONT'D)\n               Don't try your powers on me.  Try looking\n               into that place where you dare not look.\n               You'll find me there staring back at you!!\n               You Bene Gesserit have waited ninety\n               generations to produce the one person your\n               schemes required.  Here I stand.  But... I\n               will never be yours.\n\n                     REVEREND MOTHER\n               Stop him, Jessica!\n\n                         JESSICA\n               Stop him yourself.\n\n                          PAUL\n               You saw a part of what the race needs in\n               the beginning.  In time you perverted the\n               truth.  You sought to control human\n               breeding and intermix a select few\n               according to a selfish master plan.  How\n               little you understand.\n\n                     REVEREND MOTHER\n               You mustn't speak of...\n\n                          PAUL\n                    (using The Voice)\n               SILENCE!\n\n     The old woman is shot backwards by the power of his\n     shout.  Her breath is knocked out of her.\n\n                      PAUL (CONT'D)\n               I remember your gom jabbar, now you\n               remember mine.  I can kill with a word.\n--\n     A Fedaykin stand forward and recites from the\n     prophecy.\n\n                       FEDAYKIN #1\n               ...and his word shall carry death eternal\n               to those who stand against the righteous.\n\n     Feyd hears this and is angered.\n\n                          FEYD\n               The righteous!\n\n                          PAUL\n                    (to Emperor)\n               There is a Harkonnen among you.  Give the\n               Harkonnen a blade and let him stand forth.\n\n                         EMPEROR\n               If Feyd wishes, he can meet you with my\n               blade in his hand.\n\n                          FEYD\n               I wish it.\n                    (steps forward)\n\n                         GURNEY\n               This is a Harkonnen animal.  Let me,\n               please, my Lord.\n\n                          PAUL\n               The Emperor's blade.\n\n     Feyd takes up the Emperor's blade with a smile.\n     Paul takes out his crysknife.  They begin to circle\n     each other.\n\n     Paul smiles, circling still.  Suddenly, Feyd leaps,\n     his blade jabbing savagely outward, but Paul easily\n     evades it, moving away.  They begin to circle again.\n\n     He makes another pass at Paul that comes dangerously\n     close, but again, Paul is away, a frozen smile on\n     his face.\n\n                          FEYD\n               Why prolong the inevitable?  I will kill\n               you!  I will kill him!\n\n     Feyd smiles.  He lashes out biting Paul's hand.\n     Feyd LAUGHS in triumph.\n\n     Feyd leaps forward jabbing, his right hip also\n     forward.  Yet Paul, although a little slowly, again\n     reels away.  Again, Feyd thrusts.\n--\n     This time Paul jabs with his crysknife, but Feyd\n     moves away effortlessly.  Feyd counters and kicks\n     Paul to the ground.\n\n                          CHANI\n               Paul!\n\n     Paul is up instantly and he circles with Feyd.\n\n                          FEYD\n                    (smiling)\n               Who is the little one?  A pet, perhaps?\n               Will she deserve my special attentions?\n\n     Paul jabs out, his crysknife slashing.  Feyd grabs\n     his arm, and Paul his, the two men locked in a\n     straining clinch.  Feyd presses his right hip closer\n     and closer to Paul's body.  Paul strains to keep it\n     away.  Suddenly, the gom jabbar flips out of Feyd's\n     girdle, but on the left side, and he lunges\n     powerfully with it at Paul, who just barely misses\n     taking it in his skin.  He throws Feyd back, but not\n     before Feyd's feet strike out, sending Paul to the\n     floor.  Feyd leaps onto him.\n\n                          FEYD\n                    (whispering)\n               You see... your death... my blade will\n               finish you.\n\n     Suddenly, Paul, with lightning swiftness, pushes\n     Feyd up and over.  He is on top of him in a flash.\n\n     Paul's crysknife flashes up, thrusting upward\n     through Feyd's jaw.  Feyd's mouth opens as the knife\n     continues up through his tongue and through to his\n     brain.  Feyd's eyes go wild, then glaze over as he\n     jerks dead on the floor.  Paul slowly gets to his\n     feet, breathing heavily.  Anger still seething in\n     him, Paul issues a SOUND -- a loud, horrible,\n     powerful sound, and Feyd's internal organs rupture\n     and the stone floor under him cracks open.  The\n     Fedaykin smile.\n\n                       FEDAYKIN #2\n               Usul no longer needs the weirding module.\n\n     Everyone stares in disbelief.  Paul looks to the\n     Emperor.\n\n                          PAUL\n               Now, I will tell you how it will be.\n               Irulan shall be my wife, opening the way\n               for an Atreides to take the throne.\n\n                         EMPEROR\n               I sit on the throne!!\n--\n                          PAUL\n               You will sit on a throne on Selusa\n               Secundus, your prison planet.  Either that\n               or you will die.\n\n     The Emperor is still.  Paul moves to Chani.\n\n                      PAUL (CONT'D)\n                    (to Chani)\n               The Princess shall have no more of me than\n               my name... no child of mine or touch the\n               softness of glance... nor instant of\n               desire....  This is my promise to you...\n                    (whispering)\n               ...my love.\n\n     Paul turns back to the others.\n\n     Jessica turns to Chani and whispers to her.\n\n                         JESSICA\n               Think on it Chani... We who carry the name\n               of concubine... history will call us\n               wives.\n\n     Alia enters with two monks.  She signals and one of\n     them places a cloak over Paul's shoulders.\n\n                          PAUL\n               The Fremen have the word of Muad'dib.\n               They will have their Holy War to cleanse\n               the Universe... they will have Arrakis...\n               Dune... their planet.  There will be\n               flowing water here open to the sky and\n               rich green oases.  For the spice there\n               will always be some desert.  There will be\n               fierce winds and trials to toughen men.\n               We Fremen have a saying...\n                    (he stares at the Reverend Mother)\n               \"God created Arrakis to train the\n               faithful.\"\n               One cannot go against the word of God.\n\n     Everyone in the room stares at him soundlessly.\n\n                          ALIA\n               And how can this be?\n\n     There are three powerful drum hits.\n\n                      ALIA (CONT'D)\n               For... he is the Kwisatz Haderach!\n--\n284. EXT. ARRAKEEN PALACE - DUSK\n\n     Paul opens his mouth and issues an ever increasing\n     wind.  Lightning and thunder begin.  Clouds begin to\n     form over the Palace.  In the half-light of dusk,\n     thousands of Fremen watch the sky.  Giant golden\n     lights are illuminated and their rays shoot far into\n     the sky illuminating the growing clouds.  Five\n     tremendous bolts of lightning suddenly unleash a\n     downpour of RAIN ON ARRAKIS.  The Fremen stand\n     awestruck as they are drenched with water falling\n     from the sky.\n\n285. INT. GREAT HALL - ARRAKEEN PALACE - DAY\n\n     WE MOVE through Paul's glowing blue eyes into\n     beautiful blue luminescent light.\n\n     A gigantic WIND arises, and suddenly appearing in\n     the blue light is an ocean of light rolling like\n     gold glass off into infinite.  The blue becomes\n     darker and a golden lotus flower blooms in the\n     night.\n\n                         THE END\n\n\nThis script was found in INFlow. It was shameless taken off from somewhere\nelse, may god, copyright owners and people who worked hard and were not\ncredited forgive us.\n\n\n\n\n\n\nDune\nWriters :   David Lynch  Frank Herbert\nGenres :   Action  Adventure  Sci-Fi  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Ten thousand years in the futurethe known universe is ruled by Padishah Emperor Shaddam IV. The most important substance in the empire is the drug known as melange or \"the spice\". It has many special properties, such as extending life and expanding consciousness. The most profitable and important of its properties is its ability to assist the Spacing Guild with folding space, which allows safe, instantaneous interstellar travel.\nSensing a potential threat to spice production, the Guild sends an emissary to demand an explanation from the Emperor, who confidentially shares his plans to destroy House Atreides. The popularity of Duke Leto Atreides has grown, and he is suspected to be amassing a secret army, making him a threat to the Emperor. Shaddam's plan is to give the Atreides control of the planet Arrakis (also known as Dune), the only source of spice, and to have them ambushed there by their longtime archenemies, the Harkonnens. The Navigator commands the Emperor to kill the Duke's son, Paul Atreides, a young man who dreams prophetic visions of his purpose. The order draws the attention of the Bene Gesserit sisterhood, as Paul is tied to the centuries-long Bene Gesserit breeding program which seeks to produce the universe's superbeing, the Kwisatz Haderach. Paul is tested by the Bene Gesserit Reverend Mother Gaius Helen Mohiam. Paul is forced to place his hand in a box which subjects him to excruciating pain. He passes to Mohiam's satisfaction.\nMeanwhile, on the industrial world of Giedi Prime, the sadistic Baron Vladimir Harkonnen tells his nephews Glossu Rabban and Feyd-Rautha about his plan to eliminate the Atreides by manipulating someone into betraying the Duke. The Atreides leave Caladan for Arrakis, a barren desert planet populated by gigantic sandworms and the Fremen, a mysterious people who have long held a prophecy that a messiah would come to lead them to freedom. Upon arrival on Arrakis, Leto is informed by one of his right-hand men, Duncan Idaho, that the Fremen have been underestimated, as they exist in vast numbers and could prove to be powerful allies. Leto gains the trust of Fremen, but before the Duke can establish an alliance with them, the Harkonnens launch their attack.\nWhile the Atreides had anticipated a trap, they are unable to withstand the attack, supported by the Emperor's elite troops and aided by a traitor within House Atreides, Dr. Wellington Yueh. Captured, Leto dies in a failed attempt to assassinate the Baron Harkonnen using a poison gas capsule planted in his tooth by Dr. Yueh. Leto's concubine Lady Jessica and his son Paul escape into the deep desert, where they join a band of Fremen, led by Stilgar. Paul emerges as Muad'Dib, the leader for whom the Fremen have been waiting. Paul teaches the Fremen to use the sonic weapons and targets mining production of spice. Within two years, spice production is effectively halted. The Spacing Guild warn the The Emperor of the situation on Arrakis. The Guild fears that Paul will consume the Water of Life. These fears are revealed to Paul in a prophetic dream; he drinks the Water of Life and enters into a trance. Awakening, he is transformed and gains control of the sandworms of Arrakis. He has discovered that water kept in huge caches by the Fremen can be used to destroy the spice. Paul has also seen into space and the future; the Emperor is amassing a huge invasion fleet above Arrakis to regain control of the planet and the spice.\nUpon the Emperor's arrival at Arrakis, he executes Rabban for failing to remedy the spice situation. Paul launches a final attack against the Harkonnens and the Emperor's elite shock troops at the capital city of Arrakeen. His Fremen warriors defeat the Emperor's legions, while Paul's sister Alia kills Baron Harkonnen. Paul faces the defeated Emperor and relieves him of power, then engages Feyd-Rautha in a duel to the death. Paul demonstrates his newfound powers and fulfills the Fremen prophecy that he is the promised messiah by causing rain to fall on Arrakis for the first time ever, as Alia declares him the Kwisatz Haderach."}