{"title": "El Mariachi", "full_text": "El Mariachi\n\n\n\n             by Robert Rodriguez\n\n\n\n\n\n\nFADE IN:\n\n\nEXT. A JAIL IN MEXICO - DAY\n\nIt's an early Friday morning and a patrol car drives up an unpaved road and parks next to a gutted police car on cinder blocks. The camera pans with the OFFICER as he exits his car and walks up to a ramp leading to the babay blue JAIL HOUSE. He is carrying a greasy bag of fast food.\n\n\nINT. JAIL LOBBY - DAY\n\nThe Officer enters the lobby, tosses the bag of food to his PARTNER who is sitting at a desk. He grabs a tin cup and walks over to barred entrance to Block A. Twenty or so CRIMINALS, from drunks to drug dealers are sleeping peacefully in their cell on Block A. The Officer rattles the tin cup between the entrance bar.\n\n\nINT. JAIL CELLS - DAY\n\nThe inmates stir, rubbing their dirty faces and trying to sit up. The camera dollies slowly down the narrow hallway of the block which has three cells: Two small ones side by side, and one bigger cell that faces the block entrance. The sound of scribbling and business dealing can be heard from inside the cell. It is AZUL jottin ginto a business ledger while chatting on his cellular phone. His cell is equipped with a small desk and a refridgerator. He hangs up the phone and continues writing. \n\n\nINT. JAIL LOBBY - DAY\n\nThe Officer with the tin cup sits in a couch across from his partner, who is now eating, and reads a magazine.\n\n\nINT. JAIL CELLS - DAY\n\nAzul picks up his phone and makes another call. He talks business. In the other cell, prisoners are getting up and looking around. Azul hangs up the phone and writes.\n\n\nEXT. EL MOCO'S RANCH - DAY\n\nA gorgeous, bikini-clad BABE struts slowly into a tighly framed glamour shot. She pauses, takes a deep breath, then dives a 'perfect ten' dive into a house-side moat. She swims long, slow motion strokes around the moat as the camera tracks alonside her, lovingly admiring her tan lines and hydrodynamic build. She slides out of the water and walks up a cobble stone walk, dripping as she passes a seated GENTLEMAN in a white suit. His face is unrevealed. As she enters the house, he sets his drink down by a phone. He lifts up the receiver and dials. \n\n\nINT. JAIL CELLS - DAY\n\nAzul's phone rings. He looks up at it, startled, as if no one has ever called him before. He glances at his watch, and then back at the phone, hesitating to answer it. He looks around the cell block as if someone might be playing a trick on him. Finally he answers it, pausing before saying hello. It is El Moco.\n\nMOCO (V.O.)\nGood morning, Azul. Do you know who this is?\n\nAZUL\n(into phone)\nMoco... What the hell do you want after all these years?\n\n\nEXT. EL MOCO'S RANCH - DAY\n\nMOCO is sitting on his porch drinking tequila.\n\nMOCO\n(into phone)\nWe've got a lot to talk about. I'm just a few town away with a whole new gang. I heard you were nearby so I thought I'd give you a call, amigo.\n\nAZUL (V.O)\nThat's sweet of you, asshole. I don't suppose you could get me out of there, and then maybe hand me over my share of money.\n\nMOCO\n(into phone)\nYes, I figured you'd want your money, my friend. That is why I have called you. I heard you were getting out soon, and figured I should deal with our situation. But do you really need me to help you get out? From what I hear, you're running quite a business out of your cell with a phone and some loyal men. It keeps you well protected I hear. Not a bad idea. I may try that myself sometime.\n\nAZUL (V.O.)\nI could stay in here and earn peanuts compared to what you owe me if I were to get out. So, yes, I want you to help me... my friend.\n\nMOCO\n(into phone)\nSoon my friend, soon. I'm sending you some people in a few days to get you.\n\nAZUL (V.O.)\nReally? Well, that's more like it. Just like the Moco I used to know.\n\nAzul is walking towards his window at the sound of a truck racing in.\n\nMOCO\n(into phone)\nJust hang in there my friend. I won't forget that you have been a big part of our success. What's wrong. \n\n\nEXT. JAIL - DAY\n\nA large truck drives up to the jail, parking beside the police car. Two tall, well-dressed MEN step out. They reach into the cab and pull out machine guns. They walk briskly towards the jail.\n\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul walks to his toilet and stands on it to see out his barred window.\n\nAZUL\n(into phone)\nThere's something going on outside. Is this a double surprise? Are you getting me out today, Moco?\n\nThere is no response from Moco.\n\n\nINT. JAIL - DAY\n\nThe Guard reading the magazine stands when he sees someone approaching the door.\n\n\nEXT. JAIL - DAY\n\nClose tracking shot of guns as Tall Men open the door and enter the jail.\n\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul looks out of the jail cell suspiciously. Peering down the hall, he sees the guys with the guns. He hides behind the wall, peering out to see what happens next.\n\n\nINT. JAIL LOBBY - DAY\n\nThe Tall Men walk right up to the guard, and hand him a huge wad of money. The Guard tosses the money to his partner (still eating), then turns to unlock the block entrance bars.\n\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul puts the receiver back up to his mouth.\n\nAZUL\n(into phone)\nThere are two men here with guns. Did you send them?\n\n\nEXT. EL MOCO'S RANCH - DAY\n\nMoco, glancing at his watch, hangs up.\n\n\nINT. AZUL IN JAIL CELL - DAY\n\nAzul hangs up the phone and kicks his Bodyguard awake. The Bodyguard gets up and peers out the bars as Azul hides in a corner.\n\n\nINT. TALL MEN IN HALL - DAY\n\nThe Tall Men walk steady and alert, ready to kill. They enter Azul's block and scope out the cells.\n\nThe Bodyguard, seeing the tall men, retrieves his shotgun from under his mattress and grabs his machete from under the sink. He stands ready to fight.\n\nThe Tall Men move slowly towards the big cell, somewhat cautious. They see the Bodyguard a second too late, for he sticks the shotgun between the bars, and shoots one of them before they can react. The shot one stumbles back into his buddy's arms. Azul's Bodyguard, amused by all this, opens his cell door effortlessly, and walks out as if to greet them. The Tall Men hear the sound of the other cells opening, so they turn around. The other prisoners on the block begin exiting their cells, carrying guns and Molotov cocktails. The Tall Man drops his gun. Finally, Azul exits his cell carrying his phone. The Bodyguard forces the Tall Men into an empty cell, closing and locking the door.\n\nAzul presses the #-button on his phone. Moco's phone number is automatically redialed. \n\nMoco answers.\n\nAZUL\n(into phone)\nI'm still here, Moco. And so are your little friends. But not for long. They have something they want to scream to you. Listen close, because you're going to repeat it to me when I come to visit you.\n\n\nINT. TALL MEN IN CELL - DAY\n\nThe cellmates throw their Molotov cocktails into the cell. Moco hears the men screaming as they burn to death. Azul is holding the phone at arm's length into the cell.\n\n\nINT. JAIL LOBBY - DAY\n\nThe Guards exchange glances when they hear the screaming, they smile and shrug, then go back to what they were doing. As Azul and his Bodyguards exit the block, the Guard with the magazine stands up as if to stop them, but Azul tosses him a wad of money and the guard sits back down to count it.\n\n\nEXT. JAIL - DAY\n\nA blue truck races towards the jail.\n\nAzul exits the jail carrying a shotgun. His Bodyguards get inside the Tall Men's truck and start it. Azul waits patiently for his blue truck.\n\nAs the blue truck pulls up, two little rat-like VATOS exit the blue truck, one handing Azul a guitar case. Azul tosses it onto the hood. The Bodyguards wave as they drive away. Azul waves back. He opens the case, revealing an arsenal of weaponry. Azul notices one piece is missing. One Rat quickly pulls the missing weapon from his jacket and replaces it in the case. Azul is unamused. He grabs his MAC-10 machine gun from the guitar case and aims it at the thieving Rat's head.\n\nSuddenly, the Guard bolts out the jail waving the wad of money, as if complaining.\n\nAzul turns his MAC-10 onto the Guard instead. A few blasts later Azul and his rats pack up and go as the Guard twitches helplessly on the ground, still clutching the money in his bloody hand.\n\n\nCREDIT SEQUENCE\n\nEXT. AZUL / MARIACHI ON HIGHWAY - DAY\n\nThe blue truck barels down the highway and the camera pans with the truck as it passes a hitchhiker, MARIACHI, standing in the sun with a thumb in the air. The truck passes him up so he continues walking. Mariachi is carrying a guitar case in one hand and a black jacket in the other. He is wearing a white T-shirt, black pants. The camera pans to a sign that reads \"ACUÑA 18 miles\".\n\n\nEXT. MAIN STREET - DAY\n\nMariachi is walking around downtown Acuña. He notices a bar across the street and, liking the way it looks, he puts on his jacket and crosses over to it. He stops to read a sign on the building that says \"MEMBERS AND NON-MEMBERS ONLY\". He prays silently to himself before confidently walking inside.\n\n\nINT. CORONA CLUB - DAY\n\nMariachi enters the club, greeting the PATRONS as ge makes his way to the bar. No one seems to greet him back. He sits on a barstool near some OTHER DRINKERS, laying his guitar case down lovingly beneath his stool. He looks around the place, as if sizing it up.\n\nBARTENDER\nWhat do you want to drink?\n\nMARIACHI\nRefresco.\n\nThe other drinkers stare at him.\n\nGlancing around the room, Mariachi notices a small, table-shaped object draped with a cloth in one corner of the room.\n\nSitting directly behind him are four mean-looking dudes. Mariachi is served his drink.\n\nMARIACHI\nNo hay musica?\n\nBARTENDER\n(cleaning a glass)\nWhy?\n\nMARIACHI\nI'm a mariachi. A good one. I play beautiful ballads, old classic ballads, on an old-fashioned guitar.\n\nBARTENDER\nSo what?\n\nMARIACHI\nI could add a little class to this place. I work for fairly cheap, I live mostly off tips. But I need steady work, and I can guarantee bringing in more customers.\n\nBARTENDER\n(nodding)\nTell me, why would I need one little guitar player when I've already got a full band?\n\nMariachi gives him a silent \"what\" look.\n\nThe BARTENDER motions to a YOUNG MAN sitting near the small draped table.\n\nThe Young Man removes the drape revealing a keyboard. Puts on his mariachi hat, dips his fingers into his shot glass and rubs his fingers together (as if warming up for the big show). He hits a few switches in EXTREME CLOSEUP as...\n\n... Mariachi adjusts himself to the seat.\n\nThe Young Men gently taps one switch and the keyboard sounds like an accordion, pulsing out a beat. He then presses another switch and a horn section swells to a crescendo and waltzes the familiar riffs. He adds the string and horns accents by banging on the keys. He sounds awful.\n\nMariachi grimaces slightly then turns back to the Bartender who seems to enjoy it.\n\nThe Keyboard Mariachi finishes his song, sits back down.\n\nBARTENDER\n(nodding with satisfaction)\nThere you see? Either I can pay one guy to sound like a full mariachi band...\n\nMariachi picks up his guitar and lays some money next to his full drink. He looks disappointed.\n\nBARTENDER\n... or I could spend the same money only get one little guitar player... Understand?\n\nMARIACHI\n(walking away)\nThank you, sir.\n\nBARTENDER\nYou want to earn a living? Get a real musical instrument.\n\nThe Bartender picks up the bottle of soda pop Mariachis left behind and offers it to the other men on the table. They say no, pay, and leave. The Bartender offers it to the MEAN DUDES at the table.\n\nThey all shake their heads no.\n\nThe Bartender shrugs and dumps it.\n\n\nEXT. CORONA CLUB - DAY\n\nMariachi walks out and looks up and down the street. He decides to walk south.\n\nAs he walks down the sidewalk, the camera pans into a CLOSEUP of another guitar case that is moving towards the Corona Club. The camera falls back a little revealing the backside of Azul, dressed also in black. Azul walks into the bar.\n\n\nINT. CORONA CLUB - DAY\n\nAzul enters the bar, notices to his left the table with the four mean-looking Dudes, drinking and eating chips and salsa.\n\nThe oldest one, with his back to Azul, takes a sip from his mixed drink, then stands and excuses himself to the restroom.\n\n\nINT. BATHROOM - OLD MEAN DUDE - DAY\n\nThe Old Mean Dude walks into the first stall and sits down.\n\n\nINT. CORONA CLUB - AZUL - DAY\n\nThe three remaining Dudes notice Azul's guitar case. So does the Bartender. They all look at each other and laugh.\n\nBARTENDER\n(laughing and rolling his eyes)\nWhat the hell is this, mariachi day? There is no work for you here!\n\nAzul walks the mean Dude's table. Their laughing quiets down a bit as Azul stands before them. The Bartender stops smiling.\n\nAZUL\nBartender... one beer.\n\nThe Bartender nods and grabs a frosty glass. He begins to fill up at the tap.\n\nAZUL\n(without looking at him)\nIn a bottle, wey.\n\nBartender stops filling the beer, stares at the half-full glass for a moment, then drinks the beer.\n\nAzul is staring at the three Mean Dudes. They stare back.\n\nThe Bartender slaps the unopened bottle down at the counter.\n\nBARTENDER\nReady.\n\nAzul doesn't pay attention to him.\n\nAZUL\nI'm looking for an old friend of mine. His name is... Moco. Do you know where I can find him.\n\nMAIN MEAN DUDE\nYou can sometimes find him here. He owns this place.\n\nAZUL\nSo you know him?\n\nMAIN MEAN DUDE\nWe work for him.\n\nAZUL\nThat's too bad.\n\nAzul turns to the mean Dude sitting to his left, and places the guitar in his hands. The Mean Dude is confused.\n\nAZUL\nHold it please.\n\nAzul opens the case and pulls out the MAC-10. The other two Mean Dudes are already reaching for their pistols.\n\nThe Bartender ducks beneath the counter.\n\nAzul fires a million bullets into two of the Mean Dudes, (the other is holding the case in shock). Their chests explode, causing neat little dollops of flesh and blood fly everywhere. The Mean Dude holding the guitar case is frozen with fear. He manages to look up at Azul, who is watching the Mean Dudes die a slow, bloody death. The barrel of the MAC-10 is smoking. Azul turns slowly to the Mean Dude holding the case. Azul aims his MAC-10 in the Dude's face. Still frozen holding the case, he spends his last moments looking down the gun's barrel.\n\n\nINT. BATHROOM - DAY\n\nThe shots caused Old Mean Dude to peer out from his stall as the toilet paper fell to the ground and started to roll across the floor. He now watches it roll as more shots ring out. He pulls up his pants and and walks toward the door slowly. He is sweating profusely. He slowly picks up the toilet paper, plotting his next move. It grows silent... He takes a deep breath and rushes out the door.\n\n\nINT. CORONA CLUB MAIN ROOM - DAY\n\nThe Old Dude bursts into the room with a roll of toilet paper in his hand, and a sheet of sweat sliding down his face.\n\nThe Bartender rises up from behind the counter.\n\nThe camera dollies slowly by the dead Dudes. Their blood-bathed faces twisted into odd shapes and expressions. The camera continues to dolly to the one dead Dude still holding the guitar case. His face is a bloody pulp. The camera stops dollying to the old Dude's mixed drink. A hand is stirring it with a straw. The camera pans up the arm to reveal Azul, standing expressionless with his gun sling over his shoulder.\n\nShot at 16fps the Old Dude quickly drops the toilet paper and runs back inside the bathroom.\n\nAzul turns to his guitar case and carefully chooses another weapon. He grabs the drink and tosses a napkin over his arm like a waiter, then casually follows the Old Dude into the bathroom.\n\nThe Bartenders glance at each other. One pours a shot glass full of tequila and raises it to his lips to drink it. Shots ring out and the Bartender spills the drink over himself.\n\nWithout warning Azul bursts from the bathroom and walks calmly to his case. He replaces the weapon, picks up the case and leaves.\n\nA few seconds pass before the bartender grabs the phone and furiously dials.\n\nBARTENDER\n(into phone)\nGet me Moco!!!\n\nThe door bursts open as Azul reenters, storming to the bar.\n\nThe Bartender is so petrified he doesn't think to drop the phone.\n\nAzul walks right up to the Bartender.\n\nThe Bartender shuts his eyes. The sound of the beer bottle popping open canbe heard, along with the sound of thirsty guzzling. The Bartender opens his eyes to Azul.\n\nCLOSEUP of the empty bottle slamming to the counter.\n\nThe Bartender glances down at the bottle.\n\nCLOSEUP of Azul tossing a few coins near the bottle as payment. Azul leaves.\n\nA few seconds pass as the Bartender is standing there. You hear Moco yelling into the receiver asking what's going on.\n\n\nEXT. MOCO'S RANCH - DAY\n\nMoco is on the porch trying to get the Bartender to answer him.\n\nMOCO\n(into phone)\nWHAT'S GOING ON OVER THERE, ANSWER ME!!!\n\n\nINT. CORONA CLUB - BARTENDER - DAY\n\nYou hear Moco's voice through the phone. The camera dollies into the Bartender as he screams into the receiver.\n\nThe camera dollies in to the corpses...\n\n\nEXT. CORONA CLUB - AZUL - DAY\n\n... and finally a low outdoor frontal tracking shot of Azul walking away smiling as the image fades out.\n\n\nEXT. HOTEL COAHUILA - DAY\n\nLow angle of Hotel Coahuila sign. MEAN DUDE #5 enters the frame as his beeper goes off. He runs into the Hotel Coahuila.\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMean Dude #5 enters the lobby where an OLD CLERK is sitting at the counter reading a yellowed newspaper. There is a pit bull on the floor beside him.\n\nMEAN DUDE #5\nDa me telefono.\n\nVIEJO CLERK\n(without looking)\nTake it.\n\nMean Dude #5 grabs the phone and dials Moco's number. He glances down at the PIT BULL lying on the floor.\n\nMEAN DUDE #5\nPit bull?\n\nVIEJO CLERK\nYeah, pit bull.\n\nThe line is picked up and Mean Dude talks into the phone. He pulls out a piece of paper from his coat pocket and places it on the counter. He begins jotting down four names. He then slowly crosses their names out.\n\nMEAN DUDE #5\n(into phone)\nDead?\n\nThe Viejo Clerk glances up from his paper. The Pit Bull also glances up.\n\nMEAN DUDE #5\n(into phone)\nAll of them? How long ago? OK, What does this guy look like?\n\nClerk goes back to reading his paper. Pit Bull is still paying attention, though.\n\n\nEXT. HOTEL CAOHUILA - MARIACHI - DAY\n\nSame low-angle shot of the outdoor sign displaying the name Hotel Coahuila. Mariachi walks into frame, and pulls out his wallet. Mariachi pulls out a few measly bucks then seems to be considering what to do next.\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nAn inside shot looking out of the front glass reveals Mariachi looking at his wallet as Mean Dude talks to the phone. No one notices him.\n\nMEAN DUDE #5\n(into phone)\n... carries a guitar case... And what was he wearing?... all black...\n\nThe Pit Bull turns and looks out of the window. Seeing Mariachi, he gets up and walks to it.\n\n\nEXT. HOTEL COAHUILA - MARIACHI - DAY\n\nMariachi is putting his last few dollars back into his wallet. As he is walking away he notices the Pit Bull and he bends down for a closer look.\n\nMEAN DUDE #5\n(into phone)\nDon't worry, Moco. We'll find him, and we'll mess him up real good.\n(ad lib)\n\n\nEXT. HOTEL COAHUILA - DAY\n\nLow shot with long lens at full zoom of Mariachi tapping on glass.\n\nCLOSEUP of dog responing.\n\nCLOSEUP of Mariachi tapping.\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMean Dude hangsup the phone. He writes a few more things. He turns to leave.\n\nMEAN DUDE #5\nGracias señor...\n\nAs he passes the camera you can see Mariachi still playing with the dog. Inside view CLOSEUP of Mariachi tapping on glass.\n\nVIEJO CLERK\nCallate, hombre!!!\n\n\nSLOW MOTION SEQUENCE (?)\n\nMariachi looks up at the Clerk, then stands.\n\nThe Mean Dude turns around and looks and looks at the Clerk. Clerk turns to look at Mean Dude, who is walking back to the counter.\n\nMariachi picks his guitar from the ground. He is in full view, but no one is looking at him.\n\nMEAN DUDE #5\nViejo, if you see anyone new in town, carrying a guitar case, dressed in black... you can call this number, OK?\n\nMean Dude writes down a phone number and the description of Azul on a little card.\n\nVIEJO CLERK\n(nodding sarcastically)\nAnd if I don't call, you'll kill me...\n\nMEAN DUDE\n(handing him the card)\nNo. I won't kill you... he will...\n\nThe sarcastic smile fades from the old man. Mean Dude walks away. The old man reads the card, then glances out the window. Mariachi is gone.\n\n\nMARIACHI / MEAN DUDE #5 OUTSIDE HOTEL\n\nMariachi is turning a corner just as Mean Dude #5 exits the hotel. The Mean Dude walks off in the other direction.\n\n\nEXT. BOYSTOWN SALOON DOMINO'S - DAY\n\nMariachi enters Domino's bar. DOMINO is waiting on a few bar bums that are nursing their jaws. Mariachi sits with them, asks for a refresco, He gets looks again. Domino serves him and he asks to see the owner. She says he's looking at the owner. He then asks her for work as a mariachi. She says she has no money to pay him. He looks arund the classy joint and knows she's lying (it turns out to be true, she has no money). When he asks how a girl can take care of herself in a town like this she stuffs a gun barrel in his mouth. He nurses his jaw, pays and leaves, as the others laugh.\n\n\nMARIACHI CHECKS IN TO HOTEL - DAY\n\nMariachi enters the run-down lobby of the motel. The Viejo Clerk at the counter is reading his yellowed newspaper. Mariachi sees the Pit Bull laying by the counter.\n\nMARIACHI\nPit bull.\n\nVIEJO CLERK\nYeah, pit bull.\n\nMARIACHI\nI need a cheap room for a week, and I'd prefer to pay you in a few days, after I've found some work.\n\nVIEJO CLERK\nSí, later...\n\nMARIACHI\nThank you...\n\nThe Old Man hands Mariachi a key for the second floor.\n\nMARIACHI\nThank you, friend.\n\nAs Mariachi walks away, the Clerk notices the guitar case and black clothes and he rereads the card Mean Dude left him.\n\nVIEJO CLERK\n(different tone of voice)\nUh, excuse me señor? I forgot, I need a small deposit...\n\nMariachi stops in his tracks. He turns back to the Clerk slowly... thinking.\n\nMARIACHI\n(walking back slowly)\nYou can trust me.\n\nVIEJO CLERK\nI am very sorry, señor. But... how much can you spare?\n\nThe dog is watching the event.\n\nMARIACHI\n(disappointed)\nI've only got a few pesos... I plan on finding work in town.\n\nVIEJO CLERK\n(grabbing money)\nOh, that's enough for now, sir, thank you and... enjoy your stay.\n\nThe Clerk deposits the money, slams the register shut, and continues reading his yellow paper. Confused, Mariachi pockets his empty wallet and turns to find his room. The Clerk peeks over his paper, eyeing the guitar case as Mariachi goes. He hears the sound of Mariachi's footsteps trailing off. The old man drops the paper and bolts silently to the phone as he dials El Moco's phone number...\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi opens his room, tosses his guitar onto the bed and hangs his jacket in the closet. He has only his white T-shirt underneath. He glances above the bed to a plaque bearing a mace and two crossed swords. He checks out the shower and washes his face in the sink. He sits down on his bed. A few seconds later he drops back and lays there a minute before kicking the door shut. He tries to sleep.\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nThe Old Clerk is talking on the phone to the bad guys. He hangs up the phone, then reaches into the back of his counter for a gun. He places it on the counter and covers it with his newspaper and continues reading.\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nTop shot of Mariachi sleeping. A shot of the mace on the wall.\n\nCUT TO:\n\n\nDREAM IN BOYSTOWN - DAY (5.7 KINOPIC LENS)\n\nMariachi is suddenly sleeping in the dirt. Same top shot as in the hotel. He opens his eyes, then groggily he sits up.\n\nESTABLISHING SHOT of Mariachi sitting in the middle of a ghost town. He stands up.\n\nVARIOUS SHOTS of the empty town with nothing and nobody.\n\nMedium shot dolly into Mariachi as he stands, turns and sees a BOY bouncing a ball in slow motion. The Boy stops short, holding the ball tight against the chest. Mariachi glances around to maybe spot more people, before concentrating on the Boy.\n\nThe Boy places the ball carefully on the ground, then gently rolls it to Mariachi.\n\nTracking shot of the ball rolling to Mariachi. The ball sounds like a speeding truck. Mariachi smiles at the boy.\n\nCLOSEUP of the ball rolling.\n\nCLOSEUP of the Boy smiling.\n\nMariachi bends to get the ball which makes the sound of a screeching truck as it hits Mariachi's foot. Mariachi notices that it's a man's severed head.\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi bolts up in bed.\n\n\nEXT. HOTEL COAHUILA - MEAN DUDES #5, 6, 7, 8 & 9 - DAY\n\nThe Mean Dudes jump out of their truck and rush into the hotel, guns drawn.\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nThe men burst into the lobby and the old men tells them the room number. They run out into the courtyard with the old man following. The Pit Bull is uninterested in the action.\n\n\nEXT. COURTYARD IN HOTEL COAHUILA - DAY\n\nThe Mean Dudes run up the courtyard stairs and kick open the first door they come to and start blasting into the room. Screams are heard. The men stand back, and finally look down the steps at the Viejo Clerk who is waving his arms frantically.\n\nVIEJO CLERK\n127!!! Cuarto 127, pendejos!!!\n\nThey run to the room numbered 127 and cautiously stalk towards it as they reload their guns.\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi is sitting on his bed listening to all this. He bolts to the restroom and turns to the shower.\n\n\nEXT. HOTEL COURTYARD - DAY\n\nShot of men still stalking, cocking pistols.\n\nPOV shot of what men see, as camera nears the door.\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi rushes out of the bathroom towards the door.\n\n\nMARIACHI'S POV\n\nAs camera nears the door, doorknob starts to move. Remembering that he never locked the door, he jumps to the side of the door as...\n\n\nEXT. HOTEL COURTYARD - DAY\n\nMen kick open the door and burst into the room.\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nLow-angle shot as men burst in. There is no one in the room. Mean Dude #5 hears the shower and motions to keep it down and stalk quietly... They rush into the bathroom and start blasting. \n\nMariachi slips out from behind the door and runs out.\n\n\nEXT. HOTEL COURTYARD - DAY\n\nMariachi runs out of the room and jumps off the stairwell onto the courtyard in front of the Clerk.\n\nMARIACHI\n(pointing to his room)\nCuidado, viejo!\n\nMariachi darts out into the lobby. The old man watches him go then turns his attention back to Mariachi's room.\n\nVIEJO CLERK\n(pointing in Mariachi's direction)\nPendejos!!!\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nThe dog watches as Mariachi tosses his keys into the cubby hole where they belong. Mariachi then jumps over the counter, banging keys on the register to get it open.\n\n\nEXT. HOTEL COURTYARD - DAY\n\nThe Mean Dudes run out of Mariachi's room, dart down the stairs, passing the old man who is telling them where to go.\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMariachi, unable to open the register, jumps over the counter.\n\nCLOSEUP of his feet as he lands, causing the register to burst open.\n\nMariachi truns for a second to ponder gettin ghis money or risking dying, but then he checks to turn and run. Two seconds later the Mean Dudes run in, one jumps over the counter to see if he's there.\n\n\nEXT. HOTEL COAHUILA - DAY\n\nMariachi runs atop the Mean Dudes' parked truck then jumps into the bed of a passing truck. Mean Dudes run outside. The Dudes hve their hands up as if they don't know what to look for.\n\nMEAN DUDE #5\nHe wears black!\n\nShots of lots of people walking around, wearing black items.\n\n\nEXT. DOWN THE BLOCK - DAY\n\nThe truck turns a corner and the driver halts, comes out with a gun and tell Mariachi to get the hell out of his truck. Mariachi leaps out. He is about to continue running, but he stops, clenches his fists, and turns slowly as the camera dollies into his face.\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nCamera dollies into the guitar case on Mariachi's bed.\n\n\nEXT. DOWN THE BLOCK - DAY\n\nMariachi runs back in the direction of the hotel, but as he turns the corner he has to slow down for the Mean Dudes are everywhere. Each one has his gun out and is looking around for the man in black. Mariachi walks slowly, whistling and nodding to everyone as they pass. A few look suspiciously at him but continue searching. Mariachi ducks inside the hotel.\n\n\nINT. HOTEL COAHUILA LOBBY - DAY\n\nMariachi enters the lobby and winks at the old Clerk who is standing over his open register in shock. His eyes widen when he sees Mariachi. He runs out of the hotel.\n\nVIEJO CLERK\n(screaming, pointing inside)\nPENDEJOS!!!\n\n\nINT. MARIACHI'S HOTEL ROOM - DAY\n\nMariachi rushes in, grabs his jacket and puts it on. He grabs his guitar case and squeezes it tight, his eyes shut. Slow dolly into him, as his eyes open.\n\nCLOSEUP of plague on wall with mace and swords. He grabs the mace, swining it around a few times. He feels secure, now. He turns to leave.\n\n\nEXT. HOTEL COURTYARD - DAY\n\nMariachi rushes out the door, he looks down and sees the Mean Dudes entering the courtyard. He ducks his head back just as they look up to see him. Mariachi runs up a smal flight of steps, where he then tosses his guitar onto a balcony, which he then jumps over to himself.\n\nThe men rush up the steps shooting at the balcony. Bullets narrowly miss Mariachi as he climbs over the balcony to safety.\n\n\nINT. HOTEL HALLWAY - DAY\n\nMariachi dashes down the hallway out onto a balcony. He sees no way down.\n\n\nEXT. COURTYARD BALCONY - DAY\n\nThe Mean Dudes are climbing over the balcony like spiders. Mariachi runs back and slams his guitar into the first guy to make it over the balcony. His dummy falls down the stairs and over the narrow railing. The Dude splats on the ground in gruesome CLOSEUP.\n\nThe old man looks over at him as he dies, then turns back as if nothing happened. Mariachi bolts back down the hill.\n\n\nEXT. FRONT BALCONY - HOTEL COAHUILA - DAY\n\nMariachi is looking down the balcony trying to find a way to escape. Mariachi looks behind him.\n\n\nINT. HOTEL HALLWAY - DAY\n\nMean Dudes barrel down the hallway reloading the guns.\n\n\nEXT. FRONT BALCONY - HOTEL COAHUILA - DAY\n\nMariachi flings his mace over an electric cable, then stands on the balcony lip, placing his guitar between his legs.\n\n\nEXT. STREET SHOT OUTSIDE HOTEL - DAY\n\nMariachi is sliding down the cable and turns back to see Mean Dudes firing guns at him. Bus stops in traffic and Mariachi grabs his guitar and jumps onto the hood of the bus.\n\n\nEXT. STREET - DAY\n\nMariachi jumps onto another car and then down into the street.\n\nMean Dudes exit the hotel and chase him on foot while a few get in the truck and chase him. The truck takes a short cut.\n\nMariachi is running through the sidewalks and streets in front os curioso shops, jumping small carts and children and cars to escape the two men behind him. He enters a small cutoff where the truck tries to stop him by heading off. The bad guys stick their heads and guns out of their windows and laugh as they ready to shoot him. Mariachi, though, already having built momentum, runs right up the front of the trucks as the guys try to shoot him but not succeed in only shooting each other as he runs up and over the cab, into the bed, and onto the street. He swings his guitar case into another guy's groin and grabs is gun, reaiming it to shoot Mean Dude #5. Mariachi shoots him in the arm, and Mean Dude #5 drops his gun and cowers away in pain. Mariachi then turns the guy's gun on him and shoots him in the chest. Mariachi grabs his case and as Mean Dude #5 turns to get s look at him, all he sees is the case coming into his face. Mariachi heads back for Domino's.\n\n\nINT. BOYSTOWN SALOON DOMINO'S - DAY\n\nMariachi stumbles through city streets, pausing against a telephone pole as he gazes at Domino's Saloon across the street.\n\nMariachi stumbles across, almost getting hit by a few cars, and drags himself into the saloon.\n\n\nINT. AMADEUS - DAY\n\nMariachi staggers into Amadeus and washes his face in a fountain by the door. He makes his way to the bar as a patron pays and leaves.\n\nDOMINO\nWhat happened to you, Mariachi? Too much refresco?\n\nMARIACHI\nI just killed four guys.\n\nDomino turns around and looks at Mariachi, wondering hard is he's joking. He lifts up a bloody hand, grabs a napkin, and then seems to ask permission with his eyes before wiping his hands clean.\n\nDOMINO\nIs it true?\n\nMariachi nods an ashamed yes.\n\nDomino reaches for her gun under the counter.\n\nThe camera is on Mariachi when she brings it out and points at him.\n\nMARIACHI\n(exhausted)\nWait a minute... what's your name?\n\nDOMINO\nDomino.\n\nMARIACHI\nWait a minute, Domino! It was self-defense.\n\nShe cocks the pistol.\n\nMARIACHI\n(frantic)\nI'm new in town. I don't know everyone!!! I have no friends here... and no enemies.\n\nDOMINO\n(lowering the gun a bit)\nThieves?\n\nMARIACHI\n(nodding)\nNo way. They were well-dressed men. I checked into the cheapest hotel in town, no money, nothing of value, except this guitar and maybe this coat, which they could have taken when I left my room, but they didn't. They were only interested in killing me.\n\nDOMINO\n(lifting the gun back up)\nSo why do you come here? You want to get me killed?\n\nMARIACHI\nI need a place to stay until I figure this out. They've got me mixed up with someone else.\n\nDOMINO\nAnd you've never seen them before? Not even in another town?\n\nMARIACHI\n(long pause)\nAre you saying they followed me, a mariachi, here? What for?\n\nDOMINO\nMaybe they hate your music.\n\nMariachi stares at her expressionless. She stares back at him.\n\nDOMINO\nMaybe you were singing in another town, they hated your voice, and now they're trying to kill you.\n\nMARIACHI\nAre you serious?\n\nDOMINO\n(nodding)\nYes.\n\nShe laughes.\n\nMARIACHI\nAre you going to help me, or am I gonna have to die on your porch?\n\nDOMINO\nI have a room upstairs. My room. Don't touch anything. I'll be up after awhile and we can call a friend of mine.\n\nMariachi shakes her hand.\n\nMARIACHI\nThank you. I'll never forget this.\n\nHe tries to kiss her hand. She slides it away and effortlessly slaps him.\n\nDOMINO\nThis way.\n\nHe follows her to a doorway revealing an unlit staircase. When he enters, the darkness swallows him as she shuts the door behind him.\n\n\nINT. UPSTAIRS DOMINO'S LOFT - DAY\n\nMariachi enters a roomy, luxurious apartment above the main bar. There is a free-standing porcelain tub in the center of the room. Mariachi places his guitar halfway between the entrance and the tub. The camera is tracking backwards with him as he walks, making th room look endless. He removes his jacket as he makes his way to the tub. He drops his jacket onto the floor and gently climbs into the tub. The camera faces him as he settles back. The camera slowly dollies into him as he lays back, crosses his fingers, and gives a relaxed smile.\n\n\nINT. AMADEUS - DAY\n\nDomino is washing a glass. She the then remembers she has the gun in her waist belt, so she removes it and sticks it back under the counter. Wounded Mean Dude #5 comes in limping. She takes out a towel and drops it on the counter.\n\nMEAN DUDE #5\nGood morning, Domino.\n\nDOMINO\nWhat happened?\n\nMEAN DUDE #5\nGive me the phone. I have to call Moco.\n\nShe brings up the phone and sets it down where the cloth was. He picks up the cloth and wraps his arm with it.\n\nMEAN DUDE #5\nIt's not as bad as it looks. Domino, has anyone come through here? A stranger, maybe?\n\nDOMINO\nThis is a boder town. I get strangers all the time.\n\nMEAN DUDE #5\nDressed all in black, carrying a guitar case?\n\nDOMINO\nNo.\n\nMEAN DUDE #5\nWell, he shot me... and has killed ten of Moco's men... all in one day.\n\nDomino looks a little upset. She slides the phone towards him a bit.\n\nDOMINO\nAren't you gonna call your boss?\n\nMEAN DUDE #5\n(nodding)\nI have to tell Moco that he got away again... So, you better give me a drink first.\n\nDomino smiles and pours him half a beer mug with tequila. He laughs and drinks. As he's dialing, the camera is on Domino as she cleans up a few things, every once in a while glancing upstairs.\n\nMEAN DUDE #5\n(into phone)\nMoco, he got away. Shot me in the arm. Killed La Palma. Pepino, Sunday. This guy is one slick maricon. Yeah. Also, I didn't get a look at him. So, unless he's still carrying that guitar around and hasn't changed clothes, I won't even spot him, and I don't think he'll be that obvious...\n\nMOCO (V.O.)\nDon't worry. If there's one thing I know, it's that he'll always wear black and he'll always carry that guitar with him. It's his signature. Besides, that's not a guitar he's carrying. It's a guitar case full of weapons. Find him.\n\nMean Dude hangs up and puts his head in his hands.\n\nDOMINO\nQue paso?\n\nMEAN DUDE #5\nI screwed up. The guy left his guitar case in the hotel room. We chased him out, but he came back for the case.\n\nDOMINO\nMaybe he loves his guitar. It's probably an antique.\n\nMEAN DUDE #5\nIt wasn't a guitar. It was a guitar case full of weapons that he uses on his victims. Adios, I'm gonna take a nap. And thanks for the drink.\n\nMean Dude #5 stumbles as he tries to stand.\n\nMEAN DUDE #5\nIf you see this guy, call us.\n\nHe is about to walk off with the bloody towel and he turns back pointing at it. She waves her hand at him, as if granting him permission to take it. She cleans his glass, and when he is gone she slams the glass down and runs for the stairs. A few seconds later she comes back into the bar, grabs the gun from under the counter and calls her assistant to watch the bar. He sees the gun and wonders what she's up to. She storms upstairs.\n\n\nINT. DOMINO'S LOFT - DAY\n\nDomino opens the door abruptly and finds Mariachi taking a bath. He bolts upright, pulls a towel up from the floor and sits frozen waiting for Domino's next move. She laughs and walks to the counter.\n\nDOMINO\n(friendly)\nI thought I told you not to touch anything.\n\nMARIACHI\nSorry. I needed to relax. I can...\n\nDOMINO\n(smiling)\nNo, it's alright, Finish up. Do you want shampoo?\n\nMARIACHI\n(laying back, closed eyes)\nYes, please.\n\nDomino tunrs to a counter and her smile fades. She looks like she wants to rip Mariachi's throat out with her teeth. She puts the gun down on the counter. She finds an omnious-looking knife and then grabs a bottle of shampoo. She walks over to him, then pulls the knife up to his throat with one hand while grabbing his hair with the other. He opens his eyes wide. The shampoo hits the floor and begins to roll.\n\nDOMINO\nWho are you?!\n\nMARIACHI\n(choking)\nI'm a musician!\n\nThe shampoo bottle rolls into the guitar case and stops. Domino sees this, and with her foot reaches out and pulls the case toward her.\n\nDOMINO\nWhat do you have in here? GUNS? KNIVES?\n\nMariachi tries to catch his breath, pausing before answering her as if wondering if all this is really happening.\n\nMARIACHI\nNo! My guitar!\n\nDomino slides her foot out of her shoe, and unsnaps one of the latches with her toe.\n\nDOMINO\nWe'll see...\n\nShe unsnaps another. The latches snap loud and echo in the quiet room. Mariachi gasps as she tightens her grip.\n\nDOMINO\nYou're very modest, Mariachi...\n\nShe squeezes his hair and unsnaps another latch.\n\nDOMINO\n(through gritted teeth)\nYou told me you killed four men, when you really killed seven. Or were they still breathing even you shot out their hearts?\n\nAnother latch snaps.\n\nMARIACHI\n(groing dizzy)\nI'm a mariachi...\n\nSNAP!\n\nMARIACHI\n... not a murderer...\n\nSNAP!\n\nDOMINO\nAren't you going to watch?\n\nShe lifts the lid with her foot. It seems an eternity before the case is fully open. Domino is looking into the case, but Mariachi is not. He knows what's in there.\n\nMARIACHI\nI told you... I am a musician.\n\nSlow dolly into the case, which contains a white, well-kept classical guitar. Domino is seeing it, and for a moment she almost believes he is telling the truth.\n\nShe rushes to it, grabs the guitar and tosses it to Mariachi. He catches it, choking after she releases the blade. She is on the other side of the tub, now. She jams the knife down between Mariachi's legs. Mariachi's eyes bug.\n\nDOMINO\nPlay it.\n\nMARIACHI\n(still choking)\nW...w...what?\n\nDomino shoves the knife in deeper and Mariachi grimaces horribly.\n\nDOMINO\nPlay it, damnit, play something sweet!!!\n\nMariachi is sweating and his face is extremely red. He pauses for a long time before plucking an odd note. She squints as if she's caught him. But he eventually starts picking out a sweet little melody.\n\nDOMINO\n(growing impatient)\nSING!\n\nMariachi starts to sing but chokes on the words. He starts over, playing a \"Rancho Grande\" sounding song with his own made up words.\n\nMARIACHI\n(in a high sweet voice)\nWhat is this place?\nThat treats me like a murderer?\nThey've all got their heads up their butts...\nEven this beautiful girl,\nWith a knife to my balls,\nShould I kiss her or hit her...\nOr both?\n\nHe finishes his song, bowing and thanking his imaginary audience. Domino is smiling. She pulls the knife slowly out of the water and wipes it off on her apron.\n\nDOMINO\nYou're a mariachi, all right. And a good one.\n\nMariachi bows a solemn thank you.\n\nMARIACHI\nI think this is the best I've ever played. You... inspired me.\n\nCLOSEUP of the knife.\n\nShe laughs.\n\nMARIACHI\nHire me.\n\nDomino looks at him with a silent \"what?\".\n\nMARIACHI\nI'm good. Hire me to play in your bar. I'll work mostly from tips. But, I need steady work.\n\nDOMINO\nI couldn't pay you. I have no money.\n\nMARIACHI\nThis fancy place and you have no money?\n\nDOMINO\nIt's the truth.\n\nMARIACHI\nI'll work for room and board, then. Please, I'm desperate.\n\nDOMINO\n(thinking)\nWill I have to keep a knife at your balls to get you to play like that?\n\nMARIACHI\n(smiling)\nNot if you're paying me room and board. Please... until I find a permanent job.\n\nDOMINO\n(thinking)\nYou won't find a permanent job in this town... but OK.\n\nShe gets up slowly, and turns to leave. Mariachi settles back, smiling triumphantly. Suddenly she darts around and slams the knife between his legs again with a furious look on her face. He bolts up out of this triumphant daze with a look of complete shock. She loosens up and laughs.\n\nDOMINO\nYou're going to need a better sense of humor than that, if you're gonna work for me, kid.\n\nShe flings her knife aside. It sticks into a wall. She shrugs, smiles a beautiful smile, turns, and goes downstairs. Mariachi settles back down, closing his eyes. The knife slips out of the wall and clangs to the ground. Mariachi jumps again, rolls his eyes, and sinks underwater as the picture fades.\n\n\nINT. AMADEUS - EVENING\n\nMariachi plays in Amadeus.\n\n\nINT. AZUL'S HIDEOUT - DAY\n\nCamera tracks past a pool table where TWO RATS are playing nine ball. They make a few shots, then the phone rings. The camera continues to track past a small table where Azul's guitar case lies open. Weapons adorn it, with each knife, each gun in its pocket, in its own place. The camera continues tracking to a dresser on which sits Azul's cellular phone. A delicate female hand lifts the receiver. The camera is now positioned above the bed as the GIRL answers the phone.\n\nGIRL #1\n(into phone)\nYes? One moment please...\n\nHe rolls over and wakes a GIRL sleeping beside her. Girl #2 takes the phone and passes it to a third GIRL as Girl #2 tries to wake Azul (he is sleeping between Girls #2 and #3.).\n\nGirl #3 has the phone to her ear as if listening for background conversation.\n\nThe two Rats playing pool are staring longingly at the three Girls in Azul's bed. They look hungry and deprived. One hits the other, signaling it's his shot. While one shoots, the other watches.\n\nAzul awakens and grabs the phone.\n\nAZUL\n(into phone)\nYeah.\n\n\nEXT. MOCO'S RANCH - DAY\n\nMoco is sitting in his pool. A swimming WAITER is bringing him drinks.\n\nMOCO\n(into phone)\nAmigo! I'm glad I've reached you! You've not answered all day. Killing ten of my men must have been very time consuming!\n\nAZUL\n(into phone)\nSix.\n\nMOCO\n(into phone)\nWhat?\n\nAZUL\n(into phone)\nI've only killed six! You were always bad at maths, Moco. I guess that's why you never paid me half of the money. You thought it all belonged to you.\n\nMOCO\n(into phone)\nI knew half was yours... I got greedy, my friend. It's my nature. But you!!! You are modest! You've killed ten of my men!! I know, because I'm having them buried in my yard right now. With my dogs and cats.\n\nAZUL\n(counting on his fingers, into phone)\nI killed six. But don't bother counting so soon. The number will triple by tomorrow.\n\nMOCO\n(into phone)\nI'm sorry things turned out this way. My friend. I got greedy. I should never have tried to kill you. It would have been cheaper for me to pay you. Now I've got to find ten new men.\n\nAZUL\n(into phone)\nSix.\n\nMOCO\n(into phone)\nTen.\n\nAZUL\n(into phone)\nI tell you what. You give me my money, and I won't kill any more of your men... And I won't kill you.\n\nMOCO\n(takes a sip, into phone)\nNo, it's too late for that. We're going to have to see this through.\n\nAZUL\n(into phone)\nJust like the Moco I used to know. Still wearing white?\n\nMOCO\n(looking down at his clothes, into phone)\nWhat do you think?\n\nAZUL\n(into phone)\nI think you should change clothes. I'd hate to ruin a white suit with your stupid blood.\n\nAzul hangs up. He gets dressed and leaves. The little Rats are about to follow, but one Rat walks over to get one look at the girls. The girls tease him, and when he tries to advance them, they pull guns and laugh as the Rat runs away.\n\n\nINT. AMADEUS - DAY\n\nDomino walks by with a trash can. Mariachi is sitting on a barstool.\n\nMARIACHI\nI need to get my money back from that hotel. I'll be right back.\n\nDOMINO\nAre you crazy? If you go anywhere with that jacket and that case you could be killed. Leave that stuff here.\n\nMariachi gets up and is about to get his guitar case from under the stool.\n\nMariachi leaves it under the stool and takes off the jacket.\n\nMARIACHI\nI never go anywhere without it. Take care of it.\n\nMariachi leaves. Domino drops the trash can and tells her assistant to watch the bar. She heads for the staircase.\n\n\nINT. DOMINO'S LOFT - DAY\n\nDomino walks out onto her balcony, peering down into the street.\n\nPOV shot of Mariachi walking through the street.\n\nDomino turns and walks to the phone. She dials a number by heart and sits in a plush chair.\n\n\nEXT. MOCO'S RANCH - DAY\n\nMoco answers the phone. Towel around his neck, wet hair.\n\n\nINT. DOMINO'S LOFT - DAY\n\nDOMINO\n(dolly in slow, into phone)\nHi. It's Domino.\n\nMOCO\n(into phone)\nI know who it is...\nDolly into Moco.\nINT. HOTEL COAHUILA - DAY\n\nThe Clerk is reading a paper. He hears a noise and pulls it aside. Mariachi is standing at the counter smiling. The Clerk jumps in his seat, then after a few frozen seconds he sets down his paper and reaches for Mariachi's old room key.\n\nMariachi shakes his head \"no\", points to the register, and makes the money sign with his hand. The Clerk slowly moves over to the register. He depresses a few keys to open it. It won't open. He makes a gesture like it's stuck or something (he is not very convincing). He tries again and again; each time pretending to get more impatient.Mariachi glances down at the Pit Bull. The Pit Bull is eyeing Mariachi. Mariachi points to the Clerk as if he has an inside joke with the dog (\"this guy...\"). Mariachi climbs over the counter and stands next to the Clerk. The Clerk things Mariachi is a lunatic. Mariachi holds up a finger as if cueing the Clerk for a demonstration. Mariachi then leaps over the counter landing firmly back on the other side of the counter.\n\nCLOSEUP of his feet landing hard, just as before.\n\nThe register opens. Mariachi shrugs, smiles, and reaches into the register, taking his money out himself. He counts it. After a brief consideration, he decides to leave the old man a tip. Mariachi waves a \"good-bye\" wave and dances out. The old man, still standing there with his arms outstretched as if he was robbed, dashes to the phone and calls Moco's men.\n\n\nINT. AMADEUS - DAY\n\nThe bar Assistant is cleaning the bar. He walks over to grab a few glasses and when he returns, Azul is sitting at the barstool Mariachi was on earlier. The Assistant looks around, wondering where Azul appeared from.\n\nASSISTANT\nCan I get something to drink or eat?\n\nAZUL\nOne beer.\n\nThe Assistant grabs a mug and starts to fill it at the tap. He fills it halfway when...\n\nAZUL\nIn a bottle, wey.\n\nASSISTANT\n(laughs)\nSorry.\n\nHe grabs a bottle and hands it to Azul, then lifts the mug, toasts and drinks it straight down.\n\nAzul drinks his straight down, too.\n\nAZUL\n(looking around)\nIsn't there a girl that works here?\n\nASSISTANT\nYeah, she owns the place.\n\nAZUL\n(heading a few bills to the Assistant)\nShe owns it, now? Then she is Moco's girl?\n\nASSISTANT\n(looking around)\nSo-so. She's onto this new musician.\n\nAzul takes out a few more bills and hands them to the Assistant, and begins to stand up.\n\nAZUL\nThank you.\n\n\nEXT. STREET - DAY\n\nMariachi is out on the streets, returning to Domino's.\n\n\nEXT. BOYSTOWN SALOON - DAY\n\nAs he crosses the street he notices Azul leaving the saloon with a guitar case. Mariachi runs into the saloon.\n\n\nINT. AMADEUS - DAY\n\nMariachi runs inside and checks to see if his case is still there. Domino comes downstairs.\n\nMARIACHI\nI just saw a guy with a guitar case like mine. It's him they want.\n\nDOMINO\n(to Assistant)\nDid he say anything?\n\nASSISTANT\n(nodding)\nNo, he just ordered a drink.\n\nMARIACHI\nI don't look anything like him...\n\n\nEXT. STREET - DAY\n\nAzul is walking to his truck when he turns to a corner and Mean Dude #4 sticks his gun in his face. Two more guns appear, pointed at the back of his head.\n\nMEAN DUDE #10\nIs this the guy?\n\nMEAN DUDE #5\nI'm not sure...\n\n\nEXT. DOWN THE STREET - DAY\n\nThe two Rats are in the blue truck half a block away. One hits the other to look at what's happening to Azul.\n\nPOV of Rats seeing Azul with three guys around him with guns. They look at each other, start the truck and speed away.\n\n\nEXT. STREET - DAY\n\nMEAN DUDE #5\nWhat's in the case?\n\nAZUL\nMy guitar.\n\nMEAN DUDE #5\nYeah? You're one of those old-time mariachis, huh?\n\nAZUL\n(pause)\nYes.\n\nMEAN DUDE #5\nOK, let's take a look.\n\nMean Dude #4 takes the case and lays it flat in Azul's palms.\n\nMEAN DUDE #5\nIf it's a guitar like you say it is, we'll never bother you again...\n\nMean Dude #4 unsnaps two of the latches, SNAP SNAP.\n\nMEAN DUDE #5\nIf it's not...\n\nHe unsnaps three more... SNAP... SNAP... SNAP!\n\nMEAN DUDE #5\n... then we'll spray paint this street with your brains.\n\nHe points the gun deep into Azul's face and cocks it. Azul closes his eyes. Mean Dude #5 lifts the lid. Azul hears a faint strumming sound, followed by the sound of the Mean Dude slamming the case shut. Azul opens his eyes. The Mean Dude resnaps the latches. SNAP... SNAP... SNAP-SNAP-SNAP!!!\n\nMEAN DUDE #5\n(walking away)\nSorry....\n\nThey walk away leaving Azul wondering what happened.\n\n\nINT. AMADEUS - DAY\n\nDomino, Mariachi, and Assistant are standing at the bar.\n\nDOMINO\nLook, as long as you don't carry the case around, they'll leave you alone. It's that guy they're after.\n\nMARIACHI\n(putting on his coat)\nI better put this upstairs...\n\nHe grabs the case and begins to take it to the stairs, but he pauses for it feels different to him. He slowly looks down at it.\n\n\nEXT. STREET - DAY\n\nAzul watches the Mean Dudes go and when tey turn the corner he puts the case on the ground to open it.\n\n\nEXT. AROUND THE CORNER - DAY\n\nThe Mean Dudes are rounding the corner, but Mean Dude #5, who is last, snaps his fingers and motions to the others to keep quiet and to watch Azul\n\n\nINT. AMADEUS - DAY\n\nMariachi shakes the case, and puts it on the counter as if to open it... but he doesn't need to check it. He knows it's not his guitar.\n\nDOMINO\nWhat's wrong?\n\nMariachi looks at her startled, then runs out of the bar with the case.\n\n\nEXT. AROUND THE CORNER - DAY\n\nMean Dudes are watching Azul unsnap his case.\n\n\nEXT. STREET - DAY\n\nAzul opens the lid, revealing Mariachi's guitar.\n\n\nEXT. AROUND THE CORNER - DAY\n\nMEAN DUDE #5\nThat's him...\n\nThe Mean Dudes start walking towards Azul as the camera tracks back with them. Azul slams the case shut, wondering what the hell is going on. He looks up and notices the Mean Dudes walking towards him. He stands up and slowly walks in the other direction.\n\n\nEXT. A BLOCK AWAY - DAY\n\nMariachi is running through the streets and onto the sidewalk.\n\n\nEXT. STREET - DAY\n\nThe bad guys are pulling out their weapons.\n\nMariachi bolts around the corner. Now everyone is on the same sidewalk. Mariachi and Azul are on each end of the street with the Mean Dudes in between them.\n\nAzul turns and sees Mariachi with his guitar case. Mean Dude #5 turns and sees Mariachi, too.\n\nMEAN DUDE #5\nThat's him...\n\nThe two other Mean Dudes exchange glances. Mean Dude #5 stalks after Mariachi, so the other two follow. Mariachi looks to Azul for help. Azul tips the imaginary hat to Mariachi and walks away.\n\n\nEXT. ANOTHER STREET - DAY\n\nMariachi runs through the street almost getting hit. Bullets are flying as the Mean Dudes are firing at him as they run.\n\n\nEXT. DEAD END - DAY\n\nMariachi leaps up over a few cars and ends up in a dead end. He turns around, drops the case on the ground and opens it. A million weapons seem to stare back at him when he opens it. He is frantic. He grabs a small gun, shakes it in his hand, doesn't like the feel. He tosses it back in.\n\n\nEXT. STREET - DAY\n\nThe Mean Dudes are barreling down the street. One turns towards the dead end.\n\n\nEXT. DEAD END - DAY\n\nMariachi pulls out the MAC-10 and blasts the first Mean Dude he sees. He grabs the case and runs out into the street, jumping onto a truck and blasting the other Mean Dude from up there. He sees Mean Dude #5 run away.\n\nMariachi comes off the truck and walks through the streets in slow motion. Peolple are staring at him as if he was Azul the killer. Mariachi walks straight to the bar. A BOY is bouncing a ball on one of the sidewalks.\n\n\nINT. AZUL'S HIDEOUT - DAY\n\nThe camera dollies past the vacant pool table, and over to a Rat sitting in a chair, drinking a beer. The other Rat is pacing back and forth in front of the sitting Rat. Azul enters the room. Throwing his guitar case onto the pool table as a grand entrance gesture. The sitting Rat stands beside the pacing Rat.\n\nRAT #1\nI'm sorry we left...\n\nRAT #2\n... We didn't know what to do...\n\nRAT #1\n... We figured you could defend yourself!!!\n\nRat #2 nods in agreement. Azul unsnaps one of the latches. SNAP!\n\nAZUL\nYou thought I could defend myself...\n\nSNAP! SNAP!\n\nAZUL\n... against three armed men...\n\nSNAP!\n\nAZUL\n... using this?\n\nHe opens the case and the guitar sparkles at them. The Rats exchange glances. They look at the guitar then back at Azul.\n\nAZUL\nMy case got switched with some maricon mariachi!\n\nRAT #1\nWhere is this mariachi?\n\nAZUL\nHe's dead by now... So, I want you to go look for my case.\n\nThe two Rats are about to leave.\n\nAZUL\nLeave me a wepon.\n\nBoth Rats take out their guns. Azul takes Rat #2's gun.\n\nAZUL\nThat was disloyal of you to leave me out there. You should be as loyal to me as you are to each other.\n\nThe Rats exchange glances, then aim their eyes back to the floor. Azul turns to Rat #2.\n\nAZUL\nAre you loyal?\n\nRAT #2\n(after glancing at Rat #1)\nYes.\n\nAZUL\n(to Rat #1)\nAre you loyal?\n\nRAT #2\nYes.\n\nAzul gestures to Rat #2.\n\nAZUL\nThen shoot him.\n\nRat  #1 turns to Rat #2 who is in shock.\n\nAZUL\nYou are loyal, are you not? SHOOT HIM. Or I shoot you.\n\nAzul aims his gun at Rat #1, who immediately aims his gun at Rat #2. Rat #2 is sweating bullets. Rat #1 puts his gun down.\n\nRAT #1\nI can't.\n\nAZUL\nWhy not?\n\nRAT #1\nYou said we should be as loyal to you as we are to each other. I couldn't shoot him, for that would be as disloyal as shooting you.\n\nRat #2 glances back and forth between Rat #1 and Azul.\n\nAZUL\nVery good. Now go find my case.\n\nAzul puts his gun down and motions the rats to leave. They leave. When they exit, Rat #1 turns to Rat #2 and snaps his fingers. Rat #2 shakes his hand. They leave.\n\n\nINT. DOMINO'S LOFT - NIGHT\n\nDomino is dabbing hydrogen peroxide onto a cotton swab. She applies it to Mariachi's body scars on his back. Mariachi has his eyes closed. He washes the blood from his face.\n\nMARIACHI\nWhere were you when he came into the bar?\n\nDOMINO\nI was on the phone, talking to a friend that knows what's going on.\n\nMARIACHI\nDid you mention me?\n\nDOMINO\nNo... He told me the man in black is Azul.\n\nMARIACHI\nIf his name is Azul, why doesn't he wear blue?\n\nDOMINO\nI don't know... Anyway, he's killing the men of the town drug dealer. The dealer's name is Mauricio. But he's known as Moco.\n\nMARIACHI\nAnd Moco is sending these men to find Azul. So, why do they chase me?\n\nDOMINO\nThey have never seen Azul... only Moco knows him. My friend says the description Moco gave his men was that he wears black, and carries a guitar case. Sounds like you, no?\n\nMARIACHI\nCouldn't you tell your friend that there are two people like that in his town? One is a killer, and one is a mariachi.\n\nDOMINO\nOnly special people can talk to Moco. Besides, you've killed a few of his men, now. Your best option is to keep out of sight, stop wearing black, and to hide that stupid case until this is all over.\n\n\nEXT. MOCO'S RANCH - DAY\n\nMean Dude #5 comes in and approaches Moco.\n\nMEAN DUDE #5\nHe got away... but I got a good look at him.\n\nMoco takes out a cigarette and puts it in his mouth.\n\nMEAN DUDE #5\nCoca, Caca, Beto were killed.\n\nMoco takes out a match.\n\nMEAN DUDE #5\nHe won't get away again, Moco. I promise.\n\nMoco lights his match across Mean Dude #5's face and lights his cigarette. Mean Dude #5 walks away, as Moco flicks his match at him in slow motion.\n\n\nINT. DOMINO'S LOFT - NIGHT\n\nMariachi is about to lay on the floor. She tosses him a blanket.\n\nMARIACHI\nAre you always closed Monday nights, or did you close since I can't play my guitar tonight?\n\nDOMINO\nMondays are my day off. Want to play a game?\n\nMARIACHI\nSure.\n\nThe phone rings. Domino gets up to answer it. Mariachi reaches under his blanket for a small mirror and combs his hair, putting spit in his hair to slick it down. He quickly stashes the mirror.\n\nDOMINO\n(into phone)\nHello?\n\nMOCO\n(into phone)\nCome see me.\n\nDOMINO\n(into phone)\nI can't.\n\nMOCO\n(into phone)\nPlease.\n\nMoco is sitting at a table playing cards.\n\nDOMINO\n(into phone)\nI don't feel well. I've got to go.\n\nMOCO\n(into phone)\nHave you ridden the bike?\n\nDOMINO\n(into phone)\nNo... I've got to go...\n\nShe hangs up.\n\nMARIACHI\nBoyfriend.\n\nDOMINO\n(quiet as if thinking)\nNo...\n\nMARIACHI\nI can't figure out something. You tell me you're poor. Poor family. Yet you've got this place.\n\nDOMINO\n(sighing)\nThis place is a gift.\n\nMARIACHI\nFrom who?\n\nDOMINO\nFrom Mauricio.\n\nMARIACHI\nFrom EL MOCO? The man trying to kill me?\n\nDOMINO\nHe's not trying to kill you, his man had you confused with Azul.\n\nMARIACHI\nSame thing.\n\nDOMINO\nLook, you now how if you want to impress a girl, you send her flowers, candy, jewelry until you win her love?\n\nMARIACHI\nYes.\n\nDOMINO\nIf one present doesn't work, you keep sending bigger and better things until you win her or you're broke?\n\nMARIACHI\nCorrect...\n\nDOMINO\nWell, Mauricio sent me flowers, then jewelry, then he gave me a job at his saloon, then he gave me the whole saloon... etc.\n\nMARIACHI\nHe's still giving you things?\n\nDOMINO\nHe'll never run out of money.\n\nMARIACHI\nAnd you accept it all? What's the last thing he sent you?\n\nDomino walks over to the counter and picks up a key.\n\nDOMINO\nA motorcycle.\n\nMariachi laughs.\n\nDOMINO\nHe wants me to ride out to his ranch when I've decided to be his. He thinks he's close to having me.\n\nMARIACHI\nIs he?\n\nDOMINO\n(pause)\nHe was.\n\nShe sits next to Mariachi.\n\nDOMINO\nNot anymore.\n\nThey kiss. She gets up and is about to turn off the lights.\n\nMARIACHI\nSo, you really are from a poor family.\n\nCLICK!\n\nDOMINO\n(in the dark)\nI remember when I was growing up, we were so poor, that my brothers and sisters and I all slept on the same blanket stretched out across the floor. We had to sleep in a circle, with our fingers in each other's ears, to keep the bugs from crawling into them.\n\nMARIACHI\n(after a pause)\nAy, wey...\n\nDomino laughs.\n\n\nINT. AMADEUS - DAY\n\nDomino hands Mariachi a wad of money.\n\nMariachi sees the money and looks up at her bewildered.\n\nDOMINO\nHere's a little bit I've saved. I want you to go get a new guitar.\n\nMariachi starts to put up his hand as if to refuse it.\n\nDOMINO\nTake it, stupid. I'm not saying go by the best one, just a temporary one so you can play again tonight.\n\nMariachi stops and thinks... He looks up at her questioningly, then he shrugs an \"OK\" and grabs the money and jogs out excitedly. Domino is smiling.\n\n\nEXT. STREET - DAY\n\nMariachi walks down the sidewalk, passing curioso shops. The camera is low and zoomed in all the way. Mariachi stops by one of the window that has a guitar in the glass. He pulls his money and counts it. He stops after he notices someone's reflection in the window. He turns around and sees it is Mean Dude #5 right across the street. He meets up with another Mean Dude. They are standing right behind Mariachi. Mariachi is pretending to still look at the window. The Mean Dudes walk past Mariachi so Mariachi walks in the opposite direction. Mean Dude #5 stops and then turns around slowly. Far zoomed shot of Mariachi walking down the street with guys behind him. They start after him.\n\nMEAN DUDE #5\nThat's him...\n\nTracking shot following Mariachi.\n\nTracking shot in front of Mean Dudes walking at Mariachi.\n\nMean Dude #5 pulls out a small walkie-talkie and calls his buddy in the truck a block away.\n\nMEAN DUDE #5\n(into walkie-talkie)\nLoco, he's headed your way... black pants, white shirt.\n\n\nIN A TRUCK DOWN THE STREET\n\nLOCO starts the truck and starts driving slowly across the street. As he turns on the corner, Mariachi sees the truck and casually climbs inside and hides in the back. Mean Dude #5 turns the corner when whispers into walkie-talkie.\n\nMEAN DUDE #5\n(into walkie-talkie)\nWhere did he go, Loco?\n\nLOCO\n(laughs, into walkie-talkie)\nHe got in my truck.\n\nMean Dude #5 laughs.\n\nMEAN DUDE #5\n(into walkie-talkie)\nTake him around the block.\n\nMean Dude #5 taps his buddy and they start running down the block.\n\nMariachi is in back the truck searching for a weapon. The truck stops. Mariachi rolls to the side and gently lifts his head.\n\nPOV Mariachi sees the two Mean Dudes walking at him. Mariachi turns and Loco is there to knock him in the face with the rifle butt. Mariachi falls into truck, blood trickling from his dizzying head. He tries to get up a bit, but Loco is in the truck now, and slams the rifle down into his face hard... Blackout.\n\n\nDUSTY ROAD TO MOCO'S\n\nMariachi is unconcious in the back of Loco's truck. Mean Dude #5 and other Mean Dudes are riding in back with Mariachi.\n\n\nEXT. ROAD TO MOCO'S - DAY\n\nThe above scene intercuts back and forth with the arrival of Loco. Loco arrives at the gate, Mean Dude #5 opens the gate, they drive through. The truck is facing Moco so he can't see Mariachi yet. Mean Dude #5 closes the gate and walks over to the truck, opens the back door, and calls Moco over. Moco walks over to the truck and looks inside.\n\n\nEXT. TRUCK - DAY\n\nMariachi is laying there unconcious, Moco puts his arm around Mean Dude #5, who is looking very proud, and Moco pulls out a cigarette and a match.\n\nMOCO\nThat's not him.\n\nMoco strikes the match behind Mean Dude #5's head. Mean Dude #5 stops smiling.\n\n\nINT. AMADEUS - DAY\n\nDomino is waiting on customers. She glances at her watch. A few seconds later she glances at it again. She looks very worried.\n\n\nINT. AZUL'S HIDEOUT - DAY\n\nAzul's Rats burst into the hideout. FOUR GIRLS pop up over the partition with guns. The Rats stop in their tracks. The girls sigh a \"oh, it's them\" sigh and slink back to bed. Top shot of them trying to wake Azul. Azul wakes up and looks over the partition.\n\nAZUL\nWhere's my case?\n\nRAT #1\nWe couldn't find it.\n\nRAT #2\nWe heard they caught you and were taking you to Moco's ranch.\n\nRAT #1\n... so we came to see if it was true.\n\nAzul thinks a moment. He stands up.\n\nAZUL\nThey caught the mariachi.\n\nAzul dresses, smiling...\n\n\nINT. MOCO'S RANCH - DAY\n\nMariachi is in a holding cell at the ranch. He twitches, finally waking up.\n\nHe sees a GUARD outside and finds a way to escape.\n\nHe grabs the guard's assault rifle and turns a corner. Two men grab him. He slams the butt of the rifle, knocking the wind and teeth out of BAD GUY #1, then he kicks down and breaks the shin bone of BAD GUY #2 who screams out in agony. Mariachi silences him by karate punching his throat. The Bad Guy gurgles and hits the ground.\n\nAngle from the ground as Mariachi smashes the guy with is gun.\n\nHe crawls up a wall, trying to escape as quietly as he can. He sees TWO MORE MEN running towards him since they heard some noise. Mariachi aims his assault rifle at the blue Chevy parked behind him. He fires and it explodes.\n\nMariachi jumps Loco, gets him to drive him to the saloon. He also takes Loco's money.\n\n\nEXT. BOYSTOWN SALOON - DAY\n\nAzul walks into frame, looks around then proceeds into the bar.\n\n\nINT. AMADEUS - DAY\n\nAzul goes inside and finds Domino tending the bar.\n\nDOMINO\nWhat can I get you?\n\nAZUL\nOne beer.\n\nShe grabs a bottle and slams it down on the counter unopened. He eyes her admirably and then pops the top with one hand.\n\nHe guzzles the drink, slamming it down empty.\n\nDOMINO\nAnything else?\n\nAZUL\n(nodding)\nMy guitar case.\n\nDOMINO\nWhere's Mariachi?\n\nAZUL\nWhere's my case?\n\nDOMINO\nUpstairs.\n\nAZUL\nGet it.\n\nDomino grabs another beer for him and runs to get the case.\n\n(In between this time, Mariachi escapes with Loco.)\n\nShe returns, slamming it to the floor.\n\nAZUL\nIf you want your mariachi back, come with me.\n\nDOMINO\nWhy will you help me?\n\nAZUL\nBecause you know where Moco's ranch is... I don't.\n\nDomino calls her Assistant.\n\nAZUL\nYou help me, I'll help you.\n\nDOMINO\nLet's go.\n\nThey leave. The Assistant tends to the bar.\n\n\nROAD TO MOCO'S\n\nThey drive out to Moco's ranch in Azul's truck. Little do they know, they passed Loco's truck with Mariachi crouched in the passenger seat. He gets up after the truck passes. Mariachi didn't know it was Domino in Azul's truck or he could have turned around and kept her from going to Moco's ranch.\n\nThey arrive at the gate and het out of the truck.\n\nDOMINO\n(over the gate)\nMauricio!!\n\nAzul grabs Domino and points a gun to her head. He whispers to her...\n\nAZUL\nPlay along...\n\nHe kicks at the gate.\n\nAZUL\nOpen the gate or she's dead!\n\nThe gate opens and we see Moco standing at a three-quarter stance, flanked with his men on both sides. Azul drags Domino in and faces her at Moco with a gun to her head.\n\nMOCO\n(to Domino)\nI'm sorry he used you to get to me, Domino.\n\nAzul cocks the pistol.\n\nMOCO\nAzul, let her go and you'll get your money.\n\nAZUL\nMoco, give me my money or I ruin your clothes with her blood.\n\nMoco signals his men to get the money.\n\nDOMINO\nWhat have you done with Mariachi?\n\nMOCO\nWho?\n\nDOMINO\nThe musician your men confused with Azul.\n\nMOCO\n(staring at her)\nSo that's why you were busy that night...\n\nAzul is glancing between Domino and Moco.\n\nMOCO\n... you had that little monkey climbing all over you.\n\nAZUL\nGive me my money or I kill her NOW!!!\n\nMOCO\nAfter all I've done for you, this is how you treat me?\n\nDOMINO\nI never asked you for anything until now. Let Mariachi go.\n\nAzul is anxious now.\n\nAZUL\nI swear I'll kill her!\n\nMOCO\nNo you won't. I will.\n\nMoco pulls out his gun and shoots her in the heart. She falls limp in Azul's arms. Azul tries hold her up, but she's dead. Azul rests her on the ground, looking down at her, wondering why it's all come to this.\n\nAZUL\nAll I wanted was my rightful share. But you've got to kill everybody.\n\nMOCO\nYou feel sorry for her, don't you? See, that's why you can't ever be as big as me.\n\nAzul slowly looks at Moco.\n\nMOCO\n(aiming gun)\nBecause you have too much heart.\n\nMoco shoots Azul in the heart. Azul had his hands to his side, and now he falls to his knees. Moco shoots him again, and Azul dies next to Domino.\n\nMean Dude #5 is exchanging glances with the others. No one seems to be on Moco's side.\n\n\nEXT. NEAR SALOON - DAY\n\nMariachi is still in Loco's truck.\n\nMARIACHI\nStop here.\n\nLoco stops the truck and Mariachi gets out. Loco drives back when Mariachi motions for him to leave. Mariachi watches him go then dashes around the corner to the saloon.\n\n\nINT. AMADEUS - DAY\n\nMariachi runs into the bar...\n\nMARIACHI\nDomino!!! We're leaving!!! Right now!!!\n\nThe Assistant rushes over to Mariachi.\n\nASSISTANT\nShe's gone.\n\nMARIACHI\nWhere is she?\n\nASSISTANT\nLooking for you.\n\nMariachi is about to race upstairs.\n\nASSISTANT\nShe gave the case back to that guy. She left with him to find you.\n\nMariachi tries to make sense of it all for a minute before grabbing the gun from under the counter and rushing upstairs.\n\n\nINT. DOMINO'S LOFT - DAY\n\nMariachi grabs the key to the motorcycle and runs out. The motorcycle burns down the road.\n\n\nMARIACHI ON THE ROAD TO MOCO'S\n\nMariachi barrels down the road on the motorcycle.\n\n\nEXT. MOCO'S RANCH - DAY\n\nMoco is walking away from the bodies.\n\nMOCO\nBring that musician out here so he can be reunited with my Domino.\n\nSome men go to check.\n\nCut back and forth with Mariachi coming.\n\nMEN\nHe's gone, sir.\n\nMOCO\nFind him!!\n\nMariachi rides through the semi-open gate... stopping at the bodies. He dismounts the bike and holds Domino.\n\nHe has the gun in the back of his pants. You can see it while his back is to the camera and men are approaching him. Moco comes for the show.\n\nMOCO\n(good shot)\nSo you're the little mariachi that came to town, killed my men, and stole my girl...\n\nMariachi slowly lifts his eyes to Moco.\n\nMOCO\nYou are very talented.\n\nMariachi stands, hands up.\n\nMOCO\nI bet you play the guitarra real well, huh?\n\nMariachi says nothing.\n\nMOCO\n(raising gun)\nNot anymore.\n\nMoco fires into Mariachi's left hand. Mariachi grimaces, crumbling to the floor. He keeps a tight grip on his hand. When he opens his hand to see the damage, the camera can see right through his hand for a reverse shot of his face through the hole.\n\nMOCO\nNow get the hell off my property and take your hand with you!!!\n\nMoco is laughing and looking at his men for support, but no one else laughs. Mariachi tries to stand, but he falls back. When he rises again he has the gun in his hand. He shoots Moco in the chest. Moco falls back and hits the ground hard. He gasps for air...\n\nMoco's men gather around him. Mean Dude #5 crouches down to check Moco's throat pulse. Moco's dead. Mean Dude #5 strikes a match across Moco's face and lights up a cigarette. He turns and walks away. The others follow.\n\nMariachi wraps a tourniquet on his arm, kisses Domino, opens Azul's case, sees the weapons, and rides off with it.\n\n\nMARIACHI ON THE ROAD\n\nHe looks back at the town behind him, then places his hand on the motorcycle to drive off. We notice the metal brace on his hand.\n\nMariachi rides into the sunset road. He speeds pas a sign: \"ACUÑA 18 miles\"\n\n\"Coming soon\nEL MARIACHI II\"\n\nFADE OUT\n\n\n\nTHE END\n\n\n\nEl Mariachi\nWriters :   Robert Rodriguez\nGenres :   Action  Thriller  Crime  Western\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "After breaking out of jail in a small Mexican town, a ruthless criminal, nicknamed Azul (Reinol Martínez), ventures off with a guitar case full of weapons and vows revenge on the local drug lord, Moco (Peter Marquardt), who had had him arrested in the first place. Meanwhile, a young musician (Carlos Gallardo) arrives in town carrying his own guitar case which contains his signature guitar. He hopes to find work in the town in order to pursue his dream of becoming a mariachi like his father.\nFrom the confines of his heavily guarded villa on the outskirts of town, Moco sends a large group of hitmen to kill Azul. They are told to look for a man who is wearing black and carrying a guitar case, but because the Mariachi also matches this description, the hitmen mistake him for Azul and begin to pursue him. Only Moco, however, knows Azul's actual face. The Mariachi is then forced to kill four of the attackers in self-defense after being chased through the streets. As the Mariachi seeks refuge in a bar owned by a beautiful woman named Dominó (Consuelo Gómez), he quickly falls in love with her. Unfortunately, Moco is not only financing the bar, but also has his own romantic interest in Dominó.\nWhen Azul visits the bar for a beer and information about Moco, he accidentally leaves with the Mariachi's guitar case. Moco's thugs capture Azul on the street but let him go when they learn that the case he is carrying contains only a guitar. A short time later, the Mariachi is captured and taken to Moco, who identifies him as the wrong man and sets him free.\nMeanwhile, Azul, who has no directions to Moco's home, takes Dominó with him and orders her to take him to Moco's, or Moco will kill the mariachi. Dominó agrees in order to save the Mariachi's life. When they arrive at Moco's gated compound, Azul pretends to take Dominó hostage in order to gain entry. Moco soon realizes that Dominó has fallen for the Mariachi and, in a rage, shoots both her and Azul. Suddenly, the Mariachi arrives to find the woman he loves gunned down. Moco then shoots the Mariachi's left hand, rendering him useless as a guitar player. However, overcome with grief and rage, the Mariachi picks up Azul's gun and kills Moco, taking revenge for Dominó's death. Moco's surviving henchmen, seeing their leader dead, walk off and leave Moco's body and the wounded Mariachi behind.\nThe Mariachi leaves the town on Dominó's motorbike, taking her pit bull and her letter-opener by which to remember her. His dreams to become a mariachi have been shattered, and his only protection for his future are Azul's former weapons which he takes along in the guitar case."}