{"title": "Excalibur", "full_text": "EXCALIBUR\n\n \n\n                                       Written by\n\n                             Rospo Pallenberg & John Boorman\n\n\n\n                             Adapted from \"Le Morte D'Arthur\"\n\n                                            by\n\n                                      Thomas Malory\n\n\n                                                              Final Draft\n\n                \n\n               FADE IN:\n\n               EXT. FOREST - NIGHT\n\n               Darkness. The sound of battle cries and the clang of metal \n               upon metal. The forest lights up with huge sparks flying \n               from sword and ax as armored knights hack and swing at each \n               other. Mounted knights collide head-on at full gallop, their \n               armor made incandescent in the clash. Sparks eddy in their \n               wakes and float to the ground. The forest catches fire.\n\n               MAIN TITLES on the flames. Out of the sounds of ancient battle \n               grows music, heroic and barbaric, shot through with \n               melancholy.\n\n               Two crazed eyes reflect the fire. The eyes belong to a man \n               without age, at once ancient and boyish, female and male; \n               his eyes are pained from the burden of too much knowledge. \n               So close is he to the flames that a lock of his wild hair \n               sizzles alight. He slaps at the fire as if it were an annoying \n               insect. He wears a cloak of black trimmed with silver. It is \n               Merlin. The wizard weaves a path through the burning forest, \n               dodging the combatants, searching.\n\n                                     MERLIN\n                         Lord Uther! Lord Uther!\n\n               The forest around him weeps softly with the sounds that follow \n               slaughter. Patches of undergrowth are smoldering. Small flames \n               lick bark and branches.\n\n               Smoke floats through the trees and hovers over the bodies of \n               the dying and the dead.\n\n               A huge knight reins up beside Merlin on a lathered horse. \n               His armor is blood spattered. He is weary from battle. He \n               looks down at Merlin, his countenance fierce. The blade of \n               his sword glows with an unnatural aura.\n\n                                     MERLIN\n                         It's done. A truce. We meet at the \n                         river.\n\n                                     UTHER\n                              (disgusted)\n                         Talk. Lovers murmuring to each \n                         other...\n\n               EXT. RIVER, FOREST - DAY\n\n               Waiting on one bank of a small river that flows through the \n               forest is a warlord, the Duke of Cornwall. He is flanked by \n               his armored warriors. Lot of Lowthean prominent among them. \n               They are battle-weary and bloodied, but they look ready to \n               fight. Behind them is an army of lesser knights.\n\n               To the opposite bank come Uther and Merlin, a much smaller \n               force of knights, including Uryens, Lord of Gore, surrounding \n               them.\n\n                                     DUKE OF CORNWALL\n                         I spit on your truce, Uther. If you \n                         want peace, throw down your swords.\n\n               Uther and the Duke of Cornwall glare at each other in silence \n               across the river. Uther strains forward, burning with anger; \n               but Merlin restrains him.\n\n                                     UTHER\n                         I should butcher all and every one \n                         of them. Merlin, what is this wagging \n                         of tongues?\n\n                                     MERLIN\n                         Just show the sword.\n\n               Uther unsheathes his mighty sword, and brandishes it in the \n               air high over his head. The blade hums disquietingly and \n               leaves a lingering electric hue upon the air. The marvel \n               instills dread in all present.\n\n                                     MERLIN\n                              (waxing eloquent)\n                         Behold the sword of power, Excalibur. \n                         Before Uther, it belonged to Lud, \n                         before Lud, to Beowulf, before Beowulf \n                         to Baldur the Good, before Baldur to \n                         Thor himself and that was when the \n                         world was young and there were more \n                         than seven colors in the rainbow.\n                              (and in an aside to \n                              Uther)\n                         Speak the words.\n\n                                     UTHER\n                              (bellowing)\n                         One land, one king! That is my peace!\n\n               The Duke of Cornwall looks around nervously as some of his \n               knights fall to their knees in awe.\n\n                                     DUKE OF CORNWALL\n                         Lord Uther, if I yield to the sword \n                         of power, what will you yield?\n\n                                     UTHER\n                         Me, yield!?\n\n               Merlin urges Uther hard.\n\n                                     MERLIN\n                              (a whisper)\n                         He has given. Now you must.\n\n               The two knights glare at each other, rage contending with \n               anger.\n\n                                     UTHER\n                         The land from here to the sea is \n                         yours if you will enforce the King's \n                         will.\n\n               The enemies lock eyes and Merlin watches anxiously.\n\n                                     DUKE OF CORNWALL\n                         Done!\n\n               All men from both sides break out in wild cheers.\n\n                                     DUKE OF CORNWALL\n                         My Lord King Uther, let us feast \n                         together. To my castle. Lord Merlin, \n                         you must join -\n\n               But Merlin is nowhere in sight.\n\n               INT. TINTAGEL CASTLE - HALL - NIGHT\n\n               Drums and wailing flutes fill the banquet hall with a lusty \n               rhythm. Armored warriors watch a lone woman dancing. She is \n               very beautiful, both sensuous and innocent.\n\n               Uther sits at the long table beside the Duke of Cornwall \n               with the barons and dukes of the land, and the lesser knights. \n               The table is stained with wine and littered with bones and \n               half-eaten fruit.\n\n               Uther's eyes burn with lust as he watches the dancer.\n\n                                     DUKE OF CORNWALL\n                         I would wish you such a wife, Lord \n                         Uther, as my Igrayne. So innocent, \n                         but in bed, a furnace...\n\n               The Duke rises and goes to his wife, be-striding the center \n               of the hall and Igrayne weaves circles of dance around him. \n               He gloats with pride.\n\n               The words escape his lips:\n\n                                     UTHER\n                         I must have her.\n\n               Lot spins to face him.\n\n                                     LOT\n                         What? You're mad! What about the \n                         alliance?\n\n                                     UTHER\n                              (oblivious)\n                         I must have her.\n\n                                     LOT\n                         And risk all you've won? This castle \n                         commands the sea gate to the kingdom.\n\n               Uther is not one for politics, and Lot's words sail past \n               him. The King lusts for Igrayne.\n\n               A bell is struck not far away. The music ceases and the hall \n               falls silent. The great door creaks open, revealing the dawn \n               light, and a monk steps into the hall and waits by it. Muffled \n               by corridors of stone, a choir of monks can now be heard \n               singing the high, ecstatic harmonies of the Te Deum. Those \n               who have fallen asleep at the table are roused, those drunk, \n               helped up.\n\n               INT. PASSAGEWAY, TINTAGEL CASTLE - DAWN\n\n               The monk leads the party down the hallway of the castle. \n               Thin shafts of dawnlight filter through archers' slits in \n               the thick walls onto stone floors. Otherwise, it is dark. \n               Each person, lady and knight, proceeds alone, head bent, \n               some crossing themselves.\n\n               Uther is among them. He stops in a dark alcove, breathing \n               heavily, waiting.\n\n               As the lovely Igrayne drifts past him, he pulls her out of \n               sight of the others.\n\n               In a shaft of pale light Uther clasps Igrayne to his \n               breastplate, his iron arm wrapped around her frail body. So \n               violent is his embrace that she cannot breathe, her mouth is \n               wide with fear, and her feet do not touch the ground; an \n               impaled butterfly.\n\n                                     UTHER\n                         You will be mine. Wife and queen, \n                         bed and crown.\n\n               His face is close to hers, looking as though he would devour \n               her tender whiteness with his kiss. She doesn't answer; she \n               can't. Even Uther understands this and lets her go.\n\n                                     IGRAYNE\n                              (a fierce whisper)\n                         I want no other crown and no other \n                         bed than those I have.\n\n               Her gown and her fragile skin torn on the spikes of his armor, \n               Igrayne backs away and joins the procession.\n\n               Uther trembles with unreleased passion.\n\n               INT. PASSAGEWAY OUTSIDE CHAPEL, TINTAGEL CASTLE - DAWN\n\n               Igrayne enters the candlelit chapel from which issues the \n               chant, calling the castle to worship. She rushes to her \n               husband's side, kneeling next to him and whispering. The \n               Duke of Cornwall looks back at Uther, hatred in his eyes.\n\n               EXT. WAR CAMP - BEFORE TINTAGEL CASTLE - DAY\n\n               Uther is in a towering rage. Sword drawn, he stalks among \n               the biers of fallen knights. Squires and clerics keep a \n               healthy distance. The sky is lowering, pregnant with rolling \n               thunder. Beyond his encampment, high on a cliff rising out \n               of the sea stands the impregnable Tintagel Castle, seat of \n               the Duke of Cornwall, now under siege.\n\n                                     UTHER\n                              (bellowing in all \n                              directions)\n                         Merlin! Where are you!?\n\n               Just then a knight rides up and dismounts. It is Ulfius, a \n               lieutenant.\n\n                                     UTHER\n                         Have you found him?\n\n                                     ULFIUS\n                         No--\n\n               But he cannot finish. He is taken aback by the sudden \n               appearance of a hideous hag who approaches, rattling a \n               beggar's pan.\n\n                                     HAG\n                         What a hurry you were in this morning, \n                         good sir. You forgot to give this \n                         old woman a coin.\n\n                                     ULFIUS\n                         I saw you half a day's gallop from \n                         here. I asked you if you had seen \n                         Merlin. I returned here straight \n                         away. How did -\n\n                                     HAG\n                         --I heard. I have come. I am also \n                         Merlin.\n\n               The figure straightens, the filthy rags become a flowing \n               cape, and the hair is swept back by the wind, andóit is \n               Merlin, laughing.\n\n                                     MERLIN\n                         I have walked my way since the \n                         beginning of time. Sometimes I give, \n                         sometimes I take. It is mine to know \n                         which, and when.\n\n                                     UTHER\n                              (exploding)\n                         Dumb riddles, Merlin. I am your King.\n\n               Ulfius edges away.\n\n                                     MERLIN\n                         I know the storm inside you, and \n                         what it has wrought. The alliance I \n                         forged is wrecked.\n\n               The Duke of Cornwall under siege. All this for lust. Selfish \n               lust.\n\n               Uther grabs Merlin.\n\n                                     UTHER\n                         For Igrayne. One night with her. Do \n                         it. Use the magic.\n\n               Merlin frowns pensively, his gaze searching strange distances \n               and wandering; then focusing, blazing straight at Uther.\n\n                                     MERLIN\n                         You will swear by your true kingship \n                         to grant me what I wish. Then you \n                         shall have it.\n\n               Uther kneels and draws his sword and holds it up by the blade, \n               a cross.\n\n                                     UTHER\n                         I swear it. By Excalibur and the \n                         holy--\n\n                                     MERLIN\n                         --What issues from your lust will be \n                         mine. Swear it again.\n\n                                     UTHER\n                         I swear it.\n\n               Merlin looks down sorrowfully at the kneeling King.\n\n               EXT. BATTLEMENTS, TINTAGEL CASTLE - EVENING\n\n               The Duke of Cornwall watches a force of armored knights riding \n               forth from Uther's war camp, with banners flying. It passes \n               beneath the castle and on toward a distant cliff.\n\n                                     DUKE OF CORNWALL\n                              (to a lieutenant)\n                         It's Uther and all his best knights. \n                         He leaves behind little more than \n                         fledglings to guard his camp.\n\n               His eyes are as cold and as pale as ice.\n\n               EXT. CLIFF ABOVE THE SEA - TWILIGHT\n\n               Uther and his knights, and Merlin on a mule, ride to the \n               high promontory and dismount. Here, overlooking the sea, is \n               a circle of ancient stones, carved with strange runes and \n               hieroglyphics, and as the wind moves through them it moans \n               and sighs.\n\n               The knights watch as Merlin and Uther, leading his horse, \n               walk toward the stones. Merlin strides into the circle, \n               turning to look at Uther, who hesitates.\n\n                                     MERLIN\n                         Come.\n\n               Uther starts to make the sign of the cross, but Merlin halts \n               him with a gesture. Uther's hand drops, and he enters the \n               circle with his horse.\n\n               Merlin and Uther look out across the sea, to Tintagel Castle \n               high upon the cliff.\n\n               Merlin solemnly raises his arms toward that distant castle, \n               and chants in an ancient language, the sounds of which he \n               marries to the roaring and whining of the wind. The wind \n               becomes stronger, and Merlin's incantations become more \n               intense, and the wind in turn becomes wilder still. Until \n               Merlin is charged with a fierce, nonhuman power, as the wind \n               buffets his slight frame.\n\n               And then, for all to understand:\n\n                                     MERLIN\n                         I hold the balance of all things in \n                         my summoning. Arise mists. Come fog.\n\n               EXT. VISTA FROM THE CLIFF - TINTAGLE CASTLE - TWILIGHT\n\n               From the horizon a front of fog advances toward the castle \n               to envelop it, and continues across the gulf to the circle \n               of stones.\n\n               EXT. GATE, TINTAGLE CASTLE - TWILIGHT\n\n               The portal opens and a small force of armored men, led by \n               the Duke of Cornwall, exits. A fog is thickening all around \n               them.\n\n               EXT. CLIFF ABOVE THE SEA - TWILIGHT\n\n               The advancing front envelops Merlin and Uther, eddying around \n               the stones.  All else is obliterated.\n\n                                     MERLIN\n                         Mount your horse.\n\n               The King does.\n\n                                     MERLIN\n                         Ride straight to the castle, across \n                         the sea of fog.\n\n               Uther spurs straight for the edge of the cliff, then reins \n               in his horse abruptly.\n\n                                     UTHER\n                         But the cliff, the sea...\n\n               Merlin rages, crazed.\n\n                                     MERLIN\n                         Ride across! Across the bridges of \n                         desire. Your lust will hold you up. \n                         For I have just woven it into the \n                         fabric of the world. This is magic - \n                         making solid what is in the mind, \n                         and unsolid, that which is already \n                         solid.\n\n               He gives the horse a stinging blow with his staff.\n\n               The horse and Uther charge forward into a gallop and stepping \n               off where the hidden edge of the cliff would be, hoofbeats \n               ceasing and the horse dropping for the blink of an eye, they \n               gallop across the fog.\n\n               EXT. MERLIN'S FOG\n\n               Galloping on no visible terrain, Uther and his horse advance \n               through the restless fog, and as they recede rider and animal \n               become a wavering, changeable form within the cloud.\n\n               EXT. GATE, TINTAGEL CASTLE - NIGHT\n\n               Horse and rider pull up at the gate.\n\n                                     RIDER\n                              (calling)\n                         Wake up in there. It is I.\n\n               If it was not for the electric blue hue burning in the eyes \n               of the man entering the castle, the same magic hue that \n               Excalibur left upon the air when wielded, the resemblance to \n               the Duke if Cornwall would be perfect.\n\n               After a moment the portal opens.\n\n               INT. INNER GATE, INTAGEL CASTLE - NIGHT\n\n               He passes into an inner court, the portal closing behind. \n               Armed men emerge cautiously. Thinking that it is their Duke \n               they help him dismount.\n\n                                     'DUKE' OF CORNWALL\n                         Have the horse ready. I ride out \n                         before sunrise.\n\n               An inner gate opens and the 'Duke' goes through it.\n\n               EXT. UTHER'S WAR CAMP - NIGHT\n\n               The real Duke and his men ride through the fogbound camp, \n               cutting the ropes of the tents, stabbing the men trapped \n               beneath the canvas. When a frightened crow flies squawking \n               into the face of the Duke's horse, which rears. He is unhorsed \n               and falls, and impales himself on a tent stake.\n\n               Dying, the true Lord of Tintagel Castle rises and staggers \n               forward, blood pumping from him.\n\n               INT. CHAMBER, TINTAGEL CASTLE - NIGHT\n\n               A little girl of four awakens from a nightmare, a small lone \n               figure in her canopied bed. Her eyes are ice, like her \n               father's.\n\n                                     MORGANA\n                         Papa... Papa...\n\n               Igrayne is soon at her side, lifting the child from the bed, \n               holding her tight.\n\n                                     MORGANA\n                         My father is dead...\n\n               INT. IGRAYNE'S BEDCHAMBER - NIGHT\n\n               The 'Duke' enters. The room is empty, but the door to \n               Morgana's room is open.\n\n               INT. MORGANA'S CHAMBER - NIGHT\n\n               The 'Duke' stands in the doorway. Igrayne herself is \n               surprised.\n\n                                     IGRAYNE\n                         Look, here is your father. It was \n                         just a dream, little one.\n\n                                     'DUKE' OF CORNWALL\n                         Come Igrayne.\n\n               Igrayne kisses Morgana, tucks her in and returns to her own \n               room, closing the door. The child doesn't know whether to \n               believe the truth of the dream or the waking truth.\n\n               INT. IGRAYNE'S BEDCHAMBER - NIGHT\n\n               In full armor, the 'Duke' bears down on the naked Igrayne on \n               her marriage bed. She stares at him, wondering. But his eyes \n               are closed, and finally he carries her in his wild passion, \n               her white limbs tangling around the lustre of his armor.\n\n               EXT. CLIFF ABOVE THE SEA - NIGHT\n\n               And Merlin is jolted awake from deep within himself, coming \n               out of a trance.\n\n                                     MERLIN\n                         It is done. The future has found \n                         root in the present.\n\n               He lifts himself up on his staff. He stands in the midst of \n               the ancient stones, bristling with excitement. Uther's mighty \n               knights are asleep, a deep unnatural sleep, huddled together \n               and surrounded by their horses. And then Merlin swoons, \n               collapsing to the ground.\n\n               INT. HALL, TINTAGEL CASTLE - DAWN\n\n               His lieutenants deposit the Duke of Cornwall's bloodless \n               body upon the long table. His eyes are wide open, icy and \n               cunning even in death. The ladies of the castle support and \n               comfort the grief-stricken Igrayne as she approaches the \n               body of her husband. Morgana hangs onto her mother's gown.\n\n                                     IGRAYNE\n                         When did it happen? Where?\n\n                                     LIEUTENANT\n                         In the camp of Uther, my lady, just \n                         after nightfall.\n\n                                     IGRAYNE\n                         It can't be. He came to me, to his \n                         bed, last night.\n\n                                     LADY\n                         It was his spirit, yearning for you \n                         in his hour of death, that visited \n                         you.\n\n                                     IGRAYNE\n                         His spirit?\n\n               Pale with grief, Igrayne stares at her dead husband in \n               silence.\n\n               Then her hand drifts to her stomach. When she talks again, \n               undone and resolved, it is to all and herself:\n\n                                     IGRAYNE\n                         Tintagel Castle falls to Uther. But \n                         what shall become of me, and the \n                         child I bear?\n\n               Morgana shows no distress. She runs her baby hands across \n               her father's face and closes his eyes. The intensity that \n               was frozen in them is now added to her own pale and cunning \n               eyes.\n\n               EXT. CLIFF ABOVE THE SEA - DAY\n\n               Merlin has been propped up against one of the stones. He is \n               in a deep trance and Uther is attempting to shake him awake.\n\n                                     UTHER\n                         I want her, Merlin. I cannot be \n                         without her. Tintagel is mine. Can I \n                         take her now? Tell me!\n\n               Merlin's eyes open but he sees nothing, and only a puzzling \n               squeal issues from him.\n\n               INT. IGRAYNE'S BEDCHAMBER, TINTAGEL CASTLE- EVENING\n\n               Morgana watches from a corner. The ladies of the castle \n               surround Igrayne who is giving birth.\n\n               Noisy crows alight on the windowsill. Only Morgana notices.\n\n               INT. PASSAGEWAY, TINTAGEL CASTLE - NIGHT\n\n               Uther strides to Igrayne's bedchamber, his warrior knights \n               following. He is dirty and his iron dress is blood-spattered.\n\n                                     UTHER\n                              (bellowing)\n                         Three horses died under me, so hard \n                         did I spur them here. Is it born? Is \n                         it alive?\n\n               INT. IGRAYNE'S BEDCHAMBER, TINTAGEL CASTLE - NIGHT\n\n               At his approach and entrance the ladies shrink back, and \n               Morgana edges closer to her mother, and seats herself on the \n               bed beside her. Ingrain holds her newborn baby in her arms, \n               the blood of birth still wet upon it.\n\n                                     UTHER\n                         Out!\n\n               The ladies slip past him to the door, and he goes up to \n               Igrayne.\n\n                                     UTHER\n                         What is it, lady?\n\n               Terrified of him, Igrayne faces him the best she can.\n\n                                     IGRAYNE\n                         A boy, sir. Rest yourself.\n\n               Uther waves away her words but does sit down on the bed, \n               exhausted. He notices Morgana, who stares at him.\n\n                                     UTHER\n                         Send the girl away.\n\n                                     IGRAYNE\n                         She is just a child -\n\n                                     UTHER\n                         Out!\n\n               Igrayne draws the child to her and kisses her cheek.\n\n                                     IGRAYNE\n                              (whispering)\n                         Go now. Come back later.\n\n               The child leaves silently, hatred in her eyes.\n\n                                     UTHER\n                         She watches me with her father's \n                         eyes.\n\n               He grasps the newborn baby with his iron hand, and pulls it \n               to himself. He looks upon it with wonder, with a gentleness \n               that is unexpected.\n\n                                     UTHER\n                         Igrayne, is he mine, or -\n\n               He can't bring himself to say his name. She hesitates on the \n               edge of tears, worried for the infant lying in its iron \n               cradle.\n\n                                     IGRAYNE\n                         The night he died, a man loved me \n                         with great fierceness. He looked \n                         like my husband, spoke like, smelled \n                         like, felt like my own husband. But \n                         it was not he, for he was already \n                         dead. It wasn't his spirit, for this \n                         child, who was conceived that night, \n                         is flesh and blood. I know nothing \n                         more.\n\n               Uther draws a dagger. He lifts it.\n\n                                     IGRAYNE\n                         No--\n\n               But he uses it before Igrayne can move. He severs the leather \n               thongs that bind the iron breastplate to his chest. He casts \n               it to the floor. His chest is smooth and milk-white in \n               striking contrast to his creased, weathered face. And beaming, \n               he holds the baby to it.\n\n                                     UTHER\n                         Through him, I will learn to love \n                         them, for I am tired of battle. I \n                         will stay by his side and\n                              (looking shyly at \n                              Igrayne)\n                         his mother's...\n\n               Igrayne's hatred for the man is at the very edge of becoming \n               love. The baby starts to cry.\n\n                                     UTHER\n                         Here. It's hungry.\n\n               And his free hand opens her shift, and he holds a swollen \n               breast in his gloved hand, squeezing gently. Milk bubbles \n               from it and he thrusts the baby's mouth onto it.\n\n               Igrayne weeps and Uther watches proudly as the baby suckles.\n\n               Merlin advances from the window, his cape the same iridescent \n               green-black as the feathers of the crows that were perched \n               by the window.\n\n                                     UTHER\n                         Merlin! Out of the sick sleep at \n                         last.\n\n                                     MERLIN\n                         Doing what I did for you, it wasn't \n                         easy, you know. It takes it's toll. \n                         It took nine moons to get back my \n                         strength.\n\n               Uther avoids looking at him.\n\n                                     MERLIN\n                         Now you must pay me.\n\n                                     UTHER\n                         I?\n\n                                     MERLIN\n                         The child is mine, Uther. I have \n                         come for him.\n\n               Uther is shaken to his roots. Igrayne watches, trying to \n               understand.\n\n                                     UTHER\n                         The oath. You didn't say--\n\n                                     MERLIN\n                         You didn't ask!\n\n                                     IGRAYNE\n                         Uther, is it true? Don't let him \n                         take the child.\n\n                                     UTHER\n                         I swore an oath, Igrayne. I made a \n                         pact with Merlin.\n\n               Igrayne suddenly understands. She glares at Uther.\n\n                                     IGRAYNE\n                         It was you? You came to me that night. \n                         You are the father.\n\n               Uther is caught, and turns to Merlin who is harsh and \n               unswaying.\n\n                                     MERLIN\n                         It's not for you, Uther, hearth and \n                         home, wife and child.\n\n                                     UTHER\n                         To kill and be king, is that all?\n\n                                     MERLIN\n                         Maybe not even that, Uther. I thought \n                         once that you were the one to unite \n                         the land under one sword. But it'll \n                         take another, a greater king...\n\n                                     UTHER\n                         You strike me with words as hard as \n                         steel.\n\n                                     MERLIN\n                         They are not weapons, my friend, but \n                         truths. You betrayed the Duke, stole \n                         his wife and took his castle, now no \n                         one trusts you. Lot, Uryens, your \n                         allies will turn against you. Give \n                         me the child, Uther, I will protect \n                         him. Go back to your war tent.\n\n               Uther wrenches the baby from it's mother's breast and hands \n               him to Merlin.\n\n                                     UTHER\n                              (in torment)\n                         By the oath, take the devil child. \n                         Take him!\n\n               With the bawling baby under his cape, Merlin exits. Igrayne \n               pulls herself out of the bed, weak, her legs giving under \n               her. She starts after Merlin.\n\n                                     IGRAYNE\n                         WHY?... Why must he have the baby?\n\n               Uther stops her with his bulk and she claws savagely at his \n               chest to get past him. He weeps as he folds his arms around \n               her.\n\n               INT. PASSAGEWAY, TINTAGEL CASTLE - NIGHT\n\n               As Merlin walks through the castle, the baby crying in his \n               arms, the knights and ladies step back, afraid to intervene \n               in royal matters.\n\n               INT. HALL, TINTAGEL CASTLE - NIGHT.\n\n               Merlin comes across the empty banquet hall, cooing to the \n               baby, strangely pacifying him. Morgana steps out of the \n               shadows in his path, and Merlin stops at the sight of the \n               little girl, her pale eyes glaring at him.\n\n               She speaks haltingly and clearly while far-off Igrayne cries \n               out her distress.\n\n                                     MORGANA\n                         Merlin, are you now the father, and \n                         the mother, of the baby?\n\n               Staring at her, Merlin shudders and without answering he \n               continues away, faster now, and into an unlit passageway, \n               disappearing from sight a bit sooner than an ordinary mortal \n               would have.\n\n               EXT. FOREST - DAY\n\n               The forest is dark and shiny with rain. An unseen battle \n               rages.\n\n               The first combatant in sight is Uther, who swings the mighty \n               Excalibur, cutting an attacker in half at the waist. Uther \n               and a small force of knights, Ulfius among them, are \n               retreating through the slippery wet forest, completely \n               outnumbered.\n\n               Lord Lot of Lowthean and Lord Uryens of Gore are the leaders \n               of the attack.\n\n                                     URYENS\n                              (to his men)\n                         The King's sword. I must have it.\n\n               Ulfius and his men stand their ground so the King may escape \n               the onslaught. They are hacked down.\n\n               Uther flees alone, severing the limbs of any man and tree \n               that stands in his way.\n\n               EXT. STONE IN THE FOREST - DAY\n\n               Uther has gained on his pursuers. He comes to a small clearing \n               where the spine of a buried boulder rises through the forest \n               floor. He stops upon it, breathing hard, dripping blood. He \n               rages aloud, but his throat is raw and cracked and only a \n               whisper comes out.\n\n                                     UTHER\n                         Merlin, where are you? To weave a \n                         mist, to hide us...\n\n               He hears his pursuers closing in.\n\n                                     UTHER\n                         No one shall have the sword. No one \n                         shall wield Excalibur but me.\n\n               He holds it by the hilt with both hands, the blade pointing \n               to the ground of stone. He flexes his knees. He lifts up his \n               hands above his head. And with all the strength that rage \n               and pain can muster, and more, he drives the blade of \n               Excalibur into the stone, nearly to the hilt. His mouth widens \n               in an awful silent scream, and then the foam of saliva pink \n               with blood issues from deep within him, so violent was his \n               effort.\n\n               As the sword cuts into the rock, the earth shudders.\n\n               EXT. FOREST - DAY\n\n               The forest quakes. The knights searching for Uther halt in \n               fear.\n\n               EXT. FIELDS, WOODS - DAY\n\n               And far away, a caped figure is crossing a field toward a \n               wood, when the earth shakes, stirring animals and birds. The \n               man turns. He is Merlin, the two day-old baby peeking from \n               his cape. Merlin is amazed at the phenomenon, he puts his \n               ear to a rock protruding from the earth.\n\n                                     MERLIN\n                         Into the spine of the dragon!\n                              (and then he is \n                              saddened)\n                         Uther... I loved you, mighty child.\n\n               And tears welling, and giggling at the same time, he whisks \n               away into the woods.\n\n               EXT. STONE IN THE FOREST - DAY\n\n               Uther staggers away, colliding with trees, staggering, \n               crashing to the ground. Until the only life left in him is \n               the coursing of his blood, flowing from his gaping mouth \n               onto the leaves on the forest floor.\n\n               The enemy knights advance through the trees. They prod at \n               the fallen leviathan, they roll him over to get at his \n               scabbard. Only then do they see the sword in the stone, and \n               they stop, amazed and afraid. Their captains appear. Uryens \n               sees what they are staring at, and races to the sword and \n               attempts to pull it out.\n\n               He strains with all his might, but it is immovable.\n\n                                     LOT\n                         Let me.\n\n               He shoves Uryens aside, but he can't loosen the sword either, \n               and he rages with frustration.\n\n                                                                  FADE OUT:\n\n               LEGEND APPEARS:\n\n               \"Fifteen years passed and the land was without a king.\"\n\n               FADE IN:\n\n               EXT. FIELDS - DAY\n\n               Peasants spill over the crest of a hill. They are fleeing a \n               force of armored knights, their plumed helmets forged in the \n               semblance of predatory animals. The knights thunder past the \n               peasants, trampling the ripening crops. Sir Uryens is their \n               leader, his hard face indifferent to the havoc he leaves in \n               his wake.\n\n               The peasants watch in mute anger.\n\n               EXT. FARMYARD - EVENING\n\n               Sir Lot leading another group of mounted knights comes \n               galloping into a small hamlet, panicked chickens and pigs \n               scattering at their approach. The farmers run for their lives \n               as the steel men dismount, leading their horses to water and \n               hay, and searching for vittles. A knight spots a woman who \n               stands frozen with fear, and he drags her into the barn as \n               her crying child watches.\n\n               EXT. COUNTRYSIDE - NIGHT - MOONLIGHT\n\n               A farmhouse is burning nearby, and three mounted figures \n               make their way along a trail at a walking pace - an old knight \n               in leather and mail, a young knight proud in gleaming new \n               armor; and on a farm horse, a squire with baggage and jousting \n               lance. The old knight, Sir Ector, is troubled by what he \n               sees.\n\n                                     SIR ECTOR\n                         It is a dark hour... everywhere \n                         lawlessness and destruction, and no \n                         one to lead us out of it.\n\n               Just then, ten crazed peasants emerge from the darkness, \n               hurling stones and armed with clubs and pronged sticks. They \n               surround the three riders. Sir Ector wheels around and slices \n               the air with his sword to ward off the ambushers.\n\n                                     SIR ECTOR\n                         Listen all. I am Sir Ector of Morven \n                         and these are my sons. You would \n                         wrong me, for I have never stolen \n                         from others, or destroyed the fruit \n                         of the land.\n\n               The peasants edge closer, working up the nerve to rush the \n               horsemen. The sound of thundering hooves cuts through the \n               clamor.\n\n               A cavalcade of riders, armor gleaming in the moonlight, \n               advances across the fields at a gallop. Immediately the \n               peasants scatter. The old knight is on the verge of tears.\n\n                                     SIR ECTOR\n                         The people's anger is just. It is \n                         sad that for our own safety, we will \n                         have to ride to the tournament with \n                         these robber knights.\n\n               EXT. SITE OF THE SWORD IN THE STONE - SUNRISE\n\n               Red with the first light of day, Excalibur rests in the stone \n               as King Uther left it. The field is itched with tents, each \n               flying its heraldic banner. Knights and squires are \n               everywhere, preparing horses and armor for the joust. A burly \n               man in religious robes harangues the crowd, vying for \n               attention.\n\n                                     BISHOP\n                         This is Easter day, when Christ rose \n                         again. Who will find strength in \n                         victory of arms? Who will draw the \n                         sword?\n\n               The Bishop goes among the tents, through the teeming throng, \n               solemnly casting holy water upon man and horse, armor and \n               banner. The knights kneel at the Bishop's transit, but \n               ceremony does not lift the air of grimness that lies over \n               the event.\n\n               EXT. JOUSTING GROUND, SWORD IN THE STONE - DAY\n\n               Their armor ablaze with sunlight, two mounted knights thunder \n               toward each other at full gallop, lowering their long jousting \n               lances. As they meet, the lance of each knight is deflected \n               by the shield of the other. A gasp goes through the crowd, \n               and the two knights charge past each other. They wheel around \n               at the end of the jousting ground and go at each other again \n               from the other direction. Again lances strike, and this time \n               one of the men is hit in the chest and violently unhorsed. \n               The crowd cheers.\n\n               EXT. THE SWORD IN THE STONE - DAY\n\n               The victor, Leondegrance, rides up to the stone and dismounts. \n               Each great knight with his coterie of lesser knights comes \n               to watch. A charge of expectation is in the air, although \n               most knights are glowering with envy.\n\n               Leondegrance of Camelyarde ascends to the sword, grabs it by \n               the hilt, and begins to tug with all his might. Excalibur is \n               immovable. The moment of tension passes. Leondegrance staggers \n               toward his waiting squires, who lead him away. All the others \n               return to the battle sport.\n\n               EXT. JOUSTING GROUND - DAY\n\n               At the edge of the jousting ground Sir Ector's son Sir Kay \n               is getting ready for a bout. His brother Arthur is buckling \n               the new armor while his father fusses about him, making small \n               adjustments when he notices that Kay's scabbard is empty. He \n               turns to Arthur and grab's him by the ear.\n\n                                     SIR ECTOR\n                         Arthur, where is Kay's sword? A good \n                         squire doesn't forget his knight's \n                         sword.\n\n               The fifteen year-old boy blushes.\n\n                                     ARTHUR\n                         I left it in the tent, sir.\n\n                                     SIR ECTOR\n                         Well hurry then, and get it.\n\n               The boy dashes off as Sir Ector shakes his head, not without \n               affection beneath the sternness.\n\n               EXT. TENTS - DAY\n\n               Arthur runs in search of their tent. He finds it.\n\n               INT. TENT - DAY\n\n               He enters. The saddle trunk has been emptied on the floor, \n               equipment is scattered all over. Arthur is shocked, \n               nonetheless he rummages madly. Finally he stops, on the verge \n               of tears.\n\n                                     ARTHUR\n                         It's been stolen....\n\n               EXT. TENTS - DAY\n\n               He comes out, utterly defeated, and frantic. He stops by two \n               knights who are arguing angrily; and one of them has left \n               his sword in the grass.\n\n               Arthur looks at it. He is tempted to steal it, but he can't. \n               Head down, he wanders off.\n\n               EXT. JOUSTING GROUND - DAY\n\n               Sir Ector and Sir Kay are waiting.\n\n                                     SIR KAY\n                         Father, I'll go and see what's keeping \n                         him.\n\n               EXT. THE SWORD IN THE STONE - DAY\n\n               Arthur stops at the edge of the dark forest, totally dejected, \n               when he sees the sword in the stone. He walks up to it, his \n               face lighting up, brimming with innocence. He is alone, as \n               everyone has returned to the jousting ground.\n\n                                     ARTHUR\n                         If only Kay could have it...\n\n               He smiles, forgetting his troubles, a boy again living in a \n               fairy tale. He grasps the sword by the hilt and it comes \n               away easily from its stone lock.\n\n               Not expecting it to, he nearly falls. He stares at it, \n               terribly excited and surprised: he tucks it under his arm \n               and rushes back.\n\n               EXT. TENTS - DAY\n\n               He bumps into Kay.\n\n                                     ARTHUR\n                              (breathless)\n                         Your sword was stolen, Kay, but here \n                         is Excalibur. Is it too late? I \n                         hurried--\n\n               Kay takes it. He cannot believe what he's holding in his \n               hands. He starts to talk but he is so agitated he can only \n               stutter.\n\n               EXT. JOUSTING GROUND - DAY\n\n               Kay, with Arthur in tow, rushes to Sir Ector and shows him \n               the sword; he trembles with excitement.\n\n                                     SIR KAY\n                         Look, Father. Excalibur. Does that \n                         mean that I am to be king?\n\n               Sir Ector is dumbstruck.\n\n                                     SIR ECTOR\n                         Did you free the sword, boy?\n\n                                     SIR KAY\n                         I... did, Father.\n\n               Ector looks at his son amazed, wanting to believe but not \n               able to.\n\n                                     SIR ECTOR\n                         We must go to the stone at once.\n\n               With Excalibur in hand Ector of Morven heads for the stone, \n               Kay following, and Arthur too, the boy flushed with excitement \n               but a little worried, not understanding what is happening.\n\n               The exchange between Sir Ector and Sir Kay has been overheard. \n               Some have seen the sword in Sir Ector's hand. Rumor spreads \n               like wildfire.\n\n               EXT. THE SWORD IN THE STONE - DAY\n\n               As Sir Ector ascends the stone, from all parts of the jousting \n               ground knights and squires, the Bishop and the clerics, and \n               peasants too, press around.\n\n               Ector lowers the blade into the tight cleft and Excalibur \n               sinks to its original position.\n\n                                     SIR ECTOR\n                         Draw it, son!\n\n               Sir Kay grabs the hilt and pulls without conviction, and the \n               sword doesn't give. Eyes downcast, he lets go.\n\n                                     SIR KAY\n                         Sir, I didn't draw the sword. Arthur \n                         gave it to me.\n\n                                     SIR ECTOR\n                         Arthur ?!\n                              (spinning around to \n                              face him)\n                         How did you get the sword, child?\n\n                                     ARTHUR\n                              (frightened)\n                         Sir... Kay needed a sword. His was \n                         stolen. I saw Excalibur, and... I \n                         took it.\n\n                                     SIR ECTOR\n                         You freed it, son?\n\n                                     ARTHUR\n                         I did, Father. I beg your forgiveness.\n\n               He starts to kneel but Ector pulls him up.\n\n                                     SIR ECTOR\n                         Try the sword, Arthur.\n\n               Arthur is about to grasp the hilt when Uryens and Lot, and \n               other nobles, Leondegrance of Camelyarde, and Sir Caradoc \n               and Sir Turquine among the younger, stride up.\n\n                                     URYENS\n                         Stand back, Sir Ector, and take your \n                         children.\n\n                                     LOT\n                         We will try again.\n\n               Uryens, Lot, Leondegrance, Caradoc, Turquine - each in turn \n               grapples with the sword, only to be defeated by its \n               immobility. The crowd around the stone is thickening with \n               common folk.\n\n                                     SIR ECTOR\n                         Let the boy try the sword.\n\n                                     BISHOP\n                         Let the boy try...\n\n               The demand is echoed by peasants and serfs. The great knights \n               remain silent and bitter in their defeat. Sir Ector pushes \n               Arthur to the sword.\n\n                                     SIR ECTOR\n                         Go ahead, boy. Don't be afraid.\n\n               The boy hesitates shyly, and then takes the hilt of Excalibur \n               and pulls out the sword with a great sweep.\n\n               The throng is stunned. Silence falls. Some kneel, following \n               the example of Sir Ector and Sir Kay, of the Bishop and \n               Leondegrance. The other nobles stay back, confused, afraid, \n               angered.\n\n               Arthur stands there, little more than a boy, his cheeks \n               flushed, his soft hair ruffled by the wind, his eyes shining \n               with exultation, awe, and fear. Then, as if gaining confidence \n               from the sword itself, he turns it in arcs above his head.\n\n                                     BISHOP\n                         We have our King, thanks be to God.\n\n               The commoners and some of the knights react with roaring \n               enthusiasm. The others draw closer to Uryens and Lot and \n               their supporters, closing ranks around them.\n\n                                     ARTHUR\n                         Please, Father, rise up. I was your \n                         son before I became your King... if \n                         I am King.\n\n               Sir Ector rises, tears streaming down his cheeks.\n\n                                     SIR ECTOR\n                         My Lord, you are King, all the more \n                         because you are not my son, and I am \n                         not your father.\n\n               This is quite a shock to the boy king, and to the onlookers.\n\n                                     ARTHUR\n                         Who is, then?\n\n                                     SIR ECTOR\n                         I don't know. Merlin brought you to \n                         me when you were newly born and \n                         charged me to raise you as my own. \n                         At first, I did so because I feared \n                         Merlin, later because I loved you.\n\n               Merlin's name is on the lips of all those close by.\n\n                                     ARTHUR\n                         Who is Merlin?\n\n                                     MERLIN\n                         Speak of the devil!...\n\n               From out of the forest strides Merlin, dramatic, cape flowing, \n               eyes crazed as ever, laughing at his own entrance. A crow is \n               perched on his shoulder, and it squawks loudly. Annoyed with \n               it, Merlin swooshes it away.\n\n                                     MERLIN\n                         I am Merlin. Counselor to kings. \n                         Wizard and beggar. Prophet and...\n                              (he drops it)\n                         I have feasted on thunderbolts, I \n                         savored my death before I got myself \n                         born. I--\n\n               Merlin interrupts himself when his eyes fall on the boy, who \n               is taking in his performance raptly, half awestruck, half \n               amused.\n\n                                     ARTHUR\n                         Whose son am I?\n\n                                     MERLIN\n                         You are the son of King Uther, and \n                         the fair Igrayne... you are King \n                         Arthur.\n\n               The suspicion and confusion and envy of the lords erupts.\n\n                                     LOT\n                         Merlin, we haven't forgotten you. \n                         This is more of your trickery.\n\n                                     URYENS\n                         You're trying to foist a boy of \n                         dubious birth upon us. You want to \n                         shame us?\n\n                                     LOT\n                         Lord Leondegrance, join us against \n                         the boy. Surely you can see he is \n                         only Merlin's tool.\n\n                                     LEONDEGRANCE\n                         No. I, Leondegrance, Lord of \n                         Camelyarde, saw the drawing of Uther's \n                         sword, and witnessed no trickery. If \n                         a boy has been chosen, a boy shall \n                         be king.\n\n               The crowd of serfs and peasants cheer wildly, and their long \n               suppressed anger against the nobles comes to the fore. They \n               dare to press up against them, fists hammering on their \n               shields as the chant Arthur King over and over. Dark and \n               scowling, full of rebellion, all the lords except Leondegrance \n               begin to withdraw their iron men surrounding them.\n\n               EXT. CHAPEL, JOUSTING GROUND - DAY\n\n               Bells toll the good news. People stream by to see the new \n               king and join the celebration.\n\n               EXT. SITE OF THE SWORD IN THE STONE - DAY\n\n               Uryens and Lot, and Caradoc, Turquine, and the other lords \n               have mounted, and are moving out, when from the rear guard a \n               bowman in Lot's service draws upon the unarmored figure of \n               Arthur across the cheering crowd. The bowman lets the arrow \n               fly.\n\n               It flies over the heads of the crowd, unseen.\n\n               Except by Merlin at Arthur's side. He extends his arms halfway \n               up, his fists clenched tightly as if drawing urgently on the \n               power within himself. The sound of wings is heard as he flaps \n               his arms.\n\n               The arrow flies toward Arthur.\n\n               Arthur sees the arrow coming right at him, when a swooping \n               crow plucks it out of the air.\n\n               Arthur watches the crow flapping its wings, climbing swiftly, \n               the arrow in its beak, disappearing over the forest. Only he \n               has noticed.\n\n               When he turns Merlin is no longer at his side; to the \n               puzzlement of all. And Arthur is all of a sudden terribly \n               alone and afraid, as people from all sides clamor for his \n               attention and guidance.\n\n               EXT. FOREST - DAY\n\n               Arthur charges through the shadowy forest. He is in armor, \n               but it is only a light tunic of mail. Excalibur is sheathed \n               in a leather scabbard by his side. He is frantic and he calls \n               urgently.\n\n                                     ARTHUR\n                         ...Merlin... Merlin...\n\n               His face shines with sweat, the horse is lathered. He \n               dismounts and continues on foot into denser, more tangled \n               undergrowth.\n\n                                     ARTHUR\n                         Merlin!\n\n               A huge eye opens in the foreground of what had appeared to \n               be shadow, bark and tufts of weeds is really Merlin's head.\n\n                                     MERLIN\n                         You called, sir?\n\n               His voice is thin as he is awakening from a deep, exhausted \n               sleep. Arthur finds him lying within the large gnarled roots \n               of a great tree. The boy kneels before Merlin and lifts his \n               hands and kisses them.\n\n                                     ARTHUR\n                         You saved me from the arrow...\n\n                                     MERLIN\n                              (a flicker of mischief)\n                         But not from your destiny.\n\n                                     ARTHUR\n                         I want to thank you.\n\n                                     MERLIN\n                         That's not why you came.\n\n               Arthur blurts it out:\n\n                                     ARTHUR\n                         Merlin, help me. I need your help. I \n                         don't know how--\n\n                                     MERLIN\n                              (irritated)\n                         'Help me, Help me.' Help me get up.\n\n               Arthur helps Merlin up and the wizard stands unsteadily.\n\n                                     MERLIN\n                         I'm tired. Doing magic takes its \n                         toll, you know. My arms ache \n                         terribly...\n                              (he makes flying \n                              movements with his \n                              arms and grimaces)\n                         Once--or is it yet to happen--I stood \n                         exposed to the Dragon's breath so \n                         that a man could lie one night with \n                         a woman. It took me ten moons to \n                         recover. I'm sure that story would \n                         interest you, since... Well, we'll \n                         have to talk about it another time. \n                         You're too busy now.\n\n               The forest groans and creaks, alive with murmurs and shrill \n               calls.\n\n                                     MERLIN\n                         It is whispered in the forest that...\n                              (he cups his ear with \n                              exaggeration)\n                         ...Leondegrance's castle is under \n                         siege by Lot and Uryens.\n\n                                     ARTHUR\n                              (pressing)\n                         Yes, yes, I know that. Everybody \n                         does. Lord Leondegrance is my only \n                         ally among the barons and the great \n                         knights. I can't lose him.\n\n                                     MERLIN\n                         Well there. You don't need me half \n                         as much as you think you do. You \n                         already know what must not happen.\n\n                                     ARTHUR\n                              (exasperated)\n                         I must find the means to save him, \n                         then. I was hoping I could ask you \n                         for a little magic help, but if it \n                         makes you so tired...\n\n                                     MERLIN\n                         Thank you.\n\n               Silence. Arthur tries again.\n\n                                     ARTHUR\n                         It's just that I have no experience, \n                         and no men to speak of. How can I--\n\n                                     MERLIN\n                              (suddenly fierce)\n                         Because you must! You and only you. \n                         Have you forgotten that it was you \n                         who freed Excalibur?\n\n               Just as suddenly, he is his amused, ironic self again.\n\n                                     MERLIN\n                         Besides, it will be a good lesson.\n                              (giggling)\n                         The best, if it's not the last.\n\n               Arthur bows his head, confused and almost defeated. Merlin \n               steals a look at him, and puts his arm around the boy.\n\n                                     MERLIN\n                         Maybe you'd like to meet the power \n                         that gave you the sword?\n\n               He enjoys being cryptic.\n\n                                     ARTHUR\n                         How? Where?\n\n                                     MERLIN\n                         In the great book.\n\n                                     ARTHUR\n                         What book is that?\n\n                                     MERLIN\n                              (melodramatic)\n                         The book without pages. Open before \n                         you, all around us. You can see it \n                         in bits and pieces, for if mortal \n                         men were to see it whole and all \n                         complete in a single glance, why, it \n                         would burn him to cinders.\n\n                                     ARTHUR\n                         What?!\n\n               EXT. FOREST AND ELSEWHERE - DAY AND NIGHT\n\n                                     MERLIN\n                         The dragon! There...\n\n               A deep cleft at the edge of the forest, where far below lava \n               boils with a phosphorescence that lights up a great cloud, \n               billowing upward.\n\n                                     MERLIN\n                         Coiled in the unfathomed depths, it \n                         emerges...\n\n               Merlin points to the sky where roiling clouds appear to be \n               unfurling of immeasurable wings.\n\n                                     MERLIN\n                         ...It unfolds itself in the storm \n                         clouds...\n\n               A terrific wave batters a coastline, spray shooting up, and \n               as the wave recedes it exposes dark rocks and deep crevices.\n\n                                     MERLIN\n                         ...it washes its mane sparkling white \n                         in the blackness of seething \n                         whirlpools...\n\n               Merlin spins Arthur around, and they are transported into a \n               storm swept forest. Lightning strikes.\n\n                                     MERLIN\n                         ...its claws are the forks of \n                         lightning... its scales glisten in \n                         the bark of trees...\n\n               The trees shine with wetness, as a great wind tosses their \n               crowns, the branches groaning against each other.\n\n                                     MERLIN\n                         ...its voice is heard in the \n                         hurricane...\n\n               Arthur is awestruck.\n\n               EXT. FOREST - DAY\n\n               Arthur and Merlin are back in the same spot, having in fact \n               never moved at all, but traveled on the spell of Merlin's \n               words alone.\n\n                                     MERLIN\n                         ...it is so much more than a scaly \n                         monster. It is Everything!\n\n               Arthur's eyes shine with the brilliance of the vision.\n\n                                     ARTHUR\n                         And if I am to be King of everything, \n                         lord and commoner, beast, leaf and \n                         rock, I must use its voice, its claws, \n                         its power.\n\n               EXT. BATTLEMENTS, CASTLE OF CAMELYARDE - NIGHT\n\n               Leondegrance, Lord of Camelyarde, is shocked by what he sees \n               in the distance. His daughter Guenevere, a beautiful girl of \n               sixteen, draws close to him, terrified. With his surviving \n               knights, Leondegrance is making his last stand. The walls \n               have been breached, parts of the castle are burning.\n\n               EXT. OUTSIDE THE CASTLE - NIGHT\n\n               A bellowing dragon advances. Its eyes burn, its scales gleam \n               from light shining from within. It snorts fire from its \n               nostrils.\n\n               Uryens and Lot, Caradoc and Turquine, the great knights in \n               command of the siege of Leondegrance's castle, back away \n               speechless as the monster descends upon their unprepared war \n               camp. All around them, squires and lesser knights flee in \n               panic and confusion.\n\n               Only a dozen or so remain with their leaders. The group backs \n               up against the swampy moat that surrounds the castle, waiting \n               with swords drawn.\n\n               The dragon moves closer, and now it becomes apparent that it \n               is nothing more than a force of knights and footmen. Their \n               shields glinting in the moonlight are the dragon's scales, \n               torches its burning eyes. And the snorting flames from its \n               nostrils are only Merlin doing a fire-eater's trick.\n\n               The dragon form dissolves, and a banner rises bearing the \n               emblem of the Dragon, and under it, Arthur and Ector and Kay \n               lead a charge of twenty knights.\n\n               In Arthur's hands, Excalibur leaves an electric glow upon \n               the air.\n\n               EXT. BATTLEMENTS, CAMELYARDE CASTLE - NIGHT\n\n                                     GUENEVERE\n                         Father, it's the boy King.\n\n                                     LEONDEGRANCE\n                         It is. I will fight my way to his \n                         side.\n\n               EXT. OUTSIDE THE CASTLE - NIGHT\n\n               Arthur and his men charge into the enemy ranks. Lot's and \n               Uryens' people are pushed into the moat. Although the water \n               is only waist-deep, the fallen, weighed down by their armor, \n               drown. The horses of the attackers are brought down, Arthur's \n               among them. He pulls out from under it, limping. Bleeding \n               form wounds, cutting, slashing, thrusting, he falls back \n               from the havoc of the charge.\n\n               A small distance exists now between the foes, a brief respite. \n               Uryens and Lot, exhausted, bleeding, and fierce in their \n               rage:\n\n                                     URYENS\n                         War-wise fighters, grown gray in \n                         battle, checkmated by a boy.\n\n                                     LOT\n                         It's Merlin's trickery, nothing more. \n                         I won't swear faith to that wizard's \n                         brat.\n\n               Arthur and his men have been joined by Leondegrance and his \n               knights, few in number.\n\n                                     ARTHUR\n                         Let's finish this with a show of \n                         force. We have no more tricks and no \n                         more advantages.\n\n               He rushes alone at the enemy, shouting at the top of his \n               lungs, Excalibur flashing over his head, prepared to die.\n\n               EXT. BATTLEMENTS, CAMELYARDE CASTLE - NIGHT\n\n               Guenevere watches...\n\n                                     GUENEVERE\n                         No...\n\n               EXT. OUTSIDE THE CASTLE - NIGHT\n\n                                     SIR ECTOR\n                         No... Arthur--\n\n               The old knight rushes after the boy, sword drawn, to defend \n               his flank, and the others follow, a battle cry issuing from \n               them that is terrifying in its fierceness.\n\n               EXT. BATTLEMENTS AND BATTLEFIELD BELOW - NIGHT\n\n               ...and when she can't watch any longer, she buries her face \n               in her hands.\n\n               EXT. OUTSIDE THE CASTLE - NIGHT\n\n               Arthur fights like a wounded lion at the center of the savage \n               melee of sword and shield, and once again the two sides fall \n               apart.\n\n               Uryens and Lot are standing in the moat among the bodies of \n               their men, are reduced to eleven knights, all wounded.\n\n               Arthur is flanked by twenty men at arms, most of them wounded, \n               and trembling now beyond exhaustion with blood lust. Arthur \n               steps forward alone, and addresses his opponents.\n\n                                     ARTHUR\n                         You are in my hands, to slay or spare. \n                         I need battle lords such as you. \n                         Swear faith to me and you shall have \n                         mercy.\n\n                                     URYENS\n                         Noble knights swear faith to a mere \n                         squire?\n\n               Arthur turns, searching for Merlin. He spots him watching \n               from a distance. They stare at each other, Merlin implacable, \n               Arthur's eyes pleading. It's obvious that Merlin isn't going \n               to help.\n\n                                     ARTHUR\n                         You are right. I'm not yet a knight.\n                              (gaining strength)\n                         You, Uryens, will knight me.\n\n               He unsheathes Excalibur and goes forward, kneeling before \n               Uryens and offering him the sword.\n\n                                     ARTHUR\n                         Then as knight to knight I can offer \n                         you mercy.\n\n                                     MERLIN\n                              (to himself)\n                         What's this, what's this?!\n\n               Arthur, kneeling, bows his head and Uryens steps up to him, \n               his features set. He accepts the sword. Lot watches, a mad \n               hope dancing in his eyes.\n\n               EXT. BATTLEMENTS, CAMELYARDE CASTLE - NIGHT\n\n               Guenevere watches, frightened for Arthur, not daring to \n               breathe.\n\n               EXT. OUTSIDE THE CASTLE - NIGHT\n\n               Uryens stands towering above the boy. He smiles enigmatically. \n               He lifts Excalibur.\n\n               Merlin is attempting to push through the crowded ranks to \n               get to Arthur.\n\n               He's frantic and worried for once.\n\n                                     MERLIN\n                         I never saw this...\n\n               Uryens swiftly lowers the sword on Arthur's neck; with the \n               flat of the blade he gives Arthur the three strokes.\n\n                                     URYENS\n                         In the name of God, of Saint Michael \n                         and Saint George, I give you the \n                         right to bear arms, the power to \n                         mete justice.\n\n               Arthur looks up.\n\n                                     ARTHUR\n                         That duty I will solemnly obey as \n                         knight and King.\n\n               Uryens is deeply moved.\n\n                                     URYENS\n                         Rise, my King. I am your humble \n                         knight, and I swear allegiance to \n                         the courage in your veins, for so \n                         strong it is, it's source must be \n                         Uther. I doubt you no more.\n\n               Arthur rises and Uryens kneels and kisses his hands. Sir \n               Ector turns away to hide brimming tears. Merlin pushes through \n               finally, out of breath. Uryens embraces Leondegrance while \n               Lot and the other enemy knights kneel in turn and kiss \n               Arthur's hands.\n\n               EXT. WOOD BY CAMELYARDE CASTLE - DAY\n\n               The castle can be glimpsed through the trees. A clear spring \n               bubbles from the ground, and the sun splashes leaf, bird, \n               squirrel, and bee with golden light, and Arthur and Guenevere \n               too. Guenevere is serious and intent on her work.\n\n                                     ARTHUR\n                         Owww...\n\n               With water from the spring, she is bathing a large cut on \n               his chest that has been stitched closed. Wounds on his arms, \n               and one on a calf also show evidence of her neat sewing. \n               She's just finishing, and she dabs his chest with a dry cloth.\n\n                                     GUENEVERE\n                         It didn't hurt too much, did it?\n\n                                     ARTHUR\n                         Ye...\n\n                                     GUENEVERE\n                         --I'm pretty good at stitchery. I've \n                         sewn my father's wounds more than \n                         once.\n\n               He starts to get up.\n\n                                     GUENEVERE\n                         Careful! You'll have to stay still \n                         for a few days or you'll tear them \n                         open.\n\n               Arthur shivers at the thought.\n\n                                     ARTHUR\n                         But I have to leave tomorrow. The \n                         forests are thick with rebels, \n                         invaders plunder our shores...\n\n                                     GUENEVERE\n                         --And damsels in besieged castles \n                         are waiting to be rescued?\n\n                                     ARTHUR\n                         I didn't know Leondegrance had a \n                         daughter.\n\n                                     GUENEVERE\n                         Well, then, I shall tell you which \n                         knights have maiden daughters, so \n                         you can avoid their castles.\n\n               Arthur smiles at her, enjoying her jealousy, and it irritates \n               her a little.\n\n                                     GUENEVERE\n                         No, I think it's better if you just \n                         stay here to heal. At least a week.\n\n                                     ARTHUR\n                         I'm going.\n\n                                     GUENEVERE\n                         Quiet, or I'll sew up your mouth \n                         too.\n\n               She touches his lips with hers, her eyelids fluttering shut. \n               He stares at her young beauty, and draws her into a long, \n               slow kiss.\n\n               A shrill almost human squeal pierces the air not far away. \n               Arthur pulls away startled, half-rising. Guenevere giggles.\n\n                                     GUENEVERE\n                         Would you rescue me from a fiery \n                         dragon, sir?\n\n               She puts her arms around him, drawing him close again, \n               speaking in a half-whisper.\n\n                                     GUENEVERE\n                         It's just a furry little rabbit that \n                         took the bait and sprung the trap.\n\n               They smile at each other, about to kiss. As they come closer:\n\n                                     GUENEVERE\n                         You'll find him served up to you \n                         tonight, cooked in a most excellent \n                         sauce...\n\n               INT. BANQUET HALL, CAMELYARDE CASTLE - EVENING\n\n               The soft beat of psaltery and the liquid flow of lute. A \n               serving platter bearing roast rabbit in rampant position is \n               carried across the hall. It is laid on the long raised table \n               before Arthur, who presides in the middle. He looks at it \n               suspiciously and blushes, remembering the afternoon; and it \n               looks back at him accusingly with its cherry eye.\n\n               Guenevere is dancing around her father, lovely, gliding, \n               sensual. She sees Arthur and the rabbit and laughs out-right. \n               He twists off a leg of the rabbit and sinks his teeth into \n               it to hide his embarrassment. Guenevere passes to another \n               partner, smiling at him, radiant. Arthur watches her, his \n               heart breaking. He is in love.\n\n               Merlin leans close.\n\n                                     MERLIN\n                         A king must marry, after all.\n\n                                     ARTHUR\n                         ...of course...\n\n               Only then does he realize that Merlin has understood \n               everything. He is annoyed at being so transparent.\n\n                                     ARTHUR\n                         I love her. If she would be my queen, \n                         my dreams would be answered.\n\n                                     MERLIN\n                              (mischievous)\n                         There are maidens as fair, and fairer \n                         than Guenevere. If I put my mind to \n                         it, I could see them now, many of \n                         them, weeping for love of you, \n                         watching the hills for you coming \n                         from the high towers of their castles. \n                         Offering you their every favor. Rich, \n                         clever--but if it is to be Guenevere, \n                         so be it.\n\n               A shadow of doubt crosses Arthur's brow.\n\n                                     ARTHUR\n                         Who will it be? Put your mind to it, \n                         then.\n\n                                     MERLIN\n                         Guenevere. And a beloved friend who \n                         will betray you.\n\n                                     ARTHUR\n                              (smiling)\n                         Guenevere...\n\n                                     MERLIN\n                         You're not listening. Your heart is \n                         not. Love is deaf as well as blind.\n\n               Guenevere approaches, smiling and coquettish. She slaps her \n               hands, and a servant sets down a tray of pastries before \n               Arthur.\n\n                                     GUENEVERE\n                         They are only for you, for in them I \n                         mixed things that heal, but not too \n                         quickly; and things that make limbs \n                         sleepy, preventing escape, but keep \n                         one's mind sharp.\n\n               She smiles at Arthur's embarrassment and confusion.\n\n                                     ARTHUR\n                         What's in them?\n\n               She takes a cake and bites into it.\n\n                                     GUENEVERE\n                         It is an ancient mixture, containing \n                         only soft, unborn grains, and flavored \n                         with roses. The rest is secret.\n\n               Guenevere offers one to Arthur, and he hesitates, looking at \n               it.\n\n                                     MERLIN\n                         Looking at the cake is like looking \n                         at the future. Until you have savored \n                         its bitterness and its sweetness, \n                         its texture and its perfume, what do \n                         you really know? And then, of course, \n                         it will he too late.\n\n               Arthur bites into the cake, and Guenevere looks deep into \n               his eyes.\n\n                                     MERLIN\n                         Too late...\n\n                                                                  FADE OUT:\n\n               A LEGEND APPEARS:\n\n               \"...but for years war kept Arthur from thoughts of marriage.\"\n\n               FADE IN:\n\n               EXT. OAK FOREST - DAY\n\n               War tents have been pitched beneath the majestic trees. Near \n               the banner of the Dragon a doe grazes. Arthur is older, in \n               battle-scarred plate armor, pacing and angry. He is watched \n               by his wounded and bruised knights--Kay, Uryens, Lot, \n               Leondegrance, Caradoc, and some new young faces among the \n               ranks. No one talks.\n\n               The harsh clank of its battle trappings announces the arrival \n               of a horse. All eyes watch it walk into the camp. A knight \n               is slouched in the saddle.\n\n               Arthur runs to meet the horse, followed by squires and some \n               of the knights.\n\n               He eases the rider to the ground, unlaces his helmet. It is \n               Sir Ector, and his hauberk is badly dented. Tears burn in \n               Arthur's eyes.\n\n                                     SIR ECTOR\n                         He is the mightiest and fairest of \n                         knights.\n\n                                     ARTHUR\n                         We fought and won battles, and now \n                         one man defeats all my knights? I \n                         will go.\n\n               He pushes past the knights and goes to his horse. Kay steps \n               in front of him.\n\n                                     SIR KAY\n                         A king must not engage in single \n                         contest. I'll go again.\n\n               Arthur rises into the saddle and takes a jousting spear from \n               the rack.\n\n                                     ARTHUR\n                         Where is Merlin?\n\n               The squires are silent.\n\n               Arthur gallops off in the direction Sir Ector came from. His \n               knights are afraid for him.\n\n               EXT. COUNTRYSIDE - DAY\n\n               His countenance grim, Arthur gallops along a trail bordering \n               a plowed field when in it a scarecrow moves. It starts to \n               run as stick-wielding farmers pursue it. It is Merlin. Arthur \n               turns off into the field, and at the sight of an armored \n               knight on a war horse, the farmers turn and flee. Merlin \n               stops to catch his breath.\n\n                                     ARTHUR\n                              (angry)\n                         I should have left you to fend for \n                         yourself.\n\n                                     MERLIN\n                         I had to weave a little enchantment \n                         on the bees so I could get some honey, \n                         and I didn't feel up to using any \n                         more magic just yet. Anyway, I was \n                         in less danger than you'll be in \n                         today.\n\n               Arthur's hand is clenched tight around Excalibur's hilt.\n\n                                     ARTHUR\n                         So you were stealing their honey. \n                         They should have killed you.\n\n                                     MERLIN\n                         Come now. So much anger for such a \n                         little crime? Are you sure there is \n                         nothing else troubling you?\n\n                                     ARTHUR\n                         You know full well there is, and I \n                         go to meet it now. Come witness my \n                         revenge.\n\n               He offers his arm and Merlin hoists himself up behind the \n               King.\n\n               EXT. GORGE THROUGH THE HILLS - DAY\n\n               A waterfall cascades into a pool. The spray casts a rainbow. \n               Beneath it is a colorful confusion of flowers and budding \n               trees, a place dreamlike in its beauty.\n\n               Arthur, with Merlin behind, gallops along the edge of the \n               pool. The trail widens into a field of grass. Arthur reins \n               beside a pile of broken lances and twisted shields. Across \n               the field, pitched upon the trail is a war tent made of \n               diaphanous white silk, a sky blue banner above it. Merlin \n               slides off and Arthur continues.\n\n               From the tent, a knight with jousting lance rides forward to \n               meet him. His armor is so shiny it is a mirror. His eyes, \n               seen through the open visor, seem to laugh. His speech is \n               foreign, from across the sea. He is Lancelot of the Lake.\n\n                                     LANCELOT\n                         Good day to you, sir.\n\n                                     ARTHUR\n                         Move aside. This is the King's road, \n                         and the knights you joined arms \n                         against were his very own.\n\n                                     LANCELOT\n                         I await the King himself. His knights \n                         are in need of training.\n\n                                     ARTHUR\n                         I am King, and this is Excalibur, \n                         sword of kings from the dawn of time. \n                         Who are you, and why do you block \n                         the way?\n\n                                     LANCELOT\n                         I am Sir Lancelot of the Lake, from \n                         across the sea. I am the best knight \n                         in the whole of Christiandom, and I \n                         look for the king who is worthy of \n                         my sword's service.\n\n                                     ARTHUR\n                         --That is a wild boast. You lack a \n                         knight's humility.\n\n                                     LANCELOT\n                         Not a boast, sir, but a curse.\n                              (a cloud passes over \n                              his innocent face)\n                         Never have I met my match in joust \n                         or duel.\n\n                                     ARTHUR\n                         Move aside!\n\n                                     LANCELOT\n                         I will not. You must retreat or prove \n                         your kingship in the test of arms, \n                         under the eyes of God.\n\n               He crosses himself.\n\n                                     ARTHUR\n                         Then may He give me the strength to \n                         unhorse you and send you with one \n                         blow back across the sea.\n\n               Arthur wheels away, trembling with anger, and gallops to his \n               edge of the field. He sees that Lancelot has already \n               positioned himself and is waiting, lance down.\n\n               Merlin watches, a spectator, as the two charge at each other. \n               They collide with great force, their spears shattering. Arthur \n               is jolted but stays in the saddle. Lancelot's jousting is \n               impeccable. Arthur draws Excalibur.\n\n                                     LANCELOT\n                         Hold! I offer you another lance.\n\n               Pages come forward with new lances for Arthur and Lancelot.\n\n                                     LANCELOT\n                         You joust well, sir. Battle learnt, \n                         but tournament fancy. You should \n                         ride more forward in the saddle, \n                         though.\n\n               Arthur grabs the spear from the page's hands, and circles \n               back to work the horse up into an all-out gallop. Lancelot \n               spurs forward to meet him. Arthur is neatly unhorsed. He \n               picks himself up from the ground in a rage, drawing Excalibur. \n               Lancelot on his horse weaves circles around him.\n\n                                     LANCELOT\n                         Yield. I have the advantage.\n\n                                     ARTHUR\n                         I will not.\n\n               Arthur charges Lancelot, a raging bull, but cuts and slashes \n               only at the air as Lancelot stays clear of him.\n\n                                     ARTHUR\n                         Fight me from your horse or on foot, \n                         but fight me. Your avoidance mocks \n                         me.\n\n                                     LANCELOT\n                         I sought only not to harm you, sir.\n\n               He dismounts and draws his sword, and they clash. Shield and \n               sword and armor against shield and sword and armor. The \n               swordplay is furious, Arthur attacking, slashing, hacking, \n               Lancelot parrying effortlessly, elegantly defensive. Arthur \n               breaks the onslaught to catch his breath. Lancelot lifts his \n               visor. His eyes are calm, laughing.\n\n                                     LANCELOT\n                         Sir, your rage has unbalanced you. \n                         It seems you would fight to the death \n                         against a knight who is not your \n                         enemy, for a length of road you can \n                         ride around.\n\n                                     ARTHUR\n                         So be it, to the death.\n\n                                     LANCELOT\n                         It is you, sir, who knows not the \n                         virtue of humility, as a true king \n                         must.\n\n               Arthur goes forward attacking with terrible blows upon \n               Lancelot's shield, and Lancelot holds his ground, shield \n               high. And in its mirror-like metal Arthur can see his own \n               reflection, a face distorted by uncontrolled passion.\n\n               Arthur discards his own shield, grabs Excalibur with both \n               hands, and with a frightening shout that speaks of all his \n               rage, he swings a terrific blow upon the shield, cutting \n               through his own reflection and the metal. And Excalibur snaps \n               in two.\n\n               A blinding blue-green light explodes from the broken sword. \n               Lancelot, knocked back by the force of the blow, is stunned \n               by the blast and falls to the ground unconscious. Arthur \n               backs away, horrified, half of Excalibur in his hand.\n\n                                     ARTHUR\n                         What horror is this?\n                              (calling)\n                         Merlin!\n\n               Merlin approaches, pale, gripped by dread.\n\n                                     MERLIN\n                         The sword is broken. Hope is broken...\n\n               Arthur picks up the broken blade, utterly undone.\n\n                                     ARTHUR\n                         My pride broke it, my rage broke \n                         it... Humiliation and defeat lie in \n                         ambush even for a king.\n                              (looking at Lancelot)\n                         This excellent knight who fought \n                         with fairness and grace was meant to \n                         win. With Excalibur, I tried to change \n                         that verdict.\n\n               Merlin stands there, drawn, defeated, his hopes dead.\n\n                                     ARTHUR\n                         I have lost for all time the ancient \n                         sword of my fathers whose power was \n                         meant to unite all men, to serve the \n                         vanity of a single man.\n\n               Despairing, he flings the two parts of Excalibur into the \n               pool. He kneels at the waters edge, and he cries.\n\n                                     ARTHUR\n                         I am nothing.\n\n               Then Arthur sees something that startles him. Beneath the \n               surface, suspended in the blue-green water amid the dancing \n               weeds, he sees Excalibur, intact.\n\n               It is held by a maiden in flowing gown the color of water, \n               her long hair rippling across her face, obscuring it.\n\n                                     ARTHUR\n                         Excalibur! Is it true?\n\n                                     MERLIN\n                         The Lady of the Lake. Take it. Take \n                         it, quickly!\n\n               Arthur dips his hand under the water and grasps the hilt and \n               the moment he does the vision in the blue-green water fades. \n               He rises with Excalibur in hand, and Merlin speaks before \n               Arthur can ask the question.\n\n                                     MERLIN\n                         There are infinite worlds within the \n                         infinite coils of the Dragon. In one \n                         of them, which I have not traveled, \n                         the sword was forged. I only know \n                         that the King is returned to us \n                         through the instrument of his power. \n                         The game continues!\n\n               And he laughs.\n\n               Just then Lancelot stirs. Arthur rushes to his side. He \n               loosens his helmet and removes it, uncovering damp curls. \n               The young knight's eyes open, and his laughing charm once \n               more animates his face.\n\n                                     ARTHUR\n                         Thanks to God, you are alive.\n\n                                     LANCELOT\n                              (sitting up)\n                         I, the best knight in the world, \n                         bested! This is a great day, for my \n                         search is over. I love you, my King.\n\n               He embraces Arthur, who is overwhelmed by his childlike \n               directness. The King helps him to his feet.\n\n                                     ARTHUR\n                         You are still the best knight in \n                         Christiandom. You gained a hundred \n                         advantages over me. It is I who must \n                         love you, for through your courage \n                         and patience you taught me a bitter \n                         lesson.\n\n                                     LANCELOT\n                         Then make me your champion and I \n                         will always fight in your place.\n\n                                     ARTHUR\n                         But your life and lands are far from \n                         here.\n\n                                     LANCELOT\n                         I gave up my castles and my lands!\n\n               He thumps his breastplate.\n\n                                     LANCELOT\n                         My domain is here, inside this metal \n                         skin. And I would pledge to you all \n                         that I still own: muscle, bone, blood \n                         and the heart that pumps it.\n\n                                     ARTHUR\n                         And a great heart it is. Sir Lancelot, \n                         you will be my champion.\n\n               Lancelot draws his sword, holding it by the blade, a crucifix.\n\n                                     LANCELOT\n                         In the name of Jesus Christ and His \n                         holy blood, I swear eternal faith to \n                         Arthur, King.\n\n               They embrace, and Merlin watches.\n\n               EXT. ARTHUR'S WAR CAMP - NIGHT\n\n               Converging from different directions parties of mounted \n               knights enter the war camp. Lancelot among them. They \n               dismount, battle-weary and burning with the excitement of \n               victory. They quench their huge thirst from buckets carried \n               by squires. They rip off hunks of meat from carcasses sizzling \n               on spits over a roaring fire. And they join the throng of \n               knights, where stories of deeds of arms of the day are \n               enthusiastically exchanged.\n\n               A great number of knights are packed tightly around King \n               Arthur, each man anxious to tell of his victories. One of \n               them has the King's attention.\n\n                                     KNIGHT\n                         ...We killed every one of them. Burnt \n                         their ship...\n\n               Arthur sees Lancelot in the throng and moves toward him. \n               Merlin follows Arthur and is pushed and knocked around in \n               the crush of spikes and iron. The only unarmored man in the \n               crowd, he glares at the excited knights irritably.\n\n                                     ARTHUR\n                         Lancelot, how did you fare in the \n                         North?\n\n                                     LANCELOT\n                         We spared the lives of a few, so \n                         they could sail home and tell their \n                         fellows what fate they met at the \n                         hands of King Arthur's knights...\n\n               Arthur turns toward Uryens.\n\n                                     ARTHUR\n                         And you, Uryens?\n\n                                     URYENS\n                         Victory!\n\n                                     ARTHUR\n                         Lot, and you?\n\n                                     LOT\n                         We drove the invaders into the sea.\n\n                                     ARTHUR\n                         You, Gawain, the East?\n\n                                     GAWAIN\n                         The East is ours again.\n\n               Cheers greet each declaration.\n\n                                     ARTHUR\n                         The war is over. One land, one King. \n                         Peace.\n\n               Amidst the celebration, a fracas is heard. A knight pushing \n               forward to talk to Arthur has entered a shoving match with \n               those in front of him.\n\n                                     KNIGHT\n                         Let me through. I fought the King's \n                         battle too. He must know my story.\n\n               Merlin is brutally jostled. He draws a fistful of powder \n               from his cape and he tosses it into the air above him. He \n               raises his staff into the cloud, cracking it like a whip. \n               The tip of the staff catches fire, and the fire spreads \n               through the powder in the air, stunning all into silence. \n               Merlin shouts and snarls.\n\n                                     MERLIN\n                         Chaos... confusion... brutes... \n                         savages... troglodytes... Stand \n                         back... make space.\n\n               Merlin swings his burning staff into a wide arc. The knights \n               back away, amused at first, then a bit afraid.\n\n                                     MERLIN\n                         The moon... the sun... the stars... \n                         they spin... they turn... they \n                         circle... around us... us...\n\n               The knights have fallen back. Merlin stalks past each man, \n               and Arthur too, holding the flaming tip of his staff before \n               each pair of eyes, and staring into them with his gimlet \n               gaze.\n\n                                     MERLIN\n                         You, and you, and you, take up your \n                         place. Be wedded to the world. Respect \n                         its perfection. All of you, together, \n                         be one.\n\n               The knights have formed a circle. They realize this. \n               Awestruck, they whisper in astonishment, looking up at the \n               sky burning with stars. Merlin brims with pride as he waits \n               for Arthur to recognize his handiwork.\n\n                                     ARTHUR\n                         Your ancient wisdom and infinite \n                         sight have forged this circle, Merlin. \n                         Hereafter we shall come together in \n                         a circle, to tell and hear of deeds \n                         good and brave. I will build a table \n                         where this fellowship shall meet. \n                         And a hall around the table. And a \n                         castle about the hall.\n\n               A cheer rises. Arthur strides into the ring of knights.\n\n                                     ARTHUR\n                         And I will marry.\n\n               Another bout of cheers goes up, and Arthur stops before \n               Leondegrance, resting his hand on the old knight's shoulder.\n\n                                     ARTHUR\n                         And the land will have an heir to \n                         wield Excalibur.\n\n               Leondegrance's eyes fill with tears of joy. A roar of cheers. \n               Arthur draws the sword of power.\n\n                                     ARTHUR\n                         Knights of the Round Table, good \n                         friends, brothers in arms. I send \n                         you on a quest harder by far than \n                         the battles we have fought together, \n                         a quest to uphold always, and \n                         everywhere, justice, honor, and truth. \n                         Each day shall bring forth a cause, \n                         and may each cause bring forth a \n                         knight.\n\n               Lancelot is drawn in by the King's enthusiasm. He unsheathes \n               his sword and swoops it low in salute.\n\n                                     LANCELOT\n                         I swear never to rest twice on the \n                         same pillow till all men live at \n                         peace.\n\n               In quick succession all knights draw their swords, following \n               Lancelot's example.\n\n               Merlin struggles to put out the flame on his staff. He finally \n               does it by smothering it with earth. When he looks up again, \n               he sees the knights galloping off in all directions.\n\n               INT. FARMHOUSE - DAY\n\n               Terrified women, a screaming child, cowering men, old or \n               made old by the hard labor of the fields. Armored men are \n               ransacking a farm, looking for grain, and gold which they \n               find among the votive objects of a little house altar. A \n               woman is dragged away to be raped.\n\n               Through a window, a knight in shining armor is seen emerging \n               from the adjoining woods. The plunderers are all of a sudden \n               apprehensive, and fall silent. One of them grabs the crying \n               child and covers her mouth with his iron hand.\n\n               EXT. FARMYARD - DAY\n\n               The knight is Lancelot, in his mirror-like armor. He rides \n               into the cluster of houses and barns that make up the farm. \n               There are other armored men there, around a cart half-loaded \n               with loot. They smile nervously at Lancelot. The farmers are \n               blank with fear.\n\n               Lancelot stops in the middle of the yard. A knight among the \n               armored men comes forward.\n\n                                     KNIGHT\n                         Good day, sir.\n\n                                     LANCELOT\n                         Good day to you.\n\n               And he also acknowledges with a nod the ashen-faced patriarch \n               of the community.\n\n               Lancelot spurs his horse on, and the knight sighs with relief. \n               But then he reins his horse to a stop. He has sensed \n               something. He turns his head, his hooded eyes on the knight \n               and his men, and they squirm inwardly.\n\n               INT. FARMHOUSE - DAY\n\n               The child, her mouth covered by the armored hand.\n\n               EXT. FARMYARD - DAY\n\n               Lancelot, listening, watching.\n\n               INT. BARN - DAY\n\n               The woman, a blade flashing next to her eye.\n\n               EXT. FARMYARD - DAY\n\n               Lancelot, immobile. Behind him, the knight, his face shiny \n               with sweat. His minions inch forward, hands moving slowly \n               toward sword hilts.\n\n               Lancelot wheels his horse around.\n\n                                     LANCELOT\n                         I hear the stifled cry for help, I \n                         smell the reek of fear...\n\n               With a shout the knight and his men draw their swords and \n               rush Lancelot. He reins in his horse, causing it to rear and \n               break their attack. He slides off, falling on his feet with \n               sword drawn, already fighting. In an extraordinary show of \n               sword play he cuts down six men.\n\n               INT. FARMHOUSE - DAY\n\n               Hearing Lancelot storm in, the man holding the child hands \n               her to a woman and kneels before the altar, just as Lancelot \n               bursts into the room, sword high and already swooping down \n               on the man's neck. Lancelot brings the sword to a halt mid-\n               air, his fury held in check. The repent man is spared. The \n               woman kneels to kiss Lancelot's hand.\n\n               EXT. SITE OF THE SWORD IN THE STONE - DAY\n\n               The field is pitched with war tents and pavilions decked for \n               holiday. Nobles and knights flank the King and Guenevere, a \n               beautiful vision in white samite, a wreath of flowers around \n               her head. Lancelot leads a long file of prisoners to the \n               King. They fall to their knees, begging forgiveness; among \n               them is the man whom Lancelot had spared before the altar.\n\n                                     LANCELOT\n                         These men repented before God for \n                         their evil deeds. Those who would \n                         not, met their fate at the end of my \n                         sword.\n                              (he kneels)\n                         Accept the fruit of my first quest \n                         as my wedding gift.\n\n                                     ARTHUR\n                         I do. Rise, Lancelot, come with me.\n\n               He rises and follows Arthur and Guenevere into the central \n               pavilion. Pages draw its curtains closed as they pass inside.\n\n               INT. PAVILION - DAY\n\n               Guenevere is surrounded by a group of ladies and maids who \n               fuss over her dress and her hair. They eye the great knight \n               and whisper about him, Guenevere laughing with them.\n\n               Arthur sits, excited and happy.\n\n                                     ARTHUR\n                         Sit beside me, Lancelot.\n\n               Lancelot sits, stiff and upright.\n\n                                     ARTHUR\n                         Your deeds set an example for all \n                         other knights. For your gift, ask a \n                         gift of me.\n\n                                     LANCELOT\n                         Only give me leave to ride out again, \n                         to do what I am most able to do, and \n                         happiest doing.\n\n               Guenevere overhears. She approaches and Lancelot jumps to \n               his feet.\n\n                                     GUENEVERE\n                              (to Arthur)\n                         He must stay for the feasting days \n                         of our wedding, and tell his deeds \n                         himself.\n\n                                     ARTHUR\n                              (to Lancelot, smiling)\n                         I grant you your wish if you grant \n                         Lady Guenevere hers.\n\n                                     LANCELOT\n                         I will stay Madame.\n\n               Merlin leans close to Arthur.\n\n                                     MERLIN\n                         The knights of Galys approach the \n                         camp. It would be politic...\n\n                                     ARTHUR\n                         ...to ride out and meet them.\n\n               He rises. Lancelot, who was about to sit again, straightens.\n\n                                     ARTHUR\n                         I will ride with Sir Kay. Lancelot, \n                         rest here.\n\n                                     GUENEVERE\n                         Don't start a war on my wedding day!\n\n                                     ARTHUR\n                         Without Lancelot?!\n\n               Arthur and Merlin exit, leaving Guenevere and Lancelot. She \n               looks at him, lively and amused, and he can't help smiling.\n\n                                     GUENEVERE\n                         Look Lancelot. The maids and ladies \n                         whisper about you. They all dream of \n                         winning you, young and old, fair and \n                         ugly.\n\n               Lancelot blushes.\n\n                                     GUENEVERE\n                         But surely that's no secret to you, \n                         dear Lancelot. You're the bravest \n                         and strongest knight they've ever \n                         seen, and beauty has kissed your \n                         brow.\n\n               He can't look at her.\n\n                                     GUENEVERE\n                         The well-kept secret is whether any \n                         of them has won your heart.\n\n                                     LANCELOT\n                         No.\n\n                                     GUENEVERE\n                         Why?\n\n                                     LANCELOT\n                         I am a fighting man and I am married \n                         to the quest. That is enough.\n\n                                     GUENEVERE\n                         And there is no maiden in the whole \n                         world who inspires you?\n\n                                     LANCELOT\n                         There is one.\n\n                                     GUENEVERE\n                         Who?!\n\n                                     LANCELOT\n                         You.\n\n                                     GUENEVERE\n                         Me?\n\n                                     LANCELOT\n                         Yes. I would swear my love to you.\n\n                                     GUENEVERE\n                         To me? But why?\n\n                                     LANCELOT\n                         I cannot love as a woman the lady \n                         who will be wife to my King and my \n                         friend. And, in pledging my love to \n                         you, I cannot love any other woman.\n\n               Guenevere smiles, moved by his blunt innocence.\n\n                                     LANCELOT\n                         I will see you in all women, and I \n                         will defend them as I would defend \n                         you.\n\n               He kneels, kisses her thigh, rises and leaves.\n\n               INT. CHAPEL - DAY\n\n               A chorus of children sings. The Bishop waits at the altar \n               with his friars and altar boys. Cornucopias overflowing with \n               vegetables and wildflowers adorn the church, which glows \n               with the light of a thousand candles. Sir Kay is satisfied. \n               He comes back up the petal-strewn aisle.\n\n               EXT. CHAPEL, SITE OF THE SWORD IN THE STONE - DAY\n\n               Arthur and Guenevere are ushered in by Kay. They are flanked \n               by Leondegrance and Sir Ector. Lancelot and Merlin follow, \n               leading the cortege of knights and ladies.\n\n               Merlin is incapable of entering the chapel, as if at the \n               threshold there is an unseen force that repels him.\n\n                                     LANCELOT\n                         Lord Merlin, are you ill?\n\n                                     MERLIN\n                         No, no, I need air.\n\n               Strangling a laugh he wrenches himself away. Just then Uryens \n               and a small party of knights rides up through the tents and \n               dismounts in front of the church. Uryens helps a lady off \n               her horse and joins the cortege on foot.\n\n                                     URYENS\n                         Merlin, don't you join the \n                         celebration?\n\n               Merlin, who was slinking away through the throng of \n               bystanders, looks up. What he sees sends a chill through his \n               body.\n\n               At Uryens' side stands a young woman of sinister beauty, \n               with bewitching eyes of ice. Merlin just stares at her, and \n               she smiles back at him faintly.\n\n                                     URYENS\n                         My wife, Merlin. Lady Morgana of \n                         Cornwall.\n\n                                     MORGANA\n                         I remember you, Merlin. I was a child. \n                         You took my brother away.\n\n               Merlin laughs. Uryens shrugs and continues into the chapel \n               with Morgana. As she enters she glances back, and just then \n               Merlin steals a look, their eyes meet.\n\n               INT. CHAPEL - DAY\n\n               Uryens and Morgana take their places near the altar. Arthur \n               and Guenevere kneel before the Bishop, and Arthur takes her \n               hand. The clatter of armor mingles with the enthusiastic, \n               happy singing of the children, and seems to strengthen their \n               song.\n\n               EXT. SITE OF THE SWORD IN THE STONE - EVENING\n\n               The chorus carries across the field to the dark wall of trees \n               from which issues another chorus, of hoots and squawks and \n               howls. Merlin advances along the edge of the forest. He stops \n               by the stone that once held the sword, his eyes wild. He \n               forgets his inner torment when he sees a plant at the base \n               of the stone. He kneels beside it and plucks it. He admires \n               its strange flowers; he smells them.\n\n               Two feet appear at his side. He rises to be face to face \n               with Morgana. They look deep into each other. Then Merlin \n               breaks the silence.\n\n                                     MERLIN\n                         You left your husband's side? You \n                         left your brother's wedding?\n\n                                     MORGANA\n                         Is that Mandrake, Lord Merlin?\n\n                                     MERLIN\n                         It is.\n\n                                     MORGANA\n                         Can it truly be used for magic?\n\n               Merlin smiles at last, and Morgana does, her eyes piercing, \n               cruel and lovely.\n\n                                     MERLIN\n                         Yes... sometimes...\n\n               His gaze drifts toward the chapel.\n\n                                     MERLIN\n                         ...There are many powers in this \n                         world.\n\n               INT. CHAPEL - EVENING\n\n               Arthur and Guenevere are radiant with joy, and Lancelot behind \n               them mirrors the ceremony of their joining in his armor; and \n               the sweet voices of the children fill the chapel as the Bishop \n               pours the wine into the chalice, and lifts it up before him, \n               blessing it.\n\n               He turns to the royal couple.\n\n                                     BISHOP\n                         Drink this the blood of Jesus Christ \n                         our Lord.\n\n               The chalice seems to burn with a mystical light; and as the \n               chorus soars:\n\n                                                                  FADE OUT:\n\n               A LEGEND APPEARS:\n\n               \"And Arthur built his castle, Camelot. And one day, in the \n               far reaches of the Kingdom...\"\n\n               FADE IN:\n\n               EXT. FOREST, STREAM - DAY\n\n               It is shadowy and dark; ancient trees creak, unseen animals \n               cry out. A rabbit hops into view and a boy leaps forward, \n               grabbing the animal by the ears before it can move. He--\n               Perceval--is a wild boy of seventeen, dressed in skins with \n               an endearing and childlike smile.\n\n                                     PERCEVAL\n                              (to the rabbit)\n                         Sorry. Hungry.\n\n               A din is heard to the forest, and it grows. Perceval glances \n               around, panicked. The sound is the rubbing of leather upon \n               leather, of metal on metal, for now a mounted figure in armor \n               hovers over the terrified boy.\n\n                                     PERCEVAL\n                              (stuttering)\n                         Have I taken too much?\n\n               He lets the rabbit go free. The threatening figure dismounts. \n               And Perceval, cartwheels backward, landing in the stream and \n               scooping a fish out.\n\n                                     PERCEVAL\n                              (desperately trying \n                              to ingratiate)\n                         I had rabbit yesterday. Today I'll \n                         eat fish... No?\n\n               He returns the fish to the water. The figure steps into a \n               pool of sunlight and a glorious halo streaks from the armor. \n               It is Lancelot.\n\n                                     LANCELOT\n                         Don't be afraid.\n\n               Perceval is overcome with astonishment, and he kneels.\n\n                                     PERCEVAL\n                         You're an angel! Not a devil...\n\n               Lancelot laughs and pulls the boy to his feet.\n\n                                     LANCELOT\n                         Just a man. A knight in the King's \n                         service.\n\n                                     PERCEVAL\n                         You're a man?!\n                              (he reaches out to \n                              touch Lancelot)\n                         ...with metal skin!\n\n               Perceval is beside himself with enthusiasm.\n\n                                     PERCEVAL\n                         Can I grow metal skin?\n\n               Lancelot rolls his eyes, amused.\n\n                                     LANCELOT\n                         You've got a lot to learn.\n\n               EXT. SPARSE FOREST - DAY\n\n               Lancelot is cantering and Perceval is running alongside, \n               shouting in gasps.\n\n                                     PERCEVAL\n                         I'll learn... take me... to the \n                         King... What's a... King?\n\n               Lancelot shakes his head and spurs the horse into a gallop. \n               Perceval lengthens his stride, and keeps up! Lancelot reins \n               to a halt.\n\n                                     LANCELOT\n                         Very well. Climb up.\n\n                                     PERCEVAL\n                         I will run.\n\n                                     LANCELOT\n                         Listen, boy, it's more than twenty \n                         days from here.\n\n                                     PERCEVAL\n                         Twenty days!? The world is that big?\n\n               EXT. OUTSIDE CAMELOT, FOREST - DAY\n\n               Perceval cannot believe his eyes. As Lancelot and Kay talk \n               about him out of earshot, he sees things that he's never \n               seen before; and he gapes like the country bumpkin that he \n               is.\n\n               Dragon-like kites sweep low, maneuvered by children. In a \n               meadow among the trees, knights hone their skills with lance \n               and sword, and ladies watch and their \"bright eyes rain \n               influence and judge the prize.\" And then, there is Camelot \n               itself; the great gate and the drawbridge; the massive walls, \n               and the soaring towers and spires above.\n\n               Perceval rushes up to Lancelot and Kay.\n\n                                     PERCEVAL\n                         Who will give me my sword?\n\n               Kay is not at all pleased; nonetheless he takes the boy by \n               the ear and leads him across the drawbridge and into the \n               castle.\n\n                                     KAY\n                         Kitchen knives and greasy spits will \n                         be your weapons, boy.\n\n               Lancelot smiles to himself, hesitation, lingering before the \n               great gate of Camelot.\n\n               There is a walkway suspended in the trees above, that also \n               leads to the castle, and promenading on it is a group of \n               women, Guenevere and her ladies-in-waiting. The Queen sees \n               Lancelot and hastens toward him.\n\n               Lancelot sees her, and mounts his horse and heads back into \n               the forest. She stops, somewhat ahead of the ladies, and \n               watches wistfully.\n\n               Lancelot turns back and seeing her one last time, draws down \n               his visor and spurs his horse into a canter.\n\n               He passes two commoners who are heading for the castle, one \n               fat and the other thin, and they are locked in hot dispute. \n               Their wives keep them from coming to blows and their children \n               spur them on, enjoying the excitement.\n\n               Lancelot is swallowed by the forest.\n\n               INT. HALL OF THE ROUND TABLE, CAMELOT - DAY\n\n               Guenevere, bearing a bowl of perfect, deep red apples, \n               approaches the Round Table, where Arthur sits and Merlin at \n               his side, attending to the affairs of the kingdom. Quite a \n               few of the knights occupy their seats, talking with each \n               other, drinking and laughing, attended by ladies and pages. \n               Guenevere places the apples at Lancelot's empty place and \n               takes her seat next to Arthur.\n\n               In the archways that lead into the hall, petitioners wait, \n               eating, drinking, talking among themselves. In the din, no \n               one pays attention to the vehement arguing of the fat man \n               and the thin man, which continues even here. The hall is the \n               burgeoning, happy center of the kingdom.\n\n               But Merlin is oblivious to the lively clamor. He gazes like \n               a lovesick puppy across the table at Morgana, who bends over \n               whispering to a knight at the table, the young Sir Gahalt,, \n               while his older brother Sir Gawain listens. Morgana notices \n               Merlin's stare and smiles at him, and then resumes her \n               flirtation with Sir Gahalt, much to Merlin's annoyance.\n\n               Sir Kay ushers the thin man and the fat man into the open \n               space at the center of the table for their audience with the \n               king. They quarrel even as Kay tries to present them, and \n               the attention of the hall gradually focuses on them.\n\n               The two men talk at once, interrupting, overlapping.\n\n                         FAT MAN\n                 I brew ale, sir--from \n                 old shoes--I am an \n                 honest tradesman sir. \n                 I must sell what I \n                 produce. He won't buy \n                 ale and he won't pay. \n                 Pay up! He leans over \n                 the barrel and sucks \n                 in the vapors. The \n                 vapors are mine.\n\n                                                       THIN MAN\n                                               How would you know I, sir, \n                                               have the misfortune to \n                                               live next to this \n                                               criminal... What loss in \n                                               that? Not to me! Pay for \n                                               what? Why?! They are \n                                               floating on the wind. \n\n               Arthur is both amused and exasperated.\n\n                                     ARTHUR\n                         Enough!... What is a fair price for \n                         the smell of your ale?\n\n                                     FAT MAN\n                         That's why we have come to you, sir \n                         There's no one else who can tell us.\n\n                                     ARTHUR\n                         What does it cost to get drunk on \n                         your ale?\n\n                                     FAT MAN\n                         At least three shillings, sir.\n\n               Arthur addresses the Thin Man.\n\n                                     ARTHUR\n                         Give me three shillings.\n\n               The Thin Man is crestfallen, the smile gone from his face. \n               He reluctantly hands the coins to Kay, who gives them to \n               Arthur. Arthur tosses them in the air and lets them fall on \n               a metal plate. He hands them back to the Thin Man, who is \n               totally confused now, as is everybody else.\n\n                                     ARTHUR\n                         For the smell of your ale, the jingle \n                         of his coins.\n\n               The knights roar with laughter and the Fat Man and the Thin \n               Man look at each other in astonishment. Perceval lets out a \n               raucous laugh that wins him a glance of disapproval from \n               Kay.\n\n               INT. HALL OF THE ROUND TABLE - NIGHT\n\n               The din of the petitioners is replaced by music. It is the \n               hour of the evening feast, and all knights are present, except \n               Lancelot. Whole tree trunks burn in the great fireplace, and \n               lambs roast on spits in the flames. Pages run to and fro \n               with trays of food and wine, Perceval among them.\n\n               Morgana stops beside Merlin.\n\n                                     MORGANA\n                         What did I see today in the wizard's \n                         eyes? Censure, because I enjoy a few \n                         words with a young handsome knight?\n\n               Merlin is in agony, a bug stuck on a pin.\n\n                                     MERLIN\n                         No, no, of course not. You are \n                         young...\n\n                                     MERLIN\n                         I'm not jealous!\n\n                                     MORGANA\n                         It's clear you are, and it irks me.\n\n                                     MERLIN\n                         No. Yes, I am. I am jealous. I want \n                         to write poems about you with \n                         moonbeams, make the sea sing your \n                         name...\n\n                                     MORGANA\n                         A lovestruck page!\n\n                                     MERLIN\n                         Shh... yes, yes. Sit with me, \n                         please... Morgana.\n\n               She does, laughing and in complete control. His hand \n               immediately slides onto her thigh. She removes it, but holds \n               it in her hand, toying with his fingers.\n\n                                     MORGANA\n                         A steamy, panting, lovestruck page. \n                         But what good are songs and poems to \n                         me? They are the barter of ordinary \n                         love. A gift that reflected your \n                         greatness is the only one worthy of \n                         your love.\n\n               Merlin looks at her, knowing already, sad yet eager.\n\n                                     MERLIN\n                         I showed you all my conjuring \n                         tricks...\n\n                                     MORGANA\n                         The deepest secrets, the forbidden \n                         formulas...\n\n                                     MERLIN\n                         Maybe... maybe...\n\n               Merlin's thoughts have carried him far away, when he realizes \n               that Arthur is addressing him.\n\n                                     ARTHUR\n                         Merlin, are you counselor to the \n                         King, or to my sister?\n\n               Some knights laugh.\n\n                                     MERLIN\n                         At your service, sir.\n\n                                     ARTHUR\n                         Then answer me this. For years peace \n                         has reigned in the land. Crops grow \n                         in abundance, there is no want. Every \n                         one of my subjects enjoys his portion \n                         of happiness and justice, even those \n                         whose tiresome misunderstandings we \n                         must resolve here each day. Tell me, \n                         Merlin: have we defeated evil, as it \n                         seems?\n\n                                     MERLIN\n                         Good and evil; there is never one \n                         without the other.\n\n               Arthur is taken aback.\n\n                                     ARTHUR\n                         Where hides evil, then, in my kingdom?\n\n                                     MERLIN\n                         Never where you expect it, that's \n                         all I know.\n\n               He chuckles softly and Arthur is puzzled. A knight speaks \n               out, the young knight with whom Morgana was flirting. His \n               manner is sarcastic.\n\n                                     SIR GAHALT\n                         If we have peace and justice, why is \n                         Lancelot never with us? Why is he \n                         always riding out on his quests? He \n                         must know where this evil is.\n\n                                     SIR GAWAIN\n                         Could there be evil within Lancelot \n                         himself? To live above human folly, \n                         as is his aim, is to be overly proud.\n\n                                     SIR GAHALT\n                         He pays no heed even to the Queens \n                         longing for his company.\n\n               The hall falls silent, all eyes upon the Queen.\n\n                                     GUENEVERE\n                              (lashing out)\n                         What is it you would have your words \n                         mean, Sir Gahalt?\n\n               Frightened, Gahalt doesn't answer. Morgana has slipped to \n               Guenevere's side.\n\n                                     MORGANA\n                         Don't listen to him. You are the \n                         Queen.\n\n               Arthur, ashen-faced, turns to Merlin for help, but he has \n               escaped into sleep...\n\n                                     ARTHUR\n                         Sir Gahalt, answer the Queen.\n\n                                     GUENEVERE\n                         No. I meant not to be angry with \n                         you, Sir Gahalt. In the idleness \n                         that comes with peace gossip has \n                         bread its own evil. You merely repeat \n                         it. Please, sir, have one of those \n                         apples that Lancelot loves, and in \n                         that gesture partake of its goodness.\n\n               Morgana picks the bowl up and as she does so, unseen by any \n               and with a magician's dexterity, she thrusts her fingernails \n               deep into the top apple. She gives the bowl to Guenevere, \n               who takes it and sweeps around to where Sir Gahalt sits, \n               followed by Morgana. The young knight jumps to his feet.\n\n                                     GUENEVERE\n                         Take one, Sir Gahalt.\n\n                                     SIR GAHALT\n                         I am most honored, my lady.\n\n               He is too shy to take the shiniest, most beautiful apple on \n               top, and goes for another one. Morgana giggles, and he looks \n               at her. She looks at the apple on top and then smiles \n               encouragingly at him. Sir Gahalt takes it and starts eating \n               as the Queen returns to her seat.\n\n               With the third bite his is unable to breathe. His face goes \n               red and he rises to his feet, attempting to call out.\n\n               He falls, dying immediately. All leap to their feet, and \n               Arthur rushes to the young knight. Merlin is asleep and far \n               from human affairs.\n\n               Arthur and Sir Gawain rise from the body of the young knight. \n               Sir Gawain backs away from Arthur and points at Guenevere, \n               trembling with cold rage.\n\n                                     SIR GAWAIN\n                         Hear me, Lord Arthur, and knights \n                         and chieftains: I charge Guenevere \n                         with the murder of my brother.\n\n               Guenevere, white and with a broken voice, turns to Arthur.\n\n                                     GUENEVERE\n                         I didn't... I am innocent.\n\n               She begins to swoon and Morgana keeps her steady on her feet. \n               Arthur slumps into his seat and Sir Gawain kneels before \n               him.\n\n                                     SIR GAWAIN\n                         I champion this truth: That Queen \n                         Guenevere murdered Sir Gahalt with \n                         the aid of sorcery.\n\n               Enraged, Arthur reaches for Excalibur. But with effort he \n               checks his impulse.\n\n                                     ARTHUR\n                         The Queen will be in my charge till \n                         a champion steps forward to fight on \n                         her behalf.\n\n                                     GUENEVERE\n                         Not you, my husband?\n\n               Arthur cannot look at her.\n\n                                     SIR GAWAIN\n                         She must be burnt at the stake. That \n                         is the sentence for murder done with \n                         magic.\n\n                                     ARTHUR\n                         It is. Lords and knights of the Round \n                         Table, as her husband I say that \n                         this deed was not done by Guenevere. \n                         Who among you will champion this \n                         truth?\n\n               No one responds. Guenevere falls into her seat. Arthur \n               searches the eyes of his knights and they evade him.\n\n                                     ARTHUR\n                         Sir Caradoc! You!\n\n               The knight looks up.\n\n                                     CARADOC\n                         I am torn.\n\n               Sir Ector, old and feeble, weeps for Arthur. Someone speaks \n               up. It is Perceval, who kneels before the Queen. His voice \n               is unnaturally loud, and his eyes shine with held-back tears; \n               he stutters.\n\n                                     PERCEVAL\n                         I will champion you, my lady.\n\n               He is overwhelmed by his own boldness. He looks around. All \n               eyes are upon him. Guenevere smiles at him, sadly.\n\n                                     GUENEVERE\n                         I thank you, but you are not yet a \n                         knight.\n\n                                     PERCEVAL\n                         I will find Lancelot! He will come!\n\n               Perceval hurries from the hall. Arthur looks away, ashamed, \n               and his eyes fall on Merlin, twitching and mumbling in his \n               sleep.\n\n                                     MERLIN\n                         Boys!... boys will be boys...\n\n               EXT. HOVEL - COUNTRYSIDE - DAY\n\n               In full armor but for his helmet, Lancelot is seated at a \n               small table in the shadow of a tree, eating an apple.\n\n               A young girl is turning a chicken on a spit, and her mother \n               is removing freshly-baked bread from an oven. It is very \n               peaceful and silent until, galloping all out, Perceval \n               arrives. Frantic, out of breath, he leaps from his lathered \n               horse.\n\n                                     PERCEVAL\n                         I have found you. The Queen. An apple.\n                         Tomorrow. Sir Gawain...\n\n                                     LANCELOT\n                         --It must wait, child. These good \n                         ladies, for whom I intervened once, \n                         will honor me with a meal. I am \n                         beholden to them now as I was when \n                         they begged my protection.\n\n               The two women set the chicken and the bread before the great \n               knight, and stand back to watch him eat, flushed with \n               excitement. Perceval falls silent, in awe of Lancelot.\n\n               INT. BEDCHAMBER, CAMELOT - NIGHT\n\n               Arthur stands hunched over the fireplace, staring into the \n               flames. Guenevere paces back and forth to a window.\n\n                                     GUENEVERE\n                         Why can't you be my champion?\n\n                                     ARTHUR\n                         If I am your judge, I cannot be your \n                         champion. When I act as your King, I \n                         cannot be your husband.\n\n                                     GUENEVERE\n                         And you cannot love me...\n\n                                     ARTHUR\n                         The laws, my laws, must bind everyone, \n                         high and low, or they are not laws \n                         at all. Lancelot will come...\n\n                                     GUENEVERE\n                         And if he cannot be found, no other \n                         knight will champion me, though you \n                         beseeched each and every one of them. \n                         Why be king if there is no one you \n                         can call loyal subject but an eager \n                         boy?\n\n               He hides his anguish from her. Numb with hurt, she goes to a \n               tall curtained window, and draws it open, and stands there \n               looking out upon the surrounding forest, silent and still \n               beneath the moon.\n\n               EXT. WINDOW - NIGHT\n\n               She cries softly, and she whispers the name of the great \n               knight.\n\n               EXT. EDGE OF THE FOREST, WALLS OF CAMELOT - NIGHT.\n\n               A mounted knight stands motionless at the edge of the forest, \n               his armor gleaming with dark lustre. It is Lancelot. His \n               eyes are raised to the high window, where he sees Guenevere. \n               He watches her in silence. In the high window Guenevere draws \n               the curtain and Lancelot reins back into the forest.\n\n               EXT. FOREST - NIGHT\n\n               Lancelot has unsaddled and tethered his horse in a small \n               clearing. He sits, resting back against a tree. He removes \n               his helmet; he plants his sword before him, like a cross. He \n               loosens the ties of his breastplate. He waits for day, \n               yawning, tired. But his eyes burn, and he closes them and \n               nods off to sleep.\n\n               A knight appears silently hovering over him. Lancelot looks \n               up, and his eyes go wide with fear. The knight towering above \n               him wears armor identical to his, and he raises his sword, \n               and the blade is descending upon Lancelot. Lancelot draws \n               his sword from the ground and rolls away, but the knight's \n               sword slices through his shoulder joint. Lancelot attempts \n               to rise but already the knight, Lancelot's mirror image, is \n               upon him. From the ground, Lancelot parries the blow and \n               slashes at the opponent's knee, cutting through the joint in \n               the armor and severing the leg.\n\n               The knight doesn't fall, doesn't bleed, doesn't cry out. On \n               one leg he comes forward, a horror. Lancelot is paralyzed by \n               fear. As the knight leaps upon Lancelot, Lancelot rises to \n               meet him, impaling himself on the knight's sword below the \n               hauberk. He throws the knight to the ground, and comes down \n               upon him. He rips off the helmet and the breastplate. The \n               armor is empty and Lancelot rolls over on his back, awakening \n               from the nightmare with his own sword deep in his stomach, \n               and in his hand his own helmet and breastplate, while other \n               parts of his armor lie strewn around him.\n\n               Only then does he become conscious of the terrible pain and \n               the shock of the truth. He grabs the hilt of his sword and \n               draws it from his stomach. He curls up in agony, clutching a \n               fistful of leaves to the wound.\n\n                                     LANCELOT\n                         Guenevere, I fight against myself...\n\n               He loses consciousness.\n\n               EXT. JOUSTING GROUND OUTSIDE CAMELOT - DAWN\n\n               The Bishop blesses the field. Guenevere, numb and \n               disbelieving, is being led to the stake, which rises from a \n               bed of straw and wood. Arthur watches, in shock. Other knights \n               and ladies keep their distance, watching darkly, stealing \n               glances at Arthur, mumbling disapproval of his refusing to \n               defend Guenevere. In battle dress, Sir Gawain rides up and \n               down the jousting run on a snorting and powerful horse, \n               practicing. Perceval, in a mail doublet, waits beside a mangy \n               roan, his face burning with anxiety.\n\n               Guenevere is tied to the stake. All eyes watch for the \n               approach of her champion. Arthur goes to Perceval.\n\n                                     ARTHUR\n                         Is he coming?\n\n                                     PERCEVAL\n                         He heard Lady Guenevere's request \n                         and he said nothing. That is all.\n\n               Arthur hides his pain behind a rigid mask.\n\n               EXT. JOUSTING GROUND - DAY\n\n               The sun has risen shining cruelly into Guenevere's eyes; the \n               queen is alone at the stake. Sir Gawain rides up to King \n               Arthur, who waits alone, separated from the others.\n\n                                     SIR GAWAIN\n                         My Lord, the sun is upon the field. \n                         The Queen has no champion. I demand \n                         justice, as is my right.\n\n                                     ARTHUR\n                         So it is.\n\n               Perceval leaps onto his horse.\n\n                                     PERCEVAL\n                         Let me champion the Queen!\n\n               Sir Gawain looks at the squire with contempt.\n\n                                     SIR GAWAIN\n                              (to Arthur)\n                         Since no knight comes forward, I \n                         demand justice--\n\n               Arthur is in anguish. He searches the tree line for a sign \n               of Lancelot. He looks from Guenevere at the stake to his own \n               knights watching him. He draws Excalibur. A gasp goes through \n               the crowd of onlookers.\n\n                                     ARTHUR\n                         Boy, kneel.\n\n               Perceval leaps from his horse and bends his knee before the \n               King. Arthur brings the sword down on the boy's shoulder, \n               giving him the three strokes.\n\n                                     ARTHUR\n                         In the name of God, of St. Michael, \n                         and St. George, I make you a knight. \n                         Rise, Sir...\n\n                                     PERCEVAL\n                         ...Perceval!\n\n               Gawain shakes his head disdainfully as Perceval mounts back \n               into the saddle, his eyes burning with fervor.\n\n               Sir Gawain and Perceval ride to opposite ends of the field. \n               The spectators fall silent, all staring blankly, their senses \n               dulled by the tragedy, at the uneven combatants.\n\n               A cry goes up. Lancelot rides out of the forest. He rides up \n               to the King and salutes him. Arthur smiles at his old friend, \n               tears of joy in his eyes. Lancelot bows toward Guenevere and \n               rides on to where Perceval waits.\n\n               Lancelot reaches out to touch Perceval's cheek.\n\n                                     LANCELOT\n                         It's my task to prove the Queen's \n                         innocence.\n\n               Perceval cannot reply, his eyes affixed on the blood that \n               trickles from Lancelot's hauberk. Lancelot raises his lance \n               in salute to Gawain across the field. Gawain salutes in \n               answer.\n\n               The two huge knights charge at each other, each man's spear \n               tip making contact with the other's armor, and in the violent \n               collision both are unhorsed. Lancelot is slower at getting \n               to his feet and drawing his sword.\n\n               He is bleeding below the hauberk from his self-inflicted \n               wound.\n\n               In the first onslaught Lancelot fights defensively, falling \n               back. He has to toss aside his shield and hold his stomach \n               with his shield hand.\n\n               Morgana watches with Merlin. Every terrible blow of sword on \n               sword reverberates through her body pleasurable. Merlin is \n               captivated by her cruel sensuality.\n\n               EXT. JOUSTING GROUND - LATE DAY\n\n               They swing and thrust at each other with slower but bone-\n               crushing force, both unsteady now. Blood seeps from Lancelot's \n               feet, leaving awful footprints on the earth. Finally, with a \n               daring thrust, Lancelot lifts Gawain's visor and the sword \n               tip is before his eyes. Gawain drops his sword and shield, \n               kneels and speaks in a voice hoarse with weariness.\n\n                                     SIR GAWAIN\n                         The Queen is innocent. I yield to \n                         your mercy, Sir Lancelot.\n\n               Lancelot collapses in a dead faint.\n\n               INT. CELL, CAMELOT - EVENING\n\n               Eyes closed, Lancelot lies on a bed, naked but for a cloth \n               across his loins. His minor wounds have been dressed, and \n               Merlin is kneading the huge gash in his stomach, working the \n               severed flesh together. Guenevere stands on one side of the \n               bed, Arthur on the other, both looking down upon Lancelot, \n               relieved and not daring to look at each other.\n\n                                     MERLIN\n                         Flesh on flesh. You must press on \n                         the wound, Guenevere, hold it, and \n                         it will begin to bind.\n\n               Guenevere kneels, and at her touch Lancelot's eyes flicker \n               open. Merlin exits, and draws Arthur away with him.\n\n               Arthur is deeply tormented.\n\n                                     ARTHUR\n                         Merlin, tell me. Now that Guenevere \n                         is returned to me...\n\n                                     MERLIN\n                         What is it my child?\n\n               Merlin appears moved by the predicaments that Arthur has to \n               face.\n\n                                     ARTHUR\n                         Will I have a son?\n\n               Merlin stares off into the evening sky, where a lark sings \n               high up.\n\n                                     MERLIN\n                         Yes.\n\n                                     ARTHUR\n                         Just yes? No mad laughter, no riddles, \n                         nothing but a simple yes? That \n                         frightens me.\n\n                                     MERLIN\n                         A king should be afraid, always. The \n                         enemy is everywhere. Waiting in ambush \n                         in the dark corridors of his castle, \n                         on the deer paths of his forest, or \n                         in the gray and winding paths of a \n                         more tangled forest, in here.\n\n               He taps his skull and smiles.\n\n               INT. CELL - EVENING\n\n               Lancelot is staring into Guenevere's eyes. She opens her \n               shift, baring a breast with the innocence of a mother \n               preparing to suckle a child. She presses her breast to his \n               wound, her face to his chest, her arms enfolding him. She \n               whispers.\n\n                                     GUENEVERE\n                         Flesh on flesh. I will heal you.\n\n               His body trembles and his eyes brim with tears. He is lost.\n\n               INT. HALL OF THE ROUND TABLE, CAMELOT - NIGHT\n\n               The court is assembled, for the evening feast. There is music \n               and heavy drinking. Some knights are slouched across the \n               table. Lancelot, still weak, takes his seat, looking at the \n               drunken and frivolous knights. Arthur catches it, and they \n               smile at each other.\n\n                                     ARTHUR\n                         They miss the battlefield. I think \n                         we do too.\n\n                                     LANCELOT\n                         But one can still keep a sword sharp \n                         riding out in the name of the King's \n                         law.\n\n               Guenevere cannot tear her eyes from Lancelot. He avoids her \n               look. Arthur looks from Guenevere to Lancelot, and speaks \n               softly to him, across her, and with stabbing directness.\n\n                                     ARTHUR\n                         It is not easy for the young ones to \n                         learn knightly virtues without the \n                         hard teaching of war and quest. It \n                         is only your example, Lancelot, that \n                         binds them now.\n\n               Then, addressing the hall:\n\n                                     ARTHUR\n                         Which is the greatest quality of \n                         knighthood? Courage? Compassion? \n                         Loyalty? Humility? What do you say, \n                         Merlin?\n\n               He is bent close to Morgana, whispering. Only when the hall \n               rings with laughter does he look up.\n\n                                     MERLIN\n                         What?\n                              (then seeing he has \n                              an audience)\n                         The greatest? They blend together \n                         like the metals we mix to make a \n                         good sword.\n\n                                     ARTHUR\n                         I didn't ask for poetry. Which is \n                         it?\n\n               Merlin looks from Arthur to Guenevere to Lancelot to Arthur.\n\n                                     MERLIN\n                         All right. Truth. It must be truth, \n                         above all. When a man lies he murders \n                         some part of the world.\n\n               An uneasy silence falls upon the feast. Guenevere and Lancelot \n               cannot look at each other, and Arthur feels it. Lancelot \n               jumps to his feet.\n\n                                     LANCELOT\n                         Conversation and court life don't \n                         suit me. I must take my rest in the \n                         forest.\n\n               Guenevere stifles her dismay.\n\n                                     ARTHUR\n                         Hasn't Merlin mended your wound?\n\n                                     LANCELOT\n                         It is deep...\n\n               Arthur is about to rise to embrace him, but checks himself.\n\n                                     ARTHUR\n                         You will be sorely missed. Heal \n                         yourself and come back.\n\n               The exchange has become closely intimate, even though they \n               stand apart and speak before everyone in the large hall. \n               Lancelot leaves. Only Guenevere cannot watch.\n\n               EXT. FOREST GLADE -DAY\n\n               Water gurgles from a rock that is captive in the roots of an \n               ancient oak. Lancelot, in armor, reclines against its trunk, \n               the roots cradling him. He is perfectly still, drawing life \n               from the vibrant, all-enfolding forest.\n\n               Flower petals drift on the breeze. Trees sigh. Fox and rabbit, \n               sparrow and hawk, at peace with each other, watch over the \n               knight.\n\n               EXT. FOREST -DAY\n\n               A horse and rider tear through the thick undergrowth. It is \n               Guenevere. The forest races past her as she gallops toward \n               the glade, brambles tearing at her flesh and clothes.\n\n               EXT. FOREST GLADE - DAY\n\n               Lancelot gets to his feet, tense. Guenevere dismounts and \n               approaches. She is flushed and breathless from the wild race. \n               Her horse, left free, wanders over to his and grazes beside \n               it.\n\n                                     LANCELOT\n                         Why? You will destroy Arthur, and \n                         us...\n\n               She moves closer and he thrusts out his mailed fist to keep \n               her away. She clutches it and presses the metal to her soft \n               tear-streaked cheek.\n\n                                     LANCELOT\n                         The law forbids it.\n\n                                     GUENEVERE\n                         Love demands it.\n\n               Hungry with passion, she embraces the cold unmoving armor, \n               kissing it.\n\n                                     LANCELOT\n                         There are things about love--\n\n                                     GUENEVERE\n                         --Nothing!\n\n               He steps back, drawing his sword. He holds it up by the blade \n               between them.\n\n                                     LANCELOT\n                         By my knight's sword, I swore faith--\n\n               And before he can finish she grabs the blade to push it aside. \n               He holds it fast. Blood streams from her bare hands. He cannot \n               prevail without cutting them deeply. He lets go of the sword, \n               and she lets it fall to the ground.\n\n               She embraces his still and defeated hulk. She kisses the \n               metal, and sensation shoots through him, dizzying him.\n\n                                     LANCELOT\n                         Guenevere...\n\n               He folds her in his arm, and their bodies lock together as \n               though a trap had sprung. Their mouths meet, each devouring \n               the other...\n\n               EXT. BATTLEMENTS, CAMELOT - DUSK\n\n               Arthur and Merlin, the King desperate, the Wizard overwhelmed \n               by compassion:\n\n                                     ARTHUR\n                         I am alone and betrayed. By my wife, \n                         by my beloved friend, by my knights. \n                         And by you. Perhaps most of all by \n                         you. For you made me, you forged \n                         this wretched life. And like a child \n                         tired of a toy, you toss me aside, a \n                         babbling lecher trotting after my \n                         sister...\n\n                                     MERLIN\n                         That is my destiny. I have a destiny, \n                         too...\n\n                                     ARTHUR\n                         With all your powers, you are content \n                         to be ridiculed, laughed at...\n\n                                     MERLIN\n                         My powers fade, Arthur. I resort to \n                         cheap tricks...\n                              (with sudden enthusiasm)\n                         Yes! I enjoy every moment of my \n                         foolishness, I join in the making of \n                         it, so no one can betray me. But \n                         you! You betray yourself.\n\n                                     ARTHUR\n                         Me? I have lived by the oath of king \n                         and knight.\n\n                                     MERLIN\n                         You betray the boy who drew the sword, \n                         the boy who saw the Dragon... the \n                         Dragon who moves close by, coiling \n                         and uncoiling, restless, looking \n                         down, waiting for the King to be a \n                         king...\n\n               Arthur looks up and in the rolling clouds maybe, just maybe, \n               the form of a dragon is taking shape. Arthur draws Excalibur, \n               intensity animating his dead features.\n\n                                     ARTHUR\n                         I must do it myself. I must kill \n                         them both. Lancelot and Guenevere. \n                         Will you ride with me, Merlin?\n\n                                     MERLIN\n                         I cannot. I must not. Here I must \n                         stay.\n\n               They embrace. Merlin is on the verge of tears, his face \n               immediately sad and finally ancient. Arthur exits.\n\n               Morgana, who has been watching from the shadows, watching \n               from the shadows, slinks up to Merlin's side.\n\n                                     MORGANA\n                         Crazy old fool. You think yourself a \n                         kingmaker. Ha! A meddler, more likely. \n                         Look what a mess you've made of \n                         things.\n\n               Merlin smiles knowingly at her.\n\n                                     MERLIN\n                         I? Perhaps, perhaps. I'm losing \n                         interest, Morgana... I have helped \n                         men--or meddled in their affairs, if \n                         you would have it that way--since \n                         the dawn of time. Now let them live \n                         by their own laws. Let them stand on \n                         their own feet. The gods of once are \n                         gone forever, it is time for men... \n                         Morgana, make a man out of me. Kiss \n                         me.\n\n               He reaches to touch her lips. She cradles his hand in hers \n               and doesn't allow Merlin to kiss her. She kisses his knuckles \n               and stares into his eyes, stoking his desire.\n\n                                     MORGANA\n                         You know what I want. I want the \n                         secret of true magic, how to thicken \n                         the stuff of dreams and wishes with \n                         the flesh of the world.\n\n                                     MERLIN\n                         That I cannot.\n\n               She breaks away, provocative, alluring.\n\n                                     MORGANA\n                         Then I will not.\n\n               EXT. FOREST - NIGHT\n\n               Arthur and Sir Kay gallop through the forest, silently. It \n               is not a dream.  Their armor and the hooves of their horses \n               are muffled with pieces of cloth.\n\n               EXT. FOREST GLADE - NIGHT\n\n               Only Nature will ever see their love; the creatures of the \n               air, tree and ground witness the final reality of their \n               passion and sense its unfathomable depths, singing of it in \n               a hundred languages. Lancelot and Guenevere are naked and \n               interlocked, one being, suspended in the darkness in the eye \n               of the forest.\n\n               EXT. FOREST - NIGHT\n\n               Arthur walks soundlessly through the trees, approaching the \n               glade. The forest falls suddenly silent.\n\n               EXT. FOREST GLADE - NIGHT\n\n               All passion spent, locked in each other's arms, Lancelot and \n               Guenevere drift off into sleep.\n\n               Arthur comes upon them. He stands over them. He draws \n               Excalibur. Checking all emotion, he holds it above his head. \n               The ancient steel glows darkly.\n\n               The lovers faces are serene and innocently beautiful. He \n               hesitates, tormented. His mask of anguish gives way to \n               determination and calm. He strikes the sword home, letting \n               go of it.\n\n               He backs away, turns and disappears into the forest.\n\n               EXT. FOREST GLADE - DAWN\n\n               The sky is red; so is the steel of Excalibur. Lancelot awakens \n               and starts at what he sees. His cry stirs Guenevere. They \n               are horrified to see Excalibur impaled in the ground between \n               their entwined bodies. It has pierced their union without \n               grazing their flesh. They leap up and back away, unable to \n               speak at first.\n\n                                     LANCELOT\n                         Why didn't he kill us?\n\n                                     GUENEVERE\n                         He has given up.\n\n               She kneels before the sword, embracing the hilt to her breast.\n\n                                     LANCELOT\n                         The King without his sword, the land \n                         without a king...\n\n                                     GUENEVERE\n                         We are to blame.\n\n               Lancelot stumbles into the forest, berserk with guilt. He \n               rages against a small tree, crying out, and he rips its roots \n               from the ground, the terrible tearing and renting the symbol \n               of his own inner torment.\n\n               Guenevere sinks to the ground next to Lancelot's empty armor \n               and his abandoned sword.\n\n               INT. DUNGEONS OF CAMELOT\n\n               Merlin and Morgana descend winding steps cut out of rock. \n               The only light comes from the glow of Merlin's staff.\n\n                                     MERLIN\n                         When Arthur built the castle, I carved \n                         out a place for myself, where I could \n                         laugh or sleep, and no one would \n                         bother me.\n\n                                     MORGANA\n                         People make you laugh?\n\n               He laughs.\n\n                                     MERLIN\n                         They do.\n\n                                     MORGANA\n                         Why?\n\n               He leans close to her ear, whispering into it.\n\n                                     MERLIN\n                         They don't know how close they live \n                         to the edge of delight or disas...\n\n               He is about to kiss her when he slips. He laughs.\n\n                                     MERLIN\n                         Happiness or horror.\n\n               INT. CAVE BENEATH CAMELOT\n\n               They pass through jaws of stalactites and stalagmites. Merlin \n               cracks his staff whip-like and a ball of fire billows up \n               from the tip and illuminates a cave wildly veined and \n               filigreed with minerals and crusted with growths of crystals. \n               The light goes out but the malachite and the gold, the quartz, \n               diamond and beryllium burn dully. He turns to her, suddenly \n               tall and unstooped, younger, sleek and evil.\n\n                                     MERLIN\n                         In the folds of the earth where the \n                         forces that hold the world together \n                         are more alive, my power is strongest. \n                         Here I will possess you, as a man \n                         possesses a woman. And the god, the \n                         eunuch, the mule that I was, will be \n                         no more.\n\n               He sweeps her up into his arms.\n\n                                     MORGANA\n                         You are truly magnificent!\n\n                                     MERLIN\n                         Flattery! Do you think I am ignorant \n                         of your stupid little games? Preying \n                         on you weakness of others. That's \n                         your power, a petty evil. Mine is \n                         great. Great plans. Impossible dreams. \n                         Laughable endings...\n\n               He deposits her on bare rock. He kisses her. She pushes him \n               away.\n\n                                     MORGANA\n                         Merlin, the powers of Summoning, the \n                         true Name of the charms of Doing and \n                         Undoing. Show me!\n\n                                     MERLIN\n                         I won't. You would misuse such power. \n                         I have paid enough for you, and I \n                         will have you.\n\n               She leans forward and kisses his ear and whispers.\n\n                                     MORGANA\n                         Make magic, my foolish wizard. For \n                         our love. Weave a marvelous room \n                         around us, a room worthy of our \n                         coupling.\n\n               She draws closer, kissing him deeply. He breathes heavily.\n\n                                     MERLIN\n                         What do you want? You must desire it \n                         for me to weave it.\n\n                                     MORGANA\n                         Walls of shining crystals, burning \n                         with red fire, furnishings of metals \n                         and jewels never seen by man...\n\n               Morgana falls silent as Merlin raises a hand, majestically \n               intoning a harsh repetitive charm. The mineral veins of the \n               cave begin to glow and fog seeps out from them enveloping \n               the couple.\n\n                                     MERLIN\n                         Desire it and it will be as you \n                         desire.\n\n               Morgana burns with intensity. Merlin utters a formula and \n               the fog coalesces around them into the shimmering presence \n               of crystal walls, fountains raining jewels, flowers made of \n               scented air, a bed of glass shot with light and covered with \n               skins of animals dead before the time of man, goblets of \n               ruby, tapestries woven of golden hair. She reaches out to \n               touch the wall and her hand plunges through the unmaterialized \n               illusion.\n\n                                     MORGANA\n                         It's only a semblance. You disappoint \n                         me.\n\n               She begins lacing up her loosened gown.\n\n                                     MERLIN\n                         Don't touch the walls. Come close to \n                         me.\n\n               She does, a mad hope in her eyes. She kisses his chest.\n\n                                     MORGANA\n                         Do it, Merlin, the deepest secret. \n                         Fix it with the charm of Making, for \n                         our endless pleasure.\n\n               He utters the ancient charm, Morgana listening closely, \n               memorizing it. The illusion is all of a sudden solid.\n\n                                     MERLIN\n                         For you...\n\n               She runs her hand across the hard crystal surface, her eyes \n               gleaming.\n\n               From outside the wondrous room they can be seen to embrace. \n               He carries her to the magical bed where he makes love to \n               her, as they disappear from view in its effulgent light.\n\n               She comes out through the crystal door, burning with evil \n               intent. She turns to watch him asleep in the bed.\n\n               She utters the charm of Summoning learnt from Merlin, and \n               the room melts into an eddying carmine fog. Within it, Merlin \n               struggles to awaken from the torpor of love, alarmed.\n\n               Outside, Morgana utters the charm of Making and the gaseous \n               mass begins to crystallize.\n\n               Inside, Merlin is rising to his feet, breathing the red fog, \n               his movements slowing to a standstill, his mouth opening in \n               a scream of horror.\n\n               The cloud has metamorphosed into a magnificent cluster of \n               red crystals.  Morgana peers into its facets and there she \n               sees, in fragments, Merlin's terror... an eye, the gaping \n               mouth, a clawing hand--as he is entombed in the stone. She \n               laughs in triumph.\n\n               EXT. FOREST - CAMELOT - DAY\n\n               Surrounded by forest, the spires and battlements of Camelot \n               rise under black storm clouds. Arthur and Kay ride back to \n               the castle.\n\n               INT. HALL OF THE ROUND TABLE - DAY\n\n               The great hall is in gloom. Few knights are in attendance at \n               the table.\n\n               Some sleep off last night's wine. Arthur approaches, haggard, \n               searching.\n\n                                     ARTHUR\n                         Has no one seen Merlin?\n\n               Knights look up; those who meet Arthur's reddened eyes shake \n               their heads.\n\n               Arthur leaves. A knight whispers to another.\n\n                                     KNIGHT\n                         Did you see? The King was without \n                         Excalibur...\n\n               INT. PASSAGEWAYS, CAMELOT - DAY\n\n               Echoing in the vaulted corridors outside the hall, the \n               knight's whisper stabs Arthur.\n\n               The words now seem borne on the whistling wind and follow \n               the King wherever he goes in search of Merlin. He comes upon \n               a knight seducing a lady in a dark corner by the chapel door, \n               his hand under her gown. Arthur notes the sacrilege in \n               silence, and continues on his way.\n\n               INT. BEDCHAMBER - DAY\n\n               The wind keens. Thunder rolls overhead. Arthur enters his \n               bedchamber. He sits by the empty fireplace, a broken man. \n               Feminine hands light on his shoulders. He starts. He looks \n               up. It is Morgana. He smiles and grasps her hand.\n\n                                     MORGANA\n                         I'll weep for you, brother, for a \n                         King must not weep.\n\n               She comes around and she kneels in front of him. Before he \n               can talk she silences him with a tender caress.\n\n                                     MORGANA\n                         Do you know what Guenevere's maids \n                         have whispered?\n\n               He shakes his head.\n\n                                     MORGANA\n                         That when the King returned from \n                         battle...\n\n               She begins untying the laces of his metal thigh and shin \n               guards.\n\n                                     MORGANA\n                         ...Guenevere would unlace his armor \n                         and massage the burns where metal \n                         rubbed on flesh...\n\n               She is stripping his legs naked, gently touching the flesh \n               with her fingertips. He stares off, remembering.\n\n                                     MORGANA\n                         ...She would prepare a bath for you, \n                         mixing special ointment in the \n                         water...\n\n               Arthur's eyes brim with tears. Morgana weeps, embracing his \n               knees. He rests his hand gently upon her head, choked with \n               remembrance, soothing her. But as she weeps, she incants a \n               charm.\n\n               Arthur looks down upon her, and the woman who looks up at \n               him is Guenevere, a Guenevere with cold ice eyes. He is made \n               weak by desire and weakened further by magic. He holds her \n               face adoringly.\n\n                                     ARTHUR\n                         Guenevere! You are--\n\n                                     \"GUENEVERE\"\n                         --Don't speak. A thousand words, a \n                         hundred thousand words, would only \n                         be prologue to the truth that must \n                         be. That you, King, and I, your Queen, \n                         beget a son to bond our love and to \n                         strengthen our weak kingdom with a \n                         successor. Come, my lord...\n\n               She draws him to the floor and upon her body, holding him \n               tightly to himself. Arthur trembles with excitement, pathetic \n               in his desperate passion.\n\n               As he takes her, she shudders, losing control of the charm, \n               and her features change till once again \"Guenevere\" is \n               Morgana. She holds him in a tight embrace so that he may not \n               see her. She whispers in his ear.\n\n                                     MORGANA\n                         The moon flows in my blood to meet \n                         your seed. And already I bear him \n                         who will be King.\n\n               Arthur wrenches himself away so he can see her, her arms \n               still around his neck. He looks down upon her, aghast, \n               incredulous.\n\n                                     MORGANA\n                         I could easily kill you, brother. \n                         But I want you to live to see our \n                         son be King. In me, the blood of \n                         Cornwall will have its revenge; in \n                         me, the blood of Uther will show its \n                         dark side.\n\n               She presses her thumbs into his neck and he faints.\n\n               EXT. FOREST - CAMELOT - DAY\n\n               Morgana, with a small party, rides away from the castle \n               through the lashing storm, till they are taken from sight in \n               the folds of the forest...\n\n               INT. CHAPEL, TINTAGEL CASTLE - NIGHT\n\n               Lightening forks across the sky, illuminating the interior. \n               The chapel has been transformed into a place of satanic \n               worship. Held up and surrounded by hooded figures, Morgana \n               lies on the altar, her pregnant belly huge; and her features \n               are fierce with passionate intensity. She writhes in the \n               pangs of childbirth.\n\n                                     MORGANA\n                         Stand back, all of you. Through my \n                         own body I have nurtured him with my \n                         potions. I made him. I alone can \n                         give him life.\n\n               INT. CHAPEL, CAMELOT - NIGHT\n\n               Arthur enters, pale and haunted. Mass is being celebrated, \n               and some knights are present. Those not asleep whisper to \n               each other about the King. The sound of an approaching storm \n               is heard.\n\n               As the priest raises the chalice to consecrate the wine. \n               Arthur comes down the aisle and steps onto the altar. He \n               reaches out to grasp the chalice from the priest's hands.\n\n               INT. CHAPEL, TINTAGEL CASTLE - NIGHT\n\n               Morgana holds aloft her beautiful newborn baby, his body \n               glistening in a flash of lightening. She is triumphant.\n\n               INT. CHAPEL, CAMELOT - NIGHT.\n\n               A bolt of lightening strikes the chalice, rocking the chapel, \n               and Arthur is knocked back violently.\n\n               Rain lashes in through the shattered window upon the terrified \n               knights. They and the priest back away. Arthur is left alone. \n               He rises and goes to the chalice, which is bent and cracked. \n               He kneels before it. Steam hisses up as rain falls on it.\n\n               INT. HALL OF THE ROUND TABLE - DAY\n\n               Sun streams in. Many of the knights are in attendance, in \n               full armor.\n\n               Ladies and pages watch from dark corners. Arthur addresses \n               the fellowship.\n\n               He holds the cracked chalice in his hands. He burns with a \n               new-found fervor.\n\n                                     ARTHUR\n                         Who will ride the labyrinths of the \n                         forest, to the very root of his soul, \n                         to the very ends of the earth, to \n                         find the secret that will redeem us \n                         from the evil that has fallen upon \n                         us, and make this chalice, and \n                         ourselves, whole again?\n\n               Gawain rises and draws his sword in salute.\n\n                                     SIR GAWAIN\n                         I will ride forth in the name of \n                         that quest, and commit my strength \n                         and my soul to it.\n\n               Perceval, Kay and a few others draw their swords and touch \n               their lips to the blades in oath. Sunbeams splash off their \n               armor.\n\n                                     PERCEVAL\n                         I will go.\n\n               The rest of the fellowship draw their swords in imitation, \n               but the resolution within them is not strong. Arthur comes \n               forward to Gawain.\n\n                                     ARTHUR\n                         Gawain, a dreadful fear is upon me, \n                         that we may never meet again, that \n                         the fellowship will be no more...\n\n               He embraces Gawain, tears in his eyes. He turns to Perceval, \n               and Perceval kneels.\n\n                                     PERCEVAL\n                         We will find the secret or die.\n\n               Arthur kisses the young knight's brow. Then he turns to Kay.\n\n                                     ARTHUR\n                         Kay, I know your heart yearns to go, \n                         but I am prisoner to my duties, and \n                         you must be to yours, at my side.\n\n               Arthur and Kay watch the knights file out till the hall is \n               empty, the harsh song of their armor growing distant.\n\n                                                                  FADE OUT:\n\n               A LEGEND APPEARS:\n\n               \"For nine years they searched. Morgana's power grew in the \n               land.\"\n\n               FADE IN:\n\n               EXT. SNOWSCAPE - DAY\n\n               Under a leaden sky, Gawain drives his horse through swirling \n               snow. He comes upon a mounted knight who is frozen in his \n               tracks. He brushes the snow from the man's face. The frozen \n               features belong to Caradoc. He slowly continues on his way.\n\n               EXT. DEAD FOREST - DAY\n\n               Dangling from the branches of a dead tree are a dozen dead \n               knights of the Round Table, crows pecking at the rotting \n               flesh in the chinks of armor. Perceval rides up, cries out \n               in horror, and spurs his horse away.\n\n               EXT. MOORS - DAY\n\n               The rotting carcasses of sheep. The crops blackened and \n               withered on the stalk. Hungry peasants head for a distant \n               hill.\n\n               EXT, HILLSIDE, MOORS - DAY\n\n               A giant head has been carved out of an outcrop of rock, its \n               stone mouth gaping toward the sky.\n\n               People are congregated around the mouth. Peasants and farmers, \n               they are wild with excitement, responding to drums throbbing \n               and bagpipes wailing.\n\n               They watch Morgana, who is surrounded by knights in dark \n               armor. At her side is an angelic boy of eight, his eyes cold \n               as his mother's. Morgana is more beautiful than ever, in \n               flowing druidic robes, the gossamer silk clinging to her \n               sweat-drenched body.\n\n               She is standing by the deep hole which forms the giant's \n               open mouth. It is covered by a tooth-like grating acting as \n               a drain for the blood of human sacrifices made there. Before \n               her is Gawain, chained and struggling against five strong \n               men who hold him. Morgana lifts a dagger and plunges it into \n               Gawain's chest. The fountain of blood that gushes from the \n               great knight's body drives the crowd into a frenzy.\n\n                                     MORGANA\n                              (intoning)\n                         The blood of this knight will feed \n                         the god in the earth, he is weak \n                         with hunger, and he will be made \n                         strong by this blood. Then he will \n                         plant his seed, and the land will be \n                         fertile once again.\n\n               Gawain, his blood flowing from him and into the giant's mouth, \n               looks up in anguish. His bellowing voice is echoed and \n               amplified by the hollow beneath the drain.\n\n                                     GAWAIN\n                         Arthur, forgive me. I die without \n                         the secret. I have failed.\n\n               EXT. MOORS - DAY\n\n               Gawain's death cry and the din of the ritual carries to \n               Perceval's ears as he wanders through the wasteland. He draws \n               down his visor and spurs his horse forward.\n\n               EXT. HILLSIDE, MOORS - DAY\n\n               He gallops toward the giant's head. He checks his sword and \n               lowers his lance.\n\n               The knight charging forward on his war horse is an awesome \n               sight, but the crowd around the giant's mouth is strangely \n               unfrightened. Morgana is excited; she turns to the boy.\n\n                                     MORGANA\n                         Look, Mordred, a true prize for the \n                         giant. The lamb rides into our jaws.\n\n               Perceval is galloping toward them when the ground gives way \n               beneath the horse, and he and the animal plunge into a pit. \n               The cheering crowd rushes to the edge of the trap.\n\n                                     MORGANA\n                              (to Mordred)\n                         You must kill him, for this knight \n                         is dear to your father. You must do \n                         it and learn to enjoy your father's \n                         pain.\n\n               Her knights drag Perceval, unarmed, into Morgana's presence.\n\n                                     MORGANA\n                         Have you found what you search for? \n                         Have you found what Arthur seeks?\n\n               Perceval doesn't answer, defiant and hiding his fear.\n\n                                     MORGANA\n                         You haven't, or you would be smiling \n                         now in the face of death. Your quest \n                         is an impossible one.\n\n                                     PERCEVAL\n                         That it might be impossible makes it \n                         all the more necessary.\n\n                                     MORGANA\n                         Fool!\n                              (to the men holding \n                              Perceval)\n                         Uncover him. I'll show you the mystery \n                         of life. It's death...\n                              (to Mordred)\n                         Do it, Mordred!\n\n               Holding Perceval by his limbs and hair, the men force him \n               down on the bloody grating, drawing back his head, exposing \n               his throat. Morgana kneels by his head, and draws the boy \n               beside her. She holds the tip of the dagger to Perceval's \n               neck and takes Mordred's hand and wraps it around the handle.  \n               Perceval is choked with fear, his heart pounding in his \n               throat.\n\n                                     MORGANA\n                         Feel the life through the dagger, \n                         child. It belongs to you.\n\n               The boy looks up at his mother. The vein in Perceval's neck \n               pushes against the dagger's point.\n\n                                     MORDRED\n                         I feel it, Mother. I will give his \n                         blood to the giant.\n\n               The boy raises the dagger, and hesitates just a bit. Perceval \n               resigns himself bravely. He looks the child calmly in the \n               eye. Mordred brings down the blade without strength, just \n               piercing the skin with the tip. He lets go of the dagger, \n               afraid now of his mistake.\n\n               The dagger clatters to the grating and slips away down the \n               drain, before Morgana can retrieve it. She rages against \n               Mordred. In the confusion, Perceval tears loose, the men \n               holding him slipping on the blood-wet stone.\n\n               Perceval runs through the crowd. Immediately, lance lowered, \n               a knight is upon him. Perceval leaps toward him, catching \n               the lance in his hand, and pulling down the rider with it. \n               He jumps the rider and draws the knight's sword. Whirling \n               the lance and cutting the air with the sword, he keeps back \n               the other knights for a moment, giving him time to see his \n               chance. He leaps onto the riderless horse and charges off \n               through the crowd. He reins in abruptly, the horse rearing. \n               He is wary of the ground before him; there could be a hidden \n               pit. But there is no time to think. Knights and men on foot \n               are rushing him. He spurs forward into a gallop, the horse \n               striding mightily And its hind leg sinks into a pit, the \n               animal losing its gait. But the momentum carries the horse \n               forward, and it recovers from the stumble.\n\n               Perceval gallops away.\n\n               Morgana is enraged. She shakes Mordred by the hair.\n\n                                     MORGANA\n                         You didn't kill him! You didn't kill \n                         him!\n\n               But suddenly she begins kissing him tenderly.\n\n                                     MORGANA\n                         My dear, sweet boy...\n\n               He just stands there emotionless, the dead center of her \n               turbulent passions.\n\n               EXT. DEAD FOREST - DAY\n\n               Perceval gallops down a trail. The black-armored knights of \n               Morgana chase him.\n\n               Perceval reins into deep cover alongside the trail. The \n               pursuers thunder past and the sound of hooves recedes. \n               Perceval checks his newly found sword, slashes the air to \n               feel the weapon's balance. He re-sheathes it. He pats the \n               horse.\n\n                                     PERCEVAL\n                         We'll become good friends.\n\n               He starts off again, into the patchless forest of dead trees.\n\n               He is suddenly set upon by a wildman who, swinging a small \n               uprooted tree, knocks him off his horse. Perceval crashes to \n               the ground and before he can use his sword the wildman has \n               knocked it out of his hand.\n\n               It is Lancelot, demented, who furiously rains battering blows \n               on Perceval's armor, bellowing with rage. All that Perceval \n               can do is attempt to avoid the blows. Lancelot addresses \n               Perceval as if the young knight were Lancelot himself.\n\n                                     LANCELOT\n                         Where are you going, Lancelot, in \n                         your iron tomb? Still trying to save \n                         the world?\n                              (He hammers blows \n                              into Perceval's armor)\n                         The best... the bravest... the \n                         greatest... fool that ever lived. \n                         Now the world rots. Death is king of \n                         the earth. And it is you who make it \n                         so, Lancelot.\n\n               Before Perceval can speak, Lancelot disappears again into \n               the forest, his eyes blank, as though his encounter with the \n               young knight had never happened.\n\n               A knot of pain, Perceval pulls himself up. He tries to rise \n               into the saddle. He is too hurt to do it. He starts off on \n               foot, slowly, leading the horse.\n\n               EXT. DEAD FOREST AND STREAM - NIGHT\n\n               It is very dark and Perceval has to feel his way.\n\n               He comes to the edge of a stream. He kneels to drink, and \n               the horse drinks beside him. Then he rests back on his heels, \n               brooding, too tired to rise.\n\n               He lowers his eyes, staring into the dark water, defeated, \n               empty.\n\n               Before him in the water a long thin bar of light appears. He \n               looks at it amazed. Voices are heard singing very far away. \n               He reaches out to touch the long strip of light but his hand \n               just disturbs the water. It is a reflection. The strip grows \n               wider and the ethereal music is closer.\n\n               Perceval looks up. The strip of light is before him, \n               suspended, thirty feet above. It continues to grow wider. A \n               drawbridge is being slowly lowered, allowing a powerful light \n               to escape from within.\n\n               Perceval is terrified. In pain, he slowly rises into the \n               saddle, ready to gallop off; but fascinated, hypnotized by \n               the sight, he cannot, and he stays and watches.\n\n               The dim outline of a castle becomes visible as the drawbridge \n               is lowered across the water to the ground at his feet. At \n               the center of the blast of light coming from the castle, \n               Perceval can make out a burning chalice. The music swells to \n               a terrifying pitch, searing the forest.\n\n               EXT. ENTRANCE TO CASTLE - NIGHT\n\n               At the sight of the chalice, Perceval masters his fear. Bathed \n               in light and music, he spurs the horse forward onto the \n               drawbridge.\n\n               Once he is on it, the bridge begins to rise. Unsure of its \n               footing and blinded by the light, the horse becomes skittish, \n               and Perceval has to struggle to control it. He dismounts to \n               lead it, but the horse is terrified, rears up and jumps off \n               the bridge, which continues to rise, drawn up by unseen hands.\n\n               Perceval hesitates, then advances down the sloping drawbridge \n               into the castle courtyard. All details are bleached out by \n               the blinding light. The chalice appears suspended in space, \n               and now the figure of a man can be glimpsed standing behind \n               it.\n\n               Enchanting music from unseen singers grows and weaves. \n               Perceval looks back to see the drawbridge slowly closing, \n               trapping him inside.\n\n               He approaches the figure, his courage ebbing. Hands cupping \n               the chalice, it speaks to him.\n\n                                     FIGURE\n                         What is the secret of the chalice? \n                         Who does it serve?\n\n               Perceval doesn't understand. He glances back again. The \n               drawbridge is nearly closed. Terror seizes him.\n\n               Panicked, puzzled, baffled, he backs away. He scrambles up \n               the drawbridge desperate to reach the top before it closes. \n               He claws his way up till his hand grasps the top. He heaves \n               himself through the narrow closing slit which is about to \n               crush him. He screams, and with a final effort he wriggles \n               free and topples over crashing into the water below.\n\n               EXT. DEAD FOREST AND STREAM - NIGHT\n\n               He looks up. The drawbridge thunders shut, the last thin \n               strip of light disappearing; and now he is surrounded only \n               by the silence of the forest.\n\n               Where there was a castle, now there is darkness. Perceval \n               wades through the water. He has crossed the stream and all \n               he can see and feel are tree trunks. The castle has \n               disappeared. He is utterly defeated.\n\n                                     PERCEVAL\n                         The chalice. The secret was in my \n                         grasp. I let it slip, afraid for \n                         myself. A question was asked. I didn't \n                         understand. I didn't try. I failed...\n\n                                                                  FADE OUT:\n\n               A LEGEND APPEARS:\n\n               \"Nine years passed.\"\n\n               FADE IN:\n\n               INT. CAVE BENEATH CAMELOT.\n\n               Dripping water is steadily encrusting the crystal with \n               limestone.\n\n               INT. HALL OF THE ROUND TABLE, CAMELOT - DAY\n\n               Dead knights lay on biers. The once glorious seat of power \n               is falling into decay. Few are in attendance around the table. \n               Agitated, Kay enters and goes to Arthur, who is worn and \n               haggard, and aged.\n\n                                     KAY\n                         Your son Mordred is at the gate.\n\n               Arthur comes alive.\n\n                                     ARTHUR\n                         At last...\n\n                                     KAY\n                         Don't recognize him. You were trapped \n                         by Morgana's sorcery.\n\n                                     ARTHUR\n                              (staring off)\n                         ...Gawain and Perceval, Bors and \n                         Bohort, Caradoc and Ector, and all \n                         the others--lost to me. Only the \n                         echo of their voices remains in this \n                         empty hall. All I have left is the \n                         memory of their fellowship. Echoes \n                         and memories. I am a ghost of the \n                         King that once was...\n                              (he turns to Kay and \n                              with sudden harshness)\n                         ...Mordred is real, alive, my own \n                         flesh and blood. I will see him, I \n                         must.\n\n               EXT. GATE, INSIDE AND OUTSIDE CAMELOT - DAY\n\n               The drawbridge lowers slowly, and Arthur moves away from Kay \n               and the other knights, and advances across it.\n\n               Rooks wheel over the dead trees of the forest that surrounds \n               Camelot. A group of armed men waits at the edge of the forest. \n               One steps forward, a huge knight in black armor, the metal \n               defining and exaggerating the powerful musculature of his \n               body. He is Mordred, a young man of eighteen, and of \n               extraordinary beauty. A page follows ten steps behind him \n               bearing an enormous spear, its points hooded. Arthur stops \n               at the edge of the drawbridge, the huge knight a few steps \n               from him. Kay, ready for anything, moves halfway across the \n               drawbridge.\n\n               Mordred kneels on one knee.\n\n                                     MORDRED\n                         Father...\n\n                                     ARTHUR\n                         Rise, Mordred.\n\n                                     MORDRED\n                         I have come to claim what is mine, \n                         Father.\n\n                                     ARTHUR\n                         I recognize you only as my son, no \n                         more.\n\n                                     MORDRED\n                              (his tone is scathing)\n                         And you are the great King? The lords \n                         have rebelled. Invaders attack the \n                         coasts. Crops don't grow. There is \n                         nothing but plague and hunger in the \n                         land. Only I am feared. I will be \n                         king. You may have lost Excalibur, \n                         but I have found my own weapon of \n                         power. There.\n\n               He points to the huge lance. The page pulls a string and the \n               hood drops, revealing a diabolically sharp spear tip, its \n               metal glinting menacingly.\n\n                                     MORDRED\n                         The very spear that pierced the side \n                         of Christ as he died on the cross.\n\n                                     ARTHUR\n                         Your mother told you that?\n\n               Mordred is thrown off by the doubt Arthur has cast. Arthur \n               looks upon his son, desperately trying to read him.\n\n                                     ARTHUR\n                         I cannot offer you the land, only my \n                         love...\n\n                                     MORDRED\n                         And I offer only this, Father. To \n                         commit with passion and pleasure all \n                         the evils that you failed to commit, \n                         as man and king.\n\n               Arthur goes forward to embrace his son, a desperate attempt. \n               Mordred recoils.\n\n                                     MORDRED\n                         We will embrace only in battle. \n                         Father, and I will touch you only \n                         with the blade of my spear.\n\n               Arthur is on the verge of tears.\n\n                                     MORDRED\n                         I will muster a great force of \n                         knights, and I will return to fight \n                         for what is mine.\n\n                                     ARTHUR\n                         So be it.\n\n               He turns and re-enters the castle, the drawbridge pulled up \n               immediately behind him. He is hunched over, broken.\n\n               EXT. BARREN LAND - EVENING\n\n               Asleep in the saddle, Perceval rides across burnt and \n               smoldering fields. The horse walks aimlessly; it is the same \n               animal, mangy and old. A hoard of children in filthy rags \n               closes in on him, begging, pulling at the horse's trappings. \n               He bolts awake and reins away. His eyes are red and feverish.\n\n               Wild hope grips him when he sees a glinting light by a \n               farmhouse. He spurs the horse forward into a gallop.\n\n               EXT. FARM - EVENING\n\n               He leaps from the saddle and a terrified woman backs away. \n               Perceval plunges his hand into the source of light. It is \n               nothing but the reflection of the dying sun in a bucketful \n               of water. Perceval covers his face.\n\n                                     PERCEVAL\n                         Illusions. I will never find it \n                         again... I am sorry, woman, that I \n                         frightened you.\n\n               Peasants have emerged, surrounding him, and they hold axes \n               and pitchforks.\n\n                                     PERCEVAL\n                         Good woman, do you have any food? \n                         Some water?...\n\n                                     PEASANT\n                         The little we had, we gave to \n                         Mordred's knights. He has taken this \n                         land. Tell the King that now we must \n                         look to Mordred.\n\n                                     SECOND PEASANT\n                         But we will give you some water...\n\n               At least ten peasants encircle Perceval and he is too \n               exhausted to put up a fight. They grab him and carry him \n               away. Other peasants pull his horse to the ground, and one \n               raises and ax to kill it.\n\n               EXT. STREAM, BARREN LAND - EVENING\n\n               They throw Perceval down an escarpment and he rolls into the \n               fast-moving water. He is swept downstream and thrown \n               ferociously against the rocks in the stream bed, crying out \n               in pain.\n\n               EXT. RIVER AND UNDERWATER - EVENING\n\n               The water is deeper and Perceval is dragged under by the \n               weight of his armor. He struggles desperately to shed it, \n               half drowning.\n\n               Exhausted, he pulls himself up onto the muddy shore beside a \n               rotting sheep carcass, and around him, the daylight dies.\n\n               EXT. RIVER - NIGHT\n\n               Ragged and bruised, lifeless, he stares into space.\n\n                                     PERCEVAL\n                         I have lost my horse, my armor, my \n                         sword. I have lost my way. I have \n                         lost my strength. I have lost \n                         everything... I will not lose hope.\n\n               A light bursting through the trees shines on the mud, \n               wordless, harmonies sound somewhere in the forest. Perceval \n               sets off toward the source.\n\n               The burning light blasts into his face but he doesn't flinch. \n               The chorus builds in power. Before him, a drawbridge lowers.\n\n               EXT. CASTLE GATE - NIGHT\n\n               He steps onto the bridge and walks in. He crosses the \n               courtyard as the drawbridge closes behind him. All details \n               of the castle are bleached out by the searing light.\n\n               EXT. CASTLE GATE - NIGHT\n\n               He steps onto the bridge and walks in. He crosses the \n               courtyard as the drawbridge closes behind him. All details \n               of the castle are bleached out by the searing light.\n\n               INT. CASTLE, VARIOUS\n\n               Heading for the source of the light he ascends what seem to \n               be a staircase. He enters a hall where the chalice stands \n               suspended, burning with light, and the mysterious music swirls \n               and grows.\n\n               Perceval approaches the diaphanous and featureless Figure \n               who stands over the chalice.\n\n                                     FIGURE\n                         Who does it serve?\n\n                                     PERCEVAL\n                         You, my lord.\n\n                                     FIGURE\n                         I have waited long for you. Once you \n                         almost saw, but fear blinded you. \n                         Why am I served from the chalice?\n\n                                     PERCEVAL\n                         Because you and the land are one.\n\n                                     FIGURE\n                         I am wasting away and I cannot die. \n                         And I cannot live.\n\n                                     PERCEVAL\n                         You and the land are one. Drink from \n                         the chalice. You will be reborn and \n                         the land with you.\n\n               Perceval cups his hands around the chalice to lift it. But \n               they close on nothing, and he draws back. The Figure's hands, \n               although insubstantial, grasp Perceval's and appear to hold \n               his hands around the cup.\n\n                                     FIGURE\n                         But who am I?\n\n               Perceval begins to kneel.\n\n                                     PERCEVAL\n                         You are my lord and King. You are \n                         Arthur.\n\n               The blinding light vanishes, the music drifts away.\n\n               INT. HALL OF THE ROUND TABLE - NIGHT\n\n               Perceval falls to his knees before Arthur and he holds the \n               chalice, now whole again, up to the King. It fills with blood \n               from within and Arthur takes it from Perceval. He drinks. \n               And having done so, he seems to become younger and to grow \n               in strength.\n\n                                     ARTHUR\n                         I didn't know how empty was my soul \n                         until it was filled.\n\n               Sir Kay stands by the vast fireplace where a small fire burns, \n               and only now looks up and is aware of Perceval.\n\n                                     KAY\n                         Perceval, you have returned!\n\n                                     ARTHUR\n                         Ready my knights for battle; they \n                         will ride with their King once more. \n                         I have lived through others far too \n                         long! Lancelot carried my honor and \n                         Guenevere my guilt. My knights have \n                         fought my causes. Mordred carries my \n                         sins. Now, at last, I will rule.\n\n               EXT. WOODS AND FIELDS - NIGHT\n\n               Arthur at the head of a small force of knights, their armor \n               shining beneath the moon, gallops through the land. Where \n               hooves thunder, the ground becomes alive with sprouts and \n               tendrils, and bare trees start to bud, and grasses to blossom, \n               the power of Nature exploding into life.\n\n               INT. CONVENT - DAWN\n\n               An old nun approaches the doors, upon which someone is \n               pounding loudly. She opens the peephole. It is Arthur.\n\n                                     NUN\n                         Go away. No man is allowed beyond \n                         these doors.\n\n                                     ARTHUR\n                         I am Arthur.\n\n               The old nun is amazed and starts pushing open the many bolts, \n               mumbling and agitated.\n\n               INT. CONVENT COURTYARD - DAWN\n\n               She leads the King, his footsteps ringing in the silent \n               cloister, past the doors to the cells. His armor is wet with \n               dew and it shines with a dull and deep luster. Nuns whisper \n               at his transit. She opens the door to a cell and Arthur steps \n               inside.\n\n               INT. CELL - DAWN\n\n               Candles flicker on a small altar before which a nun is \n               praying. She turns to see who has entered. It is Guenevere, \n               older, thin with self-denial, all the more beautiful. She \n               looks up at the majestic figure who stands before her. She \n               nearly swoons. He helps her to her feet, and words rush from \n               deep within him.\n\n                                     ARTHUR\n                         Guenevere, accept my forgiveness, \n                         and put your heart to rest. We have \n                         suffered to long. I have always loved \n                         you, and I still love you.\n\n               She weeps.\n\n                                     GUENEVERE\n                         I loved you much, as King, and \n                         sometimes as husband, but one cannot \n                         gaze too long at the sun in the sky.\n\n                                     ARTHUR\n                         Forgive me, my wife, if you can. I \n                         was not born to live a man's life, \n                         but to be the stuff of future memory. \n                         The fellowship was a brief beginning, \n                         a fair time that cannot be forgotten; \n                         and because it will not be forgotten, \n                         that fair time may come again. Now \n                         once more I must ride with my knights \n                         to defend what was, and the dream of \n                         what could be.\n\n                                     GUENEVERE\n                         I have kept it.\n\n               She draws back the covers of her pallet, and there is \n               Excalibur. Arthur is overwhelmed by emotion; he can barely \n               speak\n\n                                     ARTHUR\n                         I never dared to hope all these years \n                         that it was in your keeping.\n\n               He kneels before her and kisses her thigh. She gazes off, \n               remembering the life of long ago. He rises and looks off \n               into her eyes, unable to find the words; he finally does.\n\n                                     ARTHUR\n                         I have often thought that in the \n                         hereafter of our lives, when I owe \n                         no more to the future and can be \n                         just a man, that we may meet, and \n                         you will come to me and claim me as \n                         yours, and know that I am your \n                         husband. It is a dream I have...\n\n               He takes Excalibur by the hilt and exits.\n\n               INT. CONVENT COURTYARD - DAWN\n\n               The nuns scatter before him in awe and terror. He strides \n               forward, Excalibur in hand. He stops and tests its balance, \n               and he draws force from it.\n\n                                     ARTHUR\n                         Guenevere...\n\n               EXT. WOODS - DAY\n\n               Excalibur gleams in the sunlight. Arthur holds it high, at \n               the head of a small force of knights under the banner of the \n               Dragons. Kay and Perceval ride at his side. Plumed helmets, \n               shields blazing with armorial colors, pennants flying in the \n               clean wind from their lances; it is a brave sight. The trees \n               are in blossom and dandelion fluff billows up at their \n               passage.\n\n               EXT. PIT, MOORS - DAY\n\n               Arthur's group comes to a halt. Two knights and a few squires \n               galloping from the opposite direction rein in before the \n               King. The knights draw their swords in homage, and the older \n               one addresses Arthur.\n\n                                     KNIGHT\n                         It is only me and my son. All other \n                         knights of the dukedom have rallied \n                         to Mordred.\n\n               Arthur smiles hiding the hurt. He points to an open pit, a \n               huge devastation.\n\n                                     ARTHUR\n                         What horror is that?\n\n                                     KNIGHT\n                         Mordred, sir. He digs for precious \n                         metals, with which he buys the loyalty \n                         of men at arms, binding them to his \n                         side.\n\n               EXT. THE MOORS - ARTHUR'S WAR CAMP - LATE EVENING\n\n               It is a clear night and the sky blazes with stars. A crescent \n               moon casts its silvery light upon Arthur, who wanders from \n               his camp alone.\n\n               EXT. STONEHENGE, THE MOORS - LATE EVENING\n\n               He stops in the ancient circle of Druidic stones.\n\n                                     ARTHUR\n                         I am outnumbered ten to one by \n                         Mordred's forces. Merlin, I need you \n                         at my side as you were once, my \n                         friend, to give me courage. There \n                         are no war tricks that will fool \n                         Mordred. He was weaned on blood.\n\n               He falls on his knees in front of the stone, tired, between \n               thinking and dreaming, and he bangs his mailed fist against \n               it.\n\n                                     ARTHUR\n                         More than I ever did, I need you \n                         now. Where are you, Merlin? Is it \n                         true that Morgana has trapped you?\n\n               INT. CAVE BELOW CAMELOT\n\n               The veins of crystal glow darkly, and the hammering of \n               Arthur's fist upon the stone is dimly echoed here. In the \n               red crystal, fragments of Merlin can be glimpsed, trapped, \n               frozen.\n\n               EXT. STONEHENGE - LATE EVENING\n\n               Arthur slips off into sleep. The stones around him distort. \n               He speaks softly, but then though the words continue, his \n               lips are closed.\n\n                                     ARTHUR\n                         ...If only you could be at my side, \n                         Merlin, to see me wield Excalibur \n                         once more...\n\n               INT. CAVE BELOW CAMELOT\n\n               The crystal is cracking, shards falling to the cave floor.\n\n               EXT. STONEHENGE - NIGHT\n\n               Arthur is still on his knees, and he sits back, looking up. \n               But the atmosphere is different, within a dream, and the \n               stones of the henge loom larger over him now.\n\n                                     ARTHUR\n                         What is this place? It is rumored \n                         Merlin, that you drew your power \n                         from these circles...\n\n               A hand ruffles the King's hair. He turns, and is face to \n               face with Merlin, standing over him. Arthur looks at him \n               without surprise, as though the intervening years never were. \n               Merlin begins to laugh his hideous giggle. Arthur rises.\n\n                                     ARTHUR\n                         Quiet. You'll wake the men, and they \n                         must fight tomorrow for their very \n                         lives.\n\n                                     MERLIN\n                         I know. I have heard noises and echoes \n                         through the stones...\n\n                                     ARTHUR\n                         What is this place, Merlin?\n\n                                     MERLIN\n                         It is like a tree. The roots of the \n                         stones spread out across the land \n                         and they draw on the thoughts and \n                         actions of men. Like sap those human \n                         matters course through the stones \n                         feeding the stars that are the leaves \n                         of the tree. And the stars whisper \n                         back to men the future course of \n                         events.\n                              (becoming passionate)\n                         But the earth is being torn apart, \n                         its metals stolen, and the balance \n                         is broken and the lines of power no \n                         longer converge. In fact, I nearly \n                         didn't make it in one piece.\n\n               He limps affectedly and stretches with exaggerated pain.\n\n                                     MERLIN\n                         But, I'm here.\n\n                                     ARTHUR\n                         Where have you been these many years? \n                         Is it true that Morgana--\n\n                                     MERLIN\n                         --Stories... You brought me back. \n                         Your love brought me back. Back to \n                         where you are now, in the land of \n                         dreams...\n\n                                     ARTHUR\n                         Is this a dream? Tell me, Merlin!\n\n               Merlin smiles, turns and leaves, heading for Arthur's camp, \n               giggling. Arthur starts off after him and awakens from the \n               dream when he walks into one of the stones. It takes him a \n               moment to realize that Merlin has vanished.\n\n                                     ARTHUR\n                         Merlin?!\n\n               He hurries away toward the camp.\n\n               INT. KAY'S TENT, ARTHUR'S WAR CAMP - NIGHT\n\n               Arthur shakes Kay awake, and as the faithful knight comes \n               out of a deep sleep, he clutches Arthur's arm.\n\n                                     KAY\n                         Merlin, will I live...?\n                              (he shakes away the \n                              dream)\n                         ...I was dreaming...\n\n                                     ARTHUR\n                         Of Merlin?\n\n                                     KAY\n                         Yes. He spoke to me. He said I would \n                         fight bravely tomorrow. I have never \n                         dreamed of Merlin before.\n\n                                     ARTHUR\n                         I dreamed of him too... Merlin lives! \n                         He lives in our dreams now, in that \n                         dark and shadowy place that is as \n                         strong and real as this more solid \n                         one. He speaks to us from there.\n\n               EXT. MORDRED'S WAR CAMP - NIGHT\n\n               Cape flowing, Merlin sweeps between Mordred's war tents, and \n               in the logic of dreams, unseen by the guards. He passes a \n               tent where the huge shadow of Mordred is thrown on the canvas, \n               as he sharpens the blade of a fearsome spear.\n\n               He enters a tent.\n\n               INT. MORGANA'S TENT - NIGHT\n\n               She is stunningly beautiful in her sleep. Merlin leans over \n               her lovely body, kisses her softly on the lips, and waits \n               for her to awaken.\n\n                                     MERLIN\n                         I have returned, enchantress. You \n                         are beautiful, magnificent. Have you \n                         used up all the magic you stole from \n                         me to keep yourself young? Have you \n                         any magic left to do battle with \n                         Merlin?\n\n               INT. TENT - MORGANA'S DREAM\n\n               She rises from her sleeping body.\n\n                                     MORGANA\n                         You provoke me, Merlin.\n\n                                     MERLIN\n                         What's behind that beauty? A wizened, \n                         cold-hearted snake.\n\n               Merlin steps back, grandiose and melodramatic.\n\n                                     MERLIN\n                         You are a snake about to strike!\n\n               He raises his staff.\n\n                                     MERLIN\n                         And I am the staff that drives the \n                         snake back.\n\n               He lowers the staff with dreamlike slowness and she slinks \n               right up to him.\n\n                                     MORGANA\n                         Burning with the fire of desire, I \n                         am the flames that consume the staff \n                         to ashes.\n\n               She winds her fluttering hands around the staff, and the \n               shadows they cast upon the tent give the illusion of licking \n               flames.\n\n                                     MERLIN\n                         I am the cloudburst that quenches \n                         the flames.\n\n                                     MORGANA\n                         I am the desert, where water \n                         disappears--\n\n                                     MERLIN\n                         --I am the sea, which covers the \n                         desert forever under its weight.\n\n                                     MORGANA\n                         --I am the fog and mists that rise \n                         up from the sea, escaping...\n\n               She laughs at her cleverness.\n\n                                     MERLIN\n                         Fog and mist! You couldn't be that. \n                         You don't have enough magic.\n\n               INT. MORGANA'S TENT - NIGHT\n\n               Morgana tosses and mutters in her tormented dream.\n\n                                     MORGANA\n                         ...I have the desire and I have the \n                         magic...\n\n               INT. TENT - MORGANA'S DREAM\n\n               Merlin, huge, magnetic, enfolds Morgana in his cape.\n\n                                     MERLIN\n                         You are mine at last. I am the sea \n                         and you will never escape me. Fog \n                         and Mist...!?\n\n               And he laughs at her, suffocating her. Morgana begins chanting \n               the charm of Making, desperate--\n\n               INT. MORGANA'S TENT - NIGHT\n\n               --and she finishes uttering it in her sleep. Her eyes spring \n               open, and vapors issue from her gaping mouth. She screams \n               and the fog gushes out filling the tent.\n\n               EXT. MORGANA'S TENT, MORDRED'S WAR CAMP - NIGHT\n\n               Fog billows out of the tent, spreading through the camp.\n\n               INT. MORGANA'S TENT - NIGHT\n\n                                     LIEUTENANT\n                         A fog is rising, sir.\n\n                                     MORDRED\n                         That cannot be.\n\n               He rises and goes out with the lieutenant.\n\n               EXT. MORDRED'S WAR CAMP - NIGHT\n\n               It is fogbound, the campfires yellow smudges within it.\n\n                                     MORDRED\n                              (to the lieutenant)\n                         My mother has a sense for such things. \n                         She said there would be no fog.\n\n               Mordred enters his mother's tent.\n\n               INT. MORGANA'S TENT - NIGHT\n\n               Mordred enters.\n\n                                     MORDRED\n                         ...Mother?\n\n               Morgana, withered, old, lies dead in the bed, wisps of smoke \n               rising from within her ruptured body.\n\n               EXT. MOORS BY THE SEA - FOG - DAWN\n\n               Arthur, with Kay and Perceval, canters through the white \n               fog. They are flanked by a phalanx of knights in silver armor.\n\n                                     ARTHUR\n                         Kay, you will lead the attack. \n                         Perceval, you will stay with me.\n\n               Kay draws his sword in salute, elated.\n\n                                     ARTHUR\n                         Be cautious, my brother.\n\n               He spurs forward, while Arthur reins to a halt, watching him \n               disappear. Perceval and a few knights stay behind and surround \n               the King.\n\n                                     ARTHUR\n                         In this battle there is one thing I \n                         must do, that no one else can. Find \n                         Mordred and kill him.\n\n               Ahead, the horrible din of joined battle.\n\n               In the swirling fog, clash of arms follows clash of arms. \n               There is confusion, for each knight is unable to see if he \n               is fighting friend or foe until they are upon each other.\n\n               The battle becomes a series of vicious duels, a knight in \n               silver armor against a knight in black-burnished armor, just \n               glimpsed in the fog that is alive with the clang of sword on \n               shield, the pounding of hooves, the cries of the dying.\n\n               Squires drag away their wounded knights, their young faces \n               pale at the sight of the carnage.\n\n               Kay is unhorsed but picks himself up and mounts a riderless \n               horse, rejoining the combat although he is bleeding.\n\n               EXT. MOORS BY THE SEA - FOG - DAY\n\n               It is full day, and the fog blinds with its painful glare. \n               Arthur with Perceval at his side rides through the fog, \n               searching. Perceval takes up a challenge against the King. \n               He unhorses this opponent, piercing him with his lance. He \n               returns to the King's side.\n\n                                     PERCEVAL\n                         There are too many on Mordred's side. \n                         We cannot hold out much longer.\n\n               Kay is glimpsed fighting on foot, hurt, barely holding his \n               own, but then the sight is hidden in the fog.\n\n               Kay overcomes his opponent and stops to catch his breath. He \n               is amazed by what he sees. A knight, in old, battle-scarred \n               armor whose pieces don't match, cuts down the knights in \n               black in foray after foray, wheeling and turning in a \n               brilliant and ruthless spectacle of martial arts. He fights \n               without a shield, a lance in his left hand and sword in his \n               right.\n\n               Kay moves away in search of Arthur.\n\n               Arthur and Perceval watch the lone knight meting out death \n               with such terrible beauty, weaving in and out of the fog.\n\n                                     KAY\n                         He can be no other.\n\n                                     ARTHUR\n                         Lancelot?... It is Lancelot!\n\n               He spurs his horse forward to join him, but Perceval is quick \n               to stop him.\n\n                                     PERCEVAL\n                         No, my lord. We seek Mordred.\n\n                                     KAY\n                         I will join him.\n\n               Kay rises onto a fresh horse and gallops away.\n\n               EXT. MOORS BY THE SEA - FOG - LATE DAY\n\n               Arthur and Perceval ride alone, the accompanying knights \n               gone, the dying and the dead and the crazed horses all around \n               them.\n\n               Squires are carrying Kay upon his shield. He is dead. Arthur \n               leaps to the ground and reaches out to touch his face, and \n               closes his eyes. He stifles his tears.\n\n                                     ARTHUR\n                         Has anyone seen Lancelot?\n\n                                     SQUIRE\n                         He lies over there, sir.\n\n               Arthur rushes off, Perceval following on horseback.\n\n               Lancelot is mortally wounded, blood flowing from his abdomen, \n               his eyes open but his gaze dead. Arthur falls to his side.\n\n                                     ARTHUR\n                         Squire! Here!\n\n               But there is no one now except the dead and wounded, and \n               Perceval, who dismounts to watch over the King, sword drawn. \n               Desperate, Arthur stops the wound with his hand. Lancelot's \n               eyes are sightless, but tears spill from them.\n\n                                     LANCELOT\n                         Arthur.\n\n                                     ARTHUR\n                         Lancelot, I will save you... Don't \n                         die.\n\n               He tears off a piece of his tunic and staunches the wound \n               with it.\n\n                                     LANCELOT\n                         My salvation is to die a Knight of \n                         the Round Table.\n\n                                     ARTHUR\n                         You are that and much more. You are \n                         its greatest knight, you are what is \n                         best in men. Now we will be together--\n\n                                     LANCELOT\n                         --It is the old wound, that has been \n                         opened. I have always known it would \n                         be the gateway to my death, for it \n                         has never healed. Let my heart do \n                         its job, my King, and pump me empty...\n\n               Arthur takes Lancelot in his arms and rests his lips against \n               the knight's brow.\n\n                                     LANCELOT\n                              (a death whisper)\n                         Guenevere, has she come to you, is \n                         she Queen again?\n\n               He lies, closing his eyes, unable to look at Lancelot.\n\n                                     ARTHUR\n                         She is, Lancelot.\n\n               A boyish smile settles over the features of Lancelot's face, \n               and he dies. Arthur holds him to his breast, his eyes shut \n               tight.\n\n               A strong wind rises. Perceval kneels beside Arthur.\n\n                                     PERCEVAL\n                         The fog is lifting. Only we remain \n                         alive.\n\n               EXT. MOORS BY THE SEA - EVENING\n\n               Arthur and Perceval rise, and as far as they can see across \n               the green hills that roll down to the sea lies the aftermath \n               of the massacre. Hacked bodies, abandoned armor, steaming \n               horse carcasses, everything still. The murmur of the dying \n               is carried on the wind to the soft roar of the sea. The \n               squires have fled the scene of horror.\n\n                                     ARTHUR\n                         But for Mordred. Where is Mordred?\n\n               Elsewhere on the battlefield, Mordred searches the dead, \n               accompanied only by his lieutenant, who turns over the bodies \n               of Arthur's knights.\n\n                                     MORDRED\n                         Where is Arthur?\n\n               One of Arthur's knights reaches out blindly for help. Mordred \n               crushes his skull underfoot. The shaft of his huge lance is \n               caked with blood, as are his hands.\n\n               Arthur and Perceval see Mordred and his lieutenant, and the \n               King restrains Perceval from going forward.\n\n                                     ARTHUR\n                         No, Perceval. Now it is time for me \n                         to raise my sword.\n                              (he bellows out)\n                         Mordred, prepare to meet your death.\n\n               Shield on his left arm, and Excalibur in his right, he starts \n               toward Mordred.\n\n                                     MORDRED\n                         I wait for you, Father.\n\n               Mordred advances forward, the huge spear in both hands and \n               parallel to the ground.\n\n               Arthur goes straight for him, shield ready to receive the \n               blow. Mordred keeps walking, his arms now tensed back and \n               ready to strike.\n\n               Once they are within weapon's reach of each other, Mordred \n               dashes forward and thrusts the spear. It glances off Arthur's \n               shield, slides under his hauberk and penetrates the King's \n               body, and so powerful was the blow that the blade pierces \n               him right through.\n\n               Mortally wounded, Arthur's scream of pain becomes a horrible \n               war cry, and he drives himself forward with all the strength \n               he has along the spear shaft almost to Mordred's hands. \n               Mordred is knocked back and to the ground and Arthur presses \n               down on him, the butt of the spear pinning Mordred. Arthur \n               lifts Excalibur. Mordred attempts to free himself, as the \n               blade of Excalibur descends upon him and cuts through metal, \n               flesh and bone.\n\n               Mordred's head falls to the ground, rolling away.\n\n               Mordred's lieutenant flees. Perceval races to Arthur's side, \n               and supports the King who has fallen on his knees. Arthur \n               speaks through the pain:\n\n                                     ARTHUR\n                         Draw the spear from me. Do it.\n\n               Perceval holds the King tight to himself with one arm, while \n               with the other he draws the shaft through and out of Arthur's \n               body. Arthur sags but doesn't fall. Perceval begins to remove \n               his armor to get at the gaping wounds. The King speaks slowly, \n               softly, from outside his own pain-wracked body.\n\n                                     ARTHUR\n                         There is one thing left to do... \n                         Excalibur... And you must do it, \n                         Perceval. Leave my wounds, I command \n                         you.\n\n                                     PERCEVAL\n                         I cannot--\n\n                                     ARTHUR\n                         --Take Excalibur. Find a pool of \n                         calm water and throw the sword into \n                         it.\n\n               Perceval, stunned by the command, doesn't move.\n\n                                     ARTHUR\n                         Obey me, Perceval. You must act for \n                         me. It is my last order as your King. \n                         Do it, and be back!\n\n               Perceval picks up the sword, mounts his horse and rides \n               inland. Arthur watches him go, struggling with the pain, \n               still kneeling, and then his head falls to his chest.\n\n               EXT. POOL, MOORS - EVENING\n\n               Perceval steps through tall reeds to the edge of a pool. He \n               cannot bring himself to throw Excalibur into the water. He \n               examines the blade, and it is haloed with a faint iridescence.\n\n                                     PERCEVAL\n                         It is too precious a thing. I can't...\n\n               He backs away from the water and hides the sword in the reeds, \n               and starts back.\n\n               EXT. MOORS BY THE SEA - EVENING\n\n               Perceval dismounts, rushing to kneel at the King's side. \n               Arthur looks up, calm and intense.\n\n                                     ARTHUR\n                         When you threw it in, what did you \n                         see?\n\n                                     PERCEVAL\n                         ...I saw nothing.\n\n               The King looks at him with piercing power. Perceval blurts \n               it out.\n\n                                     PERCEVAL\n                         My King, I couldn't do it. Excalibur \n                         cannot be lost. Other men--\n\n                                     ARTHUR\n                         --By itself it is only a piece of \n                         steel. Its power comes from he who \n                         wields it. For now there is no one. \n                         Do as I have ordered!\n\n               Perceval leaves once more. The daylight is failing, the sun \n               is near the horizon over the sea, bursting through clouds.\n\n               EXT. POOL - EVENING\n\n               He picks up the sword and looks at it for a long time. \n               Finally, with great misgiving, he hurls it into the middle \n               of the pool. As Excalibur is about to touch the water a \n               woman's hand reaches and grasps it by the hilt. It holds the \n               sword aloft for a moment and then draws it under.\n\n               Perceval backs away from the pool stunned by the marvel.\n\n               EXT. MOORS BY THE SEA - SUNSET\n\n               Perceval returns to the King, terribly excited, shouting \n               from his horse:\n\n                                     PERCEVAL\n                         Arthur!\n\n               But Arthur isn't there. Perceval looks around him, he doesn't \n               understand. He sees a trail of blood. He spurs his horse and \n               follows the trail down to the sea.\n\n               EXT. BEACH - SUNSET THEN NIGHT\n\n               There is a trail of blood and prints upon the sand left by a \n               man crawling.\n\n               Perceval follows them toward the sea. He looks around, \n               searching, terribly distraught.\n\n               Where the blood and prints cease, there are many footprints \n               coming from and returning into the sea. Perceval looks out \n               across the waves.\n\n               He sees a sailing vessel rising on the swell. On its deck he \n               can make out the distant figure of Arthur, lying surrounded \n               by women, their gossamer robes rippling in the wind. The sun \n               hovers on the horizon and the ship is heading for it.\n\n               He gallops into the waves until his horse will go no further, \n               calling out with all his strength, a futile attempt:\n\n                                     PERCEVAL\n                         Arthur! Will you return?\n\n               The sun slips below the horizon. Night is falling, and the \n               wind whips the wavecrests. He turns from the sea and wades \n               back.\n\n                                     PERCEVAL\n                         All the knights of the Round Table \n                         are dead. Excalibur is returned. \n                         Arthur is gone. Maybe he lives, maybe \n                         he will return...\n\n               He stops at the edge of the water. In the uncertain light \n               sky and sea become one. He draws the chalice out of a pouch \n               on his saddle, and he holds it up before him.\n\n                                     PERCEVAL\n                         Only I remain, and this...\n\n               The wind swirls and whistles mysteriously in the hollow of \n               the cup. Music grand and melancholic grows from it. The \n               chalice, etched in starlight, is the last thing that is taken \n               from sight in the enfolding darkness.\n\n                                                                  FADE OUT:\n\n\n                                         THE END\n\n\n\n\n\n\nExcalibur\nWriters :   Rospo Pallenberg  John Boorman\nGenres :   Adventure  Drama  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "The sorcerer Merlin retrieves Excalibur from the Lady of the Lake for Uther Pendragon, who secures a brief alliance with Gorlois, the Duke of Cornwall. Uther's lust for Cornwall's wife Igrayne soon ruins the truce, and Merlin agrees to help Uther to seduce Igrayne on the condition that he gives Merlin whatever results from his lust. Merlin transforms Uther into Cornwall's likeness with the Charm of Making. Cornwall's daughter Morgana senses her father's mortal injury during his assault on Uther's camp and, while Igrayne is fooled by the disguise and Uther impregnates her, Morgana sees through it, watching Uther as Cornwall dies in battle. Nine months later, Merlin takes Uther's son Arthur. Uther pursues but is mortally wounded by Gorlois' knights. Uther thrusts Excalibur into a stone, and Merlin proclaims, \"He who draws the sword from the stone, he shall be king.\"\nYears later Sir Ector and his sons, Kay and Arthur, attend a jousting tournament. Sir Leondegrance wins the chance to try pulling Excalibur from the stone, but fails. Kay's sword is later stolen, and Arthur pulls Excalibur from the stone while trying to replace the stolen sword. Word spreads, and Merlin announces to the crowd that Arthur is Uther's son and hence the rightful ruler. Leondegrance immediately proclaims his support for the new king, but not all are willing to accept. While the others argue, Merlin and Arthur enter the forest, where he tells Arthur that he is the rightful king, and that the king and the land are one. Overwhelmed, Arthur falls into a long sleep. When he wakes, Arthur goes to aid Leondegrance, whose castle is under siege by Arthur's enemies, led by Sir Uryens. During the battle, Arthur defeats Uryens and then demands Uryens knight him, handing him Excalibur to do so. Uryens is tempted to kill him but is deeply moved by Arthur's display of faith and decides to knight him (Merlin is stunned by something he did not foresee). Uryens falls to his knees to declare his loyalty, which leads the others to follow suit. Arthur meets Leondegrance's daughter Guenevere soon afterwards and is smitten but Merlin foresees trouble.\nYears later, the undefeated knight Lancelot blocks a bridge and will not move until he is defeated in single combat, seeking a king worthy of his sword. Lancelot defeats Arthur and his knights, so Arthur summons Excalibur's magic and defeats Lancelot but breaks Excalibur. Arthur is ashamed of abusing the sword's power to serve his own vanity and throws the sword's remains into the lake, while admitting his mistake. The Lady of the Lake offers a restored Excalibur to the king, Lancelot is revived and Arthur and his knights unify the land. Arthur creates the Round Table, builds Camelot and marries Guenevere; Lancelot confesses that he has fallen in love with her too. Arthur's half-sister Morgana, a budding sorceress and still bitter towards Arthur, becomes apprenticed to Merlin in hopes of learning the Charm of Making from him.\nLancelot stays away from the Round Table to avoid Guenevere. He meets Perceval, a peasant boy and takes him to Camelot to become a squire. Sir Gawain, under Morgana's influence, accuses Guenevere of driving Lancelot away, \"driven from us by a woman's desire\", forcing Lancelot to duel with Gawain to defend his and Guenevere's honour. The preceding night, Lancelot duels against himself in a nightmare and awakens to find himself wounded by his own sword. Arthur hastily knights Perceval when Lancelot is late to the duel but Lancelot appears just in time and defeats Gawain, while nearly dying from his wounds. Merlin heals him and he rides out to the forest to rest. Guenevere realises her feelings for Lancelot and they consummate their love in the forest; meanwhile, Merlin lures Morgana to his lair to trap her, suspecting that she is plotting against Arthur.\nArthur finds Guenevere and Lancelot asleep together. Heartbroken at their betrayal, he thrusts Excalibur into the ground between the sleeping couple. Merlin's magical link to the land impales him on the sword and Morgana seizes the opportunity to trap him in a crystal, with the Charm of Making. Morgana takes the form of Guenevere and seduces Arthur. On awakening to the sight of Excalibur, Lancelot flees in shame and Guenevere lies weeping.\nMorgana bears a son, Mordred and a curse caused by Mordred's unnatural, incestuous origin, strikes the land with famine and sickness. A broken Arthur sends his knights on a quest for the Holy Grail, in hopes of restoring the land. Many of his knights die or are bewitched by Morgana. Morgana captures Perceval, who narrowly escapes. Perceval encounters an ugly bearded old man with armour under his tattered robes, who preaches to followers that the kingdom has fallen because of \"the sin of Pride\". A shocked Perceval recognises the man as Lancelot. After Perceval fails to convince Lancelot to come to Arthur's aid, Lancelot and his followers throw Perceval into a river. Perceval has a vision of the Grail, during which he realises that Arthur and the land are one. Upon answering the riddle he gains the Grail and takes it to Arthur, who drinks from it and is revitalised, as is the land, which springs into blossom.\nArthur finds Guenevere at a convent and they reconcile. She gives him Excalibur, which she has kept safe since the day she fled. Frustrated in preparation for battle against Morgana's allies, Arthur calls to Merlin, unknowingly awakening the wizard from his enchanted slumber. Merlin and Arthur have a last conversation before Merlin vanishes. The wizard then appears to Morgana as a shadow and tricks her into uttering the Charm of Making, producing a fog from the breath of the Dragon, and exhausting her own magical powers which had kept her young. She rapidly ages and her own son kills her, repulsed by the sight of his once beautiful mother now reduced to a decrepit old crone.\nArthur and Mordred's forces meet in battle, with Arthur's army benefiting from the fog that conceals their small size. Lancelot arrives unexpectedly and turns the tide of battle, later collapsing from his old, self-inflicted wound which had never healed. Arthur and Lancelot reconcile and Lancelot dies with honour. Mordred stabs Arthur with a spear but Arthur further impales himself to get closer and kills Mordred with Excalibur. Perceval refuses to carry out Arthur's dying wish, that he throw Excalibur into a pool of calm water, reasoning that the sword is too valuable to be lost. Arthur tells him to do as he commands and reassures him that one day a new king will come and the sword will return again. Perceval throws Excalibur into the pool, where the Lady of the Lake catches it. Perceval returns to see Arthur lying on a ship, attended by three ladies clad in white, sailing into the sun toward the Isle of Avalon."}