{"title": "Extract", "full_text": "EXTRACT\n\n\n\n                                   Written by\n\n                                   Mike Judge\n\n\n\n                                                         March 2008\n                         \n\n                         \n\n                         BEGIN CREDITS:\n\n          EXT. REYNOLD'S EXTRACT BUILDING - DAY\n\n          An idyllic American factory. There's a huge, long lawn in\n          front. A Reynolds Extract sign in brick with\n          flowers/landscaping around it, sits near the entrance. We\n          see from the number of cars in the parking lot that it's a\n          company of about 50 - 75 employees.\n\n          INT. REYNOLD'S EXTRACT BUILDING - DAY\n\n          We are in a manufacturing area of an assembly-line\n          production. It's a big room full of intricate machines, huge\n          vats of different colored extract and other food flavoring\n          products, conveyor belts, bottling machines, etc. It has a\n          high ceiling with offices on the second floor that have big\n          windows overlooking this manufacturing area.\n          We PAN up to the main office.\n\n          INSIDE THE OFFICE\n          JOEL REYNOLDS, head of the company, mid-thirties, is on the\n          phone with his friend DEAN.\n          DEAN (v.o.)\n          You should come by tonight. Half\n          price well drinks while the game's\n          going.\n\n                         JOEL\n          You always give me free drinks\n          though.\n          DEAN (v.o.)\n          Oh yeah. Well come by anyway.\n\n                         JOEL\n          Yeah?... Might as well. No action\n          going on at my house, that's for\n          sure.\n          DEAN (v.o.)\n          Really? The wife out of town?\n\n                         JOEL\n          No... I just haven't been laid in\n          a month.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          2.\n          DEAN (v.o.)\n          You guys having problems or\n          something?\n\n                         JOEL\n          No. This is pretty much normal\n          these days...\n          As CREDITS continue, camera PULLS OUT, back down to the\n          manufacturing area, past a big vat of orange extract, down\n          through various stages of assembly line production, then\n          follows several bottles of orange extract moving past\n          HECTOR, a Mexican immigrant employee in his thirties. The\n          camera stops on him. Talking to Hector is STEP, a short,\n          beady-eyed Charles-Manson-looking guy with a beard and\n          mustache. Step is in his forties. He makes everything he\n          says sound as macho and important as possible.\n\n                         STEP\n          You get this job through Manpower?\n\n                         HECTOR\n          Yeah.\n\n                         STEP\n          I started here with Manpower too.\n          Started out on the line just like\n          you.\n\n                         (DEAD-SERIOUS)\n           Only I did better... 40 crates a\n          day. \n          Beat. Hector is not quite sure what he's talking about.\n          STEP continues telling his tale in such a way that the only\n          polite reaction would be one of total amazement.\n\n                         STEP (CONT'D)\n          I'm the best sorter in here.\n          That's why they made me full time\n          with benefits. I'll probably be\n          floor manager this year.\n          A FEW FEET AWAY we see RORY, a stocky indie-rock geek, with\n          too many tatoos, hair shaved on the side with a ponytail,\n          lots of bad piercings, wearing baggy shorts with lots of\n          pockets and some kind of gothy T-shirt -- a look that ought\n          to be out of style by now.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          3.\n          Rory is putting stickers on boxes with a sticker gun. He\n          flips the sticker gun around unnecessarily between each\n          application, adding a few unnecessary moves/motions, slapping\n          each box when he's done, generally making the activity look\n          like more of a skill than it actually is. He approaches Step\n          and Hector, pulling out some fliers from his many pockets.\n\n                         RORY\n          (hands them each a flier)\n          My band's playing this Friday, come\n          check us out.\n          Hector looks down at the flier. It's xeroxed with fifties\n          clip-art, cut out letters and the name of the band, \"God's\n          Cock\". Hector just looks at it confused, not knowing much\n          English, not sure what he's supposed to be doing with the\n          flier.\n          AT THE END OF THE LINE, where boxes are loaded onto pallets,\n          sits MARY, 58 years old, wearing a 15-year-old pair of acid-\n          wash jeans, and an oversized tweety-bird T-shirt, fanny pack,\n          and dayglow yellow triangle-shaped earrings. She's pear-\n          shaped with short hair. She's bitter and bossy, always\n          shaking her head at everyone. She sits on a stool with a\n          clipboard, looks over her glasses at Hector, shaking her\n          head. She talks to Gabriella, a Hispanic woman in her\n          forties.\n\n                         MARY\n          You see that... That new guy.\n          He's holding us up. It's not my\n          job to tell them to hold the line\n          either.\n\n                         GABRIELLA\n          And then Joel's gonna come yell at\n          us, cuz he's not doing his job.\n\n                         MARY\n          (folds her arms, fed up)\n          I'm just gonna sit here.\n\n                         GABRIELLA\n          You're not gonna shut it off?\n\n                         MARY\n          I'm not gonna hold the line. If\n          they're not gonna do their job, why\n          should I do mine.\n          Mary sits there, arms folded, lips pursed, refusing to pause\n          the conveyor belt.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          4.\n\n          INT. JOEL'S OFFICE - CONTINUOUS\n\n          Joel is still on the phone with Dean.\n\n                         JOEL\n          If I don't get home before about\n          8:00, she puts on the sweatpants\n          and once the sweatpants are on,\n          it's over -- I get nothing.\n          (notices something down\n\n                         BELOW)\n          Shit. I'm gonna have to call you\n          back.\n          Joel hangs up and runs downstairs.\n\n          ON THE MANUFACTURING FLOOR:\n          Boxes start to accumulate and fall off the end of the line.\n          Step sees this, runs to shut off the line, yelling at Mary.\n\n                         STEP\n          What are you doing?!\n\n                         MARY\n          What are YOU doing?!\n          (pointing at Hector)\n          What is he doing?\n          A YELLING/BICKERING MATCH breaks out between Mary, Step, Rory\n          and Gabriella. Joel runs over, shuts off the conveyor belt.\n\n                         JOEL (CONT'D)\n          All right. Now, what's the\n          problem?\n          They all erupt in more BICKERING AND FINGER POINTING.\n\n                         JOEL (CONT'D)\n          Okay! Okay, everyone settle down.\n          Now Mary. Hector here is new okay?\n          It's gonna take him a couple of\n          days, maybe his English isn't so\n          good. You gotta be patient.\n\n                         STEP\n          That's what I was tryin' to say.\n\n                         JOEL\n          And Step, if you wanna be Floor\n          Manager, this is the kind of thing\n          you're going to have to deal with.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          5.\n\n                         STEP\n\n                         (KISS-ASS)\n          Exactly.\n\n                         JOEL\n          Okay, now Step, Rory, Hector, let's\n          get this cleaned up, and get\n          rolling again. We can't afford to\n          fall behind today.\n          Joel walks away. People resume their posts. Mary starts\n          right back up with Gabriella.\n\n                         MARY\n          You see that? We always get the\n          blame.\n\n          INT. JOEL'S OFFICE - A LITTLE LATER\n\n          Joel sits in his swivel chair, looking down at the production\n          floor, shaking his head. BRIAN, Joel's second in command,\n          walks in. He's a little older than Joel, neatly trimmed\n          beard, aviator glasses, and a bit of a gut. He wears a\n          Reynold's Extract golf shirt and Khaki pants. He walks over\n          to the window, joins Joel, looking down at the employees.\n\n                         JOEL \n          Jesus... They're like a bunch of \n          goddamned children. \n\n                         BRIAN\n          Tell me about it. Sorry I missed\n          the drama; I was showing boy-genius\n          down there how to back up a\n          forklift.\n          ANGLE ON Rory, driving the forklift, handing out a flier as \n          he passes someone. \n\n                         BRIAN (CONT'D)\n          That's his whole career, driving\n          that damn forklift. You'd think\n          he'd wanna learn how.\n\n                         JOEL \n          Well, I guess he's got that band \n          he's in too... \n\n                         BRIAN\n          (disgust at the word\n\n                         \"BAND\")\n          \"Band\", ugh...\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          6.\n\n                         BRIAN (CONT'D)\n          I'll bet dollars to donuts he sucks\n          at that too. Then you got ah...\n          (tries to remember her\n          name but can't)\n          Dinkus down there...\n\n                          JOEL \n          Who, Mary? \n\n                          BRIAN\n          No, the other one -- what's-her-\n          face -- she asked me -- or rather\n          \"axed\" me -- for more personal\n          days. Just like that. I told her\n          maybe if she figures out how to\n          fill out the time sheets correctly\n          I'll give her more personal days...\n          (Off Joel's look)\n          Don't worry, she will never fill\n          out her time sheets correctly.\n          Joel looks down at the production floor. Joel's POV: \n           ANGLE ON: Mary and Step bickering. Step walks off. Mary and \n           Gabrielle shaking their heads and yapping like a couple of \n          old hens. \n\n          JOEL (O.S.)\n          Look at 'em... I am so sick of baby\n          sitting these assholes.\n          (looks at his watch)\n          I better get going...\n          Joel leaves in a hurry, mumbling something about \n          \"sweatpants.\" \n\n          INT. JOEL'S CAR - LATE AFTERNOON\n\n          Joel drives home, in a hurry, checking his dashboard clock.\n          It's an upscale neighborhood of McMansions in a town like\n          Lincoln Nebraska. He turns a corner, slows down suddenly\n          when he sees something.\n\n                         JOEL'S POV:\n          NATHAN, a middle-aged, overweight, annoying guy is going out\n          to the street to get his mail.\n\n                         JOEL\n          (to himself, praying)\n          Please go back inside... Please\n          just turn around.. .Come on...don't\n          notice me...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          7.\n          It's too late. Nathan turns, sees Joel's car and waves, then\n          crosses the street to Joel's driveway and waits to talk to\n          him.\n\n                         JOEL\n\n                         (TO HIMSELF)\n          Shit!\n          Joel pulls into his driveway as Nathan flags him down. Joel\n          begrudgingly rolls down the passenger side window so Nathan\n          can talk to him.\n\n                         NATHAN\n          Hi there Joel! Glad I caught ya...\n          Nathan settles in like he's going to be there a while,\n          leaning with his arms folded, hanging inside the car,\n          trapping Joel.\n\n                         NATHAN\n          How've ya been? I left you a\n          message last week. I don't know if\n          you got it or not.\n\n                         JOEL\n          Yeah, actually Nathan, I'm kind of\n          in a hurry here.\n\n                         NATHAN\n          Oh yeah? You been busy?\n\n                         JOEL\n          Yeah, in fact...\n          (checks his watch)\n          I should go right now actually. I\n          gotta call the office before they\n          leave.\n\n                         NATHAN\n          Well, real quick while I got ya\n          here -- what're you guys doing\n          November 17th?\n\n                         JOEL\n          Ah, I don't ah...\n          (realizes his should fake\n\n                         IT)\n          Actually we're going to be out of\n          town that weekend.\n\n                         NATHAN\n          Oh yeah? Where you going?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          8.\n\n                         JOEL\n          Ah...\n\n                         NATHAN\n          Oh, wait a minute -- I'm sorry, I\n          meant the 7th. Yeah, November 7th.\n          You'll be in town then right?\n\n                         JOEL\n\n                         (DEFEATED)\n          Ah...Yeah.\n\n                         NATHAN\n          Great. There's this dinner Leslie\n          and I are going to. It's an annual\n          thing -- we do it every year with\n          the Rotary Club -- it's for\n          charity. It's just a whole lot of\n          fun, and we wanted to invite you\n          and Suzie to be our guests at our\n          table. It's--\n\n                         JOEL\n          I'm sorry, I ah... I just don't\n          think that's something we're gonna\n          want to do.\n\n                         NATHAN\n          Really? Why not? It's a lot of\n          fun.\n\n                         JOEL\n          Oh, I don't know. Suzie doesn't\n          really like going to stuff like\n\n                         THAT--\n\n                         NATHAN\n          Why not?\n\n                         JOEL\n          Well, we wouldn't know anybody\n          there. She get's kind of\n          uncomfortable.\n\n                         NATHAN\n          Oh no -- It's not like that. She\n          won't be uncomfortable. I\n          guarantee it. No, it's not like\n          that at all. It's not formal or\n          anything. Trust me. It's just a\n          real loose bunch.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          9.\n\n                         JOEL\n          I just don't...\n\n                         NATHAN\n          I tell you what. Why don't we do\n          this -- I'll go ahead and get\n          tickets, since they're gonna sell\n          out fast. You talk to Suzie. See\n          what she says. Like I say, she\n          won't be uncomfortable at all.\n          Maybe I'll have Leslie give her a\n          call -- you know how it is when the\n          wives talk, heh heh--\n          Joel is about to snap.\n\n                         JOEL\n          Um, why don't we talk about this\n          later.\n          (looks at his watch)\n          I gotta make this call before they\n          leave.\n          Joel pulls away, forcing Nathan to raise off the window sill.\n\n                         JOEL (CONT'D)\n\n                         (CALLING BACK)\n          Sorry... I just gotta make this\n          call!\n\n          INT. JOEL'S GARAGE - CONTINUOUS\n\n          Joel pulls the car in, steps out and is shocked to see Nathan\n          right there in his garage.\n\n                         NATHAN\n          Sorry, I almost forgot -- the\n          tickets are forty dollars a plate.\n          I know that's a little steep, but\n          the food is fantastic and it's for\n          a good cause. So that'd be eighty\n          dollars total. There's no tax or\n          anything.\n\n                         JOEL\n          Ah, look Nathan, I really gotta get\n          inside and make this call. Let's\n          talk about this another time.\n          Joel has his finger on the button to shut the garage door,\n          waiting for Nathan to get out. Nathan stops, just inside.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          10.\n\n                         NATHAN\n          Oh, and if you need us to look out\n          for the house or anything when you\n          go out of town --\n          Joel's finger still on the garage door button.\n\n                         NATHAN\n          Well, just let us know. Where you\n          guys going anyway?\n\n                         JOEL\n\n                         (BULLSHITTING)\n          Ah, just sort of a vacation. Look,\n          I gotta run.\n          Joel hits the button and the door starts going down.\n\n                         NATHAN\n          Alright then. We'll see ya.\n          Nathan finally steps out of the garage. Joel breaths a huge\n          sigh of relief. Then,\n\n          ANGLE ON THE GARAGE DOOR:\n          As it gets halfway down, we see Nathan's legs, heading back\n          towards the door. Nathan leans down into frame as the door\n          goes down.\n\n                         NATHAN\n          Oh, Joel one more thing--\n          Joel lets the door shut on him, and bolts into the house.\n\n          INT. JOEL'S HOUSE - EVENING\n\n          Joel walks into the living room just as his wife, SUZIE,\n          enters from the bedroom pulling on her SWEATPANTS. A look of\n          disappointment on Joel's face. Suzie is a decent looking\n          woman, about Joel's age.\n\n                         JOEL\n          Man, that Nathan won't shut up.\n\n                         SUZIE\n          Yeah, what an asshole. I don't\n          even go into the front yard\n          anymore. That wife of his is even\n          worse.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          11.\n          Suzie plops down on the couch looking tired and pissed off.\n          Joel sits down next to her.\n\n                         SUZIE (CONT'D)\n          We gotta get a new pool cleaner.I\n          don't think that asshole checked\n          the chlorine levels again like I\n          asked him too...\n          Joel puts his arm around her, caresses her shoulder. She\n          doesn't seem to notice as he starts getting fresh.\n\n                         SUZIE (CONT'D)\n          .and every time he is here, he\n          goes on and on about some problem\n          with the goddamn filter, and I have\n          no idea what he's talking about...\n           Delayed reaction -- she notices Joel is getting frisky. He \n          gets closer, starts kissing her neck.\n\n                          SUZIE (CONT'D)\n\n                         (UNCOMFORTABLE)\n          Ah,...Joel?\n\n                         JOEL\n          What?\n\n                         SUZIE\n          I'm sorry. It's just... I'm a\n          little tired, and, I don't know,\n          it's the middle of the week...\n\n                         JOEL\n          It's not the middle of the week.\n          It's Monday. Why can't--\n\n                         SUZIE\n          Monday?\n          (Freezes, suddenly\n\n                         REALIZING SOMETHING)\n          Oh shit!\n\n                         JOEL\n\n                         (WORRIED)\n          What?!\n\n                         SUZIE\n          Idol!\n          Suzie jumps up with newfound energy, runs for the remote and\n          turns on the TV. Joel just sits there.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          12.\n          Suzie plops down in a Barcalounger.\n\n                         SUZIE (CONT'D)\n          Sorry honey. Maybe this weekend.\n          Joel leaves the room.\n\n          INT. JOEL'S BATHROOM -- LATER\n\n          [Quick scene of Joel trying to masturbate (off screen of\n          course), but he's too distracted by the sounds of a bad out-\n          of-tune Idol audition blaring through the wall.] \n\n          EXT. SCOREBOARDS SPORTS BAR -- NIGHT\n\n          Establishing shot. A sports bar that's part of a Holiday\n          Inn.\n\n          INT. SCOREBOARDS -- CONTINUOUS\n\n          Joel sits at the bar. DEAN, the owner of the bar, late\n          forties, and an old friend of Joel's, sits behind the bar on\n          a stool.\n\n                         JOEL\n          I gotta get a house with a bathroom\n          that's doesn't share a wall with\n          the TV.\n\n                         DEAN\n          Why don't you do that in another\n          bathroom. You've got three of 'em.\n\n                         JOEL\n          It would look suspicious. We never\n          use those other bathrooms... Maybe\n          if I had some insulation put in...\n\n                         DEAN\n          Insulation?... All I know is, you\n          shouldn't move man; you've got a\n          nice house. I mean you've got the\n          American dream really -- you own\n          your own company. I can't believe\n          you used to bar back for me here,\n          and now you've got all that.\n\n                         JOEL\n          But what do I have really? It's a\n          big pain in the ass.\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          13.\n\n                         JOEL (CONT'D)\n          I'm always working; can't stop or\n          the whole place will fall apart.\n          And what good does it do me anyway?\n          I don't get laid. That stock guy\n          with the shitty band that works for\n          me probably gets laid more than I\n          do.\n\n                         DEAN\n          (trying to help)\n          Yeah, but he probably lives in a\n          crappy apartment.\n\n                         JOEL\n          Hell, I'd move into a crappy\n          apartment if the bathroom wasn't\n          right next to the TV.\n\n          INT. MUSIC STORE - DAY\n\n          CINDY, a girl in her early twenties, is at the counter\n          looking at a new Gibson hollow-body electric guitar -- one of\n          the really nice ones. The price tag says $3,950. She's\n          beautiful and sexy and all that, but there's something\n          vulnerable and sweet about her as well.\n          Two SALESMEN, typical music store employees -- long-haired,\n          goateed, nerdy cocky guitar-hacks are giving her way too much\n          attention. It's clear that they don't usually have women\n          this hot in their store. They practically stumble over each\n          other trying to help her.\n\n                         SALESMAN #1\n          Yeah, it's expensive but it's\n          sweet... Are you familiar with the\n          Gibson humbucking pickups?\n\n                         CINDY\n          No, sorry. I don't play. It's for\n          my Dad actually -- for his\n          fiftieth birthday. My sisters and\n          I are all pitching in.\n\n                         SALESMAN #2\n          Ah, that's nice... Your Dad would\n          love these humbuckings. They\n          really kick ass.\n          An annoyed MALE CUSTOMER has been waiting behind Cindy,\n          trying to get some help, but he might as well be invisible.\n          He tries to address Salesman #2, off to the side.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          14.\n\n                         MALE CUSTOMER\n          Excuse me... I just have a quick\n          question...\n          Salesman #2 is oblivious, never takes his eyes off Cindy.\n\n                         SALESMAN #2\n\n                         (OBLIVIOUS)\n          So, what kind of music did he play?\n          Both Salesmen's eyes are glued to Cindy as Male Customer\n          finally gets sick of waiting and storms off into the keyboard\n          room.\n\n                         CINDY\n          I think he played like, jazz or\n          something. I'm not sure.\n\n                         SALESMAN #2\n          Well this is an excellent jazz\n          guitar. It's what Pat Metheny\n          plays.\n\n                         SALESMAN #1\n          Is your Dad into Metheny at all?\n\n                         CINDY\n          Oh, I don't know who that is.\n          Sorry.\n\n                         SALESMAN #2\n          He's like, a totally kickass fusion\n          guitarist. Are you into fusion?\n\n                         CINDY\n          I don't really know much about\n          it...\n\n                         SALESMAN #2\n          I play fusion guitar so... Just\n          curious.\n\n                         CINDY\n          Um, do they come in any other\n          colors?\n\n                         SALESMAN #1\n          You mean different finishes?\n          There's a sunburst finish we might\n          have in stock.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          15.\n\n                         SALESMAN #2\n          Yeah, do you wanna see it? I'll go\n          get it.\n\n                         SALESMAN #1\n          Or I could go. Whatever.\n\n                         CINDY\n          Are you sure?\n\n                         SALESMAN #1/SALESMAN #2\n          Oh totally./ No prob!/ I'll show\n          you the case it comes with too.\n          The salesmen practically trip over each other, going into the\n          back to find the other guitar.\n          Cindy stands there alone for a beat. She looks around. Then\n          casually picks up the four-thousand dollar guitar and walks\n          out the front door with it.\n\n          EXT. MUSIC STORE - CONTINUOUS ACTION\n\n           Cindy walks a few yards over to her car, a ' 92 Tercel, puts\n           the guitar in the trunk, gets in and takes off.\n\n          INT. MUSIC STORE - CONTINUOUS ACTION\n\n          The two Salesmen return -- one carrying the sunburst-finish\n          guitar and the other with the hard-shell case. They look\n          around, notice she's gone. They stand there for a beat,\n          disappointed, before they realize what just happened.\n\n                         SALESMAN #1\n          Oh shit!...\n\n                         (FRANTICALLY LOOKING\n\n                         AROUND)\n\n          THE GIBSON!\n          They run out the front door, but Cindy is long gone.\n\n          INT. JOEL'S OFFICE - DAY\n\n          Joel is at his desk. Brian comes in, excited.\n\n                         BRIAN\n          You're not gonna believe this.\n          Remember the guy from General Mills\n          that called a while back? Talking\n          like he wanted to buy us out?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          16.\n\n                         JOEL\n          I thought you said he wasn't\n          serious; he was just sniffing\n          around.\n\n                         BRIAN\n          Yeah, well he's serious now. He\n          just made an offer -- I mean a real\n          offer this time.\n\n                         JOEL\n          You're kidding.\n\n                         BRIAN\n          No. It must be part of some bigger\n          strategic move, because it's over\n          market value I think.\n\n                         JOEL\n          Wow...\n          Joel lets it sink in. He walks over to the window, looking\n          down on the production floor.\n\n                         JOEL\n          I could unload all this... I could\n          probably retire...\n\n                         BRIAN\n          I mean, yeah, there's a lot of\n          details to work out, but this could\n          be great. They'll be calling back\n          next week, what should I tell them?\n          Joel looks down, sees Mary sitting with her arms folded,\n          shaking her head.\n\n                         JOEL\n          Tell 'em hell yes.\n\n          INT. MANUFACTURING FLOOR - CONTINUOUS\n\n          Mary sits with her arms folded, refusing to hold the line.\n\n                         MARY\n          I already warned him. This is the\n          last time. I'm just gonna sit\n          here.\n          In SLOW MOTION, we see:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          17.\n          - The first box falls off the end of the assembly line,\n          bottles shatter.\n          - Rory, carrying some boxes slips on the broken bottles of\n          goopey extract, falls and slides into an aisle.\n          - A forklift stops suddenly to avoid hitting Rory, causing a\n          huge stack of pallets to fall off.\n          - Quick shot of Mary shaking her head in slow-motion.\n          - Just as Step rounds a corner to see what's going on, the\n          pallets land on a bunch of pipes and high-pressure valves\n          which burst open sending a piece of shrapnel flying across\n          the room heading straight for\n          - STEP'S CROTCH. The shrapnel heads straight for his\n          genitalia, as we\n\n                         CUT TO:\n\n          EXT. REYNOLD'S EXTRACT BUILDING - DAY\n\n          Step is on a stretcher being loaded into a MEDIVAC helicopter\n          by a couple of EMS guys. Step moans in pain as Joel tries to\n          comfort him. A small crowd of employees watch.\n          ANGLE ON Mary in the crowd, shaking her head.\n\n                         MARY\n          I knew it. That's what happens\n          when you don't pay attention.\n\n          INT. SCOREBOARDS -- LATER\n\n          Joel sits at the bar, on a cell phone. Dean sits behind the\n          bar on a stool.\n\n                         JOEL\n          (to the person on the\n\n                         PHONE)\n          Uh-huh... Alright. Let me know if\n          you hear anything else.\n          He hangs up, talks to Dean.\n\n                         JOEL (CONT'D)\n          Well, he's definitely lost one of\n          'em. They think they might be able\n          to re-attach the other one, but\n          they're not sure.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          18.\n\n                         DEAN\n          (shaking his head)\n          Wow...\n\n                         JOEL\n          Yeah... I'm not sure how it\n          happened, but we have a great\n          safety record and we comply with\n          all the safety codes so... it was\n          just a freak accident. There'll be\n          an investigation of some kind I'm\n          sure.\n\n                         DEAN\n          Well, you have insurance for that\n          kind of thing, right?\n\n                         JOEL\n          Oh yeah. Of course. In fact,\n          he'll probably get a huge\n          settlement.\n\n                         DEAN\n          Yeah. I would think so. I mean,\n          it's your balls...\n          Beat, as they contemplate the profundity of it.\n\n                         JOEL\n          Boy it really makes you stop and\n          think about how fragile we are --\n          especially our balls. They're just\n          hanging there in a little sack\n          between our legs. At any moment\n          they could be cut off forever.\n\n                         DEAN\n          Yeah. And your balls are really\n          important man. Your balls are\n          everything. What kind of life would\n          you have with no testicles? Can you\n          imagine that shit?\n\n                         JOEL\n          Yeah...\n          Beat.\n\n                         JOEL (CONT'D)\n          You know Dean, my life wouldn't be\n          much different than it is now\n          actually.\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          19.\n\n                         JOEL (CONT'D)\n          Except for once every three months\n          when I have sex with my wife. In\n          fact, I might even be better off...\n\n                         DEAN\n          Wait. Three months? I thought you\n          said it was once a month.\n\n                         JOEL\n          I did? I must've been lying. I\n          don't know... Maybe things'll get\n          better when I sell the company.\n          I'll be around more...\n\n                         DEAN\n          Well, I hope so. That would\n          suck... I get laid all the time.\n          (off Joel's reaction)\n          Sorry.\n\n                         JOEL\n          Ah, it's all right...\n\n                         (THINKS)\n          Actually, it sucks.\n\n                         DEAN\n          Yeah, sexual frustration is bad\n          news... You know what you oughtta\n          do?\n\n                         JOEL\n          What?\n\n                         DEAN\n          Get some Xanax.\n\n                         JOEL\n          Xanax? Isn't that for anxiety?\n\n                         DEAN\n          Yeah it is, but I find it's good\n          for just about any phsychological\n          problem. I mean, basically it just\n          makes you feel good, so it sort of\n          works for anything. I even take it\n          when I have a cold. It's probably\n          great for sexual frustration. Want\n          me to get you some?\n\n                         JOEL\n          No.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          20.\n\n                         DEAN\n          You know what else is good?\n          Codeine cough syrup.\n\n                         JOEL\n          For what?\n\n                         DEAN\n          It's just good.\n          Joel looks at Dean for a beat.\n\n                         JOEL (CONT'D)\n          Are you on something now?\n\n                         DEAN\n          No... Well, I guess I took some\n          Vicodin this morning. But that was\n          just 'cause I was hung-over.\n\n          EXT. PAWN SHOP - DAY\n\n          Establishing shot, a pawn shop in a strip mall. Cindy's car\n          parked out in front.\n\n          INT. PAWN SHOP - CONTINUOUS\n\n          Cindy is at the counter, the Gibson guitar we saw earlier is\n          in front of her. A PAWN SHOP GUY is counting out money. He\n          pauses, looks around, then speaks sympathetically to her.\n\n          PAWN SHOP GUY\n          Um, you know, I'm really not\n          supposed to say this... but since\n          this belonged to your father, and\n          since he passed away and all...\n\n                         (QUIETLY)\n          You could probably get a better\n          deal at a music store.\n\n                         CINDY\n          Oh, that's okay. Thanks. But I\n          just kind of wanna get it over\n          with, you know? It's kind of hard\n          for me.\n\n          PAWN SHOP GUY\n          I understand.\n          He looks around to see if his boss is watching, then counts\n          off a FEW MORE TWENTIES, feeling sorry for her.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          21.\n           PAWN SHOP GUY (cont'd)\n          Here.\n\n          INT. CINDY'S CAR - MOMENTS LATER\n\n          Cindy puts the money in her wallet, along with a driver's\n          license.\n\n          CLOSE ON THE WALLET.\n          Cindy shuffles through three or four different driver's\n          licenses. On one, her name says MISTY PATTERSON. It's a\n          Kansas license. She takes another one out from Colorado,\n          with the name CINDY METZLER on it and puts that in front,\n          then puts the wallet away.\n          A newspaper sits on the front seat. Something grabs her\n          attention.\n\n          ANGLE ON THE NEWSPAPER:\n          We see an article about Step's accident. There's a picture\n          of Step being taken away on the stretcher.\n          Cindy starts reading the article, with growing interest.\n\n                         CINDY'S POV:\n          She scans the article, zeroing in on certain words,\n          \".. .potentially big settlement...\" \"...no testicles...\"\n          \"several million dollars\" then back to \"no testicles\" then\n          quickly back and forth several times -- \"million dollars\" \"no\n          testicles\" \"million dollars\" \"no testicles\"\n          ON CINDY'S FACE - A look of determination. She looks one\n          more time at the name under the picture -- Don \"Step\"\n          Wilkenson, then zeroes in on the words \"Reynold's Extract.\"\n          She starts the car and speeds away.\n\n          INT. REYNOLD'S EXTRACT BUILDING - CONFERENCE ROOM - DAY\n\n          Joel sits with Brian. Brian has a clipboard, going over the \n          day's business. \n\n                         BRIAN\n          So obviously Step's not coming back\n          anytime soon. I had to hire a\n          couple temps. Is that okay?\n\n                         JOEL \n          Yeah, sure. How is Step? \n\n                         \n\n                         \n\n                         \n\n                         \n\n          22.\n\n                         BRIAN\n          Better. They say he's going home\n          in a couple of days. Speaking of\n          which, the guys at General Mills\n          heard about this whole Step thing.\n          They're worried. If Step decides\n          to sue us -- beyond the insurance\n          settlement -- it could be a serious\n          liability. They don't want to make\n          an offer until this thing has\n          settled.\n\n                         JOEL \n          Really? They think it's that big \n          of a liability? \n\n                         BRIAN\n          Well yeah. Don't you? I mean,\n          think about it. Imagine if you\n          asked a bunch of jurors how much\n          you'd have to pay 'em to cut their\n          balls off? I mean, I wouldn't let\n          someone cut my balls off for a\n          billion dollars. Seriously --\n          unless there were some kind of\n          really expensive operation that\n          could give you artificial balls or\n          something. Would you?\n\n                         JOEL \n          No, I guess not. \n\n                         BRIAN\n          Anyway, I wouldn't worry. He says\n          he's not going to sue us. Says he\n\n                         (CRUDE IMITATION)\n          \"don't want somethin' fer nothin \"'\n          and \"What's right is right.\" If we\n          can just get him to sign something\n          to that effect we should be fine.\n\n                         JOEL \n          Boy, Step sure is being mellow \n          about all this. \n\n                         BRIAN\n          Yeah, well I think when you lose\n          your balls it mellows you out. You\n          don't get as pissed off and\n          aggressive about things. I know\n          it's true for horses, and bulls.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          23.\n\n                         JOEL\n          Boy, it sure does make you think.. \n\n                         BRIAN \n          Oh, by the way, guess who asked for \n          a raise today? \n\n                         JOEL \n          Who? \n\n                         BRIAN\n\n                         (GESTURES INDISCRIMINATELY\n          to someone downstairs)\n          Dinkus. Can you believe that?\n\n                         JOEL\n          Brian, you call everyone here\n          \"Dinkus.\" I don't know who you're\n          talking about.\n\n                         BRIAN \n          You know, Forklift-Dinkus? \n\n                         JOEL \n          Oh... I thought you call him \"boy- \n          genius.\" \n\n                         BRIAN\n          Yeah, well boy-genius asked for a\n          raise. I said, \"are you kidding?\n          You nearly got someone killed last\n          week,\" and then he blamed it on\n          Dinkus over there.\n\n                         JOEL \n          You know Brian, you really ought to \n          learn the employees' names. \n\n                         BRIAN\n          Well, I was thinking about that,\n          but hey, if this deal goes through\n          next week, I won't have to. It's\n          not like I'm gonna be inviting\n          Dinkus and Boy-Genius over for\n          dinner.\n\n          INT. JOEL'S OFFICE - NEXT DAY\n\n          Joel stands on one side of his office looking down through a\n          long window overlooking the manufacturing area. Dean comes\n          in, walks over to the window, looks down at the production\n          floor with Joel.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          24.\n\n                         DEAN\n          Hey man. What's goin' o-- Whoa!\n           DEAN'S POV: It's CINDY, now working down on the floor, on\n          the assembley line.\n\n                          DEAN (CONT'D)\n          Damn! Who's she? Is she new?\n\n                         JOEL\n          Yeah. She's a temp.\n\n                         DEAN\n          She's a tramp?\n\n                         JOEL\n          No a temp. Quit staring.\n\n                         DEAN\n          Damn, she's hot! Way to go.\n\n                         JOEL\n          Hey, I didn't hire her. She came\n          here through Manpower, like\n          everybody else. They just sent her\n          over.\n\n                         DEAN\n          Manpower, huh? Maybe I should give\n          them a call. You don't usually\n          have girls anywhere near that hot\n          working here. What's the deal?\n\n                         JOEL\n          Yeah, I know. I guess it makes\n          sense though if you think about it.\n          Hot girls need a job just as much\n          as anyone else.\n\n                         DEAN\n          (thinks for a second)\n          Do they really?... Huh... You just\n          don't see 'em here. Usually your\n          temps look like winos. And they're\n          guys.\n\n                         JOEL\n          You wanna hear something really\n          weird?\n\n                         DEAN\n          What?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          25.\n\n                         JOEL\n          She came on to me.\n\n                         DEAN\n          No way! Really?\n\n                         JOEL\n          Yeah. I mean, I'm pretty sure. I\n          could be wrong, but...\n\n                         DEAN\n          Hey, I'm sure she did. Are you\n          kidding? You could have any girl\n          down there.\n\n                         JOEL\n          I don't know about that.\n\n                         DEAN\n          I'm serious. Dude, you're the big\n          shot here. You're the king of...\n          What do you call that shit you make\n          here again?\n\n                         JOEL\n          Extract. And spray-dried\n          flavoring, and we're branching out\n\n                         INTO--\n\n                         DEAN\n          Yeah, you're the Extract King man.\n          You could have any girl here. I\n          mean, I wouldn't want most of 'em,\n          but her... Way to go Joel.\n          Dean looks down at manufacturing area, taking it all in.\n\n                          DEAN (CONT'D)\n          So how did she come on to you?\n\n                         JOEL\n          Well, first she started asking me\n          about what happened to Step and all\n          that stuff -- you know, just sort\n          of making conversation?\n\n                         DEAN\n          Yeah.\n\n                         JOEL\n          But it really seemed like she was\n          flirting with me, you know?\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          26.\n\n                         JOEL (CONT'D)\n          Then, she just sort of asked me\n          out... I think.\n\n                         DEAN\n          Really? How?\n\n                         JOEL\n          Well, you see that guy down there\n          by the fork lift?\n          ANGLE ON Rory, the indi-rock guy with tattoos, etc.\n\n                          JOEL (CONT'D)\n          His band is playing somewhere, at\n          some party this weekend, and she\n          asked me if I wanted to go with\n          her.\n\n                         DEAN\n          Wow. So, you gonna do anything\n          about it?\n\n                         JOEL\n          What? No. No way. I couldn't\n          live with myself if I cheated on\n          Suzie... It'd be nice if I got\n          laid at home once in a while\n          though...\n\n                         DEAN\n          (still staring at her)\n          Man, she is fine. You mind if I\n          hit that then?\n          Beat.\n\n                         JOEL\n          Yeah, I do sort of...\n          We see a COMMOTION down on the floor. Mary runs out of the\n           Women's locker room SCREAMING AND YELLING.\n\n          INT. REYNOLD'S EXTRACT / MANUFACTURING AREA - CONTINUOUS\n\n\n                         ACTION\n          Mary runs over to where Hector is working, hysterical.\n\n                         MARY\n          My purse is stolen! It's gone!\n          (pointing at Hector)\n          He did it! He stole my purse!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          27.\n          Brian runs over and stands between them, trying to calm Mary\n          down, but she keeps ranting. Hector looks confused and\n          worried.\n\n                         BRIAN\n          Now hold on--\n\n                         MARY\n          I won't hold on! I'll call the\n          cops!\n\n                         HECTOR\n          (confused, frightened)\n          What? I don'... No comprende...\n\n                         BRIAN\n\n                         (HORRIBLE SPANISH)\n          Espera un momento Hector. Tu sabes\n          donde esta su... uh, purse?\n          ANGLE ON CINDY, watching the whole thing-- completely\n          unfazed.Joel rushes in.\n\n                         JOEL\n          Now wait a second. Calm down Mary.\n          How do you know it was stolen?\n\n                         MARY\n          It's gone! That's how.\n\n                         JOEL\n          Well, what did it look like.\n\n                         MARY\n          It was black with a fur, leopard\n          style border...\n          As Mary describes the purse, we\n\n                         CUT TO:\n\n          INT. CINDY'S CAR - AFTERNOON\n\n          Cindy sits in her parked car, going through the purse Mary\n          just described. She takes some cash, puts it in her pocket,\n          then finds what she's looking for -- the address book.\n\n          ANGLE ON ADDRESS BOOK.\n          Cindy turns to the Ws and finds Step Wilkenson. She notes\n          his address. She starts the car and takes off.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          28.\n\n          EXT. STREET IN FRONT OF STEP'S HOUSE - A LITTLE LATER\n\n          Cindy sits and waits, listening to the radio. It's a very\n          blue-collar neighborhood. She's about three houses away from\n          Step's house, keeping an eye on it.\n          After a beat, Step limps out of the house, walks over to his\n          pickup truck, painfully gets in, and leaves. Cindy starts\n          the car and follows from a distance.\n\n          INT. GROCERY STORE - A LITTLE LATER\n\n          Step wheels his shopping cart into one of the checkout lines.\n          He uses the cart as a crutch to help him walk. Cindy gets in\n          line behind him. She only has one item, a bottle of\n          Reynold's Orange Extract. Step notices her.\n\n                         STEP\n          You can go ahead of me if that's\n          all you have.\n\n                         CINDY\n\n                         (SWEETLY)\n          Thank you so much.\n          (holds up extract bottle)\n          I can't believe I'm buying this\n          stuff -- I work at the factory.\n\n                         STEP\n          Really? I work there too. Or, ah,\n          I used to.\n\n                         CINDY\n          Really? You're kidding! I just\n          started there. What's your name?\n\n                         STEP\n          I go by Step. Yeah, I'm the\n          fastest sorter there...\n          As Cindy and Step get to know each other we\n\n                         CUT TO:\n\n          INT. JOEL'S HOUSE - NIGHT\n\n          Joel enters the living room. He first sees the sweatpants,\n          then sees Suzie is sound asleep on the couch. He sighs, then\n          turns and leaves.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          29.\n\n          INT. SCOREBOARDS SPORTS BAR -- NIGHT\n\n          Joel sits at the bar talking to Dean. Joel is drinking some\n          kind of hard liquor, getting a buzz.\n\n                         JOEL\n          I'm sick of it Dean. I'm sick of\n          being turned down in my own house\n          by my own wife. We're turning into\n          one of those brother-sister\n          couples.\n\n                         DEAN\n          Huh...Now that you mention it, you\n          guys kind of look alike too.\n\n                         JOEL\n\n                         (GROSSED OUT)\n          No we don't!\n\n                         DEAN\n          Okay.\n\n                         JOEL\n          (takes a drink)\n          Maybe things will be better after I\n          sell the company... Or maybe it's\n          just going to mean more time to sit\n          around and contemplate not getting\n          laid.\n          Dean nods sympathetically.\n\n                         DEAN\n          What about that girl at work? She\n          still into you?\n\n                         JOEL\n          Yeah... she was really coming on to\n          me. She gave me her phone number\n          and everything. Told me to call\n          her if I wanted to go to that\n          party. Can you believe that? And\n          there's nothing I can do about it,\n          but just be sexually frustrated.\n\n                         DEAN\n          I've got some Xanax if you want it.\n          Like I say, that always works for\n          me.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          30.\n\n                         JOEL\n          No thanks...\n\n                         DEAN\n          Well maybe you should call that\n          girl.\n\n                         JOEL\n          No, I can't. I can't cheat on\n          Suzie. I just gotta power through\n          it until I'm so old that I can't\n          get it up anymore.\n\n                         DEAN\n          What about if Suzie cheated on you?\n\n                         JOEL\n          Hmm... I hadn't even thought of\n          that...\n\n                         (BEAT)\n          I wish she would.\n\n                         DEAN\n          You wish she would cheat on you?\n          Wouldn't that bother you?\n          Joel thinks about it.\n\n                         JOEL\n          No. I don't think it would\n          actually.\n          (occuring to him)\n          I guess that's weird huh?\n\n                         DEAN\n          Yeah, it's a little weird. Sort\n          of.\n\n                         JOEL\n          But see, then I could do something\n          about all this sexual frustration,\n          without feeling guilty about it.\n\n                         DEAN\n          Do you think she would cheat on\n          you?\n\n                         JOEL\n          Nah...\n\n                         DEAN\n          You sure?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          31.\n\n                         JOEL\n\n                         (CONSIDERS IT)\n          Well, I don't know. Hmm... Maybe\n          if she were really tempted she\n          would. Like if some really studly\n          guy came on to her.\n\n                         DEAN\n          So you're saying she would probably\n          cheat on you if she was put in\n          temptation's way?\n\n                         JOEL\n          Yeah, maybe.\n\n                         DEAN\n          You know what you oughtta do?\n\n                         JOEL\n\n                         (WEARY)\n          I don't wanna do any drugs Dean.\n\n                         DEAN\n          No, no. Check this out -- If you\n          really wish your wife would cheat\n          on you, it's not that hard to make\n          it happen.\n\n                         JOEL\n          How?\n\n                         DEAN\n          Hire a gigolo to have an affair\n          with your wife.\n\n                         JOEL\n          What?\n\n                         DEAN\n          I'm serious. I know a guy.\n\n                         JOEL\n\n                         (INCREDULOUS)\n          You know a gigolo?\n\n                         DEAN\n          Yeah.\n\n                         JOEL\n          How do you know a gigolo?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          32.\n\n                         DEAN\n          This guy Brad. He comes in here\n          all the time. He's a friend of\n          Vic's. You could hire him to have\n          an affair with Suzie.\n\n                         JOEL\n          Come on Dean.\n\n                         DEAN\n          Why not? You said you wouldn't\n          care if she cheated on you. Then\n          you'd be free to go out with that\n          Cindy chick and get your ya-yas out\n          -- with no guilt. Problem solved.\n          (proud of himself)\n          Man, what a great idea.\n          Joel just shakes his head at the whole thing.\n\n                         JOEL\n          You know, maybe I will try some of\n          that Xanax.\n          Dean reaches down under the cash register and whips out a\n          little box and pulls out a pill.\n\n          EXT. LAKE -- SAME TIME\n\n          Step's truck is parked out at a lake in the country. He and\n          Cindy sit next to each other on the tailgate, looking at the\n          stars, talking.\n\n                         STEP\n          I just believe that what's\n          right is right.\n\n                         CINDY\n          That's right Step, and what's right\n          is for you to send a message.\n\n                         STEP\n          A message?\n\n                         CINDY\n          You need to send a message so that\n          a horrible accident like this never\n          happens to anyone else ever again.\n          That's what's right. And the way\n          you do that is to take them to\n          court.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          33.\n\n                         STEP\n          You think?\n\n                         CINDY\n          Yes Step... That's why I called a\n          lawyer for you -- that guy on all\n          the bus stop benches.\n\n                         STEP\n          Joe Adler?\n\n                         (TOUCHED)\n          You did that for me?\n\n                         CINDY\n          Mmm hmm... I just want you to do\n          what's right Step.\n          They start cuddling, kissing. Cindy pulls away.\n\n                         CINDY\n          I'm sorry Step, your doctor said\n          you shouldn't get aroused.\n\n                         STEP\n          No he didn't.\n\n                         CINDY\n          Maybe it was your lawyer, but he\n          talked to your doctor. And your\n          doctor said it's very important not\n          to get aroused until after the\n          trial... I'm sorry.\n\n                         STEP\n          That's okay... You're so good to me\n          Cindy.\n          They start cuddling again.\n\n                         CINDY\n          Look Step, you're getting me turned\n          on, I'm getting you turned on... I\n          better just go.\n\n          INT. SCOREBOARDS SPORTS BAR -- LATER\n\n          Joel is starting to look really tweaked as the drug-alcohol\n          combination begins to kick in.\n          Dean is examining a pill under the cash register light,\n          trying to read the small print. He looks concerned.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          34.\n\n                         DEAN\n          Shit... Do you remember what color\n          that pill I gave you was?\n\n                         JOEL\n          Huh?\n\n                         DEAN\n          Damn. I don't think it was Xanax.\n          I think that might've been\n          Ritalin... Or \"Special K.\"\n\n                         JOEL\n          (feeling the buzz)\n          Ah, who cares?\n\n                         DEAN\n          It's just that, ah, Special K is a\n          horse tranquilizer, kinda has a\n          weird effect when people take it\n          but... well, don't worry about\n          it... You might not want to drink\n          too much more though.\n\n                         JOEL\n          (beginning to slur his\n\n                         SPEECH)\n          You know that thing you were\n          talking about? About the gigolo?\n\n                         DEAN\n          Yeah?\n\n                         JOEL\n          Do you think it would be wrong to\n          do that? I mean morally wrong?\n\n                         DEAN\n          (with full authority)\n          Oh nooo. Definitely not. What\n          could be morally wrong about it?\n\n                         JOEL\n          I don't know...\n\n                         DEAN\n          Look, if she doesn't want to go for\n          it, she doesn't have to. And if\n          she does, then she's the one who\n          sinned, and then it's perfectly\n          morally right for you to go out and\n          boff whoever you want.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          35.\n\n                         JOEL\n\n                         (SLURRED SPEECH)\n          Yeah, I guess you're right. I\n          can't think of anything morally\n          wrong about it either.\n          Beat.\n\n                         JOEL\n          And this guy, he's a friend of\n          yours? What's his name?\n\n                         DEAN\n          Brad. You want me to give him a\n          call?\n\n                         JOEL\n          I don't know. It's kinda weird\n          even talking about it.\n\n                         DEAN\n          Look, this is no big deal Joel.\n          I'm serious.\n\n                         JOEL\n          Really?\n\n                         DEAN\n          Yeah. I mean, you can't lose. Just\n          say you're hiring him to come clean\n          the pool or something. See what\n          happens. If she doesn't go for it,\n          then at least you know you're doing\n          the right thing by being faithful.\n\n                         JOEL\n          Yeah, I guess you're right... I\n          don't know. It's crazy.\n          Dean pours Joel another drink.\n\n                         DEAN\n          Look. Have another drink. Think\n          about it... You know what? Why\n          don't I just call Brad and see what\n          he has to say?\n\n                         JOEL\n          Alright. What the hell.\n          Joel takes a big swig of liquor.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          36.\n\n           INT. SCOREBOARDS SPORTS BAR - BACK OFFICE -- NIGHT\n\n           Dean and Joel are talking with BRAD, the gigolo. He's young,\n           blonde, super good-looking, but clearly a complete airhead.\n          Joel looks really messed up now.\n\n                         JOEL\n          So it's two-hundred dollars then?\n\n                         BRAD\n          Yeah, two-hundred.\n\n                         DEAN\n          Well yeah, but don't forget, I'm\n          getting ten percent.\n\n                         JOEL\n          What, so you're a pimp now?\n\n                         DEAN\n\n                         (CONDESCENDING CHUCKLE)\n          I don't think they're called\n          \"pimps\" when it's with male\n          prostitutes, okay. There's some\n          other word for it -- it's not a\n          \"john,\" but it's something like\n          that. Besides, I'm the one who\n          hooked all this up. And don't worry\n          'cuz it's coming out of Brad's\n          money anyway.\n\n                         JOEL\n          Alright, alright.\n\n                         (TO BRAD)\n          So it's two-hundred dollars then?\n\n                         DEAN\n          Two-hundred and twenty.\n\n                         JOEL\n          Wait a minute--\n\n                         BRAD\n          Um, I have a question?\n\n                         JOEL\n          Yeah?\n          Brad looks at Joel, deeply concerned.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          37.\n\n                         BRAD\n          So like, are you gonna, like, watch\n          or something?\n\n                         JOEL\n          No no no. God no! It's not like\n          that. I won't even be there. I'll\n          be at work. Remember? We already\n          talked about this.\n          Brad looks blank, like he's not getting it.\n\n                         JOEL\n          What you'll do, is come to my house\n          pretending to be the new pool\n          cleaner. Then you simply try to\n          seduce my wife. Okay? If she\n          doesn't respond, you simply clean\n          the pool and leave. That's all.\n          It's that simple.\n          Hold on Brad for a long beat.\n\n                         BRAD\n          So, uh, you're not gonna touch my\n          ass or anything...?\n\n                         JOEL\n          NO! Try to pay attention okay? I\n          will not be there. I will be at\n          work. You come over to my house\n          while I'm not there, posing as the\n          new pool cleaner and then try to\n          seduce her...\n          Brad finally makes a breakthrough.\n\n                         BRAD\n          Oooh, I see. Sorry man. Yeah,\n          yeah. I get it now. You're not\n          even gonna be there...\n\n                         JOEL\n          Yeah, that's right.\n\n                         BRAD\n          Yeah... cool. No problem. This is\n          gonna be great!\n\n                         JOEL\n          Remember, she might not go for it--\n          Brad starts to get a little too excited.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          38.\n\n                         BRAD\n          Yeah, this is gonna be cool! I can\n          hardly wait! Awesome. Hey man, if\n          you know anyone else who needs --\n          you know -- what I do, like you\n          know, lonely housewives and shit,\n          maybe you could tell 'em about me,\n          you know...\n          Joel looks on with growing concern as Brad can't seem to stop\n          talking.\n\n                         BRAD\n          Cuz like, I figure if I did a\n          few jobs and I was, like, really\n          good? Then maybe they'd tell their\n          friends, you know, and they'd give\n          me a... what do you call those\n          things?\n\n                         DEAN\n          Referrals.\n\n                         BRAD\n          Yeah yeah, those things. Then\n          those women could tell more women\n          and then it'd be like I was, like,\n          uh... branching or..\n\n                         DEAN\n          Networking.\n\n                         BRAD\n          Yeah, networking! Totally. Then\n          if I got enough of 'em, maybe I\n          could quit my landscaping job and\n          do this full time. That would be\n          awesome! Cause I hate landscaping.\n          I like getting laid a lot better,\n          and my boss is a total dick...\n\n          EXT. SCOREBOARDS' PARKING LOT -- NIGHT\n\n          Joel and Dean are at Dean's car, trying to say goodbye to\n          Brad, who still won't shut up.\n\n                         BRAD\n          Like I say, if your wife has any\n          housewife friends who might--\n          Dean finally puts his foot down.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          39.\n\n                         DEAN\n          Okay, you've said that a few times\n          now Brad. Go on to your car.\n          Okay?\n\n                         BRAD\n          Alright. Cool. Like I say--\n\n                         DEAN\n          Goodnight Brad.\n\n                         BRAD\n          Okay. See you later.\n          Brad finally leaves.\n\n                         DEAN\n          Let me drive you home. You're in\n          no condition to drive.\n          Joel stumbles into Dean's car.\n\n                         JOEL\n          Are you sure about this guy Dean?\n          He acts like he's never done this\n          before.\n\n                         DEAN\n          Oh no. He does it all the time.\n          Don't worry. He just gets a little\n          excited sometimes. He's cool.\n\n                         JOEL\n          I don't know. He sure doesn't seem\n          too bright.\n\n                         DEAN\n          Yeah well, what do you excpect?\n          He's a whore.\n\n                          DISSOLVE TO:\n\n          INT. REYNOLDS EXTRACT - EMPLOYEE BREAK ROOM - NEXT MORNING\n\n          A break room with a kitchen. Joel is badly hungover. He\n          looks like he's about to throw up as he reaches into the\n          cupboard above the sink, downs a couple of aspirin, then\n          drops some alka-seltzer in to a glass of water. Cindy comes\n          in.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          40.\n\n                         CINDY\n          Looks like you had one of those\n          nights.\n\n                         (FLIRTATIOUS)\n          Where was I?\n          Joel nods, tries to grin and look cool as he takes a sip of\n          his alkaseltzer. Then his eyes go wide, he almost does a\n          spit-take as something suddenly dawns on him...\n\n                         JOEL\n          Oh shit!\n          He runs out of the room.\n\n                         CUT TO:\n\n          INT. JOEL'S OFFICE\n\n          Joel grabs the phone and dials frantically. Dean answers.\n\n                          JOEL\n           Dean?\n\n           DEAN (V.0.)\n\n                         (WAKING UP)\n          Oh, hey Joel.\n\n                         JOEL\n          Thank God you're home. Ah,... did\n          that really happen last night? I\n          mean, did we go through with it --\n          with that gigolo stuff?\n\n                         DEAN\n          Ah, yeah. As far as I know.\n\n                         JOEL\n          Shit! What was I thinking?! We\n          gotta call it off. Right now. Can\n          you call that guy, Brad?\n\n                         DEAN\n          Okay...\n\n                         JOEL\n          Tell him I'll pay him anyway,\n          whatever, just don't come over.\n          God, what was I thinking?!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          41.\n\n                         DEAN\n          Sure, I'll call him. No problem...\n          Oh wait a second. I don't think I\n          have his number.\n\n                         JOEL\n          What? I thought you called him\n          last night.\n\n                         DEAN\n          Yeah, but I got his number from\n          Vic.\n\n                         JOEL\n          Well get it from him again.\n\n                         DEAN\n          Vic doesn't have a phone right now.\n\n                         JOEL\n          Shit! I'll try information.\n          What's Brad's last name?\n          Pause.\n\n                         DEAN\n          Hmm... it's something like,... I\n          think it's a Mexican name.\n\n                         JOEL\n\n                         (LOSING PATIENCE)\n          Mexican?! The guy's got blonde\n          hair and blue eyes!\n\n                         DEAN\n          Yeah, I thought it was weird too --\n          a guy like that with a Mexican last\n          name... It's like Lopez, or Sanchez\n          or something.\n          Joel looks at his watch. It's 11:15.\n\n                         JOEL\n          Shit!\n          Joel hangs up the phone, and rushes out the door.\n\n          INT. RECEPTIONIST DESK IN FRONT OF JOEL'S OFFICE --\n\n\n                         CONTINUOUS ACTION\n          Brian walks in.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          42.\n\n                         BRIAN\n\n                         (CONCERNED)\n          Joel, we gotta talk.\n\n                         JOEL\n          Not now Brian.\n\n                         BRIAN\n          Ah yeah, it's kind of important --\n          kind of really important. It's\n\n                         ABOUT STEP-\n          Joel rushes past him.\n\n                         JOEL\n          Not now!\n          We FOLLOW Joel as he rushes past his SECRETARY.\n\n                         SECRETARY\n          Excuse me Joel? There's a Brad\n          Chavez on line one for you.\n\n                         JOEL\n          I can't, I--\n          Joel stops suddenly.\n\n                         JOEL\n          Who?\n\n                         SECRETARY\n          Brad Chavez. He said he's done\n          with the job you guys talked about\n          at your house? Do you want me to\n          take a message?\n          Joel looks pale.\n\n                          JOEL\n           Um, no... He's the ah, pool\n           cleaner. I better take that.\n          Joel goes back in his office. HOLD on Brian, confused.\n\n          INT. JOEL'S OFFICE - CONTINUOUS\n\n          Joel stares at the phone for a beat then picks it up.\n\n                         JOEL\n          Hello?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          43.\n\n          BRAD (V.0.)\n          Hey, is this Joel?\n\n                         JOEL\n          Yes.\n\n          BRAD (V.0.)\n          Hey, it's Brad. Mission\n          accomplished dude.\n\n                         JOEL\n          What do you mean?\n\n          BRAD (V.0.)\n          I mean it worked. She totally went\n          for it.\n\n                         JOEL\n          What? What're you...?\n          (looks at his watch)\n          You weren't even supposed to be\n          there for another 45 minutes.\n\n          BRAD (V.0.)\n          Oh really? I forgot what time you\n          guys said, and I was so excited\n          about it, I just went over there.\n          Joel sits down, freaked out.\n\n                         JOEL\n          (reality setting in)\n          So you mean she actually ah... you\n          guys...?\n\n          BRAD (V.0.)\n          Yup. It was easy.\n\n                         JOEL\n\n                         (AGITATED)\n          Easy? What do you mean \"easy\"?\n\n          BRAD (V.0.)\n          Oh, I don't mean easy like she was\n          easy -- like she was a slut or\n          anything. I just mean it wasn't\n          hard to get her to... Never mind.\n\n                         JOEL\n          No. Tell me. Tell me how it\n          happened.\n\n                         (BRACES HIMSELF)\n          I wanna hear everything.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          44.\n\n                         BRAD\n          You sure?\n\n                         JOEL\n          Yeah.\n\n          BRAD (V.0.)\n          Okay. Well, she let me in, so I\n          went back like I was cleaning the\n          pool...\n\n          EXT. JOEL'S HOUSE - POOL -- DAY\n\n           As Brad's dopey narration continues, we see the story he's\n           telling. It plays out like a bad soft-porn flick on Cinemax.\n           We see Brad wiping the side of the pool with a rag.\n\n           BRAD (V.0.)\n           .I don't know anything about pool\n           cleaning, so I was just faking it.\n           She was in her bathing suit...\n          Suzie comes out and lies on one of the reclining chairs.\n\n           BRAD (V.0.)\n          .So I struck up a conversation...\n\n                         BRAD\n          This is a really nice house.\n\n                         SUZIE\n          Thanks.\n\n                         BRAD\n          Is it your Dad's house?\n\n                         SUZIE\n          No. It's ours.\n\n                         BRAD\n          Wow, you look so young to be living\n          in a house this nice.\n\n                         SUZIE\n          Oh, thanks.\n          Beat.\n\n                         BRAD\n          Do you have any sunscreen? I\n          forgot mine.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          45.\n          Brad's dopey narration comes back in...\n\n          BRAD (V.0.)\n          I thought that was pretty smart\n          of me -- to ask her to borrow\n          sunscreen. See, 'cuz that way,\n          once she gave me some, I could ask\n          her if she wanted some too, and rub\n          some on her back, instead of just\n          coming out and asking her to rub\n          some on her. Pretty smooth huh?...\n          We see Brad rubbing lotion on Suzie's back as she lies face-\n          down on the chair.\n\n          BRAD (V.0.)\n          Once I was rubbing the sunscreen on\n          her, the rest was easy...\n          We see Brad's hands working their way down Suzie's back.\n          Just as they start to move down towards her butt, Joel\n          interrupts, YANKING US OUT OF THE FLASHBACK.\n\n                         JOEL\n          Okay that's enough! Stop!\n\n          INT. JOEL'S OFFICE - CONTINUOUS\n\n\n                         JOEL\n          I don't need to hear anymore.\n\n          BRAD (V.0.)\n          Okay, cool. Hey, like I say, if\n          you know of anyone else, or if you\n          ever need me to do it again--\n\n                         JOEL\n          NO! No. Look, I gotta go. Bye.\n          Joel hangs up the phone and falls back into his chair, in a\n          state of shock.\n\n                         JOEL\n          (quietly, to himself)\n          Holy shit.\n\n          INT. JOEL'S CAR - LATE AFTERNOON\n\n          Joel drives home from work. He still looks freaked out. He\n          notices something ahead, and suddenly SLAMS ON THE BREAKS.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          46.\n\n                         JOEL\n          Dammit !\n          JOEL'S POV: Nathan, the guy across the street is in his front\n          yard, puttering around with the mail.\n\n                         JOEL\n\n                         (TO HIMSELF)\n          No... not today...\n           Joel puts the car in reverse, starts to pull behind a parked\n           car in an attempt to hide, but Nathan notices him, waves and\n           crosses the street. Joel reluctantly pulls ahead to his\n          driveway.\n\n                         NATHAN\n          How's it goin'?\n\n                         JOEL\n          Oh, I'm kind of busy actually.\n\n                         NATHAN\n          Yeah. Well I won't keep you. I\n          just wanted to let you know, I got\n          those tickets to that dinner we\n          talked about on the 7th. I think I\n          told you they were forty dollars a\n          piece, but it turns out it's a tad\n          more this year -- fifty-five -- so\n          if I could go ahead and just get a\n          check from you guys...\n\n                         JOEL\n          Look, ah, we can't go. Remember?\n\n                         NATHAN\n          No, this is the 7th. You said\n          you're going out of town on the\n          17th.\n\n                         JOEL\n          Yeah, but remember, I told you we\n          didn't really want to go to this\n          thing.\n          Nathan looks dumbfounded. Joel is about to snap.\n\n                         NATHAN\n          But I already bought the tickets.\n          I know you said something about her\n          feeling uncomfortable, but, like I\n          say, she won't feel uncomfortable\n          at all -- I guarantee it.\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n                         47\n\n                         NATHAN (CONT'D)\n          It's just a whole lot of fun. You\n          guys'll have a great time.\n\n                         JOEL\n          Look, I gotta get going.\n\n                         NATHAN\n          Alright then...\n          Joel starts to pull away.\n\n                         NATHAN (CONT'D)\n          Oh, one more thing --\n          Joel just keeps driving, almost knocking Nathan over.\n\n          INT. JOEL'S HOUSE - EVENING\n\n          Joel and Suzie are eating dinner. Suzie has a glow about\n          her, looking better than ever -- relaxed, satisfied, etc.\n          Joel's has a quietly pissed off demeanor. They eat in\n          silence for a beat.\n\n                         SUZIE\n          So... How's work?\n\n                         JOEL\n          It sucks.\n\n                         SUZIE\n          Really? What's wrong?\n\n                         JOEL\n          Nothing.\n          Suzie looks a little puzzled. They keep eating in silence\n          for a beat.\n\n                         JOEL\n          I don't feel well. I'm going to\n          bed.\n\n          INT. REYNOLD'S EXTRACT BUILDING - JOEL'S OFFICE - DAY\n\n          From the window in his office, Joel watches Cindy working\n          down on the production floor. Cindy looks up, they make eye\n          contact for a brief moment. She gives him a flirtacious wave.\n          Joel waves back. Then Rory comes by, starts talking to\n          Cindy.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          48.\n\n          INT. REYNOLD'S EXTRACT /MANUFACTURING AREA - CONTINOUS\n\n\n                         CINDY\n          So you're in a band?\n\n                         RORY\n          .Actually, I'm in five bands\n          right now. But Godscock is\n          basically the same four guys as\n          Fighthead, but Fighthead's more of\n          a thrash/skatepunk thing. Godscock\n          is more melodic stuff.\n          Cindy nods politely. Rory thinks she's interested.\n\n                         RORY (CONT'D)\n          So you comin' Friday?\n\n                         CINDY\n          Yeah, definitely.\n          (looks at her watch)\n          Ooh, I gotta go. Dentist\n          appointment.\n\n                         RORY\n          Cool.\n          Cindy leaves.\n          ANGLE ON Mary, on the other side of the room, watching them.\n          She talks to Gabriella.\n\n                         MARY\n          See, there he goes again, slowing\n          us down.\n\n                         (RE: CINDY)\n          Now she's a good sorter. They need\n          to hire more people like her.\n\n                         GABRIELLA\n          She's so nice too.\n          Hector walks by. Mary just shakes her head.\n\n                         MARY\n          I can't believe he's still working\n          here. You know Silvia can't find\n          her wallet. Thinks it was stolen.\n          And guess who was in the locker\n          room last? Hector.\n          They both look at Hector and shake their heads in disgust.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          49.\n\n                         MARY\n          You know, I could get a job at\n          Southwest Airlines. My Niece works\n          there. I'd get better benefits\n          than we get here too.\n\n                         GABRIELLE\n          Mmm hmm. I could get a job at\n          Gemco. You think they would put up\n          with this stuff at Gemco? Mmm mmn.\n          They run a tight ship.\n\n                         MARY\n          That's right.\n\n          INT. JOEL'S OFFICE - CONTINUOUS\n\n          Joel's POV of Mary and Gabrielle, yacking self-righteously.\n          Joel looks on with disgust...\n\n                         JOEL\n\n                         (TO HIMSELF)\n          Good riddance...\n          Brian steps in, taps on the door.\n\n                         BRIAN\n          You got a second? I think we might\n          have a big problem here. I'm not\n          sure what happened, but all of the\n          sudden Step says he doesn't want to\n          settle anymore. I think he\n          might've talked to a lawyer.\n          Joel goes to his desk, sits down.\n\n                         BRIAN\n          Like I say, General Mills isn't\n          going to make their offer official\n          until this settles.\n          Joel considers this.\n\n                         JOEL\n          I think Step is just chest-beating.\n          He does this all the time. He gets\n          all wound up, talks big, then he\n          always backs down. And that's with\n          his balls.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          50.\n\n          INT. PAROLE OFFICE - AFTERNOON\n\n          It's a bleak looking office with rows of cubicles. We PAN\n          past several cubicles where hardass parole officers meet with\n          their parolees -- various gang-bangers, drug dealers,\n          junkies, a hideous transvestite prostitute, etc. As we pan,\n          each officer is giving them nothing -- \"this is your last\n          chance,\" \"You expect me to believe that?\", etc. We continue\n          past officers giving them nothing, giving them nothing,\n          ending on a cubicle with Cindy, where a PAROLE OFFICER is\n          giving Cindy everything -- almost apologetic.\n\n                         PAROLE OFFICER\n          I'm sorry to even bring this up,\n          but you're not living with the drug\n          dealer anymore are you?\n          Cindy's parole officer is a sad schlub of a guy, about 50\n          with bushy grey hair and a mustache, he has a badge and a gun\n          on his belt.\n\n                         CINDY\n          Nope. I'm staying at Extended Stay\n          until I can find a place...\n          She smiles, flirtatiously waves her key/card.\n\n                         CINDY (CONT'D)\n          See?\n\n                         (SINCERE)\n          I really feel like I've turned my\n          life around. Thanks in large part\n          to you.\n\n                         PAROLE OFFICER\n\n                         (ALMOST BLUSHING)\n          It's okay. I'm just glad to see\n          you're doing so well... Ah, one\n          more thing I just need to ask you:\n          We had a little incident up in\n          Templeton a couple weeks back where\n          someone stole an expensive guitar\n          from a music store? Someone who\n          fit your description. You know\n          anything about that?\n\n                         CINDY\n          Huh? No... I was probably at work\n          that day.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          51.\n\n                         PAROLE OFFICER\n          Look Cindy, you realize you can't\n          screw up anymore right? I mean,\n          even something minor, and you could\n          go back to jail for a while this\n          time. I'd hate to see that happen.\n\n                         CINDY\n          Well yeah, but why would I steal a\n          guitar? I've got no musical\n          talent. I'm tone deaf.\n          They both laugh.\n\n                         PAROLE OFFICER\n          Heh heh, So am I. I can't carry a\n          tune to save my life.\n\n                         CINDY\n          Really? Wow...\n          Cindy acts fascinated by Parole Officer's lack of musical\n          talent. He happily goes on about it, forgetting about the\n          guitar...\n\n                         PAROLE OFFICER\n          Yeah, I could barely sing the Star\n          Spangled Banner in school...\n\n                         DISSOLVE TO:\n\n          EXT. REYNOLD'S EXTRACT BUILDING - PARKING LOT - DAY\n\n          It's the end of the workday. People walk to their cars.\n          Joel turns a corner and finds Cindy right in front of him.\n\n                         CINDY\n          Hey Mr. Reynolds.\n\n                         JOEL\n          Oh, hey Cindy. You can just call\n          me Joel.\n\n                         CINDY\n\n                         (FLIRTATIOUS)\n          Okay Joel. So you going to the\n          party tonight?\n\n                         JOEL\n          Oh yeah. Right, that's tonight...\n\n                         (AWKWARD)\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          52.\n\n          JOEL (CON T - D )\n          Yeah, I was thinking about it. Are\n          you going?\n\n                         CINDY\n          Yeah, definitely. Maybe I'll see\n          you there?\n\n                         JOEL\n          Yeah, I think I'll probably go.\n\n                         CINDY\n          Do you have the directions?\n\n                         JOEL\n          I'm not sure...\n\n                         CINDY\n          Here, I'll write it down just in\n\n                         CASE\n          Cindy opens her purse. We see at least FIVE WALLETS, SEVERAL\n          WATCHES, JEWELRY, etc. She takes out a pen and a piece of\n          pink, girly stationary and starts writing.\n\n                         CINDY (CONT'D)\n          I'll also put my number on here.\n          In case you want to call me some\n          time -- if you want.\n          Joel blushes awkwardly, like a junior high school kid.\n\n                         JOEL\n          Um... Okay. Sure.\n\n          EXT. JOEL'S HOUSE - EVENING\n\n          Joel pulls into the driveway and is STARTLED as he\n          practically runs over Nathan, flagging him down.\n          Joel MUTTERS obscenities as he reluctantly stops and rolls\n          down the window.\n\n                         NATHAN\n          Hi there. Almost missed ya.\n\n                         JOEL\n          Hi. I can't talk right now--\n\n                         NATHAN\n          Hey, I noticed you guys got a new\n          pool cleaner today. How is he?\n          We're thinking of changing\n          services.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          53.\n\n                         JOEL\n          Look Nathan, I gotta... Wait, you\n          mean yesterday, don't you?\n\n                         NATHAN\n          Huh?\n\n                         JOEL\n          The new pool cleaner. You saw him\n          yesterday right? Not today.\n\n                         NATHAN\n          No. It was today. The new guy.\n\n                         JOEL\n          What'd he look like?\n\n                         NATHAN\n          Blonde haired kid, about this high,\n          good looking. Real good looking.\n\n                         IN FACT--\n\n                         JOEL\n          You sure it was today? Not\n          yesterday?\n\n                         NATHAN\n          Yeah.\n\n                         JOEL\n          You're absolutely sure?\n\n                         NATHAN\n          Yeah. I know it was today, because\n          I came home for lunch. I was gone\n          all day yesterday. Anyway, you\n          think I could go ahead and get that\n           check from ya? Like I say, it's 55\n           dollars a plate, so that'd be 110\n           total. There's no tax...\n          Nathan leans up to scratch his back. Joel seizes the\n           opportunity and pulls away, burning a little rubber.\n\n          INT. JOEL'S HOUSE - BEDROOM -- MOMENTS LATER\n\n          Joel is on his cell phone, yelling in hushed tones at Brad.\n          He has the door shut so Suzie won't hear him.\n\n                         JOEL\n          What the hell were you doing at my\n          house today?!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          54.\n\n          BRAD (V.0.)\n          Oh, umm... nothing.\n\n                         JOEL\n          Bullshit!\n\n          BRAD (V.0.)\n          Look, don't worry about it bro'. I\n          won't charge you for this one.\n\n                         JOEL\n          Won't charge me for...? You had\n          sex with my wife again?!\n\n          BRAD (V.0.)\n          Well, I figured we already did it\n          once, so what's the big deal? I\n          mean, she said to stop by if I was\n          in the neighborhood, so... Besides,\n          I'm not gonna charge you--\n\n                         JOEL\n          Not gonna charge...? God damn you!\n          Yes you are gonna charge me! I'm\n          gonna pay you! You're not having\n          sex with my wife for free! And I\n          better not ever catch you anywhere\n          near my house ever again!\n          Joel slams down the phone. Then realizes it's a cell phone,\n          picks it back up and hits the \"End\" button.\n\n          INT. JOEL'S HOUSE - LIVING ROOM -- NIGHT\n\n          Suzie is asleep on the couch in her sweatpants. Joel walks\n          through, mumbles something about going to a party.\n\n          INT. JOEL'S CAR -- NIGHT\n\n          Joel pulls up to the house where the party is going on. He\n          stays in the car, checking it out.\n          Scanning Joel's POV, we see the band, Godscock, playing in\n          the backyard, with Rory on bass. They are set up on the\n          patio of this small two-bedroom suburban house. Most of the\n          people at the party are crowded around the keg, which is on\n          the other side of the backyard, ignoring the band. The band\n          sounds awful -- loud as hell, unmusical, uninspired. The\n          lead singer sings in that awful Eddie Vedder style, but even\n          more loud and overly dramatic. Rory acts all intense, in\n          stark contrast to the non-intensity of the music.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          55.\n          They all have that baggy-shorts tattooed mid-nineties look.\n          It's downright pathetic.\n          There's one drunk guy off to the side banging his head,\n          playing air-guitar and stumbling into the bushes.\n          Joel spots Cindy over by the keg, drinking, mingling. He\n          watches her for a beat, then shakes his head and drives away.\n\n                          CUT TO:\n\n          INT. SCOREBOARDS SPORTS BAR -- NIGHT\n\n          Joel sits at the bar talking to Dean, drinking a beer.\n\n                         JOEL\n          I can't believe my wife slept with\n          that guy.\n\n                         DEAN\n          Well... I thought you said it\n          wouldn't bother you.\n\n                         JOEL\n          I guess I didn't really think about\n          it long enough... I just wish it\n          hadn't been so easy for him.\n\n                         DEAN\n          Yeah, I'm tellin' ya, chicks really\n          go wild for that Brad...\n          (Off Joel's look)\n          Sorry.\n\n                         JOEL\n          No, you're right. He may be a\n          stupid, dull-witted moron, but he\n          can get any girl he wants. Me, I\n          had to work for it. I had to work\n          hard, get a career going, take\n          Suzie out a bunch of times, marry\n          her. But not Brad. He gets to\n          waltz into my house and have sex\n          with my wife just like that. Oh,\n          and by the way? That little prick\n          was at my house again today.\n\n                         DEAN\n          No shit? What was he doing?\n\n                         JOEL\n          Take a wild guess.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          56.\n\n                         DEAN\n          Wow... You pay a guy to do a job,\n          then he comes back and does it for\n          free.\n\n                         JOEL\n          I'm not going to let him do it for\n          free. No way. I'm paying him.\n\n                         DEAN\n          Really? How much?\n\n                         JOEL\n          Oh, I don't know. The same, I\n          guess. Why?\n\n                         DEAN\n          Hmm... So should I get my twenty\n          dollars from Brad then or...\n          Joel shoots Dean an angry look.\n\n                          DEAN (CONT'D)\n          We can worry about that later...\n          Look at the bright side, now you\n          can call Cindy.\n\n                         JOEL\n          I don't know... I feel weird about\n          it. Besides, she's at the party,\n          she probably won't be home 'til\n          late.\n\n                         DEAN\n          You know what you need to do?\n\n                         JOEL\n          (rolling his eyes)\n          I don't wanna do drugs Dean.\n\n                         DEAN\n          Look, I know I joke around a lot,\n          but this time I'm serious.\n          (like a doctor)\n          You should try smoking a little\n          pot. It's just an herb, it heals.\n          Stress can kill you, and--\n\n                         JOEL\n          I get paranoid when I smoke pot.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          57.\n\n                         DEAN\n          Not when you just smoke a little.\n          Come on. You ever meet my friend\n          Willie? Great guy. Really great\n          guy.\n          (as if it's a positive)\n          He's the guy I got that horse\n          tranquilizer from.\n\n                         JOEL\n          Oh, wonderful.\n\n          INT. WILLIE'S APARTMENT -- NIGHT\n\n          WILLIE loads up some kind of giant three-foot tall bong and\n          inhales a massive bong-load. He's a burly ex-football player\n          type who looks like he might have an extra y-chromosome or\n          two. Joel watches Willie, feeling a little uneasy. Dean\n          pontificates.\n\n                         DEAN\n          I've been reading about it --\n          they're making technological\n          advances now, coming up with great\n          drugs that can make you happy and\n          won't leave you with a hangover or\n          nothin'.\n\n                         WILLIE\n          (holding in bong-hit)\n          Right on.\n          Willie finally exhales. The exhale seems to go on way longer\n          than humanly possible, endless amounts of pot-smoke billowing\n          out (accomplished with special FX). He finally hands the\n          bong and lighter to Joel.\n\n                         JOEL\n          Oh, I don't know... I'm kind of a\n          light weight. I think that's too\n          much for me--\n\n                         WILLIE\n          (still holding out the\n          bong and lighter)\n          Bullshit.\n\n                         DEAN\n          Come on Joel. Don't worry, this\n          stuff isn't that strong.\n          (to Willie, re: Joel)\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          58.\n\n          DEAN (CON T-D)\n          He gets paranoid when he gets too\n          stoned.\n          Joel looks at Willie then at Dean, then takes the bong,\n          partly out of being intimidated by Willie.\n\n                         JOEL\n          Ah, what the hell.\n          Willie instructs Joel on the bong usage in the same\n          condescending way a weight-lifting instructor would.\n\n                         WILLIE\n          Okay, now this is a gravity bong.\n          Have you ever used one before?\n\n                         JOEL\n          Umm, I think... no.\n\n                         WILLIE\n          Okay, pay attention. Put your\n          thumb right here on the carburetor.\n          When I pull the plunger up and say,\n          \"let go\" I want you to let go and\n          inhale hard.\n          Joel's POV: Looking down the barrel of the three-foot bong\n          with macho-man Willie holding the lighter at the bowl.\n\n                         WILLIE (CONT'D)\n          Okay exhale!\n\n                         JOEL\n          You know, maybe I should just let\n\n                         YOU GUYS--\n\n                         WILLIE\n          (starting to get scary)\n          Bullshit! EXHALE HARD!\n          Mostly out of fear, Joel exhales. Willie puts the bong up to\n          Joel's face, lights it and starts lifting the plunger. Then\n          pushes it down.\n\n                         WILLIE (CONT'D)\n          Let go! Inhale! NOW!\n          Joel lets go of the carburator, inhales.\n\n                         WILLIE (CONT'D)\n\n                         (INSANE)\n\n          GO! GO! HARDER!!!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          59.\n          Joel inhales with all his might, sucking up massive amounts\n          of thick pot smoke as Willie pushes down the plunger.\n\n                         STONER-RIPPLE\n\n                         DISSOLVE TO:\n\n          WILLIE'S APARTMENT -- NIGHT\n          Willie, Dean and Joel sitting around, completely baked --\n          especially Joel. (We play most of the scene from Joel's\n          stoned, paranoid POV.)\n          Dean makes some kind of barely audible mumble -- or did he?\n\n                         JOEL\n          What?\n          Long pause.\n\n                         DEAN\n          Huh?\n          Joel's POV: looking from Dean to Willie. Willie sits there\n          with red eyes barely open. Willie turns slowly to Joel.\n\n                         WILLIE\n          Huh?\n\n                         JOEL\n          Oh, I thought somebody said\n          something.\n          Willie looks at Joel, stone-faced, adding even further to\n          Joel's paranoia. He stares at Joel for a long beat. Then,\n          in an instant, he's right up in Joel's face.\n\n                         WILLIE\n\n          BWAAAAAAAAAAAH!!!\n          Joel jumps back, scared shitless. Willie starts laughing his\n          ass off.\n\n                         WILLIE\n          Haaaah ha... The look on your face!\n\n                         (INSANE CACKLE)\n          Man you really do get paranoid when\n          you get stoned.\n\n                         JOEL\n          (fake, timid laugh)\n          Yeah, heh heh...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          60.\n\n                         DEAN\n          Hey Joel, why don't you call that\n          chick now?\n\n                         JOEL\n          What time is it?\n\n                         WILLIE\n          Time for you to call her and\n          finally get laid man!\n          (handing him the phone)\n          Come on!\n\n                         DEAN\n          It's twelve thirty. She might be\n          back by now.\n\n                         JOEL\n          Alright.\n          Joel gets the phone number out of his pocket.\n\n                         WILLIE\n          So what's this chick look like?\n\n                         JOEL\n          Oh, she's got brown hair. Pretty\n          hot. Kind of working-class\n          looking...\n\n                         WILLIE\n          What do you mean by that?\n           Willie stares at Joel for a beat. Joel can't tell if he's\n          offended Willie or not.\n\n                         JOEL\n          Umm... Oh you know,...\n\n                         WILLIE\n          Is she kind of slutty lookin'?\n\n                         JOEL\n          Yeah...\n          Beat. Joel's not sure if that was the right answer either.\n\n                         WILLIE\n          Alright! That's how I like 'em.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          61.\n\n                         JOEL\n          Yeah...\n\n                         (UNCOMFORTABLE LAUGH)\n          Kinda nasty, heh heh...\n          Joel starts dialing the number.\n\n                          JOEL (CONT'D)\n          I hope I don't wake her up...\n\n                         (LISTENS)\n          It's busy.\n\n                         DEAN\n          Alright. At least you know she's\n          home.\n\n                         JOEL\n          Yeah.\n\n                         WILLIE\n          Try her again. Come on.\n          Joel hits redial.\n\n                         JOEL\n          Still busy... Man, what kind of\n          person doesn't have call-waiting.\n\n                         WILLIE\n          I don't have call-waiting. I hate\n          call-waiting. Every time I hear\n          that goddamn clicking sound, I\n          wanna put my fist through someone's\n          head.\n          Beat. Once again, Joel doesn't know whether to shit or wind\n          his watch. Willie stares at him, then\n\n                         WILLIE\n          Haaa ha! Man you really do get\n          paranoid when you're stoned...\n          Seriously though, I fuckin' hate\n          call-waiting.\n\n                         JOEL\n\n                         (NERVOUS CHUCKLE)\n          Yeah...\n          Willie grabs the phone.\n\n                         WILLIE\n          Here let me dial. You're too\n          stoned.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          62.\n          Willie grabs the piece of paper with Cindy's number. He\n          looks at it, starts to dial, then pauses, realizing\n          something.\n          Willie looks up at Joel, with slowly building rage, then\n          hangs up the phone.\n\n                         WILLIE\n          I'll tell you why you're getting a\n          busy signal. This is my number.\n\n                         JOEL\n          Huh? But...\n          Beat.\n\n                         JOEL\n          Oh... You're joking right? Trying\n          to make me paranoid?\n          Joel waits for Willie to start cracking up. He doesn't. He\n          just continues glaring at Joel. We hear the FRONT DOOR\n          UNLOCK. Everyone looks.\n          CINDY enters.\n\n                         CINDY\n          Hi. Sorry I'm late, I...\n\n                         (NOTICING JOEL)\n          Joel? What are you doing here...?\n          Willie stands up and walks over to Joel's chair. Dean\n          suddenly stands up.\n\n                         DEAN\n          Well, it looks like you guys got a\n          lot to talk about here so I think\n          I'm just gonna go ahead and take\n          off. Later guys.\n          Dean bolts. Willie moves in closer on Joel. Joel starts to\n          leave, but Willie blocks him.\n\n                         WILLIE\n          Kinda slutty?\n          Willie grabs Joel and throws him against the wall. Joel\n          tries to make a break for the door, but Willie hauls off and\n          punches him across the face. The ass-kicking begins as we\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          63.\n\n          INT. JOEL'S HOUSE -- NIGHT\n\n           Joel limps into the house, his face bruised black and blue\n           from the ass-kicking. He looks awful.\n           As he limps into the bedroom as quietly as possible, he trips\n           on something, waking up Suzie. She turns on a light and sees\n          Joel.\n\n                         SUZIE\n          Oh my God Joel, are you alright?\n          What happened?\n\n                         JOEL\n          I'm fine. I'm fine. I just ah...\n          got my ass kicked. Go back to\n          sleep.\n\n                         SUZIE\n          What? By who? What happened?\n\n                         JOEL\n          It was just... some guy over at\n          Scoreboards.\n\n                         SUZIE\n          Let me drive you to the hospital.\n          You need to get checked out.\n\n                         JOEL\n          No. I'll be fine. I just want to\n          sleep right now, okay?\n\n                         SUZIE\n          You sure you're okay? It looks\n          like your nose is broken, and your\n\n                         EYE--\n\n                         JOEL\n\n                         (AGITATED)\n          Don't worry about it! People get\n          their asses kicked all the time!\n          It's no big deal. Go back to\n          sleep.\n\n          INT. REYNOLD'S EXTRACT BUILDING - MORNING\n\n          Joel walks past his Secretary.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          64.\n\n                         SECRETARY\n          Hi Joel. Brian wanted to see you--\n\n                         (NOTICING)\n          Oh my God, what happened?\n          Joel keeps walking, MUMBLES something about falling down some\n          stairs, goes into his office and shuts the door.\n\n          INT. JOEL'S OFFICE -- CONTINUOUS ACTION\n\n          Joel walks over to the window overlooking the production\n          area. He looks down and sees Cindy working, with her back\n          turned. Shakes his head.\n          Brian KNOCKS on the door and enters, looking worried.\n\n                         BRIAN\n          Hi... Did you talk to Step yet?\n\n                         JOEL\n          He isn't returning my calls.\n\n                         BRIAN\n          Shit... We've got problems. He did\n          hire a lawyer -- Joe Adler -- he's\n          that personal injury lawyer you see\n          on all the bus-stop benches. You\n          oughtta see this guy. He's a real\n          piece of shi--\n          (noticing Joel's face)\n          Oh man, what happened to you?\n\n                         JOEL\n          Oh, I fell down some stairs.\n\n                         BRIAN\n          Damn... Well anyway, I hate to say\n          this, but I think we're screwed.\n          There's no way this Adler guy is\n          gonna settle for anything less then\n          bankrupting us. Says he'll sue us\n          into the stone age.\n\n                         JOEL\n          (clutches his head\n\n                         MISERABLE)\n          Shit... I gotta talk to Step.\n          Brian looks at Joel's bruised face.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          65.\n\n                         BRIAN\n          Man, everyone's getting hurt.\n          Cindy came in with a black eye\n          today. You hear how she got it?\n\n                         JOEL\n          Ah... no.\n\n                         BRIAN\n          Step did it. Can you believe that?\n\n                         JOEL\n          No he--!\n\n                         (CATCHES HIMSELF)\n          What? Where did you hear that?\n\n                         BRIAN\n          That's what she told Mary.\n\n                         JOEL\n          But... Step? Does he even know\n          her?\n\n                         BRIAN\n          Apparently they've been going out.\n\n                         JOEL\n          What?!\n\n                         BRIAN\n          I know, it's weird. They didn't\n          even meet here. They met at a\n          grocery store or something. Just a\n          total coincidence.\n          Joel looks down at Cindy on the production floor, his mind\n          reeling.\n\n                         BRIAN\n          Anyway, we're gonna have to hire a\n          couple of new people because\n\n                         CINDY'S QUITTING--\n\n                         JOEL\n          Really?\n\n                         BRIAN\n          Yep. And if it's okay with you,\n          I'd like to go ahead and fire\n          Hector.\n\n                         JOEL\n          Fire Hector? What for?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          66.\n\n                         BRIAN\n          You know, Mary's purse? Sylvia's\n          wallet? It's gotta be him. Who\n          else could it be?\n          Joel looks down at Cindy with growing suspicion.\n\n                         JOEL\n          No. Don't fire him. Just trust me\n          on this. Give him another week.\n          If anything else is stolen, then\n          you can fire him.\n\n                         BRIAN\n\n                         (PUZZLED)\n          Alright. If you say so.\n          Brian looks Joel over.\n\n                         BRIAN (CONT'D)\n          Man, are you okay? Have you seen a\n          doctor?\n          Joel's Secretary BEEPS in.\n\n          SECRATARY (V.0.)\n          Joel, Dean is on line one for you.\n\n                         JOEL\n          Okay, thanks.\n\n                         (TO BRIAN)\n          I better get this.\n          Brian leaves.\n\n                         JOEL (CONT'D)\n          Hello.\n\n                         DEAN\n          Hey man. Sorry I bailed on you\n          like that last night. It's just\n          that I don't like to get involved\n          in other people's personal shit,\n          you know what I mean?\n\n                         JOEL\n          Uh-huh.\n\n                         DEAN\n          I didn't even know Willie had a\n          girlfriend. She must be new. Man,\n          Willie looked pissed.\n\n                         (CHUCKLES)\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          67.\n\n          DEAN (CON T'D)\n          I thought he was gonna take a swing\n          at you there for a second.\n\n                         JOEL\n          He did take a swing at me Dean.\n          Several swings. In fact, he beat\n          the living shit out of me.\n\n                         DEAN\n          Whoa, really?\n\n                         JOEL\n          Yes.\n\n                         DEAN\n          Wow. Man, that really goes to show\n          you -- this town is smaller than\n          you think. You really gotta be\n          careful.\n          Joel hangs up and walks out of his office, past his\n          Secretary.\n\n                         JOEL\n          I'm not feeling well. I'm going to\n          go home early.\n\n          INT. JOEL'S CAR -- DAY\n\n          Joel turns the corner to his house and does a double-take as\n          he sees BRAD'S TRUCK going the opposite direction.\n\n                         JOEL\n          Shit!\n          Joel slams on the brakes, turns around, chases Brad's truck\n          down and cuts him off, forcing him to stop. They both get out\n          of their vehicles. Joel is livid.\n\n                         JOEL\n          What the hell were you doing on my\n          street again?!\n\n                         BRAD\n          Dude, you weren't supposed to be\n          home for another four hours--\n          Whoa, what happened to your face?\n\n                         JOEL\n          (trying to improvise a\n          tough, snappy comeback,\n          but can't quite make it\n\n                         WORK)\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          68.\n\n                         JOEL (CONT'D)\n          The same thing that's gonna\n          happen.. Your face is gonna look\n          worse if... GOD DAMMIT! If I ever\n          catch you anywhere near my house or\n          my wife again, I'll have you\n          arrested.\n\n                         BRAD\n          For what? Suzie let me in.\n          Joel is stumped -- Brad actually has a point.\n\n                         JOEL\n          What the hell is wrong with you\n          anyway? Do you do this with all\n          your clients -- just keep coming\n          back and hanging around?\n\n                         BRAD\n          I don't know. This is my first\n          one.\n\n                         JOEL\n          What?! I thought you were a\n          professional!\n\n                         BRAD\n          Look man, I know she's your wife\n          an' shit, but you might as well\n          know -- I think we're in love.\n\n                         JOEL\n          In love?!\n\n                         (COMING UNGLUED)\n          HA! Man are you stupid. You are\n          so goddamn dumb. You think she\n          loves you? You're nothing but a\n          piece of ass to her. That's all.\n\n                         BRAD\n          I don't think so dude.\n\n                         JOEL\n          Oh, you don't think so \"dude?\"\n          Well did you ever think about this:\n          she doesn't even know that I paid\n          you to have sex with her -- did\n          that cross your small mind?\n\n                         BRAD\n          Uuh..\n\n                         \n\n                         \n\n                         \n\n                         \n\n          69.\n\n                         JOEL\n          How about I go home right now and\n          tell her? Tell her you did it for\n          the money. How about that loverboy?\n          Brad suddenly looks worried. This really freaks him out.\n\n                         BRAD\n          You wouldn't do that.\n\n                         JOEL\n          You don't think so? Watch me.\n\n                         BRAD\n          (realizing he's serious)\n           No... Dude, please don't. Please?\n          Joel starts back to his car.\n\n                         BRAD\n          Look man, we really have a special\n          thing going on. Please don't mess\n          it up...\n          Joel stops.\n\n                         JOEL\n          Don't mess it up?! You're talking\n          about my wife! My house! Stupid-\n          ass!\n          Joel gets in his car and starts it.\n\n                         BRAD\n          (calls out to him)\n          Dude, you can't do this to me.\n\n                         JOEL\n          Oh yes I can...\n          Joel peels out, drives half a block and turns into his\n          driveway.\n\n          INT. JOEL'S HOUSE - MOMENTS LATER\n\n          Joel walks in, still pissed off. Suzie is sitting on the\n          couch, a little surprised to see him.\n\n                         SUZIE\n          Oh hi. You're home early.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          70.\n\n                         JOEL\n\n                         (COLD)\n          Hi.\n          Joel walks over to the sliding glass door, looks outside at\n          the pool. It's filthy.\n\n                         JOEL\n          So how was that new pool cleaner?\n           Suzie is caught off guard -- wonders if she's busted -- but\n          she plays it cool.\n\n                         SUZIE\n          Um... What do you mean?\n\n                         JOEL\n          What do you think I mean?... Did\n          he do a good job cleaning the pool?\n\n                         SUZIE\n          Ah... well--\n\n                         JOEL\n          Did he get all the... leaves? It\n          doesn't really look that clean. I\n          mean I'm looking at it, and I'd say\n          it's pretty goddamn filthy. Did the\n          guy even clean it at all? It sure\n          doesn't look like it.\n\n                         SUZIE\n\n                         (NERVOUS)\n          Well yeah, I guess he didn't do a\n          very good job.\n\n                         JOEL\n          I think he did a horrible job. I\n          don't think we should use him\n          anymore.\n\n                         SUZIE\n          Okay.\n\n                         JOEL\n          Okay.\n          Suzie watches Joel leave, a slight look of guilt on her face.\n\n                         SUZIE\n          Are you all right, Joel? You want\n          an aspirin or anything?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          71.\n\n                         JOEL\n          No.\n\n          INT. JOEL'S HOUSE - BEDROOM - MOMENTS LATER\n\n           Quick shot of Joel staring up at the ceiling shaking his\n          head, can't believe all this.\n\n          EXT. STEP'S HOUSE -- NEXT DAY\n\n           In a WIDE SHOT we see Joel's car is parked on the street. He\n           walks up and rings the doorbell. We see Step answer, talk to\n          him and then invite him in.\n\n          INT. STEP'S HOUSE -- CONTINUOUS\n\n          Step and Joel enter. Step's 300 POUND HALF-BROTHER sits on a\n          ratty couch watching TV, drinking a huge plastic bottle of\n          Pepsi. He looks like he's been sitting there for years. The\n          TV is deafeningly loud.\n\n                         STEP\n          Wow, I don't think you've ever been\n          to my house before. Have you?\n\n                         JOEL\n          (talking above the TV)\n          Yeah, I don't think so. I would've\n          remembered...\n\n                         STEP\n          This is my half brother Phil.\n          Joel starts to motion \"don't get up,\" then realizes that's\n          not happening anyway. Phil nods.\n\n                         JOEL\n          Hi... Hey Step, can we talk in\n          another room.\n\n                         STEP\n          Sure, let's go out back.\n\n          EXT. STEP'S HOUSE - BACK YARD -- A LITTLE LATER\n\n          Joel and Step sit at a picnic table.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          72.\n\n                         STEP\n          You know, my lawyer told me not to\n          talk to you.\n\n                         (BEAT)\n          You're not here to try to talk me\n          out of suing are you?\n\n                         JOEL\n          Oh, no... No, I'm just kind of\n          curious about... ah... So you've\n          been going out with Cindy, huh?\n\n                         STEP\n          Yes sir. She's my girlfriend. We\n          might even get married after all\n          this lawsuit-settlement stuff gets\n          worked out.\n\n                         JOEL\n          .so some of the guys at work are\n          saying you gave Cindy that black\n          eye.\n\n                         STEP\n          What? That ain't true at all.\n\n                         JOEL\n          Yeah, I know it's not.\n\n                         STEP\n          She got it from falling down some\n          stairs.\n\n                         JOEL\n          Hmm... Look, you might wanna be\n          careful with Cindy.\n\n                         STEP\n\n                         (DEFENSIVE)\n          What do you mean?\n\n                         JOEL\n          Well, I'm not sure how to put this,\n          but... You know, you got a lot of\n          money coming your way with this\n          settlement. You might wanna be\n\n                         CAREFUL--\n\n                         STEP\n          Oh no. No, she didn't even know\n          about that 'til after we started\n          going out.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          73.\n\n                         JOEL\n          You sure about that?\n\n                         STEP\n          Oh yeah. I didn't tell her about\n          it for a while 'cuz I was kind of\n          embarrassed, you know? You don't\n          tell a girl you just met that you\n          lost one of your balls. Especially\n          a girl as hot as Cindy.\n\n                         JOEL\n          Yeah...\n\n                         (DELICATELY)\n          You know she lives with this guy\n          Willie right?\n\n                         STEP\n          That's her ex. She broke up with\n          him. She's gonna move out. She\n          just needs to get all her stuff\n          outta there.\n\n                         JOEL\n          You sure about that?\n\n                         STEP\n          Oh yeah. She's moving in with me.\n\n                         JOEL\n          Oh. Hmm...\n\n                         STEP\n          Look, I know Cindy's got some\n          problems, but she means well.\n          She's the best thing that ever\n          happened to me.\n\n                         JOEL\n          Well, okay... If you say so.\n          Another thing -- you just might\n          want to watch your back. Some of\n          the guys at work who think you gave\n          Cindy the black eye were talking\n          about paying you a visit -- you\n          know, getting even.\n\n                         STEP\n          Oh. Well I'm not worried about\n          that.\n          (dead-serious, proud)\n          I could kick anyone's ass at that\n          whole company.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          74.\n\n          INT. JOEL'S HOUSE - DAY\n\n           Brad and Suzie are by the pool which is filthy. Brad starts\n          coming on to Suzie. She pushes him away.\n\n                         SUZIE\n          No Brad, we can't. I'm sorry, but\n          we have to stop doing this.\n\n                         BRAD\n          Why?\n\n                         SUZIE\n          It's not right. I feel horrible.\n          Besides, I think Joel's getting\n          suspicious. And you gotta start\n          cleaning the pool too.\n\n                         BRAD\n          But I've never felt this way about\n          anyone before. And I've been with\n          a lot of chicks.\n\n                         SUZIE\n\n                         (TURNED OFF)\n          Uh-huh... Look Brad, the truth is\n          I love my husband. I really do.\n          This was all a big mistake. I'm\n          sorry. I don't know what got into\n          me, but we have to stop this. I\n          want to make my marriage work\n          again. I'm going to tell Joel\n          about the whole thing and just hope\n          he forgives me. And even if he\n          doesn't, at least I won't be\n          carrying around this horrible\n          feeling. I just can't stand that\n          he doesn't know.\n\n                         BRAD\n          Uh... This doesn't mean we can't\n          still see each other though, right?\n\n                         SUZIE\n          Ah, yes it does.\n\n                         BRAD\n          Why?\n\n                         SUZIE\n          Because of all the things I just\n          said.\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n                         75\n\n                         SUZIE (CONT'D)\n\n                         (PATIENTLY)\n          Do you need me to say them again?\n\n                         BRAD\n          Can I see you tomorrow?\n\n                         SUZIE\n          No.\n\n                         BRAD\n\n                         (PLEADING)\n          How about next week?\n\n                         SUZIE\n          No. Look, you gotta go Brad. Joel\n          could be home any second.\n\n                         BRAD\n          I'll call you tomorrow.\n\n                         SUZIE\n          (just trying to get rid of\n\n                         HIM)\n          Okay. Okay, just go and we'll talk\n          later.\n          Brad leans to kiss her, she pushed him away and he finally\n          leaves.\n\n                         SUZIE\n\n                         (TO HERSELF)\n          God, what a moron.\n\n          INT. JOEL'S OFFICE - DAY\n\n          Joel sits deep in his chair, bummed out, staring down at the\n          manufacturing area. Brian walks in.\n\n                         BRIAN\n          So... you ready?\n\n                         JOEL\n          Huh?\n\n                         BRIAN\n          The meeting with Step's lawyer. Or\n          lawyers I should say. It's today\n          remember?\n\n                         JOEL\n          Oh shit... Alright.\n          Joel drags himself out of the chair.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          76.\n\n          INT. REYNOLDS EXTRACT - CONFRENCE ROOM - DAY\n\n          JOE ADLER, is holding court with the various lawyers and\n          paralegals waiting for the meeting to start. As promised, he\n          is awful. He looks like Henry Winkler with an extra Y\n          chromosome and a lot of steroids. (Maybe cast Gene Simmons\n          with his hair pulled back in a pony tail.)\n\n                         ADLER\n          .You see, if both his balls had\n          been knocked clean off, he would be\n          a good case, but not a great case:\n          A man with no balls is no man at\n          all. He's a freak. He's barely\n          human. He's gross. And a jury will\n          never feel like they can walk in\n          the shoes of a ball-less, neutered,\n          he/she freak. But Step. He's\n          still got one ball - barely. He's\n          still a man. A man who's very\n          manhood has been jeopardized, but\n          still a man. And that manhood,\n          that very sense of what you are as\n          a human being is hanging by a\n          thread. Jesus, you can't get more\n          dramatic than that. That brave\n          ball, hanging on for dear life,\n          hanging on for justice, is going to\n          be the hero of this trial. I'm\n          tellin' ya this Step guy is the\n          fuckin' Holy Grail, the Powerball\n          Jackpot. And you all laughed at me\n          when I bought those bus bench ads.\n          But I knew the asses of those poor\n          slobs that sit on those benches and\n          ride those sweaty, stinking, cattle\n          cars are our future. And I --\n          Joel and Brian walk in.\n\n                         ADLER\n          Oh, hello. I'm Joe Adler...\n          Everybody starts introducing each other.\n\n          INT. REYNOLDS EXTRACT - EMPLOYEE BREAK ROOM - DAY\n\n          A bunch of employees including Mary, Garielle, and Rory are\n          talking, getting worked up.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          77.\n\n                         RORY\n          .And when they sell the company,\n          Joel and Brian are gonna be the\n          one's who get rich, and--\n\n                         MARY\n          And we're the ones doing all the\n          work.\n\n                         GABRIELLE\n          That's right.\n\n                         RORY\n          It's bullshit man. We should get a\n          piece of it. I work my ass off.\n\n                         MARY\n          Gabrielle and I work harder than\n          anybody. I should be making what\n          Brian makes. If you add up all the\n          crates I move, I lift 10,000 pounds\n          a day. Minimum.\n\n                         GABRIELLE\n          That's right. Here he's gonna make\n          a million dollars, and we're the\n          ones who do everything. I went to\n          college. For three years.\n\n                         MARY\n          If we quit, this place couldn't\n          run. They wouldn't be able to sell\n          this place for anything.\n          JIM, a tall skinny 50-something guy with a ridiculously big\n          mustache and a little paunch, chimes in.\n\n                         JIM\n          That's why what we should do is, is\n          we should all go on strike --\n          demand stock in the company before\n          it sells. If General Mills knew\n          we were on strike, they wouldn't\n          buy this place until the strike was\n          over. That way they'd have to give\n          us stock.\n          Jim points to his head, gives everyone a \"how's that\" nod.\n          It starts to build steam.\n\n                         RORY\n          That's right man. We should do it.\n          We should strike.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          78.\n\n                         MARY\n          That's right. I could get a job at\n          Gemco like that. At Gemco, all the\n          employees are owners -- even says\n          so on the name tags.\n\n                         GABRIELLE\n          Mmm hmm. I could get a job at\n          Southwest Airlines...\n\n          INT. REYNOLDS EXTRACT - CONFRENCE ROOM - DAY\n\n          The meeting is already in progress. On Adler's side of the\n          table are two other lawyers and a couple of paralegals. On\n          Joel's side it's just he, Brian and Joel's secretary. Maybe\n          one lawyer who doesn't say much.\n          Everybody has in front of them a small stack of documents.\n          The confrence room, like Joel's office, has a full length\n          window facing the manufacturing area.\n\n                         ADLER\n          Ok gentlemen. We've gone through\n          everything and the only way we\n          would even begin to consider a\n          settlement would be to the tune of\n          the number you see on the bottom of\n          page 18. Does everyone have this?\n           Joel and the rest of them find page 18. Joel is stunned by\n          the number.\n\n                         JOEL\n          What!!!?\n          (so pissed he can barely\n          get the words out)\n          We don't have this much money! Not\n          even close!\n\n                         ADLER\n          Not in cash you don't. Of course\n          not. But if you were to sell off\n          your assets: the property lease,\n          the equipment, the--\n\n                         JOEL\n          What the ff-- Are you shitting\n          me!? That would bankrupt us!\n\n                         BRIAN\n          This is what I've been trying to\n          tell you Joel...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          79.\n\n                         JOEL\n          If you think I'm just going to give\n          up this entire company that I built\n          from the ground up--\n          Adler jumps up, dripping with phoney, forced indignation.\n\n                         ADLER\n          How about what my client gave up!?\n          His testicles! How about that!?\n          He walks over to the door...\n\n                         ADLER\n          In fact, I'll make a deal with you -\n          - we will drop this case right now\n          if you come over here and put your\n          testicles right here\n          (indicates the space\n          between the door and the\n\n                         HINGES)\n          and let me slam this door like\n          this...\n          Adler SLAMS the door ridiculously hard.\n\n                         ADLER\n          Go ahead. We can settle this right\n          now -- call it even. I will drop\n          this case right now if you let me\n          slam your balls in this door,\n\n          BECAUSE THAT IS WHAT HAPPENED TO MY\n\n          CLIENT!\n\n                         JOEL\n          It was an accident!\n\n                         ADLER\n          Not according to our investigation.\n          We believe that, in fact, there was\n          gross negligence...\n\n          INT. REYNOLDS EXTRACT - MANUFACTURING AREA - CONTINUOUS\n\n          The employees, same ones in the breakroom, are milling\n          around, talking, the idea of the strike gaining momentum.\n          Rory points up to the confrence room.\n\n                         RORY\n          I heard those guys up there are the\n          guys from General Mills.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          80.\n          Employees' POV: Adler pacing around, yelling, Joel yelling\n          back, etc. [They can't hear any of it.]\n\n                         MARY\n          Mmm hmm...\n\n                         JIM\n          See, now they're probably up there\n          negotiating right now -- cuttin' up\n          the pie that we baked. That's what\n          it looks like to me.\n          The employees all nod in agreement.\n          Employees POV: Adler pointing at his balls, pointing to the\n          door again, about to slam it. One of his lawyers stops him.\n\n                         RORY\n          We gotta act fast. They could be\n          about to close the deal.\n\n                         JIM\n          Yeah, and leave us out in the cold.\n\n                         RORY\n          Yeah, then it's too late. If\n          they've already sold it we can't\n          get a piece of it. We gotta act\n          fast. We need to do one of those\n          walk outs.\n\n                         JIM\n          Well, we better do it now.\n\n                         RORY\n          Okay, who's in? We need a show of\n          force. Come on, it's now or\n          never...\n          We PAN around the employees as the idea builds momentum,\n          ending on HECTOR, who looks completely confused by it all.\n\n          INT. REYNOLDS EXTRACT - CONFRENCE ROOM - CONTINUOUS\n\n          The meeting heats up.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          81.\n\n                         ADLER\n          Okay then, let me go back to my\n          previous offer: I will gladly come\n          down on that price -- I'll come all\n          the way down to zero and drop this\n          case -- if you go over there right\n          now and slam your testicles in that\n          door! Because--\n\n                         JOEL\n          I don't wanna slam my testicles in\n          the door! I want you to be\n          reasonable! You won't even budge\n          one penny! Come on!\n\n                         ADLER\n          Like I say, if you slam your--\n\n                         JOEL\n          I'll slam your balls in the door!\n\n                         ADLER\n          I'm sorry, did you just threaten\n          me?\n          Brian puts his hand on Joel, motions him to calm down.\n\n                         BRIAN\n          Look, we need to cool off a minute.\n          We'll be right back.\n          Brian leads Joel out of the room.\n\n          HALLWAY - CONTINUOUS\n\n                         JOEL\n          I don't need this. I'm going home.\n\n          INT. REYNOLDS EXTRACT - MANUFACTURING AREA - CONTINUOUS\n\n          Joel walks down the stairs. The group of employees see him\n          and ready themselves for the big confrontation. Joel notices\n          them all looking at him and stops.\n\n                         JOEL\n          Yeah?... What?\n          But they are ill-prepared. No one knows who should talk\n          first. It's incredibly awkward. They all look at each other\n          and mutter things like, \"go ahead\" \"you first\". Finally...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          82.\n\n                         RORY\n          Umm... We were just uh...\n\n                         JIM\n          Well, Rory was talking about how\n          you guys are doing this deal with\n          General Mills and we just think\n          that ah... We were considering the\n          idea of ah...\n\n                         RORY\n          Well, we just think that we should\n          maybe get a piece of it, you know\n          cuz we do all the work... And if we\n          don't... um...\n          Joel's in no mood for this. He goes off on them.\n\n                         JOEL\n          You know what? Fine. Fine.\n          You're all in charge -- all of you.\n          (gestures to all the\n\n                         EMPLOYEES)\n          As of now. You run the goddamn\n          place. Go ahead. In fact, you can\n          go up there right now and meet with\n          Adler. He may slam your balls in\n          the door, but woohoo! You're the\n          boss!\n          Joel storms out, leaving the employees standing there.\n          A BICKERING MATCH erupts over who was supposed to do the\n          talking, who said they would say what, who backed down first,\n          etc. \"I was gonna say something but you interrupted,\" \"You\n          didn't say anything when he was leaving, so I thought you\n          were quitting. I would've stood up to him.\"\n          As the argument dies down, one by one they all go back to\n          their posts, muttering.\n\n          INT. JOEL'S HOUSE - KITCHEN - DAY\n\n          Joel is sitting at the table, picking at some food, looking\n          miserable. Suzie comes over, gathers up her nerve.\n\n                         SUZIE\n          Listen Joel, there's something I\n          have to tell you. I think we need\n          to be honest with each other.\n          Suzie sits down.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          83.\n\n                         SUZIE (CONT'D)\n          I'm not sure how to say this, but --\n          well, you've been so caught up in\n          you're work lately, and I'm here\n          alone all day and sometimes I just--\n\n                         JOEL\n          You banged the pool cleaner.\n\n                         SUZIE\n          Wha...\n          Suzie is stunned.\n\n                         JOEL\n          That's what you're trying to tell\n          me right? You had sex with Brad?\n\n                         SUZIE\n          You knew?\n\n                         JOEL\n          Yes I knew. I hired him.\n\n                         SUZIE\n          Well I know you hired him, but how\n          did you know about--\n\n                         JOEL\n          I don't mean I hired him to clean\n          the pool, I mean I hired him to\n          have sex with you.\n\n                         SUZIE\n          What?\n\n                         JOEL\n          He's a gigolo Suzie.\n          Suzie is stupefied.\n\n                         SUZIE\n          But... what... Why?\n          Joel is so fed up, he just tells her everything.\n\n                         JOEL\n          I hired him to have an affair with\n          you so that I could have an affair\n          without feeling guilty. I was\n          really drunk and on some kind of\n          horse tranquilizer and--\n\n                         \n\n                         \n\n                         \n\n                         \n\n          84.\n\n                         SUZIE\n          Brad was getting paid?...\n          (disbelief, hurt)\n          So you've been paying Brad this\n          whole time? All fifteen times?!\n\n                         JOEL\n          FIFTEEN TIMES?! Jesus Christ\n          Suzie!\n          Joel sinks into his chair, shaking his head.\n\n                         JOEL (CONT'D)\n          I only paid him once -- well,\n          twice. The rest was on the house.\n          Long beat as Suzie tries to let it all sink in.\n\n                         SUZIE\n          You wanted to have an affair with\n          another woman?\n\n                         JOEL\n          Yes. But I didn't.\n          Suzie paces around for a moment, reeling, processing all\n          this. Then, decisively,\n\n                         SUZIE\n          You asshole.\n\n                         JOEL\n          Oh, I'm the asshole?\n\n                         SUZIE\n          Yes! How could you?\n\n                         JOEL\n\n                         (LAUGHS)\n          How could I? How could you?!!!\n          You didn't have to have sex with\n          him. You could've simply said \"No\n          thanks. Just clean the pool,\" but\n          you didn't, did you?! No, you took\n          him up on his little offer and had\n          sex with him -- fifteen times!\n\n                         SUZIE\n          None of this would've happened if\n          you hadn't hired him.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          85.\n\n                         JOEL\n          Okay. I'll admit, I made a big\n          mistake. I was drunk, on drugs,\n          stressed, sexually frustrated and I\n          shouldn't have hired a male\n          prostitute to seduce you. But if\n          you had simply been faithful, none\n          of this would've happened.\n          Suzie just looks at him for a beat.\n\n                         SUZIE\n          You're sick, you know that?\n          Beat. Joel can't really argue this point.\n\n                         JOEL\n          What do you see in Brad anyway?\n          He's borderline retarded. You\n          probably could've been arrested for\n          having sex with a guy that dumb.\n\n                         SUZIE\n          That's it. I'm leaving.\n          Suzie heads for the door. Joel follows after her.\n\n                         JOEL\n          No. You're not leaving me. I'm\n          leaving you!\n\n                         SUZIE\n          Fine.\n          Joel opens the door, about to storm out, only to find\n          NATHAN, standing right there about to ring the doorbell.\n\n                         NATHAN\n          Oh, hey guys. Glad I caught ya.\n          You guys hardly ever answer the\n          door. Heh heh.\n          They are both so flustered, they can barely talk.\n\n                         SUZIE\n          Now's not a good time Nathan.\n          Joel turns around, storms off back into the house.\n\n                         NATHAN\n          Oh, you guys goin' somewhere?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          86.\n\n                         SUZIE\n          No. Look, we can't talk right now.\n\n                         NATHAN\n          Well, you think I could go ahead\n          and get that check from ya then?\n          I'm just trying to balance my\n          checkbook here...\n\n                         SUZIE\n          Now's not a good time.\n\n                         NATHAN\n          When would be a good time, you\n          think?\n\n                         SUZIE\n          I don't know.\n\n                         NATHAN\n          See the thing is--\n\n                         SUZIE\n          Okay tomorrow.\n\n                         NATHAN\n          Great, what time?\n\n                         SUZIE\n          I don't know. Just come by\n          tomorrow. I can't talk now.\n\n                         NATHAN\n          Okay great. And if you could just\n          go ahead and have that check,\n          that'd be great. It's a hundred\n          and ten. That's two plates at\n\n                         FIFTY-FIVE--\n\n                         SUZIE\n          Yeah, Okay...\n          Suzie shuts the door, cutting him off.\n\n           EXT. EXTENDED STAY AMERICA SUITES -- DAY\n\n           Joel checks into an Extended Stay America hotel.(a chain of\n          hotels that rent by the week.)\n          Quick shot of Joel sitting alone in the room. He drops his\n          suitcase and glumly sits down on the bed, grabs the remote.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          87.\n          He turns on Spectravision and surfs the Adult titles, decides\n          he's not into it and switches back to regular TV only to find\n          American Idol is on. He stares at it for a beat, then flops\n          down on the bed and stares at the ceiling.\n\n          INT. SCOREBOARDS SPORTS BAR -- NIGHT\n\n          Joel sits at the bar, drowning his sorrows. Dean is over by\n          the cash register, tending to some business. Brad enters,\n          walks over to Joel. Joel looks the other way.\n\n                         BRAD\n          Hey man... I know you probably\n          want to kick my ass, but--\n\n                         JOEL\n          I couldn't kick your ass if I\n          wanted to. You're a good 10 years\n          younger than me, and I'm a pussy.\n          So why don't you just leave me\n          alone.\n\n                         BRAD\n          I just wanted to tell you, I'm not\n          gonna see Suzie anymore. You don't\n          have to worry.\n          Joel keeps drinking his beer, stares straight ahead.\n\n                         BRAD\n          The last time I was over there, she\n          broke it off; told me to quit\n          coming over... She said she was\n          gonna tell you everything -- you\n          know, about us. She's really into\n          you dude. I guess that's why she\n          married you an' shit... You're a\n          lucky guy... Sorry if I messed shit\n          up.\n          Beat. Joel takes another swig.\n\n                         JOEL\n          Why'd you have to get hung up on\n          Suzie? You could have any girl you\n          want.\n\n                         BRAD\n          Yeah, but I want Suzie. And I\n          can't have her.\n\n                         JOEL\n          You had her fifteen times.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          88.\n\n                         BRAD\n          Yeah, but she doesn't love me dude.\n          It's just not the same... Anyway,\n          just wanted to tell you that.\n\n                         JOEL\n          Well... You told me.\n\n                         BRAD\n          Alright, later...\n          Brad starts to leave. Then he stops, turns around.\n\n                         BRAD\n          Oh, one more thing... I quit my\n          landscaping job... And I don't\n          think I'm really cut out to be a\n          gigolo. So I was wondering if you\n          had any openings over there at your\n          extract place?\n\n                         JOEL\n\n                         (EXASPERATED SIGH)\n          Brad, you had sex with my wife.\n          I'm not gonna give you a job, okay?\n\n                         BRAD\n          Okay... Sorry man.\n          Brad walks away. Joel stares at his beer for a beat,\n          thinking. He calls out to Brad.\n\n                         JOEL\n          Hey Brad?...\n          Brad stops.\n\n                         BRAD\n          Yeah?\n\n                         JOEL\n          I don't know... Maybe come by the\n          office tomorrow. Fill out an\n          application. I'll see what I can\n          do.\n\n                         BRAD\n          Cool. Thanks man.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          89.\n\n          INT. JOEL'S OFFICE - NEXT DAY\n\n          Brian sits with Joel. They both look pretty miserable.\n          Brian looks down at some papers, shaking his head.\n\n                         BRIAN\n          We're screwed. General Mills has\n          pretty much withdrawn the offer\n          pending a really favorable\n          settlement with Step.\n          (shaking his head)\n          Not only do we not sell the\n          company, we could wind up bankrupt.\n\n                         JOEL\n          (muttering to himself)\n          So I don't sell the company, don't\n          get the money, I'm bankrupt, I\n          don't get Cindy, I paid a guy to\n          have sex with my wife, and she\n          actually did it...\n\n                         BRIAN\n          Excuse me?\n\n                         JOEL\n          Nothing.\n\n          EXT. JOEL'S HOUSE - POOL -- DAY\n\n          Suzie is trying to clean the pool herself, struggling with\n          the long pole with the net at the end. She looks miserable.\n\n          NATHAN (O.S.)\n          Hello?\n          Nathan enters through the back gate.\n\n                         SUZIE\n\n                         (MUTTERS)\n          Shit...\n          Nathan walks over to Suzie. She's in no mood for this. She\n          acts as unfriendly as possible.\n\n                         NATHAN\n          Why are you cleaning the pool\n          yourself? That new guy didn't work\n          out?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          90.\n\n                         SUZIE\n          Yeah, didn't work out.\n\n                         NATHAN\n          Boy, you just can't get good help,\n          eh?\n\n                         SUZIE\n          Yeah.\n\n                         NATHAN\n          So, did you get a chance to write\n          that check?\n\n                         SUZIE\n          Look Nathan, Joel and I aren't\n          going to that dinner okay?\n          Nathan acts deeply disappointed.\n\n                         NATHAN\n          Well gee, I wish you would've told\n          me that before I went and bought\n          the tickets.\n\n                         SUZIE\n          Joel never agreed to this Nathan,\n          and neither did I.\n\n                         NATHAN\n          Well, it sure sounded like you guys\n          were going. Leslie was gonna talk\n          to you about it, but you didn't\n          return our calls. I mean, I\n          already bought these tickets.\n          They're nonrefundable. I really\n          wish you guys had been a little\n          more clear with me...\n          It's the last straw. Suzie has had enough. She unleashes\n          all her pent-up aggression on Nathan.\n\n                         SUZIE\n          Okay, let me be really clear with\n          you then. When we say \"I don't\n          think so,\" or even \"I'm not sure,\"\n          that means \"no.\" Why can't you\n          understand that?\n\n                         NATHAN\n          Well, I just--\n\n                         \n\n                         \n\n                         \n\n                         \n\n          91.\n\n                         SUZIE\n          Shut up! In fact, let me be even\n          more clear with you. We don't like\n          you! Is that clear enough? You're\n          dull, you never shut up, you never\n          listen, and we don't want anything\n          to do with you ever again!\n          Nathan freezes, in some kind of state of shock. He starts to\n          shake a little. Suzie just keeps going -- it feels too good\n          to stop.\n\n                         SUZIE\n          Is that clear enough for you\n          Nathan?! Is that...?\n          Nathan starts to go into some kind of seizure.\n\n                         SUZIE\n\n                         (WORRIED)\n          Nathan?\n          Nathan's eyes roll back into his head, and he collapses.\n          Suzie SCREAMS.\n\n          EXT. EXTENDED STAY AMERICA SUITES -- NIGHT\n\n          Joel pulls into the parking lot. He looks surprised, seeing\n          something on the other side of the lot that gets his\n          attention.\n\n                         JOEL\n\n                         (TO HIMSELF)\n          No way...\n          From JOEL'S POV, we see Cindy pull up and get out of her car.\n          Joel watches as she gets out with a grocery bag and heads up\n          the stairs. Joel gets out and watches her from a distance.\n          He sees her go into a room and shut the door.\n          He stares up at the door for a beat. Then, with a look of\n          determination, Joel walks up the stairs and knocks on her\n          door.\n\n          INT. CINDY'S ROOM -- CONTINUOUS ACTION\n\n          Cindy opens the door, a little startled to see Joel, but\n          pleasant to him.\n\n                         CINDY\n          Oh... Joel. I ah,...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          92.\n\n                         JOEL\n          Hi.\n\n                         CINDY\n          What're you...? What's up? How'd\n          you know I was here?\n\n                         JOEL\n          Ah, actually, I'm staying here too.\n          Down on the first floor, around the\n          back. I thought I saw you so I\n          ah...\n\n                         CINDY\n          Well, come in.\n          Joel enters, stands in the living room. Cindy heads in to\n          the kitchen.\n\n          CINDY (O.S.)\n          Do you want something to drink? I\n          think all I have is Diet Coke.\n          Joel notices MARY'S PURSE lying on the coffee table. He\n          stares at it.\n\n                         JOEL\n          No thanks.\n          Cindy comes back in with a Diet Coke.\n\n                         CINDY\n          Have a seat.\n          Joel remains standing, looking at the purse.\n\n                         JOEL\n          That's Mary's purse... Isn't it?\n\n                         CINDY\n          What?\n\n                         JOEL\n          Right there. That's Mary's purse.\n\n                         CINDY\n          Oh that? No, that's mine... So\n          how are things at work?\n\n                         JOEL\n          That's Mary's purse. You stole it,\n          didn't you?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          93.\n           Cindy acts like he's being silly. There's nothing about her\n          demeanor that would make anybody think she's lying.\n\n                         CINDY\n          No. It probably just looks like\n          it. There's a lot of those.\n\n                         JOEL\n          I've never seen another one. You\n          probably have Sylvia's wallet in\n          here somewhere too, don't you? And\n          everything else that's been stolen\n          from my employees.\n\n                         CINDY\n          Joel, are you okay?\n\n                         JOEL\n          No, I'm not. That's Mary's purse\n          Goddammit! Okay? Everyone blamed\n          Hector. He almost got fired.\n          Doesn't that bother you?\n\n                         CINDY\n          (innocent, sweet)\n          Joel, I don't know what you're--\n\n                         JOEL\n          Hector! Hard working guy, never\n          did anything wrong. And what are\n          you doing with Step? You're trying\n          to screw him out of his settlement\n          money aren't you?\n\n                         CINDY\n          I have no idea what you're talking\n          about.\n\n                         JOEL\n          Yes you do! You're the only reason\n          he's suing us aren't you? You know\n          how much work it took for me to\n          build up that company? You just\n          don't care about anybody do you?\n          What are you, some kind of\n          sociopath?\n          Cindy looks like Joel might be getting to her.\n\n                          JOEL (CONT'D)\n          You can't even admit that you stole\n          this purse can you? You just can't\n          do it.\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          94.\n\n                         JOEL (CONT'D)\n          In fact, you probably can't tell\n          the truth about much of anything,\n          can you?...\n          Cindy turns away from him, looking down at the floor.\n\n                         JOEL\n          I bet Cindy's not even your real\n          name is it? Who are you? Where\n          the hell are you from?\n          Cindy, still looking away, doesn't answer.\n\n                         JOEL (CONT'D)\n          You can't answer can you? Because\n          if you said one true thing, you'd\n          have to tell the truth about\n          something else and then it would\n          all unravel wouldn't it? Then\n          you'd have to admit that you stole\n          this purse and God knows what else.\n          Beat. Cindy still looking away, down at the floor. We see\n          her eyes well up, about to cry, but Joel doesn't notice.\n\n                         JOEL\n\n                         (COMPOSES HIMSELF)\n          Well, I'm leaving now.\n          Joel picks up the purse.\n\n                         JOEL\n          And I'm taking this purse with me.\n          If it really is yours, you can call\n          the police and tell 'em I stole\n          it... In fact, I'm gonna call the\n          police and report it...\n          Joel walks towards the door. Then Cindy slumps down on the\n          couch, mutters something, still looking down at the floor,\n          her voice cracking slightly.\n\n                         CINDY\n          Please don't...\n          Joel stops.\n\n                         JOEL\n          What?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          95.\n\n                         CINDY\n          (still looking down)\n          Please don't report it to the\n          police. I'm on probation. I'll go\n          to jail. For a long time.\n\n                         JOEL\n          Well... Maybe you should've thought\n          about that before you started\n          ripping off my employees.\n          Joel starts to open the door.\n\n                         CINDY\n          Joel? Please? I'll leave Step\n          alone. I promise. He'll drop the\n          lawsuit.\n          Joel considers this.\n\n                         JOEL\n          How do I know that?\n\n                         CINDY\n          You can keep the purse. If I don't\n          leave him alone; if he doesn't drop\n          the lawsuit, then you can report\n          me. Please?\n          Beat.\n\n                         JOEL\n          Hmm... I guess that ah... Do you\n          have Sylvia's wallet, and Jim's\n          watch? Can I get those too?\n          Beat. Cindy nods, still looking down. Joel considers it.\n\n                         JOEL\n          Well... Okay then. I guess that\n          works.\n\n                         (REALIZING)\n          And I guess you just admitted that\n          you stole the purse. That's good,\n          I guess... A step in the right\n          direction...\n          Joel sits down on the couch also. With her head still down,\n          Cindy is weeping quietly. Joel doesn't notice, looking\n          straight ahead.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          96.\n\n                         JOEL\n          So what's your deal anyway?... I\n          mean, how did you end up like this?\n          Joel finally looks over, notices that she's crying. He's\n          caught off guard.\n\n                         JOEL\n          .Ah... Cindy?\n          Cindy breaks down and starts bawling.\n\n                         JOEL (CONT'D)\n          Okay, now you see... that's what\n          I'm talking about. You're trying\n          to manipulate me now, and I'm not\n          gonna fall for it...\n          Cindy starts bawling even harder.\n\n                         JOEL (CONT'D)\n          I really hope you're not faking\n          this right now, because I'm feeling\n          really bad. Are you faking it?\n          Cindy shakes her head \"no.\"\n\n                         JOEL\n          I'm sorry, I was just curious, you\n          know, how a person ends up like...\n          this...\n          Cindy suddenly starts BAWLING hysterically.\n          Joel stands there awkwardly, not sure if he should hug her or\n          comfort her in any way.\n\n                         JOEL\n          Never mind. I'm sorry...\n          Joel tentatively puts a comforting arm around her and she\n          leans in to him, crying on his chest.\n          He puts his other arm around her and she snuggles in even\n          closer. As her crying gradually subsides she snuggles in\n          even more. Finally, she lifts her head and they start\n          kissing. As they get hot and heavy we\n\n                         DISSOLVE TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          97.\n\n          EXT. EXTENDED STAY AMERICA SUITES -- MORNING\n\n          Wide shot of the Hotel. It's a beautiful morning.\n\n          INT. CINDY'S ROOM - DAY\n\n          Joel wakes up, looking more relaxed than we've ever seen him.\n          We PULL OUT to reveal that he's alone in Cindy's bed. He\n          sits up, yawns. He has a big satisfied smile on his face.\n\n                         JOEL\n          Cindy?\n          He looks around, realizes he's alone. Then suddenly looks\n          worried.\n\n                         JOEL (CONT'D)\n          Oh shit!\n          He scrambles for his pants, then looks relieved as he\n          realizes his wallet is still there. He sets down the pants,\n          then after a beat, picks them up again, checks inside the\n          wallet and sees there's still cash and credit cards. Then he\n          looks up at the chest of drawers and sees: Mary's purse,\n          Sylvia's wallet, and a watch, placed side by side.\n          He lies back in bed, and shuts his eyes, grinning again.\n\n          INT. REYNOLD'S EXTRACT /MANUFACTURING AREA -- MORNING\n\n          Extract bottles moving along the assembly line full steam.\n          Mary and Gabriella gossiping.\n\n                         MARY\n          (looks at her watch)\n          Joel hasn't been in all morning.\n          can you believe that?\n\n                         GABRIELLE\n          If we come in late, we get fired.\n          And here we're working our tails\n          off, and he's gonna get rich.\n          Joel walks in, bright-eyed and cheery, greeting people. He\n          walks over to Mary carrying her PURSE.\n\n                         JOEL\n          Here you go Mary.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          98.\n          Joel hands her the purse. Mary looks at it, not quite sure\n          how to react, not ever wanting to appear grateful for\n          anything -- not in her nature.\n\n                         JOEL (CONT'D)\n          And by the way, Hector didn't take\n          it. Cindy did.\n          Joel walks off. Mary just shakes her head at him. She\n          whispers to Gabriella.\n\n                         MARY\n          Can you believe that? Blaming\n          Cindy just to protect Hector.\n\n          INT. JOEL'S OFFICE - DAY\n\n          Joel is at his desk. Brian comes in.\n\n                         BRIAN\n          Step's here to see you.\n\n                         JOEL\n          Really? Bring him in.\n\n                         BRIAN\n          No, he's outside. At the loading\n          dock. Wants to talk to you alone\n          back there for some reason.\n\n                         (CRUDE IMMITATION)\n          \"Man to man.\"\n\n          EXT. REYNOLDS EXTRACT - LOADING DOCK\n\n          Step is pacing around, waiting. Joel comes out.\n\n                         JOEL\n          Hi Step...\n\n                         STEP\n          Hey.\n\n                         JOEL\n          How you doin'? How's your, ah...\n\n                         STEP\n          (looking down at his\n\n                         CROTCH)\n          Oh it's okay. Some days it still\n          hurts, but they've got me on some\n          pills. It's not too bad I guess...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          99.\n\n                         JOEL\n          Well... that's good.\n          They both sit down on the edge of the dock.\n\n                         STEP\n          Look, ah... Cindy left me.\n          Joel's nods, not surprised, but sympathetic.\n\n                         JOEL\n          Wow... Bummer...\n\n                         STEP\n          Yeah, it is a bummer... You know, I\n          thought the worst part was having\n          my balls knocked off, but you know\n          what the worse part is? Dealin'\n          with all this bullshit... I'm sick\n          of that Adler guy tellin' me what\n          to do. He's a real dick.\n\n                         JOEL\n          Yeah, he sure is.\n\n                         STEP\n          The truth is, I just want to have\n          my old life back -- I just want to\n          go back to work. I'm a workin'\n          man; that's what I do.\n\n                         JOEL\n          Yeah... I'm beginning to think I\n          might be the same way... I'm a\n          little worried about what I'd do\n          with too much time on my hands.\n\n                         STEP\n          I just lay around and watch TV all\n          day.\n\n                         JOEL\n          Yeah,... I think I do a lot worse.\n\n                         STEP\n          The problem is, if I bankrupt the\n          company, there won't be a job to go\n          back to.\n\n                         JOEL\n          You don't have to bankrupt the\n          company.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          100.\n\n                         STEP\n          Yeah, but then if I drop the\n          lawsuit, you'll sell the company,\n          and the new company might not hire\n          me.\n\n                         JOEL\n          Well, maybe I don't have to sell\n          the company... You know I've been\n          thinking; all these years I've been\n          building this company, dreaming\n          about the day I could sell it and\n          retire, but what would I really do\n          if I retired? It's like that old\n          saying -- it's not about the\n          destination, it's about the\n          journey?\n          Step just stares at him blankly, he lost him.\n\n                         JOEL\n          I guess what I'm saying is, too\n          much free time might not be such a\n          good thing -- like that old saying,\n          idle hands are the Devil's\n          playground?\n          Step's never heard that one either.\n\n                         STEP\n          I'm sorry, I don't do much book\n          readin'.\n\n                         JOEL\n          What I'm saying is, I'm thinking\n          maybe I won't sell the company...\n\n                         STEP\n          Really?\n\n                         JOEL\n          that is, if you dropped the\n          lawsuit. -- and remember, you'll\n          still get that insurance money --\n          probably a couple hundred thousand.\n          What do you think?\n\n                         STEP\n          Hmm. That sounds fair... But\n          under one condition...\n\n                         JOEL\n          What's that?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          101.\n\n                         STEP\n          You make me floor manager.\n\n                         JOEL\n          Deal.\n          They shake hands.\n\n          INT. REYNOLDS EXTRACT - MANUFACTURING AREA\n\n          Joel walks in with Step at his side. Addresses the\n          employees.\n\n                         JOEL\n          Hold the line!\n          Mary shuts off the conveyer belt.\n\n                         JOEL\n          Okay, listen up everybody.\n          (Waits for them to settle)\n          I've decided not to sell the\n          company...\n          Gasps and murmurs among the employees.\n\n                         JOEL\n          And I'm making Step the new Floor\n          Manager.\n          More gasps and murmurs.\n\n                         JOEL\n          And if anyone doesn't like it, I\n          hear they're hiring over at\n          Gemco... But just remember, at\n          Gemco, the owner doesn't know your\n          names; you never even meet him,\n          he's at an office up in Chicago\n          somewhere and you get an auto-\n          response if you try to email him to\n          complain about anything. Here, you\n          can come up to my office any time\n          you have a problem. Thanks.\n          Joel walks off. Brian catches up with him.\n\n                         BRIAN\n          Huh? You're not selling?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          102.\n\n                         JOEL\n          It's about the journey Brian. The\n          journey.\n          ANGLE on Mary. She and Gabrielle start right back up.\n\n                         MARY\n          You know, if Joel's going to put\n          him in charge, we should go on\n          strike. You know, at Gemco, the\n          union handles the strikes and you\n          don't even have to--\n          PULL OUT as Step cuts her off.\n\n                         STEP\n          Quit yapping and get back to work\n          or you're fired.\n          Step walks off -- maybe pops a testosterone pill. Mary and\n          Gabrielle keep muttering and shaking their heads.\n          LONG PULL OUT as things get back to normal at the factory.\n\n          INT. CHAPEL - DAY\n\n          We are CLOSE ON NATHAN, in a coffin, embalmed. We PULL OUT\n          to see mourners lined up, taking a last look at the body.\n          Joel is among them. He looks down at Nathan for a moment and\n          then continues to his seat. A few rows back, we see SUZIE,\n          sitting by herself, dressed in black.\n\n          EXT. CEMETERY - DAY\n\n          Quick shot of Nathan's casket being lowered into the ground\n          as the priest says the last few words.\n\n          EXT. CEMETERY - A LITTLE LATER\n\n          People hug and console each other. Joel sees Suzie, walks\n          over to her.\n\n                         JOEL\n          Hi... You doing okay?\n\n                         SUZIE\n          Yeah, I'm okay.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          103.\n\n                         JOEL\n          I heard you were right there when\n          it happened. That must've been\n          rough.\n\n                         SUZIE\n          It was horrible Joel. He came over\n          to ask for that check, and I\n          just...\n          Suzie breaks down, starts CRYING.\n\n                         SUZIE (CONT'D)\n          .I just lost it. I started\n          yelling at him. I said horrible\n          things. He had an aneurism and I\n          probably caused it.\n\n                         (CRYING UNCONTROLLABLY)\n          I think the last thing I said to\n          him was \"shut up.\" Those were the\n          last words he heard.\n          Joel hugs her, consoling.\n\n                         JOEL\n          It's okay, it's not your fault...\n          It's not your fault.\n          Suzie's crying subsides a little.\n\n                         SUZIE\n          It could happen to any of us Joel.\n          Any of us could have an aneurism.\n          We could die at any moment.\n\n                         JOEL\n          Yeah, I know... I know... But we\n          probably won't. It'll be alright.\n          Suzie starts to regain her composure.\n          They stand there for a beat.\n\n                         JOEL\n          You wanna go get something to\n          eat... or something?\n          Beat. Suzie still sniffling a little.\n\n                         SUZIE\n          Yeah, okay. Sure.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          104.\n          They walk off towards the cemetery gates. After a while,\n          Joel hands Suzie a Kleenex.\n\n                         JOEL\n          Here...\n\n                         SUZIE\n          Thanks.\n          They walk a little further. Joel looks at the Chapel nearby.\n\n                         JOEL\n          Maybe we should've been married in\n          a Church like that one. Instead of\n          the Botanical Gardens.\n\n                         SUZIE\n          I thought you liked the Botanical\n          Gardens?\n\n                         JOEL\n          Yeah, but... a church just seems\n          more -- I don't know -- official.\n\n                         SUZIE\n          You think it would've made a\n          difference?\n\n                         JOEL\n          I don't know... So, are we still\n          married?\n\n                         SUZIE\n          Well, legally yes.\n\n                         JOEL\n          I mean otherwise.\n\n                         SUZIE\n          Hmmm... We can talk about it I\n          suppose.\n\n                         JOEL\n          Alright.\n          They walk for a beat.\n\n                         JOEL\n          You know, this is really bad,\n          but... Oh never mind.\n\n                         SUZIE\n          What?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          105.\n\n                         JOEL\n          Well, as I was looking down at\n          Nathan there, I was thinking...\n          That's the longest I've ever seen\n          him with his mouth shut.\n          Suzie LAUGHS in spite of herself.\n\n                         SUZIE\n          Joel!\n          They walk off into the distance as we\n\n          FADE OUT.\n\n\n\n                        THE END\n\n\n\n\n\nExtract\nWriters :   Mike Judge\nGenres :   Comedy  Crime  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Joel Reynolds is the owner and founder of Reynold's Extract, a flavoring-extracts company. Although his business is successful, his marriage is now completely sexless. His best friend Dean, a bartender and pothead, offers to ease his mind with Xanax and various other drugs, but the straight-laced Joel refuses.\nOne day, a series of mishaps occurs at the extract factory, resulting in an employee (Step) losing a testicle. Cindy, a con artist and drifter, reads a news story about the accident. Hatching a get-rich-quick scheme, she gets a temporary job at the factory, flirting with Joel in order to manipulate him into giving her more information about Step. She also begins a series of petty thefts from her co-workers, who suspect or openly accuse each other of the thefts. Although Step initially decides not to sue the company, he changes his mind after a \"chance meeting\" with Cindy (that she sets up in order to meet and flirt with him). Under Cindy's influence, Step hires ambulance-chaser attorney, Joe Adler.\nJoel, unhappy in his marriage and mistaking Cindy's manipulations for genuine attraction to him, entertains the idea of an affair with Cindy; however, he still loves Suzie, and wants to avoid actions that would leave him with regrets later. At the bar, Dean suggests that Joel hire a gigolo to seduce Joel's wife, so that Joel can then have a guilt-free affair of his own (as \"revenge\" for his wife cheating on him, first). Joel initially balks at the idea; but, after his judgment is impaired after ingesting a ketamine tablet that Dean mistakenly told him was just a Xanax, Joel eventually agrees. The friends hire Brad to seduce Suzie into an affair, while posing as the pool cleaner. The next morning, Joel sobers up, realizes what he has done, and tries to stop Brad from going to his house; but by then, Brad and Suzie have already begun an affair. Things backfire further, as Brad falls in love with Suzie and wants to run away with her. After smoking marijuana with Dean and his friend Willie, Joel attempts to call Cindy, but soon realizes that he is calling Willie's number. Just then, Cindy walks into the apartment. Willie realizes that Joel is trying to get with Cindy [who lives with Willie—they're lovers], and, infuriated, punches Joel in the face.\nJoel meets with Adler and his associates, in the factory office, to discuss the terms of the settlement. The workers, believing that the meeting is about a buy-out of the factory by General Mills, organize a strike. Frustrated by Adler's uncompromising negotiating style and the growing disrespect from his employees, Joel storms out and goes home—where Suzie admits her affair with Brad to him. Joel admits to Suzie that he hired Brad to do it, then leaves the house after their annoying, overly-talkative Nathan appears at their door.\nJoel moves into a motel, where he spots Cindy, staying in another room. When he goes to her room, he notices a purse stolen from one of his employees, along with other stolen items, and realizes that Cindy is not only a thief, but is also behind a lot of the company's problems. He begins to leave and call the police, but softens when Cindy confronts him and breaks down in tears. Ultimately, the two spend the night together. The next morning, Cindy disappears, but leaves the stolen items behind.\nStep meets with Joel at the factory, where he offers to drop the lawsuit if Joel promotes him to floor manager. Meanwhile, while cleaning the pool herself, Nathan stops by and Suzie loses her temper. She tells him what she really thinks of him, and just as she finishes her tirade, he collapses and dies. Feeling guilty, Suzie attends the funeral, where she runs into Joel. After a few awkward moments, the two agree to share a ride later, hinting at a possible reconciliation. It is revealed that Cindy has scammed Adler, too: she steals his luxury car, leaving him Step's truck in its place."}