{"title": "Field of Dreams", "full_text": "Field of Dreams\nWriters :   Phil Alden Robinson\nGenres :   Drama  Family  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Ray Kinsella is a novice Iowa farmer who lives with his wife Annie and daughter Karin. In the opening narration, Ray explains how he had a troubled relationship with his father, John Kinsella, who had been a devoted baseball fan. While walking through his cornfield one evening, Ray hears a voice whispering, \"If you build it, he will come.\" Ray continues hearing the voice before finally seeing a vision of a baseball diamond in his field. Annie is skeptical of his vision, but she allows Ray to plow the corn under in order to build a baseball field. As Ray builds the field, he tells Karin the story of baseball's 1919 Black Sox Scandal. As months pass and nothing happens at the field, Ray's family faces financial ruin until, one night, Karin spots a uniformed man in the field. Ray recognizes the man as Shoeless Joe Jackson, a deceased baseball player idolized by Ray's father. Thrilled to be able to play baseball again, Joe asks to bring others to the field to play. He later returns with the seven other players banned as a result of the 1919 scandal.\nRay's brother-in-law, Mark, cannot see the baseball players and warns Ray that he will go bankrupt unless he replants his crops. While in the field, Ray hears the voice again, this time urging him to \"ease his pain.\"\nRay attends a PTA meeting at which the possible banning of books by radical author Terence Mann is discussed. Ray decides the voice was referring to Mann. Ray comes across a magazine interview dealing with Mann's childhood dream of playing for the Brooklyn Dodgers. After Ray and Ann both dream about Ray and Mann attending a baseball game together at Fenway Park, Ray convinces his wife that he should seek out Mann. Ray heads to Boston and persuades a reluctant, embittered Mann to attend a game with him at Fenway. While at the ballpark, Ray again hears the voice; this time urging him to \"go the distance.\" At the same time, the scoreboard \"shows\" statistics for a player named Archibald \"Moonlight\" Graham, who played one game for the New York Giants in 1922, but never had a turn at bat. After leaving the game, Mann eventually admits that he, too, saw the scoreboard vision.\nRay and Mann then travel to Chisholm, Minnesota where they learn that Graham had become a doctor and had died sixteen years earlier. During a late night walk, Ray finds himself in 1972 and encounters the then-living Graham, who states that he had moved on from his baseball career. He also tells Ray that the greater disappointment would have been not having a medical career. Graham declines Ray's invitation to fulfill his dream; however, during the drive back to Iowa, Ray picks up a young hitchhiker who introduces himself as Archie Graham. While Archie sleeps, Ray reveals to Mann that he had denounced Shoeless Joe as a criminal to his father and that was the reason for the rift between father and son. After the fight, Ray refused to play catch with his father; something that he now regrets. When the three arrive back at Ray's farm, they find that enough players have arrived to field two teams. A game is played and Archie finally gets his turn at bat.\n\nThe next morning, Mark returns and demands that Ray sell the farm. Karin says that they will not need to sell because people will pay to watch the ball games. Mann agrees, saying that \"people will come\" in order to relive their childhood innocence. Ray, after much thought, refuses to sell and a frustrated Mark scuffles with him. Karin is accidentally knocked off the bleachers during the scuffle. The young Graham runs from the diamond to help, becoming old \"Doc\" Graham the instant he steps off of the field, and saves Karin from choking. Ray realizes that Graham sacrificed his young self in order to save Ray's daughter. After reassuring Ray that his true calling was medicine and being commended by the other players, Graham leaves. Suddenly, Mark is able to see the players and urges Ray not to sell the farm.\nAfter the game, Shoeless Joe invites Mann to enter the cornfield; Mann accepts and disappears into the corn. Ray is angry at not being invited, but Joe rebukes him: if Ray really wants a reward for having sacrificed so much, then Ray had better stay on the field. Joe then glances towards home plate, saying \"If you build it, he will come\". The catcher then removes his mask, and Ray recognizes him to be his father as a young man. Shocked, Ray realizes that \"ease his pain\" referred to John Kinsella, and believes that Joe was the voice all along; however, Joe implies that it was Ray himself.\nRay introduces his father to Annie and Karin. As his father heads towards the cornfield, Ray asks him if he wants to have a game of catch. They begin to play and Annie happily watches. Meanwhile, hundreds of cars can be seen approaching the baseball field, fulfilling Karin and Mann's prophecy that people will come to watch baseball."}