{"title": "Flash Gordon", "full_text": "FLASH GORDON\r\n\r\n\r\n\r\n                                   Written by\r\n\r\n                                Lorenzo Semple Jr.\r\n\r\n\r\n                         \r\n          FADE IN:\r\n                         \r\n          EXT. WIDE AFRICAN LANDSCAPE - MORNING\r\n                         \r\n          At first only darkness, then the rising sun paints in an\r\n          endless savanna from horizon to horizon. We hear savage drums\r\n          beating in the distance coming from some unknown place.\r\n                         \r\n          The sun clears the horizon. Suddenly it changes amazingly:\r\n          the white disc goes through a rapid series of color\r\n          transitions, from yellow to green to purple to an incredible\r\n          BLOOD RED. From it shoots a RED LIGHTNING BOLT.\r\n                         \r\n          The sky echoes with THUNDER.\r\n                         \r\n          We hear a HOWLING ethereal wind, but not a twig of the brush\r\n          stirs as bolt after bolt of RED LIGHTNING rips the sky, with\r\n          each one a TITLE or CREDIT appearing.\r\n                         \r\n          Under FINAL CREDIT snow is beginning to fall on the burning\r\n          blood-red savanna.\r\n                         \r\n          EXT. PLANE IN FLIGHT - DAY\r\n                         \r\n          I's a Twin Otter with the logo of some commuter airline. It\r\n          buzzes along over pleasant countryside, through a sky that's\r\n          almost unnaturally serene and filled with fleecy white clouds.\r\n                         \r\n          INT. PLANE IN FLIGHT - DAY\r\n                         \r\n          There are just two passengers in the cabin. One is DALE ARDEN,\r\n          a great looking dark-haired girl sitting by herself and\r\n          reading a book entitled \"KARATE FOR THE SINGLE GIRL.... A\r\n          Guide to Survival In The City.\" A few rows forward, near the\r\n          open door into the pilots' compartment, is FLASH GORDON.\r\n          He's studying a football play-sheet, one of those diagrammed\r\n          things with X's and 0's for the players and dotted-line arrows\r\n          indicating the directions of movement.\r\n                         \r\n          Suddenly the plane makes a violent bump. It almost knocks\r\n          the book from DALE'S hand. She looks out the window with\r\n          sudden fright, tossing hair out of her eyes, in a gesture\r\n          that's habitual to her in moments of stress.\r\n                         \r\n          There's nothing to see outside but the pretty clouds. She\r\n          looks forward again and watches FLASH standing up easily,\r\n          leaning in t..e cockpit doorway to speak to the PILOTS.\r\n                         \r\n          INT. PLANE/ COCKPIT - CONTINUOUS\r\n          (CO-P:ILOT, DALE, FLASH, PILOT)\r\n                         \r\n                          FLASH\r\n           What was that, fellas?\r\n           2.\r\n                         \r\n                          PILOT\r\n           Clear-air turbulence, is all. Nothing\r\n                          SERIOUS\r\n                         \r\n                          CO-PILOT\r\n           But nothing you'd want to toss a\r\n           third-down pass through either --\r\n           (Grinning back at\r\n                          FLASH)\r\n           Can I have an autograph for my kid,\r\n           Mr. Gordon?\r\n                         \r\n                          FLASH\r\n           Sure -- my pleasure.\r\n                         \r\n          As FLASH takes a bit of paper from the CO-PILOT, the plane\r\n          takes another jolt, even more violent than the first.\r\n                         \r\n                          PILOT\r\n           Wow. Call Westchester Approach, see\r\n           what they've got.\r\n                         \r\n                          FLASH\r\n           I sure hope we don't have to turn\r\n           back. I mean this is first day of\r\n           training camp, I wouldn't want to be\r\n                          LATE --\r\n                         \r\n                          PILOT\r\n           Seat-belt time.\r\n                         \r\n          FLASH starts back to his seat. The plane jumps again, shudders\r\n          violently. He holds on, calls up front:\r\n                         \r\n                          FLASH\r\n           Maybe it'd be smoother if you went\r\n                          HIGHER --\r\n                         \r\n                          DALE\r\n           Will you SHUT UP?\r\n           (as FLASH's head\r\n                          SWIVELS)\r\n           Look, Mister Flash Gordon, they have\r\n           their hands full -- just let 'em\r\n           drive.\r\n                         \r\n          INT. PLANE - CONTINUOUS\r\n          (DALE, FLASH)\r\n                         \r\n          The plane buffets. FLASH is sent reeling, catches hold of\r\n          the rack above DALE, lowers himself into the seat next to\r\n          her. He buckles fast, takes out a candy bar and offers it\r\n          to her.\r\n           3.\r\n                         \r\n                          FLASH\r\n           When you're nervous, it can help to\r\n           chew on something\r\n                         \r\n                          DALE\r\n           Thanks a lot -- I look dumb enough\r\n           to take candy from a stranger?\r\n                         \r\n                          FLASH\r\n           I'm not a stranger exactly -- You\r\n           know my name.\r\n                         \r\n                          DALE\r\n           Who doesn't. Number one draft pick,\r\n           cover of PEOPLE mag -- what'd the\r\n           GIANTS sign you for, eighty-nine\r\n           million? Big deal!\r\n                         \r\n                          FLASH\r\n           Of course.\r\n                         \r\n                          DALE\r\n           God, I hate flying -- I'm Dale Arden\r\n           it's crazy of me to hate flying --\r\n           I'm a travel agent, you see? -- I've\r\n           just been checking out a little hotel\r\n           in Vermont -- can I still have that\r\n           candy bar?\r\n           (and in the same breath)\r\n           Are we going backward?\r\n                         \r\n                          FLASH\r\n           Backwards?\r\n                         \r\n                          DALE (GASP)\r\n           Holy cow! Look at the clouds!\r\n                         \r\n          EXT. SKY - POV FROM PLANE WINDOW - DAY\r\n                         \r\n          The pretty white clouds are changing above and beginning to\r\n          surround the airplane. Over the engines we HEAR that same\r\n          ethereal wind rising which we heard in the opening. Slowly\r\n          and terrifyingly, the sun starts turning BLOOD RED. The clouds\r\n          race faster, faster, until they are actually streaming past\r\n          the plane from behind.\r\n                         \r\n          INT. PLANE - DAY\r\n                         \r\n          FLASH and DALE -- faces bathed in the eerie light. Speechless-\r\n          DALE grasps the football player's hand with all her strength.\r\n                         \r\n          EXT. A FANTASTIC GREENHOUSE - DAY\r\n                         \r\n          It is a huge and rambling, antique, standing in semiruinous\r\n          isolation in a pretty country landscape. The sun has turned\r\n           4.\r\n                         \r\n          the SAME BLOOD RED we saw from the airplane, and clouds race\r\n          across it with unnatural velocity.\r\n                         \r\n          In the center of the greenhouse rises a glass-paned tower\r\n          through which we glimpse something MIRROR BRIGHT. Floating\r\n          high in the air above the structure are several silvery helium-\r\n          filled balloons, secured by wires. As we move closer, we\r\n          discern a MAN moving about actively on a platform inside the\r\n          central tower, about half-way up:\r\n                         \r\n          INT. GREENHOUSE TOWER - DAY\r\n          (MUNSON, TV NEWSMAN, ZARKOV)\r\n                         \r\n          The man is DR. HANS ZARKOV: big, bearded, feverish looking\r\n          and seemingly half mad with exhaustion. In striking contrast\r\n          to the antique greenhouse exterior, here there are all kinds\r\n          of computers and displays connected together in a slapdash\r\n          fashion. Quantities of neglected plants, most brown and\r\n          dead or dying, hide the works in here from outside view. As\r\n          Zarkov runs around throwing switches and eyeing displays, a\r\n          grim-voiced TV. NEWSMAN is appearing and speaking from a\r\n          good-sized television screen above the main control console:\r\n                         \r\n                          TV NEWSMAN\r\n           The extraordinary weather disturbances\r\n           reported from Africa this morning\r\n           are now crossing the Atlantic, and\r\n           are expected to reach the East Coast\r\n           of the United States by noon.\r\n           According to scientists at NASA, the\r\n           Earth is being struck by an immense\r\n           stream of cosmic energy, apparently\r\n           the result of some catastrophic\r\n           stellar accident beyond the reaches\r\n                          OF --\r\n                         \r\n          ZARKOV whirls, slams the TV SOUND OFF and yells at the\r\n          silently mouthing NEWSMAN on the screen.\r\n                         \r\n                          ZARKOV\r\n           Fools! Can't you understand? This\r\n           is no accident-- it's an ATTACK! An\r\n           attack planned by a MIND! This is\r\n           ATTACK!\r\n                         \r\n          MUNSON, a scared looking assistant, comes running up the\r\n          stairs with a computer print-out sheet.\r\n                         \r\n                          MUNSON\r\n           Dr. Zarkov! Look at the report from\r\n           the last balloon!\r\n                         \r\n          ZARKOV grabs it, eyes it.\r\n           5.\r\n                         \r\n                          ZARKOV\r\n           I predicted it, didn't I?\r\n                         \r\n                          MUNSON\r\n           Yes, sir -- you sure did. And this\r\n           funny sun too ---\r\n                         \r\n                          ZARKOV\r\n           Ozone layer starting to crack up.\r\n           By tonight Carbon dioxide will be\r\n           combining with free nitrogen to form --\r\n           (breaks off, crumpling\r\n                          THE SHEET)\r\n           Well, this is it.\r\n                         \r\n                          MUNSON\r\n           Sir, the President is on the TV behind\r\n                          YOU --\r\n                         \r\n                          ZARKOV\r\n           What the hell do I care? I tried to\r\n           warn him -- he called me mad, like\r\n           all the others.\r\n                         \r\n          BOOM! The TV screen EXPLODES in a fine shower of glass.\r\n                         \r\n                          ZARKOV (CONT'D)\r\n           Time for us to go, Munson. Get your\r\n           toothbrush and whatever.\r\n                         \r\n                          MUNSON\r\n           Go where?\r\n                         \r\n                          ZARKOV\r\n           Up. Up and at him.\r\n                         \r\n          Stunned, MUNSON turns his head and glances at something big\r\n          and MIRROR BRIGHT gleaming behind foliage in center of tower.\r\n                         \r\n                          MUNSON\r\n           You're crazy!\r\n                         \r\n          Perfectly calm except for the maniacal glint in his eyes,\r\n          ZARKOV pulls out a revolver and points it at MUNSON.\r\n                         \r\n                          ZARKOV\r\n           I can't handle the capsule alone get\r\n           your toothbrush.\r\n                         \r\n          INT. COCKPIT TO SKY - POV\r\n          (CO-PILOT, PILOT)\r\n                         \r\n          The PILOTS watch these clouds also, transfixed with disbelief.\r\n          They speak with that incredible calmness characteristic of\r\n          professional airmen in a moment of impending catastrophe.\r\n           6.\r\n                         \r\n                          PILOT\r\n           What's ,e word from Westchester\r\n           Approach, Bill?\r\n                         \r\n                          CO-PILOT\r\n           Zip. All chanels dead.\r\n           (Reacting to the panel)\r\n           Say, get a load of the VOR's....\r\n                         \r\n          The directional needles are going crazy. All the instruments\r\n          are going crazy. Displays flash impossible symbols. The\r\n          PILOT gapes at them a moment, then returns his gaze to the\r\n          sky and swallows.\r\n                         \r\n                          PILOT\r\n           On the left, about six o'clock\r\n           high......\r\n                         \r\n          The racing stream of clouds is parting open like in some\r\n          surreal painting. From the cortex LASER-like bolts of RED\r\n          LIGHTNING shoot out. Like a missile, one zaps right over the\r\n          plane's nose with a horrible crackling NOISE.\r\n                         \r\n                          PILOT (CONT'D)\r\n           Hold on tight, let's put baby down\r\n           right here......\r\n                         \r\n          The CO-PILOT reaches up and hits the flap control. There is\r\n          a whooshing crackling ZAP! The whole cockpit FLARES OUT\r\n          with an intolerable blinding flash of RED LIGHT.\r\n                         \r\n          INT. PASSENGER CABIN - CONTINUOUS\r\n                         \r\n          The cockpit door flys off its hinges, admitting a gale of\r\n          wind that scatters FLASH'S play sheets like autumn leaves.\r\n          FLASH unsnaps his belt, leaps up and races forward.\r\n                         \r\n          INT. COCKPIT - CONTINUOUS\r\n          (DALE, FLASH)\r\n                         \r\n          The TWO PILOTS are gone, vanished without trace. Wind from\r\n          the shattered windows assaults FLASH as he charges in. He\r\n          stumbles forward as the plane noses into a dive. Recovering\r\n          he scrambles into the left-hand seat, grabs hold of the\r\n          bucking wheel yoke, pulls back and kicks at the rudder pedals.\r\n          DALE lurches in against the tornado.\r\n                         \r\n                          DALE\r\n           Can you fly it?\r\n                         \r\n                          FLASH\r\n           I can fly all right -- I've had a\r\n           couple of lessons! -- just don't if\r\n           I can land!\r\n                          (MORE)\r\n           7.\r\n                         \r\n                          FLASH (CONT'D)\r\n                          (FIGHTING CONTROLS)\r\n           Grab that other wheel! Help me pull\r\n           her up!\r\n                         \r\n          DALE staggers into the co-pilot's seat, pulls back on the\r\n          wheel in front of her.\r\n                         \r\n                          DALE\r\n           Oh boy! Ever hear about the man who\r\n           fell ninety stories from a window\r\n           and didn't break a bone?\r\n                         \r\n                          FLASH\r\n           No but I'd sure like to! How'd The\r\n           man fall ninety stories didn't break\r\n           a bone?\r\n                         \r\n                          DALE\r\n           The window was ninety-one stories\r\n           up!\r\n                         \r\n          SHOOTING FORWARD - THROUGH THE BROKEN WINDSHIELD\r\n                         \r\n          The Earth is approaching fast, wheeling and tilting. We get\r\n          a glimpse of a strange greenhouse structure at the end of a\r\n          flat area.\r\n                         \r\n          Another barrage of crackling RED LIGHTNING BOLTS shoot all\r\n          around the plane but just miss it.\r\n                         \r\n          INT. COCKPIT\r\n                         (FLASH)\r\n                         \r\n                          FLASH\r\n           Brace yourself I'm aiming at that\r\n           field up ahead!\r\n                         \r\n          EXT. ZARKOV'S GREENHOUSE - DAY\r\n                         (ZARKOV'S VOICE)\r\n                         \r\n          Its thousands of panes reflect the RED SUN and the RED BOLTS\r\n          which rain down in intermittent bursts. One strikes an end\r\n          of a gallery, exploding glass and foliage. From inside, we\r\n          HEAR a furious echoing VOICE:\r\n                         \r\n                          ZARKOV'S VOICE\r\n           I see you, Munson! Come out or I\r\n           shoot!\r\n           8.\r\n                         \r\n          INT. GREENHOUSE - DAY\r\n          (MUNSON, ZARKOV)\r\n                         \r\n          ZARKOV is on the lower stairs of the tower, aiming his\r\n          revolver. MUNSON emerges from some dry brown bush where he\r\n          was hiding.\r\n                         \r\n                          MUNSON\r\n           So what's it matter if I'm shot or\r\n           go up in that thing? I'm a goner\r\n           either way, right?\r\n                         \r\n                          ZARKOV\r\n           Of course -- I admit that! But this\r\n           way you'll be giving your life for a\r\n           chance of saving Earth! Haven't you\r\n           any spirit at all??\r\n                         \r\n                          MUNSON\r\n           Goodbye, Doctor -- they were all\r\n           right about you. Have a nice trip.\r\n                         \r\n          MUNSON starts walking away, toward the door at the end of\r\n          the long side wing.\r\n                         \r\n                          ZARKOV\r\n           I tell you I can't take it off alone!\r\n           If you won't come, who will I find?\r\n                         \r\n          If you woo't come, who will I find:\r\n                         \r\n          MUNSON ignores him totally, keeps walking away. ZARKOV lifts\r\n          his revolver and draws a bead on the man's back. Just as he\r\n          is about to shoot, he reacts to something outside.\r\n                         \r\n          EXT. GREENHOUSE\r\n                         \r\n          Amazingly, a Twin Otter is gliding in to a horribly rough\r\n          landing in the field outside. The plane hits on one wheel,\r\n          bounces into the air, comes down again and keeps right on\r\n          rolling toward the greenhouse.\r\n                         \r\n          AS ABOVE - FEATURE MUNSON\r\n                         \r\n          SEEING the onrushing plane, freezing an instant then starting\r\n          to run. He hardly gets five yards before the Twin Otter comes\r\n          SLAMMING IN through the greenhouse wall, burying MUNSON\r\n          totally under the wreckage.\r\n                         \r\n          INT. COCKPIT - DAY\r\n          (DALE, FLASH)\r\n                         \r\n          Crazily angled, filled with dust and smoke. Dazed, blood on\r\n          his forehead, FLASH struggles from his seat.\r\n           9.\r\n                         \r\n                          FLASH\r\n           Dale! Are you all right?\r\n                         \r\n                          DALE\r\n           I'm terrific.\r\n                          (WEAK SMILE)\r\n           Flash Gordon, you have just made me\r\n           a Giant fan for life.\r\n                         \r\n                          FLASH\r\n           Come on -- let's get out before she\r\n           blows!\r\n                         \r\n          FLASH helps her from the wrecked seat, wheels and kicks out\r\n          the emergency exit in the cockpit area.\r\n                         \r\n          INT. GREENHOUSE - DAY\r\n          (DALE, FLASH, ZARKOV)\r\n                         \r\n          FLASH lowers DALE to the ground, jumps down after her. ZARKOV\r\n          is there, smiling at them in a strange way.\r\n                         \r\n                          FLASH\r\n           Hello. i'm Flash Gordon, this is\r\n           Miss Dale Arden --\r\n                         \r\n                          ZARKOV\r\n                          (MEANS IT)\r\n           Delighted to see you.\r\n                         \r\n                          FLASH\r\n           This crazy storm knocked us down\r\n           could we use a phone?\r\n                         \r\n                          ZARKOV\r\n           Certainly. Just follow me -- up those\r\n           stairs.\r\n                         \r\n                          FLASH\r\n           Some weather huh?\r\n                         \r\n                          ZARKOV\r\n           It will get worse.\r\n                         \r\n          ZARKOV turns and smiles at them again as they start up the\r\n          tower stairs. SUddenly DALE stops short, staring at ZARKOV\r\n          with a funny expression.\r\n                         \r\n                          DALE\r\n           You're Dr. Hans Zarkov!\r\n                         \r\n          ZARKOV hesitates just an instant, the nods.\r\n                         \r\n                          ZARKOV\r\n           How did you know?\r\n           10.\r\n                         \r\n                          DALE\r\n           I saw you in PEOPLE mag. After you\r\n           left NASA, remember? It said you\r\n           were utterly ---\r\n                         \r\n          DALE breaks off, almost biting her tongue.\r\n                         \r\n                          ZARKOV\r\n           Insane? Off my rocker?\r\n                         \r\n                          DALE\r\n           I forget what it said:\r\n                          (TURNING HASTILY)\r\n           Flash, let's find some other phone,\r\n           okay? I'm sure Dr. Zarkov is very\r\n           busy.......\r\n                         \r\n          FLASH is baffled, but he gets her urgent look.\r\n                         \r\n                          FLASH\r\n           Well, all right -- but it seems to\r\n           me we ought to --\r\n                         \r\n          Now it's FLASH'S turn to break off. ZARKOV is pointing a\r\n          gun at him.\r\n                         \r\n                          ZARKOV\r\n           Up the stairs to the tower! Ahead\r\n           of me -- quick! --\r\n           (as they gape at him,\r\n                          FROZEN)\r\n           Quick I said: We haven't much time --\r\n           Earth is being attacked! -- there's\r\n           only one slim chance of saving it!\r\n                         \r\n                          FLASH\r\n           Mister, you are insane!\r\n                         \r\n          HOWL of ether-wind increases. Storm of RED LASER BOLTS. Glass\r\n          showers them as parts of the green house EXPLODE and dry\r\n          foliage bursts into FLAME.\r\n                         \r\n                          ZARKOV\r\n           Up the stairs -- RUN!\r\n                         \r\n          ZARKOV jabs the revolver into DALE'S back. RED BOLTS zap\r\n          around. FLASH whispers to her as they start running up ahead\r\n          of ZARKOV.\r\n                         \r\n                          FLASH\r\n           Go with the flow -- wait for a chance!\r\n                         \r\n          Below them, bottom of staircase disintergrates in a RED FLASH.\r\n           11.\r\n                         \r\n          INT. TOP LEVEL OF GREENHOUSE TOWER\r\n          (DALE, FLASH, ZARKOV)\r\n                         \r\n          ZARKOV rips away a screen of foliage, revealing a MIRROR\r\n          BRIGHT capsule, seamless but for one door. He yanks that\r\n          open.\r\n                         \r\n          On every side things are blowing up and burning under the\r\n          merciless rain of bolts. One strikes the capsule head on,\r\n          but does not even leave a mark.\r\n                         \r\n                          ZARKOV\r\n           I need your help to take off! Get\r\n           in or I shot you dead!\r\n                         \r\n          DALE gasps and shrinks back.\r\n                         \r\n                          FLASH\r\n           Take off for where?\r\n                         \r\n                          ZARKOV\r\n           God only knows -- whatever black\r\n           corner of space this is coming from --\r\n           wherever HE is!. -- we'll plunge\r\n           into the devil's heart and destroy\r\n           him! We'll die ourselves, of course,\r\n           but our names will be honored till\r\n           the end of time!\r\n                         \r\n                          DALE\r\n           Look, Doc -- I don't book kamikaze\r\n           tours -- never.\r\n                         \r\n          FLASH is poised to jump, but ZARKOV suddenly pushes DALE off-\r\n          balance, INTO the capsule. FLASH leaps after her.\r\n                         \r\n          INT. CAPSULE\r\n          (DALE, ZARKOV)\r\n                         \r\n          It is curiously transparent from the inside, mirrored only\r\n          on the exterior. There are some controls and displays, but\r\n          in general the interior is severely ascetic: as far removed\r\n          from conventional spacecraft as ZARKOV's solitary genius is\r\n          from everyday science.\r\n                         \r\n          Immediately starting to set switches in a frenzy of activity,\r\n          ZARKOV waves the gun at FLASH.\r\n                         \r\n                          ZARKOV\r\n           Sit down there! Foot on the red pedal!\r\n                         \r\n                          DALE\r\n           Flash! Sack him!\r\n           12.\r\n                         \r\n          ZARKOV wheels and pulls the door shut. FLASH jumps him. He\r\n          punches ZARKOV in the gut. ZARKOV slams him back with the\r\n          well-known strength of a madman. FLASH clobbers him again.\r\n          Falling, ZARKOV dives sidewards and hits a switch.\r\n                         \r\n          The capsule WHINES SOFTLY and begins to WHIRL. Looking out\r\n          through the transparent wall, it is as if the capsule itself\r\n          was motionless and the scene outside is whirling. What's\r\n          left of the greenhouse is under a constant rain of those\r\n          LASER BOLTS, flashing fire that makes us dizzy.\r\n                         \r\n          FLASH staggers to his feet and finds DALE, folds his arms\r\n          around her protectively. The centrifugal force is rapidly\r\n          increasing now, throws them both against the wall. Faster\r\n          and faster, whirling, the force presses DALE'S body back\r\n          against FLASH'S until they are almost one flesh.\r\n                         \r\n          We move over and find ZARKOV plastered against another part\r\n          of the whirling capsule, his face drained white and distorted\r\n          by the terrific G-Force operating here now, his lips moving\r\n          as he speaks with enormous effort:\r\n                         \r\n           ZARKOV,\r\n           Friendship...Built this to send to\r\n           them in...Friendship...The end\r\n           now...End of the world....Unless we\r\n                          ····\r\n           (every sound an effort\r\n                          NOW)\r\n           Unless...We...Three...Can...\r\n                         \r\n          ZARKOV'S eyes close. He loses consciousness.\r\n                         \r\n          EXT. GREENHOUSE - LONG SHOT (MINIATURE)\r\n                         \r\n          Totally ablaze within now, one huge fantastic jewel of fire.\r\n          The whole central tower explodes outward. From the inferno a\r\n          MIRROR-BRIGhT capsule slowly rises, hovers, begins picking\r\n          up speed again as it ascends.\r\n                         \r\n          EXT. CAPSULE IN FLIGHT\r\n                         \r\n          Whirling, whirling, invincibly unharmed by the LASER BOLTS\r\n          which glance off it again and again, accelerating up into\r\n          space.\r\n                         \r\n          EXT. CAPSULE IN FLIGHT - POV\r\n                         \r\n          The EARTH recedes below into a ball, RED-HUED' under the\r\n          fantastic sun. A fast approaching light FLARES up against\r\n          the mirrored surface and is recognised as our MOON. It flashes\r\n          past, follows EARTH into e distance. All around, the sky\r\n          darkens into the void of space.\r\n                         \r\n          FANTASTIC MONTAGE - OUTER PLANETS OF OUR SOLAR SYSTEM\r\n           13.\r\n                         \r\n          They hurtle past the capsule in rapid sequences:\r\n                         \r\n                         RED MARS\r\n                         \r\n          A sudden gauntlet of careening ASTEROIDS, all sizes, from\r\n          tiny zingers to one almighty tumbler big as AFRICA.\r\n                         \r\n          Mammoth JUPITER with thirteen moons and its atmosphere of\r\n          deadly methane clouds more than 1000 miles deep. The RED\r\n          PATCH on its surface is a storm 20,000 miles across which\r\n          has raged without intermission for 200 EARTH centuries.\r\n          Through the RINGS OF SATURN in a dazzling LIGHTSTORM of\r\n          blazing ice crystals.\r\n                         \r\n          NEPTUNE, PLUTO, outermost URANUS. One after another the\r\n          planets are left hurtling behind, wheeling in their concentric\r\n          orbits, the entire SOLAR SYSTEM dwindling into nothing.\r\n                         \r\n          EXT. A SPIRAL NEBULA\r\n                         \r\n          It tilts and wheels wondrously as the Capsule passes through\r\n          the middle of it. Considering that this Nebula is probably a\r\n          million light-years from edge to edge, we get some notion of\r\n          the Capsule's speed.\r\n                         \r\n          EXT. A BLACK HOLE IN SPACE\r\n                         \r\n          Curving light-rays from another galaxy are drawn fantastically\r\n          together and then simply DISAPPEAR as they are pulled in by\r\n          the unimaginable gravitation force of is THING. we SEE the\r\n          CAPSULE, tiny, curving, and spinning along amidst the mind-\r\n          blowing display of light rays, sucked along with them ····\r\n          then simply DISAPPEARING as it too enters the void.\r\n                         \r\n          EXT. CAPSULE IN FLIGHT\r\n          (KLYTUS, MING)\r\n                         \r\n          Visible again, gleaming in an AMBER GLOW. Suddenly a dancing\r\n          grid of lines appears OVER IT, making us realise that we\r\n          must be SEEING IT on some kind of screen. It BLURS out of\r\n          focus, comes back again more sharply as some adjustment has\r\n          apparently been made.\r\n                         \r\n          ECU - EYES OF MING THE MERCILESS\r\n                         \r\n          Deep in shadow, gleaming with evil amusement.\r\n                         \r\n          MONTAGE - ECU'S OF MING'S FACIAL FEATURES\r\n                         \r\n          Curve of lip, flare of nostril, fold of eyelid, gleam of\r\n          shaven scalp, each a menacing landscape of sensual shadow as\r\n                         WE HEAR:\r\n                         \r\n           MING (O.S.)\r\n           They survived our Black Hole --\r\n           14.\r\n                         \r\n           KLYTUS (O.S.)\r\n           Hail Ming! Shall I drown them in\r\n           the Sea of Fire?\r\n                         \r\n           MING (O.S.)\r\n           Later, Klytus -- I think we will\r\n           look at them first.\r\n                         \r\n          INT. CAPSULE - SHOOTING FROM WITHIN\r\n                         \r\n          Through the transparent walls as the spinning motion is\r\n          rapidly SLOWING DOWN. The three voyagers are crumpled on the\r\n          floor against the wall in strange attitudes, FLASH'S arms\r\n          still holding DALE. They seem semi-conscious, as if dropped.\r\n                         \r\n          An AMBER GLOW bathes them, and soon we see its source. A\r\n          huge planet wheels into view through the transparent wall.\r\n          It is MONGO. Its curved surface is a pure sea of AMBER FIRE\r\n          molten lava, with great tongues of flame erupting\r\n          horrifically.\r\n                         \r\n          ZARKOV blinks, struggles to focus his eyes. He succeeds,\r\n          with horror SEES where they are headed. Making a choking\r\n          sound, ZARKOV stirs and tries to crawl over to a control\r\n          panel. He pushes switches. Nothing happens. The CAPSULE\r\n          keeps on going down. A great leaping tongue of fire licks\r\n          it.\r\n                         \r\n          Suddenly, just as destruction seems imminent, the capsule\r\n          miraculously changes its flight path and soars above the\r\n          remaining flames.\r\n                         \r\n          It races through them. A shadow passes over MONGO as the\r\n          CAPSULE passes through a wall of PURPLE VAPOR and emerges\r\n          above a totally different landscape. A dozen VARIOUS COLORED\r\n          CLOUDS sweep past in silent majesty.\r\n                         \r\n          The CAPSULE slows, hovers starts straight down into a sea of\r\n          high grass.\r\n                         \r\n          EXT. MONGO -- GRASSY AREA - EVENING\r\n                         \r\n          In the distant B.G. against an extraordinary SUNSET SKY,\r\n          rises the shimmering CITY OF MONGO.... a place of many levels,\r\n          golden tiers and turrets, towers, flags and pennants. It is\r\n          like something dreamed.\r\n                         \r\n          Several STRANGELY ARMORED MEN watch the MIRROR-BRIGHT CAPSULE\r\n          descending slowly. The LEADER waves and they all start toward\r\n          the CAPSULE.\r\n                         \r\n          INT. CAPSULE\r\n          (DALE, FLASH, ZARKOV)\r\n                         \r\n          Gentle bump as the thing touches down.\r\n           15.\r\n                         \r\n                          ZARKOV\r\n           By God, we did it! We made it!\r\n                         \r\n                          FLASH\r\n           Made it where, Doctor?\r\n                         \r\n                          ZARKOV\r\n           I don't know.\r\n                         \r\n          Suddenly DALE gasps, reacting to something she SEES through\r\n          the transparent-from-within wall. They all look around and\r\n          SEE those STRANGE MEN approaching.\r\n                         \r\n                          DALE\r\n           Don't. Suddenly I like it in here\r\n           just fine --\r\n                         \r\n          EXT. GRASSY AREA - DAY\r\n          (ARMORED MEN, FLASH, LEADER, ZARKOV)\r\n                         \r\n          The door of the CAPSULE is opened from the inside. ZARKOV\r\n          and DALE and FLASH get out. THE MEN stop. Long beat as the\r\n          two parties gaze at each other, the first human eye ever to\r\n          see an extraterrestrial being. FLASH walks up to the leader.\r\n                         \r\n                          FLASH\r\n           Hello -- my name's Flash Gordon --\r\n           can you understand me?\r\n                          (SILENCE)\r\n           We're from EARTH -- we come as\r\n           friends.\r\n                         \r\n                          ZARKOV\r\n                          (URGENT)\r\n           Extend your hand! That's the gesture\r\n           of friendship known everywhere!\r\n                         \r\n          With a warm grin, FLASH extends hi right hand.\r\n                         \r\n                          FLASH\r\n           Hi!\r\n                         \r\n          CLACK! With lightning speed a manacle is slammed on FLASH'S\r\n          wrist and he is thrown to ·the ground as other RED MEN advance\r\n          to handcuff DALE and ZARKOV.\r\n                         \r\n                          LEADER\r\n           You are prisoners. I will take you\r\n           now to Ming the Merciless, Ruler of\r\n           the universe!\r\n                         \r\n                          ARMORED MEN\r\n                          (CHORUS)\r\n           Hail, Ming!\r\n           16.\r\n                         \r\n          Groggily, FLASH lifts his head towards ZARKOV.\r\n                         \r\n                          FLASH\r\n           Thanks, Doctor -- next time I'll\r\n           call my own play.\r\n                         \r\n          EXT. GRASSY AREA - POV THROUGH OPENING\r\n          (DALE, FLASH)\r\n                         \r\n          Another strange glimpse through an opening. Some fierce\r\n          tethered BEAST is being goaded and tormented by MONGO MEN,\r\n          as in an Elizabethan bear-baiting. On the floor lies the\r\n          tor n body of one MAN who apparently got too close.\r\n                         \r\n          DALE has one brief horrified GLIMPSE of this, then turns her\r\n          head away and shuts her eyes as she's marched along.\r\n                         \r\n                          DALE\r\n           Just do what I'm doing. Flash --\r\n                         \r\n                          FLASH\r\n           What are you doing?\r\n                         \r\n                          DALE\r\n           Shutting my eyes -- dreaming I booked\r\n           us to Disneyland.\r\n                         \r\n          INT. MAIN PALACE HALL\r\n                         (ARMORED MEN)\r\n                         \r\n          A gigantic STATUE comes into view amidst topless columns at\r\n          the end. Light plays over it in ever-shifting patterns. As\r\n          we come nearer, we SEE that this STATUE is cut out in the\r\n          middle to form a throne.\r\n                         \r\n          MING THE MERCILESS sits in the throne niche, silent, gazing\r\n          down on the PRISONERS as they are marched to a halt before\r\n          him.\r\n                         \r\n                          ARMORED MEN\r\n           Hail, Ming! Hail, Great One Without\r\n           Mercy!\r\n                         \r\n          A hundred reduplicated ECHOES of that shout ring through\r\n          unseen reaches of the palace. MING bends his head slightly\r\n          in acknowledgement, points idly at the ARMORED MEN at the\r\n          left of the group.\r\n                         \r\n          INT. PALACE OF HALLS - SERIES OF DISSOLVES\r\n          (ARMORED MAN, AURA, DALE, FLASH, KLYTUS, LEADER, MING, VOICES,\r\n                         ZARKOV)\r\n                         \r\n          As FLASH, DALE and ZARKOV are marched along by many ARMORED\r\n          MEN, perspectives are bewildering, curvilinear, surfaces\r\n           17.\r\n                         \r\n          bending away into caverns of gloom without measurable\r\n          dimension.\r\n                         \r\n          We pass an archway opening into what seems to be an AMUSEME-\r\n          NT ARCADE. Glimpse of MONGO PEOPLE playing amazing electronic\r\n          games, while MONGO GO-GO GIRLS cavort on a platform to\r\n          unearthly music.\r\n                         \r\n                          ZARKOV\r\n           Fantastic -- into a Black Hole and\r\n           out the other side -- to this. Who\r\n           said Hans Zarkov was mad?\r\n                         \r\n                          DALE\r\n           You're mad.\r\n                         \r\n          Look down over a balcony from a MOVING POV. A fencing glass\r\n          is in session. SIX PAIRS OF MEN go at each other with magic\r\n          swords which give off pyrotechnical displays each time the\r\n          blades clash. Thrust, parry, SLASH! The head of one duellist\r\n          EXPLODES in a bloodless fountain of fire.\r\n                         \r\n                          FLASH\r\n           You got us into this -- HOW DO WE\r\n           GET OUT?\r\n                         \r\n                          ZARKOV\r\n           Get out? Why? We're being taken to\r\n           Ming -- getting at him is our only\r\n           hope of saving EARTH. It's perfect!\r\n                         \r\n                          FLASH\r\n           Dr. Zarkov, I'm about to show you\r\n           what it feels like to be clipped by\r\n           a New York Giant --\r\n                         \r\n                          DALE\r\n           Flash, it's no use - he's too crazy!\r\n                         \r\n                          MING\r\n           Step forward, Soldier.\r\n                         \r\n          The designated one marches two paces forward, halts.\r\n                         \r\n                          MING (CONT'D)\r\n           Are you loyal to Ming? Would you\r\n           die for him?\r\n                         \r\n                          ARMORED MAN\r\n           Gladly!\r\n                         \r\n                          MING\r\n           Fall on your sword.\r\n           18.\r\n                         \r\n          Instantly the ARMORED MAN pulls his sword, rips open his\r\n          breast-plate, sets the sword hilt-down on the floor and\r\n          PLUNGES FORWARD on to the fatal point.\r\n                         \r\n          With a little cry of horror, DALE shrinks back into FLASH'S\r\n          arms.\r\n                         \r\n                          ZARKOV\r\n           You inhuman fiend!\r\n                         \r\n                          MING\r\n           Of course I'm \"inhuman\"! -- that's a\r\n           compliment!\r\n           (Dropping his voice)\r\n           Pathetic Earthlings, forever wondering\r\n           if you are alone in the universe --\r\n           beaming you plaintive messages into\r\n           to the void for anything that might\r\n           hear you -- even hurling your bodies\r\n           out into it -- and all without the\r\n           faintest inkling of who or what is\r\n           out here. If you had known anything --\r\n           anything at all about the true nature\r\n           of the universe, you would have hidden\r\n           from it, in terror!\r\n                         \r\n          There is a low throaty LAUGH from the shadows. FLASH and\r\n          DALE turn their eyes quickly in its direction.\r\n                         \r\n          FEATURE PRINCESS AURA\r\n                         \r\n          Emerging half into the light beside a column, fondling the\r\n          head of an obscure BEAST slouching between her legs.\r\n          Voluptuous beyond her years, fiercely erotic, AURA looks\r\n          FLASH boldly up and down as the BEAST HISSES with the pleasure\r\n          of her touch.\r\n                         \r\n          FLASH can't take his eyes off her. No normal man could. FLASH\r\n          swallows with a dry throat as AURA'S gaze devours him. DALE\r\n          gets the electricity going on, gives him a poke and WHISPERS\r\n          LOUDLY.\r\n                         \r\n                          DALE\r\n           Watch it, fella -- you came with me!\r\n                         \r\n          AURA laughs again, sidles up toward MING. We dimly SEE a\r\n          couple of MUTANT CREATURES dragging away the lifeless body\r\n          of the one who so vividly proved his loyalty.\r\n                         \r\n                          MING\r\n           You know who Ming is now -- who are\r\n           you and why do you come to Mongo?\r\n           19.\r\n                         \r\n                          FLASH\r\n           I'm Flash Gordon of the New York\r\n           Giants this is Dale Arden -- Dr.Zarkov\r\n           hijacked us in an effort to save\r\n           EARTH.\r\n                         \r\n          MING looks questioningly at KLYTUS\r\n                         \r\n                          KLYTUS\r\n           Sirs, Earth is the meaningless planet\r\n           you are in the process of\r\n           obliterating.\r\n                         \r\n                          ZARKOV\r\n           (pouncing on that)\r\n           In the process? You mean Earth still\r\n           exists?\r\n                         \r\n                          MING\r\n           For the moment -- not for much longer.\r\n                         \r\n                          FLASH\r\n           But why? What in hell have we ever\r\n           done to hurt you?\r\n                         \r\n                          MING\r\n           You exist -- and yet you pay no homage\r\n           to Ming! What greater crime can be\r\n           committed?\r\n                         \r\n          The palace rings with an answering chorus: VOICES of all the\r\n          ARMORED MEN and numerous others presently UNSEEN, including\r\n          many WOMEN.\r\n                         \r\n                          VOICES\r\n           Hail, Ming! Hail, Great One Without\r\n           Mercy!\r\n                         \r\n                          MING\r\n           Come closer, Dale Arden -- let me\r\n           see you.\r\n                         \r\n          DALE doesn't move. MING takes a step down, narrows his eyes\r\n          and gazes at her intensely. This guy's personal magnetism\r\n          is enormous. As if irresistibly drawn, DALE steps forward.\r\n                         \r\n          MING moves his hand in a gesture. A sourceless GOLDEN LIGHT\r\n          bathes DALE, sensuous MUSICAL CHORDS are heard. DALE's lips\r\n          open slightly, her color heightens, her rate of breathing\r\n          increases. MING touches her flesh lightly.\r\n                         \r\n          FLASH tense, ready to spring.\r\n                         \r\n                          KLYTUS\r\n           This woman will amuse you.\r\n           20.\r\n                         \r\n                          ZARKOV\r\n                          (INTERESTED)\r\n           Klytus can see the future, eh?\r\n                         \r\n                          MING\r\n           He can foresee it -- but for a few\r\n           moments only. It gives him a unique\r\n           gift for survival, -- and treachery.\r\n                         \r\n                          ZARKOV\r\n           Extraordinary. I'd like to study\r\n           his beta factors -- I wager I could\r\n           extend them with a course of\r\n           telekinetic exercise.\r\n           (peering at KLYTUS)\r\n           Tell me -- when you use this fit\r\n           does your temporal lobe prickle?\r\n           Here?\r\n                         \r\n          MING flashes a glance of interest at ZARKOV, then addresses\r\n          the LEADER of the ARMORED MEN.\r\n                         \r\n                          MING\r\n           Chain this one up. Preserve him for\r\n           further examination.\r\n                         \r\n                          LEADER\r\n           Hail, Ming!\r\n                         \r\n          ZARKOV is roughly seized. FLASH starts after them angrily\r\n          as they drag the scientist away.\r\n                         \r\n                          FLASH\r\n           Oh no you don't! We came together\r\n           and we're STAYING together!\r\n                         \r\n          Languidly, MING indicates FLASH GORDON with a pointed finger.\r\n                         \r\n                          MING\r\n           That one is useless to us. Remove\r\n           him and kill him.\r\n                         \r\n          Shock reactions. FLASH wheels back at MING as DALE steps in\r\n          front of her friend.\r\n                         \r\n                          DALE\r\n           You dirty old bastard can kill me\r\n           too!\r\n                         \r\n          CLOSE ANGLE - AURA\r\n                         \r\n          Wetting her lips, moving sinuously to WHISPER to MING:\r\n           21.\r\n                         \r\n                          AURA\r\n           Don't kill him yet, Father. Give him\r\n           to me!\r\n                         \r\n                          MING\r\n                          (EYEBROWS UP)\r\n           What would your Prince Barin say?\r\n                         \r\n                          AURA\r\n           I can handle Barin.\r\n                         \r\n                          MING\r\n           Really, Aura -- your appetites are\r\n           too monstrous -- even for our family.\r\n           This could cause great trouble with\r\n           Barin -- I must forbid it.\r\n                         \r\n          AURA touches the rime of MING'S ear with her tongue as she\r\n                         WHISPERS AGAIN:\r\n                         \r\n                          AURA\r\n           But you adore me, Father -- you ca\r\n           refuse me nothing . Yes?\r\n                         \r\n                         WIDER SHOT\r\n                         \r\n          As MING steps quickly away from his super-provocative daughter\r\n          and indicates DALE.\r\n                         \r\n                          MING\r\n           Take the Earth-woman to our quarters!\r\n           Bathe and annoint her for our\r\n           pleasure!\r\n                         \r\n          A HOODED GUARD comes from shadow, moves towards DALE.\r\n                         \r\n          FLASH starts around to defend her, but before he can do it\r\n          DALE has made her own move. WHAM! Quick as lightning, she\r\n          flattened the HOODED GUARD with a perfectly executed city-\r\n          girl's kick to the balls. DALE is astonished at her own\r\n          prowess.\r\n                         \r\n                          DALE\r\n           My God -- and I thought that book\r\n           was another rip-off-\r\n                         \r\n                          FLASH\r\n           Watch out! Behind you!\r\n                         \r\n          Three more HOODED GUARDS are emerging from the shadows towards\r\n          DALE.\r\n                         \r\n                         QUICK ANGLES\r\n           22.\r\n                         \r\n          FLASH flies at them. An elbow in the mouth disposes of one.\r\n          He seizes the man's mace-like club as he falls, uses it\r\n          quickly to knock cold the other two.\r\n                         \r\n          AURA'S eyes shine at FLASH'S prowess. Fascinated, she runs\r\n          her moist tongue along the cutting edge of her teeth.\r\n                         \r\n          Panting, braced, FLASH stands in front of DALE with raised\r\n          mace.\r\n                         \r\n          Unearthly MARTIAL MUSIC comes in a glissando from the\r\n          Cavernous space above.\r\n                         \r\n          To its tempo MING'S PERSONAL GUARDS now starts· appearing.\r\n          They are all a race of AMAZON WARRIORS, and the most amazing\r\n          thing is that they all have the SAME FACE.\r\n                         \r\n          From left to right, back and front, the AMAZONS advance 0n\r\n          FLASH and DALE. They do not attack, merely stun ad overwhelm\r\n          us with their massive, silent, answerable threat.\r\n                         \r\n          FLASH swallows, looks this way and that, stands as if\r\n          paralysed.\r\n                         \r\n                          DALE\r\n           (low and tremulous)\r\n           What's the play, Flash?\r\n                         \r\n                          FLASH\r\n           I can't -- I just can't --\r\n                         \r\n                          DALE\r\n           Can't what?\r\n                         \r\n                          FLASH\r\n           Clobber a woman, Dale --\r\n                         \r\n                          DALE\r\n                          (OUTBURST)\r\n           You damn fool, those aren't women\r\n           they're murderous AMAZON DYKES!\r\n                         \r\n          The AMAZONS are all around DALE now.\r\n                         \r\n                          DALE (CONT'D)\r\n           Help!!\r\n                         \r\n          FLASH is paralyzed by indecision one beat more, then suddenly\r\n          makes up his mind. He flies into action, SLAMS the nearest\r\n          pair of AMAZONS.\r\n           23.\r\n                         \r\n          INT. PALACE - FIGHT SEQUENCE\r\n                         (DALE)\r\n                         \r\n          Fast and furious. Great havoc is wreaked by DALE and her\r\n          karate, by FLASH and his flailing fists, but the AMAZONS'\r\n          numerical superiority is of course decisive.\r\n                         \r\n          Soon FLASH is on the floor, pinioned by a dozen AMAZONS.\r\n                         \r\n          He looks up, with despairing eyes SEES poor DALE being dragged\r\n          up a flight of stairs that disappear mysteriously into upper\r\n          gloom.\r\n                         \r\n                          DALE\r\n           Flash!!\r\n                         \r\n          The pitiful shout sends FLASH'S adrenaline rushing. With a\r\n          superhuman effort, he fights free from the pile-up and dashes\r\n          after DALE.\r\n                         \r\n          INT. PALACE - ON THE STAIRCASE\r\n                         \r\n          FLASH struggles to get through to DALE.\r\n                         \r\n          DALE claws fiercely at the bare AMAZON arms and shoulders\r\n          that engulf her, reaches desperately back down for FLASH.\r\n                         \r\n          CLOSE SHOT - THEIR HANDS\r\n                         \r\n          Just touching their fingertips.\r\n                         \r\n          CLOSE SHOT - A STEP OF THE STAIRS\r\n                         \r\n          Opens like a yawning trap door UNDER FLASH'S FEET.\r\n                         \r\n          FLASH drops away with a YELL, in the very instant that AURA\r\n          comes running INTO THE SHOT and boldly JUMPS after him.\r\n          AURA is swallowed up too, a split-second before the trap\r\n          door step CLOSES again after them.\r\n                         \r\n          INT. PALACE - CU-MING\r\n          (KLYTUS, MING)\r\n                         \r\n          Watching that, as KLYTUS hisses into his ear.\r\n                         \r\n                          KLYTUS\r\n           She betrays you! She'll take him to\r\n           Aboria!\r\n                         \r\n                          MING\r\n           So Prince Barin will kill Flash Gordon\r\n           for me -- I don't care.\r\n                         \r\n                          KLYTUS\r\n           Don't be too sure!\r\n           24.\r\n                         \r\n          MING glances at him, then back up the stairs at where DALE\r\n          has vanished. His face softens, his tone turns museful!\r\n                         \r\n                          MING\r\n           I haven't taken a wife in centuries.\r\n           I could bring myself to marry this\r\n           Dale Arden --\r\n                          (A BEAT)\r\n           What do you see in her future, Klytus?\r\n                         \r\n          NO reply. MING turns his head and finds that KLYTUS is gone.\r\n          Vanished. Not particularly surprised or concerned, MING gazes\r\n          again toward the top of the stairs and answers his own\r\n          question with a licentious smile.\r\n                         \r\n          INT. A DARK METALLIC SHAFT - SHOOTING DOWN IT\r\n          (AURA, FLASH)\r\n                         \r\n          It is seemingly endless, faintly lt by phosphoresence from\r\n          below. We dimly make out the figures of FLASH and AURA falling\r\n          away from us, far below, falling, falling. We HEAR Hollow\r\n          echoing VOICES reverbrating up to us.\r\n                         \r\n                          AURA\r\n           Take a deep breath! Grab my ankle\r\n           after we hit the water -- I'll lead\r\n           you!\r\n                         \r\n                          FLASH\r\n           Hit what water?\r\n                         \r\n          In answer, we instantly HEAR a titanic SPLASH.\r\n                         \r\n          INT. UNDERWATER (TANK)\r\n                         \r\n          FLASH plummets down, AURA right after him. Recovering balance\r\n          in a universe of bubbles, FLASH finds himself confronting an\r\n          enormous savage LUMINOUS FISH. Wheeling himself away in\r\n          fear and revulsion, FLASH encounters AURA. He seizes her\r\n          ankle as directed. Holding his beat, FLASH swims after her\r\n          through a maze of stalagmites growing up from the cavern\r\n          floor. AURA dives down, leads him OUT OF SIGHT through a low\r\n          opening.\r\n                         \r\n          INT. UNDERGROUND GROTTO\r\n          (AURA, FLASH, PLASH)\r\n                         \r\n          FLASH and AURA emerge from a pool of water. FLASH staggers\r\n          across and collapses on a fringe of beach. For sure, AURA'S\r\n          wet clinging robe doesn't make her look any less sexy. He\r\n          stares at her.\r\n                         \r\n                          AURA\r\n           Catch your breath -- then I'll take\r\n           you up and find you a disguise.\r\n           25.\r\n                         \r\n                          FLASH\r\n           You're saving my life. How can I\r\n           Thank you?\r\n                         \r\n                          AURA\r\n           I'll fly you to the forest of Arboria -\r\n           we'll find a way.\r\n                         \r\n                          FLASH\r\n           Let's get one thing straight -- I've\r\n           got to find Dale and that nut Zarkov\r\n           too -- rescue them and try to save\r\n           Earth too.\r\n                         \r\n                          AURA\r\n           Do you realize how foolish you are\r\n           to tell that to me -- Ming's daughter?\r\n                         \r\n                          FLASH\r\n           I'm no good at lying.\r\n                         \r\n                          AURA\r\n           You're funny -- are all Eathlings\r\n           like you, Flash Gordon?\r\n                         \r\n                          PLASH\r\n           I guess I'm about average.\r\n                         \r\n          INT. UNDERGROUND CORRIDOR\r\n          (AURA, FLASH)\r\n                         \r\n          There are windows on one side, emitting a fierce GLARE. FLASH\r\n          follows AURA rapidly along. Suddenly he stops short, looking\r\n          in through the tinted glass.\r\n                         \r\n          WHAT HE SEES - PLASMA CAVERN\r\n                         \r\n          An infernal place, chief feature of which is a LAKE OF\r\n          SEETHING MAGMA that slowly rotates within a wide encircling\r\n          platform. The platform is piled with GLOWING RADIOACTIVE\r\n          GRAVEL, being shoveled into the magma by LIZARDMAN SLAVES\r\n          who toil in rythmic unison.\r\n                         \r\n           FLASH (O.S.)\r\n           What's that?\r\n                         \r\n           AURA (O.S.)\r\n           The plasma core. It's e source of\r\n           the energy-beam my father ia aiming\r\n           at Earth. You can't stop it. Ming is\r\n           merciless and all-powerful!\r\n                         \r\n          ANGLES - LIZARDMAN SLAVES\r\n           26.\r\n                         \r\n          Showing ankle electrodes shackled to each SLAVE, so that\r\n          those who collapse can be shocked back to their feet by GUARDS\r\n          stationed on a surrounding catwalk above. Any SLAVE unable\r\n          to rise is summarily pitched into the magma by HOODED MEN,\r\n          waiting like executioners to perform this chore.\r\n                         \r\n           AURA (O.S.) (CONT'D)\r\n           The slaves are Lizard Men. Once they\r\n           had their own water Kingdom, the\r\n           fairest of Mongo. Then they dared to\r\n           rebel. They will suffer for it here\r\n           forever.\r\n                         \r\n          FLASH looks at AURA again, then back in the window. He\r\n          reacts.\r\n                         \r\n          INT. GROTTO - HIS POV IN CAVERN - ON A CATWALK\r\n                         (AURA)\r\n                         \r\n          ZARKOV is being led along by SOLDIERS, heavily shackled. He\r\n          stops, gazing in wonder at the seething lake, which FLARES\r\n          UP BLINDINGLY with each shovel full of gravel.\r\n                         \r\n          FLASH and AURA\r\n                         \r\n                          AURA\r\n           You can't reach him. If a soldier\r\n           spots you, it's instant death! --\r\n           Come!\r\n                         \r\n          AURA takes his hand. With one backward look toward ZARKOV\r\n          who of course has not seen him, FLASH follows her.\r\n                         \r\n          INT. PLASMA CAVERN - FEATURE ZARKOV\r\n          (MING'S VOICE, SOLDIER, ZARKOV)\r\n                         \r\n                          ZARKOV\r\n           Incredible - the very core of this\r\n           planet, is it not?\r\n                         \r\n                          SOLDIER\r\n           We are but soldiers. We do not know.\r\n                         \r\n                          MING'S VOICE\r\n           You guess well, Dr. Zarkov!\r\n                         \r\n          ZARKOV wheels in his chains, looks up.\r\n                         \r\n          INT. PLASMA CAVERN - MESSANINE\r\n          (EVERYONE, MING, ZARKOV)\r\n                         \r\n          High above this place where MING stands with KLYTUS, lit by\r\n          the infernal glare as he goes on:\r\n           27.\r\n                         \r\n                          MING\r\n           I am forcing this plasma through the\r\n           successive nuclear phases of a star -\r\n           building it toward the apocalyptic\r\n           moment that will end Earth's pathetic\r\n           history in one flash of fire.\r\n                         \r\n                          ZARKOV\r\n           Devil! Why don't you turn this science\r\n           to peaceful use? The name Ming would\r\n           be blessed instead of cursed.\r\n                         \r\n                          MING\r\n           Bring him up to the dome, Soldiers --\r\n           we wish to show him wonders.\r\n                         \r\n          At that instant a couple of worn-out SLAVES are pitched into\r\n          the magma. Their dying SCREAMS are drowned by the chorus\r\n          from all the minions:\r\n                         \r\n                          EVERYONE\r\n           Hail! Ming! Hail, Great one Without\r\n           Mercy!\r\n                         \r\n          INT. UPPER PALACE AREA - CORRIDOR\r\n          (AURA, FLASH)\r\n                         \r\n          AURA leads FLASH out through a doorway. He is now fitted out\r\n          with a fairly resplendent MONGO costume: boots, cape,\r\n          headdress and all. They hurry along through shadows. Suddenly\r\n          FLASH seizes her by the shoulders, stops her.\r\n                         \r\n                          FLASH\r\n           Listen, where's he got Dale?\r\n                         \r\n          As she looks at him, she SEES a detachment of SOLDIERS\r\n          marching this direction. Quickly she pulls FLASH into a niche,\r\n          presses her body against his in the narrow space. WHISPERS:\r\n                         \r\n                          AURA\r\n           Forget Dale Arden!\r\n                         \r\n                          FLASH\r\n           I can't! I mean I hardly know her,\r\n                          BUT --\r\n                         \r\n                          AURA\r\n           Forget her, Flash Gordon: I saw a\r\n           look in my father's eye -- I think\r\n           he intends to marry her.\r\n                         \r\n                          FLASH\r\n           What?? Marry her? What are you\r\n           talking about??\r\n           28.\r\n                         \r\n          The SOLDIERS have gone past, but AURA is still pressing\r\n          against him.\r\n                         \r\n                          AURA\r\n           Oh you ask so many questions.\r\n                          (SEDUCTIVE)\r\n           I'm taking you to people who'll help\r\n           you. Trust me!\r\n                         \r\n                          FLASH\r\n           Can I honestly?\r\n                         \r\n                          AURA\r\n           Trust me!\r\n                         \r\n          AURA hauls FLASH from the niche, they hurry on a bit further.\r\n          AURA stops in front of big doors, with glass windows in them.\r\n                         \r\n                          AURA (CONT'D)\r\n           Here we are.\r\n                         \r\n                          FLASH\r\n           Here we are where?\r\n                         \r\n                          AURA\r\n           I've dressed you as a Royal Pilot,\r\n           First Class. We'll slip into my\r\n           personal car and you'll fly it.\r\n                         \r\n          FLASH takes one look into the glass, then swivels back to\r\n                         AURA\r\n                         \r\n                          FLASH\r\n           Those are ROCKET SHIPS in there! I\r\n           can't fly a damn rocket ship!\r\n                         \r\n                          AURA\r\n           (soft, teasing)\r\n           Learn from me -- I'll teach you so\r\n           much!\r\n                         \r\n          INT. MING'S DOME\r\n          (MING, ZARKOV)\r\n                         \r\n          Open at the top to space. But instead of our familiar pinpoint\r\n          stars, here whole nebulae wheel in majesty against infinity,\r\n          their innards popping with explosions as whole galaxies are\r\n          born and die.\r\n                         \r\n          ZARKOV stands before MING in chains, mesmerized by fantastic\r\n          devices on every side. Most prominent is a huge transparent\r\n          cube, supported in the air above a control console. MING\r\n          moves to that, plays in it like an organist. we HEAR a soft\r\n          intense hum, GLIMPSE great dish-like radio antennae turning\r\n          on the top side of the dome.\r\n           29.\r\n                         \r\n          An astonishing things happens. Inside the cube a recognisable\r\n          greenish globe appears like a three-dimensional holograph,\r\n          slowly turning as the continents and oceans come into view\r\n          below a veil of clouds.\r\n                         \r\n                          ZARKOV\r\n           Earth!\r\n                         \r\n                          MING\r\n           Yes, Zarkov -- as it was. Now as it\r\n           will be, when my plasma reaches full\r\n           force.....\r\n                         \r\n          A sudden TIDE OF FIRE sweeps the globe, Even the clouds BURN.\r\n          ZARKOV gasps as MING'S fingers dance of the control keys\r\n          again.\r\n                         \r\n                          MING (CONT'D)\r\n           And as it will be in yet another\r\n           time, long after you have died. Earth\r\n           reborn! A pleasant image, no?\r\n                         \r\n          The fires recede. The hanging globe sparkles again with beauty\r\n          just as it was except that the outlines of our continents\r\n          have been subtly changed.\r\n                         \r\n                          ZARKOV\r\n           But that's impossible! Even your\r\n           perverted genius can't create new\r\n           life!\r\n                         \r\n                          MING\r\n           Of course I can create life. There's\r\n           nothing easier. It only requires\r\n           myself and one woman.\r\n                         \r\n                          ZARKOV\r\n                          (SUDDEN UNDERSTANDING)\r\n           Dale Arden.....\r\n                         \r\n                          MING\r\n           Who else? As in that childish myth\r\n           of yours -- Adam and Eve, wasn't it?\r\n           I will breed with her and repopulate\r\n           the Earth in my own image. I've\r\n           already done it on over a thousand\r\n           planets.\r\n                         \r\n          MING touches a key. The image of Earth DISAPPEARS from the\r\n          cube. ZARKOV glares hatred at MING for a beat, then his eye\r\n          catches something else.\r\n                         \r\n          WHAT HE SEES\r\n           30.\r\n                         \r\n          A big block of crystal on the floor with two swords embedded\r\n          in it, just their hilts sticking out.\r\n                         \r\n          ANGLE to include ZARKOV. Chained as he is, he suddenly bounds\r\n          over and seizes a sword hilt, tries to pull it out. It doesn't\r\n          budge.\r\n                         \r\n                          MING (CONT'D)\r\n           The magic blades are not for your\r\n           kind, Zarkov. One is my own the other\r\n           will only be withdrawn by my rightful\r\n           heir. Pull on them with all your\r\n                          MIGHT:\r\n                         \r\n          ZARKOV tugs desperately, but it doesn't give an inch. He\r\n          falls panting over the block.\r\n                         \r\n                          ZARKOV\r\n           Monster!\r\n                         \r\n          MING laughs, makes a sign to a SOLDIER.\r\n                         \r\n                          MING\r\n           Return him to the dungeon.\r\n                         \r\n          INT. MING'S SERAGLIO\r\n          (DALE, HEDONIA)\r\n                         \r\n          DALE stands amongst the EXOTIC FEMALES of this lavish place,\r\n          being gently but firmly divested of her clothes and put into\r\n          a diaphanous gown. They intend her no harm. Though each has\r\n          some slight unearthly peculiarity, all are very beautiful.\r\n                         \r\n          Tickled, DALE can't suppress a giggle. The females are amazed\r\n          and delighted by this phenomenon. They take turns poking at\r\n          her ribs as tall HEDONIA glides up, bearing a flagon of green\r\n          liquid.\r\n                         \r\n                          HEDONIA\r\n           Drink this.\r\n                         \r\n          DALE recoils, her giggling cut short.\r\n                         \r\n                          DALE\r\n           What is it -- some rotten drug?\r\n                         \r\n                          HEDONIA\r\n           It has no name. But many brave men\r\n           died to bring it across space from\r\n           Cythera, planet of Pleasure. It\r\n           will make your hours with Ming more\r\n           agreeable.\r\n                         \r\n          With a karate chop, DALE- knocks the flagon away. HEDONIA\r\n          rubs her hurt wrist but does not seem angry.\r\n           31.\r\n                         \r\n                          HEDONIA (CONT'D)\r\n           We are of different race, Dale Arden\r\n           but we all are women here. I know\r\n           your fears. Believe me, it will be\r\n           better if you drink it...\r\n                         \r\n          HEDONIA retrieves the flagon from the silken pillow where it\r\n          landed, extends it again to DALE. A shout!\r\n                         \r\n                          DALE\r\n           Flash! Where are you??\r\n                         \r\n          Of course there is no answer. Sudden tears of despair spring\r\n          from DALE'S eyes. She seizes the flagon and impulsively drinks\r\n          it. Her expression changes.\r\n                         \r\n                          DALE (CONT'D)\r\n           Say, this stuff isn't bad at all.\r\n                         \r\n          EXT. SPACE - AURA'S SHUTTLE CRAFT\r\n                         \r\n          Sails along, a wonderful little bubble-topped two-seater,\r\n          with royal devices.\r\n                         \r\n          EXT. SPACE - A MOON OF ICE\r\n                         \r\n          Floats toward us, dazzling sphere of frozen seas and glaciers.\r\n                         \r\n          INCLUDE AURA'S SPACECRAFT\r\n                         \r\n          Coming into SHOT in a curving pass over the surface. It's a\r\n          Nifty bubble-top two-seater with royal devices.\r\n                         \r\n          INT. COCKPIT - IN FLIGHT\r\n                         (AURA)\r\n                         \r\n          There are no normal controls, just a glowing multi-colored\r\n          panel over which the pilot makes hand-movements to effect\r\n          changes of course and attitude. FLASH is in the left-hand\r\n          seat beside AURA, gazing down at the glittering sight.\r\n                         \r\n                          AURA\r\n           Frigia -- eleventh of the moons of\r\n           Mongo. It's inhabited by the Bear\r\n           Men who eat their own young...\r\n                         \r\n          FLASH shivers. Patches of frost and ice start to form on\r\n          the craft's bubble.\r\n                         \r\n                          AURA (CONT'D)\r\n           Now pull up -- go starboard around\r\n           that next moon rising -- Ardentia.\r\n                         \r\n          FLASH moves his hands over the panel. The craft pulls up\r\n          and banks.\r\n           32.\r\n                         \r\n          INT. COCKPIT - ANOTHER SHOT\r\n          (AURA, FLASH)\r\n                         \r\n          Another moon RISING ahead. Its reddish desert surface is\r\n          swept by a raging sandstorm.\r\n                         \r\n                          FLASH\r\n           Some lucky people live on that one\r\n           too?\r\n                         \r\n                          AURA\r\n           Of course - the Sand Men. Every\r\n           Moon is a kingdom -- seperate and\r\n           hostile to all the others. They\r\n           have nothing in common but Ming's\r\n           rule -- and their hatred of him.\r\n                         \r\n                          FLASH\r\n           Why don't they team up and fight\r\n           him?\r\n                         \r\n                          AURA\r\n           Fight Ming the Merciless?\r\n                          (LAUGHS)\r\n           You saw what happened to the Lizard\r\n           Men.\r\n                         \r\n                         FEATURE FLASH\r\n                         \r\n          With a sudden thoughtful look, his head working.\r\n                         \r\n                          FLASH\r\n           Sue -- but that wasn't a team effort.\r\n                         \r\n                          AURA\r\n           I don't know these words what's a\r\n           \"team\"?\r\n                         \r\n          FLASH just shakes his head. AURA watches him a beat more,\r\n          then reaches up and pulls down a curious gadget hanging above\r\n          her seat. It's a TRANSPARENT HOOD with strange fittings\r\n          inside, not totally unlike a beauty-shop hairdryer.\r\n                         \r\n                          AURA (CONT'D)\r\n           Telekinetic Thought Transfer.\r\n           (setting its dials)\r\n           I'm going to get together with Prince\r\n           Barin in Arboria and tell him I'm\r\n           arriving. He's the one who'll help\r\n           you.\r\n                         \r\n                          FLASH\r\n           Why?\r\n           33.\r\n                         \r\n                          AURA\r\n           Because he does anything I ask. He\r\n           loves me.\r\n                         \r\n                          FLASH\r\n           You can really transfer your thoughts\r\n           with that? Like I could get in touch\r\n           with Dale?\r\n                         \r\n                          AURA\r\n           If I showed you how.\r\n                          (TEASING)\r\n           But I'm not going to.\r\n                         \r\n                          FLASH\r\n           Please.\r\n                         \r\n          AURA just gives him a look and laughs. FLASH stares at her a\r\n          moment, then suddenly MOVES HIS HANDS sharply over the control\r\n          panel. The craft hurtles into a violent DIVE. AURA yells.\r\n                         \r\n                          AURA\r\n           What are you doing?\r\n                         \r\n          AURA drops the plastic hood, lunges to move. her own hands\r\n          on the controls, but FLASH seizes her wrists.\r\n                         \r\n          EXT. SHOOTING THROUGH BUBBLE TO EXT.\r\n                         \r\n          Showing the windblown surface of the moon ARDENTIA dead ahead.\r\n                         \r\n          INT. COCKPIT\r\n          (AURA, FLASH)\r\n                         \r\n                          AURA\r\n           Are you mad> We're diving straight\r\n           at Ardentia!\r\n                         \r\n                          FLASH\r\n           That's right, Princess ··· and we're\r\n           not pulling out until you put that\r\n           gadget over my head and tune me in\r\n           to Dale Arden!\r\n                         \r\n          AURA struggles wildly, but FLASH'S grip on her wrists is\r\n          like iron. The surface of Ardentia LOOMS UP , closer and\r\n          closer.\r\n                         \r\n          INT. MING'S SERAGLIO - BATHING AREA\r\n          (DALE, FLASH'S VOICE, HEDONIA)\r\n                         \r\n          DALE is immersed naked in a bubbly swirling tub, a luxuriant\r\n          prisoner of the FEMALES who bathe and groom her. She seems\r\n          dazed by steam and by the sensuous movement of the water.\r\n           34.\r\n                         \r\n          A couple of the FEMALES lift DALE'S hands, make a cup of\r\n          them. HEDONIA pours rich oil into it.\r\n                         \r\n                          HEDONIA\r\n           Rub this on your body. It gives\r\n           Ming pleasure.\r\n                         \r\n          DALE starts to oil herself as the FEMALES exchange looks and\r\n          LAUGH softly. Suddenly a FILTERED VOICE is HEARD from nowhere,\r\n          though it seems very close:\r\n                         \r\n                          FLASH'S VOICE\r\n           Dale, it's me -- Flash! Am I with\r\n           you?\r\n                         \r\n                         CU DALE\r\n                         \r\n          She blinks, befuddled, pauses in her oiling of herself.\r\n                         \r\n                          HEDONIA\r\n           What's the matter?\r\n                         \r\n                          DALE\r\n           I'm dreaming.\r\n                         \r\n          INT. COCKPIT\r\n                         (FLASH'S VOICE)\r\n                         \r\n                         CU FLASH\r\n                         \r\n          with the Thought Transference gizmo down over his head, a\r\n          faint BLUISH GLOW flickering within, as AURA watches him and\r\n          we SEE the moon Ardentia falling behind rapidly through the\r\n          glass. FLASH concentrates fiercely. We HEAR his VOICED\r\n          THOUGHTS but his lips do not move.\r\n                         \r\n                          FLASH'S VOICE\r\n           No, Dale -- you're not dreaming I'm\r\n           Flash -- I'm with you and you are\r\n           with me!\r\n                         \r\n          INT. MING'S BATHING AREA\r\n          (DALE'S VOICE, FLASH'S VOICE, FLASH' S VOICE)\r\n                         \r\n                          FLASH'S VOICE\r\n           Are you receiving my thoughts?\r\n                         \r\n          Now we HEAR DALE'S VOICE, without her lips moving either:\r\n                         \r\n                          DALE'S VOICE\r\n           I'm receiving something --\r\n           35.\r\n                         \r\n           FLASH' S VOICE\r\n                          (EXCITEDLY)\r\n           I read you, Dale -- I'm getting you\r\n           too! Think of me -- hard!\r\n                         \r\n          INTERCUTS - FLASH AND DALE - SERAGLIO BATH AND COCKPIT\r\n                         \r\n          As they communicate. NOTE: There might be some faint glow\r\n          in the air above the tub some spectral suggestion. of FLASH'S\r\n          presence, the idea being to show that HEDONIA and other\r\n          FEMALES are unaware of this interchange going on as they\r\n          continue to bathe and groom DALE.\r\n                         \r\n          INT. CUTTING BETWEEN BATHING AREA AND COCKPIT\r\n          (DALE'S VOICE, FLASH'S VOICE, FLASH' S VOICE)\r\n                         \r\n                          DALE'S VOICE\r\n           Where are you Flash?\r\n                         \r\n                          FLASH'S VOICE\r\n           Speeding for the Kingdom of Arboria\r\n           to get help! I'm in a spacecraft\r\n           with Aura, Ming's daughter!\r\n                         \r\n                          DALE'S VOICE\r\n           What? That bitch? Don't trust her!\r\n           She's after you!\r\n                         \r\n                          FLASH'S VOICE\r\n           Listen, she means nothing to me --\r\n           not a darn thing. Where are you,\r\n           Dale?\r\n                         \r\n                          DALE'S VOICE\r\n           Naked in a bathtub.\r\n                         \r\n                          FLASH'S VOICE\r\n                          (CHOKED)\r\n           Oh God -- if I could only see you,\r\n           Dale. If I could touch you -- what\r\n           are you in a tub for?\r\n                         \r\n                          DALE'S VOICE\r\n           I'm being fixed up for Ming.\r\n                         \r\n           FLASH' S VOICE\r\n           No! Where's Dr. Zarkov?\r\n                         \r\n                          DALE'S VOICE\r\n           Chained in a dungeon, I think.\r\n           What'll I do, Flash?\r\n                         \r\n           FLASH' S VOICE\r\n           Fake 'em out!\r\n           36.\r\n                         \r\n                          DALE'S VOICE\r\n           How?\r\n                         \r\n                          FLASH'S VOICE\r\n           Just fake 'em out, Dale -- girls\r\n           know how. But don't go too far. I\r\n           mean get to Zarkov and release him,\r\n           I'll have help by then -- I'll find\r\n           you. Can you do all that?\r\n                         \r\n                          DALE'S VOICE\r\n           Sounds like fourth down and about\r\n           ninety yards to go, but I'll try.\r\n                         \r\n                          FLASH'S VOICE\r\n           Dale, you're some girl -- God, you\r\n           really are.\r\n                          (PAUSE)\r\n           Do you get what I'm thinking now?\r\n                         \r\n                          DALE'S VOICE\r\n                          (SUPER-SENSUOUS)\r\n           Oh yes.\r\n                         \r\n           FLASH' S VOICE\r\n           Dale, we're gonna get out of this\r\n           jam -- I swear we will -- I'll find\r\n           you, and when I do we'll -----\r\n                         \r\n          INT. COCKPIT - FEATURE AURA\r\n                         (AURA)\r\n                         \r\n          who has been watching FLASH'S face with increasing frustration\r\n          and jealousy during this, Suddenly snatching the Thought\r\n          Transfer bubble OFF FLASH'S head.\r\n                         \r\n                          AURA\r\n           Enough!\r\n                         \r\n          He has a dazed dreamy look on his face. AURA slaps him out\r\n          of it, points-ahead.\r\n                         \r\n                          AURA (CONT'D)\r\n           There's Arboria!\r\n                         \r\n          EXT. ARBORIA - DAY\r\n                         \r\n          Green tangle of branches and leaves and vines. ANGLING UP ,\r\n          we SEE the SHUTTLE CRAFT approaching us head-on at a down\r\n          angle.\r\n                         \r\n          EXT. ARBORIA - SHUTTLE CRAFT POV\r\n                         \r\n          It races up toward the craft's windshield. We level off for\r\n          a moment, then PLUNGE DOWN again into a blur of green.\r\n           37.\r\n                         \r\n          INT. COCKPIT - FLASH\r\n                         (FLASH)\r\n                         \r\n          Working his hands over the control sensors as crazy GREENERY\r\n          rushes by outside. THUMP THUD CRASH! The craft careens to a\r\n          swinging HALT, so Suddenly that FLASH and AURA almost have\r\n          their wind knocked out as they are thrown against their seat\r\n          belts. FLASH recovers.\r\n                         \r\n                          FLASH\r\n           Sorry. I guess landings aren't my\r\n           thing.\r\n                         \r\n          EXT. SHUTTLE CRAFT\r\n          (AURA, FLASH)\r\n                         \r\n          It hangs snagged in a huge vine, like a creature caught by\r\n          some monstrous boa-constrictor. This is a complete world of\r\n          green, the light, the feeling of the air. Everything rings\r\n          with forest SOUNDS. The very sky is shut from view by leaves\r\n          and foliage.\r\n                         \r\n          The craft's hatch opens. FLASH struggles out, gives AURA a\r\n          hand up. Kneeling on the cabin, FLASH takes in this incredible\r\n          vista stretching all around.\r\n                         \r\n                          FLASH\r\n           Where's Robin Hood?\r\n                         \r\n                          AURA\r\n           Who?\r\n                         \r\n                          FLASH\r\n           It doesn't matter. How do we get\r\n           down.\r\n                         \r\n                          AURA\r\n           Follow me.\r\n                         \r\n          Carefully, balancing lithely, AURA starts along the trunk of\r\n          the great vine that caught them.\r\n                         \r\n          INT. MING'S BEDCHAMBER\r\n          (DALE, SERVING GIRL)\r\n                         \r\n          Ultra-Byzantine splendor. The only light is by a huge bed\r\n          on which DALE reclines. A SERVING GIRL glides up with a\r\n          flagon of that liquid.\r\n                         \r\n                          SERVING GIRL\r\n           He is coming to see you now. Are you\r\n           ready?\r\n           38.\r\n                         \r\n                          DALE\r\n           (easy, smiling)\r\n           Very.\r\n                         \r\n                          SERVING GIRL\r\n           Do you need any more of this?\r\n                         \r\n                          DALE\r\n           No, thanks. Just turn down the light\r\n           a bit, would you? I'm shy.\r\n                         \r\n          The SERVING GIRL leans over the bed to do so. We GLIMPSE\r\n          DALE'S HAND rising quickly to deliver a karate-chop.\r\n                         \r\n          INT. PALACE HALLWAY\r\n                         \r\n          MING walks down it toward a closed door at the end. He pauses\r\n          a moment in anticipation, composes himself, opens the door.\r\n                         \r\n          INT. MING'S BEDCHAMBER\r\n                         \r\n          It's nearly dark. MING comes from shadows, looks down at the\r\n          bed. There is a feminine silhouette on it.\r\n                         \r\n          MING sits, extends a hand. His FINGERS travel sensuously up\r\n          a BARE THIGH, suddenly stop.\r\n                         \r\n          Savagely, MING pulls the face of the GIRL into the light. It\r\n          is not DALE ARDEN but the unconscious SERVING GIRL, now\r\n          dressed in DALE'S gown.\r\n                         \r\n          INT. DUNGEON - MING' S PALACE\r\n                         (GUARD)\r\n                         \r\n          OPENING CLOSE on ZARKOV, who lies asleep in his chains. A\r\n          hand touches his shoulder.\r\n                         \r\n          ZARKOV wakes with a start to SEE a SERVING GIRL bending over\r\n          him, tray in hand. She moves her cloak to reveal that she is\r\n          DALE.\r\n                         \r\n          A GUARD stands nearby against a wall, faceless in the shadow\r\n          of a cowled uniform.\r\n                         \r\n                          GUARD\r\n           Serving Girl - what business have\r\n           you in this dungeon?\r\n                         \r\n          DALE quickly puts the tray down, stands and turns to the\r\n          GUARD She smiles invitingly, lifts her skirt up above her\r\n          knee.\r\n                         \r\n          The legs are long and terrific.\r\n           39.\r\n                         \r\n          The GUARD catches his breath, steps toward her lecherously\r\n          to accept the invitation. WHAM! He doubles up as DALE kicks\r\n          him in the groin, goes down without a sound as a left-right-\r\n          left series of KARATE CHOPS hits his neck.\r\n                         \r\n          He is hardly on the floor before DALE is pouncing on the key-\r\n          ring at his belt.\r\n                         \r\n          EXT. ARBORIA FOREST - FLASH AND AURA\r\n          (AURA, FLASH)\r\n                         \r\n          Making their way swiftly through it between earth and heaven,\r\n          crossing this green world on branches and trunks of monster\r\n          vines. FLASH pauses.\r\n                         \r\n                          FLASH\r\n           Listen -- are you sure this Barin\r\n           will help me?\r\n                         \r\n          Gently, provocatively, AURA puts her finger on his lips to\r\n          silence him.\r\n                         \r\n                          AURA\r\n           Ssssh...... Trust me!\r\n                         \r\n          EXT. ARBORIA - FULL SHOT\r\n          (AURA, FLASH)\r\n                         \r\n          Of a fantastic structure, many levels, built of wood and\r\n          other materials from the heart of the forest.\r\n                         \r\n          MOVE OFF it to find FLASH and AURA nearby, him gazing at\r\n          this apparition with a strange wistful expression.\r\n                         \r\n                          FLASH\r\n           It's amazing -- I dreamed of this\r\n           tree-house when I was a kid --\r\n                         \r\n          AURA laughs softly, waves him on.\r\n                         \r\n          WITH FLASH AND AURA\r\n                         \r\n          climbing the ramp-like stairs which wind up around it in a\r\n          mounting spiral. SUddenly the forest rings with SINGSONG\r\n          CRIES and CALLS I mingled with a sort of ROARING SNARL.\r\n                         \r\n                          AURA\r\n           It's Barin's hunt! Watch!\r\n                         \r\n          AURA leads him on at a run to the wide balcony above.\r\n                         \r\n          EXT. FOREST - MOVING SHOT\r\n                         \r\n          With a desperate LION MAN, running full tilt; roaring and\r\n          snarling as he zig-zags this way and that.\r\n           40.\r\n                         \r\n          There is a SWISHING SOUND and an arrow-like missile catches\r\n          him in the back. Sharp PFSSSSS: as of gas escaping.\r\n                         \r\n          EXT. FOREST - ANOTHER ANGLE\r\n          (ALL THREE MEN, TREE MAN)\r\n                         \r\n          BARIN, PRINCE OF ARBORIA and looking every inch the part,\r\n          stands with a fired crossbow. Over his shoulder is a quiver\r\n          of GLASS ARROWS, each a little POINTED CYLINDER at the end.\r\n                         \r\n          Some distance behind and around we see a number of his loyal\r\n          TREE MEN.\r\n                         \r\n                          TREE MAN\r\n           Barin got him!\r\n                         \r\n           ALL THREE MEN\r\n           Hail, Ming!\r\n                         \r\n          EXT. STRUCTURE - BALCONY\r\n          (AURA, FLASH)\r\n                         \r\n          FLASH -- BESIDE AURA ON BALCONY\r\n                         \r\n          FLASH'S eyes jumping to her as he hears that echoing.\r\n                         \r\n                          FLASH\r\n           These are the guys who are gonna help\r\n           me?\r\n                         \r\n                          AURA\r\n           It means nothing. They only shout\r\n           that because it's treason not to.\r\n           They hate Ming.\r\n                         \r\n          EXT. FOREST - FEATURE BARIN\r\n          (BARIN, FLASH)\r\n                         \r\n                          BARIN\r\n           I scent a Tiger Man near the lodge!\r\n           Form battle lines above and below!\r\n                         \r\n          As the TREE MEN scurry to obey, BARIN moves forward, reloading\r\n          and cocking his weapon.\r\n                         \r\n          The stricken LION MAN comes INTO VIEW. Incredibly, the glass\r\n          arrow in his back has transformed him into a STATUE OF ICE.\r\n          At BARIN'S footfall, he DISINTEGRATES in a tinkling fall of\r\n          frozen shards.\r\n                         \r\n          THE TIGER MAN is poised behind a tree near the lodge, panting.\r\n          He is a magnificent creature, with a horn sticking out of\r\n          his forehead. He tenses, HEARING the BIRDLIKE CALLS of the\r\n          advancing hunters. Closer, closer.\r\n           41.\r\n                         \r\n          ANGLE WIDENS. We SEE another PAIR OF LION MEN crouching\r\n          nearby, terrified. The line of TREE MEN comes INTO VIEW. The\r\n          crouching pair look in appeal to the TIGER MAN by the tree.\r\n          He watches a beat, waves them to run backward, then covering\r\n          the escape of the others, TIGER MAN charges into his enemies\r\n          headlong.\r\n                         \r\n          FROM LODGE BALCONY - POV SHOT\r\n                         \r\n          FLASH and AURA watch the fight. TIGER MAN'S rage is\r\n          magnificent as he flails the nearest TREE MEN without regard\r\n          for their number. He has flattened half a dozen when suddenly\r\n          BARIN'S upper line of TREE MEN leap DOWN on him from the\r\n          branches above, and he is buried under their sheer weight.\r\n                         \r\n          CU FLASH WATCHING\r\n                         \r\n                          FLASH\r\n           I know just how he feels -- we played\r\n           the Pittsburgh Steelers last year.\r\n                         \r\n          EXT. FOREST -FEATURE BARIN\r\n          (BARIN, TREE MAN)\r\n                         \r\n          ANGLE - BARIN advancing by himself, HEARING the triumphant\r\n          SHOUTS of his men.\r\n                         \r\n           TREE MAN (O.S.)\r\n           Prince Barin! We have him!\r\n                         \r\n                          BARIN\r\n           Not him! Bring him back for sport:\r\n                         \r\n          EXT. BALCONY - FLASH\r\n                         (AURA)\r\n                         \r\n          Watching with horrified fascination as NETS are thrown over\r\n          the struggling TIGER MAN. AURA'S eyes bright with lust for\r\n          this kind of spectacle, AURA speaks low to FLASH\r\n                         \r\n                          AURA\r\n           Go inside -- let me talk to Barin\r\n           first.\r\n           (as FLASH hesitates)\r\n           Foolish Earthling - trust me!\r\n                         \r\n          EXT. FOREST - BELOW LODGE\r\n          (AURA, BARIN)\r\n                         \r\n          BARIN walks up ahead of some TREE MEN who are carrying the\r\n          TIGER MAN in their nets. Suddenly he stops, reacting to\r\n          AURA on the balcony.\r\n                         \r\n                          BARIN\r\n           Aura!\r\n           42.\r\n                         \r\n                          AURA\r\n           It's so long since I've been with\r\n           you, Barin -- I couldn't stand it.\r\n           Please don't be too angry at me for\r\n           coming.\r\n                         \r\n                          BARIN\r\n           Angry at you?\r\n                         \r\n          BARIN laughs.\r\n                         \r\n          INT. LODGE\r\n          (AURA, BARIN, FLASH)\r\n                         \r\n          FLASH is flattened against the wall, IWATCHING through louvers\r\n          of a door. SOUND of feet on ramp, SNARLING and ROARING of\r\n          captive TIGER MAN. BARIN comes hastening INTO VIEW on the\r\n          balcony and embraces AURA.\r\n                         \r\n          AURA AND BARIN CLOSE\r\n                         \r\n                          BARIN\r\n           You'll stay the night?\r\n                         \r\n                          AURA\r\n           I've dreamed of it!\r\n                         \r\n          His eyes alight with anticipation, BARIN steps back from\r\n          her. as his MEN arrive with the netted TIGER MAN.\r\n                         \r\n                          BARIN\r\n           Get me a sword --\r\n           (turning to AURA)\r\n           This is the fiercest Tiger Man we\r\n           have ever hunted. I'm going to kill\r\n           him now -- and dedicate his blood to\r\n           you, my beloved.\r\n                         \r\n                          AURA\r\n                          (DELIGHTED)\r\n           But that's treason! Blood can be\r\n           dedicated to Ming alone!\r\n                         \r\n                          BARIN\r\n           I know you, Aura -- the more a man\r\n           risks, the greater your passion. If\r\n           I knew a greater risk, I'd take it.\r\n                         \r\n          AURA SMILES, turns and calls softly toward the interior.\r\n                         \r\n                          AURA\r\n           Flash Gordon -- come out!\r\n                         \r\n          FLASH steps out, halts about ten feet from BARIN. Reactions\r\n          from BARIN and his TREE MEN.\r\n           43.\r\n                         \r\n                          FLASH\r\n           I'm from Earth, Prince Barin. My\r\n           friends and I were Ming's prisoners.\r\n           She kindly brought me here to enlist\r\n           your help.\r\n                         \r\n                          BARIN\r\n           What in hell? My help?\r\n                         \r\n                          AURA\r\n           Hide him from my father -- don't let\r\n           him wander -- keep him for me!\r\n                         \r\n          CU - FLASH\r\n                         \r\n                          FLASH\r\n           Keep me for.....????\r\n                          (STUNNED)\r\n           Oh, my god. I trusted you.\r\n                         \r\n          AURA darts INTO SHOT, puts her lips to his ear and WHISPERS:\r\n                         \r\n                          AURA\r\n           You still must -- I'm playing a game!\r\n                         \r\n                         CU BARIN\r\n                         \r\n                          BARIN\r\n           What? What are you saying?\r\n                         \r\n          AURA darts back into shot on his side now, WHISPERS in same\r\n                         WAY:\r\n                         \r\n                          AURA\r\n           He's a mere toy to me, my love --\r\n           when I'm tired of it we'll kill him!\r\n                         \r\n          BACK TO SCENE\r\n                         \r\n          as AURA quickly steps away, continues aloud:\r\n                         \r\n                          AURA (CONT'D)\r\n           It's the risk I ask, Barin hide him\r\n           for me in Arboria.\r\n                         \r\n                          BARIN\r\n           I'll hide him, all right -- under\r\n           six feet of Arborian dirt!\r\n                         \r\n          The sword BARIN ordered has been brought. He seizes it.\r\n                         \r\n                          FLASH\r\n           I'm not your enemy, Prince Barin. we\r\n           share a hatred of Ming\r\n           44.\r\n                         \r\n                          AURA\r\n           Are you so afraid of my Earthling,\r\n           Barin; Won't you even give him a\r\n           chance?\r\n                         \r\n          BARIN hesitates, provoked by that, then shouts:\r\n                         \r\n                          BARIN\r\n           Snake keeper! Rouse your beast!\r\n                         \r\n          ANGLE - SNAKE KEEPER\r\n                         \r\n          A HALFWIT TREE MAN, drowsing against another part of the\r\n          parapet, He jerks awake, shuffles across to a big wicker\r\n          basket, pulls off the lid. A hideous EEL-LIKE SERPANT rears\r\n          it's head, HISSING and SNAPPING venemously. The KEEPER sticks\r\n          his arm down. The snake coils around it. With a drooling\r\n          grin, the KEEPER withdraws it.\r\n                         \r\n          CU FLASH watching with horrified revulsion.\r\n                         \r\n          BACK TO SCENE\r\n                         \r\n          KEEPER carries the hissing snapping snake toward an enormous\r\n          STUMP of a tree trunk. He holds his arm out over it, WHISTLES\r\n          a curious note. The snake leaps off the arm and VANISHES\r\n          into the hollowed out trunk. We notice now that there are\r\n          SIX HOLES drilled into the gnarled wood.\r\n                         \r\n                          BARIN (CONT'D)\r\n           Who dares the beast?\r\n                         \r\n          A battle-scarred OLD TREE MAN steps forward. without a word,\r\n          he goes to the stump and plunges a hand INTO one of the holes.\r\n                         \r\n          INSIDE THE STUMP\r\n                         \r\n          BIG CU SNAKE with a hiss, fangs strike a wrist.\r\n                         \r\n          INT. LODGE - FEATURE OLD MAN\r\n          (AURA, BARIN, FLASH, TREE MEN)\r\n                         \r\n          With eyes widening in horror, hs face starts to turn BLUE.\r\n          He pulls out his hand and staggers backward. BARIN plunges\r\n          his sword into the man's breast and he topples over the\r\n          parapet, dead. Sword in hand, BARIN turns to FLASH.\r\n                         \r\n                          BARIN\r\n           I did him a mercy. This venom brings\r\n           death only after long tortured\r\n           madness. Your turn, Earthling.\r\n                         \r\n                         CU FLASH\r\n           45.\r\n                         \r\n                          FLASH\r\n           I think I'll pass on this one.\r\n                         \r\n                         INCLUDE BARIN\r\n                         \r\n                          BARIN\r\n           There are six openings to the serpent.\r\n           Five are safe -- the sixth is death.\r\n           Choose one -- or take your end from\r\n           my sword here and now.\r\n                         \r\n                         FLASH\r\n                         \r\n          He swallows, Looks at the stump, at BARIN with his bloody\r\n          sword, to the stump again, then at AURA. He crosses close\r\n          and stares into her glittering eyes.\r\n                         \r\n                          FLASH\r\n           Would you give Dale a message from\r\n           me? Tell her I'm sorry how things\r\n           have panned out -- I Loved her.\r\n                         \r\n                          AURA\r\n           I'll do that.\r\n                         \r\n                          FLASH\r\n           What the hell? Forget it. Sending\r\n           that message by you is like sending\r\n           a lettuce-leaf by a rabbit.\r\n                         \r\n          BARIN'S sword touches FLASH'S back.\r\n                         \r\n          He walks to the stump. Every eye is on him, every breath\r\n          held.\r\n                         \r\n          With a sudden quick motion, FLASH plunges his hand into a\r\n          hole. He leaves it there a second, then whips it back out\r\n          and wheels to BARIN.\r\n                         \r\n                          FLASH (CONT'D)\r\n           Whew! -- Your turn, Prince Barin.\r\n                         \r\n          SHOTS -- AROUND THE GROUP\r\n                         \r\n          BARIN goes still. This is not what he had planned. AURA'S\r\n          Tongue runs over her tee.\r\n                         \r\n                          AURA\r\n           If your love for me is great enough,\r\n           Barin, surely it will protect you\r\n           from the serpent -- no?\r\n                         \r\n          AURA laughs softly. BARIN strides across, plunges his hand\r\n          into another hole, rips it out again unscathed. He whirls to\r\n          FLASH, points the sword at him.\r\n           46.\r\n                         \r\n                          BARIN\r\n           Go again.\r\n                         \r\n          FLASH thrusts into a third hole, pulls out again. Turns.\r\n                         \r\n                          FLASH\r\n           What are you waiting for?\r\n                         \r\n          BARIN glares at him, takes a breath, jams his hand into the\r\n          fourth of the six holes.\r\n                         \r\n          BIG CU BARIN\r\n                         \r\n          His eyes widen horribly, he makes a choked sound. PULL BACK\r\n          FAST as he whips his hand out, unbitten. His face twists\r\n          into a grin.\r\n                         \r\n                          BARIN\r\n           Fooled you, didn't I?\r\n                         \r\n          AURA laughs, turns her smile on FLASH.\r\n                         \r\n                          AURA\r\n           It's an even chance now, Flash Gordon --\r\n           that's better than Daddy would have\r\n           given you --\r\n                         \r\n                          FLASH\r\n           Boy. You oughta be handled with a\r\n           forked stick yourself.\r\n                         \r\n                          BARIN\r\n           If I were you, I'd choose the sword --\r\n                         \r\n          The point touches FLASH again. Just two holes left. He does\r\n          a silently mouthed eeny-meeny-miney-mo between them, plunges\r\n          his hand into one.\r\n                         \r\n          INSIDE THE STUMP\r\n                         \r\n          The snake's head MOVES fast.\r\n                         \r\n          BACK TO SCENE\r\n                         \r\n          QUICK CU - FLASH'S FACE\r\n                         \r\n          Wincing, contorting.\r\n                         \r\n          As FLASH whips his arm out again. Amazingly, he has hold of\r\n          the terrible serpent, grasping it just below the head. CRIES\r\n          from the astounded TREE MEN, and then FLASH is leaping INTO\r\n          ACTION.\r\n           47.\r\n                         \r\n          Whirling, FLASH swings the hissing snapping writhing beast\r\n          at the nearest TREEMEN, scattering them, and thrusts the\r\n          serpent's head at BARIN.\r\n                         \r\n          BARIN slashes with his sword, misses. The serpent's tail\r\n          coils around the blade, rips it from BARIN'S hand as the\r\n          Prince of Arboria dives backwards.\r\n                         \r\n          FLASH whirls again, SLAMS the serpent's head into a post,\r\n          and SNATCHES the sword from the tail before it hits the floor.\r\n                         \r\n          MOVING WITH FLASH\r\n                         \r\n          He dashes for the ramp to the ground.. The TIGER MAN is right\r\n          in front of him, struggling in the net. FLASH pauses, SLASHES\r\n          at the cords. TIGER MAN is freed, bounds to his feet with a\r\n          ROAR, clobbers a pair of TREE MEN just jumping on him and\r\n          FLASH. Snatching one's CROSSBOW and QUIVER OF GLASS ARROWS,\r\n          he races down the ramp behind FLASH.\r\n                         \r\n          BACK TO TOP LEVEL\r\n                         \r\n                         FEATURE BARIN\r\n                         \r\n          Picking himself up, wheeling furiously on AURA, who has been\r\n          watching all this with her lips half parted, her tongue\r\n          flicking teeth in supersensuous excitement.\r\n                         \r\n                          BARIN (CONT'D)\r\n           A mere toy of yours, eh?\r\n                         \r\n                          AURA\r\n                          (TAUNTING)\r\n           Maybe I was wrong -- surely the Prince\r\n           of Arboria wouldn't be beaten by a\r\n           toy.\r\n                         \r\n          BARIN snatches a horn from his belt, blows a BLAST.\r\n                         \r\n                          BARIN\r\n           The hunt's on, my Tree Men!\r\n                         \r\n                          TREE MEN\r\n           To the hunt with Barin!\r\n                         \r\n          EXT. FOREST - FLASH AND TIGER MAN\r\n          (FLASH, TIGER MAN)\r\n                         \r\n          They run through the green tangle. FLASH trips over a vine.\r\n          TIGER MAN picks him up.\r\n                         \r\n                          TIGER MAN\r\n           Thank you for freeing me.\r\n           48.\r\n                         \r\n                          FLASH\r\n           You can speak?\r\n                         \r\n                          TIGER MAN\r\n           For all the good it does me.\r\n                         \r\n          SOUNDS echo: hunting horns, birdcalls of TREE MEN. They start\r\n          running again.\r\n                         \r\n                          FLASH\r\n           Have we a chance, Tiger Man?\r\n                         \r\n                          TIGER MAN\r\n           Only if we climb -- out of the green\r\n           light -- to the sky -- Prince Barin's\r\n           Tree Men can't follow us up there!\r\n                         \r\n                          FLASH\r\n           What do you mean?\r\n                         \r\n                          TIGER MAN\r\n           Ming's Law -- outside his own kingdom,\r\n           every hunter becomes the hunted!\r\n                         \r\n          Ahead is a huge tree made for climbing: branches stick out\r\n          like the rungs of some great green ladder. They leap onto\r\n          the lowest.\r\n                         \r\n          ANGLES - THE TREE - FLASH and TIGER MAN\r\n                         \r\n          Climbing. Jack and the Beanstalk, up and up, panting, but\r\n          there is never a top in sight. Suddenly the branches end.\r\n                         \r\n                          FLASH\r\n           Damn. End of the line.\r\n                         \r\n          TIGER MAN reacts to something off. Touches FLASH'S shoulder\r\n          and points.\r\n                         \r\n          THEIR POV - AT END OF LAST BRANCH\r\n                         \r\n          A crazy sort of ELEVATOR is going by. It's a moving. vine\r\n          with LEAFY BASKETS attached, a vertical conveyor from the\r\n          ground to above. As FLASH and TIGER MAN watch, they SEE one\r\n          basket moving UP with an armed TREE MAN in it, scanning the\r\n          forest below.\r\n                         \r\n                         FLASH\r\n                         \r\n          Snatches the crossbow off TIGER MAN'S back, cocks it, notches\r\n          it quickly with a GLASS ARROW from the quiver.\r\n                         \r\n          INCLUDE THE TREE MAN\r\n           49.\r\n                         \r\n          hearing the CLICK of the cocking. He wheels, looks up, SEES\r\n          FLASH. Letting out a fierce BIRDCALL. he jumps up and swings\r\n          his own crossbow just as FLASH shoots.\r\n                         \r\n          SWISH-PFFST as FLASH'S arrow hits him. ICE, he tumbles out\r\n          of the basket.\r\n                         \r\n          FLASH and TIGER MAN\r\n                         \r\n          Run out along the branch, jump INTO the basket as it passes\r\n          by.\r\n                         \r\n                          FLASH (CONT'D)\r\n           How far will this take us?\r\n                         \r\n                          TIGER MAN\r\n           I don't know --no man has ever been\r\n           above the green.\r\n                         \r\n          EXT. ANOTHER PART OF THE TREES\r\n          (BARIN, FLASH, TREE MAN, TIGER MAN, TREE MAN LEADER)\r\n                         \r\n          BARIN and a troop of TREE MEN are poised in the branches,\r\n          listening acutely. The one scouting in front calls back:\r\n                         \r\n                          TREE MAN\r\n           The sight -- call came from the left!\r\n                         \r\n          TREE MA.i. The sight-call carne from the left:\r\n                         \r\n                          BARIN\r\n           Up and across we'll cut them off!\r\n                         \r\n          He BLOWS his horn again. The TREE MEN start moving quickly\r\n          some climbing, others SWINGING laterally on vines.\r\n                         \r\n          IN THE BASKET\r\n                         \r\n          FLASH and TIGER MAN\r\n                         \r\n          Rising looking upward, as the light through the leaves is\r\n          changing, becoming less intensely green.\r\n                         \r\n                          TIGER MAN\r\n           What is that color above?\r\n                         \r\n                          FLASH\r\n           Blue. We call is blue.\r\n                         \r\n          A DOZEN TREE MEN come swinging into view on vines, land on a\r\n          fat branch. The LEADER looks right in this direction, points\r\n          and gives a chilling BIRDCALL. The TREE MEN unsling their\r\n          crossbows, reach for GLASS ARROWS.\r\n                         \r\n          FLASH and TIGER MAN\r\n           50.\r\n                         \r\n          SEEING cold death staring them in the face.\r\n                         \r\n          FLASH reaches for an arrow, notches it.\r\n                         \r\n           TREE MAN LEADER\r\n           You haven't a chance! Throw down\r\n           your weapon!\r\n                         \r\n          FLASH makes like to throw his crossbow away. At the last\r\n          instant, h swings it around, aims and FIRES.\r\n                         \r\n          TREE MEN ON BRANCH\r\n                         \r\n          Are startled as the arrow WHIRRS in and sticks into the branch\r\n          under their feet. The branch instantly turns to ICE.\r\n                         \r\n          BARIN - CLIMBING FROM BELOW\r\n                         \r\n          HEARS a loud brittle CRACKING SOUND. He looks up, gapes,\r\n          holds on tight to the tree trunk. A dozen SHRIEKING TREE MEN\r\n          plummet down around him amidst chunks of ICE, crashing through\r\n          the branches to doom. A look of fierce delight on his face,\r\n          BARIN resumes his climb.\r\n                         \r\n          EXT. TREETOPS OF ARBORIA\r\n          (FLASH, TIGER MAN)\r\n                         \r\n          FLASH and TIGER MAN jump from their basket into a wide leaf,\r\n          near a loading platform where the elevator-vine goes around\r\n          a great iron wheel. The forest is open to the sky at this\r\n          altitude, a sunny Eden of huge exotic flowers. Enormous\r\n          overlapping leaves form a floor FLASH and TIGER MAN can stand\r\n          on.\r\n                         \r\n                          FLASH\r\n           Which way to the border:\r\n                         \r\n                          TIGER MAN\r\n           Legend says Arboria ends in an ocean\r\n           to the west.\r\n                         \r\n          FLASH quickly checks his wristwatch and the angle of the\r\n          shadows, starts in the direction he estimates is west.\r\n                         \r\n          TREETOPS OF ARBORIA - OTHER ANGLES\r\n                         \r\n          FLASH and TIGER MAN running over the leaves, which are\r\n          somewhat BOUNCY like a huge trampoline. It's quite enjoyable.\r\n          FLASH laughs aloud at the sensation, takes a big jump off\r\n          the edge of one leaf, BOUNCES HIGH from the next.\r\n                         \r\n          Amazingly, a fat TENDRIL seizes him in mid-air, coils around\r\n          his waist. FLASH yells as he is lifted further up.\r\n                         \r\n          AN ENORMOUS FLOWER\r\n           51.\r\n                         \r\n          is right above him. The closed petals open. The inside is\r\n          viscous, hideous looking. In the deepest recess is a dark\r\n          red blob which PULSES like a huge heart, emits a BEING SOUND.\r\n          With horror, FLASH realizes the tendril is feeding him into\r\n          the flower's maw.\r\n                         \r\n          PLASH struggles vainly against the tendril's strength. TIGER\r\n          MAN dashes to his rescue below, but another tendril knocks\r\n          him flat.\r\n                         \r\n          INT. FLOWER\r\n          (BARIN, FLASH)\r\n                         \r\n          FLASH is conveyed INTO the flower. He punches wildly with\r\n          his fists, kicks, but petals are CLOSING inexorably around\r\n          him. On their inner surface are deadly spiny SPIKES.\r\n          Scattered around are the crushed SKELETONS of luckless TREE\r\n          MEN who have been fed in here.\r\n                         \r\n          SWISH-PFFFFST! Out of nowhere a GLASS ARROW comes flying\r\n          past FLASH'S ear, sinks itself into the flower's heart. The\r\n          flower SHRIEKS. All around, FLASH, it is turning into\r\n          crystalline ICE.\r\n                         \r\n          The tendrils lose their grip, FLASH falls onto the leaf below\r\n          beside the TIGER MAN.\r\n                         \r\n          TREETOPS - ANOTHER ANGLE\r\n                         \r\n          As FLASH turns his head to see BARIN standing with his\r\n          crossbow on a leaf some twenty feet away.\r\n                         \r\n                          BARIN\r\n           I saved you because your death must\r\n           be mine.\r\n                         \r\n                          FLASH\r\n           What's the point of all this killing?\r\n           Why don't we team up and overthrow\r\n           Ming?\r\n                         \r\n          BARIN notches another arrow, cocks his bow, with slow pleasure\r\n          raises it and aims at FLASH'S heart. Suddenly a SHADOW covers\r\n          BARIN. He jerks his head up to SEE:\r\n                         \r\n          A WINGED SILHOUETTE\r\n                         \r\n          Diving from the sun at him. It is a HAWKMAN, magnificiently\r\n          fierce. It seizes BARIN in its talons and lifts him INTO THE\r\n          AIR.\r\n                         \r\n                         OTHER HAWKMEN\r\n                         \r\n          Hover, their wings beating the air. They dive on FLASH and\r\n          TIGER MAN, lift them too.\r\n           52.\r\n                         \r\n          EXT. SKY - AURA'S SPACECRAFT\r\n                         \r\n          Rises in a steep climb over Arboria.\r\n                         \r\n          INT. COCKPIT - AURA\r\n                         \r\n          In the pilot's seat gazes OFF at something through tricky\r\n          little binoculars.\r\n                         \r\n          WHAT SHE SEES - DISTANT HAWKMEN\r\n                         \r\n          Ascending with their three captives-\r\n                         \r\n          INT. COCKPIT -AURA\r\n                         (AURA'S VOICE)\r\n                         \r\n          Put the binoculars down, with one hand lowers the THOUGHT\r\n          TRANSFER hood over her head, with the other waves the craft\r\n          into a sharp turn away from the HAWKMEN. Without her lips\r\n                         MOVING:\r\n                         \r\n                          AURA'S VOICE\r\n           Princess Aura returns to Mingo City\r\n           The passage through the force-field\r\n           opens at her approach --\r\n                         \r\n          AURA twists the tuning dial, then goes on in a soft\r\n                         PROVOCATIVE TONE:\r\n                         \r\n           AURA'S VOICE (CONT'D)\r\n           Daddy darling -- am I with you? Are\r\n           you getting me?\r\n                         \r\n          EXT. GRASSY AREA - ZARKOV'S CAPSULE\r\n                         \r\n          Sits some fanciful form of ground transport: perhaps a thing\r\n          with bicycle wheels and sails.\r\n                         \r\n          INT. CAPSULE - ZARKOV AND DALE\r\n          (DALE, ZARKOV)\r\n                         \r\n          They are inside, she watching tensely as ZARKQV throws\r\n          switches and eyes displays.\r\n                         \r\n                          DALE\r\n           Will it fly?\r\n                         \r\n                          ZARKOV\r\n           Basic circuits seem okay.\r\n                         \r\n                          DALE\r\n           It has-to fly! We gotta rescue FLASH\r\n           from that vampire before she --\r\n                         \r\n          Sudden BLINDING BLUE LIGHT explodes within the capsule.\r\n           53.\r\n                         \r\n                          ZARKOV\r\n           Jump!!\r\n                         \r\n          EXT. CAPSULE - ZARKOV AND DALE - CONTINUOUS\r\n          (DALE, ZARKOV)\r\n                         \r\n          Come diving out headlong into the grass.\r\n                         \r\n                          DALE\r\n           What happened?\r\n                         \r\n                          ZARKOV\r\n           Heaven knows. I was just starting to\r\n           test the primary transformer-banks\r\n                          AND ----\r\n                         \r\n          ZARKOV stops abruptly, looking down at himself. DALE gasps.\r\n                         \r\n                          DALE\r\n           My God -- your hands! Your hands\r\n           are gone!\r\n                         \r\n          It is true: ZARKOV has no hands.\r\n                         \r\n                          ZARKOV\r\n           Not gone -- Just invisible. See?\r\n                         \r\n          INVISIBLE HANDS pick up a pebble from the ground, hold it\r\n          before DALE'S nose. Magically, they toss the little object\r\n          back and forth from one UNSEEN HAND to the other. DALE touches\r\n          one, can feel it.\r\n                         \r\n                          DALE\r\n           Does it hurt?\r\n                         \r\n                          ZARKOV\r\n           Not a bit. I believe Mongo's\r\n           gravitational. field must have\r\n           reversed the polarity of my generator\r\n           so that --\r\n                         \r\n          He breaks off again. Slowly, in front of our eyes, ZARKOV'S\r\n          HANDS are FADING IN, again and becoming VISIBLE. DALE whistles\r\n          in amazement.\r\n                         \r\n                          ZARKOV (CONT'D)\r\n           Neat trick. I wonder if it's\r\n           controllable?\r\n                         \r\n          SHADOW over them suddenly. Great WHIRRING of wings. DALE\r\n          Looks up and SCREAMS.\r\n                         \r\n                         HAWKMEN\r\n           54.\r\n                         \r\n          Swoop down on ZARKOV and DALE, bear them aloft as they did\r\n          with FLASH AND TIGER MAN.\r\n                         \r\n          INT. MING'S DOME ROOM\r\n          (KLYTUS, MING)\r\n                         \r\n                         CU MING\r\n                         \r\n          In his wonderous DOME ROOM, watching something. PULL BACK.\r\n          KLYTUS is beside him as usual. ANGLE to include the VIEWING\r\n          SCREEN which MING is watching. On it is a directional\r\n          continuation of the scene we just saw: a struggling DALE\r\n          being Carrie dup into the open sky by HAWKMEN.\r\n                         \r\n                          KLYTUS\r\n           Mongo is restless today. Your vessels\r\n           stray from their appointed\r\n           kingdoms....\r\n                         \r\n                          MING\r\n           That damned Vultan -- time I clipped\r\n           his wings once and for all. We could\r\n           put those insolent Hawkmen of his to\r\n           work in the plasma cavern ----\r\n                         \r\n                          KLYTUS\r\n           Dale Arden and Flash Gordon? Will I\r\n           send out the Imperial Fleet to bring\r\n           them back?\r\n                         \r\n                          MING\r\n           We'll let Vultan tame her first --\r\n           I'll look pretty to Dale Arden after\r\n           him. Flash Gordon is nobody.\r\n                         \r\n          KLYTUS smiles that sinister way. MING looks at him\r\n          questioningly.\r\n                         \r\n                          KLYTUS\r\n           Sire, it is not for me to tell Great,\r\n           Ming that he is making mistakes.\r\n                         \r\n          EXT. SKY - WIDE SHOT\r\n          (HAWKMAN, TIGER MAN)\r\n                         \r\n          Serried squadrons of HAWKMEN escort the ones bearing FLASH,\r\n          BARIN and TIGER MAN through space.\r\n                         \r\n          CLOSER - TIGER MAN\r\n                         \r\n          Struggling against the TWO HAWKMEN who have him, snarling\r\n          and roaring. He butts one in the belly with his horn.\r\n                         \r\n                          HAWKMAN\r\n           Want us to let you go, et?\r\n           55.\r\n                         \r\n                          TIGER MAN\r\n           Yes!!\r\n                         \r\n                          HAWKMAN\r\n           Okay.\r\n                         \r\n                          TIGER MAN\r\n           Nooo!!!\r\n                         \r\n          SKY - WIDE PANORAMA\r\n                         \r\n          Light streams rough tremendous El Greco clouds. HAWKMEN Are\r\n          tiny figures, rising against it.\r\n                         \r\n          Higher, higher. Above the clouds a blinding DAZZLE comes\r\n          INTO FRAME. It resolves into a fantastic SKY PALACE hanging\r\n          in mid-air, reflecting sunlight from myriad turrets and\r\n          terraces. The HAWKMEN climb above it.\r\n                         \r\n                         CLOSER HAWKMEN\r\n                         \r\n          Carrying FLASH and BARIN and TIGER MAN , going into a\r\n          screaming dive.\r\n                         \r\n          EXT. SKY PALACE - HAWKMEN POV\r\n                         \r\n          Rushing at us with horrifying speed. ZOOMING DOWN we see a\r\n          dark opening. The wind howling around wings, we rush dizzingly\r\n          into the aperture.\r\n                         \r\n          EXT. SKY PALACE - VULTAN'S EYRIE - A HIGH TERRACE\r\n                         (DALE)\r\n                         \r\n          VULTAN circles admiringly around DALE. VULTAN is a lusty\r\n          viking of the sky, winged like his men, one eye blinded, his\r\n          beard cloven by an old scar from forehead to jaw. Gorgeous\r\n          HAWKGIRLS watch jealously as VULTAN inspects DALE very\r\n          closely, reaches out a sly hand and touches her bosom. DALE\r\n          slaps his hand away.\r\n                         \r\n                          DALE\r\n           Watch out, you old bird -- Ming wants\r\n           to marry me.\r\n                         \r\n          VULTAN hoots at that as HAWKGIRLS murmur. He's about to\r\n          touch her again when there is a CLAMOR o.s. VULTAN reacts.\r\n                         \r\n          EXT. SKY PALACE - ANOTHER LEVEL\r\n          (BARIN, DALE, FLASH, SARIN, VULTAN, ZARKOV, ZAAKOV)\r\n                         \r\n          HAWKMEN carrying FLASH, TIGER MAN and BARIN swoop OUT from\r\n          another hole like the one they dove into. The whole place is\r\n          like a great hanging birdhouse, HAWKWOMEN and HAWCHILDREN\r\n          moving in and out and perching on the various exterior\r\n          terraces.\r\n           56.\r\n                         \r\n          FLASH and TIGER MAN\r\n                         \r\n          Are dropped on to a terrace, so hard it stuns them.\r\n                         \r\n                         BARIN\r\n                         \r\n          Is lowered more carefully on another terrace, this one\r\n          grander, with a throne in the center.\r\n                         \r\n                         FEATURE VULTAN\r\n                         \r\n          Flying down from above, hovering above BARIN with menacing\r\n          glee.\r\n                         \r\n                          VULTAN\r\n           Ho! -- Barin! - I knew my Hawkmen\r\n           would catch you one of these days.\r\n                         \r\n                          SARIN\r\n           Be careful how you address me, Vultan.\r\n           I am Prince Barin, ruler of Arboria.\r\n                         \r\n                          VULTAN\r\n           Not in my Kingdom -- here you're\r\n           just a stray animal to be killed for\r\n           our sport!\r\n                         \r\n                          BARIN\r\n           Will you do that, Vultan?\r\n                         \r\n                          VULTAN\r\n           What would you do if you'd caught me\r\n           in Arboria?\r\n                         \r\n                          BARIN\r\n           Yes -- I would hunt you down and\r\n           kill you without mercy.\r\n                         \r\n          FLASH on the OTHER TERRACE\r\n                         \r\n          Lifts his head groggily, reacts to something. ANGLE TO\r\n          INCLUDE ZARKOV, stumbling out from an opening in his usual\r\n          clothes.\r\n                         \r\n                          ZARKOV\r\n           Hello - we do meet in the strangest\r\n           places.\r\n                         \r\n                          FLASH\r\n           Where's Dale?\r\n                         \r\n                          ZAAKOV\r\n           The boss-bird has her up in his\r\n           57.\r\n                         \r\n          Sudden ear-piercing SCREAM from above. DALE'S scream, FLASH\r\n          bounds to his feet.\r\n                         \r\n          IN THE EYRIE\r\n                         \r\n          DALE is surrounded by jealous HAWKGIRLS who are pushing her\r\n          toward the terrace edge. Screaming again, DALE goes OVER.\r\n                         \r\n          SPACE BETWEEN TWO TERRACES/ ONE TERRACE\r\n                         \r\n          FLASH wheels toward the sound, dives to the parapet and\r\n          catches DALE as she plunges past.\r\n                         \r\n                          DALE\r\n           Flash! Oh darling!\r\n                         \r\n                          FLASH\r\n           Dale baby!\r\n                         \r\n          He hauls her in and they embrace in a steamy kiss. FLUTTER\r\n          of wings. HAWKMEN swoop at the terrace and LIFT UP the\r\n          clinging couple. It barely interrupts their conversation:\r\n                         \r\n                          DALE\r\n           Flash -- when I was in that tub --\r\n                         \r\n                          FLASH\r\n           Yes -- it was me --\r\n                         \r\n                          DALE\r\n           Did you mean it?\r\n                         \r\n                          FLASH\r\n           Every thought, baby! --\r\n                         \r\n          EXT. VULTAN'S TERRACE\r\n          (BARIN, DALE, FLASH, HAWKPEOPLE, TIGER MAN, VULTAN)\r\n                         \r\n          As FLASH and DALE are lowered on it.\r\n                         \r\n                          VULTAN\r\n           No. What have you to say to Vultan,\r\n           Prince of the Air?\r\n                         \r\n                          FLASH\r\n           We're all Ming's prisoners. I say\r\n           let's team up and smash him.\r\n                         \r\n           TIGER MAN (O.S.)\r\n           Listen to his words! --\r\n                         \r\n          ANOTHER TERRACE - TIGER MAN\r\n                         \r\n          On his feet on the other terrace, shouting across:\r\n           58.\r\n                         \r\n           TIGER MAN (CONT'D)\r\n           I know -- I'm only an ignorant Tiger\r\n           Man -- but I tell you Flash Gordon\r\n           is the leader we've waited for!\r\n                         \r\n          BACK TO VULTAN'S TERRACE\r\n                         \r\n          Where VULTAN gazes at TIGER MAN a beat, then turns mocking\r\n          eyes on FLASH.\r\n                         \r\n                          VULTAN\r\n           You're a leader, he?\r\n                         \r\n                          FLASH\r\n           Well, back home it's what I'm paid\r\n           for -- I called a pretty good game\r\n           against the Dallas Cowboys once ---\r\n                         \r\n                          VULTAN\r\n                          (TO BARIN)\r\n           Do you understand him?\r\n                         \r\n                          BARIN\r\n           Not a word.\r\n                          (LIKE ICE)\r\n           I was hunting him when you seized\r\n           me. Before you finish me. Vultan I\r\n           beg only that you let me finish him.\r\n                         \r\n                          FLASH\r\n           Oh god -- here we go again --\r\n                         \r\n                          DALE\r\n           Is everyone on Mongo CRAZY? Haven't\r\n           you guys ever heard of TEAMWORK?\r\n                         \r\n                          FLASH\r\n                          (TO BARIN)\r\n           When I had that damn snake in my\r\n           hand, I could've poked it in your\r\n           face and KILLED you.\r\n                         \r\n                          BARIN\r\n           I had you in bow-sight you were\r\n           dead!\r\n                         \r\n                          VULTAN\r\n           Enough!\r\n           (shouting to all around)\r\n           These vagrants talk a brave fight,\r\n           my Hawkmen! Shall we test their\r\n           words?\r\n                         \r\n          QUICK CUTS - HAWKPEOPLE\r\n           59.\r\n                         \r\n          CHEERING AND SHOUTING eagerly from all around:\r\n                         \r\n                          HAWKPEOPLE\r\n           Test them! -- Let's have sport! The\r\n           joust! -- To the joust! --\r\n                         \r\n                         CU VULTAN\r\n                         \r\n                          VULTAN\r\n           Take them below -- put them together.\r\n                         \r\n          INT. SKY PALACE - A RAMP\r\n          (DALE, FLASH, ZARKOV)\r\n                         \r\n          VULTAN leads the way down. FLASH, BARIN, DALE, ZAAKOV and\r\n          TIGER MAN are escorted by many fierce HAWKMEN.\r\n                         \r\n                          DALE\r\n           Flash - don't do this.\r\n                         \r\n                          FLASH\r\n           (low, bitter)\r\n           I've got to.\r\n                         \r\n                          DALE\r\n           Why?\r\n                         \r\n                          ZARKOV\r\n           He has no choice, Dale it's the Mongo\r\n           way.\r\n                         \r\n                          DALE\r\n           I'm so homesick -- what I wouldn't\r\n           give for a nice quiet night with\r\n           some muggers in Central Park --\r\n                         \r\n          FLASH squeezes DALE'S hand.\r\n                         \r\n          Ahead appears an archway opening to the sky. A GREAT GONG\r\n          is heard.\r\n                         \r\n                         ANOTHER TERRACE\r\n                         \r\n          ANGLE - HAWKMAN appears with a mallet, he beats again on a\r\n          huge bronze GONG.\r\n                         \r\n          EXT. SKY PALACE - WIDE SHOT\r\n                         \r\n          Startling sight: A big DISC hangs in the air between the\r\n          curved prongs of a lower terrace, the shaft that supports it\r\n          lost in clouds below.\r\n           60.\r\n                         \r\n          EXT. A LOWER PLATFORM\r\n                         (VULTAN)\r\n                         \r\n          FLASH and the OTHERS appear. They halt, looking at the disc.\r\n                         \r\n                          VULTAN\r\n           Prepare them!\r\n                         \r\n          ONT HE DISC - A HAWKMAN\r\n                         \r\n          Is GREASING the shiny surface with a mop, slipping around a\r\n          bit as he does so.\r\n                         \r\n                         ANOTHER TERRACE\r\n                         \r\n          SHOTS - ASH AND BARIN getting prepared. Removing shirts being\r\n          equipped with heavy leather gauntlets, and so on. Each is\r\n          given a long vicious WHIP.\r\n                         \r\n          THE LOWER PLATFORM\r\n                         \r\n          ANGLE - a bridge-like plank extends itself, out over the\r\n          edge of the shiny greased disc. FLASH and BARIN appear, ready\r\n          for combat. HAWKMEN behind them, wthey start out over the\r\n          bridge.\r\n                         \r\n                          VULTAN (CONT'D)\r\n           Arm the disc!\r\n                         \r\n          CU - FLASH\r\n                         \r\n          Stopping short, eyes popping, as he SEES:\r\n                         \r\n          ON THE DISC\r\n                         \r\n          Razor sharp knives are POPPING UP from the top surface all\r\n          over, maybe two feet apart. If a man loses his footing and\r\n          falls he will surely be fatally impaled.\r\n                         \r\n          INT. LOWER PLATFORM\r\n          (BARIN, DALE, FLASH, MING'S VOICE, VULTAN, ZARKOV)\r\n                         \r\n          FEATURE FLASH and BARIN with whips in hand, they step from\r\n          the bridge onto the disc. FLASH almost slips and falls\r\n          immediately.\r\n                         \r\n          QUICK CU - DALE\r\n                         \r\n                          DALE\r\n           Flash!!\r\n                         \r\n          CU - FLASH\r\n           61.\r\n                         \r\n          Getting his balance again. BARIN moves across amidst the\r\n          knives, takes a stance facing FLASH, raises and coils back\r\n          his whip.\r\n                         \r\n                          BARIN\r\n           Ready for me, Earthling?\r\n                         \r\n                          FLASH\r\n                          (POISED LIKEWISE)\r\n           I ask you to swear, Barin -- if you\r\n           defeat me, you'll join Vultan against\r\n           Ming! If for no other reasons, because\r\n           you'll never have Aura as long as\r\n           her father lives!-\r\n                         \r\n                          BARIN\r\n           What do you now of Aura?\r\n                         \r\n                          FLASH\r\n           Quite a lot!\r\n                         \r\n          ZWIPPP! BARIN'S whip lashes out savagely at FLASH.\r\n                         \r\n          ANGLES - FLASH AND BARIN - SPECTATOR REACTIONS\r\n                         \r\n          Suddenly the fight begins. FLASH and BARIN stalk around,\r\n          slipping on the grease, whamming at each other with their\r\n          whips. The disc suddenly begins to TILT and SWAY, making\r\n          this affair even more desperate.\r\n                         \r\n          BARIN begins to get an edge. Slashing, cutting, he drives\r\n          FLASH back.\r\n                         \r\n                         CU DALE\r\n                         \r\n                          DALE\r\n           Flash, I love you! Win for me,\r\n           Flash!??\r\n                         \r\n                         FEATURE FLASH\r\n                         \r\n          Adrenaline courses through his veins as he hears that over\r\n          the uproar.\r\n                         \r\n          He flies at BARIN, dodges the lash, grapples with him hand-\r\n          to-hand.\r\n                         \r\n          They wrestle their way tot he very rim of the swaying tilting\r\n          surface. It looks bad again for FLASH, when with a superhuman\r\n          effort he flips BARIN over his back... over the edge!\r\n                         \r\n          In the same instant, FLASH dives onto his side amidst the\r\n          deadly knives and grabs at BARIN'S wrist.\r\n           62.\r\n                         \r\n          FLASH catches him. BARIN hangs suspended over the abyss of\r\n          space held only by FLASH'S grip.\r\n                         \r\n                          VULTAN\r\n           You've won, Earthling! Drop him to\r\n           doom!\r\n                         \r\n                          FLASH\r\n           (gasping at BARIN)\r\n           Try to catch my wrist! -- the other\r\n           one.\r\n                         \r\n                          VULTAN\r\n           What is this??\r\n                         \r\n                          ZARKOV\r\n           Call it what you want, Vultan --\r\n           compassion -- mercy: let us teach\r\n           you the meaning of these words.\r\n                         \r\n                          FLASH\r\n                          (TO BARIN)\r\n           Swing your body -- see if you can\r\n           get a leg up here!\r\n                         \r\n          Suddenly an ECHOING VOICE BOOMS from the sky:\r\n                         \r\n                          MING'S VOICE\r\n           Vultan! Hear Ming, Ruler of the\r\n           Universe!\r\n                         \r\n          INT. MING'S DOME\r\n          (AURA, MING, MING'S VOICE, VULTAN, ZARKOV)\r\n                         \r\n          Where MING watches the SKY PALACE SCENE on a viewing screen,\r\n          a weeping AURA beside him, as he goes on:\r\n                         \r\n                          MING\r\n           I see you, Vultan -- and Barin too!\r\n           You both have defied we by sparing\r\n           these Earthlings!\r\n                         \r\n                          AURA\r\n           Barin -- my only -- I swear I didn't\r\n           mean to get you into this!\r\n                         \r\n                         FEATURE VULTAN\r\n                         \r\n          As the VOICE goes on:\r\n                         \r\n                          MING'S VOICE\r\n           Do you want to live, Vultan?\r\n                         \r\n                          VULTAN\r\n           What creature wants to die?\r\n           63.\r\n                         \r\n                          MING'S VOICE\r\n           Then kill Flash Gordon now! Pick up\r\n           Dale Arden, deliver her to me on\r\n           your own wings -- it's your only\r\n           chance! My fleet is already in the\r\n           air, ready to destroy your whole\r\n           Kingdom if you disobey!\r\n                         \r\n          The ECHO rolls and dies.\r\n                         \r\n                         DISC\r\n                         \r\n          TIGER MAN suddenly leaps out onto the disc, slides over\r\n          between the knives, helps FLASH pull BARIN up to safety.\r\n                         \r\n                         AS BEFORE\r\n                         \r\n          ZARKOV in his chains, walks over to the confused VULTAN...\r\n                         QUIETLY:\r\n                         \r\n                          ZARKOV\r\n           What'll you have -- death or dishonor?\r\n                         \r\n          VULTAN looks down at FLASH once more, then makes up his mind.\r\n          He shouts to his people:\r\n                         \r\n                          VULTAN\r\n           We'll save these Earthlings! - Curse\r\n           Ming! -- Into the air, my Hawkpeople -\r\n           fly!\r\n                         \r\n          ZARKOV grins, extends a hand to VULTAN. He just looks at\r\n          it.\r\n                         \r\n                          VULTAN (CONT'D)\r\n           I don't understand this. I think\r\n           I've gone mad.\r\n                         \r\n          INT. MING'S DOME\r\n          (AURA, MING)\r\n                         \r\n          MING snaps off the viewing screen, looks at AURA\r\n                         \r\n                          AURA\r\n           Spare him Daddy -- oh please spare\r\n                          BARIN --\r\n                         \r\n          AURA tries to throw herself into his arm, but he pushes her\r\n          roughly away.\r\n                         \r\n          KLYTUS materialises from a shadow, smiling.\r\n                         \r\n                          MING\r\n           You've always wanted her, Klytus --\r\n           Aura is yours.\r\n           64.\r\n                         \r\n          EXT. SKY PALACE - LONG SHOT\r\n                         \r\n          It is being evacuated. Squadrons of HAWAKPEOPLE stream out\r\n          of its many openings, diminutive figures against the sky.\r\n                         \r\n          ANOTHER PART OF THE SKY\r\n                         \r\n          Several ROCKET-SHIPS appear, wonderfully gaudy contraptions\r\n          with MING's battle-flags flying. A RAY shoots out from the\r\n          nose of the biggest.\r\n                         \r\n          EXT. SKY PALACE - LONG SHOT\r\n                         \r\n          The RAY zaps it. The whole place EXPLODES.\r\n                         \r\n          EXT. SQUADRON OF HAWKMEN - IN FLIGHT\r\n          (DALE, FLASH, VULTAN, ZARKOV)\r\n                         \r\n          VULTAN and his CAPTAIN lead. Ranged around are BARIN, FLASH,\r\n          DALE ,TIGER MAN and ZARKOV, each carried by a HAWKMAN. Distant\r\n          explosions rumble like thunder.\r\n                         \r\n                          VULTAN\r\n           Don't look back, Hawkman. Head for\r\n           that cloud-cover!\r\n           (over his shoulder)\r\n           Where's this capsule of yours,\r\n           exactly?\r\n                         \r\n                          ZARKOV\r\n           In the high grass east of Mingo.\r\n                         \r\n                          VULTAN\r\n           Pick it up, Captain!\r\n                         \r\n          The CAPTAIN and a FEW HAWKMEN peel off.\r\n                         \r\n          FLASH and DALE\r\n                         \r\n          Gaze at each other lovingly, flown along about a hundred\r\n          feet apart. He calls for her:\r\n                         \r\n                          FLASH\r\n           Guess the first thing you and me are\r\n           gonna do after we land..!\r\n                         \r\n                          DALE\r\n           Darling not in front of the Hawkmen --\r\n           you'll make me blush! --\r\n                         \r\n                          FLASH\r\n           Gonna do it first thing -- around\r\n           here, never know if you'll get another\r\n           chance!\r\n           65.\r\n                         \r\n          Dark SHADOW falls over DALE. She looks up.\r\n                         \r\n          ANOTHER ANGLE IN THE SKY\r\n                         \r\n          A big ROCKET SHIP hovers, doors in its bottom side opening.\r\n          A flickering RAY shoots down.\r\n                         \r\n          BACK TO THE HAWKMEN AND OTHERS IN SKY\r\n                         \r\n                         FEATURE DALE\r\n                         \r\n          As an effulgent GLOW envelopes her. Inexorably, DALE and\r\n          her HAWKMEN are sucked upward.\r\n                         \r\n                          DALE\r\n           Help!!\r\n                         \r\n                          FLASH\r\n           I'm coming, Dale!\r\n           (to his Hawkmen)\r\n           Follow her -- climb!\r\n                         \r\n          VULTAN's command of course takes precedence. The HAWKMAN\r\n          bearing FLASH follows his mates into a shrieking vertical.\r\n          dive.\r\n                         \r\n          INT. ROCKET SHIP\r\n          (DALE, HEDONIA)\r\n                         \r\n          DALE and her HAWKMAN are sucked up into a chamber. Waiting\r\n          SOLDIERS seize the struggling HAWKMAN, brutally smash his\r\n          wings pitch him OUT the bottom as the doors close.\r\n                         \r\n          DALE backs off, drops into a karate stance, With a WHINING\r\n          ROAR the craft accelerates throwing DALE off balance against\r\n          a wall. HEDONIA enters through a door, her arms full seems\r\n          to be yards and yards of filmy white material. HEDONIA Smiles\r\n          nicely.\r\n                         \r\n                          HEDONIA\r\n           Time is short. Ming sent me to fit\r\n           you with is.\r\n                         \r\n                          DALE\r\n           Fit me with what?\r\n                         \r\n                          HEDONIA\r\n           Your wedding dress.\r\n                         \r\n          EXT. ARBORIA - VINCINITY OF LODGE\r\n                         \r\n          TREE MEN and LION MEN and TIGER MAN toil together in peaceful\r\n          concernt, constructing a crude wooden launch-gantry around\r\n          ZARKOV'S SPACE CAPSULE, which has been conveyed here.\r\n           66.\r\n                         \r\n          Several hovering HAWKMEN hold it in position with vine cables\r\n          as the work is completed. Capsule door is open. Through it\r\n          we see ZARKOV at work inside, feverishly re-wiring a control\r\n          panel.\r\n                         \r\n          EXT. LODGE BALCONY\r\n          (BARIN, FLASH, VULTAN, ZARKOV'S VOICE)\r\n                         \r\n          Up on Lodge Balcony, FLASH, BARIN and VULTAN lean over a\r\n          table on which maps and drawings are laid out, a typical\r\n          military staff meeting. With a bit of charcoal, BARIN sketches\r\n          a semi-circular line over a map of MING'S city.\r\n                         \r\n                          BARIN\r\n           A force-field covers the whole city,\r\n           from here to here. With luck, Flash\r\n           can lure them into lowering their\r\n           defenses.\r\n                         \r\n                          VULTAN\r\n           What if he fails?\r\n                          (ABRUPTLY)\r\n           This is suicide, Barin! I can't\r\n           order my men to suicide!\r\n                         \r\n          VULTAN ascends into the air. Hovers as he goes on:\r\n                         \r\n                          VULTAN (CONT'D)\r\n           The flight brought me back to my\r\n           senses -- good luck and goodbye.\r\n                         \r\n                          BARIN\r\n           Ming destroyed your kingdom!\r\n                         \r\n                          VULTAN\r\n           We'll build another.\r\n                         \r\n                          BARIN\r\n           Vultan!\r\n                         \r\n                          FLASH\r\n           Let him go -- I understand.\r\n           (up to Vultan)\r\n           Thanks anyway for getting us this\r\n           far!\r\n                         \r\n          VULTAN hesitates a moment, the soars away with determination.\r\n                         \r\n                          ZARKOV'S VOICE\r\n           Flash! Ready for a test!\r\n                         \r\n          INT. CAPSULE\r\n          (FLASH, ZARKOV)\r\n                         \r\n                         FLASH ENTERS\r\n           67.\r\n                         \r\n                          FLASH\r\n           What's the game-plan?\r\n                         \r\n                          ZARKOV\r\n           Sit there. When I give you zero,\r\n           punch that button. Any questions?\r\n                         \r\n          EXT. CAPSULE\r\n          (BARIN, FLASH'S VOICE, ZARKOV)\r\n                         \r\n          ZARKOV jumps out, leaving the door open. He crouches low.\r\n          BARIN and VULTAN and EVERYBODY are watching.\r\n                         \r\n                          ZARKOV\r\n           Five, four, three, two, one -- ZERO!\r\n                         \r\n          Interior of the capsule is filled with BLINDING BLUE LIGHT\r\n          for an instant. ZARKOV pops up, sticks his head in.\r\n                         \r\n                          ZARKOV (CONT'D)\r\n           Flash!\r\n                          (NO REPLY)\r\n           Do you hear me, Flash? Where are\r\n           you?\r\n                         \r\n                         CU ZARKOV\r\n                         \r\n          As INVISIBLE HANDS turn around the helmet on his head.\r\n                         \r\n                          ZARKOV (CONT'D)\r\n           Eureka! I did it! You can come out\r\n           now, Flash --\r\n                         \r\n                          FLASH'S VOICE\r\n           Not unless you get out of my way, I\r\n                          CAN'T --\r\n                         \r\n          BACK TO MAIN SCENE - EXT. CAPSULE\r\n                         \r\n          ZARKOV moves inside.\r\n                         \r\n                          BARIN\r\n           Look -- he still casts a shadow:\r\n                         \r\n          It's true. FLASH is totally invisible, but on the ground we\r\n          SEE his shadow as he climbs out and stands upright.\r\n                         \r\n          Suddenly there is rising WHINING HUMMING SOUND that seems to\r\n          fill the whole firmament. The earth trembles. LION MEN and\r\n          TREE MEN cower in terror. TIGER MAN roars.\r\n                         \r\n                          BARIN (CONT'D)\r\n           Zarkov! What have you done?\r\n           68.\r\n                         \r\n          The SOUND grows louder, intolerable. Brown smoking foliage\r\n          rains down. EVERYONE looks up.\r\n                         \r\n          EXT. FOREST OF ARBORIA\r\n          (KLYTUS, VOICE, ZARKOV)\r\n                         \r\n          CUTS AND ANGLES - UPWARDS\r\n                         \r\n          The topless forest of Arboria is withering, falling apart.\r\n          TREE MEN cry with primal fear as the SEE the sky revealed.\r\n                         \r\n          Hovering against the sun are the dark shapes of MING'S ROCKET\r\n          SHIPS. PULSING RAYS emanate from projectors on their bottoms.\r\n          A VOICE booms from heave:\r\n                         \r\n                          VOICE\r\n           Prisoners of Ming, you are surrounded!\r\n           The creature who moves is obliterated!\r\n                         \r\n          EVERYONE stands frozen.\r\n                         \r\n          PART OF FOREST - CUTAWAY\r\n                         \r\n          ONE LION MAN\r\n                         \r\n          Howls in terror, makes a break for cover. A RAY instantly\r\n          zaps down at him and he EXPLODES into fiery fragments.\r\n                         \r\n          BACK TO MAIN PART OF FOREST\r\n                         \r\n          A small SHUTTLE CRAFT descends vertically to a soft landing.\r\n          KLYTUS gets out. Every sound ceases. He nods at BARIN, at\r\n          ZARKOV. Looks around. Frowns. He walks directly across\r\n          FLASH'S SHADOW, to ZARKOV.\r\n                         \r\n                          KLYTUS\r\n           We'll find vultan later. Where's\r\n           Flash Gordon?\r\n                         \r\n                          ZARKOV\r\n           His Hawkman dropped him. He's dead.\r\n                         \r\n          INT. MING'S SERAGLIO\r\n          (AURA, DALE)\r\n                         \r\n                         CU DALE\r\n                         \r\n                          DALE\r\n           Nooo -- it's not true!\r\n                         \r\n                         WIDER ANGLE\r\n           69.\r\n                         \r\n                          AURA\r\n                          (GENTLY)\r\n           It is -- they saw him fall a mile\r\n           into the glaciers of Frigia.\r\n                         \r\n          DALE shuts her eyes, sobs out:\r\n                         \r\n                          DALE\r\n           Oh Flash -- no -- you can't be dead --\r\n           it doesn't make any sense --\r\n                         \r\n                          AURA\r\n           When I think of being given to Klytus,\r\n           I wish it was myself who had fallen.\r\n                         \r\n                          DALE\r\n           (blazing at her)\r\n           I don't believe you. You -- you\r\n           awful Mongo person -- you were born\r\n           without a heart:\r\n                         \r\n                          AURA\r\n           Then what is it that melts into my\r\n           eyes, Dale Arden? Feel it breaking --\r\n                         \r\n          Tear runs down AURA'S cheeks. She seizes DALE'S hand, presses\r\n          it against her wonderful breast. DALE is really moved.\r\n                         \r\n                          DALE\r\n           You poor kid -- don't you have a MOM\r\n           to talk to?\r\n                         \r\n                          AURA\r\n           Ming tired of her. He blew my Mother\r\n           into outer space. I look into the\r\n           night sky sometimes and wonder what\r\n           star she's orbiting --\r\n                         \r\n                          DALE\r\n           God, Aura -- no wonder you've had\r\n           problems -- that bastard:\r\n                         \r\n          DALE embraces AURA. They cling to each other, bosom against\r\n          bosom, in perfect womanly understanding. Golden CHORDS are\r\n          heard. Doors open. AMAZONS enter.\r\n                         \r\n          EXT. ARBORIA - ZARKOV'S CAPSULE\r\n                         \r\n          Capsule sits in its launch-gantry, amidst the ruined blight\r\n          left by the ray attack. There is not a soul in sight. Then\r\n          Flash's SHADOW moves quickly over the ground toward the\r\n          Capsule and VANISHES into the hatch. The door shuts itself.\r\n           70.\r\n                         \r\n          INT. CAPSULE\r\n                         \r\n          Control levers move. A red button depresses itself. Through\r\n          the side, which we should remember is transparent from within,\r\n          we SEE the scene outside going into a GREEN-BROWN BLUR as\r\n          the capsule starts to spin for takeoff.\r\n                         \r\n          INT. MING'S BEDCHAMBER\r\n          (KLYTUS, MING)\r\n                         \r\n          MING is being robed by TWO GIRL ATTENDANTS. Suddenly KLYTUS\r\n          is there in a shadow, smiling. MING senses him, turns.\r\n                         \r\n                          MING\r\n           Well? What is it this time?\r\n                         \r\n                          KLYTUS\r\n           I can't remember. I feel danger --\r\n           but I cannot see it.\r\n                         \r\n                          MING\r\n           Klytus, you're impossible. Aura\r\n           deserves you.\r\n                         \r\n                          KLYTUS\r\n           I foresee another thing. In one minute\r\n           exactly, the Earthling space capsule\r\n           will be seen on the scanner.\r\n                         \r\n          KLYTUS is swallowed again in shadow.\r\n                         \r\n          EXT. ZARKOV'S CAPSULE - IN FLIGHT\r\n                         \r\n          Sailing over the ever frozen Moon of FRIGIA\r\n                         \r\n          INT. MING'S DOME\r\n          (CAPTIN, MING)\r\n                         \r\n          Capsule is SEEN on the viewing screen, grid-lines dancing\r\n          over the image as FRIGORIA is left behind. Watching are MING,\r\n          KLYTUS, the CAPTAIN and several other SOLDIERS.\r\n                         \r\n                          CAPTIN\r\n           Shall I disintegrate it, Your Majesty?\r\n                         \r\n                          MING\r\n           No, Captain -- bring it in. Land it\r\n           to a warm reception.\r\n                         \r\n          INT. ZARKOV'S CAPSULE - IN FLIGHT\r\n                         (FLASH'S VOICE)\r\n                         \r\n          Through the front we see MING'S CITY dead ahead and below.\r\n          Numbers flash on the navigation display, constantly changing.\r\n           71.\r\n                         \r\n          INVISIBLE HAND picks up a microphone, holds it before\r\n          INVISIBLE LIPS.\r\n                         \r\n                          FLASH'S VOICE\r\n           Vultan! Do you read me?\r\n                         \r\n          EXT. ARBORIA - IN A BROWN BLASTED TREE\r\n          (FLASH'S VOICE, VULTAN)\r\n                         \r\n          VULTAN and some other HAWKMEN perch, listening to VOICE coming\r\n          from a radio in VULTAN'S belt.\r\n                         \r\n                          FLASH'S VOICE\r\n           Flash Gordon calling Vultan! Over!\r\n                         \r\n          VULTAN doesn't stir a feather. After a moment:\r\n                         \r\n           FLASH'S VOICE (CONT'D)\r\n           Okay, don't answer -- I'm on Hawkman\r\n           frequency I know you are reading me.\r\n           Now get this --\r\n                         \r\n          CAPSULE AND TREE IN ARBORIA\r\n                         \r\n                         INTERCUTS\r\n                         \r\n           FLASH'S VOICE (CONT'D)\r\n           I'm being guided through the force-\r\n           field under their control. You're on\r\n           the beam when you've got the tops of\r\n           two towers lined up exactly -- the\r\n           high gold one behind the green one\r\n           with the blue flag got that?\r\n                          (SILENCE)\r\n           Okay, Vultan, it's your decision the\r\n           ball is in your court -- I hope I'll\r\n           be seeing you, you crazy ole bird.\r\n                         \r\n          The microphone hangs itself up on the panel.\r\n                         \r\n          VULTAN AND HIS HAWKMEN\r\n                         \r\n          Just sit there, grim-faced. VULTAN shake his head.\r\n                         \r\n                          VULTAN\r\n           He calls us crazy --\r\n                         \r\n          EXT. PALACE BATTLEMENTS\r\n          (GUARD CAPTAIN, KLYTUS)\r\n                         \r\n          It's an armed camp. SOLDIERS stand admits tanks and ray-gun\r\n          artillery, every weapon trained on a landing pad in the\r\n          middle.\r\n           72.\r\n                         \r\n          KLYTUS waits with his CAPTAIN watching the mirror-bright\r\n          capsule coming down.\r\n                         \r\n          It lands. CAPTAIN gives a signal.\r\n                         \r\n          ZAP! From a tank's ray gun.\r\n                         \r\n          The capsule's door is knocked with surgical precision off\r\n          its hinges. Flanked by SOLDIERS with ray-guns at the ready,\r\n          the CAPTAIN advances and looks in. He turns and calls back\r\n          to KLYTUS in surprise.\r\n                         \r\n                          GUARD CAPTAIN\r\n           It's empty!\r\n                         \r\n                          KLYTUS\r\n           What?\r\n                         \r\n                          GUARD CAPTAIN\r\n           Unmanned. Must've taken off on some\r\n           automatic program.\r\n                         \r\n          KLYTUS frowns. He doesn't notice the SHADOW that suddenly\r\n          passes over him, moves on quickly.\r\n                         \r\n                          KLYTUS\r\n           Destroy it.\r\n                         \r\n                         FLASH'S SHADOW\r\n                         \r\n          Halts, shift shape as FLASH stops in dismay at that, turns.\r\n                         \r\n          A RAY GUN - ON A TANK ZAPS out a ray.\r\n                         \r\n          ZARKOV'S CAPSULE - glows white, falls into thin ashes.\r\n                         \r\n                         FLASH INVISIBLE\r\n                         \r\n          Lets out a bitter sigh. Then the SHADOW moves again, fast,\r\n          to an open doorway.\r\n                         \r\n          INT. PALACE HALLWAY - A SOLDIER\r\n          (FLASH' S VOICE, SOLDIER)\r\n                         \r\n          Stands on guard. Suddenly out of nowhere, but very close.\r\n                         \r\n           FLASH' S VOICE\r\n           Which way to the dungeons, Soldier:\r\n                         \r\n                          SOLDIER\r\n           Third elevator down, turn left!\r\n           (then doing a take)\r\n           Who is that?\r\n           73.\r\n                         \r\n          WHAM! A left to the gut doubles him over to take an invisible\r\n          knockout right on the chin.\r\n                         \r\n          INT. UNDER THE PALACE\r\n                         (FLASH'S VOICE)\r\n                         \r\n          TWO SOLDIERS stand with ray-guns before a heavy locked door.\r\n          Suddenly INVISIBLE FLASH steps behind a flaring torch, casting\r\n          an enormous SHADOW on the wall. He manipulates his caped\r\n          arms so that the image becomes truly fearsome.\r\n                         \r\n                          FLASH'S VOICE\r\n           I am the ghost of all the good men\r\n           murdered by Ming! Prepare for doom!\r\n                         \r\n          The SOLDIERS faint.\r\n                         \r\n          INT. NARROW PASSAGEWAY - UNDER THE PALACE\r\n                         \r\n          FOUR SOLDIERS march along, two by two, filling the narrow\r\n          way. SOUND OF RUNNING FEET coming towards them. They halt\r\n          i n consternation. WHAM! Invisible FLASH crashes into them,\r\n          sending them flying like bowling-pins.\r\n                         \r\n          INT. DUNGEON AREA\r\n                         (GUARD)\r\n                         \r\n          FOUR GUARDS lounge. around. MOVE to one of them, who sits\r\n          studying the pictures in the Mingo version of PLAYBOY\r\n          magazine. A SHADOW falls over the page.\r\n                         \r\n                          GUARD\r\n           I'm looking at it now -- wait for\r\n           your turn.\r\n                         \r\n          An INVISIBLE UPPERCUT knocks him off his chair.\r\n                         \r\n          ANGLES - THE FIGHT\r\n                         \r\n          As INVISIBLE FLASH goes after the other three with a deadly\r\n          chair that seems to SWING itself through the air.\r\n                         \r\n          INT. DUNGEON\r\n                         (FLASH'S VOICE)\r\n                         \r\n          ZARKOV, BARIN and TIGER MAN lie in chains, heads cocked at\r\n          SOUNDS of the facas outside. THUD of a body falling, brief\r\n          silence, then sound of a KEY IN THE LOCK.\r\n                         \r\n          The door opens itself.\r\n                         \r\n                          FLASH'S VOICE\r\n           It's me!\r\n           74.\r\n                         \r\n          INT. NARROW VERTICAL SHAFT\r\n          (BARIN, FLASH'S VOICE, ZARKOV)\r\n                         \r\n          The Same one AURA and FLASH fell down originally. Now BARIN,\r\n          ZARKOV, TIGER MAN and FLASH are inching their way UP it like\r\n          mountain climbers doing a rock chimney; in. back-to-back\r\n          pairs, feet pressed out against the shaft walls. What makes\r\n          it look even stranger, half of the FLASH-BARIN twosome is\r\n          INVISIBLE. Low conversation as they pant and struggle up the\r\n                         SHAFT:\r\n                         \r\n                          ZARKOV\r\n           How do we get down to the plasma\r\n           level?\r\n                         \r\n                          FLASH'S VOICE\r\n           Anti-gravity shaft -- I got a guard\r\n           to show me --\r\n                         \r\n                          BARIN\r\n           This won't be easy, Flash --\r\n                         \r\n                          FLASH'S VOICE\r\n           Nothing's easy on Mongo --\r\n                         \r\n          INT. PLASMA CAVERN\r\n          (CONTROLLER, GUARD CAPTAIN)\r\n                         \r\n          LIZARD MEN SLAVES work like mad, shoveling radioactive fuel\r\n          into the seething mass.\r\n                         \r\n          ON THE MEZZANINE\r\n                         \r\n          CONTROLLERS are at consoles. Many GUARDS stand around.\r\n          Everyone watches a big hanging dial. Its needle quivers with\r\n          each flare-up from the inferno below, inches toward a RED\r\n          SECTOR.\r\n                         \r\n                          GUARD CAPTAIN\r\n           Faster! -- More fueld!\r\n                         \r\n                          CONTROLLER\r\n           What's the hurry?\r\n                         \r\n          CONTROLLER What's the hurry?\r\n                         \r\n                          GUARD CAPTAIN\r\n           He wants to give Dale Arden the final\r\n           destruction of Earth as a wedding\r\n           present.\r\n                         \r\n          CONTROLLERS twist the shock-knobs.\r\n                         \r\n          Tortured SLAVES howl in agony. Some drop and are thrown into\r\n          the fiery mass, others redouble their efforts.\r\n           75.\r\n                         \r\n          ON THE MEZZANINE\r\n                         \r\n          The needle quivers upwards. MOVE OFF it to a slot-like window\r\n          in back wall. There are EYES behind the glass.\r\n                         \r\n          INT. CRAWLSPACE BEHIND THE MEZZANINE\r\n          (BARIN, FLASH'S VOICE, TIGER MAN, ZARKOV)\r\n                         \r\n          ZARKOV,BARIN and TIGER MAN crouch amidst WHIRRING ventilators,\r\n          watching through the window.\r\n                         \r\n                          BARIN\r\n           How's it look to yoU?\r\n                         \r\n                          ZARKOV\r\n           Bad. Plasma's contracting into a\r\n           critical mass. When that needle hits\r\n           the red, Earth is finished.\r\n                         \r\n                          TIGER MAN\r\n           Grrao! I'll charge down at them:\r\n                         \r\n          ZARKOV and BARIN just look at him. TIGER MAN slumps out of\r\n          his fighting stance.\r\n                         \r\n          Low door at the back opens itself and INVISIBLE FLASH comes\r\n          in.\r\n                         \r\n                          FLASH'S VOICE\r\n           Cavern is sealed tight -- every door\r\n           locked from the inside --\r\n                         \r\n                         CU ZARKOV\r\n                         \r\n          Hope drains from his expression.\r\n                         \r\n                          ZARKOV\r\n           Let's face it, my friends -- without\r\n           a miracle, we've lost.\r\n                         \r\n          EXT. SKY - WIDE ANGLE\r\n          (HAWKMAN CAPTAIN, VULTAN)\r\n                         \r\n          It is filled with HAWKMEN, flying toward us.\r\n                         \r\n          VULTAN and HIS CAPTAIN. fly in the lead, looking ahead and\r\n          down at the City of Mingo.\r\n                         \r\n                          HAWKMAN CAPTAIN\r\n           All right -- I see the towers lined\r\n           up now as Flash Gordon said --\r\n                         \r\n          VULTAN soars up and hovers, shouts to the ranks behind:\r\n           76.\r\n                         \r\n                          VULTAN\r\n           Through the force-field, my Hawkmen!\r\n           The pass is narrow -- dive three-by-\r\n           three! Any man who wishes to turn\r\n           back may do so!\r\n                         \r\n                         THE HAWKMEN\r\n                         \r\n          Keep flying right on, not one bird of them turning back.\r\n                         \r\n                         FEATURE VULTAN\r\n                         \r\n          Musing to his captain:\r\n                         \r\n                          VULTAN (CONT'D)\r\n           Who are these Earthlings, that so\r\n           many would die for?\r\n                         \r\n                          HAWKMAN CAPTAIN\r\n           They must have one hell of a little\r\n                          PLANET --\r\n                         \r\n          INT. MING'S DOME - ON VIEWING SCREEN\r\n                         (OFFICER)\r\n                         \r\n          THREE HAWKMEN are SEEN in steep descent. comes ,INTO FOCUS\r\n          over them.\r\n                         \r\n          PULL BACK. Several OFFICERS and SOLDIERS are around a console,\r\n          watching the screen and other displays.\r\n                         \r\n                          OFFICER\r\n           In range.\r\n                         \r\n          Another OFFICER touches a red firing-button.\r\n                         \r\n          EXT. PALACE BATTLEMENTS\r\n                         \r\n          Ranged here are devices like multiple rocket-launchers,\r\n          bristling with hundreds of arrows. SWOOSH: One fires its\r\n          load into the sky.\r\n                         \r\n          EXT. SKY - HAWKMEN\r\n          (HAWKMAN CAPTAIN, VULTAN)\r\n                         \r\n          The THREE LEADING HAWKMEN are impaled a dozen times each\r\n          crumple and plummet down.\r\n                         \r\n          VULTAN and CAPTAIN - HOVERING\r\n                         \r\n                          HAWKMAN CAPTAIN\r\n           It's a trap! The passage is covered!\r\n           77.\r\n                         \r\n                          VULTAN\r\n           Onward, Hawkmen! Dive! We outnumber\r\n           their arrows -- overwhelm them!\r\n                         \r\n          EXT. BATTLEMENTS/SKY\r\n                         \r\n          INTERCUTS - HAWKMEN and ARROW PROJECTORS\r\n                         \r\n          as the brave HAWKMEN dive in a converging stream at the\r\n          invisible opening, and the projectors FIRE again and again.\r\n          Great slaughter is wreaked on the HAWKMEN, but they keep\r\n          coming.\r\n                         \r\n          One group VEERS to the side away from the deadly fire, only\r\n          to crash into the equally deadly force-field. They EXPLODE\r\n          into flames.\r\n                         \r\n          INT. DOME\r\n                         \r\n          FIRING OFFICER is almost breaking his thumb, he has it jammed\r\n          down so hard on the red button.\r\n                         \r\n          ANGLE to the VIEWING SCREEN. On it VULTAN leads a stream of\r\n          descending HAWKMEN.\r\n                         \r\n          EXT. SKY - HAWKMEN\r\n                         \r\n          Circle and reform, some giving mid-air aid to wounded mates,\r\n          and on they come, onward!\r\n                         \r\n          INT. DOME\r\n                         (OFFICER)\r\n                         \r\n                          OFFICER\r\n           Man the battlements!\r\n                         \r\n          EXT. PALACE BATTLEMENTS\r\n                         \r\n          HAWKMEN descend as SOLDIERS rush out at them. The battle is\r\n          epic, a crazy combination of swords and ray-guns and clubs\r\n          and spears.\r\n                         \r\n          VULTAN is a towering figure in the middle of it, dealing\r\n          havoc on all sides.\r\n                         \r\n          As he fights THREE SOLDIERS, ANOTHER races at VULTAN'S back\r\n          with a deadly spear. Suddenly he TRIPS OVER NOTHING and\r\n          crashes headlong to be dispatched by another HAWKMAN. VULTAN\r\n          whirls and is amazed to have his freehand warmly clasped by\r\n          an INVISIBLE ONE.\r\n           78.\r\n                         \r\n          INT. A PALACE ANTECHAMBER\r\n          (KLYTUS, MING, OFFICER)\r\n                         \r\n          MING and KLYTUS, in ceremonial robes. As part of his costume\r\n          MING wears a sword.\r\n                         \r\n                          MING\r\n           You have the ring?\r\n                         \r\n                          KLYTUS\r\n           In my pocket.\r\n                         \r\n          Door flies open, an OFFICER dashes in.\r\n                         \r\n                          OFFICER\r\n           Your Majesty, we're under attack by\r\n           Hawkmen!\r\n                         \r\n                          MING\r\n           So what are you doing down here,\r\n           coward? Why aren't you in the fray?\r\n                         \r\n                          OFFICER\r\n           Sire, I thought you'd --\r\n                         \r\n                          MING\r\n           Mingo City is impregnable! I'm not\r\n           about to put off wedding Dale Arden\r\n           for this!\r\n                         \r\n          EXT. BATTLEMENTS\r\n          (FLASH'S VOICE, HAWKMAN CAPTAIN, VULTAN)\r\n                         \r\n          The battle continues. Bloodies HAWKMAN CAPTAIN fights his\r\n          way up beside VULTAN, who is engaged in seizing a dominant\r\n          piece of ray-gun artillery.\r\n                         \r\n                          HAWKMAN CAPTAIN\r\n           What's for us after this lot?\r\n                         \r\n                          VULTAN\r\n           Ming!\r\n                         \r\n                          FLASH'S VOICE\r\n           The cavern first! Gotta get Zarkov\r\n           in there to --\r\n                         \r\n          Suddenly MUSIC is heard from below. Some great electronic\r\n          organ booms out the strains of what is recognizably \"Here\r\n          Come The Bride\".... the familiar thrilling wedding-march.\r\n                         \r\n           FLASH'S VOICE (CONT'D)\r\n           On my god!\r\n           79.\r\n                         \r\n          INT. MING'S GREAT HALL - HIGH WIDE ANGLE\r\n                         \r\n          A magnificent wedding is on. DALE marches slowly up the\r\n          middle, on KLYTUS'S arm, helped along by AMAZONS who march\r\n          at her back with spears. Her long train passes between the\r\n          AMAZONS to be borne behind by LOVELY GIRLS, as the party\r\n          passes between ranks of splendidly garbed MONGONS.\r\n                         \r\n          An aged HIGH PRIEST waits at the throne-altar with MING,\r\n          whose eyes lecherously devour his approaching bride.\r\n                         \r\n          CLOSE ON DALE\r\n                         \r\n          Her beauty only enhanced by the teas rolling soundlessly\r\n          down her cheeks.\r\n                         \r\n          INT. PLASMA CAVERN\r\n                         \r\n          The molten mass is more intense than we have ever seen it,\r\n          scarcely bearable to the eye.\r\n                         \r\n          INT. CRAWLSPACE BEHIND THE MEZZANINE\r\n          (TIGER MAN, ZARKOV)\r\n                         \r\n          Even in here there is a terrible glare from the slot-window,\r\n          ZARKOV turns his face away suddenly, infinitely sad.\r\n                         \r\n                          ZARKOV\r\n           I can't watch any more. To think of\r\n           all our history ended this way --\r\n           the incredible ascent from primordial\r\n           slime to Albert Einstein and Dale\r\n           Arden and --\r\n                         \r\n                          TIGER MAN\r\n                          (AT WINDOW)\r\n           Look!\r\n                         \r\n          INT. CAVERN - POV SHOT\r\n                         \r\n          VULTAN and THREE HAWKMEN are swooping down from some gallery\r\n          above. VULTAN and TWO pounce on CONTROLLERS, while the THIRD\r\n          HAWKMAN flies down to open a door on the lower level.\r\n                         \r\n          INT. CRAWLSPACE\r\n                         \r\n          ZARKOV and BARIN and TIGER MAN\r\n                         \r\n          Scramble for the low exit behind them.\r\n           80.\r\n                         \r\n          INT. MING'S GREAT HALL\r\n          (DALE, FLASH'S VOICE, HIGH PRIEST, MING)\r\n                         \r\n          Earth turns slowly in mid-air, its seas and continents veiled\r\n          by clouds of hideous smoke which seethe with flashes of\r\n          interior red lightning.\r\n                         \r\n          Then FACES come INTO FOCUS below and behind it, and we realise\r\n          we are in MING' S GREAT HALL, where EARTH is a holographic\r\n          image in a transparent box above the altar-throne.\r\n                         \r\n                         FEATURE DALE\r\n                         \r\n          Standing beside MING at the altar with KLYTUS, looking up\r\n          despairingly at her beloved planet while the HIGH PRIEST\r\n                         INTONES:\r\n                         \r\n                          HIGH PRIEST\r\n           Do you take her, this Earthling,\r\n           Dale Arden, to be your Empress of\r\n           the hour? Do you solemnly promise\r\n           to use her as you will -- not discard\r\n           her until such time as you grow weary\r\n           of her?\r\n                         \r\n                          MING\r\n           I do.\r\n                         \r\n                          HIGH PRIEST\r\n           The wedding ring, please --\r\n                         \r\n          KLYTUS produces a golden ring, hands it to MING.\r\n                         \r\n          MING takes DALE'S left hand, forces it up into position,\r\n          holds the ring poised to slip it on. MING'S face has never\r\n          been more merciless.\r\n                         \r\n           HIGH PRIEST (CONT'D)\r\n           Recite after me -- with this ring I\r\n           thee wed --\r\n                         \r\n                          FLASH'S VOICE\r\n           With this ring, I thee wed!\r\n                         \r\n          An INVISIBLE HAND snatches the ring from MING'S grip like\r\n          lightning and james it onto DALE'S finger.\r\n                         \r\n                          DALE\r\n           Flash!!!\r\n                         \r\n                          FLASH'S VOICE\r\n           Run!!!\r\n                         \r\n                         HIGH ANGLE\r\n           81.\r\n                         \r\n          Pandemonium. DALE runs like hell, but is tripped by her train\r\n          and goes down as MING leaps up onto his throne platform.\r\n                         \r\n                          MING\r\n           Seal this hall! Close every portal!\r\n                         \r\n          ANGLE - A PORTAL\r\n                         \r\n          Swinging shut, BARIN squeezing in through it at the last\r\n          instant, sword in hand. KLYTUS rushes at him with a sword of\r\n          his own.\r\n                         \r\n                         MING\r\n                         \r\n          Looks around wildly, whipping out the sword sheathed at his\r\n          belt. Its blade is like crystal fire. He reacts sharply,\r\n          catches his breath.\r\n                         \r\n          WHAT MING SEES - ANOTHER SWORD\r\n          (FLASH'S VOICE, MING)\r\n                         \r\n          exactly like his, a blade of fire, apparently hanging in the\r\n          air and pointed right at him.\r\n                         \r\n                          MING\r\n           Where did you get that sword?\r\n                         \r\n                          FLASH'S VOICE\r\n           From the crystal block.\r\n                         \r\n                          MING\r\n           Impossible! It could only be pulled\r\n           by my rightful heir!\r\n                         \r\n                          FLASH'S VOICE\r\n           How about that?\r\n                         \r\n          The sword slowly advances.\r\n                         \r\n                         FEATURE MING\r\n                         \r\n          His face contorted, he flies at INVISIBLE FLASH behind the\r\n          sword. FLASH parries the blow. Astonishing pyrotechnics as\r\n          the blades hit each other. Shrieking MONGONS flee under\r\n          showers of fire.\r\n                         \r\n          INT. PLASMA CAVERN\r\n                         (ZARKOV)\r\n                         \r\n          HAWKMEN and LIZARD MEN SLAVES engage MING'S PEOPLE.\r\n                         \r\n          Aided by VULTAN and TIGER MAN, ZARKOV battles his way up to\r\n          the Mezzanine Control area. He shouts down wildly:\r\n           82.\r\n                         \r\n                          ZARKOV\r\n           Attach the electrodes to the shovels!\r\n           Pitch them into the plasma!\r\n                         \r\n          INT. GREAT HALL\r\n          (BARIN, DALE, KLYTUS)\r\n                         \r\n          MING and FLASH\r\n                         \r\n          Duel dazzlingly around the enormous throne. Suddenly FLASH\r\n          starts to lose his invisibility. A pair of eyes appears,\r\n          the tip of a nose, parts of limbs.\r\n                         \r\n                         CU DALE\r\n                         \r\n          Pinned by AMAZONS, reacting to that.\r\n                         \r\n                          DALE\r\n           Flash -- look out -- you're coming\r\n           back! He can see you now, Flash!\r\n                         \r\n          FLASH and MING\r\n                         \r\n          FLASH pauses to look at himself, almost gets his head lopped\r\n          off by a fiery slash from MING, recovers to bound up higher\r\n          on the vast throne statue wheron they battle.\r\n                         \r\n          PULL UP. In the f.g. the image of EARTH slowly turns and\r\n          glows redder with the lightning inside the clouds.\r\n                         \r\n          BARIN and KLYTUS\r\n                         \r\n          Duel in another area of e Hall. A thrust by BARIN catches\r\n          KLYTUS on the forehead. KLYTUS springs back, blood gushing\r\n          down over his eyes.\r\n                         \r\n                          KLYTUS\r\n           I foresaw at blow --\r\n                         \r\n                          BARIN\r\n           You're blinded, Klytus -- drop your\r\n           sword!\r\n                         \r\n          KLYTUS laughs, reaches up and throws off his helmet, WHIRLS\r\n          in a lightning way to reveal\r\n                         \r\n                         ANOTHER FACE\r\n                         \r\n          Shadowed, hideous, marked with all the evil in the universe.\r\n          It's mouth emits a raging SCREAM.\r\n                         \r\n                         BARIN\r\n                         \r\n          Lunges with horror, slashes with his sword point.\r\n           83.\r\n                         \r\n                         KLYTUS'S CHEEK\r\n                         \r\n          Is slashed but grotesquely does not bleed.\r\n                         \r\n          BARIN and KLYTUS\r\n                         \r\n          Fly at each other again, trade blows, then each catches a\r\n          wrist of the other with his free hand. KLYTUS laughs\r\n          horribly.\r\n                         \r\n                          KLYTUS\r\n           You fight me in vain, Barin I do not\r\n           foresee my death at your hands --\r\n                         \r\n          KLYTUS twists away, knocks BARIN'S sword out of his grasp,\r\n          drives BARIN back against the wall. KLYTUS lifts his own\r\n          sword, puts it at BARIN'S throat for the final thrust.\r\n                         \r\n                         KLYTUS'S FACE\r\n                         \r\n          Suddenly changes horribly. PULL BACK. AURA is behind him,\r\n          her hand on the hilt of BARIN'S sword, which she has driven\r\n          into KLYTUS' back. Soundless, dead, KLYTUS falls to the floor.\r\n                         \r\n          AURA and BARIN\r\n                         \r\n          Move together, embrace. BARIN touches her face. Gently, AURA\r\n          strokes BARIN'S cheek in hirst human-like, loving touch.\r\n                         \r\n          FLASH and MING\r\n                         \r\n          Have duelled their way right up onto the shoulder of the\r\n          great statue now, fight against a vast replica of MING'S\r\n          EAR.\r\n                         \r\n          INT. PLASMA CAVERN\r\n                         (ZARKOV)\r\n                         \r\n          Needle trembles on the verge of red.\r\n                         \r\n          ANGLE DOWN to ZARKOV at console, protected against the final\r\n          GUARDS' onslaught by VULTAN and TIGER MAN as he works\r\n          feverishly with a screwdriver on a wiring panel pulled out\r\n          from the innards He straightens up, takes a deep breath.\r\n                         \r\n                          ZARKOV\r\n           Cross your fingers, boys!\r\n                         \r\n          ZARKOV hits a switch.\r\n                         \r\n          INT. GREAT HALL\r\n          (ALL THE MONGONS, DALE, DALE'S VOICE)\r\n                         \r\n                         CU DALE\r\n           84.\r\n                         \r\n          Reacting to something, pointing upward:\r\n                         \r\n                          DALE\r\n           Look -- Earth!\r\n                         \r\n          EARTH - THE IMAGE IN THE AIR\r\n                         \r\n                          DALE'S VOICE\r\n           Oh it's so beautiful!\r\n                         \r\n                         FEATURE MING\r\n                         \r\n          As he swivels his head for a quick look. He freezes, gives\r\n          a CRY of unmitigated rage. FLASH seizes the instant, thrust\r\n          his sword.\r\n                         \r\n          The blade goes into MING up to the hilt. FLASH pulls it\r\n          out.\r\n                         \r\n          There isn't a drop of blood. MING just stands there , smoking,\r\n          in spectacular fashion into the atoms of which he was\r\n          constituted. MING is just GONE.\r\n                         \r\n          HIGH SHOT - THE GREAT HALL\r\n                         \r\n          EVERYONE looks upwards at FLASH, standing with his sword\r\n          atop the statue. There is a clatter as AMAZONS cast away\r\n          their spears. A cry goes up as if from one throat!\r\n                         \r\n           ALL THE MONGONS\r\n           Hail, Flash Gordon!\r\n                         \r\n          EXT. SKY OVER MINGO\r\n                         \r\n          Vista of stunning beauty as HAWKMEN soar and loop in wondrous\r\n          victory rolls, leaving behind RAINBOW CONTRAILS.\r\n                         \r\n          EXT. PALACE BATTLEMENTS\r\n          (DALE, FLASH, ZARKOV)\r\n                         \r\n          It is a scene of peace now. HAWKMEN and SOLDIERS join in\r\n          tending their wounded. Formerly fierce AMAZONS act as gentle\r\n          nurses. MOVE OVER this to find FLASH, DALE and ZARKOV standing\r\n          together, looking up at the terrific sky-shadow, FLASH with\r\n          an arm around DALE'S shoulder. He glances at her tenderly,\r\n          is surprised to see tears on her cheeks.\r\n                         \r\n                          FLASH\r\n           What's the matter, darling?\r\n                         \r\n                          DALE\r\n           We saved Earth but we lost the capsule --\r\n           we'll never get home again.\r\n           85.\r\n                         \r\n                          ZARKOV (SIMPLY)\r\n           You are home.\r\n                         \r\n                          FLASH\r\n           Zarkov is right.\r\n                         \r\n                          ZARKOV\r\n           Shouldn't you fellows be leaving on\r\n           your honeymoon?\r\n                         \r\n          DALE laughs, turns her face up to FLASH. He kisses her. As\r\n          they head into the Palace, ZARKOV gazes upward again.\r\n                         \r\n          EXT. SKY\r\n                         \r\n          HAWKMEN swoop and soar, weaving RAINBOWS, as END CREDITS\r\n          ROLL.\r\n                         \r\n                         THE END\r\n                         \r\n                         EDITOR'S NOTE:\r\n\r\n          What you have just read is a reproduction of the \"1st Draft\"\r\n          for the feature film \"Flash Gordon\". The original source\r\n          material came from a badly deteriorated copy of the original\r\n          script and in some instances dialogue which could not be\r\n          read was guessed upon by best case understanding.\r\n                         \r\n          We have made every attempt to include the integrity of the\r\n          original script, \"as-is\", to include all original\r\n          descriptions, grammar and spelling. Errors as well.\r\n                         \r\n          We hope you've enjoyed this original look at \"FLASH GORDON\"!\r\n                          \r\n\r\n\n\n\n\nFlash Gordon\nWriters :   Lorenzo Semple Jr.\nGenres :   Action  Adventure  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Emperor Ming the Merciless declares that he will first play with and then destroy the Earth using natural disasters. On Earth, New York Jets football star \"Flash\" Gordon boards a small plane, where he meets travel journalist Dale Arden. Mid-flight, the cockpit is hit by a meteorite and the pilots are lost. Flash takes control and manages to crash land into a greenhouse owned by Dr. Hans Zarkov. Zarkov, who believes the disasters are being caused because an unknown source is pushing the Moon towards Earth, has secretly constructed a spacecraft which he plans to use to investigate. Zarkov's assistant refuses to go, so he lures Flash and Dale aboard. The rocket launches, taking them to the planet Mongo, where they are captured by Ming's troops.\nThe three are brought before Ming. He orders Dale be prepared for his pleasure. Flash tries to resist, but is overpowered. Ming orders Zarkov be reprogrammed and Flash executed. Ming's daughter, Princess Aura, seduces Ming's surgeon into saving Flash, to whom she is attracted. As they escape, Flash sees Zarkov being brainwashed by Klytus, the metal-faced head of the secret police. Aura and Flash flee to Arboria, kingdom of Prince Barin, Aura's lover. En route, Aura teaches Flash to use a telepathic communicator to contact Dale. He lets her know he is alive. Dale is locked in Ming's bedchamber, but encouraged by Flash, she escapes. Klytus sends Zarkov to intercept Dale, who tells him and Klytus that Flash is alive. They then escape, as Zarkov reveals he resisted the brainwashing. They are captured by Prince Vultan's Hawkmen and taken to Sky City.\nAura and Flash arrive at Arboria. Aura asks the Prince to keep Flash safe. A distrustful Barin, in love with Aura, agrees not to kill Flash, but then forces him to perform a deadly ritual. Barin and Flash take turns sticking their hands into a hollow stump with a giant scorpion-like Wood Beast inside. When Flash has to take an extra turn, he pretends to be stung as a distraction and escapes. Barin follows, but they are both captured by the Hawkmen.\nKlytus informs Ming that Flash is alive and is given authority to find out who is responsible. Aura returns and is taken prisoner and tortured by Klytus and General Kala. They force her to confess and Ming banishes her to the ice moon Frigia after his wedding. Meanwhile, Flash and Barin are taken to Sky City, where Flash and Dale are briefly reunited. Flash is forced to fight Barin to the death, but Barin joins him when Flash saves his life. Klytus arrives and Flash and Barin kill him. Knowing that this will bring retribution, Vultan orders the Hawkmen to evacuate, leaving Barin, Flash, Dale and Zarkov behind. Ming's ship arrives and he orders Barin, Zarkov and Dale to be taken aboard. Ming is impressed with Flash, and offers him lordship over Earth in exchange for loyalty, which Flash refuses. Ming gives the order to destroy Vultan's kingdom along with Flash. Flash finds a rocket cycle and escapes before Sky City is destroyed.\nFlash contacts Vultan, who is hiding on Arboria and they plot an attack on Mingo City. Flash pretends to attack Mingo City alone on his rocket cycle. General Kala dispatches the war rocket Ajax to kill Flash, but the Hawkmen ambush and seize the rocket. Meanwhile, Princess Aura overpowers her guard and frees Barin and Zarkov from the execution chamber. Flash and the Hawkmen attack Mingo City in Ajax and Kala activates the defenses, as Ming and Dale's wedding begins. Mingo City's lightning field can only be penetrated by flying Ajax into it at a suicidal speed. Flash volunteers to stay at the helm to ensure success and allow the Hawkmen to invade the city.\nBarin and Zarkov enter the control room to stop the lightning field, encountering Kala who refuses to deactivate it. She attempts to kill Zarkov, but Barin shoots and kills her. Without Kala they are unable to deactivate the field from that control room. Barin tells Zarkov to hold the fort while he heads to Sector Alpha. Zarkov keeps trying, but is unable to deactivate the shield.\nBarin fights through Ming's guards and gets to Sector Alpha and deactivates the lightning field before Ajax hits it. Flash flies the rocket ship into the city's wedding hall and the ship's bow impales Ming. He falls off the rocket nose, seriously wounded and Flash offers to spare his life if he will stop the attack on Earth, but Ming refuses. Ming attempts to use his power ring on Flash, but his power falters and nothing happens. He then aims the ring at himself and is seemingly vaporized by its remaining power seconds before the counter to the destruction of the Earth reaches zero. A huge victory celebration ensues.\nBarin and Aura become the new leaders in Ming's place. Barin names Vultan the leader of their armies. Flash, Dale, and Zarkov discuss returning to Earth. Zarkov says he doesn't know how they will get back, but they will try. Barin tells them all they're welcome to stay, but Dale says she's a New York City girl, and it's now too quiet around Mongo.\nThe final frame shows Ming's ring being picked up by the hand of an unseen person. Ming's laugh echoes as the credits roll. Following the credits the text \"The End\" is shown on the screen before a question mark (?) is appended."}