{"title": "Gang Related", "full_text": "\"GANG RELATED\"\n\n\n\n                                        Written by\n\n                                         Jim Kouf\n\n\n\n                                      SHOOTING DRAFT\n\n                                           1997\n\n\n                \n\n               FADE IN:\n\n               NEON SIGN - THE PRINCE MOTEL - NIGHT\n\n               The N and the E are not working. So it reads the PR IC motel. \n               ROOMS TO RENT BY DAY, WEEK, MONTH. KITCHENETTES. The Prince \n               Motel has passed its prime. A few beat up cars are parked \n               outside rooms. We CRANE DOWN to ROOM SEVEN. Curtains closed, \n               but someone is holding it open a crack, looking out. We PUSH \n               in CLOSE TO THE WINDOW and the EYE looking over the parking \n               lot. Then the curtain closes.\n\n               INT. ROOM SEVEN - PRINCE MOTEL - NIGHT\n\n               Peeling flowered wallpaper, ultra-cheap furniture. The man \n               moving away from the window is RODRIGUEZ. He is slender, \n               sports a thin mustache, hair slicked straight back. He's in \n               his late thirties. Slightly nervous.\n\n               Another man sits on the couch, looking at a magazine. He is \n               forty, solidly built. His name is FRANK DIVINCI.\n\n                                     DIVINCI\n                         Says here they got slips in Honolulu. \n                         325 a month. Utilities included. \n                         That's not bad.\n\n               Rodriguez sits down.\n\n                                     DIVINCI\n                         But I gotta get at least a forty \n                         footer. It'll handle rough water \n                         better and I'll need the room if I'm \n                         gonna live on it.\n\n               Rodriguez stands up, moves back to the window. Divinci looks \n               up.\n\n                                     RODRIGUEZ\n                         I don't know how you do it.\n\n                                     DIVINCI\n                         What?\n\n                                     RODRIGUEZ\n                         How you can think about Hawaii now?\n\n                                     DIVINCI\n                         My heart's in Hawaii.\n\n                                     RODRIGUEZ\n                         You never been there. How can your \n                         heart be there.\n\n                                     DIVINCI\n                         You're tellin' me there's no place \n                         you'd rather be other than here?\n\n                                     RODRIGUEZ\n                         No, I'm saying I just don't know how \n                         you can think about Hawaii right \n                         now.\n\n                                     DIVINCI\n                         If I was in Hawaii right now, I \n                         wouldn't be thinking about here. See \n                         the difference?\n\n                                     RODRIGUEZ\n                         No.\n\n                                     DIVINCI\n                         Look, I'm not in Hawaii, I'm here. \n                         But I don't want to be here, I want \n                         to be in Hawaii. I can't be in Hawaii, \n                         therefore I think about it so as to \n                         not get depressed about being here.\n\n                                     RODRIGUEZ\n                         But I'm here, I know I'm here, I \n                         don't like being here, but I can't \n                         be anyplace else because I look around \n                         and I see all this shit. How do you \n                         get around that?! That's what I'm \n                         asking.\n\n                                     DIVINCI\n                         Focus.\n\n                                     RODRIGUEZ\n                         Focus.\n\n               Divinci nods. Rodriguez looks at his watch.\n\n                                     RODRIGUEZ\n                         It's time. No more Hawaii, okay? \n                         Focus on this.\n\n                                     DIVINCI\n                              (smiles)\n                         Aloha.\n\n               Rodriguez shakes his head, exasperated, and exits.\n\n                                     RODRIGUEZ\n                              (to himself)\n                         Aloha my ass.\n\n                                                                    CUT TO:\n\n               EXT. DARK STREET - NIGHT\n\n               Poor side of town. A few old cars parked on the street. Some \n               buildings vacant. A LATE MODEL WHITE CADILLAC cruises past. \n               We HEAR LOUD RAP MUSIC.\n\n               INT. CADILLAC - NIGHT\n\n               LIONEL HUDD drives. Hudd is thirty. African American. The \n               MUSIC is loud. His clothes lean to African roots. A WOMAN \n               sits next to the passenger window. Her name is CYNTHIA WEBB. \n               Cynthia is thirty-five, dressed in short provocative skirt, \n               tight top. A little too much make-up. She's lead a hard life.\n\n               She glances at Hudd. Hudd glances at her, looks down at her \n               skirt hiked up on her leg.\n\n                                     CYNTHIA\n                         Left at the corner.\n\n               Hudd's eyes linger on her thighs for a moment, then he turns \n               his attention back to driving, tapping along with the heavy \n               bass.\n\n               EXT. PRINCE MOTEL - NIGHT\n\n               The Cadillac pulls into the parking lot. Parks in front of \n               room SEVEN. Hudd gets out, looks around. Cynthia gets out, \n               leads him to SEVEN. Knocks.\n\n               The curtains pull back. Divinci looks at Hudd and Cynthia. \n               She nods to him. The door unlocks and opens.\n\n               Cynthia enters. Hudd looks around again. Then follows.\n\n               INT. MOTEL ROOM SEVEN - NIGHT\n\n               Divinci waits at the door. He and Hudd eye each other as \n               Hudd enters the room. Divinci looks out, making sure no one \n               has followed, then shuts the door.\n\n                                     DIVINCI\n                         Hope you don't mind me checkin' you \n                         for weapons.\n\n                                     HUDD\n                         Hell yes I mind.\n\n               Divinci hesitates. This could break the deal.\n\n                                     HUDD\n                         I just don't want no man handlin' \n                         me.\n\n               Hudd looks at Cynthia. The suggestion is taken.\n\n                                     DIVINCI\n                         Okay. Check him.\n\n               Hudd spreads his legs, lifts his arms. Cynthia would rather \n               not have the job, but there's no choice.\n\n                                     HUDD\n                         Lotta good hidin' places on this \n                         body. Check good.\n\n               Cynthia runs her hands over Hudd, checking pockets, pants, \n               sleeves. Finally coming to his crotch. Hudd smiles.\n\n                                     HUDD\n                         Careful. It's loaded.\n\n               Cynthia has heard it all before. She's not squeamish in the \n               least and she gives him a good going over.\n\n                                     CYNTHIA\n                         He's got nothin'.\n\n               She smiles back at Hudd. Then moves away, sits on the couch \n               and seductively crosses her legs.\n\n               Divinci, satisfied, pulls a PLASTIC BAG packed tight with \n               COCAINE out of his pocket, tosses it to Hudd.\n\n               Hudd sits on the couch, opens the bag, sticks his finger in \n               and tastes the contents. But never takes his eyes off Divinci.\n\n                                     HUDD\n                         Not bad, not bad. Any more where \n                         this came from?\n\n                                     DIVINCI\n                         Maybe.\n\n                                     HUDD\n                         Then maybe we talk again.\n\n                                     DIVINCI\n                         Maybe.\n\n               Hudd stands, unzips his pants. Reaches in to grab his cock, \n               but instead, pulls out a stack of MONEY. Inch thick.\n\n                                     HUDD\n                         Told you there was a lotta good hidin' \n                         places on this body.\n\n               Hudd hands the money to Divinci and pockets the plastic bag. \n               Then crosses to the door. Glances back at Cynthia.\n\n                                     HUDD\n                         Bet you gotta lotta nice hidin' \n                         places, too.\n\n               Then Hudd smiles and exits.\n\n               EXT. PRINCE MOTEL - NIGHT\n\n               Hudd gets into his Cadillac, pulls out of the motel parking \n               lot.\n\n               EXT. STREET - NIGHT\n\n               Deserted. No one on the street this late. Several of the \n               buildings are boarded up.\n\n               INT. CADILLAC - NIGHT\n\n               Hudd drives. No music this time. His attitude has changed. \n               More serious. LIGHTS in the REAR VIEW MIRROR. Coming up fast. \n               Hudd watches as the car pulls around to pass.\n\n               He glances at the CAR as it pulls past him, but all we SEE \n               is the FLASH OF A BLAST FROM A GUN. Front WINDOW EXPLODING.\n\n               THE CADILLAC\n\n               swerves into a parked car. The OTHER CAR -- a BUICK REGAL -- \n               screeches to a stop next to it. ONE MAN gets out. Moving \n               quickly to the Cadillac. It's dark, difficult to see. He \n               carries a SMITH AND WESSON .44. Opens the door. He's wearing \n               PLASTIC GLOVES.\n\n               Hudd is dead, slumped against the passenger door. The man \n               reaches in, turns off the engine, grabs the plastic bag of \n               cocaine. And now we see it's Divinci.\n\n               INT. BUICK REGAL - NIGHT\n\n               Rodriguez is the driver. Anxious. Engine running.\n\n                                     RODRIGUEZ\n                         Come on! Hurry up!\n\n               Divinci dashes back to the Buick, hops in. Rodriguez floors \n               it.\n\n               THE BUICK\n\n               tears off down the dark street.\n\n                                                                    CUT TO:\n\n               EXT. APARTMENT BUILDING - NIGHT\n\n               Not a great part of the city. Apartment buildings line both \n               sides of the street. An alley runs between two of the \n               buildings. A TAXI pulls up in front. HEADLIGHTS SHINING on a \n               MAN passed out in the street.\n\n               Cynthia exits the taxi. The taxi pulls away. She glances at \n               the man passed out in the street.\n\n               His clothes are ragged. He's filthy. His face covered in \n               beard and greasy dirty hair. Hard to tell how old he is. \n               Maybe forty. Maybe eighty. Who knows? His hand clutches a \n               bottle in a bag.\n\n                                     CYNTHIA\n                         Hey, Joe, wake up. Get outa the street \n                         before you get run over. Joe, wake \n                         up!\n\n               She nudges him with her foot. The man groans, rolls back. \n               Dead drunk.\n\n                                     CYNTHIA\n                         You're in the street, Joe. Get outa \n                         the street.\n\n               The man, JOE, is silent for a moment, then he starts to crawl -- \n               toward the middle of the street.\n\n                                     CYNTHIA\n                         Other way, Joe.\n\n               Joe turns his crawl toward the curb. Cynthia watches him for \n               a moment. He is truly pathetic.\n\n                                     CYNTHIA\n                         Forget it, Joe. Maybe you're better \n                         off right there. I don't think you'd \n                         even feel it.\n\n               Cynthia enters the building next to the alley.\n\n                                                                    CUT TO:\n\n               CYNTHIA - INT. APARTMENT - NIGHT\n\n               asleep. The room is dark. We HEAR a door open and close. \n               Cynthia wakes.\n\n                                     CYNTHIA\n                         Who is it?\n\n               Divinci crosses to the bed.\n\n                                     DIVINCI\n                         Got your money.\n\n                                     CYNTHIA\n                         Put it on the table.\n\n               She closes her eyes, trying to go back to sleep.\n\n                                     DIVINCI\n                         Tired?\n\n                                     CYNTHIA\n                         Yes.\n\n                                     DIVINCI\n                         I'm not.\n\n                                     CYNTHIA\n                         Take a sleeping pill. There's some \n                         in my purse.\n\n                                     DIVINCI\n                         You want your money?\n\n               Cynthia's eyes open and she looks up at Divinci. He's smiling, \n               holding up FIVE ONE HUNDRED DOLLAR BILLS.\n\n                                     CYNTHIA\n                         I already worked for that.\n\n               Divinci unzips his pants.\n\n                                     DIVINCI\n                         This is a bonus.\n\n                                     CYNTHIA\n                         For who?\n\n               Divinci smiles. Cynthia snatches the money. Divinci starts \n               to undress.\n\n                                     DIVINCI\n                         This ain't my fault. This is a failure \n                         of our educational system. If you \n                         hadn't fallen through the cracks and \n                         dropped outa school, you wouldn't be \n                         here now.\n\n                                     CYNTHIA\n                         So what's your excuse?\n\n                                     DIVINCI\n                         I'm in love.\n\n               Cynthia just stares at him for a long beat. Then she unbuckles \n               Divinci's pants.\n\n                                                                    CUT TO:\n\n               KEY - INSERTED INTO DOOR LOCK - NIGHT\n\n               A door is pushed open. Rodriguez enters his one bedroom \n               apartment. Starts to shut the door when TWO MEN appear from \n               the shadows. The first is short, well dressed. His name is \n               VIC. The second is large, heavy-set, shaved head. His name \n               is CUTLESS SUPREME. Cutless Supreme is not a man to be messed \n               with.\n\n                                     VIC\n                         Keepin' some late hours.\n\n               Rodriguez looks at Cutless Supreme.\n\n                                     RODRIGUEZ\n                         What the hell you doin'? What're my \n                         neighbors gonna think?\n\n                                     VIC\n                         I apologize. I understand your \n                         concerns. But you must understand \n                         that, unlike a bank, I cannot rely \n                         on a late fee as sufficient \n                         encouragement to repay one's debts. \n                         I am forced to employ the likes of \n                         Mr. Cutless Supreme, whom I might \n                         add, contributes significantly to my \n                         overhead. I am the real loser here. \n                         And I am concerned about your \n                         sincerity in repaying the twenty-\n                         seven thousand, nine hundred forty-\n                         two dollar gambling debt that is one \n                         week past due. What can you do to \n                         reassure me of your good intentions?\n\n                                     RODRIGUEZ\n                         I can make your life fuckin' miserable \n                         that's what I can do.\n\n                                     VIC\n                         Look at me. Do I have a wife and \n                         three kids? Do I have a good job at \n                         IBM? Am I a handsome guy? No, no and \n                         no. I loan money at excessively high \n                         interest rates to pricks like you \n                         who can't control their urges to \n                         lose big money playing cards and \n                         then I am forced to stay up all night \n                         trying to convince them that I have \n                         needs, too. The point of which is, I \n                         already have a fuckin' miserable \n                         life. So don't threaten me you lousy \n                         bag of cat shit.\n\n               Rodriguez steps toward Vic, but Cutless Supreme slides in \n               between them. Rodriguez isn't going to win this one.\n\n                                     VIC\n                         All I'm askin' is that you be \n                         responsible. Is that unreasonable?\n\n               Rodriguez backs off, hesitates as he runs over his options. \n               There aren't any. He reaches into his pocket, pulls out some \n               of his night's earnings.\n\n                                     RODRIGUEZ\n                         Four thousand is all I got.\n\n                                     VIC\n                         I am proportionally reassured. You \n                         purchased yourself an extension.\n\n               Vic takes the money, heads for the street. Rodriguez watches \n               Vic walk away. Cutless Supreme watches Rodriguez.\n\n                                     RODRIGUEZ\n                         Cutless Supreme, what kind of fuckin' \n                         idiot name is that?\n\n                                     CUTLESS SUPREME\n                         It was the car my daddy stole to \n                         take my momma to the hospital, but \n                         the cops stopped him and shot him \n                         dead in an alley before he could \n                         explain. I was born in the back seat.\n\n               Rodriguez glares at Cutless Supreme, then he shuts the door.\n\n                                                                    CUT TO:\n\n               CREDIT SEQUENCE - BLACK AND WHITE MONTAGE\n\n               CRIME SCENE PHOTOGRAPHS -- Dead drug dealers lying where \n               they were shot. Overlapping CLOSE-UPS of EVIDENCE TAGS and \n               SHELVING filled with EVIDENCE from hundreds of crime scenes. \n               And CLOSE-SHOTS of CRIME SCENES -- chalk outlines -- bullet \n               shells - bloody foot prints. And finally CRIME SCENE TAPE. \n               The BLACK AND WHITE fades back into COLOR --\n\n               YELLOW CRIME SCENE TAPE\n\n               surrounding the CADILLAC. We PULL BACK, revealing COPS \n               controlling the area. It's early morning. A FEW PEOPLE have \n               stopped to watch. But this is not a high traffic area.\n\n               ANOTHER CAR pulls up. Unmarked. Two men get out. We FOLLOW \n               BEHIND THEM as they approach the Cadillac and PATROLMAN \n               MAHONEY, who knows them.\n\n                                     PATROLMAN MAHONEY\n                         Another day, another body. Where you \n                         wanna start?\n\n                                     FIRST MAN\n                         A hit?\n\n                                     PATROLMAN MAHONEY\n                         Looks like. Could be gang related.\n\n               And now we SEE THE TWO MEN from the unmarked car. It's DIVINCI \n               and RODRIGUEZ. Suit and ties. They act like they own the \n               area. And they do.\n\n                                     PATROLMAN MAHONEY\n                         Happened sometime last night, early \n                         morning, two, three o'clock. African-\n                         American male, looks like in his \n                         thirties. But even that's a guess. \n                         Half his head is on the upholstery.\n\n                                     RODRIGUEZ\n                         Any witnesses?\n\n                                     PATROLMAN MAHONEY\n                         Oh, sure, hundreds.\n\n               INT. CADILLAC - DAY\n\n               The bloody scene is untouched. Hudd's body is where it fell, \n               on the seat. Dried blood everywhere. Divinci looks in.\n\n                                     DIVINCI\n                         Fuckin' Animals.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - DAY\n\n               EVIDENCE ROOM. Behind a locked fenced in area. A DESK OFFICER \n               checks in and out all evidence. He is twenty-eight, wears \n               glasses, very clean cut. TWO DETECTIVES are checking in \n               evidence as Divinci walks in.\n\n                                     FIRST DETECTIVE\n                         ...three shotgun shells, twelve gauge.\n\n               The Desk Officer checks in the evidence.\n\n                                     DESK OFFICER\n                         Three shotgun shells, twelve gauge.\n\n               The two detectives wave hellos to Divinci as he approaches.\n\n                                     SECOND DETECTIVE (SGT. GARDNER)\n                         Heard you got a gang related. Lucky \n                         guy, Divinci. You get all the pretty \n                         ones.\n\n                                     DIVINCI\n                         One less drug store on the street.\n\n                                     DESK OFFICER\n                         And the world is a safer place.\n\n               The Desk Officer buzzes Divinci through the door. Divinci \n               crosses to the --\n\n               EVIDENCE STORAGE ROOM\n\n               -- filled with shelves. Stacked with evidence from on-going \n               investigations. And the shelves are full of guns, knives, \n               bloody gloves, masks, shoes, etc.\n\n               Divinci looks around, then removes the PACKAGE OF COCAINE \n               and the .44 from his pockets and places them back on one of \n               the shelves. CASE NUMBER C-549087. One thing about the .44 \n               which we can see now -- a BLACK STAIN on the metal of the \n               handle.\n\n                                                                    CUT TO:\n\n               INT. HOMICIDE SQUAD ROOM - DAY\n\n               Desks, phones, computers, typewriters and HOMICIDE DETECTIVES. \n               Some witnesses being interviewed. Rodriguez is on the phone \n               at his desk. He's in the middle of an interview as he fills \n               out one of the many forms that complicate his life.\n\n                                     RODRIGUEZ\n                              (into phone)\n                         -- a green car... you know what \n                         make... Maybe a Ford, uh-huh. You \n                         didn't see the license, did you?\n\n               Divinci comes back to his desk, next to Rodriguez. Rodriguez \n               looks up. Divinci gives him a confident smile and brushes \n               his hands together -- clean hands.\n\n                                     RODRIGUEZ\n                              (into phone)\n                         Yeah, no, I understand, it was dark... \n                         Uh-huh.\n\n               Divinci sits at his desk. He pulls an ADVERTISEMENT for a 42 \n               FOOT SPORT FISHING BOAT out of his desk. He holds it up to \n               Rodriguez, points to the boat.\n\n                                     DIVINCI\n                         Wanna go for a ride?\n\n                                     RODRIGUEZ\n                              (into phone)\n                         You think you could describe the \n                         driver?\n                              (covers phone; to \n                              Divinci)\n                         You bought it?\n\n                                     DIVINCI\n                         As of last night, I've got the down. \n                         Just picture me under swayin' palms \n                         with a Mai Tai.\n\n               We can HEAR someone describing a felon over the phone, but \n               Rodriguez isn't listening. He's looking at the boat.\n\n                                     RODRIGUEZ\n                              (into phone)\n                         Uh-huh.\n                              (covers phone)\n                         You're gonna buy it, no shit. When?\n\n                                     DIVINCI\n                         Just a phone call away.\n\n               Divinci picks up the phone, starts to dial.\n\n                                     RODRIGUEZ\n                         That's really great, man.\n\n               Divinci smiles. Rodriguez suddenly realizes the person on \n               the other end of the phone has stopped talking.\n\n                                     RODRIGUEZ\n                              (back to phone)\n                         Uh-huh, okay... how tall was he?\n\n               A heavy set man in his fifties approaches -- CAPTAIN \n               HENDERSON.\n\n                                     CAPT. HENDERSON\n                         You got primary on the drug related \n                         this morning on 27th.\n\n                                     DIVINCI\n                         I'm workin' it up now.\n\n                                     CAPT. HENDERSON\n                         Who's your second?\n                              (Divinci points at \n                              Rodriguez)\n                         In my office. Both of you.\n\n                                     DIVINCI\n                         Why?\n\n                                     CAPT. HENDERSON\n                         Now.\n\n               Captain Henderson doesn't wait for a response. He heads for \n               the office -- an inner office of glass and wood.\n\n               Divinci looks at Rodriguez, who is suddenly a little nervous. \n               We can HEAR the PERSON OVER THE PHONE that he's talking to, \n               but he's no longer interested and hangs up on them.\n\n                                     RODRIGUEZ\n                         What the hell --\n\n               Divinci motions \"keep calm.\"\n\n               INT. CAPTAIN HENDERSON'S OFFICE - DAY\n\n               Henderson is hanging up his coat as Divinci and Rodriguez \n               enter. They aren't the only ones in the office. RICHARD SIMMS, \n               thirty-two, trim, short cut hair, suit, is waiting.\n\n                                     CAPT. HENDERSON\n                         Detectives Divinci and Rodriguez, \n                         this is Richard Simms. He's with the \n                         D.E.A. He wants to ask you some \n                         questions about your case.\n\n                                     DIVINCI\n                         What's the occasion?\n\n                                     SIMMS\n                         You get an i.d. on the victim?\n\n                                     RODRIGUEZ\n                         We're waitin' for prints.\n\n               Divinci pulls out his note pad.\n\n                                     DIVINCI\n                         Car was registered to --\n\n                                     SIMMS\n                         -- Anchor Imports. 81 El Dorado. \n                         Black.\n\n                                     DIVINCI\n                         If you got all this, what d'you want \n                         from us?\n\n                                     SIMMS\n                         ...The man in the car is Lionel Hudd.\n\n                                     RODRIGUEZ\n                              (a little incensed)\n                         How d'you know that?\n                              (to Henderson)\n                         What's goin' on here?\n\n                                     SIMMS\n                         Hudd was DEA, undercover.\n\n               Rodriguez and Divinci take the news like a sledgehammer. On \n               their frozen expressions we HEAR --\n\n                                     SIMMS (O.S.)\n                         He was workin' a case on syndicate \n                         distribution of drugs on the south \n                         side. But every dealer we tagged \n                         kept getting killed. He finally got \n                         a lead on a girl -- Hudd was a friend \n                         of mine... I'm gonna nail the \n                         sonuvabitch who killed him.\n\n               A long beat on Rodriguez and Divinci, then --\n\n                                     DIVINCI\n                         We'll do everything we can to help.\n\n                                                                    CUT TO:\n\n               THE UNMARKED POLICE CAR - EXT. STREET - DAY\n\n               screeching around a corner and up a drive into a VACANT LOT. \n               The car skids to a stop and Rodriguez gets out of the driver's \n               side, slamming the door and storming off. He's out of his \n               mind.\n\n               Divinci gets out quickly, follows him. Rodriguez is so fired \n               up and scared he can't stop moving.\n\n                                     RODRIGUEZ\n                         SHIT, FUCK, SHIT, JESUS CHRIST!\n\n                                     DIVINCI\n                         Calm down!\n\n                                     RODRIGUEZ\n                         WE'RE DEAD, WE'RE FUCKING DEAD!\n\n                                     DIVINCI\n                         SHUT UP!\n\n                                     RODRIGUEZ\n                         FUCK, FUCK, FUCK!\n\n               Divinci catches Rodriguez, tries to stop him from flailing \n               about.\n\n                                     DIVINCI\n                         STOP IT! YOU HEAR ME, RIGHT NOW, \n                         STOP IT!\n\n                                     RODRIGUEZ\n                         GOD, GOD, THIS IS REALLY FUCKIN' OUT \n                         OF CONTROL!\n\n               Rodriguez tries to push Divinci away, but Divinci holds on. \n               They struggle --\n\n                                     RODRIGUEZ\n                         LET GO OF ME!\n\n               -- pushing, shoving, falling to the dirt. Divinci jumps on \n               top of him, pulling his pistol and shoving it into Rodriguez \n               mouth.\n\n                                     DIVINCI\n                         Shut up and listen to me!\n\n               Rodriguez glares up at Divinci.\n\n                                     DIVINCI\n                         They could be watchin' us right now \n                         you asshole. So fuckin' shape up! \n                         You got it?!\n                              (nothing from Rodriguez)\n                         I want you to nod!\n\n               It takes Rodriguez a moment, but he nods. Divinci pulls his \n               gun out of Rodriguez' mouth, gets off him and holsters his \n               pistol. Rodriguez is scared to death, not of Divinci, of the \n               mess they're in. He just lies in the dirt.\n\n                                     DIVINCI\n                         Get the fuck up!\n\n               Rodriguez starts to get to his feet. Divinci grabs him, yanks \n               him up. Pushes him to the car.\n\n                                     DIVINCI\n                         Get in the car!\n\n               They move back to the car. Rodriguez gets back into the \n               driver's seat. Divinci moves around to the passenger side. \n               Gets in, slams the door shut.\n\n               INT. UNMARKED CAR - DAY\n\n               They sit silently in the car for a moment in the middle of \n               the vacant lot. Breathing hard. Dirty. After a beat --\n\n                                     DIVINCI\n                         There's no fuckin' reason to panic.\n\n               Rodriguez turns slowly and looks at Divinci incredulously.\n\n                                     RODRIGUEZ\n                         No fuckin' reason to panic? Did you \n                         say no fuckin' reason to panic!\n\n                                     DIVINCI\n                         Stop being an idiot! We're the cops \n                         on the case. It's our case. We are \n                         going to find the fuckin' killers.\n\n                                     RODRIGUEZ\n                         WE'RE THE FUCKIN' KILLERS!\n\n                                     DIVINCI\n                         Since when does that matter?!\n\n               Rodriguez stares at Divinci for a beat, then we --\n\n                                                                    CUT TO:\n\n               EXT. UNMARKED CAR - PARKED - DAY\n\n               Rodriguez and Divinci are sitting on the car, each with a \n               beer and sharing a bottle of whiskey.\n\n                                     DIVINCI\n                         All they want is someone to go down \n                         for the crime, right? Do we care who \n                         goes down for the crime? Fuck no. As \n                         long as someone goes down for the \n                         crime. It's a slot that's gotta be \n                         filled.\n\n               Rodriguez is calmer, but still something bothers him --\n\n                                     RODRIGUEZ\n                         We killed a cop, doesn't that bother \n                         you?\n\n                                     DIVINCI\n                         Of course it bothers me. What d'you \n                         want me to do, turn myself in? Well \n                         I'm not. That's the risk we take \n                         everyday, somebody might pop us, \n                         especially undercover like that. So \n                         he got popped. It happens.\n\n                                     RODRIGUEZ\n                         Not by other cops!\n\n                                     DIVINCI\n                         I patted him down! He wasn't wearin' \n                         a wire, he had no badge, no gun, how \n                         was I supposed to know?!\n\n               A moment of silence, then --\n\n                                     DIVINCI\n                         Look, I feel just as bad as you do, \n                         but we gotta start thinkin' about us \n                         here. The important thing is we don't \n                         lose control of the case. We can \n                         never lose control of the case. \n                         Whatever evidence there is goes \n                         through us. We lay down the trail. \n                         Make it nice and logical. We're the \n                         teachers and two and two can add up \n                         to five if it's our classroom.\n\n                                     RODRIGUEZ\n                         What're you talkin' about, are you \n                         sayin' we stick somebody with this?\n\n                                     DIVINCI\n                         Evidence points wherever we want it \n                         to point. Shit, we can provide so \n                         much evidence, even the asshole we \n                         pick will think he fuckin' killed \n                         him.\n\n                                     RODRIGUEZ\n                         You got some asshole in mind?\n\n                                     DIVINCI\n                         Just don't worry. We'll find a killer. \n                         There's lots of 'em out there.\n\n                                                                    CUT TO:\n\n               EXT. STREET - DAY\n\n               THREE AFRICAN AMERICAN YOUTHS, all in their twenties, are \n               hanging on a street corner. Talking. Normal street traffic. \n               They give a long hard look to an ATTRACTIVE AFRICAN AMERICAN \n               WOMAN who walks past. A little chatter.\n\n               The UNMARKED CAR suddenly screeches to the curb. The black \n               youths scatter quickly as Divinci jumps out and goes after \n               the tallest of the three. His name is JAMES. Rodriguez guns \n               the car and gives chase on wheels.\n\n               James darts across traffic. Divinci running hard after him.\n\n               Rodriguez spins the car in a u-turn. Racing after them.\n\n               EXT. ALLEY - SAME TIME\n\n               James darts down the alley. Narrow, dark, lined with trash \n               bins. Divinci turns into the alley, but he isn't going to \n               catch him.\n\n               James is almost to the end when the car turns into the alley, \n               skidding to a stop. Rodriguez jumps out, gun leveled at James.\n\n               No where for him to go. He slows down. Rodriguez moves in \n               from his front, Divinci runs up from behind. James is \n               disgusted.\n\n                                     JAMES\n                         What the hell'd I do now?\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - EVIDENCE STORAGE ROOM - DAY\n\n               Divinci removes the PACKAGE OF COCAINE and the .44 from the \n               shelf. CASE NUMBER C-549087.\n\n                                                                    CUT TO:\n\n               THE .44 - INT. INTERROGATION ROOM - DAY\n\n               SLIDING across a table to James, who stops it with his right \n               hand. Divinci and Rodriguez are across from him.\n\n                                     JAMES\n                         Ain't my gun.\n\n                                     DIVINCI\n                         Never is, is it.\n\n                                     JAMES\n                         That ain't my fuckin' gun.\n\n               He shoves the gun back. Divinci stops it with his arm, careful \n               not to touch it.\n\n                                     DIVINCI\n                         Got your fuckin' prints on it.\n\n               James quickly realizes what they've done. He lunges for the \n               gun, but Divinci picks it up quickly with a pencil through \n               the trigger guard. James glares at them with murderous intent.\n\n                                     RODRIGUEZ\n                         Where were you Friday night?\n\n                                     JAMES\n                         Friday night... last Friday night?\n\n                                     RODRIGUEZ\n                         Where were you?\n\n                                     JAMES\n                         Whatever you think I did went down \n                         last Friday night?\n\n                                     DIVINCI\n                         Better have a good alibi, James, or \n                         it's good ali bye-bye.\n\n               A beat, then James smiles.\n\n                                     JAMES\n                         I was in jail you assholes. Check it \n                         out.\n                              (starts to laugh)\n                         All night. What a couple a dickheads!\n\n               Rodriguez and Divinci are silent.\n\n                                                                    CUT TO:\n\n               DOOR - INT. APARTMENT - DAY\n\n               KICKED IN on a grungy small apartment. Divinci and Rodriguez \n               burst in, guns drawn. Scaring the shit out of an HISPANIC \n               MAN (CORTEZ) and his half-naked GIRLFRIEND as they watch \n               television.\n\n                                     DIVINCI AND RODRIGUEZ\n                         NOBODY MOVE! HANDS IN THE AIR! NOW! \n                         MOVE IT!\n\n               CUT BACK TO:\n\n               THE .44 - INTERROGATION ROOM - DAY\n\n               SLIDING across the table back to Rodriguez and Divinci. Cortez \n               sits across from them. Wearing white t-shirt, baggy pants. \n               Tattoos on his arms.\n\n                                     CORTEZ\n                         Ain't my gun.\n\n                                     RODRIGUEZ\n                              (smiles)\n                         Got your prints on it.\n\n                                     CORTEZ\n                              (stands; angry)\n                         You fuck, I ain't never seen that \n                         gun before!\n\n                                     RODRIGUEZ\n                         Where were you last Friday night?\n\n                                     CORTEZ\n                         Fuck you. I wanna talk to a lawyer!\n\n               Just want they wanted to hear. No alibi.\n\n                                     RODRIGUEZ\n                         Lawyer's not gonna help you, Cortez. \n                         All the evidence we got points right \n                         to you.\n\n               Cortez stares at them for a moment, then --\n\n                                     CORTEZ\n                         Did you say last Friday night?\n\n               Cortez smiles and pulls up his shirt, revealing a long scar \n               across his stomach.\n\n                                     CORTEZ\n                         Intensive Care, you pindejo fuckin' \n                         gutter shits. And Thursday night, \n                         and Saturday, too. I just fucking \n                         got out this morning.\n\n                                                                    CUT TO:\n\n               MAN - EXT. ALLEY - DAY\n\n               SLAMMING INTO A WALL, hitting hard, falling back to the dirty \n               garbage covered alley. He's about twenty-seven, thin, blond \n               hair tied in a pony tail. He wears a flannel shirt, jeans, \n               boots. He doesn't want to fight. His name is DAVE.\n\n                                     DAVE\n                         Alright, alright, alright... shit. I \n                         ain't gonna fight you.\n\n               He looks up at Divinci and Rodriguez moving toward him.\n\n                                                                    CUT TO:\n\n               INT. INTERROGATION ROOM - DAY\n\n               Dave is behind the desk handling the .44 with no apparent \n               problem.\n\n                                     DAVE\n                         Ain't my gun.\n\n                                     RODRIGUEZ\n                         That's what they all say.\n\n                                     DAVE\n                         Wish it was. No better gun than Smitty \n                         and Wes .44 mag with serial numbers \n                         filed off.\n                              (opens cylinder)\n                         Got any bullets?\n\n               Divinci walks around, holds out his hand for the gun.\n\n                                     DAVE\n                         Who did I kill?\n\n                                     DIVINCI\n                         Where were you last Friday night?\n\n                                     DAVE\n                         You mean, what's my alibi right?\n\n               Dave spits on the gun, wipes off his prints with his shirt.\n\n                                     DAVE\n                         I was breakin' and entering. Jewelry \n                         store on seventh and Front, about \n                         nine o'clock. Not even close to your \n                         jurisdiction. I got the rocks to \n                         prove it.\n\n               He drops the gun, clean of prints onto the table.\n\n                                     DAVE\n                         Sorry I can't help ya. But one to \n                         five is better than ten to life.\n\n               Divinci and Rodriguez stare at Dave. They are not happy.\n\n                                                                    CUT TO:\n\n               MUG SHOTS - INT. HOMICIDE SQUAD ROOM - DAY\n\n               in plastic pages. A BINDER full of criminal portraits. Divinci \n               is going through one book. Rodriguez searches another.\n\n                                     DIVINCI\n                         Montrose LaJolla...\n\n                                     RODRIGUEZ\n                         We pulled him in last year for knifing \n                         that dealer on 32nd.\n\n                                     DIVINCI\n                         Yeah. Almost killed him, remember? \n                         He'd be good.\n                              (calls out to ANOTHER \n                              DETECTIVE)\n                         Anybody seen Montrose LaJolla?\n\n                                     ANOTHER DETECTIVE\n                         He's dead. His life partner killed \n                         him in a Domestic D about a month \n                         ago.\n\n               Rodriguez suddenly slams his book shut.\n\n                                     RODRIGUEZ\n                         Shit!\n\n               Divinci looks at him. Rodriguez is angry, tense. Divinci \n               gives him a look telling him this is not the time and place \n               for a discussion on this topic.\n\n                                     DIVINCI\n                         Take it easy.\n\n                                     RODRIGUEZ\n                         This isn't gonna work!\n\n               Divinci leans toward Rodriguez.\n\n                                     DIVINCI\n                         Nobody said it was gonna be easy. \n                         But let's not advertise our despair... \n                         Okay?\n\n               The PHONE RINGS. Divinci picks it up.\n\n                                     DIVINCI\n                              (into phone)\n                         Divinci.\n\n               INT. CAPT. HENDERSON'S OFFICE - DAY\n\n               Captain Henderson is sitting behind his desk. Divinci and \n               Rodriguez are in front of him. Rodriguez is trying to hide \n               his nervousness. Divinci is absolutely cool.\n\n                                     DIVINCI\n                         This is our case! Not the goddamn \n                         DEA's!\n\n                                     CAPT. HENDERSON\n                         It's been three days.\n\n                                     DIVINCI\n                         We're not fuckin' magicians! What \n                         the hell is three days?! This is a \n                         goddamn murder case! It takes a little \n                         bit of goddamn time!\n\n                                     CAPT. HENDERSON\n                         When a Federal Undercover Officer \n                         goes down, it's never a fuckin' murder \n                         case! I don't like the DEA on my ass \n                         any better than you like 'em on yours. \n                         But this is personal for them and \n                         they want answers. Forget your other \n                         cases and get something, anything \n                         that I can give to them. The last \n                         thing I want is the goddamn F.B.I. \n                         on my back, too.\n\n               Divinci and Rodriguez are quiet for a beat, then --\n\n                                     DIVINCI\n                         We've got a couple leads. We need a \n                         little more time.\n\n                                     CAPT. HENDERSON\n                         I can't hold 'em off much longer.\n\n                                     RODRIGUEZ\n                         This is no fuckin' way to run an \n                         investigation.\n\n                                     CAPT. HENDERSON\n                         Let me tell you both something, if \n                         you don't solve this quick, they're \n                         gonna start askin' why? And they'll \n                         be lookin' to blame somebody in this \n                         department. So my advise to you is, \n                         get something fuckin' fast or turn \n                         over what you've got and get outa \n                         the way.\n\n               Rodriguez and Divinci are quiet for a moment, then --\n\n                                     DIVINCI\n                         How much time we got?\n\n                                     CAPT. HENDERSON\n                         A couple days. The funeral's this \n                         afternoon.\n\n                                     RODRIGUEZ\n                         What funeral?\n\n                                     CAPT. HENDERSON\n                         For Agent Hudd. Simms wants you there.\n\n                                     DIVINCI\n                         What for? We didn't know him.\n\n                                     CAPT. HENDERSON\n                         How the hell do I know?! It's DEA, \n                         it's their thing. You're the cops on \n                         the case, I suppose they want you to \n                         know what a great guy Hudd was so \n                         you'll work all that harder to find \n                         his killer. Just go. It'll reassure \n                         'em how much you care and keep 'em \n                         off my ass.\n\n                                                                    CUT TO:\n\n               EXT. CEMETERY - GRAVE SITE - LATE AFTERNOON\n\n               MOURNERS gathered around the grave site. WIFE in tears. MOTHER \n               in tears. The men trying their best to hold up. Beyond the \n               family, DEA AGENTS. Simms among them. A show of support and \n               solidarity. A REVEREND delivering --\n\n                                     REVEREND\n                         -- and it is too easy to say that he \n                         was a good man in his job because he \n                         gave more than most. And it's too \n                         easy to say that he was a good man \n                         in his community because he gave \n                         more than others. And it's too easy \n                         to say he was a good man at home \n                         with his family because he was always \n                         there when they needed him. Special \n                         Agent Lionel Hudd was not just a \n                         good man, he was an extraordinary \n                         man. And his death shall not be in \n                         vain.\n\n               CAMERA FINDS Divinci and Rodriguez at the back. Rodriguez \n               looks nervous. Divinci notices. Their conversation is quiet.\n\n                                     DIVINCI\n                         Don't Humpty Dumpty on me.\n\n                                     RODRIGUEZ\n                         What's that mean?\n\n                                     DIVINCI\n                         Your cracks are startin' to show.\n\n                                     RODRIGUEZ\n                              (covering)\n                         Bullshit.\n\n               Divinci sees Simms approaching from the side.\n\n                                     DIVINCI\n                         Get your balance. Here comes the \n                         King.\n\n               Rodriguez glances toward Simms as he walks up. The \n               conversation is quiet. Not wanting to disturb the ceremony.\n\n                                     SIMMS\n                         Glad you came... Anything break?\n\n               Divinci glances at Rodriguez.\n\n                                     DIVINCI\n                         Nothin' to brag about. But we've got \n                         a couple new leads we're followin'.\n\n                                     SIMMS\n                         ...Look, normally we'd be all over \n                         this, but your Captain seems to think \n                         you can do the job. It's your \n                         territory. I guess you know it better \n                         than anybody. And that can be worth \n                         a lot. But you understand... we won't \n                         wait forever.\n\n               Divinci is pissed. He doesn't like Simms.\n\n                                     DIVINCI\n                         Just outa curiosity... What happened \n                         to his backup? You guys use backup \n                         on undercover don't you?\n\n                                     SIMMS\n                         It was a new lead. Hudd was afraid \n                         backup would blow his cover. He was \n                         supposed to check in ten minutes \n                         after the deal went down. He never \n                         checked in.\n\n                                     RODRIGUEZ\n                         We want this one as bad as you do. A \n                         cop's a cop. We're in this together, \n                         right?\n\n               Simms stares at Rodriguez and Divinci for a moment, then he \n               returns his attention to the ceremony.\n\n                                     SIMMS\n                         That's why I asked you to come here. \n                         Just so you knew that.\n\n                                                                    CUT TO:\n\n               EXT. HOT DOG VENDOR STREET - DUSK\n\n               Rodriguez and Divinci walk down the street, hot dogs in hand, \n               returning to their car parked curbside.\n\n                                     DIVINCI\n                         He didn't have backup. You believe \n                         that?! Jesus what a dick.\n\n                                     RODRIGUEZ\n                         I don't think we should criticize \n                         that particular decision of his.\n\n                                     DIVINCI\n                         I don't care what the reasons are, \n                         you don't play Lone Fuckin' Ranger \n                         on a drug buy. You're just askin' \n                         for it. That's all I'm sayin'.\n\n                                     RODRIGUEZ\n                         I don't trust those bastards. They're \n                         not waitin' for us. That's bullshit. \n                         They're runnin' their own \n                         investigation. I know it!\n\n                                     DIVINCI\n                         Let 'em. The gun, the coke came from \n                         evidence. The car came from impound. \n                         So what's to find?\n\n                                     RODRIGUEZ\n                         That's what I'm afraid of. There's \n                         nothing for them to find. We were \n                         too good.\n\n                                     DIVINCI\n                         So what're you worried about?\n\n                                     RODRIGUEZ\n                         Nobody is that fuckin' good.\n\n               Divinci looks at Rodriguez, then smiles.\n\n                                     DIVINCI\n                         Except us.\n\n                                                                    CUT TO:\n\n               STRIPPER - INT. STRIP JOINT - NIGHT\n\n               bumping and grinding her way through her performance. We \n               don't see her face yet. Just her body. G-string and skin \n               tight tank top. LOUD MUSIC. MEN in the audience appreciative. \n               The room is smoky. LIGHTS swirl over the stage. The tank top \n               comes off. WHISTLES and CHEERS. And now we see the dancer -- \n               it's CYNTHIA.\n\n               INT. HALLWAY - BACK STAGE - NIGHT\n\n               Cynthia moves down the hall in her g-string and high heels. \n               She enters the dressing room.\n\n               INT. DRESSING ROOM - NIGHT\n\n               Divinci is sitting in the only chair in the cramped little \n               room. He's going through her purse. Cynthia stops when she \n               sees him, then shuts the door.\n\n                                     CYNTHIA\n                         I think this is breaking and entering, \n                         isn't it?\n\n                                     DIVINCI\n                         I work homicide, I don't deal with \n                         that shit.\n\n                                     CYNTHIA\n                              (puts on robe)\n                         Learn anything you didn't already \n                         have on file?\n\n                                     DIVINCI\n                         Yeah. You surprise me sometimes. \n                         Here I think you're just a hard case \n                         and I discover you've got a heart of \n                         gold.\n                              (holds up her drivers \n                              license)\n                         You're an organ donor. That's really \n                         nice. The only problem is, they'll \n                         never use your best parts.\n\n                                     CYNTHIA\n                         I'll make sure you get them.\n\n                                     DIVINCI\n                         Hey, don't get me wrong. I was just \n                         surprised that we had something in \n                         common... Besides what we have in \n                         common.\n\n                                     CYNTHIA\n                         Do everybody a favor, if you're gonna \n                         donate your heart, make sure it goes \n                         to science. Most people want one \n                         that beats.\n\n                                     DIVINCI\n                         Cynthia... pretty name. What do the \n                         first three letters spell?\n\n                                     CYNTHIA\n                         Don't get so clever. It's out of \n                         character.\n\n                                                                    CUT TO:\n\n               INT. CYNTHIA'S APARTMENT - BEDROOM - NIGHT\n\n               Divinci and Cynthia are lying in bed. Divinci has his arm \n               around her, but he's staring at the ceiling.\n\n                                     CYNTHIA\n                         What's so interesting up there?\n\n                                     DIVINCI\n                         Nothing.\n\n                                     CYNTHIA\n                         Then why's it got all your attention?\n\n                                     DIVINCI\n                         I'm thinkin', that's all.\n\n                                     CYNTHIA\n                         About us?\n\n                                     DIVINCI\n                         No.\n\n                                     CYNTHIA\n                         Good.\n\n               Divinci looks at Cynthia.\n\n                                     DIVINCI\n                         What if I was thinkin' about us?\n\n                                     CYNTHIA\n                         Don't waste your time.\n\n                                     DIVINCI\n                         What if I was?\n\n                                     CYNTHIA\n                         Where's it gonna get us?\n\n                                     DIVINCI\n                         Maybe I got plans.\n\n                                     CYNTHIA\n                         I don't wanna hear 'em. Plans just \n                         make you think somethin's gonna get \n                         better. I'm fine now. I don't need \n                         to get screwed up waitin' for \n                         something good to happen.\n\n                                     DIVINCI\n                         I just want you to know, love is \n                         important to me.\n\n                                     CYNTHIA\n                         Me, too.\n\n                                     DIVINCI\n                         But more important is loyalty. Nothing \n                         is more important than that. Not \n                         love, not anything. Because loyalty \n                         is about respect. You can talk about \n                         love all you want, but without respect \n                         it's empty. I mean the first thing \n                         that goes in a marriage is respect. \n                         And once it's gone, forget the love. \n                         So I am telling you, I am loyal to \n                         you. Like I'm loyal to my partner. \n                         We are closer than blood. And I trust \n                         him with my life.\n\n               Cynthia didn't really expect this from Divinci. She's \n               actually, despite herself, a little touched.\n\n                                     CYNTHIA\n                         Why're you telling me this?\n\n                                     DIVINCI\n                         When you asked if I was thinkin' \n                         about us and I said I wasn't, I just \n                         want you to know that I do.\n\n               A beat, then --\n\n                                     CYNTHIA\n                         Just don't ask me to marry you.\n\n                                     DIVINCI\n                              (smiles)\n                         Why aren't more women like you?\n\n               Divinci leans in and they kiss.\n\n                                                                    CUT TO:\n\n               EXT. CYNTHIA'S APARTMENT - NIGHT\n\n               Divinci exits the building. Starts to cross the street to \n               his car parked on the opposite side when he HEARS SOMETHING \n               BEHIND him. He turns, instantly reaching for his pistol.\n\n               A drunk staggers out of the alley -- looks like he has a gun \n               in his hand.\n\n               Divinci instinctively raises his gun to shoot when --\n\n               THE LIGHT -- catches the object in the drunk's hand -- a \n               BROWN BOTTLE, the neck sticking ahead like the barrel of a \n               gun.\n\n                                     DIVINCI\n                              (lowers gun)\n                         You fuckin' idiot.\n\n               The drunk stops when he hears the voice. Looks through his \n               matted greasy hair that cascades in front of his eyes. Now \n               we recognize Joe.\n\n               Divinci turns away, disgusted. Opens his car door, then stops. \n               Caught in a thought. He turns back and looks at Joe again.\n\n               EXT. ALLEY - NIGHT\n\n               Joe stumbles back into the DARKNESS OF THE ALLEY. Lies down \n               next to a trash bin. LIGHTS suddenly illuminate Joe. Joe \n               squints as a CAR moves right up to him. Joe shields the light \n               with an arm.\n\n               We HEAR the DOOR OPEN and CLOSE, then Divinci bends down \n               into the LIGHT. He is wearing a BASEBALL CAP backwards on \n               his head. And GLOVES on his hands. He reaches inside Joe's \n               JACKET POCKET.\n\n                                     DIVINCI\n                         What've we got here?\n\n               He pulls out the Smith and Wesson .44. Divinci looks at Joe.\n\n                                     DIVINCI\n                         Where were you last Friday night?\n\n               Confused, Joe looks up at Divinci through matted hair.\n\n                                                                    CUT TO:\n\n               INT. CAR - DRIVING - NIGHT (EARLY MORNING)\n\n               Divinci drives. Joe up front. In an alcoholic daze.\n\n                                     DIVINCI'S VOICE\n                         What's your name?\n\n               Joe looks at Divinci. Having trouble focusing.\n\n                                     DIVINCI\n                         Your name, what's your name?\n\n                                     WILLIAM\n                         ...Joe...\n\n                                     DIVINCI\n                         Where'd you get the gun, Joe?\n\n               Joe looks down at his hands -- he's holding the .44.\n\n                                     DIVINCI\n                         It was in your pocket, Joe, your \n                         coat pocket. You must keep it for \n                         protection, right?\n\n                                     WILLIAM\n                         I don't know.\n\n                                     DIVINCI\n                         Sure you do, Joe. Everybody needs \n                         protection. Especially a guy like \n                         you lives on the street, right?\n\n               Joe just stares at the gun.\n\n                                     DIVINCI\n                         Put it back in your pocket, Joe. You \n                         don't have to worry about me, I'm \n                         not gonna hurt you.\n\n               Joe puts the gun into his jacket pocket.\n\n                                                                    CUT TO:\n\n               EXT. STREET - EARLY MORNING\n\n               The LOCATION of HUDD'S MURDER. The street is empty. Quiet. \n               Divinci stops his car next to where Hudd died.\n\n               INT. DIVINCI'S CAR - EARLY MORNING\n\n               Joe is asleep, leaning against the window. Divinci reaches \n               across and yanks him.\n\n                                     DIVINCI\n                         Wake up, Joe! I want you to look at \n                         something. Out the window, Joe. Look \n                         out the window.\n\n               Joe's eyes open. Divinci forces his head to the window.\n\n                                     DIVINCI\n                         This is where it happened, Joe. I \n                         want you to remember it. This is \n                         where you killed him\n\n               Joe tries to turn to Divinci, but Divinci holds his head.\n\n                                     DIVINCI\n                         You remember it now? How you shot \n                         him through the head? You remember \n                         it?\n\n                                     WILLIAM\n                         I... don't...\n\n                                     DIVINCI\n                              (lets go of Joe)\n                         You will.\n\n               Divinci slams his foot down on the accelerator and --\n\n               THE CAR\n\n               -- tears off down the street.\n\n                                                                    CUT TO:\n\n               RODRIGUEZ - INT. BEDROOM - EARLY MORNING\n\n               asleep. Alone in a double bed. The PHONE RINGS. Rodriguez \n               startles awake. Catches the phone on the second ring.\n\n                                     RODRIGUEZ\n                         Who the hell is this?\n\n               INTERCUT WITH DIVINCI - INT. MOTEL ROOM - EARLY MORNING\n\n               Divinci on the phone in the f.g. Joe is passed out on the \n               bed in the b.g. The room is dark.\n\n                                     DIVINCI\n                         Is that any way to answer the phone?\n\n                                     RODRIGUEZ\n                         Divinci, shit! It's quarter to six.\n\n                                     DIVINCI\n                         I know what time it is, I'm not the \n                         one in bed. I need the photos of the \n                         scene.\n\n                                     RODRIGUEZ\n                         Now?\n\n                                     DIVINCI\n                         I got a suspect. But he can't remember \n                         all the details. He needs a little \n                         help. And I thought, since you're my \n                         partner, you might jump at the \n                         opportunity to lend me a fuckin' \n                         hand.\n\n               Rodriguez sits up in bed.\n\n                                     RODRIGUEZ\n                         He doesn't remember last Friday?\n\n                                     DIVINCI\n                         He doesn't remember a lotta Fridays. \n                         Bring the shots and pick up a fifth \n                         of Vodka.\n                              (glances at Joe)\n                         Make it two.\n\n                                                                    CUT TO:\n\n               JOE - INT. MOTEL ROOM - DAY\n\n               asleep on the bed.\n\n                                     DIVINCI\n                         Time to get up, Joe.\n\n               Divinci slaps him. Joe's eyes open.\n\n                                     DIVINCI\n                         I want you to look at something.\n\n               The room is still dark. Curtains drawn. We now see Rodriguez. \n               He's wearing a black sock cap and gloves. He hands Divinci \n               POLICE PHOTOGRAPHS of the car, the street, the victim -- the \n               murder scene. Divinci pulls Joe into a sitting position.\n\n                                     DIVINCI\n                         There's the guy and the street and \n                         the car. You remember how you shot \n                         him.\n\n               Joe stares at the photographs and starts to shake his head.\n\n                                     DIVINCI\n                         You don't remember? That's not what \n                         you told me last night.\n\n               Joe is confused.\n\n                                     DIVINCI\n                         If you remember you can have a drink.\n\n               Joe looks at the bottle Rodriguez holds out to him.\n\n                                     DIVINCI\n                         But you gotta remember how you saw \n                         him driving toward you and you were \n                         in the street and you were afraid he \n                         was going to hit you so you had to \n                         shoot to protect yourself. You \n                         remember now don't you?\n\n               Joe stares at the photographs for a moment, then nods.\n\n                                     DIVINCI\n                         And where's your gun, Joe, where do \n                         you keep your gun?\n\n               Joe thinks a moment, then reaches into his coat pocket and \n               pulls out the .44. Divinci hands Joe the bottle and Joe \n               drinks. We PUSH IN on the BOTTLE OF VODKA as the liquid drains \n               away and we CLOSE IN TIGHT until we can SEE LIONEL HUDD'S \n               FACE as we --\n\n                                                               DISSOLVE TO:\n\n               CLOSE UP - THE PHOTOGRAPHS\n\n               Hudd dead. Blood on the windows. The street. Joe is drunk \n               again. In a haze. Starts to lift the bottle. Rodriguez pulls \n               it away. Rodriguez and Divinci always stay behind Joe.\n\n                                     RODRIGUEZ\n                         Why'd you kill him?\n\n                                     WILLIAM\n                         I... don't know...\n\n                                     RODRIGUEZ\n                         It was your gun.\n\n                                     WILLIAM\n                         ...I don't have a gun.\n\n                                     DIVINCI\n                         Yes you do. In your pocket.\n\n                                     WILLIAM\n                         ...I'm tired.\n\n                                     DIVINCI\n                         I know, Joe, it's tough to remember \n                         things you don't wanna remember. \n                         What about your last name, Joe. You \n                         got a last name?\n\n               Joe looks up as if trying to remember. Or trying not to.\n\n                                     RODRIGUEZ\n                         Come on, Joe, everybody's got a last \n                         name.\n\n                                     WILLIAM\n                         I don't remember.\n\n                                     RODRIGUEZ\n                         Don't fuck with us, Joe. We're trying \n                         to help you. What's your last goddamn \n                         name?\n\n               Joe shakes his head.\n\n                                     WILLIAM\n                         I don't know.\n\n               Rodriguez suddenly smacks Joe on the side of the head when \n               he tries to look back. Joe is surprised by the blow. Divinci \n               pushes Rodriguez back. Shakes his head telling him to back \n               off.\n\n                                     DIVINCI\n                              (to Joe; friendly)\n                         Come on, we're all tired here, Joe. \n                         Just give us your last name.\n\n                                     WILLIAM\n                         I don't remember.\n\n                                     DIVINCI\n                         ...Okay, fine, what's in a name? But \n                         you remember the gun, right, in your \n                         pocket.\n\n               Joe nods.\n\n                                     DIVINCI\n                         And you remember that you told me \n                         you thought he was going to hit you, \n                         right? That's why you shot...\n\n                                     WILLIAM\n                         ...Yeah.\n\n               Divinci looks at Rodriguez. Rodriguez nods.\n\n                                     DIVINCI\n                         How'd it happen, Joe, tell me how it \n                         happened.\n                              (prompting)\n                         You saw him driving toward you --\n\n                                     WILLIAM\n                         -- I saw him driving toward me --\n\n                                                                    CUT TO:\n\n               INT. CAR - NIGHT - LIONEL HUDD\n\n               driving. The night that he was shot. He looks ahead into the \n               darkness of the street. Suddenly he SEES --\n\n               EXT. STREET - NIGHT\n\n               A MAN standing in the street ahead of him.\n\n               HUDD - INT. CAR - NIGHT\n\n               smiles and turns toward the man in the street.\n\n               A .44\n\n               is pulled from a jacket pocket, lifted toward the APPROACHING \n               CAR. The gun is in the hands of Joe. He is scared. The \n               HEADLIGHTS COMING RIGHT AT HIM. He aims and FIRES the gun.\n\n               THE FRONT WINDOW\n\n               SHATTERS. And the car swerves to the curb.\n\n               EXT. STREET - NIGHT\n\n               Joe watches from the street, then looks at the .44 in his \n               hand.\n\n               BACK INSIDE THE MOTEL ROOM - NIGHT\n\n               Rodriguez leans into Joe who is now sitting on the edge of \n               the bed, looking down at the .44 in his hand.\n\n                                     RODRIGUEZ\n                         Then what did you do?\n\n               EXT. STREET - NIGHT\n\n               Joe is in the street again. He doesn't know what he did.\n\n               BACK INSIDE THE MOTEL ROOM\n\n               Divinci leans close to Joe from behind now.\n\n                                     DIVINCI\n                         You ran.\n\n               And now Joe can imagine it. We PUSH INTO JOE'S EYES.\n\n               BACK TO THE STREET\n\n               as Joe turns and runs. As fast as he can away from the death. \n               He looks back over his shoulder, scared.\n\n                                     JOE'S VOICE\n                         I didn't mean to...\n\n               BACK INSIDE THE MOTEL ROOM\n\n               Joe is staring at the gun. Divinci and Rodriguez watch him.\n\n                                     WILLIAM\n                         He was going to hit me... I was \n                         scared... he was going to hit me.\n\n               Rodriguez looks at Divinci.\n\n                                     DIVINCI\n                         That's why you shot him.\n\n                                     WILLIAM\n                         That's why I...\n\n               JOE - BACK ON THE STREET - NIGHT\n\n               AIMS the gun again at the APPROACHING CAR.\n\n                                     JOE'S VOICE\n                         ...shot him.\n\n               And we HEAR the GUN SHOT AGAIN, shattering the silence as we --\n\n                                                                    CUT TO:\n\n               THE SMOKING .44 - INT. ABANDONED WAREHOUSE - DAY\n\n               held by Joe's hand, which is held by Divinci's gloved hand. \n               Divinci has held Joe's finger on the trigger and pulled it.\n\n               The gunshot is deadened in the old building. Joe is lying in \n               the back seat of a car, passed out, with Divinci holding the \n               .44 in his hand. The back door is open. The engine is running.\n\n                                     DIVINCI\n                         Helluva nice shot, Joe.\n\n               Divinci pulls the 44. out of Joe's hand, then shuts the door, \n               gets into the front. The car pulls away, exiting the \n               warehouse.\n\n               HAND - INT. INTERROGATION ROOM - POLICE STATION - DAY\n\n               signing a name at the bottom of a paper -- Joe. Beneath it \n               is the type written name: JOE DOE. We PULL BACK and see it's \n               Joe signing a typewritten page as Divinci and Rodriguez watch. \n               Joe is a mess. When he finishes he pushes the paper away and \n               puts his head down on the table. Divinci picks up the paper \n               and we --\n\n                                                                    CUT TO:\n\n               EXT. CYNTHIA'S APARTMENT BUILDING - DAY\n\n               A small yellow Toyota with a bashed up left fender pulls to \n               the curb. Cynthia gets out lugging her purse and a bag of \n               groceries. We HEAR ANOTHER CAR DOOR SHUT. She turns. Divinci \n               is walking across the street from his car toward her.\n\n                                     CYNTHIA\n                         It's the middle of the day.\n\n               Divinci gives her a look as he takes the grocery bag from \n               her.\n\n                                     DIVINCI\n                         Just talk.\n\n                                     CYNTHIA\n                         Since when?\n\n               Divinci leads the way into the apartment building.\n\n               INT. CYNTHIA'S APARTMENT - DAY\n\n               Cynthia opens the door, pulls the key out of the lock as \n               Divinci enters behind her with the groceries.\n\n                                     DIVINCI\n                         I need you to do something.\n\n                                     CYNTHIA\n                         Good, I need the money.\n\n               She shuts the door. Divinci deposits the bag on the table. \n               Cynthia picks it up, moves into the kitchen.\n\n                                     DIVINCI\n                         This isn't a deal. Where you goin'?\n\n                                     CYNTHIA\n                         I got perishables, okay?\n\n               Cynthia enters the kitchen and Divinci follows. Cynthia starts \n               unloading the groceries, putting the milk, eggs, etc. into \n               the refrigerator.\n\n                                     DIVINCI\n                         The guy we did the last deal with is \n                         dead.\n\n               Cynthia turns suddenly.\n\n                                     CYNTHIA\n                         What?\n\n                                     DIVINCI\n                         Somebody popped him that night, \n                         probably when he tried to unload the \n                         stuff. I don't know.\n\n                                     CYNTHIA\n                         Jesus, does anybody --\n\n                                     DIVINCI\n                         -- Don't worry, there's no connection. \n                         We got the guy who did it.\n\n               Cynthia breathes a sigh of relief.\n\n                                     CYNTHIA\n                         You scared the hell outa me.\n\n                                     DIVINCI\n                         We just need you to do one thing.\n\n                                     CYNTHIA\n                         ...What?\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - DAY\n\n               Divinci and Rodriguez are moving down a hallway with Cynthia. \n               She's nervous. Wants very much not to be here.\n\n                                     DIVINCI\n                         He'll be third from the left. Don't \n                         fuck up. Third from the left.\n\n                                     CYNTHIA\n                         What'm I supposed to say?\n\n                                     DIVINCI\n                         Just look at 'em and then look at \n                         the man the third from the left and \n                         say, It's him.\n\n                                     RODRIGUEZ\n                         And I'll say, Are you sure?\n\n                                     DIVINCI\n                         And you say, Absolutely. No question.\n\n                                     CYNTHIA\n                         This is all I need to do right?\n\n                                     DIVINCI\n                         We have a signed confession. You \n                         i.d. him, he's goin' straight into \n                         the can.\n\n                                     CYNTHIA\n                         Okay, okay. But this is it. I'm not \n                         doin' anything more than this.\n\n                                     DIVINCI\n                         Hey, it's a done deal.\n\n                                                                    CUT TO:\n\n               INT. POLICE LINEUP ROOM - DAY\n\n               ROWS of seats face a small platform. The LINEUP WALL is \n               striped with horizontal lines with HEIGHT NUMBERS. The \n               brightly lighted lineup is separated from the gallery, which \n               is in the dark.\n\n               UNIFORMED GUARDS are on hand to make sure there is no \n               discussion, verbal or otherwise, between accused and witness. \n               SIX MEN file onto the platform. All shady characters.\n\n                                     A VOICE\n                         Stop and face front.\n\n               The six men obey. A couple keep their heads down. The others \n               squint from the bright lights.\n\n                                     THE VOICE\n                         Lift your heads, look straight.\n\n               Heads are lifted. Eyes front. But we only recognize one of \n               them, standing third from the left. It's Joe.\n\n               Divinci, Rodriguez and Cynthia are in the gallery.\n\n                                     DIVINCI\n                         Take your time. Try and remember his \n                         face.\n\n               Cynthia counts three from the left and... wait a minute. She \n               looks more closely. Just to be sure. Rodriguez and Divinci \n               watch her. She's obviously putting on a good show. Then she \n               turns to Divinci, sitting next to her and whispers --\n\n                                     CYNTHIA\n                         I know him.\n\n               Divinci is caught a little of guard -- he didn't expect a \n               private conversation, nor does he want one for fear of it \n               looking like he's coaching her.\n\n                                     DIVINCI\n                         If you can identify the man --\n\n                                     CYNTHIA\n                              (whisper)\n                         I know him.\n\n                                     DIVINCI\n                         Just tell us which one.\n\n               Cynthia, frustrated, gives Divinci a look.\n\n                                     CYNTHIA\n                         No. I fucking know him.\n\n               Divinci still isn't sure what's gotten into her. Rodriguez \n               looks over, a little annoyed.\n\n                                     RODRIGUEZ\n                         What's the problem?\n\n                                     DIVINCI\n                         There's no problem!\n                              (to Cynthia; pointedly)\n                         Do you see him up there?!\n\n                                     CYNTHIA\n                              (aside)\n                         You don't understand.\n\n               Divinci is losing his patience. He doesn't want to blow the \n               whole thing now, not in front of guards and police personnel. \n               The Guards are beginning to wonder what the hell's going on. \n               So are the MEN in the line.\n\n                                     ONE OF THE MEN\n                         Hey, come on, do it or don't!\n\n                                     THE VOICE\n                         No talking.\n\n               Divinci leans in close to her. We can HEAR GRUMBLING from \n               the men on the platform.\n\n                                     DIVINCI\n                         Pick the asshole out!\n\n               Cynthia starts to protest again, but she suddenly feels \n               Divinci's hand grip her arm. He's had enough. Cynthia gets \n               the message. And while keeping her eyes locked on Divinci \n               she says --\n\n                                     CYNTHIA\n                         Third man from the left.\n\n               JOE\n\n               squints against the harsh light, trying to see into the room, \n               as if he recognized the voice.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY - POLICE STATION - OUTSIDE THE LINEUP ROOM - \n               DAY\n\n               Rodriguez, Divinci and Cynthia move briskly down the hall. \n               None happy about what just happened. The conversation is \n               strained.\n\n                                     DIVINCI\n                         You mind telling me what that was \n                         all about?!\n\n                                     CYNTHIA\n                         I know him. He hangs around my \n                         building. He lives in the alley or \n                         something.\n\n               Rodriguez looks at Divinci. Is this a problem?\n\n                                     DIVINCI\n                         You don't think people that hang \n                         around your neighborhood can kill \n                         somebody. Well let me tell you \n                         something. You don't live in a great \n                         fuckin' neighborhood.\n\n               Divinci pulls a paper from his pocket.\n\n                                     DIVINCI\n                         Just sign the goddamn paper.\n\n                                     CYNTHIA\n                         What paper?\n\n                                     RODRIGUEZ\n                         You picked a man out of a lineup, \n                         you have to sign that you did that \n                         so they don't think we made it up.\n\n               Cynthia just stares at Rodriguez for a beat, then --\n\n                                     CYNTHIA\n                         Now why the hell would they think \n                         something like that?\n\n                                     DIVINCI\n                         Sign it.\n\n                                     CYNTHIA\n                         You said all I had to do was pick \n                         him out.\n\n                                     DIVINCI\n                         This is part of it. Just sign it and \n                         you're done.\n\n                                     CYNTHIA\n                         How come you're so sure it was him?\n\n               Rodriguez rolls his eyes.\n\n                                     RODRIGUEZ\n                         Jesus Christ!\n\n                                     DIVINCI\n                         He confessed.\n\n                                     CYNTHIA\n                         Bullshit.\n\n                                     RODRIGUEZ\n                         We got it in writing.\n\n                                     CYNTHIA\n                         He didn't do it.\n\n                                     DIVINCI\n                         How the hell d'you know that? Were \n                         you with him at the time?! You have \n                         a good goddamn alibi for him?!\n\n                                     RODRIGUEZ\n                         Maybe she was blowing him!\n\n                                     CYNTHIA\n                         Better him than you.\n\n               Rodriguez grabs her arm and pushes her against the wall. \n               Divinci looks around quickly to see who's watching.\n\n                                     DIVINCI\n                         Take it easy.\n\n               Rodriguez angrily throws up his hands and glares at Divinci.\n\n                                     RODRIGUEZ\n                         Fine, I got nothin' at stake here.\n\n               Divinci gives him a look, then leans right up next to Cynthia.\n\n                                     DIVINCI\n                         This is what they call an open and \n                         shut case. He did the kill and he's \n                         going down. Don't make the mistake \n                         of thinking you know the right thing \n                         to do.\n\n               Divinci holds out the paper. Cynthia hesitates a beat, then \n               takes it and signs her name.\n\n                                                                    CUT TO:\n\n               JOE - CLOSE SHOT - MUG SHOTS\n\n               holding a number. The SCENE FADES WHITE with the FLASH.\n\n                                                               DISSOLVE TO:\n\n               CELL DOOR - INT. JAIL - DAY\n\n               closing on Joe who is standing in the small CELL, facing the \n               wall, his back to us. The door is locked and we --\n\n                                                                    CUT TO:\n\n               INT. EVIDENCE ROOM - DAY\n\n               as the .44 is placed on a shelf. But this time it's tagged \n               with a different number. M5114000.\n\n                                                                    CUT TO:\n\n               THE SIGNED CONFESSION - INT. CAPT. HENDERSON'S OFFICE - DAY\n\n               as Agent Simms reads through it to the end.\n\n                                     SIMMS\n                         Doe?\n\n               Simms looks across at Rodriguez and Divinci. Capt. Henderson \n               and TWO OTHER DEA AGENTS (HOOPER and SARKASIAN) are also \n               present. The DEA are in suits and ties.\n\n                                     RODRIGUEZ\n                         He wouldn't give us his last name.\n\n                                     SIMMS\n                         He signed a confession but he wouldn't \n                         give you his last name?\n\n                                     DIVINCI\n                         He said he couldn't remember it.\n                              (points to his head)\n                         He's a head case.\n\n                                     AGENT HOOPER\n                         You run prints?\n\n                                     RODRIGUEZ\n                         No priors.\n\n                                     AGENT SARKASIAN\n                         Ballistics match?\n\n                                     RODRIGUEZ\n                         We're waiting. But a forty-four was \n                         used in commission. He had a forty-\n                         four on him.\n\n                                     AGENT HOOPER\n                         It went down pretty quick.\n\n                                     DIVINCI\n                         It's our street.\n\n                                     CAPT. HENDERSON\n                         I think they did a helluva job.\n\n               Suddenly Simms slams his hand down on the desk.\n\n                                     SIMMS\n                         Goddammit!\n\n               Everyone turns to Simms. He's angry. Rodriguez is uneasy.\n\n                                     SIMMS\n                         Some goddamn piece a shit blows him \n                         away for NOTHING!\n\n               The intensity of Simms anger quiets everybody. A beat as \n               Simms regains his composure.\n\n                                     SIMMS\n                         I'm sorry. Hudd was too good for \n                         this to happen... I just didn't think \n                         he'd go down this way.\n\n               Simms crosses the room to Divinci and Rodriguez.\n\n                                     SIMMS\n                         Good work. Thanks.\n\n               He shakes their hands. Then exits. Hooper and Sarkasian follow \n               their boss out the door. Rodriguez, Divinci and Henderson \n               exchange a look.\n\n                                     CAPT. HENDERSON\n                         Do me a favor. Make sure this one \n                         sticks. I don't want the D.E.Assholes \n                         back in here.\n\n                                                                    CUT TO:\n\n               HEADLIGHTS (B&W)\n\n               coming right at us. Closer and closer. Filling the screen.\n\n               FLAMES BURST (COLOR)\n\n               from the barrel of a .44 in SLOW MOTION -- a FIREBALL. The \n               GUNSHOT is deafening, like thunder.\n\n               GLASS\n\n               SHATTERS in SLOW MOTION.\n\n               JOE\n\n               covers his face with his hands to protect himself from the \n               glass. But there is no glass. Joe is sweating, detoxing. \n               Wild eyed. He looks through his fingers, but there is no \n               street, no dead man. Just the BARS of his CELL.\n\n                                                                    CUT TO:\n\n               GLASS OF WHISKEY - INT. CYNTHIA'S APARTMENT - NIGHT\n\n               golden liquid caressing the ice. A hand lifts the glass to \n               red lips. The liquid disappears. Cynthia lowers the glass, \n               staring at it.\n\n                                     DIVINCI'S VOICE (FILTERED)\n                         Cynthia... pretty name. What do the \n                         first three letters spell?\n\n               Cynthia suddenly hurls the glass across the room.\n\n               THE GLASS - SLOW MOTIONS\n\n               shatters against the wall. And bits of glass, edges sharp \n               tumble through space like ice.\n\n                                                                    CUT TO:\n\n               INT. POLICE JAIL - CELLBLOCK HALLWAY - DAY\n\n               A GUARD leads a MAN in a dark suit and striped tie down the \n               corridor. He carries a briefcase. Short hair and a beard and \n               wire-rimmed glasses. His name is ELLIOT GOFF.\n\n                                     GUARD\n                         Word is he killed a DEA undercover...\n                              (no response)\n                         Word is he shot him in the face...\n                              (no response)\n                         Word is he signed a confession.\n\n                                     ELLIOT\n                         Word is everyone's entitled to a \n                         defense... no matter how guilty they \n                         are.\n\n               They stop at the cell block door. The guard unlocks the door. \n               INSIDE THE CELL we can see Joe on the floor in fetal position. \n               Shaking from lack of alcohol.\n\n                                     ELLIOT\n                         Oh shit.\n\n                                                                    CUT TO:\n\n               INT. INFIRMARY - DAY\n\n               Elliot waits in the hall. Fingers impatiently drumming his \n               briefcase. The door opens and a DOCTOR exits the room.\n\n                                     DOCTOR\n                         He's detoxing. I gave him something \n                         to help him through it.\n\n                                     ELLIOT\n                         Can I talk to him?\n\n               The doctor nods, opens the door. Elliot enters.\n\n               INT. INFIRMARY - DAY\n\n               Basic first aid station. Joe is on a table. Eyes closed. \n               Elliot walks up. Doctor behind him.\n\n                                     ELLIOT\n                         Joe, can you hear me?\n\n               Joe's eyes open.\n\n                                     ELLIOT\n                         I'm Elliot Goff. I'm your attorney... \n                         Do you understand what I'm saying?\n\n               Joe's eyes close. Leaving Elliot in the dark.\n\n                                                                    CUT TO:\n\n               INT. SMALL COURTROOM - DAY\n\n               Court is in session. Old metropolitan courthouse. The \n               PROSECUTOR and his TEAM are at one table. The DEFENSE ATTORNEY \n               and his CLIENT are at the other.\n\n               The Prosecutor is a woman. Her name is HELEN EDEN. She is \n               thirty-nine. She wears a business suit. RICHARD STEIN is her \n               second in command. Richard is thirty-three.\n\n               The DEFENSE ATTORNEY is fifty and a little on the portly \n               side. His name is JOHN OBLINGER.\n\n               But it's the DEFENDANT that really attracts our attention. \n               His name is CLYDE D. DUNNER. He's done his best to look like \n               a law abiding citizen, but no matter what kind of clothes he \n               wears or how he slicks down his long hair or trims his \n               mustache, this sonuvabitch looks like he'd kill for a nickel. \n               He's on trial for murder. In the first. What a surprise.\n\n               We are in the midst of opening statements. And Helen is \n               keeping the JURY riveted. The presiding Judge is a WOMAN, \n               JUDGE WEINBERG.\n\n                                     HELEN\n                         -- when the defendant, Clyde Dunner, \n                         entered the house of George and Carol \n                         Beaman on Friday night, a .44 caliber \n                         pistol in his hand. He entered the \n                         house with one thing in mind. To \n                         kill George and Carol, the people he \n                         blamed for the break up of his \n                         marriage to Carol's sister, Paula.\n\n               The defendant is hardly listening. His attention is on TWO \n               MEN SITTING BEHIND the prosecution table. And he turns to \n               glare at them. The two men are DETECTIVES RODRIGUEZ and \n               DIVINCI.\n\n               Clyde glares at them as if he'd like to get up right now, \n               walk over to them and cut off their heads. Actually, that's \n               what he's thinking. He mouths \"You die.\"\n\n               Divinci mouths back. \"Fuck you, prick, asshole, dickhead.\" \n               Then he smiles. Clyde boils.\n\n                                     HELEN\n                         George and Carol were watching a \n                         movie when he entered the living \n                         room and opened fire. George was \n                         killed instantly, hit in the face. \n                         Carol died later of three bullet \n                         wounds to her chest.\n\n               John Oblinger, his attorney, catches Clyde's murderous look \n               and instructs him, with a point of his hand, to pay attention \n               to Helen. Clyde reluctantly turns his gaze from Divinci.\n\n                                     HELEN\n                         Then the defendant, in his effort to \n                         cover up the crime, doused them with \n                         lighter fluid and set the house on \n                         fire... Carol was still alive.\n\n               A YOUNG MAN, looking very upset, enters the courtroom, shows \n               i.d. to a GUARD, then makes his way down the aisle. He tries \n               his best to be quiet, not to interrupt Helen's statement.\n\n                                     HELEN\n                         Ladies and gentlemen of the jury we \n                         will prove to you, beyond any \n                         reasonable doubt, that the defendant, \n                         Clyde David Dunner, is guilty of two \n                         counts of murder in the first degree.\n\n               Helen looks at the jury for a beat, then returns to her table.\n\n                                     JUDGE WEINBERG\n                         The defense may now proceed.\n\n               John Oblinger stands to present his side of the case. But \n               our attention stays with Helen as she approaches the table \n               to find her team in an upset. Their conversation is a tense \n               whisper.\n\n                                     RICHARD STEIN\n                         -- Jesus Christ!\n\n                                     YOUNG MAN\n                         -- I don't know where?\n\n                                     RICHARD STEIN\n                         Are you sure?\n\n                                     YOUNG MAN\n                         They looked all over --\n\n                                     HELEN\n                         What's wrong?\n\n                                     RICHARD STEIN\n                         They can't find the murder weapon.\n\n                                     HELEN\n                         What're you talking about?\n\n                                     RICHARD STEIN\n                         Dunner's .44. They can't find the \n                         goddamn gun!\n\n                                     YOUNG MAN\n                         They lost it or something. Misplaced \n                         it, I don't know. They can't find it \n                         anywhere.\n\n                                     HELEN\n                              (no whisper this time)\n                         What?!\n\n               A pause in the court. The judge taps his gavel in anger as \n               we --\n\n                                                                    CUT TO:\n\n               INT. HELEN'S OFFICE - DAY\n\n               Rodriguez, Divinci, Richard Stein, the young man and Helen. \n               Helen is furious.\n\n                                     HELEN\n                         -- I don't have a goddamn case without \n                         the goddamn gun. His fingerprints, \n                         the ballistics, everything! I have \n                         to have the fucking gun or he's gonna \n                         walk. That murdering piece of filth \n                         will go free without the .44. How \n                         could they lose it?!\n\n               Rodriguez and Divinci exchange a look.\n\n                                                                    CUT TO:\n\n               RODRIGUEZ AND DIVINCI - EXT. COURTROOM - DAY\n\n               walking quickly down the steps.\n\n                                     RODRIGUEZ\n                         The Dunner gun, you used the fucking \n                         Dunner gun?!\n\n                                     DIVINCI\n                         This is not my fuck up! Our shooting \n                         was supposed to be gang-related and \n                         unsolved! Only because we tagged a \n                         goddamn undercover cop do we need \n                         the fucking .44 for evidence! \n                         Otherwise, we never woulda needed \n                         it. So don't point your finger at \n                         me!\n\n                                     RODRIGUEZ\n                         Alright, alright... But how are we \n                         supposed to explain how the same gun \n                         was used in two murder cases by two \n                         different killers when it was supposed \n                         to be in police custody?!\n\n                                     DIVINCI\n                         We don't explain it. It's not our \n                         fault they lost the evidence. \n                         Ballistics are already complete in \n                         Dunner's case. All we need is another \n                         gun.\n\n                                                                    CUT TO:\n\n               BRIEFCASE - ALLEY - DAY\n\n               as it opens, revealing a DOZEN different HANDGUNS.\n\n                                     THE GUN SELLER\n                         All my merchandise is in top \n                         condition. Untraceable. The best \n                         money can buy.\n\n               A BLACK MAN in a three piece suit, picks up the .44 with a \n               GLOVED HAND. His accent is British.\n\n                                     THE GUN SELLER\n                         It's got good knock down, but it's \n                         slow. Unless you have a preference \n                         for revolvers, I suggest a nine \n                         millimeter auto. They are more \n                         expensive, but what they cost in \n                         money, they save in time.\n\n               Rodriguez and Divinci look down at the gun.\n\n                                     DIVINCI\n                         The .44.\n\n               The gun seller eyes them for a moment.\n\n                                     RODRIGUEZ\n                         What?\n\n                                     THE GUN SELLER\n                         You look like police.\n\n               Divinci and Rodriguez stare at the gun seller. Then he smiles.\n\n                                     THE GUN SELLER\n                         No offense.\n\n                                                                    CUT TO:\n\n               INT. EVIDENCE ROOM - DAY\n\n               as the NEW .44 goes onto the shelf. CASE NUMBER C-549087.\n\n                                                                    CUT TO:\n\n               INT. JAIL - INTERVIEW ROOM - DAY\n\n               Elliot is waiting, sitting at a table, staring at papers in \n               his open briefcase. Door opens and a GUARD leads Joe into \n               the room. Joe looks better, for the first time. His hair is \n               combed. And he's clean. He wears jail blues. But he is a \n               little gaunt. And tired. Elliot stands. The guard shuts the \n               door, leaving them alone.\n\n                                     ELLIOT\n                         Joe, I'm Elliot, we met the other... \n                         well, you weren't in very good shape. \n                         You look much better.\n\n               Joe just stares at Elliot.\n\n                                     ELLIOT\n                         Have a chair. We need to talk.\n\n                                     WILLIAM\n                         About what I did.\n\n                                     ELLIOT\n                         Yes.\n\n               Joe crosses to the table and takes a chair opposite Elliot.\n\n                                     ELLIOT\n                         Joe, before we get into what happened \n                         that night, I'd like to check a couple \n                         of things first.\n                              (looks at papers)\n                         Joe is your first name, I assume \n                         Joseph?\n\n                                     WILLIAM\n                         Okay.\n\n               Okay? Not the answer Elliot was looking for.\n\n                                     ELLIOT\n                         What about Doe? Is that what you \n                         told the officers your last name \n                         was?\n\n                                     WILLIAM\n                         I don't think so.\n\n                                     ELLIOT\n                         What did you tell them your last \n                         name was?\n\n                                     WILLIAM\n                         I don't remember.\n\n                                     ELLIOT\n                         Well, is Doe your last name?\n\n                                     WILLIAM\n                         I'm not sure.\n\n               Elliot stares at Joe. This is going to be a little more \n               difficult than he thought.\n\n                                     ELLIOT\n                         Do you know what your last name is?\n\n                                     WILLIAM\n                         I don't remember.\n\n                                     ELLIOT\n                         Joe, I'm your attorney, I'm here to \n                         help you. It doesn't matter if you \n                         give the court your last name or \n                         not, they will still put you on trial. \n                         Do you understand?\n\n                                     WILLIAM\n                         Yes.\n\n                                     ELLIOT\n                         So there's no reason to try and hide \n                         your identity.\n                              (Joe nods)\n                         What is your last name?\n\n                                     WILLIAM\n                         I would tell you if I could remember.\n\n                                     ELLIOT\n                         Joe Smith, Joe Jones, Joe DiMaggio...\n\n               Elliot hopes he can trigger a response. Joe tries hard.\n\n                                     WILLIAM\n                         ...I don't think so.\n\n                                     ELLIOT\n                         Okay. Look, we'll move on. You \n                         understand the charges against you. \n                         They're serious. And if you are found \n                         guilty, you could go to prison for a \n                         very long time.\n\n                                     WILLIAM\n                         Maybe I should.\n\n                                     ELLIOT\n                         What?\n\n                                     WILLIAM\n                         Go to prison. I killed him. I didn't \n                         mean to. But he was going to hit me.\n\n                                     ELLIOT\n                         Yes, I know, I read your confession. \n                         Joe, if you really felt your life \n                         was in danger, we might be able to \n                         use self-defense as our argument. \n                         But before we get into that... Do \n                         you have any family, Joe? Any friends?\n\n                                     WILLIAM\n                         I don't think so.\n\n                                     ELLIOT\n                         Joe... do you know what a psychiatrist \n                         is?\n\n                                     WILLIAM\n                         Yes.\n\n                                     ELLIOT\n                         Have you ever seen a psychiatrist?\n\n                                     WILLIAM\n                         ...I'm not sure.\n\n                                     ELLIOT\n                         Joe, you don't remember much about \n                         yourself.\n\n                                     WILLIAM\n                         No.\n\n                                     ELLIOT\n                         ...but you remember the night you \n                         shot the man in the car.\n\n                                     WILLIAM\n                         Yes.\n\n                                     ELLIOT\n                         Why?\n\n                                     WILLIAM\n                         ...because... I can... I'm sorry, \n                         I'm not much help.\n\n               Elliot stares at Joe, then looks down at the blank page in \n               front of him.\n\n                                                                    CUT TO:\n\n               INT. SMALL COURTROOM - DAY\n\n               The trial of Clyde D. Dunner in progress. Prosecution team \n               at their table. Defense team at their table. JUDGE WEINBERG \n               at the bench. Divinci on the stand. Clyde glaring at him. \n               And Jury listening to Helen on the floor, prosecuting with \n               vigor.\n\n                                     HELEN\n                         -- and when you approached the suspect \n                         in his apartment, did you identify \n                         yourself as a police officer?\n\n                                     DIVINCI\n                         Yes.\n\n                                     HELEN\n                         Did the suspect respond?\n\n                                     DIVINCI\n                         Yes, he did?\n\n                                     HELEN\n                         In what way?\n\n                                     DIVINCI\n                         He started shooting through the door.\n\n                                     HELEN\n                         The Defendant fired six times, until \n                         his gun was empty. We would like to \n                         show you the weapon he used.\n\n               Helen crosses to the prosecution table, picks up the .44. \n               She holds it up for the jury to see.\n\n                                     HELEN\n                         And we would like to enter it into \n                         court records. It was the same Smith \n                         and Wesson revolver he used to \n                         viciously murder George and Carol \n                         Beaman.\n\n               The .44 is duly entered into the records.\n\n               CLYDE\n\n               glances at \"his\" .44 as it passes into the BAILIFF'S HANDS. \n               It's a .44 all right.\n\n                                     HELEN\n                         The prosecution would like to call \n                         Mr. Steven J. Allen to the stand.\n\n                                     BAILIFF\n                         Steven J. Allen.\n\n               STEVEN J. ALLEN, a short balding bespectacled man in his \n               fifties, crosses to the witness box where he is sworn in, \n               then sits.\n\n                                     HELEN\n                         Mr. Allen, would tell the court what \n                         you do.\n\n                                     STEVEN J. ALLEN\n                         I am a lab technician for the police \n                         department. One of my duties is to \n                         examine weapons used in violent \n                         crimes.\n\n               Clyde's attention is on Helen's LEGS. He's bored by the \n               proceedings, but something suddenly strikes him. He looks at --\n\n               THE .44 SMITH AND WESSON\n\n               -- on the evidence table. There is no BLACK STAIN on the \n               handle.\n\n                                     STEVEN J. ALLEN\n                         I tested the defendant's revolver \n                         and matched the bullets fired to the \n                         bullets removed from the deceased.\n\n                                     CLYDE\n                         That ain't my gun.\n\n               All attention turns to Clyde. His attorney, the judge, the \n               jury, Helen, everybody is surprised by the sudden statement.\n\n                                     JUDGE WEINBERG\n                         I must remind the defendant that he \n                         is not to speak out when --\n\n                                     CLYDE\n                         That ain't my gun!\n\n               The Judge taps her gavel. John Oblinger puts a hand on Clyde's \n               arm. Clyde pulls it away. And now things happen very fast.\n\n                                     CLYDE\n                         THAT AIN'T MY FUCKIN' GUN!\n\n               And Clyde is moving toward the gun. And the Bailiff and GUARDS \n               are moving toward Clyde. And Helen is moving out of the way. \n               And the Judge is standing, banging her gavel. And the jury \n               is scared.\n\n                                     CLYDE\n                         YOU'RE TRYIN' TO FUCKIN' FRAME ME!\n\n               Clyde grabs for the gun as the bailiff and guards grab for \n               Clyde. Clyde turns and decks the bailiff and all hell breaks \n               lose.\n\n                                     CLYDE\n                         IT AIN'T MY FUCKIN' GUN!\n\n                                                                    CUT TO:\n\n               INT. MEN'S ROOM - DAY\n\n               Door slams open. Rodriguez and Divinci enter. Rodriguez \n               quickly checks all the stalls as Divinci closes the door. \n               They are alone. When Rodriguez finishes with the stalls --\n\n                                     RODRIGUEZ\n                         We gotta put the right gun back.\n\n                                     DIVINCI\n                         We can't put the right gun back! \n                         Without that gun, they won't convict \n                         Joe.\n\n                                     RODRIGUEZ\n                         Without that gun they won't convict \n                         Clyde!\n\n                                     DIVINCI\n                         I'm not worried about Clyde, I'm \n                         worried about us!\n\n                                     RODRIGUEZ\n                         Look, Joe's never goin' to trial, \n                         right. He signed a goddamn confession! \n                         Like you said, this one is open and \n                         shut. Clyde's the one we gotta worry \n                         about. We can't let him go back on \n                         the street! He's a fuckin' psychopath. \n                         He'll kill somebody again.\n\n                                     DIVINCI\n                         Shit. How the hell did that piece of \n                         puke know it wasn't his fuckin' gun?! \n                         I don't think he knows his own fuckin' \n                         mother, but he knows his fuckin' \n                         gun!\n\n                                     RODRIGUEZ\n                         I don't think that's important right \n                         now.\n\n                                                                    CUT TO:\n\n               INT. EVIDENCE ROOM - DAY\n\n               The harried Desk Officer is filling out his usual paper work \n               when Divinci and Rodriguez approach. Divinci knocks on the \n               door. The desk officer looks up. He's had a tough day.\n\n                                     DESK OFFICER\n                         Sorry, Divinci, can't do it.\n\n                                     DIVINCI\n                         What d'you mean you can't do it? I \n                         gotta check something.\n\n                                     DESK OFFICER\n                         You gotta get written permission \n                         from the Chief.\n\n                                     RODRIGUEZ\n                         Since when?!\n\n                                     DESK OFFICER\n                         Since an hour ago when he came down \n                         here and chewed me a new asshole \n                         bigger than a three car garage.\n\n                                     DIVINCI\n                         What's the problem?\n\n                                     DESK OFFICER\n                         Something about missing evidence or \n                         who the hell knows. I just wanna \n                         transfer the hell outa here.\n\n                                     DIVINCI\n                         What the hell're we supposed to do?!\n\n                                     DESK OFFICER\n                         Ask the chief. Policy ain't my \n                         department!\n\n                                                                    CUT TO:\n\n               INT. SMALL COURTROOM - DAY\n\n               Joe's preliminary trial. Joe is seated at the defense table \n               with Elliot. ANOTHER JUDGE, JUDGE HAROLD PINE, is behind the \n               bench. No jury. This is a preliminary hearing to determine \n               if there's enough evidence for Joe to stand trail. Elliot is \n               shuffling papers in preparation for his opening.\n\n               And at the prosecution table is a very tired Helen. She looks \n               completely pissed off and worn out. In no mood for anything \n               to go wrong.\n\n                                     JUDGE HAROLD PINE\n                         Whenever you're ready.\n\n               Elliot stands.\n\n                                     ELLIOT\n                         We would like to plead not guilty to \n                         the charge of murder at this time \n                         for reason of Insanity.\n\n               Helen gives Elliot a look. She doesn't need this.\n\n                                     WILLIAM\n                         But I did it.\n\n               Elliot turns to Joe.\n\n                                     ELLIOT\n                         Yes, Joe. Let me handle this.\n\n                                     WILLIAM\n                         But I signed the confession.\n\n                                     ELLIOT\n                         Yes, Joe. Don't worry about it. I'm \n                         the attorney.\n\n                                     HELEN\n                         Your honor, can we have a moment?\n\n                                     JUDGE HAROLD PINE\n                         Council may approach the bench.\n\n               Helen and Elliot cross to the bench.\n\n                                     HELEN\n                         Your honor, my colleague's client \n                         admits to the killing. I don't see \n                         any reason to go through a trial \n                         when it's obvious he would like to \n                         plead guilty.\n\n                                     ELLIOT\n                         I don't agree.\n\n                                     HELEN\n                         If he wants to plead guilty, you \n                         have to let him plead guilty.\n\n                                     ELLIOT\n                         Not if he's not of sound mind.\n\n                                     HELEN\n                         Come on, Elliot!\n\n                                     ELLIOT\n                         I think he's crazy. I know you think \n                         he's just putting it on, that's D.A. \n                         standard procedure, but I don't think \n                         he is. So, your honor, I'm standing \n                         by the not guilty because I believe \n                         he's incapable of making that \n                         judgment.\n\n                                     JUDGE HAROLD PINE\n                         Have you had a psychiatrist look at \n                         him?\n\n                                     ELLIOT\n                         Yes, your honor.\n                              (hands him papers)\n                         I think you'll see that my diagnosis \n                         is not without warrant.\n\n               The judge hesitates, then looks at Joe. Joe is staring at \n               him.\n\n                                     JUDGE HAROLD PINE\n                         I'll review the findings and make my \n                         decision tomorrow.\n\n                                     ELLIOT\n                         Thank you, your honor.\n                              (to Helen)\n                         Besides, I hear there's a good chance \n                         of beating the charges for lack of \n                         evidence.\n\n               Helen's look turns icy.\n\n                                                                    CUT TO:\n\n               INT. ETHNIC BAR/RESTAURANT - DAY\n\n               Dark, smoky. Not a place for the health-conscious. Rodriguez \n               and Divinci at a corner booth. Both with scotch and waters.\n\n                                     DIVINCI\n                         Nobody can connect us to the evidence \n                         thing... we're clean there.\n\n               Rodriguez is quiet.\n\n                                     DIVINCI\n                         The most important one is this DEA \n                         mess anyway. Once that's finished, \n                         we're completely in the clear.\n\n                                     RODRIGUEZ\n                         You know we can't do it anymore.\n\n                                     DIVINCI\n                         ...yeah, I guess.\n\n                                     RODRIGUEZ\n                         No, we're through. That's it.\n\n                                     DIVINCI\n                         Good while it lasted though. A hundred \n                         grand apiece. Not bad for a few nights \n                         work.\n\n               Divinci lifts his glass in a toast to himself, drinks.\n\n                                     RODRIGUEZ\n                         I just wanna get through this.\n\n                                     DIVINCI\n                         We're gonna get through it. No \n                         evidence problems on this one.\n\n                                     RODRIGUEZ\n                         I hope not... I don't know, Frank, \n                         lately I been thinkin'... maybe what \n                         we did wasn't such a good idea.\n\n                                     DIVINCI\n                         Hey, we took out a few scumbags, \n                         that's it. Nobody's ever gonna miss \n                         those shitheels. They were all pieces \n                         of garbage. Not one of 'em had a \n                         sheet less than a mile long. Drugs, \n                         extortion, assault. They were all \n                         fuckin' guilty as hell and still on \n                         the street, you know that.\n\n                                     RODRIGUEZ\n                         Except the cop.\n\n                                     DIVINCI\n                         Yeah, except the cop. That's part of \n                         the job. Could just as easily have \n                         happened to you or me.\n\n                                     RODRIGUEZ\n                         But we're cops, you know? We fucked \n                         up.\n\n                                     DIVINCI\n                         We fucked up once. Once outa ten. \n                         That's not bad.\n                              (a beat)\n                         I'm sorry, okay? I'm sorry. He was \n                         in the wrong place at the wrong time, \n                         what can I say. I'm not goin' down \n                         for it.\n\n                                     RODRIGUEZ\n                         I know.\n\n                                     DIVINCI\n                         Look, if we got paid a decent salary \n                         we wouldn't be tempted by this, right? \n                         And what happens when we retire? You \n                         think our pension's gonna take care \n                         of us? Shit no. We are on our own. I \n                         mean all I want in life is a goddamn \n                         fishing boat, a beach, a couple drinks \n                         and some Hawaiian fuckin' music. \n                         That ain't much for twenty years \n                         putting murdering assholes behind \n                         bars. I mean, the dealers, the pimps, \n                         the killers, they got no rules. We \n                         got all the fuckin' rules. It ain't \n                         fair. That's all I'm sayin', it ain't \n                         fair... For awhile, we made it fair.\n\n               Rodriguez downs his scotch.\n\n                                     DIVINCI\n                         Quit thinkin' you're a bad guy. You're \n                         not a fuckin' bad guy. You made one \n                         mistake. Let it go.\n\n               Rodriguez nods. A WAITRESS comes to the table. Rodriguez \n               orders another. The Waitress leaves. Rodriguez hesitates a \n               moment, then --\n\n                                     RODRIGUEZ\n                         Do you think we're corrupt?\n\n                                     DIVINCI\n                         Hey, I never took a fuckin' bribe in \n                         my life.\n\n                                     RODRIGUEZ\n                         Me either.\n\n                                     DIVINCI\n                         Nobody ever bought me.\n\n                                     RODRIGUEZ\n                         I know.\n\n                                     DIVINCI\n                         No fuckin' way. Even the thought \n                         makes me sick. And what we did has \n                         nothing to do with being corrupt. \n                         It's two completely different things. \n                         Don't get 'em confused.\n\n                                     RODRIGUEZ\n                         I guess you're right.\n\n                                     DIVINCI\n                         I'm telling you. It's nothin' to do \n                         with corrupt.\n\n                                     RODRIGUEZ\n                         I'm worried, that's all.\n\n                                     DIVINCI\n                         Hey, you gotta worry a little. It's \n                         natural. Just don't lose your sense \n                         of humor.\n\n                                     RODRIGUEZ\n                         My sense of humor, right.\n\n                                     DIVINCI\n                         The problem with people is, nobody \n                         gives a shit about makin' the world \n                         a better place. You and me, I don't \n                         care what anybody says, we made the \n                         world a better place. No matter what \n                         happens. There are ten less drug \n                         dealin' assholes on the street today \n                         because of us. They're not plea \n                         bargainin' their way back onto the \n                         street, they're not clogging up the \n                         courts, and they're not costing the \n                         tax payers a fuckin' penny because \n                         they're not in prison. They were \n                         garbage. And there's nothin' wrong \n                         with takin' out the garbage.\n\n               Divinci downs his scotch. Rodriguez nods, then --\n\n                                     RODRIGUEZ\n                         So, you think you'll get back with \n                         Caroline?\n\n                                     DIVINCI\n                         Shit. Nothin' I ever do is good \n                         enough, you know?\n\n                                     RODRIGUEZ\n                         Never is, never was, never will be.\n\n                                     DIVINCI\n                         Guess I gotta make the effort. It's \n                         gonna cost me if I don't.\n\n                                     RODRIGUEZ\n                         Tell me about it. You know how much \n                         I got left.\n\n                                     DIVINCI\n                         You're gonna think I'm an idiot, \n                         but... I like Cynthia. There's no \n                         bullshit with her. I just fuckin' \n                         like her.\n\n                                     RODRIGUEZ\n                         I think you just like fuckin' her.\n\n               Rodriguez smiles. Divinci looks at him for a beat, then --\n\n                                     DIVINCI\n                         Yeah, that, too.\n\n                                                                    CUT TO:\n\n               NEWSPAPER - INT. CYNTHIA'S APARTMENT - DAY\n\n               with JOE'S PHOTOGRAPH on the front page. HEADLINE: UNDERCOVER \n               COP GUNNED DOWN BY UNDERCOVER KILLER. We PAN AROUND to \n               Cynthia, sitting in her kitchen, staring at the photograph.\n\n                                     CYNTHIA\n                         What the hell, Joe, at least you \n                         won't get run over.\n\n               She folds up the paper and throws it in the trash can.\n\n                                                                    CUT TO:\n\n               INT. SMALL COURTROOM - DAY\n\n               The Dunner trial. The JURY is back. Helen, Judge Weinberg, \n               Clyde D. Dunner (who now sports a couple bandages to his \n               head), his attorney John Oblinger -- they're all waiting for \n               the verdict.\n\n                                     JUDGE WEINBERG\n                         The defendant will stand and face \n                         the jury.\n\n               Clyde stands.\n\n                                     JUDGE\n                         What is your verdict?\n\n                                     JURY FOREMAN\n                         We find the defendant, Clyde David \n                         Dunner, not guilty.\n\n               Helen closes her eyes in defeat. Clyde smiles.\n\n                                     CLYDE\n                         Fuckin' A!\n\n                                                                    CUT TO:\n\n               INT. HOMICIDE DIVISION - DAY\n\n               Divinci is on the phone.\n\n                                     DIVINCI\n                         -- when was the last time you saw \n                         him? -- Uh-huh -- And you haven't \n                         seen him since then?\n\n               Rodriguez suddenly strides up. He looks panicked.\n\n                                     RODRIGUEZ\n                         We gotta talk.\n\n                                     DIVINCI\n                              (into phone)\n                         Just a second.\n                              (covers phone)\n                         Calm down. I heard. Clyde walked.\n\n                                     RODRIGUEZ\n                         No!\n                              (leans in close)\n                         They're takin' Joe to trial.\n\n               Divinci stares at Rodriguez for a beat, the reality of his \n               statement taking a moment to fully slam home.\n\n                                     RODRIGUEZ\n                         They found him mentally unable to \n                         plead so his attorney pleaded not \n                         guilty by reason of insanity.\n\n                                     DIVINCI\n                         You gotta be kiddin' me.\n\n                                     RODRIGUEZ\n                         Yeah, that's me, I love to make people \n                         laugh. You hear the one about the \n                         two cops who popped the undercover \n                         DEA?\n\n                                                                    CUT TO:\n\n               INT. STRIP JOINT - NIGHT\n\n               Cynthia on stage, in the middle of her routine. Hoots and \n               whistles from the all MALE CROWD. But she's not really into \n               her performance tonight. She pulls off the last of her \n               clothing to APPLAUSE and CHEERS.\n\n               INT. DRESSING ROOM - NIGHT\n\n               Cynthia enters. An ASIAN MAN in sweat shirt and jeans is \n               sitting in the room.\n\n                                     CYNTHIA\n                         Who the hell're you and what the \n                         fuck are you doing in here?!\n                              (calls down hall)\n                         HEY, BOB, I GOT AN ASSHOLE IN THE \n                         DRESSING ROOM.\n                              (to the man)\n                         I suggest you get out before Bob \n                         gets here. He doesn't like assholes.\n\n                                     ASIAN MAN\n                         You're Cynthia Webb.\n\n                                     CYNTHIA\n                              (calls down hall)\n                         BOB!\n\n               The Asian Man stands.\n\n                                     ASIAN MAN\n                         But you are Cynthia Webb the famous \n                         dancer, yes?\n\n                                     CYNTHIA\n                         Yeah, yeah, nice try, get out.\n\n               The man moves toward her, pulling a PAPER from his pocket. \n               He hands it to her.\n\n                                     ASIAN MAN\n                         I liked your show very much.\n\n                                     CYNTHIA\n                         What the hell's this?!\n\n               He exits. No answer. Cynthia stares at the paper --\n\n                                     CYNTHIA\n                         A subpoena?! For what?! I didn't do \n                         anything!\n\n               But the man is gone. BOB, a HUGE BOUNCER, tears past, giving \n               chase.\n\n                                     CYNTHIA\n                              (staring at paper)\n                         Oh shit... oh shit. He served me! He \n                         fuckin' served me!\n\n                                                                    CUT TO:\n\n               INT. BEDROOM - NIGHT\n\n               Dark, quiet. PHONE RINGS. A hand picks up the phone.\n\n                                     MAN'S VOICE\n                         Hello.\n\n                                     ANOTHER MAN'S VOICE\n                         Detective Divinci?\n\n                                     DIVINCI\n                         Yeah.\n\n                                     ANOTHER MAN'S VOICE\n                         This is Sergeant Gardner down at the \n                         station.\n\n               INTERCUT WITH SERGEANT - INT. HOMICIDE DIVISION - NIGHT\n\n               The station is alive with activity. Even at this early hour. \n               HOOKERS, PIMPS, PUSHERS, DRUNK DRIVERS. Some being booked, \n               some being released, some being obnoxious.\n\n                                     SERGEANT GARDNER\n                         Sorry to call so late, but I got a \n                         hysterical woman here says she needs \n                         to talk to you about a murder.\n\n               Divinci turns on the light revealing a WOMAN in bed with \n               him. He picks up his watch, looks at the time.\n\n                                     SERGEANT GARDNER\n                         I told her I couldn't call you at \n                         home, but she said that it was very \n                         important. A matter of, you know, \n                         life and death.\n\n                                     DIVINCI\n                         What's her name?\n\n                                     SERGEANT GARDNER\n                         Cynthia.\n\n               Divinci perks up at the name.\n\n               And now we SEE Cynthia in the POLICE STATION trying not to \n               look as freaked out as she feels. But she's not holding \n               together well.\n\n                                     DIVINCI\n                         Tell her to wait, I'll be right down.\n\n               Divinci hangs up. Starts to dress. The woman groans.\n\n                                     WOMAN\n                         What the hell're you doing?\n\n                                     DIVINCI\n                         I gotta go down to the station.\n\n                                     WOMAN\n                         Now? What time is it?\n\n                                     DIVINCI\n                         Go back to sleep.\n\n                                     WOMAN\n                         Frank, this is no way to repair our \n                         marriage, you know?\n\n               She pulls the covers over her head. Divinci pulls on his \n               pants.\n\n                                                                    CUT TO:\n\n               INT. POLICE STATION - 3:38 A.M.\n\n               Divinci pushes into the room. Sees Cynthia sitting on the \n               bench, looking nervous as hell. Smoking, tapping her foot, \n               looking around. Just this side of a wreck.\n\n                                     DIVINCI\n                         Hey!\n\n               Cynthia sees him and is immediately on her feet, moving to \n               him.\n\n                                     CYNTHIA\n                         Frank, I can't do this. He came to \n                         the club. You gotta --\n\n                                     DIVINCI\n                         Not here!\n\n               He takes her arm, leads her out of the station.\n\n               INT. POLICE STATION PARKING GARAGE - NIGHT\n\n               Divinci leads Cynthia out of the station to his car.\n\n                                     CYNTHIA\n                         I thought you said all I had to do \n                         was pick him out?! That's what you \n                         said, that's all I had to do. I did \n                         what you said. But that was supposed \n                         to be all.\n\n                                     DIVINCI\n                         SHUT UP!\n\n               He opens the driver's door, pushes her in. Gets in behind \n               her.\n\n               INT. UNMARKED CAR - NIGHT\n\n               Cynthia is a bundle of nerves. Divinci slams the door. Cynthia \n               is startled by the suddenness of his anger.\n\n                                     DIVINCI\n                         What're you talkin' about?\n\n               Cynthia opens her purse and pulls out the subpoena.\n\n                                     CYNTHIA\n                         They want me in court.\n\n               Divinci glances at the papers.\n\n                                     CYNTHIA\n                         You promised me I wasn't gonna have \n                         to do anything! What the hell is \n                         goin' on?!\n\n               This is yet another glitch that Divinci hadn't counted on.\n\n                                     CYNTHIA\n                         I can't do this, Frank. I can't go \n                         into court. I'm gettin' outa here!\n\n                                     DIVINCI\n                         You are not getting outa here!\n\n                                     CYNTHIA\n                         Well I can't go to court! THAT'S NOT \n                         WHAT YOU SAID I'D HAVE TO DO!\n\n                                     DIVINCI\n                         WELL THIS WASN'T SUPPOSED TO HAPPEN! \n                         NOW JUST FUCKIN' CALM DOWN FOR A \n                         SECOND AND LET ME THINK!\n\n               Cynthia glares at him, then turns away, takes a drag and \n               blows out the smoke.\n\n                                     CYNTHIA\n                         Fine. Think away.\n\n               Divinci hesitates as ANOTHER CAR pulls out. Then turns to \n               her.\n\n                                     DIVINCI\n                         Look, you're a witness, that's all. \n                         You got nothin' to worry about. You \n                         saw something happen --\n\n                                     CYNTHIA\n                         -- What?! What did I see?!\n\n                                     DIVINCI\n                         I will tell you everything you gotta \n                         know. You understand? Everything. \n                         You will know exactly what to say.\n\n               Cynthia looks at Divinci, unsure. Divinci gives her a \n               confident smile. Look, it's another stage, that's all. Just \n               like dancin'.\n\n               THE UNMARKED CAR\n\n               pulls quickly out of the PARKING GARAGE.\n\n                                                                    CUT TO:\n\n               INT. JAIL - MEETING ROOM - DAY\n\n               Elliot is waiting. The guard opens the door and Joe enters. \n               Joe is looking better. Getting him off booze has helped \n               immensely.\n\n                                     ELLIOT\n                         Hi, Joe. You're looking much better.\n\n                                     WILLIAM\n                         I guess jail's been good for me.\n\n               Elliot nods, motions for Joe to take a chair.\n\n                                     ELLIOT\n                         Trial date's been set for Thursday.\n\n                                     WILLIAM\n                         I've been thinking about what I did... \n                         and I don't think it's right that I \n                         try getting off.\n\n                                     ELLIOT\n                         Excuse me?\n\n                                     WILLIAM\n                         I want to plead guilty. I killed a \n                         man and I should be punished.\n\n                                     ELLIOT\n                         ...I'm a little surprised.\n\n                                     WILLIAM\n                         Why?\n\n                                     ELLIOT\n                         Nobody ever wants to be punished for \n                         what they've done. It's just a new \n                         concept. But I still think our defense \n                         is reasonable. I don't believe, under \n                         the condition you were in, that you \n                         were responsible for your actions.\n\n                                     WILLIAM\n                         But why was I carrying a gun? I had \n                         no right to carry a gun.\n\n                                     ELLIOT\n                         If you hadn't been carrying the gun, \n                         you might be dead.\n\n                                     WILLIAM\n                         And he might be alive.\n\n                                     ELLIOT\n                         I understand... Can I think about \n                         this?\n\n                                     WILLIAM\n                         No. I've made up my mind.\n\n               Elliot stares at Joe for a beat, then we --\n\n                                                                    CUT TO:\n\n               YELLOW CRIME SCENE TAPE - EXT. APARTMENT BUILDING - DAY\n\n               TWO MURDER VICTIMS lying in the street. POLICE OFFICERS have \n               the area under control. A few CURIOUS PEOPLE have stopped to \n               watch. An UNMARKED CAR pulls up. Stops.\n\n               INT. UNMARKED CAR - DAY\n\n               Parked. Rodriguez behind the wheel. Divinci next to him.\n\n                                     RODRIGUEZ\n                         What if she takes off?\n\n                                     DIVINCI\n                         Then we got no goddamn witness puts \n                         him at the scene.\n\n                                     RODRIGUEZ\n                         And what happens if she testifies \n                         and nobody fuckin' believes her?\n\n                                     DIVINCI\n                         Perjury, maybe. But that's a fifty \n                         fifty. They might believe her.\n\n                                     RODRIGUEZ\n                         Shit, Frank, she's a goddamn stripper \n                         for Chrissake, who's gonna believe \n                         her. I don't believe her when she's \n                         telling the truth!\n\n               An OFFICER walks to the car and knocks on the window. Divinci \n               rolls it down.\n\n                                     DIVINCI\n                         What?\n\n                                     OFFICER\n                         Ahh, we got two bodies out here and \n                         three more in the house.\n\n                                     DIVINCI\n                         So?\n\n                                     OFFICER\n                         I was just wondering if you were \n                         gonna be the primary on this one, \n                         that's all.\n\n                                     DIVINCI\n                         Yeah, yeah, we're comin'. Just give \n                         us some room.\n\n               Divinci rolls the window back up. The officer backs off.\n\n                                     RODRIGUEZ\n                         She could blow the whole thing. She \n                         could tie us in and that would be \n                         it. We'd be fuckin' fried.\n\n                                     DIVINCI\n                         If it looks like she's gonna crumble \n                         we'll take steps.\n\n                                     RODRIGUEZ\n                         What steps?\n\n               Divinci looks at Rodriguez.\n\n                                     DIVINCI\n                         One more chalk outline more or less \n                         in this city who's gonna know?\n\n                                     RODRIGUEZ\n                         Oh shit, Frank.\n\n                                     DIVINCI\n                         Hey, hey, you think I like this?!\n\n                                     RODRIGUEZ\n                         We just can't go around killin' \n                         everybody!\n\n                                     DIVINCI\n                         Just a second. Look around. Whatta \n                         we got here? Two stiffs on the street, \n                         shot to shit, three more inside. \n                         That's five chalk lines in one night \n                         in one deal in one neighborhood in \n                         one city. Let me fill you in on some \n                         statistics, we're not killin' \n                         everybody.\n                              (a beat, then --)\n                         Look, this is strictly last resort. \n                         Okay? But let's not kid ourselves. \n                         If push comes to shove, somebody has \n                         to go down. If you got another \n                         candidate, I'm willin' to listen.\n\n               Rodriguez is silent. Divinci opens the door. Rodriguez watches \n               him, then he follows. To the scene of another crime.\n\n                                                                    CUT TO:\n\n               INT. CYNTHIA'S APARTMENT - DAY\n\n               Cynthia is in the kitchen, making herself a peanut butter \n               and jelly sandwich as she watches Sally Jesse Raphael \n               interview yet another moron on television. The phone rings. \n               She takes a bite of the sandwich as she picks up and mumbles --\n\n                                     CYNTHIA\n                         Hello.\n\n               INTERCUT WITH INT. OFFICE - D.A.'S DEPARTMENT - DAY\n\n               Richard Stein, the attorney, is on the phone. His office is \n               cluttered with the myriad of case files he's forced to juggle.\n\n                                     RICHARD STEIN\n                         Cynthia Webb?\n\n                                     CYNTHIA\n                              (swallows)\n                         ...yeah.\n\n                                     RICHARD STEIN\n                         I'm Richard Stein with the District \n                         Attorney's office. You're a witness \n                         in a case we're handling and I'd \n                         like to talk to you as soon as \n                         possible.\n\n               Cynthia puts down the sandwich, her appetite suddenly gone.\n\n                                     RICHARD STEIN\n                         Ms Webb?\n\n                                     CYNTHIA\n                         Yeah.\n\n                                     RICHARD STEIN\n                         Any chance we could get together \n                         today?\n\n                                     CYNTHIA\n                              (nervous)\n                         I'm ah... pretty busy.\n\n                                     RICHARD STEIN\n                         It won't take long. Will you be home \n                         about two?\n                              (no answer)\n                         Ms Webb?\n\n                                     CYNTHIA\n                         Yeah, okay... two.\n\n                                     RICHARD STEIN\n                         Good. Let me make sure I've got your \n                         correct address.\n\n                                                                    CUT TO:\n\n               SUITCASE - INT. CYNTHIA'S BEDROOM - DAY\n\n               as clothes are stuffed into it. The suitcase is slammed shut. \n               And Cynthia heads for the door.\n\n                                                                    CUT TO:\n\n               EXT. MANSION - DAY\n\n               A BLACK CONVERTIBLE MERCEDES pulls into the circular, gated \n               drive of the large two story home on immense manicured \n               grounds. A BMW is parked in front of the FOUR CAR GARAGE. It \n               is being waxed by car care specialists. The Mercedes stops \n               and a MAN gets out. He has gray hair and expensive clothes. \n               He carries a briefcase and heads for the front door. His \n               name is ARTHUR BAYLOR.\n\n               EXT. MANSION - PATIO - DAY\n\n               A BUTLER shows Arthur to the patio where another MAN, NATHAN \n               MCCALL, is seated behind a table, reviewing documents. McCall \n               is fifty-five, wears glasses.\n\n                                     BUTLER\n                         Mr. Baylor is here.\n\n               McCall looks up, smiles.\n\n                                     WILLIAM\n                         Arthur.\n\n               Arthur crosses. The two men shake hands.\n\n                                     ARTHUR\n                         Nathan. How are you?\n\n                                     WILLIAM\n                         Good, Arthur, thanks. Would you like \n                         some coffee, juice.\n\n                                     ARTHUR\n                         No, I'm fine.\n\n                                     WILLIAM\n                         Well, this is all a bit of a mystery. \n                         You certainly got my attention with \n                         your phone call. What's this all \n                         about?\n\n               Arthur removes a NEWSPAPER from his briefcase. Opens it. \n               Revealing the PHOTOGRAPH OF JOE and the headline: UNDERCOVER \n               COP GUNNED DOWN BY UNDERCOVER KILLER. McCall looks at the \n               paper.\n\n                                     WILLIAM\n                         Is there something you want me to \n                         see?\n\n               Arthur points at the photograph. McCall looks. A beat, then --\n\n                                     WILLIAM\n                         Oh my God.\n\n                                                                    CUT TO:\n\n               INT. BUS STATION - DAY\n\n               Cynthia boards a greyhound. Getting the hell out of Dodge.\n\n                                                                    CUT TO:\n\n               INT. CYNTHIA'S APARTMENT - DAY\n\n               We HEAR a key in the lock. The door opens and Divinci enters. \n               He looks around.\n\n                                     DIVINCI\n                         Cynthia.\n\n               He moves into the bedroom. Sees clothes strewn around and a \n               half empty closet.\n\n                                     DIVINCI\n                         Shit!\n\n               He heads back into the living room. Pulls open the door and \n               almost runs into Richard Stein who was just about to knock.\n\n                                     DIVINCI\n                              (startled)\n                         Jesus!\n\n               Richard Stein is just as startled and it takes him a moment \n               to recognize --\n\n                                     RICHARD STEIN\n                         Divinci?\n\n               Divinci is caught off guard.\n\n                                     RICHARD STEIN\n                         Richard Stein, D.A.'s office.\n\n                                     DIVINCI\n                         Oh, yeah, sorry. I didn't expect -- \n                         what're you doing here?\n\n                                     RICHARD STEIN\n                         I have to talk with Cynthia Webb. A \n                         witness in -- well, wait, aren't you \n                         and Detective Rodriguez on this one?\n\n                                     DIVINCI\n                              (vamping)\n                         Yeah, yeah, that's why I'm here. I \n                         wanted to go over some of the details.\n\n                                     RICHARD STEIN\n                         Me, too. Is she there?\n\n                                     DIVINCI\n                         No.\n\n                                     RICHARD STEIN\n                         I was supposed to meet her at two.\n                              (looks at watch)\n                         Do you know her?\n\n                                     DIVINCI\n                         What d'you mean?\n\n                                     RICHARD STEIN\n                         Well, I just mean, if she's not \n                         here... you were...\n                              (a little awkward)\n                         ...inside.\n\n                                     DIVINCI\n                              (forces a smile)\n                         Oh, yeah, the legal thing. Well, \n                         she's a witness in a murder case. \n                         And when they don't answer a knock \n                         and the door's open, it's my \n                         experience, you know. I like to make \n                         sure there's no dead bodies layin' \n                         around.\n                              (pulls door shut)\n                         Don't tell on me.\n\n                                     RICHARD STEIN\n                         No, no, of course not... Well, maybe \n                         I should wait. She might be stuck in \n                         traffic or something.\n\n                                     DIVINCI\n                         Yeah. If she shows up, let me know. \n                         I'd like to talk to her, too.\n\n                                     RICHARD STEIN\n                         Of course.\n\n               Divinci looks at Stein for a beat, then smiles and --\n\n                                     DIVINCI\n                         See you in court.\n\n                                     RICHARD STEIN\n                         Right.\n\n               Divinci heads down the walkway. Richard Stein watches him \n               for a moment, then looks at the closed door, then at his \n               watch.\n\n                                                                    CUT TO:\n\n               INT. ELLIOT'S OFFICE - DAY\n\n               Elliot's office is a cramped space in the PUBLIC DEFENDERS \n               FLOOR of the CRIMINAL COURTS BUILDING. A buzz of activity \n               outside. The staff is overworked, underpaid and \n               underappreciated. Elliot is reviewing legal documents. Knock \n               on the door.\n\n                                     ELLIOT\n                         Yeah.\n\n               The door opens and Arthur Baylor enters.\n\n                                     ARTHUR\n                         Elliot Goff?\n\n               Elliot looks up and suddenly recognizes --\n\n                                     ELLIOT\n                         Arthur Baylor?\n\n                                     ARTHUR\n                         Yes.\n\n               Elliot is stunned and flattered. He stands quickly.\n\n                                     ELLIOT\n                         Arthur Baylor, oh my God. I ahh, \n                         would you ahh... are you here to see \n                         me?\n\n                                     ARTHUR\n                         Yes.\n\n               Arthur shuts the door.\n\n                                                                    CUT TO:\n\n               INT. JAIL - INTERVIEW ROOM - DAY\n\n               Door opens. Joe is lead into the room by the JAIL GUARD. Joe \n               looks even better now. His stay in jail has broken his \n               dependency on alcohol. His hair is clean and combed. And \n               he's not as depressed. He stops upon seeing Elliot and Arthur \n               at the table. Both men stand. The guard shuts the door. Arthur \n               looks at Joe for a moment, then says --\n\n                                     ARTHUR\n                         William.\n\n               Joe stares at Arthur as if fighting a lost memory, then --\n\n                                     WILLIAM\n                         ...yes.\n\n                                                                    CUT TO:\n\n               INT. DISTRICT ATTORNEY - HELEN'S OFFICE - DAY\n\n                                     HELEN\n                         What are you telling me?!\n\n               Richard Stein is facing a not very happy Helen. She is seated \n               behind her desk stacked high with case files.\n\n                                     HELEN\n                         She missed the appointment? She forget \n                         you were coming? What?!\n\n                                     RICHARD STEIN\n                         If you want my best guess, I'd say \n                         she split.\n\n                                     HELEN\n                         She split, our witness split... Can't \n                         we keep our evidence and witnesses \n                         from disappearing around here? I \n                         mean what do I have to do, lock them \n                         in the trunk of my car? What the \n                         fuck is going on?! I want that bitch \n                         back here and on the stand or in \n                         jail!\n\n               Richard Stein nods quickly.\n\n                                     RICHARD STEIN\n                         I'll get her.\n\n               And he exits fast. He doesn't like it when his boss is pissed. \n               And right now his boss is really pissed.\n\n                                                                    CUT TO:\n\n               EXT. BAIL BOND OFFICE - DAY\n\n               A seedy side street near the courthouse and jail. The unmarked \n               car pulls up and Divinci gets out.\n\n               INT. BAIL BOND OFFICE - DAY\n\n               The interior is sparse. Several FRAMED FIGHT POSTERS on the \n               walls. All with MANNY LADREW, a young tough fighter in the \n               featherweight division, in his best pose, explaining where \n               and when the next bout will be -- but all these posters are \n               at least fifteen years old.\n\n               Two desks. One for the secretary, who is on vacation, and \n               the other for MANNY LADREW, the ex-pugilist. He's put on \n               some pounds in the intervening years, plus an added thin \n               mustache. Manny is on the phone --\n\n                                     MANNY\n                         -- yeah, uh-huh.\n                              (takes notes)\n                         Why you think he'd go there?\n\n               Divinci enters.\n\n                                     DIVINCI\n                         We need to talk.\n\n                                     MANNY\n                              (covers phone)\n                         Just a second.\n\n                                     DIVINCI\n                         Not just a second, now!\n\n               Manny glares at Divinci. He doesn't like Divinci, never has, \n               never will. But he's a cop. Cop's you have to make room for.\n\n                                     MANNY\n                              (into phone)\n                         I'll call you back.\n                              (hangs up)\n                         What d'you want, Divinci?\n\n               Divinci pulls some papers out of his pocket, hands them to \n               Manny.\n\n                                     DIVINCI\n                         I got a witness who took off. I gotta \n                         get her back. I don't got a lotta \n                         time.\n\n                                     MANNY\n                         You're the fuckin' police. What're \n                         you comin' to me for?!\n\n                                     DIVINCI\n                         Don't ask fuckin' questions, you \n                         just find her!\n\n               Manny, annoyed, looks at the papers -- photo of Cynthia \n               included.\n\n                                     MANNY\n                         Where've I seen her before?\n\n                                     DIVINCI\n                         She dances.\n\n                                     MANNY\n                         Yeah, right, okay. So what'd she \n                         take off for?\n\n                                     DIVINCI\n                         I said --\n\n                                     MANNY\n                         -- I know what you fuckin' said, but \n                         you want me to find her I gotta know \n                         why the fuck she took off! So I know \n                         where not to look! Okay?!\n\n                                     DIVINCI\n                         ...she's supposed to testify. She \n                         got scared, thinks somebody might \n                         kill her, so she's hidin'. That's \n                         why I want you to find her. If \n                         somebody is tryin' to pop her, I \n                         don't want anyone knowin' where she \n                         is. Manny eyes Divinci. He doesn't \n                         believe anything anybody tells him. \n                         Especially in his business.\n\n                                     MANNY\n                         How long I got?\n\n                                     DIVINCI\n                         Two days.\n\n                                     MANNY\n                         Shit, two fuckin' days!\n\n                                     DIVINCI\n                         Find her, puss head.\n\n               Divinci glares at Manny, then exits. Manny watches him leave.\n\n                                     MANNY\n                         Sure, Detective. Always like to help \n                         out the police whenever possible!\n\n                                                                    CUT TO:\n\n               INT. LARGE COURTROOM - DAY\n\n               Joe (William) is lead into the courtroom by GUARDS. Takes \n               his place at the DEFENSE TABLE which includes Elliot and TWO \n               YOUNG ATTORNEYS. The PROSECUTION TABLE, which includes Richard \n               Stein and Helen is going over last minute minutia.\n\n               PEOPLE are taking seats in the gallery. But another attorney \n               joins the Defense table. It's Arthur Baylor. And Richard \n               Stein double-takes when he sees him.\n\n               AT THE PROSECUTION TABLE\n\n                                     RICHARD STEIN\n                              (to Helen)\n                         Isn't that Arthur Baylor?\n\n               Helen turns.\n\n                                     HELEN\n                         Yes.\n\n               They watch Arthur shake hands with everyone - Elliot, the \n               two young attorneys and Joe.\n\n                                     RICHARD STEIN\n                         What's he doing here?\n\n               Arthur takes a seat at the defense table and glances across \n               at Helen and Richard and nods. Helen and Richard are stunned.\n\n                                     HELEN\n                         What the hell?\n\n                                     BAILIFF\n                         Hear ye, hear ye. All rise, face our \n                         flag and recognize the principles \n                         for which it stands. The Criminal \n                         Court, Department G is now in session. \n                         The Honorable Harold W. Pine \n                         presiding.\n\n               Everyone rises as JUDGE HAROLD PINE enters. In black robe. \n               Taking his place behind the bench. He sits.\n\n                                     BAILIFF\n                         Please be seated and come to order.\n\n               Everyone sits. And even Judge Harold Pine double-takes when \n               he sees Arthur Baylor at the Defense table.\n\n                                     BAILIFF\n                         The People versus Joe Doe in case \n                         number 95-24705.\n\n                                     JUDGE HAROLD PINE\n                         Before we proceed, I'd like to ask \n                         the Defense if there's anything this \n                         court should be made aware of.\n\n               Arthur stands.\n\n                                     ARTHUR\n                         Yes, your honor. I have joined the \n                         defense in the representation of Mr. \n                         William Dane McCall, otherwise known \n                         to this court as Joe Doe.\n\n               Everyone turns to look at Joe (William McCall). CAMERA PUSHES \n               in on him. It doesn't look as if he's sure who he is yet.\n\n                                     ARTHUR\n                         I have represented the McCall family \n                         for several years before William \n                         McCall's disappearance seven years \n                         ago. It was assumed that he had died, \n                         but since he has reappeared under \n                         these tragic circumstances, I would \n                         ask this court for a continuance to \n                         allow the defense to prepare \n                         adequately in light of his real \n                         identity now being known.\n\n                                     JUDGE HAROLD PINE\n                         How long do you need.\n\n                                     ARTHUR\n                         One week should be sufficient.\n\n                                     JUDGE HAROLD PINE\n                         Any objection to a week's continuance \n                         by the State?\n\n                                     HELEN\n                         I don't... believe so, your honor.\n\n                                     JUDGE HAROLD PINE\n                         Then I grant a one week continuance. \n                         We will start the proceedings next \n                         Monday morning.\n\n               Judge Harold Pine taps his gavel.\n\n                                                                    CUT TO:\n\n               TELEVISION NEWS REPORTS - INT. HELEN'S OFFICE - DAY\n\n               FLASH Joe's photograph and scenes of him being lead from the \n               courtroom. Helen and Richard Stein are watching. They can't \n               believe it.\n\n                                     NEWSCASTER\n                         -- when it was discovered that the \n                         man who has confessed to killing an \n                         undercover DEA agent, was actually \n                         himself thought dead for seven years. \n                         The man who signed the confession as \n                         Joe Doe is actually William Dane \n                         McCall, brother of Nathan McCall. \n                         Both are sons of the founder of McCall \n                         International, a corporation involved \n                         in telecommunications, computer design \n                         and development and other related \n                         industries. The net worth of both \n                         men is estimated at over a billion \n                         dollars --\n\n                                                                    CUT TO:\n\n               INT. UNMARKED CAR - DAY\n\n               Parked on the street. Rodriguez and Divinci inside. Rodriguez \n               reads the paper.\n\n                                     RODRIGUEZ\n                         -- but William McCall shunned the \n                         business world and turned his life \n                         to medicine, receiving his medical \n                         degree from Harvard in 1969. Once \n                         again he turned his back on the \n                         established norm and spent several \n                         years in Africa performing organ \n                         transplants for the poor.\n\n               Rodriguez slams down the paper.\n\n                                     RODRIGUEZ\n                         Jesus Christ, this is who you picked? \n                         A goddamn surgeon who performs organ \n                         transplants on poor Africans?!\n\n                                     DIVINCI\n                         He was living in the fuckin' street! \n                         How the hell was I supposed to know \n                         he was a goddamn doctor?!\n\n                                     RODRIGUEZ\n                         He's not a goddamn doctor! You picked \n                         a fuckin' Saint to pin a fuckin' \n                         murder on!\n\n               Divinci grabs the paper away from him. Both cops are angry, \n               upset, frustrated and scared to death.\n\n                                     RODRIGUEZ\n                         When we pick 'em, we really fuckin' \n                         pick 'em. We shoulda just picked up \n                         the fuckin' Pope.\n\n                                     DIVINCI\n                              (reading)\n                         -- he disappeared seven years ago on \n                         September 19 two weeks after the \n                         tragic death of his wife and two \n                         young children in a multiple vehicle \n                         accident. At the time it was assumed \n                         that he had returned to Africa, but \n                         that was never confirmed. What William \n                         McCall has been doing for seven years \n                         is now the mystery that the court \n                         will try to help unravel.\n\n               Divinci closes the paper.\n\n                                     DIVINCI\n                         Alright, alright, let's think here. \n                         What's the worse case scenario?\n\n                                     RODRIGUEZ\n                         Are you asking me if I can think of \n                         something worse than what we've done \n                         that we can still do, or something \n                         worse that might happen to us if \n                         this all blows up and we are convicted \n                         and sent to jail and die in the \n                         electric chair and go to hell?\n\n               Divinci looks at Rodriguez.\n\n                                     DIVINCI\n                         Work with me here.\n\n                                     RODRIGUEZ\n                         I'm sorry. I'm a little on edge. \n                         Would you repeat the question?\n\n               Both men are quiet for a moment, then --\n\n                                     DIVINCI\n                         Even if the doc walks, there's no \n                         evidence ties us to it. There's only \n                         one person who can connect us to \n                         Hudd.\n\n                                     RODRIGUEZ\n                         Okay, fine, I don't wanna argue about \n                         it anymore. Let's just fuckin' kill \n                         her.\n\n                                                                    CUT TO:\n\n               INT. BALL BOND OFFICE - DAY (LATE AFTERNOON)\n\n               Manny LaDrew is pouring himself a cup of coffee. His SECRETARY \n               is typing up a letter at her desk.\n\n                                     DIVINCI'S VOICE\n                         We need to talk.\n\n               Manny recognizes the voice. He mouths an oh fuck to himself, \n               then turns around to Divinci who is standing in the doorway.\n\n                                     MANNY\n                         Are you fuckin' with me?\n\n                                     DIVINCI\n                         No, I'm not fuckin' with you. Are \n                         you fuckin' with me?!\n\n                                     MANNY\n                         You don't know?\n\n                                     DIVINCI\n                         Know what?\n\n                                     MANNY\n                         Well this is a good one. You're a \n                         cop and you don't know.\n\n                                     DIVINCI\n                         Stop it.\n\n                                     MANNY\n                         Cops got her. Ain't that a gas. Cops \n                         got her, you're a cop, and you gotta \n                         find out from me. It's a crazy world \n                         we live in, don't you think?\n\n               Divinci suddenly explodes, going for Manny, grabbing him, \n               slamming him against the wall, his arm to Manny's throat.\n\n                                     DIVINCI\n                         Cops?! What fuckin' cops?!\n\n                                     MANNY\n                         I don't know what fuckin' cops. All \n                         I know is, my people got to her \n                         sister's place and she was already \n                         gone. Her sister said some cops took \n                         her. I thought it was you!\n\n               Divinci glares at Manny for a beat, then he storms out.\n\n                                     SECRETARY\n                         What an asshole.\n\n               Manny looks down at his Secretary.\n\n                                     MANNY\n                         You're a good judge of character.\n\n                                                                    CUT TO:\n\n               DIVINCI - INT. HOMICIDE DIVISION - DUSK\n\n               at his desk, on the phone.\n\n                                     DIVINCI\n                         -- look, she's our witness, if she's \n                         in custody, somebody better tell me!\n\n               Divinci slams down the phone. He sits quietly for a moment, \n               then rubs his face. Rodriguez crosses to his desk, sits down.\n\n                                     DIVINCI\n                         Anything?\n\n                                     RODRIGUEZ\n                         Nothin'. Nobody knows nothin'. The \n                         D.A. thinks she's gone. D.E.A. doesn't \n                         know shit.\n\n                                     DIVINCI\n                         If she was bein' held by police, \n                         we'd know.\n\n                                     RODRIGUEZ\n                         Unless she said somethin'.\n\n                                     DIVINCI\n                         If she said something we wouldn't be \n                         sittin' here.\n                              (a beat, then --)\n                         I think it's that lyin' piece of \n                         shit.\n\n                                                                    CUT TO:\n\n               MANNY - INT. BALL BONDS OFFICE - NIGHT\n\n               getting the shit beat out of him. The room is dark. Two men \n               are hammering on Manny. Throwing him against the wall, pulling \n               him up and hitting him in the stomach -- not the face. \n               Throwing him across the room, over the desk. Manny is too \n               hurt to get up. Divinci walks over to him, rubbing his gloved \n               hand.\n\n                                     DIVINCI\n                         Don't ever lie to me again.\n\n               Manny looks up weakly. Divinci walks away. Rodriguez opens \n               the door and they exit.\n\n                                                                    CUT TO:\n\n               INT. COUNTY JAIL CELL - MORNING\n\n               Joe is sitting on his cot, staring at the floor. ANOTHER MAN \n               is in the cell with him, reading a magazine. His name is \n               DUNCAN. Duncan looks at Joe.\n\n                                     DUNCAN\n                         First trial, huh.\n\n                                     WILLIAM\n                         Yes.\n\n                                     DUNCAN\n                         I got one piece of advise. When you \n                         break for lunch, don't get the \n                         pastrami.\n\n               We HEAR the BARRED CELL DOOR open.\n\n                                     GUARD\n                         Time to go.\n\n               Joe gets up. Puts out his hands. They shackle him as we HEAR --\n\n                                     THE BAILIFF'S VOICE\n                         Hear ye, hear ye. All rise, face our \n                         flag and recognize the principles \n                         for which it stands.\n\n               INT. COUNTY JAIL CELL - HALLWAY - MORNING\n\n               Joe is lead down the hall by TWO GUARDS, past rows of cells \n               filled with other PRISONERS --\n\n                                     BAILIFF'S VOICE\n                         The Criminal Court, Department G is \n                         now in session. The Honorable Harold \n                         W. Pine presiding.\n                              (We HEAR people rise)\n                         Please be seated and come to order.\n\n               EXT. COUNTY JAIL - PARKING AREA - DAY\n\n               Joe is lead to a waiting prison van. He gets inside.\n\n                                     BAILIFF'S VOICE\n                         The People versus William McCall in \n                         case number 95-24705.\n\n               The van pulls away.\n\n                                                                    CUT TO:\n\n               THE .44 SMITH AND WESSON (CLYDE'S .44)\n\n               as it is introduced into evidence.\n\n                                     HELEN\n                         -- when he pulled this gun and fired \n                         at the driver of the car. Killing \n                         him instantly. Let the record show \n                         that this is the weapon used in the \n                         crime, a Smith and Wesson forty-four \n                         caliber handgun.\n\n               INT. LARGE COURTROOM - DAY\n\n               Joe is sitting at the Defense table with Arthur and Elliot. \n               The trial is underway. And they watch the .44 go to the \n               evidence table -- the .44 with the BLACK STAIN.\n\n               Richard Stein is seated at the Defense table. He, too, is \n               watching the .44. He leans across to his ASSISTANT.\n\n                                     RICHARD STEIN\n                         All these goddamn guns are startin' \n                         to look the same to me.\n\n                                                               DISSOLVE TO:\n\n               DIVINCI - INT. LARGE COURTROOM - LATER\n\n               on the stand, being questioned by Helen.\n\n                                     HELEN\n                         And when you arrested the defendant, \n                         did he deny that he had killed Agent \n                         Hudd.\n\n                                     DIVINCI\n                         No.\n\n                                     HELEN\n                         Can you describe the defendant's \n                         condition at the time of his arrest.\n\n                                     DIVINCI\n                         He was drunk. We could smell the \n                         booze on him. But we drew blood. He \n                         didn't object.\n\n                                     HELEN\n                         We have the blood test report that \n                         shows --\n                              (picks up report)\n                         -- that he had four times the legal \n                         limit to drive. The people would \n                         like to enter this into evidence.\n\n               They so enter it.\n\n                                                                    CUT TO:\n\n               RODRIGUEZ - INT. LARGE COURTROOM - LATER\n\n               on the stand. Elliot is cross-examining.\n\n                                     ELLIOT\n                         -- and you arrested the defendant \n                         four days after the killing. What \n                         lead you to suspect Mr. McCall?\n\n                                     RODRIGUEZ\n                         You ask questions. Work the \n                         neighborhood. Find out who was on \n                         the street that night.\n\n                                     ELLIOT\n                         Yes, but specifically Mr. McCall? He \n                         had no previous criminal record.\n\n                                     RODRIGUEZ\n                         We found someone who'd seen him in \n                         the area. So we picked him up for \n                         questioning. We didn't expect it to \n                         be him. But if someone saw him in \n                         the area that night we would want to \n                         talk to him. If he wasn't the killer, \n                         he might've seen the killer. Just \n                         routine really.\n\n                                     ELLIOT\n                         Where did you find the defendant?\n\n                                     RODRIGUEZ\n                         On the street. Corner of Third and \n                         Madison.\n\n                                     ELLIOT\n                         What was he doing?\n\n                                     RODRIGUEZ\n                         He was passed out.\n\n                                     ELLIOT\n                         But you knew it was the man you were \n                         looking for.\n\n                                     RODRIGUEZ\n                         Yes.\n\n                                     ELLIOT\n                         Based on what?\n\n                                     RODRIGUEZ\n                         His description.\n\n                                     ELLIOT\n                         Who provided you with the description?\n\n                                     RODRIGUEZ\n                              (hesitates a beat)\n                         Cynthia something, I think.\n\n               Elliot moves to the defense table, glances at Arthur as he \n               picks up a paper. Arthur nods approvingly. Elliot looks at \n               the paper.\n\n                                     ELLIOT\n                         I believe her name is Cynthia Webb. \n                         According to the statement filed the \n                         night she picked him out of the line-\n                         up. The name familiar?\n\n                                     RODRIGUEZ\n                         Yes... that's her.\n\n                                     ELLIOT\n                         Where did you find Ms Webb?\n\n                                     RODRIGUEZ\n                         On the street. Same area.\n\n                                     ELLIOT\n                         And she agreed to pick the defendant \n                         out of a line up.\n\n                                     RODRIGUEZ\n                         Yes.\n\n                                     ELLIOT\n                         Where you aware that Ms Webb \n                         disappeared after she was served \n                         with a subpoena?\n\n                                     RODRIGUEZ\n                         Yes, my partner and I tried to contact \n                         her about the case and were \n                         unsuccessful.\n\n                                     ELLIOT\n                         Thank you, Detective, that's all the \n                         questions I have.\n\n               Rodriguez gets up as we --\n\n                                                                    CUT TO:\n\n               INT. ETHNIC BAR/RESTAURANT - NIGHT\n\n               A waitress cruises past tables to the booth in the back. She \n               sets down two scotch and waters to the two men. Rodriguez \n               and Divinci. The waitress exits. Divinci picks up his glass.\n\n                                     DIVINCI\n                         To justice in all its forms.\n\n               Rodriguez picks up his glass.\n\n                                     RODRIGUEZ\n                         We're not home free yet.\n\n                                     DIVINCI\n                         Without Ms Webb, there's no place \n                         they can go. We still got the \n                         confession, the gun, the ballistics... \n                         And I don't give a shit about all \n                         this African doctor crap... the man \n                         is a drunk and he's been a drunk for \n                         seven goddamn years. So lets have a \n                         drink for drunks.\n\n               Rodriguez reluctantly lifts his glass. They clink and drink.\n\n                                     DIVINCI\n                         That's the thing about life. You \n                         control it or it controls you. Most \n                         people don't understand that. They \n                         try'n blame their fuck-ups on \n                         something or somebody else. But it's \n                         not like that. I don't wanna hear \n                         why your life's a mess. It's a mess \n                         cause you're a mess. That simple. \n                         They're waitin' to live happily ever \n                         after. But after what? After all the \n                         shit happens? Well, I got a clue for \n                         everybody, the shit never stops \n                         happening. So you deal with it or \n                         you get buried in it. I'm not talkin' \n                         about you, you know what I'm sayin' \n                         here.\n\n                                     RODRIGUEZ\n                         Yeah.\n\n                                     DIVINCI\n                         Life don't work in mysterious ways. \n                         There ain't no mystery to it. You \n                         just work it. And you don't take it \n                         too serious. You can't take it too \n                         serious otherwise you get fragile. \n                         And you can't be fragile and have \n                         any fuckin' fun.\n\n                                     RODRIGUEZ\n                         You think I'm fragile?\n\n                                     DIVINCI\n                         That's the first sign of trouble, \n                         when you start askin' other people.\n\n               Rodriguez nods.\n\n                                     RODRIGUEZ\n                         ...I just wish I knew where the hell \n                         she was.\n\n                                                                    CUT TO:\n\n               INT. HELEN'S D.A. OFFICE - NIGHT\n\n               Helen and Richard Stein are working late. Over take-out \n               Chinese.\n\n                                     RICHARD STEIN\n                              (referring to papers)\n                         -- so I think we'll have to rely on \n                         the confession for his description \n                         of what happened. He'll never take \n                         the stand, even if --\n\n               The phone rings. Richard picks up.\n\n                                     RICHARD STEIN\n                              (into phone)\n                         D.A.'s office... What?... When?... \n                         Where will --\n\n               Richard is surprised. He turns to Helen.\n\n                                     RICHARD STEIN\n                         They found Cynthia Webb.\n\n                                     HELEN\n                         Where?\n\n                                     RICHARD STEIN\n                         I don't know.\n\n                                     HELEN\n                         When?\n\n                                     RICHARD STEIN\n                         I don't know.\n\n                                     HELEN\n                         Well who the hell was that?\n\n                                     RICHARD STEIN\n                         I don't know. They hung up.\n\n               Richard hangs up the receiver. He and Helen exchange a look.\n\n                                     HELEN\n                         What the fuck is going on?!\n\n                                                                    CUT TO:\n\n               INT. LARGE COURTROOM - DAY\n\n                                     HELEN\n                         Your honor, the people call Ms. \n                         Cynthia Webb to the stand.\n\n               VARIOUS REACTIONS\n\n               Rodriguez and Divinci are stunned. Cynthia? Elliot is \n               completely surprised. Cynthia? Arthur is never shaken by \n               anything.\n\n               The courtroom doors open and Cynthia is lead down the aisle \n               by a SHERIFF'S DEPUTY. She moves to the chair.\n\n               But it's Joe's turn to double take. He remembers her. My \n               God, he knows her. It's Cynthia -- the girl from the apartment \n               building. He never saw who pointed him out, but he never \n               expected it to be her.\n\n                                     BAILIFF\n                         Raise your right hand.\n\n               Cynthia raises her hand. But her look goes right to Joe. \n               Staring at him. She's never seen Joe like this -- cleaned \n               up, trimmed, handsome. She's not sure she even recognizes \n               him.\n\n                                     BAILIFF\n                         You swear to tell the truth, the \n                         whole truth and nothing but the truth \n                         so help you God.\n\n               She turns her eyes from Joe.\n\n                                     CYNTHIA\n                         Sure.\n\n                                     BAILIFF\n                         You may be seated.\n\n               Cynthia sits down. Looks at Divinci.\n\n               And Joe leans across to Arthur and Elliot. Their conversation \n               is in whispers --\n\n                                     WILLIAM\n                         I know her.\n\n                                     ELLIOT\n                         She's the woman who identified you.\n\n                                     WILLIAM\n                         No. I mean I know her.\n\n                                     ARTHUR\n                         ...How?\n\n                                     WILLIAM\n                         I'm not sure... I think I lived near \n                         her.\n\n               Arthur exchanges a look with Elliot. Arthur turns now and \n               looks at Cynthia. The wheels are turning.\n\n                                     HELEN\n                         Please state your name for the court.\n\n                                     CYNTHIA\n                         Cynthia Webb.\n\n                                     HELEN\n                         Do you see the man that you identified \n                         in a police line-up in this room.\n\n                                     CYNTHIA\n                         Yes.\n\n                                     HELEN\n                         Is it the defendant, Mr. McCall?\n\n               Cynthia looks at Joe. Joe looks straight at her. Cynthia \n               turns her eyes away.\n\n                                     CYNTHIA\n                         Yes.\n\n                                     HELEN\n                         Please describe what you saw the \n                         night of September 14th.\n\n                                     CYNTHIA\n                         I was comin' out of an all night \n                         minimart --\n\n                                                                    CUT TO:\n\n               EXT. STREET - MINI MART - NIGHT\n\n               Cynthia comes out of a ALL NIGHT MINI-MART with a bag of \n               food. She walks down the street and suddenly we HEAR a \n               GUNSHOT. Followed by a CAR CRASH. She turns toward the sound. \n               And we HEAR RUNNING FOOTSTEPS. Then we see a man running. He \n               has a pistol in one hand.\n\n               Cynthia watches the man run past and disappear into the \n               darkness.\n\n                                                               CUT BACK TO:\n\n               INT. LARGE COURTROOM - DAY\n\n               Cynthia is looking at Helen.\n\n                                     HELEN\n                         And you're positive the man you saw \n                         with the gun is the defendant.\n\n               Instead of looking at Joe, Cynthia turns to Rodriguez and \n               Divinci who are seated in the rows behind the prosecution \n               table. They are looking right at her. They wait for her \n               answer.\n\n                                     CYNTHIA\n                         Yeah.\n\n                                     HELEN\n                         No further questions.\n\n               Divinci offers her a small smile.\n\n               Cynthia turns away. Arthur is now standing in front of her.\n\n                                     ARTHUR\n                         Miss Webb... is it Miss?\n\n                                     CYNTHIA\n                         Yes.\n\n                                     ARTHUR\n                         Miss Webb, had you ever seen the \n                         defendant before that night, the \n                         night you described to us?\n\n                                     CYNTHIA\n                         No.\n\n                                     ARTHUR\n                         Do you know what perjury is?\n\n                                     CYNTHIA\n                         When you lie.\n\n                                     ARTHUR\n                         When you lie under oath in a court \n                         of law. Do you know what the penalty \n                         for that is?\n\n                                     CYNTHIA\n                         You go to jail.\n\n                                     ARTHUR\n                         Yes... Cynthia, have you ever seen \n                         the defendant before that night?\n\n                                     HELEN\n                         Objection. The witness has already \n                         answered that question.\n\n                                     JUDGE HAROLD PINE\n                         Sustained.\n\n                                     ARTHUR\n                         I just want to give the witness the \n                         opportunity to remember if she could \n                         have seen Mr. McCall anyplace else \n                         before the night in question.\n\n               Divinci stares at Cynthia. As if willing her to give the \n               answer he wants her to give.\n\n                                     JUDGE HAROLD PINE\n                         Ms. Webb, do you understand the \n                         consequences of perjury?\n\n                                     CYNTHIA\n                         Yes.\n\n                                     JUDGE HAROLD PINE\n                         Let's get on with it then.\n\n                                     ARTHUR\n                         What did you buy the night you went \n                         into the mini-mart?\n\n                                     CYNTHIA\n                         What did I buy?\n\n                                     ARTHUR\n                         You remembered seeing Mr. McCall \n                         that night and hearing the gunshot \n                         and a car crash. I just wondered if \n                         you remembered what you bought in \n                         the mini-mart.\n\n                                     CYNTHIA\n                         ...shampoo I think.\n\n                                     ARTHUR\n                         That's all?\n\n                                     CYNTHIA\n                         Yes.\n\n                                     ARTHUR\n                         Where do you live?\n\n                                     CYNTHIA\n                         4356 17th Street. Number 37.\n\n                                     ARTHUR\n                         Is that close to where this mini-\n                         mart is?\n\n                                     CYNTHIA\n                         Close? Sort of.\n\n                                     ARTHUR\n                         How far would you say?\n\n                                     CYNTHIA\n                         I don't really know.\n\n                                     ARTHUR\n                         Within walking distance?\n\n                                     CYNTHIA\n                         No... I don't think so.\n\n                                     ARTHUR\n                         Did you walk there that night or \n                         drive?\n\n                                     CYNTHIA\n                         I ahh... drove.\n\n                                     ARTHUR\n                         You drove. But when you left the \n                         mini-mart you stated that you walked \n                         down the street.\n\n                                     CYNTHIA\n                         Yeah.\n\n                                     ARTHUR\n                         How far?\n\n                                     CYNTHIA\n                         ...to the corner.\n\n                                     HELEN\n                         Objection. Your honor, I don't see a \n                         point to this line of questioning.\n\n                                     JUDGE HAROLD PINE\n                         Is there a point?\n\n                                     ARTHUR\n                         Yes, your honor. Since this is the \n                         only witness, I'm trying to establish \n                         what the scene was like that night.\n\n                                     JUDGE HAROLD PINE\n                         Try to get there as quickly as \n                         possible.\n\n                                     ARTHUR\n                              (to Cynthia)\n                         And how far away from the corner was \n                         the Mini-mart? For example was it in \n                         the middle of the block, close to \n                         the corner, where?\n\n                                     CYNTHIA\n                         In the middle I think.\n\n                                     ARTHUR\n                         So you walked all the way to the \n                         corner. I assume then you were walking \n                         back to your car, yes?\n\n                                     CYNTHIA\n                         ...yeah.\n\n                                     ARTHUR\n                         Was there a reason you parked so far \n                         away?\n\n                                     CYNTHIA\n                              (getting nervous)\n                         Um... there were lots of cars parked \n                         on the street.\n\n                                     ARTHUR\n                         Was there anyone else on the street \n                         besides you?\n\n                                     CYNTHIA\n                         No.\n\n                                     ARTHUR\n                         Lots of cars, but no people. Any \n                         traffic?\n\n                                     CYNTHIA\n                         I don't remember.\n\n                                     ARTHUR\n                         So you were the only person to see \n                         Joe on the street that night?\n\n                                     CYNTHIA\n                         I didn't see anybody else.\n\n                                     ARTHUR\n                         So you heard a gunshot, a car crash \n                         and a man running with a gun in his \n                         hand.\n\n                                     CYNTHIA\n                         Yes.\n\n                                     ARTHUR\n                         What did you do then? Did you call \n                         the police, 911?\n\n                                     CYNTHIA\n                         I went home.\n\n                                     ARTHUR\n                         You went home. Straight home?\n\n                                     CYNTHIA\n                         Yes.\n\n                                     ARTHUR\n                         And you're sure it was Joe you saw \n                         that night?\n\n                                     CYNTHIA\n                         Yes.\n\n                                     ARTHUR\n                         When you went home.\n\n                                     CYNTHIA\n                         Yes.\n\n               Arthur pauses.\n\n                                     ARTHUR\n                         When you went home you saw Joe?\n\n               Cynthia realizes what she's said.\n\n                                     CYNTHIA\n                         No.\n\n                                     HELEN\n                         Objection. Defense is trying to \n                         confuse the witness.\n\n                                     ARTHUR\n                         I'm not trying to confuse the witness, \n                         it's the witness that's trying to \n                         confuse the court. I have witnesses \n                         who will refute her testimony. \n                         Witnesses who were on that corner \n                         the night of the shooting, who never \n                         saw Ms. Webb, who never heard the \n                         gunshot, who never saw Joe run past. \n                         Ms Webb saw Joe outside her apartment \n                         building that night because he lived \n                         in the alley next to it. Isn't that \n                         right, Ms Webb?\n\n               Arthur turns dramatically to Cynthia. She is scared.\n\n                                     HELEN\n                         Objection!\n\n               Everyone's attention is on Cynthia.\n\n                                     ARTHUR\n                         When I referred to him as Joe, you \n                         knew who I was talking about, didn't \n                         you. This case is the People versus \n                         Mr. William McCall. Not Joe. Joe has \n                         never been mentioned in this trial. \n                         How did you know who I was talking \n                         about, Ms. Webb?\n\n               Cynthia looks from Arthur to Divinci. Divinci is frozen. \n               Rodriguez is sweating.\n\n               Then Cynthia turns and looks at Joe.\n\n               Joe looks at her, feeling sorry for her. Not hating her.\n\n                                     ARTHUR\n                         Ms. Webb, how did you know that Joe \n                         was the defendant?\n\n               Cynthia lowers her eyes to the floor.\n\n                                     CYNTHIA\n                         He lived in the alley next to my \n                         apartment building.\n\n               Helen and Richard Stein are stunned yet again.\n\n                                     HELEN\n                              (to herself)\n                         Oh shit.\n\n               Divinci and Rodriguez are doing their best to remain cool, \n               calm and collected.\n\n                                     ARTHUR\n                         Why did you lie to this court?\n\n                                     CYNTHIA\n                         I don't know.\n\n                                     ARTHUR\n                         Are you afraid of somebody?\n\n                                     CYNTHIA\n                         I don't know.\n\n                                     ARTHUR\n                         Are you protecting somebody?\n\n                                     CYNTHIA\n                         I don't know.\n\n                                     JUDGE HAROLD PINE\n                         Answer the questions, Ms. Webb or \n                         I'll be forced to cite you for \n                         contempt.\n\n               Cynthia looks up at the judge. She's not talking.\n\n                                                                    CUT TO:\n\n               CYNTHIA\n\n               having her mug shots taken. Holding a number. On the FLASH --\n\n                                                                    CUT TO:\n\n               INT. UNMARKED CAR - STREET - DAY\n\n               Driving.\n\n                                     RODRIGUEZ\n                         She didn't talk.\n\n                                     DIVINCI\n                         Don't hold your breath.\n\n                                     RODRIGUEZ\n                         You think she'll talk.\n\n                                     DIVINCI\n                         I know she'll talk.\n\n                                     RODRIGUEZ\n                         We'll make it look gang related.\n\n                                     DIVINCI\n                         Problem is we're gonna need another \n                         gun.\n\n                                     RODRIGUEZ\n                         The problem?! Have you forgotten? \n                         She's in fucking jail. That's the \n                         goddamn problem.\n\n                                     DIVINCI\n                         Since when is being in jail a guaranty \n                         of a long life? You just get a fuckin' \n                         gun.\n\n               EXT. STREET - DAY\n\n               Rodriguez gets out of the car. Divinci pulls away, driving \n               into traffic. Rodriguez heads into the Station.\n\n                                                                    CUT TO:\n\n               INT. BAIL BOND OFFICE - DAY\n\n               Divinci enters. Manny looks up from his desk. His face is \n               bruised and bandaged.\n\n                                     MANNY\n                         Oh shit. I didn't do anything!\n\n                                     DIVINCI\n                         Everything's fine, Manny. I just \n                         came to apologize.\n                              (looks at secretary)\n                         We need some privacy...\n\n               Manny looks at Divinci, then motions for his Secretary to \n               take a walk. She gets up, exits.\n\n                                     DIVINCI\n                         Just one more favor. I want you to \n                         bail somebody out of jail.\n\n                                     MANNY\n                         You're kiddin'.\n\n                                     DIVINCI\n                         Bail's twenty-five thousand.\n\n               Divinci pulls out a piece of paper.\n\n                                     DIVINCI\n                         I want her out tonight. And don't \n                         tell her who. It's a surprise.\n\n                                     MANNY\n                         And how'm I payin' for this? They \n                         don't take American Express.\n\n               Divinci pulls a plastic bag filled with cocaine out of his \n               pocket -- tosses it onto Manny's desk.\n\n                                     DIVINCI\n                         I know you know how to exchange that. \n                         It's worth a lot more than twenty-\n                         five grand. You can keep the change.\n                              (points to cocaine)\n                         I want her back in two hours... Or \n                         I'll nail you for possession.\n\n                                     MANNY\n                         How'd you get to be such a prick?\n\n                                     DIVINCI\n                         DNA.\n\n               Divinci exits.\n\n                                     MANNY\n                         What a piece of shit.\n\n                                                                    CUT TO:\n\n               INT. COUNTY JAIL CELL - NIGHT\n\n               Cynthia sits alone in her cell.\n\n                                                                    CUT TO:\n\n               INT. COUNTY JAIL CELL - NIGHT\n\n               Joe lies on his cot. But even though he is in jail for murder, \n               he is no longer the bum. This is a new man now. Clean shaven. \n               Hair cut. Prison clothes neat. Duncan rolls over on his cot.\n\n                                     DUNCAN\n                         You don't have to say nothin', but... \n                         you really a doctor?\n\n                                     WILLIAM\n                         ...I was... a surgeon.\n\n                                     DUNCAN\n                         No shit, no shit, really. A surgeon. \n                         I know I'm nobody to judge, but you \n                         musta been a smart guy. What the \n                         hell's a smart guy like you doin' in \n                         here?\n\n               Joe looks up at Duncan, hesitates, then --\n\n                                     WILLIAM\n                         ...I had an affair with another \n                         woman... a nurse at the hospital I \n                         worked at. It was nothing... I can't \n                         even remember much about her... Except \n                         my wife found out. We had a fight. \n                         She left the house, took the kids... \n                         She was hysterical. I should've done \n                         something... gone after them, I don't \n                         know... they were killed in a car \n                         accident about a mile from the \n                         house... I've never told anybody \n                         that... about why she left.\n\n               Duncan nods.\n\n                                     DUNCAN\n                         Hey, doc, you can trust me. It won't \n                         go no farther.\n\n                                                                    CUT TO:\n\n               EXT. 6TH STREET OUTSIDE STATION - NIGHT\n\n               Rodriguez is outside the Station. Looking nervous and upset. \n               The unmarked car pulls up. Rodriguez moves for the car. He \n               gets in and the car pulls away.\n\n               INT. UNMARKED CAR - NIGHT\n\n               Divinci drives. Rodriguez sweats. Divinci notices.\n\n                                     DIVINCI\n                         You get the gun?\n\n                                     RODRIGUEZ\n                         I got it.\n\n                                     DIVINCI\n                         Everything okay?\n\n                                     RODRIGUEZ\n                         Are you kidding? We're going to kill \n                         a goddamn witness who's in fucking \n                         jail because we killed an undercover \n                         DEA agent. I'm sorry, but this kinda \n                         shit troubles me a little.\n\n                                     DIVINCI\n                         Take off the dress and get back in \n                         the game. We gotta do what we gotta \n                         do.\n\n                                     RODRIGUEZ\n                         Yeah. I know. Let's just get it over \n                         with.\n\n               Divinci glances at Rodriguez. He's more nervous than normal.\n\n                                                                    CUT TO:\n\n               EXT. COUNTY JAIL - FRONT - NIGHT\n\n               Manny walks out of the jail building. Cynthia is with him.\n\n                                     CYNTHIA\n                         I don't understand. Why can't you \n                         tell me who put up the bond?\n\n                                     MANNY\n                         Look, a guy comes in, says bail her \n                         out, gives me the money, I do it. \n                         That's how I make my living, I bail \n                         fuckin' people outa jail. You wait \n                         with me.\n\n                                     CYNTHIA\n                         Was it a cop?\n\n                                     MANNY\n                         Yeah, right. Cops bail people outa \n                         jail all the time. Doesn't there \n                         seem to be a dichotomy there for \n                         you?\n\n                                     CYNTHIA\n                         I don't like this.\n\n                                     MANNY\n                         You wanna stay in jail, that's up to \n                         you. Or you come with me.\n\n                                     CYNTHIA\n                         What'd he look like?\n\n                                     MANNY\n                         You're a stripper right? Lotta guys \n                         fall in love with your type. But \n                         they don't know how to get close, \n                         know what I mean? Somebody wants you \n                         to owe them something.\n                              (shrugs)\n                         Take it or leave it.\n\n               Manny starts down the steps. Cynthia hesitates, then follows.\n\n               INT. UNMARKED CAR - PARKED DOWN THE STREET - NIGHT\n\n               Divinci and Rodriguez watch Cynthia get into the car with \n               Manny.\n\n                                     RODRIGUEZ\n                         This is the last time, Frank. The \n                         last time we kill somebody.\n\n                                     DIVINCI\n                         Yeah, it's the last time.\n\n                                     RODRIGUEZ\n                         This'll be eleven, Frank. Eleven is \n                         enough.\n\n                                     DIVINCI\n                         I get the picture.\n\n               Divinci looks at Rodriguez. He's staring out the window, but \n               he looks ill. Something is not right with him.\n\n                                     RODRIGUEZ\n                         It was all okay until you shot Hudd.\n\n                                     DIVINCI\n                         What's goin' on here? You mad at me \n                         or something?\n\n                                     RODRIGUEZ\n                         It wasn't my idea to start killing \n                         people, Frank. That's all I'm sayin'. \n                         We're in this goddamn mess because \n                         you started killing people.\n\n                                     DIVINCI\n                         Drug dealers don't qualify as people. \n                         Never did, never will. So what the \n                         hell's wrong with you tonight? You \n                         suddenly worried about where all the \n                         money went?\n\n                                     RODRIGUEZ\n                         I'm just sick of it, that's all.\n\n               Divinci stares at Rodriguez for a beat, then starts car.\n\n                                                                    CUT TO:\n\n               EXT. ALLEY - NIGHT\n\n               The unmarked car turns off the street onto the side street \n               and stops. The lights go out.\n\n               INT. UNMARKED CAR - NIGHT\n\n                                     RODRIGUEZ\n                         What're you doin'?\n\n                                     DIVINCI\n                         I need some fresh air.\n\n               Divinci exits. Rodriguez hesitates, then gets out with him.\n\n               EXT. ALLEY - NIGHT\n\n                                     RODRIGUEZ\n                         Frank --\n\n                                     DIVINCI\n                         Talk to me, okay? Just fuckin' talk \n                         to me.\n\n               Rodriguez hesitates a moment, then --\n\n                                     RODRIGUEZ\n                         I don't know... I owe some money. I \n                         don't know how I'm gonna pay it...\n\n                                     DIVINCI\n                         You gambling again?\n\n                                     RODRIGUEZ\n                         Yeah, yeah... I just couldn't... \n                         Frank... let's forget about this. \n                         Let's just get the fuck outa here. \n                         We got enough money, let's go. We'll \n                         get outa the country or something.\n\n               Divinci turns toward Rodriguez. And he's got his pistol out.\n\n                                     RODRIGUEZ\n                         What the hell're you doin'?!\n\n                                     DIVINCI\n                         Take off your shirt.\n\n                                     RODRIGUEZ\n                         What're you talkin' about?\n\n                                     DIVINCI\n                         Just take off your shirt. If there's \n                         nothin' to worry about, then I'll \n                         apologize. But I'm not gonna argue. \n                         Take off your fuckin' shirt now.\n\n                                     RODRIGUEZ\n                         What is this, you piece of shit?! \n                         You don't trust me?! Is that it?! \n                         YOU DON'T FUCKIN' TRUST ME AFTER ALL \n                         WE'VE BEEN THROUGH?!\n\n                                     DIVINCI\n                         ...Take off your shirt.\n\n                                     RODRIGUEZ\n                         Fuck you, you don't trust me.\n\n                                     DIVINCI\n                         I'm askin' you one more time.\n\n                                     RODRIGUEZ\n                         You wanna shoot me? Shoot me.\n\n               Divinci hesitates. He doesn't want to. This is his partner. \n               A beat, then he lowers his gun.\n\n                                     DIVINCI\n                         Okay, I'm sorry. You're right. I'm \n                         fuckin' nervous. Like you. Forget \n                         it. This thing... shit. Let's just \n                         get it over with.\n\n               Divinci holsters his gun. Rodriguez hesitates, breathes a \n               sigh, then returns to the car. They both get back in.\n\n               INT. UNMARKED CAR - NIGHT\n\n               Divinci starts up the car.\n\n                                     DIVINCI\n                         I'll just feel a whole lot better \n                         when she's dead. Then we're off the \n                         hook.\n\n                                     RODRIGUEZ\n                         Right.\n\n               Divinci starts to shift gears, but suddenly throws his elbow \n               into Rodriguez' face. And Divinci is all over him like a \n               tornado. Slamming a fist into his face repeatedly. He grabs \n               his shirt and rips it open REVEALING the TAPE RECORDER \n               strapped to his body, recording their every word.\n\n                                     DIVINCI\n                         YOU FUCKIN' RAT!\n\n               Divinci puts his revolver to Rodriguez' head. Rodriguez, \n               bleeding from the mouth and nose, looks at Frank.\n\n                                     RODRIGUEZ\n                         Yeah... yeah... I am, I'm a fuckin' \n                         rat... I traded you, Frank, I fuckin' \n                         traded you... Simms knows everything.\n\n               Divinci pulls back the hammer, ready to blow Rodriguez' head \n               off.\n\n                                     RODRIGUEZ\n                         Just fuckin' shoot me, get it the \n                         fuck over with! I DESERVE IT! I \n                         FUCKING DESERVE TO DIE!\n\n               Divinci is ready to pull the trigger.\n\n                                     DIVINCI\n                         You're fuckin' right.\n\n               Divinci rips the wires off the recorder. Rodriguez closes \n               his eyes, waiting for the end. A tense moment, then --\n\n                                     DIVINCI\n                         ...Get out.\n\n               Rodriguez opens his eyes, looking at Divinci, who is still \n               holding the gun to his head. Another moment, then --\n\n                                     RODRIGUEZ\n                         Frank --\n\n                                     DIVINCI\n                              (calm)\n                         Get outa the car NOW!\n\n               A beat, then Rodriguez gets out. Divinci looks up at his \n               partner.\n\n                                     DIVINCI\n                         This is why you can never -- ever -- \n                         lose your sense of fuckin' humor.\n\n               EXT. ALLEY - NIGHT\n\n               The car tears away, leaving Rodriguez alone in the alley.\n\n                                                                    CUT TO:\n\n               THE KEY - INSERTED INTO THE DOOR LOCK - NIGHT\n\n               Rodriguez pushes open the door to his apartment, enters. \n               Shuts the door. Stands alone in the room for a moment, then \n               suddenly erupts in rage. Ripping off his coat, ripping off \n               his shirt, ripping off the tape recorder taped to his chest.\n\n               He throws the recorder on the ground. Stomps on it until \n               it's shattered into pieces. He stares at the broken recorder.\n\n                                     MAN'S VOICE (VIC)\n                         I guess we caught you at a bad time.\n\n               Rodriguez spins around. Vic steps into the moonlight streaming \n               in through the window. Behind him is Cutless Supreme.\n\n                                     VIC\n                         But we all have problems.\n\n               Rodriguez suddenly YELLS and CHARGES THEM. He tackles Vic. \n               But in the darkness we can't see anything. Until the explosion \n               of a GUN and the FLASH of flames lights up the room. A moment \n               of silence then --\n\n                                     VIC\n                         Oh shit. You shot him, you fuckin' \n                         shot him!\n\n               Two men stumble to the door. Leaving one on the floor. The \n               door is flung open and Vic runs out. Followed by Cutless \n               Supreme.\n\n                                                                    CUT TO:\n\n               CRIME SCENE TAPE - INT. RODRIGUEZ APARTMENT - EARLY MORNING\n\n               The crime scene is swarming with cops, DEA and FBI. The task \n               of evidence collection in progress. Rodriguez' body on the \n               floor. Agent Simms is standing over the body with Agent \n               Sarkasian.\n\n                                     AGENT SARKASIAN\n                         Divinci musta figured it. I didn't \n                         think he'd kill his own partner \n                         though.\n\n                                     SIMMS\n                         He's an animal.\n\n               DEA AGENT Hooper comes up behind Simms.\n\n                                     AGENT HOOPER\n                         Recorders busted up. But we might be \n                         able to salvage some of the tape.\n\n                                     SIMMS\n                         I want him. You understand me, I \n                         don't care what it takes. I want \n                         that sonuvabitch!\n\n               Simms heads for the door. Sarkasian and Hooper follow.\n\n                                                                    CUT TO:\n\n               EXT. BAIL BOND OFFICE - MORNING\n\n               A car pulls up in front.\n\n               INT. BAIL BOND OFFICE - MORNING\n\n               It is deadly quiet. We PAN SLOWLY around the office until we \n               find Manny in his chair, sprawled back. Continuing to PAN \n               until we see Cynthia sprawled on the couch. But no signs of \n               blood. Just the bodies. The door opens. TWO MEN enters. All \n               we SEE are GUNS in hands.\n\n               Cynthia and Manny wake up with a start. Manny is scared.\n\n                                     MANNY\n                         Shit! Who the fuck're you?!\n\n               A BADGE comes out. And now we see Agents Hooper and Sarkasian.\n\n                                     AGENT SARKASIAN\n                         Ms. Webb. We'd like you to come with \n                         us.\n\n               Cynthia looks at Manny. She's pissed.\n\n                                     CYNTHIA\n                         This was the big secret? Shit. You're \n                         an asshole.\n\n               Cynthia puts her coat on and heads for the door. Manny doesn't \n               know what the hell is going on.\n\n                                                                    CUT TO:\n\n               INT. INTERROGATION ROOM - FEDERAL BLDG. - DAY\n\n               Cynthia is in with Agents Simms, Hooper and Sarkasian.\n\n                                     SIMMS\n                         Who set it up?\n\n                                     CYNTHIA\n                         I don't know.\n\n                                     AGENT HOOPER\n                         It was Divinci wasn't it?\n\n                                     CYNTHIA\n                         I don't know.\n\n                                     SIMMS\n                         Which one pulled the trigger? Divinci \n                         or Rodriguez?\n\n                                     CYNTHIA\n                         I don't know.\n\n               Agent Simms looks right into Cynthia's eyes.\n\n                                     SIMMS\n                         Detective Rodriguez is dead. He was \n                         shot in the head last night.\n\n               This gets Cynthia's attention.\n\n                                     SIMMS\n                         Rodriguez was wearing a recorder. \n                         Divinci found it. You can do addition, \n                         can't you.\n\n                                     CYNTHIA\n                         You're full of shit.\n\n                                     AGENT SARKASIAN\n                         Just tell us what you know.\n\n               Cynthia looks at both of them.\n\n                                     CYNTHIA\n                         Where's Divinci?\n\n                                     SIMMS\n                         We don't know. But we're gonna find \n                         him.\n\n                                     CYNTHIA\n                         You're gonna find him?\n                              (smiles sarcastically)\n                         Right... I don't know a fuckin' thing.\n\n               Simms stares at her for a moment, then turns to Hooper and \n               nods. Hooper takes Cynthia's arm and leads her out of the \n               office. When the door closes --\n\n                                     SIMMS\n                         Get a copy of the tape to Bailor. \n                         But make sure it doesn't come from \n                         us.\n\n                                                                    CUT TO:\n\n               INT. COUNTY JAIL CELL - DAY\n\n               Cynthia is alone in her cell. We HEAR footsteps. She looks \n               up as the GUARD approaches.\n\n                                     GUARD\n                         Your attorney's here.\n\n                                     CYNTHIA\n                         What attorney?\n\n               INT. ROOM - COUNTY JAIL - DAY\n\n               Cynthia enters the office. The Guard shuts the door. Cynthia \n               finds herself facing Arthur Baylor. A tape recorder on the \n               table in front of him.\n\n                                     ARTHUR\n                         Hi, Cynthia. Please sit down.\n\n                                     CYNTHIA\n                         I got nothin' to say.\n\n                                     ARTHUR\n                         So I'm told.\n\n               Arthur pushes the tape recorder and we HEAR --\n\n                                     DIVINCI'S VOICE\n                         ...Take off your shirt...\n\n                                     RODRIGUEZ'S VOICE\n                         Fuck you, you don't trust me.\n\n                                     DIVINCI'S VOICE\n                         I'm askin' you one more time.\n\n                                     RODRIGUEZ'S VOICE\n                         You wanna shoot me? Shoot me.\n\n                                     DIVINCI'S VOICE\n                         Okay, I'm sorry. You're right. I'm \n                         fuckin' nervous. Like you. Forget \n                         it. This thing... shit. Let's just \n                         get it over with. I'll just feel a \n                         whole lot better when she's dead. \n                         Then we're off the hook.\n\n               Arthur watches Cynthia's reaction to \"when she's dead.\" But \n               Cynthia has seen enough not to be too shocked by anything. \n               And her reaction is subtle. She knows better than to reveal \n               what she's really feeling and thinking.\n\n                                     RODRIGUEZ'S VOICE\n                         Right.\n\n                                     DIVINCI'S VOICE\n                         YOU FUCKIN' RAT!\n\n                                     RODRIGUEZ'S VOICE\n                         Yeah... yeah... I am, I'm a fuckin' \n                         rat... I traded you, Frank, I fuckin' \n                         traded you... Simms knows everything. \n                         Just fuckin' shoot me, get it the \n                         fuck over with! I DESERVE IT! I \n                         FUCKING DESERVE TO DIE!\n\n                                     DIVINCI'S VOICE\n                         You're fuckin' right.\n\n               The recording ends. Arthur shuts off the machine.\n\n                                     ARTHUR\n                         I think you know my client is \n                         innocent. That's all I care about, \n                         my client. But I understand why you're \n                         scared. You're already facing perjury \n                         charges. My guess is, your involvement \n                         is deeper than that. But I don't \n                         really care, I'm not after you... I \n                         get nothing if you go to jail. But I \n                         think if I help you, I can help my \n                         client.\n\n                                     CYNTHIA\n                         ...how?\n\n                                     ARTHUR\n                         William -- Joe -- didn't do it, did \n                         he?\n\n               Cynthia hesitates, then shakes her head.\n\n                                     ARTHUR\n                         Why don't you sit down.\n\n               A beat, then Cynthia pulls up a chair.\n\n                                                                    CUT TO:\n\n               AGENT SIMMS - INT. OFFICE - DAY\n\n               angry.\n\n                                     SIMMS\n                         No goddamn way! I'm not going to \n                         grant that whore immunity. She lied \n                         on the stand, she's protecting \n                         somebody. And she's involved. I want \n                         them all.\n\n               Arthur, who was sitting across from him, stands.\n\n                                     ARTHUR\n                         Before I leave, let me remind you \n                         that you have shit for a case. If \n                         you really care about seeing justice \n                         for your dead agent, don't blow this \n                         deal. Immunity for her testimony is \n                         a small price for a bad cop. It's \n                         the only way she's going to talk.\n\n               Simms glares at Arthur.\n\n                                     ARTHUR\n                         And William McCall walks, right now, \n                         all charges dropped.\n\n               Simms hesitates, then --\n\n                                     SIMMS\n                         If what she says is any good, I'll \n                         deal. If it isn't, then nobody goes \n                         anywhere.\n\n                                                                    CUT TO:\n\n               INT. HALLWAY - CRIMINAL COURTS BUILDING - DAY\n\n               Cynthia is lead down the hall by GUARDS. They enter an office.\n\n               INT. OFFICE - CRIMINAL COURTS BUILDING - DAY\n\n               Agents Simms, Hooker, Sarkasian and TWO TECHNICIANS are \n               waiting inside with Arthur. Cynthia is lead into the room. \n               The guards withdraw, closing the door.\n\n               Cynthia looks at the men, then at the TAPE RECORDING EQUIPMENT \n               on the table and the empty chair. A MICROPHONE is waiting.\n\n               Cynthia looks at Arthur, then sits down in the chair.\n\n                                                                    CUT TO:\n\n               EXT. CRIMINAL COURTS BUILDING - DAY\n\n               REPORTERS swarm around Arthur and Joe as they exit the \n               courthouse.\n\n                                     REPORTERS\n                         How does it feel to be a free man \n                         again?\n\n               Arthur and Joe head down the steps to a waiting LIMOUSINE.\n\n                                     REPORTERS\n                         Do you remember everything that \n                         happened to you? What are your plans?\n\n                                     WILLIAM\n                         I just want to go back to work.\n\n                                     REPORTERS\n                         As a surgeon?\n\n                                     WILLIAM\n                         Yes.\n\n                                     REPORTERS\n                         What about the signed confession, \n                         did the police coerce you into signing \n                         it?\n\n                                     ARTHUR\n                         I'm sorry, no more questions.\n\n               They get into the back of the waiting limo and it pulls away.\n\n               INT. LIMOUSINE - DAY\n\n               Nathan is in the back, staring at Joe. Arthur sits next to \n               Joe. Nathan smiles. Joe smiles.\n\n                                     NATHAN\n                         Good to have you back, Will.\n\n                                     WILLIAM\n                         ...I'd like to make one stop.\n\n                                     NATHAN\n                         I know.\n\n                                                                    CUT TO:\n\n               EXT. CEMETERY - DAY\n\n               The limousine is parked curbside. Nathan and Arthur wait. \n               Watching Joe walk across the lawn. He stops, looking down.\n\n               The grave stones are for his wife and two children. He sits \n               down beside them. It's very near where Agent Hudd was buried.\n\n                                                                    CUT TO:\n\n               EXT. THE MCCALL MANSION - DUSK\n\n               Giant party in progress. Expensive cars parked along the \n               drive.\n\n               INT. MCCALL MANSION - DUSK\n\n               Filled with well-wishers in TUXES and GOWNS. Arthur Bailor \n               and Elliot in attendance. Elliot isn't used to this much \n               glory, but he's taking credit where where he can -- with one \n               of the PRETTY YOUNG WOMEN.\n\n                                     ELLIOT\n                         -- you know, it just didn't make \n                         sense, a man wanting to be punished \n                         for a crime? How many times does \n                         that happen? Once in a lifetime, I \n                         can tell you.\n\n               CAMERA MOVES to Arthur, who is also receiving his share of \n               the credit.\n\n                                     ARTHUR\n                         -- to tell the truth, I had no other \n                         witnesses to refute her testimony. \n                         But she didn't know that. All we \n                         knew was that she was reluctant to \n                         testify. You look for signs.\n\n               And CAMERA CONTINUES TO Joe and Nathan.\n\n                                     A MAN\n                         My God, we thought you were dead, \n                         you know. It's just incredible that \n                         you're here.\n\n                                     A WOMAN\n                         Life moves in such strange ways. Oh, \n                         I just think what might've happened \n                         to you had you not been arrested for \n                         killing that poor policeman. You \n                         still might be on the street.\n\n               Joe just takes it all in, smiling and nodding.\n\n                                     ANOTHER WOMAN\n                         Joe, you look wonderful. After what \n                         you've been through... I just can't \n                         imagine.\n\n                                     ANOTHER MAN (SINCLAIR)\n                         When you're ready to come back to \n                         work, let me know. I've already spoken \n                         to the board, they're ready to re-\n                         certify you anytime. I can put you \n                         in the emergency sector until you \n                         get warmed up. We all want you back. \n                         We can't afford to waste someone of \n                         your talent.\n\n               A beat, then Joe smiles.\n\n                                     WILLIAM\n                         ...I'm ready.\n\n               A BLACK TUXEDO WIPES past CAMERA as we --\n\n                                                                    CUT TO:\n\n               BLACK SCREEN. We HEAR the POUNDING of the MUSIC -- a FAMILIAR \n               RHYTHM. And in GRAFFITI across the screen:\n\n                                    FOUR MONTHS LATER\n\n               EXT. STRIP JOINT - NIGHT\n\n               The neon blares as usual.\n\n               INT. STRIP JOINT - NIGHT\n\n               And there's Cynthia. Back bumping and grinding to the music. \n               He life hasn't changed at all. And she knows it. But there's \n               nothing else she can do.\n\n                                                                    CUT TO:\n\n               INT. CYNTHIA'S APARTMENT - NIGHT (EARLY MORNING)\n\n               Door opens. Cynthia enters. Shuts the door. Tries the light. \n               It doesn't go on. Suddenly a man is next to her --\n\n                                     MAN'S VOICE (DIVINCI)\n                         I guess you had no choice.\n\n               Cynthia tries to move, but a hand grabs her arm. And now we \n               see Divinci. He looks like hell. A man on the run. Desperate \n               and dangerous. He hasn't shaved. His clothes are filthy. He \n               looks like... Joe. Cynthia looks up at him.\n\n                                     DIVINCI\n                         You had to do the right thing.\n\n                                     CYNTHIA\n                         What d'you want?\n\n                                     DIVINCI\n                         What do I want?\n\n               Divinci suddenly shoves her hard across the room.\n\n                                     DIVINCI\n                         Why're you asking me that? You gonna \n                         grant me three wishes? I don't know \n                         where to start. Let's see... money \n                         would be nice... love would be \n                         better... but a little loyalty... \n                         you can never get enough of that.\n                              (moves up to her)\n                         ...But we'll start with... money.\n\n               Divinci pushes her into the bedroom.\n\n               INT. BEDROOM - NIGHT (EARLY MORNING)\n\n               Cynthia goes to her closet, pulls out a box, opens it. It's \n               got her savings.\n\n                                     CYNTHIA\n                         This is all I've got.\n\n               Divinci grabs the money and stuffs it into his jacket pocket.\n\n                                     CYNTHIA\n                         They'll catch you.\n\n                                     DIVINCI\n                         I don't think so.\n\n                                     CYNTHIA\n                         You wanna bet?\n\n                                     DIVINCI\n                         They don't have a clue, baby. And \n                         you wanna know why? Because I am \n                         following my heart.\n\n               Divinci puts aside his gun. And pushes Cynthia down on the \n               bed. He leans in close to her. Face to face.\n\n                                     DIVINCI\n                         And they don't know where that is.\n\n                                     CYNTHIA\n                         So tell me about your plans. I think \n                         I'd like to hear 'em now.\n\n               Divinci looks at Cynthia for a moment, almost with remorse.\n\n                                     DIVINCI\n                         Loyalty is what it all comes down \n                         to. Nothing holds together when it's \n                         gone. And once it's gone, you don't \n                         ever get it back... You shouldn't've \n                         told 'em.\n\n                                     CYNTHIA\n                         I shouldn't've done a lotta things \n                         in my life. But that's not one of \n                         'em.\n\n                                     DIVINCI\n                         Let me tell you something... the \n                         only difference between a liar and a \n                         witness is that just one of 'em knows \n                         what he's doing.\n\n               INT. LIVING ROOM - NIGHT (EARLY MORNING)\n\n               It is dark and quiet. No clue as to what's going on inside. \n               And we hold on this for a long moment. Just wondering what's \n               she being made to do. And then there's a MUFFLED BOOM. Divinci \n               exits the bedroom quickly. He is upset. We HEAR the DOOR \n               close.\n\n               AND WHITE FEATHERS\n\n               fall like snow flakes on Cynthia's body draped across the \n               bed. The pillow on the floor beside her with the stuffing \n               blown out. She has a hole in her chest, right above her heart.\n\n                                                                    CUT TO:\n\n               INT. BAIL BOND OFFICE - EARLY MORNING\n\n               Manny unlocks the door, enters his office.\n\n                                     DIVINCI'S VOICE\n                         Shut the door and lock it.\n\n                                     MANNY\n                         Jesus Christ!\n\n               Manny looks toward the voice. Divinci is sitting on the floor \n               out of sight. Holding his revolver.\n\n                                     MANNY\n                         You scared the shit outa me.\n\n                                     DIVINCI\n                         Lock the door.\n\n               Manny locks the door.\n\n                                     DIVINCI\n                         One more favor, Manny.\n\n                                     MANNY\n                         Since when did I become such a good \n                         guy?\n\n                                     DIVINCI\n                         I'm takin' some time off. I want a \n                         car, here tonight, and a driver. You \n                         can do that for your old friend, \n                         right?\n\n                                     MANNY\n                              (disgusted)\n                         Yeah, I can do that. But you are a \n                         hot fuckin' potato. And drivers that \n                         don't talk, don't come cheap.\n\n                                     DIVINCI\n                         I got the money. Just put it together.\n\n                                                                    CUT TO:\n\n               EXT. HOSPITAL - EARLY MORNING\n\n               An AMBULANCE races up to the EMERGENCY entrance.\n\n               INT. HOSPITAL - EARLY MORNING\n\n               TWO PARAMEDICS push the gurney down the hall. Cynthia is \n               conscious on the gurney. Looking up at the ceiling. She is \n               fading. We HEAR --\n\n                                     VOICES\n                         -- come on, hang in there, hold on.\n\n               CYNTHIA'S (MOVING) P.O.V OF THE CEILING and FACES.\n\n               The gurney pushes past and CAMERA PICKS UP TWO SURGEONS moving \n               out of an Operating Room. Pulling off masks and rubber gloves \n               bloody from surgery. One of them is Joe. The other surgeon \n               pats him on the back.\n\n                                     OTHER SURGEON\n                         Just like riding a bike.\n\n               Joe finally breathes a sigh of relief and manages a smile.\n\n                                                                    CUT TO:\n\n               BLACK LINCOLN - EXT. BAIL BOND OFFICE - NIGHT\n\n               pulls up in front of the office. Tinted windows.\n\n               INT. BAIL BOND OFFICE - NIGHT\n\n               Manny is looking out the window.\n\n                                     MANNY\n                         Leather upholstery, moon roof, CD. \n                         What more could you ask for?\n\n               Divinci looks out. Gun in hand. He's cleaned himself up. \n               He's now wearing a Hawaiian shirt, slacks. A traveler.\n\n                                     DIVINCI\n                         Better not be a set up.\n\n                                     MANNY\n                         Want me to hold your hand?\n\n                                     DIVINCI\n                         Just walk me to the door.\n\n               EXT. BAIL BOND OFFICE - NIGHT\n\n               The Lincoln idles at the curb. Divinci and Manny exit the \n               office. Divinci glances up and down the street as they move \n               toward the car. Manny opens the back door. Nobody inside.\n\n                                     DIVINCI\n                         I think I'll let you live.\n\n                                     MANNY\n                         You are a real prince. Now how about \n                         my money?\n\n               Divinci hands Manny a wad of cash from his pocket, then gets \n               into the back of the car.\n\n                                     DIVINCI\n                         You never saw me.\n\n                                     MANNY\n                         Don't I wish that were true.\n\n               He closes the door. The Lincoln pulls away. Manny watches it \n               move off down the street.\n\n                                     MANNY\n                         Have a nice trip.\n\n               INT. LINCOLN - NIGHT\n\n               Driving. Divinci in the back. Can only see the DRIVER'S EYES \n               in the REAR VIEW MIRROR.\n\n                                     DIVINCI\n                         Head south. Get on the interstate. \n                         Don't break the speed limit.\n\n               Divinci settles into the leather seat. Looks at the rear \n               view mirror.\n\n                                     DIVINCI\n                         You know, the one thing about life... \n                         you can never lose your sense of \n                         humor. Without it, you got nothin'.\n\n               Suddenly the driver turns around, holding a 9mm and fires. \n               BLAM. BLAM. BLAM. Divinci's head snaps back as the BACK WINDOW \n               BLOWS OUT of the Lincoln.\n\n               And now we recognize the driver. It's Clyle D. Dunner.\n\n                                     CLYDE\n                         Fuckin' A.\n\n               THE LINCOLN\n\n               moves right into CAMERA. BRIGHT HEADLIGHTS filling the screen. \n               The car stops. We HEAR the DOOR OPEN and RUNNING FEET. And \n               PAN INTO THE BRIGHT HEADLIGHTS GLARING into CAMERA.\n\n                                                                    CUT TO:\n\n               SURGICAL LIGHTS - INT. OPERATING ROOM - NIGHT\n\n               SHINING BRIGHTLY into CAMERA.\n\n                                     MAN'S VOICE\n                         -- run the cardioplegia.\n\n               Faces appear. Looking down. We recognize Joe and one of the \n               friends from the party -- Sinclair.\n\n                                     WILLIAM\n                         She's fibrilating. Go on bypass.\n\n               Faces move away as we HEAR MEDICAL MACHINES in operation. A \n               NURSE reappears. CAMERA MOVES back now, revealing the room. \n               And the operation in progress.\n\n                                     SURGEON SINCLAIR\n                         Forceps.\n                              (A nurse hands him \n                              forceps)\n                         Just like old times.\n\n                                     WILLIAM\n                         I wouldn't have done this without \n                         you... I owe you.\n\n                                     SURGEON SINCLAIR\n                         Lucky to have a donor. Never would've \n                         survived the night. Have a suture \n                         ready.\n\n                                     NURSE\n                              (picks up suture)\n                         I heard it was a cop's heart.\n\n               Joe looks at the nurse.\n\n                                     NURSE\n                         He was shot in the head a couple \n                         hours ago.\n\n               CAMERA PUSHES IN ON JOE\n\n                                     NURSE\n                         They think it was gang related.\n\n               The BRIGHT LIGHTS OVERHEAD bleed the scene to WHITE and we --\n\n                                                               DISSOLVE TO:\n\n               WAVES - DAY\n\n               crashing on white sand. PANNING with the clear blue water \n               racing up the sand to a woman in a bathing suit, sitting \n               alone. We PAN UP HER LEGS, past her stomach, to her CHEST \n               where we see a SCAR ABOVE HER HEART.\n\n               We CONTINUE UP TO HER FACE NOW. It's Cynthia. Staring out at \n               the ocean. Palm trees behind her. She's beautiful. She leans \n               back, hands behind her and... She smiles. Her life has \n               changed. And we HEAR HAWAIIAN SLACK KEY GUITAR MUSIC as we --\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\nGang Related\nWriters :   Jim Kouf\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Vice police detectives Frank Divinci (James Belushi) and Jake Rodriguez (Tupac Shakur) gun down narcotics dealer Lionel Hudd (Kool Moe Dee), after the three engage illegally in drug trafficking; this is in order to recover the cocaine Hudd purchased from them. When Divinci and Rodriguez find out Hudd was actually a \"deep cover\" DEA agent—because Hudd's partner, Richard Simms (Gary Cole) drops by their precinct for help sniffing out the killers—they try to frame anyone else with the murder. It does not help that Rodriguez has outstanding gambling debts, and that a huge man known only as \"Mr. Cutlass Supreme\" (Tiny Lister) is on his case for it. After arresting numerous felons without success (because they cannot possibly link Hudd's murder to any of them), Divinci and Rodriguez arrest a homeless drunk by the name of Joe Doe (Dennis Quaid). While Joe is still intoxicated, the detectives convince him that he shot Hudd. They even make him sign a confession. Divinci and Rodriguez convince local stripper Cynthia Webb (Lela Rochon), also Divinci's mistress, who was the \"bait\" in their trap for Hudd, to \"identify\" Joe in a police line-up.\nAt his first legal hearing, Joe is declared mentally unfit to stand trial (he can not even remember his own last name). The trial is postponed accordingly. Really believing that he killed Hudd, Joe informs his attorney that he deserves to be in jail and is willing to accept a plea bargain. Meanwhile, it turns out that the Magnum that Rodruiguez stole from the police-evidence room to kill Hudd is that of Clyde David Dunner, a murderer and arsonist arrested by Divinci and Rodruiguez and whose case is currently being tried. To fill the void, Divinci gets another gun to replace the other, but during trial Dunner recognizes that this one is not his gun and the case is dropped for lack of evidence.\nAt Joe's second hearing, high-profile lawyer Arthur Baylor (James Earl Jones) attends the proceedings. Baylor reveals that his client's name is actually William Dane McCall, and that he is actually the missing-and-presumed-dead co-heir to the financial empire of a high-status family, as well as a surgeon who used to attend and help the poor. Baylor asks the court to grant a one-week continuance so he can prepare his defense properly. The court agrees. Afterwards, Cynthia is summoned to testify in court. Nervous and afraid, she disappears. Divinci, fearing that she may betray him, hires a bail agent named Manny (Terrence C. Carson) to locate her; when Manny's efforts fail, he is roughed up by Divinci and Rodriguez. Cynthia is finally discovered and brought in for The People vs. William Dane McCall. She gives her rehearsed testimony against \"Joe\", at which time William informs Baylor that he lived in an alley next to Cynthia's apartment. Baylor questions Cynthia and points to the contradictions in her testimony until she finally confesses to knowing \"Joe\". The fact that she knows the defendant as \"Joe\" and not as \"William Dane McCall\" shows that she had previous knowledge of the defendant, thus proving her testimony for \"Joe\" being Hudd's killer to be false. She is arrested for perjury while the verdict of William's case remains pending. Divinci hires Manny to get Cynthia out of jail. He plans to kill her before she can testify.\nOn their way to \"silence\" her, Rodriguez tells Divinci how he feels regarding the numerous murders they have committed. Divinci suddenly suspects his partner of taping their conversation; such indeed turns out to be the case, after Divinci forcibly searches Rodriguez. Rodriguez informs Divinci that he has already confessed to the DEA regarding what they have done. Unwilling to kill Rodriguez here and now, Divinci renounces their friendship and drives off into the night. Rodriguez returns home to find his bookie and Mr. Cutlass Supreme waiting for him. Enraged about the preceding events, he attacks them only to be shot dead. Cynthia is brought to court by Baylor, who strikes a deal with her to testify against Divinci and thus get her perjury case dropped.\nFour months later, Frank has become a fugitive. Knowing that Cynthia blew the whistle on him, he breaks into her home. He takes her money, then shoots and mortally wounds her. Cynthia is rushed to an emergency room at the local hospital, where Doctor William Dane McCall prepares to salvage her organs for needy recipients...despite Frank's previous statement that \"they'll never use your best parts\".\nDivinci forces Manny to help smuggle him out of the country. Manny hires a luxurious car and a driver for Frank. Unfortunately for Divinci, said driver turns out to be Clyde David Dunner...who produces the same revolver used to kill Hudd. He shoots Frank in the head, then abandons the car and body in a deserted alley."}