{"title": "Get Shorty", "full_text": "\"GET SHORTY\"\ntitle=\"style1\">\n\n\n\n<br><b><!--\n<br></b>if (window!= top)\n<br>top.location.href=location.href\n<br><b>// -->\n<br></b>\n\n\n\n\n\n\n\n\n\nGET SHORTY\n\nScreenplay by Scott Frank \n\nBased on the novel by Elmore Leonard\n\n\n\nBLACK \n\nMAN'S VOICE\nLooks fuckin' cold out there. \n\nEXT. VESUVIO'S RESTAURANT -- MIAMI DAY \n\nIt is cold. People walk by hugging themselves, pulling up their collars, etc. \n\nINT. VESUVIO'S RESTAURANT -- SAME TIME \n\nCHILI PALMER, late thirties, sits in a booth with TOMMY CARLO, a low level mob type. Chili smokes a cigarette, stares out the window at the people on the street. \n\nTOMMY\nGuy on the radio said it's gonna get down to thirty-four. \n\nChili watches a woman on the sidewalk pause to tighten the scarf around her neck . . . She looks in the window, sees Chili looking out. \n\nTOMMY\nThirty-four -- that's freezing, for Christ sake.\n(then)\nYo, Chili, you're spacin'. \n\nChili turns and studies Tommy a moment, then . . . \n\nCHILI\nThey're closing the Granview. You know, theater down on Biscayne? \n\nTOMMY\nYeah, the guy owes Momo a few G's. \n\nCHILI\nWhat I'm thinkin' is maybe Momo could buy it. \n\nTommy looks at him. \n\nCHILI\nMomo could buy it, I could run it for him. Show some Cagney films. \n\nTOMMY\nWhat's Momo gonna want with an old place, shows old movies people don't care about no more. Outside of maybe turnin' it into a porno house, I don't think he's gonna give much of a fuck. And you already got a job. \n\nChili looks back out the window again. \n\nCHILI\nYeah. \n\nWe hear LAUGHTER O. S. and then FOCUS on the window so that Chili can now see a GROUP OF MEN reflected there, sitting at a table nearby. We hear MORE LAUGHTER and now Chili turns and looks over at . . . \n\nRAY \"BONES\" BARBONI \n\nMob guy\ntall, loud suit with lots of jewelry. As he gets up from the table, the other men around the table follow his lead as he finishes up some jokes . . . \n\nMOB GUY\n. . . so the guy says, I'm not the tailor, I'm the undertaker. \n\nThe men laugh again, more out of respect than appreciation. Ray Bones turns, sees . . . \n\nCHILI and Tommy sitting in their booth. Tommy, sucking on a toothpick, waves. \n\nTOMMY\nRay. How you doing? \n\nRAY BONES\nOkay, Tommy. You? \n\nTOMMY\nOkay. \n\nBones focuses on Chili, waits for acknowledgement. But Chili turns back to the window. Always the peacemaker, Tommy smiles at Bones again . . . \n\nTOMMY\nYou believe this weather, Ray? Miami Beach, for Christ's sake. \n\nRAY BONES\n(ignoring him)\nChili Palmer.\n(smiles)\nChilly outside. Chili inside. It's a regular fuckin' chili-fest. Hey, waiter -- give Mr. Chili Pepper a big fuckin' bowl of chili! \n\nAgain the men all laugh respectfully at Ray Bone's stupid joke. Chili smiles the best he can at the idiot . . . \n\nCHILI\nGood to see you, Ray. \n\nHe turns back to the window, watches Ray Bones in the reflection, still cracking up as he and his men head for the front of the restaurant. Tommy looks at Chili for a moment, then stands up . . . \n\nTOMMY\nYou done starin' out the window, I'll see you back at the office. \n\nChili nods, but still doesn't turn from the window. He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day. \n\nTOMMY\nJesus. It's freezin'! \n\nChili then puts out the cigarette, nods to the waiter who comes over with the check. \n\nINT. RESTAURANT COATROOM -- A FEW MINUTES LATER \n\nFrom inside the tiny room. A couple of ratty rain coats and an old flight jacket hang to one side in immediate f.g. as Chili steps into the doorway and freezes. He looks o.s. and whistles . . . \n\nCHILI\nHey. \n\nA moment later the MANAGER, an old Italian guy in a black suit, joins him in the doorway. \n\nCHILI\nWhat happened to my coat? \n\nThe Manager peers into the room . . . \n\nMANAGER\nIt's not one of these? \n\nCHILI\nYou see a black leather jacket, fingertip length, like the one Pacino wore in Serpico? You don't, you owe me three seventy-nine. \n\nMANAGER\nMaybe you don't see my sign? \n\nThe manager points to a sign on the wall\n'WE CANNOT BE RESPONSIBLE FOR LOST ARTICLES.' \n\nCHILI\nLook, I didn't come down to sunny Florida to freeze my ass. You follow me? You get the coat back or you give me the three seventy-nine my ex-wife paid for it at Alexander's. \n\nThe Manager looks o.s., and begins speaking in Italian. Chili reacts as we hear the name RAY BARBONI mentioned a couple of times. \n\nMANAGER\nExplain to him how Mr. Barboni borrow the coat. \n\nA WAITER joins Chili and the Manager in the doorway. \n\nCHILI\nRay Bones took my coat? Just now? \n\nWAITER\nHe didn't take it. He borrow it. See, someone took his coat, you know . . .\n(indicates flight jacket)\n. . . leave this old one. So Mr. Barboni, he put on this other coat that fit him pretty good. \n\nCHILI\nYou mean my coat. \n\nWAITER\nHe was wearing it, you know, to go home. He wasn't gonna keep it. \n\nCHILI\nMy car keys were in that coat. \n\nMANAGER\nWe call you a taxi. \n\nCHILI\nLemme get this straight. You aren't responsible for any lost articles like an expensive coat of mine, but you're gonna find Ray Bones' coat or get him a new one? Is that what you're telling me? \n\nMANAGER\nMr. Barboni a good customer.\n(making sure to add)\nWorks for Jimmy Capp. \n\nCHILI\nI know who he works for. Where's your phone. \n\nINT. TOMMY CARLO'S CAR -- DAY \n\nTommy drives. Chili stares straight ahead, rubs his hands together, tries to stay warm . . . \n\nTOMMY\nYou sure it was Ray Bones took the coat? \n\nCHILI\nThat's what the guy said. \n\nTOMMY\n(nervous now)\nTomorrow, I see on the TV weather, it's gonna be nice and warm. You won't need the coat. \n\nChili points out the window. \n\nCHILI\nThis is it. \n\nEXT. VICTOR HOTEL -- DAY \n\nAs Tommy pulls up out front. \n\nINT. CAR -- SAME TIME \n\nTommy looks up at the hotel as Chili takes a pair of leather gloves from top of the dash, opens the door. Tommy looks over at him. \n\nTOMMY\nHey, Chili.\n(Chili pauses)\nGet your coat, but don't piss the guy off, okay? It could get complicated and we'd have to call Momo to straighten it out. Then Momo gets pissed for wasting his time and we don't need that. \n\nCHILI\nDon't worry about it. I won't say any more than I have to, if that. \n\nEXT. STAIRS -- DAY \n\nChili pulls on the gloves as he goes up the stairs to the third floor. \n\nEXT. DOOR -- DAY \n\nAs Chili knocks on the door three times. He waits, pulls the right-hand glove on tight, so that when RAY BONES opens the door, Chili nails him. One punch. No need to throw the left. \n\nRAY BONES\nJesus . . . Oh, God . . . \n\nChili then steps over him into the room and grabs his coat from a chair. He looks over at Ray Bones bent over, blood running from his nose and mouth, blood all over his hands, his shirt. \n\nRAY BONES\nFuck, man . . . \n\nChili walks out. Doesn't say one word to Ray Bones. \n\nEXT. BARBER SHOP -- DAY \n\nA warmer day. The sun is shining. All is quiet. \n\nINT. BARBER SHOP -- SAME TIME \n\nThe place is empty except for FRED and ED, the two old barbers sitting in the chairs, reading newspapers. \n\nED\nYou been there, haven't you? \n\nINT. BARBER SHOP BACKROOM -- SAME TIME \n\nA room Tommy and Chili use as an office. Chili sits at the desk making entries in the collection book. We can hear the two old barbers talling o.s. . . \n\nFRED O.S.\nParis? Yeah, I been there plenty times. It's right offa Seventy-nine. \n\nED (O.S.)\nHell it is. It's on Sixty-eight. Seventeen miles from Lexington. \n\nFRED O.S.\nWhat're you talking about, Paris, Kentucky, or Paris, Tennessee? \n\nSilence. No answer to the question. Chili look up from the collection book, listens a moment to nothing. \n\nHe opens the desk drawer and pulls out a .38. He aims the gun at the open doorway . . . \n\nOVER CHILI'S SHOULDER \n\nAs Ray Bones, a bandage on his nose, appears in the back hall, then the doorway to the office, his face showing surprise to see a gun aimed at him . . . \n\nRay Bones begins firing the big Colt auto in his hand, maybe before he's ready, the gun making an awful racket, when Chili pulls the trigger, shooting Ray Bones along the top of his head, creasing him from hairline to crown. \n\nChili calmly gets to his feet. Aims once more -- probably lower this time -- but doesn't fire as Ray Bones grabs his head and stumbles out of there. \n\nRAY BONES (O.S.)\nSomebody call 9 fucking 111. \n\nEXT. MIAMI HARBOR -- DAY \n\nRay Bones, a bandage on his head now as well as his nose, sits on a cigarette boat with his boss, JIMMY CAP and two bikini clad BABES, both of whom rub lotion on Jimmy. \n\nJIMMY\nWhatta you want me to do Ray? Go to war over a fuckin coat? You're lucky the guy didn't kill you. The coat was a Christmas present for Christ's sake. \n\nRAY BONES\nYou gotta do somethin', Jimmy. This man's got no respect for us. \n\nJIMMY\nHe's got no respect for you, and I don't gotta do shit. Chili Palmer don't work for me, he works for Momo up in Brooklyn. So as long as Momo's around, nothing happens to Chili Palmer. You understand? \n\nAs an angry Ray Bones sits back, we . . . \n\nFADE TO BLACK \n\nEXT. BROOKLYN STREET -- NIGHT \n\nWe TILT DOWN to REVEAL a dark Brooklyn street as a black Cadillac pulls to a stop in front of an older building. \n\nVOICE\nMomo. We're here. \n\nTwo big guys, BODYGUARDS, get out of the car. One of them opens the back door for a huge man, MOMO, who gets out of the car and looks up at the dark building . . . \n\nMOMO\nYou check this place out good? If I'm going up alone, I don't want no surprises. \n\nBODYGUARD\nI checked it out, boss. \n\nINT. BROOKLYN TENEMENT BUILDING -- NIGHT \n\nMomo eyes the bodyguards -- both nervous -- then starts up the steps. We follow Momo as he enters the building, goes up the dark stairwell . . . up one flight . . . we're behind him the whole time . . . \n\nWhen he gets to the top floor, Momo pauses to catch his breath, before moving on down the hall to a door. Momo knocks. \n\nVOICE\nYeah? \n\nMOMO\nIt's Momo. \n\nVOICE\nCome in. \n\nMomo slowly opens the door . . . when, suddenly, the apartment is FLOODED WITH LIGHT so that we see a room full of PEOPLE, a banner on the back wall reading 'HAPPY SIXTY-FIFTH, MOMO!' \n\nEVERYONE\nSurprise! \n\nSilence as Momo drops to his knees, gurgles something we can't understand and falls over. Suddenly a dozen faces are looking down on us as we then . . . \n\nCUT TO\nEXT. BARBER SHOP -- DAY \n\nA beautiful day in Miami. \n\nCHILI (V.O.)\nSo what're you tellin' me, you're never gonna go to sleep again? \n\nINT. BARBER SHOP -- DAY \n\nChili and Tommy each sit in a barber chair, reading the newspaper while Fred and Ed sit nearby playing checkers. \n\nTOMMY\nNo, I said I'm never goin' to bed. There's a difference. See, the article says most people die in their beds. I figure long as I stay outta bed, I'm safe. \n\nCHILI\nThat's the dumbest thing I ever heard. Where do you sleep? \n\nTOMMY\nIn an armchair. Or I go to a coffee shop, sleep there. Sit in a booth, pull my hat down. \n\nA car pulls up. Chili's no longer listening to Tommy, but now watching as Ray Bones and a BLACK GUY get out of the car. \n\nTOMMY\nHow many people you hear ever die in a coffee shop? \n\nTommy looks over as Ray Bones -- smaller bandage on the top of his head -- and his man enter the shop. \n\nRAY BONES\nYou cut straight hair in this place, or just fags? \n\nCHILI\nHey, Bones, looks like you're gonna have a nice scar up there. Maybe these guys can fit you with a rug, cover it up for ya. \n\nRay Bones eyes Chili, then nods to Fred and Ed. \n\nRAY BONES\nWhy don't you geezers take your game over to the park. \n\nThe two guys leave as the Black Guy steps up to Chili . . . \n\nBLACK GUY\nThis man is the man, you understand what I'm saying? He's Mr. Bones, you speak to him from now on. \n\nChili exchanges a look with Tommy, watches as 'Mr. Bones' goes down the hall into the back office, then turns to the black guy . . . \n\nCHILI\nYou can do better'n him. \n\nBLACK GUY\nNot these days. Not less you can talk Spanish. \n\nRay Bones comes out with the collection book open, looking at all of the names of who owes what. \n\nRAY BONES\nYou got a miss. Leo Devoe. Guy's six weeks over. \n\nCHILI\nHe died. \n\nRAY BONES\nHow'd you know he died, he tell you? \n\nRay Bones checks his man to get some appreciation, but the guy's too busy looking at the hair rinses and shit on the connter. \n\nCHILI\nYeah, he told me. \n\nRAY BONES\nPersonally? \n\nCHILI\nYeah, Ray, he personally told me he got killed in that Get Away Airlines' jet went down last month. \n\nRAY BONES\nWhat Get Away jet? \n\nCHILI\nIt was in the Herald. \n\nRAY BONES\nYeah, well, maybe the guy took out flight insurance. Check with the wife. \n\nCHILI\nHey, it's your book now. You want to check it out, go ahead. He's got a dry cleaning business out on Federal Highway. \n\nTommy gives Chili a look as the Black Guy comes over to Chili, stands next to him. Ray Bones steps over to Chili . . . \n\nRAY BONES\nMomo's dead. Which means anything was his now belongs to Jimmy Capp, including you. \n\nTommy watches as the Black Guy picks up a pair of scissors, runs his hand along the edge . . . \n\nRAY BONES\nWhich also means when I speak, I'm speakin' for Jimmy. So e.g. as of now, you start affording me the proper respect. \n\nCHILI\n'e.g.' means 'for example', Ray. I think what you wanna say is 'i.e.' \n\nRAY BONES\nBullshit. E.g. is short for 'ergo'. \n\nCHILI\nAsk your man here. \n\nRay Bones looks at the Black Guy. \n\nBLACK GUY\nBest a my knowledge, e.g. means 'for example.' \n\nRAY BONES\nE.g., i.e., fuck you. The point is, I say jump, you say okay. Okay? \n\nTOMMY\n(for Chili)\nYeah, Ray. Okay. \n\nRay Bones then nods to his man who grabs Chili, holds the point of the scissors to Chili's throat . . . \n\nRAY BONES\nYou owe me the dry cleaner's fifteen grand plus the juice which is what another, uhh . . . \n\nCHILI\nTwenty seven hundred. \n\nRAY BONES\nExactly. You either get it from the wife or out of your own pocket, I don't give a fuck. You don't ever hand me a book with a miss in it. \n\nRay throws the book at Chili and walks out, his man right behind him. Chili looks over at Tommy. \n\nTOMMY\nI told you not to -- \n\nCHILI\nDon't say a fuckin' word. \n\nEXT. FAY DEVOE'S BACKYARD -- DUSK \n\nWhere Chili sits with FAY DEVOE -- thirties, attractive, in a sundress -- on her patio. They each have a drink . . . \n\nFAY\nI hate the dry cleaning business. I hate being inside all day, around all those machines. \n\nCHILI\nMust be hot. \n\nFAY\nYou have no idea how hot it is. \n\nShe looks at him. Touches her drink to the side of her face. Chili finishes his drink, sets it down. \n\nCHILI\nI was wondering, Fay, if Leo had any life insurance. \n\nFAY\nI don't know of any. \n\nThey sit there in silence a moment. Fay reaches over, puts a hand on his leg . . . \n\nFAY\nI trust you, Chili. I think you're a decent type of man, even if you are a crook. \n\nCHILI\nThank you Fay. \n\nShe finally looks at Chili . . . \n\nFAY\nI wish he really was dead, the son of a bitch. \n\nEXT. LAS VEGAS -- NIGHT \n\nThe strip. Mesas Casino. \n\nCUT TO\nCLOSE UP OF PHOTOGRAPH \n\nLeo Devoe. Standing with Fay at Epcot Center. \n\nDICK (V.O.)\nThat's him all right. \n\nPULL BACK TO REVEAL INT. DICK ALLEN'S OFFICE -- NIGHT \n\nA sign on the door reads \"DICK ALLEN, CUSTOMER RELATIONS.\" A bank of video monitors show the floor of the casino. Chili sits across the desk from DICK ALLEN -- lots of jewelry, a giant NEON COWGIRL out the window behind him. \n\nDICK\nCalled himself Larry DeMille. Hit on every showgirl in town. Would tell 'em he was the 'Martinizing King of Miami'. What a moron. \n\nHe returns the snapshot to Chili. \n\nDICK\nAnyway, you want this guy, he's in L.A. We put him on a flight after he spanked one a my cocktail girls in the Keno room. \n\nCHILI\nLeo spanked a waitress? \n\nDICK\nApparently, way it went, he invited her to come to Santa Anita to play the ponies with him. She told him what to do with that and he gave her one on the tush. My guess, he's by his lonesome at the track right now. \n\nChili nods. \n\nDICK\nHey, Chil? Since you're goin' out to L.A. anyway. \n\nCHILI\nWhat've you got? \n\nDICK\nGuy owes us a hundred and fifty grand, sixty days over; a movie producer. \n\nCHILI\nMovie producer? Yeah, why not. \n\nAs Dick Allen reaches for a pad of paper, we hear THE SOUND OF AN AIRPLANE OVER. . . . \n\nEXT. LAX RENTAL CAR LOT -- NIGHT \n\nIt's raining as we TILT DOWN from a LANDING AIRPLANE to a National Car Rental BUS arriving next to a tan MINIVAN. Chili eyes the car a moment, then turns to the driver. \n\nCHILI\nWhat is this? \n\nATTENDANT\nAn Oldsmobile Silhouette. \n\nCHILI\nI reserved a Cadillac. \n\nATTENDANT\nYeah, well, this one's the Cadillac of minivans. \n\nCHILI\nYou're kidding me, right? \n\nATTENDANT\nHey, you want La Tierra Rent-A-Car just over there, but I think all they got are Rabbit convertibles. \n\nChili gives the driver a look then gets out of the bus, standing there in the rain, his seat getting wet, nowhere to go. He turns and stares at the minivan . . . \n\nEXT. KAREN FLORES' HOUSE -- NIGHT \n\nAll the lights are out, save the BLUE GLOW of a television coming from one of the downstairs rooms . . . \n\nWOMAN'S VOICE\n(loud whisper)\nHarry? \n\nINT. KAREN FLORES' BEDROOM -- NIGHT \n\nAs KAREN FLORES, pretty, endowed, sits up in bed wearing a Lakers T-shirt, nothing else. She looks at the big shape lying under the covers beside her. \n\nKAREN\nHarry. \n\nThe shape deesn't move. She shakes it. \n\nKAREN\nHarry, God damn it, somebody's downstairs. \n\nThe shape stirs, rolls over, and we see HARRY ZIMM, balding, overweight; a movie producer. He sits up. \n\nHARRY\nWhat's wrong? \n\nKAREN\nBe quiet and listen. \n\nHARRY\nI don't hear anything. \n\nWe hear VOICES downstairs. \n\nKAREN\nShhh -- there. \n\nAnd now LAUGHTER . . . \n\nHARRY\nSounds like the television. \n\nShe looks at him . . . \n\nKAREN\nWhen I came upstairs, you stayed to finish your drink. I told you to turn off the TV when you were through.\n(an afterthought)\nCome to think of it, I also told you you could sleep in the maid's room. \n\nHARRY\nYeah, well I turned off the set. I used the remote control thing and laid it on the floor. You know what could've happened? The dog came in and stepped on it, turned the TV back on. \n\nKAREN\nI don't have a dog. \n\nHARRY\nYou don't? What happened to Muff? \n\nKAREN\nHarry, are you going down, or you want me to? \n\nHe grunts, gets out of bed. Starts looking around the room for his clothes. Harry looks out the window . . . \n\nHARRY\nAnyone skim the pool? It needs it. \n\nKAREN\nHarry -- \n\nHARRY\nI'm going. \n\nINT. HALLWAY -- SAME TIME \n\nThe MONOTONE VOICES become louder and more distinct as Harry moves down the curved staircase in his shirt and boxer shorts. One of the voices is familiar . . . \n\nWe can see this is a nice place as Harry crosses the entry hall to a doorway, the FLICKERING LIGHT of the television emitting from inside the room. \n\nHarry listens at the door. Yeah, it's David Letterman. \n\nINT. KAREN'S STUDY -- SAME TIME \n\nHarry moves into the glow of the big Sony, the rest of the room dark. On the tube, Dave is interviewing actor Martin Weir when suddenly the screen goes black and the desk lamp comes on. Harry jumps . . . \n\nHARRY\nJesus Christ! \n\nChili leans into the light, keeps his tone quiet, controlled. \n\nCHILI\nHarry Zimm, how you doing? I'm Chili Palmer. \n\nHarry presses a hand against his chest. \n\nHARRY\nJesus, if I have a heart attack, I hope you know what to do. \n\nCHILI\nWhere you been, Harry? \n\nHarry lets his hand slide down over his belly, taking his time, wanting to show that he has it together now. \n\nHARRY\nHave we met? I don't recall. \n\nCHILI\nWe just did. I told you my name's Chili Palmer. \n\nHarry stares back, trying to figure out who this guy is. \n\nHARRY\nYou're in pictures, right? \n\nChili smiles. Doesn't say anything. \n\nHARRY\nDid you stop to think what if I had a heart attack? \n\nCHILI\nYou look okay to me, Harry. Come over here and sit down. Tell me what you been up to. \n\nHarry takes one of the canvas director's chairs by the desk. He looks at a bottle of Dewars sitting there, runs a hand through his hair, thinks about a drink . . . \n\nCHILI\nHarry, look at me. \n\nHarry brings his hand down. \n\nHARRY\nI'm looking at you. \n\nCHILI\nI want you to keep looking right here, okay? \n\nHARRY\nThat's what I'm doing. \n\nCHILI\nYou know Dick Allen, Mesa's Casino? \n\nHARRY\nDick Allen's a very dear friend of mine. How far you want to go with this? \n\nCHILI\nWe're there, Harry. You signed markers for a hundred and a half, you're over sixty days past due and you haven't told anybody what the problem is. \n\nHarry looks at Chili. \n\nHARRY\nJesus Christ, what're you, a collector for a fucking casino? You come in here, walk in the house in the middle of the fucking night? I thought you were an actor, auditioning, for Christ's sake. \n\nChili nods, almost smiles . . . \n\nCHILI\nIs that right? That's interesting. You thought I was acting, huh? \n\nHarry pushes out of the chair, looks down at Chili. \n\nHARRY\nWe'll see about this . . . \n\nHarry grabs the phone, punches the 'O'. \n\nHARRY\nOperator, how do I get Las Vegas Information? \n\nCHILI\nHarry, lemme give you some advice. \n\nChili leans forward, hangs up the phone with his index finger, casually reaches for the rereiver . . . \n\nCHILI\nYou don't want to act like a hard-on, you're standing there in your undies. You know what I'm saying? What you want to do is sit down and talk to me. \n\nHarry sits down. Chili hangs up the phone. \n\nCHILI\nA marker's like a check, Harry. \n\nHARRY\nI know what a marker is. \n\nCHILI\nThey don't want to deposit yours and have it bounce. That annoys them. So your dear friend Dick Allen's been calling, leaving messages on your machine, but you never get back to him. I happen to be in Vegas on another matter, and Dick asks me as a favor would I look you up. I follow you over here, see you in the window with this woman, looks a lot like that actress Karen Flores, was in Grotesque, except she's not blond anymore . . . \n\nHarry's gaze moves to the bottle of scotch on the desk . . . \n\nCHILI\nYou're not looking at me, Harry. \n\nHARRY\nWhy do I have to keep looking at you? \n\nCHILI\nI want you to. \n\nHARRY\nYou gonna get rough now, threaten me? I make good by tomorrow or get my legs broken? \n\nCHILI\nCome on, Harry -- Mesas? The worst they might do is get a judgment against you, uttering a bad check. I can't imagine you want that to happen, man in your position. \n\nHARRY\nFuckin' basketball game. \n\nHarry reaches for the bottle of scotch and pours himself drink. \n\nHARRY\nTell Dick Allen I'll cover the markers in the next sixty days at the most. He doesn't like it, that's his problem. The prick. \n\nHarry starts to take another drink, looks at Chili, not moving. \n\nHARRY\nSo, you want me to call you a cab? \n\nChili shakes his head, keeps staring at Harry, but with a different expression now, more thoughtful, curious. \n\nCHILI\nYou make movies, huh? \n\nHARRY\nI produce feature motion pictures, no TV. You mentioned Grotesque, that happened to be Grotesque Part II that Karen Flores was in. She starred in all three of my Slime Creatures releases you might have seen. \n\nChili nods, leans forward on the desk. \n\nCHILI\nI think I got an idea for a movie. \n\nINT. KAREN FLORES' BEDROOM -- NIGHT \n\nKaren is sitting up in bed, listening. We hear the muffled sonuds of Chili and Harry talking downstairs. She gets out of bed . . . \n\nINT. HALLWAY -- SAME TIME \n\nChili and Harry's conversation gets louder as Karen descends the stairs. She peers into the study, but they're not in there . . . \n\nINT. KITCHEN -- SAME TIME \n\nChili sits with Harry at a butcher block table, a bottle of Dewars and a couple of glasses now between them. \n\nCHILI\nYeah, Leo wore these little plaid hats -- Miami, middle of the summer, this guy thinks no one's gonna notice he's balding, he wears a fuckin' hat. \n\nHarry looks up past Chili, smiles. \n\nHARRY\nKaren? \n\nChili turns aronud and sees her standing in the doorway now, her arms folded across that chest, the Lakers T-shirt coming down just past her crotch. \n\nHARRY\nKaren, say hello to Chili Palmer. Chili, this is Karen Flores. \n\nCHILI\nKaren, it's a pleasure. How you doing? \n\nKAREN\nHow did you get in the house? \n\nHARRY\nHe's telling me an idea for a movie. It's not bad so far.\n(motions with his glass)\nSit down, have a drink.\n(to Chili)\nTell Karen, let's see what she thinks. \n\nKAREN\nMaybe you didn't hear me. \n\nCHILI\nThe door from the patio, in back. \n\nKAREN\nYou broke in? \n\nCHILI\nNo, it was open. It wasn't locked. \n\nKAREN\nWhat if it was? \n\nChili doesn't say anything, just watches her, likes the way she's handling it. \n\nHARRY\nYou want to hear this idea? It's about a dry cleaner who scams an airline out of three hundred grand. Go on, tell her. \n\nCHILI\nYou just did. \n\nHARRY\nI mean, the way you told it to me. Start at the beginning, we see how the story line develops. \n\nChili looks at Karen. She leans in the doorway. \n\nCHILI\nWell, basically, this guy owes a shylock fifteen thousand, plus he's a few weeks behind on the vig, the interest you have to pay. \n\nKAREN\nI know what a vig is. \n\nHARRY\nIt's the kind of situation, you don't pay, you get your legs broken. \n\nCHILI\nOr the guy thinks he could get 'em broken. You have to understand the loan shark's in business the same as anybody else. He isn't in it to hurt people. He's in it to make money. \n\nEXT. LEO DEVOE'S HOUSE -- DAY \n\nAs we see Chili talking to Fay on the front porch. \n\nCHILI (V.O.)\nBut the dry cleaner, we'll call him Leo, he's scared, doesn't know any better, so he takes off -- \n\nINT. KAREN'S KITCHEN -- NIGHT \n\nAs Harry jumps in . . . \n\nHARRY\nThat's Miami. He's going to Vegas. He's got a few bucks and he's thinking it's his only chance. \n\nINT. AIRPLANE -- DAY \n\nWe see a fidgety LEO DEVOE, a little guy in a crummy suit and a little green hat sitting there in coach, looking around. \n\nCHILI (V.O.)\nLeo gets on a plane, ready to go, but the plane sits there at the gate, doesn't move. \n\nBehind Leo sits a BRAT with his MOM and DAD. The parents are trying to entertain the kid with the G.I. Joes, other stuff they've brought along, but the kid spots Leo's hat as Leo looks up to listen to an announcement . . . \n\nCHILI (V.O.)\nThey annonnce over the PA there's some kind of mechanical problem, they'll be there maybe an hour, but keep your seats in case they get it fixed sooner. \n\nLeo gets really uncomfortable now . . . \n\nCHILI (V.O.)\nThe guy's nervous, in no shape to just sit there, sweat it out. So he gets off the plane . . . \n\nAs Leo gets up from his seat, the kid knocks off Leo's little green hat, and we . . . \n\nCUT TO\nINT. MIAMI AIRPORT COCKTAIL LOUNGE -- DAY \n\nAs Leo downs a drink, looks around for the waitress . . . \n\nCHILI (V.O.)\nGoes in the cocktail lounge and starts throwing 'em down, one after the other. \n\nHe 's motioning to her for another, when we see a PLANE taxi past the window in the b.g . . . \n\nCHILI (V.O.)\nWhen the plane pulls away from the gate. \n\nINT. KAREN'S KITCHEN -- NIGHT \n\nAs Harry interrupts. \n\nHARRY\nWithout him. The guy's so out of it he doesn't even know it's gone. \n\nCHILI\nThat's right. As a matter of fact . . . \n\nINT. COCKTAIL LOUNGE -- DAY \n\nA shit-faced Leo struggles to keep his head up as he watches the waitress look out the window and gasp . . . \n\nCHILI (V.O.)\nHe's still in the lounge when a plane blows up on the runway . . . \n\nWe see a BIG FIREBALL in the b.g. as Leo's head hits the table. \n\nINT. KAREN'S KITCHEN -- NIGHT \n\nAs Chili lights a cigarette. \n\nCHILI\nSo when the guy finds out it was his flight, he can't believe it. If he'd stayed on that plane, he'd be dead. Right then he knows his luck has changed. If everybody thinks he's dead he won't have to pay back the fifteen or what he owes on the vig, four and a half a week. \n\nChili offers the pack to Karen. Karen doesn't move. \n\nKAREN\nThe interest is four hundred and fifty dollars a week on fifteen thousand? \n\nCHILI\nThat's right. Three percent. \n\nKAREN\nBut a week. That's a hundred and fifty percent a year. \n\nCHILI\nA hundred and fifty-six. Some'll charge you more'n that, go as high as six for five on a short-term loan. So three a week's not too bad. \n\nKAREN\nA real bargain. \n\nShe shakes her head, keeps her arms folded. Chili watches her, likes the way she's giving it to him. \n\nHARRY\nKeep going. \n\nCHILI\nWell, since Leo's name was on the passenger list . . . \n\nINT. AIRPORT HANGER -- DAY \n\nAs an FFA OFFICIAL leads Fay, a black veil over her face, amongst tables full of charred items . . . \n\nCHILI (V.O.)\nThey bring his wife out to the airport where they're going through personal effects, whatever wasn't burned up. Leo's bags were on the plane, so the wife tells 'em what to look for, things only she would know about. \n\nFAY REACTS as the FFA guy points to a LITTLE GREEN HAT on one of the tables. She grabs it, clutches it to her chest, pretends to faint. \n\nINT. KAREN'S KITCHEN -- NIGHT \n\nAs Karen finds herself listening, despite herself. \n\nCHILI\nA couple days ago by, people from the airliner come to see his wife, tell her how sorry they are and all that their plane exploded and offer her a settlement, the amount based on what he would've earned operating the dry cleaner's the rest of his life. Leo had some kind of trouble with his kidneys, so they were giving him about ten years. \n\nKAREN\nHow much is the wife offered? \n\nChili starts to speak, but Harry cuts him off. \n\nHARRY\nThree hundred grand, and they take it, money in hand, babe. The guy has his wife cash the check and he takes off for Las Vegas with the dough. Gets there, he's supposed to call her, tell her when to come out. But she never hears from him again. \n\nMeanwhile, the guy's hot, runs the three hundred up to half a million . . . \n\nCHILI\nHe comes to L.A. . . . \n\nHarry raises his hand to stop Chili. He's rolling, turns to Karen now . . . \n\nHARRY\nIt drives the guy nuts, he's winning but can't tell anybody who he is. You show in a back story his motivation, his desire to be famous, you know, pal around with celebrities, the headliners doing the big rooms. Now he's got the dough to buy his way in, mix with celebs and he can't resist . . . \n\nHarry then turns back to Chili. \n\nHARRY\nSo he comes to L.A. . . . \n\nCHILI\nI don't know about his wanting to meet celebrities, that's something new. But, yeah, he comes to L.A. Then after that, I don't know what happens. \n\nChili looks at Karen. Patient. Not moving. \n\nHARRY\nThat's it? That's your movie? \n\nCHILI\nI said I had an idea, that's all. \n\nHARRY\nThat's half a movie, with holes in it. Maybe forty minutes of screen time. You don't even have a girl, a female lead, and on top of that, there's no one to sympathize with, you don't have a good guy. \n\nCHILI\nThe shylock's the good guy. \n\nHARRY\nThe shylock? He's barely mentioned. And it's not believable the wife would get a settlement that fast. \n\nKAREN\nHarry doesn't realize it's a true story. \n\nThey both look at her now. \n\nKAREN\nThat Miami flight that went down, it was on the news every day for about a week. Harry must've been busy. \n\nHARRY\nThat's where you got the idea? \n\nCHILI\nPart of it, yeah. \n\nHARRY\nWait a minute, you're not the guy, are you? The dry cleaner? \n\nCHILI\nYou mean, Leo? \n\nHARRY\nYou wouldn't be talking to me if you were. \n\nCHILI\nI'm not the guy, Harry. \n\nHARRY\nBut you work for the casino? \n\nCHILI\nI'm out here looking for Leo. I just looked you up as a favor to your dear friend, Dick Allen. \n\nHARRY\nSo you don't work for the casino? \n\nKAREN\nHarry, for God's sake . . . \n\nThey both look at her. \n\nKAREN\nHe's the shylock. \n\nShe's staring at Chili again. Harry turns to him. \n\nHARRY\nIs that right, that's what you do for a living? \n\nCHILI\nWhat I did till recently.\n(looking at Karen)\nAfter I get done here I'll think about what I'm gonna do next. \n\nKAREN\nWith your experience, you could always become an agent. Right, Harry? \n\nHARRY\nYeah, that's what we need. More agents. \n\nKAREN\nWell. I got an audition tomorrow. \n\nHARRY\nNo problem. You go on off to bed. \n\nKaren looks at the two of them sitting there. Not about to move. \n\nKAREN\nWhat I'm saying, Harry, is I want you and your new buddy to get out of my house. \n\nHARRY\nOh, yeah, sure. \n\nCHILI\nNice meeting you, Karen. \n\nShe just looks at him, turns and walks out. Chili watches her go. Harry watches Chili, pours the last of the scotch into Chili's glass . . . \n\nHARRY\nI imagine in your line of work, there were times you had to get rough, you know, say one of your customers stopped paying. \n\nCHILI\nThey always paid. \n\nHarry nods, thinks a moment, then . . . \n\nHARRY\nYou pack a gun? \n\nCHILI\nNot really. \n\nHARRY\nWhat does that mean? \n\nCHILI\nMaybe a few times I have. \n\nHARRY\nEver shot anybody. \n\nCHILI\nOnce. \n\nHARRY\nReally? You ever been arrested? \n\nCHILI\nI've been picked up a couple times. Loan sharking. Racketeering. But I was never convicted. I'm clean. \n\nHARRY\nRacketeering, that covers a lot of ground, doesn't it? \n\nChili looks at him. \n\nCHILI\nWhy don't you get to the point, Harry? You want me to do something for you. \n\nEXT. FAY DEVOE'S HOUSE -- MORNING \n\nAs a Cadillac Eldorado pulls up out front and Ray Bones and his man get out, check out the neighborhood . . . \n\nRAY BONES\nHi, I'm Ray, a friend of Chili Palmer's. \n\nINT. FAY DEVOE'S HOUSE -- MORNING \n\nFay watches as Ray Bones and his man go through her things. \n\nRAY BONES\nHave your spoken to Mr. Palmer since your husband . . . you know, blew up? \n\nFAY\nMaybe once or twice. \n\nRAY BONES\n(coming over)\nWhat was it you talked about? \n\nFAY\nOh, nothing really? This and that. \n\nRay Bones hits Fay Devoe in the face. She drops to her knees and cries out. Ray Bones crouches down in front of her, puts a hand in her hair. \n\nRAY BONES\nFay . . .\n(pulls her head up)\nFay. \n\nShe looks at him. Afraid now, her nose is bleeding. Ray Bones smiles at her, strokes her hair. \n\nRAY BONES\nFay, I want us to be friends. And friends don't hit each other, 'less they have to.\n(she nods)\nSo whatta you say we start all over and you tell me exactly what the fuck is goin' on? \n\nEXT. SUNSET BOULEVARD -- MORNING \n\nAs we BOOM DOWN from a massive billboard for the movie Bonaparte starring Martin Weir as Napoleon and begin tracking with Harry's eight-year-old, battered Mercedes . . . \n\nINT. HARRY'S CAR -- SAME TIME \n\nHarry drives, all the while gesturing with a lit cigarette. \n\nHARRY\nThese guys, my investors, they run a limo service, came to me originally, put money in a few of my pictures and did okay, they're happy. So they come in on another deal -- this was back a few months ago when I was planning what would be my next picture, about this band of killer circus freaks that travel around the country leaving bodies in their wake. The characters, there's this seven-hundred-pound fat lady who has a way of seducing guys, gets them in her trailer -- \n\nCHILI\nHarry, look at me. \n\nHarry looks at him. Chili takes away his cigarette. \n\nCHILI\nYou're trying to tell me how you fucked up without sounding stupid, and that's hard to do. Let's just get to where you're at, okay? You blew the two hundred grand the limo guys gave you in Vegas on a basketball game and you haven't told 'em about it. Why not? \n\nHARRY\nBecause they're not the type of guys would take it with any degree of understanding or restraint. The first thing they'd do is break my legs. \n\nCHILI\nYou got that on the brain, Harry. If you're so scared of 'em why'd you take their money to Vegas to begin with? \n\nHARRY\nBecause I need half a million to buy a script. \n\nCHILI\nFor a movie? \n\nHARRY\nA blockbuster. But quality. No mutants or maniacs. This one's gonna be my Driving Miss Daisy. \n\nCHILI\nWhat's it called? \n\nHARRY\nMr. Lovejoy. \n\nCHILI\nMr. Lovejoy? That's the title? \n\nHARRY\nIt's not bad when you know what it's about. \n\nHarry pulls to the curb, faces Chili . . . \n\nHARRY\nMurray Saffrin, guy who wrote it, did all my Grotesque pictures, had it in a drawer for twenty years. He shows it to me one day, tells me he's got a star interested, would I produce it. \n\nCHILI\nWho's the star? \n\nHarry points arross the street to the Cafe Med where we see a RED FERRARI convertible parked out the front. We see MARTIN WEIR and a WOMAN with jet-black hair sitting at a table . . . \n\nHARRY\nTwo time academy award nominee, Martin Weir. \n\nCHILI\nMartin Weir. He played the mob guy that turned snitch in The Cyclone. \n\nHARRY\nOne of his best parts. \n\nCHILI\nNo, his best part was the cripple gay guy that climbed Mt. Whitney. \n\nHARRY\nRide the Clouds. Good picture. \n\nThey watch Martin and the girl a moment . . . \n\nCHILI\nShe looks familiar. \n\nHARRY\nShe's a rock star. Every day, same time, they come down here and have breakfast. He has the egg white omelette; she has the banana pancakes. He sits facing west so he can see his billboard. She faces east so she has an excuse to wear the shades. \n\nHarry pulls out, starts driving again . . . \n\nHARRY\nAnyway, Murray has this shrink, who also happens to be Martin's personal trainer's shrink. Murray gives the shrink the script and the shrink gives it to Martin's trainer who reads it to Martin while they work out, and Martin flips. Loves it. \n\nCHILI\nSo what's the problem? \n\nHARRY\nThe problem is Murray. He and a few other blocked screenwriters went river rafting down the Kern a few weeks ago. Murray never made it back. \n\nCHILI\nHe drown? \n\nHARRY\nHeart attack. Apparently they brought a couple hookers along. \n\nChili nods, looks up at an ANGELYNE billboard . . . \n\nHARRY\nDoris, Murray's widow, finds out about this Martin Weir thing and says since Murray and I never had any written contract, she wants five hundred grand for the script. \n\nCHILI\nSo you're thinking what if I was to put you next to my dry cleaner. Ask him if he wants to invest his money in a movie. \n\nHARRY\nThat, or I'm thinking what if some tragic accident were to befall the widow Saffrin -- \n\nCHILI\nI'm not gonna pop her, Harry. \n\nHARRY\nJust a thought. \n\nCHILI\nBut I could talk to the limo guys. Tell 'em to leave you alone for a while. Make the point in a way they'd understand it. \n\nHARRY\nYou don't even know these guys. \n\nCHILI\nHarry, I probably know 'em better than you do. \n\nHARRY\nWhat do you get out of this? \n\nCHILI\nLet's see how we get along. \n\nEXT. PARKING LOT -- DAY \n\nBO CATLETT, black, tall, put together in a tan outfit\nsuit, shirt, tie, lies on the hood of a BLACK STRETCH LIMO, his back against the windshield, reading Daily Variety, a headline proclaiming 'BONAPARTE STANDS TALL AT THE B. O.' We hear the sonud of an AIRPLANE and he checks his watch. \n\nHe casually folds the newspaper as a 747 screams past directly overhead and we . . . \n\nPULL BACK TO REVEAL\nLAX -- DAY \n\nAs Bo Catlett pounds twice on the fender . . . \n\nBO CATLETT\nThat's us. \n\nINT. SOVEREIGN TERMINAL -- DAY \n\nBo Catlett walks through the terminal. We hear the arrival of the Miami flight annonnced over the PA as Catlett stops at one of the gates. \n\nWe see a plane pulling into the gate through the glass as Bo Catlett checks out the other people waiting to greet the flight . . . \n\nLike, for example, the YOUNG DUDE in jeans and a wool shirt hanging out. \n\nBo Catlett studies him a moment, then sits down in one of the chairs. He looks over at . . . \n\nA BIG MAN, bearded, wearing a loud Hawaiian shirt, and carrying a three-year-old GIRL in his arms. The girl licks an ice-cream, spilling some on Daddy's shirt . . . \n\nBo Catlett looks over as disembarking PASSENGERS start coming through the gate. \n\nAs a LATINO MAN gets off the plane and glances around. He looks uncomfortable in the loose-fitting suit, like a migrant dressed for Saturday night. \n\nThe Latino Man lays his TICKET ENVELOPE on top of the trash container near the gateway . . . \n\nINSERT -- TICKET ENVELOPE \n\nThe name Y. PORTILLO printed on the outside. The big man with the little girl picks up the ticket and walks away. \n\nAs the LATINO MAN heads straight for Bo Catlett. \n\nBO CATLETT\nDon't say nothing to me. Sit down and act like you're waiting for somebody supposed to meet you. \n\nLATINO MAN\nThe fock you taking about . . . \n\nHitting the word hard, like Tony Montana in Scarface. \n\nLATINO MAN\nThey nobody know me here, man. Give me the focking money. \n\nBO CATLETT\nSit down. Now be looking. Man over to your right in the blue wool shirt hanging out . . . the other way, derecho . . . \n\nBo Catlett hunches over to rest his arms on his thighs, so that the Latino Man is now between him and the dude in the wool shirt. \n\nBO CATLETT\nThat's a federal officer, most likely DEA. He moves his leg look for the bulge. You savvy bulge? That's his backup piece . . . Hey. Try it without looking right at him if you can. \n\nThe Latino Man, trying to be cool about it, checks out the dude in the wool shirt. Sure enough, there's a bulge down near the guy's ankle. \n\nBO CATLETT\nWhat's your name? \n\nLATINO MAN\n(nervous now)\nYayo. Portillo. \n\nBO CATLETT\nAlright, Yayo, you know he's there, now forget about him. Now I'm gonna get up. Soon as I'm gone, you sit down in this same seat I'm in. You feel something under your ass it's the key to a locker where your half a million is. Along with some product we're returning \n\nNervous now, Yayo is staring at the guy with the wool shirt. \n\nYAYO\nYou suppose to give me the focking money yourself. \n\nBo Catlett gets up, adjusts his suit jacket, smoothing the long roll lapel. \n\nBO CATLETT\nTry to be cool Yahoo. I told you where it is. Do it how I told you and have a safe trip home. Or as you all say, vaya con Dios, motherfucker. \n\nBo Catlett walks off, leaving Yayo sitting there, confused now, not quite sure what to do. \n\nCLOSE ON HAND HOLDING TICKET ENVELOPE \n\nThe name Y. PORTILLO written on the jacket. \n\nPULL BACK TO REVEAL\nBAGGAGE CLAIM -- DAY \n\nWhere the Big Man in the Hawaiian shirt waits by the carousel. His LITTLE GIRL HOLDS THE TICKET ENVELOPE. The man grabs a case from the carousel and walks to the door. He tears the baggage claim stub from the envelope and hands it to the SECURITY GUARD. \n\nEXT. BAGGAGE CLAIM -- DAY \n\nAs the Big Man and the little girl walk to the black stretch parked at the curb, RONNIE WINGATE, an aging surfer in a suede jacket and running shoes, holds the door open for them. \n\nRONNIE\nLike fucking clockwork, eh Bear? \n\nBEAR/BIG MAN\nDon't cuss in front of Farrah. \n\nThe Bear hands the case to Bo Catlett who sits in the back of the limo . . . \n\nGIRL\nHi, Bo. \n\nBO CATLETT\nHow you doing, sweetie? \n\nAs Ronnie gets in back with Bo Catlett, The Bear puts his daughter in a toddler seat up front, then gets behind the wheel. \n\nGIRL\nHere we go! \n\nEXT. HARRY'S OFFICE -- DAY \n\nTwo stories, part of a block of white store fronts on Sunset near La Cienega. \n\nINT. HARRY'S OFFICE -- DAY \n\nLight filters through venetian blinds, illuminating a desk stacked with folders, magazines, scripts, papers, unopened mail, hotel ashtrays, a brass lamp, a clock and two telephones. \n\nHARRY\nI once asked this literary agent what type of writing brought the most money and the agent says, 'Ransom notes.' \n\nChili stands looking over some of the old photographs as Harry goes through the mess on the desk. There are some of Karen, Harry with a much youger, blonde Karen. Harry with giant bugs, Harry shaking hands with mutants and maniacs, and so on. \n\nHARRY\nHere it is . . . Mr. Lovejoy. \n\nHarry hands a script to Chili. Chili examines the cover, the first time he's ever held a movie script. He opens it to the middle . . . \n\nCHILI\nLovejoy sits behind the wheel, watching the bar across the street, getting his video camera ready for action . . .\n(looks up)\nWhat's he doing? Following a guy? \n\nHARRY\nRead it. It's a grabber. \n\nChili looks out the window as we see a long black stretch limo pull up to the curb down on the street . . . \n\nCHILI\nHey, Harry? I think your investors are here. \n\nEXT. HARRY'S OFFICE -- SAME TIME \n\nAs the Bear opens the door for Bo Catlett and Ronnie . . . \n\nINT. HARRY'S OFFICE -- SAME TIME \n\nAs Harry moves away from the window. \n\nHARRY\nJesus . . . \n\nChili tosses the script on the desk, moves between a pair of fat red leather chairs. \n\nCHILI\nAll right, Harry, make sure the limo guys sit here, not over on the sofa. \n\nHarry is tugging the string to lower the blinds behind the desk. \n\nCHILI\nNo leave 'em up, we want the light in their eyes. I'll be at the desk . . . but don't introduce me, let it go, just start talking. You're gonna be here, behind 'em when they sit down. \n\nHARRY\nThey'll be looking at you. They don't know who you are. \n\nCHILI\nThat's right, they're wondering, who's this guy? You don't tell 'em. Understand, Harry? Do not tell 'em who I am. \n\nHarry glances off as we hear RONNIE SINGING down the hall. \n\nRONNIE (O.S.)\nIn the year 2525 . . . if man is still alive . . . \n\nHARRY\nSo what do I say to them? \n\nCHILI\nYou don't say any more'n you have to. You say, 'Well, I'm glad you assholes stopped by, so I can set you straight.' \n\nHARRY\nYou're kidding, right? \n\nRONNIE (O.S.)\nIf woman can survive . . . \n\nCHILI\nYou tell 'em the movie's been postponed. Say, till next year, if you want. But don't tell 'em why or what you're doing. Understand, Harry? You don't tell 'em anything about Mr. Lovejoy. \n\nAnd the door opens. Chili sits behind the desk, watching the two of them come into the office. Ronnie singing . . . \n\nRONNIE\nThey may find . . . \n\nHe looks about the office . . . at the old photographs . . . \n\nRONNIE\nHarry, what year is it, man? We enter a time warp? I feel like I'm back in Hollywood of yesteryear. \n\nHarry waves them right into the two cracked red leather chairs facing the desk. Chili watches as Catlett comes first. Sitting down, he nods to Chili who ignores him. \n\nHARRY\nHave a seat . . . right over here . . . \n\nRonnie sits down in the chair and hooks one leg over the arm, swings it up and down, his motor running on some chemical. He too stares at Chili. \n\nHARRY\nThis is my associate, Chili Palmer, who'll be working with me. \n\nHarry already forgetting his instructions. Chili can't believe it. The limo guys nod to Chili and Chili nods back, trying to catch Harry's eye. \n\nHARRY\nI want to make sure there's no misunderstanding here. Despite rumors you might have heard, your investment in Freaks is as sound as the day you signed your participation agreement. \n\nRonnie has his face raised to the ceiling. \n\nRONNIE\nI can hear you, but where the fuck are you, man? \n\nBO CATLETT\n(looking at Chili)\nWhat I been wondering is where's he been. \n\nRONNIE\nYeah, where've you been? We haven't heard from you lately. \n\nHarry comes around to stand at one side of the desk, his back to the window . . . \n\nHARRY\nI've been off scouting locations. Interviewing actors in New York. \n\nChili's gaze moves from Ronnie the fool to Bo Catlett the dude, the man composed, elbows on the chair arms, his hands steepled in front of him. \n\nHARRY\nThe main thing I want to tell you, the start date for Freaks is being pushed back a little, a few months. \n\nRonnie stops bouncing his leg. \n\nRONNIE\nA few months? \n\nHARRY\nMaybe longer. We need prep time. \n\nRONNIE\nHey, Harry? Bullshit. We have an agreement with you, man. \n\nHARRY\nWe're gonna make the picture. I've just got another project to do first, that's all. One I promised this guy years ago. \n\nChili shakes his head, he can't believe he's hearing this. Ronnie sits up straight. \n\nRONNIE\nI want to see your books, Harry. Show me where it is, a two with five zeroes after it in black and white, man. I want to see your books and your bank statements. \n\nCHILI\nHey, Ronnie? Look at me. \n\nBoom. Ronnie looks over. So does Bo Catlett for that matter. \n\nCHILI\nYou have a piece of a movie, that's all. You don't have a piece of Harry. He told you we're doing another movie first. And that's the way it's gonna be. \n\nRONNIE\nExcuse me. But who the fuck are you? \n\nCHILI\nI'm the one telling you how it is. That's not too hard to figure out, is it? \n\nRonnie turns to Bo Catlett, the man not having moved or changed his expression the last few minutes. \n\nRONNIE\nCat? \n\nBo Catlett takes his time, gives it some thought. He looks at Harry . . . \n\nBO CATLETT\nWhat's this movie you're doing first? \n\nCHILI\nHarry, let me answer that. \n\nCatlett looks at Chili again. \n\nCHILI\nBut first I want to know who I'm talking to. Am I talking to you, or am I talking to him? \n\nBO CATLETT\n(beat, smiles)\nYou can talk to me. \n\nCHILI\nThat's what I thought. So let me put it this way \n\nNow it's between them. The guy studies Chili, thinks about whether or not to make a move, when Harry steps in, reaches over the desk and picks up a script . . . \n\nHARRY\nThis is the project, Mr. Lovejoy. I'm not trying to pull anything on you guys. This is it, right here. \n\nChili looks at Harry, wonders if there's a way to shut him up without punching him in the mouth. \n\nRONNIE\nMr. Loveboy? What is it, Harry, a porno flick? \n\nHe reaches for the script. Harry backs away, holds the script to his chest. Bo Catlett notices this. \n\nHARRY\nIt's nothing. It's fluff. Nothing you'd be interested in. \n\nBo Catlett eyes him a beat, then pushes out of his chair . . . \n\nBO CATLETT\nHarry, you think we go to see your movies? I've seen better film on teeth. Makes no difference to me which one our money's in. So how 'bout you take our twenty points out of Freaks and put 'em in this other one, Mr. Loverboy. \n\nHARRY\nI can't do it. \n\nBO CATLETT\nYou positive about that? \n\nHARRY\nIt's a different kind of deal. \n\nBo Catlett nods, gets up. \n\nBO CATLETT\nOkay. Then be good enough to hand us our money back, or you think about us coming in on this new one. \n\nRONNIE\nBy Friday, man, or you're fuckin' dead as disco. \n\nRonnie opens his coat so that Harry can see a gun tucked in his belt . . . \n\nRONNIE\nYou hear me? \n\nBo Catlett gives Ronnie a look. \n\nBO CATLETT\nTake your time, Harry.\n(closes Ronnie's jacket)\nWe're not animals. Are we, Ronnie? \n\nBo Catlett glances once more at Chili then follows Ronnie out the door. Harry stares at the door a moment, senses Chili staring at him . . . \n\nHARRY\nWhat? \n\nCHILI\nI don't know, maybe I wasn't clear. But I thought . . . I told you to keep your mouth shut. \n\nHARRY\nI had to tell 'em something. \n\nCHILI\nNever say anything unless you have to. \n\nChili shakes his head as Harry sits down in one of the chairs, fumbles for his cigarettes. \n\nCHILI\nYou tell me you want these guys off your back. Next thing I know, you're saying yeah, maybe they can have a piece of Mr. Lovejoy. I couldn't believe my fuckin' ears. \n\nHARRY\nI said I'd think about it. What does that mean? In this town, nothing. \n\nCHILI\nThat's the difference between you and me, Harry. I say what I mean. I want something from someone, I ask 'em straight out. I want Martin Weir, I go get Martin Weir. I don't fuck around with his trainer's shrink. \n\nHARRY\nHis shrink's trainer. \n\nChili looks at Harry. \n\nCHILI\nTake me back to my car. \n\nEXT. LAX -- DAY \n\nAs a plane touches down on the runway . . . \n\nINT. SOVEREIGN TERMINAL -- SAME TIME \n\nYayo, now soaked with sweat, is still here. He stands watching a row of lockers. He stares at one of them . . . \n\nCLOSE ON LOCKER. \n\nThe number C-18. We PUSH IN . . . \n\nYAYO \n\nstarts to move for it . . . then looks off at . . . \n\nA MAN IN A SUIT \n\nas we quickly TILT DOWN to the guy's ankle, looks like a bulge there. We then . . . \n\nWHIP PAN TO \n\nA WOMAN, dressed casually in slacks and a blouse. We TILT DOWN to her ankle, hmmm, is that a bulge? We . . . \n\nWHIP PAN TO \n\nA TENNIS SHOE, tapping to some unheard rhythm and what looks like a bulge near the ankle. We TILT UP this time to reveal A LITTLE KID, listening to a walkman. \n\nYAYO \n\nobviously losing it now, rubs his eyes and quickly walks off to a row of payphones . . . \n\nEXT. KAREN FLORES' HOUSE -- DAY \n\nChili's minivan is parked outfront. \n\nTOMMY (V.O.)\nWhere you been? I been callin' all over for you . . . \n\nINT KAREN'S HOUSE -- THE STUDY -- SAME TIME \n\nChili sits at the desk on the phone. \n\nTOMMY\n (PHONE)\nRay Bones is looking for you. He's got some kinda bug up his ass, can't sit still. \n\nINT. BARBER SHOP -- DAY \n\nTommy on the phone. \n\nTOMMY\nI hate to say I told you, but I did. I told you don't start nothing with him that time. \n\nINTERCUTTING TOMMY & CHILI\n\n\nCHILI\nYou said don't say nothing and I didn't. \n\nTOMMY\nNo, you just broke his fuckin' nose instead. \n\nCHILI\nYou gonna start that again? You're just like him, all you got room for in your brain is one fuckin' thing. \n\nTOMMY\nAll I know is he came by the barber shop, all fuckin' undone, wanting to know where you were staying in Vegas. I told him I don't know. I still don't. \n\nCHILI\nHow'd he know I was in Vegas? You tell him? \n\nTOMMY\nHe already knew it. \n\nCHILI\nYeah, well, I'm in L.A. now. \n\nTOMMY\nWhatta you doing out there? \n\nCHILI\nI'm going into the movie business. \n\nTOMMY\nWhat're you talking about? You wanna be a movie star? \n\nCHILI\nI'm thinking about producing. \n\nTOMMY\nHow you gonna do that? You don't know shit about making movies. \n\nCHILI\nI don't think the producer has to do much, outside of maybe knowing a writer. \n\nTOMMY\nHey, Chil? I think you're fulla shit. \n\nINT. KAREN'S ENTRY WAY -- SAME TIME \n\nAs Karen, dressed as a B-movie queen, press kit under one arm, steps inside, freezes as she hears . . . \n\nCHILI (O.S.)\n. . . call me soon as you know when Ray's coming out. \n\nINT. STUDY -- SAME TIME \n\nChili is scribbling something on a piece of paper as Karen comes into the room. Chili looks up at her as he hangs up, smiles at her. \n\nCHILI\nHey . . . Karen. How ya' doin'? \n\nKAREN\nWhat're you doing here? \n\nCHILI\nI wanted to come by, apologize for coming into your house like I did last night. \n\nKAREN\nLemme get this straight, you broke in again to apologize for breaking in before? \n\nCHILI\nNo, no . . . you let the patio door open. You gotta stop doin' that, all the nice things you got around here. \n\nKAREN\nYeah, well make sure you lock it on the way out. \n\nCHILI\nRough day on the set? \n\nKAREN\nI spent all day crawling out of a grave. The costumer kept bitching 'cause I was ripping my nylons -- \n\nCHILI\nRipped nylons work. Makes the shot more real. \n\nKAREN\n(regarding him)\n. . . That's what we finally decided. \n\nCHILI\nLike in Bride of the Mutant, when you played the whole end with that torn top. \n\nShe looks at him. \n\nKAREN\nYou saw that one? \n\nCHILI\nYeah. When you turn to the camera to tell the alien mother that her time on earth is finished . . . when you give us all that look, Joan Crawford wishes on her best day she had that much presence. Not even in Mildred Pierce -- which by the way was a better book than a movie -- did Crawford even touch the intensity you had in that look. \n\nKAREN\n(beat)\nYeah . . . that was a good scene. I mean, for a horror movie. \n\nCHILI\nFor any movie. \n\nKAREN\nI know I'm better than what I've been doing the last ten years, walking around in a tank top and fuck-me pumps, waiting till it's time to scream. \n\nCHILI\nMan, can you scream. \n\nKAREN\nYeah. It's a real gift.\n(beat)\nI'm just saying it'd be nice, one time in my career to get the chance to say one great line. You know, like in that Bette Davis picture, Cabin in the . . . \n\nCHILI\nCotton. \n\nKAREN\nYeah, you know when Bette comes up to the guy on the porch, gives him a flirty look and says, 'I'd kiss you, but . . .' \n\nCHILI/KAREN\n'I just washed my hair.' \n\nKAREN\nYeah. \n\nCHILI\nThat is a great line. \n\nChili looks at her. \n\nCHILI\nHow come you stopped making movies with Harry? \n\nKAREN\nI married Martin. That was a full-time job. \n\nCHILI\nYou read Harry's new one? He says it's the best thing he's ever read. \n\nKAREN\nHe must mean after Slime Creature 3. \n\nCHILI\nThat why Harry came over last night? See if you could help him get Martin in his movie? \n\nKAREN\nHarry's dreaming of a forty-million-dollar production he'll never get off the ground with a star he'll never sign. With or without my help. \n\nCHILI\nHarry told me Martin loves it, he flipped. \n\nKAREN\nYeah, well Martin is known for his flipping. He flips over a script, and when the time comes to make a deal, he flips out. \n\nCHILI\nTell you what, I'll stop by Harry's office and pick up a copy for you. \n\nKAREN\nDon't go out of your way. \n\nThey consider each other a moment . . . until Chili finally checks his watch. \n\nCHILI\nWell, I gotta have a talk with Leo, my runaway dry cleaner. \n\nKAREN\nRight. See how your story ends. \n\nCHILI\nYeah. Right.\n(then)\nListen, Touch of Evil's phying near my hotel. You wanna go check it out? Watch Charlton Heston play a Mexican? \n\nKaren looks caught, doesn't answer right away. \n\nCHILI\nMaybe some other time. \n\nHe turns to go, then turns back to her . . . \n\nCHILI\n'He tried to make love to me and I shot him.'\n(then)\nAnother great Bette Davis line. \n\nKaren looks at him. Surprised. He smiles at her. \n\nCHILI\nSee you around. \n\nEXT. BEVERLY HILLS HOTEL -- NIGHT \n\nLeo Devoe, dressed in a sporty plaid ensemble, complete with little matching hat gets out of a cab, and walks to the front entrance. He tips the doorman, gives him a grin. \n\nDOORMAN\nEvening, sir. \n\nLEO\nAnd a good evening to you, too, sir. \n\nINT. HOTEL HALLWAY -- NIGHT \n\nAs Leo the high-rolling dry cleaner bounces down the hall, unlocks his door . . . \n\nINT. LEO'S HOTEL ROOM -- NIGHT \n\nDark. Leo enters, heads for the bottle of Chivas on the desk. Has one straight out of the bottle, ahhh, before pulling a fat wad of cash out of his jacket, tossing it on the desk like it's change from the cab fare. \n\nHe then takes off the jacket, unbuttons the shirt, reaches for the Chivas again, when we hear . . . \n\nCHILI O.S.\nLook at me, Leo. \n\nCrash. Something glass hits the floor. Probably the Chivas bottle as Leo nearly has a fucking coronary . . . \n\nLeo looks over as Chili turns on the light behind him. But what catches Leo's eye is the BRIEFCASE sitting on the couch beside Chili. \n\nCHILI\nI wouldn't think you're that dumb, leave over three hundred grand in the closet, underneath the extra blanket, but I guess you are. \n\nLEO\nI didn't know where else to keep it.\n(then)\nWhere would you? \n\nCHILI\nYou're here a while, what's wrong with a bank? \n\nLEO\nThey report it to the IRS. \n\nCHILI\nYou don't open an account, Leo, you put it in a safe deposit box. Dip in whenever you want. \n\nLeo nods in his sporty hat and undershirt, thinking it over, what to do the next time he scams an airline. \n\nCHILI\nYou've been losing. \n\nLEO\nI'm up twelve grand today. \n\nCHILI\nFrom when? You left Vegas with four-fifty? \n\nLEO\nWho told you that? \n\nCHILI\nNow you're down to three-ten in the case. You must've cooled off quite a bit since you got here. \n\nLEO\nHow'd you know I was here? \n\nCHILI\nHere's another tip \n\nLeo looks away, raises his preshaped plaid hat and recocks it, then. . . \n\nLEO\nIt was Fay, wasn't it, told you about the money. She tell you my whole life history, for Christ's sake? \n\nCHILI\nI wouldn't let her if she tried. Why I'm here, Leo, basically, is to save your ass. \n\nLEO\nHow? By taking my money? \n\nCHILI\nYou can keep what you won today. That's yours. \n\nLEO\nIt's all mine. \n\nCHILI\nSit down, Leo. \n\nLeo sits down in the arm chair, stares sadly at the briefcase. \n\nCHILI\nI don't know how you got this far, you're so fuckin' dumb. But now you're through. I'm gonna explain to you why and I hope you're not too dumb to understand what I'm saying. Okay? \n\nLeo nods. \n\nCHILI\nRay Bones is now the man you're dealing with. Ray Bones finds out what you did, he's gonna want everything you have. And when I say everything, I mean even that sporty little hat if he wants it. Then after he takes all you got, he'll most likely hit you with some kind of heavy object if he doesn't shoot you, just so you won't tell on him. \n\nChili lets that sink in a minute. \n\nCHILI\nI won't do that. Take your stuff or hurt you. You have three-ten in the case, right? I'm gonna take the three hundred you scammed off the airline, but the rest of it, the ten grand? I'm gonna borrow that and pay you back sometime. \n\nLeo's squinting at him now . . . \n\nLEO\nYou take all my money, but you're borrowing part of it? \n\nCHILI\nAt eighteen percent, okay? And don't ask me no more fuckin' questions. I'm leaving. \n\nHe picks up the briefrase as he rises from the sofa and Leo gets out of his chair. \n\nLEO\nBut you won't know where I am. I don't even know where I'll be. \n\nCHILI\nI'll find you, Leo . . . \n\nChili reaches for the door, opens it and looks back at Leo . . . \n\nCHILI\nYou leave a trail like a fuckin' caterpillar. \n\nINT. HALLWAY -- SAME TIME \n\nAs Chili starts for the elevator. Leo steps into his doorway . . . \n\nLEO\nWait a minute. What's this eighteen-percent-a-year shit? You want to borrow ten, the vig's three bills a week. Fifteen for the vig plus the ten, that's twenty-five big ones you go a whole year, buddy! You hear me? \n\nChili stops, turns around. As he starts back, he sees Leo's scared look just before he slams the door shut. Chili shakes his head, starts back for the elevator. \n\nEXT. GRIFFITH PARK -- NIGHT \n\nChili drives a dark road up into the park. He rounds a corner, and we see an explosion of light up ahead as we come upon . . . \n\nA MOVIE SET \n\nChili pulls in behind a row of trailers. He gets out of the car and heads for the set where Harry is now looking up at the sky and yelling at someone . . . \n\nHARRY\nHow's anyone gonna see anything from way up there? \n\nCHILI\nHey, Harry. \n\nHARRY\nYeah, Chili. Hi.\n(looking up)\nYou're fifty feet in the air! \n\nThe DIRECTOR -- early twenties, dressed like a frat boy -- sits on a crane about fifty feet above the set . . . \n\nDIRECTOR\nHarry. I'm gonna boom down real fast, get a subjective p-o-v. \n\nCHILI\nListen, I talked to Karen. She's gonna think about helping you out. \n\nHARRY\nYeah, but whose point of view? \n\nDIRECTOR\nWhatta you mean, whose point of view; The audience's point of view. \n\nHARRY\nGet down here. I wanna talk to you. Come on . . . right now . . .\n(to Chili)\nShe's gonna talk to Martin? \n\nCHILI\nShe's thinking about it. I just need the key to your office. I just told her I'd pick up a script. \n\nHarry tosses Chili a key-ring. \n\nHARRY\nIt's the red one. Take it off the ring. \n\nChili sits down in one of the director's chairs that sits off to one side. He starts to take the key off the ring . . . \n\nVOICE\nYour name Vicky Vespa? \n\nChili looks up at a bored-looking ACTRESS standing there in a blood-soaked nightie. \n\nCHILI\nExcuse me? \n\nACTRESS\nI asked you, is your name Vicky Vespa? \n\nCHILI\nNo. \n\nACTRESS\nThen get the fuck outta my chair. \n\nChili sits forward, sees her name printed on the back. He gets up. As she sits down, we see an ICE PICK sticking out the other side of her head. Chili sits back down next to her in the chair with HARRY ZIMM on the back. \n\nHARRY\n(to the director)\nWhat're you doing? I thought I told you to get down here? \n\nThe kid nods to the camera operator who lowers the crane as we BOOM WAY UP. . . \n\nHARRY\nAll these camera moves and weird angles and shit are gonna distance us from the emotion of the scene. \n\nDIRECTOR\nWhat 'emotion?' Girl just got stabbed in the ear with an ice pick. \n\nHARRY\nShe's scared! Fear is an emotion!\n(then)\nLook, kid, if you remember anything from your time working with Harry Zimm, let it be the three key words to filmmaking. \n\nThe kid fiddles with the crane controls. \n\nDIRECTOR\nYeah? What three words, Harry? \n\nHARRY\nPick 'n' Save. \n\nDIRECTOR\nHm? \n\nHARRY\nYou heard me, Pick 'n' Save. \n\nHarry turns so the rest of the crew can hear him . . . \n\nHARRY\nNow I'm gonna tell you a little story, happened to me years ago when I was so broke I had to go to the Pick 'n' Save over on Vine to buy a lousy candybar for my dinner. \n\nChili watches the crew stop what they're doing and listen. \n\nHARRY\nI'm standing in line waiting to pay my two bits when I overhear this lady, call her Mildred, talking to the cashier about a movie. \n\nThe Director gives a look to his assistant like 'Jesus, you believe this shit?' \n\nHARRY\nSo Mildred says to the cashier, 'I saw the new Streisand picture.'\n(gets into it the way Mildred did)\n'God, I just love it at the end when she brushed Robert Redford's hair off his forehead the way she did when they were together, and the way they gave each other this look that said they still loved each other, but knew they couldn't be together. That look was so . . . romantic.' \n\nDIRECTOR\nThat's great, Harry. So what's the -- \n\nHARRY\nWhat she did not say was, 'I just loved the way the director moved the camera so much it made me fuckin' seasick.' All she cared about was that look. All she remembered was that look. And why do we remember things in movies? Because we can see them. \n\nHarry's right in the guy's face now . . . \n\nHARRY\nSo . . . keep this fuckin' camera down here on the ground and shoot this scene, so we can see what the fuck is goin' on, before I get someone over sixteen to fuckin' shoot it for you! \n\nHarry walks over to Chili, sees Chili sitting there. Chili tosses Harry his key ring. \n\nCHILI\nHere's your keys, Harry. \n\nHARRY\nGet the fuck outta my chair. \n\nEXT. HARRY ZIMM'S OFFICE -- NIGHT \n\nAs Chili pulls out front, gets out of the minivan, he looks up, sees a light on in Harry's office. \n\nINT. CORRIDOR -- NIGHT \n\nChili walks down the hallway, dark except for a light on at the end of the hall . . . \n\nINT. HARRY'S OFFICE -- NIGHT \n\nBo Catlett, reading glasses, script open in front of him, looks up from Harry's desk as Chili steps into the office. \n\nBO CATLETT\nThis ain't bad, you know it? This Mr. Lovejoy. Needs a better ending but yeah, I can see why Harry wants to do it. \n\nChili says nothing, sits down in one of the red leather chairs. \n\nBO CATLETT\nYou understand I knew Harry was lying, saying this wasn't any good, but holding on to it, man, like you have to break his fingers to get it from him. \n\nCHILI\nThat's funny, I was just wondering what I was gonna break of yours to get it away from you. \n\nBo Catlett smiles at him, doesn't give up the script. \n\nBO CATLETT\nI'm just explaining to you what I'm doing here. Case you think I come to rob the place, rip off any of this dusty old shit the man has. \n\nCHILI\nI'd never make you as a burglar, not in that outfit. \n\nBo Catlett sits back in the chair a moment, watches Chili light a cigarette . . . \n\nBO CATLETT\nHarry called you his associate, but what does that mean? I never heard your name or read it in Variety or The Reporter or anyplace. \n\nCHILI\nIt's what he said, I'm his associate. \n\nBO CATLETT\nYou must bring something heavy to the deal. \n\nCHILI\nThat's right, me. \n\nBo Catlett picks up a piece of paper off the desk . . . \n\nBO CATLETT\nSays here you're getting Martin Weir for the part of Lovejoy. \n\nCHILI\nYeah, we're getting Martin. \n\nBO CATLETT\nNo shit, come on. How you gonna do that? \n\nCHILI\nI put a gun right here . . .\n(touches the side of his head)\n. . . and I tell him, 'Sign the paper Marty or your fuckin' dead.' Like that. \n\nBO CATLETT\nI wonder, would that work?\n(then)\nYou know who I see for Al Roxy? Harvey Keitel. The man could do it in his sleep. \n\nCHILI\nHarvey Keitel. Yeah. Maybe. He was pretty good in the movie Fingers. \n\nBO CATLETT\nI missed that one. Or, hey, you know who else? Morgan Freeman. You know Morgan? \n\nCHILI\nYeah, Morgan Freeman. But he's a colored guy. \n\nBO CATLETT\nSo what? Where's it say in this script he's white? Color is what the part needs, man, somebody to do it has some style. The way it is now, Ronnie could do it, play himself, some cracked out asshole.\n(then)\nSo whatta you think of the script? \n\nBo watches as Chili picks up a copy of the script, begins flipping through it. \n\nCHILI\nTitle's the first thing's got to go. And the guy's name. I mean, even this writer's name, Murray Saffrin is better than Lovejoy. \n\nBO CATLETT\nI'm with you on that. And don't you think it needs a good female part? Increase the romance angle. \n\nChili flips through the script, sees a name . . . \n\nCHILI\nThere's Ilona. \n\nBO CATLETT\nWhat about her? \n\nCHILI\nGet something going there. \n\nBO CATLETT\nWith Ilona? You know how old Ilona is? \n\nCHILI\nShe's . . . young. \n\nBO CATLETT\nYoung? She's fuckin' nine-years-old, same age as Lovejoy's kid. Bernie. One she calls Bernard. Have you read the script? \n\nCHILI\nYeah, I read it. I was just thinking you could make her older. We might even be able to get Karen Flores. \n\nBO CATLETT\nWho? \n\nCHILI\nShe's been out of movies a few years, but she's good. Real good. \n\nBo Catlett studies Chili a moment, smiles . . . \n\nBO CATLETT\nYou know what I'm thinkin'?\n(leans forward)\nYou wanna make the girl older. I don't like the ending. We could do that, you and me, sit down and write the script over where it needs it. \n\nChili fips through the script a moment . . . \n\nCHILI\nYou know how to write one of these? \n\nBO CATLETT\nThere's nothin' to know. You have an idea, you write down what you wanna say. Then you get somebody to add in the commas and shit where they belong, if you aren't positive yourself. Maybe fix up the spelling where you have some tricky words . . . although I've seen scripts where I know words weren't spelled right and there was hardly any commas in it at all. So I don't think it's too important. Anyway, you come to the last page you write in 'Fade out' and that's the end, you're done. \n\nCHILI\nThat's all there is to it, huh? \n\nBO CATLETT\nThat's all. \n\nChili sits forward, stabs out his cigarette, exhales into Bo Catlett's face . . . \n\nCHILI\nThen what do I need you for? \n\nBo Catlett starts for the door. \n\nBO CATLETT\nI really think I can be of service on this one. \n\nCHILI\nYeah, well, we need a ride somewhere, we'll let you know. \n\nEXT. NUART THEATER -- NIGHT \n\nAs Karen walks up to the box office. A Touch of Evil on the marquis. \n\nINT. MOVIE THEATER -- NIGHT \n\nNot so full. Chili sits in the middle, watching the final scene as Orson Welles gets blown away, falls into the oily river. He can't take his eyes off the screen . . . \n\nKaren comes in, starts up the aisle, looking for Chili. She spots him, just as he mouths the dialogue along with Marlene Dietrich . . . \n\nMARLENE DIETRICH (O.S.)\nHe was some kind of man. \n\nKaren smiles, decides to wait a moment. Chili, lost in the movie . . . keeps mouthing the dialogue. \n\nMARLENE DIETRICH (O.S.)\nWhat does it matter what you say about people? \n\nMORT MILLS (O.S.)\nGood-bye, Tanya. \n\nMARLENE DIETRICH\nAdios. \n\nAs Tanya/Marlene Dietrich resumes her slow walk away, Karen sits down at the end of the row. People start getting up to leave. Chili turns to a GUY a few seats away from him . . . \n\nCHILI\nWow, huh? \n\nThe guy gives Chili a look, puts his arm around his DATE, and quickly starts up the aisle so that Chili can now see Karen sitting there at the end of the row . . . \n\nCHILI\nYou been here the whole time? \n\nKAREN\nI just caught the end. \n\nShe gets up, they start up the aisle together . . . \n\nCHILI\nYou know, Welles didn't even wanna do that one. Some studio made him do it. He owed 'em one and all his own movies lost money.\n(walking out now)\nBut, hey, sometimes that's when you do your best work, you got a gun to your head . . . \n\nEXT. NUART -- NIGHT \n\nAs Karen and Chili exit the theater, stand there a moment. \n\nCHILI\nI got you a copy of the script. \n\nKAREN\nI already read it. Harry left a copy at the house. \n\nCHILI\nWhat do you think? \n\nShe starts walking. \n\nKAREN\nI think it's not horrible. \n\nCHILI\nI don't like the title. Or the main guy's name. \n\nKAREN\nThen you've read it? \n\nCHILI\nNot yet. \n\nKAREN\nYou and Harry'll make a great team.\n(then)\nI'm gonna make a deal with him. \n\nCHILI\nThere a part in it for you? \n\nKAREN\nI don't want to act in it, I want to produce it with Harry. Especially if I help him get Martin. \n\nCHILI\nSounds fair. \n\nKAREN\nWhat do you get out of it? \n\nHe stops, looks at her. \n\nCHILI\nThat why you came over here, to ask me that? \n\nKAREN\nI want to know. \n\nCHILI\nWhy does anyone want to be in movies? \n\nKAREN\nYesterday, you were a loan shark. \n\nHe starts walking again . . . \n\nCHILI\nI was never much into it. All that bullshit having to do with respect. It's bad enough having to treat those guys like they're your heroes, having to smile when they make some stupid remark they think's real funny. \n\nKAREN\nAnd you think the movie business is any different? \n\nCHILI\nYeah well . . . I like movies. I figure if I help Harry make one, I'll find out what you have to do outside of have an idea and raise the money. That doesn't sound too hard. I was in the money business and I get ideas all the time. \n\nThey stop at her car. \n\nKAREN\nI'm talking to Martin tomorrow morning. I told Harry I'd meet you and him at Abiquiu afterward.\n(opens her door)\nThis might work, you never know. \n\nHe stands there, watching her drive away. \n\nEXT. HARRY'S APARTMENT BUILDING -- NIGHT \n\nJust above Franklin in the Hollywood Hills. A realtor might call it Chandleresque. We call it old and cheap. \n\nINT. HARRY'S APARTMENT -- NIGHT \n\nContinuing on the old and cheap theme. Harry stands behind the wet bar pouring himself a strong one. He looks at himself in the smoke-tinted mirror squares, downs the drink in one and pours himself another. \n\nA KNOCK AT THE DOOR. \n\nHarry looks at the door. \n\nHARRY\nWho is it? \n\nWOMAN'S VOICE\nMe. \n\nHARRY\n(lower)\nFuck. \n\nWOMAN'S VOICE\nI heard that. \n\nHarry moves to the door and opens it to reveal DORIS SAFFRIN -- fiftyish, fur coat, hair up so that we can see the nifty necklare. She leans in the doorway . . . \n\nHARRY\nHello, Doris. \n\nDORIS\nHarry Zimm. You look like a wet kiss. \n\nAnd she plants one on him. Walks into the apartment. Looking good for her age. Hell, for any age. \n\nDORIS\nWell, aren't you gonna offer me whatever it is you taste like? \n\nHARRY\nCome on in. \n\nDoris goes to the window. Harry goes to the bar, pours them each a drink . . . \n\nDORIS\nWhat a spectacular view. \n\nHARRY\nYeah, lovely. Last night I watched two guys carjack a Camero down on the corner of Argyle there.\n(hands her the drink)\nWhat do you want, Doris? \n\nShe drinks, never taking her eyes off him. \n\nDORIS\nI miss Murray, Harry. \n\nHARRY\nYeah, me too. He was a helluva good writer. And I would know. I discovered him. Made him what he was. \n\nDORIS\nWhat he was, was a hack, couldn't get a job writing for anybody but you.\n(off Harry)\nI'm being honest. He was a lousy writer, but he was a good husband. I just didn't know it until too late. \n\nHarry finishes his drink, pours himself another . . . \n\nHARRY\nYeah, well, twenty-twenty hindsight and all that. \n\nHarry takes a big, noisy pull off his drink as she moves to the bar . . . \n\nDORIS\nI hate being alone. The house is so quiet. So lonely. It needs . . .\n(studies him)\nA man's touch. \n\nAnd with that, she opens up the fur coat to reveal that she's wearing nothing but a garter belt and high heels. \n\nHARRY\nNice garter. \n\nShe sets her drink down, moves in, wraps her arms around his neck . . . \n\nHARRY\nI'm not sure how I feel about this, Doris. \n\nDORIS\n(reaching down)\nYou seem to feel fine about it. \n\nHARRY\nI mean morally. Murray was my friend. \n\nDORIS\nMurray's dead. \n\nShe kisses him . . . Harry pulls back . . . \n\nHARRY\nSo this means you've reconsidered our deal on Mr. Lovejoy? \n\nDORIS\nNo. But now that you mention it, I did talk to a handsome executive at Paramount the other day . . . who just happened to get his hands on the script. \n\nHARRY\nYeah, what'd he have to say? \n\nDORIS\nHe said if Martin's interested, I could get a half a million for it easy. But don't worry, Harry, I'm still giving you until Friday. \n\nHARRY\nHow honorable of you. \n\nNow she backs away, gives him a hurt look. \n\nDORIS\nHarry. If you want me to go, just say the word. \n\nHarry looks at her a moment, decides . . . \n\nHARRY\nWhat the hell . . . \n\n. . . And pulls her as close as we then . . . \n\nDISSOLVE TO\n\n\nEXT. HOLLYWOOD HILLS HOME -- NIGHT \n\nWe hear laughter, rock and roll as a NUDE WOMAN dives into a blue-lit swimming pool and swims the length . . . \n\nWe then TILT UP to a HOUSE ON STILTS above this one and see the lone figure of Bo Catlett standing on his deck. \n\nEXT. BO CATLETT'S HOUSE -- NIGHT \n\nThe shimmering yellow grid of the city in the b.g., Bo Catlett, barefoot, bathrobe, leans on the rail of his deck, watching the folks frolic twelve stories down. \n\nYAYO (V.O.)\nListen to me, man, I don't wan' no focking key. I wan' the money. \n\nEXT. BO CATLETT'S DECK -- NIGHT \n\nBo Catlett looks inside where Yayo paces back and forth. The Bear reclines on a chaise lounge. \n\nBO CATLETT\nHey, Yayo? You gonna smoke, get the hell off my seventy-bucks-a-yard carpet. \n\nYayo steps out on to the deck . . . \n\nBO CATLETT\nI told you where the money is. All you gotta do is go get it. \n\nYAYO\nNo. I'll tell you something \n\nBO CATLETT\nThat's all you know, huh? Wait here a minute, Yayo, I be back directly. \n\nYayo leans against the railing, cuts a 'now that's the way you get things done' look at the Bear. He lights a cigarette, looks o.s. and freezes . . . \n\nYAYO\nThe fock you doing with that? \n\nBo Catlett holds a big .45 out in front of him . . . \n\nBO CATLETT\nI'm taking you out, Yahoo. \n\n. . . and shoots Yayo in the chest, the gun going off loud, the round knocking the little Latin man back against the railing. \n\nBO CATLETT\nDead focking center, man. \n\nYayo, a stupid look on his face, stumbles backwards, over the railing. The Bear reaches for him, but it's too late . . . \n\nEXT. HOUSE DOWN BELOW -- SAME TIME \n\nThe group down here is too stoned to notice the little Colombian who falls from the deck high above like a sack of dirt, then slides partway down the slope. \n\nEXT. BO CATLETT'S DECK -- SAME TIME \n\nThe bear looks over at Bo Catlett . . . who now calmly stares down at the motionless form of Yayo. \n\nBO CATLETT\nShit, now someone's gotta climb down there and get him. \n\nBEAR\nYou didn't have to shoot him, Bo. We coulda just beat him up some. \n\nBO CATLETT\nYou see that? The way the man just went right over? \n\nBo Catlett takes a sip of his drink, looks at the railing. \n\nBO CATLETT\nMaybe we can get Chili Palmer up here. You fix my railing to give way like they do in the movies. Then I invite the man out here, have a look at my view. Get him to lean over the railing, see all the naked people down there . . . a tragic accident, officer . . . \n\nBear looks at him. \n\nBEAR\nCat, that's the lamest idea I've ever heard. \n\nBO CATLETT\nYeah, well, I'm bored, Bear. I wanna make movies. \n\nBear looks at him. \n\nBO CATLETT\nI mean, what's the point of living in L.A. if you're not in the movie business? \n\nBo Catlett leans on the railing, looks down at Yayo again. \n\nBO CATLETT\nAnd I mean high up in it.\n(turns to Bear)\nThat's why Harry's gonna make Mr. Lovejoy with me, not Chili Palmer. \n\nBEAR\nMr. Lovejoy? That's cute, Bo. \n\nBO CATLETT\nDoesn't matter what it's called, Harry's got Martin Weir and it's gonna be big. \n\nBEAR\nThey all sound big at the talking stage. \n\nEXT. MARTIN WEIR'S HOUSE -- MORNING \n\nKaren pulls into the driveway in a convertible BMW. As she checks her make-up in the REARVIEW MIRROR, we see Chili pull up behind her in his rented minivan. She turns aronnd, frowns, and quickly gets out of her car. \n\nHe gets out of the van . . . holds up a Star Map . . . \n\nCHILI\nThis thing's actually accurate. I bought it for ten bucks from a kid in a lawn chair on Sunset . . . \n\nKAREN\nYou were supposed to wait for me with Harry at the restaurant. \n\nChili points to a star on the map . . . \n\nCHILI\nSee, here it is . . . Martin Weir's house . . . right across the steet from George Hamilton. \n\nVOICE\nChili, Jesus! \n\nThey both look to the front door where a tall, skinny WOMAN with wild, jet black hair stands. \n\nWOMAN\nIt is you . . . \n\nShe comes bounding down the steps, runs over and gives him a hug . . . Karen can't believe what she sees. \n\nCHILI\nNicole? \n\nWOMAN\nIt's Nicki now. I don't believe this. \n\nCHILI\nMe neither.\n(to Karen)\nWe know each other. \n\nKaren smiles\n'How 'bout that.' Then looks at Nicki. \n\nKAREN\nHello, Nicki. \n\nNICKI\nKaren. Shit. I didn't see you there. How are you? \n\nKaren starts to answer, but Nicki's already hustling Chili inside . . . \n\nINT. MARTIN WEIR'S HOUSE -- DAY \n\nWhite everything. Way off in the b.g., a view on to the huge backyard. A pool man cleans the pool. A gardener blows the leaves. \n\nMartin's extensive photography collection lines the walls. Chili steps inside, checks some of them out\nmost of the photographs are of Martin. \n\nNICKI\nMartin will be out in a minute.\n(to Karen)\nChili was the only one at Momo's didn't hit on me. \n\nKAREN\nWhat a gentleman. \n\nNICKI\nYou like my hair?\n(reaches up, touches it)\nBlack like this? \n\nCHILI\nIt's nice. Especially under your arms. \n\nSomehow this makes Karen feel better. \n\nNICKI\nMartin won't let me shave. I guess I fill some need. Brings him back to the sixties or something. \n\nKaren turns as we hear a TOILET FLUSH somewhere o.s. \n\nNICKI\n(looks o.s.)\nSpeak of the devil . . . \n\nChili follows her gaze and we see . . . \n\nMARTIN \n\nas he comes down the stairs, checking the front of his trousers. He and Karen spot each other. Both look uncomfortable for a fraction of a second, then Martin hurries over to her . . . \n\nMARTIN\nKaren. Wow. Look at you . . . \n\nKAREN\nHello, Martin. \n\nHe hugs her and hangs on, leaving Nicki and Chili standing there like idiots. \n\nMARTIN\nMmmmm. You smell terrific.\n(to Nicki)\nShe always smelled so good. \n\nNICKI\n(thrilled)\nNeat.\n(then)\nMartin, this is Chili Palmer. \n\nMARTIN\nChili is it? \n\nCHILI\nYesh, a pleasure, Martin. \n\nNICKI\nChili's a gangster. Ran a club I used to play at for another gangster back in Miami. How is Momo these days anyway? \n\nCHILI\nDead. \n\nKaren fights a smile. Nicki nods solemnly . . . \n\nNICKI\nBummer.\n(then)\nWell, I'll let you all get to your movie talk. Chili, make sure you say good-bye before you leave. \n\nCUT TO\nA PORTRAIT OF MARTIN WEIR \n\nDone in cracked oils, the whole bit. \n\nPULL BACK TO REVEAL\nMARTIN'S LIVING ROOM \n\nMartin, Karen and Chili all sit on white couches. Martin is checking out Karen, nodding . . . \n\nMARTIN\nI'm sitting here, I'm looking at you and I'm having these flashes. You know, flashbacks, of memories.\n(touches her hair)\nOf us. \n\nKAREN\nReally. \n\nMARTIN\nYeah and I'm wondering, how did it go wrong? How did it all . . . slip away? \n\nKAREN\n'It' didn't slip away, Martin, you did . . . when you went off to fuck Nicki in the middle of my birthday party. \n\nMartin brings his hand back, nods, lost in thought . . . \n\nMARTIN\nYeah. That was a good party. \n\nCHILI\nYou know, Marty, you were good in The Cyclone. \n\nMARTIN\nMartin. It was a beautiful role. All I had to do was find the character's center, the stem I'd used to wind him up and he'd play, man, he'd play. \n\nKaren looks like she wants to throw up. \n\nCHILI\nWell, you had it down cold. Watching you in the movie, if I didn't know better I'd have to believe you were a made guy and not acting. Even the fink part. I never met a fink and I hope to God I never do, but how you did it must be the way finks act. \n\nMARTIN\nA few weeks before shooting, I went back to Bensonhurst, just to listen to you guys. See, I'm Italian, but I grew up in Tarzana. So I wanted to pick up your rhythms of speech. \n\nCHILI\nWe talk different? \n\nMARTIN\nIt's more like your attitude. Your tone, your speech patterns demonstrate a certain confidence in yourselves, in your opinions, your indifference to conventional views. \n\nCHILI\nYou mean like we don't give a shit. \n\nMARTIN\nYeah. Kinda. Anyway, once I have the authentic sounds of speech, the rhythms, man, the patois, I can actually begin to think the way those guys do, get inside their heads. \n\nChili exchanges a look with Karen who sits back now. Ready to give up. \n\nCHILI\nOkay, I'm one of those guys you mentioned. I'm actually one of 'em. What am I thinking? \n\nMartin looks at Chili . . . \n\nMARTIN\nDon't get me wrong, I'm not saying an actual metamorphosis takes place. That wouldn't be acting. \n\nKaren looks at Martin, shakes her head. \n\nCHILI\nSo you don't know what I'm thinking. \n\nMARTIN\nNo, I don't. Though I have to say I'm curious. \n\nCHILI\nSo you want to know. \n\nMARTIN\nIf you'd like to tell me, yeah. \n\nCHILI\nI'm thinking of a movie. \n\nMARTIN\nOne of mine? \n\nCHILI\nOne we're producing. \n\nMARTIN\nWith what? Wiseguy money? \n\nMartin cracks himself up. Karen and Chili crack up with him, Karen leaning into Chili . . . \n\nKAREN\nMaybe this was a bad idea. \n\nBut Chili keeps looking at Martin. \n\nCHILI\nMartin, I'm not connected to those people anymore. Not since I walked out of a loan-shark Operation in Miami. \n\nMARTIN\nWhat happened? The pressure got to you? \n\nCHILI\nPressure? I'm the one applied the pressure. \n\nChili sits back. Karen is starting to enjoy Chili's handling of Martin . . . \n\nCHILI\nYou're an actor, you like to pretend. Imagine you're the shylock. A guy owes you fifteen grand and he skips, leaves town. What do you do? \n\nChili watches as the movie star hunches over, narrows his shoulders. For a few moments he holds his hands together in front of him, getting a shifty look in his eyes. Karen shakes her head . . . \n\nKAREN\nOh, for Christ's sake -- \n\nMARTIN\nI know. I'm doing Shylock instead of a shylock. Okay, what's my motivation? The acquisition of money. To collect. Inflict pain if I have to. \n\nKaren watches as Martin stares at Chili, his expression gradually becoming deadpan, sleepy . . . \n\nMARTIN\nGuy owes me fifteen large and takes off, I go after him. The fuck you think I do? \n\nCHILI\nMartin, look at me. \n\nMARTIN\nI'm looking at you. \n\nSo is Karen, for that matter. \n\nCHILI\nNo, I want you to look at me the way I'm looking at you. Put it in your eyes, 'You're mine, asshole,' without saying it. \n\nMARTIN\nLike this? \n\nCHILI\nWhat you're telling me, you're tired? You wanna go to bed? \n\nMARTIN\nWait. How about this? \n\nCHILI\nNow you're squinting like you need glasses. \n\nKaren looks away now, fighting a smile. \n\nCHILI\nLook at me. I'm thinking, You're mine. I fuckin' own you. What I'm not doing is feeling anything about it one way or the other. You understand? You're not a person to me, you're a name in my collection book, a guy owes me money, that's all. \n\nMartin nods, gives Chili a nice dead-eyed look. Karen is thoroughly enjoying Chili's manipulation of Martin. \n\nMARTIN\nHow about this? \n\nCHILI\nThat's not bad. \n\nMARTIN\nThat's what I think of you, asshole. Nothing. \n\nCHILI\nI believe it. \n\nMARTIN\nI turn it on when I confront the guy. \n\nCHILI\nYeah, but you haven't found him yet.\n(then)\nThe guy took off for Las Vegas. \n\nMARTIN\nHow do I know that? \n\nKaren looks at Chili as he sits back . . . \n\nCHILI\nThe guy's wife tells you . . . \n\nINT. ABIQUIU RESTAURANT -- DAY \n\nTwo floors, the upstairs with a railing overlooking the bar. Harry, a drink in front of him, sits in a big corner booth upstairs. He checks his watch . . . \n\nVOICE\nHarry, how you doing? \n\nHarry looks up to see Bo Catlett, dressed up as usual, standing there with the Bear, wearing a Hawaiian shirt. \n\nHARRY\nBo. I'm great. Listen, I'm expecting some people -- \n\nBO CATLETT\nYou must be makin' some big deals, doin' lunch in a place like this? \n\nHARRY\nI'm working on a few things. \n\nBO CATLETT\nYeah, I hear you bagged Martin Weir for Mr. Lovejoy. \n\nHARRY\nBoy, this town. Word gets around, doesn't it? \n\nHarry chuckles, takes a sip of his drink. \n\nBO CATLETT\nChili Palmer told me. \n\nHarry's smile goes away. \n\nBO CATLETT\nLast night. When he called me over to your office to talk about it. \n\nHARRY\nChili Palmer showed you my script? \n\nBO CATLETT\nYeah, I was wondering why he should do that. \n\nINT. MARTIN WEIR'S HOUSE -- SAME TIME \n\nMartin is leaning forward . . . Hooked . . . \n\nMARTIN\nThe wife sues the airline.\n(nods)\nThis is a gutsy babe. \n\nCHILI\nGood-looking, too.\n(turns to look at her)\nLike Karen. \n\nChili smiles at her. Martin leans forward. \n\nMARTIN\nSo when do I meet up with the husband and give him the look? \n\nCHILI\nIt's not that simple. You have to be careful. There's another guy that comes along, a hard-on you owe some money to. A mob guy. Wants to take you out anyway, on account of a past situation. \n\nMARTIN\nOkay. I'm listening. \n\nChili stops; he doesn't know what else to say. Martin waits, then looks at him a moment . . . \n\nCHILI\nAt that point, basically, that has to be it. \n\nMARTIN\nYou're not going to tell me the rest? \n\nKAREN\nWell actually, Martin the movie we came to talk about is Mr. Lovejoy. \n\nCHILI\nYeah. We understand you read the script and like it . . . a lot. \n\nMARTIN\nRefresh my memory . . . \n\nCONTINUED\nINT. ABIQUIU -- SAME TIME \n\nHarry drains his drink. Bo Catlett exchanges a look with the Bear, then . . . \n\nBO CATLETT\nListen, Harry, how would you like to get your hands on five hundred grand? You pay me back at your convenience, no interest. \n\nHARRY\nYou serious? \n\nBO CATLETT\nAll I want in return is to work on the movie with you. Fact I already got some ideas on how to fix it up. \n\nBo Catlett signals the waiter . . . \n\nBO CATLETT\nHow 'bout another one for Mr. Zimm. A double. \n\nHARRY\nYou're gonna just give me five hundred grand? \n\nBO CATLETT\nWe'll talk about that, Harry. But first I gotta know, how'd you hook up with Chili Palmer. \n\nEXT. MARTIN WEIR'S HOUSE -- DAY \n\nKaren, Martin, and Chili walk out to the driveway. \n\nMARTIN\nLemme talk to Buddy, set up a meeting. \n\nCHILI\nBuddy? \n\nKAREN\nLufkin. His . . . agent. \n\nMARTIN\nYeah, Karen knows him. \n\nKAREN\nBut you are interested? \n\nMARTIN\nI'm intrigued, yeah. You know what might help you, take a look at the Cylone again, the way a visual fabric is maintained even while the metaphor plays on different levels. Hey --\n(nods to minivan)\nThis your ride, Chili? \n\nChili follows Martin over to the minivan, opens the door for him. \n\nMARTIN\nVery nice . . . \n\nCHILI\nYeah, I like it, I'm high up, I can see everything, you know? It's the Cadillac of minivans. \n\nMARTIN\nWhat's that? \n\nCHILI\nCompass. \n\nMARTIN\nWow.\n(then)\nMind if I take it for a spin? \n\nINT. ABIQUIU RESTAURANT -- DAY \n\nBo Catlett and Harry are laughing as Harry, very drunk now finishes another drink . . . \n\nBO CATLETT\nHe was watching Letterman, huh? Sneaky, that Chili Palmer.\n(signals the waiter, then)\nSo, he ever find this dry cleaner, the one with all that money on him? \n\nHARRY\nLeo, I don't know. \n\nBo Catlett and the Bear look at each other. \n\nBO CATLETT\nI bet he did and he ain't givin' you a penny of it, help you out. Not the way I am. \n\nHarry looks at Bo, can't believe what's happening to his life, thinks a moment, then . . . \n\nHARRY\nAssuming I go along with this, when can I have the five hundred? \n\nBO CATLETT\nWhenever you want it. The money's in hundred dollar bills inside one of those jock bags, you know? In a locker at the airport, waiting to be picked up. \n\nHARRY\nThe airport. \n\nBO CATLETT\nIt was waiting out there on another deal, one that didn't go through; one you don't want to know about. \n\nHarry shakes his head, looks around the restaurant. Bo and the Bear exchange looks, then . . . \n\nHARRY\nI don't know. \n\nBO CATLETT\nIt's not the kind of thing you do. \n\nAnother glance at the Bear, then . . . \n\nBO CATLETT\nThat's why I was thinking you could send your boy Chili Palmer. He gets busted or hit on the head you aren't out nothing. \n\nAnd with that, Bo Catlett calmly slides an ORANGE KEY across the table to Harry. Harry stares at it. It has the number C-18 printed on the flat orange part. \n\nHARRY\nC-18. \n\nBO CATLETT\nThat's the magic number. \n\nBEAR\nCat . . . \n\nAnd they all look . . . \n\nDOWNSTAIRS \n\nas Chili and Karen enter the restaurant. Chili checks out the bar, sees they aren't there, then looks up at the railing . . . keeps his eyes up there as he says . . . \n\nCHILI\nWait here. \n\nChili moves to the staircase, now sees the Bear in his Hawaiian shirt standing a few steps from the top. \n\nChili gets within three steps of the guy and stops, but doesn't look up, keeps his eyes fixed on the man's gut. \n\nBO CATLETT\nI'd like you to meet my associate, the Bear. Movie stuntman and champion weightlifter, as you might've noticed. Picks up and throws out things I don't want. \n\nChili doesn't move, keeps his eyes on the man's crotch. \n\nBEAR\nWe think you ought to turn around and go back to Miami. \n\nChili slowly moves his gaze up through hibiscus until he's looking at the man's bearded face . . . \n\nCHILI\nSo you're a stuntman. Are you any good? \n\nThe Bear grins and turns his head to the side, as if too modest to answer and will let Bo Catlett speak for him. \n\nThis makes the next move easier . . . the guy not even looking as Chili grabs a handful of his crotch, steps aside and yanks him off the fucking stairs. \n\nThe Bear yells out of pain and fear as the beefy guy rolls all the way down the stairs to land on the main floor, a few feet away from where Karen now stands. \n\nChili keeps watching until he sees the guy move, then looks up at Bo Catlett who's now coming down . . . \n\nCHILI\nNot bad for a guy his size. \n\nChili continues up the stairs to where Bo Catlett stands beside the table. Chili unbuttons his coat . . . \n\nCHILI\nI'll make you a deal. If you can get out of here before I take my coat off, I won't clean the floor with you, get your little costume all messed up. \n\nKaren watches now as Bo Catlett puts a hand in his coat packet, steps right up to Chili . . . \n\nBO CATLETT\nYou don't know me. You only think you do. \n\nBo walks past Chili, goes down the stairs. Chili watches as Bo Catlett helps the Bear get to his feet. They leave the restaurant, the Bear looking over his shoulder at Chili. \n\nEven Karen is looking at him differently now as they slide into the booth with a now shocked, rapidly sobering Harry. \n\nCHILI\nRough business this movie business. I may have to go back to loan sharking for a rest. \n\nHarry doesn't say anything. Karen looks at him. \n\nKAREN\nHarry, what're you still doing with those guys? \n\nHARRY\nHe happens to be loaning me five hundred grand, no strings, I write any kind of agreement I want. \n\nCHILI\nIs he giving you a check or cash? \n\nHARRY\nCash. It happens to be waiting right at this moment in a locker at the airport. \n\nKAREN\nA locker at the airport? Jesus Christ, Harry. Tell me you're not really that stupid. \n\nCHILI\nThe guy's setting you up. You pulled out of their Freaks deal so he's paying you back. \n\nHARRY\nOh, is that right? I'm being set up? Then how come Catlett said I should send you out to get it, since you haven't done a fucking thing for me since you got into this . . . except showing Bo Catlett my script? \n\nChili looks at Karen, smiles, shakes his head . . . \n\nCHILI\nOkay, Harry, I'm wrong. You're not the one he's setting up. \n\nHARRY\nI mean, at least Bo's invested in three of my movies. \n\nKAREN\nHarry, we spoke with Martin. \n\nHARRY\n'We?' \n\nKAREN\nChili and me. \n\nHarry looks at the two of them, differently now . . . \n\nHARRY\nReally. \n\nCHILI\nYeah, he wants us to talk to Buddy, set up a meeting. \n\nHARRY\nA meeting with who? You and Karen? \n\nKAREN\nHarry -- \n\nHARRY\nMan's in town two days, thinks he's David O. fucking Selznick. \n\nKaren and Chili look at each other as Harry finishes his drink. \n\nHARRY\nSo how 'bout it, Mr. Selznick, do I make my deal with Bo? Or you gonna finally help me out, have a word with your dry cleaner when you find him. \n\nCHILI\nI found him. \n\nHarry looks at him. \n\nCHILI\nForget about Leo's money, Harry. \n\nHARRY\nYou have it? \n\nCHILI\nHarry, if I gave you Leo's money you'd have Ray Bones all over your ass and then you'd be in a whole new kinda trouble. \n\nHARRY\nWho? \n\nCHILI\nRay Barboni. Guy from Miami, owns Leo now that Momo died. \n\nHARRY\nWho the fuck is Momo? Jesus, these fucking names . . . \n\nCHILI\nTell you what, Harry, tomorrow morning, when the airport's crowded, I'll go check it out. If I don't see a problem, I'll pick up the money . . . \n\nKAREN\nI wouldn't get my hopes up, Harry. \n\nHarry thinks a moment, lays the key on the table, but keeps his hand on it. \n\nHARRY\nMaybe I oughta talk to this Ray Bones character myself. See if he wants to invest in my movie. \n\nCHILI\nDon't waste your time, Harry. The guy's not much of a movie fan. Now c'mon, gimme the key. \n\nHarry finally lifts his hand. \n\nEXT. HARRY'S OFFICE -- NIGHT \n\nA light on upstairs . . . \n\nHARRY (V.O.)\nBones. B-O-N-E-S. \n\nINT. HARRY'S OFFICE -- SAME TIME \n\nHarry sits at his desk, the phone cradled to his ear, a half-empty bottle of scotch in front of him. \n\nOPERATOR\n (PHONE)\nI show a 'Dem Bones Barbecue' in Dade County, but that's all. \n\nHARRY\nOh. Wait a minute. That's not his real name. It's uh . . . uh . . . yeah -- try Barboni. B-a-r-b-o-n-i. \n\nINT. RAY BONES' APARTMENT -- NIGHT \n\nWe start CLOSE ON A TELEPHONE . . . THE PHONE RINGS and we BOOM UP to reveal a CLOSED DOOR across the room . . . \n\nINT. BATHROOM -- SAME TIME \n\nRay Bones nests on the can, humming off key, reading Weir'D Tales, Martin Weir's autobiography. He looks up, listens to the PHONE RING. \n\nBONES\nFuck. \n\nThe phone KEEPS RINGING. Bones thinks about it a moment, then tosses the book aside . . . \n\nBONES\nFuck fuck fuck fuck . . . \n\nINT. FRONT ROOM -- SAME TIME \n\nAs Bones bursts out of the john and grabs the phone. \n\nBONES\nWhat? \n\nINTERCUTTING HARRY & RAY BONES \n\nPhone to his ear, Harry downs another drink, sits up. \n\nHARRY\nRay Barboni? \n\nBONES\nWho is this? \n\nHARRY\nAre you the guy they called Ray Bones? \n\nBONES\nDepends. Who's this? \n\nHARRY\nWho is this? I'm the one telling you the way it is, okay, asshole? That's who I am. Now you want your three hundred grand or don't you? \n\nBONES\nWhat three hundred grand? \n\nHARRY\nThe three hundred grand a guy named Leo Devoe scammed off an airline. The three hundred grand Chili Palmer now has in his possession. \n\nOkay. This gets Bones' attention. \n\nHARRY\nHello? You there? \n\nBONES\nYeah, I'm here. I just don't like the anonymous crap. It means your either chickenshit or not for real. \n\nHARRY\nYeah? Well, trust me. I'm very for real. \n\nBONES\nOkay. So who are you? \n\nHARRY\nI work for Harry Zimm, alright? \n\nBONES\nWho? \n\nHARRY\nHarry Zimm. The man happens to be a major Hollywood player. \n\nBONES\nNever heard of him. \n\nHARRY\nMaybe that's because you've never been out've fuckin' Miami, dipshit. Maybe it's time you got on a plane, flew out to L.A. and took a meeting with Mr. Zimm. \n\nBones sits down, trying to put this together . . . \n\nBONES\nSo, what, this Zimm guy asking for some kinda finders fee, that what we're talking about here? \n\nHARRY\nHey, Zimm doesn't ask for dick. Zimm tells you the way it is . . . or else. \n\nBONES\nOr else what? \n\nHARRY\nOr else use your fucking imagination. \n\nHarry hangs up at the other end. Bones stares at the phone. \n\nCONTINUED\nINT. HARRY'S OFFICE -- SAME TIME \n\nHe sits there a moment, also staring at the phone. \n\nHARRY\nMotherfucker. \n\nHe then realizes his hands are shaking, grabs the bottle and pours the rest of the scotch down his throat. \n\nEXT. LAX -- SOVEREIGN TERMINAL -- MORNING \n\nBusy. Travelers moving along the sidewalk. Here comes Chili . . . he enters the terminal and we . . . \n\nINT. SOVEREIGN TERMINAL -- DAY \n\nCUT TO\nA ROW OF LOCKERS \n\nAll with keys sticking out of them except one. We push in on that one . . . C-18. \n\nCHILI \n\nstands between rows of lockers on either side of him. He studies them a moment longer, then looks up at the ARRIVALS MONITOR. He starts writing something on a CARD as we push past him . . . pushing in on #83 from NEWARK . . . \n\nINT. AIRPORT GIFT SHOP -- DAY \n\nAs Chili buys an L.A. LAKERS T-SHIRT and a BLACK CANVAS ATHLETIC BAG. He pauses to check out the magazine rack, Martin Weir is on the cover of everything including his hardback autobiography \"WEIR'D TALES\". He grabs a copy . . . \n\nChili puts the book and the T-shirt inside the athletic bag, puts that inside the papergift shop bag, and then looks around . . . \n\nA SCRUFFY LOOKING KID \n\nEighteen or so, checking out the skin magazines as Chili comes up behind him. \n\nCHILI\nYou want to make five bucks, take you two minutes? \n\nThe kid looks at him, but doesn't answer. \n\nCHILI\nYou go over to those lockers over there and put this in C-17. \n\nThe kid still doesn't say anything. \n\nCHILI\nIt's a surprise for my wife. But you have to do it quick, okay? While she's in the can. \n\nThat sonuds like it makes sense, so the kid nods . . . \n\nKID\nYeah, okay. \n\nChili gives him the paper bag with his purchases, a five dollar bill and three quarters. He watches as . . . \n\nThe kid walks over to the row of lockers . . . puts the quarters into C-17, opens it, puts the stuff inside, pulls the key and then walks back over to Chili, and hands him the key . . . \n\nCHILI\nThanks. \n\nEXT. AIRPORT -- DAY \n\nAs a plane touches down . . . \n\nINT. SOVEREIGN TERMINAL -- DAY \n\nAs Chili watches the last few passengers come off the plane. He watches them come through the gate until he's standing there by himself. \n\nOkay, he turns and walks down the aisle now to the bank of lockers three high where C-18 is just about in the middle. \n\nHe looks both ways, takes his time until a group of people pass behind, giving him a screen, giving him just time enough to open C-17, grab the black athletic bag, and close the locker. \n\nChili gets about ten yards down the aisle, heading for daylight, when a BLACK GUY IN A SUIT comes towards him and stops right in his path . . . \n\nBLACK GUY/CURTIS\nExcuse me, sir . . . \n\nNow there's a BIG GUY IN A PLAID WOOL SHIRT next to him, the same guy we saw when Bo Catlett was here. And Christ, ANOTHER GUY now, this one down the aisle, talking on his hand radio. The Black Guy has his I.D. folder open . . . \n\nBLACK GUY/CURTIS\nCurtis. Drug Enforcement. These are Agents Dunbar and Morgan, would you come with us, please? \n\nCHILI\nWhat's wrong? What's this about? \n\nAgent Curtis turns and starts off\n\n\nDUNBAR\nLet's follow him and behave ourselves. What do you say? \n\nAs Chili walks off with the D.E.A. guys we see . . . \n\nRAY BONES \n\nComing out one of the gates. He looks at A GUY holding a square piece of cardboard that reads MR. BARBONE. \n\nGUY\nMr. Barbone? Welcome to L.A. I'm Bobby, your driver. You have a good flight? \n\nRAY BONES\n(starts walking)\nI hope you drive better than you fucking spell, jackoff. My name's Barboni, not Bar-bone. \n\nAs Ray Bones then walks off, we see coming out a different gate . . . \n\nTHREE COLOMBIANS \n\nAll in dark suits. Two big guys in sunglasses flanking one smaller, older guy . . . \n\nBIG GUY\nYou want to go to the hotel first, Mr. Escobar? \n\nMR. ESCOBAR\nI want to get my focking money. \n\nINT. SMALL AIRPORT OFFICE -- DAY \n\nChili stands there while Curtis opens Chili's wallet and looks at the driver's license while Dunbar in the plaid shirt pulls the Lakers T-shirt out of the athletic bag, feels around inside. The agents glance at each other without giving any kind of sign. \n\n\nCURTIS\nYou live in Miami? \n\nCHILI\nThat's right. \n\nCURTIS\nWhat're you doing in Los Angeles? \n\nCHILI\nI'm in the movie business. \n\nCURTIS\nYou're an investor, is that it? \n\nCHILI\nI'm a producer. \n\nCURTIS\nYou have a card in here? \n\nCHILI\nNot yet. I just started. \n\nChili watches Curtis pick up the note with the Newark Flight number and arrival time written on it. \n\nCHILI\nI'd appreciate your telling me what this is about. \n\nMORGAN\nI got a John Doe warrant here. I can strip-search you if I want. \n\nCURTIS\nPat him down. \n\nMORGAN\nWhy don't I strip-search him. \n\nCURTIS\nPat him down. \n\nThe big guy puts Chili against the wall. \n\nMORGAN\nSpread your legs. \n\nCURTIS\nWhat're you doing at the airport? \n\nCHILI\nI was supposed to meet my wife, but she wasn't on the flight. \n\nDUNBAR\nWhy, you live in Miami, was your wife coming from Newark? \n\nCHILI\nWe had a fight and she left me, went back to Brooklyn. I asked her to come out here, you know, thinking with a change of scenery maybe we could get back together, and she said okay, but evidently she changed her mind. \n\nCURTIS\nYour wife a Lakers fan? \n\nCHILI\nI am. I'm a fan of everything that's L.A. I love it out here. \n\nHe looks over his shoulder to the give the guy a smile. Curtis doesn't return it. \n\nCURTIS\nYou can go. \n\nChili moves to the table to collect his things. Curtis watches him then . . . \n\nCURTIS\nBy the way, you recall the number of the locker you used? \n\nCHILI\nIt was C . . . I don't know, sixteen or seventeen, one of those. Why? You looking for anyway, a bomb or something? \n\nCURTIS\nSomething shouldn't be there. \n\nCHILI\nWhy don't you get the attendant to open all the lockers and take a look. Maybe you'll find it. \n\nCURTIS\nThat's the idea. I'll think about it. \n\nCHILI\nThat's what I'd do.\n(looks right at Curtis)\nMake sure I got the right guy next time. \n\nCURTIS\nGet him out've here. \n\nEXT. FREEWAY -- DAY \n\nThe usual L.A. traffic. A black caddy in the middle of it. \n\nINT. CADDY -- SAME TIME \n\nAs Ray Bones looks out a tinted window at the freeway. \n\nBOBBY\nYou ever wanta go to the beach, here's the freeway you take we're coming to. \n\nRAY BONES\nI live in Miami and you want to show me a fuckin' beach? The sun ever come out here, or you have this smog all the time? \n\nBOBBY\nThey say the smog's the reason we have such beautiful sunsets. \n\nRAY BONES\nThat's what they say, huh? What a buncha fuckin' bullshit. \n\nEXT. AIRPORT PARKING STRUCTURE -- DAY \n\nChili glances about, makes sure no one's around, then pulls the key for the 'right' locker out from a crack in the pavement, near the stairwell. He then goes up the stairs to \n\nEXT. AIRPORT PARKING STRUCTURE -- DAY \n\nANOTHER LEVEL \n\nwhere the Bear, in his trademark Hamaiian shirt is standing beside Chili's car. He straightens up as Chili exits the stairwell and walks up to him. \n\nCHILI\nI don't know how I could've missed you with that shirt on. It's the same as the other one you had only the hibiscus are a different color. Right? \n\nBEAR\nSo you didn't have the key with you. \n\nCHILI\nYou think I'd be standing here? You set somebody up and you want it to work, it has to be a surprise. Can you remember that? \n\nBEAR\nYou spotted them, huh? \n\nChili looks at him, the guy's either dumb or making conversation. \n\nCHILI\nWhat, did you see it work in some movie you got beat up in? \n\nBEAR\nI have to ask you for that key. \n\nCHILI\nWhat, the setup didn't work so you want the key back? \n\nBEAR\nCatlett says if you don't open the locker the deal's off. \n\nCHILI\nYou serious? This is how you guys do business? I can't believe you aren't dead. \n\nThe Bear keeps staring, but doesn't say anything. \n\nCHILI\nLook, there's no fuckin' way I'm gonna give you the key, outside of you point a gun at my head. Then we might have something to talk about. Now step away from the car. \n\nBEAR\nI don't need a gun. Where is it? If it isn't on you, it's around here someplace. \n\nChili shakes his head, tired of this, but still feeling a little sorry for the guy. He looks off in a kind of thoughtful way, turns to the Bear again and kicks him in the left knee, hard. \n\nThe Bear stumbles, hunching over. Chili grabs him by the hair with both hands, pulls his head down and brings his own knee up into the guy's face. This straightens him and now Chili hits him high in the belly as hard as he can, right under the rib cage. \n\nThe Bear sucks air with his mouth open trying to breathe, helpless now and in pain. Chili takes him by the arm . . . \n\nCHILI\nLie down on your back. Come on, if you want to breathe. \n\nHe gets the Bear down on the concrete, straddles his midsection and reaches down to lift him up by the waist of his pants. \n\nCHILI\nTake deep breaths through your mouth and let it out slow . . . that's it, like that. \n\nThe Bear starts to breathe okay again. He checks his teeth now, feeling his nose . . . \n\nCHILI\nHey, Bear, look at me. \n\nThe Bear looks at him. \n\nCHILI\nTell your boss I don't ever want to see him again. He made a deal with Harry and a deal's a deal. \n\nThe Bear nods, dosing and opening his eyes. \n\nCHILI\nWhat're you hanging around with a guy like that for? You were in the movies, right? A stuntman? What's he ever done he can talk about? You feel okay? \n\nBEAR\nNot too bad. \n\nCHILI\nHow 'bout when you went down the stairs? \n\nThe Bear touches his thigh . . . \n\nBEAR\nI think I pulled my quadriceps. \n\nCHILI\nSo . . . how many movies you been in? \n\nBEAR\nAbout sixty. \n\nCHILI\nNo shit? What're some of 'em? \n\nINT. HARRY'S OFFICE -- DAY \n\nHarry is passed out with his head on the blotter when we hear someone POUND ON THE DOOR. He jerks upright. \n\nVOICE\nHarry Zimm? \n\nHARRY\nWhat -- who is it . . . ? \n\nHarry, his hair a mess from sleeping on it, looks up at the door as it opens to reveal Ray Bones standing there. \n\nRAY BONES\nThe dipshit who's never been out've Miami. \n\nHarry wakes up quick, nearly wets himself as Bones then casually steps into the office. \n\nHARRY\nMr. Barboni. Well. This is surprise . . . \n\nScrambling now to play it the way Chili taught him, Harry quickly gestures to the red leather chair arross the desk. \n\nHARRY\nPlease. Have a seat. Right here in this chair right here . . . \n\nAs Ray Bones sits down, Harry moves to the blinds and opens them. Problem is, the sun's setting, so there's no glare at all. Ray indicates the nice red sunset . . . \n\nBONES\nThey say the fuckin' smog's the reason you have such beautiful sunsets. \n\nHarry just smiles, sits down at the desk, things already not going too well, about to get worse . . . \n\nINT. WINGATE MOTORS OFFICE -- SAME TIME \n\nThe walls are covered with posters of Porsches and Ferraris, the kind you can buy at the carwash with severely titted chicks sprawled on the hoods. Bo Catlett is behind a big wooden desk on the phone. \n\nBO CATLETT\nWhatta you mean, he faked them out? \n\nEXT. AIRPORT PAYPHONE -- DAY \n\nThe Bear, sort of half doubled over . . . \n\nBEAR\nHe knew it was a set up. He was ready for it. \n\nINTERCUTTING BO CATLETT & THE BEAR\n\n\nBO CATLETT\nSo where's the money? \n\nBEAR\nI guess still in the locker. \n\nBO CATLETT\nYou guess? You mean you don't know? \n\nBEAR\nI mean I don't care. \n\nBo Catlett looks into the outer office as a car pulls into the garage. Three dark-shaded gentlemen step out of the car. \n\nBO CATLETT\nBear, I'm going to call you later. \n\nINT. WINGATE MOTORS OFFICE -- DAY \n\nBo Catlett hangs up, gets to his feet as the men all look into the office now. \n\nBO CATLETT\nMr. Escobar. What a surprise. Welcome to L.A. \n\nWe can now see that one of the Latinos is older, the other two, younger, are his bodyguards. Mr. ESCOBAR, the older, meaner one . . . steps into the office . . . \n\nESCOBAR\nWhere is my nephew? \n\nBO CATLETT\nYour who? \n\nESCOBAR\nYayo. Where is he? \n\nBo Catlett stiffens . . . Uh oh. \n\nINT. GARAGE -- DAY \n\nAs the two back doors of a limo slum shut. There's half dozen other limos wedged in here. \n\nINT. LIMO -- SAME TIME \n\nBo Catlett sits in the back, wedged in between the two bodyguards, neither of whom has removed his shades. He faces Escobar on the opposite seat. \n\nESCOBAR\nHe's my sister's kid. No papa. Not too bright. Personally, I think he's a retard. I only gave him the job as a favor for my sister, you understand? \n\nBO CATLETT\nSure. Family. I know how that goes. \n\nESCOBAR\nHe comes up here with our product. He suppose to come home with five hundred thousand dollars. He never shows up. Meanwhile, my sister's going crazy calling me all the time worried about him. Me, I just wanna know what happened to my focking money. \n\nBO CATLETT\nWell, I don't know. I gave the man his money, sent him on his way. \n\nESCOBAR\nYou gave him the money? \n\nBO CATLETT\nI gave him a key to a locker that had the money in it. \n\nESCOBAR\nNow why would you do that? Put the money in a locker? \n\nBO CATLETT\nBecause there were a zillion DEA guys hanging around the terminal. \n\nESCOBAR\n(flat)\nA zillion, huh? That's a lot. \n\nEscobar studies him a moment. Bo Catlett shrugs. \n\nBO CATLETT\nMaybe your nephew panicked, took off. \n\nESCOBAR\nWhere's your partner, the jumpy one? Why isn't he here? \n\nBO CATLETT\nHe's around someplace. \n\nESCOBAR\nI hear he's around Palm Springs. Dealing our product. Product we sold to you for five hundred thousand dollars.\n(then)\nWhy do you keep talking to me bullshit? I think maybe I have Ramon and Ceasar staple your tongue to your chin. What do you think? \n\nBo Catlett barely glances at the bodyguards, smiles the gleamy smile to the Latin guy in front of him . . . \n\nBO CATLETT\nYou know, you speak very good English, Mr. Escobar. \n\nESCOBAR\nI went to UC San Diego.\n(then)\nWe're gonna spend the weekend at the Universal Sheraton. We're gonna take the tour. See the shark. Check out the Miami Vice Action Spectacular. After, we'll come here, get our money. \n\nOne of the bodyguards says 'Your nephew' in Spanish. \n\nESCOBAR\nOh, yeah, and Yayo, too. \n\nINT. RONNIE WINGATE'S PORSCHE -- DAY \n\nAs Ronnie zigzags in and out of traffic, giving people the 'look' as he passes . . . on the carphone. \n\nRONNIE\nHis fucking nephew? \n\nINT. WINGATE MOTORS -- SAME TIME \n\nBo Catlett on the phone . . . \n\nBO CATLETT\nYou get to town, you go straight to the bank, raid the limo account. \n\nINTERCUTTING RONNIE & BO CATLETT\n\n\nRONNIE\nI'm already in town, but it don't matter. We got dick in the bank. We dumped it all in Harry's movie. \n\nBO CATLETT\nWhat I'm sayin' is the man wants his money and he wants it now. \n\nINT. HARRY'S OFFICE -- DAY \n\nRay Bones impatiently listening to Harry . . . \n\nHARRY\nI'm talking about you, Ray Barboni, owning a piece of a major motion picture. How big a piece is up to you. What I'm saying, you could invest part of the three hundred Palmer owes you or you could invest all of it. It's entirely up to you . . . \n\nBones leans forward . . . \n\nBONES\nWhere's Leo Devoe? Where's Chili Palmer? Where's my fuckin' money? \n\nHARRY\nRay. Look at me. \n\nUh-oh . . . Ray's heard that one before . . . \n\nBONES\nWhat? \n\nHARRY\nLook at me, Ray. \n\nBONES\nYou say look at you? \n\nHARRY\nThat's correct. Look at me. \n\nBones shakes his head, stands up . . . \n\nBONES\nI tell you what . . . \n\nAnd in one fast move, Ray Bones grabs the phone off the desk and slams it into Harry Zimm's surprised face . . . \n\nBONES\nFuckin look at that, asshole . . . \n\nBones then yanks the phone out of the wall and throws it down at Harry . . . \n\nBONES\nAnd have a peek at that . . . \n\nRay Bones pulls a pair of black leather gloves from his pocket and steps around the desk . . . begins kicking the living shit out of Harry Zimm . . . \n\nBONES\nYou know, Harry, this is the exact fucking thing I needed after the fucking plane flight. My ass fell asleep . . .\n(kick)\n. . . seven times. I need a little fucking . . .\n(kick)\n. . . exercise. \n\nHarry tries to push himself to his feet, but Ray Bones stomps on Harry's hands . . . breaking them . . . and Harry falls back down . . . Bones crouches down . . . \n\nBONES\nYou got a big problem, Harry. \n\nBones grabs him by the hair, picks him up and throws him arross the room into the wall of pictures, many of them coming off their hooks and falling on top of Harry. \n\nBONES\nHey, Harry . . . Harry. Don't you pass out on me. Look up here . . . \n\nHarry, a crumpled heap, looks up and we see his bloody pummeled face as Ray Bones quickly crosses the room. He steps on Harry's neck with his shoe, pinning him to the floor . . . \n\nBONES\nWhere's my money? \n\nHarry can't speak; his jaw is broken. He looks sad lying there pinned beneath Ray Bones' shoe, wondering how it all went so wrong. \n\nBones pulls a 9mm from his coat pocket and aims it down at Harry's face . . . \n\nBONES\nHarry. I'm gonna ask you one more time, then I'm gonna shoot you, you don't tell me what I wanna know . . . \n\nHarry just makes a noise. Bones aims the gun at him. \n\nBONES\nWhere's my money? \n\nVOICE\nYour money? \n\nRay Bones looks over as Ronnie Wingate strolls into the office . . . Harry actually looks glad to see him. \n\nRONNIE\nWho the fuck are you? \n\nBONES\nRay Barboni. From Miami. \n\nRONNIE\nWhat, like that's supposed to mean something to me? \n\nRonnie then puts a cigarette in his mouth, eyes Bones. Harry tries to follow what's happening from the floor. \n\nRONNIE\nThe man you're steppin' on belongs to me and my partner. \n\nBONES\nHe owes me money. \n\nRONNIE\nGet in line, bro. \n\nBONES\nI don't like waiting. \n\nRONNIE\nTough shit, bro. This ain't Miami. You want something, talk to me. \n\nBONES\nHey, fuckball, I don't need your permission. L.A.'s an open city. \n\nRonnie opens his jacket so that Ray Bones can see the .357 Ronnie's got tucked into his belt. \n\nRONNIE\nYeah, well, I just closed it. \n\nBones looks at the gun, looks up at Ronnie standing there, hands on his hips, holding his jacket open. Bones raises his own gun . . . \n\nBONES\nYou a quick draw . . . 'bro?' You better be, your piece stuck way down in your belt like that. \n\nRONNIE\nWhatta you got there . . . some kinda pop nine, the fuckin' Fiat of guns, always jammin' at the wrong time. \n\nOkay. Bones thinks about that. His confidence a little shaken. They stand there a moment. Harry raises his hand, makes a gurgling noise as . . . \n\nRonnie goes for his gun. \n\nBoom. Boom. Boom. Harry closes his eyes as Ray Bones shoots Ronnie over and over, knocking the guy backwards until he hits the door, and slumps to the floor. \n\nRay Bones stares at Ronnie a moment, then comes out of his trance, looks down . . . quickly steps back . . . \n\nBONES\nDon't you puke on my shoes, Harry. \n\nHarry rolls over on to his side. Ray Bones deep in thonght now, picks the telephone up off the floor, sets it back down on the desk, then looks at Ronnie again. \n\nBONES\nHarry. I need you to do me a favor . . . \n\nHarry rolls over and looks up at Ray Bones. \n\nBONES\nI need you to take this gun and put a pill in the bro over there for me. \n\nHarry looks at the dead Ronnie Wingate, slumped up against the door, staring vacantly back at him. \n\nBONES\nI know what you're thinking, 'Why the fuck would I shoot him? He's already dead.' \n\nRay Bones crouches down beside him. Harry winces as Ray puts the gun in Harry's broken hand. \n\nBONES\nBut see, the cops got these tests, tell them whether or not a person fired a gun. And I was never here. \n\nHarry looks pleadingly at Ray Bones. \n\nBONES\nYou understand, Harry? I was never here. You say I was, and I'm gonna come back here throw you out that fuckin' window. \n\nHarry looks at the gun, feebly aims it at Bones. Bones frowns, pushes the gun away . . . \n\nBONES\nC'mon, knock it off, Harry. We don't have a lotta time here . . . \n\nHarry looks up at Ronnie, raises the gun . . . \n\nEXT. KAREN'S BACKYARD -- DUSK \n\nBeer in hand, Chili sits in a chaise longue by the pool. Karen watches him a moment from the doorway . . . \n\nKAREN\nNot a worry in the world. \n\nHe looks over . . . \n\nCHILI\nYour pool needs skimming. \n\nShe comes over, sits down. \n\nKAREN\nThat was Martin. He wants to have lunch tomorrow. That is, if you can make it. \n\nCHILI\nDepends, who pays? \n\nKAREN\nDefinitely not Martin. Movie stars never pick up the check. They have no idea what things cost. Most of them don't know their zip code and a lot don't even know their own phone number. \n\nChili looks at Karen a moment. \n\nCHILI\nHow'd you meet Martin anyway? \n\nKAREN\nNot unlike the way Nicki met him. Except it was a wrap party. Why? \n\nCHILI\nI don't know, I'm just havin' some trouble seeing you two together. \n\nKAREN\nYou don't like Martin much, do you? \n\nCHILI\nOh, I like him. I just think he's . . . short. I mean, he's a good actor and all, but I'm wondering what it was exactly you saw in Marty. \n\nKAREN\nFor starters, Marty wasn't Martin back then. \n\nFeeling him staring, she keeps her eyes on the sunset, and tries to change the subject . . . \n\nKAREN\nSo what about your story. You thought of a title yet? \n\nCHILI\nHow 'bout Get Shorty? Except that isn't a movie. That's real life. \n\nKAREN\nHow 'bout Chili's Hollywood Adventure. \n\nCHILI\nThat's a different story. I'm still working on that one, you know, getting the visual fabric just right.\n(then)\nAlthough I've added to it. \n\nHe looks at her, puts his drink down. \n\nKAREN\nYeah? \n\nCHILI\nYeah. There's a girl in it now. \n\nKAREN\nReally. \n\nAnd he leans over and kisses her. \n\nINT. KAREN'S BEDROOM -- NIGHT \n\nKaren and Chili lie in bed together. She looks at him . . . \n\nKAREN\nI think you could be an actor. I know you're acting sometimes, but you don't show it. \n\nCHILI\nYou thought I was faking? \n\nKAREN\nNo. I don't mean that. I just meant in general. \n\nCHILI\nOh. \n\nThe're both quiet a moment. Then . . . \n\nCHILI\nYou don't mean a movie star? More like a character actor? \n\nKAREN\nWhichever. Let's talk about it tomorrow. \n\nBut Chili can't stop thinking about this now . . . \n\nCHILI\nI mean I could see myself in movies Robert De Niro had been in. Or I could maybe do an Al Pacino movie, play a hard-on. But I couldn't see myself in ones, like say the one where the three guys get stuck with a baby. They don't know how to take care of it and you see these big grown-up assholes acting cute -- \n\nKAREN\nHey, Chili? Look at me. \n\nShe leans over and kisses him. Is still kissing him when the PHONE RINGS. They ignore it, let things heat up as we hear the ANSWERING MACHINE pick up O.S.... \n\nKAREN (V.O.)\nI'm not in right now. Leave a message at the beep . . . \n\nA BEEP, followed by . . . \n\nDORIS (V.O.)\nHi, Karen. It's Doris. Listen, doll, you might wanna come by Cedars tonight and visit Harry. He's in the emergency room . . . \n\nChili and Karen both jerk upright. \n\nINT. EMERGENCY ROOM -- SAME TIME \n\nAs Doris leads Karen and Chili towards the triage area. \n\nDORIS\nI stopped by his office to see if he wanted to take me to Le Dome for dinner when I saw Harry and this other man lying on the floor. \n\nDoris smiles as two UNIFORMED COPS walk past. \n\nDORIS\nGoodnight, Todd. Night, Louis. \n\nKaren and Chili exchange a look as they follow her into . . . \n\nTHE TRIAGE AREA \n\nWhere Harry lies in bed in a pain-killer stupor. Both of his eyes are black. His face is swollen and purple. \n\nKAREN\nHarry . . . My God . . . \n\nCHILI\nWhat happened? \n\nHe raises a bandaged hand and waves feebly . . . \n\nDORIS\nHe can't talk. He's full of Demerol. \n\nHarry tries to pull away as she runs a hand through his hair. \n\nCHILI\nWho'd he shoot? \n\nDORIS\nAccording to Todd -- Sergeant Randall -- a man named Ronnie came by Harry's office to collect on a debt. He got rough and Harry shot him. \n\nCHILI\nYou shot one of the limo guys? \n\nHarry gives Chili a sad look. We then hear . . . \n\nVOICE\nHello, hello . . . \n\nThey all look over as a RESIDENT walks over trailed by several MED STUDENTS. \n\nRESIDENT\n(enthusiastic)\nOkay . . . here we go. Looks like Mr. Zimm here's got a broken jaw and some neck trauma to go with those fractured hands . . . \n\nDoris winks at one of the young med students as the resident then turns to her, Karen, Chili. \n\nRESIDENT\nExcuse me, folks . . . \n\nThey step back as the Resident pulls the curtain shut, blocking their view of Harry. \n\nKAREN\nHey, Harry, listen, Martin wanted to meet us tomorrow at the Ivy for lunch. I'd cancel, but Martin's going to Cannes next week, so I think maybe Chili and I should still go. \n\nWe hear HARRY GRUNT from behind the curtain, then . . . \n\nRESIDENT (O.S.)\nOkay, who wants to take a crack at wiring Mr. Zimm's jaw? \n\nChili and Karen look at each other as we then . . . \n\nDISSOLVE TO\n\n\nEXT. BO'S DECK -- MORNING \n\nA PHOTOGRAPH OF HARRY ZIMM \n\nStanding beside some giant mutant maggot or something. We begin PULLING BACK . . . now we can read a headline above the photograph, 'PRODUCER INVOLVED IN SHOOTING.' \n\nBO CATLETT (V.O.)\nMotherfucker . . . \n\nAs Bo Catlett sits on his deck reading the newspaper. From inside, we hear the front door open and a moment later, the Bear steps out on to the deck, with Farrah, his little girl. \n\nBO CATLETT\nMotherfucker . . . \n\nBo Catlett looks over as Bear CLEARS HIS THROAT, indicates Farrah . . . \n\nBO CATLETT\nHey, Bear. I been calling you, man. Where you been? \n\nFARRAH\nHi Bo. \n\nBO CATLETT\nHey, Farrah. Hah you, little honey bunny. You wipe your feet, for you come in here? Keep Uncle Bo's carpet nice and white. \n\nBEAR\nYou see the paper? \n\nBO CATLETT\nI seen it, but I don't believe it. Says Harry shot Ronnie five times. Four to the chest and one through his foot. \n\nBEAR\nHis foot. Jeez, poor Ronnie . . . \n\nBO CATLETT\nYeah, I'm really gonna miss him. \n\nBo throws the paper aside. \n\nBO CATLETT\nListen, tonight, later on, I got one for you doesn't involve any heavy work. I want you to go have a look around Chili Palmer's hotel room. \n\nBEAR\nI can't. I got to take Farrah to Satan's place down in Costa Mesa. \n\nBO CATLETT\nWho? \n\nBEAR\nHer mother. Not that it matters because I don't work for you no more. I quit. I just wanted to come by, tell you to your face so there's no misunderstanding. \n\nBO CATLETT\nWhoa . . . This is the man used to jump offa high buildings? \n\nBEAR\nInto air bags. There's no cushion under what you're doing. I'm out of it, Cat. I'm done. \n\nBO CATLETT\nBear. The Colombians are in L.A. Seems they all upset about their money. That ain't enough, as a bonus, it turns out the yoyo was Escobar's nephew. \n\nBEAR\nThat's your problem. You shouldn't've smoked the guy. \n\nBo Catlett looks at the Bear, then smiles at Farrah . . . \n\nBO CATLETT\nCome here, honey bunny, come sit with your Uncle Bo. He hates being alone. \n\nBear watches uncomfortably as Farrah sits down with Bo. Bo looks up at the Bear . . . \n\nBO CATLETT\nFact, he hates it so much, if he takes a fall, he ain't gonna fall by himself. \n\nBo Catlett keeps his mouth close to her ear . . . \n\nBO CATLETT\nHe's gonna plea-deal his way out. Give up this ace stunt man now one of the West Coast dope kings, if they go easy on the Cat. \n\nBEAR\nCome here, Farrah . . . \n\nBo Catlett holds on to her, looks up at the Bear. \n\nBO CATLETT\nI heard in the Federal joints they let you spend an extra five minutes at the glass with your Daddy on Father's Day. \n\nBEAR\nFarrah. Come here. \n\nFarrah slips off the couch, walks over to the Bear . . . \n\nBEAR\nAfter this one, I'm out, Cat, you understand? This is the last time we talk to each other. \n\nBO CATLETT\nRemember Harry's story about the dry cleaner Palmer was after? Guy who stole the three hundred grand from the airline? \n\nBEAR\nWhat about him? \n\nBO CATLETT\nI was thinking tonight you could go have a look around Palmer's hotel room while I go check out Karen Flores' place. See if he hasn't stashed it somewhere. \n\nBEAR\n(beat)\nAnd if we don't happen to find it under Palmer's mattress or inside Karen Flores' undie drawer? What then? \n\nBO CATLETT\nJust do what I told you and meet me back here at midnight. \n\nAnd he winks at Farrah. \n\nEXT. KAREN'S HOUSE -- DAY \n\nChili's minivan is parked out front. \n\nVOICE (V.O.)\nSunset Marquis. \n\nINT. KAREN'S HOUSE -- SAME TIME \n\nChili, dressed in his suit, on the phone. \n\nCHILI\nThis is Mr. Palmer. I have any messages. \n\nHOTEL OPERATOR\n (PHONE)\nA Tommy Carlo called. He said to tell you that a Mr. Barboni was on his way to Los Angeles and that you should . . .\n(clears throat)\n. . . get the fuck out of there. \n\nCHILI\nWhen was this? \n\nOPERATOR\nTwo nights ago. \n\nChili hangs up as Karen comes into the room wearing a black suit, no blouse underneath, putting on an earring. \n\nCHILI\nWow. Nice earrings. \n\nEXT. KAREN'S HOUSE -- DAY \n\nAs Karen and Chili walk out to the minivan . . . \n\nCHILI\nWhat kinda food they serve at this Ivy place anyway? \n\nKAREN\nContinental, but it doesn't matter. Martin won't order from the menu. \n\nHe opens the door for her . . . \n\nCHILI\nWhy not? \n\nKAREN\nBecause a movie star can never order straight from the menu. They have to think of something they have to have that isn't on the menu. \n\nEXT. THE IVY -- DAY \n\nAs the valet drives off with Chili's minivan, a CAB pulls up and Harry -- his hands bandaged, his neck in a massive brace -- gets out . . . \n\nKAREN\nHarry, what're you doing? You're supposed to be in the hospital. \n\nCHILI\nYeah, Harry, you look like you belong in one of your horror movies. \n\nHarry waves them off points to himself as he mumbles through his wired jaw . . . \n\nHARRY\n. . . my project . . . \n\nHe then pushes past them and limps up the steps. The hubub on the patio quiets as the three of them then walk up to the Maitre D'. \n\nINT. THE IVY -- DAY \n\nMAITRE D'\nMr. Zimm. Nice to see you. \n\nHarry looks at him, not used to being greeted like this. \n\nMAITRE D'\nRight this way. \n\nAll eyes are on Harry as they're led to a table. Karen sits down, looks about at all of the gawking diners . . . \n\nKAREN\nYou're a celebrity, Harry. You shoulda shot someone a long time ago. \n\nChili watches Harry try to shake a cigarette out of the pack. Chili reaches over and helps him out. \n\nCHILI\nTell me, Harry, what'd you think of Ray Bones as a person? \n\nHarry goes stiff, looks at Chili as he lights one for himself . . . \n\nCHILI\nOnly a guy like Bones would mess you up like this, break your hands for no reason. He shoot Ronnie, too? \n\nHarry looks at Karen, quickly looks away. \n\nCHILI\nThing I don't get, Harry, is why'd you go and do a thing like talking to Ray Bones. You don't need guys like him or Bo Catlett. \n\nHarry looks at Chili now. \n\nCHILI\nI been here a while now and far as I can tell you're the only person in town actually making a movie instead of just talking about it. \n\nBefore Harry can answer, we hear a murmur and Chili and Karen look across the patio to the street, where . . . \n\nEXT. THE IVY -- DAY \n\nMARTIN WEIR \n\ngets out of a NEW MINIVAN, exactly like Chili's rental. \n\nINT. THE IVY -- DAY \n\nWe PAN WITH Martin as he stops off to say hello to people sticking their hands out at him to greet him, laugh at his stupid jokes . . . \n\nMARTIN\nChill. Harry. \n\nChili nods as Martin smiles, leans down and kisses Karen. \n\nMARTIN\nHi, sweetface. You look great. And mmmmm, you smell good, too. \n\nKAREN\nThanks. \n\nMartin sits down and fans the air in front of him. \n\nMARTIN\nWould you guys mind terribly not smoking? \n\nChili takes another drag, blows it out past Martin. Harry stabs his out, doing the best he can with two broken hands. \n\nMARTIN\nSo. Harry. I hear you had quite an experience. \n\nHarry grunts. \n\nMARTIN\nWell, I'm glad you're okay. And you know what else? \n\nHarry watches Karen and Chili a moment longer, turns to Martin . . . \n\nMARTIN\nI'm glad you rejected me ten years ago when I auditioned for Eddie Solomon, the pedophile clown in Birthday Boy. Had I gotten the part. I might've gotten typecast. \n\nMartin smiles at his own joke, looks up as the Maitre D' approaches. Harry turns back to Chili and Karen. \n\nMARTIN\nYou all ready to order? I kind've have another thing after this . . . \n\nChili watches anticipatingly as Martin studies the menu for maybe a second, returns it to the waiter . . . \n\nMARTIN\nYou know, I feel like an omelette. You think I could have a cheese omelette with shallots, but with the shallots only slightly browned . . . \n\nKaren and Chili exchange looks, pick up their menus. \n\nDISSOLVE TO\n\n\nINT. THE IVY -- DAY \n\nThey've finished lunch. Chili shares a bowl of ice cream with Karen. Harry sips cognac through one of those tiny cocktail straws . . . \n\nMARTIN\nI think the romance angle in your story is critically important, that isn't simply a jump in the sack for either of them. These two become deeply in love. \n\nHarry looks up . . . mumbles through his wired jaw . . . \n\nHARRY\nWhich two? \n\nMARTIN\n(ignoring him)\nOnce their lives are in danger and you have the mob guy coming after them, it not only heightens the tension, it adds a wistful element to their love. \n\nHARRY\nMob guy? \n\nHarry touches his jaw. It hurts to speak. \n\nMARTIN\nI have to consider, I mean, as the mob guy, this is another man's wife I'm sleeping with. \n\nKAREN\nAnd after all, you have such morals. \n\nHarry looks to Karen for help here . . . \n\nHARRY\nMob guy? \n\nMartin looks at his watch. \n\nMARTIN\nI have to run. But what I hope to see, they begin to have misgivings about wanting the money. It becomes their moral dilemma and they try to rationalize keeping it, but in the end they can't. Can they? \n\nHARRY\nWhat money? \n\nMARTIN\n(bewildered)\nThe three hundred large. What other money is there?\n(then)\nI should keep quiet, I know, till I've read the script, but I've got a feeling about this one. I'm that shylock. \n\nHARRY\nShylock? \n\nHarry winces in pain. Martin turns to him . . . \n\nMARTIN\nLook at me, Harry. \n\nHarry's already looking at him. \n\nMARTIN\nWhatta you think, Chill? \n\nCHILI\nThat's not bad. I think you got it down. \n\nHarry turns to Chili, and back to Martin again. Just now getting it . . . \n\nMARTIN\nReally, it scares me how well I know him. I could do this one tomorrow, no further preparation.\n(to Karen)\nBye darlin' . . . you really should think about acting again. I mean, maybe we could even do something together. \n\nNow Harry looks at Karen who forces a smile at Martin. \n\nKAREN\nI'll give it some heavy thought. \n\nEXT. KAREN'S HOUSE -- NIGHT. \n\nNo lights on. Chili's minivan out front. \n\nKAREN (V.O.)\nChili. Wake up. \n\nINT. KAREN'S BEDROOM -- SAME TIME \n\nKaren sits up in bed. Chili lies asleep beside her. She nudges him . . . \n\nKAREN\nWake up. Someone's downstairs. \n\nChili sits up on his elbows, listens. We can hear the TV. \n\nKAREN\nIt's Harry. Downstairs. \n\nChili sits up on his elbows, listens. \n\nCHILI\nYou sure? \n\nKAREN\nHe's doing the same thing you did to him, playing Letterman on TV. \n\nCHILI\nIt's not Dave. It's a movie. \n\nKAREN\nAre you going down? \n\nCHILI\nI don't know. \n\nKAREN\n(getting up)\nYou're as bad as Harry . . . \n\nCHILI\nI'll go. I'll go. \n\nHe gets up, pulls on his pants and the Lakers T-shirt he bought at the airport. \n\nCHILI\nHey, Karen, you have a gun? Any kind would be fine. \n\nShe shakes her head. He listens to the TV, then . . . \n\nCHILI\nI think it's Rio Bravo. \n\nINT. KAREN'S STUDY -- SAME TIME \n\nThe big-screen TV on loud, the big .45 in his lap. This time it's a movie, a western, not David Letterman that's on. John Wayne and Dean Martin shooting bad guys as Chili steps into the doorway and looks around; the room is empty now. Chili moves to the television and turns the volume down . . . \n\nHe 's about to walk out when the dark shape of Bo Catlett steps into the doorway and startles him . . . \n\nBO CATLETT\nI need the money. \n\nCHILI\nWhat money? \n\nBO CATLETT\nThe three hundred grand you got from a little dry cleaner named Leo. \n\nCHILI\nLemme see if I got this right, you break into Karen Flores' house, ask me for three hundred grand, doesn't even belong to you? \n\nINT. KAREN'S HOUSE -- HALLWAY \n\nAs Karen comes down the stairs, she can see Bo Catlett standing in the doorway bathed in the flickering light. \n\nBO CATLETT (O.S.)\nGive it to me, I'll be on my way. \n\nINT. KAREN'S STUDY -- SAME TIME \n\nAs Chili shakes his head at Bo Catlett . . . \n\nCHILI\nI can't believe the way you guys do business out here. I can't believe how fucked up your organization is. \n\nBO CATLETT\nTell you what . . . \n\nBo Catlett raises the .45 . . . \n\nBO CATLETT\nHow 'bout I give you to three, then I organize your fuckin' brains all over the wall back there. One . . . \n\nCHILI\nWhat, you gonna shoot me now, Bo? \n\nBO CATLETT\nIn just a second. Two . . . \n\nCHILI\nI don't believe this. \n\nBO CATLETT\nThree. \n\nBo Catlett is about to fire . . . when we hear a SCREAM. Not just any scream, but a completely professional one that fills the house and is all over Bo Catlett so that he starts firing before he's ready, giving Chili time to dive out of the way as . . . \n\nBo Catlett begins firing all over the room . . . keeps on firing until without thinking he blows out the TV and the room goes dark and the scream stops. Then . . . \n\nCHILI (V.O.)\nKaren? You okay? \n\nBO CATLETT (V.O.)\nShe can't talk right now. \n\nWe hear movement, then the lump goes on and we see Chili standing beside the desk looking to the doorway where Bo Catlett now has his hand over Karen's mouth. She struggles, but Bo hangs on to her . . . \n\nBO CATLETT\nThat's a nice scream, lady. You oughta be in movies. \n\nCHILI\nAlright, Bo. You can have the money . . . but it's not here. I have to go get it. \n\nBO CATLETT\nOkay. Fine. The meantime, I'll just hang on to her for safe keeping. \n\nChili and Karen are looking at each other now. \n\nBO CATLETT\nYou know Laurel Canyon? \n\nCHILI\nI'll find it. \n\nBO CATLETT\nI'm at 8150 Wonderland Avenue. It's right off Laurel. \n\nCHILI\n(looking at Karen)\nGimme an hour. \n\nEXT. BO CATLETT'S HOUSE -- NIGHT \n\nAs Bo Catlett pulls up, drags Karen out of the car. \n\nINT. BO CATLETT'S HOUSE -- SAME TIME \n\nThe Bear gets up off the couch as Bo Catlett shoves Karen inside . . . \n\nBO CATLETT\nYou get the money? \n\nBEAR\nNo. What's this? \n\nBO CATLETT\nPlan B. Here ya go, honey . . . \n\nHe shoves Karen into the bathroom and shuts the door . . . \n\nBO CATLETT\nMake yourself comfortable. \n\nINT. BATHROOM -- SAME TIME \n\nAs Karen shuts the door on him. She listens a moment. \n\nBO CATLETT\nWe gonna make a little trade. \n\nShe spots a copy of Martin's hardback Weir'D Tales by the toilet. \n\nKAREN\nFor Christ sake . . . \n\nINT. LIVING ROOM -- SAME TIME \n\nBo Catlett goes over to the stereo. \n\nBEAR\nTrade for what? \n\nBO CATLETT\nThe money. Fuck. I gotta think . . . \n\nWe hear Marvin Gaye OVER . . . \n\nBEAR\nJesus, Bo, what're you doing? \n\nKaren sticks her head out the door . . . \n\nKAREN\nHe doesn't know what the fuck he's doing. \n\nBo Catlett points the gun at her face . . . \n\nBO CATLETT\nShut up. \n\nShe closes the door. \n\nBEAR\nSo you kidnapped her? \n\nKaren opens the door again . . . \n\nKAREN\nThat's a fucking federal offense, asshole! \n\nBEAR/BO CATLETT\nShut up! \n\nAgain she shuts the door. \n\nBEAR\nYou get life for kidnapping. \n\nBO CATLETT\nCalm down, Bear . . . \n\nBEAR\nCalm down? We're going away for life and you tell me to calm down? \n\nHe taps Bo's gun . . . \n\nBEAR\n(ranting)\nHell, why not just shoot her? Why not shoot everybody. Fuckin' shoot me. Shoot the fuckin' president? \n\nBO CATLETT\nDon't fade on me now, Bear. Not unless you wanna hold Farrah on your lap in a room fulla felons. \n\nThe two men stare at each as we hear . . . \n\nINT. HOUSE -- SAME TIME \n\nCHILI\nSo this's one of those houses you see way up hanging over the cliff. \n\nThey both look over at Chili, standing in the doorway, lighting a cigarette. \n\nCHILI\nWhere's Karen? \n\nBO CATLETT\n(nods to the closed door)\nIn the can. That the money? \n\nChili opens Leo's bag so that Bo can see the money. \n\nCHILI\nLemme see her. \n\nBo Catlett shrugs, walks over and opens the bathroom door. Karen stands there with her arms folded across her chest. \n\nCHILI\nYou okay? \n\nKAREN\nGuy's got a fucking pink toilet, for Christ's sake. \n\nBO CATLETT\nShe's great. Gimme the money. \n\nCHILI\nFirst you and me gotta get a couple things straight. \n\nChili walks to the doorway leading out to the deck and turns around. He eyes Bo Catlett a moment, then . . . \n\nCHILI\nI've been shot at before -- once by accident, twice on purpose. I'm still here and I'm gonna be here as long as I want. That means you're gonna have to be somewhere else, not anywhere near me or Harry or Karen. \n\nChili sets the duffle bag down in front of him. \n\nCHILI\nHere's your money. Take it and leave the movie business to the rest of us, know what we're doing. C'mon Karen . . . \n\nThey turn to leave, we hear a LOUD CLICK as Bo raises the gun, takes a step towards them . . . \n\nBO CATLETT\nYou broke in my house and I have a witness to it. \n\nCHILI\nWhat? \n\nChili looks at the Bear. The Bear won't look at him. \n\nBO CATLETT\nOnly this time, no John Wayne and Dean Martin shooting the bad guys in El Dorado. \n\nCHILI\nIt was Rio Bravo. Robert Mitchum was the drunk in El Dorado, Dean Martin in Rio Bravo, practically the same part. John Wayne, he also did the same thing in both. He played John Wayne. \n\nBO CATLETT\nMan, I can't wait for you to be dead. \n\nCHILI\nBear, you're not really gonna -- \n\nThe Bear hooks one to Chili's face. Chili drops to his knees. \n\nBEAR\nThat's for the stairs. \n\nThe Bear kicks him, sending Chili back into the living room at Karen's feet. \n\nBEAR\nEver fallen down stairs before? It really hurts . . . \n\nKAREN\nHey -- \n\nKaren moves to help Chili. Bo raises the gun . . . \n\nBO CATLETT\nYou wanna go first, honey? That's fine with me. \n\nBear picks up Chili . . . \n\nBO CATLETT\nGet him off my carpet, you gonna make him bleed like that. \n\nThe Bear knees Chili in the gut, then shoves him out on to the balcony. Bo Catlett follows them out there . . . \n\nBO CATLETT\nLike I say, 'I warned him, officer, but he kept coming at me . . .' \n\nThe Bear follows Chili out, hits him again. \n\nBEAR\nAnd that's for the airport. \n\nBO CATLETT\nHey, he should have a weapon, a knife or something. \n\nBEAR\nWe'll get it later. \n\nAnd the Bear hits Chili again . . . \n\nBO CATLETT\nOkay, Bear . . . that's enongh. \n\nBut the Bear can't stop, keeps hitting Chili. Bo moves up to the Bear . . . \n\nBO CATLETT\nHey, Bear . . . enough! \n\nThe Bear looks at Bo Catlett . . . \n\nBO CATLETT\nYou keep hittin' him like that, he ain't gonna look like he broke in anymore, he gonna look like someone beat him up and then shot him. \n\nBEAR\nYou're right. \n\nAnd then the Bear, holding on to the back of Chili's shirt, shoves him towards Bo Catlett, who takes a step back, and grabs the rail behind behind him, and drops the gun as he gets a funny look on his face as . . . THE RAIL BREAKS AWA Y . . . \n\nBO CATLETT\nFuck . . . \n\nHe flails a moment, grabbing at spare, but then quickly grabs on to Chili . . . \n\nCHILI\nHey -- \n\nThe Bear tries to pull Chili back, but ends up holding a handful of Chili's shirt as both Chili and Bo Catlett go over the rail together and drop from sight . . . \n\nKAREN\nChili! \n\nEXT. FROM THE HOUSE BELOW -- LOOKING UP AT BO CATLETT'S HOUSE \n\nAs a body falls . . . too dark to see who . . . \n\nEXT. BO CATLETT'S DECK -- SAME TIME \n\nAs Karen spots THE GUN on the deck as two hands apprar on the edge and the Bear rushes forward . . . \n\nBEAR\nC'mon, man, gimme your hand . . . we gotta get outta here . . . \n\nBehind the Bear, Karen picks the gun up off the deck, points it at the Bear. . . \n\nBEAR\nHey, Karen, don't -- \n\nThe Bear reaches down again and BOOM! Karen SHOOTS THE BEAR IN THE LEG. He cries out, falls back and lets go of . . . \n\nCHILI \n\nWho now barely hangs on to the deck. \n\nCHILI\nKaren! What the fuck are you doing?! \n\nKAREN\nOh, shit . . . I'm sorry . . . I thought that was . . . I'm so sorry . . . \n\nShe comes over to the edge . . . helps the now wounded Bear pull Chili back up on to the deck. Then they all stand there looking down at Bo Catlett lying in the weeds and scraggly bushes, a hundred or so feet down, not moving. \n\nMarvin Gaye singing 'Ain't No Mountain High Enongh' as Chili then steps back, looks at the railing . . . \n\nCHILI\nJesus. How'd that happen? \n\nThe Bear starts taking bolts and nuts, old used ones, out of his pants pockets. Wiping each one on his shirt before dropping it over the side . . . \n\nBEAR\nBeats the shit out of me. \n\nBO CATLETT'S POV -- CHILI, KAREN, & THE BEAR \n\nThe three of them looking down. Slowly the picture gets blurry as we then . . . \n\nFADE OUT. \n\nWe then TILT DOWN TO REVEAL\n\n\nEXT. SUNSET MARQUIS HOTEL -- NIGHT \n\nAs Chili and Karen pull to the curb out front. She looks at him . . . \n\nKAREN\nWere you scared up there? \n\nCHILI\nYou bet. \n\nKAREN\nYou don't act like it? \n\nCHILI\nI was scared then, not now. How long you want me to be scared? \n\nShe looks off, shakes her head . . . \n\nCHILI\nI'll be right back. \n\nKAREN\n(shakes her head)\nGo get your stuff. \n\nINT. CHILI'S ROOM -- NIGHT \n\nAs Chili enters, takes off his suitcoat, drapes it over a chair. He takes his suitcase out of the closet, throws it on the bed, and freezes as . . . \n\nRAY BONES \n\nextending the 9mm at Chili, comes out of the bathroom. \n\nCHILI\nYou don't need that. You want to sit down and talk, it's fine with me. Get this straightened out. \n\nBones steps further into the room as Chili turns his back on Bones, walks to the sofa and sits down. \n\nCHILI\nHow'd you get in here? \n\nBONES\nI told them I was you. I acted stupid and they believed me. \n\nCHILI\nSo what brings you to L.A., Bones? \n\nBONES\nDon't insult me. Get up and turn around. \n\nChili gets to his feet. Bones motions with the gun and he turns to face the painting over the sofa. Bones comes over and lifts his wallet from his back pocket. \n\nBONES\nYou're the dumbest fucking guy I ever met in my life. Let's see what's in your pockets. \n\nHis face still to the wall, Chili shoves his hands in and pulls the side pockets out. Bones turns away. \n\nBONES\nWhat you should've done was told me about Leo Devoe as soon as you found out. \n\nChili looks over his shoulder to see Bones pulling his suitcoat from the back of the chair . . . \n\nCHILI\nWhy would I do that? \n\nBONES\n'Cause the guy's a customer now, stupid. His ass belongs to me. \n\nBones lays the pistol on the conuter, holds the suitcoat with one hand and feels through it with the other expression changes, his eyes open wider. \n\nBONES\nWhat have we here? \n\nHis hand comes out of the suitcoat with the LOCKER KEY. Chili sits down on the sofa again; he can't believe how easy this is gonna be . . . \n\nCHILI\nGive me my cigarettes. They're in the inside pocket. \n\nBones throws him the coat. \n\nBONES\nHelp yourself. \n\nBones then holds up the key to look at it. \n\nBONES\nC-one-eight. \n\nFrowning now. Putting on a show. \n\nBONES\nI wonder what this's for, a locker? Yeah, but where is it? \n\nChili sits back to smoke his cigarette, lets it happen. \n\nCHILI\nI checked the bag at the airport, when I came. \n\nBONES\nYeah? Which terminal? \n\nCHILI\n(beat)\nSovereign. \n\nBONES\nYou found Leo, didn't you? Took the poor asshole's money and put it in a locker, ready to go.\n(looks at him)\nWhy haven't you left? \n\nCHILI\nI like it here. \n\nChili shrugs. Bones eyes the key a moment, then . . . \n\nBONES\nLook, there's no reason you and I shouldn't get along. Forget all the bullshit from before -- I don't even remember how it started. You took a swing at me over some fuckin' thing, whatever it was -- forget it. You owe me some money, right? Forget that too. But, you don't say a fuckin' word about this to anybody. It's strictly between you and me, right? \n\nCHILI\nWhatever you want, Ray. \n\nEXT. SUNSET MARQUIS HOTEL -- NIGHT \n\nAs Ray Bones gets into a cab . . . \n\nWOMAN (V.O.)\nDrug Enforcement Agency. \n\nINT. CHILI'S HOTEL ROOM -- LATER \n\nChili is on the telephone. \n\nCHILI\nI wanna speak to the agent in charge. \n\nWOMAN\n (PHONE)\nWhat is this in regard to? \n\nCHILI\nA locker out at the airport, full of money. \n\nChili waits. Then . . . \n\nMAN'S VOICE\n (PHONE)\nWho's speaking please? \n\nCHILI\nI can't tell you. It's an anonymous call. \n\nMAN\n (PHONE)\nAre you the same anonymous asshole called the other day? \n\nCHILI\nNo, this is a different one. Have you looked in that locker, C-one-eight? \n\nThere's a pause on the line. \n\nMAN\nYou're helping us out. I'd like to know who this is. \n\nCHILI\nI bet you would. You want to chat or you want me to tell you who to look for? The guy's on his way out there right now. \n\nMAN\nYou know there's a reward for information that leads to a conviction. That's why I have to know who this is. \n\nCHILI\nI'll get my reward in heaven. The guy you want has a bullet scar in his head and is wearing gray shoes. You can't miss him. \n\nEXT. SUNSET MARQUIS -- NIGHT \n\nAs Chili follows the bellboy out of the hotel. He tips the guy, then gets in the car with Karen. \n\nKAREN\nWhat took you so long? \n\nCHILI\nCouldn't find my toothbrush. \n\nHe kisses her, then starts the car. \n\nEXT. SOVEREIGN TERMINAL -- LAX -- NIGHT \n\nAs Bones, seen only from the back now, gets out of the cab, enters the terminal. \n\nINT. SOVEREIGN TERMINAL -- SAME TIME \n\nAs Ray Bones, still seen only from the back casually strolls through the terminal, playing with the LOCKER KEY in his hand. \n\nRay walks right up to C-18 and inserts the key, turns it, and opens the locker to reveal a BLACK ATHLETIC BAG sitting inside . . . Chuckling, he then reaches inside . . . \n\n. . . then stiffens as we hear A CLICK as a RED LASER DOT hits him in the temple . . . \n\nVOICE\nLook at me, Boots. \n\nBones turns his head and we see that it's not the Ray Bones we know, but . . . AN ACTOR, a tough-looking guy with a scary face . . . \n\nWE PULL BACK FURTHER TO REVEAL\n\n\nMARTIN WEIR standing there with the biggest fucking gun with laser scope we've ever seen. A BEAUTIFUL WOMAN with the biggest -- well, you get the idea -- is standing next to him . . . She screams . . . \n\nWOMAN\nWatch it, Steve! \n\nBullets and blood fly as the tough guy pulls a gun from the locker and begins firing wildly at Martin and the Woman and Hare Khrishna's and anybody else who happens to be in the vicinity . . . \n\nMartin, the tough guy only two feet away, calmly aims his gun and pulls the trigger, but nothing happens. He shakes the gun . . . \n\nMARTIN\nDammit . . . not again . . . \n\nDIRECTOR\nCut! \n\nPULL BACK FARTHER TO REVEAL\nA SOUNDSTAGE \n\nSet up like the airport terminal. Martin throws a fit about the malfunctioning prop as The Bear walks up to him. \n\nBEAR\nMartin, maybe you should dive or roll out of the way or something . . . \n\nHARRY\nAlright, let's wrap! We'll pick it up tomorrow! \n\nAs Karen crosses the soundstage, we track along the backs of a row of director's chairs with the names . . . MARTIN WEIR . . . HARRY ZIMM . . . KAREN FLORES AND . . . CHILI PALMER. Chili stands chatting with BUDDY LAFKIN. \n\nBUDDY\nBut Martin already told me he loves it. \n\nCHILI\nLook, I don't know, Buddy, I don't think Martin's right for this new one. \n\nBUDDY\nWhy the hell not? \n\nCHILI\nHe's too short. \n\nEXT. SOUNDSTAGE -- DUSK \n\nAs Karen, Chili, Harry, Martin, and Buddy all exit the soundstage. Karen and Chili get into Chili's minivan. \n\nAs they pull out, we see the name 'C. Palmer' painted in the space. \n\nWe then CRANE UP AND BACK as Harry, Martin, and Buddy each get into their own minivans . . . and we then . . . \n\nFADE OUT. \n\n\n\n\n\n\n\n\n\n\nGet Shorty\nWriters :   Scott Frank\nGenres :   Action  Comedy  Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Chili Palmer, a loan shark based in Miami, clashes with mobster, Ray \"Bones\" Barboni over a leather jacket borrowed from Palmer at a restaurant without permission by Mr. Barboni. They have two confrontations, the first of which leaves Barboni with a broken nose. Barboni then wants his boss Jimmy Capp to go after Palmer, but he refuses, as Palmer has done nothing wrong. Barboni took the jacket without permission, and Chili's car keys were in the jacket. Jimmy also tells Bones that Chili works for another mafioso named Momo and Capp has no power over him. But soon after Palmer's boss, Momo, dies of a heart attack, Chili finds himself working for Barboni, whose first order is for Palmer to collect a loan shark debt owed by dry cleaner Leo Devoe. Devoe was believed to have been killed in a commercial airliner crash, but in truth had actually gotten off the plane, and failed to re-board because he was getting drunk in the airport bar. After the plane crash, Devoe's wife identified his personal effects, and the airline quickly offers her an insurance check for $300,000. Faye carelessly gives Leo the insurance money, and he heads out of Miami. When Chili visits Leo's \"widow\" Faye, she reveals to Palmer that Leo is still alive, has left Miami, and is partying and winning money in Las Vegas, Nevada.\nWhile in Las Vegas, looking for Leo, Palmer also picks up a debt collection job from a casino manager to collect a marker debt from a B-movie producer/director named Harry Zimm. Palmer goes to Los Angeles and locates Zimm sleeping at the home of actress Karen Flores. After breaking into her house, Chili turns on the television, and waits for Zimm to come downstairs. At first scared of Chili, soon Zimm agrees to pay the casino the money he owes in 90 days. Film fan Palmer then pitches a movie idea: a thinly veiled story of his own life, being a shylock, including the airline insurance scam by Leo.\nZimm is very interested, but he has pressing financial problems: He owes $200,000 to limo company owner/drug dealer Bo Catlett, who also wants to be \"high up\" in the movie business. Chili Palmer says he will help Zimm take care of the money problem with Bo, and will stall Bo on the making of a Zimm movie called \"Freaks\". Arriving at Harry's movie office, Catlett is with his drug dealing sidekick Ronnie. They are visiting Zimm's office for a progress report about the Zimm film they are financing, titled \"Freaks\". Waiting for them with Harry is Palmer. Harry Zimm tells Catlett that Zimm has a different project, other than \"Freaks\", one he cannot talk about, to finish up first. Chili takes over the meeting, explaining that Bo and Ronnie must wait for Harry's other project to be finished first. Bo and Ronnie get angry, and Harry suddenly panics. Being afraid of Bo and Ronnie, to Chili's disgust Harry reveals the new Zimm movie project is a book by Murray Saffron, called \"Mr. Lovejoy\". Catlett and his partner Ronnie then proceed to threaten Zimm, saying they want their money back, or to put their money into \"Mr. Lovejoy\" instead of \"Freaks\".\nAfterward, Bo Catlett meets Colombian drug runner Yayo Portillo at the airport for a big cocaine transfer deal, and tells Yayo that he has to pick up the cocaine money from a locker at the airport. Yayo is upset at this deal change. Portillo is aware that the locker is under surveillance by the DEA, and Yayo refuses to get the money. Bo's bodyguard Bear, with his daughter, picks up his cocaine suitcase at the luggage claim. Bo with his partner Ronnie and Bear leave with the cocaine. Two days later Yayo confronts Bo at his house in the Hollywood hills and demands his money - and in frustration Bo shoots him dead.\nLater that day Palmer returns to Karen's house, where he asks Karen on a date. Karen is the ex-wife of actor Martin Weir, which gives Palmer the idea that Weir should star in his movie. Karen cannot go out, but latter shows up at the end of the movie Chili has suggested they go see - \"Touch of Evil\", with Orson Welles. The next day Chili and Karen go to Martin Weir's home to pitch the script idea, with Chili giving the actor tips on how to act exactly like a loan shark. Weir is intrigued with Chili and Karen's script idea.\nZimm has a lunch meeting with Chili and Karen, but Catlett and Bear suddenly show up and offer to invest the $500,000 that is still in a locker at the airport, which is the money owed to the drug cartel that didn't get picked up by Yayo. Zimm agrees to sideline Chili's project just as Chili and Karen arrive for their lunch with Harry at the restaurant. Bear confronts Chili, who throws Bear down the stairs and then threatens Catlett. Zimm tells Chili and Karen about the money, and asks Chili to pick it up but Chili recognizes that it is a setup by Catlett and that there is a high probability that the money is being watched. Chili goes to the airport and creates a ruse that reveals that the DEA is looking for someone that will be trying to get the locker money, and Chili leaves without being connected with the cash.\nAfter an evening office tryst with Doris, Murray Saffron's widow, a drunken Zimm makes a call to Ray Barboni in Miami, telling him Chili has recovered the money from Leo Devoe and insults Barboni by speaking to him rudely on the phone. Barboni promptly flies to Los Angeles, confronts Zimm in his office, and beats him mercilessly when Zimm does not reveal the location of Chili and the money. Drug dealer Ronnie walks in, confronts Barboni, and Ray suddenly shoots him, then puts the gun in Zimm's hand.\nDoris, Zimm's girlfriend, whose late husband wrote \"Mr. Lovejoy\", calls Karen and tells her that Zimm is in the hospital. When he is eventually released, Zimm must wear a neck brace and remains in agonizing pain, even as he endures Weir's arrogant behavior in a brief lunch meeting with Chili and Karen about their movie project.\nDesperate for money after double crossing Colombian cartel lord Escobar, Catlett kidnaps Karen and demands the money that Chili has gotten back from Devoe. But after Chili gives him the money, Catlett reneges on their deal. Chili cuts a deal with Bear to double-cross Catlett. On a balcony at Catlett's home, where Karen is being held, Bear pretends to give Chili a beating, but it's a set-up. In the struggle, Catlett is pushed over a balcony rail that was previously loosened by Bear and falls to his death.\nAt his hotel, Ray Barboni confronts Palmer, demanding the money. Barboni finds the airport locker key, questions Chili, and assumes the money is hidden in the locker. At the prospect of acquiring DeVoe's insurance money without further incident, he expresses to Palmer a desire to bury the hatchet and forget all past transgressions. Barboni heads to the airport and approaches the locker as the DEA agents alert one another and appear ready to move. Suddenly, we hear actor Martin Weir confront Barboni from off-camera. Barboni turns around, and he is now being played by actor Harvey Keitel. Barboni fires at Weir, who attempts to fire back, but the movie gun malfunctions and ejects the magazine. The director, Penny Marshall, yells \"cut\", and we recognize that the scene is now a MGM Hollywood set. As the movie set wraps for the day, we see Zimm is executive producer (accompanied by widow Doris Saffron nagging him), Chili and Karen as co-producers, and Bear as a special effects technical consultant."}