{"title": "Hard Rain", "full_text": "\"HARD RAIN\"\n\n                                      Screenplay by\n\n                                       Graham Yost\n\n                                           1998\n\n                                      SHOOTING DRAFT\n\n\n                \n\n               FADE IN\n\n               RAIN\n\n               Falls from low grey clouds. Down below we see...\n\n               THE RIVER\n\n               Muddy, slow and powerful, overflowing its banks. In the near \n               distance is...\n\n               THE RESERVOIR\n\n               Filled to the maximum, water thundering out of two open gates. \n               We close in on...\n\n               THE DAM\n\n               There's a Dam Control Office in the middle of the dam. We \n               MOVE OFF the reservoir and head out over...\n\n               THE TOWN OF HUNTINGBURG\n\n               We see \"NO FEAR\" spelled out in stones on one man's roof. We \n               go down and into...\n\n               EXT. STREETS OF HUNTINGBURG - DUSK\n\n               Storefronts are sandbagged and closed. A sign on one store \n               reads: GONE FISHING. A sign on another: HEY LOOTER. NOTHING \n               OF VALUE HERE. TRY NEXT DOOR. And on the next store: HE'S \n               LYING.\n\n               A CHURCH\n\n               Beautiful, old, ringed with a five-foot-high wall of sandbags. \n               The floodwater is up to the first level of sandbags.\n\n               CARS AND PICKUP TRUCKS\n\n               Loaded down, are heading out of town on streets covered in \n               the first water of the flood.\n\n               A STATUE\n\n               On an island in the middle of the street. It's Civil War-\n               era, of a general on a horse, sword held high. The floodwater \n               is over the curb, lapping at the base of statue's pedestal. \n               Near the statue stands...\n\n               THE SHERIFF\n\n               50s, with soft edges and friendly eyes. He's talking into \n               his radio mike.\n\n                                     SHERIFF\n                         So, are we all going to die?\n\n               EXT. RESERVOIR DAM\n\n               HANK, the dam control officer, is on the radio with the \n               Sheriff.\n\n                                     HANK\n                         Not right now. But I'm gonna have to \n                         let out a little more.\n\n               EXT. MAIN STREET\n\n               WAYNE and PHIL, two deputies, 30s, are near the Sheriff, \n               shoring up a sandbag wall that has partially collapsed.\n\n                                     PHIL\n                         I think my best was when I turned \n                         twelve. My Dad set up a treasure \n                         hunt. It was really cool.\n                              (off Wayne's disdainful \n                              look)\n                         Well, it was.\n\n               Wayne shrugs a \"whatever\" and pulls a sandbag up out of the \n               water. There's unpleasant-looking muck all over his arms. He \n               drops the sandbag back into the water and shakes off the \n               crud with disgust.\n\n                                     WAYNE\n                         This blows.\n\n                                     PHIL\n                         My most awful birthday was sweet \n                         sixteen. I had mono. How about you? \n                         What was your worst?\n\n                                     WAYNE\n                         You kidding? You think I could've \n                         possibly had a birthday worse than \n                         this? What kind of loser do you think \n                         I am?\n\n                                     SHERIFF (O.S.)\n                         Don't answer that, Phil.\n\n               The Sheriff walks over.\n\n                                     SHERIFF\n                         Hank says he's gonna open another \n                         gate. We're gonna get another rise.\n\n               They turn at the sound of honking. The MAYOR drives up.\n\n                                     MAYOR\n                         Gentlemen. Hey -- happy birthday, \n                         Wayne.\n\n               Wayne nods. Phil stiffens. They do not like this guy.\n\n                                     MAYOR\n                              (to the Sheriff)\n                         Mike, I gotta say, what you're \n                         doing... I don't know if I'd be here, \n                         considering.\n\n                                     SHERIFF\n                              (good-natured)\n                         Well, you would be if you wanted to \n                         get the last couple of paychecks \n                         some bastard owed you.\n\n                                     MAYOR\n                              (grins, then:)\n                         I just want you to know I think the \n                         people 'round here made a big mistake.\n\n               Phil grumbles to himself.\n\n                                     PHIL\n                         \"The people\"? You're the one who \n                         screwed him.\n\n                                     MAYOR\n                         Sorry, Phil?\n\n                                     PHIL\n                              (blushes)\n                         I, uh --\n\n                                     SHERIFF\n                              (to Mayor, saving \n                              Phil)\n                         You know, Bob, as much as I'd love \n                         to stand here all day talking about \n                         how great I am, if you don't get \n                         moving I'm gonna have to haul your \n                         sorry ass off to jail.\n\n                                     MAYOR\n                              (laughs)\n                         Okay, okay, I'm going. Keep up the \n                         good work, boys. It's appreciated.\n\n               The Mayor rolls up his window and heads off.\n\n                                     WAYNE\n                         Whaddya say we go torch the fucker's \n                         house and blame it on looters. Or \n                         how about we put a dead cow in his \n                         living room. He comes back after \n                         it's been in the water a couple of \n                         days. Hello!\n\n                                     SHERIFF\n                              (shakes head)\n                         You wanna know how to get the best \n                         revenge on the Mayor and his boys? \n                         You do exactly what we're doing. You \n                         protect the town. You protect it \n                         better than they would. Better than \n                         they ever could.\n\n                                     WAYNE\n                              (thinks, shrugs)\n                         I think the dead cow's better.\n\n                                     SHERIFF\n                              (ignores Wayne)\n                         Any looter that comes in here is in \n                         for a big surprise, cause as long as \n                         I'm still wearing this pointy thing...\n                              (indicates badge)\n                         ...nobody's taking anything from \n                         this town.\n\n               INT. BANK VAULT\n\n               Nervous assistant bank manager WELLMAN is hurriedly tossing \n               stacks of money into two canvas bags.\n\n               A MAN'S SHADOW\n\n               Washes up on Wellman.\n\n                                     CHARLIE (O.S.)\n                         Do you think you could go a little \n                         faster, pal?\n\n                                     WELLMAN\n                         I -- I'm going as fast as I can.\n\n               SECOND SHADOW COMES UP\n\n                                     TOM (O.S.)\n                         Well, it's not fast enough.\n\n               Wellman is about to speak, then sees something, gulps.\n\n               A SHOTGUN\n\n               Is held by one of the men, pointed at the floor.\n\n               WELLMAN\n\n               Sweeps the money off the shelves and into the bags.\n\n                                     SECOND MAN (O.S.)\n                         That it?\n\n                                     WELLMAN\n                         Yes. We don't keep any of our --\n\n               THE TWO MEN\n\n               Ignore Wellman, grab the canvas bags and stride off.\n\n               EXT. BANK - DAY\n\n               CLOSE ON the lower half of the front doors as they fly open. \n               Out come TWO MEN in long dark raincoats.\n\n               WELLMAN\n\n               Runs up, stopping in the open door.\n\n                                     WELLMAN\n                         Hey, wait!\n\n               VERY CLOSE ON THE TWO MEN\n\n               As they slowly turn to face Wellman. We just see their faces, \n               shielded from the rain by hat brims. Meet...\n\n               TOM AND CHARLIE\n\n               Tom, 30, handsome, with an easy smile. Charlie, 50, with a \n               tough, red face.\n\n                                     CHARLIE\n                         Excuse me?\n\n               WELLMAN\n\n               Looks nervous for a second, then holds up a clipboard.\n\n                                     WELLMAN\n                         You forgot to sign.\n\n               TOM AND CHARLIE\n\n               We see, for the first time, by their hats and uniforms, that \n               they are armored car drivers. There's an armored car parked \n               at the curb, on the other side of a low wall of sandbags.\n\n               Charlie sighs, goes back to Wellman and perfunctorily signs \n               the form. Then he and Tom go to the sandbag wall. Tom holds \n               both bags in one hand and the shotgun in the other. Charlie \n               doesn't want to get wet.\n\n               He steps from the sandbag wall onto the rear bumper of the \n               truck, then keys open the doors.\n\n                                     CHARLIE\n                         Okay.\n\n               Charlie reaches out for the money bags. Tom jumps off the \n               sandbag wall and lands in the water, splashing Charlie.\n\n                                     CHARLIE\n                         For Christsakes!\n\n                                     TOM\n                         It's a flood, Charlie. You're gonna \n                         get wet.\n\n               Charlie takes the bags, tosses them in then shuts the back. \n               He moves toward the front, still trying to keep out of the \n               water. Tom splashes him some more.\n\n                                     CHARLIE\n                         Hey! Do you know what kind of crap \n                         is in that water?\n\n                                     TOM\n                              (of course he knows)\n                         Well, yeah.\n\n               Tom kicks some more water at Charlie. Charlie gives Tom a \n               withering look and climbs in the truck.\n\n               INT. ARMORED TRUCK\n\n               Charlie gets into the driver's seat; Tom climbs into the \n               shotgun seat. They shut and bolt the doors. Charlie gets on \n               the radio.\n\n                                     CHARLIE\n                         Dispatch, this is 31.\n\n                                     DISPATCHER (V.O.)\n                         Go ahead, 31.\n\n                                     CHARLIE\n                         We're leaving Huntingburg. We'll be \n                         back in an hour.\n\n                                     DISPATCHER (V.O.)\n                         Ten-four. Get out of there.\n\n                                     CHARLIE\n                         We're gone. Over and out.\n\n               Charlie hangs up the radio. He starts writing on a clipboard. \n               Silence for a few moments, and then Charlie notices Tom \n               staring at him.\n\n                                     CHARLIE\n                         What?\n\n                                     TOM\n                         Your ear.\n\n                                     CHARLIE\n                         What about my ear?\n\n                                     TOM\n                         You've got a major hair growth going \n                         on.\n\n                                     CHARLIE\n                         Shut up.\n\n                                     TOM\n                         I'm serious. You're gonna need \n                         somebody to go in there with a weed \n                         whacker.\n\n               Charlie grabs a donut bag off the seat and tosses it to Tom.\n\n                                     CHARLIE\n                         Here.\n\n                                     TOM\n                         You're offering me one of your donuts? \n                         I don't know what to say. I'm getting \n                         all misty.\n\n                                     CHARLIE\n                         If it'll shut your mouth you can \n                         have the whole bag.\n\n               Charlie starts the truck. Tom thinks about it, then tosses \n               the bag back.\n\n                                     TOM\n                         Nah. I start eating donuts and I'll \n                         never get out of this truck.\n\n                                     CHARLIE\n                              (disgusted)\n                         I love how you think you're better \n                         than this.\n\n                                     TOM\n                         Don't get me wrong, Charlie. There's \n                         a lot to like about this job -- and \n                         I don't just mean the dashing \n                         polyester ensemble and the solid \n                         three-figure income.\n\n                                     CHARLIE\n                              (angry)\n                         You ungrateful shit! I don't believe \n                         you!\n\n                                     TOM\n                              (surprised)\n                         Charlie, relax! I was kidding!\n\n                                     CHARLIE\n                         You don't wanna do this? Fine. Go \n                         back to selling hot construction \n                         machinery. That's a helluva career.\n\n                                     TOM\n                         It had better hours.\n\n               Charlie slams the clipboard down on the seat.\n\n                                     CHARLIE\n                         You think this is a joke? This is \n                         funny? Jesus Christ! You know how \n                         lucky you are you could get in here? \n                         Thirty years old and all the crap \n                         you pulled and you never got caught?\n\n                                     TOM\n                              (angry)\n                         That wasn't luck, old man. That was \n                         skill. I was good at it.\n\n                                     CHARLIE\n                         Oh, yeah, it takes a lot of skill to \n                         fence bulldozers. That's goddamn \n                         genius time.\n\n                                     TOM\n                         About as much skill as it takes to \n                         sit in a truck and get fat eating \n                         donuts.\n\n                                     CHARLIE\n                         Oh, so that's all I've been doing, \n                         huh? Just wasting my life away.\n\n                                     TOM\n                         I didn't say that.\n\n                                     CHARLIE\n                         Yeah, building a home, raising a \n                         family -- that's just stupid.\n\n                                     TOM\n                         I didn't say that!\n\n                                     CHARLIE\n                         You know what, Tom? I really don't \n                         give a shit what you said.\n\n               Tom doesn't reply. Charlie puts the truck in gear; starts \n               off. Tom looks at Charlie, shakes his head -- what was that \n               about?\n\n               EXT. ROADSIDE BAR - ESTABLISHING - DUSK\n\n               INT. ROADSIDE BAR - DUSK ECU PEN ON PAPER\n\n               Writing letters in a crossword puzzle. Holding the pen is...\n\n               JIM\n\n               Late 50s, with a creased face and piercing eyes. He's sitting \n               at the bar, drinking coffee. Rain sheets down outside. The \n               BARTENDER watches TV, sound off. Next to Jim at the bar are...\n\n               RAY, KENNY AND MR. MEHLOR\n\n               Ray, 40s, has lank hair, rheumy eyes and a glass of Irish \n               whisky in front of him. Kenny, 20s, long hair, has the energy \n               of a puppy -- unfortunately he has about as much smarts as a \n               puppy. Mr. Mehlor. 40s, looks like -- and was -- a high school \n               teacher.\n\n               ON TV\n\n               Sound off, a MAN is crying about what he has lost in the \n               flood.\n\n                                     RAY\n                         \"Thus saith the Lord; Behold, waters \n                         shall rise up out of the north and \n                         be an overflowing flood and all the \n                         inhabitants of the land shall howl.\" \n                         Jeremiah 47:2.\n\n               Ray takes a drink. Kenny leans over to Ray, sotto.\n\n                                     KENNY\n                         You're gonna be able to buy a helluva \n                         lot of bibles, huh, Ray? Me? First \n                         thing I'm gonna do is get my brother \n                         a lawyer. Best that money can buy.\n\n               A thought comes to Jim -- an answer to a clue in the crossword -- \n               and he starts filling in words as Ray and Kenny talk.\n\n                                     RAY\n                         What's he facing?\n\n                                     KENNY\n                         Thirty in.\n\n                                     RAY\n                         He cap a cop or something...?\n\n                                     KENNY\n                         Security guard. \"In the commission...\" \n                         All he's got is a piece of shit P.D. \n                         Now I'm gonna be able to afford him \n                         a good lawyer -- a guy with a haircut.\n\n               Jim leans over to Kenny.\n\n                                     JIM\n                         'Scuse me a second. Take a look at \n                         thirty-one across.\n\n               Jim slides the newspaper in front of Kenny.\n\n                                     KENNY\n                         Shit, Jim. I don't do crossword \n                         puzzles.\n\n                                     MR. MEHLOR\n                         I'll take a look, Jim.\n\n                                     JIM\n                         Kenny can read.\n                              (to Kenny)\n                         Just look at it. You know when you \n                         write down a word and suddenly it \n                         looks all wrong? Maybe it's right, \n                         but it doesn't look right?\n\n               Jim points at the newspaper.\n\n                                     JIM\n                         Thirty-one across.\n\n               Kenny shrugs and looks down at the newspaper.\n\n                                     KENNY\n                              (mumbles as he reads)\n                         Mention money again and...\n\n               His eyes go wide.\n\n               ECU CROSSWORD PUZZLE\n\n               In an uncompleted part of the puzzle, Jim has written a \n               message in the boxes. It reads: MENTION MONEY AND I'LL KILL \n               YOU.\n\n               JIM AND KENNY\n\n               Kenny looks up at Jim. Jim glances over at the bartender \n               then back at Kenny. Understand?\n\n                                     JIM\n                         Did I get it right?\n\n                                     KENNY\n                         Yeah, Jim. You got it right.\n\n               INT. ARMORED TRUCK - DUSK\n\n               Charlie and Tom continue to drive in silence. They both sneak \n               looks at each other. Their eyes meet for a second, then they \n               look away. A moment's pause then...\n\n                                     TOM\n                         Jerk.\n\n                                     CHARLIE\n                         Jack-ass.\n\n               A hint of a smile on both of them. Tom reaches for Charlie.\n\n                                     TOM\n                         Give us a kiss. Come on.\n\n               Charlie goes red in the face, pushes Tom away.\n\n                                     CHARLIE\n                         Get out of here.\n\n                                     TOM\n                              (laughs, beat)\n                         You really are a cranky old fart, \n                         you know that?\n\n                                     CHARLIE\n                         I'm sorry.\n\n                                     TOM\n                         What was that about? I mean, I'm \n                         just sitting here and all of a sudden \n                         you go postal on me.\n\n                                     CHARLIE\n                         I don't know, I... It's just this \n                         weather. I... I want to get back.\n\n                                     TOM\n                         You know, I really do appreciate \n                         what you've done for me. This is a \n                         good job.\n\n                                     CHARLIE\n                         No, it's not. It stinks. It's putting \n                         your life on the line for someone \n                         else's money.\n\n               EXT. ROAD OUT OF TOWN - DUSK\n\n               Looking away from town, the HIGH SCHOOL is on the left. On \n               the right is the CEMETERY. Farther on, on the left, is a CAR \n               AND BOAT DEALERSHIP. The road is covered in water.\n\n               THE ARMORED TRUCK\n\n               Goes by the entrance to the high school, water shooting up \n               from the wheels, pushing out in a wide wake.\n\n               INT. TRUCK\n\n               Tom glances ahead and sees that the road is covered in water.\n\n                                     TOM\n                         Jesus. Where's the road?\n\n               THEIR POV\n\n               Stretching out ahead of them are reflector bars on the \n               telephone poles, a few feet above the rippling surface of \n               the floodwater.\n\n                                     CHARLIE\n                         It's there.\n                              (beat)\n                         Somewhere. I hope.\n                              (beat)\n                         Look, Tom, I don't care what it is \n                         you end up doing.\n\n                                     TOM\n                         Oh, God, here we go again.\n\n                                     CHARLIE\n                         This is the last time, I swear.\n\n               Tom sees something ahead. He doesn't understand at first.\n\n               HIS POV\n\n               The reflector bar on the pole two poles ahead is lower than \n               the others. No reflector bars for a hundred yards, then they \n               resume.\n\n                                     CHARLIE\n                              (looks at Tom)\n                         I just think, whatever it is you do, \n                         it's time you did some heavy lifting.\n\n               Tom figures out what's going on with the reflector bars.\n\n                                     TOM\n                         Stop!\n\n                                     CHARLIE\n                         No, you gotta hear this. You're better \n                         than --\n\n                                     TOM\n                         Stop the truck! We're going down!\n\n               OUTSIDE THE TRUCK\n\n               The water rises fast up the grille as the truck angles down.\n\n               INSIDE THE TRUCK\n\n                                     CHARLIE\n                         Jesus!\n\n               Charlie stands on the brakes.\n\n               THEIR POV\n\n               A wave of water rushes forward from the truck, then comes \n               back and washes over the hood, splashing up on the windshield.\n\n                                     TOM\n                         Back up!\n\n               Charlie throws the truck into reverse but gives it too much \n               power. They hear the rear wheels spinning underwater. Charlie \n               eases off, the tires start to catch, they start moving \n               backwards.\n\n               Charlie and Tom exchange a quick look of relief... and then \n               the engine dies. Charlie tries to restart it, but there's \n               nothing.\n\n               OUTSIDE THE TRUCK\n\n               It's stopped on a downgrade -- it's a dip in the road.\n\n               The water is up to the top of the front tires: up to the \n               hubcaps on the rear wheels. The headlights are underwater, \n               spots of yellow glowing. They've stopped next to a lighted \n               sign.\n\n               CLOSE ON SIGN\n\n                                 WELCOME TO HUNTINGBURG.\n\n                        HOME OF THE 1987 STATE CHAMPION WARRIORS.\n\n               IN THE TRUCK\n\n                                     CHARLIE\n                         Goddammit!\n\n                                     TOM\n                         It's a little dip in the road or \n                         something. You can see the reflectors \n                         come up the other side.\n\n                                     CHARLIE\n                              (curses to himself)\n                         I knew this would happen.\n                              (grabs radio mike)\n\n                                     TOM\n                         I'll see if there's anyone coming. \n                         Maybe we can get pulled out.\n\n               Tom opens the door. Charlie adjusts the radio frequency \n               selection button; clicks on.\n\n                                     CHARLIE\n                         Dispatch, this is 31. 31 calling \n                         dispatch.\n\n                                     DISPATCHER (V.O.)\n                              (over radio)\n                         31, this is dispatch.\n\n                                     CHARLIE\n                              (into radio)\n                         Dispatch, we're stuck outside of \n                         Huntingburg. Truck's dead.\n\n                                     DISPATCHER (V.O.)\n                         Where are you?\n\n                                     CHARLIE\n                         We're on 231, headed for the \n                         Interstate. Right by a sign saying \n                         \"Welcome to Huntingburg.\"\n\n               Tom climbs out and up on top of the truck.\n\n               OUTSIDE THE TRUCK\n\n               Tom stands on top of the truck. In one direction, nothing \n               but blackness. The other way he can see the lights of the \n               town. But there are no cars coming.\n\n               IN THE TRUCK\n\n               Charlie looks over as Tom appears, upside-down, in the \n               doorway.\n\n                                     TOM\n                         The town's been evacuated. We won't \n                         get any help from there.\n\n                                     CHARLIE\n                         Dispatch can't get anyone out.\n\n                                     TOM\n                         They are aware we're carrying a \n                         shitload of money...?\n\n                                     CHARLIE\n                         They called the National Guard. \n                         They're gonna be here in about ninety \n                         minutes.\n\n                                     TOM\n                         Ninety minutes? Jesus.\n\n                                     CHARLIE\n                              (nods; into radio)\n                         Dispatch, we're gonna need help a \n                         little sooner than --\n\n               There's a sudden sparking sound and the radio cuts out and \n               interior lights and the headlights go out.\n\n                                     TOM\n                         Oh, shit.\n\n               INT. HOUSE - DUSK POV THROUGH WINDOW\n\n               Looking out as the Sheriff's car rolls past on the water-\n               covered street. A HAND lets go of a curtain and it swings \n               across the window.\n\n               EXT. STREET - DUSK IN THE SHERIFF'S CAR\n\n               The Sheriff motions Wayne to stop the car, then he grabs the \n               radio mike and clicks it on as a megaphone.\n\n                                     SHERIFF\n                              (into mike)\n                         Henry, I saw you. Come on out.\n\n               No one comes out of the house.\n\n                                     SHERIFF\n                         Henry, I'm not leaving until you \n                         come out.\n\n               A few moments pass and then...\n\n               HENRY AND DOREEN SWERZKY\n\n               Late 70s, step out onto their porch.\n\n                                     DOREEN\n                         Jesus H. Christ, Henry, I told you \n                         to stay away from the damn window.\n\n               THE SHERIFF\n\n               Gets out of the car.\n\n                                     SHERIFF\n                         What are you still doing here?\n\n                                     HENRY\n                         We're just --\n\n                                     DOREEN\n                         We're setting traps.\n\n                                     SHERIFF\n                         That's illegal, Doreen.\n\n                                     DOREEN\n                         You gonna arrest us, Sheriff? Hell, \n                         are you even sheriff anymore, Sheriff? \n                         Didn't you lose an election? I sure \n                         as hell know I didn't vote for you, \n                         and neither did Henry.\n\n                                     HENRY\n                         Doreen...\n\n                                     SHERIFF\n                         You don't need to set traps.\n\n                                     DOREEN\n                         That's what they said in '73. When \n                         we got back, anything the bastards \n                         didn't steal they broke, just for \n                         the hell of it.\n\n                                     SHERIFF\n                         That's not happening this time.\n\n                                     DOREEN\n                         Damn right it's not.\n\n                                     SHERIFF\n                         You can't stay, you know that.\n\n                                     HENRY\n                         We're going to my sister's.\n\n                                     SHERIFF\n                         Good.\n\n                                     DOREEN\n                         Soon as we finish setting the traps.\n\n               The Sheriff wants to say something more, but he's not about \n               to argue with Doreen. He just nods and gets back into the \n               car.\n\n               IN THE CAR\n\n               The Sheriff climbs back in. He and Wayne watch Henry and \n               Doreen go back into the house, Doreen still nagging at Henry.\n\n                                     SHERIFF\n                         God'll understand if you have to \n                         drown her in the basement, Henry.\n\n               The Sheriff sighs, nods to Wayne. Wayne puts the car in gear.\n\n               EXT. ARMORED TRUCK - NIGHT\n\n               The water is creeping up the sloping hood of the truck.\n\n                                     CHARLIE\n                         We gotta get out of here.\n\n                                     TOM\n                         What about the money?\n\n                                     CHARLIE\n                         The money's safe; we're not. Water \n                         rose about a foot in the last twenty \n                         minutes. The National Guard isn't \n                         going to be here for another hour. \n                         You do the math.\n\n               Tom shrugs -- Charlie's right. They're about to get out when \n               light washes up on them. They look out to see...\n\n               THE HEADLIGHTS OF A GMC SUBURBAN\n\n               Approaching on the other side of the dip, a quarter-mile \n               away.\n\n               CHARLIE AND TOM\n\n               Look at each other then get out of the truck.\n\n               THE SUBURBAN\n\n               Stops on the far side of the dip -- a hundred yards away. \n               The headlights shine across the water. Doors open and MEN \n               get out.\n\n               TOM AND CHARLIE\n\n               Come around the front of the truck. They can't see through \n               the glare of the Suburban's bright headlights.\n\n                                     CHARLIE\n                         Hello!\n\n                                     MAN'S VOICE\n                         You okay? You stuck?\n\n                                     CHARLIE\n                         Yes!\n\n                                     MAN'S VOICE\n                         We'll see if we can get you out! \n                         We'll be right over!\n\n               Charlie looks at Tom, relieved.\n\n                                     CHARLIE\n                         Looks like we might just --\n\n               THE SUBURBAN\n\n               Headlights go on high beam.\n\n               CHARLIE AND TOM\n\n               Squint, blinded by the high beams.\n\n                                     TOM\n                         Why'd they do that?\n\n                                     CHARLIE\n                         Probably so they can see better.\n\n                                     TOM\n                         Or so we can't see at all.\n\n               Charlie looks at him -- what does he mean? Tom puts his hand \n               on his pistol.\n\n               IN THE WATER\n\n               Assembled by the Suburban are...\n\n               JIM AND HIS MEN\n\n               All holding guns. He speaks to them quietly.\n\n                                     JIM\n                         This is my retirement fund, boys, \n                         and if any one of you screws up, I \n                         swear to God I'll kill you. Let's \n                         go.\n\n               They start wading down into the dip in the road. Kenny carries \n               a rifle.\n\n               TOM AND CHARLIE\n\n               Tom squints through the bright light.\n\n                                     CHARLIE\n                         Company dispatch and the National \n                         Guard are the only ones who know \n                         we're here.\n\n                                     TOM\n                         Anyone with a scanner from Radio \n                         Shack could've intercepted your call, \n                         Charlie.\n\n                                     CHARLIE\n                              (realizes)\n                         Jesus.\n\n                                     TOM\n                              (to Jim and men)\n                         Could you turn down your lights?!\n\n                                     JIM\n                         We're bringing a rope!\n\n                                     TOM\n                         Turn down your lights!\n\n                                     JIM\n                         We'll be right there!\n\n               Tom starts to pull his gun.\n\n               KENNY\n\n               is fired up on adrenalin. He has his rifle up and is aiming \n               it.\n\n               HIS POV\n\n               Tom with his hand on his pistol, starting to pull it out.\n\n               TOM AND CHARLIE\n\n               Charlie sees Tom going for his gun. He moves close to Tom, \n               half in front of him, putting his hand on Tom's.\n\n                                     CHARLIE\n                         Take it easy, Tom.\n\n               KENNY\n\n               Stiffens.\n\n               KENNY'S FINGER\n\n               Squeezes the trigger of his rifle.\n\n               TOM\n\n               Jumps at the sound of the rifle crack.\n\n               CHARLIE\n\n               Is knocked back.\n\n               TOM\n\n               Yanks out his gun and starts shooting back.\n\n               JIM AND HIS MEN\n\n               Duck down in the water.\n\n               TOM\n\n               Shooting blindly, looks over and sees...\n\n               CHARLIE\n\n               A horrible look on his face, blood coming out of his neck. \n               He sinks into the water.\n\n               KENNY\n\n               Shoots off another few quick rounds.\n\n               TOM\n\n               Drops into the water, bullets plugging in around him. Just \n               his hand and pistol are visible, shooting blindly back toward \n               Jim and his men. THE SUBURBAN\n\n               Is hit by Tom's fire.\n\n               TOM\n\n               Runs out of bullets. A beat later we see Charlie start moving \n               through the water -- Tom is pulling him.\n\n                                     JIM\n                         STOP SHOOTING!\n\n               KENNY\n\n               Doesn't hear Jim and keeps firing.\n\n               JIM\n\n               Aims his pistol at Kenny's head.\n\n                                     JIM\n                         Stop.\n\n               Kenny stops.\n\n               BEHIND THE ARMORED TRUCK\n\n               Tom comes up in the water behind the truck, gasping, holding \n               Charlie. Tom rests his gun on the truck bumper.\n\n                                     CHARLIE\n                         I'm sorry, Tom.\n\n               Charlie's gone.\n\n               JIM AND HIS MEN\n\n               Jim glares at Kenny, his eyes on fire.\n\n                                     KENNY\n                         He was going for his gun!\n\n                                     JIM\n                         He wasn't gonna shoot, Kenny. \n                         Goddamnit!\n                              (shakes head, calls \n                              to Tom)\n                         We just want the money! Get away and \n                         we won't have to kill you!\n\n               TOM\n\n               Shuts his eyes, thinking, scared.\n\n                                     JIM (O.S.)\n                         Now!\n\n               Tom opens his eyes. He looks down at...\n\n               CHARLIE\n\n               Floating in the water.\n\n               TOM\n\n               What the hell is he going to do?\n\n               JIM AND HIS MEN\n\n               Jim's men look at him. Jim motions them to wait some more.\n\n                                     JIM\n                         You got thirty seconds to get the \n                         hell away!\n\n               Jim and the others wait, but there's no answer from Tom.\n\n                                     JIM\n                         The clock's running! Go!\n\n               Still no response from Tom.\n\n               THEIR POV\n\n               All they can see is the front of the truck, in the light of \n               the \"Welcome\" sign. They can't see the back.\n\n               JIM AND HIS MEN\n\n               Jim nods to his men. They head for the truck, down into the \n               deeper water at the bottom of the dip in the road. All have \n               guns up and ready.\n\n               Jim sends Mr. Mehlor and Ray out to circle around. They all \n               move quietly. The only sound is the rain.\n\n               JIM\n\n               Gets to the truck and moves along its side, Kenny right behind \n               him. Jim gets to the back of the truck, nods for Kenny to \n               cover him, then steps out behind the truck, gun up.\n\n               JIM'S POV\n\n               Tom is gone.\n\n               CHARLIE\n\n               Is floating in the water, eyes of glass.\n\n               KENNY, MR. MEHLOR AND RAY\n\n               Step into the circle of light thrown by the \"Welcome\" sign.\n\n                                     JIM\n                              (eyes Charlie)\n                         Ah, Jesus.\n                              (to Kenny)\n                         Your dad'd be real proud of you, \n                         Kenny.\n\n                                     KENNY\n                         He was going for his gun!\n\n                                     JIM\n                         Mr. Mehlor, I believe we're gonna \n                         need your science project.\n\n               Mr. Mehlor nods and digs into his pack. Ray looks down at \n               Charlie in the water.\n\n                                     RAY\n                         \"I shall bring floodwaters upon the \n                         earth to destroy all that lives under \n                         the heavens and every creature that \n                         has the breath of life in it shall \n                         perish.\" Genesis 6:17.\n\n                                     KENNY\n                         Were you a preacher or something?\n\n               Ray laughs.\n\n                                     MR. MEHLOR\n                         Ray did five years in the hole at \n                         Joliet. The only thing you get to \n                         read in the hole is the Bible.\n\n                                     KENNY\n                              (to Ray)\n                         You got religion?\n\n                                     RAY\n                         Obviously.\n\n               Mr. Mehlor laughs as he pulls something out of his pack. \n               It's...\n\n               SMALL EXPLOSIVE DEVICE\n\n               A half-stick of dynamite with a timer, mounted on a magnet.\n\n                                     MR. MEHLOR\n                         When you hit the switch you've got \n                         thirty seconds.\n\n                                     RAY\n                         You teach your students how to make \n                         things like that?\n\n               Mr. Mehlor puts the device on the back door.\n\n                                     MR. MEHLOR\n                         You been to a high school recently, \n                         Ray? My students taught me how to \n                         make things like that. Ready?\n\n                                     JIM\n                         Hold on.\n\n               Something's wrong. Jim touches the handle on the door. It \n               moves. Uh-oh. He raises his pistol, grabs the door handle \n               and pulls. The door swings open. We don't need to see what \n               he sees -- we can tell from the expression on his face.\n\n               EXT. ON THE ROAD\n\n               Tom is running hard through the knee-deep water, pulling a \n               string of canvas money bags buckled together. The truck and \n               \"Welcome\" sign are two hundred yards behind him. Tom hears \n               an angry yell.\n\n               EXT. BY THE ARMORED TRUCK\n\n               Kenny is the one yelling.\n\n                                     JIM\n                         Shut up. Everyone.\n\n               They quiet. The patter of the rain is too loud -- they can't \n               hear anything. Jim scans the horizon, but sees nothing.\n\n                                     RAY\n                         Now why'd he have to go and do a \n                         thing like that?\n\n                                     JIM\n                         To stay alive.\n                              (off their looks)\n                         He thinks we'll kill him -- unless \n                         he knows where the money is and we \n                         don't.\n\n                                     MR. MEHLOR\n                         There is another possibility.\n                              (off their looks)\n                         He's thinking of keeping it for \n                         himself.\n\n                                     JIM\n                         There's always that. Either way, we \n                         got ourselves a sharp one.\n\n                                     KENNY\n                         What do we do?\n\n               Jim is looking at something in the distance.\n\n                                     JIM\n                         Pretty soon the water'll be too deep \n                         for him to run. But for us it'll be \n                         just deep enough.\n\n                                     KENNY\n                              (unclear)\n                         Deep enough for what?\n\n               INT. CAR AND BOAT DEALERSHIP - SHOWROOM\n\n               A glass window is smashed and water floods into the boat \n               showroom. Jim and his men stride in. Kenny ogles a \n               particularly nice cruiser. Jim stops at a smallish ski-boat.\n\n                                     JIM\n                         Here we go.\n\n                                     KENNY\n                              (re: cruiser)\n                         What about this monster?\n\n                                     JIM\n                              (re: ski-boat)\n                         This is all we need.\n\n                                     RAY\n                         Shit, Jim, we're stealing. Can't we \n                         take anything we want?\n\n                                     JIM\n                         The water isn't very deep yet. We \n                         need something with a low draft. Mr. \n                         Mehlor -- find us some gasoline.\n\n               Mr. Mehlor heads off.\n\n               KENNY\n\n               Sees something else he likes. We don't see what it is.\n\n                                     KENNY\n                         Oh, Jim...?\n\n               EXT. CEMETERY\n\n               The name WILLIAM PORTMAN is chiseled into a crypt. Tom appears \n               from underwater, gasping for breath. He gets to his feet and \n               trudges off through the water.\n\n               EXT. ROAD OUTSIDE CEMETERY\n\n               Tom comes out through the gates of the cemetery, splashing \n               through the knee-deep water. He's running when he hears, \n               from behind him, boat engines firing up. He turns to see...\n\n               LIGHTS\n\n               Racing toward him over the water, a hundred and fifty yards \n               back.\n\n               TOM\n\n               Sprints off.\n\n               THE SKI-BOAT\n\n               Jim is steering the ski-boat. Mr. Mellor hunkers down beside \n               him. We PULL BACK to see...\n\n               TWO JET-SKIS\n\n               Flanking the ski-boat, piloted by Kenny and Ray.\n\n               ON THE ROAD\n\n               Tom is running as fast as he can. He looks back, sees the \n               ski-boat and jet-skis closing. They'll get him before he \n               gets to town. He suddenly veers off the road toward...\n\n               THE HIGH SCHOOL\n\n               The sign out front reads: GO WARRIORS!\n\n               EXT. HIGH SCHOOL\n\n               Tom runs around the side of the high school.\n\n               JIM AND HIS MEN\n\n               Ride up on the ski-boat and jet-skis and round the corner.\n\n               THEIR POV\n\n               No sign of Tom.\n\n                                     JIM\n                         Cut your engines!\n\n               The engines are shut down. They all drift. Jim shines a \n               flashlight over onto...\n\n               WINDOWS\n\n               There's a hole in a window large enough to climb through.\n\n               INT. HIGH SCHOOL - CLASSROOM\n\n               Tom wades through the classroom, pushing floating desks aside. \n               Flashlight beams stab into the room. Tom hurries to the hall.\n\n               EXT. HIGH SCHOOL\n\n               Jim turns to his men.\n\n                                     JIM\n                         Let's get him out. But for Godsake, \n                         whatever you do...\n                              (with a hard look at \n                              Kenny)\n                         ...don't kill him. Not until we find \n                         out where he hid that money.\n\n               INT. HIGH SCHOOL - HALLWAY\n\n               Tom makes his way past banks of lockers, trying to get as \n               far as he can from the probing flashlight beams.\n\n               EXT. HIGH SCHOOL - FRONT DOORS\n\n               Kenny drifts up to the front doors. He pulls on them. Locked.\n\n                                     JIM\n                         Mr. Mehlor?\n\n               MR. MEHLOR\n\n               Reaches into his pack.\n\n               INT. SCHOOL HALLWAY\n\n               Tom tries lockers, looking for a place to hide.\n\n               EXT. FRONT DOORS\n\n               Kenny rides his jet-ski fast away from the front doors and \n               the doors explode.\n\n               INT. SCHOOL FRONT LOBBY\n\n               Tom ducks down as...\n\n               A FIREBALL\n\n               Shoots over him.\n\n               KENNY AND RAY\n\n               Ride the jet-skis into the flooded school.\n\n               UNDERWATER\n\n               Tom is swimming as hard as he can, out of breath. KENNY AND \n               RAY\n\n               Ray goes off down a hall while Kenny idles in the lobby.\n\n               TOM\n\n               Surfaces, gasping.\n\n               KENNY\n\n               Hears the gasp, turns, grinning.\n\n                                     KENNY\n                         Enemy sub off the port bow!\n\n               TOM\n\n               Gets to his feet runs as fast as he can down the hall. He \n               rounds a corner and keeps going.\n\n               KENNY\n\n               Guns his engine and takes off after Tom.\n\n               TOM\n\n               Runs another thirty feet, then trips on something and goes \n               down.\n\n               KENNY\n\n               Comes around the corner, grinning when he sees...\n\n               TOM\n\n               Halfway down the hall, standing frozen, caught in Kenny's \n               light.\n\n               KENNY\n\n               Guns it, racing forward down the hall toward Tom.\n\n                                     KENNY\n                         Full steam ahead!\n\n               THE JET-SKI\n\n               Hits something underwater and stops.\n\n               KENNY\n\n               Keeps going. He flies through the air, slams headfirst into \n               a trophy case and drops into the water.\n\n               TOM\n\n               Stands up -- he was kneeling.\n\n                                     TOM\n                         Low tide, sailor.\n\n               A HANDRAIL\n\n               On the wall, angles down into the water. Underwater there \n               are a couple of steps leading up to a change in level in the \n               hall -- that's what the jet-ski grounded on.\n\n               HALLWAY\n\n               Ray motors down the hallway toward the corner.\n\n                                     RAY\n                         Kenny?\n\n               HIS POV\n\n               Around the corner comes a jet-ski. Ray assumes it's Kenny.\n\n                                     RAY\n                         See him?\n\n               Then the jet-ski speeds up and shoots by him. Ray sees it's...\n\n               TOM\n\n               Wearing Kenny's hat and jacket.\n\n               RAY\n\n               Gives chase.\n\n               SCHOOL HALLWAYS\n\n               Ray races after Tom along the flooded hallways, taking the \n               turns fast. Ray pulls a gun, starts shooting.\n\n               TOM'S POV\n\n               Tearing through the halls, flashlight lighting the way. \n               Bullets hit the walls, ceiling, water around him.\n\n               TOM\n\n               Comes around a corner, sees the open front doors ahead of \n               him.\n\n               JIM AND MR. MEHLOR\n\n               Come into view in the ski-boat, blocking the exit.\n\n               TOM\n\n               Turns hard and speeds down a side hall.\n\n               TOM'S POV\n\n               A wall of windows at the end. No way out. Trapped. Then...\n\n               KENNY\n\n               Rises out of the water, blood running down his face, pistol \n               up.\n\n               TOM\n\n               Looks back.\n\n               RAY\n\n               Is on his tail.\n\n               TOM\n\n               Makes his choice and guns the jet-ski straight at Kenny.\n\n                                     TOM\n                         Yee-hah!\n\n               KENNY\n\n               Fires, misses and is knocked to the side as...\n\n               TOM\n\n               Hunches down on the jet-ski and crashes through the windows.\n\n               EXT. HIGH SCHOOL\n\n               Jim and Mr. Mehlor are moving right outside the windows just \n               as Tom blasts out of the school and races off into the dark.\n\n               EXT. OPEN WATER\n\n               Tom moves fast over the water. He yanks off his clip-on tie.\n\n               JIM AND THE OTHERS\n\n               Chase Tom's light, behind by fifty yards, heading out into \n               farm fields. They get closer and closer and then watch as...\n\n               TOM'S JET-SKI\n\n               Runs straight into a tree and explodes.\n\n               JIM AND THE OTHERS\n\n               Race up to find the burning, flaming wreckage of the jet-\n               ski. Ray circles on the other jet-ski. Kenny, still bleeding \n               from the head, is in the boat with Jim and Mr. Mehlor.\n\n                                     KENNY\n                              (laughing)\n                         Nice driving, buttwipe!\n\n                                     RAY\n                         I'm glad you're enjoying this, Kenny, \n                         but if he's dead, how do we find the \n                         money?\n\n               Kenny reacts -- oh, right.\n\n                                     JIM\n                         Oh, he's still alive.\n\n               We see what Jim sees.\n\n               ECU THROTTLE OF JET-SKI\n\n               Tom used his tie to wrap the throttle open.\n\n               HUNDRED YARDS AWAY\n\n               Tom is hiding in the branches of a floating tree, watching \n               the distant lights of Jim and his men. The current carries \n               Tom away.\n\n               WITH JIM AND HIS MEN\n\n               Jim scans the horizon; sees nothing.\n\n                                     JIM\n                         Ray, I'm in need of a little \n                         inspiration.\n\n                                     RAY\n                         \"With a raging flood he makes an end \n                         of those who oppose him, and pursues \n                         his enemies into darkness.\" From one \n                         of the more obscure --\n\n                                     KENNY\n                         Sorry to interrupt Bible study and \n                         all, but has no one but me noticed \n                         how completely screwed we are? We \n                         should be back in the motel room, \n                         counting out the money. Instead --\n\n               Jim lashes out with a fist, hard and fast, hitting Kenny in \n               the chest, knocking him out of the ski-boat, into the water. \n               Kenny comes up in the thigh-deep water, sputtering.\n\n                                     JIM\n                         No one likes this particular turn of \n                         events, Kenny, but we have a choice -- \n                         we can can either deal with it or we \n                         can walk away. There's a lot of money \n                         out there, so I choose to deal with \n                         it. If you want to go, that's fine -- \n                         start swimming. You want to stay, \n                         that's fine, too -- just stop your \n                         damn whining.\n\n               Jim pushes the throttle forward and the ski-boat takes off, \n               leaving Ray on the jet-ski, with Kenny in the water.\n\n                                     KENNY\n                         What the hell's his problem? All the \n                         money in the world ain't worth a \n                         goddamn nickel if you get caught. \n                         It's not like there won't be other \n                         jobs.\n\n                                     RAY\n                         You may have more of these in you, \n                         Kenny, but Jim doesn't.\n\n               Ray pulls Kenny up onto the jet-ski and takes off after Jim.\n\n               EXT. BACK OF CHURCH - SANDBAG WALL\n\n               The water level is creeping up a five-foot-high wall of \n               sandbags.\n\n               REVERSE ANGLE\n\n               Looking out over the top of the sandbag wall. A tree floats \n               by on the water.\n\n               HANDS\n\n               Suddenly appear on the top of the wall and...\n\n               TOM\n\n               Pulls himself into view. He climbs over the wall, exhausted.\n\n               BEHIND THE SANDBAG WALL\n\n               Gasoline-powered pumps are sucking up any rainwater. The \n               sandbags have kept the floodwater at bay.\n\n               TOM\n\n               He hurries up the back steps and goes into the church.\n\n               INT. CHURCH - BACK ROOM\n\n               Tom walks through a small room lined with closed cupboards. \n               He goes through a door.\n\n               INT. CHURCH - MAIN HALL\n\n               Tom comes out into the altar. He looks around, impressed. \n               It's a beautiful church. Scaffolding goes up one wall -- the \n               church is being restored. Tom is startled by a sound from \n               above. He grabs a heavy silver candlestick as a weapon and \n               looks up to see...\n\n               BIRDS\n\n               Fluttering up in the rafters.\n\n               TOM\n\n               Takes a breath. Just as he relaxes, he hears a whooshing \n               sound from behind him and turns to see...\n\n               A LARGE CRUCIFIX\n\n               Being swung at his head. Thunk and...\n\n               THE SCREEN GOES BLACK\n\n               FADE IN:\n\n               INT. SHERIFF'S STATION\n\n               Tom slowly regains consciousness, blinking his eyes. He \n               hears...\n\n                                     SHERIFF (O.S.)\n                         What are you doing here?\n\n               But the Sheriff isn't asking Tom, he's asking...\n\n               KAREN\n\n               30, pretty, even in head-to-toe rain gear.\n\n                                     KAREN\n                         I was setting up pumps.\n\n                                     WAYNE\n                         I sure as hell don't get what you \n                         see in that church.\n\n                                     KAREN\n                         I wouldn't expect you to, Wayne.\n\n                                     WAYNE\n                         What's that supposed to mean?\n\n                                     SHERIFF\n                         Karen, did you think the order was \n                         for everyone but you to evacuate?\n\n                                     KAREN\n                         I was gonna go as soon as I filled \n                         the pumps, but the next thing I know, \n                         I've got a looter on my hands. Now, \n                         maybe I'm crazy, but I was expecting \n                         a little gratitude?\n\n                                     PHIL\n                         I think it's great what you did.\n\n                                     WAYNE\n                         That's it, Phil. That'll finally get \n                         you into her pants.\n\n                                     PHIL\n                         Shut up.\n\n                                     SHERIFF\n                         What if he'd had a gun, Karen? A lot \n                         of these looters carry guns.\n\n                                     TOM (O.S.)\n                         I'm not a looter.\n\n               TOM\n\n               Sits up on a cot, behind bars in the holding cell, woozy.\n\n               INT. HIGH SCHOOL\n\n               Jim and his men are searching the school for the money.\n\n                                     RAY\n                         Jim, it could be anywhere. It might \n                         not even be in the school.\n\n                                     JIM\n                         Keep looking.\n\n               EXT. MAIN STREET\n\n               The rain sheets down hard. A lightning flash reveals...\n\n               THE STATUE\n\n               The water is up to the horse's knees. The lightning passes \n               and a second later thunder rolls.\n\n               INT. SHERIFF'S STATION\n\n               The Sheriff, Phil, Wayne and Karen stand outside the cell. \n               Tom is inside, on the cot. He touches the cut on his forehead.\n\n                                     WAYNE\n                         What were you doing at the church?\n\n                                     KAREN\n                         I told you -- he was looting it.\n\n                                     TOM\n                         I just said I'm not a looter!\n                              (to Karen)\n                         You're the one who nailed me?\n                              (Karen nods)\n                         You got a better arm than my ex-wife. \n                         What the hell did you hit me with -- \n                         a statue? I saw a flash of some guy \n                         coming at me.\n\n                                     KAREN\n                              (mumbles, embarrassed)\n                         It was a crucifix.\n                              (to others)\n                         It was the only thing there!\n\n                                     TOM\n                         Oh, great. Now I'm gonna have people \n                         coming from around the world to see \n                         the face of Jesus on my forehead.\n\n                                     SHERIFF\n                         Look, son, what were you doing in \n                         the church?\n\n                                     TOM\n                         Looking for a place to hide out.\n\n                                     WAYNE\n                         From who -- Swamp Thing?\n\n                                     TOM\n                         The bastards who killed my partner.\n\n               That stops the room.\n\n                                     TOM\n                         We were driving an armored truck. \n                         The truck got stuck out past the \n                         high school. They must've picked up \n                         our call to dispatch, 'cause they \n                         knew where we were. Charlie and I \n                         were just standing there and all \n                         hell broke loose.\n\n                                     SHERIFF\n                         How much money did you have?\n\n                                     TOM\n                         A little over three million.\n\n               They all exchange a look -- that's a lot of money.\n\n                                     TOM\n                         The bank was afraid of looters. They \n                         had us cleaning out their branches \n                         up and down the river.\n\n                                     WAYNE\n                         They stole three million dollars?\n\n                                     SHERIFF\n                         No, I don't think so.\n\n               They all look at the Sheriff. He looks at Tom.\n\n                                     SHERIFF\n                         You took the money, didn't you.\n\n                                     TOM\n                         I hid it in the cemetery. Tied it to \n                         a crypt for a guy named Portman.\n\n                                     WAYNE\n                         What the hell'd you do that for?\n\n                                     TOM\n                         I don't like to carry around that \n                         much cash.\n\n                                     SHERIFF\n                         Jesus, Wayne, use your head. If he \n                         hadn't hidden it, they woulda killed \n                         him, too.\n\n               The Sheriff looks at Tom -- is that it? Tom nods.\n\n                                     SHERIFF\n                         You got any ID?\n\n                                     TOM\n                         No, it was in my jacket and I --\n\n                                     WAYNE\n                         Color me surprised.\n\n               The Sheriff thinks for a beat, then tosses some keys to Phil.\n\n                                     SHERIFF\n                         Get out two rifles and a shotgun.\n\n               Phil nods and goes to it. The Sheriff opens a desk drawer, \n               pulls out an ankle holster.\n\n                                     WAYNE\n                         You believe him?\n\n                                     SHERIFF\n                         Well, yes, Wayne, I do. And even if \n                         I didn't, I'd say we sure as hell \n                         had an obligation to check it out, \n                         don't you think?\n\n               The Sheriff starts strapping on the ankle holster.\n\n                                     TOM\n                         I'll go with you. I can show you \n                         where --\n\n                                     SHERIFF\n                         No, I think you better stay put. But \n                         that was --\n\n                                     WAYNE\n                         Yeah, all we need is an armored car \n                         guy helping us out.\n\n               The Sheriff thwacks Wayne in the ear.\n\n                                     WAYNE\n                         Ow!\n\n                                     SHERIFF\n                         Wayne, what's the worst that's ever \n                         happened to you? When old Mrs. Dugan \n                         went after you with a knife? This \n                         guy just got shot at!\n                              (dismisses Wayne; to \n                              Tom)\n                         Smart move with the money.\n\n               Phil comes over with the guns.\n\n                                     SHERIFF\n                              (to Phil)\n                         Wayne and I'll check out the cemetery. \n                         You escort Slugger...\n                              (nods at Karen)\n                         ...out of town. Get her to some high \n                         ground, then come on back.\n\n               The Sheriff jams a small pistol into his ankle holster.\n\n                                     KAREN\n                         I have to fill the pumps --\n\n                                     SHERIFF\n                              (pulling her out)\n                         Not any more you don't.\n\n               The Sheriff straightens up, grabs a rifle from Phil and pulls \n               Karen to the door. Wayne goes to Tom's cell door and pulls \n               it shut with a click.\n\n                                     SHERIFF\n                         Wayne...\n\n                                     WAYNE\n                         He could still be lying!\n\n               The Sheriff rolls his eyes and gestures for Wayne to come \n               along. He opens the door for Karen, Wayne and Phil to go \n               through.\n\n                                     TOM\n                         Sheriff -- they killed my partner \n                         without any warning.\n\n                                     SHERIFF\n                         And they're gonna regret that, I \n                         guarantee you. They're gonna regret \n                         coming anywhere near this town \n                         tonight. And out he goes.\n\n               EXT. SHERIFF'S STATION\n\n               Water is halfway up the four-foot high wall of sandbags around \n               the station. There are three outboard motorboats moored to \n               the sandbags.\n\n                                     SHERIFF\n                         Phil, take Karen's boat.\n\n               The Sheriff and Wayne climb toward their boats.\n\n                                     WAYNE\n                         You can do it, Phil. The men of \n                         Huntingburg are counting on you.\n\n                                     PHIL\n                         Just bite me.\n\n               Wayne laughs as he and the Sheriff fire up their boat engines.\n\n               INT. SHERIFF'S STATION\n\n               Tom hears boat engines start up and move away. He lays back \n               down on the cot, listening to the rain.\n\n               INT. DAM CONTROL OFFICE\n\n               Empty. Light comes out from under the door to the bathroom.\n\n               INT. BATHROOM\n\n               Hank is on the can reading a copy of \"American Survivalist\" \n               magazine. An odd reaction comes over his face. He feels \n               something weird. He looks down.\n\n               ON THE FLOOR\n\n               Water is seeping in under the door.\n\n                                     HANK\n                         Holy shit!\n\n               INT. DAM CONTROL OFFICE\n\n               The bathroom door flies open and Hank waddles out, pants \n               around his feet. He shuffles fast to the control wheels and \n               starts spinning them.\n\n               EXT. RESERVOIR DAM\n\n               Two gates open fast, all the way, and water thunders out.\n\n               INT. DAM CONTROL OFFICE\n\n               Hank pulls up his pants as he gets on the radio.\n\n                                     HANK\n                         Sheriff! Sheriff!\n\n               EXT. PARK AREA\n\n               The Sheriff and Wayne are motoring in their boats, zooming \n               through the trees, engine noise obliterating anything coming \n               in over the radio.\n\n               INT. DAM CONTROL OFFICE\n\n                                     HANK\n                              (on the radio)\n                         Sheriff, come in!\n\n               EXT. MAIN STREET - MOVING BOAT\n\n               Phil steers Karen's small boat down Main Street, past the \n               statue. The water is up to the rider's stirrups.\n\n                                     KAREN\n                              (pleading)\n                         Did you see the stained glass windows, \n                         Phil? Did you see what a good job \n                         they did? I can't let anything happen \n                         to the church, not after all I've \n                         put into it.\n\n                                     PHIL\n                         Karen, you know I'd do anything for \n                         you, but the Sheriff told me to get \n                         you out of town. I'm sorry. It's for \n                         your own good.\n\n               Karen stands up.\n\n                                     PHIL\n                         What're you doing?\n\n                                     KAREN\n                         If you're not going to take me back \n                         to the church, then I'll swim.\n\n               Karen moves to get out of the boat.\n\n                                     PHIL\n                         No. Hey, hold on.\n\n               Phil lets go of the throttle and stands, moving toward Karen.\n\n                                     KAREN\n                         What am I saying?\n\n               Karen suddenly turns on Phil and pushes him out of the boat.\n\n                                     KAREN\n                         This is my boat. You swim.\n\n               Karen guns the engine and shoots off down a side street. \n               Phil stands in the waist-deep water and watches her go, \n               flabbergasted.\n\n               EXT. CHURCH\n\n               Karen comes around a corner and drives her boat up to the \n               church. The water is swirling quietly, still a good three \n               feet below the top of the wall.\n\n               EXT. ROAD OUT OF TOWN - WELCOME SIGN\n\n               Close on the lighted \"Welcome to Huntingburg\" sign. There's \n               a rushing sound and a two-foot-high wall of water hits the \n               sign. The lights explode in geysers of sparks and the water \n               rushes on.\n\n               EXT. PARK AREA\n\n               The Sheriff and Wayne are racing through a grove of half-\n               submerged trees. There's a rushing sound above the sound of \n               the engines. WHAM! and they're hit by the wall of water. \n               Wayne falls out of his boat and is lost in the swirling water.\n\n               EXT. ALLEYWAY\n\n               Jim and his men are motoring down an alleyway when...\n\n               THE WALL OF WATER\n\n               Rushes down the alley.\n\n               RAY\n\n               The water hits him hard, knocking him off the jet-ski. He's \n               swept away by the water.\n\n               CLOSE ON A FENCE LACED WITH CONCERTINA WIRE\n\n               The surge water shoots through it. And suddenly there's...\n\n               RAY\n\n               Slammed up against the fence, pinned to it, water rushing \n               over and around and by him. He yells as the wire cuts into \n               him.\n\n               EXT. CHURCH\n\n               Karen is pouring gasoline into the pumps.\n\n               She hears the rushing and looks up as the surge hits. Water \n               shoots over the top.\n\n               INT. SHERIFF'S STATION\n\n               Tom hears the sound and opens his eyes -- what the hell is \n               that?\n\n               EXT. SHERIFF'S STATION\n\n               The wall of water slams in hard, cascading over the sandbag \n               wall.\n\n               INT. SHERIFF'S STATION\n\n               TOM SITS UP, SWINGING HIS LEGS OVER THE SIDE OF THE COT. HE \n               REACTS, LOOKS DOWN. HIS POV\n\n               There's two feet of water in the station.\n\n               EXT. SHERIFF'S STATION\n\n               The building is like a rock in a stream, with the water \n               rushing up high against one wall, roiling and swirling around \n               the sides.\n\n               INT. SHERIFF'S STATION\n\n               Tom looks over, stunned, to see... THE DOOR\n\n               As a fine stream spits in through the keyhole.\n\n               THE WINDOWS\n\n               Are heaving as the water rises up against them.\n\n               TOM\n\n               Gets to his feet, woozy and goes to get out of the cell. He \n               remembers -- uh-oh: the cell door is locked.\n\n               EXT. ALLEYWAY\n\n               Jim pulls Ray, coughing, choking, bleeding, into the ski-\n               boat.\n\n               INT. SHERIFF'S STATION\n\n               The water level inside is rising fast. It hits the wall \n               sockets and there's a spit of sparks, then all the desk lamps \n               go dark. Light still comes from overhead fluorescent panels. \n               Tom sees...\n\n               TWO KEYS ON A KEY RING\n\n               Laying on the Sheriff's wooden desk. They're four feet away -- \n               too far to reach.\n\n               EXT. CHURCH\n\n               Karen suddenly has a horrible thought and stops. She shakes \n               it off -- doesn't want to think about it -- and mutters to \n               herself.\n\n                                     KAREN\n                         They'll get him out.\n\n               EXT. MAIN STREET\n\n               Phil is clinging to the statue as the water surges by below \n               him.\n\n               EXT. PARK AREA\n\n               Wayne gets back into his boat. The Sheriff realizes something.\n\n                                     SHERIFF\n                         Wayne... You locked him in.\n\n               INT. SHERIFF'S STATION\n\n               Tom looks through the cell bars at wooden chairs bobbing in \n               the water. The Sheriff's desk lifts up, starts floating. Tom \n               gets an idea. He takes his belt off.\n\n               EXT. NEAR SHERIFF'S STATION\n\n               A telephone pole is half-submerged, being pulled along fast \n               by the current.\n\n               INT. SHERIFF'S STATION\n\n               Tom holds one end of the belt and tosses the rest of it at...\n\n               THE DESK\n\n               Bobbing in the rising water. He misses the keys.\n\n               TOM AND THE DESK\n\n               Tom tries again. The belt lands on the desk top.\n\n               Tom very gently starts pulling. Too hard; the belt starts \n               slipping off the desk. He gets it just right and the desk \n               starts moving toward Tom. He reaches out with his hand, \n               stretching.\n\n               HIS FINGERS\n\n               Touch the top of the desk, start pulling it toward him, and \n               he just gets a firm grip on the desk when...\n\n               THE TELEPHONE POLE\n\n               Smashes into a window, bending in the bars on the window, \n               shattering the glass, letting a torrent of water into the \n               room.\n\n               THE DESK\n\n               Is moved by the rush of water, but not before Tom grabs...\n\n               THE KEYS\n\n               And grips them tight.\n\n               TOM\n\n               Tries the keys in the lock. They don't fit. He looks at them.\n\n               CU KEYS\n\n               The tag is emblazoned with the Ford logo.\n\n                                     TOM\n                         Great! I can drive out of here!\n\n               Tom tosses the keys into the water and looks around at...\n\n               THE WATER LEVEL\n\n               Rising very fast. A foot in ten seconds.\n\n               TOM\n\n               Climbs up the cell bars, the water rising with him. He's \n               running out of room between himself and the ceiling. Three \n               feet. Two feet. He's being pushed up by the water toward...\n\n               FLUORESCENT LIGHT FIXTURE\n\n               On the ceiling, caged in a wire cover.\n\n               TOM\n\n               Is terrified, about to die. The water rises up past his face.\n\n               TOM'S HANDS\n\n               Pull his Maglite flashlight from his belt. He takes off the \n               lens and the battery cap, then shakes the batteries out.\n\n               TOM\n\n               Sticks the flashlight tube up through the wire grate over \n               the light fixture.\n\n               He blows out the water -- like clearing a snorkel -- then \n               breathes. Reprieve for a few moments and then...\n\n               THE WATER\n\n               Reaches the top of the flashlight tube and starts to trickle \n               in when...\n\n               THE FLUORESCENT LIGHT FIXTURE\n\n               Goes dark. In the darkness, there's the sound of tubes \n               breaking and metal being wrenched.\n\n               TOM\n\n               Looks up, astonished, to see...\n\n               THE FLUORESCENT FIXTURE\n\n               Being lifted up and away from above. Streetlight comes in, \n               silhouetting...\n\n               A FIGURE\n\n               Standing on the roof. The figure leans down and starts tugging \n               at the wire cage over the inside of the fixture. In the light, \n               Tom sees that it's...\n\n               KAREN\n\n               And she's pulling as hard as she can, but the wire cage isn't \n               budging. She pulls out a Swiss Army knife, unfolds a small \n               knife and starts taking out the screws holding the cage in \n               place. She gets two screws out.\n\n               TOM\n\n               Pulls on the cage and it swings down. He climbs up it.\n\n               EXT. SHERIFF'S STATION ROOF\n\n               Tom surfaces in a hole in the roof. There's a vent duct laying \n               on the roof -- Karen must've kicked that over to get to the \n               light fixture. Karen helps Tom up. She sits and he lays down \n               on the roof, catching his breath.\n\n                                     TOM\n                         Thank you.\n\n                                     KAREN\n                         I owed you -- for hitting you and \n                         all. But we're even now, okay?\n\n                                     TOM\n                         Even.\n                              (beat, looks around)\n                         What happened?\n\n                                     KAREN\n                         I don't know.\n\n               They get up.\n\n                                     KAREN\n                         Maybe another levee broke upriver. \n                         They've been --\n\n               Just then...\n\n               A PROPANE TANK\n\n               Explodes. The fireball rips across the dark sky, illuminating \n               everything, showing...\n\n               JIM AND HIS MEN\n\n               Fifty feet away -- Jim, Mr. Mehlor and Ray in the ski-boat \n               and Kenny on the jet-ski -- guns aimed at Tom and Karen.\n\n                                     TOM\n                         Oh, God.\n\n               DARKNESS\n\n               As the lightning passes, and in the darkness, the thunder \n               rolls.\n\n               JIM AND HIS MEN\n\n               Switch on their lights and move forward. They pass...\n\n               CARS\n\n               Floating down the street with other debris. The cars have \n               been damaged by the flood -- one is missing a door.\n\n               JIM AND HIS MEN\n\n               When they get closer to the Sheriff's station, what they see -- \n               or don't see -- makes them stop.\n\n               THEIR POV\n\n               Tom and Karen have disappeared. Karen's boat is still moored \n               to the Sheriff's station roof, empty.\n\n                                     JIM\n                         They're in the water! Kenny, cut \n                         your engine!\n\n               Kenny shuts off the engine of the one remaining jet-ski. Jim \n               shuts down the boat engine. They float in silence, scanning \n               the water with their flashlights. There's no sign of Tom and \n               Karen.\n\n               UNDERWATER\n\n               Tom motions Karen to follow him. She's freaked and hesitates. \n               Tom grabs her hand and pulls her.\n\n               THEIR POV\n\n               The ski-boat and jet-ski are right above them, flashlights \n               playing over the water.\n\n               JIM AND HIS MEN\n\n               Reach the roof of the Sheriff's station. Jim looks around.\n\n                                     JIM\n                         Kenny, go that way. We'll go down \n                         here.\n\n               LONG SHOT POV THROUGH CAR WINDSHIELD\n\n               Of Kenny and Jim heading off in different directions.\n\n               TOM AND KAREN\n\n               Rise into view in a car. They gasp for air and keep low.\n\n                                     KAREN\n                         Tell them where the money is.\n\n                                     TOM\n                         I can't.\n\n                                     KAREN\n                         Well, I can.\n\n               She's about to call out. Tom grabs her hard.\n\n                                     TOM\n                         If they know where the money is, \n                         they will kill us.\n\n               Before Karen can say anything, a flashlight beam comes \n               swinging toward them and they have to duck underwater.\n\n               JIM\n\n               Watches as his flashlight beam washes over the car. Nothing \n               there. He guns his engine and heads off down the street.\n\n               THE CAR\n\n               Floats off around a corner.\n\n               IN THE CAR\n\n               Tom and Karen surface, catch their breath. Quiet for a few \n               moments as they both look around to see that Jim and his men \n               are gone.\n\n                                     KAREN\n                         So what do we do?\n\n                                     TOM\n                         I guess just drive around until we \n                         run out of gas.\n\n                                     KAREN\n                              (pissed)\n                         Look, I've spent the last eight months \n                         of my life restoring that church, \n                         and I just left it to come save your \n                         ass, so spare me, okay?\n\n                                     TOM\n                              (beat)\n                         When we get down here a little further \n                         we'll find a place for you to hide.\n                              (off her look)\n                         I'm gonna get back to the truck and \n                         wait for the National Guard.\n                              (checks watch)\n                         They should be there pretty soon.\n\n               Karen nods. Tom looks at her. She's shivering.\n\n                                     TOM\n                         Cold?\n\n                                     KAREN\n                         No, I'm fine. The heater just kicked \n                         in.\n\n               Tom looks at her, gives a little grin. Their eyes meet for a \n               second, then they look away.\n\n               EXT. SHERIFF'S STATION\n\n               Phil climbs up onto the roof, exhausted. He sees the hole in \n               the roof and goes to look at it. As he's looking down...\n\n                                     SHERIFF (O.S.)\n                         Is he dead?\n\n               Phil turns to see...\n\n               THE SHERIFF AND WAYNE\n\n               Coasting up in their boats.\n\n                                     PHIL\n                         No. Someone got him out.\n\n                                     SHERIFF\n                         Who?\n\n                                     PHIL\n                              (hesitates)\n                         Maybe Karen.\n\n                                     WAYNE\n                         Karen? How could she get him out? \n                         You took her out of town.\n\n                                     PHIL\n                         I -- It --\n\n                                     SHERIFF\n                         Let's hear it, Phil.\n\n                                     PHIL\n                         It happened real fast, okay?\n\n               EXT. ALLEYWAY\n\n               Tom and Karen float down the alley in the car.\n\n                                     KAREN\n                         You ever been robbed before?\n\n                                     TOM\n                         No. The scariest thing that ever \n                         happened before was Charlie running \n                         out of donuts.\n                              (off her look)\n                         I've only been doing this for a couple \n                         months.\n\n                                     KAREN\n                              (not what she wanted \n                              to hear)\n                         Oh.\n\n               Silence for a few moments.\n\n                                     KAREN\n                         What'd you do before this?\n\n                                     TOM\n                         I, uh... I sold construction \n                         machinery.\n                              (off her look)\n                         I was making good money, it just... \n                         I don't know. It just didn't seem \n                         right for me anymore.\n\n                                     KAREN\n                         How'd you end up in this?\n\n                                     TOM\n                         My uncle did me a favor; got me in.\n\n                                     KAREN\n                         Nice favor. How's he gonna feel after \n                         tonight?\n\n                                     TOM\n                         My uncle was Charlie -- my partner \n                         in the truck.\n\n                                     KAREN\n                         Oh, God. I'm sorry.\n\n               Tom nods -- so is he.\n\n               EXT. SHERIFF'S STATION\n\n               Phil climbs into the Sheriff's boat.\n\n                                     WAYNE\n                         She know karate or something, Phil? \n                         Maybe kung fu? I mean, I can't see \n                         how else she could overpower the \n                         likes of you.\n\n                                     PHIL\n                         Shut up, Wayne.\n\n                                     SHERIFF\n                         Shut up, both of you. Let's go find \n                         Karen; see if she's got him.\n\n               The Sheriff fires up his engine and heads off, Wayne \n               following.\n\n               EXT. ALLEYWAY\n\n               Karen and Tom are still in the car. They freeze at the sound \n               of engines in the distance. The sounds fade. Tom looks around.\n\n                                     TOM\n                         God, I wonder whose car this is.\n\n               Karen plucks some cassette tapes out of the water.\n\n                                     KAREN\n                         Well, whoever it is, he listens to \n                         Pat Benatar, Eddie Money and the \n                         soundtrack to \"Footloose.\"\n\n                                     TOM\n                         Really?\n                              (looks at tapes)\n                         Hold on...\n                              (looks around car)\n                         ...I think this is my car from high \n                         school.\n\n               Karen laughs. Just then...\n\n               THE CAR\n\n               Gets caught on something and stops.\n\n                                     TOM\n                         Looks like we get out here.\n                              (Karen hesitates)\n                         Come on -- I told your father I'd \n                         have you home by ten.\n\n               Karen grins. Just then...\n\n               A TRANSFORMER\n\n               down the street explodes.\n\n               TOM AND KAREN\n\n               Hear a sparking sound and look over to see...\n\n               A TRANSFORMER\n\n               On a telephone/power pole close to them. Rain hits it, causing \n               the sparking sound. The floodwater is inching up the pole \n               toward it.\n\n               The water will reach the transformer in a matter of seconds. \n               And while they're staring at that...\n\n               ANOTHER TRANSFORMER\n\n               At the end of the street explodes as water hits it.\n\n               TOM AND KAREN\n\n               Look around -- what to do? Tom points.\n\n                                     TOM\n                         There!\n\n               They climb out of the car and start swimming toward a house.\n\n               THE TRANSFORMER\n\n               Water is three inches from the transformer; two inches...\n\n               TOM AND KAREN\n\n               Swimming as hard as they can.\n\n               THE TRANSFORMER\n\n               One inch from the water...\n\n               TOM AND KAREN\n\n               Reach the house. They pull themselves up onto a television \n               antenna/ladder running up the side of the house. Karen's \n               feet are still in the water.\n\n                                     TOM\n                         Get your feet up!\n\n               THE TRANSFORMER\n\n               The water is about to touch. There's a sizzling sound.\n\n               TOM AND KAREN\n\n               They heave a huge sigh of relief -- but then Tom realizes...\n\n                                     TOM\n                         Oh, shit!\n\n                                     KAREN\n                         What?\n\n                                     TOM\n                              (re: antenna/ladder)\n                         It's metal!\n\n               Tom pushes Karen over onto a window ledge. Then, just as \n               Tom's about to step over...\n\n               KENNY\n\n               Comes screaming in on the jet-ski. He dives off the jetski, \n               gets a hold of Tom and pulls him under.\n\n               KENNY AND TOM\n\n               Surface. Kenny is stronger and he has Tom in a tight grip. \n               One problem -- Kenny doesn't know the danger they're in.\n\n                                     TOM\n                         We've gotta --!\n\n               Kenny shoves Tom underwater.\n\n                                     KENNY\n                         HEY! I GOT HIM!\n\n               Tom comes up, looks over at...\n\n               THE TRANSFORMER\n\n               The sizzling is getting louder.\n\n                                     TOM\n                         We have to --!\n\n               Kenny dunks Tom again.\n\n                                     KENNY\n                         I GOT HIM!\n\n               UNDERWATER\n\n               Tom grabs Kenny's arms and pulls himself up fast.\n\n               KENNY AND TOM\n\n               Tom's head comes out of the water and slams into Kenny's \n               chin. Kenny is stunned. Tom gets free of his grasp.\n\n                                     KAREN\n                         Hurry!\n\n               Tom does the backstroke, pulling hard toward Karen.\n\n               KENNY\n\n               Still stunned, finally hears the sizzling and looks over \n               at...\n\n               THE TRANSFORMER\n\n               The water touches the outer casing of the transformer.\n\n               KENNY\n\n               Starts swimming fast toward...\n\n               TOM AND KAREN\n\n               Karen grabs Tom's arm and Tom gets a hold of the windowsill \n               and pulls himself up.\n\n               KENNY\n\n               Grabs onto...\n\n               THE TV ANTENNA\n\n               And starts pulling himself out of the water.\n\n               THE TRANSFORMER\n\n               Explodes.\n\n               KENNY\n\n               Feels pretty pleased with himself until...\n\n               THE TV ANTENNA\n\n               Starts dancing with electricity and...\n\n               KENNY\n\n               Is hit by the voltage and his teeth clamp shut and his body \n               goes rigid and his clothes explode in flames.\n\n               TOM AND KAREN\n\n               Look away.\n\n               THE WATER\n\n               Dead fish start floating to the surface.\n\n               KENNY\n\n               Is fried, smoking. He falls off the TV antenna and hits the \n               water with a loud and ugly hiss. He floats away, his body \n               shaking spasmodically.\n\n               TOM AND KAREN\n\n               Tom hears an engine approaching. He looks around, then smashes \n               the window with his elbow.\n\n               INT. HOUSE\n\n               The window glass tumbles in. Tom reaches in, undoes the latch \n               and slides up the window. He climbs in, straddling the window \n               sill. The camera moves down Tom's leg to show...\n\n               A WOLF TRAP\n\n               Laying on the floor, just below the window.\n\n               TOM\n\n               Is oblivious. He starts to put his foot down into the trap. \n               Just then he knocks...\n\n               A POTTED CACTUS\n\n               Off the windowsill. It falls straight down into...\n\n               THE WOLF TRAP\n\n               Hitting the trigger. The jaws snap, obliterating the cactus.\n\n                                     TOM\n                         Jesus Christ!\n\n               A SHOTGUN BARREL\n\n               Snaps into view, pointing right at Tom's head.\n\n                                     WOMAN (O.S.)\n                         You so much as breathe funny and \n                         your head is going back out that \n                         window without you.\n\n               EXT. RESIDENTIAL STREET\n\n               Jim drives the boat down the street. Mr. Mehlor is scanning \n               the water with a flashlight.\n\n                                     MR. MEHLOR\n                         Jim! Over there!\n\n               Jim looks over to see...\n\n               THE JET-SKI\n\n               Floating in the water. And not far from it is...\n\n               KENNY\n\n               Still twitching.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               INT. HOUSE - BEDROOM\n\n               Doreen holds the shotgun on Tom and Karen as they move away \n               from the window, hands raised.\n\n                                     DOREEN\n                         Real slow now. Like you were in a \n                         big jar of molasses. That's it.\n\n               They hear footsteps coming down old wood stairs.\n\n                                     MAN (O.S.)\n                         Doreen? You haven't killed anybody, \n                         have you?\n\n                                     DOREEN\n                         I've got everything under control, \n                         Henry. You go back up.\n\n               Henry enters.\n\n                                     HENRY\n                         Jesus, Doreen, you caught a whole \n                         gang.\n\n               EXT. RESIDENTIAL STREET\n\n               Jim and Mr. Mehlor pull Kenny into the ski-boat. Kenny is \n               shivering. Part of his hair has been burned away.\n\n                                     KENNY\n                         Jesus, God, it hurts!\n\n                                     JIM\n                         You're gonna be okay, Ken. Mr. Mehlor \n                         knows these things and he thinks \n                         you're gonna be okay.\n\n               Mr. Mehlor looks at Jim. Mr. Mehlor knows these things and \n               he thinks Kenny is going to die.\n\n                                     KENNY\n                         It hurts!\n\n                                     JIM\n                         Don't you, Mr. Mehlor? Don't you \n                         think Kenny's gonna be okay?\n\n                                     MR. MEHLOR\n                         Yeah, Kenny. You're gonna be fine.\n\n                                     KENNY\n                         Jesus, I can't stop shivering.\n\n               Mr. Mehlor moves aside. Jim puts his arms around Kenny.\n\n                                     KENNY\n                         I know you didn't want me to come.\n\n                                     JIM\n                         You kidding? We couldn't've done \n                         anything without you.\n\n                                     KENNY\n                         My dad'd sure be pissed off, huh?\n\n                                     JIM\n                         Your dad'd just want you to lay still \n                         while we got you some help.\n\n                                     KENNY\n                         Hey -- hey the pain's goin'.\n                              (relief)\n                         Oh, man.\n\n               He looks up at Jim and grins.\n\n                                     KENNY\n                         When you said I was gonna be okay, I \n                         thought you were just shittin' me.\n\n                                     JIM\n                         See? You gotta trust me.\n\n               Kenny's shivering stops. It stops because he's dead. Jim \n               slowly lets go.\n\n               INT. HENRY AND DOREEN'S ATTIC\n\n               Henry and Doreen have brought everything into their attic -- \n               a TV, some silver and china, bowling trophies. A Coleman \n               lantern lights the room.\n\n                                     DOREEN\n                              (sarcastic)\n                         Well, isn't that just wonderful! Now \n                         these bastards are gonna want to \n                         kill us, too! Why the hell did you \n                         have to come to this house?\n\n                                     KAREN\n                         We thought it was empty.\n\n                                     DOREEN\n                         You know what? The house next door \n                         is empty. So whaddya say we go back \n                         downstairs and you two keep moving?\n\n                                     HENRY\n                         We are not going to send these people \n                         out to the wolves.\n\n                                     DOREEN\n                         Oh, we're not, are we? Then what's \n                         your plan, General Schwartzkopf?\n\n                                     HENRY\n                         I -- I just don't think --\n\n                                     TOM\n                         It's okay. I have to go anyway.\n\n               They look at him, surprised.\n\n                                     TOM\n                         The National Guard'll be at the truck \n                         in about fifteen minutes. I'm gonna \n                         go wait for them.\n\n                                     DOREEN\n                         You can't swim that far in fifteen \n                         minutes.\n\n                                     HENRY\n                         He could take our boat.\n\n                                     DOREEN\n                         Henry!\n\n                                     HENRY\n                              (to Tom)\n                         I'll go get it ready for you.\n\n                                     DOREEN\n                         Henry, he is not taking our boat.\n\n               Henry ignores Doreen. He pushes the attic stairs down, heads \n               down them.\n\n                                     DOREEN\n                              (grabs TV; to Tom)\n                         Here. You want a TV too? How about \n                         some china? Maybe our silver?\n                              (sets TV down)\n                         Henry! Henry, you leave the boat \n                         where it is!\n\n               Doreen heads off down the stairs. Tom starts down the stairs, \n               stops.\n\n                                     TOM\n                         Karen?\n                              (she looks at him)\n                         I'm Tom.\n\n               They shake hands.\n\n                                     KAREN\n                         Watch yourself, Tom. I really don't \n                         wanna have to save your life again.\n\n               Tom nods and goes down the stairs.\n\n               EXT. HENRY'S HOUSE\n\n               Henry stands on the roof of the back porch, steadying a small \n               rowboat as Tom gets in. Doreen nags from the window.\n\n                                     DOREEN\n                         You give away our only boat in the \n                         middle of a flood. You are a genius, \n                         Henry. A goddamn genius.\n\n                                     TOM\n                              (whispers to Henry, \n                              re: Doreen)\n                         You wanna come with me?\n\n               Henry looks at Tom, entertaining the notion...\n\n                                     DOREEN\n                         Jesus, Henry, what are you waiting \n                         for -- a kiss goodbye? Get back in \n                         here.\n\n               Henry sighs and lets go of the boat. Tom rows off.\n\n               LONG SHOT OF TOM\n\n               We see him in silhouette, crossing the gap between two houses.\n\n               JIM AND HIS MEN\n\n               Are watching, from the shadows on the dark side of the street.\n\n                                     RAY\n                         Why don't we just get him?\n\n                                     JIM\n                         If our resourceful young friend hears \n                         us coming, he'll electrocute us or \n                         sink us or one of you'll shoot him. \n                         Besides...\n                              (glances at watch)\n                         ...I know where he's going. What I'd \n                         like to know is where he came from.\n\n               EXT. CHURCH\n\n               The Sheriff sits in his boat, moored to the wall of sandbags \n               around the church. Wayne's boat is tied up next to it. The \n               floodwater is trickling over the top of the wall. The gas-\n               powered pumps inside the wall are keeping the waters at bay.\n\n               WAYNE AND PHIL\n\n               Come out of the front doors of the church.\n\n                                     WAYNE\n                         They're not here.\n\n               EXT. ROAD OUT OF TOWN - WELCOME SIGN\n\n               Tom rows up to the truck and \"Welcome\" sign. His flashlight \n               shows just the top of the truck and sign. Tom looks at his \n               watch, ties the rowboat to the sign, jumps into the water.\n\n               A few moments pass, then Tom surfaces, holding a shotgun. \n               Then he senses something behind him and turns to see...\n\n               A COW\n\n               Floating in the water, tongue out, eyes glassy.\n\n               TOM\n\n               Kicks away, horrified. And then he hears an engine. He looks.\n\n               TOM'S POV\n\n               Jim's ski-boat is coming over the water. The engine cuts out \n               and the ski-boat drifts, a hundred feet from Tom.\n\n                                     JIM\n                              (yelling)\n                         Son, before you go underwater and do \n                         something tricky, there's something \n                         I'd like you to see!\n\n               A flashlight comes on, the beam swivels, illuminating...\n\n               HENRY AND DOREEN\n\n               Standing in the ski-boat, blinking in the light.\n\n               TOM\n\n               Slumps.\n\n                                     JIM\n                         Now, I know it's your job to protect \n                         that money, and maybe you'd even be \n                         foolish enough to give your life for \n                         it. The question is, are you willing \n                         to give their lives for it?\n\n               Jim puts a pistol to Doreen's head.\n\n                                     JIM\n                         Drop the gun and get into the boat.\n\n               TOM\n\n               Thinks for a second, then throws the shotgun away and pulls \n               himself into the rowboat.\n\n                                     JIM\n                         Excellent choice.\n\n               TOM, JIM, HENRY AND DOREEN\n\n               As Tom and Jim call to each other across the water, Doreen \n               goes at Henry.\n\n                                     TOM\n                         I'll take you to the money, but you \n                         gotta let them go.\n\n                                     DOREEN\n                         I hope you're proud of yourself, \n                         Henry Sears.\n\n                                     HENRY\n                         Shh.\n\n                                     JIM\n                         I think it'd be best if --\n\n                                     DOREEN\n                         I told you not to give him the goddamn \n                         boat.\n\n                                     HENRY\n                         Doreen, please.\n\n                                     JIM\n                         I think it'd be best if we all stayed \n                         together.\n\n                                     TOM\n                         You say all you want is the money? \n                         Prove it. Let them go.\n\n                                     JIM\n                         I don't know if that's --\n\n                                     DOREEN\n                         We could be safe in our home instead \n                         of out here in a boat with these low-\n                         life scumbags!\n\n                                     JIM\n                              (after a look at \n                              Doreen, nods to Mr. \n                              Mehlor)\n                         Let 'em go.\n\n               EXT. MAIN STREET\n\n               The Sheriff, Wayne and Phil motor past the statue. Wayne is \n               driving his boat; Phil is with the Sheriff. The water is up \n               to the General's neck.\n\n               EXT. ROAD OUT OF TOWN\n\n               Tom helps Henry and Doreen over into the rowboat. As he does, \n               his face comes close to Henry's for a second.\n\n                                     TOM\n                              (whisper)\n                         Karen?\n\n                                     HENRY\n                              (shakes head, whispers)\n                         In the attic. They never saw her.\n\n               EXT. RESIDENTIAL STREET\n\n               Karen swims down the center of the street.\n\n               EXT. ROAD OUT OF TOWN\n\n               Tom is in the ski-boat with Jim. He looks out at...\n\n               HENRY AND DOREEN\n\n               As Henry rows them off into the darkness.\n\n                                     DOREEN\n                              (disappearing in dark)\n                         Faster, Henry! The bastards might \n                         change their minds! Stop lily- dipping \n                         and move it!\n\n               Henry starts to turn the boat around.\n\n                                     DOREEN\n                         What're you doing?\n\n                                     HENRY\n                         I'm gonna row back there and see if \n                         he'll shoot you. Or me. Fine either \n                         way.\n\n                                     DOREEN\n                         Henry...?\n\n                                     HENRY\n                         Do you want me to get us out of here?\n\n                                     DOREEN\n                         Yes, of course, I --\n\n                                     HENRY\n                         Then shut the fuck up.\n\n               Henry turns the boat around and rows off. Doreen is silent.\n\n               JIM'S SKI-BOAT\n\n               Jim shakes his head. Tom looks at Ray, coughing and at Kenny, \n               dead. Tom doesn't know what to say.\n\n                                     TOM\n                         I...\n\n                                     JIM\n                         The only thing I want to hear from \n                         you is where the money is.\n\n               EXT. STREET\n\n               The Sheriff and Wayne are motoring fast down a street, the \n               Sheriff leading. The Sheriff sees something in the water in \n               front of him. He curses and throttles down fast.\n\n               KAREN\n\n               Is in the water, exhausted and cold.\n\n               EXT. CEMETERY\n\n               Jim pilots the ski-boat into the cemetery. All are aghast.\n\n               A DOZEN CASKETS\n\n               Are floating in the water. Half of them have drifted up \n               against the fence; the others are headed that way.\n\n                                     JIM\n                         I wonder where they think they're \n                         going.\n\n                                     RAY\n                         What the hell's going on?\n\n                                     MR. MEHLOR\n                         This happened in a flood in Georgia. \n                         The ground gets soggy, and the caskets \n                         are air-tight -- anyone who hasn't \n                         been planted too long just pops up.\n\n                                     RAY\n                         You teach your students stuff like \n                         that? No wonder they kicked you out.\n\n                                     MR. MEHLOR\n                         I didn't teach my students anything \n                         at all.\n\n                                     JIM\n                              (to Tom)\n                         Where is it?\n\n                                     TOM\n                         It's hard to tell now with the water \n                         so deep.\n\n               Jim cocks the hammer on his pistol. Tom gets the hint.\n\n                                     TOM\n                         It's down there a little further.\n\n               Jim nods, gives the engine some juice and they move on.\n\n               TOM\n\n               Takes a quick look at his watch.\n\n               JIM\n\n               Sees Tom looking at his watch.\n\n               EXT. STREET\n\n               Karen is in the Sheriff's boat, wearing Phil's jacket, trying \n               to warm up.\n\n                                     KAREN\n                         Tom went off in their rowboat.\n\n                                     WAYNE\n                              (to Phil)\n                         It's Tom now. Looks like you lost \n                         out, pal.\n\n                                     SHERIFF\n                         Where was he going?\n\n                                     KAREN\n                         Back to the armored truck.\n\n               EXT. CEMETERY\n\n               Jim throttles down the ski-boat engine.\n\n                                     JIM\n                         Here?\n\n                                     TOM\n                         Uh... no. A little farther --\n\n                                     JIM\n                         They're not coming, son.\n\n               Tom looks over at Jim, pretending to be confused.\n\n                                     TOM\n                         What?\n\n                                     JIM\n                         The National Guard. They're not \n                         coming.\n\n                                     TOM\n                         I don't --\n\n                                     JIM\n                         I know you've been trying to stall \n                         until they show up, but they're not \n                         coming.\n\n                                     TOM\n                              (pause as he realizes)\n                         Oh, God. You intercepted Charlie's \n                         call, then you called them off.\n\n                                     JIM\n                         No, son, I didn't call them off. \n                         They never were coming. We didn't \n                         \"intercept\" Charlie's call. He called \n                         us direct.\n\n               And on Tom's look of disbelief...\n\n               INT. DAM CONTROL OFFICE\n\n               Hank is on the radio.\n\n                                     HANK\n                         I'd love to help you, Sheriff, but I \n                         can't leave! If the water goes over \n                         the top again it's bye-bye, dam! Bye-\n                         bye, town! In fact, I could use a \n                         little help up here myself.\n\n               EXT. PARK AREA\n\n               The Sheriff is in his boat; Wayne is back in his own. The \n               Sheriff is on the radio.\n\n                                     SHERIFF\n                         Hank, remember when Mike Crane holed \n                         up in Jack Finch's barn and said he \n                         was gonna burn it down?\n\n               CROSSCUT WITH HANK\n\n                                     HANK\n                         Hey, I was the one who got the dumb \n                         son-of-a-bitch to come out.\n\n                                     SHERIFF\n                         Right. And before you went in, I \n                         deputized you, you dumb son-of-a-\n                         bitch! So when I say get down here, \n                         it's not a request, it's an order. \n                         So get down here! Now! I won't need \n                         you for long. And bring your gun.\n\n               EXT. CEMETERY\n\n                                     JIM\n                         We were gonna hit you just before \n                         you got on the Interstate, but then \n                         you got stuck so we had to change \n                         our plans and take you --\n\n                                     TOM\n                         Bullshit. This is all bullshit.\n\n                                     JIM\n                         I knew Charlie when we were both \n                         working construction for the Johnstown \n                         company. His middle name was McCarthy \n                         because his parents loved Charlie \n                         McCarthy on the radio. His wife's \n                         name was Mary. She died of a heart-\n                         attack last year. He has a daughter \n                         and a son, both grown with children \n                         of their own. I'm afraid I don't \n                         know the names of the grandchildren.\n\n               Tom looks down, not wanting to believe.\n\n                                     JIM\n                         What else do I know...? Oh, yes. I \n                         know Uncle Charlie was trying to \n                         steer his favorite nephew away from \n                         a life of crime.\n\n               Tom suddenly lunges for Jim. Ray yanks Tom back.\n\n                                     TOM\n                         Why'd you shoot him? Kill Charlie \n                         and you get to keep another share?\n\n                                     JIM\n                         No, That was an accident. Ken shot \n                         him.\n                              (eyes Kenny sadly)\n                         I never told him Charlie was on my \n                         side. Ken liked to talk.\n                              (shakes head)\n                         He shouldn't've been here. But his \n                         dad asked me to watch over him. I \n                         guess I didn't do the best job.\n\n                                     RAY\n                         Excuse me, Jim. I hate to interrupt \n                         and all, but could we just get the \n                         money and get the hell out of here?\n\n                                     JIM\n                              (nods; to Tom)\n                         I'm gonna ask you one more time. And \n                         before you think of bullshitting me \n                         again, keep in mind I have had a \n                         very frustrating night. And while I \n                         know I'll never get the money if I \n                         kill you, it's getting to the point \n                         where I just don't care.\n\n               Jim casually aims his gun at Tom.\n\n                                     TOM\n                         I'll tell you where it is. But it's \n                         not going to do you any good.\n\n               Jim arches an eyebrow.\n\n                                     TOM\n                         The Guard may not be coming, but \n                         someone else sure as hell is.\n\n               EXT. OUTSKIRTS OF TOWN THE SHERIFF\n\n               At the controls of his boat, moving fast, sprayed by rain. \n               Karen and Phil are in the back of the boat. Wayne is close \n               behind in his boat.\n\n               EXT. CEMETERY\n\n                                     JIM\n                         I'll take my chances.\n\n               Tom pauses, looks over to...\n\n               THE CRYPT\n\n               Just the top of it is visible. Two more COFFINS float nearby.\n\n                                     TOM\n                         There.\n\n               Jim steers the ski-boat over, hands Tom a flashlight.\n\n                                     JIM\n                         Well, go get it.\n\n               Tom climbs over the edge of the ski-boat and into the water. \n               He turns on the flashlight and drops below the surface.\n\n                                     RAY\n                              (eyeing Tom in water)\n                         \"At night we'd go down to the river \n                         and into the river we'd dive.\"\n                              (off Jim and Mehlor's \n                              looks)\n                         Springsteen, \"The River.\" I'm all \n                         out of bible quotes.\n\n               UNDERWATER\n\n               Tom shines his light on...\n\n               THE CRYPT\n\n               One end of a rope is tied to the crypt. The other end, cut \n               and frayed, is suspended in the water, waving in the current.\n\n               ON THE WATER\n\n               Jim watches Tom's light rise. Tom comes up fast, takes a \n               breath.\n\n                                     TOM\n                         It's gone.\n\n                                     JIM\n                         What?\n\n                                     TOM\n                              (smug)\n                         Looks like somebody beat you to it.\n\n                                     RAY\n                         Oh for Christs -- I'm gonna shoot \n                         him, Jim.\n\n               Ray grabs pistol in his belt. Before he can pull it out, \n               holes puff out of his chest, followed by blood and then the \n               sound of the rifle-shots. Ray tumbles into the water. A half-\n               second later there's...\n\n               HAIL OF BULLETS\n\n               Ripping into the ski-boat, water, trees, crypt.\n\n               THE SHERIFF'S BOAT, WAYNE'S BOAT\n\n               Are outside the fence, a hundred feet from the crypt. PUSH \n               IN FAST on...\n\n               THE SHERIFF\n\n               To the rescue. He and Wayne and Phil fire their guns.\n\n               TOM\n\n               Ducks underwater.\n\n               JIM\n\n               Pulls his pistol, returns fire.\n\n               MR. MEHLOR\n\n               Opens fire with a shotgun, shooting wild, yelling. Then he's \n               hit and knocked out of the boat, dead.\n\n               IN THE SHERIFF'S BOAT\n\n                                     KAREN\n                         Stop! You'll hit Tom!\n\n               The Sheriff stops shooting, yells at the others.\n\n                                     SHERIFF\n                         Hold your fire!\n\n               Wayne and Phil stop shooting.\n\n               BY THE CRYPT\n\n               Tom is holding onto a coffin, out of view of the Sheriff. He \n               hears a rush of bubbles and turns as...\n\n               JIM\n\n               Comes to the surface, breathing deep.\n\n               JIM'S GUN\n\n               Comes out of the water fast and the barrel goes to Tom's \n               forehead.\n\n               THE SHERIFF'S BOAT\n\n               There's an adrenal fire in the Sheriff's eyes. He starts his \n               boat forward, Wayne following. Their lights find...\n\n               JIM'S BOAT\n\n               No sign of life. Then there's a sound and the lights sweep \n               over to find...\n\n               JIM AND TOM\n\n               Climbing up on top of the mostly-submerged crypt. Jim is \n               behind Tom with his gun to Tom's head.\n\n               THE SHERIFF\n\n               Stops his boat. Wayne stops, too. They are thirty yards from \n               Jim and Tom.\n\n               KAREN AND TOM\n\n               A look passes between them.\n\n                                     JIM\n                              (to Sheriff)\n                         Now, sir, I can imagine you'd love \n                         nothing more than to shoot me, but I \n                         caution you -- in order to do that, \n                         you're gonna have to shoot through \n                         young Tom here.\n\n               THE SHERIFF\n\n               Thinks for a second, then shrugs.\n\n                                     SHERIFF\n                         Okay.\n\n               He raises his rifle.\n\n               KAREN\n\n               Realizes what is about to happen.\n\n               TOM AND JIM\n\n               Also clue in, but before they can move...\n\n               THE SHERIFF\n\n               Squeezes the trigger as...\n\n               KAREN\n\n               Hits the gun with her arm.\n\n               THE RIFLE\n\n               Fires.\n\n               TOM\n\n               is grazed in the arm by the bullet.\n\n               THE SHERIFF\n\n               Smacks Karen hard with his rifle and she tumbles out of the \n               boat, unconscious.\n\n               TOM AND JIM\n\n               Throw themselves back off the crypt as...\n\n               THE SHERIFF AND WAYNE\n\n               Empty their guns in their direction.\n\n               JIM\n\n               Returns fire, shooting blindly over the top of the crypt.\n\n               PHIL\n\n               Reaches for Karen, floating limp in the water, but...\n\n               WAYNE\n\n               Is closer. He grabs Karen and pulls her into his boat, then \n               grins at Phil.\n\n               TOM AND JIM\n\n               Are behind the crypt. Tom holds his bleeding arm. Jim reloads.\n\n                                     TOM\n                         Well, that was unexpected.\n\n                                     JIM\n                         Is he the one you thought was coming \n                         to your rescue?\n\n               No answer from Tom, but the answer is clear.\n\n               WITH THE SHERIFF AND HIS MEN\n\n               The Sheriff and Wayne reload.\n\n                                     HANK (O.S.)\n                         Anyone mind telling me what the hell \n                         is going on?\n\n               The Sheriff, Wayne and Phil turn to see...\n\n               HANK\n\n               In his boat, right behind them, all dressed up in hunting \n               gear, rifle at the ready.\n\n                                     SHERIFF\n                         Hey, Hank. That money I told you \n                         about? From the armored car? We're \n                         gonna keep it. Three million dollars. \n                         Four ways.\n                              (shoots at crypt)\n                         Seven fifty apiece. You okay with \n                         that?\n\n               Hank is stunned. He doesn't answer.\n\n                                     SHERIFF\n                         Hank? You okay with that?\n\n                                     HANK\n                         Seven hundred and fifty thousand \n                         dollars?\n                              (beat, grins)\n                         Damn straight I'm okay with that.\n\n                                     WAYNE\n                              (grumbling, re: Hank)\n                         Don't see what we needed him for.\n\n                                     SHERIFF\n                         Then I guess you've never been hunting \n                         with Hank.\n                              (to Hank)\n                         We got two behind that crypt. Get \n                         'em.\n\n               Hank nods. He motions for Wayne to go one way; he'll go the \n               other. They start off. A blind shot comes from Jim behind \n               the crypt. The Sheriff shoots back. Phil finally musters up \n               the courage to say something.\n\n                                     PHIL\n                         Maybe I'm not okay with it.\n\n                                     SHERIFF\n                         Come on now, Phil.\n\n                                     PHIL\n                         You're gonna kill people?\n\n                                     SHERIFF\n                         They're looters, Phil! They come and \n                         steal from an armored truck in our \n                         town -- they're looters.\n                              (fires two shots)\n\n                                     PHIL\n                         What about Tom? What about Karen? \n                         They're not looters.\n\n                                     SHERIFF\n                         No, they're witnesses.\n\n               The Sheriff fires off a flurry of bullets.\n\n               TOM AND JIM\n\n               Behind the crypt, bullets winging by. Jim looks over, sees...\n\n               HANK\n\n               Motor into view.\n\n               JIM\n\n               Opens fire.\n\n               HANK\n\n               Shoots back.\n\n               TOM\n\n               Flattens against the crypt, then turns to see...\n\n               WAYNE\n\n               Coming into view on the other side.\n\n               TOM\n\n               Looks at Jim, sees he's occupied in the fight with Hank. \n               Then he sees...\n\n               RAY\n\n               Floating in the water, dead, pistol still jammed in his pants.\n\n               TOM\n\n               Thinks, decides, and reaches out for Ray.\n\n               CLOSE ON JIM\n\n               Shooting at Hank. He hears gunfire from Wayne and is about \n               to swivel to shoot in that direction when he hears a gun \n               firing from right next to him. He turns to see...\n\n               TOM\n\n               Shooting back at Wayne with Ray's gun.\n\n               WAYNE\n\n               Pulls back out of the line of fire.\n\n               HANK\n\n               Curses and pulls back, too.\n\n               TOM AND JIM\n\n               Exchange a look.\n\n               THE SHERIFF'S BOAT\n\n                                     PHIL\n                         How can you do this?\n\n                                     SHERIFF\n                         Jeez, Phil, I always thought Wayne \n                         was the stupid one. Read my lips.\n                              (slowly)\n                         Three million dollars. Look at it!\n\n               The Sheriff reaches down into a forward storage area of the \n               boat and pulls back a tarp revealing the bags of money.\n\n                                     SHERIFF\n                         A couple of those bags are gonna be \n                         yours, Phil.\n\n                                     PHIL\n                         But -- but -- you're the Sheriff!\n\n               The Sheriff rips his badge off and throws it away.\n\n                                     SHERIFF\n                         I'm the what?\n\n               TOM AND JIM\n\n               Jim looks at Tom, then hands Tom his pistol. Tom doesn't \n               know what Jim's doing. Jim slips beneath the water.\n\n               HANK\n\n               Whistles and gets Wayne's attention. He motions Wayne to try \n               it again.\n\n               THE SHERIFF'S BOAT\n\n                                     PHIL\n                         For twenty years you've been --\n\n                                     SHERIFF\n                         For twenty years I've been eating \n                         shit, breakfast, lunch and dinner. \n                         Well, tonight I'm changing the menu! \n                         From now on everything I eat is gonna \n                         be shit-free!\n\n               BEHIND THE CRYPT\n\n               Tom is looking for Jim, to see what he's doing. And then...\n\n               WAYNE AND HANK\n\n               Come around on both sides.\n\n               TOM\n\n               Starts shooting at them with the two pistols.\n\n               WAYNE AND HANK\n\n               Pull back. As they go...\n\n               TOM\n\n               Sees...\n\n               KAREN'S ARM\n\n               Draped over the side of Wayne's boat.\n\n               TOM\n\n               Takes another shot at Hank but stops firing at Wayne.\n\n               CLOSE ON JIM'S SKI-BOAT\n\n               Jim's hand appears over the gunwale. He reaches in and \n               grabs...\n\n               MR. MEHLOR'S PACK\n\n               And pulls it out of the boat.\n\n               THE SHERIFF'S BOAT\n\n                                     SHERIFF\n                         Can I make it any clearer, Phil? Do \n                         you want me to draw pictures?\n\n               Phil pulls out his revolver and points it at the Sheriff.\n\n                                     PHIL\n                         I can't let you do it.\n\n                                     SHERIFF\n                         Oh for --\n                              (beat)\n                         Okay, Phil. But here's how it's gonna \n                         go. I'm gonna hear one of two things \n                         out of you. Either I'm gonna hear \n                         you say you're in with us, or...\n                              (moves close to Phil's \n                              gun)\n                         ...I'm gonna hear a bullet come out \n                         of that gun and go into me.\n\n               Phil is incredulous. The Sheriff weighs his hands like scales.\n\n                                     SHERIFF\n                              (one hand)\n                         Seven hundred and fifty thousand \n                         dollars or...\n                              (other hand)\n                         ...you kill me. Your choice.\n\n               The Sheriff weighs the hands a couple more times. Phil slumps, \n               lowers the gun.\n\n                                     SHERIFF\n                         There we go.\n\n               SOMETHING\n\n               Flies through the air; lands in the water by the Sheriff. \n               It's...\n\n               MR. MEHLOR'S PACK\n\n               And it starts sinking in the water.\n\n               BEHIND THE CRYPT\n\n               Tom sees...\n\n               JIM\n\n               Haul himself into the ski-boat.\n\n                                     WAYNE (O.S.)\n                         In the boat!\n\n               THE SHERIFF, WAYNE AND HANK\n\n               Start shooting at Jim in the ski-boat.\n\n               JIM\n\n               Sticks the shotgun over the gunwale and returns fire.\n\n               TOM\n\n               Starts swimming for the boat.\n\n               THE SHERIFF, WAYNE AND HANK\n\n               See Tom and start shooting at both he and Jim when...\n\n               MR. MEHLOR'S PACK\n\n               Explodes and...\n\n               THE WATER\n\n               Erupts in a huge geyser.\n\n               THE SHERIFF, WAYNE, PHIL AND HANK\n\n               Are knocked off their feet. The Sheriff, Phil and Hank are \n               thrown into the water. Their boats are rocked up and back \n               and swamped with falling water.\n\n               JIM\n\n               Fires up his engine.\n\n               TOM\n\n               Is almost to the boat.\n\n               WAYNE\n\n               Gets to his knees in his boat and starts shooting.\n\n               TOM\n\n               Gets to Jim's boat and grabs onto it.\n\n               JIM\n\n               Cranks the throttle, and, dragging Tom, tears off under the \n               hail of Wayne's bullets.\n\n               TOM'S POV\n\n               As Jim races through the tombstones, barely missing \n               halfsubmerged stone crosses and crypt roofs.\n\n               TOM\n\n               Rams into one cross.\n\n               HIS HANDS\n\n               Start to slip from the boat.\n\n               JIM\n\n               Grabs Tom's hand and holds on as they shoot off across the \n               water.\n\n               THE SHERIFF, PHIL AND HANK\n\n               Get back in the boats.\n\n               EXT. ON THE WATER - MOVING\n\n               Jim hauls Tom into the boat. Tom lays on the bottom, catching \n               his breath. Blood is dripping down from his arm.\n\n                                     TOM\n                              (beat, looks up at \n                              Jim)\n                         You really want that money?\n\n               Jim gives Tom a look -- of course he wants that money.\n\n                                     TOM\n                         'Cause the only way you're ever gonna \n                         see it is if you help me get Karen.\n\n               Before Jim can answer, gunshots ring out behind them. They \n               look back to see...\n\n               THE SHERIFF AND HIS MEN\n\n               Coming after them in the three boats, shooting, closing.\n\n                                     TOM\n                         We're too slow.\n\n                                     JIM\n                              (thinks, then:)\n                         Here.\n\n               Jim moves away from the wheel, giving it to Tom. Tom gets up \n               and takes over. Jim bends and picks up...\n\n               KENNY\n\n               Lifeless and limp.\n\n               JIM\n\n               Looks at Kenny for a moment, then pushes his body overboard.\n\n               WITH THE SHERIFF AND HIS MEN\n\n               Flying over the water.\n\n               THEIR POV\n\n               They see a body tumble out of the ski-boat.\n\n               WITH JIM AND TOM\n\n               Jim looks back, following Kenny with his eyes.\n\n               EXT. MAIN STREET\n\n               Jim and Tom make the turn onto Main Street. They look back \n               as...\n\n               THE SHERIFF AND HIS MEN\n\n               Come around the corner, two hundred yards back.\n\n                                     TOM\n                         They're not going to catch us now.\n\n               LOW ANGLE\n\n               Of the ski-boat, racing toward camera. As it gets closer, \n               the camera BOOMS DOWN underwater to reveal...\n\n               THE STATUE\n\n               The sword tip just below the surface. THE SKI-BOAT\n\n               There's a jarring metal on metal clank as the sword tip slams \n               into the propeller.\n\n               JIM AND TOM\n\n               Are thrown forward.\n\n               JIM\n\n               Slams head-first into the dash.\n\n               UNDERWATER\n\n               The propeller has stopped.\n\n               TOM\n\n               Looks back to see that...\n\n               THE OUTBOARD MOTOR\n\n               Has almost been ripped from its moorings.\n\n                                     TOM\n                         Okay, so maybe they are gonna catch \n                         us now.\n\n               No answer from Jim. Tom looks down.\n\n               JIM\n\n               Is laying on the deck, unconscious. Just then... BAM! BAM! \n               BAM!\n\n               HANK\n\n               Has his rifle resting on his boat's windshield and is firing \n               off a clip on automatic as he, Wayne and the Sheriff close \n               in.\n\n               TOM\n\n               Ducks down and tries to start the engine. No go. Again. It \n               catches on the third try. Tom guns it and the boat tears \n               off.\n\n               THE OUTBOARD ENGINE\n\n               Is wobbling, vibrating.\n\n               HANK\n\n               Keeps up his stream of gunfire.\n\n               TOM\n\n               Stays down, driving blind, as the bullets fly in, blowing \n               holes in the windshield. He looks at Jim, at the engine and \n               curses. He steers the boat toward...\n\n               THE CHURCH\n\n               All lit-up, brilliant white in the darkness, a quarter-mile \n               away.\n\n               EXT. THE CHURCH\n\n               The water is now over the sandbag wall. The first several \n               feet of the church are flooded.\n\n               THE SKI-BOAT\n\n               Comes up fast. Tom grounds it on top of the sandbag wall. \n               Tom hesitates for a half second before grabbing Jim and \n               pushing him out of the boat and into the water.\n\n               JIM\n\n               Hits the cold water and comes to, sputtering.\n\n               TOM\n\n               Grabs guns and ammo and jumps out of the boat and into the \n               water. He lays a rifle on the top of the sandbag wall and \n               fires off a clip.\n\n               THE SHERIFF, HANK AND WAYNE\n\n               Jim's bullets plug into their boats. They circle back.\n\n               AT THE CHURCH\n\n               Tom pushes Jim, still groggy, into the flooded church.\n\n               INT. CHURCH\n\n               Tom shuts the door. He piles the weapons on a shelf. He sees \n               Jim touch his head.\n\n                                     TOM\n                         That hurt?\n\n                                     JIM\n                         Yeah.\n\n                                     TOM\n                         Good.\n\n               EXT. MAIN STREET\n\n               Wayne and Hank are alongside the Sheriff, engines idling as \n               they look at the church.\n\n                                     SHERIFF\n                              (nods, to Hank)\n                         Then go get some bottles.\n\n               Hank nods, guns his engine.\n\n                                     PHIL\n                              (to Hank)\n                         Wait -- what about the dam?\n\n                                     SHERIFF\n                         It'll be fine.\n\n                                     PHIL\n                         You said if it goes it'll wipe out \n                         the town.\n\n                                     SHERIFF\n                         Fuck the town.\n\n               Hank nods in agreement and takes off.\n\n               INT. CHURCH\n\n               Jim and Tom are by one of the stained glass windows, looking \n               out through a pale-colored pane at the Sheriff and his men \n               across the street. They watch Hank race off.\n\n                                     JIM\n                         Does he have the girl?\n\n                                     TOM\n                              (shakes head)\n                         She's in the small boat.\n\n               Tom touches the wound on his head.\n\n                                     TOM\n                         Jesus, I'm gonna get hepatitis.\n\n                                     JIM\n                         Hepatitis, hell. You probably already \n                         got cholera.\n\n               Tom gives Jim a look then starts for the back of the church.\n\n                                     JIM\n                         What're you doing?\n\n                                     TOM\n                         There's a back room.\n                              (touches wound)\n                         Maybe they've got something I can \n                         use on this.\n\n                                     JIM\n                         You been in here before?\n\n                                     TOM\n                              (bad memory)\n                         Oh, yeah.\n\n                                     JIM\n                         What happened?\n\n                                     TOM\n                         I saw Jesus.\n\n               EXT. DAM\n\n               Water is starting to go over the top again. It pours down in \n               sheets over the face of the dam.\n\n               INT. CHURCH\n\n               Jim is by the window, looking out at the Sheriff and Wayne \n               across the street in the shadows. He turns as...\n\n               TOM\n\n               Enters from the back. He's got a bottle of rubbing alcohol \n               and a towel. He splashes some of the alcohol on the towel, \n               then touches it to his wound. It hurts like a sonofabitch. \n               After a beat...\n\n                                     TOM\n                         So, has this all gone pretty much \n                         how you thought it would?\n\n               Jim turns on Tom.\n\n                                     JIM\n                         Everything would have gone fine if \n                         you'd've just walked away from the \n                         truck.\n\n                                     TOM\n                         Oh, yeah? Well, everything would've \n                         gone even better if you hadn't decided \n                         to rob the damn truck in the first \n                         place!\n\n               Jim looks away. After another silence...\n\n                                     TOM\n                         Did Charlie have cancer or something?\n\n                                     JIM\n                         You mean why was he doing this?\n                              (thinks, shrugs)\n                         No cancer.\n                              (beat)\n                         Didn't you ever think about taking \n                         the money?\n\n                                     TOM\n                         No.\n\n                                     JIM\n                         Come now. A man who used to make his \n                         living fencing hot jackhammers never \n                         thought about what he'd do with three \n                         million dollars?\n\n                                     TOM\n                         Sorry to disappoint you.\n                              (beat)\n                         What are you gonna do with it?\n\n                                     JIM\n                         As little as possible.\n\n               Silence for a few moments, then...\n\n                                     TOM\n                         Belize.\n\n               Jim looks at him.\n\n                                     TOM\n                         It's this small country in Central \n                         America, on the Atlantic side.\n\n                                     JIM\n                         I know where Belize is. What about \n                         it?\n\n                                     TOM\n                         They speak English and the dollar \n                         goes a long way. Beautiful beaches; \n                         friendly people. And they've got \n                         liberal banking laws. Very liberal.\n\n                                     JIM\n                         No, you didn't think about taking \n                         that money at all.\n\n                                     TOM\n                              (busted)\n                         You can't ride in the truck and not \n                         think about it.\n\n                                     JIM\n                         I'm sure. And I guess that's pretty \n                         much how it started with Charlie.\n\n               Tom thinks, nods and presses the towel to his wound again.\n\n               EXT. MAIN STREET\n\n               Wayne is thinking about something. He makes a decision and \n               flicks on his engine.\n\n                                     SHERIFF\n                         What're you doing?\n\n                                     WAYNE\n                         We got too many bodies with bullets \n                         in 'em.\n                              (nods at Karen)\n                         I'm gonna put her in her house, make \n                         it look like she fell down the stairs \n                         and drowned.\n\n                                     PHIL\n                         Don't you touch her!\n\n                                     WAYNE\n                         Saving her life... Hmm... You know, \n                         that might have actually gotten you \n                         laid.\n\n                                     SHERIFF\n                         Oh, for Christsakes, just dump her \n                         here.\n\n                                     WAYNE\n                         We got a few minutes before Hank \n                         gets back.\n\n                                     SHERIFF\n                         Just dump her here!\n\n               Wayne ignores the Sheriff and motors off.\n\n                                     SHERIFF\n                         Wayne! Goddamnit, we've gotta get \n                         them outta there! Wayne!\n\n               But Wayne keeps going.\n\n               INT. CHURCH\n\n               Tom watches Wayne drive off with Karen.\n\n                                     TOM\n                         Shit. Where's he going?\n\n               Tom grabs a rifle, frustrated and angry.\n\n               EXT. MAIN STREET\n\n               Hank motors up to the Sheriff and Phil.\n\n                                     HANK\n                         Where's Wayne going?\n\n                                     SHERIFF\n                         On a date. You all set?\n\n                                     HANK\n                         Yeah, but --\n\n                                     SHERIFF\n                         Then let's go.\n\n                                     HANK\n                         Aren't we gonna wait for Wayne?\n\n                                     SHERIFF\n                         We can get started without him, the \n                         dumb shit. He won't be long. Besides, \n                         we got Phil. Phil's gonna earn his \n                         money on this, aren't you Phil?\n\n               Phil looks scared shitless.\n\n               EXT. RESERVOIR DAM\n\n               Water continues to pour over the top. CLOSE ON CONCRETE\n\n               Chunks of cement are starting to wash away.\n\n               INT. CHURCH\n\n               Tom finishes reloading a gun.\n\n                                     JIM\n                         What -- you're gonna swim after her?\n\n               Tom doesn't answer. He moves toward the front door. Jim cuts \n               him off.\n\n                                     JIM\n                         You ain't gonna help her by getting \n                         shot. He's gone and you don't know \n                         where.\n\n                                     TOM\n                         The Sheriff knows. I think maybe \n                         I'll go ask him.\n\n                                     JIM\n                         You'll be dead before you get over \n                         the sandbags.\n                              (beat)\n                         Look, he'll be coming for us. You \n                         can ask him then.\n\n               Jim sees something out the window.\n\n                                     TOM\n                         What if he doesn't come?\n\n                                     JIM\n                         I wouldn't worry about that.\n\n               Tom sees what Jim sees.\n\n               THEIR POV\n\n               The Sheriff, Phil and Hank are heading toward the church, \n               flaming Molotov cocktails in their hands.\n\n               EXT. SIDE OF CHURCH\n\n               The Sheriff, Phil and Hank heave the flaming Molotov \n               cocktails.\n\n               THE ROOF\n\n               The bottles hit, explode. Sheets of fire rain down the roof.\n\n               ONE BOTTLE\n\n               Smashes through a window.\n\n               INT. CHURCH\n\n               Tom and Jim duck down as...\n\n               THE BOTTLE\n\n               Flies across the inside of the church and smashes against a \n               wall, sending sheets of fire down the wall.\n\n               EXT. CHURCH\n\n               The roof is on fire.\n\n               EXT. KAREN'S HOUSE\n\n               Modest, two-story, on a side street. The front door is open; \n               the boat tied up outside. There's a light on in the front \n               hall.\n\n               INT. KAREN'S HOUSE\n\n               Karen is unconscious. Wayne has her laying on the stairs \n               leading up from the entry area to the second floor. There's \n               three feet of water in the house. Karen's legs are in the \n               water. Her hands are handcuffed to a railing attached to the \n               wall, running up the stairs. Wayne stands over Karen, pats \n               her face.\n\n                                     WAYNE\n                         Wakey-wakey.\n\n               Karen stirs, then starts slipping back into unconsciousness, \n               so Wayne splashes her face with water. Karen comes to, \n               sputtering. Her eyes focus. She looks up at Wayne. Wayne \n               grins.\n\n                                     WAYNE\n                         Dear Penthouse: I always thought \n                         your letters were fake, until the \n                         wildest thing happened to me. I'm a \n                         policeman in a small town. In the \n                         middle of the big flood last year, I \n                         was patrolling the streets in a boat, \n                         feeling kind of sorry for myself -- \n                         'cause it was my birthday and all -- \n                         when I saw the front door to a house \n                         was open. I pulled my gun -- afraid \n                         it might be looters. Imagine my \n                         surprise when, instead of a looter, \n                         I find a young woman handcuffed to \n                         the railing of her stairs. Her name \n                         was Karen, and ever since she came \n                         back from college she'd made it clear \n                         she was too good for any of us local \n                         folk. Now here she was, in handcuffs! \n                         I said, \"What the heck is going on \n                         here, ma'am?\" And she said...\n\n               Karen says nothing. Wayne leans in close.\n\n                                     WAYNE\n                         And she said...\n\n                                     KAREN\n                         Sorry, Wayne, but I'm not playing a \n                         part in your sick little play.\n\n               Wayne pulls his gun, puts it to Karen's head.\n\n                                     WAYNE\n                         You're perfect for the role. I suggest \n                         you reconsider.\n\n                                     KAREN\n                         Or what? You'll kill me? You're gonna \n                         do that anyway.\n\n                                     WAYNE\n                         I might get clumsy. It might take a \n                         while.\n\n                                     KAREN\n                         I'm sure you can hurt me. But it's \n                         all going to be the same when I'm \n                         dead.\n\n               Wayne straightens up, looks at her, then launches back into \n               it.\n\n                                     WAYNE\n                         And she said, \"Happy Birthday, Wayne. \n                         I've got something for you.\" Well, \n                         I'm not stupid. I knew what she wanted \n                         to give me and I knew she wanted to \n                         give it bad, so I --\n\n               THE OVERHEAD LIGHT\n\n               Sparks and goes out.\n\n                                     WAYNE\n                              (looks up at light)\n                         That won't do. Man's gotta see what \n                         he's doing. 'Scuse me.\n\n               Wayne heads off for the kitchen. The second he's gone...\n\n               KAREN\n\n               Raises her hips and digs a hand into her pocket and pulls \n               out her Swiss Army knife. She pries open the big blade. She \n               hears Wayne sloshing back toward her. She gets back into the \n               position Wayne left her in as...\n\n               WAYNE\n\n               Re-enters carrying two burning candles in candle-holders.\n\n                                     WAYNE\n                         I got the candles. All's we need is \n                         a cake.\n\n               He sets the candles down on a dry step above Karen's head. \n               He leans in close.\n\n                                     WAYNE\n                         Mood lighting. You in the mood yet?\n                              (no answer from Karen; \n                              back into Penthouse \n                              letter)\n                         And then she said, \"My present's \n                         ready and waiting. All's you gotta \n                         do is unwrap it.\"\n\n               Wayne reaches into the water, undoes Karen's rain pants, \n               yanks off her shoes, then pulls off her pants. He throws \n               them over the banister. Karen remains passive, blank. Wayne \n               takes off his holster; hangs it on the banister. Then he \n               pushes his pants down to his ankles. His shirttail is long \n               enough so that we don't have to see his wretched little \n               pecker. He climbs on top of Karen in the water, brings his \n               face close to hers.\n\n                                     WAYNE\n                         It was cold and rainy that birthday \n                         night, and all I wanted was to get \n                         someplace warm and dry. As it turned \n                         out, what I really wanted was \n                         something warm and wet. Wayne grins \n                         and closes for a kiss and...\n\n               KAREN'S HAND\n\n               Moves fast with the knife and...\n\n               WAYNE'S EYES\n\n               Pop open wide.\n\n               WAYNE\n\n               His head jerks back. He tries to shout, but all that comes \n               out is an awful gurgle. He tries to push off Karen, but...\n\n               KAREN\n\n               Wraps her legs around him, holds him close, pinning him.\n\n               WAYNE\n\n               Finally breaks free. He tries to stop the bleeding with a \n               hand, but the blood spurts through his fingers. He reaches \n               for his gun in his holster on the banister, but just as he \n               grabs it...\n\n               KAREN\n\n               Lashes out of the water with her legs, kicking Wayne in the \n               groin, pushing him back.\n\n               WAYNE\n\n               Tries to get his balance, but his feet can't move -- his \n               pants are around his ankles. He falls back into the water, \n               firing his pistol.\n\n               BULLETS\n\n               Blow chunks out of the wall next to Karen, hit the ceiling \n               and...\n\n               WAYNE\n\n               Is floating on his back, trying to lift the pistol, but his \n               strength is fading fast. He gets off one last shot and...\n\n               THE CANDLE\n\n               Nearest Karen is blown to pieces.\n\n               WAYNE\n\n               The gun drops into the water. No more shots. No more life. \n               He floats, pants around his ankles, covered in blood, dead.\n\n                                     KAREN\n                         Happy Birthday, Wayne.\n\n               EXT. STREET AND CHURCH\n\n               The church roof is on fire.\n\n               THE SHERIFF, PHIL AND HANK\n\n               Are across the street.\n\n               INT. CHURCH\n\n               Jim and Tom hear a creaking and look up.\n\n               THE CEILING\n\n               The fire has eaten holes in the roof. Embers come down.\n\n               EXT. CHURCH AND STREET\n\n               The Sheriff is getting very agitated.\n\n                                     SHERIFF\n                         They're not coming out, Hank!\n\n                                     HANK\n                         The fire's not catching. The rain's \n                         too --\n\n                                     SHERIFF\n                         We have to get them! We have to kill \n                         them! Do you understand? If they're \n                         not dead, we got jack shit!\n\n               INT. CHURCH\n\n               A small chunk of burning ceiling drops down. Jim and Tom \n               look up. Just then...\n\n               BRIGHT LIGHT\n\n               Floods into the church through...\n\n               THE STAINED GLASS WINDOWS\n\n               Filling the church with a kaleidoscope of colors.\n\n               TOM AND JIM\n\n               Look out the windows.\n\n                                     TOM\n                         My God they're beautiful.\n\n               THE STAINED GLASS WINDOWS\n\n               Remain beautiful for a few more seconds until they shatter \n               and blow inwards as...\n\n               THE SHERIFF'S BOAT AND HANK'S BOAT\n\n               Come crashing through.\n\n               THE BOATS\n\n               Land, stop fast. The Sheriff's boat lands closer to the \n               pulpit; Hank's boat closer to the balcony.\n\n               THE SHERIFF, HANK AND PHIL\n\n               Look around. It's quiet for a moment. There's no sign of Tom \n               and Jim.\n\n               INT. KAREN'S HOUSE\n\n               Karen has her pants back on. She reaches out with one foot \n               and hooks Wayne's holster off the banister. She flips it \n               through the air and catches it with her hands. She opens \n               little leather pockets -- mace, more bullets. No keys. Karen \n               starts to panic.\n\n                                     KAREN\n                         There have to be keys. There --\n\n               She sees...\n\n               WAYNE\n\n               Still floating on his back, still dead. She looks closer \n               at...\n\n               WAYNE'S PANTS\n\n               Bunched around his ankles. And there, hanging from a belt-\n               loop is a ring of keys.\n\n               KAREN\n\n               Reaches out with her foot for Wayne's pants. She can't reach.\n\n               WAYNE\n\n               Is slowly drifting out the open door. Beyond the door, in \n               the light of the streetlamp, the water is riffling, moving, \n               and Wayne is heading toward it.\n\n               KAREN\n\n               Slides down further on the stairs, into the water, then stops.\n\n               CLOSE ON HANDCUFFS AND RAILING\n\n               There are metal supports going from the railing to the wall, \n               every three feet. Karen is prevented from going any further \n               down the stairs by one of these supports.\n\n               KAREN\n\n               Reaches out with a foot, straining, stretching her body, \n               almost dislocating her shoulder and...\n\n               HER FOOT\n\n               Just barely touches one of Wayne's feet, but then Wayne's \n               foot slips away and...\n\n               KAREN\n\n               Can only watch as...\n\n               WAYNE\n\n               Drifts out the door and is pulled away by the current.\n\n               EXT. RESERVOIR DAM\n\n               Water is cascading over the top of the dam. Chunks of concrete \n               are washing away.\n\n               INT. CHURCH\n\n               The Sheriff, Phil and Wayne scan the water, looking for \n               movement.\n\n                                     SHERIFF\n                         Where are they?! Jesus!\n\n               UNDERWATER POV\n\n               Looking up through a tangle of floating pews at the wavering \n               silhouettes of the boats and the men in them against the \n               burning timbers above.\n\n               TWO PISTOLS\n\n               Come into view, pointed up through the water.\n\n               ON THE WATER\n\n               The Sheriff, Phil and Hank have let down their guard for a \n               second when there's a series of dull, muted clacks from \n               underwater as...\n\n               BULLETS\n\n               Come streaking out of the water, winging by them, plugging \n               into the boats.\n\n               UNDERWATER\n\n               Jim fires the pistols, the bullets' bubble streaks knifing \n               up through the water.\n\n               THE SHERIFF, PHIL AND HANK\n\n               hit the deck in their boats, returning fire over the gunwales.\n\n               TOM\n\n               Surfaces over by the stairs up to the balcony, gasping for \n               air. He runs for the stairs.\n\n               BLAZING TIMBERS\n\n               Start to fall from the burning roof frame, hitting the water \n               with loud sizzling hisses.\n\n               THE SHERIFF, PHIL AND HANK\n\n               Turn to shoot at tom through the dropping flaming debris.\n\n               TOM\n\n               Disappears up the stairs, the bullets just missing him.\n\n               UNDERWATER\n\n               Jim runs out of bullets. He's long since run out of air. He \n               drops his guns and swims under the pews.\n\n               HANK\n\n               Looks up, realizing that Tom will be able to shoot down on \n               him. He reverses his boat fast under the balcony as...\n\n               TOM\n\n               Shoots down from the balcony, blowing a chunk out of the \n               prow of Hank's boat.\n\n               INT. KAREN'S HOUSE\n\n               The water is up to Karen's chin. Her hands are working \n               frantically beneath the water.\n\n               UNDERWATER\n\n               She's using the tip of the knife blade to unscrew the screws \n               holding the support to the railing. She's on the last one. \n               The blade slips, misses, gets a quarter turn, another quarter \n               turn...\n\n               KAREN\n\n               Spits out the water that spills into her mouth.\n\n               UNDERWATER\n\n               Another quarter-turn and the screw is loose enough to turn \n               by hand.\n\n               KAREN\n\n               Holds her breath with the water touching her nose. She gets \n               the screw loose, pulls up on the railing and pulls the \n               handcuff through the gap between the support and the railing.\n\n               INT. CHURCH\n\n               The Sheriff turns to Phil and nods re: Jim.\n\n                                     SHERIFF\n                         You take care of him!\n\n               The Sheriff aims at the balcony as Phil scans the water, \n               looking for Jim.\n\n               UNDERWATER\n\n               Jim pulls an electrical cord out of a wall socket.\n\n               ON THE BALCONY\n\n               Tom ducks down as the Sheriff's bullets start plugging through \n               the wood front of the balcony. Tom moves away from the bullet \n               strikes, splashing through the water in the balcony.\n\n               CLOSE ON BALCONY FLOOR\n\n               As BANG BANG BANG -- bullets start shooting up from below.\n\n               HANK\n\n               Is firing up at Tom through the floor of the balcony.\n\n               TOM\n\n               Jumps back, startled, looking down at...\n\n               THE BALCONY FLOOR\n\n               Holes explode in the floor, sending up small geysers of water. \n               The water then starts whirlpooling down through the holes.\n\n               TOM\n\n               Moves back from hank's advancing bullet holes.\n\n               THE SHERIFF\n\n               Keeps firing.\n\n               TOM\n\n               Is caught between Hank's bullets and the Sheriff's bullets. \n               So he racks a load in the shotgun and dives backwards off \n               the balcony.\n\n               HANK\n\n               Is still shooting up as...\n\n               TOM\n\n               Arcs off the balcony, firing the shotgun under the balcony \n               at Hank.\n\n               HANK\n\n               Dives to the floor of his boat as Tom's shotgun blasts blow \n               plate-sized holes in the church doors.\n\n               TOM\n\n               Lands in the water and goes under.\n\n               THE SHERIFF AND PHIL\n\n               Look for Tom in the water.\n\n               HANK\n\n               Starts to get up from the bottom of his boat, searching for \n               a clip for his gun.\n\n               THE SHERIFF\n\n               Sees Tom's shape in the water and is about to shoot when...\n\n               JIM\n\n               Jumps up out of the water with the electrical cord. He tosses \n               a loop of the cord around the Sheriff's neck and pulls, \n               yanking the Sheriff out of the boat.\n\n               TOM\n\n               Comes out of the water, aiming his shotgun at...\n\n               PHIL\n\n               Who is aiming his pistol at Tom. Phil freezes.\n\n               THE SHERIFF AND JIM\n\n               Struggle in the water. Jim pulls the cord tightly around the \n               Sheriff's neck as the Sheriff tries to get a shot off at Jim -- \n               he can't get the barrel pointed at Jim.\n\n               HANK\n\n               Fumbles with the bullet clip.\n\n                                     HANK\n                              (to Phil)\n                         Kill him!\n\n               TOM\n\n               Turns his shotgun on Hank and pulls the trigger -- click. Uh-\n               oh.\n\n                                     HANK\n                         Kill him!\n\n               TOM AND PHIL\n\n               Exchange a look.\n\n               HANK\n\n               Slams the clip into his gun and levels it at Tom.\n\n               PHIL\n\n               Points his gun at Hank.\n\n                                     PHIL\n                         No! We can't --\n\n               BANG! and hank shoots Phil. Phil pitches back out of the \n               Sheriff's boat.\n\n               PHIL\n\n               Lands between Jim and the Sheriff, knocking them apart.\n\n               THE SHERIFF\n\n               Is free of Jim's grasp. He shakes off the electrical cord \n               and turns to shoot...\n\n               JIM\n\n               Who moves a little faster. He grabs Phil's pistol and puts \n               it to the Sheriff's head before the Sheriff can bring his \n               gun around.\n\n               HANK\n\n               Draws a bead on Jim and is about to shoot when...\n\n               TOM\n\n               Comes out of the water on the other side of Hank's boat. Tom \n               pushes down hard on the side of the boat.\n\n               HANK\n\n               Is rocked back, thrown off balance. He starts to spin and \n               bring his gun around when...\n\n               TOM\n\n               Swings with the shotgun, catching...\n\n               HANK\n\n               In the side of the head. Hank crumples and falls into the \n               water, taking his rifle with him.\n\n               JIM AND THE SHERIFF\n\n               Jim nods at the Sheriff's rifle.\n\n                                     JIM\n                         In the boat.\n\n               THE SHERIFF\n\n               Hesitates, then tosses his rifle into the boat.\n\n               TOM\n\n               Grabs Hank's rifle and aims it at the Sheriff.\n\n                                     TOM\n                         Where's Karen?\n\n               INT. KAREN'S HOUSE\n\n               Karen undoes a last screw in a metal support.\n\n               She pulls the handcuff through the gap between the support \n               and railing. She's at the top of the stairs.\n\n               THE END OF THE RAILING\n\n               Curves and goes into the wall.\n\n               KAREN\n\n               Tugs at the railing, tries rocking it up and down. It doesn't \n               budge. She starts chipping at the plaster with the knife.\n\n                                     KAREN\n                         God, I am really beginning to hate \n                         fine craftsmanship.\n\n               THE WATER\n\n               It's up to her chest.\n\n               INT. CHURCH\n\n               The Sheriff hesitates.\n\n                                     TOM\n                         Where is she?\n\n                                     SHERIFF\n                         They went back to her house.\n\n                                     TOM\n                         Where's her house?\n\n                                     SHERIFF\n                         It's --\n\n               And just then they all hear something truly ominous -- a \n               siren pierces the night.\n\n               INT. KAREN'S HOUSE\n\n               She reacts to the siren -- uh-oh.\n\n               INT. CHURCH\n\n               The siren wails.\n\n                                     JIM\n                         What in God's name is that?\n\n                                     SHERIFF\n                         Hank?\n\n                                     HANK\n                              (woozy but okay)\n                         It's topped out.\n\n                                     SHERIFF\n                         How much time we got?\n\n                                     HANK\n                         How should I know?\n\n                                     SHERIFF\n                         Guess!\n\n                                     HANK\n                         It's an old dam! Not long.\n\n                                     SHERIFF\n                              (to Tom)\n                         Then I'd say you boys better drop \n                         your guns.\n\n                                     TOM\n                         What?\n\n                                     SHERIFF\n                         That's the deal! You let me and Hank \n                         go -- with a few of these bags -- \n                         and I'll tell you where to find Karen.\n\n                                     JIM\n                              (to the Sheriff)\n                         Get out of the boat.\n\n                                     TOM\n                         Hold on.\n\n               Jim turns to look at Tom.\n\n                                     JIM\n                         Hold on?\n\n                                     SHERIFF\n                         It's the only way you're gonna find \n                         her!\n\n                                     TOM\n                         It's only a couple of bags.\n\n                                     JIM\n                         No.\n\n                                     TOM\n                         But I thought --\n\n                                     JIM\n                         Look, I don't know what you thought \n                         but I told you, I'm here for the \n                         money; that's all.\n\n               Tom doesn't know what to do. The Sheriff looks pretty pleased \n               with himself. He might just get out of this. And then...\n\n                                     PHIL (O.S.)\n                         She lives on Boyd Street.\n\n               They all look over at...\n\n               PHIL\n\n               Alive, but barely.\n\n                                     PHIL\n                         Three over. Two-story, blue shutters.\n\n               TOM\n\n               Looks at Jim, disappointed, angry, then hurries to Hank's \n               boat.\n\n               JIM\n\n               Climbs into the Sheriff's boat.\n\n               TOM\n\n               Climbs into Hank's boat. He starts the engine, looks down \n               at...\n\n               PHIL\n\n               Floating in the water, dying. A brief look between them, \n               then...\n\n               TOM\n\n               Drives the boat out through a shattered window.\n\n               JIM\n\n               Pushes the Sheriff out of the boat.\n\n               EXT. RESERVOIR DAM\n\n               A large V is being cut in the top of the dam by the raging \n               water.\n\n               A QUARTER-MILE AWAY\n\n               Looking back at the dam. The line of lights on top of the \n               dam start to fall over, then go dark, snuffed out by an unseen \n               force.\n\n               INT. CHURCH\n\n               Jim keeps his gun leveled at the Sheriff and Hank, standing \n               in the water, as he pulls the money bags up from the forward \n               hold.\n\n                                     SHERIFF\n                         So, you just gonna kill me?\n\n                                     JIM\n                         Lord knows I should.\n\n               Jim opens a money bag and smiles at what he sees.\n\n               INT. KAREN'S HOUSE\n\n               Karen tilts her head back to keep her lips and nose above \n               water. And then she hears a window smash. She turns as...\n\n               TOM\n\n               Wades in along the upper hall.\n\n                                     TOM\n                         I'm guessing you can't get up.\n\n                                     KAREN\n                         I'm handcuffed.\n\n               Tom reaches into the water for the railing.\n\n                                     KAREN\n                         The railing's bolted to the wall.\n\n               He looks at her.\n\n                                     KAREN\n                         I've got a saw.\n\n                                     TOM\n                         Where?\n\n                                     KAREN\n                         In the kitchen. In the tall cupboard \n                         beside the --\n\n               And then they hear a sound more ominous than the siren -- \n               they hear the siren stop.\n\n                                     TOM\n                         Is that good or bad?\n\n               INT. CHURCH\n\n               Jim, the Sheriff and Hank react to the silence. Jim looks \n               off.\n\n               THE SHERIFF\n\n               Drops underwater.\n\n               JIM\n\n               Turns back at the sound of the Sheriff going under.\n\n               UNDERWATER\n\n               The Sheriff pulls up his pant leg.\n\n               JIM\n\n               Is aiming his gun at the water and is about to fire as...\n\n               THE SHERIFF'S HAND\n\n               Comes out of the water shooting a pistol.\n\n               JIM\n\n               Is shot in the gut and the thigh and high on the chest and \n               he stumbles back, bellowing, and falls out of the Sheriff's \n               boat and into the water.\n\n                                     SHERIFF\n                         You should've just killed me.\n\n               INT. KAREN'S HOUSE\n\n                                     KAREN\n                         You gotta go!\n\n               Tom starts hyperventilating.\n\n                                     KAREN\n                         The dam's gone! You gotta go!\n\n                                     TOM\n                              (shakes head)\n                         I owe you one.\n\n               Tom breathes deep then ducks underwater.\n\n               UNDERWATER\n\n               Tom flicks on his flashlight and starts swimming down the \n               stairs.\n\n               KAREN\n\n               Watches Tom and his light get swallowed up in the murky water.\n\n               INT. CHURCH\n\n               Phil is grabbing for the Sheriff's boat as the Sheriff and \n               Hank zoom out of the church, leaving him behind.\n\n                                     PHIL\n                         NOOOO!\n\n               EXT. MAIN STREET\n\n               The Sheriff's boat comes onto Main Street, moving fast.\n\n               IN THE BOAT\n\n               Hank is looking back, in the direction the flood will come.\n\n                                     HANK\n                         We gotta go faster!\n\n                                     SHERIFF\n                         Yeah, you're right.\n\n               The Sheriff pushes Hank out of the boat.\n\n               HANK\n\n               Goes skipping over the water and slams into a streetlight \n               post.\n\n               INT. KAREN'S HOUSE\n\n               Tom swims down into the living room. His light shows a couch, \n               chairs, TV set. Books and newspapers are suspended in the \n               water.\n\n               EXT. THE CHURCH\n\n               The damaged ski-boat that Jim and Tom took to the church has \n               slipped off the sandbag wall and is drifting. A peaceful \n               scene. But then, from the distance, comes a rushing roar.\n\n               INT. CHURCH\n\n               Phil hears the roar. He looks around, lost.\n\n               EXT. STREET\n\n               Hank, groggy in the water, also hears the distant roar.\n\n               INT. CHURCH\n\n               The roar is building, getting louder. Phil sees something in \n               the water and reaches for it, frantically. He gets it. It's...\n\n               A BIBLE\n\n               And he clutches it to his chest as...\n\n               THE FLOOD\n\n               Hits the church.\n\n               INT. KAREN'S HOUSE - KITCHEN\n\n               Tom swims into the kitchen. He looks for the tall cupboard \n               by the fridge. He opens it.\n\n               INSIDE THE CUPBOARD\n\n               Hanging on a hook on the back wall is a saw. Tom grabs it.\n\n               EXT. MAIN STREET\n\n               Hank unwraps himself from around the lamp post. He looks \n               back.\n\n               HIS POV\n\n               Streetlights in the distance, winking out one by one, marking \n               the advance of the wall of water.\n\n                                     HANK\n                         Oh my God.\n\n               Hank looks around for safety. He sees it.\n\n               HIS POV\n\n               There's an alleyway.\n\n               HANK\n\n               Swims for the alley.\n\n               EXT. THE ADVANCING FLOOD\n\n               Roars through the town, pushing a rolling wave of debris, \n               obliterating anything in its path.\n\n               EXT. ALLEY\n\n               Hank swims into the alley. Hank looks for something to climb \n               up on, to hold onto. There's...\n\n               FIRE ESCAPE LADDER\n\n               At the end of the alley.\n\n               HANK\n\n               Swims for it. He hears the rushing roar of the advancing \n               flood. He expects the flood to blow by the end of the alley. \n               Wrong.\n\n               WALL OF WATER\n\n               Comes into the alley, banking high on the far wall before \n               coming down and barreling toward Hank. And what makes it \n               worse for Hank is that there's...\n\n               A CAR\n\n               At the front of the wave, being pushed by the water.\n\n               HANK\n\n               Dives clear just as...\n\n               THE CAR\n\n               Smashes into the wall, right where Hank had just been.\n\n               HANK\n\n               Relief in his eyes. He gets to the fire escape and is climbing \n               to safety when...\n\n               PROPANE TANK\n\n               Comes into the alley, rolling in the flood, spraying propane \n               from a torn hose. It explodes.\n\n               HANK\n\n               Barely has time to scream.\n\n               INT. KAREN'S KITCHEN - BREAK OF DAWN\n\n               Tom is threading his belt through the handle of the saw to \n               secure it. He gets it done and starts to swim out of the \n               kitchen.\n\n               BACK TO KAREN\n\n               Just Karen's lips and nose are above water.\n\n               IN THE KITCHEN\n\n               Tom is about to leave when everything starts to move -- \n               rocking, from side to side, as if in a slow motion earthquake. \n               Cupboards and the fridge open and bottles and food and plates \n               tumble out.\n\n               EXT. KAREN'S HOUSE\n\n               The house has been hit by the flood. It's being pulled by \n               the massive current, stretching overhead phone and power \n               lines.\n\n               INT. KAREN'S HOUSE\n\n               Karen hears the groaning, ripping as the house tears free \n               from water and sewer lines. She's looking down for Tom when \n               there's a snap and the light above her goes out.\n\n               EXT. KAREN'S HOUSE\n\n               The house is carried on the current, turning in the water.\n\n               IN THE KITCHEN\n\n               Tom watches, astounded, as the room starts to turn around \n               him. He kicks fast for the door to...\n\n               THE LIVING ROOM\n\n               Tom swims in, fast, toward the stairs when...\n\n               A WINDOW\n\n               Caves in and...\n\n               HUGE TREE BRANCH\n\n               Smashes in, filling the room, blocking Tom's route to the \n               stairs.\n\n               TOM\n\n               Tries to get through the tangle of branches and leaves, but \n               can't. He swims over to another window and slides it up.\n\n               KAREN\n\n               Keeps looking down for Tom.\n\n               EXT. KAREN'S HOUSE\n\n               The house is impaled on a tree, the current sluicing around \n               it.\n\n               TOM\n\n               Surfaces near the side of the house, gasping. The current \n               starts ripping him past the house. He swims as hard as he \n               can back to the house, reaches out and grabs onto a gutter.\n\n               INT. KAREN'S HOUSE\n\n               Karen doesn't have much time left. The water is washing over \n               her mouth and nose. And just as she's about to go under...\n\n               TOM\n\n               Swims in with the saw. He starts sawing on the handrail. \n               Everything's going fine. And then...\n\n               THE SAWBLADE\n\n               Snaps.\n\n               TOM AND KAREN\n\n               Look at each other. Oh no. Karen's going under.\n\n               TOM\n\n               Sees something. He dives into the water.\n\n               KAREN\n\n               Can only watch and wait. What's he doing? Oh, Jesus. And \n               then...\n\n               TOM\n\n               Surfaces, holding Wayne's pistol. He puts the mouth of the \n               barrel to the handcuff chain, shields Karen's face, looks \n               away and pulls the trigger.\n\n               EXT. A TREE IN WATER\n\n               The water swirls through the branches of a half-submerged \n               tree.\n\n               HENRY AND DOREEN\n\n               Are in the tree. Henry is either unconscious or dead. Doreen \n               cradles him.\n\n                                     DOREEN\n                         Come on, Henry. Forget that \"Go to \n                         the light\" crap. Come back to me. \n                         You're all I've got.\n\n               And Henry starts to come to.\n\n                                     DOREEN\n                         Oh, Henry. Thank God.\n\n               Henry opens his eyes.\n\n                                     HENRY\n                         Next time, when I say \"Let's \n                         evacuate,\" we're gonna evacuate.\n\n                                     DOREEN\n                         Whatever you say, honey.\n\n               She hugs him tight and after a beat he hugs her back.\n\n               EXT. KAREN'S HOUSE\n\n               Tom and Karen swim out of a second floor window, grab the \n               rain gutter. Tom pulls himself onto the roof then grabs Karen \n               and helps her up. They crawl until they're clear of the edge. \n               Only the sloped roof of the house is visible in the swirling \n               water. They are just catching their breath when they are hit \n               by...\n\n               BRIGHT WHITE LIGHT\n\n               And they look to see...\n\n               THE SHERIFF\n\n               In his boat, shining a searchlight on them with one hand, a \n               gun in the other. He starts shooting.\n\n               TOM AND KAREN\n\n               Tom pushes Karen toward the peak of the roof as the bullets \n               plug in around them. Tom pushes Karen over the top then turns \n               and dives off the roof and into the water.\n\n               KAREN\n\n               Hears an engine behind her and turns.\n\n               A BOAT\n\n               Racing toward the house. It's...\n\n               THE SKI-BOAT\n\n               And at the controls is...\n\n               JIM\n\n               Barely alive.\n\n               THE OUTBOARD MOTOR\n\n               Is wobbling, vibrating at the back of the boat, almost loose \n               from its moorings.\n\n               JIM'S POV\n\n               He sees Karen, crouched below the peak of the house, a bright \n               light coming from the other side along with gunshots.\n\n               JIM\n\n               Pushes the throttle all the way forward.\n\n               THE SKI-BOAT\n\n               Shoots forward.\n\n               UNDERWATER\n\n               Tom swims hard toward the Sheriff's boat.\n\n               THE SHERIFF\n\n               Is shooting down into the water at Tom's moving shape.\n\n               THE SKI-BOAT\n\n               With Jim at the wheel, comes racing straight toward the house.\n\n               KAREN\n\n               Thinks he's going to turn.\n\n                                     KAREN\n                         No! No!\n\n               THE SKI-BOAT\n\n               Doesn't turn.\n\n               KAREN\n\n               Rolls to the side, just getting clear as...\n\n               THE SKI-BOAT\n\n               Hits the sloping roof of Karen's house and ramps up it.\n\n               THE OUTBOARD MOTOR\n\n               Digs into the shingles of the roof and tears free from the \n               back of the boat.\n\n               THE SHERIFF\n\n               Hears the sound and looks up as...\n\n               THE SKI-BOAT\n\n               Comes over the peak of the roof.\n\n               TOM\n\n               Surfaces to see...\n\n               THE SKI-BOAT\n\n               Fly right over him, heading straight for...\n\n               THE SHERIFF\n\n               Who ducks down, just in time as...\n\n               THE SKI-BOAT\n\n               Misses him, landing just past him in the water.\n\n               THE SHERIFF\n\n               Straightens up, grinning with glee that the boat missed him. \n               And then he hears a piercing whine coming from behind him. \n               He turns, just in time to see...\n\n               THE OUTBOARD MOTOR\n\n               Flipping end over end, propeller whirring, heading straight \n               for him.\n\n               THE SHERIFF\n\n               Starts to scream.\n\n               CLOSE ON KAREN\n\n               Looking over the peak of the roof in horror. She hears the \n               Sheriff's scream and the scream of the propeller and then a \n               horrible ugly ripping and both screams stop.\n\n               THE SHERIFF'S BOAT\n\n               The Sheriff is gone. The side has been smashed out of the \n               boat and the boat is flooding with water.\n\n               THE SHERIFF\n\n               Is just some misshapen thing trailing red, floating in the \n               water.\n\n               JIM\n\n               Tries to restart the ski-boat but it's dead. He slumps \n               forward.\n\n               TOM\n\n               Sees Jim slump against the side of the boat.\n\n                                     TOM\n                         You okay?\n\n                                     JIM\n                         Fine.\n\n               Tom can tell Jim's anything but. Tom swims for the boat.\n\n               THE BOAT\n\n               Tom swims up, pulls himself in. He pulls Jim back off the \n               controls, sees the blood.\n\n                                     TOM\n                         Oh, God. We gotta get you to --\n\n               Jim looks at Tom. Tom understands -- Jim's not going anywhere.\n\n                                     TOM\n                         Thanks.\n\n                                     JIM\n                         For what?\n\n                                     TOM\n                         You just saved our lives.\n\n                                     JIM\n                         I did? I just came for the money.\n\n               Tom looks at Jim -- he knows Jim's lying.\n\n                                     KAREN (O.S.)\n                         Do you need any help?\n\n                                     JIM\n                              (grabs Tom's arm)\n                         No. Tell her to stay back.\n\n                                     TOM\n                              (to Karen)\n                         It's okay!\n\n               Jim lets go of Tom.\n\n                                     JIM\n                         You're going to turn it in?\n\n                                     TOM\n                         Sorry to disappoint you.\n\n                                     JIM\n                         Well, hell, then I guess I better \n                         take it after all. I figure the \n                         river'll carry me down to the Gulf \n                         of Mexico. If I catch the right \n                         currents, maybe I'll end up in... \n                         Belize?\n                              (Tom nods)\n                         You come look me up. I'll buy you a \n                         drink.\n\n                                     TOM\n                         I'll do that.\n\n               Jim grimaces as he's hit by a wave of pain. He looks away.\n\n                                     JIM\n                         Go.\n\n               Tom hesitates for a second.\n\n                                     JIM\n                         Please.\n\n               Tom turns and slides into the water and swims away.\n\n                                     JIM\n                         Son, don't think too badly of your \n                         Uncle Charlie. He always said you \n                         were capable of remarkable things.\n                              (beat)\n                         He was right.\n\n               There's a last look between Jim and Tom, then Tom swims away.\n\n                                     JIM\n                              (smiles)\n                         The rain's stopped.\n                              (breathes deep)\n                         The air after a rain...\n\n               Jim slowly topples forward and is still.\n\n               TOM\n\n               Swims through the swirling current toward Karen's roof.\n\n               JIM'S BOAT\n\n               Sinks below the surface and is gone.\n\n               TOM AND KAREN\n\n               Karen is down at the water's edge with her arm extended to \n               Tom. Tom grabs it, and as Karen pulls...\n\n                                                              MATCH CUT TO:\n\n               EXT. CHURCH - SUNSET\n\n               Karen pulls Tom up onto scaffolding running along the edge \n               of the new roof under construction. Tom holds a paper bag. \n               He's wearing work gear -- tool belt, work boots, etc. Tom \n               looks at the work being done on the roof.\n\n                                     TOM\n                         They got a lot done today.\n\n                                     KAREN\n                         It's coming along.\n                              (re: bag)\n                         What'd you get?\n\n                                     TOM\n                         Barbecue chicken from Lilly's.\n\n                                     KAREN\n                         Yum.\n\n                                     TOM\n                         You want some? I wish you'd told me. \n                         I woulda got more.\n\n                                     KAREN\n                         Ha ha.\n\n               And as they sit down and start to eat, the camera begins to \n               PULL BACK.\n\n                                     TOM\n                         I talked to Mikey. He says the \n                         flooring should be in by Friday.\n\n                                     KAREN\n                         That's what he said last week.\n\n                                     TOM\n                         I said if it wasn't here by Friday \n                         at six that you were going to go \n                         over and beat the crap out of him.\n\n                                     KAREN\n                         And I will.\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\nHard Rain\nWriters :   Graham Yost\nGenres :   Action  Crime  Thriller  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "During the worst recorded rainstorm in the history of the Midwestern United States, armored truck drivers Tom (Christian Slater) and his uncle Charlie (Edward Asner) collect the money from local banks affected by the rising flood waters. In the small town of Huntingburg, Indiana, which has been evacuated, Tom and Charlie drive into a ditch and become stuck, and Charlie calls dispatch to alert the National Guard. They are then ambushed by Jim (Morgan Freeman) and his gang of armed robbers, Kenny (Michael Goorjian), Mr. Mehlor (Dann Florek) and Ray (Ricky Harris). Kenny accidentally shoots Charlie dead, as Tom gets away with the $3 million in cash and hides it in a cemetery. The film continues, showing floods and chases with jet skis and other craft."}