{"title": "Heist", "full_text": "March, 1999\n\n\n\n\n                               GENE HACKMAN\n\n\n\n                                   HEIST\n\n\n\n                              A SCREENPLAY BY\n                                DAVID MAMET\n\n\n\n                           COPYRIGHT © 1998, 1999\n                                   BY DAVID MAMET\n\n\n\n\nROSENSTONE/WENDER AGENCY\n\n3 E. 48th St.   N.Y.C.\n\nFADE IN:\n\nEXT RAILROAD OVERPASS DAY.\n\nA LOW FLYING PLANE, MAKING ITS FINAL APPROACH.\n\nANGLE CU.\n\nA WELL-BUILT MAN IN HIS FORTIES, JOE MOORE, IN HORN RIMMED GLASSES\nAND MOUSTACHE, LOOKS UP, AT THE PLANE.\n\nCAMERA TAKES HIM TO AN OLD STONE OVERPASS OVER A RAILROAD TRACK.\n\nHE CARRIES A FOLDED MAP.     HE LOOKS AROUND, AS IF LOST.\n\nANGLE.\n\nMOORE, STANDING AT THE SIDE OF A TWO LANE SEMI-SUBURBAN ROAD.      HE\nLOOKS DOWN AT HIS MAP.\n\nSOUND OF A TRAIN APPROACHING.\n\nANGLE\n\nON MOORE, OVER HIM AS A TRAIN STREAMS BY BENEATH THE OVERPASS.\n\nANGLE.\n\nON MOORE, AS HE NODS, AND STARTS BACK TOWARD A PARKED STATIONWAGON.\n\nANGLE INS.\n\nWE SEE    THE FOLDED MAP CONTAINS A YELLOW LEGAL PAD. MOORE GLANCES\nAT HIS    WATCH, AND MAKES A NOTATION IN THE PAD. HE FLIPS BACK\nPAGES    ON THE PAD TO SHOW IT IS FULL OF NOTATIONS. WE SEE A SKETCH\nOF THE    RAILWAY OVERPASS.\n\nANGLE\n\nON MOORE, AS HE STARTS TO GET INTO THE STATIONWAGON. HE LOOKS\nAROUND ONE LAST TIME, SHRUGS, AS IF TO SAY \"SO BE IT,\" AND GETS\nINTO THE CAR.\n\nANGLE INT THE CAR.\n\nMOORE, SITTING. A POLICE CAR, SIREN AND LIGHTS ON.      ROARS PAST\nOUTSIDE. MOORE NODS, LOOKS AT HIS WATCH.\n\nHE STARTS THE CAR. PUTS THE PAD DOWN NEXT TO HIM, IS ABOUT TO\nDRIVE OFF, WHEN HE GETS ANOTHER THOUGHT, AND OPENS THE PAD AGAIN.\n\nMOORE LOOKS AROUND.    SIGHS, SHRUGS, AND PUTS THE CAR IN GEAR.\n\n                                                    DISSOLVE TO:\n\nEXT. COMMERCIAL STREET. A METAL CANE ON THE SIDEWALK, A PAIR OF\nMAN'S LEGS. THE SUNLIGHT GLINTS OFF THE CANE.\n\nPAN UP, PAST THE CANE, TO REVEAL.\n\n                                                                 2.\n\n\nEXT. LIMOUSINE. DAY.\n\nA BEAUTIFUL COMMERCIAL STREET. FULL OF BOUTIQUES, POSH CARS, AND\nFOLKS STROLLING DOWN THE STREET. TWO MEN, JOE MOORE, AND BILLY\nBLANE, A WELL-BUILT MAN OF SIMILAR AGE, BOTH IN FINE BUSINESS SUITS,\nBOTH WEAR LEATHER GLOVES, STROLL DOWN THE STREET. MOORE WALKS WITH\nTHE AID OF A HEAVY METAL CANE.\n\n                        MOORE\n                (AS HE LOOKS AROUND)\n           What makes the world go around?\n\n                        BLANE\n           ...you tell me.\n\n                         MOORE\n           Gold.\n\n                        BLANE\n           Some people say Love.\n\n                         MOORE\n                (NODS)\n           It is love.   It is Love of Gold.\n\n                        BLANE\n           ...easy to get the gold, hard to get it home.\n\n                        MOORE\n           ...waal, so it takes a little bit of\n           thought...\n\nANGLE CU\n\nON MOORE, AS HE LOOKS ACROSS THE STREET.\n\nANGLE HIS POV.\n\nA POSH JEWELRY STORE. A UNIFORMED GUARD EXITS THE STORE, CLOSING\nTHE METAL GRATE BEHIND HIM.\n\nANGLE. ON BLANE AND MOORE. AT THEIR     LIMOUSINE. BLANE FEEDS THE\nPARKING METER. AND HELPS MOORE INTO    THE BACKSEAT. OVER THEM, IN\nTHE B.G., WE SEE THE GUARD DISAPPEAR   AROUND A CORNER. MOORE\nLOOKS DOWN AT HIS WATCH AS HE ENTERS   THE CAR.\n\nANGLE\n\nON BLANE, AS HE GETS INTO THE DRIVER'S SEAT.\n\nBLANE LOOKS OUT OF THE WINDOW.\n\nINT FAST-FOOD COFFEESHOP DAY.\n\nANGLE, INSERT.\n\nA TRAY WITH FIVE ESPRESSO SHOTGLASSES ON IT.\n\n                                                               3.\n\n\nA WOMAN'S HAND FILLING THE LAST OF THE FIVE.\n\nANGLE\n\nTHE UNIFORMED GUARD, AT THE COUNTER, CHATTING WITH ANOTHER SERVER.\n\n                         CASHIER\n                 (TO GUARD)\n            ...what's yours?\n\nTHE WOMAN POURING THE DRINKS RUBS HER TEMPLES, AND SIGHS.\n\n                         WOMAN\n            ...Five Cappuccino...\n\n                         CASHIER\n            ...that ought to keep you up...\n\nTHE GUARD AND THE CASHIER LAUGH.\n\n                         CASHIER (cont'd)\n            ...eleven ninety-two...\n\nANGLE\n\nON THE WOMAN, A SMALL 'VISINE-LIKE' BOTTLE FROM HER POCKET, TIPS\nHER HEAD BACK, AND MOVES AS IF TO PUT THE DROPS IN HER EYES.\n\nANGLE XCU\n\nWE SEE THAT THE CAP IS STILL ON THE BOTTLE.\n\nANGLE.\n\nSHE LOWERS THE BOTTLE AND TAKES OFF THE CAP, AND PUTS SEVERAL DROPS\nINTO EACH OF THE DRINKS BEFORE HER.\n\nANGLE\n\nON THE WOMAN AS SHE PASSES THE TRAY FULL OF DRINKS OVER THE COUNTER\nTO THE GUARD.\n\n                         WOMAN\n            ...you have a nice day.\n\nSHE LOOKS UP AT THE WALLCLOCK, AND ADDRESSES HERSELF TO THE CASHIER.\n\n                         WOMAN (cont'd)\n            I've got a break...\n\nTHE CASHIER NODS.\n\nCAMERA TAKES THE WOMAN BACK INTO THE EMPLOYEE'S AREA, WHERE SHE\nTAKES DOWN A LARGE SHOULDERBAG, AND FISHES A PACK OF CIGARETTES AND\nA LIGHTER OUT OF IT. SHE BEGINS TO LIGHT A CIGARETTE.\n\nTHE CASHIER TURNS BACK TO LOOK AT THE WOMAN.\n\n                                                                  4.\n\n\n                      CASHIER\n         ...Din't they tell you can't smoke in here...\n\nTHE WOMAN NODS, AS IF TO SAY, 'I FORGOT. I'M SORRY.' SHE TAKES\nTHE BAG, PUTS IT OVER HER SHOULDER, AND STARTS OUT OF THE\nCOFFEESHOP.\n\nANGLE, EXT THE COFFEESHOP.\n\nA SMALL PARKING AREA, A DUMPSTER, THE WOMAN COMES OUT, SMOKING THE\nCIGARETTE. CAMERA HINGES HER AROUND THE CORNER, INTO A SMALL\nALLEYWAY. IN THE ALLEYWAY SHE TAKES A THIN GRAY RAINCOAT OUT OF THE\nBAG, AND PUTS IT ON. IT COVERS HER STORE UNIFORM. SHE TAKES A\nPIN FROM HER HAIR AND LETS HER HAIR FALL. SHE TAKES A LARGE PAIR\nOF SUNGLASSES FROM THE GLASS AND PUTS THEM ON.\n\nANGLE, INT THE LIMOUSINE.\n\nBLANE, IN THE DRIVER'S SEAT, JOE MOORE IN BACK.\n\nANGLE ON MOORE.   HOLDING A SMALL YELLOW SHEET.\n\nANGLE INS:   IT IS THE DRAWING OF THE RAILROAD OVERPASS.\n\nANGLE\n\nON BLANE MAKING A CALCULATION ON THE SHEET.\n\nBLANE SEES SOMETHING OUT OF THE WINDSHIELD, AND INDICATES IT TO\nJOE MOORE, WHO NODS AND PUTS AWAY THE YELLOW PAD.\n\n                      BLANE\n         Showtime, Circus Time.\n\nANGLE, THEIR POV.\n\nTHE GUARD, HOLDING THE TRAY OF COFFEES, ENTERING THE\nJEWELRYSTORE.\n\nANGLE\n\nON THE GUARD. AS HE IS BUZZED THROUGH A DOUBLE GRATE.      CAMERA PANS\nTO REVEAL THE WOMAN COMING OUT OF THE ALLEYWAY.\n\nCAMERA TAKES HER ACROSS THE STREET. WHERE SHE PASSES THE LIMOUSINE,\nAS SHE DOES SHE OPENS HER HAND, SHOWING HER OPEN HAND TO THE\nLIMOUSINE.\n\nANGLE INT THE LIMOUSINE.\n\n                      BLANE\n         ...I see five.\n\n                      MOORE\n         Five is correct.\n              (HE LOOKS DOWN AT HIS WATCH.)\n\n                                                                   5.\n\n\nANGLE EXT THE JEWELRY STORE.\n\nWE SEE THE GUARD INSIDE, DRINKING COFFEE WITH THE SALESPEOPLE, A\nGUARD ENTERS FROM THE REAR OF THE STORE, AND TAKES A COFFEE.\n\nWE SEE IN THE REFLECTION, THE WOMAN IN THE SUNGLASSES AND\nRAINCOAT LOOKING IN THE WINDOW OF THE JEWELRY STORE, SHE ADJUSTS\nHER HAIR, AND TURNS.\n\nANGLE INT THE LIMOUSINE, WHICH IS PULLING UP TO THE CURB.\n\nWE SEE THE WOMAN TURNING AWAY FROM THE JEWELRY STORE, AND NODDING\nAT THE LIMOUSINE.\n\nON THE WOMAN, AS SHE CONTINUES DOWN THE STREET. SHE TAKES A\nLARGE PAPERBAG FROM HER SHOULDERBAG, AND DUMPS IT IN A TRASH\nRECEPTACLE.\n\nIN THE LIMOUSINE BLANE STARTS TO OPEN THE DOOR.\n\n                       MOORE\n               (LOOKING AT HIS WATCH)\n          No wait.\n               (PAUSE)\n          Alright.\n\nANGLE EXT THE LIMO.\n\nBLANE GETS OUT OF THE DRIVER'S SEAT, AND HURRIES AROUND TO OPEN\nTHE REAR DOOR.\n\nMOORE IS HELPED OUT OF THE REAR SEAT, AND HANDED A METAL CANE BY\nBLANE.\n\nTHEY START ACROSS THE SIDEWALK TOWARD THE DOUBLE GRATE OF THE\nJEWELRYSHOP. BLANE HOLDING MOORE'S ELBOW.\n\nAS THEY REACH THE FRONTDOOR. A HEAVYSET MAN ALSO WEARING LEATHER\nGLOVES, CARRYING SEVERAL BEAUTIFULLY WRAPPED PINK PACKAGES\nAPPROACHES THE DOOR.\n\nTHERE IS THE SOUND OF AN EXPLOSION.     THE THREE MEN TURN THEIR\nHEADS.\n\nANGLE.   AT THE DOOR TO THE SHOP.\n\nANGLE THEIR POV, DOWN THE STREET, THERE IS A FIRE RAGING AND A VAST\nCOLUMN OF SMOKE POURING FROM THE TRASH RECEPTACLE.\n\nANGLE\n\nAT THE DOOR TO THE STORE. THE THREE MEN, MOORE AND THE HEAVYSET\nMAN, PINCUS, PUT, STOCKINGMASKS OVER THEIR HEADS.\n\nMOORE TAKES A SMALL ELECTRONIC LOOKING CONTRAPTION FROM HIS\nPOCKET, AND HOLDS IT UP TO THE GRATING, THE GRATING POPS OPEN.\n\nBLANE NODS AT THE TWO OTHER MEN WHO START INTO THE STORE.\n\n                                                                  6.\n\n\nTHEY TAKE OFF THEIR LEATHER GLOVES REVEALING SURGICAL GLOVES\nUNDERNEATH.\n\nANGLE, ON PINCUS, AS HE RESTRAINS MOORE.   BOTH LOOK INSIDE THE\nSTORE.\n\nANGLE, THEIR POV.\n\nON THE COUNTER, ONE CAPPED, UNOPENED COFFEE CONTAINER, AND A YOUNG\nWOMAN, SALESGIRL, STANDING BESIDE THE COUNTER, TERRIFIED.\n\nANGLE\n\nON THE TWO MEN. BEAT. PINCUS REACHES FOR A GUN. MOORE SHAKES HIS\nHEAD NO. THEN MOORE TAKES OFF HIS MASK, AND MOTIONS TO PINCUS\nWHO HESITATES FOR A SECOND, THEN HANDS A SMAL OBJECT TO MOORE.\n\nMOORE PROCEEDS INTO THE STORE.\n\nCAMERA FOLLOWS HIM IN, TO SHOW A GUARD SLUMPED UNCONSCIOUS ON THE\nFLOOR.\n\n                      MOORE (cont'd)\n         ...what is it, I'm a doctor...\n              (HE KNEELS AT THE HEAD OF THE\n               FALLEN MAN)\n         Come here, hold his head up. Now...\n\nTHE YOUNG WOMAN COMES OVER, MOORE TAKES OUT THE OBJECT PINKY\nPASSED HIM, A SMALL CANISTER, AND SPRAYS THE WOMAN IN THE FACE.\nSHE SLUMPS TO THE FLOOR. MOORE MOTIONS PINKY INTO THE SHOP.\n\nANGLE EXT THE STORE.\n\nSEVERAL BYSTANDERS ARE MOVING TOWARD THE FIRE. ONE COMES UP TO\nBLANE, AS IF TO ENTER THE STORE. BLANE PUTS HIS HAND TO HIS EAR,\nAS IF LISTENING TO AN EARPIECE, AND POINTS AT THE FIRE, SHAKING\nHIS HEAD.\n\n                      BLANE\n         Move along, please... This area must be\n         secure while the Secretary's on the\n         street... just move alone...\n\nANGLE INT THE STORE.\n\nPINCUS HAS REMOVED THE COVER FROM HIS PACKAGES, REVEALING THEM TO BE\nA LARGE RECEPTACLE.\n\nCAMERA PANS HIM ACROSS A COUNTER, OVER WHICH COUNTER WE SEE SLUMPED\nTHE FORMS OF THE TWO SALESPEOPLE. PINCUS POINTS AT THE DESK. MOORE\nNODS. IN THE B.G. WE SEE MOORE HIT A BUZZER UNDERNEATH A DESK.\n\nA PANEL IN THE WALL SWINGS OPEN, AND WE SEE A LARGE WALK IN SAFE\nBEHIND, ITS DOOR OPEN.\n\nIN THE FOREGROUND THE HEAVYSET MAN IS SHOVELLING THE CONTENTS OF\nTHE DISPLAY CASES INTO HIS CARRYALL.\n\n                                                                  7.\n\n\nANGLE\n\nON MOORE IN THE WALK IN SAFE, AS HE CONSULTS A SMALL INDEX CARD\nTAKEN FROM HIS POCKET.\n\nHE WALKS TO THE SLUMPED FORM OF AN EMPLOYEE, AND TAKES A KEY FROM\nAROUND HER NECK, MOVES TO THE SAFEBOXES IN THE REAR.\n\nTHE KEYS DO NOT WORK. MOORE NODS AS IF TO SAY, \"WELL, THAT WOULD\nHAVE BEEN TOO EASY...\"\n\nHE UNSCREWS A SECTION OF HIS METAL CANE, AND REMOVES SMALL SURGICAL\nTOOLS, HE OPENS NOW ONE AND NOW ANOTHER OF THE SMALL SAFE BOXES AND\nEMPTIES THEM INTO THE CARRYALL. MOORE WIPES HIS FOREHEAD WITH HIS\nARM AS HE WORKS.\n\n                      HEAVYSET MAN (PINCUS)\n              (VO)\n         ...two minutes...\n\nMOORE NODS.\n\nPINCUS MOTIONS UP, THEY BOTH LOOK UP AT A TELEVISION CAMERA...\n\nANGLE\n\nA BLACK AND WHITE IMAGE--THE TWO MEN--PINCUS IN A STOCKINGMASK,\nMOORE SEEN PLAINLY, AS IF THROUGH THE SURVEILLANCE CAMERA...\n\nANGLE\n\nMOORE NODS, FINISHES SCOOPING THE CONTENTS OF THE BOXES INTO THE\nCASE.\n\nHE LOOKS AT HIS WATCH, AND UP, AGAIN, AT THE TV CAMERA.\n\n                      PINCUS\n         Forty seconds...\n\nMOORE NODS, CAMERA TAKES HIM ALONG A WALL OF CABINETS, HE OPENS NOW\nONE, AND NOW ANOTHER, DISSATISFIED...\n\nANGLE, HIS POV.\n\nAN ELECTRONIC CABINET.   SEVERAL TAPEDECKS, BEHIND A METAL, LOCKED\nGRATING.\n\nTHE TAPEDECK BEHIND IT, ITS LIGHTS GLOWING.\n\n                      PINCUS (cont'd)\n         ...thirty seconds...\n\nANGLE\n\nON MOORE, WHO USES THE TOOLS IN HIS CANE, TO ATTEMPT TO OPEN THE\nGRATING.\n\n                                                                   8.\n\n\nTHE GRATING DOES SO, BUT HIS TOOL SLIPS, SHATTERING THE TAPEDECK\nBEYOND. ITS LIGHTS GO OUT.\n\n                      PINCUS (CONT'D)\n         Ten seconds...\n\nANGLE, ON MOORE, AS HE TRIES, FURIOUSLY, TO DESTROY THE TAPE\nMACHINE, TO GET TO THE TAPE.\n\nANGLE INS.   XCU.   THE TAPE MACHINE.   MOORE SMASHING AT IT.\n\n                      PINCUS (CONT'D)\n         ...that's it, that's gotta be it...\n\nMOORE CONTINUES TRYING TO PRY LOOSE THE TAPE.\n\nANGLE\n\nPINCUS, PULLING MOORE AWAY.   THE HEAVYSET MAN PUTS THE PINK PACKAGES\nCAMOUFLAGE ON HIS CASE.\n\nANGLE, CU ON MOORE, AS HE LEAVES THE BACK ROOM.\n\nANGLE HIS POV.\n\nTHE TAPE MACHINE.\n\nANGLE: IN BLACK AND WHITE, AS IF THROUGH THE VIDEO SURVEILLANCE\nCAMERA--THE MEN LEAVING THE STORE.\n\n                                                    DISSOLVE TO:\n\nEXT THE DECK OF A SLOOP IN THE OCEAN, DAY\n\nA MAGNIFICENT 60-FOOT WOODEN SAILBOAT. A BEAUTIFUL DAY, LIGHT\nCHOP. A FLORID FELLOW IN HIS FIFTIES, SMOKING A CIGAR, AT THE\nWHEEL.\n\nANGLE\n\nA BEAUTIFUL YOUNG WOMAN, THE SAME    WOMAN WE SAW IN THE PREVIOUS\nSEQUENCE, IN SHORTS AND A T-SHIRT,    AND SUNGLASSES, NEAR THE MAST OF\nTHE SAILBOAT. BEYOND HER A MARKER     BUOY AND BEYOND A SMALL HARBOR\nAND MARINA. SHE TURNS TOWARD THE     CAMERA.\n\n                      WOMAN\n              (FRAN. CALLING BACK)\n         Y'got your marker, five, six hundred yards.\n              (PAUSE)\n         Y'might want to start your turn.\n\nANGLE\n\nON THE FLORID MAN, AS HE NODS. AND BENDS TO LOOK UNDER THE SAIL.\nHE IS BLINDED BY A FLASH OF LIGHT. HE SCREWS UP HIS EYES.\n\nANGLE, HIS POV.\n\n                                                                  9.\n\n\nTHE LIGHT, BOUNCING OFF A GLEAMING RAIL.   THE MAN FLINCHES.\n\nANGLE: ON THE BOAT, AS IS COMES UP INTO THE WIND, THE SAIL\nLUFFS, AND THE BOAT BEGINS TO ROCK.\n\nANGLE: FRAN COMING UNDER THE SAIL BOOM, GOES HURRIEDLY, TO THE\nWHEEL, AND MOVES TOWARD THE MAN. PUSHING HIM OUT OF THE WAY, AND\nCORRECTING THE COURSE OF THE BOAT.\n\nANGLE:\n\n                      FLORID MAN\n              (SMILING)\n         ...you lookin to make friends...?\n\n                       FRAN\n         No.   I've got my friends...\n\nTHE MAN MOVES TO THE WHEEL AGAIN, AND FRAN HOLDS HIM OFF.\n\n                      FRAN\n         You put this boat on the rocks, you bought\n         it.\n\n                      FLORID MAN\n         I got the sun in my eyes.\n\nANGLE\n\nAS FRAN TAKES THE WHEEL.\n\nON THE BOAT, AS IT HEELS AND TURNS, PASSING THE RED MARKER BUOY\nINBOUND FOR THE HARBOR.\n\nINT SHIPYARD DAY.\n\nA SMALL MARINA.   THROUGH THE OPEN DOORS WE SEE THE MARINA BEYOND.\n\nGLEAMING, MOLTEN METAL IS BEING POURED INTO A SMALL MOULD BY A\nWORKMAN.\n\nJOE MOORE, NOW WITHOUT MOUSTACHE AND GLASSES, WITH LIGHT, GREYING\nHAIR, IN A CHEAP SPORTCOAT, COMES OVER, AND GIVES THE WORKMAN A FEW\nDIRECTIONS. THE WORKMAN NODS. CAMERA TAKES MOORE PAST SEVERAL\nBOATS IN THE SHED, IN VARIOUS STAGES OF DISASSEMBLY. OUT OF THE\nSMALL SHED, AND TO THE PIER OF THE MARINA, WHERE WE SEE FRAN TYING\nUP THE SLOOP, AND THE FLORID MAN DESCENDING THE GANGPLANK.\n\n                      MOORE\n         What do you think?\n\n                      FLORID MAN\n         Think you're too old for that girl--How'd\n         you ever get a girl like that...?\n\n                                                                10.\n\n\n                      MOORE\n         I won her in a raffle...\n\n                      FLORID MAN\n         No, I'm serious. What's a girl like hh...\n\n                       MOORE\n              (SHRUGS)\n         She's got this \"father\" thing.   You like the\n         boat?\n\n                      FLORID MAN\n         Waal... your price is rather high...\n\n                      MOORE\n         I'll tell you what, then why'nt you go build\n         one...\n\n                      FLORID MAN\n         No offense, no offense, I told you I liked\n         the boat.\n              (TO FRAN)\n         What is he, a touchy fella...?\n\n                      FRAN\n         You have to ask him.\n\n                      FLORID MAN\n              (TO MOORE)\n         What I'd like to do: I'll take'er out\n         again, me and some people... The Weekend...?\n\nFRAN, IN THE B.G. COMES DOWN THE GANGPLANK.\n\n                      MOORE\n         ...we'll be here...\n\nANGLE, ON FRAN, AS SHE TURNS HER BACK ON THE FLORID MAN, AND\nSTANDS CLOSE TO MOORE, HER FACE SURPRISED, MOORE IGNORES HER.\n\n                      MOORE (cont'd)\n         ...we'll be here.\n\n                      FLORID MAN\n         ...I like this boat...\n\n                      FRAN\n         ...Mister Fletcher, tell you what, you put\n         down your deposit, we're gonna fit you one\n         out. Your specs.\n\n                      FLORID MAN\n         I don't want you, fit me one out, I want to\n         buy this one here. This is a hell of a boat.\n\n                      FRAN\n         Well, this one's not for sale.\n\n                                                               11.\n\n\n                      FLORID MAN\n         Everything's for sale. I'm gone tell you\n         what: you want, sell the boat to me, this\n         weekend, you want to name your price, we'll...\n              (HE HANDS FRAN A BUSINESS CARD AND\n               SCRIBBLES ON THE BACK OF IT.)\n\n                       FRAN\n              (SMILES)\n         Well, Mr. Fletcher, this weekend, we're gone\n         on a little trip, but...\n\n                      FLORID MAN\n         How often do you see a live one...? I'm\n         talking cash. You want a premium, I'm going\n         to pay your premium, and I...\n\nFRAN DISASSOCIATES HERSELF FROM THE FLORID MAN (MR FLETCHER)\n\n                         FRAN\n         Excuse me...\n\nSHE WALKS TOWARD MOORE\n\n                      MOORE\n         What do you want me to bring you back?\n\n                      FRAN\n         You just come back... Stay in the shadows.\n\n                      MOORE\n         Everybody's lookin' in the shadows.\n\n                      FRAN\n         Then where's the place to be...?\n\n                      MOORE\n              (AS HE SQUINTS AT THE SUN, HE\n               PUTS ON HIS SUNGLASSES)\n         Place to be's in the Sun...\n\n                      FRAN\n         Well, then, you stay there, then...\n\nBEAT.\n\nHE TAKES HER TO HIM AND KISSES HER.\n\n                      FLETCHER\n              (IN THE B.G. JOCULARLY)\n         ...pretty little girl like that, wouldn't stay\n         away too long...\n\nMOORE EXCHANGES A LOOK WITH FRAN.\n\nSOUND OF A CARHORN.   THEY BOTH TURN.\n\nANGLE, THEIR POV.\n\n                                                                12.\n\n\nA CAB, EXT, THE MARINA.\n\nANGLE\n\nFRAN AND MOORE, HE SHRUGS, STARTS TO TURN.   FRAN PUTS A HAND ON\nHIS ARM.\n\n                       FRAN\n         Stay here.   Let Bobby do it...\n\n                      MOORE\n              (AS HE KISSES HER AGAIN)\n         You take care, Baby. I'll see you tonight.\n\nHE TURNS TOWARD THE CAB.\n\nINT BOXING GYM DAY.\n\nSOUND OF SPEEDBAGS, AND ROPESKIPPING.\n\nTWO YOUNG MEN SPARRING IN THE SMALL, DARK, DIRTY GYM.\n\nANGLE\n\nBLANE, IN HOODED SWEATSHIRT AND JEANS, SMOKING A CIGAR, LOOKS DOWN,\nFROM A WOODEN BALCONY, ON THE GYM BELOW.\n\nBEHIND HIM WE SEE MOORE ENTER THE BALCONY, AND WALK SILENTLY,\nAND STAND TWO FEET BEHIND THE CHAIR. BEAT.\n\n                      BLANE\n         You shouldn't sneak up on a fella like that.\n\n                      MOORE\n         ...what's he likely to do...?\n\n                      BLANE\n         He's likely to do all sorts of unpredictable\n         shit.\n\nBLANE TURNS, AND THE TWO START DOWN THE RICKETY STAIRS TO THE\nMAIN FLOOR.\n\nANGLE\n\nMOORE TURNS. TO SEE TWO WORKMEN UNBOLTING A SMALL METAL PIPE\nSCAFFOLDING, ON WHICH HANG SOME OLD HEAVYBAGS.\n\n                      BLANE (cont'd)\n         Yeah, I was going, put in some new equipment.\n\n                      MOORE\n         What'd you, come into some money?\n\nBLANE SMILES.\n\nON THE MAIN FLOOR OF THE GYM, A WIZENED OLD MAN SITS AT A SMALL\nCOATROOM.\n\n                                                                 13.\n\n\nBLANE GESTURES AND THE MAN THROW HIM AN OLD LEATHER JACKET, AND\nHANDS HIM A LARGE BOXING GYM BAG. MOORE AND BLANE EXIT THE GYM.\n\nEXT 47TH STREET DIAMOND DISTRICT.    NYC DAY.\n\nBLANE AND MOORE WALKING DOWN THE STREET. THEY PASS INTO A BUILDING\nWHICH WE SEE ADVERTISED AS GOLDENSOHNS DIAMOND MART.\n\n                      BLANE\n         Where you goin to go with the gelt?\n\n                      MOORE\n         You know where I'm going.     Me and the girl,\n         gone get on the boat.\n\n                      BLANE\n         You gone go South somewhere... rub yourselves\n         all over, Cocoa butter...\n\n                      MOORE\n         ...that's right.\n\n                      BLANE\n         Get one of them cocker spaniel dogs, pull down\n         your bathingsuit...\n\n                      MOORE\n         ...that's right...\n\n                      BLANE\n         ...stick your white ass out at the world...\n\n                      MOORE\n         I worked for it.\n              (PAUSE)\n         What're you gonna do...?\n\n                      BLANE\n         I'm gonna open a carwash, n'torch it for the\n         insurance... hold on a second...\n\nANGLE THEIR POV.\n\nTWO UNIFORMED POLICEMEN, WALKING DOWN THE STREET, OUT OF A DELI.\nBLANE AND MOORE TURN.\n\nBEAT. THE POLICE TURN AWAY FROM BLANE AND MOORE.     BLANE AND MOORE\nPROCEED.\n\nANGLE INT GOLDENSHON'S DIAMOND MART.\n\nBLANE AND MOORE ENTER. BLANE HOLDS THE DOOR OPEN FOR AN EXITING\nMATRON. THEY PROCEED DOWN THE AISLES OF STALLS AND JEWELS.\n\nCAMERA TAKES THEM TO A HEAVYSET FELLOW STANDING IN FRONT OF A DOOR.\n\n                                                               14.\n\n\nINT OFFICE SUITE DAY.\n\nTHE GYMCASE IS PLACED DOWN ON A HEAVY DESK. MOORE SITS IN A CHAIR,\nBLANE STANDS BEHIND HIM IN THE SMALL SPARSELY FURNISHED ROOM, ACROSS\nFROM BERGMAN, A FELLOW WHO LOOKS LIKE A GANGSTER. BERGMAN OPENS THE\nCASE.\n\nANGLE INS: THE CASE IS FULL OF OLD BOXING EQUIPMENT--GLOVES, A\nSPEED BAG, ETC. A HAND COMES INTO THE SHOT, TAKES OUT A KNIFE, AND\nRIPS OPEN THE SPEEDBAG--WE SEE THE GLINT OF JEWELS INSIDE. THE\nKNIFE PROCEEDS TO OPEN OLD BOXING GLOVES, ETC. ALL ARE FULL OF\nJEWELS.\n\nANGLE\n\nTHE MEN AT THE DESK.    SOUND OF A DOOR OPENING.\n\nIN THE B.G. A DARK, HANDSOME YOUNG MAN IS SEEN OPENING THE DOOR TO\nTHE OUTSIDE.\n\nBERGMAN MOTIONS HIM TO TAKE THE CASE AND LEAVE, THE MAN (BELLA) NODS\nAND BEGINS TO DO SO.\n\n                      BERGMAN\n              (INTRODUCING HIM)\n         My nephew, Jimmy.\n\n                      MOORE\n         I met him a long time ago.\n              (NODS)\n\n                        BERGMAN\n         Did you...?\n\n                      MOORE\n         Yeah, I think I did.\n\nBEAT.\n\nBLANE AND MOORE EXCHANGE A LOOK, THE DARK YOUNG MAN IS HANDED THE\nGYMCASE. HE CLOSES THE DOOR LEAVING BERGMAN, BLANE, AND MOORE\nALONE. MOORE NODS, TO INDICATE, \"IT'S ALRIGHT,\" AND BLANE BEGINS,\nRELUCTANTLY, TO LEAVE.\n\n                      BERGMAN\n         You should of shot the girl.\n\n                       MOORE\n              (SHRUGS)\n         You know, you're right...\n\nBERGMAN SHRUGS, AS IF TO SAY \"WELL, THAT'S WATER UNDER THE BRIDGE.\"\n\n                      BERGMAN\n         On the other thing, Good News! We got the\n         go ahead, we got a date. I got a firm date on\n         the swiss thing.\n\n                                                                 15.\n\n\n                       MOORE\n         I'm burnt.   They got my picture.\n\n                       BERGMAN\n              (SHRUGS)\n         They got your picture in drag.     Witcher\n         warpaint on.\n\n                      MOORE\n              (SHAKES HIS HEAD)\n         --I got to go.\n\n                      BERGMAN\n         You goin down, a Body Shop?\n              (HE RUNS HIS HANDS OVER HIS\n               FACE.)\n\n                      MOORE\n         Yeah, I'm gonna have'em pound the dents out.\n\n                      BERGMAN\n         ...old as you are, it's a good deal.\n\n                      MOORE\n         Waal, they're honorable scars.\n\n                      BERGMAN\n         That they are and indeed they are.     How you\n         doing, Bobby?\n\n                      BLANE\n         Well, you're looking at it.\n\n                      BERGMAN\n         Anything you guys want, you're here? Y'want\n         to get a present for the Little Lady...\n\nTHERE IS A KNOCK AT THE DOOR. BELLA, THE YOUNG HANDSOME MAN\nENTERS WITH THE GYM BAG AND A PIECE OF PAPER, AND WALKS TOWARD\nBERGMAN. BERGMAN TAKES THE PAPER, AND SMILES.\n\n                      BERGMAN\n         No, you're the Boss Hog, Joe.\n\n                      MOORE\n         Kind of you to say so.\n\n                      BERGMAN\n              (OF THE SLIP OF PAPER)\n         Nobody... gets the goods like you...\n\n                      MOORE\n         Anybody can get the goods, the tough part's,\n         getting away.\n\n                      BERGMAN\n         Uh huh.\n\n                                                               16.\n\n\n                      MOORE\n         Plan a good enough getaway, you could steal\n         Ebbetts Field.\n\n                      BERGMAN\n         Ebbet's Field's gone...\n\n                      MOORE\n         What'd I tell ya...?\n              (BERGMAN HANDS HIM A SLIP OF\n               PAPER. OF THE SLIP OF PAPER)\n         Higher than the estimate.\n              (HE PASSES THE PAPER TO BLANE)\n\n                      BERGMAN\n         And half of that's yours.     You n'your team.\n\n                      MOORE\n         Yeah, why're you telling me that?\n\n                      BERGMAN\n         ...I told you we're on for the \"other\"\n         thing? The Swiss thing?\n\n                      MOORE\n         ...why're you telling me that, Bill? That\n         half of it's mine. I know half of it's\n         mine. Because, you'll remember, me and my\n         crew? Went in there and got it.\n              (PAUSE)\n\n                      BERGMAN\n         ...the other thing?\n\n                      MOORE\n         ...you remember that?\n\n                      BERGMAN\n         It's the shot of the century.\n\n                      MOORE\n         Yeah--well, it's a shame...\n\n                      BERGMAN\n         I'm locked into it. It's such a beautiful\n         deal, Joe... we waited so long.\n\nHE PUTS HIS ARM AROUND MOORE, AND WALKS HIM INTO THE OUTER OFFICE,\nWHERE WE SEE BLANE AND BELLA AND SEVERAL BODYGUARD TYPES.\n\n                      BERGMAN (CONT'D)\n         ...I put myself, n'my friends in hock, set\n         the deal up...\n\n                      MOORE\n         I need my money. I owe the crew...\n              (PAUSE)\n         I owe my crew, Bill...\n\n                                                             17.\n\n\n                      BERGMAN\n         If it was me...\n\n                      MOORE\n         Yeah, if it was you n'if it was me.     I owe my\n         crew.\n              (PAUSE)\n         And I got to go.\n              (PAUSE)\n         I got to get outta town.\n\n                      BERGMAN\n         You should of popped the girl... Look:\n              (HE PICKS UP A SHEAF OF PAPERS\n               FROM HIS DESK.)\n         This Swiss thing? After how long we\n         waited...?\n\n                      MOORE\n         Woulda shoulda coulda.\n\n                      BERGMAN\n         ...I was a publisher man, I'd publish the\n         plans... it's the Mona Lisa.\n\n                      MOORE\n         You're too kind.\n\n                      BLANE\n         Why don't you publish the plans?\n\n                      BERGMAN\n         Yeah, no, I'm saying, that's what I would do,\n         f'I was in the book business. Unfortunately,\n         I'm a thief, so, I have to do that thing.\n         You understand... Joe:\n\n                      MOORE\n         What is it I understand...?\n\n                      BERGMAN\n         You understand my position.\n\n                      MOORE\n         Here's mine? I did the job. Me and my\n         crew. We brought you the swag, we're going to\n         take our cut.\n\n                      BERGMAN\n         Well, look here, it's the Golden   Rule. You\n         know the Golden Rule. Whoever's    got the\n         Fucken Gold, he gets to make the   Rule... Huh?\n              (PAUSE)\n         Huh...? Look: The normal course      of events...\n\nANGLE\n\nON MOORE, AS HE EXCHANGES A LOOK WITH BLANE\n\n                                                                   18.\n\n\nTHEY LOOK AT THE GYMBAG.      BLANE STARTS TO EDGE TOWARD THE GYMBAG.\n\n                         BERGMAN (cont'd)\n            ...let's all remember where we are...\n\n                         BLANE\n                 (AS HE MOVES TOWARD THE BAG)\n            ...that's very literary.\n\nBELLA PUSHES HIM BACK.\n\n                         BELLA\n            Look here, Pal... Look here, Pal... You're\n            the help...\n\n                           BLANE\n            I'm what...?\n\n                           BELLA\n            ...you're...\n\n                         BLANE\n            I'm the \"help,\" motherfucker? You were\n            sitting behind a desk, we were on the street,\n            it seems to me. Furthermore:\n\nANGLE, HIS POV, INSERT, THE GYMBAG.      WE SEE ONE OF THE BODYGUARDS\nMOVE IN FRONT OF IT.\n\nANGLE\n\nMOORE AND BLANE AS BELLA PUSHES BLANE AWAY FROM THE GYMBAG.      BLANE\nPUNCHES HIM, HE FALLS TO THE GROUND. BLANE PULLS A PISTOL.\n\nONE OF    THE THUGS NEXT TO BLANE PULLS A PISTOL, AND POINTS IT AT\nBLANE    WHO BATS IT OUT OF THE WAY. THE GUN DISCHARGES. BLANE STEPS\nUP TO    THE THUG AND HITS HIM IN THE HEAD WITH THE GUNBUT. THE THUG\nFALLS    TO THE FLOOR.\n\n                         BLANE (cont'd)\n                 (AS HE MOVES TOWARD THE GYMBAG)\n            You wanna play \"O.K. Corral?\" Is this the\n            plan of the Day? You wanna go dress warmly,\n            n'go play Outside? Go for it. Go for it,\n            motherfucker: you know where I am, I'm right\n            here...\n                 (PAUSE)\n\n                         BERGMAN\n            Yeah. You're a pitbull.\n                 (TO MOORE)\n            Your friend's a pitbull.\n\n                         MOORE\n            What do you want, we're supposed to do, sit\n            back, put our feet up while you fucken rob\n            me?\n\n                                                          19.\n\n\n                      BERGMAN\n         I'm in HOCK to my PEOPLE for the TOYS, all the\n         TOYS YOU told me you need, do the Other\n         thing...\n\n                        MOORE\n         I got to go.\n\n                      BERGMAN\n         While I what? Go WEE WEE all the way home to\n         my ? Go WEE WEE all the way home to\n         my Backers? You told me this:\n              (HE HOLDS OUT HIS HANDS FOR A\n               LIST)\n         the Truck, two Trucks, the stuff the Train,\n         the plans? ... you told me, \"Go Out, Spend\n         the Money,\" I did. Now:\n\n                      MOORE\n         What do you want from me?   They got my face\n         on a Cereal box...\n\n                      BERGMAN\n         I want you do do the Swiss job.\n              (PAUSE)\n\n                      MOORE\n         Gimme our cut, we worked for, my crew, we do\n         the Swiss Job.\n\n                      BERGMAN\n         Well, now, that's bullshit, Joe, you know\n         that, you just tol me you're goin travelling--\n         I give you the Money now, and you're gone.\n         You gone play me for some kind of sucker? The\n         other job. It's set up.\n\n                      BLANE\n         You trine to play us for, you over-the-hill,\n         short-weight motherfucker...\n\n                      BERGMAN\n              (TO MOORE)\n         ...I don't think your friend likes me...\n\n                      BLANE\n         Like you? I'd like you to spend the rest of\n         your life with me... RIGHT NOW...\n              (HE DRAWS A PISTOL AND POINTS IT\n               AT BERGMAN)\n         RIGHT NOW, MOTHERFUCKER. HERE YOU ARE: YOUR\n         WEIGHT AND FATE. How 'bout that... how\n         'bout that...?\n\nSEVERAL OF THE THUGS DRAW THEIR WEAPONS.\n\n                      BERGMAN\n         ...alright... alright... let's just...\n\n                                                                  20.\n\n\n                      BLANE\n         How about that, n' we'll let someone else\n         clean up...\n\nBLANE MOVES TOWARD THE GYMBAG.\n\n                      BLANE (cont'd)\n         How about them rosy'red apples...?\n\n                      MOORE\n         Bag's empty...\n              (PAUSE)\n         The bag's empty, Billy...\n              (PAUSE)\n         Put the bag down, it's empty...\n\nBLANE OPENS THE GYMBAG AND WE SEE THAT IT IS EMPTY--HE LOOKS TO\nMOORE FOR DIRECTIONS.\n\n                      MOORE (cont'd)\n         Alright.\n\n                      BLANE\n         What?\n\n                      MOORE\n         I said alright.\n              (PAUSE)\n\n                      BERGMAN\n         ...you'll do the Swiss Job?\n\n                      MOORE\n         No.\n\n                      BERGMAN\n         Well, then, it's not alright.     What are you\n         telling me...?\n\n                      MOORE\n         I'm telling you I'll think about it.\n              (PAUSE)\n         Lemme think about it.\n\nTHE THUG STARTS TO RISE FROM THE FLOOR.    BLANE ADDRESSES HIM.\n\n                      BLANE\n         ...don't get up.\n\n                      BERGMAN\n         You think about it, Joe. I got your money\n         sitting for you, right here. You do the job,\n         and I swear to you...\n\nBLANE AND MOORE BACK OUT OF THE ROOM.\n\n                                                             21.\n\n\nINT BEDROOM NIGHT. MOORE AND FRAN, ON THE BED. WRAPPED IN A SHEET.\nMOORE IS STANDING AT THE WINDOW, WEARING PAJAMA BOTTOMS.\n\nANGLE HIS POV.\n\nHIS SAILBOAT, IN THE MARINA BELOW.\n\nANGLE, ON MOORE, AS HE TURNS BACK TO FRAN.\n\n                        FRAN\n         ...alright:    what if we...\n\nMOORE HOLDS UP HIS HAND FOR HER TO BE QUIET.    BEAT.\n\n                        MOORE\n         I'm sorry...\n\n                      FRAN\n         ...what do you tell me?     What is it you tell\n         me?\n\n                      MOORE\n         What is it I tell you?\n\n                      FRAN\n         \"Any situation, stand it on its head.\"\n\n                      MOORE\n         Izzat right...\n\n                      FRAN\n         So:  stand it on its head.\n              (PAUSE)\n         What if we...\n\nMOORE INTERRUPTS.\n\n                      MOORE\n         Sell the beat.\n              (PAUSE)\n         Call the guy, sell the boat.\n\nANGLE ON FRAN AS SHE DIALS THE PHONE.\n\n                      MOORE (cont'd)\n         You quote him our figure, sell it to him for\n         cash.\n\n                        FRAN\n         For cash?\n\n                      MOORE\n         That's the sweetener.\n\n                      FRAN\n         I don't get it.\n\n                                                                 22.\n\n\n                      MOORE\n         You say \"cash,\" he knows we're hungry. He'll\n         counter ten, twenny percent less, you kick\n         around, and accept it.\n\n                      FRAN\n         Where's he gonna get the cash at night?\n\n                      MOORE\n         Let him get it tomorrow.   You bring him the\n         title for the boat.\n\n                      FRAN\n         And you?\n              (ON THE PHONE)\n         Hello, Mr. Fletcher...? Could you, I'm\n         looking for Mr. Robert Fletcher.\n              (PAUSE)\n         Would you tell him Fran, from Moore Marine.\n              (SHE LOOKS AT MOORE)\n\n                      MOORE\n         ...I'll meet you in Mexico.\n\n                      FRAN\n         How're you going to Mexico...?\n\n                      MOORE\n              (PAUSES, AS IF AT THE OBVIOUS)\n         ...I'm taking the boat.\n              (BEAT)\n         I'm not proud...\n\n                      FRAN\n         F'you're taking the boat, Baby, take the boat\n         tonight...\n\n                      MOORE\n         I ain't going til I make sure we're goin get\n         the money...\n\nFRAN GESTURES FOR HIM TO BE QUIET, AS THERE IS SOMEONE ONE THE\nLINE.\n\n                      FRAN\n         Well, would you tell him...\n\n                      MOORE\n         ...I can't go down there with nothing...\n\n                      FRAN\n         What're you gonna do about the Other Guys?\n\n                      MOORE\n         We're gonna play some ringolevio.     I'm gonna\n         need your help--Look here:\n\n                                                               23.\n\n\nINT NYC DELICATESSEN DAY\n\nMIDTOWN BUSY DELI. PINCUS AND BLANE SEATED AT A BOOTH IN THE REAR\nOF THE DELI, DRINKING COFFEE.\n\n                      PINCUS\n         You know, in many ways, it isn't their\n         arrogance that hurts, it's the money.\n\n                        BLANE\n         Yeah?    What were you gonna do with the money?\n\n                      PINCUS\n         I was gonna buy a scooter for my niece. You\n         know, this's the goddamndest thing I ever saw:\n         They got his face on tap, he's got to Steal\n         Away like the Arabs.\n\n                      BLANE\n         ...with what?\n\n                      PINCUS\n         Well, what about Times Two. If they stiffed\n         him on Monday, what're they gonna do on\n         Wednesday...\n\n                        BLANE\n         Joe?    He's got something in reserve.\n\nPINCUS SHRUGS, AS IF TO SAY \"MAY IT BE SO.\"\n\n                      BLANE (cont'd)\n         He's got something in the Hole. He wouldn't\n         change his mind without a diversion.\n\n                      PINCUS\n         ...may it be so.\n\n                      BLANE\n         ...and a back-up plan...\n\nANGLE, ON BELLA, WHO IS WALKING BACK THROUGH THE DELI, TOWARD THE\nBOOTH HOLDING PINCUS AND BLANE.\n\nBELLA STOPS, SHEILDED BEHIND SOME COATS.\n\nANGLE HIS POV.\n\nTHE OTHER TWO MEN IN THE BOOTH.\n\n                      PINCUS (cont'd)\n         ...b'cause, b'cause I've spent my cut, the\n         last thing...\n\n                      BLANE\n         ...you hold tight with the Crew...\n\n                                                                  24.\n\n\n                      PINCUS\n         ...I hold tight with the Crew, the Crew holds\n         tight with me, is all I'm...\n\nBLANE PERCEIVES BELLA, AND PINCUS STOPS TALKING.\n\nBLANE LOOKS UP, ALL TURN.\n\nANGLE, THEIR POV.    BELLA, AT THE BOOTH.\n\n                      BELLA\n         How're we all today?\n\n                      BLANE\n         F'we got somewhere to go, let's go.\n\nANGLE\n\nTHE GROUP IN THE BOOTH RISES, BELLA MOTIONS THEM OUT OF THE FRONT\nOF THE STORE.\n\nANGLE EXT 47TH STREET, DIAMOND DISTRICT, DAY.\n\nTHE GROUP EMERGES FROM THE DELI.\n\nANGLE INT.   A GOLD AND JEWELRY SHOWROOM.\n\nBERGMAN BEHIND THE COUNTER, TALKING TO A MAN AT AN OPEN SAFE, THE\nMAN IS HANDLING SEVERAL GOLD COINS.\n\nANGLE INS.\n\nBERGMAN'S HAND, HOLDING THE COINS.\n\nANGLE\n\nBERGMAN, LOOKS UP.\n\nANGLE HIS POV.\n\nACROSS THE STREET, THE GROUP, AND BELLA, MOTIONING MOORE ACROSS THE\nSTREET.\n\nANGLE, EXT, THE GOLD AND JEWELRY SHOWROOM.   BERGMAN COMES OUT,\nCOMING ACROSS 47TH STREET.\n\nIN THE B.G. WE SEE A BUNCH OF SCANDINAVIAN LOOKING TOURIST,\nEACH WITH HIS MAP, CAMERA SLUNG AROUND THE NECK, ET CETERA, WALKING\nDOWN THE STREET.\n\nWE SEE BERGMAN, CROSSING THE STREET, LOOKING AROUND.\n\nANGLE\n\nPINCUS, BELLA, AND BLANE, BLANE IS SCANNING THE STREET, HE TURNS\nBACK IN THE DIRECTION OF BERGMAN, AND NODS.\n\nANGLE HIS POV\n\n                                                               25.\n\n\nBEHIND BERGMAN, ONE OF THE TOURISTS DETACHES HIMSELF FROM THE GROUP\nAND WALKS UP BEHIND BERGMAN. CAMERA TRACKS WITH THEM, AS MOORE\n(THE TOURIST) TAKES BERGMAN'S ARM, AND THEY WALK DOWN 47TH STREET.\n\nBEAT\n\n                        MOORE\n         Alright.\n\n                      BERGMAN\n         You'll do the job?\n\n                      MOORE\n         That's right.\n\n                      BERGMAN\n         I'm sorry I put you in a position.\n\n                      MOORE\n         It's very sporting of you to say so.\n\n                        BERGMAN\n         Well...\n\n                      MOORE\n         I'm going to need some walking-around money.\n              (BERGMAN NODS)\n         And I'm going to need my men's share, on the\n         last job.\n\n                      BERGMAN\n         That's not unreasonable.\n\n                      MOORE (cont'd)\n         Give it to me\n               (HE HOLDS OUT HIS HAND.)\n\n                        BERGMAN\n         ...now?\n\n                      MOORE\n         ...you got it in your pocket.\n\nBERGMAN SIGHS, TAKES OUT AN ENVELOPE, AND SHOWS IT TO MOORE.\n\n                      BERGMAN\n         ...you're ahead of me every turn.    How about\n         that.\n\n                        MOORE\n         ...stunning.\n\n                      BERGMAN\n         ...the date holds, you got the shipment on the\n         fourteenth.\n\n                      MOORE\n         ...how do I insure my cut?\n\n                                                               26.\n\n\n                      BERGMAN\n         I swear to you...\n\n                      MOORE\n         ...you lost your amateur standing. Here's\n         what the thing is: I go with the gold.\n              (PAUSE)\n         I go with the gold, or there's no deal.\n         I take my half, you take your half on site,\n         we're done.\n              (PAUSE)\n\n                        BERGMAN\n         ...so be it.\n\n                       MOORE\n         Now:   what's your little surprise.\n\nANGLE, OVER THEM, ONTO THE GROUP OUTSIDE THE DELI, AS WE SEE THAT\nTHEIR WALK HAS TAKEN MOORE AND BERGMAN AROUND THE BLOCK.\n\n                      BERGMAN (cont'd)\n              (MOTIONING AT BELLA AS THEY JOIN\n               THE OTHER GROUP)\n         ...my boy goes on the job with you.\n              (PAUSE)\n\n                      MOORE\n         ...he's got terrible manners.\n\n                      BERGMAN\n         Nobody's perfect.\n              (PAUSE)\n\nTHE TWO HAVE WALKED UP TO PINCUS AND BLANE.\n\n                      MOORE\n              (TO BERGMAN)\n         Gettim over here...\n              (BERGMAN MOTIONS TO BELLA)\n\n                      BELLA\n              (PAUSE)\n         ...I'm sorry for what I said.\n\n                      BLANE\n         ...what'd he say...?\n\n                      BELLA\n              (PAUSE)\n         I'm sorry for what I said.\n              (PAUSE MOORE MOTIONS TO BLANE)\n\n                      BLANE\n         Well, you were prolly just overcome by the\n         heat of the moment. Is that the thing?\n\n                                                              27.\n\n\n                      BELLA\n         ...that's right.\n\n                      MOORE\n         Okay, so You called us one, we called you\n         one. The way you get along's you're gonna go\n         along.\n              (TO BERGMAN)\n         Okay, we're done negotiating, gimme the money\n              (BERGMAN HANDS HIM AN ENVELOPE)\n         I'll see you on the fourteenth...\n\nMOORE AND BLANE START TO WALK AWAY.\n\n                      BLANE\n         You going to take that lame onna job?\n\n                      MOORE\n         I'll tell you what, you make the decisions,\n         and I'll bitch at you. It's Fun to Play\n         Pretend!\n\n                      BLANE\n         You going to roll over for these guys, I got\n         to walkaway... It's one thing, put your head\n         in the Lion's Mouth. It's another thing,\n         put your head in the Lion's Mouth and shoot\n         yourself. I...\n\n                      MOORE\n         You do whatever the fuck you have to do...\n\nMOORE STARTS TO WALKAWAY FROM THE GROUP, FOLLOWED BY BLANE.\n\n                      MOORE\n         You want to show me another way?\n\n                      BLANE\n              (OF BELLA, AS HE STOPS MOORE)\n         ...why does he go with the gold?\n\n                       BERGMAN\n         Y'ever split a piece of cake? One kid gets\n         to cut the cake, the other gets to choose.\n         We're gonna get the gold. Your guy gets to\n         go, my guy gets to go.\n               (PAUSE)\n\n                      MOORE\n         Then we go together.\n\n                      BERGMAN\n         You go with the gold. That's the deal.\n              (PAUSE. BLANE AND MOORE START TO\n               WALKAWAY)\n\n                      BLANE\n         You're losing a step, Joey.\n\n                                                                 28.\n\n\n                       MOORE\n         Zat so?\n\n                      BLANE\n         Time was, you wuun't of asked him.\n\n                      MOORE\n         Yeah, well, the time was I was the Law West\n         of the Pecos.\n\n                       BLANE\n         And now...?\n\n                      MOORE\n         And now the Time Was, I got to get out of\n         Town.\n\nHE TURNS BACK, HANDS THE ENVELOPE TO PINCUS.\n\n                      MOORE (cont'd)\n              (SOTTO, TO PINCUS)\n         Okay it's on.\n\n                      PINCUS\n              (AS HE TAKES THE ENVELOPE)\n         I'll take care of it.\n\nPINCUS TURNS BACK TO EXCHANGE A PRIVATE WORD WITH MOORE.\n\n                      MOORE\n         You wanna wash any laundry out inna\n         street...? ...you said you were gone take\n         care of it, take care of it.\n              (PAUSE, WHILE PINCUS HESITATES)\n         ...are you in or out...?\n\nPINCUS EXCHANGES A LOOK WITH BLANE.    SHRUGS, AND NODS AND WALKS\nOFF.\n\nMOORE, TO BLANE.\n\n                      MOORE (cont'd)\n         Is he going soft on me...?\n\n                      BLANE\n              (PAUSE)\n         He'd never go soft on you, Joey...\n\n                      MOORE\n         Well, then. What's the thing?     Am I missing\n         something...?\n\n                      BLANE\n         He's just countin' the tricks, and the tricks\n         don't add up. Tricks don't add up. These\n         guys. You get the gold, they never let you\n         walk away wi... why would you want to...\n              (PAUSE.\n                      (MORE)\n\n                                                               29.\n\n\n                      BLANE (cont'd)\n               RECOGNITION LIGHTS UP BLANE'S\n               FACE)\n         We ain't doin the job. Izzat it? You're just\n         going to take the up front money, walk away.\n              (PAUSE)\n\n                      MOORE\n         I got to Bobby...\n\n                      BLANE\n         I know you do.\n\n                       MOORE\n         Tick tock.\n\n                       BLANE\n         No, I know.\n\n                      MOORE\n         The cops got me on tape.   I got to go...\n              (PAUSE)\n\n                      MOORE\n         But everybody gets his cut from the Jewelry\n         store.\n\n                      BLANE\n         Yeah, thanks, but after which, what're you\n         going to live on?\n\n                      MOORE\n         I'm trine a figure out a way, get somebody,\n         throw me inna briar patch.\n\nMOORE TURNS BACK TO BELLA.\n\n                      MOORE (cont'd)\n         Awright, you want to go to work...?\n\nBELLA WALKS UP TO THE GROUP.\n\nBLANE SEES SOMETHING OVER MOORE'S SHOULDER.\n\nANGLE HIS POV.\n\nTHE TWO POLICEMEN WE SAW EARLIER, WALKING THEIR BEAT, ONE LOOKS IN\nMOORE'S DIRECTION, AND DOES A DOUBLE TAKE, AND THEN KEEPS LOOKING\nAT MOORE.\n\nANGLE\n\nON MOORE AND BLANE, MOORE STARTS TO HALF-TURN, BLANE PUTS HIS ARM\nON MOORE'S ELBOW, AND STARTS TO WALK HIM AWAY.\n\n                      BLANE\n              (SOTTO)\n         ...just keep walking...\n\n                                                               30.\n\n\nBLANE TURNS BACK, AND LOOKS AT PINCUS, WHO STANDS IN THE MIDDLE OF\nTHE BLOCK, HE TUGS ON HIS EAR, AND INCLINES HIS HEAD SLIGHTLY TOWARD\nTHE TWO POLICEMEN, ONE OF WHOM IS WALKING, TENTATIVELY, TOWARD\nMOORE.\n\nANGLE, ON PINCUS, WHO IS TURNED AWAY.\n\nANGLE\n\nON BLANE, WHO IS STILL TRYING TO SIGNAL PINCUS.\n\nHE SHAKES HIS HEAD MINUTELY, AND TURNS BACK TO MOORE.\n\n                      BLANE (cont'd)\n              (SOTTO)\n         ...walk on... just walk on...\n\nANGLE\n\nON THE TWO POLICEMEN, WHO ARE WALKING TOWARD BLANE AND MOORE, WE\nSEE MOORE DETACH HIMSELF FROM BLANE, AND CONTINUE WALKING, TURNING\nTHE CORNER.\n\nANGLE\n\nON BLANE, AS HE WALKS UP TOWARD A PASSERBY. HE TAKES A PIECE OF\nPAPER OUT OF HIS POCKET, AS IF LOOKING FOR DIRECTIONS.\n\n                      BLANE (cont'd)\n         ...excuse me... excuse me...\n\nTHE PASSERBY IS CROSSING THE STREET, BLANE STEPS OUT INTO THE\nSTREET. WE HEAR THE BLARING OF CAR HORNS, AND THE SQUEAL OF BRAKES.\n\nANGLE\n\nON BLANE, AS A CAR RUNS INTO HIM.\n\nBLANE HITS THE HOOD OF THE CAR.\n\nANGLE\n\nON HIS HAND, AS IT COMES DOWN, WITH A THUMP, ON THE HOOD OF THE\nCAR.\n\nHE ROLLS OFF THE HOOD, AND ONTO THE GROUND.\n\nANGLE\n\nON THE TWO POLICEMEN, TURNING TO THE SOUND OF THE ACCIDENT.\n\nIN THE B.G. WE SEE MOORE, TURNING THE CORNER.\n\nANGLE\n\nON BLANE, ON THE GROUND, HOLDING HIS LEG.\n\n                                                                 31.\n\n\n                      BLANE (cont'd)\n         ...oh god... oh god...\n\nANGLE ON THE CROWD OF ONLOOKERS, AS THE POLICEMEN KNEEL TO BLANE.\nBLANE STARTS TO HIS FEET. IN THE BACK OF THE CROWD WE SEE PINCUS,\nWHO LOOKS ON FOR A SECOND, AND THEN MELTS AWAY.\n\nANGLE\n\nSIDEWALK, PASSERBY.   MOORE WALKING IN THE STREET.   PINCUS COMES UP\nBEHIND HIM.\n\n                      PINCUS\n              (SOTTO)\n         ...he's okay.\n\n                      MOORE\n         Yeah, well, you know, that was his road\n         game.\n\n                      PINCUS\n         He's too old for that.\n\n                       MOORE\n              (SHRUGS)\n         It's his job. Let's get to work.\n\nINT SMOKEY WORKINGMAN'S BAR NIGHT.\n\n                      FRAN\n              (IN BLUE JEANS, ON A PAYPHONE)\n         ...an if, an if... well, why didn't you, no,\n         wait a sec... wait a second, f'it's about\n         your wife, F'It's about your wife, why\n         din'tcha... no, wait a... will you WAIT, what\n         I'm saying, if the whole thing is about\n         your wife, you know what, you know what, the\n         hell with it.\n\nSHE HANGS UP, SHE GOES TO THE BAR, TWO PACES AWAY, AND SITS NEXT\nTO A MIDDLEAGED WOMAN.\n\n                      FRAN (cont'd)\n              (TO BARTENDER)\n         Could I have another, please...?\n\n                      BARTENDER\n         Hope you're not driving tonight.\n\n                      FRAN\n         Well, I hope I am driving tonight, and I run\n         into some fucked abutment IF THAT'S WHAT\n         THEY'RE CALLED, and\n              (HE GIVES HER A DRINK)\n         Thank you...\n              (SHE DRINKS)\n\n                                                                32.\n\n\n                       MIDDLE AGED WOMAN\n          ...take it easy, Baby... stuff'll eat your\n          stomach lining...\n\n                       FRAN\n          Yeah, but I get to drink it first...\n               (SHE SHAKES HER HEAD)\n          Can I ask you something...\n\nANGLE.   ON BELLA, SITTING IN THE BACK OF THE BAR, WATCHING FRAN.\n\nHE TAKES OUT A POLAROID CAMERA AND TAKES A PICTURE.\n\n                       WAITRESS\n               (TO BELLA, AS SHE PUTS DOWN A\n                DRINK NEXT TO HIS EMPTY GLASS)\n          ...see anything you like...?\n\nEXT RAILROAD OVERPASS. DAY.\n\nA STATIONWAGON, PARKED BY THE SIDE OF THE ROAD.\n\nANGLE INT.   BELLA AND BLANE AND PINCUS, IN THE STATIONWAGON.\n\nBLANE HOLDS A NOTEPAD, AND IS TALKING TO BELLA, WHO IS TAKING OUT A\nMOBILE PHONE.\n\n                       BLANE\n               (AS HE LOOKS AT A   POLAROID PICTURE\n                OF THE WOMAN WE   SAW IN THE BAR)\n               (READING OFF THE   NOTEPAD)\n          ...what's the woman's   name...?\n\n                        BELLA\n          Croft.   Betty Croft.\n\n                       BLANE\n          ...and she's on what shift...?\n\nANGLE, ON PINCUS, AS HE DIALS HIS NUMBER, AND MOTIONS BLANE TO BE\nSILENT. HE LOOKS AT HIS WATCH.\n\n                       BELLA\n               (RECITING)\n          She's on the swingshift. She's got two kids.\n          She's got an ulcer. Betty Croft...\n               (TO PHONE)\n          I got to report a Bomb throat, I got to\n          report, you've got a bomb in...\n\nANGLE\n\nUNDERNEATH THE OVERPASS.   WE SEE THE HIGHWAY ABOUT, AND THE\nSTATIONWAGON.\n\n                                                               33.\n\n\nMOORE, WEARING A HARDHAT, AND CARRYING A CLIPBOARD, IS PACING OFF\nTHE TRACK. HE GLANCES AT HIS WATCH. NODS. KEEPS PACING. HE\nMAKES A NOTATION IN HIS CLIPBOARD.\n\nANGLE\n\nMOORE, CLIMBING THE BANK, UP TO THE ROADGRADE, TOWARD THE\nSTATIONWAGON.\n\nANGLE, INT THE STATIONWAGON.    BLANE AND BELLA.\n\n                      BELLA\n         What's the story on your pal?\n\n                      BLANE\n         He was born, he suffered, he died.\n              (PAUSE)\n\n                      BELLA\n         How long's he been with the girl?\n\n                      BLANE\n         What business is it of yours?\n\n                      BELLA\n         How long's he been with her...?\n\n                      PINCUS\n         How long is a chinaman's name.\n              (PAUSE)\n\n                      BELLA\n         Can he do the thing?\n\n                      BLANE\n         He was doing the thing before you were born.\n\n                      BELLA\n         Well, you see, that's what, that's what\n         troubles me.\n              (PAUSE)\n\n                      BLANE\n         Maybe you wanna pray about it.\n\n                      BELLA\n         No, I'm not a religious man.\n\n                      BLANE\n         That's a shame. Who's got the Uniforms...?\n\n                      PINCUS\n         ...I got em...\n\n                      BLANE\n         ...the rental trucks...?\n\n                                                              34.\n\n\nMOORE WALKS UP TO THE CAR, AND HOLDS A CONFERENCE, LEANING IN THE\nWINDOW. HE STARTS TO SPEAK, AND A PLANE SCREAMS OVER, HE LOOKS UP\nAND PAUSES.\n\n                      BLANE (cont'd)\n         Whaddaya got?\n\n                      MOORE\n         I got to redo some of these figures.\n\n                      BELLA\n         They worked out on the plan, why all a sudden\n         now, you...\n\n                      MOORE\n         Because, lemme explain it to you: because\n         when it starts to go sour, someby's gonna be\n         pissing their shit, look'n around, shoot\n         someb'y inna head, I'd like to have an\n         alternative idea, is the explanation.\n              (PAUSE)\n\nTWO POLICE CRUISERS SCREAM BY, LIGHTS FLASHING. BLANE AND MOORE\nLOOK AT EACH OTHER AND NOD. MOORE MAKES A NOTE ON HIS CLIPBOARD.\n\n                      MOORE (CONT'D)\n         One minute twenty seconds...\n\n                      BELLA\n         ...why should it go sour?\n\nMOORE SHAKES HIS HEAD IN DISBELIEF.\n\n                      BELLA (cont'd)\n         No, no. No. Teach me something: why should\n         it go sour. Was that such a stupid...?\n              (PAUSE)\n\n                      MOORE\n         Y'ever cheat on a woman?\n              (PAUSE)\n         Your girl, something...\n              (PAUSE)\n         Stand her up?\n\n                       BELLA\n         ...what...?\n\n                      MOORE\n         D'you ever do that?\n\n                       BELLA\n         Yeah.\n\n                      MOORE\n         When you called her up, d'you have an excuse?\n\n                                                                   35.\n\n\n                        BELLA\n          Yeah.\n\n                       MOORE\n          What is she didn't ask?   What was your\n          alibi, a waste of time?\n\nBEAT.   MOORE WALKS AWAY.\n\n                       BELLA\n          What was that about?\n\n                       BLANE\n          Well, you see, that's why he's running the\n          crew, n'you're somebody's fucken nephew--\n               (PAUSE)\n          You don't do anything without: a diversion\n          and a back-up plan. Wu'un that your\n          question...?\n\nBELLA SHRUGS.\n\n                         BLANE (cont'd)\n          Now:    why'd you ask about his wife...?\n\nPAUSE. THERE IS THE SCREECH OF A TRAIN WHISTLE. IN THE B.G. WE SEE\nMOORE MAKE A NOTATION, AND WAVE TOWARD BLANE. IN THE STATIONWAGON\nBLANE MAKES A NOTE ON A CLIPBOARD, AND WAVES BACK.\n\nIN THE B.G. WE SEE MOORE BECKONING, AND BLANE GETS OUT OF THE CAR.\n\nANGLE, EXT, THE OVERPASS.    BLANE AND MOORE WALKING TOWARD EACH\nOTHER.\n\nMOORE LOOKS BACK TOWARD BELLA, IN THE CAR.    AND LOOKS QUESTIONINGLY\nAT BLANE.\n\n                       BLANE (cont'd)\n          Yeah, he's holding up. What're you...?\n\n                       MOORE\n          I found a Hotwalker for him.\n\n                        BLANE\n          ...Fran...?\n\n                       MOORE\n          Well, it could be...\n\n                       BLANE\n          I don't mean to 'pry'\n\n                       MOORE\n          ...then don't pry.\n               (NODS, GESTURES TO THE CLIPBOARD)\n          I have to redo the figures on the train...\n\nTHEN HE SEES SOMETHING OVER BLANE'S SHOULDER.\n\n                                                                36.\n\n\nANGLE, HIS POV\n\nANOTHER CRUISER, WHICH BRAKES, AND SLOWS DOWN, TO EYE THE\nSTATIONWAGON.\n\nANGLE\n\nON BLANE AND MOORE\n\n                      MOORE (cont'd)\n              (TO HIMSELF. SOTTO)\n         Don't move the car... don't move the car...\n\n                      BLANE\n              (WHO IS TURNED AWAY FROM THE\n               CRUISER)\n         ...is he moving the car...?\n\nANGLE\n\nON THE STATIONWAGON, WITH BELLA PUTTING IT IN GEAR, AND MOVING IT\nTOWARD BLANE AND MOORE. WE SEE THE POLICE CRUISER TURN IN, TO CUT\nTHE TWO MEN OFF FROM THE STATIONWAGON.\n\nANGLE\n\nON MOORE AND BLANE. AS BLANE OPENS HIS JACKET TO REVEAL A PISTOL\nIN HIS WAISTBAND. WE SEE MOORE SHAKE HIS HEAD MINUTELY.\n\nANGLE.\n\nTHE POLICE CRUISER, ROLLING UP BETWEEN THEM AND THE STATIONWAGON.\nA YOUNG TROOPER GETS OUT OF THE CAR.\n\nTROOPER WALKS TOWARD THEM UNBUTTONING THE SAFETY SNAP ON THE\nHOLSTER. HE LOOKS WARILY AT BELLA AND BLANE.\n\nANGLE, TIGHT TWO ON MOORE AND BLANE.\n\n                      BLANE (cont'd)\n              (TO HIMSELF)\n         Oh, maaan...\n\n                      MOORE\n              (SOTTO)\n         Is he getting out of the car...?\n\nBLANE TURNS.   ANGLE, HIS POV\n\nTHE DRIVER'S DOOR OF THE STATIONWAGON OPENING.\n\nANGLE\n\nBELLA GETTING OUT OF THE DRIVER'S DOOR.   HE TAKES A PISTOL FROM\nTHE SEAT BESIDE HIM.\n\nANGLE\n\n                                                                 37.\n\n\nBLANE AND MOORE.   BLANE NODS TO HIM.\n\nMOORE SHAKES HIS HEAD IN DISGUST. HE REACHES INTO HIS PANTS POCKET\nAND EXTRACTS A MINI-AUTO PISTOL THE SIZE OF A HALF-A-DECK OF CARDS.\n\nANGLE: INS:   HE CYCLES THE ACTION, JACKING A SHELL INTO THE\nCHAMBER.\n\nHE PUSHES PAST BLANE.\n\nMOORE WALKS UP TO THE TROOPER, PUTTING THE HAND WITH THE MINI-\nPISTOL IN HIS POCKET.\n\n                      MOORE\n         Hey: what the hell...? What the hell...?\n         Scuse me, scuse me, officer, we were sposed to\n         have a detail, doing security for us...\n\nBLANE TAKES HIM BY THE ARM.\n\n                      BLANE\n         ...Bobby...?\n              (MOORE PULLS AWAY)\n         No, it's no big deal, but we're standing out\n         here...\n\n                      TROOPER\n         ...who did you...?\n\n                      BLANE\n              (PULLING MOORE AWAY)\n         Forget about...\n\n                      MOORE\n         No, it burns my butt... we're out there,\n         we're out there, side-of-the-road, workin' on\n         the highway, for...\n              (TO THE TROOPER)\n         I know it's not you, I'm sorry, I know it's\n         not you, but...\n\n                      TROOPER\n         ...who did you...?\n\n                      BLANE\n         ...our boss talked to...\n\n                      MOORE\n         If this was the first time...\n\n                      BLANE\n         Hey, forget about it, we'll sort it out back\n         at the office...\n\nBLANE AND MOORE WALK AWAY FROM THE TROOPER.\n\n                                                                38.\n\n\n                      BLANE (cont'd)\n              (SOTTO)\n              (TO MOORE)\n         ...He ain't sure yet...\n              (MOORE WALKS BACK TO THE TROOPER.)\n\nHE CONTINUES WALKING MOORE BACK TOWARD THE STATIONWAGON.\n\n                      MOORE\n              (TO THE TROOPER)\n         I'm sorry, I know it's not you, but...\n\n                      TROOPER\n         Hey, nothing to it. If...\n\n                      MOORE\n         But it's not the first time... we're sposed\n         to have police pro...\n\n                      BLANE\n         We'll call from the office.\n              (TO TROOPER)\n         He didn't mean any offense... He didn't mean\n         any offense.\n              (TO MOORE, AS HE WALKS AWAY)\n         ...the man's only doing his job...\n\nMOORE BRUSHES BLANE'S ARM OFF.\n\nBLANE WALKS AHEAD OF MOORE, GETS INTO THE DRIVER'S SEAT.   BLANE\nLOOKS IN THE REARVIEW MIRROR.\n\nANGLE HIS POV.\n\nMOORE WALKS AWAY, AND THEN, BACK TO THE TROOPER.\n\nANGLE\n\nON PINCUS AND BELLA IN THE CAR\n\nWE SEE BELLA LOOKING IN THE REARVIEW MIRROR. HE STARTS TO REACH\nINSIDE HIS JACKET, AND EXTRACT A PISTOL. PINCUS PUTS HIS HAND ON\nBELLA'S ARM.\n\n                      PINCUS\n         ...keep it together... keep it together...\n\n                      BELLA\n         ...can he cool the guy out...\n\n                      PINCUS\n         Just pick up your clipboard, and make like\n         you're writing in it.\n\n                      BELLA\n         Izzit gonna be cool...?\n\n                                                               39.\n\n\n                      PINCUS\n         ...my motherfucker is so cool, when he goes\n         to bed, sheep count him...\n\nANGLE\n\nEXT THE CAR. ON MOORE AND THE TROOPER AS BLANE GETS INTO THE CAR.\nAS MOORE, OBVIOUSLY APOLOGIZING, SHAKES HANDS WITH THE TROOPER, AND\nTHEN STARTS TO WALK AWAY. CAMERA TRACKS WITH MOORE, AS HE TAKES\nOUT A PACK OF CIGARETTES AND A MATCH. ANGLE, INS.\n\nON HIS HANDS, AS THEY SHAKE SO BADLY HE CAN HARDLY LIGHT THE\nCIGARETTE.\n\nANGLE, INT.   THE CAR.   AS MOORE GETS INTO THE BACKSEAT.\n\n                      MOORE\n         I'm trina... I'm trina...\n              (TO BELLA)\n         You fucken lame, you want to leave me dead,\n         th'whole crew, the side of the highway?\n\n                         BELLA\n         I...\n\n                      MOORE\n         You fucken cowboy, I oughta\n              (TO MOORE)\n         Tell me why I don't leave him out inna ditch\n         somewh...\n              (TO PINCUS)\n         Get us the fuck outtahere.\n\nPINCUS MOVES BEHIND THE WHEEL, AND THE CAR BEGINS TO DRIVE OFF.\n\n                      BLANE\n              (SHRUGS SHOULDERS)\n         Hey, I vote we do...\n\n                      MOORE\n         ...put you down like the fucken dog you\n         are... you gonna come, shoot your way to\n         stardom? Don't do any...\n\n                         BELLA\n         ...I only\n\n                      MOORE\n         I don't want you to do anything unless and\n         until... we hit the City, ditch the car.\n\n                         BELLA\n         ...I'll...\n\n                      MOORE\n         You do it, you do it.\n              (PAUSE)\n         You do it, Pinky...\n\n                                                                 40.\n\n\nHE WIPES HIS HAND OVER HIS MOUSTACHE.    TAKES OFF HIS HARDHAT, AND\nWIPES THE SWEAT FROM HIS BROW.\n\nINT BOAT REPAIR SHOP NIGHT\n\nA SPRAY OF SPARKS FROM A WELDING UNIT.\n\nANGLE\n\nON MOORE, AS HE PUTS UP THE SHIELD ON A WELDER'S MASK, WIPES HIS\nBROW, PUTS THE SHIELD DOWN AGAIN, AND CONTINUES CUTTING WITH AN\nACETYLENE TORCH ON A LARGE, INDUSTRIAL AIR-CONDITIONING UNIT.\n\nANGLE\n\nIN THE B.G. A RYDER RENTAL TRUCK.\n\nANGLE.   ON PINCUS AND BLANE, AS A LONG ASSEMBLY TABLE.\n\nBLANE HOLDS A LEGAL PAD, AND IS MAKING NOTATIONS ON IT.\n\nHE SPEAKS TO PINCUS, AS CAMERA PANS OVER THE TABLE, HOLDING ON\nBLANE'S HANDS AS HE CHECKS THE VARIOUS PROPS.\n\nWE SEE: A SECURITY GUARD'S UNIFORM. A LEATHER BADGECASE, HOLDING\nA GOLD BADGE, SEVERAL SMALL METAL CANNISTERS, A TOOLKIT, A UTILITY\nBELT HOLDING TOOLS. SEVERAL WALKIE TALKIES.\n\nPINCUS AND BLANE CONVERSE, V.O.\n\n                       PINCUS\n          The thing of it is, the thing of it is, it's\n          a question of redistribution...\n\n                        BLANE\n          How's that?\n\n                       PINCUS\n          The question: how do we get the money from\n          there to here... it's just a question in\n          logistics.\n\n                       BLANE\n          \"What is the robbing of a bank, compared with\n          the founding of a bank?\"\n\n                       PINCUS\n          Who said that?\n\n                       BLANE\n          Anybody ever applied for a loan.\n\nANGLE\n\nON THE TWO, AS BLANE HANDS THE CLIPBOARD TO PINCUS.\n\n                       PINCUS (cont'd)\n          ...load it up?\n\n                                                                  41.\n\n\nBLANE NODS. THEY BEGIN HAULING THESE PROPS AND SUPPLIES INTO THE\nTRUCK, AND LOADING THEM INTO THE \"FALSE\" (HOLLOW) ENGINE.\n\nBLANE LOOKS OUT OF THE BACK OF THE TRUCK.\n\nANGLE, HIS POV.   A CAR PULLS UP OUTSIDE THE SHED.   BELLA GETS OUT.\n\nANGLE\n\nON BELLA, AS HE WALKS INTO THE SHED.   HE TAKES OUT AN ENVELOPE.\n\nANGLE, ON BLANE, WHO OPENS THE ENVELOPE.    TO REVEAL CASH INSIDE.\n\n                      BELLA\n         ...expenses for the truck, and...\n\n                      BLANE\n         Yeah, I got it. I got it.     Okay.\n\nBELLA WALKS OFF, AS FRAN ENTERS FROM THE \"LIVING\" AREA OF THE\nBOATSHED, HOLDING TWO CUPS OF COFFEE.\n\nFRAN STARTS TO OPEN HER MOUTH, SMILING, AS HE STARTS TO PUT DOWN\nTHE CUP OF COFFEE, MOORE GIVES HER AN INFINITESSIMAL SHAKE OF HER\nHEAD. AND MOTIONS TOWARD BELLA. FRAN NODS IN AGREEMENT, AND, NOT\nBREAKING HER STRIDE, WALKS TOWARD BELLA.\n\n                      BELLA\n              (TO FRAN)\n         Well, then...\n\n                      FRAN\n         ...that's right.\n              (PAUSE)\n\n                      BELLA\n         ...long time.\n              (PAUSE)\n\n                      FRAN\n         ...that's right.\n\nANGLE\n\nON MOORE, LOOKING AT THEM.\n\nANGLE, HIS POV:\n\nBELLA AND FRAN, IN THE B.G., BELLA CHATTING FRAN UP.\n\nANGLE\n\nON BLANE AS HE WALKS OVER TO MOORE, AT THE WELDING STATION.     HE\nHANDS MOORE THE ENVELOPE.\n\n                      BLANE\n         The plan gonna work?\n\n                                                               42.\n\n\n                      MOORE\n         It's gonna work if we make it work.   How's\n         Fran doing?\n\n                      BLANE\n         Looks like he maybe wantsa take her to the\n         Prom.\n\nMOORE SMILES, AND NODS.\n\n                      MOORE\n         Well, it's always the pretty girl stays\n         home, innit?\n\n                      BLANE\n         Izzat what they said in the White\n         Community...?\n\n                      MOORE\n         That's what I hear.\n\n                      BLANE\n         And I hear, if you get a goose, it keeps the\n         fox off the chickens.\n              (LOOKS AT FRAN AND BELLA)\n         What does that lady see in you, by the way?\n\n                      MOORE\n         I'm very resilient.\n\n                      BLANE\n         Yeah, so's Gumby.\n\n                      MOORE\n         I got a more striking profile.\n\nPINCUS WALKS UP.   HE AND BLANE WALK ACROSS THE SHOP FLOOR, BLANE\nLIMPS SLIGHTLY.\n\n                      BLANE\n         They're gonna leave that on the cutting room\n         floor, Buenos Aires.\n\n                      MOORE\n         I never liked the way I looked anyway...\n\n                      PINCUS\n              (AS HE LOOKS OVER HIS SHOULDER AT\n               FRAN AND BELLA, SOTTO)\n         ...seems to be coming along nicely.\n\n                      BLANE\n              (SOTTO)\n         My boy there, like to Fertilize the Flowers.\n\n                      PINCUS\n         ...how's your leg?\n\n                                                                43.\n\n\n                      BLANE\n         You should see the other guy...\n\n                      PINCUS\n              (TO MOORE)\n         ...when we do the switch, the Highway...\n\nMOORE SHAKES HIS HEAD, INDICATING BELLA.\n\n                      PINCUS (cont'd)\n         ...he can't hear...\n\n                      MOORE\n         ...he can't hear what you don't say...\n\n                      PINCUS\n         I'm gonna be as quier as an ant pissing on\n         cotton.\n\nMOORE FIRES UP THE TORCH, AND BEGINS CUTTING AGAIN.\n\nANGLE, IN THE B.G. FRAN AND BELLA.\n\nBLANE WALKS PINCUS AWAY FROM MOORE.\n\n                      BLANE\n              (SOTTO)\n         Don't think it, Baby. Don't think it: Don't\n         be as quiet as an ant pissing on cotton, don't be\n         quiet as an ant thinking about pissing on\n         cotton. You be quiet as an ant not even\n         thinking about pissing on cotton.\n\nTHEIR WALK TAKES THEM TO BELLA AND FRAN.    FRAN IS LAUGHING.\n\n                      FRAN\n         ...our friend was telling me \"What Made Him a\n         Criminal...\"\n\n                      BLANE\n         I'll get the beer and pretzels.\n\n                      BELLA\n         ...what made you a criminal?\n\n                      BLANE\n         Nobody made me a criminal.     I am a Criminal.\n\nMOORE WALKS OVER.\n\n                      MOORE\n         How we doing?\n\nHE GATHERS THEM AROUND A TABLE.\n\n                      BLANE\n         How you doing?\n\n                                                               44.\n\n\n                       MOORE\n          I'm done.\n               (PAUSE)\n          Well, that's it them.\n\nMOORE GETS UP, CAMERA TAKES HIM TO THE RYDER TRUCK. HE OPENS THE\nBACK, AND WE SEE HIM OPEN WHAT APPEARS TO BE THE SOLID MOTOR, WHICH\nIS REVEALED TO BE HINGED AND HOLLOW.\n\nBLANE FOLLOWS HIM, AND HANDS HIM SEVERAL FIREARMS, WHICH HE\nSECRETS IN THE HOLLOW SPACE.\n\n                       MOORE (cont'd)\n          You got the detonators?\n\nBELLA HOLDS UP SEVERAL PUTTY COLORED PACKAGES OF PLASTIQUE, WHICH HE\nTAKES OFF OF THE TABLE, BEARING THE PROPS.\n\n                       BELLA\n          ...din we check'em?\n\n                       MOORE\n          I know we checked'em. What I'm doing, I'm.\n          I'm asking you a question.\n\n                       BELLA\n          What happened to Check It an Forget it?\n\n                       MOORE\n          Yeah, well, I went to the Other camp, which\n          is Fuss it to Death, and Fuck it into a\n          Cocked Hat, or do you want to run the\n          show...?\n\nPAUSE.   THEY EXCHANGE A LOOK.\n\nBELLA WALKS AWAY SHAKING HIS HEAD.\n\n                       BLANE\n          Then we ready to Go Do it?\n\n                       PINCUS\n          I'm ready to go do it, you know why? I never\n          liked the Swiss in any case. You know\n          why? They make those little clocks, two\n          cocksuckers come out of them, little\n          hammers, hit each other on the head.\n               (PAUSE)\n          What kind of sick mentality is that?\n\nANGLE, ON BLANE AND BELLA, AS BELLA LOOKS OVER AT MOORE.\n\nANGLE.   ON BELLA, AS HE WALKS OVER TO FRAN.\n\nTHEY BOTH LOOK BACK AT MOORE, WHO IS LOADING UP THE TRUCK.\n\n                       BELLA\n          Z'he gonna hold up?\n\n                                                              45.\n\n\n                      FRAN\n         Why would you put a man in a position, he's\n         got no way out?\n\n                      BELLA\n         What is that, your philosophy?\n\n                      FRAN\n         That's right.\n\n                      BELLA\n         ...what is it to you?\n\n                      FRAN\n         ...he's my Husband.\n\n                      BELLA\n         Whose fault is that, you wanna think about\n         it? Listen:...\n\n                        MOORE\n                (IN THE B.G.)\n         I...\n\nANGLE, ON BELLA, AS HE TURNS.\n\n                      BELLA\n         ...you gonna make an Impassioned Speech?\n\n                        MOORE\n         Yeah:    Let's go get the money.\n\n                      BLANE\n              (TO BELLA AND PINCUS)\n         You clean the place down, n'y'thing'll burn,\n         burn it..., nobody's coming back here, nothing\n         that we need, don't leave it f'somebody else.\n\nPINCUS LIGHTS A FIRE IN A 55 GALLON DRUM.\n\nANGLE, ON MOORE, AS HE WALKS TO THE FRONT OF THE SHED, AND LOOKS\nOUT AT HIS BOAT.\n\nFRAN COMES UP BEHIND HIM.\n\n                      FRAN\n         Z'it gonna work?\n\n                      MOORE\n         It's either gonna be a monumental heist, or a\n         real amusing anecdote.\n              (PAUSE)\n\n                      FRAN\n         ...I love you, Joe...\n\n                        MOORE\n         Why?\n\n                                                              46.\n\n\n                      FRAN\n         You know why? Because you're thorough.\n\n                      MOORE\n         I hope to tell you...\n\nSHE TURNS TO WALK BACK INTO THE SHED. HE TURNS TO LOOK AT HER.\nIN THE B.G. WE SEE PINCUS FEEDING PAPERS INTO THE FLAMES.\n\nANGLE. EXT THE BOATSHED, ON THE GROUP, BLANE MOORE, PINCUS AND\nBELLA, AS THEY WALK TOWARD THEIR CARS.\n\nPINCUS IS ON THE PHONE IN THE B.G. (ON A CELLPHONE)\n\nMOORE STOPS TO LOOK AT HIS BOAT.\n\n                      BELLA\n         You gonna miss it?\n\n                        MOORE\n         What?\n\n                        BELLA\n         Your boat?\n\n                      MOORE\n         Well, it's a nice boat.\n\n                      BELLA\n         Hey, baby, after this job, you're gone have\n         enough money, make this look like a Boat inna\n         Bathtub.\n\n                      MOORE\n         That's right.\n\nPINCUS GOES TOWARD MOORE EXCITEDLY.\n\n                      MOORE (cont'd)\n         ...what is it?\n\n                      PINCUS\n         ...they found the car.\n\n                        MOORE\n         ...what car?\n\n                      PINCUS\n         ...the car we used at the Overpass. The cops\n         found it, I heard it on the police band.\n\n                      MOORE\n         ...they found it, how'd they find it?    I tole\n         you to it? I tole\n         you to ditch it in...\n\n                       PINCUS\n         I, I.   I stopped off to see my niece, I...\n\n                                                          47.\n\n\n                      MOORE\n         Did you wipe it down...?\n\n                      BLANE\n         You sonofabitch, what do you mean, you stopped\n         off to see your...\n\n                      MOORE\n         Did you wipe it down...?\n\n                      BELLA\n         ...what does this do to the Job...?\n\n                      BLANE\n         Man, you din't wipe it down, they're gonna\n         be on you, they're gonna be on all of us...\n\n                      BELLA\n         ...what about the Job...?\n              (PAUSE)\n\n                      MOORE\n         The job stands...\n\n                      PINCUS\n         ...I'm sorry, Joe.\n\n                      MOORE\n         Shut up. The job stands.\n              (HE LOOKS AROUND)\n         This joint is burnt.\n\n                      BLANE\n              (TO BELLA)\n         Come with me...\n\n                      MOORE\n         Meet at the Overpass.\n\n                      BELLA\n         ...the job stands...?\n\n                      MOORE\n         The meet at the overpass.   The 14th...\n\n                       PINCUS\n         Joe.   Joey, I...\n\n                      MOORE\n         Get him out of here.\n\n                      PINCUS\n         ...I don't see how they could of found the\n         car...\n\nBLANE STARTS MOVING BELLA OVER TO A CAR.\n\n                                                               48.\n\n\n                       BELLA\n               (AS HE GETS INTO A CAR)\n          You go on...\n\nWE SEE BELLA AND BLANE, IN TWO SEPARATE CARS, BEGIN TO DRIVE OFF.\nWE SEE MOORE, IN FOREGROUND, BEGIN TO WALK BACK TOWARD THE\nBOATSHED, AND PINCUS, IMPLORING, HANGING ON HIS ARM.\n\nANGLE, TIGHT ON PINCUS AND MOORE.\n\n                       PINCUS\n          Joe. Joe, I swear to God.      I swear to God,\n          I... are they gone...?\n\n                       MOORE\n               (LOOKS OVER PINCUS SHOULDER)\n          They're gone.\n\n                       PINCUS\n          Well, then, you get gone, too.\n\n                       MOORE\n          ...that's right.\n\nBEAT.   THEY EMBRACE.\n\nMOORE TAKES OUT THE MONEY ENVELOPE.\n\n                       PINCUS\n          You take care, Pally.\n\n                       MOORE\n          You get his cut to Bobby...?\n               (PINCUS NODS)\n\n                       PINCUS\n          You gonna be Okay?\n\n                       MOORE\n          I'm okay now.\n\n                       PINCUS\n               (OF THE ENVELOPE)\n          Yeah? What do you do for cash?\n\n                       MOORE\n          ...we're taking down the Boat guy.\n\n                       PINCUS\n          You're taking down the boat guy...\n\n                       MOORE\n          That's right.\n\n                       PINCUS\n          That's your case money...\n\n                                                             49.\n\n\n                      MOORE\n         It's enough, get us away...\n\n                      PINCUS\n         And then Aloha.\n\n                      MOORE\n         That's right.\n              (PAUSE)\n\n                      PINCUS\n         S'a shame, you know what, we din't get a\n         chance, actually do the thing. The Swiss\n         job. At's a beautiful plan.\n\n                      MOORE\n         So was World War One.\n\n                      PINCUS\n         ...no, it's a beautiful plan, Joe.     You're the\n         maestro.\n\n                      MOORE\n         Yeah, well, it's all in a lifetime...\n\n                      PINCUS\n         Izzat so?\n\n                      MOORE\n         That's what they tell me.\n              (PAUSE)\n\n                      PINCUS\n         See you, Joe.\n\n                      MOORE\n         I'll send you a Papaya.\n\n                      PINCUS\n         They're good for digestion.\n\n                      MOORE\n         Say good-bye to your niece.\n\nPINCUS PINCHES MOORE ON THE CHEEK.\n\nTHEY EMBRACE.\n\n                      PINCUS (cont'd)\n         Joe, you're the motengator.\n\n                      MOORE\n         Cute, huh?\n\n                      PINCUS\n         ...cute as a pail full of kittens...\n\n                                                               50.\n\n\nPINCUS GETS INTO HIS CAR. MOORE CHECKS HIS WATCH, AND GETS INTO\nHIS CAR. CAMERA FOLLOWS MOORE ONTO HIS BOAT, WHERE WE SEE HIM\nBEGIN CASTING OFF LINES.\n\nINT THE BOAT'S CABIN\n\nWE HEAR A THUMP.   ON THE DECK.   MOORE LOOKS UP.\n\nCAMERA TAKES MOORE UP ONTO THE DECK, WHERE FRAN HAS PLACED A LARGE\nSUITCASE. MOORE TAKES IT DOWN INTO THE CABIN. FRAN FOLLOWS.\n\n                      MOORE\n         I would of done that.\n\n                      FRAN\n         No, I'm the Frontier Wife.\n\n                      MOORE\n         ...that's right...\n\n                      FRAN\n         You ready to go?\n\n                      MOORE\n         Soon as we get the money.      Call the guy.   Get\n         us the money...\n\nFRAN TAKES OUT A CELL PHONE.   MOORE SHAKES HIS HEAD.\n\n                       MOORE (cont'd)\n         Landline.\n\nHE COMES UP ON THE DECK.\n\nANGLE\n\nMOORE AND FRAN, ON THE DECK, WALKING TOWARD THE MARINA.\n\n                      FRAN\n         You'll miss the guys.\n\n                      MOORE\n         Buncha Old Men, talkin' about Old Touches...\n\n                      FRAN\n         ...that's right...\n\n                      MOORE\n         Cuttin up Old Touches, th'time So and So\n         overslept. You know what...?\n\n                      FRAN\n         No, but you do.\n\n                                                              51.\n\n\n                      MOORE\n         Then I'll tell you what, is pee ess, if my\n         name's on the thing, then whose fault is it\n         in the First Place, we're having, fight our\n         way Back to Even.\n\n                       FRAN\n         Well.   You've been kicking yourself some...\n\n                      MOORE\n         ...that's right.\n\nCAMERA TAKES THEM UP INTO THE LIVING QUARTERS. MOORE GOES\nTHROUGH THE DRAWER OF A DESK. AS FRAN PICKS UP A PHONE AND DIALS.\n\n                      MOORE (cont'd)\n         In a contest of Cunning, a Stupid Person will\n         get the better of a Smart one Every Time...\n         Who said that...?\n\n                      FRAN\n         You did, Baby...\n\n                       MOORE\n         Well.   Help me remember it, huh...?\n\n                      FRAN\n         ...that's right...\n              (PAUSE)\n\n                      MOORE\n         You know, we're goin' down there with\n         nothing...\n\n                      FRAN\n         We'll get the boat money...\n\n                      MOORE\n         ...yeah?\n\n                      FRAN\n         That's enough to start over.\n\n                      MOORE\n         Is it enough for you...?\n\n                      FRAN\n         The Lord hates a coward...\n              (SHE REACTS TO THE TELEPHONE)\n              (TO PHONE)\n         Mr. Mr. Fletcher -- Mr. Robert Fletcher...\n         Well, do you... he asked me to call him back\n         at... Thank you...\n              (TO MOORE)\n         How you doing?\n\n                      MOORE\n         I'm about ready to go South.\n\n                                                           52.\n\n\n                      FRAN\n         South we go, Baby.\n\n                      MOORE\n         ...that's right.\n\n                      FRAN\n              (LOOKING AROUND)\n         You set to walk away from it?\n\n                      MOORE\n         Hey, I got you, what do I care...?\n\n                      FRAN\n              (ON PHONE)\n         Hello Mr...\n\n                      MOORE\n              (SOTTO)\n         Smile at the man, tell im cash, I'm coming to\n         get the money. Right now... find out where\n         he...\n              (FRAN NODS)\n\n                      FRAN\n         Hello, Mr. Fletcher, I... This is Fran,\n         from... Yes, I'm sorry to... you gave me this\n         number. On your ccc... Yes, I'm... Well, no,\n         yes, I'll be glad to call back Monday, but we\n         aren't going to have a boat... but we, we\n         just had a situation where, if, No, I\n         realize that, Sir, I don't want to keep you\n         from your pl... I'm calling, because you told\n         me that...\n         Well, it could wait till Monday, but we have\n         another buyer interested in the bbb...\n\nANGLE, ON MOORE, NODDING HIS ENCOURAGEMENT TO HIM.\n\n                      FRAN (cont'd)\n         I'm calling to say that if, if you want to\n         make a cash, an immediate cash deal, at the\n         figure which... Well, thank you, sir, that is\n         exactly my attitude.\n\nSHE SMILES AND NODS AT MOORE, HE SMILES BACK.\n\n                      FRAN (cont'd)\n         Superior... Well:\n\nSHE LOOKS TO MOORE FOR DIRECTION.\n\n                      MOORE\n              (SOTTO)\n         Tell him what he needs to hear.\n\nSHE OFFERS THE PHONE TO MOORE, WHO SHAKES HIS HEAD \"NO.\"\n\n                                                                   53.\n\n\n                         FRAN\n                 (TO PHONE)\n            Could, you, could you, hold...\n\nSHE COVERS THE MOUTHPIECE.\n\n                         MOORE\n            Flirt with the guy.\n\n                         FRAN\n                 (COVERING THE MOUTHPIECE, TO\n                  MOORE)\n            No problem. Can we meet him at His Bank.\n\n                          MOORE\n            Superior.   You get the address.   When?\n\n                         FRAN\n                 (TO MOORE)\n            I caught him going out of town, he... he\n            wants to meet next...\n\n                         MOORE\n            Right now. Right now, tell him we got\n            another buyer, we...\n\nANGLE.   SHE LOOKS OVER MOORE'S SHOULDER.\n\nANGLE XCU\n\nFRAN LOOKING FRIGHTENED.\n\nANGLE HER POV\n\nOVER MOORE, HE SEES SOMETHING OVER HER SHOULDER.       MOTIONS HER TO\nKEEP TALKING.\n\nANGLE\n\nMOORE POV. OVER HER SHOULDER, THROUGH A PLATEGLASS WINDOW, INTO\nTHE SHED, INTO THE DARK MACHINESHOP/FOUNDRY AREA OF THE BOATYARD.\n\nA DARK FORM, A MAN MOVING.\n\nANGLE\n\nON FRAN, AS SHE BEGINS TO LOWER THE PHONE, AS SHE LOOKS AT\nMOORE.\n\nANGLE, ON MOORE, AS HE LEAVES THE BEDROOM AREA THROUGH A BACKDOOR.\n\nANGLE FRAN, ON THE PHONE.\n\n                         FRAN (cont'd)\n            ...hello... hello...?\n\nANGLE ON MOORE, GOING OUT THE BACK DOOR, GESTURING HER TO MOVE\nAWAY FROM THE WINDOW.\n\n                                                                 54.\n\n\nANGLE, ON FRAN, AS SHE CONTINUES TALKING, MOVING OUT OF THE SHOT.\n\nANGLE\n\nON THE PHONE CORD JACK, IN THE WALL, AS IT PULLS OUT OF THE WALL.\n\nANGLE\n\nON MOORE CLIMBING DOWN AN IMPROVISED STAIRWAY-LADDER, TO THE LEVEL\nOF THE BOATYARD, IN THE B.G., WE SEE FRAN, STILL TALKING ON THE\nPHONE, MOVING OUT OF THE WINDOW.\n\nANGLE\n\nMOORE, MOVING THROUGH THE MACHINESHOP AREA, PAST SEVERAL MOTORS AND\nMARINE TRANSMISSIONS, HUNG FROM THE CEILING ON HOISTS.\n\nANGLE\n\nTHE FORM OF THE MAN, SILHOUETTED IN THE LIGHT FROM THE OPEN SHED\nDOOR, LEADING TO THE MARINA. ANGLE, ON MOORE COMING UP BEHIND THE\nMAN, MOORE LOOKS OUT OF THE SHED, CHECKING FOR THE PRESENCE OF\nOTHERS. HE TURNS BACK, AND COMES UP BEHIND THE MAN IN THE SHADOWS.\n\n                      MOORE\n         ...would you move into the light...? No,\n         don't turn around. Just move into the\n         light...\n\nANGLE\n\nFROM THE FRONT, THE MAN MOVES FORWARD, AND WE SEE IT IS BELLA,\nTHE YOUNG MAN FROM BERGMAN'S OFFICE.\n\nANGLE\n\nFROM THE REAR, WE SEE BELLA WALK FORWARD TO A GLASSED OFFICE\nAREA. WE SEE HIS REFLECTION, AND, BEHIND IT, MOORE'S REFLECTION.\n\nWE SEE MOORE STICK A PISTOL BACK INTO THE WAISTBAND OF HIS PANTS.\n\n                      MOORE (cont'd)\n         What do you want?\n              (PAUSE)\n         What're you, the Social Service Lady?\n              (PAUSE)\n\n                      BELLA\n         ...I...\n\n                      MOORE\n         ...what did you, come to take the Baby\n         back...?\n\nHE MOTIONS HIM FORWARD, INTO THE OFFICE AREA.    MOORE FOLLOWS HIM\nAND TURNS ON THE LIGHTS.\n\n                                                                55.\n\n\n                       MOORE (cont'd)\n          What do you want?\n\nBELLA WALKS TO A WORKTABLE.\n\nANGLE:   ON MOORE, AS HE EXCHANGES A LOOK WITH FRAN.\n\n                       BELLA\n          I forgot my copy of the plans.\n               (PAUSE)\n\n                       MOORE\n          How about that.\n               (HE LOOKS AT BELLA AND THEN AT\n                FRAN)\n               (PAUSE)\n\n                       BELLA\n          You got to do the job, Joe.\n               (PAUSE)\n          Lookit me like I'm your Good Angel.   You\n          can't walk away from it.\n\nANGLE, AS MOORE LOOKS AT FRAN.\n\n                       FRAN\n               (ON PHONE)\n          Hello... Hello...?\n\n                       MOORE\n          ...try him back...\n\n                         FRAN\n          ...hello...?\n\nANGLE, ON FRAN, AS SHE FOLLOWS DOWN THE CORD, TO WHERE IT HAS\nPULLED OUT OF THE WALL.\n\n                       MOORE\n          ...call him back...\n\nIN THE B.G. FRAN REDIALS THE PHONE.\n\n                       BELLA\n          You got to do the job...\n\n                       MOORE\n          Hold on, here...\n               (HE WALKS OVER TO FRAN.)\n\n                       FRAN\n               (ON PHONE)\n          Mr. Fletcher. I... I was just talking with\n          him. I... well, can you give me that\n          number...? Well, can you re... can you\n          reconnect mmm...\n               (PAUSE)\n          I... I see.\n\n                                                                56.\n\n\nSHE HANGS UP. SHE AND MOORE EXCHANGE A LOOK.   SHE SHAKES HER\nHEAD. MOORE WALKS BACK DOWN TOWARD BELLA.\n\n                      MOORE\n         Din't you just make yourself dispensable?\n\n                      BELLA\n         You got to do the job. Can you shoot me and\n         walk away from it? You know they'll kill you.\n\n                      MOORE\n         You my self-help program...?\n\nMOORE TURNS TO LOOK AT FRAN, WHO SHAKES HER HEAD.\n\n                      BELLA\n         You gone shoot me, go on the run, with\n         nothing? With that pretty little thing?\n\n                      MOORE\n         That would be my wife.\n\n                       BELLA\n         Is that so?\n\n                      MOORE\n         That's correct.\n\n                      BELLA\n         What does she see in you, anyway?\n\nBELLA TURNS TO LOOK AT FRAN.\n\n                      BELLA (cont'd)\n         ...you must be hung like Man of War...\n\nMOORE LUNGES FOR HIM AND GRABS HIM BY THE THROAT.\n\n                      MOORE\n         You wanna play the dozens. Here you go: They\n         called, there was a bookkeeping error at the\n         Hospital, you died at birth. Your turn...\n\n                      FRAN\n         Joe, leave him...\n\n                     MOORE\n         Eh? Cat got your tongue?   You wanna make\n         peace.\n\n                       FRAN\n         ...Joe\n\n                      MOORE\n         Don't you know when a man's whipped, for\n         chrissake?\n\n                                                                 57.\n\n\nMOORE WALKS BACK TOWARD HIS WIFE.   HE MAKES A \"TELEPHONE\" GESTURE,\nAND LOOKS A QUESTION AT HER.\n\n                       MOORE (cont'd)\n          ...the boat guy?\n\n                       FRAN\n          ...slipped off.\n\n                       MOORE\n          Call him back.\n               (PAUSE)\n          Get him back.\n\n                       FRAN\n          ...he's gone.\n               (PAUSE)\n          I'm sorry, Joe.\n\n                       MOORE\n               (TO BELLA)\n          Get up.\n\n                       BELLA\n          What're you gonna do.\n\n                       MOORE\n          I'm gonna be Don Ameche in a taxi, honey.\n               (PAUSE)\n          Get up.\n\n                          BELLA\n          ...and what?\n\n                          MOORE\n          Get out.\n               (PAUSE)\n          Get out.\n\nBEAT.   BELLA RETREATS.\n\nMOORE LOOKS AT FRAN.\n\n                       MOORE (cont'd)\n          You wanna tell me what I'm going to do...?\n               (PAUSE)\n\n                          FRAN\n          I...\n\nMOORE WAVES HER OFF, AS IF TO SAY, \"I'M THINKING...\"\n\nINT DARK BOXING GYM NIGHT.\n\nA YOUNG FIGHTER HITTING THE HEAVY BAG.   IN THE DARK GYM.   HE\nLOOKS AROUND.\n\nANGLE, HIS POV.\n\n                                                                  58.\n\n\nMOORE, MOVING THROUGH THE DARK GYM.\n\nANGLE INT. SMALL EQUIPMENT ROOM.\n\nANGLE INS.\n\nA DOORKNOB.   A SMALL PILE OF QUARTERS RESTING ON THE TOP.\n\nTHE KNOB TURNS, AND THE QUARTERS FALL OFF, CLATTERING ONTO THE\nFLOOR.\n\nANGLE INT THE ROOM.\n\nBLANE, IN HIS UNDERWEAR, COMING OFF OF A COT. HE THROWS OFF A\nBLANKET REVEALING A SMALL SHOTGUN, WHICH HE LEVELS AT THE DOOR.\n\nANGLE\n\nTHE DOOR, SWINGING OPEN, NO ONE BEYOND.    WE HEAR MOORE'S VOICE.\n\n                      MOORE\n         It's me, put it away.\n\nANGLE\n\nON MOORE, AS HE WALKS INTO THE ROOM.   TO CONFAB WITH BLANE.\n\n                      BLANE\n         ...the fuck you doing, sneaking in on a man,\n         middle of the\n\nMOORE NODS, HALF-CLOSES THE DOOR.\n\nANGLE EXT THE GYM.\n\nSEMI-INDUSTRIAL AREA. FRAN, STANDING BY THE GYM'S DOOR.      SEVERAL\nSMALL CHILDREN PLAYING UNDER A STREETLIGHT.\n\nANGLE\n\nON FRAN, AS SHE COMES INTO THE GYM, AND STANDS, WATCHING THE\nBOXER, WHO IS GOING BACK TO HITTING THE HEAVY BAG. HE TURNS TO\nLOOK AT HER.\n\n                      BOXER\n         What you doin here?\n\n                      FRAN\n         Well, you know, I'm with my friends...\n\n                      BOXER\n         I don't see nobody else here...\n\n                      FRAN\n         No, that's right...\n\nANGLE, ON HER, POV.\n\n                                                                 59.\n\n\nMOORE AND BLANE, THROUGH THE HALF OPENED DOOR, AS BLANE FINISHES\nDRESSING.\n\n                      BLANE\n         Baby, you shuunt be on the streets, the first\n         place...\n\n                      MOORE\n         ...what's the move...?\n\n                      BLANE\n         The move is:\n              (PAUSE)\n         The move is we got to get the gold.\n\nBLANE MOVES OUT OF THE ROOM.\n\nWE FIND HIM AND MOORE ON THE SECOND FLOOR RICKETY BALCONY\nOVERLOOKING THE SMALL GYM BELOW. WE SEE FRAN BELOW\n\nMOORE AND BLANE COME DOWN THE STAIRS.\n\nTHEY MEET FRAN.   AND BLANE STARTS DRIVING THEM IN THROUGH A SMALL\nDOOR.\n\nANGLE INT GARAGE.\n\nBLANE TURNS ON THE LIGHTS TO REVEAL A SMALL    FILTHY GARAGE. AN OLD\nRUSTED PICKUP TRUCK, ONE WHEEL GONE, UP ON    A JACK. STREETLIGHT\nCOMING IN THROUGH DIRTY WINDOWPANES SET IN    THE GARAGE DOOR. AS\nTHEY ENTER THERE IS A NOISE OUTSIDE, MOORE    FLINCHES.\n\n                      BLANE (cont'd)\n         ...kids on the street. Always kids on the\n         street.\n\nTHEY MOVE TO A BENCH. WHERE BLANE STARTS FILLING A PERCOLATOR\nFROM A UTILITY SINK. MOORE SITS ON SOME OLD, DISCARDED BOXING\nEQUIPMENT--A DISASSEMBLED SET OF PIPES, WHICH STILL HOLD AN OLD,\nROTTEN, LEATHER \"HEAVYBAG.\"\n\n                      MOORE\n         I can't go for the gold til I can see how to\n         get it home...\n\n                      BLANE\n         Well, then, we just got to think a little\n         harder.\n\n                     FRAN\n             (AS SHE ENTERS THE ROOM.)\n         Yes. That's right.\n\n                      BLANE\n         The nephew don't come back, the first place,\n         you're down on the Tropic Isle.\n              (PAUSE)\n         You shoulda left him on the side of the road.\n\n                                                 60.\n\n\n             MOORE\nUh huh... why'd you leave him the plans?\n\n             BLANE\nWhy'd I leave him what?\n\n             MOORE\nWhy'd you leave him the plans?\n\n            BLANE\nWhat...?\n\n             MOORE\nHe forgot his \"cheat sheet.\"     S'why he came\nback.\n\n             BLANE\nYeah, no, he din't forget his cheatsheet,\ncause I got it right here.\n     (HE RUMMAGES IN THE GYMBAG, AND\n      PRODUCES SEVERAL SMALL FOLDERS)\nWhat'm'I, going to go leaving papers in the\nhands of some lame? Are you kidding me...?\nHe said what?\n\n             MOORE\nHe said that's why he came back.\n\n             FRAN\nHe came back for me\n     (PAUSE. THEY TURN TO LOOK AT\n      HER.)\nHe came back to make sure I was okay.\n     (PAUSE)\nI knew him from before.\n\n             MOORE\nWell, hell, for the luvva god, we're going to\ndo something, let's do it. Okay. Okay:\nFran:\n\n            FRAN\nYes.\n\n             MOORE\nYou want to suit up?\n\n             FRAN\n...that's right.\n\n             BLANE\nWhat's the shot?\n\n             MOORE\n     (TO FRAN)\nYou got to Kiss Rings.\n\n                                                               61.\n\n\n                      FRAN\n         ...you point me.\n\nINT LOWER MIDDLE CLASS TRACT HOUSE KITCHEN NIGHT.\n\nSHOT FROM THE KITCHEN INTO A SMALL HALLWAY.\n\nPINCUS, KISSING GOODNIGHT TO A LITTLE GIRL, THE LITTLE GIRL'S MOTHER\nCOMES INTO THE SHOT, AND LEADS HER OFF. THE LITTLE GIRL WEARS A\nBATHROBE.\n\nANGLE\n\nON PINCUS AS HE COMES INTO THE KITCHEN.\n\nANGLE, HIS POV\n\nMOORE, SITTING AT THE KITCHEN TABLE, BLANE NEXT TO HIM, A CUP OF\nCOFFEE AHEAD OF HIM, STARING DOWN AT SOME SHEETS OF PAPER.\n\nPINCUS SITS DOWN, AND PICKS UP A LEGAL PAD.    PAUSE.\n\nMOORE PICKS UP A PHONE, LISTENS FOR \"DIALTONE,\" REPLACES IT.\n\n                      MOORE\n              (OF THE PLANS IN FRONT OF HIM)\n         What're we forgetting...?\n\n                      BLANE\n         How did we get away with the Gold?\n\n                        MOORE\n         Oh yeah.\n              (PAUSE)\n\n                      PINCUS\n         Robert the Bruce. Watched this Spider, try,\n         three hours, to spin this web...\n\n                        MOORE\n         Uh huh...\n\n                      PINCUS\n         Til finally...\n\n                        MOORE\n         Yeah?\n\n                      PINCUS\n         He succeeded.\n              (PAUSE)\n\n                      BLANE\n         That's the worst story I've ever heard.\n\nANGLE, ON MOORE, AS HE SITS THINKING, WITH PINCUS AND BLANE IN THE\nB.G.\n\n                                                                 62.\n\n\n                       PINCUS\n              (SHRUGS)\n         And it gave him the Idea.     To conquer\n         Scotland.\n\n                      BLANE\n         I don't get the connection.\n\nMOORE LOOKS AT HIS WATCH.   THE PHONE RINGS.   MOORE PICKS UP THE\nPHONE.\n\n                      MOORE\n              (TO PHONE)\n         Put him on.\n\nINT MANSION NIGHT.\n\nTHE SUMPTUOUS STUDY OF BERGMAN'S HOUSE. BERGMAN, IN ROBE AND\nPYJAMAS. A BODYGUARD IN A SUIT, BELLA, AND FRAN. THE BODYGUARD\nPASSES THE PHONE TO BERGMAN.\n\n                      BERGMAN\n              (TO PHONE)\n         Are you fucken with me? Are you fucken with\n         me, or are you done fucken with me? Because\n         I've just \"financialized\" the problem, and\n         you've just become more trouble than you're\n         worth.\n              (PAUSE)\n         She says you're gonna do the job. You said\n         that before, why now? What is it, all a\n         sudden...?\n              (PAUSE)\n         Everyone needs money. That's why they call it\n         \"money...\"\n              (PAUSE)\n         Well, let me add this sweetener. You do the\n         job. You do the job, r'else I turn you over,\n         I drop a fucken dime on you, you're so hot, I\n         on'y got to dial five digits. How strict is\n         that? How strict is that, you fucken lame?\n         ...I'm sorry that I have to speak this way,\n         in front of a Woman... were it not for who,\n         I'd waste your fucken ass. You said you're\n         goin' the job? Do the job, you're done with\n         the Charade. Save your bold moves for the\n         brilliant players.\n              (HE HANGS UP)\n              (TO FRAN)\n         I'm sorry for my language.\n\n                      FRAN\n         Well, it's only words.\n\n                      BERGMAN\n         That's absolutely right.\n\nBERGMAN MOTIONS BELLA TO HIS SIDE, THEY WALK INTO A KITCHEN AREA\nWITH FRAN IN THE B.G.\n\n                                                63.\n\n\n             BERGMAN (cont'd)\n     (TO BELLA. SOTTO)\nYou're in my position, what do you do?\n     (PAUSE)\nWhat did she tell you?\n\n               BELLA\nHe's scared.\n\n             BERGMAN\nI've never known him scared.\n\n             BELLA\nShe says he's getting old.\n\n             BERGMAN\n...she said that...\n\n             BELLA\nHe's broke. He's made. The cops're looking\nfor him. He don't want to go out there with\nnothing.\n     (PAUSE)\nShe says that he'll do the job.\n\n             BERGMAN\n...she does...\n\n             BELLA\n...she...\n      (HE HESITATES)\n\n               BERGMAN\n...please...\n\n             BELLA\nI think, the thing, she came to plead for\nhim.\n\n               BERGMAN\n...she did.    She came to plead for him?\n\n               BELLA\nI think so.\n\n             BERGMAN\nThe sonofabitch screwed me once, he's gone\nscrew me again. Why, why, why would she think\nthat I'd believe her?\n\n             BELLA\nShe came to me...\n\n               BERGMAN\nTo you.\n     (PAUSE)\nAh.\n\n                                                                 64.\n\n\n                       BELLA\n           ...yes.\n\n                        BERGMAN\n           He put her up, to come to you.\n\n                        BELLA\n           I think she came to me on her own.\n                (PAUSE)\n\n                        BERGMAN\n           Well, no, but as Rational Men, don't we\n           have to \"doubt\" her?\n\n                        BELLA\n           She thinks the guy's weak, he's scared, she's\n           scared, I think she's sincere.\n\n                        BERGMAN\n           Then, let me put a question to you: you had\n           the job... you had the job... how would you\n           test her sincerity...?\n\nANGLE\n\nON FRAN.   AS BERGMAN AND BELLA REEMERGE.\n\n                        BERGMAN (cont'd)\n           Okay, we're All on One Team, all arrayed\n           against a Common Enemy? Thank you for coming,\n           I'm an old Man, I'm going to bed...\n\n                        BELLA\n                (TO FRAN)\n           I'm going to see you back.\n                (HE TAKES HER BY THE ARM.)\n\nANGLE EXT THE MANSION, VARIOUS CARS PARKED IN THE CIRCULAR DRIVEWAY.\nBELLA WALKS FRAN TO HER CAR. HE STARTS TO GET IN.\n\n                        FRAN\n           I'll be alright...\n\n                        BELLA\n                (AS HE WALKS OVER TO HER SIDE OF\n                 THE CAR)\n           Hey, you're alright now...\n\nHE GRABS HER AND GOES INTO A CLINCH. SHE RESISTS FOR A MOMENT,\nCAMERA PANS THEM AS BELLA TAKES HER BEYOND THE DRIVEWAY TOWARD A\nPOOLSIDE CABANA.\n\nINT PINCUS'S KITCHEN DAWN. LEANED BACK AGAINST THE WALL. BLANE\nASLEEP AT HIS CHAIR. PINCUS PLAYING SOLITAIRE. MOORE SITTING.\nHOLD.\n\nMOORE KICKS THE CHAIR, SO THAT BLANE COMES FORWARD, AND AWAKE.\n\n                                                               65.\n\n\n                      MOORE\n         ...get me the name of a freight forwarder.\n\n                       BLANE\n         ...what?\n\n                      MOORE\n         ...a freight forwarder.\n              (HE THROWS HIM A YELLOW PAGES)\n         Okay. Alright.\n\nAS BLANE LOOKS THROUGH THE YELLOW PAGES MOORE GRILLS PINCUS.\n\n                      MOORE (cont'd)\n         ...what's the Lady's name?\n\n                      PINCUS\n         ...Mrs. Croft.\n\n                      MOORE\n         What do we chat her up about?\n\n                        PINCUS\n         She   is active in the church choir. She has\n         had   her job for sixteen years. Last time I\n         saw   her, she had stomach problems... what's\n         the   response time on the tow truck...?\n\n                      BLANE\n         Average, forty five minutes.\n\n                      MOORE\n              (SHAKES HEAD)\n         Too quick...\n              (PAUSE)\n         On the day. Half hour before the thing,\n         call up, three false breakdown calls. Keep'em\n         buys.\n\n                      PINCUS\n         ...that's right...\n\n                      MOORE\n         You got to givvem breakdown calls on actual\n         vehicles, which means you'll have to go to\n         the Rental...\n\nANGLE, ON PINCUS, LOOKING AT HIM AS IF TO SAY \"DO YOU THINK YOU'RE\nPLAYING WITH CHILDREN...?\"\n\n                      BLANE\n              (AS HE LOOKS THROUGH THE YELLOW\n               PAGES)\n         What, what kind of \"freight do you want\n         to...\"\n\n                                                                 66.\n\n\n                      MOORE\n              (AS HE TAKES OUT HIS PAD AND\n               PENCIL AND BEGINS TO DRAW))\n         ...look here:\n\nINT POOLSIDE CABANA DAY.\n\nFRAN AND BELLA, FINISHING DRESSING.\n\n                      BELLA\n         ...and how's he getting his share away...?\n\n                      FRAN\n         ...what difference, you're going to screw it\n         out of him anyway...\n\n                      BELLA\n         ...what are you telling me...?\n\nFRAN SHAKES HER HEAD AND STARTS OUT OF THE CABANA.    BELLA FOLLOWS\nHER.\n\nINT BOATSHED DAY\n\nMOORE IS APPLYING \"SKINS,\" (I.E. REMOVABLE COVERINGS) TO THE SIDE OF\nA VAN, ADVERTISING IT AS THE VAN OF A SECURITY COMPANY. BLANE\nARRIVES, CARRYING SEVERAL UNIFORMS, IN PLASTIC, DRY CLEANERS WRAP.\n\n                      MOORE\n         ...take the wrappers off, hang em in the air,\n         get the drycleaning smell out.\n\nHE LOOKS UP AS FRAN AND BELLA ENTER.\n\n                      MOORE (cont'd)\n         ...where have you been...?\n\n                      BELLA\n         ...tucking Betty Croft in...\n\n                      BLANE\n         What's she, out all night partying...?\n\n                      BELLA\n         She's a wild, wild woman...\n              (HE HANDS MOORE A POLAROID, HE\n               TOOK AT THE BAR.)\n\n                      MOORE\n              (AS HE TAKES THE PHOTO, AND\n               STUDIES IT.)\n         Alright, then. No Hard Feelings...?\n\n                      BELLA\n         ...last thing in the World...\n\nANGLE, C.U. MOORE, LOOKING AT FRAN.\n\n                                                                  67.\n\n\nFRAN COMES OVER TOWARD MOORE, WHO IS HOLDING A YELLOW PAD.\n\n                        FRAN\n         ...I...\n\n                      MOORE\n         ...I don't give a fuck. The only thing is:\n         Get the Gold. Get the gold, Baby. Get the\n         Gold. They ain't gonna pay for Yardage...\n\nHE LOOKS DOWN.\n\nANGLE, INS. HIS POV\n\nTHE YELLOW LEGAL PAD, WITH THE SKETCH OF THE RAILROAD OVERPASS.\n\n                                                   DISSOLVE TO:\n\nEXT THE RAILROAD UNDERPASS.    NIGHT.\n\nANGLE INS: A MAN'S HANDS, IN WORKGLOVES, HOLD THE SKETCH OF THE\nUNDERPASS, COVERED IN FIGURES.\n\nANGLE: MOORE, IN WORKCLOTHES, WALKING DOWN FROM UNDERNEATH THE\nUNDERPASS, TO THE LEVEL OF THE TRACKS. HE TURNS AND LOOKS UP AT THE\nUNDERSIDE OF THE VAULT.\n\nANGLE\n\nON THE TRACK.    MOORE WALKS INTO THE SHOT, PACING OFF STEPS DOWN THE\nTRACKS.\n\nANGLE.\n\nIN THE SCRUB ALONGSIDE THE BANKS, HE WALKS UP AND SITS NEXT TO\nA BLACK NYLON BACKPACK. HE CHECKS HIS WATCH.\n\nEXT RAILROAD OVERPASS NIGHT.\n\nA SMALL TRUCK, IT'S SIDES PAINTED TO ADVERTISE A SECURITY COMPANY,\nGOES OVER THE OVERPASS.\n\nANGLE INT THE TRUCK.\n\nBELLA AND, BLANE, DRESSED IN COVERALLS, ADVERTISING A SECURITY\nCOMPANY.\n\nANGLE, INT THE TRUCK.\n\nBLANE, LOOKING OUT OF THE WINDOW.\n\nBELLA, CHEWING GUM, TAKES OUT THE PACK, AND BEGINS CHEWING\nANOTHER PIECE.\n\n                      BLANE\n         ...you feeling?\n\n                                                             68.\n\n\n                        BELLA\n         I'm fine...\n\n                      BLANE\n         Sometimes, th'drenaline, hits you, gives you\n         the shakes...\n\n                        BELLA\n         I'm alright.\n\n                      BLANE\n         I'm saying, some people, adrenaline, gives'em\n         the shakes... some people, mistake it for\n         cowardice...\n              (PAUSE)\n\n                        BELLA\n         I'm fine.\n\nHE TAKES OUT A SCAPULAR, HOLDS IT, AND SAYS A SMALL PRAYER\n\nHE LOOKS OVER AT BLANE.\n\n                      BLANE\n         ...nothing wrong with prayer.\n              (PAUSE)\n\n                      BELLA\n         ...you think so...?\n\n                      BLANE\n         I was in this firefight? One time?\n         Motherfucker, always carried a bible, next to\n         his heart. And we used to mock him. But\n         that bible stopped a bullet.\n\n                        BELLA\n         No shit.\n\n                       BLANE\n         My hand to god. That bible, stopped a bullet,\n         would have ruined that fucker's heart.\n               (PAUSE)\n         And had he had another bible, in front of\n         his face, that man would be alive today.\n         What time you got?\n\n                      BELLA\n         Five eighteen.\n\n                      BLANE\n         ...make the call.\n\nBELLA TAKES OUT A CELLPHONE AND DIALS.\n\n                      BELLA\n              (ON PHONE)\n         Hello? I've, hello?\n                      (MORE)\n\n                                                                 69.\n\n\n                      BELLA (cont'd)\n         I've got one of your trucks...? The, the\n         engine quit on me... Hello? Yeah, the..., I\n         got a delivery I have to... from when?\n         Well, it's twenty after fi... I'm on, where\n         am I? I'm on Industrial and two-oh-seventh,\n         well, your truck's dead...\n\nANGLE, EXT THE TRUCK.\n\nTHE TRUCK STOPS AT THE OVERPASS.      BLANE HOPS OUT.\n\nANGLE. IN THE SCRUB. ALONGSIDE THE BANK. THE BLACK BACKPACK\nMOORE LEFT EARLIER. BLANE PICKS IT UP. CAMERA PANS HIM BACK TOWARD\nTHE OVERPASS.\n\nANGLE INS.\n\nINSIDE THE SPAN OF THE STONE OVERPASS. A SMALL ELECTRONIC LOOKING\nDEVICE. BLANE'S HAND COMES INTO THE FRAME, HOLDING IT. HE AFFIXES\nIT TO THE STONE, FLIPS A SWITCH. A REDLIGHT BEGINS TO GLOW ON\nTHE DEVICE.\n\nANGLE\n\nEXT THE SECURITY TRUCK AT THE SIDE OF THE ROAD, BY THE\nOVERPASS. BLANE, RUNNING BACK TOWARD THE TRUCK.\n\nANGLE INT THE SECURITY TRUCK.\n\n                      BELLA (cont'd)\n              (ON PHONE)\n         to fix the...\n\nBLANE GETS INTO THE TRUCK\n\n                      BLANE\n         ...let's go...\n\n                      BELLA\n              (ON PHONE)\n         ...would you do that?       Thank you...\n\nANGLE EXT.\n\nTHE TRUCK.   PULLING OUT INTO THE ROAD.\n\nINT COMMUTER TRAIN COACH.    DAWN.\n\nAN OLD TIRED CONDUCTOR WALKING DOWN THE AISLE. PAST A SLEEPING\nBUSINESSMAN. THE BUSINESSMAN WALKS, TO REVEAL IT IS MOORE. HE\nSTRETCHES, LOOKS OUT THE WINDOW. AND WALKS BACK IN THE CAR,\nHOLDING HIS BRIEFCASE.\n\nANGLE INT.   THE LAVATORY.\n\nMOORE ENTERS, HE TAKES A SMALL BOX FROM HIS BRIEFCASE, TURNS A\nDIAL, AND AFFIXES IT TO THE CEILING.\n\n                                                                  70.\n\n\nEXT SUBURBAN STATION DAWN.\n\nTHE TRAIN SLOWING DOWN. MOORE ALIGHTS FROM THE LAST CAR, A\nSTATIONWATON PULLS UP FROM THE EMPTY PARKING LOT, MOORE WALKS\nTOWARD IT.\n\nINT A BANK OF PHONES DAY\n\nPINCUS, IN A BUSINESS SUIT. STANDING BY WHAT APPEARS TO BE A LARGE\nSAMPLE CASE, WAITING AT A BANK OF PHONES. HE LOOKS AT HIS WATCH.\n\nEXT AIRPORT DEPARTURES DRIVEWAY.\n\nTHE STATIONWAGON PULLS UP.    FRAN DRIVING, AND MOORE RIDING.   HE GETS\nOUT, WEARING COVERALLS.\n\nMOORE LOOKS DOWN AT THE POLAROID PICTURE WE SAW EARLIER.\n\nANGLE\n\nON A COFFEETRUCK PARKED OUTSIDE AN EMPLOYEE'S ENTRANCE.\n\nA FORTYISH WOMAN IN A SECURITY GUARD'S UNIFORM IS DRINKING COFFEE,\nONE OF A NUMBER OF AIRPORT EMPLOYEES.\n\n                      WOMAN\n              (MRS. CROFT)\n         ...of my ulcer--Doctor said it's... it isn't\n         the caffeine, but the acids in the coffee\n         that...\n\nANGLE\n\nON MOORE, WALKING UP TO THE WOMAN.     HE CONSULTS A PIECE OF PAPER.\n\n                      MOORE\n         Mrs. Croft?\n              (PAUSE)\n         Betty Croft...?\n\n                        MRS. CROFT\n                (SOMEWHAT SURPRISED)\n         Yes?\n\n                         MOORE\n              (AS    SHE DRAWS HER ASIDE)\n         My name    is... could I see some identification,\n         please?     My name is Wilson, I'm with the\n         F.A.A.     Could I see your badge, please?\n\nMRS. CROFT TAKES OUT AN EMPLOYEES BADGE AND SLIPS IT TO HER UNIFORM.\n\n                      MRS. CROFT\n         ...just coming to work...\n\n                      MOORE\n         I understand. ...I believe we've met before,\n         on my last...?\n                      (MORE)\n\n                                                                  71.\n\n\n                      MOORE (cont'd)\n              (HE CHECKS HER NAME AGAINST A\n               LIST ON A CLIPBOARD. HE TAKES\n               OUT A BADGE AND SHOWS IT TO HER.)\n         ...You are on Gate twenty-one this morning?\n\n                      MRS. CROFT\n         ...that is correct, Sir.\n\n                      MOORE\n         We will be conducting a Security Check. I\n         will be coming through the metal detector in\n              (HE CHECKS HIS WATCH)\n         approximately ten minutes. I will be quote\n         Armed, and carrying a toolkit in which are\n         hidden three potentially lethal or dangerous\n         items. This is a test of the security\n         personnel and of the apparatus under your\n         control. Now. I must caution you that, from\n         that time to this you will be under covert\n         surveillance, and should you attempt to\n         communicate\n\n                      MRS. CROFT\n         I wouldn't...\n\n                      MOORE\n               (SHRUGS)\n         ...you've been warned. Now: the guard under\n         your supervision will be graded on the\n         following:\n\nANGLE, INT THE AIRPORT CONCOURSE.\n\nPINCUS, DRESSED AS A SECURITY GUARD. STANDING BY A BANK OF\nPHONES. A YOUNG MOTHER WITH A CHILD COMES UP TO ASK DIRECTIONS OF\nHIS. HE DIRECTS THEM, AND TOUCHES HIS HAT, AND THEY MOVE OFF.\n\nANGLE EXT, AIRPORT DRIVETHROUGH.\n\nAT THE STATIONWAGON.\n\nMOORE LEANS IN, AND TAKES A LARGE TOOLCASE OUT OF THE BACK.\n\nIN THE B.G. WE SEE MRS. CROFT.     STILL STANDING BY THE COFFEETRUCK.\n\nFRAN LOOKS UP.\n\n                      FRAN\n         Here they come.\n\nMOORE LOOKS IN THE REARVIEW MIRROR.\n\nANGLE HIS POV\n\nTHE SECURITY TRUCK, PULLING INTO THE DRIVETHROUGH AREA.\n\nANGLE\n\nFRAN AND MOORE.   AS FRAN LOOKS OUT OF THE WINDOW.\n\n                                                                 72.\n\n\n                         FRAN (cont'd)\n            Where's the girl...?\n\nMOORE LOOKS AROUND.\n\n                         MOORE\n            ...yeah... okay... okay... it's okay.\n\nANGLE\n\nON MOORE, AS HE WALKS TO THE SECURITY GATE.\n\nANGLE, HIS POV.\n\nTHE SECURITY WALKTHROUGH.    A METAL DETECTOR, A GUARD SEATED AT A\nCONSOLE.\n\nMOORE LOOKS AROUND.    HE LOOKS AT HIS WATCH.\n\nHE TURNS BACK OUT TOWARD THE STREET.\n\nANGLE.   HIS POV.\n\nTHE SECURITY TRUCK.    PULLING UP.\n\nANGLE\n\nON MOORE.    AS HE WALKS TOWARD THE COFFEETRUCK.\n\n                         MOORE (cont'd)\n                 (TO THE COFFEEMAN)\n            What happened to Betty? Betty Croft...?\n\n                         COFFEEMAN\n            Hey, I don't know... she...\n\n                         MOORE\n            Gimme a cuppacoffee.\n\nANGLE\n\nON MOORE AS HE TAKES THE COFFEE AROUND THE SIDE OF THE COFFEETRUCK.\nHE PUTS IT UP ON THE HOOD.\n\nHE SCANS THE AREA.    THE SECURITY TRUCK IS GETTING CLOSER.\n\n                         MOORE (cont'd)\n                 (TO COFFEEMAN)\n            Gimme one of those...\n                 (MOORE POINTS)\n\nTHE COFFEEMAN HANDS MOORE A SMALL OBJECT.\n\nMOORE TAKES A WRAPPED PACKAGE OUT OF HIS POCKET.\n\nANGLE INS.\n\n                                                                73.\n\n\nWE SEE IT IS A FOIL WRAPPED CONDOM PACKET.   MOORE TAKES OUT THE\nCONDOM.\n\nMOORE TURNS AWAY FROM THE COFFEETRUCK.\n\nANGLE INS.\n\nMOORE DIGS IN HIS POCKET AND TAKES OUT A VERY SMALL AUTOMATIC\nPISTOL. HE PUTS THE PISTOL IN THE CONDOM, AND TIES IT SHUT, HE\nDROPS THE CONDOM INTO THE STEAMING COFFEE. HE STARTS TOWARD THE\nSECURITY GATE.\n\nANGLE\n\nON MOORE, CARRYING A CASE OF TOOLS, AS HE WALKS TO AN EMPLOYEE'S\nENTRANCE, SEVERAL EMPLOYEES IN WORK WEAR, STREAMING IN. MOORE TAKES\nAN EMPLOYEE'S BADGE, AND AFFIXES IT TO HIS COLLAR.\n\nANGLE INT SECURITY SHED.   EMPLOYEES STREAMING THROUGH THE METAL\nDETECTOR.\n\nMOORE PUTS HIS STEAMING COFFEE ON TOP OF THE MACHINE, AND PASSES\nTHROUGH.\n\n                      SECURITY GUARD.\n         ...up early or up late.\n\n                      MOORE\n              (OF THE COFFEE)\n         Not up at all, till I get that down...\n\n                      SECURITY GUARD.\n         I heard that.\n\n                      MOORE\n         Where's the, uh, where's the girl's usually\n         here, your Supervisor? They lett'n you play\n         all ? They lett'n you play\n         all by yourself?\n\n                      SECURITY GUARD.\n         Na, she's got this stomach thing.   Least\n         little...\n\n                      MOORE\n         Uh huh...\n\n                      SECURITY GUARD.\n         ...least little thing, sets her off...\n\nMOORE STANDS WAITING FOR HIS CASE OF TOOLS TO COME THROUGH THE X-\nRAY MACHINE.\n\nMOORE PICKS IT UP, AND GOES BACK TO TAKE HIS COFFEE, AND START OUT\nOF THE DOOR, INTO THE AIRPORT. HE LEAVES HIS CASE BEHIND HIM.\n\nANGLE EXT THE AIRPORT DRIVE-THROUGH.\n\n                                                               74.\n\n\nWE SEE THE STATIONWAGON PULLING OUT, AS, IN THE B.G., WE SEE THE\nSECURITY TRUCK PULLING INTO THE ARRIVALS AREA.\n\nANGLE\n\nIN THE STATIONWAGON, AS FRAN LOOKS DOWN AT HER WATCH.\n\nANGLE\n\nPINCUS, AT THE BANK OF PHONES, HE DOES THE SAME, AS HE TALKS ON\nTHE PHONE.\n\n                      PINCUS\n              (TO PHONE)\n         I have to inform you we have placed three\n         bombs... Three bombs. Inside your facility.\n\nHE HANDS UP THE PHONE AND CAMERA AT A BAGGAGE HANDLING AREA SHOWS\nHIM GOING INTO A MEN'S ROOM. MOORE RETRIEVES THE PISTOL FROM HIS\nCOFFEECUP. HE STARTS BACK TOWARD THE SECURITY AREA. AS HE WALKS\nHE TAKES APART THE FLASHLIGHT HANGING IN THE UTILITY BELT AT HIS\nWAIST, HE REMOVES A SMALL CANNISTER FROM THE BATTERY AREA.\n\nANGLE\n\nINT PASSENGER CONCOURSE.\n\nPINCUS, COMING OUT THE MEN'S ROOM, WEARING THE UNIFORM OF A GUARD.\nAS HE COMES OUT OF THE DOOR, WE SEE HE HAS LEFT HIS UTILITY CASE\nBEHIND.\n\nANGLE INT THE SECURITY SHED.\n\nTHE GUARD TURNS, AS MOORE REENTERS.\n\nANGLE ON MOORE, TO SHOW HE HOLDS THE PISTOL DOWN ALONG ONE THING,\nTHAT HE HOLDS THE CANNISTER ALONG THE OTHER.\n\n                      MOORE\n         ...how tired I am, I left my...\n              (HE GESTURES AT THE TOOLCASE HE\n               HAS LEFT BEHIND)\n\nTHE GUARD TURNS TO MAKE A JOKE.\n\nMOORE WALKS UP TO HIM, AND DISPLAYS THE SMALL PISTOL.\n\n                      MOORE\n         Please tell me the code for the main gate.\n\n                      GUARD\n              (LOOKING AT THE PISTOL)\n         Who the hell d'you think you're kidding with\n         that lll...\n\nMOORE SHOOTS THE PISTOL TOWARD THE GUARD'S FOOT.\n\n                                                                 75.\n\n\n                      MOORE\n         Please tell me the code.\n\nANGLE\n\nIN THE CONCOURSE. PINCUS, DRESSED AS A GUARD, EXTRACTS A SMALL SHIM\nFROM A LEATHER HOLDER. HE STARTS TOWARD A SECURITY DOOR. AN\nAIRLINE EMPLOYEE IN UNIFORM ENTERS BEFORE HIM.\n\nAS HE STARTS TOWARD THE DOOR, THERE IS AN EXPLOSION BEHIND HIM, AND\nSMOKE FILLS THE HALL.\n\n                      PINCUS\n         ...hold that door... hold that door...\n\nTHE AIRLINE EMPLOYEE HOLDS THE DOOR OPEN AND PINCUS ENTERS.\n\nINT SECURITY SHED, DAY.\n\nMOORE IS GLANCING AT THE VIDEO DISPLAYS. WE SEE ON ONE OF THE\nDISPLAYS, THE SECURITY TRUCK TURNING TO ENTER THE SECURITY GATE\nAREA.\n\nANGLE\n\nON MOORE, AS HE DISCONNECTS THE VIDEO, AND WE SEE THE SCREEN GO\nBLANK. HE TURNS TO SHOW PINCUS, COMING INTO THE SHED BEHIND HIM.\n\nWE HEAR ON THE LOUDSPEAKER.\n\n                      LOUDSPEAKER\n         Attention... Attention, we have a code Four,\n         and a Fire. I repeat, a code Four, and a\n         Fire, at...\n\nANGLE\n\nON THE SECURITY TRUCK, AS THE GATES SWING OPEN, AND IT ENTERS THE\nSECURITY AREA.\n\nANGLE\n\nON PINCUS, AS HE TAKES A SEAT AT THE SECURITY CONSOLE. AND MOORE\nGETS ONTO THE SLOW MOVING SECURITY TRUCK. WE SEE THE SECURITY\nGATES CLOSE BEHIND IT.\n\nEXT AIRPORT DAY.\n\nTHE TAIL OF A PLANE WITH A HUGE SWISS CROSS AS PART OF ITS LOGO.\n\nCAMERA PANS TO SHOW IT IS A CARGOPLANE, MARKED AEROHELVETICA.\n\nANGLE INT THE COCKPIT, AEROHELVETICA CARGO PLANE.\n\nTHE PILOT IS CONVERSING WITH SOMEONE ON THE RADIO.   HE SPEAKS\nENGLISH WITH A FOREIGN ACCENT.\n\n                                                                    76.\n\n\n                      PILOT\n         ...clearance for...\n              (BEYOND, ON THE TARMAC, WE SEE\n               THE SECURITY TRUCK COMING\n               TOWARD THE PLANE.)\n         ...Yes. Aero, 294. Requests permission to\n         take the Active...\n              (PAUSE. HE LISTENS. NODS)\n         Aero 294 for runway two-six.\n              (TO HIS CO-PILOT, IN GERMAN)\n         Let's get out of here...\n\nANGLE, INT THE COMMUTER CAR LAVATORY.    THE SMALL DEVICE AFFIXED TO\nTHE CEILING.\n\nANGLE EXT THE OVERPASS.    WE SEE A TRAIN APPROACHING IN THE\nDISTANCE.\n\nANGLE\n\nTHE SMALL ELECTRONIC DEVICE ON THE UNDERSIDE OF THE STONE ARCH.\n\nWE SEE THE LIGHT GO FROM STEADY RED TO BLINKING RED.\n\nANGLE THE OVERPASS.   AS THE TRAIN APPROACHES.   THE ARCH EXPLODES.\n\nANGLE\n\nTHE CAB OF THE TRAIN.     AS THE ENGINEER SEES THE ARCH CRUMBLING\nBEFORE HIM.\n\nANGLE\n\nTHE TRAIN SLOWING DOWN, BRAKES SCREECHING.\n\nANGLE\n\nIN THE LAVATORY, AS THE DEVICE EXPLODES.\n\nANGLE\n\nEXT THE TRAIN, TO SHOW THE TRAIN SLOWING, AND THE LAST CAR\nSPOUTING FLAMES. CAMERA CRANES UP TO SHOW THE TRAIN STOPS.\n\nJUST BELOW A BANK OF LANDING LIGHTS, AND, BEYOND, IS THE AIRPORT.\n\nANGLE\n\nINT THE JET COCKPIT\n\nTHE JET IS TAXIING, AND, IN THE B.G., WE SEE THE FLAMES FROM THE\nBURNING COMMUTER TRAIN CAR.\n\n                      CO-PILOT\n              (IN GERMAN)\n         ...what the hell is that...?\n\n                                                                  77.\n\n\nTHE PILOT MOTIONS \"KEEP QUIET.\"    HE PUTS HIS HAND TO HIS EARPHONES.\nAND LISTENS.\n\n                       PILOT\n          Affirmative. 294, to return to Area A\n               (PAUSE)\n          294.\n               (TO COPILOT)\n          Back to the barn...\n\nHE LOOKS DOWN.\n\nANGLE HIS POV\n\nTHE SECURITY TRUCK, COMES ALONGSIDE, AND KEEPS STATION WITH THE\nMOVING PLANE. WE SEE, FROM THE PILOTS POV, MOORE, IN THE TRUCK,\nMOTIONING, \"BACK TO THE GATE.\"\n\nANGLE ON THE PILOT\n\n                       PILOT (cont'd)\n                (TO HIMSELF)\n          ...yes. We understand...\n\nHE SIGHS. AND MOTIONS TO     THE CO-PILOT, WHO PROCEEDS BACK INTO THE\nCARGO AREA. CAMERA TAKES     HIM PAST SEVERAL LARGE CRATES MARKED\n\"MACHINE PARTS\" TO HYWEST    FOUNDRY, PAST SEVERAL LARGE METAL\nCONTAINERS. TO THE CARGO     DOOR. WE SEE THE PLANE JOLT TO A STOP.\nTHE CO-PILOT ENTERS A CODE    IN A PANEL NEAR THE DOOR. AND THE DOOR\nSLIDES OPEN TO REVEAL THE    SECURITY TRUCK BELOW, AND TWO MEN GETTING\nOUT OF IT.\n\nANGLE\n\nON THE TARMAC. MOORE, IN A SECURITY UNIFORM, HOISTS HIMSELF UP ONTO\nTHE HOOD OF THE CAR, AND INTO THE CARGO DOOR.\n\nANGLE\n\nON BLANE AND BELLA, BELOW, BELLA STARTS TO FOLLOW MOORE.     BLANE\nRESTRAINS HIM.\n\n                       BLANE\n          ...stick with the program.    Stick with the\n          program...\n\nANGLE.   INT THE CARGOPLANE.\n\nON MOORE, AS HE WALKS PAST THE CRATES OF MACHINE TOOLS AND THE\nUNMARKED METAL CRATES, TOWARD THE COCKPIT.\n\nANGLE.   INT THE COCKPIT.\n\nAS THE PILOT TURNS AROUND.\n\nAS MOORE ENTERS.\n\n                                                                 78.\n\n\n                         MOORE\n            ...we have a report of...\n\n                         PILOT\n            Yes, we're getting it over the radio...\n\nMOORE TAKES A SMALL BATON FROM HIS BELT AND CLOUTS THE PILOT AND\nTHEN THE COPILOT WITH IT. BLANE MOVES UP TO HIM. TAKES A ROLL OF\nGAFFTAPE FROM HIS BELT, AND BEGINS BINDING THE TWO MEN TO THEIR\nSEATS, FIRST GAGGING THEM WITH THE TAPE.\n\n                         MOORE\n            ...make sure they're breathing...\n\nANGLE. IN THE CARGO AREA. ON BLANE. BEYOND HIM WE SEE MOORE\nSTANDING OVER THE TWO SPRAWLED FORMS OF THE PILOT AND THE CO-\nPILOT.\n\nANGLE\n\nON MOORE, AS HE REMOVES A KEY FROM THE NECK OF THE CO-PILOT, AND\nWALKS BACK TO MOORE, THEY OPEN ONE OF THE METAL CASES.\n\nANGLE, INT THE METAL CASE. IT IS FILLED WITH LARGE INGOTS COVERED\nIN BURLAP. MOORE HANDS OPEN ONE TO REVEAL IT IS GOLD. THE GOLD\nINGOT IS STAMPED CREDIT NATIONAL DE GENEVE.\n\nANGLE\n\nON MOORE.\n\nAS HE DETACHES A SMALL CONVEYOR FROM THE INTERIOR OF THE CARGO\nAREA, AND LOWERS IT DOWN TO THE BACK OF THE SECURITY TRUCK.\n\nANGLE\n\nIN THE SECURITY TRUCK. BELLA, ACCEPTS THE CONVEYOR. THE BELT OF\nTHE CONVEYOR BEGINS TO MOVE, AND THE COVERED IGNOTS TO DESCEND DOWN\nTHE SLIDE.\n\nANGLE.   ON BELLA AS HE UNCOVERS ONE OF THE INGOTS, TO REVEAL IT IS\nGOLD.\n\nBLANE DROPS DOWN NEXT TO HIM.\n\n                         BLANE\n            ...let's get with it...\n\nHE AND BELLA MOVE TO THE HUGE ENGINE HELD IN THE BODY OF THE TRUCK.\nTHEY PIVOT IT OPEN, AND BEGIN TO FILL THE EMPTY INTERIOR WITH THE\nCOVERED BARS.\n\nANGLE INT THE CARGOPLANE.\n\nMOORE LOADING THE COVERED INGOTS ONTO THE CONVEYOR.   HE LOOKS AT\nHIS WATCH.\n\nINT SECURITY SHED DAY.\n\n                                                                   79.\n\n\nON PINCUS, DRESSED AS A SECURITY GUARD. AS HE LUGS THE UNCONSCIOUS\nGUARD ACROSS THE FLOOR, AND INTO A LAVATORY. HE CLOSES THE DOOR,\nAND STARTS BACK TOWARD HIS POSITION AT THE SECURITY CONSOLE.\n\nAS HE STARTS BACK, TWO STATE TROOPERS PULL UP IN THEIR CRUISER.     AT\nTHE MAIN GATE. THEY HONK THE HORN.\n\nANGLE, ON PINCUS, AS HE PROCEEDS OUT TO THEM. WE SEE ONE OF THE\nPOLICEMEN IS HOLDING HIS BADGEHOLDER OUT OF THE WINDOW, TOWARD THE\nVIDEO CAMERA. PINCUS WALKS UP TO THE CAR.\n\n                      TROOPER\n         Get the gate open...\n\n                      PINCUS\n              (AS HE MAKES A NOTATION ON A\n               CLIPBOARD)\n         I got to take down your badge nnn...\n\n                      TROOPER\n              (AS HE GESTURES AT THE\n               VIDEOCAMERA)\n         I'm holdin' it up to the damn...\n\n                      PINCUS\n         ...the video's out.\n\nHE STARTS BACK TOWARD THE SECURITY SHED.     ONE OF THE TROOPERS\nFOLLOWS.\n\n                       TROOPER\n              (IN CAR)\n         Get the gate open...?\n\nANGLE\n\nINT THE SECURITY SHED.   PINCUS COMING BACK IN, FOLLOWED BY THE\nOTHER TROOPER.\n\n                      TROOPER (cont'd)\n         Can we get the gate open...?\n\n                      PINCUS\n         You're looking at me doing it...\n\nPINCUS PUNCHES NUMBERS INTO THE BOARD, AND WE SEE THE GATE SWING\nOPEN BEYOND THEM. THE TROOPER, IN THE B.G. STARTS TO OPEN THE DOOR\nTO THE LAVATORY.\n\n                      TROOPER\n         ...who's been through here...?\n\n                       PINCUS\n         Well I.   I can tell you who's...\n\n                      TROOPER\n              (AS HE WALKS TOWARD THE LAVATORY)\n         Gimme a list of any...\n\n                                                                 80.\n\n\n                      PINCUS\n         I put it on, it's all on the computer, n'the\n         computer went down...\n\nTHE TROOPER STARTS TO OPEN THE DOOR TO THE LAVATORY\n\n                      PINCUS (cont'd)\n              (SCREAMING)\n         Don't touch the door. For Godsake. Don't\n         touch the door-- din't you hear, on the rrr...\n         one guy, got his arm blown off, the bombsquad\n         said not to...\n\nANGLE, EXT, THE TARMAC\n\nMOORE IN THE CARGOPLANE. LOOKS AROUND. HAULS UP THE CONVEYOR,\nPUNCHES A BUTTON ON THE CONTROL PANEL, THE HATCH STARTS TO CLOSE.\n\nANGLE EXT THE PLANE.\n\nON THE TARMAC, THE TRUCK. WE SEE, INTERIOR. BELLA AND BLANE,\nSWINGING CLOSED THE HOLLOW ENGINE, THEY PULL THE REAR DOOR OF THE\nTRUCK CLOSED. AS MOORE JOINS THEM, IN THE CAB OF THE TRUCK.\n\nANGLE INT THE CAB OF THE TRUCK.\n\nBLANE, HOLDS UP A WALKIE TALKIE, WHICH IS SPOUTING SECURITY UPDATES.\nHE NODS AT MOORE TO SAY \"I THINK WE ARE ALRIGHT.\"\n\nANGLE, THEIR POV\n\nTHE SECURITY GATE AHEAD OF THEM. THE TROOPER'S CRUISER PARKED\nINSIDE OF IT. BLOCKING THE EXIT.\n\nANGLE\n\nTHE THREE MEN IN THE TRUCK.\n\nBEAT.\n\n                      MOORE\n              (TO BELLA, WHO IS DRIVING)\n         Honk the horn.\n              (PAUSE)\n         ...what'm I telling you...?\n\nBELLA HONKS THE HORN, TENTATIVELY.\n\nANGLE, THEIR POV THE TROOPERS, ONE IN THE CAR, ONE INSIDE THE\nSECURITY AREA, TALKING WITH PINCUS.\n\nANGLE\n\nINSIDE THE TRUCK.   AS MOORE LEANS OVER AND LEANS ON THE HORN.\n\nANGLE\n\n                                                                 81.\n\n\nTHE TROOPER IN THE CAR SIGHS, AND PULLS HIS CAR UP, SO THAT THE\nTRUCK CAN PASS.\n\nANGLE EXT THE SECURITY SHED. AS PINCUS MOVES PAST THE TROOPER, TO\nTHE TRUCK, WHICH IS MOVING THROUGH THE SECURITY AREA.\n\n                      PINCUS\n              (TO THE TROOPER)\n         Would you please, would you please...?\n              (TO THE TRUCK)\n         Excuse me. Excuse me... No one is to leave\n         this...\n\n                      BLANE\n              (CALLING OUT OF THE TRUCK)\n         ...would you get out of the way...?\n\n                      PINCUS\n         I'm trying to do my job, I'm\n              (APPEALING TO THE POLICE OFFICERS)\n         I am a, like you, just like you, I am trying\n         to do my Sworn...\n\nANGLE, ON PINCUS, AS HE SEES SOMETHING, IN THE POLICE CRUISER.\n\nANGLE HIS POV.   TAPED TO THE VISOR OF THE POLICE CRUISER.\n\nINS. OF A SHOT OF MOORE (A PHOTO TAKEN FROM AND WHICH WE\nRECOGNIZE AS TAKEN IN THE VIDEO AT THE JEWELRY STORE, I.E., MOORE\nLOOKING UP AT THE VIDEOCAMERA.)\n\nANGLE, ON PINCUS, LOOKING AT THE SHOT.\n\nHE WIPES HIS FOREHEAD. AND CONTINUES TALKING TO THE TROOPERS\nWHILE HE PASSES AN INFINITESIMAL \"GET OUT OF HERE...\" SIGNAL\nTOWARD THE SECURITY TRUCK.\n\nANGLE\n\nIN THE TRUCK.    AS THEY DRIVE THROUGH THE GATES.\n\n                      BLANE\n         Don't look back... don't look back...\n\n                      BELLA\n         How's he... how is he...?\n\n                      BLANE\n         Well, that's just gonna have to be as it\n         is...\n              (HE TAKES OUT A CELLPHONE AND\n               DIALS AS HE SPEAKS.)\n              (INTO PHONE)\n         I got a broke down truck, excuse me, I called,\n         could I speak to your supervisor please...? I\n         got one of your trucks, engine failure, I\n         called first at Five, five twenty, this...\n         this is my forth call... Right outside the\n         Airport.\n                      (MORE)\n\n                                                                   82.\n\n\n                         BLANE (cont'd)\n                 (PAUSE)\n            Industrial and 2-0-seventh, I... Yes, thank\n            you. I'm an attorney... could I have your\n            name please...? Could I have your name,\n            please, because I'm going to have to speak\n            to your supervisor...\n\nANGLE\n\nON MOORE, AS HE STEALS A GLANCE BACK AT PINCUS.\n\nANGLE HIS POV\n\nON PINCUS, TALKING WITH THE TWO TROOPERS.\n\nINT THE CARGOPLANE DAY\n\nTHE THREE METALLIC CRATES OPEN, PAN PAST THE \"MACHINE PARTS\"\nCRATES, ONTO THE TWO MEN IN THE COCKPIT. THE PILOT STARTS TO\nSTIR, GROGGILY.\n\nANGLE EXT\n\nON THE VAN AS IT COMES ONTO A SMALL ACCESS ROAD.    WE SEE THEIR\nAIRPORT IN THE B.G.\n\nANGLE\n\nEXT THE STATIONWAGON, DRIVEN BY FRAN, PULLING INTO THE ARRIVALS\nAREA. SHE DRIVES SLOWLY BY THE SECURITY GATE.\n\nANGLE HER POV\n\nIN THE B.G. WE SEE PINCUS STILL TALKING TO THE TROOPERS.\n\nANGLE\n\nON PINCUS, AS HE STEALS A GLANCE AT HIS WATCH.     HE LOOKS UP.\n\nANGLE HIS POV\n\nIN THE B.G., FRAN, DRIVING THE STATIONWAGON SLOWLY.\n\nANGLE, INT, THE SECURITY STATION.\n\nONE OF THE TROOPERS GETS A CALL ON THE WALKIE-TALKIE.\n\n                         TROOPER\n                 (INTO THE WALKIE)\n            Four nine, go.\n                 (PAUSE)\n            Where...? Oh shit...\n\nHE HURRIES OUT TO THE CAR.    HE TURNS BACK, TOWARD PINCUS.\n\n                         TROOPER (cont'd)\n                 (CALLING)\n            Aerohelvetica. Cargo...?\n\n                                                               83.\n\n\n                        PINCUS\n          Bay Five.   Go Left.   Bay Five...\n\nWE SEE THE TROOPERS IN THE CAR HURRY OFF.\n\nPINCUS STARTS STRIPPING OFF HIS SECURITY UNIFORM, AS WE WALKS OUT\nOF THE SECURITY SHED, TOWARD FRAN IN THE CAR.\n\nANGLE INT THE STATIONWAGON AS PINCUS GETS UP, AND MOTIONS FRAN TO\nDRIVE QUICKLY. WE HOLD ON THE STATIONWAGON LEAVING THE AIRPORT\nDRIVETHROUGH.\n\n                       FRAN\n          How...?\n\nANGLE. THE STATIONWAGON DRIVING PAST A ROW OF ORANGE-VESTED\nROADWORKERS, WHO ARE LAYING TAR ON THE ROADWAY.\n\nTHE STATIONWAGON SLOWS.\n\nANGLE INT THE CAR.\n\n                       PINCUS\n          Wait wait wait wait wait.\n               (HE GESTURES HER TO STOP)\n\nANGLE EXT THE STATIONWAGON.\n\nON PINCUS AS HE TAKES A TRASH BAG, AND THROWS IT INTO A ROADSIDE\nTRASH CONTAINER.\n\nANGLE\n\nON THE VAN, AS IT PULLS INTO A PARKING GARAGE.\n\nANGLE -\n\nA MOSTLY EMPTY FLOOR OF THE PARKING GARAGE.\n\nTHE VAN PULLING UP.\n\nMOORE AND BLANE GET OUT, AND START TO LOOK DOWN TOWARD THE AIRPORT.\n\nMOORE LOOKS AT HIS WATCH. BLANE GOES TO THE SIDE OF THE VAN,\nHESITATES, AND LOOKS AT MOORE.\n\n                       BLANE\n          ...where's your explosion...?\n\n                       MOORE\n               (HE LOOKS AROUND, THEN, TO\n                BLANE)\n          Do it...\n\nBLANE NODS TO MOORE, AND THEY BEGIN TO STRIP THE \"SKINS\" OFF THE\nSIDE OF THE SECURITY TRUCK, TO REVEAL IT IS A RYDER RENTAL TRUCK.\n\nANGLE INT THE TRUCK\n\n                                                                   84.\n\n\nMOORE OPENS THE BACK PANEL, HE REMOVES A LARGE GARBAGE BAG.       AND\nACCEPTS THE REMOVED SKINS AND LICENSEPLATES FROM BLANE.\n\nIN THE FRONT WE SEE BELLA, GETTING OUT OF HIS SECURITY UNIFORM.\n\nAND, IN THE REAR, BLANE AND MOORE DOING THE SAME.\n\nMOORE OPENS THE FAKE ENGINE, AND STUFF THE UNIFORMS, ET CETERA,\nINSIDE.\n\n                      BELLA\n              (LOOKING BACK)\n         Here she comes...\n\nANGLE ON BLANE, AS HE TURNS.\n\nANGLE, HIS POV.\n\nTHE STATIONWAGON, COMING UP THE RAMP.    FRAN AND PINCUS IN IT.\n\nANGLE\n\nON THE MEN IN THE TRUCK.\n\nON MOORE, AS HE LOADS THE MATERIALS INTO THE ENGINE.\n\n                      MOORE\n         Is he with her...?\n\n                      BLANE\n         Yeah he's there.\n\nHE PICKS UP ONE OF THE BARS FROM THE FAKE ENGINE AND PULLS OFF THE\nCOVERING, TO REVEAL IT IS GOLDEN. HE SMILES\n\n                      BLANE (cont'd)\n         Yeah, he's there.\n\nTHE STATIONWAGON PULLS UP BY THE TRUCK.     PINCUS GETS OUT AND WALKS\nTO THE BACK OF THE TRUCK.\n\n                      MOORE\n              (TO PINCUS)\n         Where's my diversion...?\n\n                      PINCUS\n         I... I threw it in the garb... Joe:     Joe,\n         Listen:\n\n                      MOORE\n         Where's my explosion, I'm up here naked...\n\n                         PINCUS\n         Joe:     they got your...\n\nHE LOOKS INSIDE THE TRUCK.     HE TAKES OUT AND LOOKS AT THE HALF-\nOPENED BAR OF GOLD.\n\n                                                              85.\n\n\n                      PINCUS\n         Joe... they got your...\n\nBLANE SHOWS HIM THE GOLDEN BAR.\n\n                      PINCUS (cont'd)\n         Go sell chocolate, you Heidi Motherfuckers.\n         Go see Cookoo Clocks. WE GOT YOUR GOLD...\n\nANGLE\n\nON BLANE, AS HE TAKES THE ROLL OF TAPE FROM HIS BELT, AND TAPES\nTHE COVERING AGAIN OVER THE BAR. HE REPLACES THE BAR, AND MOORE\nSHUTS UP THE FAKE ENGINE.\n\n                      FRAN\n              (TO MOORE)\n         How'd it go?\n\n                      BLANE\n         It got a little tight in there.\n\n                      PINCUS\n              (TO MOORE)\n         They got your photo.\n\n                        MOORE\n         Who?\n\n                        PINCUS\n         The Staties.    I saw it in the car.   I.\n\n                       MOORE\n         Forget it.   Let's...\n\nBLANE MOVES TO A SEDAN, WHICH THEY ARE PARKED, TAKES OUT KEYS, OPENS\nIT, AND BEGINS PUTTING ON A SUITCOAT AND A HAT WHICH ARE FOUND ON\nTHE SEAT.\n\n                      BELLA\n         ...they got your photo...?\n\n                      MOORE\n         Yeah, well, that's a Hazard of the jjj...\n\n                      BELLA\n         You can't go through the roadblock if...\n\n                      MOORE\n         I told you on the day, they had me, you...\n\n                      BELLA\n         Yeah, but you... I can't have you going\n         through the...\n\n                      MOORE\n         I stay with the gold.\n\n                                                              86.\n\n\n                      FRAN\n         Joe, he's right if...\n\n                      MOORE\n         You're gonna side with the guy, you're gonna\n         side against me? You gonna talk against me,\n         Fran?\n\n                      FRAN\n         I'm saying...\n\n                      BELLA\n         Fuck it... if they got you on film I am not\n         going through that with the gold and you in\n         the truck.\n\n                      MOORE\n         I stay with the gold.\n              (PAUSE)\n         I stay with the gold.\n\n                      BELLA\n         They got you on film, you got to go.     You'll\n         never make the road block... Joe...\n\n                      MOORE\n         I got to go with the gold.\n\n                      BELLA\n         You know, your wife said it...\n\nANGLE, ON BLANE, AS HE LOOKS OUT OF THE PARKING GARAGE.\n\nANGLE, HIS POV.\n\nON THE ACCESSROAD, SEVERAL STATE POLICE CARS, SETTING UP A\nROADBLOCK.\n\n                      BLANE\n         Joe, we gotta go.\n\n                       MOORE\n         You go.   See you at the rendezvous...\n\nANGLE ON BLANE, AND PINCUS, WHO IS TAKING CLOTHES FROM THE SEAT OF\nTHE SEDAN. HE STARTS TO GET IN. REACHES BACK, AND HANDS PIECES OF\nPAPER TO MOORE.\n\n                      PINCUS\n         ...parking tickets, you've been here two\n         days...\n\nHE GETS INTO THE SEDAN, AND THE SEDAN PULLS AWAY.\n\nMOORE STARTS TO GET INTO THE VAN.\n\n                      BELLA\n         ...you're burnt.\n\n                                                               87.\n\n\n                      MOORE\n         Then we'll all go together.\n\n                      BELLA\n         I do not see the percentage...\n\n                      MOORE\n         You don't have to, Baby...\n\n                      FRAN\n         ...you can't make the Roadblock, Joe...\n\n                      BELLA\n         You're burnt, for chrissake.   You're fucken\n         burnt Old Man... What're you,  telling your\n         Beads \"I go with the Gold\"...  Look here: You\n         tell me: what're they gonna   be looking\n         harder at? You tell me, you   here with us, or\n         you in an empty car.\n              (PAUSE)\n         You tell me.\n              (PAUSE)\n         You tell me? You follow us.     Through the\n         roadblock, for chrissake.\n              (PAUSE)\n         Eh? You follow us thr...\n\nMOORE TURNS TO BLANE.\n\n                      BLANE\n         You're burnt, Joe. You're burnt.     It's the\n         wise thing. What do you lll...?\n\n                      MOORE\n         I follow you to the rendezvous...\n              (TO FRAN)\n         Gimme the keys...\n\nSHE PASSES THE KEYS TO BELLA, WHO HANDS THEM TOWARD MOORE.\n\n                      PINCUS\n         ...Joe, get in the c...\n\nANGLE, ON MOORE, AS HE ADDRESSES FRAN, AS SHE GETS INTO THE TRUCK.\n\n                      MOORE\n         ...stay with the ggg...\n              (HE LOOKS DOWN AT THE KEYS. WE\n               SEE THEY ARE NOT THE SAME KEYS\n               WHICH FRAN HANDS TO BELLA)\n              (TO BELLA)\n         You palmed the keys, you palmed the keys, you\n         motherf...\n\nHE LOOKS DOWN AT THE KEYS IN HIS HAND. HE GRABS BELLA'S WRIST, AND\nTURNS IT OVER TO SHOW A SECOND SET OF KEYS IN BELLA'S HAND.\n\n                                                                  88.\n\n\n                        MOORE (cont'd)\n           ...what's, what's the deal, you're gonna\n           leave me, alone, in the...\n\nTHERE IS A SOUND OF AN EXPLOSION. MOORE TURNS HIS HEAD, WE SEE\nBEYOND AND BELOW HIM, THE GARBAGE CAN, BURSTING INTO FLAMES, AND\nSPOUTING SMOKE.\n\nANGLE, ON BELLA, AS HE TAKES OUT HIS PISTOL AND CLOUTS THE\nDISTRACTED MOORE.\n\nANGLE XCU.\n\nON FRAN.\n\n                        FRAN\n           ...no...\n\n                        BELLA\n           Get in the truck. Get in the truck... Get in\n           the truck...\n\nANGLE\n\nHE FORCES HER INTO THE VAN.\n\nANGLE\n\nTHE VAN COMING DOWN THE RAMP.\n\nANGLE INT THE VAN.    BELLA DRIVING, COMING UP ON THE CASHIER'S\nBOOTH.\n\n                        BELLA\n                (TO FRAN)\n           Gimme the ticket.\n                (PAUSE)\n           Gimme the ttt...\n\n                        FRAN\n           ...you left'em up there with Joe...\n\nANGLE, AT THE CASHIER'S BOOTH.\n\n                        CASHIER\n           ...morning...\n\n                        BELLA\n           I, uh...\n\n                        FRAN\n                (SOTTO)\n           ...get us out of here...\n\n                        BELLA\n           I seem to've lost my ticket...\n\n                                                                89.\n\n\n                         CASHIER\n         Oh, man.     I'm sorry.\n\n                        BELLA\n         ...just...\n\n                      CASHIER\n         Look, f'you c'n show me some... something,\n         your airline ticket, something...\n\n                      BELLA (cont'd)\n         ...just tell me what the full freight is,\n         for...\n\n                      CASHIER\n         Sure, but, between you 'n me? They give me\n         some leeway, so, f'you c'n show me some\n         \"Proof,\" 'bout, how long...\n\n                      FRAN\n         Just, would you just, however long, the...\n\n                      CASHIER\n         ...lost Ticket charge, hundred fifty dollars.\n         I don't think you...\n\nFRAN DIGS IN HER POCKET, AND STARTS PAYING HIM.\n\n                      CASHIER (cont'd)\n         I'm telling you, I hate to...\n\n                      FRAN\n         We're in a hurry...\n\nTHE CASHIER SHRUGS.\n\n                      CASHIER\n         ...you must be some kind of rich...\n\nHE HANDS THEM A RED RECEIPT, WHICH IS PRINTED \"STAYS OVER 72 HOURS.\nLOST TICKET CHARGE. PAID.\"\n\nANGLE\n\nON BELLA, AS HE TAKES THE RECEIPT, AND THROWS IT ON HIS DASHBOARD,\nAND DRIVES OFF.\n\nANGLE, ON MOORE, ON THE PAVEMENT, AS HE STIRS, AND SHAKES HIS\nHEAD...\n\nANGLE\n\nON THE VAN, COMING OUT OF THE PARKING GARAGE, AND ONTO THE ACCESS\nROAD.\n\nANGLE\n\nON THE VAN, GOING ONTO THE SHOULDER OF THE ACCESSROAD.\n\n                                                                     90.\n\n\nBELLA JUMPS OUT OF THE VAN, AND RAISES THE HOOD. HE TAKES OUT A\nSCREWDRIVER, AND USES IT TO DISCONNECT SEVERAL WIRES.\n\nHE WALKS BACK TO THE VAN.\n\n                      FRAN\n         You didn't have to hit him...\n\n                      BELLA\n         Yea? When'd you get so tough.        You didn't\n         used to be so tough...\n\n                         FRAN\n         I...\n                 (SHE SEES SOMETHING IN THE\n                  REARVIEW MIRROR)\n\nANGLE BELLA'S POV.\n\nA WRECKER TRUCK COMING DOWN ALONG THE ROAD.      IT VEERS ONTO THE\nACCESS ROAD, AND PUTS ON ITS FLASHES.\n\nANGLE\n\nBELLA AND FRAN\n\n                      BELLA\n         Yeah, that's about as close as I ever want it\n         to be...\n\n                      FRAN\n         ...why did you have to hurt him...?\n\n                      BELLA\n         ...hey, din't we make that decision...?\n\nANGLE\n\nAS THE MAN FROM THE WRECKER BACKS HIS TRUCK UP TO THE HOOD OF\nTHE RENTAL TRUCK.\n\nFRAN COMES OUT TO TALK TO HIM.\n\n                      FRAN\n         Where the, where the hell, excuse me. Good\n         morning. We've been sitting here, since...\n\nTHE MECHANIC FROM THE WRECKER ADVANCES TOWARD THEM.\n\n                      MECHANIC\n         I'm sorry, we've got a full day... I got four\n         false calls this morning, four false calls.\n         I...\n\nHE STARTS TO OPEN THE HOOD.\n\n                                                                91.\n\n\n                      FRAN\n         That's not going to do you a whole raft of\n         good. That's dead as Kelsey's nuts...\n\nANGLE\n\nSEVERAL COP CARS ESTABLISHING THE ROADBLOCK. WE SEE TWO OF THE\nCOPS GET INTO A CRUISER, AND PULL UP TOWARD THE WRECKER AND THE VAN.\n\nANGLE\n\nON BELLA AND FRAN IN THE VAN.   BELLA TAKES OUT A CIGARETTE.\n\n                      FRAN (cont'd)\n         Don't smoke the cigarette.\n\n                      BELLA\n         ...what kind of people try to look calm...?\n\nANGLE INT THE POLICE CRUISER. AS IT COMES UP ON THE TOWTRUCK,\nWHICH IS HAULING UP THE \"BROKEN\" RENTAL TRUCK.\n\nONE OF THE OFFICERS GETS OUT OF THE STOPPED CRUISER AND WALKS\nTOWARD THE TRUCK, THE OTHER STAYS ON THE RADIO, AND THEN FOLLOWS.\n\n                      OFFICER ONE\n              (AS HE APPROACHES THE GROUP\n               AROUND THE TWO TRUCKS)\n         Morning,\n\nANGLE ON OFFICER TWO AS HE WALKS AROUND TO THE BACK OF THE TRUCK.\n\n                      OFFICER TWO\n         ...would you stand away, please...?\n\nOFFICER TWO MOVES INTO THE BACK OF THE TRUCK, CAMERA FOLLOWS TO\nSHOW HIM WALKING UP TO THE OTHER SIDE.\n\nANGLE EXT THE TRUCK.\n\n                      OFFICER ONE\n              (TO FRAN)\n         How long has this truck been here?\n\n                      FRAN\n              (TO THE MECHANIC)\n         Ask him...\n\n                      MECHANIC\n         ...the, uh, we got the first call at...\n\n                      FRAN\n         We've been here since...\n\n                                                                   92.\n\n\n                        OFFICER ONE\n           One moment, please.\n\n                        MECHANIC\n           We got the breakdown call at five-twenty,\n           this.\n\n                        FRAN\n           This is great, this is great, a four hour\n           breakdown n'i'm gonna get arrested, all in\n           One Swell Day. Whatsa Charge...?\n\n                        OFFICER TWO\n                (AS HE COMES BACK AROUND FROM THE\n                 BACK, COMING UP TO FRAN.)\n           ...what you hauling...?\n\n                        FRAN\n           Marine 'quipment.\n\n                        OFFICER TWO\n           Marine what...?\n\n                        OFFICER ONE\n           ...would you open the rear, please...?\n\nANGLE\n\nON FRAN.   AS SHE GETS DOWN, AND WALKS THE COP TO THE BACK.\n\n                        FRAN\n           ...it's an auxiliary engine, some rich guy's\n           toy...\n\nSHE OPENS THE REAR OF THE VAN.      THE POLICEMAN STARTS INVESTIGATING\nTHE ENGINE.\n\n                          OFFICER\n           ...some toy.\n\n                        FRAN\n                (TAKES OUT A STICK OF GUM AND PUTS\n                 IT IN HER MOUTH.)\n           ...maybe he's compensating fr'something...\n                (OFFERS A STICK OF GUM TO THE\n                 COP, WHO DECLINES)\n           what's the deal, what're you looking for...?\n\nANGLE\n\nON OFFICER TWO AND BELLA, WHO IS IN THE CAB.\n\n                        OFFICER TWO\n           How long you been out here...?\n\n                        BELLA\n           Broke down, this morning, five, five\n           fifteen...\n\n                                                                93.\n\n\n                      OFFICER TWO\n         What'dja eat...?\n\n                      BELLA\n         Nothing, you know, nothing to eat... nothin'\n         to eat but luckies...\n\nHE REACHES FOR CIGARETTES ON THE DASHBOARD.\n\nANGLE INS.   WE SEE THE LARGE RED RECEIPT PARKING OVER 72 HOURS,\nETC.\n\nANGLE\n\nON BELLA AS HE TAKES THE CIGARETTE AND LIGHTS IT, HE PUTS THE\nMATCHES BACK ON THE DASH, NEXT TO SOME PAPERWORK.\n\n                      OFFICER ONE\n         ...you been sitting out here all morn...?\n\nANGLE\n\nON FRAN, AS SHE WALKS UP, FOLLOWED BY THE OTHER COP.\n\n                      FRAN\n         You guys wanna wave your magic wand n'make\n         it different, that's awright with me...\n\n                      BELLA\n         ...look at the paperwork...\n\nHE STARTS TO REACH FOR THE CLIPBOARD.\n\nANGLE, FRAN'S POV INS.   THE RED LATE TICKET SLIP ON THE\nDASHBOARD.\n\nANGLE\n\nON THE OFFICER ONE, AS HE REACHES INTO THE CAB FOR THE PAPERWORK.\n\n                      FRAN\n         Yeah. Lookit the paperwork.    Tell you what,\n         keep the paperwork.\n\nSHE REACHES PAST HIM, PICKS UP THE RED RECEIPT, TAKES OUT HER GUM\nAND PUTS IT IN THE PAPER, CRUMPLES IT, AND TOSSES IT ONTO THE\nFLOOR OF THE CAB.\n\n                      FRAN (cont'd)\n         ...lest you need to Throw me in Jail,\n         f'sitting in a Truck...\n\n                      OFFICER ONE\n         Back's clean...\n\n                      FRAN\n         Hey, y'gonna leave, just when we're gettin'\n         to know each other...?\n\n                                                                   94.\n\n\n                      OFFICER TWO\n         Duty calls...\n\n                      FRAN\n         Ships-in-the-night...\n              (SHE SHRUGS)\n\nANGLE\n\nEXT THE WRECKER.\n\nTHE MECHANIC CLOSES THE HOOD, WE SEE THE TWO COPS WALKING BACK TO\nTHEIR CRUISER. THE WRECKER STARTS TO DRIVE OFF, WE SEE ONE OF\nTHE COPS WAVE TO THE OTHERS AT THE BARRICADE, AND WE SEE THE WRECKER\nPASS THROUGH.\n\nANGLE INT THE PARKING GARAGE.\n\nMOORE, HOLDING A DIRTY HANDKERCHIEF TO HIS BLEEDING HEAD.\n\nLOOKS OUT AT THE ACCESSROAD.\n\nANGLE HIS POV.\n\nTHE WRECKER AND THE TRUCK PASSING THROUGH THE ROADBLOCK.\n\nINT PARKING GARAGE. DAY.\n\nMOORE, RISING TO HIS FEET.     HOLDS A HANDKERCHIEF TO HIS HEAD.\n\nHE WALKS TO THE EDGE OF THE PARKING GARAGE PARAPET, AND LOOKS OUT.\n\nANGLE HIS POV.\n\nTHE TRUCK, DOWN, BELOW, ON THE ACCESS ROAD, PASSING THROUGH THE\nROADBLOCK, TOWED BY THE WRECKER.\n\nANGLE\n\nAT THE ROADBLOCK, THE COPS WAVING THE WRECKER THROUGH.\n\nANGLE\n\nIN THE PARKING GARAGE.   MOORE, TURNS AWAY FROM THE EDGE, AND WALKS\nBACK, UNSTEADILY.\n\nCAMERA TAKES HIM TOWARD THE STAIRCASE.\n\nANGLE THE DRIVETHROUGH, GROUND LEVEL, AIRPORT.\n\nA SMALL FIRETRUCK IS PARKED BESIDE THE WASTE CAN, WHICH IS SPEWING\nSMOKE, TWO FIREFIGHTERS ARE PUTTING OUT THE FIRE, POLICE ARE\nDIRECTING TRAFFIC AROUND IT.\n\nSEVERAL ROADCREWMEN, THE ROADCREW WE SAW EARLIER.     ARE SITTING ON\nTHE CURB, AND WATCHING.\n\nANGLE\n\n                                                                   95.\n\n\nON MOORE, AS HE EMERGES FROM THE CONCRETE STAIRWELL. HE LOOKS\nAROUND. HE PICKS UP AN ORANGE VEST AND A HARDHAT FROM A PILE AT THE\nBARRICADE OUTSIDE THE STAIRWELL. HE TIES THE HANDKERCHIEF AROUND\nHIS HEAD, HE SHUCKS OFF HIS SPORTCOAT, AND SHIRT, AND PUTS THE VEST\nON OVER HIS T-SHIRT. HE PUTS ON THE HARDHAT.\nHE PICKS UP A HOE, AND STARTS SLOWLY WALKING DOWN THE ROAD, AWAY\nFROM THE FIRE AND POLICE.\n\n                                                    DISSOLVE TO:\n\nINT RENTAL TRUCK GARAGE DAY.\n\nFRAN SIPPING COFFEE, INSIDE A SMALL \"ADMIN\" SHED. IN THE B.G. WE\nSEE THE VARIOUS TRUCKS BEING SERVICED. BELLA, TALKING WITH A\nMECHANIC, COMES BACK INTO THE SHED. HE COMES AND SITS NEXT TO HER\nON A BENCH, THEY SPEAK IN UNDERTONES.\n\nFRAN NODS HER APPRECIATION.\n\nA SUPERVISOR COMES IN.\n\n                      SUPERVISOR\n         I'm sorry, I believe It'll take us four or\n         five hours to... you know, f'you want, I'll\n         be glad, transfer your load...\n\n                      BELLA\n         ...thank you, but we got that thing\n         palletted in there, pretty good, and... I,\n         uh, I don't want to change it, I'd rather\n         wait.\n\n                      SUPERVISOR\n         No problem, just thought I'd make the\n         offer...\n\nHE WITHDRAWS.    PAUSE.\n\n                      BELLA\n         I figure, we can't be any safer than in here.\n\n                      FRAN\n         ...you think pretty good on your feet.\n\n                      BELLA\n         ...I think pretty good off my feet, too.\n              (PAUSE)\n         F'you remember...\n              (PAUSE)\n         You remember that...?\n\nHOLD ON FRAN, LOOKING AT HIM.\n\nINT DINER DAY.\n\nA POV, ACROSS AN INDUSTRIAL STREET, THE RENTATRUCK GARAGE.\n\n                                                                  96.\n\n\nWE SEE THE OPEN BACK OF THE TRUCK, AND THE ENGINE IN IT.\n\nIT IS RAINING.\n\nANGLE\n\nFRAN AND BELLA, IN A BOOTH AT THE GARAGE.   BELLA LOOKS BACK AT\nFRAN.\n\n                      BELLA\n         ...what is it?\n\n                      FRAN\n         Why'd you have to hit him?\n\n                      BELLA\n         ...to make him see my point of view.\n              (PAUSE)\n\n                      FRAN\n         Is he going to be alright?\n\n                      BELLA\n         Well, you know, he's gonna have a headache.\n              (PAUSE)\n         Or is that what you're asking?\n              (PAUSE)\n         In which case, we're way past that. Don't you\n         think?\n              (PAUSE)\n         Because lemme run this down to you: And you\n         tell me the error in my logic. One: an old\n         man. On the run. Might as well have his\n         face on a Postage Stamp. N'he's looking for\n         his money. Two: You and me. For example:\n              (HE LOOKS ACROSS AT THE TRUCK)\n         And the prize in the Crackerjack.\n              (PAUSE)\n         And a wet afternoon to kill. Talking about\n         it.\n\n                        FRAN\n         I.    Uh... let's get out of here...\n\nSHE GETS UP.\n\n                      BELLA\n              (AS SHE FOLLOWS HER)\n         I'm getting too close to you?\n\n                      FRAN\n         Yeah, you're gettin' too close to me.\n\n                      BELLA\n         Uh huh. What? I took the thrill out of\n         \"slumming...\"\n\n                      FRAN\n         Let's get to the Rendezvous.\n\n                                                                 97.\n\n\n                      BELLA\n         ...we're going to the rendezvous.\n\n                      FRAN\n         Let's get there.\n\n                      BELLA\n         We got twelve hours.\n\n                      FRAN\n         Yeah, no, let's go now.\n\n                      BELLA\n         The truck's broken.\n\n                      FRAN\n         Tell'im what's wrong with it.\n\nSHE STARTS FOR THE ENTRANCE, BELLA FOLLOWS HER.\n\n                      FRAN (cont'd)\n         Tell im, you had this same problem one time,\n         your truck, and maybe it's the same th...\n\n                      BELLA\n         ...why don't we just?\n\n                      FRAN\n              (TURNING TO HIM)\n         Because if you sold everybody else out, why\n         wouldn't you sell me out?\n\n                      BELLA\n              (PAUSE)\n         You remember the reason for that...\n              (SHE STARTS ACROSS TO THE GARAGE.\n               HE FOLLOWS HER.)\n\nINT. CHEAP HOTEL ROOM.   NIGHT.\n\nMOORE, IN A T-SHIRT, LOOKING IN THE MIRROR. HE HAS A BAD CUT ON\nHIS FOREHEAD. AND HE HAS FIRST-AID SUPPLIES SPREAD OUT IN FRONT\nOF HIM ON THE BUREAU, UNDERNEATH THE MIRROR.\n\nHE WINCES AS HE APPLIES IODINE, AND A BANDAGE.\n\nHE TAKES A PANCAKE MAKEUP OUT OF A SMALL PAPER BAG, AND BEGINS\nSPREADING IT OVER THE BANDAGE ON HIS FOREHEAD.\n\nANGLE\n\nON THE CHEAP, UNSLEPT-IN BED IS A DUFFLEBAG, IN IT WE SEE THE\nSECURITY GUARD UNIFORM, AND THE F.A.A. INSPECTORS BADGE.\n\nWE SEE A MAN'S HANDS COME INTO THE SHOT AND TAKE A CLEAN SHIRT OUT\nOF THE DUFFLEBAG.\n\n                                                                 98.\n\n\nON THE BED NEXT TO THE DUFFLEBAG ARE A WET AND BLOODY SHIRT AND\nUNDERSHIRT.\n\nANGLE\n\nON MOORE, AS HE PUTS ON THE CLEAN SHIRT. HE REACHES IN THE BAG\nAND TAKES OUT HORNRIM GLASSES, AND PUTS THEM ON. HE STUFFS THE\nBLOODY CLOTHING INTO THE DUFFLEBAG.\n\nCAMERA TAKES HIM TO THE BUREAU, WHERE HE PUTS THE BANDAGES ET\nCETERA, INTO THE DUFFLEBAG.\n\nHE LOOKS AROUND THE ROOM. PICKS UP THE DUFFLEBAG, AND A SMALL\nATTACHE CASE WHICH RESTS AT THE DOOR.\n\nHE OPENS THE DOOR, AND PEERS OUT INTO THE HALL.\n\nANGLE, IN THE HALL, MOORE EXITING THE ROOM, CLOSES THE DOOR BEHIND\nHIM, LOCKS IT. WE SEE HE IS ATTIRED IN A CHEAP SPORTCOAT, WITH A\nNEW PEN PROTECTOR FULL OF PENS IN ITS POCKET.\n\nCAMERA TAKES HIM DOWN THE HALL TO AN INCINERATOR SHOOT.   HE PUTS THE\nDUFFLEBAG AND THEN THE KEY INTO THE INCINERATOR SHOOT.\n\nINT CAB OF THE RENTAL TRUCK. DESERTED COUNTRY ROAD.   NIGHT.    BELLA\nDRIVING, FRAN RIDING SHOTGUN.\n\nHOLD\n\n                      BELLA\n         S'alot of money we've got back there.\n              (PAUSE)\n         I said...\n\n                       FRAN\n         Yes.   Thank you. I know what you said.\n\n                      BELLA\n         What're you, filled with Remorse,\n         something...?\n\n                      FRAN\n              (LOOKING OUT OF THE WINDOW)\n         ...this is our exit.\n\n                      BELLA\n         Are you filled with remorse...?\n\n                       FRAN\n         ...not yet.\n\n                      BELLA\n         Well, good, cause...\n\n                      FRAN\n         This is the exit for the meet.\n\nANGLE HER POV\n\n                                                               99.\n\n\nTHE RAINY NIGHT HIGHWAY, DIVIDING, AN OFFRAMP SHOWN A HALF MILE\nAHEAD.\n\nANGLE INT THE TRUCK\n\n                      FRAN (cont'd)\n         ...this is the...\n\n                      BELLA\n         Yes, Indeed it is, but I'm going to tell you\n         something...\n\nSHE GRABS FOR THE WHEEL.\n\n                      BELLA (cont'd)\n              (AS HE PUSHES HER AWAY)\n         Take your hands off the wheel...\n\nANGLE, EXT. THE TRUCK AS IT SWERVES TOWARD THE SIDEROAD, AND THEN\nBACK ONTO THE MAIN ROAD.\n\nANGLE INT THE CAB.\n\n                      BELLA (cont'd)\n         What are you, nuts? Are you nuts? We're\n         going to... I'll tell you what we're gonna do.\n         We're gonna...\n\n                       FRAN\n         ...alright.\n\n                      BELLA\n         ...we're gonna. That lame, that old lame you\n         were with... he was... what did you think he\n         was? He was a non-starter... what did you\n         think...\n         what way in hell was he going to go home with\n         the gold? Based on what Fairy tale...? YOU\n         knew that... only one who didn't know that\n         was...\n\nANGLE EXT THE TRUCK. THEY PASS BY A ROADSIDE SERVICE AREA, A GAS\nSTATION, A LIT-UP COUNTRY DINER-LOUNGE BESIDE IT.\n\nANGLE INT THE TRUCK\n\nBELLA AND FRAN\n\nAS FRAN LOOKS OUT OF THE WINDOW.\n\n                      FRAN\n         You missed the exit for the meet.\n\n                      BELLA\n         Well, yeah, no, I told you... we aren't going\n         to the Meet.\n              (PAUSE)\n         You know we aren't going there.\n                      (MORE)\n\n                                                           100.\n\n\n                      BELLA (cont'd)\n              (PAUSE)\n         Why would we want to go there...?\n\n                      FRAN\n         What am I, just going to go off with you\n         forever?\n\n                      BELLA\n         You want me to tell you why...?\n\n                      FRAN\n         Take me to the Meet.\n\n                      BELLA\n         There is no meet, for the luvva God.   You know\n         that.\n              (PAUSE)\n         You know that.\n              (PAUSE)\n         You know that...\n\n                      FRAN\n         I need a drink.\n\n                      BELLA\n         Yeah. I'll get you a drink, and here's a\n         bracer... We left the meet at the Airport.\n         We left the Meet, your guy went out, got his\n         picture on the Videott... and let's cut out\n         the Shucking and the Jivin': what kind of\n         man, sends you to me, sends his wife to me...\n         to \"distract\" me... Oh? Surprise! I was All\n         Taken In... How About That... What a fool I\n         am... Would I do that to you?\n              (PAUSE)\n         Would I do that to you...? Except pee ess,\n         who liked it?\n              (PAUSE)\n         So, Old Times Sake, I'm gonna tell you\n         something, why'nt we cut the nonsense, and Say\n         What It Is?\n              (PAUSE)\n\n                      FRAN\n         ...I need a drink.     Turn around.\n\n                      BELLA\n         ...nothing simpler.\n\n                      FRAN\n         I, uh, I need some time, I need a little time,\n         to...\n\nBELLA ADJUSTS THE CAR INTO A U-TURN.\n\n                      BELLA\n         We're gonna siddown, and I'll draw you the\n         scheme of it, the New Thing, on a Napkin.\n\n                                                                  101.\n\n\nHE LOOKS OUT OF THE WINDSHIELD.\n\nANGLE, HIS POV, AROUND A TURN AHEAD, THE COUNTRY DINER-LOUNGE WE\nPASSED EARLIER, IN FRONT OF IT, A POLICE CRUISER.\n\nANGLE, INT THE TRUCK.\n\n                        BELLA (cont'd)\n            uh oh...\n\nHE TWISTS THE WHEEL VIOLENTLY.\n\nANGLE, EXT THE TRUCK.\n\nTHE TRUCK STARTS TO SKID ON THE RAIN-SLICKED HIGHWAY, IT CROSSES\nTO THE FAR SIDE OF THE ROAD, AND GOES INTO A DITCH.\n\nTHE TRUCK TUMBLES IN THE DITCH AND ENDS, ON ITS SIDE.\n\nANGLE\n\nIN THE SCRUB WOODS ON THE SIDE OF THE ROAD. THE TRUCK, ON ITS SIDE,\nTHE SIDE PANELS CRUMPLED, THE BACK SPRUNG OPEN.\n\nANGLE INT THE TRUCK\n\nBELLA AND FRAN.    HE CHECKS HER FOR INJURIES.   SHE IS SHOCKY.\n\nHE HELPS HER OUT OF THE TRUCK.\n\nANGLE EXT\n\nTHE WRECKED TRUCK. IN THE RAIN. IN THE FAR B.G. THE LIGHTS OF THE\nDINER, AND THE POLICE CRUISER. BELLA REACHES BACK INTO THE TRUCK,\nTURNS OFF THE ENGINE AND THE LIGHTS.\n\nHE WALKS AROUND TO THE BACK OF THE TRUCK.\n\nANGLE HIS POV\n\nTHE BACK DOOR SPRUNG OPEN, THE FAKE ENGINE OPEN, AND THE COVERED\nBARS LYING ALL OVER THE BACK OF THE TRUCK.\n\nANGLE\n\nON BELLA AND FRAN, AS SHE COMES AROUND THE BACK OF THE TRUCK.\n\nBELLA STANDS, INDECISIVE, LOOKING AT THE COVERED BARS.     HE STARTS TO\nREACH IN FOR THEM.\n\n                        FRAN\n            leave it.\n\nPAUSE\n\nBELLA LOOKS AT HER, AMAZED.    HE STARTS TO GATHER THEM UP.\n\n                                                                   102.\n\n\n                      FRAN (cont'd)\n         Leave it... walk away from it.     For godsake...\n\nBELLA STARTS SCOOPING UP THE BARS, AND CARRYING THEM BACK INTO THE\nWOODS. FRAN MOVES TO STOP HIM.\n\n                      FRAN (cont'd)\n         Walk away from it... what are you going to\n         ...come on. Come on...\n              (SHE GESTURES BACK AT THE COPCAR)\n         Are you crazy...\n\n                      BELLA\n         ...we can get a few, we can bury the bars, if\n         we bury the bars in the...\n\n                      FRAN\n              (PULLING ON HIM)\n         For godsake, walk away from it.     Leave it...\n\n                     BELLA\n         Okay. Look: we fit'em back into the\n         container. We... come on, come on...\n\nHE LOOKS BACK OVER HIS SHOULDER AT THE COPCAR. HE WORKS HIS WAY\nBACK INTO THE TRUCK, AND STARTS REPLACING THE GOLDBARS IN THE\nCONTAINER.\n\n                      FRAN\n              (BEHIND HIM)\n         Come on...\n\n                      BELLA\n              (HE REACHES FOR A FLASHLIGHT FROM\n               THE GLOVE COMPARTMENT, TO HELP\n               HIM)\n         The truck's clean, for chrissake, the truck's\n         clean: we put it back together, we calla\n         towtruck -- am I gone to walkaway from all\n         this gold...?\n\nHE IS PLAYING HIS BEAM ON THE GOLDBARS.    PAUSE.\n\nANGLE, HIS POV.   INS.\n\nHE PICKS UP ONE OF THE BARS. THE WRAPPING IS TORN.     HE SHINES THE\nLIGHT ON IT, TO REVEAL IT IS A DULL LEADEN COLOR.\n\nHE PICKS UP NOW ONE AND NOW ANOTHER    OF THE GOLD BARS. AND DRIPS THE\nCOVERING OFF OF THEM. EACH ONE IS     LEAD. HE PICKS UP THE ONE BAR\nWHICH WAS OPENED AND RESEALED WITH    TAPE, TO SHOW IT IS GOLD. HE\nSTRIPS OFF THE WRAPPING. HALF THE     BAR IS GOLD, THE REST OF IT IS\nLEAD.\n\nHE STARTS RIPPING THE COVERS OFF THE BARS VIOLENTLY.       ALL THE REST\nARE LEAD.\n\nANGLE\n\n                                                                    103.\n\n\nON BELLA, AS HE TURNS TO LOOK AT FRAN.\n\nANGLE, HIS POV.    ON FRAN.    STANDING BEHIND HIM IN THE RAIN.\n\nANGLE\n\nON FRAN, AS SHE BACKS AWAY FROM BELLA, BACK INTO THE WOODS.\n\nANGLE\n\nON BELLA, AT THE TRUCK, AS HE CONTINUES RIPPING OFF THE COVERINGS.\n\nHE TURNS AROUND.\n\nANGLE HIS POV.\n\nON FRAN, AS SHE DISAPPEARS INTO THE WOODS.\n\nANGLE INT THE WOODS.\n\nFRAN RUNNING IN THE DARK WOODS.     SHE SLIPS, AND FALLS.   WE SEE\nBELLA, RUNNING BEHIND HER.\n\nSHE PICKS HERSELF UP, BEGINS TO RUN AGAIN. SHE STOPS, HER JACKET\nAND PURSE CAUGHT ON A TREE. SHE TRIES TO FREE HERSELF, SHE LOOKS\nBACK AT THE MAN GAINING ON HER.\n\nSHE TAKES OFF HER JACKET AND RUNS ON.      HOLD ON HER JACKET AND\nPURSE STRAP ON THE TREE.\n\nEXT ROADSIDE DINER, NIGHT.\n\nTHE PARKINGLOT, THE POLICE CRUISER PARKED OUT FRONT.\n\nFRAN EMERGES FROM THE WOODS, AND RUNS ACROSS THE PARKING LOT AND\nINTO A BACK DOOR OF THE DINER.\n\nINT DINER NIGHT.\n\nTHE POLICEMAN AND A COUPLE OF CUSTOMERS AT THE COUNTER.\n\nFRAN ENTERS THROUGH THE BACK DOOR.     SHE PROCEEDS TOWARD A\nPHONEBOOOTH.\n\nSHE STARTS TO DIAL.    BEAT.    SHE REACHES FOR HER PURSE, IT IS GONE.\n\nSHE DIGS IN HER PANTS.    FINDS NOTHING.\n\nANGLE AT THE COUNTER.\n\nFRAN WALKS UP.    ALL TURN TO LOOK AT HER.\n\n                      FRAN\n         Yeah, well, Can I, uh, can I make a credit\n         card call on that phone?\n\n                      COUNTERMAN\n         No, I don't think so.\n\n                                                                104.\n\n\n                        FRAN\n                (SHE NODS)\n           Then, anybody got a coin...?\n                (PAUSE)\n\nANGLE.    SHE LOOKS OVER AT THE POLICEMAN, WHO IS LOOKING AT HER.\n\n                        FRAN (cont'd)\n                (TO THE COP)\n           Excuse me, what are you looking at, All Due\n           Respect?\n\n                        COP\n                (PAUSE)\n           I was wondering, Maam, if you needed any\n           assistance.\n\n                        FRAN\n           Well, thank you, Sir. It would be nice, to\n           meet a gentleman... to meet a gentleman for\n           once in my life... But I, uh... I, uh...\n\nANGLE XCU ON FRAN, AS SHE LOOKS BACK.\n\nANGLE, HER POV.\n\nAT THE BACK OF THE DINER, BELLA, COMING THROUGH THE DOOR, AND\nSTOPPING BEHIND SOME CRATES, IN THE BACK.\n\nANGLE\n\nON FRAN\n\n                        FRAN (cont'd)\n           I, uh... thank you, I just need to uh...\n\nTHE POLICEMAN SLIPS SOME CHANGE ACROSS TO HER.\n\n                        FRAN (cont'd)\n                (AS SHE LOOKS BACK AT THE PHONE)\n           In fact, you know, I'm fine... I had a fight\n           with my husband... and he said... I said...\n           \"then let me out of the car...\" ...\n           and he did...\n                (SHE STARTS TO CRY)\n\nA WAITRESS COMES OVER AND SITS BY HER.\n\n                        FRAN (cont'd)\n           ...that was the stupidest thing... the\n           stupidest thing that...\n\nTHE WAITRESS GESTURES TO THE POLICEMAN THAT SHE WILL TAKE CARE OF\nIT.\n\nTHE COP NODS, AND PUTS DOWN SOME MONEY FOR THE CHECK, AND GETS UP.\n\nANGLE\n\n                                                                      105.\n\n\nON THE COP, AS HE PROCEEDS TOWARD THE CRUISER.\n\nA TRUCKER PAYS HIS CHECK AND WALKS AFTER HIM.\n\nANGLE,\n\nON BELLA, AS HE WATCHES.      CAMERA TAKES HIM AROUND THE OUTSIDE OF\nTHE DINER.\n\nANGLE\n\nON BELLA, AS HE WATCHES THE POLICEMAN DEPART.\n\nANGLE INT THE DINER.\n\nAS BELLA REENTERS THROUGH THE BACK DOOR.\n\nANGLE HIS POV.\n\nFRAN, DEPARTING THE FRONT OF THE DINER, TALKING WITH A TRUCKER,\nAS THE TRUCKER HELPS HER UP INTO HIS CAB.\n\nANGLE\n\nBELLA. HOLD. HE PICKS UP THE PHONE.       DIGS FOR SOME CHANGE, AND\nPUTS IT IN THE PHONE.\n\nHE LOOKS DOWN.\n\nANGLE INS.\n\nTHE HALF GOLD, HALF LEAD BAR.     SOUND OF DIALLING.\n\n                                                       DISSOLVE TO:\n\nEXT RAINY HIGHWAY.   NIGHT.    A SMALL TRUCK.\n\nANGLE INT THE SMALL TRUCK.\n\nBLANE AND MOORE IN THE TRUCK.     BLANE DRIVING.\n\nMOORE TOUCHES HIS HEAD INJURY.\n\n                      BLANE\n         How you doing?\n\n                      MOORE\n         I ain't feeling too well.\n\nBLANE LOOKS AT SOMETHING UP AHEAD.     MOORE TURNS.\n\nANGLE HIS POV.\n\nA SECURITY CHECKPOINT, A BARRIER, A GUARD COMING FORWARD.\n\n                                                               106.\n\n\nANGLE EXT THE TRUCK.\n\nTHE SECURITY GUARD COMES OUT.\n\nBLANE HAND HIM A SLIP OF PAPER. THE SECURITY GUARD CHECKS IT, MAKES\nA CALL ON A WALKIE, AND WAVES THEM THROUGH A BARRIER WHICH RISES TO\nADMIT THEM.\n\nANGLE\n\nON THE TRUCK.   ENTERING WHAT IS NOW SHOWN TO BE THE CARGO AREA OF\nTHE AIRPORT.\n\nANGLE\n\nTHE TAIL OF THE AEROHELVETICA PLANE, THE LARGE SWISS CROSS. TILT\nDOWN TO SHOW SEVERAL TRUCKS SURROUNDING IT, A POLICE CRUISER, AND\nTHE TRUCK BEARING MOORE AND BLANE, PULLING UP TO THE PLANE.\n\nANGLE\n\nON THE TARMAC. MOORE GETS OUT, AS BLANE REVERSES THE TRUCK. BLANE\nWALKS UP TO A SMALL GROUND OF COVERALLED WORKERS, AND TWO COPS.\n\nTHERE IS A CONVEYOR RUNNING FROM THE PLANE DOWN TO THE GROUND,\nAND SEVERAL CONTAINERS ON THE GROUND.\n\nBLANE PRESENTS A SHEAF OF PAPERWORK TO ONE OF THE COVERALLED MEN.\n\n                      BLANE\n         ...Hywest Foundry?\n\nHE LOOKS AROUND, AS IF CONFUSED BY THE POLICE ACTIVITY.\n\n                      OFFICIAL\n              (EXPLAINING)\n         We had a robbery of the pll...\n\n                      MOORE\n              (OF HIS INVOICE. VERY CONCERNED)\n         Could you check my numbers, Please...?\n\n                      TROOPER\n              (OVERHEARING)\n         Yeah, no, they got what they came for, Pal.\n         It wasn't yours...\n\nMOORE LOOKS CONFUSED. HE TURNS TO THE COVERALLED OFFICIAL FOR HELP.\nTHE OFFICIAL CONSULTS THE PAPERWORK, AND BIDS MOORE FOLLOW HIM UP\nTHE CONVEYOR.\n\nANGLE, IN THE AREOHELVETICA PLANE.\n\nSEVERAL WORKERS INSIDE. THE OFFICIAL, LEADS MOORE TO THE CONTAINERS\nMARKED 'HYWEST FOUNDRY.' HE POINTS THEM OUT AND MOTIONS TWO OF THE\nWORKERS TO START THEM ONTO THE CONTAINER.\n\n                                                                    107.\n\n\n                         MOORE\n            ...thank God.\n\n                         TROOPER\n            ...precious stuff, huh?\n\n                         MOORE\n            It would mean my job...\n\nANGLE\n\nTHE HYWEST FOUNDRY CONTAINERS COMING DOWN THE CONVEYOR, AS BLANE\nOPENS THE BACK OF HIS TRUCK FOR THEM. HE LOOKS UP.\n\nANGLE, HIS POV.\n\nMOORE, STANDING IN THE OPEN HATCH OF THE SWISS PLANE.\n\nANGLE CU.\n\nMOORE.   WITH A SLIGHT GRIN.     NODS AT BLANE.\n\nEXT CITY RESIDENTIAL STREET DAY.\n\nAN OLD STYLE STREET OF    SMALL BUNGALOWS. A SMALL GIRL     BEING WALKED\nDOWN TO THE CURB BY HER    MOTHER, WHO IS HANDING HER A    LUNCHBOX.\nPINCUS WALKS OUT OF THE    HOUSE BEHIND THEM, HE SHAKES    HANDS AND\nMAKES HIS GOODBYES WITH    A YOUNG FELLOW WHO IS HOLDING    A CUP OF\nCOFFEE.\n\nANGLE\n\nTIGHT ON PINCUS, THE MOTHER AND THE YOUNG GIRL (WHOM WE SAW EARLIER,\nIN THE KITCHEN SCENE...) AT THE CURB. AS THE MOTHER ADJUSTS THE\nCOLLAR ON THE CHILD.\n\n                         MOTHER\n            ...Uncle Donn to get up so early in the\n            morning, Walk you to the Bus Today.\n\n                         PINCUS\n            Glad to do it, glad to do it, glad to do it.\n\n                         MOTHER\n                 (AS PINCUS GIVES HER A PECK ON\n                  THE CHEEK)\n            ...come over for dinner, Thursday.\n\n                         PINCUS\n            Waal, we're gonna have to see...\n\nHE TAKES THE CHILD OUT OF THE FRAME.\n\nANGLE\n\nTRACKING BACK BEFORE PINCUS AND THE GIRL, AS THEY WALK.\n\n                                                                108.\n\n\n                      GIRL\n         ...come to dinner.\n\n                      PINCUS\n         We're gonna have to see.\n\n                      GIRL\n         You always say that, and it means you won't.\n\n                      PINCUS\n         Well, it's possible, it's possible, you see,\n         that my 'business'...\n\n                        GIRL\n         ...uh huh...\n\n                      PINCUS\n         ...that I might have to go 'travelling' for a\n         while...\n\n                      GIRL\n         Why can't you do your business here?\n\n                      PINCUS\n         Wish I could, Baby. Fact it. Fact is:          I got\n         to get out of here, this morning.\n\n                      GIRL\n         This morning?\n\n                      PINCUS\n         That's when my plane leaves.\n\n                      GIRL\n         ...there's the bus...\n\nWE SEE THE YELLOW SCHOOLBUS PULLING UP TO A SIGN, AND SEVERAL\nCHILDREN GETTING INTO IT.\n\n                      PINCUS\n         Well, there you go. Times change. My day,\n         all kids, had to walk all the way to school.\n\n                       GIRL\n         Yes.   But the streets were safer.\n\n                      PINCUS\n         Izzat so...?\n              (HE BENDS DOWN AND GIVES HER A\n               KISS)\n         You take care of yourself, kid...\n\n                      GIRL\n         Bye, Uncle Donny...\n\nSHE GETS UP INTO THE BUS.      HE WAVES HER GOODBYE.\n\nANGLE, CU.   ON PINCUS, WAVING GOODBYE.     HE TURNS.\n\n                                                                    109.\n\n\nANGLE\n\nAS HE TURNS HE FINDS A THUG AND BERGMAN STANDING BEHIND HIM.\n\nA BLACK SEDAN IS AT THE CURB BEHIND BERGMAN, ANOTHER THUG STANDS BY\nTHE BACK DOOR, AND OPENS IT.\n\nBEAT.\n\n                      PINCUS\n         Good day for the race.\n\n                      BERGMAN\n         What race is that?\n\n                      PINCUS\n         The Human Race.\n              (PAUSE. HE LOOKS AFTER THE BUS)\n         Kids growing up, so on...\n              (PAUSE)\n         Hope of the Future.\n\n                      THUG\n         Get in the fucken car.\n\nPINCUS SIGHS, HE STARTS TOWARD THE CAR.     AND THEN TURNS TO RUN.\nTHE THUG PUTS THE ARM ON HIM.\n\n                      BERGMAN\n         Get in the car.\n\n                                                     DISSOLVE TO:\n\nINT SHIPYARD SHED. DAY.\n\nTHE HYWEST CORP CONTAINER. OPENED. ON BLANE, WHO IS SWEATING,\nCOMES INTO THE FRAME. CAMERA TAKES HIM INTO THE CONTAINER, WHERE WE\nSEE WHAT IS THE LAST SEVERAL SCORE WRAPPED INGOTS.\n\nBLANE PICKS UP SEVERAL, AND CAMERA HINGES HIM TO A WORKTABLE, ON\nWHICH WE SEE MANY GOLD INGOTS, BLANE STRIPS THE FELT COVERING OFF\nTHE NEW INGOTS TO REVEAL THEM STAMPED CREDIT NATIONAL DE GENEVE.\n\nHE TAKES THE WRAPPINGS AND TOSSES THEM INTO A FIRE, BURNING IN THE\nBOTTOM OF A KILN. BLANE CLOSES THE DOOR.\nTILT UP TO SHOW MOORE, WHO IS TAKING A GOLD INGOT, AND PUTTING IT\nINTO A CAULDRON, IN WHICH IS MOLTEN GOLD. HE WEARS A WELDER'S\nMASK.\n\nHE FLIPS UP HIS MASK.     AND WIPES HIS FOREHEAD.   HE CHECKS HIS\nWATCH.\n\n                      MOORE\n              (TO BLANE)\n         ...where's pinky...?\n\n                                                              110.\n\n\nINT GARAGE DAY.\n\nPINCUS, TIED TO A CHAIR, IS BEING INTERROGATED BY BERGMAN AND HIS\nTHUG.\n\n                      BERGMAN\n         Where's the Gold?\n\n                      PINCUS\n         Well, I, uh, I, uh, I, you know, I'm\n         reluctant to tell you.\n\nANGLE\n\nON BERGMAN, BEHIND HIM IS SEATED BELLA.\n\n                      BERGMAN\n         When we put it to you.\n              (PAUSE)\n         You know when we put it to you, you're gone\n         be telling us the gross national product of\n         Bolivia...\n\n                       PINCUS\n         ...hey...\n\n                      BERGMAN\n         You're gonna be telling us the area codes,\n         Belgium and Luxembourg...\n\n                       PINCUS\n         Hey, look:   Z'all I know...\n\nANGLE INS.   BERGMAN PICKS UP THE HALF LEAD, HALF GOLD BAR.\n\nANGLE\n\nON BERGMAN\n\n                      BERGMAN\n         This is all you know. This is all you know...\n         This is all you know.\n         N'we got you, going to St. Croix\n              (HE HOLDS UP A TICKET)\n         Where's your share? How do you pick up your\n         share, and where's the meet? WHERE'S THE\n         MEET...?\n              (BERGMAN PICKS UP THE HALF GOLD\n               BAR TO THREATEN PINCUS)\n\n                      PINCUS\n         What're you, gonna hurt me...?\n\n                      BERGMAN\n         Yeah, no, actually\n              (TO PINCUS)\n         No, I'm not going to hurt you.   No.\n                      (MORE)\n\n                                                             111.\n\n\n                      BERGMAN (cont'd)\n         But tell a guy, m fulla admiration.     What was\n         the deal? What was the deal?\n\n                      PINCUS\n         The way you're looking at the deal the deal\n         was we get away with the gold. Cute huh?\n\n                       BERGMAN\n         Yeah, no.   It's charming.   And then what?\n\n                      PINCUS\n         We, uh, we \"slip away.\"\n\n                      BERGMAN\n         You \"slip away.\" Me and my guys go to the\n         Meet, we find a truck full of Pig Iron. Zat\n         the thing?\n\n                      PINCUS\n         Well, you know, Joe figured, you weren't never\n         going to the Meet.\n\n                      BERGMAN\n         He did... And where's the Gold.     Where's the\n         Gold all this time?\n              (PAUSE)\n         Y'know? Your guy din't get it in     his head,\n         fly off on a Variation, we're out    on the Patio\n         right now, and everybody's got a    Margarita.\n         Where's the Gold?\n\n                        PINCUS\n         ...You know:\n\n                      BERGMAN\n         Yeah, no, where's the Gold, what's the Back-up\n         Plan...?\n\n                      PINCUS\n         You can understand my reluctance to tell you.\n\n                      BERGMAN\n              (TO HIS THUGS)\n         Take him and show him something...\n\nINT SHED DAY.\n\nTHE DOOR TO THE KILN, OPEN, THE FIRE DIED DOWN TO ORANGE EMBERS, IN\nTHE B.G.\n\nTHE OPEN, EMPTY HWYEST CONTAINERS.\n\nTHE DOOR OPEN, SHOWING THE MARINA.\n\nAND MOORE STANDING ON THE DECK OF THE SAILBOAT.\n\nHE WIPES THE BRIGHT BRONZE RAIL, THE SUN GLINTS OFF OF IT.\n\nHE GETS DOWN ONTO THE DOCK.\n\n                                                               112.\n\n\nANGLE.\n\nON MOORE AS HE WALKS BACK INTO THE SHED.\n\nWHERE WE SEE BLANE, WHO IS SHUTTING DOWN THE FIRE IN THE FURNACE\nUNDER THE CRUCIBLE. BLANE LOOKS AT HIS WATCH.\n\n                         BLANE\n          Fran...?\n\n                       MOORE\n          No, she won't be calling in till she ditches\n          the guy.\n\n                       BLANE\n          How's she gonna ditch him?\n\n                       MOORE\n          She could talk her way outta a sunburn.\n\nBLANE LOOKS AT HIS WATCH\n\n                       BLANE\n          ...and then where's Pinky...?\n\n                       MOORE\n          Let's finish up...\n\nINT SERVICE STATION RESTROOM DAY.\n\nPINCUS.   HOLDING A CELLPHONE TO HIS FACE, TALKS INTO THE CELLPHONE.\n\n                         PINCUS\n                 (TO PHONE)\n          Joe.\n               (PAUSE)\n          ...Yeah. How you doing?\n               (PAUSE)\n          Just to check in.\n               (PAUSE)\n          Fine. Finest kind.\n               (PAUSE)\n          Yeah, no, I saw the truck go through, too.\n          Innit. See you at the meet.\n               (HE HANDS THE PHONE TO A THUG, WHO\n                WE NOW SEE IS STANDING BESIDE\n                HIM. THE THUGS REDIALS THE PHONE\n                AND HANDS IT TO PINCUS.)\n          Yeah.\n               (PAUSE)\n          Yeah. Checked in.\n               (PAUSE)\n          The meet is at.\n\nANGLE INT BERGMAN'S OFFICE.\n\n                       BERGMAN\n               (ON THE PHONE)\n          ...and where's the Gold...\n                       (MORE)\n\n                                                                113.\n\n\n                       BERGMAN (cont'd)\n               (PAUSE. BERGMAN, LISTENS,\n                SMILES.)\n          ...you're shitting me... Hah. Yeah.   yeah.\n          Well, no, thank you...\n\nANGLE EXT THE SERVICE STATION.   ANOTHER BODYGUARD TYPE.   KNOCKING ON\nTHE DOOR.\n\nANGLE, INT THE RESTROOM.\n\n                       PINCUS\n          ...alright...?\n\n                       THUG\n          Yeah, alright.\n\nHE OPENS THE DOOR TO THE OUTSIDE.\n\nANGLE EXT THE RESTROOM\n\nTHE THUG NODS 'ALRIGHT' TO THE BODYGUARD TYPE, WHO MOVES TO REVEAL\nHE HOLDS PINCUS'S NIECE BY THE ARM. THE BODYGUARD BEGINS TO WALK\nHER OFF.\n\nWE SEE THE DOOR TO THE RESTROOM CLOSE. HOLD. WE HEAR A SHOT.\nTHERE IS A PAUSE. AND THE THUG COMES OUT OF THE RESTROOM DOOR AND\nLETS THE DOOR SWING CLOSED BEHIND HIM.\n\nANGLE AT THE FOUNDRY DAY.\n\nON MOORE, AS HE WALKS OVER TO BLANE, STILL HOLDING THE PHONE.\n\n                       BLANE\n          Pinky Called.\n\n                         MOORE\n          Yeah.\n\n                       BLANE\n          What's the report?\n\n                       MOORE\n          Says he's fine.\n\n                       BLANE\n          He said so, huh?\n\n                       MOORE\n          That's what he said.\n\n                       BLANE\n          Well...\n               (BEAT. BLANE CLAPS HIM ON THE\n                SHOULDER)\n\nHOLD.   MOORE SHRUGS.\n\n                                                                  114.\n\n\n                      MOORE\n         Good of him to keep in touch.\n\nMOORE STARTS TO WALK TOWARD THE BOAT.\n\nINT CLOTHES BOUTIQUE DAY.\n\nFRAN, IN A DRESSINGROOM. GETTING OUT OF HER BEDRAGGLED CLOTHES,\nSHE LOOKS OUT THROUGH THE DOOR.\n\nANGLE HER POV.\n\nA YOUNG WOMAN, WHO HAS JUST EMERGED FROM AN ADJACENT DRESSINGROOM,\nIN A NEW DRESS WITH A TAG ON IT. SHE TALKS TO A SALESGIRL, WHO\nTAKES HER OUT OF THE DRESSING AREA.\n\nANGLE\n\nON FRAN, IN HER UNDERWEAR, AS SHE RETREATS BACK INTO THE DRESSING\nROOM AND THROWS HERSELF WITH ALL HER WEIGHT AGAINST THE PARTITION,\nCRASHING INTO THE NEXT DRESSINGROOM.\n\nANGLE HER POV\n\nTHE OTHER WOMAN'S CLOTHES AND PURSE IN THE DRESSINGROOM.\n\nINT ENGINEROOM THE SAILBOAT DAY.\n\nMOORE TINKERING.\n\nEXT THE DECK OF THE SAILBOAT, DAY. MOORE GOES TO THE COCKPIT AND\nTRIES THE STARTER. THE ENGINE DOES NOT START. CAMERA TAKES HIM\nDOWN TO THE ENGINEROOM.\n\nANGLE INT BOUTIQUE, DAY.\n\nFRAN, DRESSED IN THE OTHER WOMAN'S CLOTHES, EXITING THE STORE,\nCAMERA HINGES HER AROUND A CORNER, AND TO A PAYPHONE.\n\nANGLE, INT THE ENGINE ROOM.\n\nMOORE, TINKERING WITH THE ENGINE.     THE ENGINE SPUTTERING.\n\nANGLE INS, THE CELLPHONE, IN THE POCKET OF HIS JACKET, WHICH IS HUNG\nON A HOOK IN THE ENGINEROOM. BLINKING.\n\nANGLE\n\nAT THE PAYPHONE. FRAN. REDIALS THE NUMBER.       HOLD.   THEN SHE LOOKS\nAT HER WATCH AND HAILS A PASSING CAB.\n\nEXT SAILBOAT DAY.\n\nMOORE, ON THE DECK OF THE SAILBOAT.     AS HE CONNS IT AROUND A MARKER,\nAND IN TOWARD A PIER.\n\nTHE SUN GLINTS OFF THE RAILING.\n\n                                                                    115.\n\n\nEXT HIGHWAY DAY.\n\nA TAXICAB. TURNING INTO A PIER AREA. A SMALL MARINA. A SMALL\nPOWERBOAT BEING BACKED INTO THE WATER BY A SUBURBAN. THE CAB\nENTERS THE AREA, AND FRAN GETS OUT, AND PAYS THE CABBIE OFF. SHE\nTURNS TOWARD THE WATER.\n\nANGLE, HER POV.    THE SAILBOAT.     FAR OUT BEYOND THE END OF A LONG\nPIER.\n\nANGLE\n\nTHE PIER.    FRAN RUNNING DOWN THE PIER TOWARD THE BOAT.\n\nAT A SMALL CABANA, NEAR THE END OF THE PIER.       FRAN.   SITTING ON A\nBENCH, LOOKING OUT AT THE SAILBOAT.\n\nANGLE\n\nON THE BOAT. AS MOORE PULLS IT UP TO THE END OF THE PIER.         JUMPS\nDOWN, AND TIES UP THE BOAT.\n\n                         MOORE\n            How're you doing? Blane's Okay.      Billy's\n            Okay, Pinky called, he...\n                 (PAUSE)\n\nHE LOOKS AT FRAN.    HOLD.\n\nBERGMAN AND HIS CREW EMERGE FROM THE SMALL CABANA.\n\nMOORE TURNS BACK TOWARD THE BOAT.       A THUG YELLS AT HIM AND PULLS A\nPISTOL. HE STOPS.\n\n                         BERGMAN\n            Yeah, yeah, what there was a change in\n            Plans...? You couldn't get to me to tell me?\n\n                         MOORE\n            Let my wife go.\n\n                         BERGMAN\n            Do you mind if I say something personal?\n                 (PAUSE)\n            You wife's a whore. She'n'you, 've fucked\n            this perfect little plan, into...\n\nMOORE STEPS TOWARD BERGMAN.      A THUG CLUBS MOORE TO THE GROUND.\n\n                         BERGMAN    (cont'd)\n            Get up. Get up, get     up, you contrary\n            motherfucker. I was     going to make you rich.\n            I was going to make    you rich. The Swiss\n            Score. And look how     you treat me. Cause you\n            got to be Too Smart.     You got to be too smart.\n            Don't you?\n\nMOORE RISES TO HIS FEET.\n\n                                                                116.\n\n\n                      BERGMAN (cont'd)\n         You just gotta complicate it That Last Bit.\n              (PAUSE)\n         Well. Do you want to wrap it up, or you want\n         to stand around out here, guess my Real Name?\n\n                      MOORE\n         What is your real name?\n\n                      BERGMAN\n         It's Rumplestiltskin.\n\n                      MOORE\n         What was it before you changed it?\n\nTHE THUG HITS MOORE AGAIN.\n\n                      FRAN\n         Don't hurt him...\n\n                      BERGMAN\n         You had to go out on a limb -- you had to go\n         out on a limb, Didn't you...? Didn't you...\n\n                      MOORE\n         Let the girl go, I'll give up the gold.\n\n                      BERGMAN\n         Yeah, we had, basically, we had in mind a\n         different deal... a different deal. How bout\n         that, I hear, if you're flexible, it Keeps you\n         Young.\n\n                      MOORE\n         I'll give up the Gold, Me and the girl leave\n         on the boat.\n\n                      BERGMAN\n         Well, that's very sentimental.   But what if\n         the gold's on the boat.\n\n                      MOORE\n         Search the boat.\n\nBERGMAN TAKES OUT A SMALL KNIFE, AND BEGINS TO CLEAN HIS NAILS.\n\n                      BERGMAN\n         Yeah, no, I don't got to search the boat.\n\nANGLE\n\nON BERGMAN, AS HE BECKONS SEVERAL OF THE THUGS ONTO THE BOAT.\n\n                      BERGMAN\n         Yeah, no, your wife just made another deal.\n         The deal she made, we get the gold, we let you\n         live. Whaddaya think?\n\n                                                           117.\n\n\nPAUSE.   AS MOORE LOOKS AT FRAN.\n\n                       MOORE\n          You let me walk away.\n\n                       BERGMAN\n          That's right.\n\n                        MOORE\n          Me and her.\n\n                       BELLA\n          Well, not quite.\n\n                       MOORE\n          What did you do to her...\n\nHE LOOKS AT FRAN.\n\n                       FRAN\n          I gave you up, Baby.     I gave up the gold.\n               (PAUSE)\n\n                       BERGMAN\n          Yeah, that's what we did for her, we let you\n          live.\n\n                       FRAN\n          I gave you up. I had to.\n\n                       BERGMAN\n               (TO THE THUGS)\n          Let's get this boat out of here.\n               (TO MOORE)\n          We're letting you live cause it makes the\n          broad happy. That's what she traded us for\n          the gold.\n\n                       MOORE\n          Hold on, hold on, let's siddown...\n\n                       BERGMAN\n          Oh, yeah, let's siddown. You fucken dog inna\n          manger, we sit here a little long enough, the\n          Boys in Blue come visit, n'there goes the\n          neighborhood...\n\n                        MOORE\n          One second.   Hold on...\n\n                       BERGMAN\n          You're bust, Baby. You got Broke... go cry\n          a little\n               (TO MOORE, SOTTO)\n          You fortunate motherfucker, she don't step up,\n          you're gone stay here, for, like, a little bit\n          of forever...\n\n                                                                118.\n\n\n                      BERGMAN (cont'd)\n         ...this way you walk away, you Lucky Dog.\n\n                      MOORE\n         Take the gold. Take the gold off, leave me\n         the boat.\n\n                      BERGMAN\n         Don't make me lose my respect for you. By the\n         way, we already had the gold. Pincus gave it\n         up. That's what she traded for your life.\n              (PAUSE)\n         She's got a very commercial mind...\n\nBELLA STARTS TO TAKE FRAN AWAY, BACK DOWN THE PIER.    WE SEE A BLACK\nCAR, DRIVING DOWN THE PIER, TOWARD THE GROUP.\n\nBERGMAN BECKONS A HENCHMAN, AND POINTS AT THE BOAT.\n\n                      BERGMAN (cont'd)\n         ...take it back to the boatyard\n              (HE MAKES A DIALING MOTION)\n         Get a number, call'im up, we need a private\n         slip, what do you call it, a shed. Tell'im\n         we'll pay in cash. Get the thing squared\n         away, we'll take the gold out...\n              (THE HENCHMAN STARTS TO GO OFF,\n               NODDING)\n\n                      BELLA\n              (TO MOORE)\n         You don't want to stay here, pal. They're\n         coming for you... they're coming for you...\n\nHE STARTS PUTTING FRAN INTO THE CAR.\n\n                      FRAN\n              (TO BERGMAN)\n         Leave him some money. Give him some money...\n         don't let him go out there with nothing...\n              (SHE GETS INTO THE CAR.)\n\nANGLE CU ON FRAN AS BELLA PUTS HER INTO THE CAR.\n\n                      FRAN (cont'd)\n         I'm sorry, baby.\n\nANGLE, ON MOORE, AS HE TURNS, AND WE SEE THE CAR DRIVE OFF.\n\n                      BERGMAN\n         Yeah, we don't want, to send you out there\n         broke... here: go buy yourself something\n         nice... You don't mind if I pay you in\n         Gold...?\n\nHE STEPS OVER TO THE BOAT, FLOATING ALONGSIDE THE DOCK.    HE TAKES\nHIS CLASP KNIFE, AND APPLIES IT TO THE SHINING RAIL.\n\nANGLE INS.\n\n                                                                   119.\n\n\nTHE BLADE BENDS ON THE RAIL.\n\nANGLE ON BERGMAN, AS HE GETS ONTO THE BOAT. HE WALKS TO ONE RAIL\nAND TRIES TO CARVE IT WITH HIS KNIFE. NOTHING HAPPENS. HE WALKS\nTO ANOTHER RAIL, AND TRIES THE SAME.\n\nANGLE INS. THE KNIFE. THE BLADE BENDING ON THE RAIL.        MORE\nPRESSURE IS EXERTED. THE BLADE SNAPS.\n\nANGLE\n\nON BERGMAN.   WHO GESTURES FOR ANOTHER KNIFE.   THE HENCHMAN DOES NOT\nUNDERSTAND.\n\n                      BERGMAN (cont'd)\n         A knife, gimme another knife...\n\nTHE HENCHMAN HANDS HIM A KNIFE. BERGMAN TRIES NOW ONE AND NOW\nANOTHER OF THE RAILINGS. THE KNIFE CANNOT RAISE SHAVINGS ON ANY OF\nTHEM.\n\nANGLE\n\nON BERGMAN, AS HE LOOKS BACK AT THE SHORE.\n\n                      BERGMAN (cont'd)\n         ...I don't... I need you to tell me where\n         the gold is.\n\nBERGMAN GETS OFF THE BOAT, AND ADVANCES ON MOORE, WHO IS STANDING ON\nTHE PIER.\n\n                      BERGMAN (cont'd)\n         Where's the gold?\n\n                      MOORE\n         Where would you like it to be...?\n\nBERGMAN GESTURES TO THE THUGS, WHO TAKE HOLD OF MOORE'S ARMS.\nMOORE LOOKS AROUND WILDLY AT THE DESERTED PIER. BERGMAN ADVANCES\nON MOORE, HOLDING THE KNIFE.\n\n                      BERGMAN\n         What is it, with your pal...?\n\nAS BERGMAN NEARS MOORE, MOORE TURNS, BREAKING THE HOLD OF THE TWO\nMEN. HE HITS ONE IN THE THROAT, KICKS AT THE OTHER, AND STARTS\nTO RUN. ONE OF THE THUGS PULLS A PISTOL, AND SHOOTS AT MOORE, AND\nMOORE FALLS TO THE PIER, GRASPING HIS SHOULDER, HE GETS SLOWLY UP,\nAND FACES BERGMAN, AND THE THUGS, WHO STAND ON THE PIER ALONGSIDE\nTHE SAILBOAT. MOORE LOOKS AROUND.\n\n                        BERGMAN (cont'd)\n         And then   where is he now. Your  running buddy?\n         No, It's   all over, and I need to know:\n         Where Is   The Gold. I hate to do  anything as\n         dramatic   as \"counting to Three,\" but... ONE:\n                        (MORE)\n\n                                                                  120.\n\n\n                      BERGMAN (cont'd)\n              (HE HOLDS OUT HIS HAND. A\n               HENCHMAN PUTS A PISTOL INTO IT.)\n\nAS HE SPEAKS, MOORE KEEPS TURNING, SO THAT THE SUN IS BEHIND\nMOORE, AND SHINING INTO THE EYES OF BERGMAN AND HIS ACCOMPLICES,\nWHO NOW STAND WITH THEIR BACKS TO THE BOAT.\n\n                      BERGMAN (cont'd)\n         Two... why must you, oh, God, why in the\n         world must you, why in the hell, a guy like\n         you, would you put me in a position... Aahh,\n         the Hell with it, life is too short, you\n         know what? Fuck you...\n\nHE RAISES HIS ARM TO FIRE. BEHIND HIM WE SEE BLANE EMERGE FROM THE\nSAILLOCKER ON THE BOAT'S DECK, BLANE HOLDS A SHOTGUN. HE SHOOTS\nBERGMAN AND THE TWO THUGS, ONE OF THE THUGS TURNS AND FIRES AT\nBLANE, WHO IS WOUNDED. BLANE FIRES AGAIN AT THE THUG, AND STUMBLES\nON TO THE PIER, AND FALLS BACKWARD INTO THE WATER BETWEEN THE BOAT\nAND THE PIER.\n\nANGLE\n\nON MOORE, WHO MOVES JERKILY,     TO THE SIDE OF THE PIER. HE TRIES\nTO PUSH THE BOAT AWAY, TO GET     TO BLANE IN THE WATER. HE UNTIES\nTHE LINE WHICH HOLDS THE BOAT     TO THE PIER, AND PUSHES THE BOAT\nAWAY. HE THROWS THE LINE TO      BLANE, WHO USES IT TO LIFT HIMSELF UP\nONTO THE PIER.\n\nTHE TWO MEN SIT FOR A MOMENT, CATCHING THEIR BREATH.\n\n                      MOORE\n         How you doing?\n\n                         BLANE\n         I'm leaking?\n              (PAUSE)\n         You hurt?\n\nMOORE NODS. HE STANDS, AND HELPS BLANE TO HIS FEET. MOORE PICKS\nUP THE SHOTGUN. THEY LOOK AROUND, BEHIND THEM, THE SAILBOAT IS\nDRIFTING OUT TO SEA.\n\nTHEY START DOWN THE PIER. STEPPING OVER ONE OF THE BODIES OF THE\nTHUGS. THE SECOND THUG LOOKS UP.\n\n                         THUG\n              (WEAKLY)\n         I... I...\n\nBLANE KICKS HIS BODY OVER THE SIDE OF THE PIER, INTO THE WATER.\n\nMOORE STEPS OVER THE DYING BERGMAN.\n\n                       BERGMAN\n         Cute.   Very cute.\n\nMOORE WALKS OVER HIS BODY, AND HE AND BLANE CONTINUE DOWN THE\nPIER.\n\n                                                                  121.\n\n\n                      BERGMAN (cont'd)\n         Don't you want to hear my dying words...?\n\nMOORE TAKES THE SHOTGUN FROM BLANE, AND STEPS BACK TO BERGMAN.\n\n                       MOORE\n         I just did.\n\nHE SHOOTS BERGMAN, HANDS THE SHOTGUN BACK TO BLANE, AND THE TWO\nHEAD OFF, HELPING EACH OTHER DOWN THE PIER.\n\n                                                   DISSOLVE TO:\n\nINT INDUSTRIAL DINER. DAY.\n\nMOORE, HIS ARM IN A SLING, NOW WEARING A BEARD, SITTING IN A BOOTH,\nDRINKING COFFEE.\n\n                       BLANE\n              (VO)\n         I hear...\n\nMOORE LOOKS UP, BLANE, WALKING WITH A CANE, SLIDES INTO THE BOOTH\nOPPOSITE HIM.\n\n                      BLANE (cont'd)\n         I hear if you put milk into it, it lesses the\n         chance of stomach distress.\n\n                      MOORE\n         Hey, you can't worry about every little\n         thing...\n\nTHEY BOTH SIT, LOOKING OUT THE WINDOW.\n\nA WAITRESS COMES BY WITH A COFFEEPOT.\n\n                       WAITRESS\n         Heat it up?\n\n                      MOORE\n              (AS HE RISES)\n         No, I think we gotta be moving on.\n\nANGLE EXT THE DINER, AS THE TWO WALK ACROSS AN INDUSTRIAL AREA.\n\n                      BLANE\n         Too bad about Pinky.\n\n                      MOORE\n         Ain't that so.\n\n                      BLANE\n         ...always made me laugh.\n\n                                                              122.\n\n\n                      MOORE\n         Well, what more can you say of anyone?\n\n                      BLANE\n         Nothing...\n\nBEAT. THEY CONTINUE WALKING ACROSS THE STREET TO REVEAL THEY ARE IN\nTHE INDUSTRIAL AREA OUTSIDE THE BOXING GYM. THERE ARE MANY KIDS\nPLAYING IN THE STREET.\n\n                      BLANE (cont'd)\n         Robert the Bruce...\n\n                      MOORE\n         Yeah?\n\n                      BLANE\n         Why'd they call him Robert \"The\" Bruce...\n\n                      MOORE\n         ...what?\n\n                      BLANE\n         Why'd they call him Robert \"The\" Bruce?\n              (PAUSE)\n\n                      MOORE\n         Because he asked them to.\n\nBLANE NODS.\n\n                      BLANE\n         Y'go to that Plastic Surgeon, don't lettem put\n         you all the way under. I knew a guy in\n         Statesville, went to get his face fixed, woke\n         up, sucker'd given him a pair of tits.\n\n                      MOORE\n         Yeah, that's no bargain.\n\n                      BLANE\n         Well, he landed back inside, he never had to\n         want for Cigarettes...\n\nBLANE TAKES OUT A SLIP OF PAPER, AND HANDS IT TO MOORE.   MOORE LOOKS\nAT IT.\n\n                      MOORE\n         Send your cut there...?\n\n                      BLANE\n         Wire it there, when you get where you're\n         going.\n\n                      MOORE\n         That I will, Pal.\n\n                                                                123.\n\n\n                      BLANE\n         I hear it's nice down there in the Sun.\n\n                      MOORE\n         Zat where I'm going?\n\n                      BLANE\n         Wherever it is, Brother, don't come back.\n              (BEAT. MOORE NODS.)\n\nBLANE EMBRACES MOORE. BEAT. BLANE HANDS HIM THE KEY TO THE\nGARAGE. AND WALKS OFF. WE SEE BLANE WALK ACROSS THE STREET, A\nCONVERTIBLE PULLS UP, DRIVEN BY A VERY BEAUTIFUL YOUNG WOMAN. BLANE\nGETS INTO THE PASSENGER SEAT AND MOTIONS HER TO DRIVE.\n\nANGLE C.U. MOORE LOOKING ON.\n\nANGLE: HIS POV, ON BLANE'S CAR, AS IT DRIVES OFF, BLANE TURNS BACK\nTO LOOK AT MOORE ONE LAST TIME, THEN SHRUGS AND TURNS FORWARD.\n\nANGLE, ON MOORE, AS HE WALKS ACROSS THE STREET, TURNS A CORNER AND\nSTANDS BEFORE A GARAGE DOOR.\n\nMOORE USES THE KEY AND OPENS A SMALL DOOR SET INTO THE OVERHEAD\nDOORS OF THE GARAGE. HE ENTERS THE DARK GARAGE.\n\nANGLE INT THE GARAGE.\n\nA NEWISH TRUCK, WITH A LARGE ENGINE LASHED ONTO ITS BED. THE ENGINE\nIS PAINTED IN FRESH BLACK PAINT. BEHIND IT, THE OLD BATTERED PICKUP\nTRUCK, UP ON A JACK, ITS BED FULL OF THE RUSTED PIPES OF THE\nDISCARDED BOXING EQUIPMENT, AND THE OLD ROTTEN LEATHER \"HEAVYBAG.\"\nMOORE TAKES OUT A PACK OF CIGARETTES AND A LIGHTER, HE IS ABOUT TO\nLIGHT A CIGARETTE, WHEN HE LOOKS OVER AT THE NEW TRUCK.\n\nHE PUTS THE CIGARETTES DOWN ON THE OLD TRUCK, BENDS   DOWN, AND PICKS\nUP A CAN OF BLACK PAINT. HE WALKS TO THE NEW TRUCK    AND APPLIES\nTOUCHUP PAINT TO THE ENGINE LASHED IN THE BACK. HE    NODS AT IT,\nAND THEN, SATISFIED, HE TAKES A TARP AND COVERS THE   ENGINE.\n\nHE GETS INTO THE NEW PICKUP TRUCK AND STARTS IT.\n\nWHILE IT WARMS UP HE GOES TO THE FRONT OF THE GARAGE, WIPING THE\nBLACK PAINT OFF OF HIS HANDS WITH A RAG. HE RAISES THE SHED DOOR,\nTO REVEAL FRAN STANDING THERE.\n\nHE SMILES AND KISSES HER AND TAKES HER BACK TOWARD THE NEW PICKUP\nTRUCK. HE OPENS THE PASSENGER DOOR.\n\n                      MOORE\n         Yeah, I knew you'd show.\n\n                      FRAN\n         Good, good plan, baby...\n\n                      MOORE\n         Yeah, I wouldn't clear my throat, without a\n         backup plan...\n\n                                                              124.\n\n\n                      FRAN\n         That's the right way to do it.\n\n                      MOORE\n         End of the day, though, end of the day,\n         what's the important thing...?\n\n                      FRAN\n         That's right.\n\n                      MOORE\n         What's the important thing...?\n              (PAUSE)\n\n                      FRAN\n         Shame about Pinky...\n\n                      MOORE\n         You heard.\n              (OF TRUCK)\n         Come on, get in.\n\n                      FRAN\n         Y'all loaded up?\n\nHE LIFTS THE TARP TO REVEAL THE ENGINE, COATED IN BLACK PAINT,\nSITTING THERE. HE RECOVERS IT.\n\n                      MOORE\n         C'mon, get in, we'll talk on the road.     You\n         heard about Pinky...\n\n                       FRAN\n         Yeah.   I heard. I'm sorry about that.\n\n                      MOORE\n         Yeah, well, it just went bad there, that\n         little bit. Dinnit...?\n\n                        FRAN\n         Yes, It did.\n\nMOORE TOUCHES THE BRUISE ON HIS HEAD.\n\n                      MOORE\n         ...yes, it did... it got kind of convincing.\n\n                      FRAN\n         ...and, so, you got hurt.\n\n                      MOORE\n         Well, you can't do it halfway, can you...?\n\n                      FRAN\n         No, anything you do, you got to do full-out.\n         Don't you?\n\n                                                               125.\n\n\n                      MOORE\n         Indeed you do.\n\n                      FRAN\n         And, sometimes...\n              (PAUSE)\n\n                      MOORE\n              (TOUCHES HIS FOREHEAD, AND THE\n               BRUISE, WINCES)\n         Then, that's just the Price.\n\n                      FRAN\n         That's right. That's what you taught me.\n         That's part of it.\n\n                      MOORE\n         Well, but didn't you do great. Played it down\n         to the last recorded syllable...\n\n                      FRAN\n         I went to a good school.\n\n                      MOORE\n         Never seen it done n'y better.   You hotwalked\n         that dude so good.\n\n                      FRAN\n         ...thank you, Joe.\n\n                      MOORE\n         Cooled him out the livelong day.   You made it\n         look so real.\n\nHE MOVES TO THE FRONT OF THE SHED. AND TURNS OUT THE LIGHTS.    HE\nWALKS BACK TOWARD FRAN, WHO IS STANDING AT THE TRUCK.\n\n                      MOORE (cont'd)\n              (TO HIMSELF)\n         ...yes, you did.\n\n                      FRAN\n         Well, you know...\n              (PAUSE)\n\n                      MOORE\n         ...what d'you mean, \"that's part of it?\"\n\n                      FRAN\n         I don't get you?\n\n                      MOORE\n         I was talking about Pinky.\n\n                     FRAN\n         Uh huh.\n\n                                                                  126.\n\n\n                      MOORE\n         I said we paid the price.         And you said.   We\n         paid part of it.\n              (PAUSE)\n\n                        FRAN\n         Yes.    That's right.\n\n                      MOORE\n         ...what's the rest of it...?\n              (PAUSE)\n         What's the rest of it...?\n\nANGLE XCU MOORE.   AS HE LOOKS AT FRAN.\n\nANGLE\n\nFRAN, AS SHE LOOKS BEYOND MOORE.\n\nANGLE ON MOORE AS HE TURNS.       BELLA IS STANDING BEHIND HIM.\n\nBELLA HOLDS A PISTOL. HE MOVES TO MOORE, AND HE FRISKS HIM, AND\nFINDS NOTHING, AND TAKES A STEP AWAY.\n\nANGLE, ON MOORE, AS HE LOOKS FROM BELLA TO FRAN.\n\n                          MOORE (cont'd)\n         Oh.\n                (PAUSE)\n\n                      BELLA\n         Well. They don't always leave with the Ones\n         they came In with.\n\n                          MOORE\n                (PAUSE)\n         Oh.\n\nBELLA LOOKS AT THE TRUCK.     HE LOOKS INQUIRINGLY, AT FRAN.\n\n                      FRAN\n              (TO MOORE)\n         It was dead, anyway.\n              (PAUSE)\n         You know it was.\n\n                          MOORE\n         Was it...?\n\n                      FRAN\n              (PAUSE)\n         You shouldn't of sent me to him.\n\n                      MOORE\n         Well, you can't think of everything.\n              (PAUSE)\n\n                                                              127.\n\n\n                        MOORE\n         I'm sorry.\n              (PAUSE)\n\n                        FRAN\n         Well...\n\n                        MOORE\n         I'm sorry...\n\n                      FRAN\n         You knew it was over...\n\n                      FRAN (cont'd)\n              (TO BELLA)\n         ...it's in the back.\n\nBELLA WALKS TO THE BACK OF THE TARP, RAISES A CORNER, LOOKS IN.\n\nHE LOOKS AT HIS HANDS, AND TAKES OUT A HANDKERCHIEF, AND WIPES OFF\nTHE BLACK PAINT. HE LOWERS THE TARP DOWN.\n\n                      MOORE\n              (OF BELLA)\n         Why dun' he shoot me?\n\n                      FRAN\n         Cause it's over. It's all done.    That's the\n         deal.\n\n                      MOORE\n         He ain't gonna shoot me?\n\n                        FRAN\n         No.\n\n                      MOORE\n         Then he hadn't aughta point a gun at me.\n              (PAUSE)\n         It's insincere...\n\nMOORE SITS DOWN ON AN UNOPENED WOODEN BOX, IN THE DOORWAY OF THE\nGARAGE.\n\n                      MOORE (cont'd)\n         Oh, God, I'm tired...\n\n                      FRAN\n              (TO MOORE)\n         I'm sorry, Baby.\n\n                       MOORE\n         Well, no.   You told me, \"you knew him\n         before.\"\n\n                      FRAN\n         That's right. I did.\n              (TO BELLA)\n                      (MORE)\n\n                                                                128.\n\n\n                      FRAN (cont'd)\n         Get in and drive\n              (TO MOORE)\n         I'm sorry.\n\n                      MOORE\n         You said that.\n              (PAUSE)\n         Well.\n              (PAUSE)\n         You must be under quite a lot of stress.\n\n                        FRAN\n         Hmm.\n\n                      MOORE\n         It was a pretty plan, though, wunnit...?\n\n                      FRAN\n         Cute as a Chinese baby...\n\n                      MOORE\n         Thanks for everything.\n              (FRAN GETS UP INTO THE TRUCK)\n\n                      FRAN\n         You'll be alright.\n\n                      MOORE\n         You think so?\n\n                      FRAN\n         You always are.\n              (PAUSE)\n\n                      MOORE\n         Well, I missed this trick, though, didn't\n         I...?\n\n                      FRAN\n         ...the best laid plans of mice and men...\n\n                        MOORE\n         ...what?\n\n                      FRAN\n         I said Nobody's Perfect.\n              (PAUSE)\n         You take care.\n              (TO BELLA)\n         Alright, let's go.\n\nTHE TRUCK DRIVES OFF.\n\nANGLE\n\nON MOORE, AS HE SLOWLY SHAKES HIS HEAD.   HE SIGHS.   HE WALKS BACK\nINTO THE SHED.\n\n                                                               129.\n\n\nHE WALKS TO THE OLD ABANDONED PICKUP, WHERE HE LEFT HIS CIGARETTES\nAND LIGHTER. HE TAKES OUT A CIGARETTE, AND HOLDS IT TO HIS LIPS.\nHE HESITATES. HE CRUMBLES IT, AND THROWS IT TO THE FLOOR. LOWERS\nTHE PICKUP TO THE GROUND, USING THE HYDRAULIC JACK.\n\nHE SIGHS, AND SLAMS THE TAILGATE ON THE OLD METAL FRAME OF THE\nBOXING EQUIPMENT. THE TAILGATE DOES NOT CLOSE. HE SLAMS IT AGAIN.\nAND IT CLOSES.\n\nHE WALKS OVER AND GETS IN THE CAB OF THE OLD PICKUP.\n\nANGLE\n\nTHE OLD METAL FRAME IN THE BED OF THE PICKUP TRUCK. WE SEE THAT THE\nTAILGATE HAS JAMMED ONTO THE OLD METAL PIPES, AND THE PIPE'S PAINT\nHAS CHIPPED TO REVEAL THAT THE PIPE IS GOLD, AND WE SEE, ON\nTHE BASE OF THE PIPE, WHERE THE PAINT HAS CHIPPED, FAINTLY, THE\nLETTERS CREDIT INTERNATIONAL DE GENEVE.\n\nANGLE\n\nON MOORE, IN THE TRUCK, AS IT PULLS OUT OF THE GARAGE.\n\n                                                         FADE OUT.\n\n\n\n\n-----------------\n\nHEIST\n\nA SCREENPLAY BY DAVID MAMET\n\nCOPYRIGHT © 1998, 1999\n\nBY DAVID MAMET\n\nC/O HOWARD ROSENSTONE\n\nROSENSTONE/WENDER. N.Y.C.\n\n\n                                                         MARCH, 1999\n\n\n\n\n\nHeist\nWriters :   David Mamet\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Joe Moore runs a ring of professional thieves, which includes Bobby Blane, Don \"Pinky\" Pincus and Joe's wife Fran. During a daylight robbery of a New York City jewelry store, Joe's face is captured by a security camera after he takes off his mask in an attempt to con/distract the store's last remaining employee. As both the picture and a witness can identify him, Joe chooses to retire from crime and plans to disappear on his sail boat with his wife, living off their share of the heist.\nThis does not sit well with Joe's fence, Mickey Bergman, who runs a garment business as a front. After accruing a number of expenses in setting up another, much more complicated robbery, Bergman decides to withhold the payment due to Joe and his crew. He insists they go through with the other job — robbing an airplane carrying a large shipment of gold. Bergman further insists that his hot-headed nephew, Jimmy Silk, be a part of the crew.\nJoe reluctantly accepts, but a series of shifting loyalties changes the complexity of their task. That includes Jimmy's personal interest in Joe's wife and Bergman and Jimmy's belief that Joe's skills are declining.\nThey attempt to rob the plane twice. In their first attempt, while setting up explosive devices along the border of the airport, they are stopped by passing law enforcement officers. While Joe and Bobby talk the officers into leaving, an agitated Jimmy draws his gun but is luckily stopped by the rest of the team from shooting the officers and thus blowing the team's cover. Because of this Joe calls the robbery off for that day. He later on that day forces his team out of finishing the job after he finds out that Pinky didn't (like he was told to by Joe) destroy the vehicle they were using, as it was covered in the team's fingerprints, as result of it being used in one of rare instances where the team is involved in a criminal act and none donned their usual leather gloves. Bergman doesn't accept Joe and the team's departure and forces them to finish the job.\nThe plane robbery is set up as a series of misdirections. Pinky poses as a guard while Joe, Bobby, and Jimmy pose as airport security personnel. They stop the jet, pretending to be responding to an emergency. They fill a van with what they take from the plane, then move the van to a rented garage on the airport grounds, where they re-brand it and call for a tow truck to have it hauled away.\nJimmy betrays the others in a bid to steal both the gold and Fran. He knocks out Joe after everyone else has left, then tells Fran that he had known that Joe had changed the plan. He and Fran take the van, but Jimmy finds out that, instead of bars of gold, the hidden compartments are filled with metal washers.\nJoe avoids arrest and returns to the plane in disguise. He and Bobby remove a shipment of goods they had booked on board the same Swiss flight, which they insist now must be driven to its destination due to the plane's delay. Inside the shipment is the stolen gold, which Joe and Bobby then melt and mold into long rods.\nA furious Bergman apprehends Pinky, who is walking his niece to the school bus. Pinky discloses the plan in order to save his niece. Bergman and his crew arrive at Joe's sail boat along with Jimmy and Fran, where they hold Joe at gunpoint, demanding to know: \"Where's the gold?\"\nThey notice that the boat railings are golden. Fran leaves with Jimmy, pleading with Bergman to give Joe some money and let him go. Bergman checks the railings, which turn out to be painted. Bergman counts to three, preparing to shoot Joe, when a hidden Bobby opens fire. Bergman's men are killed and Bergman is wounded. He asks Joe, \"Don't you want to hear my last words?\" Joe replies, \"I just did,\" and shoots him.\nBobby gives Joe the address to which he should send his share. Joe waits to meet Fran with a new truck filled with black-painted rods. Fran shows up with Jimmy. They take the truck and the gold, Fran telling Joe: \"You're the one who sent me to him. You shouldn't have sent me to him.\"\nJoe gets into an older truck to leave. A black bar in the truck scrapes the garage door, revealing gold underneath. Joe lifts a tarp in the truck bed, revealing the gold rods concealed under it. He covers the rods with the tarpaulin and drives away."}