{"title": "Hotel Rwanda", "full_text": "HOTEL RWANDA\n          \n          \n\n                                         Written by\n\n                                Keir Pearson & Terry George\n\n          \n          \n          \n          \n          \n          FADE IN:                                                                   \n          SCREEN TYPE:    THIS IS A TRUE STORY                                       \n          \n          \n          EXT. KIGALI AIRPORT. DAY\n          \n          A burning white sun high in a clear blue sky,\n          \n                                                                     PAN DOWN TO:\n          \n          A rundown (sixties) airport, peeling in the heat.\n          \n          A mad traffic jam of cars, vans, motorbikes all stopped at a checkpoint\n          where a RWANDAN POLICEMAN blows his whistle, waves some and stops\n          others as bored Rwandan soldiers look on.\n          \n          CLOSE ON: A white van pulls out of traffic, a balls-out case of line\n          jumping. HORNS, OBSCENITIES.\n          \n          A HAND: Extends from the passenger side of the van, Rwandan francs\n          pressed neatly between thumb and palm.\n          \n          The van stops next to the policeman.\n          \n                                     POLICEMAN\n          Mr. Rusesabagina, good morning.\n          \n          In the passenger seat PAUL RUSESABAGINA, late 30's, flashes a smile. He\n          is dressed in a sharp blue suit (always dressed in a neat suit and tie,\n          it is a matter of pride).\n          \n          A quick shake of hands. Money passes from one to the other.\n          \n          \n          EXT. KIGALI AIRPORT TARMAC. DAY\n          \n          The van parked by the runway tarmac. African music plays on the radio.\n          Paul drums his fingers, checks his watch.\n          \n          ZOZO, porter/driver, early thirties, sits nervously.\n          \n          An airport baggage handler approaches the van.\n          \n                                     HANDLER\n                         Sir, the flight is delayed one more hour.\n          \n                                     PAUL\n                         Thank you.\n                              (to Zozo)                                              \n                         He can get the beer.\n          \n          \n          \n          \n          \n                                                                            2.\n          \n                                  ZOZO\n                           (suddenly worried)\n                      Rutaganda's place?\n          \n                                  PAUL\n                      What's wrong?\n          \n                                  ZOZO                                               \n                      Beg your pardon sir, you are Hutu. You\n                      are safe there.\n          \n                                  PAUL\n                      You are with me, Zozo, don't worry.                            \n          Zozo throws the van into gear and speeds off.\n          \n          \n          EXT. KIGALI STREETS. DAY\n          \n          The white van, marked \"THE HOTEL MILLE COLLINES,\" whips its way through\n          Kigali's packed streets and open-air markets.\n          \n          \n          ZXT. KIGALI STREETS. DAY\n          \n          Zozo works THE HORN, weaves in and out of traffic.\n          \n                                  ZOZO\n                      What is it like to fly on a plane, sir?\n          \n                                  PAUL\n                      It depends where you sit Zozo. In coach\n                      it is like the bus to Giterama.\n          \n                                  ZOZO\n                      That is why they call it coach?\n          \n                                  PAUL\n                      Maybe. But in business class there are\n                      fine wines, linens, Belgian chocolates.\n          \n                                  ZOZO\n                           (impressed)\n                      You have taken business class?\n          \n                                    PAUL\n                      Many times.\n          \n          Suddenly, Zozo slows.\n          \n          Paul looks up, SEES: a gathering on the side of the road -- a large\n          crowd of men dressed in exotically, yet identically colored shirts.\n          They're members of the INTERAHAMWE - the Hutu Militia.\n          \n          \n          \n                                                                             3.\n          (Interahamwe - the Hutu Militia will de distinguished by these wildly\n          colored shirts) They chant, drink beer, dance onto the road,\n          obstructing cars, threatening the occupants. Several of them perform a\n          rhythmic dance - the INTERAHAMWE war dance to thumping drumbeat music\n          from a boombox.\n          \n                                   PAUL (CONT'D)\n                      Turn off.\n          \n          Zozo, scared, looks for a side road, studies the traffic behind.\n          \n                                  ZOZO\n                      There is nowhere to turn, sir.                                \n          As the van approaches,\n          \n                                   PAUL\n                      Slow down.\n          \n          The van pulls up beside the Militia.\n          \n                                  PAUL (CONT'D)\n                      Boys, do you know the way to Mr.                              \n                      Rutagunda's warehouse?\n          \n          Some Militia approach. They are suddenly friendly, helpful.\n          \n                                  MILITIA MAN #1\n                      It is one more mile on this road.\n          \n          Paul reaches into his pocket, takes out some Rwandan dollars.\n          \n                                  PAUL\n                      This is thirsty work, let me treat you to\n                      some beers.\n          \n          As the van pulls away Zozo looks to Paul, relieved.\n          \n          \n          INT. RUTAGANDA'S WAREHOUSE. DAY\n          \n          At his desk in front of a fan. GEORGE RUTAGUNDA, late 30's, huge, gold\n          chains, Rolex watch, (like an African Mafia boss) but the same\n          Interahamwe shirt. He squeezes an orange rind into a cup of espresso.\n          \n          Behind him, through his office window, the white van is being loaded\n          with cases of beer.\n          \n          George holds out his massive shirt.\n          \n                                  GEORGE\n                      You will join us at the rally today?\n          \n          Paul sits opposite, sipping coffee.\n          \n                                                                            4.\n          \n                                  PAUL\n                      I will try my best George but these days\n                      I have no time for rallies or politics.\n          \n                                  GEORGE\n                      Politics is power, Paul. And money.\n          \n          Paul studies his watch.\n          \n                                  PAUL\n                      Time is money, George. We need extra beer\n                      today.\n          \n                                  GEORGE\n                      Business is good at the hotel?\n          \n                                    PAUL\n                      Very good.\n          \n                                  GEORGE\n                      I am always glad to see you Paul.\n          \n          George leads Paul out into the warehouse.                                 \n          As a forklift lifts A WOODEN CRATE, George angers.\n          \n                                  GEORGE (CONT'D)\n                      Hell man, that is not beer, put it back!\n          \n                                  DRIVER\n                      But, sir, the Carlsberg is behind...                          \n                                  GEORGE\n                      Forget the Carlsberg, give him Grolsch.\n                           (to Paul)                                                \n                      I won't charge extra.                                         \n                                    PAUL\n                      Thank you.\n          \n          The driver of the forklift, anxiously, spins the machine to return the\n          crate but it slides off and CRASHES onto the floor: MACHETES, hundreds\n          of them, spill out.\n          \n          An awkward moment then George picks one of the crude blades.\n          \n                                  GEORGE\n                      A bargain buy, from China. Ten cents\n                      each, I'll get a dollar.\n          \n                                    PAUL\n                      At least.\n          \n          Off Zozo terrified.\n          \n                                                                              5.\n          \n          \n          EXT. KIGALI AIRPORT TARMAC. DAY\n          \n          A Sabena airliner lands. Passengers disembark via a roll-up staircase.\n          \n          Paul's van pulls up by the luggage belt.\n          \n          A large polystyrene box comes down the conveyor belt. It has Brussels -\n          Kigali destination stickers all over it.\n          \n          As Zozo picks it up, water sloshes from the lid.\n          \n                                  PAUL\n                      The ice has melted!\n          \n          Zozo goes to open it.\n          \n                                  PAUL (CONT'D)\n                      Don't. Let's go.\n          \n          Paul slips money to two customs officials.\n          \n          \n          EXT. KIGALI STREETS. DAY\n          \n          The van speeds through traffic. More traffic jams, Zozo edges up on the\n          sidewalk. Then at an intersection they see.\n          \n          THE INTERAHAMWE PARADE - a mass of young men and women, most in the\n          same colorful uniform. Line after line, waves all performing the\n          INTERAHAMWE war dance, in wild hypnotic sync, many wave sticks, spears,\n          wooden imitation guns. A large banner reads, \"Hutu Power.\"\n          \n          A flatbed truck, speakers blare drumbeat music. On it GEORGE RUTAGUNDA\n          dances the DANCE and waves a machete to the crowd.\n          \n          Zozo sinks down behind the wheel.\n          \n                                  PAUL\n                      Sit up, smile, Zozo, don't attract\n                      attention to yourself.\n          \n                                  ZOZO\n                      Boss, some of those men are my neighbors,\n                      they know I'm Tutsi.\n          \n          The parade passes. As they wait Paul takes out the wad of notes George\n          gave him, peels off a few dollars.\n                                  P\n          \n                                  PAUL\n                      Here, Zozo, for your trouble.\n          \n          Zozo takes it.\n          \n                                                                               6.\n          \n          \n          EXT. HOTEL ENTRANCE. DAY\n          \n          The van turns off the street into The Milles Collines Hotel driveway\n          and HONKS twice as it pulls down a short drive lined with tall shrubs.\n          An ARMED GUARD rushes from his booth and lifts the gate. Perfectly\n          timed. The van doesn't even have to slow as it passes. A sign on the\n          guard house reads \"WELCOME TO THE HOTEL MILLE COLLINES\".\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Lush tropical gardens, peacocks wander the well-manicured lawns,an\n          exotic African paradise. The van heads to a magnificent colonial\n          building.\n          \n                                  PAUL (V.O.)\n                      Pull up at the front door.\n          \n          A valet opens the front door of the hotel and looks shocked. It's\n          unheard of for a service van to stop out front.\n          \n                                  PAUL (CONT'D)\n                           (urgent, to the valet)\n                      Help Zozo.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul leads Zozo and the valet into a magnificent lobby, a tasteful\n          blend of Africa and Europe. Guests stare as water sloshes and spills\n          from the crate.\n          \n          GREGOIRE, early thirties the receptionist behind the desk throws a look\n          of disapproval. Paul, imperial, snaps his finger toward him.\n          \n                                  PAUL\n                           (re: spilled water)                                       \n                      Gregoire. Take care of this.\n          \n          Gregoire engages a guest in chit-chat, ignores Paul.\n          \n                                   PAUL (CONT'D)\n                      Gregoire!   See to this right away.\n          \n          The elevator door opens and reveals BIK the Belgian hotel manager, mid-\n          40's, reading some reports. He looks up, sees Paul and Zozo carrying\n          the box as they step in. Bik looks puzzled.\n          \n                                  PAUL (CONT'D)\n                      It's an emergency, sir.                                        \n          Now Bik sees the wet floor.\n          \n          \n          \n                                                                              7.\n          \n                                    BIK\n                      Paul!\n          \n                                  PAUL\n                      Gregoire will deal with it, excuse me.\n          \n          The elevator doors shut. Bik's left standing in disbelief.\n          \n          \n          INT. HOTEL KITCHEN. DAY\n          \n          The crate is hefted onto a counter. The top pried off. A crowd of\n          cooks gathers around Paul and Zozo as they peer in.\n          \n                                  ZOZO\n                      Any of them make it?\n          \n                                  HEAD CHEF\n                      Into the sink!\n          \n          They hoist up one end of the crate and LOBSTERS spill out. Many make\n          it into the sink, but some miss and slide across the counter and fall\n          onto the floor.\n          \n          The cooks sort the living from the dead.\n          \n                                  ZOZO\n                      Twelve are dead.\n          \n                                    PAUL\n                      How dead?\n          \n          The cooks smells a dead lobster, shakes his head no.\n          \n                                  PAUL (CONT'D)\n                      Dump the bad meat, save the shells, fill\n                      them will ah, a stuffing, something\n                      local.\n          \n                                  COOK\n                      Cassava, and Tipali.\n          \n                                  PAUL\n                      Yes. Call it 'fresh Scottish Lobster in a\n                      cassava and Tipali crush'.\n          \n          Paul fixes his tie, very pleased, another crisis solved.\n          \n          \n          INT. BANQUET ROOM/HOTEL MILLE COLLINES. DAY\n          \n          Paul inspects the tables' fresh flowers, sparkling crystal glasses. He\n          looks to the bar - Grolsch on ice.\n          \n                   \n          \n          \n                                                                            8.\n          \n          The sound of African drums fills the air.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul emerges, as a troupe of African male dancers in ceremonial costume\n          - Leopard skin dress, ostrich feather head dress, spears and shields\n          perform a greeting dance for a the American Ambassador and a crowd of\n          European dignitaries.\n          \n          The male dancers are joined by a troupe of young female dancers in\n          similar ceremonial dress. The ceremony comes to a foot stomping finale.\n          The guests break into LOUD APPLAUSE. Paul flings open double doors to a\n          reception room and the crowd moves in.\n          \n                                  PAUL\n                      Mr. Ambassador, please come in.    \n                                      \n                                  US AMBASSADOR\n                      Thank you, Paul.    \n                                                     \n          A UN Colonel, OLIVER, middle aged, Canadian,follows the US Ambassador.     \n          The Colonel wear the blue berets and armbands of UN Peacekeepers. (all     \n          UN troops will be distinguished by their bright blue berets, white\n          helmets and arm bands)\n          \n                                  PAUL\n                      Colonel Oliver, you are very welcome.                          \n          The Ambassador shakes the Colonel's hand.\n                                            \n                                  US AMBASSADOR\n                      Colonel. I'd like you to meet Mr. Colson,                      \n                      of our Regional Aid Division.\n          \n          MR. COLSON, crew cut, military build, is obviously CIA.\n          \n                                  US AMBASSADOR (CONT'D)\n                      Colonel Oliver is the liason officer for                       \n                      the U.N. peace keeping forces.  \n                                         \n          Paul backs away unnoticed...\n          \n          \n          INT. KITCHEN/HOTEL MILLE COLLINES. DAY\n          \n          ...then marches into the busy kitchen, claps his hands toward a\n          gathering of waiters.\n          \n                                  PAUL\n                      Please, serve the hors d'ouvres now.\n          \n          A waiter whispers to him.\n          \n                    \n          \n          \n          \n                                                                               9.\n          \n                                  WAITER\n                      General Bizimungu wants to see you.\n          \n          Paul heads out of the kitchen.\n          \n          \n          INT. HOTEL BAR. DAY\n          \n          A luxurious lounge/club called the Kigali Club - an African\n          Casablanca, complete with animal heads, a statue of a mountain gorilla,\n          grand piano in the corner. Rwandan Hutu army officers, (distinguished\n          by their crisp khaki uniforms, in the style of the French army), arms\n          dealers, government dignitaries, businessmen and reporters mingle\n          freely. The few tourists stand out.\n          \n          PAUL heads to a table. The center of attention and conversation is\n          General BIZIMUNGU, 40's, dressed in a crisp, heavily decorated\n          uniform, a strong figure, relaxed, in control. \n                                      \n                                  GENERAL BIZIMUNGU\n                      Paul, this scotch is exceptional.\n          \n                                  PAUL\n                      It's a single malt, Glenmorangie. I\n                      thought you'd like it. Anything you need,\n                      gentlemen, let me know.\n          \n                                  GENERAL BIZIMUNGU\n                      Oh, Paul, talk to the coat check, please.\n          \n          Paul heads for the lobby. He's intercepted by an zealous young Tutsi\n          reporter BENEDICT who covers the political scene for the local\n          independent newspaper.\n          \n                                  BENEDICT\n                      Paul, Paul, a moment please.   \n                                          \n                                  PAUL\n                      Yes, Benedict, what can I do?  \n                                          \n                                  BENEDICT\n                      Can you get me into the Ambassador's\n                      reception?\n          \n                                  PAUL\n                      I'm sorry, it's a private function.\n          \n          Benedict takes out his reporters notebook.\n          \n                                  BENEDICT\n                      At least tell me who is attending. The\n                      newspaper will be grateful.\n          \n          Paul laughs.\n          \n                              \n          \n          \n                                                                           10.\n          \n                                  PAUL\n                      I will be grateful if you keep my name\n                      out of your newspaper. Wait here and you\n                      will see who has attended as they leave.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul fixes a floral arrangement as he passes then arrives at the clock\n          room hatch.\n          \n                                  PAUL\n                           (to the coat check)\n                      Did General Bizimungu bring a briefcase?\n          \n                                  COAT CHECK\n                      Yes, sir.\n          \n                                  PAUL\n                      Take it to the bar storeroom. Put three\n                      bottles of Glenmorangie...                                     \n                            he writes it down on a pad)                              \n                      ...GLEN-MOR-AN-GIE, into it.          \n                                   \n          Paul moves off as the coat check scurries away.\n          \n                                   ONNIE DENVER (O.S.)\n                      Oh, Paul, Paul\n          \n          An American woman, CONNIE DENVER, rich, blonde, surgically enhanced,\n          stands by the door of the tourism office.\n          \n          \n          INT. HOTEL TOURISM OFFICE. DAY\n          \n          Paul walks into the tourism office. It is decorated with posters and\n          photos of Rwanda's single most important economic asset - the rare\n          silver back mountain Gorillas. There's a picture of the real-life Diane\n          Fossey next to the movie poster for \"Gorillas in the Mist\". Numerous\n          books and video cassettes. CONNIE DENVER's older husband, BOB, and four\n          American friends wait.\n          \n                                  CONNIE DENVER\n                      Paul, Paul. Our trip has been cancelled.\n          \n                                  PAUL\n                      Yes, I'm sorry Madame Denver, it is\n                      because of the rebels.\n          \n                                  CONNIE DENVER\n                      Rebels? What rebels?                                           \n          \n                         \n          \n          \n                                                                          11.\n          \n                                  BOB\n                      Don't be stupid for Christ sake. The\n                      Watusis are invading the country. I told\n                      you not to come here.\n          \n                                  PAUL\n                      The Tutsi rebels are far away on the\n                      border. And soon there will be peace.\n          \n                                  BOB\n                      Tutsis, Watutsis they'll still shoot you.\n          \n                                  CONNIE DENVER\n                      But I came here to see the gorillas?\n          \n                                  PAUL\n                      I will try to arrange something.\n          \n          \n          INT. HOTEL BANQUET ROOM. DAY\n          \n          The luncheon is in full swing. Paul glides in the background.\n          \n          Close on: The Ambassador in deep conversation with Oliver.  \n                   \n                                  US AMBASSADOR\n                      Things will calm down when the president\n                      signs the peace agreement with the\n                      rebels.\n          \n                                  COLONEL OLIVER                                 \n                      Our intelligence, Mr. Ambassador, is that                  \n                      the Hutu government has been stockpiling\n                      weapons and are preparing a massacre.\n          \n                                   US AMBASSADOR\n                      That's not what I hear. Excuse me. Paul.\n                            Paul comes over)                                     \n                      Colonel, you know the house manager, Paul                  \n                      Rusesabagina.\n          \n                                  PAUL\n                      How was your meal, sir?     \n                                         \n                                   US AMBASSADOR\n                      Magnificent.\n                            reads)                                               \n                      Scottish lobster, in Rwanda. You see\n                      General what a genius this man is. You\n                      want anything, this man can get it?\n          \n                                  COLONEL OLIVER                                 \n                      How about a battalion of U.S. Marines.                     \n          \n          \n          \n                                                                           12.\n          \n                                     US AMBASSADOR\n                         Now, General, don't ask for the\n                         impossible.\n          \n          Paul smiles.\n          \n                                     PAUL\n                         I have heard, Mr. Ambassador, that they\n                         have discovered oil here, under Lake                        \n                         Kivu.\n          \n          Oliver bursts out laughing. \n                                                         \n                                     COLONEL OLIVER                                  \n                         You're right, Mr. Ambassador, Paul knows\n                         how to get anything, even U.S. troops. \n                               \n          The ambassador takes Paul's hand, shakes it warmly.\n          \n                                     US AMBASSADOR\n                         Thank you for a wonderful meal, Paul.\n          \n          Paul moves away graciously, and in one smooth move checks out, then\n          pockets, the hundred dollar bill the ambassador palmed him.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          General Bizimungu gazes through glass into the reception room, SEES\n          Paul shake hands and joke with the Ambassador. (He's impressed.)\n          \n          Paul notices the General.\n          \n          The General raises his briefcase and waves.\n          \n          Paul waves back. Another favor rendered.\n          \n          \n          EXT. HOTEL GROUNDS. NIGHT\n          \n          It is night now. Floodlights bathe the hotel in a warm glow. Tiki oil\n          lamps illuminate the walkways and spread scented citronella smoke among\n          the trees. Wild birds CALL OUT.\n          \n          \n          EXT. HOTEL REAR CAR PARK. NIGHT\n          \n          Paul walks to the employee car park at the rear.\n          \n          He sees Gregoire and another male reception clerk tossing Zozo's\n          pillbox porter's hat between them with Zozo trapped in the middle\n          trying to jump and catch it. Gregoire thinks this tease is great fun.\n          \n                         \n          \n          \n                                                                              13.\n          \n                                  GREGOIRE\n                      Come on, Zozo, cockroaches can jump, some                      \n                      of them can fly.\n          \n           he clerk sees Paul just as he's about to throw, miscalculates, the hat\n          sails over Gregoire's head and lands at Paul's feet. Zozo scampers to\n          pick it up.\n          \n                                    PAUL\n                      No.\n                            (points to Gregoire)                                      \n                      You pick it up.\n          \n          Gregoire doesn't move.\n          \n                                  PAUL (CONT'D)\n                      How are your dish-washing skills,                              \n                      Gregoire?\n          \n          Gregoire bends, picks up the hat, hands it to Zozo, who walks away\n          quickly. Gregoire and his friend turn to head back into the hotel.\n          \n                                  PAUL (CONT'D)\n                      Gregoire, there are no cockroaches in\n                      this hotel, do you understand?\n          \n                                   BIK (O.S.)\n                      Cockroaches?\n          \n          Bik has walked out of the rear door and overheard.\n          \n                                  BIK (CONT'D)\n                      Don't tell me we have cockroaches, Paul?                       \n          A sly smile breaks on Gregoire's face as he uses Bik's arrival to\n          disappear inside.\n          \n                                  PAUL\n                      No, Bik, it's a code word for Tutsis.   \n                                 \n                                  BIK\n                      That's what I came to talk to you about.\n          \n                                   PAUL\n                      Excuse me?\n          \n                                  BIK\n                      The Hutu-Tutsi thing. The BBC faxed to                         \n                      say they would be here on the sixth for\n                      the peace accords. And the U.N. wants the\n                      banquet room for that day, a reception to\n                      broadcast the signing ceremony. Can you\n                      organize monitors and check the satellite\n                      dish?\n          \n                                                                               14.\n          \n                                  PAUL\n                      Leave it to me.\n          \n          Bik leans slightly closer.\n          \n                                  BIK\n                      Also, could you remember to use the\n                      service entrance at all times?\n          \n                                    PAUL\n                      Of course.\n          \n          \n          EXT. HOTEL FORECOURT. NIGHT\n          \n          Paul hops in his car and tosses a box of Belgium chocolates on the seat\n          next to him.\n          \n          \n          EXT. KIGALI STREETS. NIGHT\n          \n          Paul speeds through the streets of Kigali HUMMING along to music on the\n          radio and eating chocolates from the box. He passes bicycles laden\n          with produce. The song on the radio ends and local news comes on.\n          \n                                  RADIO ANNOUNCER (V.O.)\n                      Good Hutus of Rwanda, beware. The\n                      dictatorship of the Tutsi cockroach is\n                      near. Watch your neighbor. Identify these\n                      cockroaches. Then rise up and stamp out\n                      this murderous infestation...\n          \n          Paul turns the station.    Finds another with music.\n          \n          \n          EXT. KIGALI NEIGHBORHOOD. NIGHT\n          \n          Lights burn in windows. Kids play soccer in dusty lots. Paul's van\n          turns onto a residential street and slows. He HONKS twice. The metal\n          gate to a walled compound swings open. A GUARD(old, peaked hat, bare\n          feet, pathetic) stands just inside. Paul waves to him and pullsinto\n          the courtyard, two cars are already parked there.\n          \n          \n          EXT. PAUL'S HOUSE. NIGHT\n          \n          A neat bungalow and gardens behind the high wall. Paul parks and gets\n          out. A DOG runs and greets him, BARKING.\n          \n                                  PAUL\n                      Down, Pealiss.\n          \n                                 \n          \n          \n                                                                           15.\n          \n          His wife, TATIANA, a woman of great natural beauty, emerges from the\n          house, beside her an even taller, very elegant woman, she has a\n          doctor's bag and a stethoscope in her hand. This is ODETTE, their\n          family doctor and close friend.\n          \n                                  PAUL (CONT'D)\n                      Good evening, Odette, who is sick this                      \n                      time?\n          \n                                  TATIANA\n                      I asked Odette to take a look at little\n                      Anais. She has a rash.\n          \n                                  PAUL\n                      Your brother's here?\n          \n                                  TATIANA\n                      Yes, with Fedens and the children.\n                       e wants some advice.\n          \n                                  ODETTE\n                      Good to see you, Paul.     \n                                           \n          Paul embraces Odette warmly, kisses Tatiana.\n          \n                                  ODETTE (CONT'D)\n                      I must go, Paul.            \n                                          \n                                  TATIANA\n                      You will not stay for dinner.\n          \n                                  ODETTE\n                      No thank you, Tatiana.   \n                                             \n                                  PAUL\n                      My best to Jean Baptiste.\n          \n          \n          EXT: PAUL'S HOUSE. NIGHT\n          \n          The old guard opens the gate, Odette drives off.\n          \n          \n          EXT. PAUL'S GARDEN. NIGHT\n          \n                                  PAUL\n                           (a sigh)\n                      Thomas wants advice?\n          \n                                  TATIANA\n                      He wants your wisdom.\n          \n                                  PAUL\n                      Let's have dinner first.\n          \n                                   \n          \n          \n                                                                              16.\n          \n                                      TATIANA\n                        Of course.\n          \n          His brother-in-law THOMAS and sister-in-law FEDENS come out to greet\n          Paul the Patriarch. They hug. Kids run everywhere. Paul spots his twin\n          nieces Anais (in blue) and Carine (in yellow), four years old. He\n          scoops them up, one in each arm.\n          \n                                      PAUL\n                        Hello, Anais.                                                 \n          She laughs.\n          \n                                      CARINE\n                        I am Carine.\n          \n                                    PAUL\n                        You are not Anais?  \n                                                    \n                                      ANAIS\n                        I am Anais.\n          \n                                    PAUL\n                        Oh, Carine, that is a shame. I have a                         \n                        present for Anais.\n          \n          Anais reaches out her hand. Paul sets them on the ground, takes a\n          chocolate from his chocolate box, deliberately hands it to Carine.\n          Anais jumps up and down.\n          \n                                    ANAIS\n                        It is for me.\n          \n                                    PAUL\n                        Goodness, I cannot tell. I guess I must\n                        find another present.\n          \n          He takes a chocolate gives it to Carine, then hands out the   chocolates\n          to his children who are gathered around.\n          \n          \n          INT. PAUL'S KITCHEN. DAY\n          \n          A crowded family table. Tatiana, Paul's four children, Thomas and\n          Fedens, and the twins Anais and Carine.\n          \n                                    PAUL\n                        Roger, your turn.\n          \n          Paul's eldest, ROGER, 12, bows his head.\n          \n                                    ROGER\n                        For food and clothes, and all that grows,\n                        etc, etc. Dear Lord, thank you.\n          \n          \n          \n          \n                                                                           17.\n          \n                                     PAUL\n                         Thank you, Roger.\n          \n          Food is passed around. Roger gobbles his down.\n          \n                                     PAUL (CONT'D)\n                         Why the hurry, Roger?\n          \n                                     ROGER\n                         Simon has a new pet. Can I go see it?\n          \n                                     PAUL\n                         No, I don't want you going on the street.\n          \n                                      OGER\n                         Please, papa, I have a secret path.  \n                                 \n                                     PAUL\n                         Who is this Simon?\n          \n                                     TATIANA\n                         Simon, next door, the Charingas' boy.\n          \n                                      PAUL\n                         Homework?\n          \n                                      ROGER\n                         It's done.\n          \n                                     TATIANA\n                         And he did extra chores.\n          \n                                     PAUL\n                         Wash your things, and be back soon. \n                                  \n          Roger takes off at a run.\n          \n          \n          EXT. PAUL'S GARDEN. NIGHT\n          \n          Roger runs to a wooden fence, gets down, moves two boards and squeezes\n          through into a path, almost a tunnel in dense reeds.\n          \n          EXT. NEIGHBOR'S (SIMON'S) YARD. NIGHT\n          \n          Roger crawls along his path. There's a gap a little way down, and Roger\n          shoots through it into the wide open of the neighbors yard. He runs to\n          a back window of the house and taps on it. Soon SIMON, 12, appears. He\n          slides it open.\n          \n                                     ROGER\n                         Let's feed it.\n          \n          \n          \n                                                                           18.\n          \n          Simon lets Roger in.\n          \n          \n          INT. NEIGHBOR'S (SIMON'S) HOUSE. NIGHT\n          \n          Roger holds a WILDLY COLORED SNAKE in a jar. Simon has a bag of bugs.\n          Waves the bag in front of the snake. It's forked tongue goes wild.\n          \n                                  ROGER\n                      Let me.\n          \n          Simon hands him the bugs. Roger lifts the lid, drops one bug in, and\n          the snake strikes. The boys jump back, laugh.\n          \n          \n          INT. PAUL'S KITCHEN. NIGHT\n          \n          After dinner coffee for the adults. Tatiana, Thomas and Fedens at the\n          table. Paul, in his usual position, at the head, listening, like\n          Solomon.\n          \n                                  THOMAS\n                      I've heard bad things, Paul. My assistant\n                      says we should get out of Rwanda.\n          \n                                  FEDENS\n                      Why should we leave? I have a new job,\n                      things have never been better for us.\n          \n                                  THOMAS\n                      What good is it if we are murdered in our\n                      bed?\n          \n                                  TATIANA\n                      Your assistant, he is Hutu?\n          \n                                  THOMAS\n                      Yes, and he is in the Hutu Power Militia.\n          \n                                  CARINE\n                      He wants your job.\n          \n                                  THOMAS\n                      No, he is a friend, but he tells me to\n                      listen to the radio. All day they talk\n                      about the great slaughter.\n          \n                                  TATIANA\n                      That station is filth.\n          \n          PAUL has listened, now he decides to speak.\n          \n          \n          \n                                                                             19.\n          \n                                  PAUL\n                      Today I talked to my friend the American\n                      Ambassador and Colonel Oliver of the                           \n                      United Nations. They are preparing a\n                      banquet for the peace signing. The BBC\n                      are flying in their best reporters. The\n                      world is watching. There will be peace.\n                      Don't listen to this man.\n          \n          Solomon has spoken. Fedens smiles, Tatiana rubs Paul's arm.\n          \n          \n          EXT. NEIGHBOR'S (SIMON'S) YARD. NIGHT\n          \n          Roger crawls along his grass tunnel. Then he hears something. He looks\n          through the reeds toward the street.\n          \n          HE SEES: Military boots, a cluster of Hutu soldiers in their crisp\n          Khaki uniforms.\n          \n          He hears whispering.\n          \n                                     OLDIER'S VOICE (O.S.)\n                      That house.\n          \n          \n          EXT. PAUL'S HOUSE. NIGHT\n          \n          Paul, Tatiana, are by Thomas's car. They say good night to their\n          guests. Anais and Carine sleep in the car.\n          \n          Paul nods to the old guard to go open the gate. Just then Roger emerges\n          from the thicket, wide-eyed, afraid.\n          \n                                  ROGER\n                      There are soldiers.\n          \n                                    PAUL\n                      Where?\n          \n                                  ROGER\n                      On the street.\n          \n          Paul nods to Tatiana to take Roger inside. Thomas and Fedens grab the\n          sleeping twins from their car.\n          \n          Paul goes to his big metal gates and peers through the two inch gap\n          E\n          between the gate hinge and the gate post.\n          \n          \n          EXT. VICTOR'S HOUSE. NIGHT.\n          \n          HE SEES: (two houses down) the group of Hutu soldiers, clustered around\n          jeeps, they whisper and point. It's a raid.\n          \n                                   \n          \n          \n                                                                           20.\n          \n          Now they move rushing out of view.\n          \n          The sounds of SPLINTERING WOOD, GLASS BREAKING, CHILDREN'S CRIES, WOMEN\n          SCREAMING.\n          \n          Suddenly there's a face, beside Paul's. It's Tatiana.\n          \n                                    TATIANA\n                      What is it?\n          \n          She looks, sees the soldiers, as they drag a middle-aged man onto the\n          street.\n          \n          He is crying, pleading, like a whipped dog.\n          \n                                  TATIANA (CONT'D)\n                      Oh, my God, it's Victor. Why do they want                      \n                      Victor?\n          \n          They watch as Victor is beaten to the jeep. At this point Victor looses\n          it completely, stops pleading, grabs on to a soldier, clinging,\n          screaming like a terrified child - like a man who knows he is going to\n          die. It's a horror.\n          \n                                  TATIANA (CONT'D)\n                      Do something.\n          \n                                    PAUL\n                      What?\n          \n                                  TATIANA\n                      Call your friends in the army. Call\n                      someone. Victor is harmless. This is a\n                      mistake.\n          \n                                  PAUL\n                      Please, be quiet.\n          \n          Tatiana, moves toward the gate handle.\n          \n                                  TATIANA\n                      I'm going to talk to them.\n          \n          Paul grabs her.\n          \n                                    PAUL\n                      No.\n          \n                                  TATIANA\n                      We must do something.\n          \n          Paul takes her by the arm, leads her to the house.\n          \n                                                                         21.\n          \n                                  PAUL\n                      What would you have us do? Argue with                     \n                      these madmen? We cannot interfere.                        \n          \n          INT. PAUL'S LIVING ROOM. NIGHT\n          \n          Thomas and Fedens wait, anxious, as Paul appears.\n          \n                                  PAUL\n                      You better stay the night, it is too\n                      dangerous to be on the streets.\n          \n          Tatiana hides her anger.\n          \n                                  TATIANA\n                      I'll fix a bed.\n          \n          \n          INT. PAUL'S BEDROOM. NIGHT\n          \n          Paul lies in bed unable to sleep.   The clock reads 3:00 am.\n          \n                                  TATIANA\n                      Why didn't you call your contacts in the\n                      army?\n          \n                                  PAUL\n                      I couldn't help.\n          \n                                  TATIANA\n                      You could have asked for a favor.\n          \n                                  PAUL\n                      No, I could not. What do you know about\n                      favors Tatiana, about barter and deals?\n                      All day long I work to please this\n                      officer, that diplomat, this tourist. To\n                      store up favors so that if there is a\n                      time when my family need help I have\n                      powerful people I can call upon. Now you\n                      would have me waste a precious favor on a\n                      stranger.\n          \n                                  TATIANA\n                      Victor was not a stranger, he was our\n                      neighbor.\n          \n                                  PAUL\n                      He was not family. Family is all that\n                      matters. Do you think if you or I were\n                      being dragged from here, any one of them\n                      would lift a finger to help us?\n          \n          \n          \n                                                                            22.\n          \n                                  TATIANA\n                      They do not have your connections.\n          \n                                  PAUL\n                      Connections? I have no connections, only\n                      favors. If I call to help Victor, a\n                      General will think \"Paul Rusesabagina is\n                      a fool. He thinks my favors are so\n                      numerous and so insignificant as to waste\n                      them on everybody.\" Then my hard work is\n                      doubly squandered. I insult the General\n                      and I do not get to use my favor at all.\n                      Please leave these things to my good\n                      judgment.\n          \n          His turn away indicates the discussion is over.\n          \n          \n          EXT. HOTEL FRONT GATE. MORNING\n          \n          Paul's car rolls up to the hotel's guard house.\n          \n          SUPER THE TITLE: APRIL 6th, 1994.\n          \n          An army jeep is parked just inside. General Bizimungu is in the\n          passenger seat, talking into a walkie-talkie.\n          \n          The General gives an I'll see you soon wave.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          The hotel entrance is a mini-jam of airport buses, white UN jeeps,\n          foreign news crew Land Rovers, and a TV repair van unloading monitors.\n          Paul marches in, past Zozo the bell hop, who helps the TV men unload.\n          \n                                  PAUL\n                      Welcome, gentlemen.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          The lobby buzzes with activity. At the reception, Gregoire is\n          surrounded by a BBC news crew: GLORIA, young, chic female\n          reporter/producer, and JOCK, tough, experienced Scottish cameraman, and\n          his local sound guy Peter. Gloria is upset.\n          \n                                  GLORIA\n                      We reserved five rooms not two\n          \n                                  GREGOIRE\n                      I'm sorry, ma'am, but I see only two here\n                      in the computer.\n          \n                        \n          \n          \n                                                                            23.\n          \n          Jock sees Paul.\n          \n                                  JOCK\n                      Paul, how the hell are ya'?    \n                                        \n                                  PAUL\n                      I am delighted to see you, Mr. Daglish.\n          \n                                  JOCK\n                      They moved you from the Diplomat?\n          \n                                  PAUL\n                      Promoted. House Manager.\n          \n                                  JOCK\n                      Good for you.\n          \n                            (moves closer)                                          \n                      We're having a little trouble, Paul. We\n                      booked five rooms, but...\n          \n          Paul moves behind the desk.\n          \n                                  PAUL\n                      Let me check.\n          \n          He punches into the computer.\n          \n                                  PAUL\n                      Ah, I see the mistake. You were reading\n                      CBC - the Canadian broadcasting people\n                      instead of BBC Gregoire.\n          \n          Close on the computer: It clearly states BBC - two rooms.   Gregoire\n          looks to Paul with a mix of puzzlement and anger.\n          \n          \n                      Of course, the BBC, five rooms.\n                            (lies)                                                  \n                      They are being prepared as we speak. I\n                      have ordered fresh flowers and\n                      complimentary champagne.\n          \n          Gloria picks up her bag.\n          \n                                  GLORIA\n                      Great, I really need a shower.\n          \n                                  PAUL\n                      Just give me a moment to get your keys.\n          \n          Paul better come up with three rooms fast. Then he spots the reporter\n          Benedict hovering at the door.\n          \n          \n          \n                                                                           24.\n          \n                                  PAUL (CONT'D)\n                           (to Gloria)\n                      Excuse me for one second.\n          \n          Paul hurries over to Benedict.\n          \n                                  PAUL (CONT'D)\n                      Benedict, you should meet the BBC people.                     \n                      They could use your expertise.                                \n          \n          Benedict is delighted. They head back across the lobby.\n          \n                                  PAUL (CONT'D)\n                            (whisper)                                                \n                      Benedict, General Bizimungu will be here\n                      any moment. The BBC should talk to him.\n          \n          They join the BBC team.\n          \n                                  PAUL (CONT'D)\n                      Madame, this is Benedict Nangori, one of\n                      our best journalists. He covers all the\n                      big stories. I thought you should meet.\n          \n          Gloria, a consummate news producer, turns on the charm.\n          \n                                  GLORIA\n                      Benedict, beautiful name. I'm Gloria\n                      Fleming. BBC.\n          \n          Paul moves off to the desk, Gregoire can barely disguise his pleasure.\n          \n                                  GREGOIRE\n                      There are no more rooms.\n          \n                                  PAUL\n                      Give me the phone.\n          \n          Gregoire hands it over. Paul dials.\n          \n                                  PAUL (CONT'D)\n                      Madame Denver. I have very good news. I\n                      have a present for you, in return for the\n                      cancellation of your gorilla expedition I\n                      have arranged a safari at Lake Kivu\n                      lodge. A wonderful experience. No, no\n                      extra charge. A luxury coach will leave\n                      in one hour. I'll send maids up to help\n                      you all pack. You're welcome.\n          \n          Paul hangs up, turns to Gregoire.\n          \n          \n          \n          \n                                                                           25.\n          \n                                  PAUL (CONT'D)\n                      Call Kivu Lodge, ask for George, tell him\n                      I need three rooms. And send a team of\n                      maids up to the Americans. I want those\n                      rooms turned around in twenty minutes.\n          \n          PAUL heads for the glass doors and sees:\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          General Bizimungu, briefcase in hand, gives the tv interview, He's\n          confident, controlled Benedict stands close by as Gloria interviews.\n          \n                                  GLORIA\n                      There are rumors, General, that your\n                      army, the Hutu army, consider these peace\n                      accords a sellout to the Tutsi rebels.\n          \n                                  GENERAL BIZIMUNGU\n                           (laughs)                                                  \n                      Nonsense. At this moment we are making\n                      plans to rehabilitate the dissidents into\n                      our armed forces.\n          \n                                  GLORIA\n                      Then the army fully supports the\n                      president as he signs the peace\n                      agreement.\n          \n                                  GENERAL BIZIMUNGU\n                      Of course, the president is a clever man,\n                      he knows what he is doing. Thank you for\n                      coming to Rwanda. (on the move). You will\n                      see what a beautiful country this is.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul turns, walks past porters ferrying the BBC luggage. He puts his\n          hand out. Gregoire hands him keys.\n          \n          Paul does his rounds. He double checks the banquet room where\n          technicians install several TV monitors and test the signal.\n          \n          He looks in the kitchen, frenzied activity.\n          \n          He wanders behind the bar. Everything is 'under control'.\n          \n          He returns to the lobby, greets Connie, her flustered husband and their\n          friends, followed by a team of porters and luggage.\n          \n                                  \n          \n                                                                           26.\n          \n                                  PAUL\n                      Forgive the hurry but I do not want you\n                      to miss the lunch buffet on the paddle\n                      steamer across the lake. It is the most\n                      spectacular sight in all Africa.\n          \n                                   OB\n                      Lunch? All we do is eat. I thought there                       \n                      was famine in Africa. \n                                                   \n                                  PAUL\n                      Exactly, we can't have our guests                              \n                      starving. What would they think of the                         \n                      Mille Collines back in the United States?      \n                          \n          Gen. Bizimungu, takes Paul's arm, pulls him aside, hands him his empty\n          briefcase.\n          \n                                  GENERAL BIZIMUNGU\n                      Keep that cockroach Benedict away from\n                      me.\n          \n          As the General disappears into the bar, Paul waves over the coat check,\n          hands her the briefcase.\n          \n                                  PAUL\n                      Same as last time.\n          \n          She nods, hurries off just as the BBC crew appears. Paul hands out\n          keys, greets each.\n          \n                                  PAUL (CONT'D)\n                      The fifth room is your broadcast room.\n          \n                                  GLORIA\n                      Good. I'd like to book a massage.  \n                                      \n                                   PAUL\n                      Of course.\n          \n          Jock, the Scottish cameraman, hangs behind as the others leave, takes\n          his key.\n          \n                                  JOCK\n                      Did you bring any of those wee girls who                       \n                      used to sit at the bar in the Diplomat                         \n                      with you? You know? \n                                                     \n                                  PAUL\n                      I'm sorry, Mr. Daglish, this is the Mille\n                      Collines. No working girls here.\n          \n                                  JOCK\n                      Can we phone them in, Paul?\n          \n          \n          \n                                                                            27.\n          \n                                  PAUL\n                      I'm afraid I can't do that, Mr. Daglish.\n                      Ah, Zozo.\n          \n          Paul calls Zozo over.\n          \n                                  PAUL (CONT'D)\n                      You remember Zozo, from the Diplomat?\n          \n          Jock gets the code instantly, as Zozo smiles.\n          \n                                  JOCK\n                      Zozo! The very man!\n          \n          The Scot and Zozo greet, then hurry off.\n          \n          \n          INT. HOTEL BANQUET ROOM. DAY\n          \n          Paul supervises waiters hanging a banner.   It reads \"Peace, Love, and\n          Brotherhood! UNAMIR 1994\".\n          \n          \n          INT. HOTEL CONFERENCE ROOM. DAY\n          \n          Reporters watch rows of TVs. All broadcast the signing of the Arusha\n          Accords. (Reporters have political chatter.)\n          \n          CLOSE ON: the TVs as President Habyarimana signs.\n          \n                                  COMMENTATOR\n                      As president Habyarimana signs a peace\n                      accord between the Tutsi rebels and his\n                      Hutu army there remains strong doubts\n                      that the extremist Hutu Power will abide\n                      by the accords. But for now hope has\n                      returned to Rwanda for the first time in\n                      many years.\n          \n          All the African reporters in the room CHEER.\n          \n          Fireworks go off outside the hotel.\n          \n          Colonel Oliver raises a glass of champagne and leads the room in a        \n          toast.\n          \n                                  COLONEL OLIVER                                    \n                      To Peace.\n          \n          The room as one raise their glasses.\n          \n          CLOSE ON: Paul as he nods to a member of the tribal band on the small\n          stage. Then, African drummers hammer out a fast uplifting beat as the\n          full troupe of ceremonial dancers skip into the room in celebration.\n          \n                                 \n          \n          \n                                                                            28.\n          \n          \n          INT. HOTEL BAR. DAY\n          \n          Paul checks out the banques. They appear empty, then a voice.\n          \n                                  GENERAL BIZIMUNGU\n                      Paul, join us.\n          \n          It's General Bizimungu, he is sitting with George Rutagunda now in a\n          shiny blue suit. A bottle of whiskey on the table is almost gone.          \n          Bizimungu and Rutagunda watch the peace celebration across the lobby.   \n             \n                                  GENERAL BIZIMUNGU\n                      Have a drink.\n          \n          He pours. George points his glass toward the Europeans.\n          \n                                  GEORGE\n                      Look at them, they want to see the tribes\n                      dance to their tune. Here is our dance.\n          \n          Rutagunda staggers to his feet, launches into a drunken version of the\n          Hutu Militia War Dance.\n          \n                                  GEORGE (CONT'D)\n                      Come on, Paul. Show them our dance.\n          \n          Paul takes George's arm, does two steps of the dance, then   appears to\n          stumble and shoulder bumps the big man.\n          \n          George falls into his chair.\n          \n                                  PAUL\n                      Forgive me, George, my step was off.\n          \n          Rutagunda bursts out laughing, toasts:\n          \n                                  GEORGE\n                      To our president. May he find peace.\n          \n          As Paul is forced to join in the toast, Rutagunda laughs, Bizimungu        \n          smiles at some insider joke.                                               \n          \n          INT. HOTEL CONFERENCE ROOM. EVENING\n          \n          Reporters and crews pack up their equipment. Paul shakes hands, orders\n          porters to pick up cases. Then a porter whispers a message to Paul.\n          \n                                  PAUL\n                      Excuse me, gentlemen.\n          \n          \n          \n                                                                           29.\n          \n          \n          EXT. HOTEL FORECOURT. NIGHT\n          \n          Paul emerges, discovers Fedens and Thomas - they look embarrassed to be\n          in such exulted surroundings.\n          \n                                  THOMAS\n                      Forgive us, Paul. We must talk.\n          \n                                  PAUL\n                      What's wrong?\n          \n                                  THOMAS\n                      We are leaving Rwanda, Paul.\n          \n                                  PAUL\n                      Go to the terrace, I will join you.\n          \n                                                                       CUT TO\n          \n          \n          EXT. HOTEL POOL TERRACE. NIGHT\n          \n          Drinks are served at a table as Paul listens to Thomas.\n          \n                                  THOMAS\n                      My assistant, the Hutu Power man, says we                      \n                      should get out now, that soon it will be\n                      very bad.\n          \n          Paul stifles his anger.\n          \n                                  PAUL\n                      Give me this man's name.\n          \n                                  THOMAS\n                      His name is Naramaranga, but please,                           \n                      Paul, even though he is Hutu Power, he is                      \n                      a friend, he likes me. He told me there\n                      is a signal. It is \"Cut the tall trees.\"                       \n                      When they hear the signal, the militia                         \n                      are to go to war.\n          \n                                  FEDENS\n                      Please, let us take Tatiana with us. You\n                      are Hutu, you will be safe.\n          \n                                  PAUL\n                      Thomas, Fedens, I am a man who looks\n                      after his family. If there were danger I\n                      would be the first to leave?\n          \n          BANG - a distant explosion, a flash of light on the far side of the\n          city. Fedens jumps.\n          \n          \n          \n          \n          \n                                                                          30.\n          \n                                   FEDENS\n                       What was that?\n          \n                                   PAUL\n                       Calm yourself, it is fireworks to\n                       celebrate the peace.\n          \n                                   THOMAS\n                       Please, Paul, tomorrow I will bring you\n                       my car. You will sell it for me and get a\n                       fair price. We will go to Tanzania until\n                       there is real peace.\n          \n                                   ZOZO\n                       Excuse me, Paul, you have a call. \n                                    \n          Zozo hands Paul a cordless phone.\n          \n                                   PAUL\n                        ello. Tatsi. Yes, they are here. Yes. I\n                       know but I want them to calm down.\n          \n          THOMAS and Fedens listen.\n          \n                                   PAUL (CONT'D)\n                       Already the press are packing their bags.\n                       The BBC man told me there's no story\n                       here. We are boring now. I'll be home\n                       soon.\n          \n          He hangs up.\n          \n                                   PAUL (CONT'D)\n                       Let us all go home and sleep.\n          \n          \n          EXT. HOTEL FORECOURT. EVENING\n          \n          Paul escorts Fedens and Thomas to their car.\n          \n                                   PAUL\n                       Call when you get home.   And don't worry,\n                       Thomas. Good night.\n          \n          \n          INT.   PAUL'S CAR. NIGHT\n          \n          Paul's at the wheel, driving. A thick mist. Barely a car on the road.\n          Shadows dart past faint house lights. The windscreen clouds. Paul\n          switches on his wipers. A Toyota truck, loaded with Militia, appears\n          from the mist, speeds past. Paul switches the preset buttons on the\n          radio as he drives. He can only find fevered drum-based MUSIC.\n          \n          \n          \n                                                                             31.\n          \n          \n          EXT. PAUL'S STREET. NIGHT\n          \n          Paul turns onto his street. The houses are dark: windows shuttered;\n          gates closed; not a soul about. Paul stops before his gate. HONKS\n          twice. The gate doesn't open. He hops out and opens it with a key.\n          Gives it a push and pauses as he heads back to the car. He hears the\n          far off sound of gunfire. Distant explosions light the night sky.\n          \n          \n          EXT. PAUL'S HOUSE. NIGHT\n          \n          Paul drives in. His compound is curiously dark.     His headlights sweep\n          across his pitch-black house.\n          \n                                                                         UT TO:\n          \n          The gates swing shut. We PULL BACK as Paul turns and faces his house.\n          Paul whistles for the dog, nothing. He goes back to the car, gets a\n          flashlight, heads for the front door.\n          \n          \n          INT. PAUL'S LIVING ROOM. NIGHT\n          \n          The door slowly opens. Paul steps in quietly, tries the light switch,\n          nothing. He listens. The only sounds are distant explosions and\n          gunfire. The beam of his flashlight cuts the blackness, illuminating:\n          magazines arranged on a coffee table; an empty chair; children's toys\n          in a basket.\n          \n          \n          INT. PAUL'S KITCHEN. NIGHT\n          \n          Paul continues his search. Scans the counter. There's food on the\n          stove. The table is set. He hears a GROWL, quickly cut short, from one\n          of the bedrooms.\n          \n          \n          INT. PAUL'S HALL. NIGHT\n          \n          Paul shines the light into a room. Looks for a second, then closes the\n          door, and walks to the next. He stops and listens with his ear to the\n          door. Nothing. He pushes it in.\n          \n          \n          INT. PAUL'S BEDROOM. NIGHT\n          \n          Paul's light sweeps across the room and illuminates:\n          \n          Eyes - terrified eyes, a room full of faces, staring back.\n          \n          THEIR POV: A dark figure behind a blinding light.\n          \n          The dog breaks free, runs to Paul.\n          \n          \n          \n          \n                                                                           32.\n          \n                                  PAUL\n                      Pealiss!\n          \n          From among the faces, Tatiana's voice heavy with relief.\n          \n                                  TATIANA\n                      Paul!\n          \n          Paul's eyes adjust, he recognizes many of his neighbors, all crowded\n          into this small room. Then he sees their friends Odette and her husband\n          Jean Baptiste.\n          \n                                  PAUL\n                      Jean Baptiste!\n          \n                                  JEAN BAPTISTE\n                      Our house has been burned.\n          \n                                  PAUL\n                      What is going on?\n          \n                                  TATIANA\n                      The president has been murdered.\n          \n                                  PAUL\n                      Murdered! By whom?\n          \n                                  ODETTE\n                      The radio says Tutsi rebels.\n          \n                                  PAUL\n                      Nonsense. Why would the rebels kill the\n                      president when he agreed to peace?\n          \n          Tatiana pulls Paul aside.\n          \n                                  TATIANA\n                      Where are Thomas and Fedens?\n          \n                                  PAUL\n                      I sent them home. Go and call them.\n          \n                                  TATIANA\n                      I tried already. The phones do not work.\n          \n          Jean Baptiste turns on his tiny radio.\n          \n                                  RADIO ANNOUNCER\n                      Our great president is murdered, by the\n                      Tutsi cockroaches. They tricked him, then\n                      they killed him. We must cleanse this\n                      country, Good Hutus of Rwanda. We must\n                      clear the brush. Clear the brush of all\n                      cockroaches. Clear the brush!!!\n          \n          \n          \n          \n                                                                           33.\n          \n          The words are cut short as a grenade blast rattles the window. Everyone\n          jumps, children whimper. Paul is shocked but tries to pull things\n          together.\n          \n                                  PAUL\n                      Come on, everyone out of this room, find\n                      a seat in the living room.\n          \n          He holds the door open, they file out, frightened. Tatiana is last, he\n          stops her, steps back in, closes the door.\n          \n                                  PAUL (CONT'D)\n                           (in hushed anger)                                         \n                      Is every Tutsi in the neighborhood here?\n          \n                                  TATIANA\n                      They came through the bushes, over the\n                      wall. What could I do?\n          \n                                  PAUL\n                      Send them home. We are not the police.\n                      What do we have to protect them?\n          \n                                  TATIANA\n                      Please. Let them stay 'til morning. The\n                      militia will not come here, they know you                      \n                      are a Hutu with influence.\n          \n                                  PAUL\n                      They know you are Tutsi!\n          \n          The door knocks.   Paul gets up, angry.\n          \n                                  TATIANA\n                      Please, Paul, 'til first light.\n          \n                                  PAUL\n                      Dawn. Then they go.\n          \n          Paul opens the door, it's Odette, holding the hand of Paul's eldest\n          daughter.\n          \n                                  ODETTE\n                      Forgive me, Paul. Danielle says that\n                      Roger has gone.\n          \n          Tatiana comes over instantly, worried.\n          \n                                  TATIANA\n                      Gone where? Tell me, Danielle.                                 \n          Their daughter Danielle answers.\n          \n                                                                                    \n          \n          \n          \n          \n                                                                           34.\n          \n                                     DANIELLE\n                         Next door, mama. He was afraid for his                     \n                         friend Simon. He went to fetch him.\n          \n          \n          EXT. UNDERGROWTH. NIGHT\n          \n          Roger crawls between the shrubs.      He hears ANGRY VOICES.\n          \n          He peers through the long grass.\n          \n          Sees: Hutu soldiers boots, feet in sneakers, bare women's feet. And\n          among them the glint of machetes, hoes, a club spiked with nails, a\n          length of chain CLANGING on the ground.\n          \n          \n          EXT. PAUL'S GARDEN. NIGHT\n          \n          Tatiana rushes out the front door, Paul after her.\n          \n          Paul catches her and puts his hand over her mouth.\n          \n                                     PAUL\n                         Shhhhh.\n          \n          SHOUTS next door. Paul pulls Tatiana behind the car. A beat. More\n          SHOUTS. Paul takes his hand from her mouth. She's sobbing.\n          E\n          \n          \n             EXT. NEIGHBOR'S YARD. NIGHT\n          \n          Roger crawls to the gap in the shrubs. Feet, a crowd, leaving, through\n          a gate. Engines rev.\n          \n          Roger crawls from the bushes.\n          \n          Crawls across, the driveway, crawls through a puddle.\n          \n          Then stops, SEES SOMETHING, AN (UNSEEN) HORROR!\n          \n          \n          EXT. PAUL'S GARDEN. NIGHT\n          \n          Paul and Tatiana exit the back of the house with flashlight in hand\n          headed towards the rear gate.\n          \n          Paul searches along the chain link fence, finds a section loose, he\n          pulls it back, clambers underneath it.                                    \n          Tatiana clasps her mouth, afraid to utter a cry.                          \n          \n          EXT. UNDERGROWTH. NIGHT                                                   \n          Paul crawls through this scrub tunnel.                                    \n          \n                                 \n          \n          \n          \n                                                                            35.\n          \n          Then he hears BRANCHES SNAPPING.                                           \n          He moves toward the sound.                                                 \n          Discovers Roger, terrified, thrashing in a tangle of bushes.               \n          He grabs Rogers shirt, pulls him as the little boy startles.               \n                                    PAUL                                             \n                      Ssshh!                                                         \n          Paul drags his son through the chainlink fence, whisks him up in his       \n          arms and rushes him to the house.\n          \n          \n          INT. PAUL'S KITCHEN. NIGHT\n          \n          Paul bursts through the back door and sets Roger down.   Tatiana is\n          beside them.\n          \n                                    TATIANA\n                      Roger!\n          \n          Paul turns the flashlight on Roger. Tatiana pulls back in horror:\n          Roger is covered in blood. Her SCREAMS, stifled by fear.\n          \n                                    TATIANA (CONT'D)\n                      Oh, my God!                                                    \n                                  PAUL\n                      Where are you hurt, son?\n          \n           oger stares blankly. Odette is beside them now.\n          \n                                  ODETTE\n                      Get his clothes off.\n          \n          Hands pull and tear his clothes off. Towels wipe him down. Odette\n          looks all over his body with the flashlight. Despite the blood Roger\n          has no injuries.\n          \n                                  PAUL\n                      What happened, son? Where did you get\n                      this blood?\n          \n          But Roger, trembling, just stares, totally traumatized. Children cry.\n          \n                                  ODETTE\n                      He's not injured.\n          \n          His paralysis freaks the women in the room. Paul turns angrily to them.\n          \n                                  PAUL\n                      Leave us, give us some space.\n          \n                                                                           36.\n          \n          He ushers the neighbors out of the room, closes the door.\n          \n                                  PAUL (CONT'D)\n                           (to Tatiana)                                              \n                      The neighbors must go at dawn.\n          \n          Tatiana hugs her son.\n          \n          \n          EXT. KIGALI. DAWN\n          \n          The faintest grey of dawn over the city. Then a flock of birds rises as\n          one in the distance. A millisecond later, the cause of their flight, a\n          grenade explosion, echoes.\n          \n          The birds dart, in another direction as the STACCATO of a machine gun\n          rips the air.\n          \n          \n          INT. PAUL'S BEDROOM. DAWN\n          \n          PAUL sits on the edge of the bed, staring out the window.\n          \n          Behind him Tatiana has Roger cradled in her arms, he still trembles\n          wide eyed as she tries to get him to talk.\n          \n                                  TATIANA\n                      Will you take a little milk?\n          \n          Nothing.\n          \n                                  PAUL\n                      Let him sleep.\n          \n          The door knocks. The old guard calls in frightened.\n          \n                                    OLD GUARD (O.S.)\n                      Mr. Paul.                                                      \n                                  PAUL\n                           (to Tatiana)\n                      It is time for the neighbors to leave.\n          \n          He heads for the door.\n          \n          \n          INT. PAUL'S LIVING ROOM. DAWN\n          \n          Paul steps out, closes the door behind him. A small delegation of the\n          men wait nervously.\n          \n                                    JEAN BAPTISTE\n                      It is true.\n          \n          \n          \n                                                                              37.\n          \n          He holds up the tiny radio, tuned to the BBC World service, a crackly\n          Brit voice. (It's Gloria the reporter.)\n          \n                                  GLORIA THE REPORTER (O.S.)\n                      The Hutu president's plane was struck by\n                      a ground-to-air missile as he returned\n                      from signing the peace accord with the\n                      Tutsi rebels. There were no survivors.\n                      The Hutu government has already blamed                         \n                      the Tutsi rebels. The rebels have denied                       \n                      the accusation. Already there are reports                      \n                      of reprisal killings on the streets.  \n                                   \n          As they listen, a young woman lets out a SQUEAL, and flees the window\n          where she's been sitting.\n          \n                                  WOMEN (O.S.)\n                      They are here.\n          \n          Hysteria in the room, women and children push toward the bedroom. Paul\n          manages to make it to the window, nervously steals a glance and sees:\n          \n          A HUTU ARMY SOLDIER sits on the high wall by the gate. He pulls another\n          up beside him.\n          \n           anic in the room now. Paul turns.\n          \n                                  PAUL\n                      Shut up!\n          \n          PAUL'S POV: The soldiers drop into his garden. They draw pistols.\n          \n                                  TATIANA (O.S.)\n                      What is it, Paul.\n          \n                                  PAUL\n                      Stay with the children.\n          \n          PAUL'S POV: The soldiers go to the gate, slide the bolt, swing it open.\n          \n          Two jeeps, jammed with heavily armed SOLDIERS, sit in the drive like\n          many-limbed beasts of war. Paul watches as the jeeps rumble into his\n          garden. The soldiers jump out.\n          \n          INSIDE THE ROOM:\n          \n          Nothing can stop the women and children from fleeing into the bedrooms.\n          Paul is frozen at the CRASH of rifles on the door.\n          \n          The door gives, SOLDIERS flood in.\n          \n          They are startled by the crowd in the living room, rifles raised,\n          SHOUTS.\n          \n                                                                           38.\n          \n                                  SOLDIERS\n                      Out, get out now!\n          \n          Paul pulls himself together, marches over to the soldier.\n          \n                                  PAUL\n                      Who is in charge?\n          \n          A Captain is at the door.\n          \n                                    CAPTAIN\n                      Who are you?\n          \n                                  PAUL\n                      I am Paul Rusesabagina, a good friend of\n                      General Bizimungu.\n          \n                                  CAPTAIN\n                      We are looking for you.\n          \n          He takes Paul by the arm, leads him outside.\n          \n          \n          EXT. PAUL'S HOUSE. DAWN\n          \n          The Captain stops by his jeep, studies his clipboard.\n          \n          Tatiana with Roger in her arms, her kids and all the neighbors herded\n          together.\n          \n                                  PAUL\n                      What is this about?\n          \n                                  CAPTAIN\n                      Let me see your identity card.\n          \n          Paul pulls it from his pocket, hands it to the Captain.\n          \n          CLOSE ON: Paul's ID - it reads Ethnicity: HUTU.\n          \n          The Captain studies him, waves for the soldiers to back off.\n          \n                                  CAPTAIN (CONT'D)\n                      You heard the Tutsi cockroaches murdered\n                      our president.\n          \n                                  PAUL\n                      Yes, it is a calamity for us all.\n          \n                                  CAPTAIN\n                      You work at the Hotel Diplomat?\n          \n                                  PAUL\n                      No. I work at the Mille Collines.\n          \n          \n          \n          \n                                                                           39.\n          \n          The Captain looks confused. Paul quickly:\n          \n                                  PAUL (CONT'D)\n                      I used to work at the Diplomat.\n          \n                                  CAPTAIN\n                      Do you know how to open the safe there?\n                           (Paul nods)\n                      Our government needs to use the hotel and\n                      the room keys are in the safe. You must\n                      open it.\n          \n                                   PAUL\n                      Of course.\n          \n          Paul sees out into the street behind the jeeps: a group of Militia in\n          their colored shirts armed with machetes, have gathered, trying to see\n          what is going on.\n          \n                                  PAUL (CONT'D)\n                      Captain, I must take my family.\n                      It is not safe here.\n          \n                                  CAPTAIN\n                      Where is your family?\n          \n          Tatiana is beside him now.\n          \n                                  TATIANA\n                           (interrupts)                                              \n                      This is them.\n          \n          Tatiana points to the huddled neighbors. Paul is stunned.\n          \n                                  CAPTAIN\n                      All of them! I cannot take them.\n          \n                                  TATIANA\n                      No, no, good Captain, you do not have to.\n                      We have the car and our van.\n          \n          She points to the Mille Collines van.\n          \n           he Captain looks doubtful, then his two-way radio barks - an urgent\n          message. He listens.\n          \n          Tatiana drags the kids and ushers everyone toward the van. In a second,\n          they are all clambering in.\n          \n                                   CAPTAIN\n                      Let's go.\n          \n          \n          \n          \n                                                                           40.\n          \n          Paul jumps behind the wheel of the van. Neighbors are jammed in like\n          sardines, 15, more, inside. Tatiana and their kids are squashed\n          together on the front bench.\n          \n          The convoy (jeep - van, car - jeep) starts up and turns out into the\n          street.\n          \n          The Militia men wave sticks, machetes.\n          \n          \n          INT. VAN TRAVELING - DAY\n          \n          Paul looks back as they speed off down the street.\n          \n          Sees: The Militia looters pour into his gateway.\n          \n          As they pass the Caringa home, Militia looters carry off a TV and push\n          a stove on a child's skateboard.\n          \n          TATIANA has Roger on her lap, she cradles his head.\n          \n          \n          EXT. KIGALI STREET. DAY\n          \n          The convoy speeds through the deserted streets. Slowing only to\n          maneuver through makeshift roadblocks where Militia wave machetes,\n          nailed clubs and spears as they dance.\n          \n          FURTHER ALONG THE ROAD: a group of Militia swarm over a car, smashing\n          the windshield, the windows. Inside a family huddles together in\n          terror, waiting for the windows to give way.\n          \n          In the gutter by the side of the road, three dead bodies.\n          \n                                  PAUL\n                           (to Tatiana)                                             \n                      Don't look.\n          \n          \n          EXT. HOTEL DIPLOMAT. DAY\n          \n          The convoy pulls up at this older, shabbier hotel. There are other\n          jeeps, and several staff in a panic. The janitor, ROBERT, sees Paul,\n          bursts into waves of joy.\n          \n                                  ROBERT\n                      Mr. Paul, sir. Oh, Mr. Paul. We must open                     \n                      every door right now for the government.\n          \n          Paul jumps out of the van, hurries to the lead jeep.\n          \n                                  PAUL\n                           (to the Captain)                                         \n                      The safe is in the manager's office.\n          \n          \n          \n          \n                                                                           41.\n          \n          The Captain nods to two soldiers.\n          \n                                  CAPTAIN\n                      Go with him, get the keys.\n          \n          \n          INT. HOTEL DIPLOMAT LOBBY. DAY\n          \n          Paul runs through the lobby. The staff look petrified.\n          \n          \n          INT. HOTEL DIPLOMAT MANAGER'S OFFICE. DAY\n          \n          Paul bursts into the room. The two soldiers follow.\n          \n          He goes to the hotel's big old combination safe, spins the combination\n          a few times, tries the handle, clunk! It doesn't open. He's forgotten\n          the number.\n          \n          The soldiers look at him impatiently. Paul improvises.\n          \n                                  PAUL\n                      Gentlemen, you'll find some chocolate,\n                      and maybe a few beers in the fridge.\n                      Don't let them go to waste.\n          \n          The soldiers fall over each other to get to the fridge.\n          \n          Paul tries the safe numbers again, clunk! It opens.\n          \n          He sees: a big bunch of keys, a wad of dollars, Rwandan francs, a check\n          book, and several bottles of the best cognac, whiskey, some Cristal.\n          \n          He looks round nervously but the two soldiers are busy fighting over\n          the beer and chocolates in the fridge.\n          \n           s they do, Paul, hands trembling, stuffs the wads of notes, into his\n          belt, pulls his shirt over and shuts the safe door.\n          \n                                  PAUL (CONT'D)\n                      I've got them.\n          \n          He is about to leave.\n          \n                                  SOLDIER 1\n                      Wait!\n          \n          Paul looks back at the soldier.\n          \n                                  SOLDIER 1 (CONT'D)\n                      Sit down.\n          \n          Paul sits, as the two soldiers guzzle beers and stuff chocolate into\n          their pockets.\n          \n                                                                           42.\n          \n          \n          INT. HOTEL DIPLOMAT LOBBY. DAY\n          \n          Paul hurries through the lobby toward the entrance.\n          \n          \n          EXT. HOTEL DIPLOMAT ENTRANCE. DAY\n          \n          Paul emerges to see:\n          \n          All of the occupants of the van, Tatiana, his kids, Odette on their\n          knees, with their hands on their heads.\n          \n          The Captain hovers over them, pistol in hand, turns, sees Paul. He\n          marches toward him and SLAPS HIM HARD on the face.\n          \n                                    CAPTAIN\n                      Traitor!\n          \n          Paul reels from the blow, but manages to stay on his feet.\n          \n          The Captain snatches a bunch of ID cards from a soldier, hurls the\n          cards in Paul's face.\n          \n                                  CAPTAIN (CONT'D)\n                      They are all Tutsi cockroaches.\n          \n                                  PAUL\n                      Let me explain.\n          \n          He grabs Paul by the scruff of the neck, pushes him toward the kneeling\n          captives. The Captain snatches a pistol from one of his soldiers,\n          shoves it into Paul's hand.\n          \n                                    CAPTAIN\n                      SHOOT THEM!\n          \n          Paul looks at him.\n          \n                                  PAUL\n                      Please, I don't use guns.\n          \n                                  CAPTAIN\n                      There is nothing to it.\n          \n          The Captain raises his own pistol and FIRES it. Everyone jumps with\n          fright.\n          \n                                  CAPTAIN (CONT'D)\n                      Shoot them now or you die first.\n          \n          The Captain aims his pistol at Paul's head. Cocks the hammer.\n          \n          \n          \n          \n                                                                           43.\n          \n                                  PAUL\n                      Captain, what could I pay you not to do\n                      this?\n          \n          The Captain laughs.\n          \n                                  CAPTAIN\n                      You want to pay me?\n          \n                                  PAUL\n                      Why not? These are not rebels, look at\n                      them. Soon they will be worthless to you.\n                      Why not take some money, for your work?\n          \n                                    CAPTAIN\n                      How much?\n          \n                                  PAUL\n                      Name a price.\n          \n                                  CAPTAIN\n                      Ten thousand francs for each one.\n          \n                                  PAUL\n                      I don't have that much.\n          \n          The Captain laughs, snatches the gun from Paul, marches toward them.\n          \n                                    PAUL (CONT'D)\n                      Wait! Wait!\n          \n          Paul reaches into his pocket, pulls out the bunch of dollars.\n          \n                                  PAUL (CONT'D)\n                      Here, here, a thousand US dollars - fifty\n                      thousand francs for my family. To let us\n                      drive off to the Mille Collines.\n          \n                                  CAPTAIN\n                      How many in your family?\n          \n                                    PAUL\n                      Six.\n          \n          The Captain looks at his soldiers, at the wad of notes.\n          \n                                   APTAIN\n                      Pull your family out.\n          \n          Paul runs over, grabs Tatiana, Roger, the three girls. Odette kneels\n          beside Tatiana. Paul whispers.\n          \n                                  PAUL\n                      Have you any money?\n          \n                                                                            44.\n          \n                                    ODETTE\n                      Nothing.\n          \n          Paul pushes his family toward the van, looks back, sees the Captain\n          pocket the dollars, move toward the line.\n          \n                                  TATIANA\n                      Paul, don't let them die.\n          \n                                  PAUL\n                           (urgent)\n                      Get in.\n          \n          Paul pushes them into the van, shuts the door, digs into his soul for\n          all the courage he can muster, then turns back.\n          \n                                  PAUL (CONT'D)\n                      Captain, let these people give you some\n                      money, whatever they have.\n          \n          The Captain hesitates. Paul sees this, runs over to the line of\n          neighbors.\n          \n                                  PAUL (CONT'D)\n                      Give me everything, everything you have.\n          \n          A pathetic rain of Rwandan francs, useless coins, watches, jewelry\n          falls onto the ground. Paul scoops it all up.\n          T\n          \n          he Captain looks at it, takes it, then:\n          \n                                  CAPTAIN\n                      There is only enough for one cockroach.\n          \n          The Captain raises his pistol.\n          \n                                  CAPTAIN (CONT'D)\n                      Pick one to take with you.\n          \n          Now each terrified neighbor looks to Paul, begging.\n          \n                                    PAUL\n                      Wait, wait.\n          \n          Paul counts the kneeling figures: ten adults, four kids.\n          \n                                    PAUL (CONT'D)\n                      Ten.\n          \n                                  CAPTAIN\n                      And four children?\n          \n          \n          \n          \n                                                                              45.\n          \n                                  PAUL\n                      I'll give you a hundred thousand francs\n                      for all of them.\n          \n          The Captain points the gun.\n          \n                                    CAPTAIN\n                      Give me it.\n          \n                                  PAUL\n                      I don't have it here. At the Mille\n                      Collines. I can get it for you.\n          \n                                  CAPTAIN\n                      You will run into the hotel and hide\n                      behind the U.N.\n          \n                                  PAUL\n                      I swear, Captain, one hundred thousand\n                      francs, enough for a house. I will get\n                      the money, you keep them outside.\n          \n          The Captain smiles.\n          \n                                  CAPTAIN\n                      I will keep your family outside. Let's\n                      go.\n          \n          \n          EXT. HOTEL FRONT GATE. DAY\n          \n          The convoy pulls up at the outer gates of the Mille Collines. It's\n          manned by ARMED UN PEACEKEEPERS.\n          \n           he Captain walks to Paul in the van.\n          \n                                  CAPTAIN\n                      Go with my soldiers. And hurry back if\n                      you want to keep these cockroaches.\n          \n          The Captain nods to Paul's children.\n          \n          Paul jumps into the Rwandan army jeep.\n          \n                                  PAUL\n                           (to UN Peacekeepers)                                      \n                      I am the manager. Open the gate.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Chaos - UN jeeps, hotel vans, dismayed tourists, frightened Tutsi\n          refugees.\n          \n          \n          \n                                                                              46.\n          \n          CLOSE ON: Bik, the Dutch manager, bag packed, anxious, sees Paul.\n          YELLS.\n          \n                                  BIK\n                      Paul, I have to talk to you ...\n          \n          But Paul ignores Bik, barrels his way through the din and crush of the\n          parking lot.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul rushes in:   The lobby is filled with Tutsi refugees, and scared\n          white tourists.\n          \n            solitary receptionist, besieged by anxious guests, is relieved to see\n          Paul.\n          \n                                  RECEPTIONIST\n                      Oh, sir, please can you...\n          \n          Paul rushes to the accounting room behind the reception desk, closes\n          the door.\n          \n          \n          INT. HOTEL OFFICE. DAY\n          \n          Paul pulls bundles of dollars from the hotel safe.\n          \n          \n          EXT. HOTEL. DAY\n          \n          Paul pushes through the mob at the door. Bik comes up.\n          \n                                  BIK\n                      Paul...                                                        \n                            grabs Paul)                                              \n                      ...I have to talk to you.                                      \n                                   PAUL\n                      I'll be back.\n          \n          Paul breaks free and hurries over to the Army jeep.\n          \n                                  PAUL (CONT'D)\n                           (hops in)                                                 \n                      Let's go.\n          \n          \n          EXT. HOTEL FRONT GATE. DAY\n          \n          Paul jumps from the jeep. Waves to Tatiana in the van, then gives the\n          money to the Captain.\n          \n          \n          \n                                                                           47.\n          \n                                  PAUL\n                      Now let them go.\n          \n          No response. Money in hand, the Captain eyes Paul with malice.\n          \n                                  PAUL (CONT'D)\n                      Don't be foolish. There's more money to\n                      be made here.\n          \n                                  CAPTAIN\n                      You want to buy anymore cockroaches ask\n                      for Captain Naramunju.\n          \n          The Captain smiles, then jumps in his jeep and speeds off. Paul runs to\n          the van and jumps in.\n          \n          INSIDE THE VAN\n          \n          Jubilation, in the rear of the van. Odette is in tears.\n          \n                                  ODETTE\n                      Thank you, thank you, Paul.\n          \n          Paul doesn't reply. Tatiana hugs him. He gives her a look - a mix of       \n          relief and anger - the crowd in the back almost cost him his family.       \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul's van arrives. Bik hangs from a minibus.\n          \n                                  BIK\n                           (shouts)                                                  \n                      Paul, I have to go. The staff have fled\n                      Kivu Lodge. I have to close it.                                \n          \n          He flings office keys to Paul.\n          \n                                  BIK (CONT'D)\n                      While I'm away, you're in charge.                              \n          \n          Bik's van takes off. A group of tourists hears Bik's words.\n          \n                                  TOURISTS\n                      Hey, hey, we need our passports, we want\n                      to get a flight.\n          \n          Paul looks at them.\n          \n                                  TOURIST\n                      They're in your safety boxes. We need\n                      them right away.\n          \n                  \n                                                                              48.\n          \n                                  PAUL\n                      Come inside.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          At the desk, the same receptionist is overwhelmed.\n          \n                                  TOURIST (O.C.)\n                      He's in charge, that's him.\n          \n          Paul goes behind the desk. Rumors fly among the crowd of tourists.\n          \n                                  TOURISTS\n                      (staccato) to the airport...my embassy\n                      ...tried to call... the airport is closed\n                      ... refund... this is outrageous ...\n          \n          Behind the tourists, Tatiana and the neighbors look lost.\n          \n          Paul addresses the frightened Western tourists.  \n                                    \n                                  PAUL                                               \n                      Please, I am the house manager. Return in                      \n                      thirty minutes and we will deal with all                       \n                      your requests, thank you.     \n                                           \n          Paul turns to the room key boxes, nearly all are empty.\n          \n                                  PAUL (CONT'D)                                      \n                      What happened to all the rooms?\n          \n          Finally he finds a key, pushes through to Tatiana, hands a key to\n          Odette and Jean Baptiste.\n          \n                                  PAUL (CONT'D)\n                      Take this room. Tatiana, bring the\n                      children.\n          \n          Paul starts to lead his family away.\n          \n                                  TATIANA\n                      (re: neighbors) What about them?\n          \n          Paul looses it.                                                            \n                                  PAUL                                               \n                      Them. They almost got us all killed. I                         \n                      have done enough for them! We cannot look                      \n                      after them anymore.\n          \n                                                                           49.\n          \n                                  TATIANA\n                      What are you going to do? You cannot\n                      drive them out onto the road. They can                      \n                      stay with me.    \n                                                     \n                                  PAUL                                            \n                      What!          \n                                                       \n                                  TATIANA\n                      I will not have them on my conscience.                      \n                      They will stay in my room.  \n                                          \n                                  PAUL\n                           (to Zozo)\n                      Zozo, get a key for two staff bedrooms.\n                      Put these people in them.\n          \n                                  ZOZO\n                      Yes, sir.\n          \n          \n          INT. HOTEL CORRIDOR. DAY\n          \n          Paul hurries his family along the corridor. Rwandan refugees wander\n          aimlessly pulling their meagre possessions.\n          \n                                  REFUGEE\n                           (calls out)                                            \n                      Moses, Moses Seradungu.\n          \n                                  PAUL\n                      Can I help you?\n          \n                                  REFUGEE\n                      I'm looking for Moses Seradungu's room.\n          \n                                  PAUL\n                      What is his room number?\n          \n                                  REFUGEE\n                      I don't know.\n          \n                                  PAUL\n                      Go downstairs, I will help you.\n          \n          Paul finds his room and opens the door.\n          \n          \n          INT. HOTEL ROOM. DAY\n          \n          PAUL leads his family into a one-bedroom suite. The kids drop to the\n          beds exhausted. Tatiana picks up the phone and dials.\n          \n                                                                           50.\n          \n                                  PAUL\n                      What are you doing?\n          \n                                  TATIANA\n                      Trying Thomas and Fedens. We've got to\n                      get them here.\n          \n          Paul paces the room. The maids clearly haven't cleaned it since it's\n          last occupants: the beds are unmade; towels are on the floor; and a\n          newspaper is scattered across the desk.\n          \n                                  PAUL\n                      (re: room) This won't do.\n          \n                                  TATIANA\n                      It will do just fine.\n          \n          So Paul tidies the place. As he does,\n          \n                                  PAUL\n                      Any luck?\n          \n                                  TATIANA\n                      No answer. Please send someone to get\n                      them, please.\n          \n                                  PAUL\n                      I'll try.\n          \n          Paul leaves.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul waits, then a car pulls up, an Indian businessman, Mr. Garindi,\n          gets out, shakes hands, he's shaken.\n          \n                                  MR. GARINDI\n                      Terrible times, Paul. There are bodies                      \n                      everywhere. I cannot stay here.\n          \n                                  PAUL\n                      I need a great favor.\n          \n          He hands Mr. Garindi an address.\n          \n                                  PAUL (CONT'D)\n                      I need you to go to this address and\n                      bring my brother-in-law and his family.\n          \n                                  MR. GARINDI\n                      No, no. This is a very dangerous part of\n                      town. I cannot do this.\n          \n                                                                            51.\n          \n                                  PAUL\n                      This would be an enormous favor to me. I                     \n                      am a man of means, Mr. Garandi. When this                    \n                      nonsense is over I will be most grateful.    \n                          \n                                  MR. GARINDI\n                      I will see what I can do.\n          \n          Mr. Garindi climbs back into his car.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul stops just shy of the lobby. Around the corner is a mob of angry\n          guests. Paul takes a moment to gather himself: straightens his tie;\n          button his jacket; flick a piece of lint from his shoulder. Then he\n          takes a breath and steps around the corner.\n          \n                                  PAUL\n                      Thank you for your patience, ladies and                      \n                      gentlemen. Now, how can I help you.    \n                                \n          The mob rushes him.\n          \n                                                                      CUT TO:\n          \n          Paul works the front desk as angry guests surge all around him. Zozo\n          emerges from the office with two tourists.\n          \n                                  PAUL (CONT'D)\n                      Where are the receptionists? Where's\n                      Gregoire?\n          \n                                  ZOZO\n                      He has taken the presidential suite.\n          \n                                  PAUL\n                      What!\n          \n          Paul storms off.\n          \n          \n          INT. HOTEL CORRIDOR - DAY\n          \n          CLOSE ON: A door with a placard reading \"Presidential Suite\".   Paul\n          knocks. The door opens. Gregoire answers, half-naked.\n          \n                                   GREGOIRE\n                           (surprised)\n                      Mr. Manager.\n          \n                                  PAUL\n                      Gregoire, what are you doing here?\n          \n          \n          \n                                                                           52.\n          \n                                   A WOMAN'S VOICE INSIDE (O.S.)\n                      Who is it?\n          \n                                  GREGOIRE\n                      What do you want?\n          \n                                  PAUL\n                      Get out of this room and get back to\n                      work.\n          \n                                  GREGOIRE                                           \n                      I don't have to listen to you anymore. \n                                  \n                                  PAUL                                                                           \n                      I am in charge now. Get back to work or\n                      I'll fire you. \n                                                          \n                                  GREGOIRE                                           \n                      Let me ask you Mr. Manager, do you notice                      \n                      a smell of cockroaches? If I were to                           \n                      leave this room, I'm sure I could find                         \n                      this smell. I know people who could                            \n                      cleanse it.(stares) But maybe it doesn't                       \n                      bother you? Why is that? Are used to this                      \n                      smell? Not me, I need a clean room to                          \n                      escape it.         \n                                                      \n          Gregoire closes the door. Paul's eyes burn with anger, but this battle     \n          will have to wait.                                                         \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul comes into the lobby and discovers Colonel Oliver, he is escorting    \n          a tall, well-dressed man, the Tutsi Minister of Finance XAVIER and his\n          family.\n          \n                                  COLONEL OLIVER                                     \n                      Paul, you know who this is?\n          \n                                  PAUL\n                      Yes, Colonel Monsieur Xavier, the                              \n                      Minister of Finance.\n          \n                                   COLONEL OLIVER                                    \n                      Get him a room, but tell no one he is\n                      here.\n                            (to Xavier)\n                      Paul will look after you.\n          \n                                  XAVIER\n                      I will need a suite.\n          \n                               \n          \n                                                                            53.\n          \n                                   PAUL\n                      Of course.\n          \n          He moves over to Zozo.\n          \n                                  PAUL (CONT'D)\n                      Get the key to suite twelve, take these\n                      people there right away.\n          \n          There's a commotion by the door. Paul goes over.\n          \n          A valet stops a group of Tutsi refugees from entering.\n          \n                                  PAUL (CONT'D)\n                      What's going on?\n          \n                                  VALET\n                      Sir, they have no reservations.\n          \n          Paul studies the group, - a ragged bunch, no way are they Mille\n          Collines guest material.\n          \n                                  REFUGEE #2\n                      Please, sir, we have nowhere else to go.\n                      They're hunting us.\n          \n                                  PAUL\n                      Wait over there.\n          \n                                   EFUGEE #3\n                      We need a room.\n          \n                                  PAUL\n                      I said everyone go over there.\n          \n          Paul sees: UN Colonel Oliver giving an interview to the BBC in front of    \n          the hotel.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul approaches the BBC reporter Gloria and Colonel Oliver as their        \n          interview concludes.\n          \n                                  GLORIA\n                      Do we know who fired the missile that\n                      killed the president?\n          \n                                  COLONEL OLIVER                                     \n                      No. But I fear it's intention may have\n                      been to kill the peace accords and spark\n                      a civil war between the Hutu Militia and\n                      the Tutsi rebels.\n          \n                                                                                     \n          \n          \n          \n          \n                                                                            54.\n          \n                                  GLORIA\n                      We've heard reports of reprisal killings.\n                      Will the UN intervene to stop the                              \n                      bloodshed.?       \n                                                       \n                                  COLONEL OLIVER\n                      Unfortunately we're here as peace-keepers                      \n                      not peace makers, we can't take an                             \n                      aggressive role.         \n                                                \n                                  GLORIA\n                      If the UN changes your mandate could you                       \n                      stop the bloodshed?   \n                                                   \n                                  COLONEL OLIVER                                     \n                      Yes. With some re-inforcements I'm                             \n                      confident we could impose order.    \n                                     \n                                    GLORIA\n                      Have you requested re-enforcements?    \n                                  \n                                  COLONEL OLIVER                                     \n                      Yes we have.   \n                                                          \n                                    GLORIA\n                      What was the response?    \n                                               \n                                    COLONEL OLIVER                                   \n                      We're awaiting a decision, excuse me.  \n                                  \n          Colonel Oliver shakes Gloria's hand then moves off toward Paul.      \n                \n                                  COLONEL OLIVER (CONT'D)                            \n                      Paul, I've sent my soldiers to rescue the\n                      Lady Prime Minister, she'll need a room.\n          \n                                  PAUL\n                      Yes sir, but these people (points) they                        \n                      cannot stay here. I've heard you have a                        \n                      refugee center at the airport Stadium?   \n                                \n                                  COLONEL OLIVER                                     \n                      I'm sorry, I can't possibly take them                          \n                      Paul. I'm overrun with refugees. As soon                       \n                      as we can stabilize the situation we'll\n                      take them.\n          \n          PAUL moves to the door, where Jock and Gloria argue beside a saloon car\n          with the word `press' spelt out in tape on the wind sreen\n          \n                                  JOCK\n                      For fuck's sake, Gloria There's a big\n                      news story out there! We need to get out                       \n                      and cover it.                                                  \n          \n                         \n          \n                                                                           55.\n          \n          \n          \n                                  GLORIA\n                      We're not going outside the hotel grounds                      \n                      unless we have an armored car. That's the                      \n                      ground rules.\n          \n                                  JOCK\n                      Ground rules! Where the fuck do you think\n                      you are, Wimbledon?\n          \n                                  GLORIA\n                       We cover the story from here until we\n                      can get proper protection.\n          \n          She walks off.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul works his way through the crowds in the lobby, sees a trolley of\n          dishes by an elevator, looks around, can't see any staff. Disgusted, he\n          pushes the trolley himself.\n          \n          \n          INT. HOTEL KITCHEN. DAY\n          \n          Paul pushes the trolley into the deserted kitchen. At the back door,\n          several cooks listen to the radio.\n          \n                                  RADIO ANNOUNCER\n                      'Good Hutus, we must destroy an\n                      infestation of cockroaches at the\n                      technical college.'\n          \n                                  PAUL\n                      Turn that off. We have a hotel to run.\n          \n          The cooks halfheartedly slouch back to the sinks.\n          \n          \n          INT. HOTEL LOBBY. NIGHT\n          \n          The lobby is overflowing with refugees. Paul stands with phone to ear.\n          Zozo walks up.\n          \n                                  PAUL\n                           (to Zozo)\n                      Where's housekeeping? They won't pick up.\n          \n                                  ZOZO\n                      Sir, no one wants to work. They say the\n                      boss has left.\n          \n          \n          \n                                                                           56.\n          \n          Paul heads for the back office.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. NIGHT\n          \n          A neat corporate office.\n          \n          Paul picks up the phone.\n          \n          \n          INT. SABENA PRESIDENT'S OFFICE. BRUSSELS. NIGHT\n          \n          Several executive officers sit across from Sabena President GODEFROID\n          around a speaker phone.\n          \n                                      ABENA PRESIDENT\n                         Can I have your name again?\n          \n                                     PAUL (O.S.)\n                         Paul Rusesabagina, Mr. Godefroid. The\n                         house manager. I met you on your last\n                         visit.\n          \n                                     SABENA PRESIDENT\n                         Yes, Paul, I remember. The Mille Collines\n                         is a very important property for Sabena.\n                         Our directors believe we should close\n                         down, shutter the place until this unrest\n                         is over?\n          \n          This is really bad news. Paul can't allow them to close.\n          \n                                     PAUL\n                         Sir, that would be very bad for our                       \n                         reputation. We are an oasis of calm for                   \n                         all our loyal customers. What would they                  \n                         think if Sabena deserted them now? (lies)                 \n                         I assure you the United Nations has                       \n                         everything under control.\n          \n          IN THE SABENA PRESIDENT\n          \n          He looks at the others.\n          \n                                     SABENA PRESIDENT\n                         Very well. But if this thing gets worse,\n                         we must close. If there's anything you\n                         need, call anytime.\n          \n                                     PAUL\n                         There is one thing I need right away.\n          \n          \n          \n          \n                                                                           57.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. NIGHT\n          \n          Paul waits by the fax, then it spits out a single page.\n          \n          \n          INT. HOTEL BANQUET ROOM. NIGHT\n          \n          Every member of the hotel staff is gathered together. Paul addresses\n          them as Zozo hands out copies of a fax.\n          \n                                    PAUL\n                        This is my letter of appointment, signed\n                        by Mr. Godefroid, the president of\n                        Sabena. The Mille Collines is a five star\n                        establishment, we will run it that way.\n                        If you don't want to work for me, then\n                        leave now.\n          \n          No one moves.\n          \n                                    PAUL (CONT'D)\n                        I want the hallways cleaned now, a menu\n                        prepared for the dining room. Where's the\n                        pianist?\n          \n          A hand goes up.\n          \n                                    PAUL (CONT'D)\n                        I want you on the piano in the Kigali\n                        Room tonight. Back to work.\n          \n          \n          EXT. HOTEL FORECOURT. MORNING\n          \n          Paul emerges to find more refugees, some settled on the lawn, others\n          gathered in clumps by the doorway.\n          \n          Paul calls over to the valet.\n          \n                                    PAUL\n                        Take these people to the rear car park,\n                        they can't stay here.\n          \n          Suddenly women and children on the lawn scream and run in fear. Behind\n          them bushes shake, then suddenly a bloody figure wearing only boxer\n          shorts bursts out from among the trees and flees to the middle of the\n          driveway. It's the journalist, BENEDICT, covered in blood. His ear has\n          been chopped off.\n          \n          PANDEMONIUM. As Paul runs to him, calls to Zozo.\n          \n                                      PAUL (CONT'D)\n                        Get Odette!\n          \n                                                                                    \n          \n          \n                                                                           58.\n          \n          Paul grabs Benedict, tries to calm him.\n          \n                                  PAUL (CONT'D)\n                      What happened?\n          \n                                  BENEDICT\n                      They're killing everyone. The Lady\n                      Minister! The UN soldiers. They're at the\n                      gate.\n          \n          He points down the driveway. This sparks many of the women refugees,\n          and white guests, to flee inside the hotel.\n          \n          Odette arrives with her bag, leads Benedict inside.\n          \n          Jock has been filming all of this.\n          \n          \n          EXT. HOTEL DRIVEWAY. DAY\n          \n          Now Jock runs, camera still on his shoulder, toward the gate.\n          \n          Paul takes off after him.\n          \n          More Tutsi refugees running up the driveway in fear.\n          \n          \n          EXT. HOTEL FRONT GATE. DAY\n          \n          As Jock films, Paul arrives by the gate house. UN soldiers watch the\n          outside road. Engines roar, then.\n          \n          A convoy of Toyota trucks circle on the road outside the gate. Drunken\n          Militia men on the back wave spears, machetes, one, in a woman's disco\n          wig, waves a cordless power drill. The drill bit is red with blood.\n          \n          In the next truck, TWO Militia MEN triumphantly taunt the UN soldiers\n          as they hold blue UN helmets high on sticks. The helmets are shot\n          through with holes.\n          \n                                  MILITIAMAN #1\n                      We kill UN. We kill you next.\n          \n          ENRAGED UN SOLDIERS cock their weapons, aim.\n          \n          A UN armored car races past the Militia and turns into the driveway.\n          The back door opens, UN Colonel Oliver jumps out.  \n                                 \n                                  COLONEL OLIVER\n                      Hold the line here. Do not shoot!\n          \n          The Colonel stabilizes the situation, his men watch the militia drive     \n          by. Paul approaches Oliver                                                \n          \n                         \n          \n          \n                                                                           59.\n          \n                                  PAUL\n                      What's happening?\n          \n                                  COLONEL OLIVER                                    \n                      They murdered my soldiers. Ten Belgians\n                      who I sent to get the lady minister.\n          \n                                      PAUL\n                      Where is she?         \n                                                  \n          Oliver shakes his head. He helps Paul clamber into the armored car.\n                                                                         \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul follows Oliver as he marches through the lobby. Several reporters    \n          surround them.\n          \n                                  REPORTERS\n                      Is it true about the Belgian soldiers...\n                      Are all ten dead?\n          \n          Paul watches the UN command disappear into an elevator.\n          \n          \n          EXT. HOTEL CORRIDOR. DAY\n          \n          Paul is in the corridor, talking to Tatiana.    \n                                    \n                                  PAUL                                              \n                      Has Roger spoken yet?   \n                                                \n                                  TATIANA                                           \n                      No, Odette says he's in shock.   \n                                       \n                                  PAUL                                              \n                      How can we help him.        \n                                            \n                                  TATIANA                                           \n                      He needs to be in a safe place.                               \n                           (a beat)\n                      Have you heard from Mr. Garindi? \n                                       \n                                  PAUL                                              \n                      Give him time.              \n                                            \n          There's a clank of metal. Paul looks and sees:                            \n          A waiter struggling with a trolley of food by a door.                     \n          He hurries to help the waiter as Jock opens, indicates quiet, waves\n          Paul and the waiter in.                                                   \n          \n          \n                                                                           60.\n          \n          \n          INT. HOTEL BBC ROOM. DAY\n          \n          The room is set up as a make-shift broadcast center.\n          \n          Gloria is on a phone to the BBC in London, she hangs up.\n          \n                                  GLORIA\n                      Okay, we're feeding through live now.\n          \n          She fixes her outfit, sits straight up in the chair. Behind her two\n          monitors show footage of a plane crash and bodies along roads.\n          \n                                  GLORIA\n                      Okay London .... and five four three two\n                      one ...That's correct Tom. Today's\n                      gruesome ambush of a ten man Belgian\n                      patrol has left the UN peacekeeping force\n                      in a state of disarray. Its commander has\n                      called for re-enforcements. However, the\n                      General Council is deeply divided. The\n                      United States, still smarting from the\n                      UN's disastrous Somalia mission, has\n                      indicated that it will veto any moves to\n                      reinforce. Meanwhile, the slaughter goes\n                      on. Gloria Brooks in Kigali, Rwanda.\n          \n          Gloria on the phone, listens.\n          \n                                  GLORIA\n                      And, cut ...good, give me a call guys,\n                      let me know you've got it.\n          \n          Jock turns to Paul.\n          \n                                  JOCK\n                      Perfect timing.\n          \n                                  PAUL\n                      This goes out live?\n          \n          Jock points skyward.\n          \n                                  JOCK\n                      Satellite feed.\n          \n                                  GLORIA (ON PHONE)\n                      Great. (listens) No kidding,  When will\n                      they be here? Excellent. Yes, call then.\n          \n          She hangs up.\n          \n          \n          \n                                                                           61.\n          \n                                  GLORIA (CONT'D)\n                      The news room has heard that the French\n                      and the Belgians are putting together an\n                      intervention force.\n          \n                                  PAUL\n                      When will they be here?\n          \n                                     GLORIA\n                      Very soon.\n          \n                                     PAUL\n                      Thank God.\n          \n          Jock's is at the window scanning with his camera, getting b roll, then\n          he sees something.\n          \n                                  JOCK\n                      Hey Peter, hook me back into the\n                      monitors.\n          \n          Jock's filming as Peter makes the connection.\n          \n                                  JOCK (CONT'D)\n                      Holy shit! Holy shit.\n          \n                                     GLORIA\n                      What is it?\n          \n          Jock focuses\n          \n          On the monitor: blurry focus of a shanty town on a hill.\n          \n          NOW FOCUS: Of a crowd hovering close to a group of Rwandan Tutsis\n          seated on the ground. Two Militia emerge from the crowd, waving\n          machetes. They SLASH their way along the line, savage, powerful blows,\n          butchering people like cattle.          (Author note: we will use real\n          news footage of this)\n          \n                                  JOCK (CONT'D)\n                      You fucking see that!\n          \n                                     GLORIA\n                           (shock)\n                      Oh my God!\n          \n          On Screen: The crowd run off, waving machetes.\n          \n          \n          \n          Gloria snaps out of her shock, snatches the phone, dials.\n          \n                                                                           62.\n          \n                                  GLORIA (CONT'D)\n                      It's Gloria. Listen we've footage,\n                      unbelievable footage! A massacre!\n                      Machetes, murderers, dead bodies. You\n                      have to lead with this. We'll send it\n                      through right now. Wait 'til you see\n                      this.\n          \n          She puts the phone down, turns to the others, triumphant.\n          \n          An embarrassed silence in the room. Jock is disgusted by her glee. He\n          picks up a plate from the trolley.\n          \n                                  JOCK\n                      (to Gloria) Here, have a sandwich.\n          \n                                     GLORIA\n                      Fuck you.\n          \n          She storms out. Paul fills the embarrassed silence.\n          \n                                  PAUL\n                      I'm glad you filmed this. Now the West\n                      will have to stop it. Excuse me,\n                      gentlemen.\n          \n          \n          EXT. HOTEL CORRIDOR. EVENING\n          \n          The businessman Mr. Garindi knocks on room 211. Paul opens the door,\n          sees him, then turns back to Tatiana.\n          \n                                     PAUL\n                      Tatsi, come.\n          \n          Tatsi appears at the door with several of the kids.\n          \n                                  PAUL (CONT'D)\n                      (to the kids) Go back inside.\n          \n          The kids do as they're told. Paul and Tatsi shut the door and join the\n          businessman in the hall.\n          \n                                  PAUL (CONT'D)\n                      Did you find the twins?\n          \n          Tatiana clings to Paul, fearful of the news.\n          \n                                  MR. GARINDI\n                      I made it to the house but it was empty.\n                      It had been robbed.\n          \n                                     TATIANA\n                      Oh God.\n          \n                            \n          \n                                                                              63.\n          \n                                  PAUL\n                      Was there blood?\n          \n                                  MR. GARINDI\n                      No blood. As I left a neighbor, an old\n                      woman, waved to me. I went to her house.\n                      She has the little girls. They are safe.\n          \n                                  TATIANA\n                      My brother, his wife. Did this woman know\n                      of them? Did they leave the children with\n                      her?\n          \n          The businessman shakes his head no. Tears run down Tatiana's face. She\n          holds Paul's arm to stop from falling to the floor.\n          \n                                  PAUL\n                      This is not bad news, Tatsi. Perhaps they\n                      fled or could not make it home. There is\n                      hope.\n          \n                                  TATIANA\n                           (to the businessman)\n                      Please go back, bring the children to us.\n          \n                                  MR. GARINDI\n                      (frightened)No ma'am, I cannot do that.\n                      The roadblocks are everywhere. They are\n                      looking for children. They shout, \"Kill\n                      the babies to clear the infestation.\"\n                      Leave them be, they are safe. I have to\n                      go now.\n          \n          Paul takes a small wad of notes from his pocket, presses it into the\n          businessman's hand.\n          \n                                  PAUL\n                      Thank you for your help.\n          \n          He leaves. Tatiana pulls Paul to her.\n          \n                                  TATIANA\n                      My sister is dead, Paul. They would not\n                      leave the children.\n          \n                                  PAUL\n                      No. They are not dead. Stop this.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul and Tatiana push through the French tourists and AID workers\n          running across the lobby.\n          \n                                                                            64.\n          \n                                   FRENCH TOURISTS\n                       Mon Dieu, Merci.\n          \n          Cheers break out. Paul and Tatsi peer from the crowd and through the\n          lobby window see:\n          \n          \n          EXT. HOTEL DRIVEWAY. DAY\n          \n          French and Italian special forces pull into the parking lot, standing\n          tall in their jeeps, macho western super troops, triumphant. Salvation!\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Wild cheering, flowers draped around necks, kisses. Westerners,\n          Rwandans, dance and sing in celebration.\n          \n          Paul SEES: Colonel Oliver off to the side, with the commanders of the      \n          French special forces.\n          \n          \n                      OLIVER\n          CLOSE ON:                                                                  \n                                   COLONEL OLIVER                                    \n                       You have a battalion, you could stop this\n                       now. The Hutu army is no match for you.\n          \n                                   FRENCH COMMANDER\n                       Those are not our orders.\n          \n          Oliver pulls off his blue beret, throws it on the ground, points his       \n          finger at the French and Italian officers.\n          \n                                   COLONEL OLIVER                                    \n                       You will remember this day for the rest\n                       of your lives.\n          \n          He walks off, returns, picks up his beret.\n          \n          Paul watches as he storms into the lobby.\n          \n          Paul follows.\n          \n          \n          INT. HOTEL BAR. DAY\n          \n          Paul follows the Colonel into the Kigali Club. The place is empty, the     \n          bartender missing, gone to celebrate.\n          \n                                   PAUL\n                       Colonel, what can I get you?                                  \n          Paul gets behind the bar.\n          \n                                                                           65.\n          \n                                  COLONEL OLIVER                                    \n                      Anything. Strong.\n          \n                                  PAUL\n                      Canadian Club?\n          \n          Oliver cracks a weary smile. Paul pours two drinks, slides one across.    \n          He raises his glass.\n          \n                                  PAUL (CONT'D)\n                      Congratulations, Colonel. You have saved                      \n                      us all.\n          \n                                   COLONEL OLIVER                                   \n                            (raw cynicism)\n                      Congratulations. You should spit in my\n                      face.\n          \n                                  PAUL\n                      Excuse me, Colonel.                                           \n                                  COLONEL OLIVER                                    \n                      We think you are dirt, less than dirt,\n                      worthless.\n          \n                                  PAUL\n                      I don't understand.\n          \n                                  COLONEL OLIVER                                    \n                      Don't bullshit me, Paul. You're the\n                      smartest man here. You have them all\n                      eating out of your hand. You'd own this\n                      fucking hotel, except for one thing.\n          \n          Paul doesn't answer.\n          \n                                  COLONEL OLIVER (CONT'D)                           \n                      You're fucking black! You're not even a\n                      nigger, you're African!\n                           (downs his drink)\n                      They're not staying to stop this thing.\n                      They're gonna fly right out of here with\n                      their people.\n          \n                                  PAUL\n                           (shocked)\n                      Their people?\n          \n                                  COLONEL OLIVER                                    \n                      They're only taking the whites.\n          \n                               \n          \n                                                                           66.\n          \n          \n          INT. HOTEL PAUL'S ROOM. DAY\n          \n          Paul opens the door. Tatiana and the kids pack bags, prepare to leave.\n          \n                                  PAUL\n                      Children, go into the hallway.\n          \n          Tatiana and the children stop what they're doing, puzzled.\n          \n                                  PAUL (CONT'D)\n                      (to the kids) Please, go.\n          \n          The kids leave.\n          \n                                  TATIANA\n                      What's wrong?\n          \n          Paul takes her hands in his.\n          \n                                  PAUL\n                      All the whites are leaving.\n          \n          Tatiana's grip tightens.\n          \n                                  PAUL (CONT'D)\n                      They are being evacuated.\n          \n                                  TATIANA\n                      What about us?\n          \n                                  PAUL\n                      We have been abandoned.\n          \n          Tatiana clings to hope.\n          \n                                  TATIANA\n                      The soldiers will stop the killers.\n          \n          Paul looses it.\n          \n                                  PAUL\n                      Listen to me woman. I said all the whites\n                      are leaving. The French, the Italians,\n                      even the Belgian UN soldiers.\n          \n                                  TATIANA\n                      But who is left?\n          \n                                  PAUL\n                      I don't know. Colonel Oliver says the UN                      \n                      has three hundred soldiers for the whole\n                      country. Black soldiers, Pakistanis.\n          \n          \n          \n          \n                                                                              67.\n          \n          He looks up at her.\n          \n                                  PAUL (CONT'D)\n                      The most the Colonel can spare for the                           \n                      hotel are four men, and they're not\n                      allowed to shoot.\n          \n          He takes her hand, makes her sit down.\n          \n                                   PAUL (CONT'D)\n                      If anything should happen, if the Militia\n                      arrive, you must take the children and go\n                      to the roof.\n          \n          Tatiana's eyes are wide with fear.\n          \n                                  TATIANA\n                      What for?\n          \n          Paul takes his anger out on Tatiana.\n          \n                                  PAUL\n                      Do what I say, woman. You hear me? I will\n                      meet you there.\n          \n          He storms out.\n          \n                                                                         CUT TO:\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          REVEAL: A chaos of luggage, white tourists, AID agency people, Italian\n          and French soldiers, elite, slick.\n          \n          On the edges, clumps of Rwandans, watching, silent, fearful.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          A torrential African rain storm soaks everything. Porters with big\n          umbrellas run the white evacuees to the buses.\n          \n          French and Italian commanders check off names on clipboards.\n          \n          Jock films the evacuees boarding buses.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          At the front desk, Paul, dripping wet from working the convoy,    listens\n          to a French tourist who refuses to pay his bill.\n          \n                                   \n          \n          \n                                                                           68.\n          \n                                     FRENCH TOURIST\n                         Why should I pay to stay in a, in a\n                         holocaust? Tell me.\n          \n          Paul, stone-faced, polite, destroys this asshole.\n          \n                                     PAUL\n                         You are not staying sir, you are leaving.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul watches in the rain as the final agency people are being loaded\n          onto buses.\n          \n          Several white aid workers weep uncontrollably as they are dragged away\n          from frightened Rwandan coworkers.\n          \n             PAUL in the rain.\n          \n           cross the parking lot Colonel Oliver watches from his jeep.              \n          Jock and his sound man embrace two beautiful young HOOKERS.\n          \n          One girl begs Jock to take her with him.\n          \n                                     HOOKER\n                         Please, please, they will put me on the\n                         street. They will chop me.\n          \n                                     JOCK\n                         Darlin', believe me, if I could...\n          \n          He digs in his pockets, pulls out money, cigarettes. Everything he has\n          he gives to her.\n          \n          Then he pulls her toward Paul, digs out his wallet.\n          \n                                       JOCK (CONT'D)\n                         Here. Here.\n          \n          He pushes two Visa cards into Paul's hands.\n          \n                                     JOCK (CONT'D)\n                         Give her what she wants, room, food,\n                         anything. Charge it all. Don't you put\n                         her out, Paul.\n          \n                                     PAUL\n                         I would never do that.\n          \n                                     JOCK\n                         I know that, Paul. I'm sorry.                              \n                         Here take this.                                            \n          \n          \n          \n                                                                              69.\n          \n          Jock pulls a Rolex off his wrist.  \n                                                  \n                                  PAUL\n                      This is a Rolex, I can't take it.   \n                                     \n                                  JOCK                                               \n                      Take it for Christ sake. I wish it was a                       \n                      fucking aeroplane.       \n                                                \n          Jock embraces Paul, tears in his eyes.\n          \n          Gloria watches from the doorway. Embarrassed by Jock, She becomes\n          officious.\n          \n                                  GLORIA\n                      Let's go, Jock.\n          \n                                  JOCK\n                           (turns on her)\n                      Go! What the fuck sort of journalists are\n                      we, running from a war? I'm ashamed. Are\n                      you? Well, are ya'?\n          \n                                  GLORIA\n                      You're drunk.\n          \n          Gloria marches onto the bus.\n          \n                                   LORIA\n                           (to a French soldier)\n                      What are we waiting for?\n          \n                                  FRENCH SOLDIER\n                      We have to evacuate some nuns from a\n                      convent. They are on their way.\n          \n          Jock kisses the hooker, heaves his camera onto the bus.\n          \n          Then there is a disturbance on the driveway.\n          \n          A group of French nuns, along with maybe a hundred Tutsi women and\n          children come running up the driveway. They are all terrified. One nun\n          leads them with a French flag.\n          \n          French soldiers run forward. A commander orders them to form   a line,\n          blocking the refugees.\n          \n          French soldiers begin pulling nuns from the terrified crowd.\n          \n          Several nuns begin hysterically weeping, pulling Rwandan children with\n          them. Panic breaks out among the crowd.\n          \n                                                                           70.\n          \n          \n          INT/EXT. BUS. DAY\n          \n          Jock grabs his camera, pushes off the bus.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Nuns cling to young children. French soldiers wrench the nuns away,\n          lift them off their feet, carry them to the bus.\n          \n          JOCK films, as A FRENCH OFFICER screams at him.\n          \n          The last nun is dragged onto a bus.\n          \n          Jock looks to Paul, then gets on the bus.\n          \n          The convoy - French jeeps, buses, Italian jeeps, UN jeeps takes off,\n          through the refugees, turns a corner, gone.\n          \n          Paul, drenched, is left alone to fend for his new guests:                 \n          Weeping women, frightened children.\n          \n          \n          EXT. HOTEL FRONT GATE. DAY\n          \n          The convoy passes the gate house.\n          \n          Across the road, two jeeps of Rwandan Army soldiers watch the convoy\n          leave. They get on the radio.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Where five minutes before the lobby was a frenzy of wealthy Europeans\n          and aid workers, the groups of clustered black faces are silent except\n          for the crying of babies and sobbing mothers. Paul picks his way among\n          them. Zozo catches up.\n          \n                                  ZOZO\n                      What do we do with all these people?\n          \n                                  PAUL\n                      Open up the ballroom, we'll put them\n                      there. And Zozo tell the kitchen to make\n                      rice and beans - a lot of it.\n          \n          \n          INT. HOTEL PAUL'S ROOM. DAY.\n          \n          Paul enters, drops to the bed. Tatiana curls up next to him.\n          \n                                  TATIANA\n                      You could leave, Paul.\n          \n                \n          \n          \n                                                                           71.\n          \n                                    PAUL\n                        What are you saying, Tatsi?\n          \n                                    TATIANA\n                        Your card says Hutu. Take our children,\n                        go and get the twins, pay money at the\n                        roadblocks. Get them out. Please.\n          \n                                    PAUL\n                        Enough of this. We stay together. Let me\n                        rest, I will feel better then.\n          \n          Paul puts on his walkman earphones, presses play, the rich cowboy drawl\n          of Don Williams singing ???\n          \n          Close on: Paul as his eyes droop and to the music.\n          \n          A kalidiscope of colors filter through drooping eyelids as\n          \n          Close on Paul's face, as the music plays.\n          \n          His eyes open wide, disturbed, music playing\n          \n          Paul's POV, an Army lieutenant stands over him, other soldiers around.\n          \n          The lieutenant reaches down, pulls the earphones from Paul's ears.\n          \n                                    LIEUTENANT\n                        You are the manager?\n          \n                                    PAUL\n                        Yes, sir. What is wrong?                                     \n                                    LIEUTENANT\n                        Everyone must leave the hotel now.\n          \n                                    PAUL\n                        Why sir?\n          \n                                    LIEUTENANT\n                        It's an order. Get everyone out now.\n          \n                                    PAUL\n                        I...ah...need some time. Please give us\n                        twenty, thirty minutes. People are\n                        sleeping.\n          \n          The lieutenant is not impressed.\n          \n                                    PAUL (CONT'D)\n                        Please, have some cold drinks. I will be\n                        as quick as I can.\n          \n          'Cold drinks' softens the soldiers' attitudes.\n          \n          \n          \n                                                                           72.\n          \n                                  LIEUTENANT\n                      We will be outside, ten minutes.\n          \n          The soldiers march off. Paul goes back inside. The kids, sensing the\n          menace, sit still and wide-eyed on the floor. Suddenly Tatiana notices     \n          Roger is missing.                                                          \n                                  TATIANA                                            \n                      Where's Roger?        \n                                                   \n          Danielle points to under the bed.    \n                                                \n          CLOSE ON:                                                                  \n          Roger trembling under the bed, as Paul's face appears.   \n                            \n                                  PAUL                                               \n                      Come on son, everything is all right.                          \n          He slides him out, clutches him in his arms, then turns him over to\n          Tatiana as he phones the front desk. \n                                                \n                                  PAUL (CONT'D)                                      \n                           (on phone)                                                \n                      Who is this? Zozo. I know. Get them beer.                      \n          \n          He turns to Tatiana.\n          \n                                  PAUL (CONT'D)\n                      Go to the roof now.\n          \n                                  TATIANA\n                           (terrified)\n                      What for Paul.\n          \n                                  PAUL\n                           (forceful)\n                      Do as I say. I will be there soon.\n          \n          He hurries out.\n          \n          \n          INT. HOTEL CORRIDOR. DAY\n          \n          Paul's door opens, his head appears round the corner.\n          \n          The corridor is empty of soldiers. Now, frightened Tutsis peer out from\n          their rooms. A group of men, among them the politician Xavier, are\n          gathered in the hallway. Paul spots one man holding a pistol. He runs\n          up.\n          \n                                  PAUL\n                           (to the man with the pistol)\n                      Are you mad? They will gun us all down.\n          \n                                                                           73.\n          \n                                  PISTOL MAN\n                      Better to die by the bullet than the\n                      machete.\n          \n          Paul pulls the gun off him.\n          \n                                  PAUL\n                      Wait here, please.\n          \n          Paul hands the gun to Xavier, hurries off.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. DAY\n          \n          Paul bursts in, sits by the phone and dials.\n          \n                                  PAUL (ON PHONE)\n                      Good day, General Bizimungu please. Do\n                      you know where he is? Please ask him to\n                      call Paul Rusesabagina. It is urgent.\n          \n          Phone again.\n          \n          A SERIES OF FLASH CUTS: increasingly frantic calls.\n          \n                                  PAUL (CONT'D)\n                      Colonel Bagsora. Where? Can you find him?\n          \n          ANOTHER CALL:\n          \n                                  PAUL (CONT'D)\n                      Who would order such a thing?\n          \n          ANOTHER CALL:\n          \n                                  PAUL (CONT'D)\n                      Did you find the General?\n          \n          Paul hangs up the phone defeated. He looks at his watch. His head flops\n          onto the desk, onto the Sabena logo. He sees it.\n          \n          \n          INT. SABENA PRESIDENT'S OFFICE. DAY\n          \n          The Sabena president and two VPs sit on couches.\n          \n                                  PRESIDENT\n                      If British Airways abandons the route we\n                      should bid for it.\n          \n          His intercom buzzes, he's annoyed then.\n          \n                            \n          \n                                                                             74.\n          \n                                  SECRETARY (ON PHONE)\n                      I'm sorry, sir. I have a call from Paul\n                      in Kigali. He says it's urgent.\n          \n          The president goes to the phone, hits the speaker button.\n          \n                                  PRESIDENT\n                      Paul. Are you alright?\n          \n                                  PAUL (O.S.)\n                      We have a big problem. The Hutu army have\n                      come and ordered us all of us out of the\n                      hotel.\n          \n          The president is baffled.\n          \n                                   RESIDENT\n                      Out? Where are you going?\n          \n                                   PAUL\n                      I do not know, sir. I think they will\n                      kill us all.\n          \n          The president can barely form words to reply.\n          \n                                  PRESIDENT\n                      All. What do you mean all?\n          \n                                  PAUL\n                      The staff, the guests.\n          \n                                  PRESIDENT\n                      The staff and guests! How many?\n          \n                                  PAUL\n                      Now we have eight hundred guests and one\n                      hundred staff. I have ten minutes left.\n                      I wish I could have done more, sir.\n                      Please, thank all my friends at Sabena.\n                      You have been good to me and my family.\n          \n                                  PRESIDENT\n                      (panicked) Paul, wait, wait, I'm going to\n                      put you on hold for one minute, stay on\n                      the phone.\n          \n          He hits the hold button. Looks to the other executives. They are\n          stunned to silence by Paul's profound farewell.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. DAY\n          \n          Paul listens to music on the phone.\n          \n          \n                                                                           75.\n          \n          \n          INT. SABENA EXTERIOR OFFICES. DAY\n          \n          Pandemonium - the president has everyone working the phones.\n          \n                                  PRESIDENT\n                      Get the prime minister's office. Call\n                      General Chareaux. Louis get the UN. Tell\n                      them this is Belgian property.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. DAY\n          \n          The music is suddenly interrupted.\n          \n                                  PRESIDENT (O.S.)\n                      Paul, are you there?\n          \n                                  PAUL\n                      Yes, thank you Mr. President.\n          \n                                  PRESIDENT (O.S.)\n                      Paul, if you have one call in all the\n                      world to stop this, who would you call?\n          \n          Paul thinks.\n          \n                                  PAUL\n                      The French. They supply the Rwandan army.\n          \n                                  PRESIDENT (O.S.)\n                      Paul, do everything you can to buy time.\n                      I will call you back.\n          \n          Paul hurries from the room.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Zozo at the computer, printing something. Paul walks up, sees: The\n          Hotel's Registry printing. Paul grabs it, studies.\n          \n                                  PAUL\n                      What are you doing?\n          \n                                  ZOZO\n                      The lieutenant wants the register.\n          \n          He pushes Zozo toward the elevator.\n          \n                                  PAUL\n                      Go and get more beer.\n          \n          Now Paul is on the computer, typing.\n          \n                                                                           76.\n          \n          ON SCREEN: The register shows that day's date: April 13.\n          \n          Paul hits a few keys.\n          \n          ON SCREEN: The date above the register is April 4.\n          \n          Paul hits the print button. The printer clicks to life.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul with the printed registry and Zozo with beer walk to the jeeps.\n          The soldiers don't wait for the Captain's order, they mob Zozo, grab\n          beers. The lieutenant marches up to Paul.\n          \n                                  LIEUTENANT\n                      Where's the guest list?\n          \n          Paul hands him the printout. He studies it, reads.\n          \n                                  LIEUTENANT (CONT'D)\n                      Anderson, Arthurs, Boulier. What is this?\n          \n                                  PAUL\n                      The guest list. It hasn't been updated\n                      since the murder of the president.\n          \n          The lieutenant grabs Paul by the shirt.\n          \n                                  LIEUTENANT\n                      Are you trying to make a fool of me?\n                      There are no Europeans left in that\n                      hotel. Get me the names of all the\n                      cockroaches in there.\n          \n                                  PAUL\n                      That will take time.\n          \n                                  LIEUTENANT\n                      You don't have time. If I do not have the\n                      names, so that I can pick out the\n                      traitors, then I will kill everyone here\n                      in this car park. Get in there now.\n          \n          Paul turns to walk back in. The lieutenant hurries to his men, pulls\n          beers from their hands, smashes them on the ground. One soldier comes\n          running to him with a radio. Paul watches. The lieutenant listens, then\n          calls to Paul.\n          \n                                  LIEUTENANT (CONT'D)\n                      Hey you, come here.\n          \n          Paul returns.\n          \n          \n          \n          \n                                                                           77.\n          \n                                     LIEUTENANT (CONT'D)\n                         Who did you call?\n          \n                                      PAUL\n                         Call, sir?\n          \n                                     LIEUTENANT\n                         Don't lie to me. What's your name?\n          \n                                     PAUL\n                         Rusesabagina. Paul Rusesabagina.\n          \n                                     LIEUTENANT\n                         I will remember that name. (turns to his\n                         soldiers) Let's go.\n          \n          The soldiers roar off down the driveway.\n          \n             ZOZO looks to Paul, a thank you Jesus look.\n          \n          \n          EXT. HOTEL ROOF. DAY\n          \n          Paul emerges onto the roof, sees Tatiana, his children, and many of the\n          neighbors sitting huddled together. (They do not know the soldiers have\n          left.)\n          \n          Tatiana is frozen to the spot.\n          \n                                     PAUL\n                         They have gone.\n          \n          Tatiana grabs him. Tears of joy. Paul's neighbors swarm him, touch him,\n          thank him like a messiah. This effects him. He seems genuinely moved as\n          he shakes hands and hugs them.\n          \n                                     ZOZO\n                         Sir. The president of Sabena is on the\n                         phone for you.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. DAY\n          \n          Paul arrives behind the front desk.\n          \n          Paul hits the button.\n          \n                                     PAUL\n                         They are gone. Thank you, sir. What did\n                         you do?\n          \n                               \n          \n                                                                            78.\n          \n          \n          INT. SABENA PRESIDENT'S OFFICE. BRUSSELS. DAY\n          \n          Gotfroid is at his desk.\n          \n                                  SABENA PRESIDENT\n                      I managed to get the President of France\n                      on the phone.\n          \n                                  PAUL (O.S.)\n                      Thank you, sir, you saved our lives.\n          \n                                  SABENA PRESIDENT\n                      Paul, I pleaded with the president to go\n                      in and get you all. He told me it will\n                      not happen.\n          \n                                     PAUL\n                      Why?\n          \n                                  SABENA PRESIDENT\n                      I can give you many political answers\n                      Paul but the truth is that Africa is not\n                      worth a single vote to all of them:\n                      French, British, Americans.\n          \n          Silence.\n          \n                                  SABENA PRESIDENT (CONT'D)\n                      You have to get out of there, Paul. I\n                      will do whatever I can.\n          \n                                                                 SMASH CUT TO:\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. DAY\n          \n          The elite of the Tutsi refugees, those with contacts or friends abroad,\n          are gathered in the office.\n          \n                                  PAUL\n                      There will be no rescue, no intervention\n                      force. We can only save ourselves. Call\n                      any foreigner you know, tell them what\n                      will happen to us. Say goodbye but when\n                      you say goodbye, say it as though you're\n                      reaching through and shaking their hand.\n                      Let them know if they let go of that\n                      hand, you will die. (silence) We must\n                      shame them into sending help.\n          \n          The others look stunned.\n          \n                                                                           79.\n          \n                                  PAUL (CONT'D)\n                      Get on the phones while we still can. At\n                      least we can say they heard our cries.\n                      Zozo come with me.\n          \n          Paul leaves.\n          \n                                                                      CUT TO:\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul looks around the lobby. It resembles a refugee center more than a\n          five star hotel.\n          \n          He turns to a computer, calls up the register, then hits DELETE and\n          erases the register.\n          \n          He picks up the phone, calls.\n          \n                                  PAUL\n                      Send two of the housekeeping carpenters\n                      to the lobby.\n          \n          Paul strides across the lobby, calls to Zozo.\n          \n                                  PAUL (CONT'D)\n                      Everyone gather together now. Zozo get\n                      them all together.\n          \n          They herd together quickly.\n          \n                                  PAUL (CONT'D)\n                      No one can remain in this lobby any\n                      longer. I have rooms available. Who can\n                      pay? The rental is six hundred francs per\n                      day.\n          \n          About fifty percent of the hands go up.\n          \n                                  TUTSI WOMAN\n                      I cannot pay?\n          \n                                  PAUL\n                      Go with Zozo to the ballroom. We will\n                      find you bedding. This is a hotel. No one\n                      will be allowed to stay in the lobby.\n          \n          The carpenters arrive beside Paul.\n          \n                                  PAUL (CONT'D)\n                      Good. I want you to go around and take\n                      all the numbers off the doors.\n          \n                                 \n          \n                                                                            80.\n          \n                                  CARPENTER\n                      What shall we put in their place.\n          \n                                  PAUL\n                      Nothing. I want no numbers on the doors.\n          \n          \n          INT. HOTEL CORRIDOR. DAY\n          \n          Paul going door to door, knocking. The rooms are all packed with Tutsi\n          refugees. A door opens.\n          \n                                  PAUL\n                      Good day. Here is your bill for the last\n                      week. If you cannot pay, or think you\n                      will not be able to pay, go to the\n                      ballroom. Zozo will take care of you.\n          \n                                                                  DISSOLVE TO:\n          \n          \n          INT. HOTEL CORRIDOR. DAY.\n          \n          Paul knocks on a door. The Tutsi politician Xavier opens the door, sees\n          that it is Paul.\n          \n                                  XAVIER\n                      Come in Paul.\n          \n          \n          INT. HOTEL LUXURY SUITE. DAY\n          \n          A beautiful two-bedroom suite. Xavier lives in comfort compared to the\n          other refugees.\n          \n                                  PAUL\n                      I'm afraid you will have to move room.\n          \n                                  XAVIER\n                      Move? Where to?\n          \n                                  PAUL\n                      I'm going to put you on the third floor.\n          \n                                  XAVIER\n                      The third floor are low class rooms.\n          \n                                  PAUL\n                      Yes they are. However if the army return\n                      they will expect important people such as\n                      yourself to be in these grand rooms.\n          \n          \n          \n          \n                                                                           81.\n          \n                                  XAVIER\n                           (to his wife)\n                      Pack the bags, we have to move.\n          \n                                  PAUL\n                      Also, this is your bill for the last\n                      week.\n          \n          Paul leaves, Xavier looks shocked.\n          \n                                                                     FADE TO:\n          \n          \n          MONTAGE\n          \n          Paul and influential refugees, Odette, Benedict (with a bandage over\n          his missing ear), Xavier and others call, plead, write and send faxes\n          all around the world. We see this NIGHT and DAY; DAY and NIGHT --\n          \n           hen Odette on the phone.\n          \n                                  ODETTE\n                      Yes, that's right. I helped set up the\n                      treatment center in Nairobi. I'm in the\n                      Mille Collines Hotel right now with my\n                      husband, Peter, and my two boys. If you\n                      do not help us we will be murdered.\n          \n          Zozo arrives.\n          \n                                  ZOZO\n                      Sir, General Bizimungu is here.\n          \n          \n          EXT. HOTEL POOL TERRACE. DAY\n          \n          The pool patio is deserted except for General Bizimungu and three\n          soldiers who lounge at a table. Gregoire and his girlfriend sun on\n          reclining deck chairs like movie stars. Paul and a waiter with a tray\n          of drinks join the General.\n          \n                                  GENERAL BIZIMUNGU\n                      I am glad you are well.\n          \n          Paul hands the scotch to Bizimungu.\n          \n                                  PAUL\n                      I'm sorry it is not Glenmorangie.\n          \n                                   GENERAL BIZIMUNGU\n                      As long as it is scotch.\n                            (drinks)\n                      Your white friends have abandoned you,\n                      Paul.\n          \n                                 \n          \n                                                                          82.\n          \n                                  PAUL\n                      The United Nations are still here.\n          \n                                  GENERAL BIZIMUNGU\n                      (laughs) The United Nations. Madmen are\n                      on the streets, Paul. But I will take\n                      care of you. (chugs his drink) Your\n                      cellar is well-stocked, right?\n          \n                                  PAUL\n                      Yes, General. I am glad you came by. I\n                      overheard something that I think you\n                      should know about.\n          \n                                  GENERAL BIZIMUNGU\n                      What did you overhear?\n          \n                                  PAUL\n                      A discussion between an American Embassy\n                      official and a UN Colonel.\n          \n                                  GENERAL BIZIMUNGU\n                      What did they say?\n          \n                                  PAUL\n                      The American assured the colonel that\n                      they would watch everything.\n          \n                                  GENERAL BIZIMUNGU\n                      Watch everything? How? They are gone.\n          \n          Paul points surreptitiously to the sky. The General looks up.\n          \n                                    PAUL\n                      Satellites.\n          \n                                    GENERAL BIZIMUNGU\n                      Satellites?\n          \n                                  PAUL\n                      Yes, they can photograph the epaulets on\n                      your shoulder.\n          \n                                   ENERAL BIZIMUNGU\n                      And what will they do with these\n                      satellites?\n          \n                                  PAUL\n                      The American said intervention is too\n                      costly, better to get photographic\n                      evidence and snatch up the high command.\n          \n                                  GENERAL BIZIMUNGU\n                      The high command? Our high command?\n          \n                         \n          \n                                                                           83.\n          \n                                  PAUL\n                      'Snatch them up and put on a war crimes\n                      trial. Lock them all away forever. No\n                      political risk, and big publicity.'\n                      That's what he said. (a beat) I thought\n                      I'd better tell you.\n          \n          The General looks again to the sky then.\n          \n                                  GENERAL BIZIMUNGU\n                      The Americans! Who are they to put us on\n                      trial. Let us imagine Paul when their\n                      president Kennedy was shot, they said it\n                      was a black man. Then their politicians,\n                      their radio stations gave orders `we must\n                      wipe out these black people before they\n                      wipe out us.' What do you think would\n                      have happened? No different.\n          \n                                  PAUL (CONT'D)\n                      Indeed, general. Excuse me momentarily.\n          \n          \n          INT. HOTEL CELLAR. DAY\n          \n          Paul fills Bizimungu's briefcase with scotch, hands two six-packs of\n          beer to Zozo. Paul notes his once packed storeroom, now considerably\n          dwindled in stock.\n          \n                                  PAUL\n                      Where has all our beer gone?\n          \n                                  ZOZO\n                      Sir, Gregoire has been taking beers.\n          \n                                  PAUL\n                      How much beer?\n          \n                                    ZOZO\n                      Many beers.\n          \n          \n          EXT. HOTEL POOL TERRACE. AFTERNOON\n          \n          Paul arrives back at the pool, hands Bizimungu his briefcase. Zozo\n          gives the beer to the soldiers.\n          \n                                  PAUL\n                      I am worried about thieves and criminals\n                      coming into the hotel. Perhaps you could\n                      arrange for some police to guard us.\n          \n                                  GENERAL BIZIMUNGU\n                      The police are very busy.\n          \n          \n                                                                             84.\n          \n                                  PAUL\n                      I understand General, but when I last                            \n                      talked to the president of Sabena he                             \n                      promised me that anyone who helped                               \n                      protect Belgian property would be                                \n                      rewarded.                                                        \n          \n          Bizimungu understands this is a financial proposition.\n          \n                                  GENERAL BIZIMUNGU                                    \n                      He did.                                                          \n                                  PAUL                                                 \n                      \"Well rewarded\" Those were his words.   \n                                   \n                                  GENERAL BIZIMUNGU\n                      If I were to spare a few policemen, where\n                      would I station them?\n          \n                                  PAUL\n                      The front gate would be best, General.\n                      They could check all guests.\n          \n                                  GENERAL BIZIMUNGU\n                      I will see what I can do.\n          \n                                  PAUL\n                      I admire you, General. How do you keep\n                      command of your men amidst such madness?\n          \n                                  GENERAL BIZIMUNGU\n                      I am strong, Paul, like a lion.\n          \n                                  PAUL\n                      I wish I were like you. Look at my staff,\n                      they won't work, they listen to no one.\n          \n          Paul nods over toward Gregoire.\n          \n                                     ENERAL BIZIMUNGU\n                      He is staff?\n          \n           he General gets up.\n          \n          Gregoire, who is lying face down on the deck chair, doesn't see him\n          approach. The General pulls the deck chair from underneath Gregoire and\n          throws it into the pool. As Gregoire tries to scramble to his feet, the\n          General propels him forward with a massive kick up the ass.\n          \n                                  GENERAL BIZIMUNGU (CONT'D)\n                      Get to work, you slug.\n          \n          Gregoire races from the pool, followed by his girlfriend.\n          \n                                                                           85.\n          \n          The General clicks his fingers and his soldiers follow.\n          \n                                  GENERAL BIZIMUNGU (CONT'D)\n                      Make sure, Paul, your guests are\n                      generous.\n          \n          \n          INT. LOBBY. DAY\n          \n          Benedict greets Paul in the lobby.\n          \n                                   BENEDICT\n                      Paul, we would like to speak to you in\n                      your office.\n          \n                                  PAUL\n                      We, who is we?\n          \n                                  BENEDICT\n                      A delegation.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. DAY\n          \n          Paul walks in and discovers the office packed with the elite Tutsi\n          refugees including Xavier, Odette and Jean Baptiste. Paul's puzzled,\n          there's an air of tension in the room.\n          \n                                  PAUL\n                      Yes.\n          \n          A brief silence, then a Tutsi bank manager speaks.\n          \n                                  BANKER\n                      You have no right to charge us rent.\n          \n                                  PAUL\n                      Why not?\n          \n                                  BANKER\n                      This is no longer a hotel, it is a prison\n                      and you are profiteering from our misery.\n          \n                                  ODETTE\n                      That is not true.\n          \n          Another accuser speaks up.\n          \n                                  TUTSI ACCUSER\n                      Yes it is. He charges for food, for\n                      everything. Where is all this money\n                      going? We hear he has a deal with\n                      Bizimungu.\n          \n          \n                                                                            86.\n          \n                                  TUTSI ACCUSER #2\n                      It is said that you work for the murderer\n                      George Rutagunda.\n          \n          Murmurs of agreement. Paul has heard enough.\n          \n                                  PAUL\n                      I confess. ( a beat) It's true I have a\n                      deal with General Bizimungu. He was just\n                      here. I worked out another money making\n                      scheme for him. New arrivals will be\n                      taxed at the gate.\n          \n          Silence.\n          \n                                  PAUL (CONT'D)\n                      Do you know what my deal is with\n                      Bizimungu. I pay him and he keeps you\n                      alive. Anyone want to take their money\n                      back?\n          \n          PAUL pulls money from his pocket, hands it around, offers it.\n          \n                                  PAUL (CONT'D)\n                      Here, here take it. And you don't have to\n                      pay your bill. I will move you into the\n                      ballroom or out into the gardens.\n          \n          He walks among them.\n          \n                                  PAUL (CONT'D)\n                      And, yes, I work with George Rutagunda.\n                      I buy rice and beans, beer and soap. I\n                      will have to visit his warehouse soon\n                      because we are running out of food. Who\n                      wants to come with me?\n          \n          Paul holds the door open.\n          \n                                  PAUL (CONT'D)\n                      Anyone who wants to come with me stay\n                      behind. If not, please leave.\n          \n          They hurry out, duly chastised. But Odette and her husband Jean\n          Baptiste remain.\n          \n                                  PAUL (CONT'D)\n                           (laughs)\n                      You are most certainly not coming with\n                      me. You will get me killed.\n          \n                                  JEAN BAPTISTE\n                      You can't go to that place, they know\n                      what you are doing here.\n          \n          \n          \n          \n                                                                           87.\n          \n                                  PAUL\n                      George will not hurt me, I am too\n                      profitable to him.\n          \n                                  ODETTE\n                      What if he is not there?\n          \n          Paul hasn't got an answer for that one. He leads them out.\n          \n          \n          INT. HOTEL PAUL'S ROOM. NIGHT\n          \n          Roger is asleep, on a couch in the living room, several kids sleep on\n          the floor.\n          \n          TO THE BED: Where Tatiana suppresses bursts of laughter as Paul relates\n          the Gregoire story in whispers.\n          \n                                  PAUL\n                      As soon as the General left he came\n                      running back. (mimics Gregoire) Help me,\n                      sir, I have been possessed by a witch.\n                      (Paul's own voice now) A witch you say?\n                      (mimics) Yes, yes, I did not know I was\n                      in that room. The president's room, why\n                      would I be in the president's room? (own\n                      voice) Indeed, the General asked me the\n                      same. (mimics) Asked you what? (own\n                      voice) Does Gregoire think he is\n                      president now?\n          \n          PAUL mimics Gregoire's whimpers of fear.\n          \n                                  TATIANA\n                           (laughing)\n                      Stop, stop, we will waken the children.\n          \n          Paul lifts the bottle of fine bordeaux, pours more.\n          \n                                  PAUL\n                      Lynch Bages, 84. Perfect with lamb, or\n                      fine rare beef.\n          \n                                  TATIANA\n                      So where is the lamb?\n          \n                                  PAUL\n                      Maybe Gregoire and the witch ate it.\n          \n          They both chuckle, then Paul remembers, a cloud of anxiety comes over\n          him.\n          \n                                  TATIANA\n                      What's the matter?\n          \n              \n          \n                                                                          88.\n          \n                                  PAUL\n                      We're running out of beer and other\n                      supplies.\n          \n          She kisses him.\n          \n                                  TATIANA\n                      The foreigners abandon us and you do\n                      inventory. You are so conscientious.\n          \n          She kisses him again, tries to cheer him.\n          \n                                  PAUL\n                      I have to go out to get food.\n          \n                                  TATIANA\n                      Go out! Where?\n          \n                                  PAUL\n                      To Rutagunda's place. It is close by.\n          \n                                  TATIANA\n                      No, no.\n          \n                                  PAUL\n                      I have to, Tatiana, we are only as                         \n                      valuable as the service we provide.                        \n                                  TATIANA\n                      You cannot go alone.\n          \n                                  PAUL\n                      I'm not going alone. I'll take Gregoire\n                      with me. He's a good Hutu, and he wants\n                      to impress me now.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          The lobby is deserted except for Gregoire now neatly dressed.\n          \n                      G           PAUL\n                       regoire it is good to see you back to\n                      work.\n          \n                                  GREGOIRE\n                      Please, except my humblest apologies...\n          \n                                  PAUL\n                      Don't worry. I have a job this morning. I\n                      must go to visit my good friend George\n                      Rutagunda. You know George?\n          \n          Gregoire nods, impressed.\n          \n                                                                           89.\n          \n                                  PAUL (CONT'D)\n                      Fetch the van.\n          \n          \n          EXT. HOTEL FORECOURT. DAWN\n          \n          A thick mist blankets the grounds as Paul and Gregoire emerge.\n          \n                                  GREGOIRE\n                      (fearful) Where are we going, sir?\n          \n                                  PAUL\n                      For supplies, you drive.\n          \n                                  GREGOIRE\n                      The fog is too heavy, sir.\n          \n                                  PAUL\n                      Just drive, Gregoire.\n          \n          \n          INT. VAN. DAWN\n          \n          They pass the gate, the policemen are asleep in the box.\n          \n          The van passes along the deserted main road, past a wrecked car, over\n          broken glass, the fog swirls around them.\n          \n          Then Gregoire hits the brakes.\n          \n          In front of them, a makeshift barricade, long poles stretched across\n          two oil drums.\n          \n          They wait for someone to appear from the fog: No one.\n          \n                                  GREGOIRE\n                      We should go back, sir.\n          \n          Paul wants to agree, but can't. He opens his door.\n          \n          \n          EXT. ROAD. DAY\n          \n          Paul gets out, tentative.\n          \n                                  PAUL\n                      Hello?\n          \n          Nothing. He moves to the barrier, lifts the pole, places it on the\n          ground, hurries back to the van.\n          \n          \n          \n                                                                           90.\n          \n          \n          INT. VAN. DAWN\n          \n                                    PAUL\n                      Let's go.\n          \n          They drive past the barricade.\n          \n          The van weaves through the fog-enshrouded streets.\n          \n           hey slow to check road signs in the fog - on one a woman's dress,\n          shredded and soaked in blood, is draped like a banner.\n          \n          \n          EXT. RUTAGANDA'S WAREHOUSE. DAWN\n          \n          The fog still hangs like a cloud. As they pull up, a group of young\n          Militia emerge from Toyota trucks.\n          \n                                  MILITIAMAN #1\n                      What do you want?\n          \n                                  PAUL\n                      We are to meet Mr. Rutagunda.\n          \n                                  MILITIAMAN #1\n                      The commander is not here.\n          \n                                  PAUL\n                      He will be here.\n          \n                                  MILITIAMAN #1\n                      Show me your ID\n          \n          Paul and Gregoire hand over their ID cards. The Militia man studies\n          them, then pockets the cards.\n          \n                                    PAUL\n                      Excuse me.\n          \n                                    MILITIAMAN #1\n                      What?\n          \n                                  PAUL\n                      Our cards, please.\n          \n                                    MILITIAMAN #1\n                      What cards?\n          \n                                  PAUL\n                      You have our cards.\n          \n          \n          \n          \n          \n                                                                           91.\n          \n                                    MILITIAMAN #1\n                        No. But I make cards. Would you like me\n                        to make you two cards?\n          \n                                      PAUL\n                        How much?\n          \n                                    MILITIAMAN #1\n                        One thousand francs.\n          \n          Then from out of the fog, three Toyota trucks roar up. George\n          Rutagunda, heavily armed, in cut-off shorts and an open shirt, his\n          barrel chest laden with bandoliers, jumps out.\n          \n           he Militia man pulls out the ID cards, hands them back.\n          \n                                      MILITIAMAN #1 (CONT'D)\n                        apologetic)\n                       joke.\n          \n          Rutagunda strides over.\n          \n                                    GEORGE\n                        Paul. My old friend.\n          \n          Paul climbs out, greets George, as a Militia man swings open the doors\n          of the warehouse. They walk in.\n          \n          \n          INT. RUTAGANDA'S WAREHOUSE. DAY\n          \n          The warehouse is filled with looted televisions, artwork, cars. George\n          points to the stacks of beer.\n          \n                                    GEORGE\n                        Everything is double the price now, you\n                        do understand that?\n          \n                                    PAUL\n                        I need rice, beans, beer, and your best\n                        whiskey.    G\n          \n                                     EORGE\n                        Beer yes, but no whiskey.\n          \n                                    PAUL\n                        You have no whiskey?\n          \n                                    GEORGE\n                        No whiskey, no spirits. Your rich\n                        cockroaches at the hotel, they will have\n                        to do without their scotch. Anyway, I                       \n                        have bled that cow enough Paul.                             \n          \n                    \n          \n          \n          \n                                                                           92.\n          \n          Paul counts out the Rwandan francs.\n          \n                                  PAUL\n                      What do you mean George?                                     \n                                  GEORGE\n                      Their money is no good to them. Soon all                     \n                      the Ineysi will be dead.                                     \n                                  PAUL\n                           (incredulous) )                                         \n                      You cannot kill them all.\n          \n                                  GEORGE\n                                                                                   \n                      Why not? We are half way there already.\n          \n          Paul's stomach heaves. He hides it, turns over the money, gets in the    \n          van with Gregoire. George comes to the passenger window.                 \n                                   EORGE (CONT'D)\n                      Let me give you a tip my friend, our                         \n                      generals in the army say 'do not go near                     \n                      the Mille Collines or they will send the                     \n                      Belgian soldiers back here'. But the                         \n                      generals are about to leave, and we will                     \n                      be in charge. It is time to butcher your                     \n                      cow for the meat. (a beat)                                   \n                      You can help us Paul. You have some very                     \n                      important traitors at your hotel. The                        \n                      politician Xavier. The liar Benedict. If                     \n                      we were to get them, then maybe we could\n                      let one or two cockroaches get away. You                     \n                      understand, Paul.\n          \n          Paul says nothing, but Gregoire has been listening very carefully.\n          \n                                  PAUL\n                      Let's go.\n          \n                                  GEORGE\n                      Take the river road back. It is clear.\n          \n          The van takes off.\n          \n          \n          INT. VAN. DAWN\n          \n          The fog has gotten thicker. They can barely see a yard ahead.\n          \n                                  PAUL\n                      Are you sure this is the river road?\n          \n                                  GREGOIRE\n                      I saw the sign.\n          \n          \n          \n          \n                                                                           93.\n          \n          The van begins to bump erratically. Bump, bump, bump.\n          \n                                  PAUL\n                      Stop. You've driven off the road.\n                      You'll put us in the river.\n          \n          The van jerks to a halt.\n          \n          \n          EXT. RIVER ROAD. DAWN\n          \n          Paul clambers out, stumbles, falls.\n          \n          And discovers he's looking at the face of a dead child, a young Tutsi\n          girl, her hands clasped on her ears as though to block the sound of her\n          own death - an African Munz's Scream.\n          \n          Paul clambers to his feet, sees that the van is on a road littered with\n          dead bodies, men, women, children.\n          \n           he bumps were dead bodies, the van has driven over them.\n          \n          A breeze from the lake blows the fog clear for thirty feet.\n          \n          REVEALING: a carpet of bodies, hundreds of them sprawled all along the\n          road as far as Paul can see. Paul wanders stunned among misshapen\n          corpses, made more ghostly by wisps of fog.\n          \n          Finally, Paul clambers shell-shocked back into the van.\n          \n                                  PAUL\n                      Go back! Go back!\n          \n          Gregoire throws the van into reverse.\n          \n           hey bump back over the carpet of bodies, each shake and crunch another\n          horror.\n          \n          \n          EXT. HOTEL REAR DELIVERY AREA. DAY\n          \n          The van pulls up at the rear suppliers entrance. Paul hops out, turns\n          to Gregoire.\n          \n                                  PAUL\n                      Tell no one what you saw, do you\n                      understand?\n          \n          Gregoire, Zozo and the porters begin unloading the van.\n          \n                   \n          \n                                                                              94.\n          \n          \n          EXT. HOTEL GARDENS. DAY\n          \n          Paul wanders to a bench set back in a manicured grove of bushes. Beyond\n          him a crowd of Rwandan refugee children play in the swimming pool,\n          laughing, jumping, splashing like they were at a municipal pool in\n          Central Park.\n          P\n          \n          PAUL watches. Tears stream from his eyes, the stream grows into a\n          flood, he buries his face in his hands.\n          \n          Then a voice.\n          \n                                    LITTLE BOY (O.S.)\n                      Mr. Manager.\n          \n          Paul wipes his eyes, turns.\n          \n          A little boy stands behind him, holding out his arm.\n          \n                                  LITTLE BOY (CONT'D)\n                      Mr. Manager, sir.\n          \n          Then Paul sees what is wrong. The boy Has a big thorn imbedded in the\n          muscle of his arm. Paul studies it.\n          \n                                  PAUL\n                      That's a big one. (pinches the thorn)\n                      Here we go.\n          \n          Paul pulls on the thorn, the kid doesn't flinch.\n          \n          Paul picks him up, carries him to the pool, throws him in.\n          \n          \n          INT. HOTEL PAUL'S ROOM. NIGHT\n          \n          Tatiana feeds the children - rice and beans. Paul arrives.\n          \n                                  CHILDREN\n                      Good evening, Papa.\n          \n                                  PAUL\n                      Roger, you have no greeting for me.\n          \n          Roger tries to speak, struggles to mouth the words but nothing comes\n          out, as though he has forgotten. Tears form in his eyes.\n          \n                                  PAUL (CONT'D)\n                      There, do not worry, no tears.\n          \n          He hugs him, puts him back at his food, then takes Tatiana's hand,\n          leads her to the door.\n          \n               \n          \n          \n                                                                           95.\n          \n                                   TATIANA\n                       (whispers) Where are we going?\n          \n          They slip out.\n          \n          \n          INT. HOTEL ROOF DOOR. NIGHT\n          \n          Tatiana stops.\n          \n                                   TATIANA\n                       Please, Paul, why do we have to go to the\n                       roof?\n          \n                                   PAUL\n                       It's alright. This is the only place I\n                       can find some peace.\n          \n          \n          EXT. HOTEL ROOF. NIGHT\n          \n          Paul slips out onto the roof. Tatiana follows. Artillery and mortar\n          fire rumble in the distance. Flashes silhouette along the far hills\n          above Kigali.\n          \n          He leads her to a blanket, a candle, two glasses and the bottle of\n          wine. They sit. He opens the wine.\n          \n                                   TATIANA\n                       (laughs) I hear we must pay for\n                       everything. How much for this?\n          \n                                   PAUL\n                       A kiss.\n          \n          They kiss.\n          \n                                   TATIANA\n                       You are a very good man, Paul\n                       Rusesabagina.\n          \n           he kisses him again.\n          \n                                   PAUL\n                       I have a confession. When we met...\n          \n                                   TATIANA\n                       In Ruhengeri?\n          \n                                   PAUL\n                       Yes, when you worked as the nurse.\n          \n                                   TATIANA\n                       Yes.\n          \n          \n          \n                                                                          96.\n          \n                                  PAUL\n                      I had you transferred to Kigali.\n          \n                                  TATIANA\n                      What?\n          \n                                  PAUL\n                      I bribed the Minister of Health to have\n                      you transferred to Kigali.\n          \n                                  TATIANA\n                      Why?\n          \n                                  PAUL\n                      To be closer. So that I could marry you.\n          \n                                  TATIANA\n                      What was the bribe?\n                           (silence)\n                      What am I worth to you?\n          \n                                  PAUL\n                      It was substantial.\n          \n                                  TATIANA\n                      Tell me what it was.\n          \n                                  PAUL\n                      A car.\n          \n                                  TATIANA\n                      What sort of car?\n          \n                                  PAUL\n                      What does it matter.\n          \n                                  TATIANA\n                      I want to know.\n          \n                                  PAUL\n                      A Volkswagen.\n          \n                                  TATIANA\n                      A Volkswagen!\n          \n           he slaps him playfully.\n          \n                                  TATIANA (CONT'D)\n                      I hope it was a new Volkswagen.\n          \n          She kisses him, they lie back on the roof, kiss passionately.\n          \n          \n          \n                                                                           97.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul instructs the porters to clean around the entrance.\n          \n          The UN armored car comes up the driveway. Colonel Oliver gets out,       \n          strides across the tarmac, he shakes Paul's hand.\n          \n                                     COLONEL OLIVER                                \n                        Great news, Paul, we're going to get you\n                        out of here.\n          \n          I\n          The sweetest words Paul has ever heard.\n          \n          \n          INT. HOTEL BANQUET ROOM. DAY\n          \n           Oliver is on the stage, all the refugee guests are crowded into the     \n          room he has a list in his hand.\n          \n                                    COLONEL OLIVER                                 \n                        The UN has been notified that the\n                        following families have received travel\n                        visas from the following countries.\n          \n          He reads.                                                                \n                                    COLONEL OLIVER (CONT'D)                        \n                        Abukesu - Tanzania, Arumangu -Zambia,\n                        Bawroanga - Kenya,\n          \n          CLOSE ON: Elation among the chosen families.\n          \n                                    COLONEL OLIVER (CONT'D)                        \n                        Gituaranga - Zambi, Horangora - Belguim\n          \n          CLOSE ON - Fear on the faces of families who realize they have missed\n          this alphabetical list, anxiety among the others.\n          \n                                    COLONEL OLIVER (CONT'D)                        \n                        Paramisambi - Zambia, Rusesabagina -\n                        Belgium.\n          \n          Tatiana kisses Paul.\n          \n                                    COLONEL OLIVER (CONT'D)                        \n                        Zamacanga - Ghana. A plane will land at\n                        the airport tomorrow and the named\n                        families will be flown to Kenya. Two UN\n                        trucks will be here at 7 a.m. The named\n                        families must be ready to leave then.\n          \n              voice calls out.\n          \n                                                                           98.\n          \n                                  TUTSI WOMAN\n                      Colonel, sir. Why not take us all to the                       \n                      airport? We can wait there to obtain\n                      visas.\n          \n                                  COLONEL OLIVER                                     \n                      I can't do that. Our camp at the airport\n                      is overwhelmed already. We could not\n                      defend you there. You are better to stay\n                      here and work to get an exit visa.\n          \n           Oliver jumps from the stage, pushes through the crowd.                    \n          Paul's POV: Odette and Jean Baptiste are silently devastated. He pushes\n          through to the Colonel now surrounded by those who didn't make the         \n          list.\n          \n                                   PAUL\n                      Colonel, Odette Camundu ... she must be                        \n                      on the list.\n          \n           Oliver shakes his head no.                                                \n                                  COLONEL OLIVER                                     \n                      Paul, only those I called can get on the\n                      trucks. I do not want to have to pull\n                      people off, you understand?\n          \n          Paul nods yes. Tatiana arrives beside him, pulls him aside.\n          \n                                  TATIANA\n                      I will not leave without the twins.\n          \n                                  PAUL\n                      We have to get out of here Tatiana.\n          \n                                  TATIANA\n                      Please, please try one more time.\n          \n                                  PAUL\n                      I'll try but we have to leave, with or\n                      without them. I want you to promise.\n          \n          She reluctantly nods yes.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Mr. Garindi waits nervously in the lobby.\n          \n          Paul arrives.\n          \n          \n                                                                           99.\n          \n                                  MR. GARINDI\n                      It is dangerous to be here. The radio\n                      says this is a nest of cockroaches.\n          \n                                  PAUL\n                      I need one last favor. Go back and get\n                      the twins.\n          \n                                  MR. GARINDI\n                      (emphatic) No, it is impossible. That\n                      side of town has been destroyed in the\n                      fighting. The children are dead.\n          \n                                  PAUL\n                      How do you know?\n          \n                                  MR. GARINDI\n                      Everyone is dead there. The dogs eat the\n                      bodies in the street. I have to go.\n          \n                                  PAUL\n                      I will give you my house.\n          \n          The businessman turns back.\n          \n                                  PAUL (CONT'D)\n                      It's a fine house. Here is a paper.\n          \n          Paul spots an elegant woman carrying laundry toward the elevator. He\n          runs to her.            P\n          \n                                  PAUL (CONT'D)\n                      Madame Kawunda, please.\n          \n          Paul leads her over.\n          \n                                  PAUL (CONT'D)\n                      I need you to witness this signature.\n                           (to the businessman)\n                      Madame Kawunda is the Minister for\n                      Agriculture. She is a very reliable\n                      witness.\n          \n          Paul signs, then hands the pen to the puzzled woman.\n          \n                                  PAUL (CONT'D)\n                      Please witness this deed.\n          \n          She signs. Paul pushes the deed into the man's hand.\n          \n                                  PAUL (CONT'D)\n                      There, now go and find them. They have no\n                      papers. No one knows they are Tutsi. They\n                      will be alive.\n          \n          \n          \n                                                                          100.\n          \n          The businessman heads for the door.\n          \n                                  PAUL (CONT'D)\n                      You must be back by 7:00a.m. tomorrow.\n          \n          Paul watches him go.\n          \n                                  PAUL (CONT'D)\n                      Seven, remember.\n          \n          The Mr. Garindi leaves.\n          \n          \n          EXT. HOTEL GARDENS. NIGHT\n          \n          Paul skirts the little groups of poor families bivouacked on the lawn.\n          The smoke of cooking fires has replaced the Tiki lanterns. The grounds\n          are a mini refugee camp.\n          \n          Paul joins Tatiana, Odette and Jean Baptiste who sit at a table by the\n          pool.\n          \n                                   DETTE\n                      Don't worry, Paul, we will make the next\n                      list.\n          \n          ZOZO arrives, with beers, serves them, is about to leave. Tatiana grabs    \n          him by the arm.                                                            \n                                  TATIANA                                            \n                      Sit with us Zozo.  \n                                                      \n                                  ZOZO                                               \n                      No ma,am, I am too busy.   \n                                              \n                                  PAUL                                               \n                      Zozo you are family, join us.                                  \n          Zozo is shocked by this breach of protocol but sits.\n          \n                                  PAUL (CONT'D)\n                      You are my dearest friends. I promise you\n                      before God that I will not sleep until I\n                      have you out of here. All of you.\n          \n          He embraces Jean Baptiste\n          \n                                  JEAN BAPTISTE\n                      It is good that you are going, Paul,\n                      because now we know we have one person\n                      who will save us.\n          \n          Odette hugs and kisses him.\n          \n                                                                            101.\n          \n                                  ODETTE\n                      We owe you our lives.\n          \n          Paul takes Zozo in his arms.\n          \n                                  PAUL\n                      You are my family now, Zozo, my brother.\n                      I will get you out of here.\n          \n                                  ZOZO\n                      Thank you, sir.\n          \n                                  PAUL\n                      Let us remember this night and tell the\n                      world that even in hell there are good\n                      people.\n          \n          A unbreakable bond of faith with each other.\n          \n                                                                       CUT TO:\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          The lucky families are gathered: Tatiana and all her children; Xavier\n          and his wife; Benedict; and others.\n          \n          Some of the unlucky ones peer around the door of the ballroom. A UN\n          officer stands in their way.\n          \n                                  UN LIEUTENANT\n                      Back. Everyone back. Only those with\n                      letters of acceptance in the lobby.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          The UN convoy waits outside.   Tatiana waits nervously as Paul   checks\n          his watch.\n          \n                                  TATIANA\n                      A little longer, Paul?\n          \n                                  PAUL\n                      We wait until 7:00. If he is not here\n                      with the twins he is not coming. We\n                      leave. That was your promise. Go help the\n                      children.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul is in a horrible mood. The refugees in the ballroom try to push by\n          the UN officer. Paul joins him.\n          \n          \n          \n          \n          \n                                                                          102.\n          \n                                     UN LIEUTENANT\n                         Back, please. Stay back.\n          \n                                     PAUL\n                         Zozo, tell those people to get back to\n                         the ballroom. They can not be here.\n          \n          Zozo scampers off.\n          \n                                     PAUL (CONT'D)\n                         What are we waiting for? Come on.\n          \n          Paul herds the convoy people toward the door.\n          \n          CLOSE ON: Gregoire watching from behind the front desk.\n          \n          Through the doors we see the trucks being loaded.\n          \n          Zozo returns.\n          \n                                     ZOZO\n                         Sir, the others want to speak to you.\n          \n          Reluctant, Paul walks over to the ballroom dwellers.\n          \n                                     PAUL\n                         Yes.\n          \n                                      TUTSI WOMAN\n                         Good, sir we have letters, please take\n                         them for us.\n          \n          Paul reaches out for the letters, takes them, reads the addresses:\n          President Nelson Mandela. Pope John Paul. President Clinton.\n          \n                                     TUTSI MAN #1\n                         If you leave, we are certain to die.\n          \n                                     ZOZO\n                         I have a letter, sir.\n          \n          Zozo hands Paul the letter. He studies the address. It reads \"To the\n          great man Muhammad Ali.\"\n          \n           thers crowd around.\n          \n                                     PAUL\n                         I will get you all visas. I promise. I\n                         will get you out of here.\n          \n          Paul's at a loss. He has to tear himself away.\n          \n              fraid to look back, he heads for the convoy.\n          \n             \n          \n                                                                           103.\n          \n          \n          EXT. HOTEL LOBBY. DAY\n          \n          The last of the evacuees clamber onto the UN trucks. The children are\n          on board but Tatiana waits.\n          \n                                  TATIANA\n                      Ask them to wait a little longer. For the\n                      twins.\n          \n                                  PAUL\n                      Get on the truck, Tatiana.\n          \n                                  TATIANA\n                      No.\n          \n          He checks his watch, then takes her in his arms.\n          \n                                  PAUL\n                      Look, our children are crying, please get\n                      on the truck.\n          \n          Paul helps Tatiana on board. He looks toward the door.\n          \n          POV: The unlucky refugees are now crowded at the windows, lost souls\n          watching out from their prison at the lucky ones.\n          \n          Paul whispers to Benedict as he boards.\n          \n          \n          INT. TRUCK DAY\n          \n          Paul clambers on beside him.   He reaches Tatiana as Benedict sits\n          beside her.\n          \n                                  PAUL\n                      I have to stay.\n          \n                                  TATIANA\n                      No! Sit down now.\n          \n                                  PAUL\n                      I cannot leave these people. I will wait\n                      for the twins.\n          \n          Paul backs off. Tatiana tries to follow. Benedict grabs her.\n          \n                                  TATIANA\n                      Let go. Let me off this truck.\n          \n          A commotion as she tries to get up.\n          \n                                  TATIANA (CONT'D)\n                      Let me go. Children get off.\n          \n          \n                                                                          104.\n          \n                                  PAUL\n                      I will follow on the next plane. Go.\n          \n          \n          EXT. HOTEL FORECOURT. DAY.\n          \n          The truck starts up. Paul runs beside it, shouts to Tatiana.\n          \n                                  PAUL\n                      I love you. Keep the children safe.\n          \n                                    TATIANA\n                      Paul!\n          \n          Then another voice.\n          \n                                    ROGER\n                      Papa! Papa!\n          \n          The convoy takes off down the driveway.\n          \n          Paul, Zozo and other refugees cluster by the door.\n          \n          ZOZO looks round,\n          \n          I\n          Sees: Gregoire put a phone down.\n          \n          \n          INT. UN JEEP. DAY\n          \n          UN Colonel Oliver sits next to a UN PAKISTANI DRIVER.                      \n           he convoy passes looters and small groups of Militia on the road but\n          proceeds unheeded.\n          \n          \n          INT. HOTEL PAUL'S ROOM. DAY\n          \n          The room is still littered with clothes, kids drawings, the personal\n          junk accumulated over four weeks.\n          \n          Paul tries to arrange things, then collapses on the bed, paralysed with\n          doubt - Why did he do this?\n          \n          Then the door bangs.\n          \n                                  ZOZO\n                      Boss, sir, quick, please, come quick.\n          \n          \n          INT. HOTEL CORRIDOR. DAY\n          \n          The door springs open, Paul confronts Zozo.\n          \n             \n          \n          \n                                                                           105.\n          \n                                  ZOZO\n                           (breathless)\n                      Sir, the radio, you must hear, it is on\n                      the radio.\n          \n          \n          INT. HOTEL KITCHEN. DAY\n          \n          Paul and Zozo burst into the kitchen. The cooks and others are\n          clustered, listening to the radio.\n          \n                                  RADIO ANNOUNCER (O.S.)\n                      ...Block the roads to the airport! The\n                      cockroaches from the Mille Collines are\n                      escaping! Xavier. The liar Benedict, the\n                      traitor Rusesabagina's cockroaches. Stop\n                      them now at Rue Don Bosco. Thirty\n                      thousand francs for the head of Xavier!\n          \n                                  PAUL\n                      Dear lord, how did they know?\n          \n                                  ZOZO\n                      I saw Gregoire make a call, sir?\n          \n                                    PAUL\n                      When?\n          \n                                  ZOZO\n                      As the trucks go.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul bursts out of the kitchen - enraged.\n          \n          Gregoire is at the front desk. Sees Paul - understands instantly.\n          \n          Gregoire takes off, running for his life.\n          \n          \n          EXT. HOTEL GARDENS. DAY\n          \n          Paul chases after him, through the door.\n          \n          Gregoire disappears into the thicket of trees.\n          \n          Paul after him.\n          \n          Through the trees.\n          \n          Gregoire, younger, faster, climbs the high wire fence.\n          \n          Finally, Paul reaches the fence.\n          \n          \n          \n          \n                                                                            106.\n          \n          Sees Gregoire escape into the bushes on the other side of the fence.\n          \n          Paul gives up, turns back toward the hotel.\n          \n          \n          INT. JEEP TRAVELLING. DAY\n          \n          As the UN jeep turns a bend, Colonel Oliver SEES crowds of Interahamwe       \n          swarming from beside houses, from gardens. They pull burning tires, old\n          furniture, junk onto the road.\n          \n          \n          INT. TRUCK TRAVELLING. DAY\n          \n          The UN truck suddenly lurches, then slows.    The refugees from the Mille\n          Collines grow alarmed.\n          \n                                    TATIANA\n                        What's happening?\n          \n          \n          INT. HOTEL OFFICE. DAY\n          \n          Paul is on the fax phone, begging.\n          \n                                    PAUL\n                        Please, General, I will give you money,\n                        whiskey.\n          \n                                    GENERAL BIZIMUNGU (O.S.)\n                        You said you had no whiskey.\n          \n                                    PAUL                                               \n                        Please, I have money. They're driving\n                        into an ambush, it's on the radio.\n          \n          \n          EXT. KIGALI STREET JUNCTION. DAY\n          \n          Swarms of crazed Militia fill the road. Gun fire breaks out.\n          \n          Colonel Oliver steps from the jeep, waving his pistol in the air.\n          M                                                                            \n           ilitia men swarm around him, push past to the truck.\n          \n          INSIDE THE TRUCK:\n          \n              MACHETE SLASHES through the canvas.\n          \n           hildren scream, HANDS GRAB at people.\n          \n          Benedict is hauled off the truck. Beaten.\n          \n          Tatiana protects her kids in a corner, kicking at the hands that grab\n          for her.\n          \n          \n          \n                                                                          107.\n          \n          ON THE STREET: Xavier falls to the ground.\n          \n          Screams, shouts, MORE SHOTS.\n          \n          Oliver fights his way through to Xavier.                                   \n          Oliver points his pistol.                                                  \n          The crowd backs off slightly.\n          \n          Xavier gets to his feet.\n          \n          BANG - more gun fire. IMMACULATA falls, wounded in the foot.\n          \n          More are dragged from the trucks. Machetes flash in the sun.\n          \n          Then HORNS, GUNFIRE - RWANDAN SOLDIERS drive through the crowd in two\n          jeeps. The crowd scatters, then re-forms as Rwandan soldiers push\n          between the Militia and the refugees.\n          \n          As they do, another Militia gunman steps out, fires wildly at the\n          refugees, but wounds A RWANDAN SOLDIER in the stomach.\n          \n          Suddenly fights erupt between the Militia and the soldiers.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul paces up and down, he can hear gunfire in the distance.\n          \n          MACHINE GUNFIRE - THEN SINGLE SHOTS.\n          \n          Paul jumps in the van, guns the engine, drives.\n          \n          \n          EXT. HOTEL FRONT GATE. DAY.\n          \n          Paul's van speeds toward the gate.\n          \n          THEN - A LOUD METALLIC SCREECHING NOISE\n          \n          As a UN JEEP, its tires shot out, sparks cascading from wheel rims,\n          screams up to the guard house.\n          \n          Paul slams on the brakes.\n          \n          The jeep is followed by the two trucks, their canvas slashed fluttering\n          in the wind.\n          \n          Paul throws the van into reverse and clears the way.\n          \n          The convoy pulls up in front of the hotel.\n          \n          Bloody and battered, the terrified refugees fall from the trucks.\n          \n                      \n          \n          \n                                                                             108.\n          \n          Paul and Odette run among the casualties. Then he sees them:\n          \n          Tatiana, clothes torn, scratches on her face.\n          \n          The kids screaming in terror.\n          \n             PAUL runs to them, grabs, kisses, weeps louder.\n          \n          Battered refugees everywhere, other hotel residents looking on -\n          equally terrified because: They know they are doomed.\n          \n          Paul sees Roger, trembling, tears soak his face.\n          \n                                       ROGER\n                         Papa! Papa!\n          \n          He grabs Roger up. Tatiana struggles to Paul, embraces.\n          \n                                     PAUL\n                         Thank God you are safe.\n          \n          Tatiana breaks from the embrace.\n          \n                                     TATIANA\n                         Did he bring the twins?\n          \n          Paul shakes his head no.\n          \n          \n          EXT. HOTEL GARDENS. DAY\n          \n          Paul sits alone on his secluded bench in the garden.\n          \n              cloud of despair shrouds him.\n          \n          As he watches several women dip cooking pots into the pool.\n          \n              e hurries toward them.\n          \n                                     PAUL\n                         What are you doing?\n          \n                                     TUTSI WOMAN\n          P              There is no water from the pipes.\n          \n          PAUL heads for the front doors. He's intercepted by the two Rwandan\n          policemen stationed at the gate by Bizimungu.\n          \n                                     GENDARME\n                          here is our beer? You promised us beer.\n          \n                                     PAUL\n                         Did you explain to the good General that\n                         I have temporarily run out of stock?\n          \n          \n                                                                  109.\n          \n                                  GENDARME\n                      He said to ask Mitterand and the French\n                      to send you more.\n          \n                                  PAUL\n                      You will get it in due time. Now, please,\n                      get back to the gate.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul enters, sees Zozo.\n          \n                                  PAUL\n                      What is this about no water?\n          \n                                  ZOZO\n                      It's true, sir, the water has been turned           \n                      off.\n          \n          \n          INT. HOTEL MANAGER'S OFFICE. DAY\n          \n          Paul enters. Odette, Benedict watch CNN on the TV.\n          \n          PAUL shakes his head in disbelief.\n          \n                                  PAUL\n                      We can still get CNN here in hell.\n          \n          A state department woman gives a press conference.\n          \n                                  ODETTE\n                      The Americans are talking about us.\n          \n          \n          ON TV:\n          \n                                  STATE DEPT. OFFICER\n                      From the reports we have received from\n                      Rwanda it appears that acts of genocide\n                      have been committed.\n          \n                                  REPORTER\n                      Excuse me, how many acts of genocide does\n                      it take to declare this a genocide?\n          \n                                  STATE DEPT. OFFICER\n                      I, ahh, there is, ahh we have\n                      terminology, that has been.\n          \n                                                                          110.\n          \n                                  BRIT REPORTER\n                      You haven't answered the question. How\n                      many acts of genocide before your\n                      government will declare this a genocide?\n          \n                                  STATE DEPT. OFFICER\n                      I'm not prepared to, nor am I able.\n          \n          Everyone in the room is dumbfounded.\n          \n          Then Benedict begins laughing, a maniacal laugh, then he bangs on his\n          chest, and hoots like a chimpanzee.\n          \n                                  BENEDICT\n                      I've got it. I have the answer. Watch.\n          \n          They all stare as he begins beating his chest, and hopping about like\n          an ape.\n          \n                                  BENEDICT (CONT'D)\n                      We must become mountain gorillas. Then\n                      they can put us on the endangered species\n                      list. Come on, try it. They think we're\n                      halfway there already.\n          \n          Benedict hops up onto a desk.\n          \n          The door flies open. It's General Bizimungu.\n          \n          He surveys the room, then points at Paul.\n          \n                                   GENERAL BIZIMUNGU\n                      Come here.\n          \n          \n          INT. HOTEL CORRIDOR. DAY.\n          \n          Bizimungu looks terrible, an alcoholic suffering D.T.s.\n          \n                                  GENERAL BIZIMUNGU\n                      Where are my supplies?\n          \n                                  PAUL\n                      I'm sorry, General. The cellar is empty.\n          \n                                  GENERAL BIZIMUNGU\n                      You have cockroaches dancing on tables\n                      and you tell me the cellar is empty? Did\n                      they drink my whiskey?\n          \n                                  PAUL\n                      No. We have no way of finding other stock\n                      but I have money for you from the guests.\n          \n                                                                          111.\n          \n          Paul pulls a bundle of notes, hands them to the General.\n          \n                                  GENERAL BIZIMUNGU\n                      Rwandan francs! They are only good now\n                      for wiping your ass. There is nothing\n                      more I can do for you people. No police.\n                      No protection. You're on your own.\n          \n          The General storms off.\n          \n          \n          INT. LOBBY. DAY\n          \n          Paul walks through the lobby. He carries an ash tray to a trash can,\n          the futile task of a dedicated hotel manager on auto-pilot. He sees a\n          UN jeep pull up outside.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Paul meets the UN soldiers, (They are the four Ghanians who guard the\n          gate). They look frightened.\n          \n                                  UN OBSERVER\n                      The policemen have gone. What happened?\n          \n                                  PAUL\n                      I ran out of whiskey. Please go down and\n                      guard us.\n          \n          Then ROAR of an engine and the CRASH of splintering wood.\n          \n          As a battered Toyota pickup appears, it races up the driveway. The\n          truck drags the wooden gatehouse on a rope behind.\n          \n          Crazed Militia pack the bed of the pickup.\n          \n          BANG, BANG, BANG. A Militia man fires a pistol into the air.\n          \n          The Tutsi refugees camped on the lawn flee in panic as the Militia\n          truck speeds around the driveway.\n          \n          The Militia taunt and yell at the Tutsi refugees.\n          \n          The truck does a screeching turn and heads back down the driveway,\n          leaving a trail of splintered wood.\n          \n                                  PAUL (CONT'D)\n                      Get down there and stop them, please.\n          \n          Now the Ghanians are really frightened.\n          \n                                  PAUL (CONT'D)\n                      Get down and stop them.\n          \n                                                                          112.\n          \n                                  UN SOLDIER\n                      You know we cannot shoot.\n          \n                                  PAUL\n                      What do you mean you cannot shoot?\n          \n                                  UN SOLDIER\n                      We are peacekeepers, it is not in our\n                      mandate to shoot.\n          \n                                  PAUL\n                      Then go and pretend you are soldiers.\n          \n          \n          EXT. HOTEL GARDENS. NIGHT\n          \n          Paul and Tatiana pass the clusters of families around their cooking\n          fires. They pass the pool, now just a third full. He sits her on the\n          bench in the grove.\n          \n                                  TATIANA\n                      We are almost out of water.\n          \n                                  PAUL\n                      We are almost out of everything.\n          \n          He takes her hand.\n          \n                                  PAUL (CONT'D)\n                      We had a good life, you and I. I want to\n                      make our peace. To thank God for the time\n                      we had.\n          \n          He kisses her, total love.\n          \n                                  PAUL (CONT'D)\n                      We have to have a plan.\n          \n                                  TATIANA\n                      What sort of plan?\n          \n                                  PAUL\n                      Our children cannot see us die first. If\n                      the Militia comes, you must hurry up to\n                      the roof. I will meet you there.\n          \n                                  TATIANA\n                      Please do not talk like this.\n          \n                                  PAUL\n                      We have to. If I do not come, you must\n                      take them all by the hands and jump.\n          \n          She puts her hands to her ears. He pulls them down.\n          \n          \n                                                                          113.\n          \n                                  PAUL (CONT'D)\n                      The machete is no way to die. Promise me\n                      you will do it.\n          \n          She cries harder and squeezes his hand in fear.\n          \n           uddenly, A BANG, from behind them and then above their heads a trail\n          of fire - an RPG rocket - zigzags toward the hotel.\n          \n          A HUGE EXPLOSION on the wall, one-story beneath the roof.\n          \n          Paul throws Tatiana to the ground, covers her.\n          S\n          \n           moke and concrete dust fall around them.\n          \n          \n          INT. HOTEL STORE ROOM. NIGHT\n          \n          Paul, Zozo stand amongst the debris: a gaping hole in a wall. The room\n          is covered in burned note papers, menus brochures for Sabena's two\n          hotels, the Mille Collines and the Diplomat.\n          \n          Odette appears carrying her medical bag.\n          \n                                  ODETTE\n                      Was anyone hurt?\n          \n                                  PAUL\n                      No. It was only a storeroom.                                   \n          \n          EXT. HOTEL FORECOURT. NIGHT\n          \n          Colonel Oliver arrives in his armored truck. Paul, Odette, Benedict and    \n          others gather around him.\n          \n                                  PAUL\n                      They fired a rocket at us.\n          \n                                   COLONEL OLIVER                                    \n                      Yes.   Where are the Rwandan police?\n          \n                                  PAUL\n                      I ran out of bribes. Bizimungu took them\n                      away.\n          \n                                  COLONEL OLIVER                                     \n                      That explains it. I'm sorry to tell you\n                      this but we've heard rumors the Militia\n                      are getting ready to storm the hotel.\n          \n                                  PAUL\n                      Will you protect us.\n          \n          \n          \n          \n                                                                       114.\n          \n                                   COLONEL OLIVER                              \n                       I can't, I don't have the men.\n          \n                                   VARIOUS VOICES\n                       We have no one...We will be killed.\n          \n                                   COLONEL OLIVER                              \n                       There's one option.\n          \n                                     PAUL\n                       What is it?\n          \n                                   COLONEL OLIVER                              \n                       The rebels have fought their way into the\n                       city. They have many Hutu prisoners.\n                       They're willing to exchange them for you\n                       all.\n          \n                                   ODETTE\n                       Will the Hutu army agree?\n          \n                                   COLONEL OLIVER                              \n                       I think so. They are in disarray now. The\n                       rebels are winning, and the Hutu high\n                       command are anxious to get some of their\n                       men back.\n          \n                                   TUTSI WOMAN\n                       How would we escape?\n          \n                                     COLONEL OLIVER                            \n                       By convoy.\n          \n                                   XAVIER\n                       This time the Militia will kill us.\n          \n                                   PAUL\n                       They will surely kill us here. It's over\n                       here. We have to take the chance.\n          \n                                   TUTSI WOMAN\n                       No, we'll be chopped on the street.\n          \n                                   PAUL\n                       We'll be chopped here.\n          \n          The crowd disperses. Colonel Oliver takes Paul aside.  \n                   \n                                   COLONEL OLIVER                              \n                       A man came to my headquarters, asked that\n                       I give you this.\n          \n          Colonel   Oliver hands a letter.                                     \n          \n                                                                          115.\n          \n                                  COLONEL OLIVER (CONT'D)                            \n                      Paul, I need you to buy me a day or two.\n                      I don't have the fuel for this convoy. I\n                      will have to scrounge it.\n          \n                                  PAUL\n                      I can't. I have nothing left to bribe\n                      with. Can your men at the gate hold out\n                      for another day?\n          \n                                  COLONEL OLIVER                                     \n                      No, Paul, they're afraid. They've\n                      demanded to be moved back to headquarters\n                      now.\n          \n                                  PAUL\n                      Give me their uniforms. I will put people\n                      at the gate, in disguise.\n          \n                                  COLONEL OLIVER                                     \n                      I wish I could, Paul. Try to hold out.\n                      One more day.\n          \n          Colonel Oliver leaves. Their is nothing more Paul can do.                  \n          \n          INT. HOTEL PAUL'S ROOM. NIGHT\n          \n          Tatiana is beside him. He opens the envelope, finds his makeshift house\n          deed and a note.\n          \n                                   PAUL\n                      It's from Garandi.                                             \n                           (reads)\n                      I am sorry. There is no hope for the\n                      twins. The old lady's house has been                           \n                      destroyed.\n          \n          \n          INT. HOTEL PAUL'S ROOM. NIGHT\n          \n          Paul sleeps fitfully. It is almost dawn, then he sits up.\n          \n                                  PAUL\n                      The Diplomat!\n          \n          Tatiana wakens, startled.\n          \n                                  TATIANA\n                      What's wrong?\n          \n                                  PAUL\n                      I have to go to the Diplomat.\n          \n                                                                          116.\n          \n          \n          INT. OFFICE. DAWN\n          \n          Paul is on the one working phone.\n          \n                                  PAUL\n                      General, sir. I am glad to find you. I\n                      have found you some supplies.\n          \n                                  GENERAL BIZIMUNGU   (O.S.)\n                      Whiskey?\n          \n                                  PAUL\n                      The finest, and cognac, champagne. Come\n                      and I will get them for you.\n          \n                                  GENERAL BIZIMUNGU   (O.S.)\n                      I'll be over.\n          \n                                  PAUL\n                      Bring back your policemen...\n          \n          ...But the line is already dead.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Bizimungu's jeeps arrives at the hotel. Paul greets him.\n          \n                                  PAUL\n                      We must go to the Diplomat.\n          \n                                  GENERAL BIZIMUNGU\n                      Get in.\n          \n                                  PAUL\n                      Your police are at the gate?\n          \n                                  GENERAL BIZIMUNGU\n                      After the Diplomat!\n          \n          Paul clambers in the back.\n          \n          \n          INT. JEEP TRAVELLING. DAY\n          \n          The jeep turns away from the Mille Collines front gate.\n          \n          They travel at high speed along the road. Then the driver sounds his\n          horn, because...\n          \n          Paul sees: A large crowd of Militia marching along the road toward the\n          hotel, waving machetes and sticks.\n          \n          \n          \n                                                                          117.\n          \n                                  PAUL\n                      Where are they going?\n          \n                                  GENERAL BIZIMUNGU\n                      They can go where they want. They are in\n                      charge now.\n          \n                                  PAUL\n                      What do you mean, General?\n          \n                                  GENERAL BIZIMUNGU\n                      We have decided to move the government to\n                      Gitarama.\n          \n                                  PAUL\n                      When?\n          \n                                  GENERAL BIZIMUNGU\n                      Today.\n          \n          \n          EXT./INT. DIPLOMAT HOTEL. DAY\n          \n          Paul arrives into the lobby of the Diplomat. Looters have stripped the\n          place bare. The convoy pulls up. General Bizimungu stands with his\n          pistol out. The looters see him and disperse.\n          \n                                  GENERAL BIZIMUNGU\n                      Maggots!\n          \n          \n          INT. DIPLOMAT HOTEL OFFICE. DAY\n          \n          Paul enters the manager's office, followed by the General. It has been\n          stripped clean, except for the safe, which is pock-marked with bullet\n          strikes.\n          \n          \n          \n           LOSE ON: Paul: he sees a big problem. The dial is damaged.\n          \n                                  GENERAL BIZIMUNGU\n                      Do your work.\n          \n          Paul goes to the safe and turns the dials, tries the handle - nothing.\n          It is incredibly hot, and Paul is soaked with nervous perspiration, he\n          takes off his jacket.\n          \n                                  PAUL\n                      It might be damaged, General.\n          \n          Bizimungu's look says: it better not be for your sake.\n          \n          \n          \n                                                                            118.\n          \n          Paul starts again, turns the dials more carefully, tries and opens the\n          safe door. CLICK.\n          \n          He pulls it open, sees six bottles of Glenfiddich, four bottles of VSOP\n          brandy.\n          \n          Bizimungu is joyous as Paul hands him a bottle\n          \n          Bizimungu sits on a window ledge, takes a swig.\n          \n                                  GENERAL BIZIMUNGU\n                      Here. (offers) To celebrate.\n          \n          PAUL takes a swig.\n          \n                                  GENERAL BIZIMUNGU (CONT'D)\n                      You know what the Scottish call it?\n          \n                                  PAUL\n                      No.\n          \n                                  GENERAL BIZIMUNGU\n                      Ishca Baha - the water of life. I went on\n                      a tour once of the finest single malt\n                      distillery in the world. Have you ever\n                      been to Scotland?\n          \n                                  PAUL\n                      No, sir.\n          \n                                  GENERAL BIZIMUNGU\n                      Wonderful country, wonderful golf. I\n                      wonder - will I ever go back? What do you\n                      think?\n          \n          \n          \n                                  PAUL\n                      I hope we all get to do many things. Can\n                      we go now?\n          \n          The soldier arrives with a box. He whispers to Bizimungu.\n          \n                                  GENERAL BIZIMUNGU\n                      (to the soldier) Pack those carefully,\n                      put them in my jeep, and guard them.\n          \n                                  PAUL\n                           (looses his cool)\n                      Please, General, call and put your\n                      policemen back at the gate.\n          \n          The soldier packs the bottles. Bizimungu pours into Paul's cup.\n          \n                                                                  119.\n          \n                                  GENERAL BIZIMUNGU\n                      I am going to do you a great favor.\n                      (studies glass) I am going to take you\n                      with us to Gitarama.\n          \n                                  PAUL\n                      I do not want to go to Gitarama, General.\n          \n                                  GENERAL BIZIMUNGU\n                      You cannot go back to the hotel. The\n                      crazy men are going there now. Better to\n                      come with me.\n          \n          Paul is now terrified.\n          \n                                  PAUL\n                      The Militia are at the hotel?! We must go\n                      back now, General, please, for my family.\n          \n          Bizimungu, now tipsy, drinks more.\n          \n                                  GENERAL BIZIMUNGU\n                      We are better here.\n          \n                                  PAUL\n                           (desperate, forceful)\n                      Listen, you need me.\n          \n          Bizimungu laughs.\n          \n                                  PAUL (CONT'D)\n                      You are a marked man.\n          \n                                   GENERAL BIZIMUNGU\n                      How so.\n          \n                                  PAUL\n                      The Americans, and the UN they have you\n                      as a war criminal. You are on a list.\n          \n                                  GENERAL BIZIMUNGU\n                      I am on a list! What list?\n          \n                                  PAUL\n                      When the Europeans left, their soldiers\n                      gathered lists.\n          \n          Bizimungu grabs Paul.\n          \n                                   GENERAL BIZIMUNGU\n                      You lie.\n          \n          \n                                                                  120.\n          \n                                  PAUL\n                      If you do not help me, you will stay on\n                      that list.\n          \n                                  GENERAL BIZIMUNGU\n                      I committed no war crimes.\n          \n                                  PAUL\n                      Who will tell them? You need me to tell\n                      how you helped the hotel. The others who\n                      have gone, they blame you for all their\n                      misfortune. They say you led the\n                      massacres.\n          \n                                  GENERAL BIZIMUNGU\n                      (nervous now) I led no massacres.\n          \n                                  PAUL\n                      You think they will believe you?\n          \n                                   ENERAL BIZIMUNGU\n                      You will tell them the truth.\n          \n                                  PAUL\n                           (defiant)\n                      I will do nothing unless you help me now.\n          \n          Bizimungu reaches for his pistol.\n          \n                                  PAUL (CONT'D)\n                      What are you going to do, shoot me? It\n                      will be a blessing. Go ahead shoot. I\n                      will pay you to shoot my family. You can\n                      do nothing to me!\n          \n          Bizimungu jumps up, grabs Paul, pulls him.\n          \n                                  GENERAL BIZIMUNGU\n                      You will tell them I did nothing.\n          \n          \n          EXT. DIPLOMAT HOTEL. DAY\n          \n          Paul and Bizimungu rush out to the jeeps.\n          \n          \n          INT. JEEP TRAVELLING. DAY\n          \n          Paul almost overcome with anxiety. Bizimungu worried.\n          \n          \n          EXT. HOTEL FORECOURT. DAY\n          \n          Militia swarm around the front of the hotel.\n          \n          \n          \n                                                                             121.\n          \n          The jeeps race through, scattering them. They screech to a halt.\n          Several refugees sit, huddled and battered. Bizimungu jumps out,\n          snatches an A.K. from a soldier, fires in the air.\n          \n                                  GENERAL BIZIMUNGU\n                      Get back! (to his soldiers) Get them out\n                      of here.\n          \n          PAUL does not wait.\n          \n          \n          INT. HOTEL LOBBY. DAY\n          \n          Paul races into the hotel, past frightened refugees who flee.\n          \n          Then Paul sees a face he recognizes.\n          \n          It's Gregoire with the Militia! Paul ducks into the stairway.\n          \n          IN THE STAIRWELL\n          \n          He leaps the stairs four at a time.\n          \n          He makes it to the third floor, pushing past frightened refugees who\n          race down the stairs.\n          \n          ON THE THIRD FLOOR\n          \n          He runs straight into a bunch of young Militia.\n          \n                                  MILITIAMEN\n                      Rusesabagina. Show us Rusesabagina.\n          \n          They shove Paul along the corridor.\n          \n                                  MILITIAMAN #1\n                      Show us the manager. He wears a suit.\n          \n                                  PAUL\n                      They have him in the lobby, go quickly.\n          \n          The killers race off.    Paul gets to his feet and runs.\n          \n          \n          INT. PAUL'S ROOM. DAY\n          \n          Paul bursts in.    The place is a mess. And it's empty!\n          \n                                  PAUL\n                      Oh God, please Lord.\n          \n          IN THE CORRIDOR\n          \n          He careens out of the room.\n          \n          \n                                                                           122.\n          \n          And sees Gregoire coming with a group of Militia.\n          \n                                   GREGOIRE\n                       That's him. That's Rusesabagina!\n          \n          They charge toward Paul.\n          \n          Then a roar of gunfire. The ceiling and walls around Gregoire explode.\n          General Bizimungu's men run up with weapons drawn.\n          \n                                   HUTU SOLDIER\n                       Get out, or I'll shoot you.\n          \n          Paul rushes to the stairs.\n          \n          More gunfire echoes (soldiers clearing the Militia).\n          \n          AT THE STAIRS - Paul races upward, falls, pushes past others struggling\n          to get down.\n          \n          AT THE ROOF - now, there are clumps of refugees who have fled up there,\n          including Xavier who huddles in a corner.\n          \n                                   PAUL\n                       Tatiana! Oh God. Have you seen Tatiana?\n          \n          Paul runs to the edge of the roof, looks over.\n          \n          SEES: bodies -   women, and children, still, on the ground beneath, by a\n          row of hedge.\n          \n                                  PAUL (CONT'D)\n                      (screams in agony)\n                   TATIANA!\n          \n          The bodies move, look up, it's not them. It's refugees hiding. Paul,\n          delirious with fear, runs along the parapet.\n          \n          BELOW he sees soldiers herding the Militia.\n          \n          He runs back to the stairs.\n          \n          INSIDE THE STAIRCASE: He jumps four stairs at a time.\n          \n          INSIDE THE CORRIDOR: Soldiers are chasing off the Militia.\n          \n          TO HIS ROOM: Paul staggers in, crazed with fear. He looks under the\n          bed.\n          \n          INTO THE BATHROOM - empty.\n          \n          He's about to run out again, sees the connecting door to the adjoining\n          hotel room is slightly open.\n          \n          \n          \n                                                                             123.\n          \n          INTO THE ADJOINING ROOM: It's empty, then A WHIMPER.\n          \n          FROM THE BATHROOM, he moves in, cautious.\n          \n          IN THE BATHROOM: Nothing. He moves over, pulls back the shower curtain.\n          \n          Reveals: A cluster of women and children, the older ones holding hands\n          over the mouths of the younger ones. And there at the back: Tatiana and\n          his kids.\n          \n                                  PAUL (CONT'D)\n                      It's alright, they're gone.\n          \n          Tears, hugs, women tremble.\n          \n          \n          EXT. HOTEL FORECOURT. DAWN\n          \n          The grey of dawn, before the sunrise.\n          \n          Colonel Oliver in his jeep leads a convoy of UN trucks past the guard      \n          house and Bizimungu's police and up the drive.\n          \n                                                                      CUT TO:\n          \n          THE UN TRUCKS\n          \n          Parked in front of the hotel. Tutsi refugees file up and are helped on\n          board by UN soldiers.\n          \n          Paul helps Tatiana and the children onto a truck.\n          \n          An ARGUMENT breaks out towards the back of the convoy. Paul rushes\n          toward Xavier and Benedict who argue.\n          \n                                  XAVIER\n                      They should go one truck at a time. When\n                      the first truck gets through to the\n                      airport, then the others will follow.\n          \n                                  PAUL\n                      We can't wait. We all go together or not\n                      at all.\n          \n          Paul takes matters into his own hands. He locks the doors of the hotel.\n          There is no going back.\n          \n                                  PAUL (CONT'D)\n                      It is time to leave. The Mille Collines\n                      is closed.\n          \n          Paul climbs onto the truck. The others follow, some reluctantly.\n          \n          Colonel Oliver gives the signal.                                           \n          \n          \n          \n                                                                          124.\n          \n          The trucks take off down the driveway.\n          \n          \n          INT. TRUCK TRAVELLING. DAY\n          \n          Paul now at the front of the truck\n          \n          WATCHES out through a slice in the canvas.\n          \n          SEES, the convoy pull out of the Mille Collines.\n          \n          They travel along the road.\n          \n          Turn a corner, and the truck slows ...\n          \n          PAUL SEES: a great mass of Hutus fill the road:\n          \n          Militia, kids, soldiers discarding uniforms.\n          \n          No longer a mob, but a crush of Hutu refugees now fleeing toward them,\n          fleeing the advancing of the rebel army.\n          \n          A crowd of Militia men wave their arms, shout at the trucks.\n          \n                                  COLONEL OLIVER                                    \n                      Don't stop. Push through.\n          \n          The driver reluctantly speeds up.\n          \n          A break in the mass of Hutu refugees.\n          \n          Then GUN FIRE ahead.\n          \n          Children begin crying, it becomes infectious, spreading to Paul's\n          children, some of the women.\n          \n          Then ahead, a gang of Militia men break from the bushes beside the\n          road.\n          \n          They're running fast toward the truck, some carry rifles.\n          \n          There's more gunfire behind.\n          \n          The Militia are almost upon them now.\n          \n          Colonel Oliver has his pistol drawn.                                      \n                                    COLONEL OLIVER (CONT'D)                         \n                      Keep going.\n          \n          The Militia are at the truck.\n          \n          But they run STRAIGHT PAST!\n          \n            \n          \n                                                                          125.\n          \n          As a platoon of Tutsi rebel soldiers (in bush camouflage and   red and\n          blue headbands) burst from the brush.\n          \n          Pursuing, careful, professional.\n          \n                                   PAUL\n                       It's the rebels.\n          \n          The crying stops. Silent disbelief.\n          \n                                   PAUL (CONT'D)\n                       We've made it!\n          \n          Cheering breaks out. Children frightened again by the sudden euphoria\n          break into cries of joy.\n          \n          A rebel soldier waves his AK 47 in the air.\n          \n          \n          EXT. KIGALI SOCCER STADIUM. DAY\n          \n          The trucks crawl into the chaos of the stadium, a mass of refugees, the\n          wounded, lost children, abandoned old people, hundreds crammed\n          together.\n          \n          Paul, Tatiana, and the others clamber off the trucks. They hug, cry, an\n          outpouring of relief. Then Tatiana spots someone among the crowds.\n          \n          She rushes over.\n          \n                                   TATIANA\n                       Have you seen my sister Fedens?\n          \n          Heads shak `no'. Tatiana moves on, more frantic, pushing through the\n          crowds.\n          \n                                   TATIANA\n                       Two little girls, twins, an old woman had\n                       them.\n          \n          More `nos'\n          \n          Now she's desperate, pushing, tripping through the crowds, and around\n          her we see others doing the same, then\n          \n                                      OGER (O.C.)\n                       Mama, mama.\n          \n          He reaches her, pulls at her dress.\n          \n                                     ROGER\n                       Mama, wait.\n          \n          She takes his hand.\n          \n          \n                                                                             126.\n          \n                                  ROGER\n                      No, mama, look.\n          \n          Tatiana turns .... and sees Paul carrying the twins in his arms.\n          \n          She squeals with joy, runs to him, snatches one from his arms.\n          \n                                  TATIANA\n                      Oh, my babies.\n          \n                                  PAUL (CONT'D)\n                      Anais, it is so good to see you.\n          \n                                    CARINE\n                      I'm Carine!\n          \n                                  ANAIS\n                           (in Tatsi's arms)\n                      And I'm Anais!\n          \n          Their laughter mix with tears of joy among the crushing mass of            \n          survivors.\n          \n          FREEZE\n          \n                                                               FADE TO BLACK:\n          \n          \n          THE GENOCIDE ENDED IN LATE JUNE 1994, WHEN THE TUTSI REBELS DEFEATED       \n          THE HUTU ARMY AND MILITIA.\n          \n          TWO MILLION HUTUS FLED INTO THE NEIGHBORING CONGO IN THE LARGEST SINGLE\n          EXODUS OF THE TWENTIETH CENTURY\n          \n          THEY LEFT BEHIND ALMOST ONE MILLION CORPSES.                               \n          \n          \n                      ------------------------------------------                     \n          \n          \n          \n          \n          PHOTO OF: GEORGE RUTAGUNDA                                                 \n          George Rutagunda was convicted of crimes against humanity.   He is now     \n          serving a life sentence in a Tanzanian jail.\n          \n          PHOTO OF: GENERAL BIZIMUNGU\n          \n          Augustin Bizimungu escaped with the Hutu Militia to the Congo. In\n          August, 2002 he was captured in Angola. A UN war crimes tribunal has\n          charged him with crimes against humanity.\n          \n                                                                          127.\n          \n          PHOTO OF: THOMAS AND FEDENS                               Thomas' and\n          Fedens' bodies where never found. Paul adopted their twin daughters.\n          \n          PHOTO OF: PAUL (the lead actor)                           PAUL\n          RUSESABAGINA: saved the lives of all one thousand two hundred Rwandan\n          refugees who took shelter at the Mille Collines Hotel.\n          \n          PHOTO TURNS TO PHOTO OF REAL PAUL AND HIS FAMILY.         Paul,\n          Tatiana, the twins, and all their family now live in Belgium, where\n          Paul owns and operates two taxi cabs.\n          \n          FREEZE -\n          \n                                            THE END\n          \n          \n \n\n\n\nHotel Rwanda\nWriters :   Keir Pearson  Terry George\nGenres :   Drama  Thriller  War\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Tensions between the Hutu and Tutsi peoples lead to a war in Rwanda, where corruption and bribes between politicians are routine. Paul Rusesabagina (Cheadle), the manager of the Sabena owned Hôtel des Mille Collines, is Hutu, but his wife Tatiana (Okonedo), is Tutsi. His marriage is a source of friction with Hutu extremists, most prominently Georges Rutaganda (Kae-Kazim), a friendly goods supplier to the hotel who is also the local leader of Interahamwe, a brutal Hutu militia.\nAs the political situation in the country worsens following the assassination of the president, Paul and his family observe neighbors being killed in ethnic violence, initiating the early stages of a genocide. Paul curries favor with people of influence, bribing them with money and alcohol, seeking to maintain sufficient influence to keep his family safe. When civil war erupts and a Rwandan Army officer threatens Paul and his neighbors, Paul barely negotiates their safety, and brings them to the hotel. More evacuees arrive at the hotel from the overburdened UN refugee camp, the Red Cross, and various orphanages. Paul must divert the Hutu soldiers, care for the refugees, be a source of strength to his family, and maintain the appearance of a functioning hotel as the situation becomes more violent.\nThe UN Peacekeeping forces, led by Canadian Colonel Oliver (Nolte), are unable to take assertive action against the Interahamwe since they are forbidden to intervene in the genocide. The foreign nationals are evacuated, but the Rwandans are left behind. When the UN forces attempt to evacuate a group of refugees, including Paul's family, they are ambushed and must turn back. In a last-ditch effort to save the refugees, Paul pleads with the Rwandan Army General, Augustin Bizimungu (Mokoena) for assistance. However, when Paul's bribes no longer work, he blackmails the General with threats of being tried as a war criminal. Soon after, the family and the hotel refugees are finally able to leave the besieged hotel in a UN convoy. They travel through retreating masses of refugees and militia to reach safety behind Tutsi rebel lines.\nThe film's epilogue displays a series of graphics stating that Rusesabagina saved 1,268 Rwandan refugees at the Hôtel des Mille Collines, and now lives in Belgium with his family. It notes that Rutaganda and General Bizimungu were tried and convicted by the UN for war crimes in 2002, while also conveying that the genocide ended in July 1994 leaving almost a million people dead."}