{"title": "How to Train Your Dragon 2", "full_text": "How to Train Your Dragon 2\nWriters :   Dean DeBlois  Cressida Cowell\nGenres :   Animation  Action  Adventure\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "The island of Berk is a remote Viking village, from which dragons periodically steal livestock. Hiccup, the awkward son of the village chieftain, Stoick the Vast, is too small to fight the dragons and instead fashions mechanical devices under his apprenticeship with Gobber the blacksmith, though his inventions often backfire. During one attack, Hiccup believes he has shot down a Night Fury, an extremely rare and dangerous dragon. Hiccup later finds it in the forest trapped in his bolas, but finds that he can't bring himself to kill the dragon and instead sets it free. Stoick assembles a fleet to find the dragons' nest, leaving Hiccup in a dragon-fighting class taught by Gobber. Hiccup returns to the forest to find the Night Fury still there, and realizes it is unable to fly properly because of its crippled caudal fin. Hiccup gradually tames the dragon and gives it the name \"Toothless\", for its retractable teeth. Hiccup makes a harness and prosthetic fin that allows him to guide the dragon in free flight. By studying Toothless' behavior, Hiccup becomes proficient in subduing the captive dragons during training. Stoick's fleet arrives home unsuccessful, but he is cheered by Hiccup's unexpected success.\nAstrid, a tough Viking girl whom Hiccup has a crush on, discovers Hiccup is training Toothless but before she can tell the village, Hiccup takes her for a ride to demonstrate his relationship with the dragon. Toothless unexpectedly takes the pair to the dragons' nest where they discover a gargantuan dragon named the Red Death2 that eats the smaller dragons unless they bring it stolen livestock.\nBack at the village, Hiccup subdues a captive dragon in his final training test in front of his father instead of killing it, but Stoick inadvertently angers the dragon into attacking. Toothless attempts to protect Hiccup in the ensuing panic but is instead captured by the Vikings. Hiccup accidentally reveals to Stoick that Toothless is capable of locating the dragons' nest. Stoick disowns his son and sets off for the nest with Toothless chained to the lead ship as a guide. The Vikings expel most of the dragons but are overwhelmed by the Red Death until Hiccup, Astrid and their fellow pupils fly in riding the training dragons from the academy and provide cover fire. Hiccup almost drowns trying to break Toothless free from a sinking ship but Stoick saves them both and then reconciles with his son. Toothless and Hiccup destroy the Red Death but Hiccup is injured in the fight. Hiccup regains consciousness on Berk where his left foot has been replaced by a prosthesis, and the Vikings and the dragons now live in harmony."}