{"title": "Hudson Hawk", "full_text": "\"Hudson Hawk\", by Steven E. de Souza, revised by Daniel Waters\n\n\n\n   \n\n\n\n\n                            HUDSON HAWK\n\n\n\n                           Screenplay by\n\n                        Steven E. de Souza\n\n\n                           Revisions by\n\n                            Dan Waters\n\n\n                   Based on an original idea by\n                    Bruce Willis & Robert Kraft\n\n\n\n\n\n     A Silver Pictures/Flying Heart Films      June 14, 1990\n      Production\n\n\n\n\n\n     NOTE: THE HARD COPY OF THIS SCRIPT CONTAINED SCENE NUMBERS\n     AND SOME \"SCENE OMITTED\" SLUGS. THEY HAVE BEEN REMOVED FOR\n     THIS SOFT COPY.\n\n\n\n\n     FADE IN:\n\n     EXT. VINCI COUNTRYSIDE - RENAISSANCE - DAY\n\n     Beneath a jawdroppingly storybook castle, a small\n     Renaissance Fair with florid awnings, demented ACROBATS\n     and roaring puppets is unfolding.\n\n     RUSTIC FARMERS and their families rumble with enjoyment\n     at the Sabbath afternoon entertainment.\n\n     Encircled by children, A JUGGLER WITH AN UNFORGETTABLY\n     ETCHED FACE elegantly plucks the red balls from a pouch\n     on his mule.  As he begins to juggle, a LOUD EXPLOSION\n     is heard, causing him to ungracefully drop his balls\n     and collapse in a heap.\n\n     Everyone at the fair, including the puppets, looks up.\n\n                             UNFORGETTABLE JUGGLER\n               Leonardo, che pazzo.\n\n     The juggler shakes his fist up to a swish pan that swings\n     up toward a smoking window of the awesome castle...\n\n     INT. ROOM OF THE GOLD MACHINE\n\n     where the charismatic LEONARDO DA VINCI laughs down at\n     him.  Da Vinci wears a pair of very early, very cool sun-\n     glasses with his trademark beard.\n\n     He turns and loses his smile, something extraordinary\n     reflecting off his glasses.  Removing his shades, Da\n     Vinci moves to the Something, a gloriously incredible\n     machine.  The opening CREDITS REVEAL its dazzling idio-\n     syncrasies.\n\n     TWO COUGHING APPRENTICES haplessly try to disperse smoke\n     from the still billowing, mysteriously spectacular\n     Machine.  Mirrors attached to parts of it reflect beams\n     of light which cut through the smoke like a Renaissance\n     laser show.\n\n                             DA VINCI\n                       (silencing authority)\n               Basta vapore.\n\n     The apprentice throws a lever.  A shunt near the furnace\n     turns.  Steam escapes upwards.  The machine immediately\n     slows down.  Da Vinci oh-so-gently coughs and moves for-\n     ward with tongs.\n\n     A LITTLE TROUGH - IN THE MACHINE'S INNARDS\n\n     comes to a trembling, mystical halt.  Right behind this\n     trough is a CONPLEX POLYHEDRON CRYSTAL as intricately\n     modulated as any Rubik stocking stuffer, but much more\n     dazzling in beauty.  It gleams like a jewel in the yellow\n     glow which pours from a PLEASANTLY GRINNING DEMONHEAD into\n     a trough--a glow of heat--and something more than heat.\n\n     The tongs enter the frame.\n\n     Da Vinci brings the object closer to his face.  A murmur\n     goes up from the awestruck apprentices as the Master\n     peers at the smoking yellow bar.\n\n                             APPRENTICE TWO\n               Maestro, che meraviglia!\n\n                             APPRENTICE THREE\n               Lei e' proprio fantastico!\n\n     Da Vinci's pride goes dead as the implications hit.\n\n                             DA VINCI\n               Lasciatemi, solo.  Solo!\n\n     The apprentices scurry out.  Mind reeling, Da Vinci turns\n     his back to the viewer, before a wall of frescoes.\n\n                             DA VINCI\n               L'ho fatto.\n\n     Spinning back around, using the edge of his cloak, Da\n     Vinci pulls out the large gleaming crystal with a pop.\n\n     INT. DA VINCI'S WORKSHOP\n\n     With an accompanying blast of smoke, Da Vinci bursts\n     through some double doors into his workshop, sadly\n     reflecting upon the crystal in one hand and the tonged\n     bar in the other.\n\n     His workshop is a spendiferously enigmatic blend of\n     laboratory and studio; On a table in the foreground is\n     a fresh clay equestrian statue; a large VOLUME of\n     sketches, the inkwell nearby; a MODEL of what looks like\n     a HELICOPTER; Da Vinci flings the tonged bar on the table\n     among these goodies.\n\n     Pocketing the crystal, Da Vinci meanders through his work-\n     shop casually tinkering with various experiments.  He\n     snaps his fingers at a BATHING SUITED APPRENTICE, wearing\n     a diving helmet prototype.  The Apprentice jumps into a\n     pool of water.\n\n     Leonardo next stops at an easel displaying a finished-\n     except-for-the-mouth portrait of Mona Lisa, who happens\n     to be seated in a stool before the easel.  She broadly\n     smiles, revealing the worst dental work of her epoch.\n     Da Vinci shakes his head and moves out onto a\n\n     EXT. CASTLE TERRACE\n\n     A FLYING APPRENTICE sails past Leonardo in a bat winged\n     glider, enthusiastically shouting.  Da Vinci grins back\n     until he touches his pocket.  He pulls out the crystal\n     and, after a beat, angrily twists it apart into two\n     separate, geometric pieces revealing a small intricate\n     mirror.  He quickly folds the surprisingly shapable\n     geometric pieces.\n\n     Calming down, Da Vinci looks from the three components of\n     the crystal to each of the three unfinished works on the\n     table in his workshop.  He ponders then looks back out to\n     the Vinci vista.\n\n     The bat winged glider DISSOLVES into:\n\n     A HAWK\n\n     who is revealed to be flying over Sing Sing prison.\n\n     INT. A SING SING PRISON CELL\n\n     The shadow of the hawk passes through a cell window, over\n     the face of EDDIE HUDSON HAWKINS causing him to break out\n     of an eye-closed trance.\n\n     Before the viewer can get a good look at him, Hudson\n     Hawk turns to an oddball version of the \"Mona Lisa\" that\n     has his face and tears it off the cell back-wall.\n\n     INT. PRISON BLOCK WALKWAY\n\n     TWO PRISON GUARDS, One WISE and BLACK, the other YOUNG\n     and GREEN march down a cell block.  The Former is smoking\n     a pipe which the Young Guard lights with a lighter.\n\n                             WISE GUARD\n               We're losing our biggest celebrity\n               today.\n\n                             YOUNG GUARD\n               You're kidding, Petey the Paint\n               Thinner Killer is getting paroled?\n\n                             WISE GUARD\n               Not that slime, you Fizzhead.\n               Hudson Hawk.  The last of the\n               great cat burglars.\n\n     INT. PRISON CELL WALL\n\n     A hand tears down a picture of a happy Hudson Hawk and\n     a LITTLE MONKEY, identically dressed in black cat\n     burglar gear.\n\n     THE BLOCK\n\n     The Wise Guard and the Young Guard rumble forward.\n\n                             WISE GUARD\n               As a thief, Hawk was a poem.\n               Iambic fucking pentameter.  You\n               know, Crime used to have a little\n               class.  A hundred reporters were\n               here when he came in, now they're\n               probably out covering some tired\n               crack gang war...\n\n     The Guards approach Hawk's cell.  Hawk, with his back\n     turned, hefts on a nifty blazer.\n\n                             HAWK\n               Remind me to fire my publicist.\n\n     The Wise Guard chuckles as the Young Guard fumbles with\n     his key-ring.\n\n                             YOUNG GUARD\n               Darn, these are for L-block...\n\n     Hawk's hand reaches through the bars and grabs a pipe\n     cleaner from the Wise Guard's pocket.  Then the lighter\n     from the Young Guard's pocket--BURNS OFF the fabric fuzz\n     with the lighter beside it--bends the now blackened\n     wire--and with a quick turn of the wrist uses it to\n     UNLOCK the door.\n\n                             YOUNG GUARD\n               - go back down to security and-\n\n     He stops, dumbfounded, as the door clunks open.  The\n     Guards double-take as Hawk, finally in full view, struts\n     past them, down the hall.  The Guards hustle to catch\n     up.  The wise guard puts his finger in the air and\n     sarcastically pretends to be stung by the heat emanating\n     from Hawk.\n\n                             WISE GUARD\n               Guess this means, Hawk, you'll\n               be able to let yourself back in...\n\n                             HAWK\n               Never happen.  Bet.  Ten bucks.\n\n     Hawk and the Wise Guard hit fists, half-smiling.  Hawk\n     unfolds the painting.\n\n                             HAWK\n               Oh, give this back to Petey in A\n               block.  Tell him it was a sweet\n               gift, but I think he got some\n               wrong ideas about our friendship.\n\n                             YOUNG GUARD\n               The Paint Thinner Killer did\n               this?  I think you picked a good\n               day to get out...\n\n     The trio comes to the final checkpoint.  Hawk takes a\n     deep breath.\n\n                             WISE GUARD\n               Hope I lose the bet.  Have that\n               cappuccino on me.\n\n                             HAWK\n                       (flipping him the\n                        pipe cleaner)\n               You got it.  A double.\n\n     EXT. OUTSIDE THE PRISON--DAY\n\n     Hawk strides to the Massive Sliding Concrete Door/Wall\n     between him and freedom.  As music crescendos and\n     Hawk glows his first smile, the door opens to reveal two\n     Mafioso brothers, CESAR and ANTONY MARIO, the latter\n     sitting upon the hood of a tinted window Lincoln\n     Continental.  Cesar is of cool, hair-slicked-back\n     attitude, his scumbag brother is not.\n\n                             ANTONY\n               Welcome back, buddy ol' pal.\n               We've got a proposition...\n\n                              HAWK\n               Answer's no, not even if you\n               bathe.  Cesar Mario, Antony Mario,\n               how's the \"Family?\"  Kill any\n               monkeys lately?\n\n                              CESAR\n               How many times do I have to say\n               it?  I didn't put the hit on\n               Little Eddie... Never had anything\n               against that kooky chimp.  I\n               actually found him, \"endearing.\"\n\n                             HAWK\n               Sure.  Face down.  Two endearing\n               shots to the back of the head.\n               That's your mark, man.  What did\n               Little Eddie ever do to...\n\n     Smouldering, Hawk struts off.  Cesar takes a black\n     canvas bag from a SCARFACED DRIVER and hustles up to\n     Hawk.  The Lincoln rumbles behind them, Antony riding\n     on the hood.\n\n                             CESAR\n               You're hitting Rutherford's\n               Auction House.  Easy as my\n               brother's wife.  Directions are\n               in the bag.  Just open the seventh\n               floor safe and take out the\n               thingie...\n\n                             HAWK\n               Or you cut off my thingie.\n               Directions even your brother\n               would understand.\n         \n                             ANTONY\n                       (defensively)\n               Yeah, directions even I could\n               understand.\n\n     The car squeals to a stop.  Antony bounds off.  Cesar\n     shove-throws the canvas bag into Hawk's unwilling\n     hands.\n\n                             CESAR\n               Hawk, you're a great thief.  Got\n               set up, did some time, nothing to\n               be ashamed of.  Don't give me a\n               sonata about you always just\n               really wanted to settle down,\n               open a hardware Store and sell\n               spatulas...\n\n                             HAWK\n               If the Mario brothers weren't\n               Jersey's third largest family,\n               I'd say kiss my ass.  But\n               considering your status, I'll\n               say slurp my butt.\n\n     Hawk fiercely push-shoves the canvas bag back into\n     Cesar's hands.\n\n                             CESAR\n               What's your favorite sport, Hawk?\n\n                             HAWK\n               Baseball, why?\n\n     Antony opens the back door of the Lincoln and says\n     \"Baseball.\"  He is handed a baseball bat.  Hawk backs\n     up as Antony moves threateningly toward him.\n\n                             HAWK\n               I meant, ping pong.  Listen, I'd\n               rather go back in than whore for\n               you...\n                       (stopping)\n               Oh, I need to borrow ten dollars.\n\n     A PRISON GUARD from above turns as not to be a witness.\n     Hawk feebly calls up to him.\n\n                             HAWK\n               Help?  Police?\n\n     Antony swings at Hawk, who pretends not to notice until\n     the last second.  Hawk ducks and slam-kicks his calf.\n     Antony crumples, using the bat as a crutch.  Hawk boots\n     up the bat for a two-handed catch then savagely pivots\n     it across Antony's face, knocking him into the backseat\n     of the car.\n\n                             CESAR\n                       (unfazed)\n               You need some time to think.\n               That's cool, but next time, I'm\n               not going to say \"Please.\"\n\n     Cesar floats into the backseat.  The Lincoln takes off.\n     Hawk seethes...\n\n                             HAWK\n               I don't believe this.  I've been\n               out forty seconds...\n\n     A BACKFIRE rings out.  Hawk hits the ground, thinking\n     it is a gunshot.\n\n     HAWK'S ON THE GROUND P.O.V.\n\n     A gasping 1960 Caddy comes to a stop and a pair of a too-\n     fancy-to-be-tasteful shoes comes out.  Hawk looks up to\n     see ALEX MESSINA, his older, maybe-maybe-not-wiser best\n     friend.\n\n                             ALEX\n               That's the first thing I did.\n               Smooch the ground and taste the\n               freedom.  Sorry I was late.  Miss\n               anything?\n\n                             HAWK\n                       (getting up)\n               Your timing, and your shoes, are\n               impeccable...  Good to see you,\n               Alex, been having a lousy day.\n\n                             ALEX\n               Lousy day?  The man's getting out\n               of prison and he's having a\n               lousy day.  What, you missing out\n               on the Cell Block Water Ballet\n               pageant?  Believe me, it's\n               overrated.\n\n     Hawk pauses to say something, then just hugs Alex.\n\n                             ALEX\n               Where's the kiss?  No tongue this\n               time, I promise.\n\n     A laughing Hawk gives Alex's stomach a slap before\n     getting in the car....\n\n                             HAWK\n               Looks like you've been expanding\n               your...\n\n                             ALEX\n               Don't say it, Hawkins.  I'm\n               incredibly sensitive about my\n               fucking figure.\n\n                             HAWK\n               My next word was gonna be\n               \"consciousness.\"  Swear to God...\n               tubby.\n\n     EXT. THE ROAD INTO HOBOKEN--DAY\n\n     The Caddy thunders past a sweet Manhattan view. \"Come\n     Fly With Me\" is playing on the radio.  Hawk casually com-\n     pletes an intimidating hand puzzle.\n\n                             HAWK\n               That's your definition of \"Hard?\"\n\n                             ALEX\n               Show off.  Hey, boss tune.  \"Come\n               Fly with Me.\"\n\n                             HAWK\n               Three minutes, 51 seconds.\n\n                             ALEX\n               Still do the puzzles, still know\n               the running times of songs, and\n               I'll bet you're still the best\n               damn cat burg--\n\n                              HAWK\n               Not anymore.  Now I'm the laziest\n               damn cat burg--I'm going to take\n               it so straight that I won't tape\n               a Mets game without the expressed\n               written consent of the National\n               Baseball League.\n\n                             ALEX\n               Now that you're born again,what\n               do you wanna do?  Statue of\n               Liberty?  Entertain some ladies?\n               Miss Saigon tix?  Seduce some\n               women?  Play Nintendo?  Bone some\n               chicks?\n\n                             HAWK\n               Come on, Alex, let's just get to\n               Alex's.  Your bar's the only\n               place that's going to cheer me.\n               God, I'd kill for a damn\n               cappuccino.  What the hell's a\n               Nintendo?\n\n                             ALEX\n               Oh man, you still got a thing for\n               those unmasculine European coffees?\n               Who's your buddy?\n\n     Alex pulls a styrofoam cup from a paper bag.\n\n                             HAWK\n               The man knows, the man knows!\n\n     Hawk takes off the cap with a stimulating whiff.\n\n                             ALEX\n               So Mr. Coffee, what went down\n               outside the prison?\n\n                             HAWK\n               Oh, not much.  Mario Brothers want\n               me to do a job.\n\n     Alex brakes and cappuccino flies.  Hawk half-heartedly\n     tries to lick up with his fingers.\n\n                             ALEX\n               Those dago-guinea-I can say\n               this shit I'm Italian-wop\n               motherfu--\n\n                             HAWK\n               Ah, had the perfect amount of\n               foam.  Just get me to the bar...\n               It's the one good thing in my\n               life that'll never change....\n\n     EXT. OUTSIDE ALEX'S BAR--NIGHT\n\n     The Guys move through the personably Jersey face of the\n     bar.  The Empire State Building beams in the background.\n     Sinatra cuts off.\n\n     INT. ALEX'S BAR--NIGHT\n\n     It's changed.  Hawk and Alex enter into what has become\n     the ultimate pseudo-art deco-fern littered-nightmare,\n     packed with noisy, INSUFFERABLY SELF-ABSORBED YUPS.\n     A violently erotic and pretentious video plays upon\n     elevated T.V. sets set up all around the place.\n\n     Hawk's mouth gapes as he drifts by a sickening COUPLE\n     toasting wine coolers, and two very YOUNG BROKERS high-\n     fiving each other after missing a dartboard.\n\n                             ALEX\n               I didn't know how to tell you.  A\n               couple brokers stopped in for\n               Stoley Spritzers one night.  Next\n               thing I know Fast Track Digest\n               votes us \"Watering Hole of the\n               Month.\"  Now, I'm shopping for\n               Aqua Salmon wallpaper.\n\n                             HAWK\n               I read about these people in\n               Newsweek.  Where's all the\n               regulars, Crazy Jeff Cava, the\n               Todd sisters, Indian Joe?  Where's\n               Ed Kranepool's autograph?  Captain\n               Bob's steering wheel?\n\n                             ALEX\n               Hey, get this irritable guy a\n               cappuccino.  I gotta go be a boss.\n\n     Alex lifts a piece of the bar and moves behind it.\n     Snatching up a menu, Hawk calls out...\n\n                             HAWK\n               This is Pizza?  Reindeer Goat\n               cheese?  I admit, I've been known\n               to go wild and order a Canadian\n               Bacon in my time, but..\n\n     Hawk lights up a cigarette.  A TORTOISE SHELL NON-SMOKER\n     immediately turns to him wearing a \"Yes, I mind if you\n     smoke\" button.\n\n                             TORTOISE SHELL NON-SMOKER\n               Can you read.... smoker?\n\n                             HAWK\n               Can you take a sunrise and\n               sprinkle it with dew?\n\n                              TORTOISE SHELL NON-SMOKER\n                       (Huh?)\n               No.\n\n                              HAWK\n               The Candy Man can, Felix.  You\n               know, I thought this was a country\n               where you could do any stupid\n               thing you wanted; drive to work\n               naked, make love to a V.C.R.\n               Guess I'm wrong.  Maybe that's\n               why I became a serial arsonist.\n\n                             TORTOISE SHELL NON-SMOKER\n               Hey, it's okay, big guy.  Smoke\n               all you want.  Have mine....\n\n     The Non-smoker fumbles out a pack of cigarettes and\n     flees.  A cappuccino in cup and saucer slides down the\n     bar saloon-style.  A smiling Hawk picks it up, turns away\n     from the bar and closes his eyes, bringing the cup to his\n     lips until a POLICE BADGE swirls into frame and splashes\n     into the cup, splattering coffee over Hawk's blazer.\n\n                             GATES (O.S.)\n               You're under arrest...\n\n     Hawk makes eye contact up to a crude, coarse, and\n     cackling island of a man, OFFICER GATES, amid the sea\n     of oblivious and self-obsessed yuppitude, standing by\n     a table.\n\n                             GATES\n               Have a seat.  Good to see you,\n               buddy ol' pal...\n\n                             HAWK\n               The pleasure's all yours, Officer\n               Gates.\n\n     BACK OF THE BAR\n\n     With concern, Alex watches Hawk sit at Gates' table.\n\n     GATES' TABLE\n\n     Gates pillages a plate of spaghetti and meatballs with\n     terrifying precision.  Hawk tosses the badge onto the\n     food.  Gates eats around it.\n\n                             GATES\n               Why do you show your parole\n               officer such disrespect?\n               Especially after I got you such\n               a nice job.\n\n                             HAWK\n               What job?\n\n     Gates pulls up the black canvas bag and puts it on the\n     table.\n\n                             GATES\n               The auction house, asshole.  One\n               night's work and you're free like\n               no ex-con's ever been.  No\n               checking in with a shrink, no\n               community service teaching\n               retards how to play air hockey.\n               It's a great deal, I can't lie.\n\n                             HAWK\n               The only thing you can't do is\n               get sex for free.  I know I was\n               in prison for like basically the\n               80's, but, call me daffy, aren't\n               you supposed to stop me from\n               committing crimes.  You know,\n               Book-em-Dano, Call-for-backup,\n               Give-a-Hoot-Don't-Pollute.\n\n     Gates thunders out of his chair and moves around to sneer\n     down at Hawk.  Behind Gates, on the T.V. screens, are\n     analogous images of DISGUSTING ANIMALS AND MONSTERS.\n\n                             GATES\n               You wouldn't be out if it wasn't\n               for me!  I did dog and pony for\n               you!  You think they would have\n               let you out after what you did,\n               you told the board members they\n               looked like the Three Stooges...\n\n                             HAWK\n               How was I supposed to know they\n               were women?  Besides one of them\n               was bald and kept saying\n               \"Soitinly.\"\n\n     Gates simmers into his seat with a self-control smile.\n\n                             GATES\n               Remember that guy in the cell\n               next to you who hung himself?\n\n                             HAWK\n               Yes.\n\n                             GATES\n               Remember that shoe you lost...\n\n                             HAWK\n               Uh, yeah.  Cut to the chase.\n\n     Gates pulls up a shoe and puts it on the table.\n\n                             GATES\n               One phone call and your shoe\n               will become a piece of evidence\n               and that suicide'll become a\n               murder.\n\n     Hawk bobs under the table and up.\n\n                             HAWK\n               What else do you got under there\n               ... I don't want to be rude, but\n               this is all pretty lame.\n\n                             GATES\n               That's the beauty.  It's bullshit,\n               but I can make it stick because\n               I'm a good guy parole officer and\n               you re a bad guy who's about to\n               find out that there's a thin line\n               between ex-con and escape con.\n\n     Alex suddenly approaches the table.\n\n                             ALEX\n               How is everything tonight, sir?\n\n                             GATES\n               Beat it, Alex.  You're a dinosaur.\n\n                             HAWK\n               Alex, did you know this ape was\n               going to be here...\n\n                             ALEX\n               Sure.  That's why his meatballs\n               are made out of marinated Chuck\n               Wagon.\n\n                             GATES\n                       (mouthful)\n               You're full of shit.\n\n     As Alex speaks, an eating dog is on the screens.\n\n                             ALEX\n               No, man, actually you are.  Just\n               add water and it makes its own\n               gravy.  Keeps your teeth healthy\n               and your coat shiny.\n\n     Gates grabs the shoes and races off, gagging.  Hawk gets\n     up to laugh next to Alex.  Their laughter dies as they\n     turn to look at the black canvas bag left on the table\n     between them.\n\n     INT. BACK ROOM--DAWN\n\n     Hawk stares mournfully at a black and white photo of a\n     monkey-sized chalk-outline on a city street.  Behind him,\n     Alex pulls out blueprints from the black bag.  Sinatra's\n     \"Witchcraft\" blares on the radio....\n\n                             ALEX\n               Hmmmm.....\n\n                             HAWK\n               Yo Pandora, quit hummm-ing... look\n               at this.\n\n     Hawk is rummaging through stockpiled remnants of an old,\n     \"true\" bar.  Round lamps, tacky mirrors, pictures of Hawk\n     and the Regs at the bar.  Managing a weary smile, Hawk\n     lifts a ship steering wheel, while Alex puts on a pair of\n     granny classes and pulls out blueprints.\n\n                             HAWK\n               It's Captain Bob's steering wheel!\n               Remember when the Captain.....\n\n                             ALEX\n               Hmmm, nasty little safe on the 7th.\n\n     Hawk nervously picks up a Rubik's Cube and holds it\n     behind his back.  He brings it back around, completed.\n     Sighing, Hawk drops the cube and rubs his scalp.  Alex\n     starts rubbing his stomach.  They pace in pre-job\n     syncopation and speak rapid-fire.\n\n                             HAWK\n               The safe's a Simpson 71.  Last\n               time I played the game, Simpson\n               only had a 40.\n\n                             ALEX\n               Just means it'll take you an extra\n               31 seconds to seduce.  You re\n               still the best, I know it.\n\n                             HAWK\n               But you got three guards who...\n               Shit, what am I doing?  Where's\n               the want ads?  Gonna sell some\n               spatulas.\n\n                             ALEX\n               Hey, I'm sorry, man.  I'm putting\n               out a fire with kerosene.\n\n     Alex gives Hawk a consoling two-hand-shake then jumps\n     back to reveal he has put Hawk into thumbcuffs.\n\n                             HAWK\n               This isn't funny.  I'm not into\n               this.  I...\n\n                             ALEX\n               There goes five seconds...My\n               record's eighteen.\n\n                             HAWK\n               You're not...LISTENING!\n\n     Out of annoyance, Hawk breaks out of the cuffs and\n     violently throws them at Alex, who sits down a little\n     wounded.\n\n                             HAWK\n               I'm sorr--Goddamn Mario Brothers.\n               Goddamn Gates.  Goddamn Rutherford\n               Auction House.  By the way, how\n               many seconds?\n\n                             ALEX\n               Rutherford Auction... that name...\n\n     Alex jumps up excitedly and then convulses in pain.\n\n                             HAWK\n               Alex!\n\n                             ALEX\n               Don't wet your diapers.  I'll have\n               to change them.  \"Witchcraft.\"\n               What's the running time?\n\n     Alex flops down behind a work table before a wallfull of\n     drawings of different kinds of vaults.  He sets himself\n     up for an insulin injection.\n\n                             HAWK\n               3:48.  I can't get you involved,\n               man.  This is my sewage and...\n                       (re drawings)\n               God, you love all this, don't you,\n               you bastard.  Haven't you ever\n               heard of stamp collecting, or\n               curling?\n\n     Hawk leans in and administers the shot of insulin to\n     Alex.\n\n                             ALEX\n               I'm in.  Have you seen the public\n               service announcements for Diabetes.\n               We can ride horses, play LaCrosse,\n               and knock off auction houses.  I\n               got a plan.  You won't have to hail\n               Cesar or Gates.\n\n     Hawk collapses next to Alex, resigned to his fate.\n\n                             HAWK\n               I'm a bum.\n\n     EXT. NICE, BUSINESS NEIGHBORHOOD--NIGHT\n\n     TWO GRUBBY DERELICTS, one pushing a shopping cart, the\n     other inside it, situated atop the usual two Glad bags.\n     They are drunkenly warbling \"Witchcraft.\"  IMPECCABLY\n     DRESSED NIGHT-LIFERS give them a wide berth.\n\n     Our derelicts pass beneath a MASSIVE RED CANOPY of a\n     distinguished eight story edifice, upon which is written\n     RUTHERFORD'S AUCTION HOUSE.  A DOORMAN shoos them away...\n\n     A NEWSPAPER TRUCK pulls up in front of the Auction House.\n     The Driver pops out with a bundle of papers and moves to\n     a Dispenser on the corner.  The Bums wheel around the\n     truck.  The Driver loads the papers and bounds back.\n\n     The Truck pulls away from the corner.  The shopping cart\n     rolls off--the bums nowhere to be seen.\n\n     The Truck turns the corner, revealing the derelicts\n     climbing up the back of it, with Glad bags around their\n     necks.  The Truck moves toward an enclosed Walkway Bridge\n     that connects the Auction House with another Building.\n\n     Launching low-tech grapples, the Vagrants latch them-\n     selves onto the Walkway window as the Truck passes\n     beneath.\n\n     AT THE WINDOW\n\n     The viewer's viewpoint moves into a tighter view of the\n     dangling derelicts, revealing them to, of course, be Hawk\n     and Alex.  Getting a footing, on the small window ledge,\n     each man cuts a hole in the window while holding onto a\n     plunger.\n\n                             HAWK\n               Whoa, you better cut a bigger hole\n               than that.\n\n                             ALEX\n               Hey, you promised......Don't worry,\n               I'm wearing my girdle.\n\n     INT. INSIDE THE WALKWAY WINDOW--NIGHT\n\n     Hawk and Alex come through their window holes.  Hawk\n     immediately flattens himself against a wall, whisper-\n     ing...\n\n                             HAWK\n               Cameras?\n\n                             ALEX\n               No need.  Guards' station's right\n               there.\n\n     Alex points to an open doorway just down the hall where\n     laughter and shadows emerge.  Hawk tries to flee, but a\n     grinning Alex pulls him toward it.\n\n     Hawk and Alex slide across the wall to a closed room\n     marked POWER, which is right next to the open Guards'\n     Station.  The viewer's viewpoint moves past Hawk and\n     Alex lock-picking into the Power room to...\n\n     INT. THE GUARDS' STATION\n\n     Two Security Guards sit before a console of seven\n     security screens still chuckling over an unheard joke.\n     Wires coming out of the security console run across the\n     floor and through the wall into...\n\n     INT. THE POWER ROOM\n\n     The wires go up to a row of seven humming, RECORD button\n     flashing V.C.R.s.  Hawk and Alex stand before them,\n     sharing a cig.\n\n                             ALEX\n               They record everything their\n               video surveillance takes in...\n\n                             HAWK\n               Yes, master-thief, I can see that.\n               You said something about a plan...\n\n     Alex presses the REWIND buttons on the V.C.R.'s.\n\n                             ALEX\n               Am I boring you, smartass?  Watch.\n               A little rewind and re-wire action\n               and the Guards are going to be\n               watching a rerun and miss out on\n               our exciting episode.\n\n     Alex pulls from a nearby shelf six tapes marked MONDAY.\n\n     INT. SEVENTH FLOOR AUCTION AUDITORIUM--NIGHT\n\n     Moving beneath a video camera and a dazzling Set of\n     Hanging Horse Mobiles, a Heavyset guard, BIG STAN, moseys\n     through the dimly lit main auction house auditorium.  The\n     auditorium chairs are strewn out in the middle beside a\n     turbo Floor Washer.\n\n     Next to a painting of Happy Children Riding Horses at the\n     back of the auditorium stage, Big Stan hefts himself upon\n     a comparatively TINY BLUE CHAIR and begins to tip back\n     and snooze.\n\n     INT. GUARDS' STATION\n\n     The Security Guards look to the seventh floor screen to\n     see an unfolding shot of Big Stan mid-snooze.\n\n                             SECURITY GUARD ONE\n               Check out Big Stan...\n                       (walkie-talkie)\n               Big Stan!\n\n     THE AUCTION AUDITORIUM\n\n     Startled by his walkie-talkie, Big Stan falls back on the\n     little chair, crunching it to the ground.\n\n     THE FIRST FLOOR\n\n     The laughing security guards see the crunch.\n\n     INT. THE POWER ROOM\n\n     Alex puts the last of the Monday tapes into a V.C.R.\n\n                             ALEX\n               You got about five minutes and\n               change.\n\n                             HAWK\n               5:32.  \"Swinging on a Star.\"\n\n                             ALEX\n               You know they invented something\n               while you were inside.  Called a\n               watch.\n\n     A freight elevator pings.  Hawk opens it up as the music\n     of \"Swinging on the Star\" kicks in on the soundtrack.\n\n                             HAWK\n               \"A mule is an animal with long\n               funny ears.\"\n\n                             ALEX\n               \"He kicks up at anything he\n               hears.\n\n     Hawk crams himself into the freight elevator with his\n     Glad bag.  Strenuously upbeat Ray Conniffesque singers\n     continue to sing the song, orchestrally accompanied, when\n     Hawk isn't.\n\n     INT. THE FREIGHT ELEVATOR\n\n     Hawk takes over the song, sardined in the elevator.\n\n                             HAWK\n               \"Or would you rather swing on a\n               star, carry moonbeams home in a\n               jar.\"\n\n     POWER ROOM\n\n     Alex goes up to a Circuit Box and pulls down two large\n     Switches.  The soundtrack singers continue to warble.\n\n     THE GUARDS' STATION\n\n     The lights of the floor wobble and die.  The console\n     screens blink off.  The Security Guards stop laughing.\n\n                             SECURITY GUARD TWO\n               Hell-o.  Check the Power room,\n               bud...\n\n     Security Guard One harrumphs into a standing position...\n\n     POWER ROOM\n\n     Alex speedily hooks and rehooks the backs of the V.C.R.S.\n     They now all have their PLAY buttons lit up.\n\n                             ALEX\n               swing on a star, carry moonbeams...\n\n     OUTSIDE THE POWER ROOM\n\n     Security Guard One fishes for keys to open the power\n     room.  The soundtrack singers whisper as not to give away\n     Alex.\n\n     INSIDE THE POWER ROOM\n\n     Alex briskly slams back up the switches.\n\n     OUTSIDE THE POWER ROOM\n\n     The singers go louder as the lights come back on.\n     Security Guard One harrumphs and heads back to the\n     Guards' Station.\n\n     THE AUCTION AUDITORIUM\n\n     Hawk scrambles out of the freight elevator in the left\n     wall of the Auditorium, glancing to the clock.\n\n                             HAWK\n               \"Or would you rather be a fish?\"\n\n     He pulls out the black canvas bag from his Glad bag and\n     takes out the blueprints.  Hawk follows them toward the\n     painting on-stage.\n\n     THE GUARDS' STATION\n\n     Big Stan comes up from behind his fellow guards, dumping\n     the remains of the chair on the floor.\n\n                             BIG STAN\n                       (moving back off)\n               Very funny.\n\n     The Seventh Floor Screen shows a peaceful auction\n     auditorium.  And the Blue Chair.\n\n     THE AUCTION AUDITORIUM--CAMERA P.O.V.\n\n     From the exact angle, the viewer sees the current state\n     of the room with Hawk flinging off the painting of the\n     horseback children, revealing a safe.  But no Blue chair.\n\n     HAWK\n\n     spits on the rubber cup of an electronic sensor, plugged\n     into a Walkman, and affixes it to the safe above the\n     dial.\n\n                             HAWK\n                       (lyric trouble)\n               \"A fish is annuh nan na nan na\n               brook.\n\n     THE FREIGHT ELEVATOR\n\n     Alex is now packed into the freight elevator.\n\n                             ALEX\n               \"He can't write his name or read\n               a book.  To fool people is his\n               only thought.\"\n\n     THE AUCTION AUDITORIUM\n\n                             HAWK\n                       (remembering)\n               \"And though he's slippery, he\n               still gets caught.\"\n\n     Wearing headphones, Hawk cranks up the Walkman and spins\n     the dial.  The CLICKS from the dial are so loud he winces\n     and turns down the volume.  Then there's a CLUNK.\n\n     THE GUARDS' STATION\n\n     With the soundtrack singers taking over, Guard Two sips\n     a cup of coffee.  He doesn't swallow.\n\n     His sights zero in on the Blue Chair on the seventh\n     screen.  He looks to the chair remains, then back again.\n\n                             SECURITY GUARD TWO\n               Uh, Jerry.  I'm looking at the\n               seventh floor and I don't know\n               how to say this, I see the Blue\n               Chair.\n\n                             SECURITY GUARD ONE\n               What the... You think that's weird,\n               check out screen two.....\n\n     Screen Two shows THE TWO SECURITY GUARDS THEMSELVES\n     hatching open some on-duty beers, going down a hall.\n     Guard Two looks to the empties atop the console....\n\n                             SECURITY GUARD TWO\n               Somebody rewired the recorders!\n\n     AUCTION AUDITORIUM\n\n     Hawk ditches his accessories and swings the safe door\n     open.\n\n     Inside the safe, along with the \"holy\" Da Vinci music\n     cue, is the clay equestrian model from Leonardo's\n     worktable.\n\n     Hawk belts out as he put it in the black canvas bag.\n\n                             HAWK\n               \"And all the monkeys aren't in\n               the zoo.\"\n\n                             ALEX (V.O.)\n               \"Every day you meet quite a few.\"\n\n     Alex gives Hawk a congratulatory pat.\n\n                             HAWK AND ALEX\n               \"So you see it's all up to you.\n               You can be better than you are.\n               You could be swinging on a star.\"\n\n     THE AUCTION ROOM\n\n     BIG STAN reconnects the wires of the seventh V.C.R.\n\n     THE GUARDS' STATION\n\n     Suddenly, on the seventh screen, the image and voices\n     of Hawk and Alex in-process comes on.\n\n                             SECURITY GUARD ONE\n               Shit, let's roll!\n\n     THE AUCTION AUDITORIUM\n\n     Hawk puts the painting back up, but stops to stare at the\n     playful children.\n\n                             ALEX\n               The song's over!  Come on!\n               \"You could be swinging on a star.\"\n\n                             HAWK\n               What am I doing here?  There are\n               so many things I wanna do that\n               aren't this.  Paint a lighthouse.\n               Kiss a woman in Italy.\n\n                             ALEX\n                       (more frantically)\n               \"You could be swinging on a star.\"\n\n                             HAWK\n               Paint a woman in a lighthou--I\n               don't want to steal a horse.\n               Life is...\n\n     Hawk's soliloquy is cut short as Security Guards One and\n     Two crash into the auction auditorium.\n\n                             ALEX\n                       (DEADPAN)\n               \"You could be swinging on a star.\"\n               You couldn't have waited to see\n               a psychiatrist.  No, you had...\n\n     Alex whips his chair at the floor washer, tipping it\n     forward and causing its electrical cord to pull up and\n     trip the Guards into a bellyflop.\n\n     Hawk bolts right at the bustling up guards and locks them\n     into Alex's thumbcuffs.  He then limbos under their\n     connected arms and springs over the outstretched washer\n     cord.  The Security Guards clumsily turn and re-trip\n     themselves.\n\n                             HAWK\n               Let's go down the freight elevator.\n\n     Big Stan suddenly unhatches from the freight elevator.\n\n                             ALEX\n               Keep those ideas coming.\n\n     Hawk and Alex run toward an office located at the right\n     wall.  They both do a Gene-Kellyesque-chair-tip-over\n     before simultaneously bashing through the office door.\n\n     INT. DARKENED AUCTION AUDITORIUM OFFICE\n\n     Hawk and Alex stop in the office to painfully laugh and\n     rub their funny bones.  Alex stops laughing.\n\n                             ALEX\n               I'm not as unpleasantly plump as\n               that Guard am I.\n\n     Big Stan fires off a warning shot.  Hawk and Alex quickly\n     tear up a window.\n\n     Moving out on to a ledge, Hawk and Alex look down to the\n     huge auction house awning and trade gulps.\n\n     Big Stan wobbles into the mouth of the office door.\n\n                             HAWK AND ALEX\n               I got a bad feeling....\n\n                             HAWK\n               I can't even swim.\n\n                             ALEX\n               Hell, the fall'll probably kill\n               ya...\n\n     Big Stan raises his gun.\n\n     Hawk and Alex jump and AAAGH down the face of the\n     building....\n\n     Closer and closer to the awning....\n\n     The viewer focuses upon Hawk as he free-falls......\n\n                                                CUT TO:\n\n     RIGHT INTO A LAZ-Y-BOY CHAIR\n\n     Hawk continues his \"fall\" into a ridiculously huge\n     reclining chair.  The foot stand swooshes out with a\n     thump.  A HAND pulls away the canvas bag with a cackle.\n\n     INT. GATES APARTMENT--LATE NIGHT\n\n     Hawk's weirdly reclining viewpoint makes Gates and his\n     pad more grotesque than they are (No small feat.)\n     A sub-Radio Shack stereo coughs next to a scary punch\n     bowl of red, margarita-like substance, beneath the\n     instantly recognizable framed picture of Those Dogs\n     Playing Poker, all atop a Jungle Shag.\n\n     Gates, in shorts and a Hawaiian shirt-over-a-KEEP ON\n     TRUCKIN'-T-shirt, raises a loud tumbler with one hand,\n     the black canvas bag in the other.\n\n                             GATES\n               Hudson Hawkins gets the chair of\n               honor.  How about a Gates-arita?\n                       (toward bowl)\n               I used real hot dogs.\n\n                             HAWK\n               Weren't you the bartender at\n               Jonestown?\n\n     Suddenly a light is turned on in the corner, revealing a\n     seated Cesar and Antony Mario, the latter taking a painful\n     Gatesirita sip.\n\n                             CESAR\n               Good job, not pretty, but good.\n\n                             HAWK\n               Ah, the mafia, the cops; do I know\n               how to party or what?\n\n     Gates pulls out the horse and looks at it.\n\n                             GATES\n               All this trouble for a horsey.\n               I may not know art, but I know\n               what I like.\n\n                             HAWK\n                       (to Dog picture)\n               You certainly do.\n\n                             GATES\n               So when's that Sebastian-Cabot-\n               Buckingham-Palace-looking-\n               Butlerhead getting here?\n\n                             ALFRED\n               Any minute now, dear Mr. Gates.\n\n     A malevolently snobbish British Butler, ALFRED, enters in\n     distaste.  He makes a stressful glance to three VANITY\n     FAIRS on a coffeetable that has a photo of a MAGNETIC\n     HUSBAND-WIFE-DOG COMBO with the caption: MAYFLOWER POWER.\n     Hawk notices this.\n\n                             GATES\n               Oh, sorry Jeeves.  Gates-arita?\n\n                             ALFRED\n               I'll pass.  May I?\n\n     Alfred takes the equestrian model and with a jeweler's\n     loupe, studies it carefully.\n\n                             ALFRED\n               Ah, such craftsmanship.  Leonardo\n               Da Vinci's last commission for the\n               Duke of Milan.  Irreplaceable.\n\n                             GATES\n               Hey, Mr. French, I'm delirious\n               for you.  Now where's my cut?\n\n     With dignity, Alfred SMASHES the ancient horse over\n     Gates's head.  Alfred rummages through the debris\n     REVEALING a perversely labyrinthine CRYSTAL PIECE.\n     (recognizable from Da Vinci's workshop).\n\n                             GATES\n               You son-of-a......I don't believe\n               this!  You come into my house!\n\n     Alfred pockets the goodies, but not before Hawk can give\n     them a confused peruse.\n\n                             GATES\n               I ought to take Big Ben and shove\n               it up your limey blimey bunghole!\n\n     A blade slides down Alfred's arm.  Half-yawning, he...\n\n     ALFRED'S 180 DEGREE POV\n\n     spins before Gates and the bystanders behind him.\n     THE BLADE goes back up Alfred's arm.\n\n     The room's only sound is the stereo's inappropriate\n     music.  Gates shrugs but his voice is off.\n\n                             GATES\n               Like I said.  Where's my cu-u-...\n\n     Suddenly a line across Gates's neck turns red and blood\n     begins to gush like a tourist attraction.  Gates crashes\n     down upon the table holding the punch bowl and the stereo,\n     sending it to the ground, cutting off the music.  The Dog\n     Poker picture falls atop the carnage like a lid.\n\n     Blown away, Hawk tries to wiggle his way out of the\n     recliner.  Alfred pats some stain remover on the blood\n     on his shirt.\n\n                             ALFRED\n               So much for his \"cut.\"\n                       (post-chortle)\n               Excuse my dry British humor.\n\n                             CESAR\n                       (rising)\n               Lovely work, Alfred, taking the\n               Concorde back?\n\n                             ALFRED\n               Indeed I am, Mr. Mario.  I'm\n               really racking up those frequent\n               flyer points...\n\n                             HAWK\n               I hate to interrrupt you two\n               lovebirds...\n\n                             ANTONY\n               You know, I think Gates promised\n               Hawk a cut, too....\n\n     The Mario brothers cackle out.  Hawk tries to flail out\n     of his chair.  Alfred turns to him and flicks up his arm.\n     Hawk sees his life pass before his eyes until he realizes\n     Alfred is merely pulling him up off the chair.\n\n                             ALFRED\n               Ta ta, Hudson Hawk.\n\n                             HAWK\n                       (breathless)\n               Too-do-loo, babe.\n\n     INT. ALEX'S RESTAURANT--DAWN\n\n     Hawk bursts into the bar.  Alex sits on a stool, reading\n     the paper.\n\n                             ALEX\n               Did I miss anything?\n\n                             HAWK\n               Oh, not much.  Gates just had his\n               tonsils taken out.  The hard way.\n         \n                             ALEX\n               Geez, Gates was killed.  Who do we\n               send the thank you note to?\n         \n     Hawk does a combat jump over the bar and begins to fiddle\n     with the cappuccino machine.\n\n                             HAWK\n               The Butler did it.  Guy was a cross\n               between Alistair Cook and a Cuisinart.\n               Dude took Mr. Ed and humptied\n               dumptied it over Gates's head.  He\n               said it was made by, get this,\n               Leonardo..\n\n                             ALEX\n                       (professorial)\n               Ah yes, a rare Renaissance piece.\n               Da Vinci's \"Sforza,\" an equestrian\n               model of a never executed statue.\n               I consider it to be the prize of\n               tonight's auction of objets\n               d'equestrian.  Horse things.\n\n     The cappuccino machine sparks.  A perplexed Hawk takes\n     a couple extra seconds to back off.\n\n                             HAWK\n               Okay, you got me, Mr. PBS.\n\n                             ALEX\n                       (holding up newspaper)\n               Morning edition.  Seems two thieves\n               \"attempted\" to steal it last night,\n               but thanks to three \"courageous\"\n               guards, it will be ready for tonight.\n\n                             HAWK\n               \"Attempted.\"  At-tempt-ted!  I'm\n               not happy about having to steal\n               that horse, but I do have my\n               pride.  Face it, when it comes to\n               burglary, and sex, I....\n\n     Hawk takes the newspaper.  There is a picture of the\n     Three Security Guards in a cheery pose behind the\n     \"Sforza.\"  Hawk squints to see that Security Guards One\n     and Two are still wearing the thumbcuffs.\n\n                             HAWK\n               Boing.  Uh, this I don t understand...\n\n                             ALEX\n               Why try?\n\n                             HAWK\n                       (hurdling the bar)\n               Because I'm tired of not\n               understanding things.  Cops,\n               Mafia, and butlers forcing me to\n               bust my ass to steal something,\n               which it turns out I really didn't\n               steal--it's fucked up.\n\n                             ALEX\n                       (pulling back newspaper)\n               You re not thinking of going to...\n\n                             HAWK\n               Alex, my man, it's time to play a\n               little offense.  Where's your tux?\n\n     INT. RUTHERFORD'S AUCTION HOUSE--NIGHT\n\n     Dressed in a not-quite-fitting but suave tuxedo, Hawk\n     enters the now well-lit auction house auditorium (chairs\n     all set out).  Bored WORKMEN in coveralls lug equestrian\n     items on to a podium from the familiar freight elevator.\n\n                             ECCENTRIC BALD AUCTIONEER\n               ...fan-taas-tic example of\n               Florentine marble... Who will start\n               at 160,000...160,000......180,000.\n\n     Someone raises their paddle as Hawk passes beneath the\n     hanging horses and finds an aisle seat near the stage.\n     Hawk scans everyone in the room before coming to the one\n     seated next to him, AN ENCHANTINGLY BEAUTIFUL WOMAN.\n\n                             HAWK\n               All these years of attending auctions,\n               I still get goosebumps.  The paintings,\n               the sculptures....the things that\n               aren't really paintings or sculptures...\n\n                             THE WOMAN\n               .... the pretentious vultures who\n               don't even look up from their\n               calculators to see what they're\n               buying.  Now that gives me\n               goosebumps.  Auctions are\n               disgusting.\n\n                             HAWK\n               I couldn't agree more.  Savages.\n\n     The Woman laughs at his gear switch then catches herself.\n\n                             ECCENTRIC BALD AUCTIONEER\n               Lot Fifteen, an equestrian sconce\n               attributed to the Cellini school..\n\n     AUCTION ENTRANCE\n\n     Big Stan, the hefty guard from the heist, enters the area\n     wearing a blue ribbon.\n\n     AUCTION AREA\n\n     Big Stan is walking in back of the seated bidders:  An\n     oblivious Hawk in the foreground starts to scan VARIED\n     BIDDER-TYPES, raising their paddles to babble out dollar\n     figures; a GAUDY ROCK STAR and his GLOOMY-CHIC ENTOURAGE,\n     A KING FAROUK-TYPE with a BORED TEENAGE AMERICAN HOOKER,\n     and a scary NORDIC PRINCESS in a monocle and a tiara.\n\n     THREE STANDING ASSISTANTS frantically man a table of\n     phones set up down before the stage.  One raises his\n     arm.\n\n                             ECCENTRIC BALD AUCTIONEER\n               Sold!  To the caller from\n               Newfoundland.\n\n     A STYLISH FEMALE ASSISTANT takes out an impressive replica\n     of the \"Sforza\" from the safe behind the podium and brings\n     it to the Auctioneer.  The crowd a-a-hs... Hawk laughs\n     and shakes his head.\n\n                             ECCENTRIC BALD AUTIONEER\n               And finally, Lot number 17,\n               thought to be lost in the war,\n               and again last night, the Da\n               Vinci \"Sforza,\" the jewel of the\n               sale.  Fan-taas-tic...\n\n                             HAWK\n                       (re: Auctioneer)\n               Is looking like a constipated\n               warthog a prerequisite to getting\n               a job in the art world?\n\n                             ECCENTRIC BALD AUCTIONEER\n               There have naturally been questions\n               of its authenticity, so to verify\n               we have Doctor Anna Baragli of the\n               Vatican.  Doc?\n\n                             ANNA\n                       (rising, to Hawk)\n               Some of us warthogs are more\n               constipated than others.\n\n     Hawk uneasily laughs as Anna makes her way up the stage\n     and pulls out a large magnifying glass.  A look of\n     distress passes over her face.  Hawk closes his eyes in\n     anticipation.\n\n                             HAWK\n               Oh, the shit is going to hit the\n               fa--\n\n                             ANNA\n                       (suddenly serene)\n               Fantastic.  Perfection.  The\n               Vatican extends its jealousy to\n               the lucky bidder.\n\n                             ECCENTRIC BALD AUCTIONEER\n               We'll begin the bidding at 82.5\n               million dollars.  To you, sir.\n               Eighty-three, Ninety--your bid,\n               madame--Ninety point five.....\n\n     Hawk opens his eyes in confusion.  He scans Anna coming\n     off the stage, gliding toward the phone table.  Hawk\n     floats into the aisle, curling toward her as she picks\n     up a phone and murmurs into it.\n\n                             DARWIN MAYFLOWER\n               lOO million clams, Francesco!\n\n     The crowd orgasms as Vanity Fair cover boy, DARWIN\n     MAYFLOWER works the aisle, playfully mussing up the\n     appreciative, tiaraed Princess's hair, giddily high-\n     fiving the Rock Star, and sloppily frenching the Hooker.\n\n                             ECCENTRIC BALD AUCTIONEER\n               100 million dollars to Mr. Darwin\n               Mayflower.\n\n     Hawk turns to gaze at the enigmatically familiar figure.\n     Anna looks up from the phone to do the same.  She\n     swerves her attention to the back-turned Hawk.\n\n     Darwin moves to one of two reserved empty seats as his\n     wife, Minerva, makes her entrance par excellahnce.  She is\n     outrageously dressed with a mammoth Tiffany watch that\n     extends from her wrist down to, acting as a leash,\n     her obnoxious little dog, BUNNY.\n\n                             MINERVA\n               Francesco, 100 million and one.\n\n     Darwin, to the crowd's delight, holds his struck heart.\n\n                             DARWIN\n               Outbid by my own wench, quelle\n               bummere.\n\n                             MINERVA\n               Poor baby..... Here, Bunny.\n\n                             ECCENTRIC BALD AUCTIONEER\n               Fan-taas-tic, the bid is at 100\n               million and one dollars.\n\n     Commencing a slow motion sequence, Big Stan comes out\n     of the nearby office, zipping up his fly.  He immedi-\n     ately scopes Hawk in the space before the stage.\n\n     The Mayflowers lower themselves into their seats with\n     devoured canary smiles.\n\n                             ECCENTRIC BALD AUCTIONEER\n               Go-ing!\n\n     Big Stan pulls out his gun, untheatrically, as not to\n     cause a scene.  Anna sees this and follows Big Stan's\n     eyeline to Hawk.\n\n     Hawk turns to re-pursue but stops dead at the sight of\n     the gloating Big Stan.\n\n                             ECCENTRIC BALD AUCTIONEER\n               Go-ing!\n\n     Big Stan launches a gallop toward Hawk, who spins and\n     veers back round up the aisle.\n\n     The Mayflowers zero their sights on the activity.\n\n                             ECCENTRIC BALD AUCTIONEER\n               Gone!\n\n     The gavel comes down in super slow-motion.\n\n     Anna's leg pokes out of the aisle, tripping the guard.\n\n     Hawk brakes at the end of the Mayflower's row and smiles\n     in relief, casually turning to Darwin and Minerva.\n\n     The gavel continues to come down in super slow-motion.\n\n     Both Darwin and Minerva Mayflower suddenly DUCK DOWN.\n\n     Smile vanishing, Hawk spins toward the stage.\n\n     The Gavel hits.\n\n     Breaking out of slow-motion into wide-angle, the entire\n     podium explodes sending debris, equestrian pieces, and\n     eccentric bald pieces searing into the screaming,\n     battered crowd.\n\n     Knocked off his feet, Hawk gropes into a standing\n     position.  He sees the Mayflowers make a smooth exit.\n     He starts to give chase until he sees a battered Anna\n     rising from the ground.\n\n     A hanging white Tri-Star Pegasus, cracks from the\n     damaged ceiling and swooshes down towards Anna.\n\n     Hawk bolts upon some auction chairs and makes a flying\n     leap.  He slams Anna out of the Pegasus's pulverizing\n     Path.  They weary up off the ground and move down the\n     aisle, calm in a storm of packed art patrons.\n\n                             ANNA\n               My God, that was bold of you,\n               you didn't have to do that...\n\n                             HAWK\n               Forget about it--it was nothing--\n               anybody would have done the same\n               thing--It's an impulse...\n\n                             ANNA\n               No, I meant you didn't have to\n               tackle me and rip my dress.  A\n               polite push, perhaps?  A clear\n               shout of \"watch out, Anna\"\n               would have done nicely...\n\n                             HAWK\n               Excuse me, Milady.  I would have\n               flown over and carried you up to\n               a pink cloud, but I left my cape\n               at the cleaners.\n\n     Anna touches Hawk's lips and laughs.\n\n                             ANNA\n                       (\"Hey, I was kidding\")\n               Thanks tough guy, thanks a lot.\n               Why was the guard chasing you?\n\n                             HAWK\n                       (Serious answer?\n                        Na-a-h?)\n               Because Danger, Doc, is my middle...\n\n     Before Hawk can finish, a hanging horse out of nowhere\n     hammers him into the ground and the viewer into\n     darkness.\n\n     FADE IN:\n\n     INT. VAN-TYPE AMBULANCE--NIGHT\n\n     Hawk stirs into consciousness strapped on an elevated\n     gurney.\n\n                             HAWK\n               Saint Pete, hey I know, the whole\n               cat burglar thing, it sounds bad,\n               but I'll take the worst cloud you\n               got...\n\n     Hawk's eyes focus.  The Mario Brothers hover over him.\n\n                             CESAR\n               News flash.  You're not in\n               heaven.  Yet.  30 seconds and\n               counting, if you know what I'm\n               saying.  Couldn't just play along,\n               could you...\n\n     EXT. THE BROOKLYN BRIDGE--NIGHT\n\n     The ambulance careens onto the Brooklyn Bridge.\n\n     INT. INSIDE THE AMBULANCE\n\n     Antony raises up a mammoth gun.\n\n                             HAWK\n               Pretty class way of covering your\n               tracks.  I think that auctioneer\n               landed at La Guardia.\n\n                             ANTONY\n               Subtlety was never one of our\n               strong points.\n\n                             HAWK\n               Neither's flossing.\n\n     A confused Antony touches his teeth with his gun hand.\n     Hawk escapes from one of his straps and launces a nearby\n     trayful of syringes into Antony's face where they ghoul-\n     ishly quiver.  Antony fires a wild shot, shattering the\n     partition.\n\n     FRONT SEAT OF THE AMBULANCE\n\n     The Scarfaced Bodyguard/Driver, now in paramedic white,\n     freaks at the starred windshield.\n\n     THE BROOKLYN BRIDGE\n\n     The ambulance bumper-pools off some innocent cars.\n\n     INSIDE THE AMBULANCE\n\n     Hawk frantically tries to undo his other strap but a\n     howling Cesar, side-stepping his vibrating-on-the-floor\n     brother, latches onto the back of the gurney and wrenches\n     it backward.\n\n     OUTSIDE BACK OF AMBULANCE\n\n     The elevated gurney blasts out the back with a now\n     unstrapped but terrified Hawk whoa-a-ing atop it.\n\n     The gurney wheels hit the road, sparking.\n\n     A sheet from the gurney, caught on the door, yanks TAUGHT\n     --Hawk is \"water skiing\" on his stomach atop the elevated\n     gurney!\n\n     Screeching cars are weirded out by the new vehicle on the\n     road.\n\n     THE GURNEY\n\n     Battered by wind and fear, Hawk clutches to the gurney\n     and the sheet with a grit teeth stoneface.\n\n     The sheet is torn from the gurney sending it rocketing\n     off to the side on its own crazed volition.\n\n     Hawk skis toward a TOLL BOOTH WITH A LARGE GATE-ARM.\n\n                             HAWK\n               Life don't get much better than\n               this.\n\n     He then sees he's heading toward an EXACT CHANGE lane.\n\n     Whizzing wildly forward on the gurney, Hawk scrambles\n     into his pocket and wiggles out some change.  He fran-\n     tically winnows out some pennies and then maniacally\n     FLINGS the change from twenty feet away.\n\n     TOLL BOOTH\n\n     The change ker-chunks into the basket and Hawk and the\n     gurney JUST BARELY streak underneath the rising Gate-arm.\n\n     EXT. THE AMBULANCE\n\n     CRASHES through a gate-arm of another lane.  Hawk and the\n     still-wildly whooshing gurney cut it off.\n\n     FRONT SEAT OF THE AMBULANCE\n\n     Cesar pops his head through the partition.\n\n                             CESAR\n               Make him into Roadkill!\n\n     Antony, seemingly oblivious to the syringes porcupined in\n     his skull, pokes his head next to Cesar's.\n\n                             ANTONY\n               Yeah, run him down!\n\n     Cesar and the Bodyguard/Driver turn to Antony and scream,\n     then all three look out the windshield and scream.\n\n     THE AMBULANCE\n\n     jackknifes over a stopped car and somersaults into a\n     fiery ball.\n\n     In the foreground, Hawk's gurney coasts down\n\n     A PEACEFUL OFF-ROAD\n\n     Hawk, with an unchanged expression of pure white knuckle\n     fear, comes to a tranquil gurney-wheels-gently-squeaking\n     stop.\n\n     Lit by the flames of the ambulance crash, a sneering\n     young man in wire rim glasses emerges from the darkness,\n     carrying a steel suitcase.  He kneels before Hawk and\n     opens the suitcase revealing a complex computer appara-\n     tus.  He begins mumbling into a cellular phone.\n\n     A malevolent, SILENT DEADPAN WRAITH passes him and\n     approaches Hawk.  Both men are dressed in outfits that\n     seem to be a melange of fascist uniform and haute\n     couture.\n\n     On the fingers of one Wraith hand is carved the word\n     HATE.  On the other hand is the word FROG.  The Frog Hand\n     hands a befuddled Hawk a card.  It reads: MY NAME IS KIT\n     KAT AND THIS IS NOT A DREAM.\n\n     Hawk looks up with a \"huh\" expression as Kit Kat chops\n     his neck, knocking him off the gurney.\n\n     The sneering computer guy hangs up his phone and pulls\n     forward a small cattle prod from his apparatus.\n\n                             HAWK\n               This is the worst night...\n\n                             SNICKERS\n               When it rains, it pours.  Name's\n               Snickers.  The plane leaves in 40.\n\n     Snickers zaps Hawk in the leg with his device.  Hawk a-\n     a-ghs into a kneeling position.  Snickers returns to his\n     suitcase and is passed by a PLEASANT YOUNG BLACK WOMAN in\n     the \"outfit.\"\n\n                             ALMOND JOY\n               Almond Joy.  I know, pretty silly.\n               But it's better than when we first\n               started out, our code names were\n               Diseases.  You don't know what\n               it's like being called Clymidia\n               for a year.\n                       (walking off)\n               Whoops, forgot....\n\n     She deftly kicks Hawk across the face.  Hawk angrily\n     bounds back up until he sees the BIGGEST MEMBER OF THE\n     GROUP Fe-Fi-Fo-Fum his way toward them.  Suddenly, the\n     Giant clumsily trips over Snickers' suitcase apparatus\n     and ram-collapses into Hawk and the gurney.  Laying atop\n     Hawk, Butterfinger goofily speaks...\n\n                             BUTTERFINGER\n               My name's Butterfinger.\n\n                             HAWK\n               No shit.\n\n     The mysterious group parts to reveal a much more mature\n     and cynically subdued man dressed in big lapels and a hat\n     that screams Old Time CIA.  His name will be GEORGE\n     KAPLAN.\n\n                             KAPLAN\n               Don't you just hate kids...\n\n                             ALMOND JOY\n               George, you promised.  No Old CIA/\n               New CIA jokes...\n\n                             KAPLAN\n               I call them the MTV.I.A.  Punks\n               think Bay of Pigs is an herbal tea.\n               They think the Cold War involves\n               penguins and...\n\n                             HAWK\n               Don't I know you...\n\n                             KAPLAN\n               You just might.  I'm the guy who\n               tricked you into robbing a\n               government installation and then\n               had you sent to prison for it.  At\n               the time, I was bald with a beard,\n               no moustache, and I had a different\n               nose, so if you don't recognize me,\n               I won't be offended.\n\n                             HAWK\n               Bastard, you're going to need\n               another nose!\n\n     Hawk explodes upward.  Everyone but cool Kaplan draws a\n     gun.\n\n                             HAWK\n               But I'm not the type of guy to\n               hold a grudge.\n\n                             KAPLAN\n               I used you as a diversion.  while\n               you were getting captured upstairs,\n               I was shredding documents in the\n               basement.  Deep down, I guess I\n               was just jealous.  You were one\n               incredible thief...\n\n                             HAWK\n               To what do I owe the dishonor of a\n               reunion, you centrally intelligent\n               scumsicle.\n\n     As Kaplan converses, Snickers and Butterfinger bring out\n     a mammoth empty suitcase and open it behind Hawk.\n\n                             KAPLAN\n               I Want to make things up to you.\n               That's why I got you this gig,\n               doll.  Hawk, my name's George\n               Kaplan and to quote the late,\n               great Karen Carpenter, \"We've only\n               just begun.\"\n\n                             HAWK\n               Three minutes, twenty-three\n               seconds.  If you think I'm doing\n               another...\n\n                             KAPLAN\n               Hush.  My employer wants a meeting.\n\n                             HAWK\n               Employer?  The president?\n\n                             KAPLAN\n               No, somebody powerful.  Oh.  Look.\n               what's that up there?\n\n                             HAWK\n               I'm supposed to fall for that?\n\n                             KAPLAN\n               Shucks.  Guess not.\n\n     Kaplan savagely point-blank punches Hawk in the face,\n     knocking him out cold and into the mammoth suitcase.\n     Snickers slams it shut revealing a KENNEDY INTERNATIONAL\n     sticker.\n\n     INT. MYSTERIOUS BARE ROOM--DAY\n\n     Hawk slowly awakens on an exotic couch.  He has been put\n     in an aggressively fashionable Italian outfit.  He eyes\n     and touches his new duds with complete bafflement.  He\n     then stumbles into a standing position to, mouth gaping,\n     take in a wondrous 360 degree view of Rome, Italy as \"O\n     Solo Mio\" blares on the soundtrack.\n\n                             HAWK\n               No.  Way.\n\n     Hawk's spinning view and the music on the soundtrack slam\n     to a halt as he zeroes in on the sight of Scary Butler\n     Alfred elegantly reaching the top of the staircase.\n\n                             ALFRED\n               Welcome to Rome, sir.\n\n                             HAWK\n               Yes way.\n\n     EXT. OUTSIDE INTERESTING BUILDING--DAY\n\n     Alfred opens the back door of an omnipotent, Mayflower-\n     logoed LIMOUSINE.  The car moves off as Hawk slides in...\n\n     INT. THE BACK SEAT OF THE MAX-TECH LIMOUSINE\n\n     facing Darwin Mayflower who is blustering into the\n     cellular.\n\n     While he talks, Darwin shakes Hawk's bewildered hand,\n     then holding up one finger in a \"be with you in a sec\"\n     facial move.\n\n                             DARWIN\n               For those kind of wages, I could\n               have built the factory in America!\n               They're Vietnamese, can't we just\n               give them more Bart Simpson shirts?\n               I hear depressing news like this\n               and I want to commit genocide!\n                       (slamming phone)\n               Alfred, hold my calls.  So, Hawk!\n               The Hawkster!  What do you think\n               of the vehicle?\n\n                             HAWK\n               You could host American Bandstand\n               in here.  Why did you duck at the\n               auction, asshole?\n\n                             DARWIN\n               Because I didn't want to get hurt,\n               taterhead.\n\n     A FAX MACHINE comes to life as Darwin babbles.\n\n                             DARWIN\n               What can I tell you, I'm the\n               villain.  Initially it was a\n               priority to keep a lot of buffers\n               between you and me, but since most\n               of them are dead now, I thought\n               what the heck.  Hawk, you come\n               highly recommended.  I would have\n               done some things differently at\n               the auction house, but hey, I want\n               to be in business with you.\n\n     Darwin scans the Fax message with annoyance, and then\n     shoves it into a violent paper shredder.\n\n     OUTSIDE THE LIMO SHREDDER\n\n     Shredded paper litters out of a vent on the outside door.\n\n     INSIDE THE LIMOUSINE\n\n     A simmering Hawk tries to explode but the phone rings.\n\n                             HAWK\n               My life is not some deal.  I...\n\n                             ALFRED (O.S.)\n               It's Boston, Mr. Mayflower.\n\n                             DARWIN\n               I'm sorry, I have to take this.\n               Those are valid points though...\n\n     Darwin picks up the phone and goes Mr. Hyde, while giving\n     Hawk \"Can you believe this guy\"-type gestures.\n\n                             DARWIN\n               You better have a good excuse...\n               You better have a better excuse!\n               You are so weak!  I'm only\n               thankful your ancestors didn't\n               settle America or else my name\n               would be Running Brave or Vomiting\n               Antelope...Really.  Well, listen\n               close, babe.\n\n     Darwin holds the phone over a 50 cent piece-size siren in\n     his armrest.  Darwin presses a button and a PIERCING\n     NOISE fills the car as it comes to a stop.\n\n                             DARWIN\n               Shall we?\n\n     Darwin bolts out.  Hawk hangs back, waiting for Rod\n     Serling to explain things, then bolts out too.\n\n     EXT. E.U.R. DISTRICT BUILDING--DAY\n\n     Hawk and Darwin head up the steps of an overpowering\n     fascistly marble superstructure.  Alfred brings up the\n     rear.\n\n                             DARWIN\n               So Hawkasaurus, I won't mince\n               words...\n\n                             HAWK\n               Whatever.  You own Boardwalk, you\n               own Park Place, you own the four\n               railroads.  You think you're God.\n               For all I know, you're probably\n               right.  I just wanted to have a\n               damn cappuccino, maybe play some\n               Nintendo after I find out what it\n               is.  Man, why didn't you just buy\n               the horse?  What am I saying, you\n               did buy it...\n\n                             DARWIN\n               Oh... Let's see.  There are\n               organizations that think we wanted\n               the \"Sforza\" for reasons other\n               than putting it in the Da Vinci\n               museum we're building in Vinci.\n               Hopefully, these organizations\n               think our plan has been ruined\n               with the explosion of our replica.\n               If I seem vague, grand.  We want a\n               low profile on this, that's why I\n               got Kaplan and the Candy bars\n               involved.  I helped George help\n               the Mario Brothers and Gates help\n               get you out....\n\n                             HAWK\n               If you're pausing for a \"thank you,\"\n               give it up.  So boss, you going to\n               tell me what the crystal piece\n               inside the pony means?\n\n                             DARWIN\n               Way to go, Alfie!  How many people\n               did you break that thing in front\n               of.   Good help's hard to find.\n\n                             HAWK\n               I guess that's a no.\n\n     INT. MASSIVE CONFERENCE ROOM--DAY\n\n     A mind-blowingly pretentious painting of Darwin, Minerva,\n     and Bunny hangs above a mammoth M-shaped conference table.\n\n     Lying atop the table in heels, shades, and a heart-\n     stopping dark outfit is Minerva.  NASTY Metal riffs semi-\n     audibly spew from a headset she wears.\n\n     Surrounding the table is a VARIED GROUP OF OLD MONEY AND\n     NEW MONEY BOARD MEMBERS ranging from a nine year old\n     INDIAN PRINCE to a SWEET ELDERLY AMERICAN WOMAN.  They\n     converse to the person at their side in businesslike\n     tones, oblivious to Minerva.\n\n                             DARWIN\n               Ladies and gentlemen of the board...\n\n     The board members go into tableau silence.  Minerva con-\n     tinues a brief sing-a-long before Darwin scolds...\n\n                             DARWIN\n               And Min-er-va.  Let's give it up\n               for Hudson Hawk.\n\n     The board applauds as Alfred pushes Hawk inside.\n\n                             MINERVA\n               Hello......Bunny, Ball-Ball!\n\n     Minerva lobs a ball in the air.  Bunny, the annoying dog,\n     scurries beside Hawk to catch it.\n\n     Moving down toward the other end of the table, Hawk takes\n     in the surreal surroundings with battle fatigue.  He sees\n     ONE BOARD MEMBER take a luxurious sip of cappuccino.\n     Minerva paces up upon the table.\n\n                             DARWIN\n               Hawkmeister, we got you clothes,\n               great hotel, and a 250,000 lira\n               per diem.\n\n                             MINERVA\n               That's two hundred dollars a day?\n               So he can get a hooker and some\n               tequila.  Veto, Darwin.\n\n                             HAWK\n               Guess I know who wears the penis\n               in this family.\n\n                             MINERVA\n                       (jumping off table)\n               For God's sake, chain this\n               convict.\n\n     With a yawn, Alfred pulls out a pair of state-of-the-art\n     handcuffs.\n\n                             HAWK\n               Alfred, you're a very polite\n               psychopath, but if you...\n\n     Hawk kicks out at Alfred, who nimbly moves slightly and\n     gives a pummel to Hawk's body somersaulting him over the\n     edge of the table, into an empty seat.\n\n     The Board Members politely applaud.  Alfred pulls Hawk's\n     hands around his back and cuffs him.  Bunny intensely\n     sniffs his crotch.\n\n                             MINERVA\n               We want Da Vinci's sketchbook,\n               what do they call it, the Codex.\n\n                             DARWIN\n               Listen Hawk, this might be hard to\n               believe, but I'm a regular joe.  I\n               just want to be happy and happiness\n               comes from the achieving of goals.\n               It's just when you make your first\n               billion by the age of 19, it's\n               hard to keep coming up with new\n               ones.  But now finally I got my\n               new goal.  World domination.  With\n               your help...Bunny....quit that!\n\n                             MINERVA\n               Bunny, ball-ball!  Bad bunny!\n\n                             HAWK\n               Think he's already got today's\n               ball-balls.  Five more minutes\n               please, it's been so long...\n\n     Minerva yanks away the yelping dog.\n\n                             HAWK\n               Anybody have a cigarette?  But\n               seriously, do me a favor and\n               Concorde me back to prison.  I\n               don't care anymore.  I hope you\n               have the receipts for the threads.\n\n                             MINERVA\n               You go back, you won't be alone.\n               You'll have a diabetic barkeep\n               cellmate.  You're still young\n               enough to have fun shanking child\n               molesters for a pack of smokes,\n               but \"Alex\" will go in knowing that\n               the next time he gets out it'll be\n               to attend his own funeral.\n               Depressing.\n\n                             HAWK\n               You wouldn't risk the dime to call\n               the police.  You have no proof.\n\n                             DARWIN\n               Ah, the magic word...\n\n     Alfred plants a slide machine on the table and Darwin\n     starts clicking gorgeous images of Hawk and Alex robbing\n     the auction house, on a bare wall.\n\n     The Board members gush.  The Elderly Woman gives a\n     thumbs-up.\n\n                             DARWIN\n               It's veja du, Hawkhead.  Something\n               you wish never happened.  We shot\n               the entire operation with hidden\n               cameras behind the hidden cameras.\n               Hired the guy who did the last\n               Sports Illustrated Swimsuit issue.\n               Excellent work... whoops, damn\n               Fotomat assholes...\n\n     A slide hits the wall of himself and Minerva kneeling in\n     Big Baby clothes with Alfred snarling over them, decked\n     out in leather.  He clicks ahead...\n\n     Hawk looks away and sees that the Board members have an\n     annual Report-type booklet in front of them that reads--\n     THE DA VINCI/ALCHEMY PROJECT.\n\n     Minerva leans over in front of him.\n\n                             MINERVA\n               Tomorrow, you're going to hit a\n               church.\n\n                                               CUT TO:\n\n     EXT. A MASSIVE WIDE SHOT OF ST. PETER'S--DAY\n\n     The Vatican stands in its glory, mobbed by HUNDREDS OF\n     LOCALS AND SIGHTSEERS.  The viewer's viewpoint zeroes in\n     on the Mayflower limousine circling around it.\n\n     INT. THE LIMOUSINE\n\n     Hawk looks out from the back seat of the limousine\n     in stylish Italian sunglasses.\n\n                             HAWK\n               I'm robbing the Vatican.  The nuns\n               at St. Agnes predicted that I'd end\n               up doing this...\n\n     Two identical Twin Flunkies sit across from him, grinning\n     stupidly.  Hawk pushes up his sunglasses with his middle\n     finger.\n\n     INT. VATICANESQUE MAP ROOM\n\n     Mentally casing the joint, Hawk gets some distance\n     between him and the flunkies as he enters into a room\n     that has a glorious, ancient Map of the World Mural.\n\n     INT. ANOTHER VATICAN ROOM\n\n     Hawk makes a scribble in a notepad before coming to a\n     Vatican guard, standing before a painting of a Pope\n     performing a Coronation.\n\n                             HAWK\n                       (half-hearted)\n               Excuse me, I'm being blackmailed\n               into robbing the Vatican by a\n               psychotic American corporation\n               along with a CIA...\n\n                             VATICAN GUARD\n               \"You're being\".....uh, I don't,\n               uh...\n\n     A jaded Hawk laughs and pats the cop on the back.\n\n                             HAWK\n               Forget it, man.  Go tackle a\n               jaywalker.\n\n     INT./EXT. CIRCULAR OPEN AIR HALLWAY\n\n     Hawk comes out onto a circular open-air hallway.  He\n     scans up to some rooftops and makes a note...until he\n     sees a line of International Phone Boothettes.  Checking\n     for Flunkies, he rips one up.\n\n                             HAWK\n               Operator, I want to make a collect\n               call to Alex Messina, New York....\n\n     The Flunkies drift into view.  Hawk hangs up and seethes\n     off.\n\n     INT. HALLWAY LEADING TO CODEX ROOM\n\n     Hawk saunters down a long resplendent hallway toward a\n     room at the end bustling with excitement.  Coming to the\n     mouth of the room, he looks to two gold framed mirrors on\n     either side of the opening, rubs his head, and scribbles.\n\n     INSIDE THE CODEX ROOM\n\n     Hawk takes in the majestic beauty, and practical details,\n     of the room--windows, statues, a Massive Ornate Lighting\n     Fixture--as he moves down one of the twin winding stair-\n     cases leading to a path of people behind velvet ropes and\n     the object of their gaze...\n\n     THE DA VINCI CODEX\n\n     --an old book enclosed in a glass case, propped open to\n     the familiar BEAUTIFUL DRAWING of a MAN inside a CIRCLE.\n\n     The case is located between two informational tablets\n     enclosed in glass columns.  Enter Holy Da Vinci theme.\n\n                             ANNA (V.O.)\n               But it is his gift as an inventor\n               who drew together science and art\n               that is most incredible.\n\n     Hawk brightens to the return of Anna, carrying a portfolio\n     bag, striding down the stairs with a group of INVESTORS\n     AND FAMILIES.  She brightens back, giving him a quick\n     verbal breath and a hand squeeze.\n\n                             ANNA\n               Tough guy.  What are you--How's\n               your head.\n\n                             HAWK\n                       (vegetable)\n               Yes, and my giraffe loves it, too...\n\n     She laughs, going into her public voice.\n\n                             ANNA\n               As you know, the Da Vinci Codex,\n               has lived in the Vatican for\n               centuries and will continue to\n               live here for centuries more.\n\n                             HAWK\n                       (under his breath)\n               That's what you theenk.\n\n                             ANNA\n               Question, sir?   His untiring pen\n               predicted the airplane, the\n               submarine, the bicycle, the\n               helicopter, and even the tank.\n         \n     A LITTLE BRAT trailing the group, moves next to Hawk,\n     bitching away to her STUFFED ELEPHANT, POKEY.\n\n                             LITTLE BRAT\n               This is so bor-ing!  Do you hate\n               Italy as much as I do, Pokey?\n                       (bad ventriloquism)\n               Si, senor!  Italy sucks the big\n               one!  why can't we go to the Epcot\n               Center!\n\n     The Little Brat stops and lets Pokey the elephant dangle\n     from her side.  Hawk eyes the elephant strangely.\n\n                             ANNA\n               These more dangerous designs\n               inspired him to develop a secret\n               code that ....\n\n     The stuffed elephant suddenly goes flying over Anna's\n     head.\n\n     The ALARM goes off.  The Massive Ornate Lighting Fixture\n     swoops down from the ceiling, inverting in air, and slams\n     down over the Codex, transformed into a makeshift cage.\n\n     Strange green gas comes billowing out of the vents.\n     Needless to say, everyone goes crazy.\n\n     Coughing gas, Hawk peeks to see that a line of light\n     sensor alarms imbedded in the tablets are what set the\n     alarm off.\n\n     Two GAS MASKS drop airlinesquely from the mouth of the\n     entranceway and TWO RACING-IN GUARDS wrangle them on.\n\n     The Little Brat sees that Pokey the stuffed elephant has\n     been beheaded by the cage/lamp.  She is pulled away and\n     spanked.\n\n                             LITTLE BRAT\n               Pokey, come back!\n\n     Anna yanks a notetaking Hawk away as the gas blusters in\n     around him.  The Two Flunkies, eyes on Hawk, are hap-\n     lessly making their way up the opposite staircase.\n\n                             ANNA\n               Come on, this stuff will knock you\n               out.  Have you ever had the feeling\n               you were being followed, Mr. Bond.\n\n                             HAWK\n               Never, why do you ask?\n\n     Reaching the top of the stairs, just outside the door,\n     Anna briskly pulls Hawk into a PIECE OF WALL THAT IS\n     REALLY A DOOR.  The wall closes as the Flunkies come\n     flying out, baffled.\n\n     INT. CIRCULAR STAIRCASE\n\n     Hawk, mucho impressed, and Anna move down a tight, dark\n     circular staircase.\n\n                             HAWK\n               Whoa.  Name's Hawkins, Eddie\n               Hawkins.\n               My nickname's Hudson Hawk, but don't\n               call me Hudson, not even as a joke.\n               The Nuns at St. Agnes called me\n               that and they're the ones who\n               helped make me what I am today.\n               Not a compliment...\n\n                             ANNA\n               Sure Hudson.  Are you going to\n               tell me why you did that back there\n               or are you going to blame it\n               on Dumbo?\n\n                             HAWK\n               Could you believe that crazy\n               elephant?\n\n     Anna shakes her head as she opens a door into...\n\n     INT. A LITTLE UNDERGROUND SUBWAY--DAY\n\n     A four foot high mail train rumbles down the track of a\n     mini-underground station.  Workers latch onto mail bags.\n     Hawk and Anna emerge from a small door.\n\n                             HAWK\n               Whoa, part 2.  Does it go to Times\n               Square?\n\n                             ANNA\n               Delivers up to ten at night.  The\n               Pope has an obsession with his\n               Easter Seals.  It's actually not\n               that an unusual set-up.  The\n               secret passageway on the other\n               hand....\n\n                             HAWK\n               The Vatican is made of constant\n               mysteries meant to be enjoyed,\n               not explained.\n\n                             ANNA\n               Nice.  But right out of our\n               brochure.\n\n                             HAWK\n               Oh, you read that.\n\n                             ANNA\n               Actually I wrote it.  It's a good\n               sentence.  It can apply to people.\n\n                             HAWK\n               You're not an unmysterious thang\n               yourself.\n\n                             ANNA\n               I don't steal stuffed elephants\n               from little girls.\n                       (smoothing his\n                        jacket)\n               And I buy my own clothes.  My\n               life's a little boring...\n\n                             HAWK\n               God, I wish I could say the same\n               thing.  What about having a nice,\n               dull dinner with me tonight.\n               Scrabble, Knock-knock jokes,\n               Anecdotes about famous dead\n               Italians....\n\n                             ANNA\n               I'll bring my entire repertoire...\n\n     The Two Flunkies stumble into the station, looking\n     around.  Anna and Hawk crouch down.\n\n                             HAWK\n               And I'll bring my entourage...\n\n                             ANNA\n               Secret passageways don't mean as\n               much as they used to.  There's\n               a place two blocks east of here.\n               Enzo's.  Say 10:30.\n\n                             HAWK\n               Said.\n\n     Hawk and Anna peck each other with a smile.  He crawls\n     out an exit door.  As he leaves, Anna's smile disappears.\n     She pulls out a rosary and gives herself a self-scolding\n     bang on the head.  She then darts to a large crucifix\n     and looks up.\n\n                             ANNA\n               Father, it's obvious.  He's up to\n               something.\n\n     Suddenly a speaker in Jesus's mouth gently crackles.\n\n                             JESUS (Italian)\n               Report downstairs at once.\n\n                             ANNA\n               Yes, sir.\n\n     INT. CATACOMBLIKE AREA\n\n     A CARDINAL paces in an enigmatic Vatican area.  Anna\n     clacks up to him.\n\n                             CARDINAL\n               Did he mention the Mayflowers?\n\n                             ANNA\n               No, your Eminence.  I think he's\n               going to steal the Codex, as\n               early as next week.\n\n                             CARDINAL\n               Attempt, you mean.  The vanity\n               of this man, Hudson Hawk.  The\n               Vatican has foiled the advances\n               of Pirates and Terrorists.  We\n               will not lie down for some\n               schmuck from New Jersey.  Must\n               you flirt with him so realistically?\n\n                             ANNA\n               That's the best kind.  A wise\n               woman once said \"Polite\n               conversation is rarely either.\"\n\n                             CARDINAL\n                       (chuckling)\n               Let me be the one to quote\n               Scripture.  ....As an agent of\n               our organization, you are put in\n               awkward situations.  Just\n               remember, Hudson Hawk is an evil,\n               evil man.\n\n                             ANNA\n                       (unconvinced)\n               Yeah.  The big E.\n\n     EXT. NAVONA PIAZZA--DAY\n\n     The evil Hawk clumsily strides around a fountain, looking\n     off in all directions, soft-shoes past some sedate\n     painters and swings into...\n\n     INT. A BIG QUIRKY PHONE BOOTH\n\n     Hawk grabs up the phone and dials....\n\n                             HAWK\n               Hello, operator.  I'd like to\n               make a collect call to New York\n               number...\n\n     The Mayflower limousine creeps to the edge of the piazza,\n     behind an oblivious Hawk.\n\n                             HAWK\n               Thank you, operator, thank you.\n\n     Hawk turns, putting a finger in his ear.  Seeing the\n     limo, he FREAKS and balls himself into a corner.\n\n                             HAWK\n               Come on, Alex, pick up, you\n               Reindeer goat cheese-eating\n               motherfucker.\n\n     INT. ALEX'S RESTAURANT--NIGHT\n\n     It is late night in New York.  A phone rings atop the\n     bar of Alex's restaurant with no one in sight.\n\n     INT. PIAZZA--DAY\n\n     Hawk pokes his head to see a Darwin and Minerva (holding\n     Bunny) emerge from the limousine.  As he turns his con-\n     centration back to the phone, ALEX HIMSELF flows out from\n     a building to cheerfully speak with Darwin and Minerva\n     and get licked by Bunny, before they all pile into the\n     limo.\n\n                             HAWK\n               A-lex, A-lex, come on Alex.\n\n     Hawk slams down the phone and turns to see the limousine\n     pull off.\n\n     Hawk angrily bursts from the door and is painfully\n     CLOTHESLINED by agent Butterfinger, who is dressed as\n     a mailman.\n\n     Crumpled on the ground, Hawk kicks out with his foot,\n     into Butterfinger's stomach, doubling him. Hawk then\n     grabs him by the head and rams into the glass of the\n     booth.\n\n     Hawk rotates off for an escape...but the rest of the\n     CIA crew cuts him off holding barely concealed guns;\n     Snickers dressed as a maitre 'd, Almond Joy as a Bermuda\n     tourist, and Kaplan in his usual emsemble.  Kit Kat is\n     dressed exactly like Hawk, right down to a bloody lip.\n     Hawk gives him a double take.\n\n                             KAPLAN\n               Hawk, Hawk, Hawk.  Enjoying\n               Italy?  I always had a soft spot\n               for Rome.  Did my first barehanded\n               strangulation here.  Communist\n               politician.\n\n                             HAWK\n               Why George, you big softie...\n\n                             KAPLAN\n               God, I miss communism.  The Red\n               Threat.  People were scared, the\n               Agency was respected, and I got\n               laid every night.\n\n     A humiliated Butterfinger comes waddling out, holding\n     the phone.  Kaplan rolls his eyes.\n\n                             BUTTERFINGER\n               Sorry, coach...\n\n                             KAPLAN\n                       (shaking his head)\n               If his father wasn't the head of\n               Shit, I hate this, the\n               government's got me farmed out,\n               working for the Mayflower\n               corporation now, money beats\n               politics.  War isn't Hell anymore,\n               it's Dull.  Don't slaughter their\n               men and rape their women, just\n               steal their microchips.\n\n                             HAWK\n               You know Kaplan, if you weren't\n               the slimiest pinata of shit that\n               ever lived, I'd feel sorry for\n               you.\n\n                             SNICKERS\n               Good news, bud, the Mayflowers\n               have moved up the time-table.\n               You're hitting the Vatican to-night.\n\n                             HAWK\n               Tonight?  You're whacked.  The\n               timing's off, I'm underequipped\n               Damnit, I have a date!\n\n     Almond Joy smoothly extracts Hawk's notebook and reads...\n\n                             ALMOND JOY\n               Grapple, Biker's bottle, hairspray,\n               black turtleneck, Pocket\n               Fisherman, acid, collapsible\n               yardstick, softball, and 72 stamps.\n               Gee Stud, this is going to be\n               some date.  No Harvey's Bristol\n               Cream?\n\n                             KAPLAN\n               Snickers, make the list happen.\n               Oh and it's one thing to play\n               hide and seek with the Mayflower's\n               pathetic staff, but we're sore\n               losers.  I've put jumper cables\n               on the nipples of children and\n               not always in the line of duty.\n\n                             HAWK\n               Thanks for sharing.\n\n                             KAPLAN\n               We blow up space shuttles for\n               breakfast.  You and your friend\n               Alex would be a late afternoon\n               Triscuit.\n\n                             HAWK\n               If you do anything to my friend...\n\n                             KAPLAN\n               Yeah, right.  By the way, as long\n               as I'm getting things off my\n               chest, I'm the one who killed your\n               little monkey.  Made it look like\n               a Mafia hit.  Did it for fun.\n               Ciao.\n\n     Kaplan and the crew quickly disperse in different\n     directions as Hawk howls in frustration.  Kit Kat moves\n     behind Hawk and perfectly mimics him.\n\n                             HAWK\n               What did you have against Little\n               Eddie, motherfucker?  He was just\n               a monkey who liked to laugh.\n               Come back without your yuppie\n               army.  I'll triscuit you, you\n               space shuttle eating...Shit.!\n\n     Without looking, Hawk elbows the mimic Kit Kat in the\n     face.  Kit Kat gives Hawk a strange smile and hands him\n     a card that reads:  BEWARE THE ODD STEPS.\n\n     Hawk looks up from the card.  Kit Kat is gone, but\n     Butterfinger scampers in his place.\n\n                             BUTTERFINGER\n               Hey, Mr. Hawk, I got those 72\n               stamps!\n\n     Sighing, Hawk takes the huge sheath of stamps.\n\n     EXT. INDOOR TRAIN TRACK\n\n     One of the small Vatican mail trains bullets across an\n     indoor track.  The viewer's viewpoint whooshes to catch\n     up, focusing on a very large package, addressed to the\n     Pope, that has Hawk's sheath of stamps slapped onto it.\n     The train zips into a tunnel.\n\n     INT. THE VATICAN UNDERGROUND SUBWAY\n\n     The train rumbles into the Vatican mini-station.  TWO\n     HARRIED WORKERS heave up the strange cargo onto a sorting\n     table.\n\n     A bell rings as a clock hits 10.  The workers do a sigh\n     of relief.  Shucking off their uniforms, they head out.\n\n     A hand rips out of the huge package.\n\n     INT. OUTSIDE THE CODEX ROOM--NIGHT\n\n     Hawk pops out of the secret passageway door and moves to\n     the mouth of the doorless Codex room.  He pauses to\n     hand-comb his hair in the two large, framed mirrors at\n     the sides.\n\n     THE CODEX ROOM\n\n     Carrying the now frameless mirrors in each hand, Hawk\n     hustles to the top of the steps and suddenly stops.\n\n                             HAWK\n               \"Beware the Odd Steps.\"\n\n     Hawk crouches down and notices the step below him has a\n     clear magnetic tape running across it to a dime sized\n     alarm button.\n\n                             HAWK\n               Why Kit Kat, aren't you a\n               gentleman...\n\n     Hawk bounds down every other one of the steps down to\n     where the Codex is bathed in a holy light.\n\n     He hefts up the two now frameless mirrors and puts them\n     each in a groove of a collapsible yardstick running\n     across the top.  The parallel mirrors now face out from\n     each other.  Hawk sprays a blast of Clairol to reveal the\n     light sensor beams, and then with a deep breath, he\n     thrusts the mirrors into the beams.\n\n     The light bounces harmlessly off the mirrors and Hawk\n     exhales.  He balances the connected mirrors then crawls\n     through his tent-like passageway.\n\n     Hawk squirts acid from a biker's bottle on the cracks of\n     the rectangular glass case that holds the Codex.  The\n     acid sizzles.\n\n     INT. VATICAN LIBRARY HALLWAY--NIGHT\n\n     A BURLY GUARD thoughtfully stares at a painting, fingers\n     propping his chin like an critic then continues ambling\n     on.\n\n     THE CODEX ROOM\n\n     Rubbing his head, Hawk gives an excited smile as the glass\n     cracks of the rectangular case loosen.  Hawk pulls out a\n     pocket fisherman....\n\n     The viewer's viewpoint moves upward to reveal, through\n     the mouth of the room, the Burly Guard is coming down\n     the hall.\n\n     OUTSIDE THE CODEX ROOM\n\n     Burly Guard approaches the outskirts of the Codex room.\n     He combs his hair into the piece of wall in the now\n     empty mirror-frame then REALIZES.\n\n     Muttering Italian into his walkie-talkie, Burly Guard\n     rushes into the room and looks down to the sensor\n     deflecting mirrors.\n\n     He passes a statue, behind which, Hawk is revealed to\n     be standing.\n\n     Burly Guard approaches the Codex and sees the dripping\n     acid.  He also notices a fishing hook attached to the\n     binding of the Codex.  The fishing wire leads out of\n     the glass case.  The Guard reaches to touch it when\n     suddenly the wire is pulled tightly upward by a\n     moving-out-from-behind-the-statue Hawk.\n\n     The Codex FLIES off its perch, setting off the ALARM and\n     sending the bizarre cage/lamp CRASHING DOWN and AROUND\n     the hapless Burly Guard.  The green gas commences its\n     noxious billowing as the Codex swooshes into Hawk's\n     hands.  He then hurls a softball, smashing a window\n     on the other side of the room.\n\n     The familiar Vatican Guard and a Guard Three barrel\n     down into the mouth of the codex room.  Only one\n     Gas Mask drops from the doorway.  The Vatican Guard\n     pulls it on and gives a \"That's Life\" shrug of\n     shoulders to the fainting Guard three.\n\n     Hawk puts on the missing gas mask and launches a grapple\n     around the ceiling cord of the dropped Ornate Lighting\n     Fixture.  Hawk then Tarzans from one staircase to\n     another.  He then ungrapples and heads toward the\n     shattered window.\n\n     The Vatican Guard waits a stunned moment before giving\n     chase.\n\n     EXT. THE ROOF\n\n     Hawk flings off his gas mask and begins a classical\n     skipping-across-the-rooftop jaunt.  Suddenly a brick\n     on the slightly slanted roof gives way and Hawk FALLS.\n     His canvas bag goes skipping down across the roof,\n     landing against the antennae.\n\n     INT. THE POPE'S BEDROOM\n\n     A T.V. showing Mr. Ed. speaking to Wilbur in Italian\n     goes fuzzy.  THE POPE, wearing his famous hat and a Notre\n     Dame bathrobe angrily bangs on it.\n\n     EXT. THE ROOF\n\n     Hawk harvests his grapple on the level part of the roof\n     and slides down toward the dangling-off-the-antennae bag.\n\n     The Vatican Guard pops out of the window and fires a\n     warning shot.\n\n     Hawk stretches to the bag.  His fingers touch as the\n     Guard continues to bound forward.\n\n                             HAWK\n               Please God, Please God.......let\n               the guard shoot me.\n\n     Hawk pulls up the bag and turns himself to see Vatican\n     Guard hovering over him on the roof.\n\n                             VATICAN GUARD\n               The worm's on the other foot,\n               yankee noodle candy.\n\n     Hawk sees the Vatican Guard's foot move toward the\n     grapple.  Hawk ferociously tugs, ripping the Guard\n     off-balance and knocking down a side of the roof.\n\n     EXT. TOP OF A NEARBY WALL\n\n     Hawk dashes atop a nearby wall and hurls his grapple\n     across a road around a tree branch.  Hawk ties the end of\n     grapple line, tosses on a friction belt, takes a breath\n     and JUMPS OFF THE WALL.  The viewer follows him on his\n     breathtaking ride.\n\n     The brused Vatican Guard flops back atop the roof.  He\n     gets off a wild shot before crumpling back down.\n\n     HAWK\n\n     is alnost to the other side when the Guard's bullet hits\n     the friction belt.  Hawk drops with a wild scream...\n     and lands with a painful straddle atop a street lamppost.\n     His eyes bug out with the thought of a life without\n     children.  He slowly spins off the lamppost and sails\n     down upon...\n\n     EXT. A BUS\n\n     and the comfortable luggage housed on top of it.  Hawk\n     tries to maintain his balance upon the wobbling\n     baggage, but the bus makes a quick turn and Hawk goes\n     flying off...\n\n     EXT. RIGHT INTO A CAFE CHAIR--NIGHT\n\n     Panting and discombobulated, Hawk looks across the table\n     to the female hands holding open a menu.  The menu comes\n     down.  It is Anna.  Hawk unpretzels and laps his canvas\n     bag.\n\n                             ANNA\n               Oh Hudson, I was worried you\n               weren't going to drop by....\n\n                             HAWK\n               I never break a date.  Scout's\n               honor.\n\n     Hawk does the honor sign with his black gloved hand\n     then quickly rips it off as a WAITER comes to the\n     table.\n\n                             HAWK\n               Fettucini con Funghi Porcini.\n\n                             WAITER\n               Bellissimo, signor.\n\n                             HAWK\n               Oh, and could I have some ketchup\n               with that.\n\n     Anna hits her forehead with the palm of her hand while\n     the waiter's entire body sinks in disappointment.  Other\n     TABLE OCCUPANTS sadly shake their heads.\n\n     EXT. ANOTHER TABLE--NIGHT\n\n     At a comfortable distance curled behind a heat lamp,\n     Snickers is being an Uglier American to an UNCOMPREHENDING\n     WAITER, while Almond Joy chuckles and Butterfinger spreads\n     butter over an entire baguette.\n\n                             SNICKERS\n               Come on, Pierre, Steak-bur-ger,\n               Fren-n-ch Fries.  This is France,\n               you gotta have French.....\n\n                             ALMOND JOY\n               Actually we're in Italy, Snickers,\n               she said as if it made a difference.\n\n     The Waiter sneaks off.  Butterfinger devours his bread.\n\n                             SNICKERS\n               Italy, France, Moscow.  They all\n               just wanna be Nebraska.  Old Man\n               Kaplan thinks since Communism is\n               dead, we got nothing to do.  Man,\n               Democracy isn't free elections.\n               We gotta teach the world that\n               Democracy is Big Tits, College\n               Football on Saturdays, Eddie\n               Murphy saying the word \"Fuck\"\n               and Kids putting their hands down\n               garbage disposals on \"America's\n               Funniest Home Videos.\"\n\n                             ALMOND JOY\n               Damn baby, when's the last time\n               you had a vacation...Jesus, I\n               gotta get out of this job.  If\n               my Mom knew her daughter\n               assassinated the leader of the\n               anti-Apartheid movement....\n\n                             SNICKERS\n               Quit bitching, you got the\n               employee of the month plaque for\n               that shit...Ah to be in Pari-is\n               and in love.\n\n     They look off to....\n\n     HAWK AND ANNA'S TABLE\n\n     Physically sarcastic, the Waiter brings a tall wine\n     basket with a bottle of ketchup in it.  Hawk nabs it.\n\n                             HAWK\n               This is bueno.  They had the worst\n               ketchup in prison.....uh...\n\n                             ANNA\n               Prison?\n\n                             HAWK\n               I was the Warden?\n\n                             ANNA\n               How long were you in?\n\n                             HAWK\n               Let's just say, I never saw E.T.\n\n                             ANNA\n               Wow, you were \"in the joint.\"\n               \"Doing hard time.\"  It's funny,\n               but that excites me.  I seem to\n               have a thing for sinners.\n\n                             HAWK\n               I seem to have a thing for sinning.\n               sinning.  Check please....\n\n                             WAITER\n               Ah, anything for dessert?\n\n                             ANNA\n                       (she shoots)\n               Yes.  Something to go.\n\n                             HAWK\n                       (she scores)\n               I'll bring the ketchup.\n\n       INT. ANNA'S HOUSE--NIGHT\n\n       The viewer's viewpoint pulls back, past the black canvas\n       bag on a table, to reveal a barefoot Anna is straddling\n       a bare-backed Hawk, demurely and tentatively studying his\n       bruises.\n\n                             ANNA\n               What have you been doing?\n\n                             HAWK\n               Uh....old badminton injury.\n\n     Anna giggles and bends to kiss a bruise.  She stops\n     herself and opts for tickling.\n\n                             HAWK\n               tickles, ticKleS, TICKLES.\n\n                             ANNA\n                       (not stopping)\n               Oh, I'm so sorry...\n\n     Roaring with laughter, they capsize onto the floor.\n     Hawk slithers around to devour her toes.  Anna closes\n     her eyes and arches her back.....\n\n     She opens her eyes and sees a large crucifix staring\n     right at her.  With a gasp, she rolls away from Hawk\n     and stands up, trying to brush off her sins.\n\n                             ANNA\n               I'm sorry.  I can't.  I....\n\n                             HAWK\n                       (softly approaching)\n               Hey now, outside of a very\n               friendly dog this morning, it's\n               been a slow decade.  I don't make\n               love every ten years, I get a\n               little cranky.\n\n                             ANNA\n               It's also been a long time for\n               me.  I--\n\n     Their heads fuse for a semi-classic screen kiss until\n     THE CRUCIFIX LIGHTS UP AND BEGINS SHOUTING IN ITALIAN.\n\n                             HAWK\n               Catholic girls are scary...\n\n                            ANNA\n               Somebody robbed the Vatican.\n\n                            HAWK\n               Oh.  No.\n\n     Anna slides on her shoes and makes a hasty retreat.\n     She bumps into the canvas bag.  The Codex slides out.\n     They both catch it in mid-air.  Anna's eyes pop.  She\n     wrenches the Codex away and kicks.  Hawk pulls her into\n     a compassionate back-against-his-stomach hug.  The Codex\n     falls to the floor unharmed.\n\n                             HAWK\n               It's not what you think.  Okay,\n               maybe it is....\n\n                             ANNA\n               You really went and did it.  With\n               one day, not even a day, of\n               planning, you did it.  Nobody\n               does it better, Hudson.  You\n               started the week stealing the\n               Sforza and you ended it swiping\n               the Codex.\n\n                             HAWK\n               Wha--\n\n                             ANNA\n               What are your plans for the\n               weekend?  Hoisting away the\n               Colosseum?  Tell me, did the\n               devil make you do it or did\n               Darwin and Minerva Mayflower?\n\n     EXT. A CAR OUTSIDE OF ANNA'S PLACE--NIGHT\n\n     Crammed together in the front seat, Snickers, Almond\n     Joy, and Butterfinger are watching the shadows of\n     Hawk and Anna up in the window.  Snickers snaps a\n     cartridge into a gun while Butterfinger attacks a\n     goo-ey pastry.\n\n                              SNICKERS\n               What's going on in there?\n\n                              BUTTERFINGER\n               Do you want me to rape them?\n                       (throwing pastry down)\n               Dunkin does it better.\n\n                              SNICKERS\n               Just read, Butterfinger.\n\n     Butterfinger pulls up the book on Da Vinci that Anna\n     wrote and starts reading like a schoolboy.\n\n                             BUTTERFINGER\n               \"Da Vinci had fears about his\n               more dangerous designs, so he\n               created a shorthand code in\n               reverse script...\"\n\n                             ALMOND JOY\n               To yourself!.....What are they\n               doing?  In twenty seconds, we go\n               in.\n\n     INT. ANNA'S PLACE\n\n     Foam shoots out over the coffee.  Hawk smiles down at\n     it as Anna works a cappuccino machine.\n\n                             ANNA\n               For two years, I've been tracking\n               the Mayflowers' peculiar interest\n               in three Da Vinci pieces.  Their\n               Sforza replica was as fake as\n               the \"gas leak\" that supposedly\n               destroyed it.\n\n                             HAWK\n               Does everyone in the world know\n               more than me?  Jesus, I'm just\n               some guy who happens to be good\n               at swiping stuff.....Lifted a\n               piece of licorice when I was one\n               and a half.  Who knew it would\n               lead... They even got the CIA\n               involved!\n\n                             ANNA\n               The C.I. what?  God, no...\n\n                             HAWK\n                       (raising his cup)\n               Ooh, I guess I do know something\n               Here's looking at you, kid...\n\n     THE CAR OUTSIDE\n\n     The agents burst from the car, guns raised.\n\n                             ALMOND JOY\n               Now.\n\n     ANNA'S HOUSE\n\n     Hawk sips the cappuccino.  His face immediately contracts.\n\n                             HAWK\n               This doesn't taste like\n               cappuccino.\n\n                             ANNA\n               Oh, I must have put too much\n               ethyl-chloride in it.\n\n     Anna throws a pillow on the ground and holds out her\n     hand.  Hawk collapses.  His coffee cup lands perfectly in\n     Anna's outstretched hand and his head lands perfectly\n     on the pillow.\n\n     The candy bars bash the door open, guns raised.\n\n                             ANNA\n               Why didn't you tell me at the\n               restaurant that he had hit the\n               Vatican tonight.  My people will\n               not be happy.  I want to see Kaplan.\n\n                             ALMOND JOY\n               That's not overly possible.  He...\n\n                             BUTTERFINGER\n               But guys, remember, he's in the\n               castle at Vinci....\n\n     Snickers and Almond Joy grimace into fake smiles.\n\n     EXT. THE CASTLE--NIGHT\n\n     A helicopter thunders up to the awesome castle from the\n     opening Da Vinci sequence.\n\n     INT. HELICOPTER\n\n     Anna pets the head of Hawk on her lap.  She is pondering.\n\n     INT. A MYSTERIOUS DARK ROOM--NIGHT\n\n     A sparse circle of light houses a chair and a pacing\n     Kaplan.\n\n     Snickers and Butterfinger flop Hawk onto the lit chair.\n\n     Kit Kat is dressed exactly like Anna.  She reacts as she\n     comes into the light.  Kaplan takes the Codex from her.\n\n                             KAPLAN\n               Way to go, Anna.\n\n                             ANNA\n               When the Mayflowers find out we\n               have the Codex, they're going to\n               want to make a deal...\n\n                             KAPLAN\n                       (gung-ho lying)\n               And then we'll arrest those\n               greedy pigs... Is that it?\n\n     Hawk stirs.  The viewer gets his woozy P.O.V.\n\n                             ANNA\n               Actually George, it's not it.\n               What are we doing in this castle?\n               I happen to know the Mayflowers\n               bought this castle last year when\n               they found out Da Vinci used to\n               do...\n\n     The lights in the room come on to the sound of holy Da\n     Vinci theme, revealing an almost perfect refurbishing of\n     the exact same workshop Da Vinci toiled in in the\n     opening.\n\n                             KAPLAN\n                       (trying to be solemn)\n               It's the site of their new museum\n               and we're taking it over.  Operation\n               Deflower Mayflower is going full\n               speed ahead.\n\n                             ANNA\n                       (taking it in)\n               Oh Lord.... the only reason I ask is\n               that Hudson, uh, Mr. Hawk, Hawkins,\n               had some \"neat\" things to say about\n               Darwin, Minerva, and you.\n               Basically that you're part of the\n               same car pool.\n\n                             KAPLAN\n               Anna.  Anna.  Anna.  If that were\n               true, Almond Joy would have\n               handed you your heart right\n               after you handed me the Codex.\n               Now, get some sleep.  Kit Kat...\n\n     Kit Kat in drag spookily moves inches away from Anna.\n\n                              ANNA\n               Cat got his tongue?\n\n                              KAPLAN\n               Actually he never told us what it\n               was.\n\n     Kit Kat smiles, revealing the fact he has no tongue.\n\n                             ANNA\n               How sweet.  I trust you will see\n               Hudson Hawk is given to the proper\n               authorities.  I recommend\n               leniency...\n\n                             SNICKERS\n                       (holding in a laugh)\n               Oh, I think we all do.\n\n     Hawk gives her a look of honesty and pain that causes\n     Anna to guiltily gulp as she heads out with the mimicking\n     Kit Kat.\n\n                             SNICKERS\n               Do you think she has any idea that\n               Operation Deflower Mayflower is as\n               bogus as Kit Kat's tits?\n\n                             KAPLAN\n               I don't think so, although bringing\n               her to the castle gave her a big,\n               juicy hint.\n\n                             ALMOND JOY\n               With all due respect to that great\n               blouse, why didn't I cut out her\n               heart?\n\n                             KAPLAN\n               Close call, but she's our only way\n               of keeping tabs on that damn\n               mysterious Vatican organization.\n               Hawk, it's time to go to the\n               principal's office....\n\n     EXT. OUTSIDE THE CASTLE--NIGHT\n\n     Moving into the chopper, Anna glimpses, Bunny, the\n     obnoxious dog, in a Mayflower logo dog tag, taking a leak\n     on some bushes.  She fakes a yawn to the like dressed Kit\n     Kat who fakes one back.\n\n     INT. THE G. MACHINE ROOM--NIGHT\n\n     Kaplan, Hawk, and the other agents march into the mammoth\n     room of the opening scene.  In the place of where one\n     remembers the gold machine are undulating sheets, beneath\n     which are unassembled parts of the machine.\n\n     Inside, a ball goes whizzing out of a tennis ball\n     machine.  In tennis gear and goggles, Darwin Mayflower\n     thwacks it against the wall of (now faded) frescos.\n\n     Also in tennis threads, Minerva is laying on a chaise\n     lounge holding a gadget in her hand.\n\n                             DARWIN\n               Seven!\n\n     Minerva turns the gadget up to SEVEN and presses a\n     button.  Another tennis ball shoots out, a little faster.\n     Darwin batters it.  The ball ricochets into the forehead\n     of an \"amused\" Alfred who is retrieving balls in sweat\n     pants.\n\n                             ALFRED\n               Jolly.  Good.  Shot.  Sir.\n\n                             MINERVA\n               Ooh, it's Hudson Hawk, you cease\n               to amaze me, convict.  You are a\n               terrible cat burglar!\n\n                             DARWIN\n               Haven't you ever seen, like David\n               Niven?  You know tiptoe in, tiptoe\n               out.\n\n                             MINERVA\n               Like a \"cat\", one could say.\n\n                             HAWK\n               Shucks, I'll just take it back.\n\n     Hawk reaches for the Codex.  Kaplan pulls it over to\n     Darwin, who pulls up his goggles and fondles the ancient\n     binding.  Taking a knife from Kaplan, he begins to slit\n     it open.\n\n                             MINERVA\n                       (bouncing up)\n               No, let me!\n\n                             DARWIN\n                       (pout)\n               I don't care.\n\n     Hawk looks away to the billowing sheets and the strange\n     machine parts behind them.\n\n     Minerva slits the bindings and tugs out another geometri-\n     cally perverted crystal.\n\n                             HAWK\n               Another piece of the puzzle for\n               the Da Vinci Alchemy project.\n\n     Kaplan, Darwin, and Minerva look up to Hawk, then to each\n     other, all start to speak, then all stop.\n\n     This quandary is deferred by the entrance of the twin\n     Flunkies.\n\n                             DARWIN\n               Oh, you.  There's nothing more I\n               hate than failure.  All you had to\n               do was follow the Hawk, it's not\n               like I said \"Teach our nation's\n               children how to read.\"\n\n     Hawk uses the distraction to amble toward the sheets.\n\n                             DARWIN\n               I guess we're just going to have\n               to kill 'em...\n\n     Shockingly swift, Minerva pulls a small gun from beneath\n     her tennis dress and blasts a burning hole between each\n     set of Flunky eyes, splattering them to the ground.\n\n                             DARWIN\n               God Minerva, I was kidding.\n\n     A SHOCKED HAWK\n\n     quickly turns from the blithe carnage and pulls up a\n     sheet.  He reveals the familiar Gold Machine Demonhead.\n\n     THE MAYFLOWERS\n\n     reverberate off each other with laughter.  Bloodstained,\n     Kaplan and Almond Joy exchange an eye bulge.  Minerva's\n     smile disappears as she sees Hawk by the sheets.\n\n                             MINERVA\n               Get away from there, convict!\n\n                             HAWK\n               Just browsing.  Don't touch me....\n\n     Snickers touches him.  Hawk smashes him in the jaw.\n     Snickers rears back to reciprocate....\n\n                             DARWIN\n               Don't hurt him!  We need him for\n               the final job!\n\n     Snickers stops himself, snarling in frustration.  Hawk is\n     suddenly the happiest man he's been in Italy.\n\n                             HAWK\n               Oh weeeeelly, don't hurt me?  Even\n               if I do this....\n\n     Hawk pulls Snickers' glasses off and stamps them.\n\n                             HAWK\n               And this....\n\n     Hawk knees Butterfinger in the stomach.\n\n                             HAWK\n               Surely this must offend....\n\n     Hawk body-block-dominoes Butterfinger and Snickers to the\n     ground.  Kaplan and Almond Joy aim their guns.\n\n                             KAPLAN\n               That's it!\n\n     Playfully lifting his shirt, Hawk grabs Minerva and\n     manually swivels her hips to the beat of his.\n\n                             HAWK\n               Things are getting a little loose\n               at the Da Vinci workshop tonight.\n               \"Put your left leg in, take your\n               right foot out.\"  May I call you\n               Minnie....\n\n     Hawk mambos to Alfred who rifles his blade up to Hawk's\n     crotch.  Hawk stops dancing.\n\n                             DARWIN\n               Come to think of it there is a part\n               of your body that you won't need for\n               your next job...\n\n                             HAWK\n               Hey, guys, I've always wanted to sing\n               like Franki Valli and the other seasons,\n               but come on....\n\n     Alfred moves the blade a little upward.  Hawk a-a-ghs.\n\n                             MINERVA\n               Big girls don't cry-I-eye.\n\n                             HAWK\n               Two minutes, 35 seconds.  Damnit,\n               I'm involved in this thing, so I\n               just wanna know what this thing is.\n               I wanna be treated as an adult.\n\n                             DARWIN\n               That's fair.  Tomorrow.  Back in\n               Rome.  Now go to your room.\n\n     Alfred strategically Vulcans Hawk on the neck.  He falls.\n\n     INT. DARK CONFESSION BOOTH--MORNING\n\n     The lips of Anna come into light.\n\n                             ANNA\n               Forgive me Father for I have\n               sinned.  It's been 1200 hours\n               since my last confession.\n\n     INT. THE CARDINAL'S SIDE OF THE CONFESSION BOOTH\n\n     The cardinal suppresses a yawn.\n\n                             CARDINAL\n               Hit me with your best shot.\n\n                             ANNA (O.S.)\n               I betrayed a man.  A good man.  An\n               innocent man.  A thief.\n\n                             CARDINAL\n               Anna, what are you trying to say...\n\n     ANNA'S DARKENED LIPS\n\n                             ANNA\n               He came into a world where crime\n               is a legitimate business tactic\n               and a legitimate government\n               procedure.  But he knew Right and\n               Wrong.  Oh, and we kind of messed\n               around...\n\n     THE CARDINAL\n\n     freaks and goes into some Italian gibberish before...\n\n                             CARDINAL\n               \"Messed around\" messed around?  I\n               know-- I don't want to know.  First\n               base?  Second Base?  Stop me when\n               I'm getting warm...\n\n                             ANNA (O.S.)\n               A little petting is not the issue!\n\n                             CARDINAL\n               Sorry.  Seventeen Hail Marys and\n               five minutes outside.\n\n     INT. OUTSIDE THE CONFESSION BOOTH--MORNING\n\n     The Cardinal emerges and stands by Anna's confessional\n     curtains.\n\n                             CARDINAL\n               So let me get this straight,\n               sister, you're saying Hudson Hawk\n               is not willingly working for the\n               Mayflowers but Kaplan and the\n               Candy Bars are?\n\n     Anna moves out of the confessional curtains, wearing a\n     FULL NUN HABIT for she is a Nun.  The gaspingly beautiful\n     church unfolds as they walk.\n\n                             ANNA\n               You got it.  Operation Deflower\n               Mayflower is a bad joke and I'm the\n               punchline.  I thought we were using\n               the CIA to help us to get Mayflower,\n               but really the CIA was using me to\n               keep us away from Mayflower.\n\n                             CARDINAL\n               Oh, why couldn't I be the Cardinal\n               in charge of catering.... If the\n               Mayflowers get the three sections\n               of Da Vinci's crystal and his\n               instructions for the gold machine--\n               Aie-yi--Do we got anything?  What of\n               Alex, Hawk's friend, where is his\n               loyalty?\n\n                             ANNA\n               I'm going to find out.\n\n                             CARDINAL\n               I'm sorry for losing it back there,\n               but you must remember, sister, you\n               have vows to God as well as a mission\n               to the world.\n\n                             ANNA\n               I know, I know, your Eminence, just say\n               \"God go with me.\"\n\n                             CARDINAL\n               God go with you, sister.\n\n     Anna puts on the coolest pair of sunglasses, deliciously\n     contrasting with her habit.  She moves off....\n\n     INT. ROME CONFERENCE ROOM--DAY\n\n     Beneath the wacky portrait, Darwin circles the board-\n     member filled conference table as Minerva smooches Bunny.\n     Everyone watches Alfred place a bar of Gold and of Lead\n     in the hands of a blindfolded Hawk at the middle of the M.\n\n                             DARWIN\n               So, Captain Hawk, in one of your\n               paws you got a gold bar worth\n               about 8 thou.  In the autre, you\n               got lead that won't get you\n               gelato.\n\n                             MINERVA\n               Surely a master-thief like you can\n               tell the difference.\n\n                             HAWK\n                       (\"What's my Line\")\n               That's two down to Kitty\n               Carlisle...\n\n     Hawk \"weighs\" the two bars in his hands--digs with his\n     fingernails.  He rips off the blindfold in subdued\n     frustration.  As Minerva speaks, she unconsciously\n     molests Alfred.\n\n                             MINERVA\n               Cool, isn't it?  Weight, feel,\n               mal1eability, they're all but\n               identical.  On the periodic chart\n               of elements, they're but one\n               proton apart.  Great minds worked\n               for centuries to turn worthless\n               into priceless.\n\n                             HAWK\n               Alchemy.\n\n                             DARWIN\n                       (casually goosing Alfred)\n               Alchemy!  Is the business term of\n               the 90's, my man!  Minerva read\n               about it in an airline magazine\n               about four years ago.  I dumped\n               some lira into research... Shazam,\n               we come across a diary by one of\n               Da Vinci's apprentices detailing\n               La Machine de Oro, the gold machine\n               for those at home, and the rest is\n               about to become history.  Money\n               isn't everything, gold is.  Fuck\n               blue chip stocks!  Fuck T-bills!\n               Fuck Junk Bonds!  I got the real\n               deal!  Money will always be paper\n               but gold will always be gold!\n\n                             MINERVA\n               Market crashes.  Bomb drops.\n               Greenhouse effect affects.  We'll\n               still be the richest, most powerful\n               people in the world.  In 1992,\n               Europe is coming together to become\n               one business superpower.  It's one\n               party we'd love to poop.\n\n                             DARWIN\n               Well, that said, the last\n               ingredient in the recipe is in, get\n               this, you're gonna die, the Kremlin.\n\n                              HAWK\n               Sure.  The Kremlin.  Makes sense.\n               The Kremlin.  Why not?  Listen,\n               this is all too Indiana Jones and\n               the Lost City of King Tut for me,\n               man.  Throw me in jail and go ahead,\n               just try and throw Alex...\n\n                             MINERVA\n               Jail, you asshole!  Our foot\n               soldiers will blow your brains\n               out!  Bunny, Ball-Ball!\n\n     Minerva angrily throws the dog off her lap and whips a\n     tennis ball into its mouth.\n\n                             DARWIN\n               I'll torture you so slowly you'll\n               think it's a career!  I'll kill\n               your family, your friends, and the\n               bitch you took to the Prom!\n\n                             HAWK\n               You want an address on that last\n               one?\n\n     Bunny barks up at Hawk in anger.\n\n                             HAWK\n               Bunny, not you too?\n\n                              MINERVA\n               You've got a dilemma, tiger.  I\n               think I know what's going to help\n               you solve it.\n\n     Alfred quickly latches on the state-of-the-art handcuffs\n     and the blindfold.  The viewer's viewpoint stays on a\n     writhing Hawk.\n\n                              HAWK\n               I'll kill all you.  Even the old\n               lady.\n\n\n     Hawk kicks back on the table, \"jump ropes\" the cuffs,\n     then picks the lock with his teeth.  Hawk rips off the\n     blindfold to see that the entire room is empty except\n     for Alex, standing at the other end, in an incongruous\n     Italian leather coat.\n\n                             ALEX\n               I hated cigarettes until I saw my\n               first No Smoking sign.  Keep off\n               the Grass?  Let's play Soccer.\n               Only law I cared about was\n               friendship.  Broke that one too,\n               didn't I?  This Gates-Mario\n               Brothers-CIA-Mayflower-Da Vinci\n               thing seemed like a sweet deal.\n               Visit foreign lands, take their\n               treasures.  I don't know, I thought\n               you'd get into it.  It's better\n               than playing darts with M.B.A.'s at\n               the bar.  I didn't know it was\n               going to be like this.  Them using\n               me to use you... I'm sorry, there's\n               only one way out of this and it's\n               gonna hurt me more than it's gonna\n               hurt you.\n\n     Alex pulls out a gun from his jacket and clicks it in.\n\n     EXT. FAMILIAR PIAZZA--DAY\n\n     The piazza from the fascist E.U.R. building are bustling\n     with office workers laughing, smoking, and hustling.\n     Darwin, Minerva and Kaplan are a solid troika in the\n     center of the steps.  The other agents stroll in the\n     periphery....\n\n                              KAPLAN\n               I just don't think it was a\n               smoking hot idea to leave them up\n               there alone.\n\n                             MINERVA\n               Don't worry George, this is the\n               reason we put the old diabetic\n               guinea on the payroll to begin\n               with.  To keep Hawk in line.\n               They'll talk about \"being buddies\"\n               and \"chugging brewskis.\"\n\n                             DARWIN\n                       (raising glass)\n               You gotta love male bonding.\n\n     As Darwin slaps Kaplan on the back, behind them, Hawk and\n     Alex come crashing out of the windowed doors of the building.\n\n                              KAPLAN\n               You were saying...\n\n     Moving to the edge of the stairs, Hawk and Alex, latter\n     holding his gun, sprout up from their own debris and\n     continue savagely brawling.  The wigging out passers-\n     by give them space.\n\n                             HAWK\n               You bastard!  You fucked my\n               freedom for a lousy job!\n\n     Alex trembles, going into a diabetic seizure.  He shakily\n     raises his gun.\n\n                             ALEX\n               Hawk... I'm so sorry...\n\n     Hawk roars forward like a bull and helmets Alex.  They\n     roll together down the massive staircase past Darwin,\n     Minerva, and the CIA who react with \"This can't be\n     happening\" catatonia.\n\n     Two SHOTS go off as Hawk and Alex crash to the bottom of\n     the staircase.  Hawk rises up in a daze to see Alex on the\n     ground with two bloody bullet holes.\n\n                             HAWK\n               No.....Alex!  Wake up, you can't\n               go out like this.\n\n     Hawk falls to his knees as Snickers hustles toward him.\n     Suddenly, sirens are heard as a police van pulls up.\n     Snickers stops.\n\n     Four policemen blast from the back of the van.  One holds\n     back the crowd.  One strenuously pulls Hawk into the van.\n     The other two drag in Alex.\n\n     The villains look to each other for non-existent guidance\n     as the van pulls away.\n\n                             MINERVA\n               Plan B, anyone...\n\n     Using initiative, Snickers hops on a Vespa and roars off\n     after them.  The van can be seen swerving off.....\n\n     AROUND A CORNER\n\n     where it bolts up into a much larger truck marked VATICAN\n     SOUVENIRS.  TWO SEEMINGLY-INNOCENT-BYSTANDER PRIESTS break\n     demeanor to flop up the wheel ramps, slam close the back\n     of the truck, lock it shut, and continue on their solemn\n     way.\n\n     The TRUCK BELLOWS off as the Vespa spins around the corner.\n     Snickers brakes and looks around for the police van.  He\n     hits his handle with frustration.\n\n     EXT. BEAUTIFUL ROME OVERVIEW\n\n     Out of her habit but still in her incredible sunglasses,\n     Anna looks out to a lovely view of Italy.  The Vatican Truck\n     pulls up behind her.  A giddy, blood-stained Alex and a not-\n     so-giddy Hawk bound out of the back.  Alex excitedly gives\n     himself an insulin shot.\n\n                             ANNA\n               Oh thank God, you're dead...\n\n                             ALEX\n               It was so beautiful!  When the\n               blanks went off, they...\n\n     Hawk's fist whooshes into frame and blasts Alex's jaw.\n\n                             HAWK\n               You bastard.  You fucked my\n               freedom for a lousy job.\n\n                             ALEX\n               But I said I was sorry....\n\n                             HAWK\n               No sweat, Alex, you only made the\n               biggest mistake of my life.  What\n               was your per-diem?\n\n                             ALEX\n               Don't act like you've never committed\n               a crime before, Hawkins?  I know, I\n               made call, when Anna tracked me down I...\n\n                             ANNA\n               Hudson, don't you understand...\n\n                             HAWK\n               And you, Dr. Cappucino, you're lucky\n               I don't hit women, assuming you are\n               a woman.  I'm not taking anything for\n               granted anymore.\n\n                             ANNA\n               I-work-for-a-covert-Vatican-humanitarian-\n               organization.  The-CIA-made-a-fool-of-me.\n               I-care-for-you...\n\n                             HAWK\n               Oh.  Well, what's this?\n\n     Hawk pulls out the Demon Head that was in the Mayflower\n     Museum from out of his pocket.  Anna turns white.\n\n                             ANNA\n               Where did you get this?\n\n                             HAWK\n               You know, the place where you gave\n               the bad guys the Codex.... the\n               Mayflower Museum.\n\n                             ANNA\n               It's from the machine.  All they\n               need is the crystal to run it and\n               they have 2/3 of it already.  We\n               can't let that happen.\n\n                             ALEX\n               You're saying you want us to beat\n               them to the crystal and save the\n               world from financial disarray.\n\n                             ANNA\n               Something like that.\n\n                             ALEX\n                       (pulling out plane\n                        tix)\n               Well, forget about it.  Hawk and I\n               are going to Rio.  We're hurt,\n               we're tired, and a hero ain't\n               nothing but a sandwich.  Right,\n               buddy?...\n\n                             ANNA\n               Hudson, God's given you a gift for\n               cat burglary, you can t just...\n\n                             HAWK\n               You better believe I can.  I'm\n               sick of people telling me what I\n               have to do.\n\n                             ANNA\n               It's that kind of selfish attitude\n               that...\n\n                             HAWK\n               Selfish attitude?  I'm just some\n               guy who wants a little nap and a\n               cappuccino for when he wakes up,\n               not too much foam...\n\n                             ANNA\n               You re not \"some guy\" anymore,\n               Hudson.  Right now, you're the\n               only guy.  Without your help, I....\n\n     Anna looks to Hawk with a choked-up expression.  The\n     weight of the world on his shoulders, Hawk turns away\n     to a lovely view, his mind painfully raging and\n     swirling toward peaceful clarity.\n\n                             HAWK\n               The world is beautiful.  Every day\n               in prison I made sure to remember\n               that.  It's only when I actually\n               got out that I forgot.  If I was\n               sane, I'd be on that plane to Rio.\n               But being beaten and abused to\n               fulfill some corporation's\n               perverted vision does something to\n               your mental health.  The world is\n               beautiful and I'm tired of being\n               fucked.\n                       (turning around)\n               It's Darwin and Minerva's turn to\n               bite the pillow...\n\n     Anna involuntarily does the sign of the cross.  Alex\n     goodnaturedly does a jerking off motion.\n\n                             ANNA\n               That was beautiful.\n\n                             ALEX\n               I laughed, I cried.\n\n     Shaking his head, Hawk swipes the plane tickets from\n     Alex.\n\n                             HAWK\n               Rio, Alex?  After all they've\n               done to...Hey, these tickets are\n               for Moscow!\n\n                             ALEX\n                       (knowing smile)\n               Damn travel agency.  That Kremlin\n               thing is in Moscow, isn't it?\n\n     A proud Hawk slaps Alex on the back as some passing\n     ITALIAN LOCALS stop to stare, horrified, at Alex's\n     bullet holes.  Anna sweetly intervenes.\n\n                             ANNA\n               Ketchup.  Stupido Americani...\n\n     The locals give off a slightly dazed \"A-a-h\" and move off.\n\n     INT. THE CONFERENCE ROOM--DAY\n\n     Wind blows through the shattered conference room window.\n     Snickers is banging on his computer apparatus at the\n     table with the Mayflowers and the other agents.\n\n                             KAPLAN\n               We're all family now.  My team\n               has done a lot of rougher things\n               than steal the model of a\n               helicopter.\n\n                             SNICKERS\n               We're going to whack this place\n               so fast we'll have time to shop\n               for American imports.\n\n     Darwin and Minerva politely smile and then turn away to\n     each other with knowing looks.  The computer screen shows\n     the familiar image of the Kremlin building that turns\n     into a complex look at interiors the viewer will later\n     see.\n\n                             ALMOND JOY\n               Lucky for us, the Da Vinci is\n               located in a wing of the Kremlin\n               that they used to throw the Miss\n               Ukraine pageant and stuff.  It'll\n               have the least number of guards....\n\n                             KAPLAN\n               As for our plan of action,\n               anybody'd be insane to go in\n               from the ground floor...\n\n     INT. A VAN-BUS--NIGHT\n\n     A head-rubbing Hawk and a stomach rubbing Alex kneel on\n     the floor of a moving van, over a barely legible drawing\n     of what was so neatly delineated on the CIA computer.\n     Both guys are dressed as priests and are chewing gum.\n\n                             ALEX\n               We're going in from the ground\n               floor.\n\n                             HAWK\n               Geez, this Art Treasures Room\n               looks like a burnt diaphragm.\n\n     Hawk laughs and pops up into the passenger seat.  Anna\n     is revealed to be driving in her habit.  Hawk gives her\n     a kiss.\n\n                             HAWK\n               Hey, don't take your disguise so\n               seriously.\n\n                             ANNA\n               Uh, yeah.  Guess I'm a wee bit\n               nervous.  I'm sorry I could only\n               score clergy passports.\n\n                             HAWK\n               Fits my new image.  A thief for\n               the masses.  This is one job I'm\n               not going to feel guilty about\n               enjoying.  Gum.\n\n     Hawk, Alex, and Anna all spit out their gum into a bag\n     Hawk holds.\n\n                             ALEX\n               The security's actually not that\n               severe.\n\n                             ANNA\n               It doesn't have to be.  Everybody\n               knows that if you mess with the\n               Kremlin, you'll end up in a\n               Siberian gulag eating your own\n               fingernails.\n\n     Hawk takes in some views of Moscow that remind one of\n     Budapest.\n\n                             HAWK\n               Shwoof, that makes me feel better.\n               I can't believe this is the Iron\n               Curtain.  All the guy at Airport\n               customs wanted to know was \"Who\n               Shot J.R.?\"\n\n                             ALEX\n               You sound disappointed.\n\n                             HAWK\n               Yeah, I mean, come on, going\n               through the Iron Curtain is\n               supposed to be crawling\n               underneath barbed wire, it's\n               supposed to be strangling a\n               guard...\n\n     THE VAN\n\n     passes a textbook shot of the Kremlin in the distance.\n\n                             HAWK (V.O.)\n               It's supposed to be parachuting\n               in the moonlight....\n\n     EXT. THE TOP OF THE KREMLIN--NIGHT\n\n     Kaplan, Snickers, Almond Joy, and Butterfinger slam down\n     upon the roof of the Kremlin and discard their\n     parachutes.\n\n     Snickers opens up his computer screen, upon which is the\n     image-map of the Kremlin with a flashing blue light at\n     the top of the building and a flashing green one inside.\n\n                             SNICKERS\n               We are the blue light.  The green\n               light is where the Art Treasures\n               room is.\n\n                             KAPLAN\n               Let's go make a purple light.\n               Where's Kit Kat?\n\n     EXT. THE KREMLIN GROUNDS\n\n     Dressed in cat burglar black and all chewing gum, Hawk,\n     Alex, and Anna crawl across the Kremlin grounds.  They\n     scope out a shabby Delivery Entrance.\n\n                             ALEX\n               Delivery Entrance.  Low Security.\n\n                             ANNA\n               Gum.\n\n     All three spit out their gum into Hawk's bag.\n\n                             HAWK\n               Count of three?\n\n                             ALEX\n               Why not just go now?\n\n                             HAWK\n               Okay.\n\n     The Trio rush for the door.\n\n     THE KREMLIN ROOF\n\n     SOVIET GUARD ONE comes out on the roof to light a cig-\n     arette.  He looks in the distance to the motivating CIA\n     team.  Suddenly a card floats down into his hand.\n\n     It reads:   WILLIAM TELL.  ADAM'S APPLE.  GET IT?\n\n     The not-getting-it Guard looks up from the card as a\n     grinning Kit Kat parachutes behind him.  The Guard\n     swerves around and Kit Kat savagely skewers him with a\n     crossbow shot to his Adam's apple.\n\n     THE DELIVERY ENTRANCE\n\n     Hawk, Anna, and Alex race to the door, the latter\n     bashes it...\n\n     INT. GRUNGY WHITE FOYER\n\n     open and sets off an annoying hammer-against-bell alarm.\n     Alex all-fours beneath the alarm.  Hawk does a Michael\n     Jordan vault off Alex's back and slam dunks A MASSIVE\n     BALL OF USED-GUM, pulled from his bag, between the\n     hammer and the bell, cutting off the sound.  They rush\n     ahead.\n\n     EXT. THE KREMLIN ROOF\n\n     The agents are trotting across the roof when a phone on\n     Snickers' apparatus rings.  Kaplan answers it.\n\n                             KAPLAN\n               Everything's going fine, Minerva,\n               thanks for asking...\n\n     INT. NONDESCRIPT HALLWAY\n\n     Minerva chats on a cellular moving down a hallway, with\n     Darwin, who is holding in his laughter as if this was a\n     great crank.\n\n                             MINERVA\n               I say who needs this Hudson Hawk\n               anyway....\n\n     INT. A GRAND BALLROOM\n\n     The good guys scurry upon the second level of an epic\n     and gorgeous ballroom.  Two lush staircases lead up from\n     the floor.  From behind a pillar, the gang checks out\n     the activity below.\n\n     A tablecloth is being wrangled over a large table at\n     the opposite end of the ballroom by SERVANTS.  Threaten-\n     ing SOVIET SOLDIERS maneuver on the floor.\n\n                             HAWK\n                       (Wizard of Oz)\n               Oh-Eee-Oh-A-Whoa-Oh.\n\n     They then make a mad scuffle across their side of the\n     second level, hunkering down by the level railing.\n\n     As they move into another wing hallway, the viewer's\n     viewpoint moves back down to the ballroom floor to see\n     a gloating DARWIN AND MINERVA ENTER, the latter still\n     on the phone.\n\n                             MINERVA\n               Everybody here, in Rome, wishes\n               you tinsel boxes of love...\n\n     The servants move away from the tablecloth and the\n     table, revealing that it is shaped like an M.  A GROUP\n     OF SERIOUS SOVIET V.I.P.'s come out to join the\n     Mayflowers at the table.\n\n     THE ROOF\n\n     Kaplan hangs up the phone.\n\n                             KAPLAN\n               Lazy, rich, condescending bitch.\n\n     The team moves up to the rooftop doorway where Kit Kat\n     is.  He holds up an \"About Time\" card.  The agents laugh\n     and greet them.\n\n     INT. A VERY LONG, ENIGMATIC HALLWAY\n\n     Hawk, Alex, and Anna pass through a set of windowed\n     double doors into a very long hallway that leads into a\n     pitch darkness.  A MURAL OF A HAPPY, ARM-STRETCHED LENIN\n     looms above the doors.  They give it a a quick glance\n     before pulling out screwdrivers and wire hangers.\n\n                             ALEX\n               Eighth room down, babe...\n\n                             ANNA\n               Guards come exactly every three\n               minutes....\n\n                             HAWK\n               Three.  Oh.  Oh.  \"Side by Side.\"\n\n     Our trio charges down the hallway.\n\n                             HAWK\n               \"Oh, we ain't got a barrel of\n               money.\n\n                             ALEX\n               \"Maybe we're ragged and funny.\"\n\n     They reach a MASSIVE SPOOKY DOOR WITH AN ODD, ANCIENT\n     LOCK.  They go to work on it.  Not losing the beat.\n\n                             HAWK AND ALEX\n               \"But we'll travel along, singing\n               a song.  Side by Side...\"\n\n     INT. TOP FLOOR HALLWAY\n\n     With a gust of wind, Kaplan and the Candy Bars bluster\n     through the rooftop door into another hallway, where\n     SOVIET GUARDS TWO AND THREE are taking it easy.\n\n                             KAPLAN\n               Create a diversion.\n\n     Snickers and Butterfinger calmly blow away both guards\n     with silenced mini-Uzis.\n\n     SOVIET GUARD FOUR rushes out a door before the agents,\n     zipping up his fly.  Almond Joy twists his neck with an\n     agonizing SNAP.\n\n     THE LONG HALLWAY\n\n     Hawk, Anna, and Alex retreat beneath the Lenin mural\n     through the windowed double doors.\n\n     Behind the doors, they poke up to see a BESPECTACLED\n     GUARD emerge from the darkness to check out the door.\n\n                             ALEX\n               Now that's a lock.\n\n                             HAWK\n               Don't worry, we'll get it...\n\n                             ANNA\n               Can I sing this time, too?\n               Please?\n\n     Hawk and Alex are not thrilled about the idea, but Anna's\n     eye flutter does it.\n\n                             HAWK\n               Uh, I guess so.\n\n     The Bespectacled Guard moves back into the darkness.\n\n     THE BALLROOM\n\n     The Soviet V.I.P.'s open up presents of pink L.A. GEAR\n     tennis shoes, silly T-shirts, and Nintendo joysticks\n     as a standing Darwin hypnotizes them.\n\n                             DARWIN\n               I look at you Soviet people and I\n               feel... pity... superiority.  Most\n               of your life, your government has\n               told you that Capitalism turns\n               people into robots who'd rather\n               eat microwave sushi, naked in the\n               back of a Cadillac than hear the\n               laughter of children.\n\n                             MINERVA\n                       (smiling)\n               We're here to say, your government\n               was right.\n\n                             DARWIN\n               So let's get busy.  Have some fun\n               and make some deals.\n\n     AT THE LOCK\n\n     Alex holds a lit match into the lock, while Hawk\n     does something incomprehensible with a screwdriver.\n     They are improvising...\n\n                             HAWK\n               \"Oh this lock is a pain in the bu-utt\"\n\n                             ALEX\n               \"How'd we ever get such in a ru-utt\"\n\n     Anna suddenly, booms out the chorus in a way that Hawk and\n     Alex can barely concentrate.\n\n                             ANNA\n               \"But we'll travel the road, Sharing\n               the load.  Side by Side!\"\n\n     THE HALLWAY ABOVE\n\n     The CIA team saunters through corpses up to a door\n     similar in lock and design to the one Hawk and Alex\n     are working on.\n\n     Snickers's computer screen shows the blue light directly\n     above the green light.\n\n                             SNICKERS\n               This is the room above the Art\n               Treasures room.  The lock is a\n               Natalya Z-Z, first created...\n\n                             ALMOND JOY\n               Snickers, baby, I love you like a\n               brother, but really, who cares?\n               Silencer bomb...\n\n     Butterfinger pulls from around his shoulder a strange\n     rifle.  He attaches to the front of it;, a glass encased,\n     suctioning time-bomb from a waist satchel.  He fires\n     the bomb against the door and it starts ticking.\n\n     BEHIND THE WINDOWED DOUBLE DOORS\n\n     come Hawk, Alex, and Anna, panting.\n\n                             HAWK\n               That was close....\n\n                             ALEX\n               Anna, I think you better stay....\n\n                             HAWK\n               You can be lookout!.....  Take\n               Alex's gun.\n\n     Alex hands Anna his gun, who glumly takes it like a Little\n     Sister not allowed to play.  Hawk and Alex go back through\n     the doors.\n\n     THE HALLWAY ABOVE\n\n     The CIA bomb blows up the door with a weird silencer\n     sound.  Kaplan and the Candy Bars giddily whoop as they\n     rush through the smoking door.\n\n     THE BALLROOM--SECOND LEVEL\n\n     Anna meanders across the second level muttering to herself\n     in Italian and amusingly imitating Hawk's condescension.\n\n                             ANNA\n               \"You can be the lookout.\"\n\n     Anna suddenly moves past the pillar to see the Mayflowers\n     and the V.I.P.S.  She gasps and hurls herself behind the\n     second level railing.\n\n     THE BALLROOM FLOOR\n\n     A VERY DIGNIFIED SOVIET LEADER, in a SHIT HAPPENS baseball\n     cap, addresses Darwin.\n\n                             SOVIET LEADER\n               Before we serve you \"the main course,\"\n               hee, hee, we need to know specifics\n               about what you can do for us.  We--\n\n                             DARWIN\n               Bluntness.  How amusingly Hungarian.\n               Listen up, for reasons I don't want\n               to get into, I recently had to close\n               down a petroleum factory, but I'm\n               going to re-build it here and\n               Madonna's going to cut the ribbon!\n               Frozen burritos in Leningrad.  1982\n               fantasy.  1992 reality.\n\n     THE LOCK OUTSIDE THE DOOR\n\n     Hawk and Alex more frantically toil on the lock.\n\n                             HAWK\n               \"We all had our quarrels and\n               parted...\"\n\n                             ALEX\n               \"But we'll be the same as we started...\n\n     The lock clunks open.  They race through the doors into...\n\n     INT. THE ART TREASURE ROOM\n\n     Hawk and Alex weave through the room which is crammed,\n     with little nuance, to the gills with great art treasures\n     including an impressive array of Faberge eggs.  A solid\n     gold hammer and sickle hang on one wall...\n\n                             HAWK AND ALEX\n               \"Just traveling along, singing a\n               song.  Side--\"\n\n                             HAWK\n               Geez, this place is a mess...\n\n                             ALEX\n               Voila...\n\n     They rumble toward an opening in the wall of the room\n     covered by a small curtain that has the Da Vinci Man in\n     the Circle drawing emblazoned across it.  Hawk reaches\n     for the curtain.  Alex puts his arm around him and speaks,\n     not sings.\n\n                             ALEX\n               Side by side, man...\n\n     Suddenly, the roof above them explodes.  Kaplan and the\n     Candy Bars drop down behind them.\n\n                             ALMOND JOY\n               What the hell....\n\n                             SNICKERS\n               You're supposed to be dead!\n\n                             ALEX\n               I'm a ghost.  Boo.\n\n                             HAWK\n               I don't want to sound immature,\n               but we were here first...\n\n                             KAPLAN\n               I wish I could think of those cute\n               quips the way you can, Hawk, but\n               I can't, so I'll just shoot Alex.\n\n     Kaplan point blank shoots Alex in the chest.  Alex\n     crumples backward, moaning.  Butterfinger, casually, but\n     with incredible strength, holds Hawk's arms behind his\n     back.\n\n                             HAWK\n               No....\n\n                             ALMOND JOY\n               That was pretty uncool, George...\n\n                             KAPLAN\n               Sorry, you know he kind of reminds\n               me of Little Eddie.  But I digress.\n               Ah, victory is so sweet....\n\n     Kaplan pulls back the Da Vinci curtain.  Nothing is there.\n\n     THE BALLROOM BANQUET\n\n     A SOVIET CHEF lifts up a silver domed serving tray,\n     revealing the Da Vinci helicopter model.\n\n                             MINERVA\n               Yum.  This is the best meal I\n               ever had...\n\n     ANNA\n\n     bulges her eyes at the revelation.  She pulls out Alex's\n     gun and bangs herself in the head.  What to do....\n\n     THE ART TREASURES ROOM\n\n     Kaplan is bugging out.\n\n                             KAPLAN\n               Damnit, this isn't the plan!\n               Blue light, green light, shit!\n               Snickers, Kit Kat, A.J., scramble,\n               see if you can find out anything.\n\n     They thunder out.  Hawk, still in Butterfinger's\n     oblivious clutches, shouts..\n\n                             HAWK\n               Can't you see the Mayflowers\n               double-crossed you...\n\n                             KAPLAN\n               They may be scum, but if I get the\n               Da Vinci model back, then we'll be\n               roasting weenies on the beach.\n\n                             HAWK\n               I don't think you'll appreciate\n               their choice of weenie.\n\n     Kaplan raises his gun.\n\n     THE BALLROOM BANQUET\n\n     Darwin holds the Da Vinci model in one hand and raises\n     a glass of vodka in the other.\n\n                             DARWIN\n               You're helping us achieve a goal\n               and in return, I'm giving you a\n               key to the world's executive\n               washroom.  Don't piss it away....\n               Skoal, amigos...\n\n                              ANNA (O.S.)\n               Stop or I'll shoot.\n\n     Minerva and some various Soviet VIPS spew their vodka to\n     look up to Anna pointing a gun down at them from the\n     second level.  She is shivering, shaking the gun.\n\n                              ANNA\n               You people are immoral and\n               narcissitic and I won't let you...\n\n     In unison, the Soviet Soldiers surrounding the table\n     begin machine gunning up at her.  She dives behind the\n     railing.\n\n     THE ART TREASURES ROOM\n\n     Kaplan lowers his gun.\n\n                             KAPLAN\n               I can't believe this.  I'm in\n               fucking Russia, or do I have to\n               say, the fucking Soviet Union and\n               I'm shooting a non-Bolshevick.\n                       (raising back up\n                        his gun)\n               I never thought I'd say \"I'm just\n               in this job for the money.\"  Sad.\n               Any last immature quips?\n\n                             HAWK\n               No.\n                       (a beat)\n               But why do you let Butterfinger\n               keep those blood stains on his\n               shirt?\n\n     Falling for the oldest trick in the book, Butterfinger\n     looks down to his shirt.\n\n                             BUTTERFINGER\n               What blood stains....\n\n     Hawk bounces up to savagely head-butt Butterfinger.\n     Butterfinger slams back against a wall causing the Gold\n     Sickle to fall down around his neck and knock him to the\n     ground, pinning his head to the floor.  The Gold Hammer\n     next trembles off the wall and crushes Butterfinger's\n     skull.\n\n                             HAWK\n               You want immature, how 'bout an\n               egg fight...\n\n     Hawk flings a Faberge egg, smashing the gun out of Kaplan's\n     hand.  Hawk pelts a batch more at him.  Kaplan sloppily\n     whips some eggs back.  Hawk finally smashes one in half\n     and beans the jagged piece into Kaplan's eye.  He squeals\n     to the ground, geysering blood.\n\n     Hawk swoops down to a wheezing, breath controlling Alex.\n\n                             HAWK\n               Alex, are you....\n\n                             ALEX\n               I can't believe you didn't notice.\n               My weight.  I lost ten pounds in\n               Rome\n\n                              HAWK\n               You're a reed, man.  I gotta get\n               Anna.  Hang in there...\n\n     THE BALLROOM\n\n     Bullets stop splintering around Anna at the railing as\n     the soldiers fling out their empty cartridges to reload.\n\n     Snickers, Almond Joy, and Kit Kat race out of the hall-\n     way area into the ballroom area.  They stop at the sight\n     of Anna....\n\n                             ALMOND JOY\n               Anna-bannana-fo-fanna, I guess I\n               have to cut out your heart for\n               real now.  It's not personal.\n\n     Anna feebly raises her gun.  Almond Joy laughs and\n     pulls out a knife.\n\n                             ALMOND JOY\n               You won't shoot.  I read your\n               dossier... Sister.\n\n     The Soviet Soldiers snap in new cartridges as Almond Joy\n     moves out from behind the pillar towards Anna.  The\n     Soldiers blast away at this newly appearing figure.\n\n     Almond Joy ruptures and vibrates in a Sonny Corleone\n     ballet.\n\n                             ALMOND JOY\n               I gotta get a new job...\n\n     Snickers and Kit Kat militarily roll on either side of\n     Anna as their partner wilts to the ground.  The men,\n     Snickers with his mini-Uzi, Kit Kat with his cross-\n     bow rifle, briefly leap up to fire down at the soldiers\n     with some graphic success.\n\n     Anna watches Darwin and Minerva head up the stairs to\n     her level.  She bolts off....\n\n     BALLROOM FLOOR\n\n     The last of the Soviet VIPS flee as the Soldiers tip\n     over the M shaped table on its side, using it for\n     cover, firing upward.\n\n     KIT KAT\n\n     breaks off and scurries around the second level to get\n     a position behind the M.\n\n     He fires down an arrow for a successful kill.  Another\n     guard tries to fire up, but Kit Kat impales him to the\n     back of the table with a quality shot.\n\n     Kit Kat grins and reloads as Alfred, the butler, regally\n     creeps behind him.\n\n     HAWK\n\n     comes out of the long hallway double doors up to where\n     Anna is bustling.  They hug...\n\n                             ANNA\n               The Mayflowers got...\n\n     Hawk and Anna turn to see the Mayflowers hastening in\n     their direction.  Noticing them back, the model-toting\n     Mayflowers halt.\n\n     KIT KAT\n\n     turns to Alfred and fires his crossbow.  Alfred effort-\n     lessly cuts it in half with his blade and continues\n     to move forward.  Still smiling, Kit Kat tries to reload.\n\n     MINERVA\n\n     breaks the standstill.\n\n                             DARWIN\n               What a pleasant surprise.  You're\n               probably wondering...\n\n                             HAWK\n               But you're going to tell us\n               anyway...\n\n                             MINERVA\n               I hate a man with a sense of\n               humor.  While you corn dogs were\n               comparing the lengths of your\n               masculinity, we obtained the\n               helicopter the new fashioned\n               way: a thoroughly corrupt business\n               deal.\n\n                             HAWK\n               If you think you're getting past\n               me...\n\n     Grunting behind them, Snickers gun-butts Hawk to the\n     ground.\n\n                             HAWK\n               Don't be stupid...they...\n\n                             SNICKERS\n               Bastard!  If you were a true\n               American.\n\n                             HAWK\n               Just shut up and hit me!\n\n     Snickers swings a punch.  Hawk blocks it then whomps\n     him in the chest.\n\n     As they battle, Darwin grabs Anna's hair, slams her\n     into a pillar, and watches her crumple.\n\n     KIT KAT\n\n     gets in an arrow but it's too late.  Alfred stabs\n     him deep, deep, deeply, and lifts him from the ground.\n\n     A shower of cards reading \"OUCH\" \"PAIN\" and \"THIS REALLY\n     HURTS\" rain from out of Kit Kat's coat.\n\n     Alfred discards him over the edge.\n\n     Kit Kat sails down upon the M.\n\n     The lone card of \"FUCK\" plops from his open eyed corpse.\n\n     HAWK\n\n     and Snickers trades fierce blows, stumbling down a\n     staircase.\n\n     DARWIN\n\n     and Minerva watch the fight with amusement.  Alfred\n     approaches.\n\n                             DARWIN\n               Alfred, the getaway car...\n\n     SNICKERS\n\n     slashes Hawk in the arm with a small but sinister blade.\n\n                             HAWK\n               Damnit, I hate this!  I'm a cat\n               burglar!  Nobody said anything\n               about this fight-to-the-death\n               shit.\n\n                             SNICKERS\n               Too bad.\n\n     Snickers goes for a final thrust when suddenly one of the\n     silencer time bombs suctions to his head.\n\n     Hawk turns to see Alex, barely standing, at the top of\n     the stairs, holding the strange rifle.\n\n     Darwin and Minerva turn to this dramatic entrance.  They\n     start to trot off...\n\n                             MINERVA\n               I knew it!  I told you it was a\n               fake.\n\n                             DARWIN\n               That New-York-Italian-Father-\n               made-twenty-bucks-a-week-son-\n               of-a-bitch.  What was our bet?  A\n               million?\n\n                             MINERVA\n               Million five, lover...\n\n     HAWK\n\n     boots Snickers down the stairs.  Snickers somersaults\n     up and frantically tries to pull off the bomb.\n\n     Snickers wails to the soldiers, who have lowered their\n     guns and are poking their heads out of the M to watch.\n\n                             SNICKERS\n               Help me you Democratic Reform\n               lovers!  Get a screwdriver, you\n               Stupid Eskimoes!  Screw-dri-ver!\n               Oh God, I always wanted to know\n               how to play the harp, there\n               just was so little time!  Rosebud!\n\n     The soldiers high-tail it out.  Snickers plugs his ears.\n     Nothing happens.\n\n                             SNICKERS\n               Maybe it was just a....\n\n     Snickers blows up gloriously before the M.\n\n     THE STAIRCASE\n\n     Hawk bounds up to Alex, who puffs down onto the steps.\n\n                             ALEX\n               Get 'em.  They went down the\n               hallway.\n\n                             HAWK\n               Let's just forget it, I mean...\n\n                             ALEX\n               Get em....\n\n     Hawk rushes up the. stairs, gives a \"What can I do?\" glance\n     to the unconscious Anna, and then continues rushing, past\n     a pillar.  Minerva emerges from behind the pillar and\n     moves forward.\n\n     THE LONG ENIGMATIC HALLWAY\n\n     Hawk chugs beneath the Lenin mural and down the hall-\n     way.  He sees Darwin breezing in front of him.  Darwin\n     looks back to Hawk then runs forward into the darkness.\n\n     THE BALLROOM\n\n     Minera sits down next to the pained Alex.\n\n                             MINERVA\n               Alex.  How's it going?\n\n                             ALEX\n               Go, go to Hell, to Hell.\n\n     Minerva pulls out a candy bar and rips it open.\n\n                             MINERVA\n               Where's your insulin....No?  Well,\n               Bon Appetite.\n\n     Minerva savagely slams Alex's head down and shoves the\n     candy bar in his mouth.\n\n     THE HALLWAY\n\n     Hawk moves closer and closer to the darkness of the\n     hallway when a one-eyed and bleeding George Kaplan dives\n     out of the Art Treasures room and tackles him.  Hawk\n     kicks him off...\n\n                             HAWK\n               Oh, come on....\n\n     THE BALLROOM\n\n     Alex gulps down the last of the candy bar, shivering.\n\n                             MINERVA\n               Very good, Alex, but you re\n               still alive....\n\n     She pulls out another candy bar.  Alex, with a last\n     burst of strength, punches her across the face.\n\n                             MINERVA\n               That's fair.\n\n     THE LONG HALLWAY\n\n     Hawk and Kaplan lock onto each other's throats.\n\n                             HAWK\n               Why does this have to be so hard...\n\n                             KAPLAN\n               Tell me about it...\n\n     Suddenly, of all things, a car is heard rumbling in the\n     darkness.\n\n     Hawk and Kaplan stop fighting and turn to see THE MAY-\n     FLOWER LIMOUSINE screeching out of the darkness with\n     Darwin standing out of the sunroof firing a gun.\n\n     Bullets fly around them.  From his back pocket, Hawk\n     slaps the nice picture of him and Little Eddie into\n     Kaplan's hands.\n\n                             HAWK\n               Take this to Hell with you...\n\n     Hawk jumps up and grabs a hanging lamp.\n\n     Deranged with confusion, Kaplan turns from the picture\n     to the charging limousine.\n\n                             KAPLAN\n               My pension.....\n\n     The driving Alfred smiles through the windshield.\n\n     Kaplan's body slams into a vivid somersaulting crash\n     into the windshield.\n\n     Hawk's hands burn and sizzle on the hanging lamp.\n\n     Passing beneath, Darwin raises up his gun.\n\n     Hawk lets go of the lamp and drops down on Darwin,\n     locking his legs around his neck and crushing him\n     down into....\n\n     THE BACKSEAT OF THE LIMOUSINE\n\n     Hawk and Darwin grapple on the floor of the limo.  The\n     Da Vinci helicopter model bobs on the backseat.  Darwin's\n     gun goes off..\n\n     right through Alfred's throat.  He slumps over, pressing\n     down on the accelerator.\n\n     THE LIMOUSINE\n\n     blasts down the hallway, sparking off the wall, and\n     bashing off paintings and mirrors.\n\n     THE BACKSEAT\n\n     Darwin flicks on his paper shredder and shoves the side\n     of Hawk's hand into its teeth.\n\n     OUTSIDE THE LIMOUSINE\n\n     A mist of blood coughs out of the shredder vent and makes\n     a weird bloody line across the wall.\n\n     INT. BACKSEAT\n\n     Hawk yanks his hand from the shredder and grabs the meg-\n     lomaniac by the hair and shoves his head down on the\n     arm rest.  Hawk turns on the piercing siren and Darwin's\n     eyes try to escape his head with a high pitched scream.\n     Darwin's entire body bucks wildly.\n\n     Darwin back-elbows Hawk and moves down for his gun.\n     Hawk pulls him back by his hair, grabs him by the balls,\n     and pushes him upward through the sunroof.\n\n                             DARWIN\n               God-damnit, I only wanted to\n               destroy the world in my own image.\n               I'm a regular Joe...\n\n     Darwin pounds his fists on Hawk's head as Hawk hits the\n     sunroof switch sliding it shut on Darwin, pinning\n     his arms below the roof, but leaving his torso twisting\n     in the wind.\n\n     The mural of a happy Lenin with his arms outstretched\n     looms ahead waiting to greet Darwin.\n\n     Putting two and two together, Darwin loses it....\n\n                             DARWIN\n               Not Lenin, anybody but Lenin.  God,\n               let's talk abut this.\n\n     The limousine charges through the double doors and Darwin's\n     body connects with the mural.\n\n     INSIDE THE LIMO\n\n     Hearing the crunch, Hawk flips into the front seat and\n     brakes the vehicle.  Alfred's head bounces against the\n     steering wheel.  Hawk reaches over with a grin and picks\n     up the Da Vinci model.  He looks to Alfred, Kaplan\n     crunched in the windshield, and Darwin's dangling legs.\n\n                             HAWK\n               Wow, this is really gonna hurt the\n               resale value...\n\n     THE BALLROOM\n\n     Hawk runs up to a woozy Anna and helps her up.  She has\n     a cross-shaped blood stain on her forehead.\n\n                             HAWK\n               Oh, honey....\n\n     Hawk looks to Alex, sitting on the stairs, the same way\n     he left him.  Hawk rushes to him.\n\n                             HAWK\n               We did it man, we...\n\n     Hawk grabs Alex's shoulder.  Alex falls back.  Written\n     over his face in red lipstick is REALLY DEAD.\n\n     Engaging a slow motion sequence, Minerva saunters behind\n     Anna, putting on red lipstick.  Minerva slams her back\n     to the ground.\n\n     Hawk howls then turns to see stiff-upper-lip Alfred,\n     bleeding from the neck.  Hawk tries to throw a punch,\n     but Alfred blocks it and crunches him across the face.\n\n     The Da Vinci helicopter model bounces down the stairs\n     in slow motion and cracks open, revealing the intricate\n     mirror of the opening scene.\n\n     INT. DARK ROOM ATOP MAYFLOWER MUSEUM--DAY\n\n     A damaged Hawk awakens in a dungeonish room and stumbles\n     to some shutters.  \"O Solo Mio\" returns on the sound-\n     track as the shutters open to a postcard view of Vinci.\n\n     Hawk closes the shutters and cuts off the music.  A\n     slightly more composed Anna touches his shoulder causing\n     him to jump slightly.  They melt into a kiss.\n\n                             ANNA\n               Oh Hudson...\n\n                             HAWK\n               I told you not to call me Hudson.\n               The only people who called me that\n               were the nuns at...\n\n                             ANNA\n               Oh Hudson, I'm a sister of the\n               Catholic church as well as an\n               agent.\n\n                             HAWK\n                       (cut-off laugh)\n               This is too bad to be false.\n\n     Alfred enters the room in his favorite outfit with a\n     bandage around his neck.  His voice is strange, but still\n     polite.\n\n                             ALFRED\n               Welcome back to Vinci.\n\n                             HAWK\n               Last rites, sister?\n\n                             ANNA\n               Please, no nun jokes...They're a\n               bad habit to get into....get it?\n\n     Hawk and Anna unconvincingly laugh then sadly pause.\n\n                              HAWK\n               She killed Alex.\n\n     Alfred gives them a push.\n\n     INT. THE DA VINCI WORKSHOP\n\n     Alfred leads them through the Da Vinci workshop past the\n     bat winged glider and incongruously crammed-in tennis ball\n     machine.\n\n     INT. THE ROOM OF THE GOLD MACHINE--DAY\n\n     Alfred grandly opens double-doors to reveal that Da\n     Vinci's gold machine has been majestically re-created\n     piece by piece.  In the periphery, the 90's rears its\n     head in the form of THREE TECHNICIANS wearing headsets\n     and gun holsters who consult computer terminals.\n\n                              MINERVA (O.S.)\n               GOLD-FI-ING-ER!\n\n     Hawk and Anna turn to see Minerva splashily enter in\n     sexy funeral-wear.\n\n                              MINERVA\n               Sorry, I couldn't resist.  You're\n               probably wondering why you're\n               still alive.  Anna.....\n\n     As Minerva speaks, TECHNICIAN ONE forcibly escorts Anna\n     toward a stand near the gold machine and tightly\n     handcuffs her to it.\n\n                              MINERVA\n               I want you to monitor the Da\n               Vinci's directions from the\n               apprentice diary.  And Hawk, I\n               didn't want you to go to hell\n               without knowing that Darwin and\n               I's dream came true.\n                       (suddenly sheepish)\n               Beside that, none of us can seem\n               to put that damn crystal together.\n               Alfie and I were up all night with\n               the thing.\n\n     TECHNICIAN TWO commences a forcible escort of Hawk to the\n     gold machine.  Hawk cold-cocks him to the ground.\n\n                              HAWK\n               You killed a friend.  Why should I\n               help you go for the gold?\n\n                              MINERVA\n               It'll take a couple of years of\n               steady production, but I'll flood\n               the market with so much gold that\n               gold itself, the foundation of all\n               finance, will lose its meaning.\n               Brokers, economists, and fellow\n               entrepreneurs will drown in the\n               saliva of their own nervous\n               breakdowns.  Markets will crash-\n               crash.  Financial Empires will\n               crumble-crumble.\n\n                              HAWK\n               Except yours-yours.  The goal of\n               world domination.  Well, if you\n               put it that way, Minnie.  How can\n               I resist?\n\n                              MINERVA\n               You can't, convict!  You're just\n               a shmoe!  Every shmoe has the\n               fantasy the planet revolves around\n               them.  It rains, car crash stops\n               traffic, you say \"How could this\n               happen to me?\"  It's a natural\n               inclination.  But for I, this\n               isn't a fantasy, it is reality!\n               You are on my planet!  You walk\n               around the corner for coffee, out\n               of my sight, you do not fucking\n               exist!  The lives of shmoes like\n               you have meaning only in relation\n               to the rich, to the powerful, to ME!\n\n     Anna looks at the oil cloth diary before her.  She pulls\n     a compact from her pocket and holds the compact mirror\n     over the scribblings.  Reading off the reflection, her\n     eyes widen.\n\n                              ANNA\n               Do it.  There's no reason to fight\n               anymore.  She's a force of nature.\n\n     Trying to get a grip on Anna's words, Hawk lets himself\n     be escorted to another stand before the gold machine that\n     has the two complex crystal parts and the weird mirror.\n\n                              MINERVA\n               If you pull this off, I can't\n               promise I won't kill you.  I mean,\n               who we trying to kid?  But I will\n               spare the Flying Nun here....\n\n                              HAWK\n               And to think I thought you were\n               Evil Incarnate in pumps.\n\n                              MINERVA\n               I killed some lovable working\n               class Italian-diabetic, but you\n               killed the most significant male\n               figure of the decade and a kind,\n               gentle lover.  So don't play with\n               me.\n\n     Minerva flicks a switch on the stand Anna's handcuffed\n     to.  Anna vibrates, being electrocuted.\n\n                              HAWK\n               Okay, fine!\n\n     Minerva switches it off.  Giving himself a head rub, Hawk\n     bears down on the three oddly malleable objects.  He\n     TANGLES and BENDS and with a loud SNAP, puts them\n     together, forming the Crystal from the opening scene.\n     Minerva snatches it from him and puts on a head-set.\n\n                              MINERVA\n               Oh Hawk, don't ever change.  Go,\n               team, go!\n\n     Minerva giddily sets the crystal in the same place as Da\n     Vinci had it in his machine.\n\n     Using a long steel pole, Technician One adjusts a myriad\n     of mirrors so they are in a proper angle with a series\n     of lenses culminating on the top of the machine.\n\n     Technicians Two (black-eyed) and Three pour various\n     chemical powders and liquids into corresponding compart-\n     ments on the machine, beautifully decorated by the\n     chemical's zodiac sign.\n\n     Alfred places a lead bar in its proper place.\n\n     Hawk glides to Anna and undoes her handcuff.\n\n                              HAWK\n               I hope you know what....\n\n                              ANNA\n               Trust Leonardo....\n\n                              HAWK\n               Wha.....\n\n     Anna puts her fingers on his lips.\n\n     Minerva throws a lever.  Steam begins to percolate from\n     the furnace towards the machine.\n\n                              MINERVA\n                       (into the headset)\n               We're for real.\n\n     THE MACHINE\n\n     begins to rotate, at first clunkily, then faster.\n     The Crystal rotates comfortably in its compartment.\n\n     The machine throws out its folding arms, each with an\n     element.  The arms click higher.\n\n     The goggled technicians stand before a time-coded video\n     monitor, taking notes.\n\n     The chemical housings open and the chemicals begin to\n     spill and drop through brass tubes.\n\n     ANNA\n\n     murmurs to Hawk.\n\n                              ANNA\n               Da Vinci made the real directions\n               in a secret script that I decoded.\n               The way the machine is running\n               now, the gold will produce too\n               quickly, clog, and the machine\n               will shut itself down.  Isn't it\n               wonderful?\n\n                              HAWK\n               Yeah, but what would happen if that\n               little mirror came out of the\n               crystal.\n\n                              ANNA\n               Wha -- you don't want to know...\n\n     Hawk pulls out the mirror from his pocket.\n\n                              HAWK\n               I wanna know...\n\n                              ANNA\n               Holy sh-h--things are going to\n               get very interesting, very fast.\n               Da Vinci would be proud of you.\n\n     IN THE MACHINE\n\n     The chemicals snake down their individual paths to the\n     Lead Bar spinning its trough.  There's a FLASH and a\n     controlled but jarring explosion.\n\n     EVERYONE\n\n     doubletakes.  Hawk reaches down to the six foot steel\n     pole and with one swing slams the faces of all three\n     deep in concentration Technicians to the ground.\n\n     Oblivious to the violence behind her, Minerva, pulling\n     on goggles over her head-set, moves closer with a\n     religious purr.\n\n     THE MACHINE\n\n     triggers a fresnel lens and laserlike beams bounce around\n     the mirrors faster and faster, circling the room.\n\n     OUTSIDE THE MACHINE\n\n     Hawk and Anna squint, blinded.  Flinging off her goggles,\n     A literally beaming Minerva giggles forward.\n\n     THE MACHINE\n\n     Beams of light converge on the top mirror and bounce into\n     the innards of the machine with a mighty roar!\n\n     MINERVA\n\n     sees that the center of the machine gleams yellowish and\n     molten.  She moves closer, shouting into her head-set.\n\n                              MINERVA\n               Eureka, motherfuckers!\n\n     The machine thunders and spins at a more aggressive\n     pace.\n\n     Hawk's voice suddenly comes on Minerva's head-set.\n\n                              HAWK'S VOICE (head-set)\n               Minnie, hate to interrupt your\n               orgasm, but....\n\n     HAWK AND ANNA\n\n     stand above the unconscious Technicians.  Hawk is on\n     head-set.\n\n                              HAWK\n               Me, Anna, and Leonardo just wanna\n               say you got the Midas touch, baby...\n\n     MACHINE\n\n     Minerva turns toward the machine in anger and confusion.\n\n     The center of the machine blows.  The pool of molten gold\n     rockets at the viewer.\n\n     Mirrors explode and the lasers slash at the walls.\n\n     Minerva tumbles from the machine, screaming, that is to\n     say, trying to scream, because molten gold covers her\n     face.  It bubbles and cascades, turning her into a\n     bizarrely beautiful echo of Nefertiti.\n\n     HAWK AND ANNA\n\n     turn to retreat, and see, standing in the mouth of the\n     open double doors, in an open shirt, wearing Indian war\n     paint on his face and the words RULE BRITANNIA painted\n     on his chest, ALFRED!\n\n                              ALFRED\n               How.\n\n                              HAWK\n               You're unemployed, Alfie.  Boss\n               is dead.  Her plan is over.\n\n                              ALFRED\n                       (strange voiced)\n               My plan is just beginning.  I'll\n               forgive you for denying me the\n               pleasure of slaughtering my\n               boorish employers, but I'm afraid\n               the birth of the new British\n               Empire can have no witnesses!\n\n                              HAWK\n               Ooh-kay...\n\n     Alfred rushes forward with a howl.  Hawk meets him\n     halfway.  They trade savage punches and then lock onto\n     each other's throats.\n\n     Anna pulls a gun from a technician's holster and prays\n     for forgiveness.  She aims steadily, and fires...\n\n     right into Hawk's arm.  This allows Alfred to knock him\n     back with a strong punch.\n\n                              ANNA\n               Sorry!\n\n     She fires again.  The bullet pings off Hawk's belt buckle.\n\n                              HAWK\n               Stop helping me!  Thou shalt not\n               kill!\n\n     Hawk's turning to chastize Anna, allows Alfred to kick\n     Hawk back against a wall.  Alfred lunges out with his\n     blade, hitting the wall off-angle.  Hawk yanks the shaft.\n     Alfred goes with the flow and presses the shaft on Hawk's\n     throat.\n\n     Gasping, Hawk looks to a rip in Alfred's shirt and sees\n     a hinge and lever on the shaft.  With an all or nothing\n     jerk, Hawk flicks the lever.  The shaft clicks on the\n     hinge.\n\n     Alfred's greater strength and narrower grip makes it fold\n     away from Hawk and suddenly it is Alfred's throat which\n     is caught in the V-shaped trap!  The momentum of the\n     sudden change makes Alfred stumble towards the wall until\n     the point of the \"V\" hits it--\n\n                              HAWK\n               Don't lose your head over this.\n\n     Hawk takes the six foot steel pole and gives a Babe Ruth\n     swing right onto the V.  The blades slam together and\n     POP ALFRED'S HEAD OFF, SENDING IT SCREAMING DISEMBODIED,\n     HIGH IN THE AIR.\n\n     ALFRED'S SCREAMING HEAD P.O.V.\n\n     Hawk and Anna are seen waving up to the viewer (Alfie's\n     head).\n\n                              HAWK\n               Excuse my crass American humor.\n\n     The machine thunders with another explosion.\n\n     THE DA VINCI WORKSHOP\n\n     Hawk and Anna rush into the Da Vinci workshop.  She\n     guiltily touches the surface wound on his arm.  He\n     delicately takes the gun from her and laughs until he\n     sees...\n\n     BUNNY THE DOG!! standing in the open mouth of the\n     workshop.  Anna turns to Hawk...\n\n                              ANNA\n               Allow me.\n\n     Anna confidently moves toward the dog until Bunny leaps\n     up and savagely clamps his teeth into her throat sending\n     her crashing to the ground.\n\n     Hawk pauses in disbelief before raising the gun.\n\n     Bunny continues to viciously gnaw away on the convulsing\n     Anna, blood gently starts to emerge.\n\n     Hawk can't get off a shot.  He throws down the gun in\n     exasperation.  It lands next to The Gadget that is\n     connected to the Tennis Ball Machine.  Hawk rushes\n     forward, picks up the gadget, turns the dial to Ten, and\n     then smiles sweetly toward the dog.\n\n                              HAWK\n               Oh Bunny, Ball-Ball.\n\n     Bunny stops his violent behavior and perkily looks up\n     blood droplets drizzling from his mouth.\n\n     Hawk slams down on the gadget.\n\n     A tennis ball comes rocketing out of the machine.\n\n     Bunny leaps and catches the rocketing ball but the force\n     of it sends him FLYING AND CRASHING out a window.\n\n     Hawk pulls up Anna as the machine completely EXPLODES.\n\n     A huge chunk of the roof THUDS before the workshop door.\n\n     Hawk suddenly looks off-camera and smiles.  Anna shakes\n     her head vigorously.  He pulls her out of the frame.\n\n     EXT. A VINCI COUNTRYSIDE TREE\n\n     A man awakens from a nap and pulls up his hat.  It is THE\n     TRAVELING JUGGLER WITH THE UNFORGETTABLY ETCHED FACE.\n\n     He pulls his three red balls from a pouch on his mule.\n     He begins a stoic juggle when another loud BOOM sends him\n     to the ground.\n\n     EXT. OUTSIDE THE GRAND CASTLE--DAY\n\n     An explosion of steam and gas blows out the windows!\n     Debris frisbees toward the camera along with....\n\n     Anna, hanging on Hawk's waist, and Hawk, hanging from\n     the bar on DA VINCI'S BAT WINGED GLIDER.\n\n     The glider gracefully swooshes down through the castle -\n     through the glorious vista.\n\n     EXT. THE ROAD TO THE CASTLE\n\n     The glider floats to a perfect landing before the\n     Unforgettable Juggler.\n\n                             JUGGLER\n                         Che pazzo....\n\n     Hawk and Anna collect themselves and look up to the smoke\n     billowing castle.  They smile and gush in relief.  They\n     wrap arms around the confused but warming up Juggler and\n     laugh again.\n\n     A SMALL PIAZZA\n\n     The mule trots into a small storybook piazza in the hush\n     of dawn.  Hawk, Anna, and the unforgettable Juggler ride\n     atop it.\n\n     A WOMAN WITH AN UNFORGETTABLY ETCHED FACE moves to a cafe\n     table with a luminous smile.  She unfolds a table cloth\n     atop it and then mystically sets down two cappuccinos.\n\n     Hawk and Anna dismount, thank the Juggler, then cozy into\n     the table.\n\n                             HAWK\n               Have I ever told you the world is\n               beautiful...\n                       (semi-seductively)\n               I'd really like to play\n               Nintendo with you, or something...\n\n                             ANNA\n               Hudson, I'm afraid I'm sticking\n               with God.\n                       (smiling)\n               But you're a close second, tough\n               guy.  What is that smile?\n\n                             HAWK\n                       (broadly grinning)\n               I got my planet back.\n\n     Hawk puts on a pair of sunglasses that look exactly like\n     the ones Da Vinci wore in the opening and raises his cup.\n\n                             HAWK\n               The first one's for Alex.  Cheers.\n\n     The viewer's viewpoint moves into Hawk's lips having a\n     sip of that damn unmasculine European coffee.\n\n                                                FADE OUT.\n\n\n\n\n\n\n                              THE END\n\n\n\n   \n\n\n\n         \n\n\n\n\nHudson Hawk\nWriters :   Steven E. De Souza  Daniel Waters\nGenres :   Action  Adventure  Comedy  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Eddie \"Hudson Hawk\" Hawkins (Bruce Willis)—\"Hudson Hawk\" is a nickname for the bracing winds off the Hudson River—is a master burglar and safe-cracker, attempting to celebrate his first day of parole from prison with a cappuccino. Before he can get it, he is blackmailed by various entities, including his own parole officer, a minor Mafia family headed by the Mario Brothers, and the CIA into doing several dangerous art heists with his singing partner in crime, Tommy \"Five-Tone\" Messina (Danny Aiello).\nThe holders of the puppet strings turn out to be a \"psychotic American corporation\", Mayflower Industries, run by husband and wife Darwin (Richard E. Grant) and Minerva Mayflower (Sandra Bernhard) and their blade-slinging butler, Alfred (Donald Burton). The company, headquartered in the Esposizione Universale Roma, seeks to take over the world by reconstructing La Macchina dell'Oro, a machine purportedly invented by Leonardo da Vinci (Stefano Molinari) that converts lead into gold. A special assembly of crystals needed for the machine to function are hidden in a variety of Leonardo's artworks: the maquette of the Sforza, the Da Vinci Codex, and a scale model of DaVinci's helicopter design. Sister Anna Baragli (Andie MacDowell) is an operative for a secretive Vatican counter-espionage agency, which has arranged with the CIA to assist in the Roman portion of Hawk's mission, though apparently intending all along to foil the robbery at St. Peter's Basilica.\nThroughout the adventure, Hudson is foiled in attempts to drink a cappuccino. After blowing up an auctioneer to cover up the theft of the Sforza, the Mario Bros. take Hawk away in an ambulance. Hawk sticks syringes into Antony Mario's face and falls out of the ambulance on a gurney, and the Marios try to run him down with the ambulance as his gurney speeds along the highway. The brothers are killed when their driver, startled by the array of syringes in Antony's face, crashes the ambulance. Immediately afterwards, Hawk meets CIA head George Kaplan (James Coburn) and his CIA agents–Snickers (Don Harvey), Kit Kat (David Caruso), Almond Joy (Lorraine Toussaint), and Butterfinger (Andrew Bryniarski)–who take him to Darwin and Minerva Mayflower. Hawk successfully steals the Da Vinci Codex from another museum, but later refuses to steal the helicopter design. Tommy Five-Tone fakes his death so they can escape. They are discovered and attacked by the CIA Agents, and Kaplan reveals that he and his agents stole the piece, and unlike Tommy and Hudson, had no problem killing the guards. Hawk and Tommy cause Snickers and Almond Joy to be killed by their own explosive device, and they escape. Kit Kat and Butterfinger take Anna to the castle where the Macchina dell'Oro is being reconstructed.\nA showdown takes place at the castle between the remaining CIA agents, the Mayflowers, and the team of Hudson, Five-Tone, and Baragli. Kit Kat and Butterfinger are betrayed and killed by Minerva. Tommy fights Darwin and Alfred inside Darwin's speeding limo, and Hudson fights George Kaplan on the roof of the castle. Kaplan topples from the castle and lands of the roof of the limo. Alfred plants a bomb in the limo and escapes with Darwin; Tommy is trapped inside and Kaplan is hanging onto the hood. The bomb detonates as the limo speeds over a cliff. Darwin and Minerva force Hawk to put together the crystal powering the machine, but Hawk intentionally leaves out one small piece. When the Mayflowers activate the machine, it malfunctions and explodes, killing Minerva and Darwin. Hawk battles Alfred, using Alfred's own blades to decapitate him. Hawk and Baragli escape the castle and discover Tommy waiting for them at a cafe, having miraculously escaped death. Hawk finally gets to enjoy a cappuccino."}