{"title": "Insomnia", "full_text": "Insomnia\n\n                                      by\n\n                                   H. Seitz\n\n\n\n                                                            5.2.00\n\n\n\n\n             FADE IN:\n\n             On credit sequence...\n\n             AN ARM\n\n             stretched out.  Long, alabaster white.  Beautiful.  A WASH\n             CLOTH enters frame.  Starts washing the arm with long, tender\n             strokes. \n\n             A TUMBLE OF HAIR\n \n             thick and auburn.  Being gently washed.  \n\n             FINGERNAILS\n\n             being clipped with a shiny nail clipper.  Short.  Uniform.\n             Tidy.\n\n             EYEBROWS\n\n             brown with a touch of gold.  A BRUSH comes into view.\n             Brushes against the eyebrow hair, then back again.  Against.\n             Then back again.\n\n             PANTY-HOSE\n\n             pulled gingerly off a long leg.  Folded neatly.  The wash\n             cloth begins between the toes.  Warm, soapy water.\n\n             HAIR\n\n             now dry.  The HAND appears with a comb.  Pulls down through\n             the thick tresses.\n\n             It is only now that we see the hand is wearing a SURGICAL\n             GLOVE.\n\n             The gloved hand holds up the comb and pulls stray hairs from\n             it.  Places them in a big, clear, plastic bag.  In the bag we\n             see the panty-hose, a folded flower dress, the nail\n             clippings.\n\n             Goes back to combing.  Comes across a knot and yanks the comb\n             through.  The HEAD rolls over to us.  Her face is bruised,\n             her eyes blank.  She is lying on the floor.\n\n             Dead.\n\n             End of credit sequence.\n\n             INT. BUSH PLANE - THE KILBUCK MOUNTAINS, ALASKA - DAY\n\n             The loud THRUM of a bush plane.  We CLOSE ON a small, cloudy\n             window.  Through it we see an endless expanse of pine trees.\n\n                                 HAP (O.S.)\n                       Jesus.  Just look at all that.\n\n             PULL BACK to reveal HAP ECKHART and WILL DORMER sitting side\n             by side.  Hap's at the window.  Greying moustache, a little\n             pudgy, wearing a brown suit.  Holding a folded over Seattle\n             Times.\n\n                                 HAP (cont'd)\n                       I thought we had a population problem.\n                       Everyone should just move up here.\n                           (taps window)\n                       Just look at it, Will.\n\n             Will's eyes remain on the file on his lap.\n\n                                 WILL\n                       I don't need to look at it.\n\n             Will Dormer.  Tall, handsome, expensively tailored suit.\n             Snakeskin cowboy boots.  There's both a magnetism and a\n             distance to him.  An intense mixture.  Hap glances at him.\n     \n                                 HAP\n                       Nothing wrong with smelling the roses.\n\n             Will looks up.  We see the trace of a thick, ropy SCAR by his\n             Adam's apple.  There's tension between him and Hap, just\n             below the surface.  He taps the file.\n\n                                 WILL\n                       Tell that to her, partner.\n\n             ANGLE ON THE FILE\n\n             a stack of 8x10 PHOTOGRAPHS.  Of the dead girl.  Her eyes\n             puffed up from bruises.  The whites bloody.  Contusions along\n             her breasts and shoulders.\n\n                                 PILOT (O.S.)\n                       Detective?\n\n             The PILOT's looking back at Will.  Wearing a leather red\n             baron hat.\n\n                                 PILOT (cont'd)\n                       Better check your belts.  We'll be\n                       landing in about fifteen minutes.\n\n             Will nods.  The plane lurches.  The file falls to the floor\n             and the photographs scatter.  The pilot catches a glimpse of\n             them.  Looks at Will.\n\n             EXT. BUSH PLANE - CONTINUOUS\n\n             The small yellow plane veers left.  Clears a mountain top and\n             gives view to the spectacular Alaskan coastline.  The green\n             of the Bering sea, the blanket of pine trees, the jagged rock\n             of the beaches.  Enormous.\n\n\n             EXT. LANDING STRIP - OUTSIDE NIGHTMUTE - DAY\n\n             A SIGN swinging in the wind: Nightmute, Alaska.  Halibut\n             Fishing Capital of the World!\n\n             PULL BACK to reveal it hanging from the eave of a small,\n             corrugated building.  The \"airport.\"  Nothing else for miles\n             around.\n\n             A mud-splattered Jeep Cherokee pulls up next to it.  Brakes\n             SCREECHING.  A YOUNG WOMAN hops out.  About 23.  Petite with\n             short, brown hair.\n\n             Peers up at the sky.  Brightens at the sight of the BUSH\n             PLANE coming in for landing.  Smooths down her down vest.\n             Making sure the GOLD SHIELD on her belt's visible.  Nervous.\n             Excited.\n\n                                 OLD MAN (O.S.)\n                       Eleanor?\n\n             ELLIE BURR turns.  Shields her eyes from the sun.  An OLD MAN\n             hosing down the side of the building.\n\n                                 ELLIE\n                       Hey, Mr. Angstrom!\n\n                                 MR. ANGSTROM\n                       What're you doing here?\n\n             Ellie puffs up.\n\n                                 ELLIE\n                       Police business.\n\n                                 MR. ANGSTROM\n                       Police business?\n\n             The old man screws up his face, confused.  \n\n                                 MR. ANGSTROM (cont'd)\n                       Didn't you used to baby-sit for us? \n\n                                 ELLIE\n                       I don't babysit any more, Mr. Angstrom.\n                       Just made detective three weeks ago.\n\n             A CAT jumps down off the roof.  Angstrom sprays it.\n\n                                 MR. ANGSTROM\n                       Boy, Charlie must be short-handed down at\n                       the station.\n\n             Ellie, used to not being taken seriously.  Turns back to THE\n             ROAR of the bush plane as it taxis down the strip.  Coming to\n             a stop.  She hurries over as the door swings open and...\n\n             WILL DORMER steps down.  Slipping on his sunglasses.\n             Scanning the nothingness around him.  Spots the swinging\n             sign.\n\n                                 WILL\n                       \"Halibut fishing capital of the world.\"\n\n             Hap, right behind him.  Rubs his neck.\n\n                                 HAP\n                       This ought to be interesting.\n\n                                 ELLIE\n                           (over the engine)\n                       Detective Dormer!\n\n             They look down.  Ellie reaches up and takes Will's bag.  Then\n             his hand.  Shakes it vigorously.\n\n                                 ELLIE (cont'd)\n                       It's a huge honor to meet you!  Ellie\n                       Burr.  I'm here to take you to the\n                       station!\n\n             Will motions to Hap.\n\n                                 WILL\n                       My partner...\n\n                                 ELLIE\n                       Detective Eckhart!  I know!  Welcome to\n                       Nightmute!\n\n             She leads them away from the plane.  Takes Will's briefcase.\n\n                                 ELLIE\n                       I just want to say how incredible it is \n                       to have you working with us, Detective\n                       Dormer.  I've followed all your cases.\n                       Theodore Dineli, Frank and Casey\n                       Prud'homme, the Port Angeles shootings...\n\n             Opens the back of the Jeep.  Puts the bags inside.\n\n                                 ELLIE (cont'd)\n                       ...And especially the Leland Street\n                       Murders.  That was my case study at the\n                       Academy.\n\n             The Pilot walks by.  Taps her on the shoulder.\n\n                                 PILOT\n                       Tell your dad the game's gonna start late\n                       this week, Ellie.\n\n                                 ELLIE\n                       Sure thing, Spence.\n\n             She looks back at Will.  Can't help but focus in on his scar.\n             Touches her own smooth neck.  In awe.\n\n                                 ELLIE (cont'd)\n                       That's where Ronald Langley cut you in\n                       the basement of his father's house on 325\n                       Leland, isn't it?\n\n             Will smiles, taken aback by this girl's exuberance.\n\n                                 WILL\n                       You did your homework, Officer.\n\n                                 ELLIE\n                       Actually...\n\n             She throws a quick glance at Angstrom.  Out of ear-shot.\n\n                                 ELLIE\n                       I just made detective three weeks ago.\n\n             EXT. NIGHTMUTE POLICE DEPARTMENT - DAY\n\n             The Cherokee parked next to a police car outside a plain, one-\n             storey building.  The Nightmute Police Department.  A totem\n             pole stands out front.\n\n                                 CHIEF NYBACK (O.S.)\n                       Will Dormer!\n\n             INT. CHIEF CHARLES NYBACK'S OFFICE - CONTINUOUS\n\n             Nightmute Police Chief CHARLES NYBACK gets up from behind his\n             desk with a big smile.  Ruddy, red hair sprinkled with grey,\n             Nyback wears a faded army sweater over his uniform.\n\n                                 CHIEF NYBACK\n                       I'll be damned!\n\n             Limps from behind his desk and gives Will a shake and a slap\n             on the back.\n\n                                 WILL\n                           (warmly)\n                       How you doing, Charlie?\n\n             Nyback shakes Hap's hand.  A reunion.\n\n                                 HAP\n                       Hey, Charlie.\n\n                                 CHIEF NYBACK\n                       Christ.  I haven't seen you boys since...\n\n                                 WILL\n                       Just after Leland Street.\n\n                                 CHIEF NYBACK\n                       What's that, then?\n\n                                 HAP\n                       Eight years.\n\n                                 WILL\n                       Seven years.\n\n                                 CHIEF NYBACK\n                       Seven years?  Where does it all go?  That\n                       was some amazing time, though, wasn't it?\n\n             Looks at Will.  Down at his boots.\n\n                                 CHIEF NYBACK (cont'd)\n                       You haven't changed a bit, Will.\n\n             Will.  Looks at Nyback's gut.\n\n                                 WILL\n                       You have, Chief.\n\n             They LAUGH.  Eyes twinkling.\n\n                                 CHIEF NYBACK\n                       I knew that was coming.  I deserve it.\n\n             He starts back over to his desk.  Notices Ellie still\n             standing by the door.  Points to Will.\n\n                                 CHIEF NYBACK (cont'd)\n                       Pay attention to this man, Ellie.  He'll\n                       teach you how to be a great cop.\n\n             Ellie straightens.  Smiles.  Looks over at Will.\n\n                                 ELLIE\n                       Yes, sir.\n\n                                 CHIEF NYBACK\n                       That's all, for now.\n\n             Ellie, realises they want to be alone.\n\n                                 ELLIE\n                       Oh.  Right.  Okay.\n\n             Backs out.  Quietly closing the door behind her.  Will\n             unbuttons his jacket.  Takes a seat.\n\n                                 WILL\n                       Nice kid.\n\n                                 CHIEF NYBACK\n                           (sits with a SIGH)\n                       Got a love affair with police work.\n                       Drives me crazy with it.\n\n             Will surveys the fishing poles leaning against the gun rack.\n\n                                 WILL\n                       Keeping you busy up here, Charlie?\n\n             Hap picks up a cheap trophy.  Reads the base.\n\n                                 HAP\n                       \"2nd prize Great Kodiak Salmon Catch.\"\n\n                                 CHIEF NYBACK\n                       I told you seven years ago this was a \n                       stepping stone to retirement.\n\n             Nyback nods to Hap's Seattle Times.  The headline:  \"Deeper\n             Investigation into Special Branch\"...\n\n                                 CHIEF NYBACK (cont'd)\n                       Looks like it's a good time for you to\n                       get up here, too.  With all the bad\n                       business going on down at Special Branch.\n\n             Will and Hap share a look.  No more joking.  Hap folds over\n             the paper.\n\n                                 CHIEF NYBACK (cont'd)\n                       Just five bad apples so far?\n\n                                 WILL\n                       So far.\n\n                                 CHIEF NYBACK\n                       What's the D.A. got them on?\n\n                                 WILL\n                       Four unwarranted shootings, witness\n                       intimidation, and cocaine theft.\n\n             Nyback winces.\n\n                                 CHIEF NYBACK\n                       How about you?  How you faring?\n\n                                 HAP\n                       They're all over us, Charlie.\n\n                                 WILL\n                       They're all over everybody.\n\n                                 HAP\n                       I.A.'s calling themselves the \"Corruption\n                       Task Force.\"  Can you believe that?\n                       Trying to root out any mistakes or\n                       \"oversights\" any other Detectives may\n                       have made over the years.  They're\n                       turning it into a witch hunt.  Something\n                       on the news about it practically every\n                       night.\n\n             Nyback pulls a stack of messages from his desk.\n\n                                 CHIEF NYBACK\n                       Got a bunch of messages here from some\n                       guy named Warfield.\n\n             Hap tosses a glance over at Will.\n\n                                 WILL\n                       That's I.A.'s pit bull.\n\n                                 CHIEF NYBACK\n                       Wants me to keep him posted on all your\n                       movements up here.\n\n             Nyback turns and ceremoniously drops the messages into the\n             trash.\n\n                                 CHIEF NYBACK (cont'd)\n                       I'm just glad Buck could spare you a\n                       couple of weeks.  Take you out of the\n                       frenzy.  I gotta tell you, though, I sure\n                       don't miss big city police work.  Not\n                       that I was ever a great detective.  But\n                       up here there's no Bureaucracy.  No\n                       Public Relations.  No blurred lines.\n                       Just good guys and bad guys.  Simple.\n\n             A cloud passes over his face.\n\n                                 CHIEF NYBACK (cont'd)\n                       Except for this.\n\n             Holds up a file.  The name written on the lip:  KAY CONNELL.\n\n             INT. HALLWAY - MINUTES LATER\n\n             Nyback leads Will and Hap down a hallway.  Crooked plaques\n             and black-and-white pictures line the walls.\n\n                                 CHIEF NYBACK\n                       Couldn't get a thing from the body.  Not\n                       a trace.  Town's never dealt with\n                       anything like this before.\n\n             They turn a corner and stop at a door.  Will glances up:\n             MOOSE ANTLERS hanging over it.\n\n                                 CHIEF NYBACK (cont'd)\n                       I've briefed everybody about your coming.\n                       They know to follow your lead.\n\n             Nyback opens the door onto...\n\n             INT. BULLPEN - NIGHTMUTE PD - CONTINUOUS\n\n             ...the bullpen of Nightmute PD.  Wooden desks, a couple\n             computers, a jumbled corkboard, an impressive gun cabinet.  A\n             RADIO's playing.\n\n             Three MEN look over.  A young uniformed cop and two guys with\n             heavy facial hair, Timberland boots, and flannel shirts.  One\n             of them's part Inuit.  Ellie sits in the back.  Reaches over\n             to turn off the radio.\n\n             Will and Hap stand in the doorway.  Sticking out like sore\n             thumbs in their suits.  Nyback jerks his thumb towards them.\n\n                                 CHIEF NYBACK\n                       This is Detective Dormer and his partner\n                       Detective Eckhart.  On loan from Buck\n                       Lundgard, Seattle Robbery and Homicide\n                       Special Branch.  They'll be helping with\n                       the Connell case.\n\n             The Inuit, FRED DUGGAR, snorts.  Takes his feet of the desk.\n\n                                 FRED\n                       Helping?  \n\n                                 CHIEF NYBACK\n                           (ignoring him)\n                       Anything they need to see, you show them;\n                       anywhere they want to go, you take them.\n                           (nods to Fred)\n                       This is Detective Fred Duggar.  He's been\n                       leading the investigation up to now.\n\n             Will puts out his hand.\n\n                                 WILL\n                       Detective...\n\n             Fred tugs at his dark handlebar moustache.  Stands.\n\n                                 FRED\n                       Suppose you want to see the body.\n\n             EXT. NIGHTMUTE POLICE DEPARTMENT - DAY\n\n             Fred steps out of the station, pulls on a baseball cap.\n\n                                 FRED\n                       We can walk from here.\n\n             He heads off across the parking lot.  Will and Hap exchange a\n             glance.\n\n                                 WILL\n                       Guess that's what they call Alaskan\n                       hospitality.\n\n                                 ELLIE (O.S.)\n                       Don't worry about him...\n\n             They turn.  Ellie's come up behind them.  Looks over at the\n             hunched figure to Fred.\n\n                                 ELLIE (cont'd)\n                       He's just mad 'cause you're taking over.\n\n             Fred stops up ahead.  Sees her.  Annoyed.\n\n                                 FRED\n                       Ellie!  Go type something!\n\n             INT. NIGHTMUTE MORGUE - LATER\n\n             CLOSE ON a faucet.  A bead of water, quivering at the mouth.\n             Falls with a BLIP!\n\n                                 CORONER (O.S.)\n                       Did a fundascopic examination and found\n                       papilledema and petechiae of the retina.\n\n             PULL BACK to reveal Will, Hap, and the COUNTY CORONER\n             standing by a stainless steel table.  The naked body of KAY\n             CONNELL is laid out before them.  Fred hangs back.\n\n             The coroner tugs at her surgical gloves.  She's in her late\n             seventies.\n\n                                 CORONER (cont'd)\n                       Clear cause of death was herniation of\n                       the brain stem due to intracerebral\n                       hemorrhage.\n\n                                 HAP\n                       Beaten to death.\n\n                                 CORONER\n                       Beaten to death.\n\n             Will points to the bruises on the body's shoulders and\n             breasts.\n\n                                 WILL\n                       What about these contusions?\n\n                                 CORONER\n                       Superficial.\n\n                                 WILL\n                       Any signs of rape?\n\n                                 CORONER\n                       None.\n\n             The coroner starts to cover the body with a sheet.\n\n                                 CORONER (cont'd)\n                       She was a nice girl.  Played flute with\n                       my granddaughter.\n\n             Will stays her hand.\n\n                                 WILL\n                       Wait.\n\n             He pulls the sheet back down.  Studying the body of Kay\n             Connell.  Starts walking slowly around the table.  In his\n             element.  The faucet drips.  Drips.  Drips.\n\n             He bends down to smell her hair.\n\n                                 WILL (cont'd)\n                       He washed her hair.\n\n             Takes a handful and lets it fall from his fingers.\n\n                                 WILL (cont'd)\n                       Combed it.\n\n             Continues around the table.  Picks up one of her hands.\n             Examines her fingers, her nails.\n\n                                 WILL (cont'd)\n                       Cleaned under her fingernails.  Clipped\n                       them.\n\n             Continues down around her feet.  Checks between her first and\n             second toes.\n\n                                 WILL (cont'd)\n                       Toes, too.\n                           (to Fred)\n                       You found nothing on the body?\n\n                                 FRED\n                       No.\n \n                                 WILL\n                       No fibers, skin flakes, hairs...\n\n                                 FRED\n                       Like I said, no.  We know about those\n                       things up here.\n\n             Will stands there.  Looking down at the body.  Slim.  Young.\n             Beautiful.  Skin like marble.\n\n                                 WILL\n                       He knew exactly what we'd be looking for.\n                       Made sure to cover up all his tracks.\n\n                                 HAP\n                       Even the best make mistakes.\n\n             Will looks up and locks eyes with his partner.\n\n             INT. PIONEER LODGE - NIGHTMUTE - NIGHT\n\n             Will and Hap enter the lobby of the Pioneer Lodge.  Big stone\n             fireplace and heavy ceiling beams.  MOOSE ANTLERS mounted\n             above reception.  They put their bags down by the desk.  Look\n             around.\n\n                                 RACHEL (O.S.)\n                       Lower forty-eight.\n\n             They turn.  RACHEL CLEMENT stands in a doorway behind the\n             desk.  Dunking a teabag into a mug.  Long dark hair and\n             intelligent eyes.\n\n                                 HAP\n                       Lower forty-eight?\n\n                                 RACHEL\n                       You're not from here.  I can tell by your\n                       walk.\n\n                                 HAP\n                       Oh?  And how's that?\n\n                                 RACHEL\n                       Unsure.\n\n             Hap smiles at her.  Will checks his watch.\n\n                                 WILL\n                       Detectives Will Dormer and Hap Eckhart.\n                       There should be a reservation for us.\n\n             Rachel looks at him.  Goes to a small file box on the desk.\n\n                                 RACHEL\n                           (to Hap)\n                       Your friend's all business.\n\n                                 WILL\n                       I'm always all business.\n\n             He glances out the window.  It's as bright as day.\n\n                                 WILL (cont'd)\n                       Is it really 9:30?\n\n                                 RACHEL\n                           (nods)\n                       Alaskan summers.  Hope you're an easy\n                       sleeper.  It'll be like this all night.\n\n             She hands them two cards.\n\n                                 RACHEL (cont'd)\n                       Sign here.\n\n             INT. WILL'S ROOM - NIGHT\n\n             Will's taken off his jacket and is unpacking.  The room is\n             sparse and creaky.  Bed dips in the middle.  He hangs a\n             jacket in the armoire then returns to his suitcase.  Pulls\n             out his SMITH AND WESSON 45.\n\n             Lays it on the bedside table.  Takes out a shoulder holster.\n             A back holster.  A handful of shells.  Lays them on the \n             table.  Then a small SMITH AND WESSON 39/13 9MM.  Checks the\n             magazine.\n\n             There's a KNOCK on the adjoining door.\n\n                                 HAP (O.S.)\n                       Me.\n\n             Will SLAPS the magazine back.\n\n                                 WILL\n                       Come on in.\n\n             Hap opens the door.  A glimpse into his room: family PICTURES\n             on his bedside table - a WOMAN and three teenage GIRLS.\n\n                                 HAP\n                       See you have the same decor as my room.\n\n             He walks over to the big window.  It overlooks the harbor.\n             Big, snow-capped mountains in the distance.  One lone TUGBOAT\n             in the harbor towing a freighter.\n\n                                 HAP (cont'd)\n                       Same view, too.\n                           (looks out)\n                       I've been watching that tugboat for the\n                       last half hour.  So small, pulling all\n                       that weight.\n                           (beat)\n                       We have to talk, Will.\n\n             Will reaches into his suitcase.  Pulls out a shirt.\n\n                                 WILL \n                       What do you want to talk about?\n\n                                 HAP\n                       You know what about.\n\n             Will throws him a look.\n\n                                 WILL\n                       We'll talk when we get back to Seattle.\n\n                                 HAP\n                       When's that, a week?  Two weeks?...\n                           (heads over to him)\n                       We have to figure out a plan of action\n                       now.\n\n                                 WILL\n                       You know my plan of action.\n\n                                 HAP\n                       To do nothing.\n\n                                 WILL\n                       That's right.\n\n                                 HAP\n                       Dammit, Will.  Warfield had me locked up\n                       in his office again for five hours\n                       yesterday.  Five hours.  Asking all kinds\n                       of questions...\n\n                                 WILL\n                       He's asking everybody questions.\n\n                                 HAP\n                       But he's zeroing in on me.  On us.\n                       Everyone's talking about it.\n\n                                 WILL\n                       He's just rattling your cage.\n\n                                 HAP\n                       Well, I gotta tell you.  With a wife,\n                       three kids, and a pension plan in the\n                       balance, it's rattling hard.\n\n                                 WILL\n                       We say nothing.  It goes away.  Simple as\n                       that.\n\n             Will goes back to his suitcase.  Hap follows.  A thin film of\n             sweat on his upper lip.\n\n                                 HAP\n                           (lowers voice)\n                       Look.  We've tampered with evidence.\n                       We've pushed witnesses.  We've planted\n                       shit.  And they're sniffing around like\n                       dogs.  Especially on the Dobbs case...\n\n             Will flares up.  Struck a nerve.  Turns to his partner.\n\n                                 WILL\n                       Weston Dobbs killed an eight year-old boy\n                       and left him hanging in the basement like\n                       a piece of meat.  You remember that?\n\n                                 HAP\n                       You know I remember that.\n\n                                 WILL\n                       One word to I.A. and he walks.\n\n                                 HAP\n                       Maybe not.  We could talk to Buck...\n\n                                 WILL\n                       No way.\n\n                                 HAP\n                       Cut some kind of a deal.  I heard that's \n                       what Flynn's doing...\n\n                                 WILL\n                       Mike Flynn's a dirty cop, Hap!  We are\n                       nothing like Mike Flynn.  We did what we\n                       needed to do to make sure that son-of-\n                       bitch Dobbs paid for what he did.  And\n                       every bastard like him.  We say one word\n                       about it and every case we ever brought\n                       in is going to blow wide open and they'll\n                       all walk.  Every last one.  And I am not\n                       going to let that happen.  No deals.  No\n                       compromises.  No discussions.\n\n             He grabs a hanger.\n\n                                 HAP\n                       Goddammit, Will.  You grab on to\n                       something and you don't let it go.\n\n             He takes out a handkerchief.  Wipes his brow.\n\n                                 HAP\n                       I don't know if it's because you think\n                       it's the right thing to do or because\n                       your pride won't let you do anything\n                       else.  I can't tell any more.\n                           (steps back)\n                       But I can tell you one thing.  I'm\n                       getting too old for this cowboy cop\n                       stuff.  Breaking the rules.  Cleaning up\n                       messes.  We're a dying breed, Will.\n                       You're a dying breed.  I.A., the D.A.,\n                       all those reporters - they don't care\n                       what you did at Leland Street seven years\n                       ago.  They don't care that you've made\n                       this your life.  They don't care about\n                       getting the bad guy...\n\n             Will turns on his partner, eyes burning.\n\n                                 WILL\n                       I care.\n\n             The partners, lock eyes.  Years of working together.  A\n             thousand things unsaid.  Hap reaches for the door.\n\n                                 HAP (cont'd)\n                        They're watching us, Will.  Like it or\n                        not.  They're watching us.\n\n             INT. WILL'S ROOM - NIGHT\n\n             Will's asleep.  Kay Connell's folder open on his chest.  It's\n             dark in his room, quiet.  Suddenly the shade on his window\n             quivers and SNAPS up, flooding the room with light.\n\n             Will's eyes pop open.  He rolls over to look at the clock:\n             3:15.  Squinting, he gets up and walks over to the window.\n             We can see the rest of his scar.  Runs down deep across his\n             sternum.\n\n             He yanks the shade back down.  It bucks, then settles.\n             Satisfied, Will returns to bed.  Plumps the pillow, pulls the\n             blanket up around him.  Closes his eyes.\n\n             The shade lurches halfway.  Then SNAPS back up.  Light pours\n             in.  Will's eyes open.\n\n                                 WILL\n                       You got to be kidding me.\n\n             EXT. STREET - NIGHTMUTE - DAY\n\n             Will jogs along in a Sonics sweatshirt, a ring of sweat\n             around his collar.  He looks out over the harbor.  Fishing\n             boats coming in with their early morning haul.  More halibut.\n             He checks his watch.  Slows to a walk.  Looks up and sees...\n\n             Ellie Burr standing on the front steps of the Pioneer Lodge.\n             Smiles.  Holds up some car keys.\n\n                                 ELLIE\n                       Fred wants us to meet him at the\n                       Connell's.\n\n             INT./EXT. JEEP CHEROKEE - DAY\n\n             Ellie driving.  A hula-girl, swinging from the rear-view\n             mirror.  Will in the passenger seat.  Wearing a crisp suit.\n             Ellie hands him a take-out bag.\n\n                                 ELLIE\n                       Brought you a bear claw.  Just in case\n                       you were hungry.\n\n             Will takes the bag.  Looks inside.  Yikes.\n\n                                 ELLIE (cont'd)\n                       Local delicacy.\n\n                                 WILL\n                       Think I'll pass.\n\n             He puts the bag on the dash.  Looks out the window.\n             Nightmute's main street.  A line of shops.  Undistinguished\n             Town Hall.  Elementary school up on a hill.  Sign out front:\n             Sign-ups for Midnight Little League!\n\n                                 WILL (cont'd)\n                       What kind of calls you get around here?\n\n                                 ELLIE\n                       Oh.  You know.  Small-time stuff.\n                       Nothing like what you must get.  Mostly\n                       drinking-related problems.  Domestic\n                       abuse.  Barroom fights.  Stuff like that.\n\n             She shifts down.  Takes a steep turn.\n\n                                 ELLIE (cont'd)\n                       In the summer months it's pretty quiet.\n                       That's when there's work out on the\n                       boats.  The rest of the year, though...\n\n             They pass a MAN walking along the road.  Gnarled walking\n             stick.  Ellie calls out the window.\n\n                                 ELLIE (cont'd)\n                       Hey, there, Joe!\n\n             JOE waves.  They pass.\n\n                                 ELLIE (cont'd)\n                       That's Joe Willy.  Took his family \n                       hostage in November.  That was the most\n                       exciting thing that happened last year.\n                       I wasn't there, though.\n                           (grinds gear)\n                       Chief barely lets me handle anything\n                       above a misdemeanor.\n\n             Will looks over at her.  Smiles.\n\n                                 WILL\n                       Don't give misdemeanors a bad rap.\n\n                                 ELLIE\n                       But they're so boring.  All small stuff.\n\n                                 WILL\n                       It's all about the small stuff.  Small\n                       lies.  Small mistakes.  Small oversights.\n                       People give themselves away in a traffic\n                       violation just as much as they do in a\n                       murder case.  It's human nature.\n\n             He looks over.  Ellie's listening intently.\n\n                                 WILL (cont'd)\n                       Aren't you going to write that down?\n\n             Ellie, searching her pockets for something to write with...\n\n                                 ELLIE\n                       Let me just...\n\n             Stops.  Looks over.  Realises Will's teasing her.\n\n             EXT. CONNELL HOUSE - DAY\n\n             A small ranch house.  Aluminum siding.  FLOWERS piled up by\n             the front door.  TEDDY BEARS.  RIBBONS.  Left by well-wishers.\n\n                                 MRS. CONNELL (O.S.)\n                       I haven't tidied up, since Fred told me\n                       not to touch anything.\n\n             INT. HALLWAY - CONNELL HOUSE - CONTINUOUS\n\n             MRS. CONNELL, a big woman with a thick grey braid down her\n             back, opens the door to her daughter's room.  Looks at Will.\n\n                                 MRS. CONNELL\n                       I don't believe in keeping a child's room\n                       like a shrine.\n\n             Will heads into the room.  Hap follows.  A palpable\n             uneasiness between them.  Fred and Ellie stand in the\n             doorway.  Mrs. Connell turns to go.\n\n             INT. KAY CONNELL'S ROOM - CONTINUOUS\n\n             A small bedroom.  Pink shag carpeting and clouds painted on\n             the ceiling.  Pictures cut from magazines pasted on the\n             walls.  A stack of tapes and a boom box in the corner.\n\n             Will stands in the middle of the room.  Taking it in.\n\n                                 WILL\n                       Typical seventeen year-old.\n                           (beat)\n                       She went to a party Friday night?\n\n                                 ELLIE\n                       Down at a local dive the kids like to\n                       hang out in.\n\n             Fred throws Ellie a look.  \"Kids?\"  She's practically a kid\n             herself.  Will opens the top drawer of the bureau.  Roots\n             beneath the panties.\n\n                                 WILL\n                       No diary.\n\n             On top of the bureau, a stack of photos.  A couple torn up.\n             Kay Connell and a GIRL with white-blonde hair.  Laughing.\n\n                                 FRED\n                       She left the party early.  Friends said\n                       she had a fight with her boyfriend and\n                       stormed out.\n\n                                 WILL\n                       What time was that?\n\n                                 FRED\n                       Around twelve-thirty.\n\n             Hap picks up a bear on Kay's bed.  A bell JINGLES when he\n             shakes it.  Will crosses to a closet in the corner.\n\n                                 WILL\n                       Who was the last one to see her alive?\n\n                                 FRED\n                       Randy Stetz.  Her boyfriend.  We've\n                       questioned him, searched his place.\n                       Didn't find anything.\n\n             Will pulls a dress out of the closet.  Small, black, elegant.\n             The tag's been cut out.  He pulls out another, then another.\n             Feels the fabric.\n\n                                 WILL\n                       These are designer.  Expensive.\n                           (looks up)\n                       Could Randy Stetz afford these?\n\n             Fred and Ellie exchange a look.\n\n                                 ELLIE\n                       He fixes boat engines.\n\n             Will looks around.  Cheap wallpaper, torn window screens.\n\n                                 WILL\n                       Well her mother didn't buy them for her.\n\n                                 HAP\n                       What are we thinking?\n\n             Will reaches over to a heart-shaped box on the bedside table.\n             Pulls out a pretty gold necklace.  Holds it up.\n\n                                 WILL\n                       Kay Connell had an admirer.\n\n             He hands the dresses to Ellie.  Heads out of the room.\n\n                                 WILL (cont'd)\n                       I want to talk to the boyfriend.\n\n             INT. INTERROGATION ROOM - DAY\n\n             CLOSE ON a hand squeezing a shoulder.  Hard.\n\n                                 WILL\n                       You don't seem all that sad.\n\n             The shoulder jerks away.  PULL BACK to reveal RANDY STETZ\n             sitting at a wooden table in an interrogation room.  Longish\n             blond hair, wearing a Metallica t-shirt, trying like hell to\n             grow a moustache.\n\n                                 RANDY\n                       I haven't had a chance!  You fuckers been\n                       all over my back since Monday!\n\n             He takes out a cigarette.  It's bent.  He lights it.  Hap\n             sits opposite.\n\n                                 HAP\n                       You know smoking stunts your growth.\n\n             Randy throws him a look.\n\n                                 RANDY\n                       Yeah, okay, fat-ass.\n\n                                 HAP\n                           (smiles at Will)\n                       More Alaskan hospitality.\n\n             Will goes over to a coffee machine.  Pours a cup.\n\n                                 WILL\n                       Did you love her?\n\n                                 RANDY\n                       Huh?\n\n                                 WILL\n                       Kay Connell.  Did you love her?\n\n             Randy flicks his ash.  Shrugs.\n\n                                 RANDY\n                       Sure.  She was nice.\n\n             Will turns with his coffee.\n\n                                 WILL\n                       \"She was nice.\"  Wow.  That makes me all\n                       soft inside.  Ever occur to you she\n                       didn't love you back?\n\n                                 RANDY\n                       Huh?\n\n                                 WILL\n                       You heard me that time.\n\n                                 RANDY\n                       She loved me.  She wanted to see me every\n                       night.\n\n                                 WILL\n                       But she was seeing someone else on the\n                       side.\n\n             Randy glares.\n\n                                 RANDY\n                       I don't know what you're fucking talking\n                       about.\n\n                                 WILL\n                       Friday night, at the party - what'd you\n                       fight about?\n\n                                 RANDY\n                       Stuff.\n\n                                 WILL\n                       What kind of stuff?\n\n                                 RANDY\n                       Just stuff.  I don't fucking remember.\n\n                                 WILL\n                       The other guy?\n\n                                 RANDY\n                       I told you I don't remember.\n\n                                 WILL\n                       After that she left the party to go to\n                       him.\n\n                                 RANDY\n                       How should I know?...\n\n                                 WILL\n                       Ran like hell to go to him...\n\n                                 RANDY\n                       Fuck you, man! - I'm sick of all your\n                       fucking cop questions...\n\n             Will suddenly hurls his coffee cup and grabs Randy up by the\n             collar.  Nose to nose.\n\n                                 WILL\n                       Now you listen to me, you little shit.\n                       This fuck-the-world-Metallica-t-shirt \n                       crap may work with your mamma, but it\n                       doesn't work with me.  You got mad at\n                       your girlfriend because she was seeing\n                       someone else.  You want to be the last\n                       person who saw her alive or are you going\n                       to tell me who that is?\n\n             Randy's lip curls.  Red-faced.\n\n                                 RANDY\n                       I don't know.\n\n                                 WILL\n                       You don't know.\n\n                                 RANDY\n                       She didn't tell me.\n\n             Disgusted, Will shoves Randy back into his seat.\n\n             INT. HALLWAY - MINUTES LATER\n\n             Will walking out of the interrogation room.  Ellie joins him.\n\n                                 ELLIE\n                       He's a little surly, isn't he?\n\n             Will smooths back his hair.  Checks his tie.\n\n                                 WILL\n                       Just a little.\n\n             He reaches into his pocket and pulls out the gold necklace\n             from Kay's room.  Hands it to her.\n\n                                 WILL\n                       I want you to check this out, Ellie.\n\n                                 ELLIE\n                       We already did.\n\n                                 WILL\n                       Do it again.\n\n                                 ELLIE\n                       But there wasn't any...\n\n             Will stops.  Ellie stops.  Will puts a hand on her shoulder.\n\n                                 WILL\n                       The small things - remember?  The second\n                       you're about to dismiss something - look\n                       at it again.\n\n             Ellie smiles, teasing.\n\n                                 ELLIE\n                       You want me to write that down?\n\n             Will, has to smile.  She's quick.  Looks down the hall.  A\n             bearded GUY on crutches.  Ellie follows his gaze.\n\n                                 WILL\n                       Who's that?\n\n                                 ELLIE\n                       The bartender at Darrow's.  He was there\n                       Friday night.\n\n                                 WILL\n                       Good.  He's up next.\n\n             Will heads over to him.  Ellie watches his neck.  Her hand\n             closing over the necklace.\n\n             INT. RESTAURANT - PIONEER LODGE - NIGHT\n\n             The Pioneer Lodge restaurant.  Small, dark wood, a RADIO\n             playing something between Bluegrass and Folk.  Some rough-\n             looking GUYS at the bar.  Throwing looks over at...\n\n             Will and Hap, sitting at a table.  Studying faded menus.\n\n                                 WILL\n                           (reading)\n                       Halibut Calabrese.  Halibut Olympia.\n                       Halibut Cajun Style.  Halibut fish and\n                       chips...\n\n             He puts down his menu.  Reaches for his drink.\n\n                                 WILL (cont'd)\n                       Can't wait to see what's for dessert.\n\n                                 HAP\n                       At least there's variety.\n\n             Will drains his drink.  Locks eyes with a big GUY over at the\n             bar.  Beer froth on his moustache.\n\n                                 WILL\n                       Looks like the natives are restless.\n\n                                 HAP\n                       Will?\n\n             Will looks back at his partner.  Hap's fidgeting with the end\n             of his tie.\n\n                                 HAP (cont'd)\n                       I think, I think I'm gonna talk to Buck\n                       when we get back to Seattle.\n\n             A cold flash down Will's spine.\n\n                                 HAP\n                       I wish I could stick it out like you.  I\n                       just, with Trish and the kids...\n\n                                 WILL\n                       Don't do this, Hap...\n\n             Hap avoids his eyes.\n\n                                 HAP\n                       I'm thinking I could get off with\n                       probation.  Keep half my pension.  That's\n                       all I want.\n\n                                 WILL\n                           (hisses)\n                       Goddammit, Hap.  Think about what you're\n                       doing...\n\n                                 HAP\n                       You don't have to be involved, Will.\n\n                                 WILL\n                       You tell Buck and I'm involved whether I\n                       like it or not...\n\n                                 RACHEL (O.S.)\n                       Ready to order?\n\n             The men look up, interrupted.  Rachel is standing by the\n             table with a pad.  Hap tries to recover with a big smile.\n\n                                 HAP\n                       Hey - you do everything around here?\n\n                                 RACHEL\n                       Just about.\n\n             Will stands abruptly.  Eyes on Hap.  Trying not to explode.\n\n                                 WILL\n                       I'll just have another Scotch in my room.\n                           (turns to Rachel)\n                       If you don't mind.\n\n             Just then, his cell phone RINGS.\n\n             INT. BULLPEN - NIGHTMUTE PD - NIGHT\n\n             Will bursts into the bullpen.  Hap behind.\n\n                                 WILL\n                       Where is it?\n\n             Ellie, Fred, and a couple other GUYS huddled around a desk.\n\n                                 ELLIE\n                       Over here.\n\n             Will and Hap head over to them.  One of the younger guys,\n             FARRELL, intimidated by Will's presence.  Tucks his shirt\n             into his dirty jeans.\n\n             They part to reveal a BLUE KNAPSACK laying on the desk.  Mud\n             spots all over it.  An embroidered daisy.  Will examines it.\n\n                                 WILL\n                       We're sure it's hers?\n\n                                 FRED\n                       Has her books in it.\n\n                                 HAP\n                       What about prints?\n\n             Ellie shakes her head, unfortunately not.  Will reaches into\n             the bag.  Pulls out two text books.\n\n                                 WILL\n                       Biology and Algebra.\n\n             He shoves the books towards one of the guys.\n\n                                 WILL (cont'd)\n                       Find out who she studied with.\n\n             He continues through the bag.  Pulls out a little plastic bag\n             with \"Hello Kittys\" all over it.  Dumps out the contents.\n\n                                 WILL (cont'd)\n                       Make-up.\n\n             Looks up at Fred.\n\n                                 WILL (cont'd)\n                       Find out where she bought it.\n\n             Fred looks at him.  Not happy with make-up duty.  Will pulls\n             out a hair brush.  Hands it to Ellie.\n\n                                 WILL (cont'd)\n                       Lab.\n\n             Next, a couple worn paperbacks.\n\n                                 WILL (cont'd)\n                           (reading titles)\n                       Otherwise Engaged, Murder at Sunset.\n\n             He looks up at the group.\n\n                                 WILL (cont'd)\n                       Who here reads this kind of crap?\n\n             Farrell straightens.\n\n                                 FARRELL\n                       I read that kind of crap.\n\n             Will tosses them to him.\n\n                                 WILL\n                       Read them.  Tell me anything that strikes\n                       you.\n\n             Down to the bottom of the bag.  A Ziploc with a half-eaten\n             sandwich and an apple core.  Will hands them to Ellie.\n\n                                 WILL (cont'd)\n                       Lab.\n\n             Upends the knapsack.  Scraps, paper clips, gum wrappers.\n\n                                 WILL (cont'd)\n                       That's it.\n\n             Fred reaches for the knapsack.\n\n                                 FRED\n                       I'll stick it in the evidence locker...\n\n                                 WILL\n                       No.\n\n             Will takes it, walks slowly over to the window.  Thinking.\n             Twists the knapsack in his hands and looks out at the\n     \n             TOTEM POLE standing tall outside.  A black RAVEN alights on\n             top of it.  Pecks at the air.  Turns.  Seems to look right at \n             Will.\n\n                                 WILL (cont'd)\n                       We put it back where we found it.\n\n             Will turns to them.\n\n                                 WILL (cont'd)\n                       You said it was a fishing cabin.\n\n                                 FARRELL\n                       Uh, right.  About two miles outside of\n                       town.\n\n                                 ELLIE\n                       On the beach.\n\n             Fred tightens his jaw.\n\n                                 FRED\n                       Why are we taking it back?\n\n             Will ignores the question.  Walks back towards them.\n\n                                 WILL\n                       This murder was in the papers, right?\n\n                                 ELLIE\n                       Yeah.  All over.\n\n                                 WILL\n                       Call all of them from here to Anchorage.\n                       Tell them we now know that Kay Connell\n                       left the party with a dark blue knapsack,\n                       but we haven't recovered it yet.\n                           (checks watch)\n                       We can get it in by the morning editions.\n\n             He hands the bag to Farrell.\n\n                                 WILL (cont'd)\n                       Fill this with random books.  Make it\n                       look heavy.\n\n             Will pulls out a handkerchief.  Wipes the mud off his hands.\n             Taking his time.  Finally turns to Fred.\n\n                                 WILL (cont'd)\n                       It'll eat this guy alive if he thinks he\n                       overlooked a detail.\n\n             EXT. ROCKY BEACH - OUTSIDE NIGHTMUTE - MORNING\n\n             POV through BINOCULARS\n\n             A WOODEN CABIN comes into focus.  Right by the water.  Hasn't\n             been used in years.  Weathered, slate roof.  Algae growing up\n             the sides.\n\n                                 HAP (O.S.)\n                       Nice.  Lighter than I remembered.\n\n             WILL lowers his binoculars.  He's standing on the black rocky\n             beach.  It's damp, slick, and cold.  A fog's rolling in.\n\n             Hap and Farrell are sitting behind a cluster of rocks.  A\n             couple paper bags and a megaphone.  They're comparing guns.\n\n                                 FARRELL\n                       Glock 40.  All plastic save the barrel\n                       and firing pin.  Never rusts.  What do\n                       you carry down in Seattle?\n\n             Hap reaches into his holster.  Pulls out a...\n\n                                 HAP\n                       Smith and Wesson 45.\n\n                                 FARRELL\n                       Excellent!\n\n             Fred Duggar's standing on the other side of them.  He's got a\n             pair of binoculars, too.  They're staking out the cabin.\n             Been there a while.\n\n                                 ELLIE (O.S.)\n                       Brought some coffee...\n\n             Ellie appears with a thermos.  Crouching down.  Fred turns,\n             annoyed.\n\n                                 FRED\n                       What are you doing here?\n\n                                 WILL\n                           (answering for her)\n                       I told her to come.\n\n             Fred shoots Will a look.  Down at his cowboy boots.  Will\n             gives him a smile.\n\n                                 ELLIE\n                       Anything yet?\n\n                                 WILL                    FRED\n                       Nothing.                Nothing.\n\n             Fred goes back to scanning, pissed.\n\n                                 FARRELL\n                       Maybe this guy doesn't read the papers.\n\n                                 HAP\n                       Or goes straight to the Sports Section.\n\n             Hap and Farrell chuckle.  Hap unscrews the thermos.  A cloud\n             of steam.\n\n                                 HAP (cont'd)\n                       Who gets first dibs?\n                           (looks up at Will)\n                       Will?\n\n             Will looks down at his partner.  Holding out the thermos like\n             a weird kind of truce.  Will turns away, rejecting it.  A\n             swath of thick fog unfolds over the black rocks as...\n\n             Fred tenses.\n\n                                 FRED\n                           (looking through binoculars)\n                       I see someone!\n\n             Hap and Farrell scramble to their feet.  Will whips up his\n             binoculars.\n\n             POV THROUGH WILL'S BINOCULARS - a FIGURE making its way to \n             the cabin.  Furtive.\n\n                                 WILL (O.S.)\n                       That's him.\n\n             Will lowers the binoculars.  Snaps his fingers at the men.\n \n                                 WILL (cont'd)\n                       Fan out.\n\n             Fred, Farrell and Hap.  Start spreading out.  Ellie steps\n             up.  Will looks back at her.  Too dangerous.\n\n                                 WILL (cont'd)\n                       Stay here, Ellie.\n\n                                 ELLIE\n                       But...\n\n             Will puts up his hand.  She stops short.  He plunges ahead.\n\n             Hap.  Will.  Farrell.  Fred.  Fanning out.  Silent.  Keeping\n             eye-contact.  Will points to Farrell.  Wants the megaphone.\n             Farrell, balancing on a rock, holds it out.  Accidentally\n             keys it.  The feedback SQUAWKS.  Fuck.\n\n                                 FRED\n                       He's bolting!\n\n             POV THROUGH WILL'S BINOCULARS - the FIGURE, looking around,\n             running towards the cabin.  Leaping from rock to rock.\n\n             WILL reaches for his Smith and Wesson.\n\n                                 WILL\n                       Go!  Go!  Go!\n\n             The men jump into action.  Race down towards the cabin.\n\n             Fred and Farrell, nimble over the wet rocks.  Will and Hap,\n             harder going.  Grab onto jagged edges, slip down small\n             crevices.  Rocks sticking out every which way.  The fog,\n             thick and white...\n\n             THE FIGURE disappears into the cabin.\n\n             FRED AND FARRELL leap up onto a tall boulder and jump down.\n             Run over to the door of the cabin, guns at the ready...\n\n             WILL rounds the boulder, Hap panting behind him.  Joins Fred\n             and Farrell at the door.\n\n             Will levels his Smith and Wesson at the door, and with a nod\n             to Fred as he KICKS it in...\n\n             INT. FISHING CABIN - CONTINUOUS\n\n             ...the door CRACKS and swings in.  The men rush inside.\n\n                                WILL\n                       Police!\n\n             They look around:  Nothing.  A few old nets, a wooden table\n             rotted through.  No knapsack.\n\n             In the corner, a TRAP DOOR, left open.  Will races over.\n             Looks down into the darkness.\n\n                                 WILL (cont'd)\n                       Goddammit!\n\n             Turns and points to Farrell.\n\n                                 WILL (cont'd)\n                       You!  Head back up to base...\n                           (to Fred)\n                       You!  Go right and follow along the\n                       water...\n                           (to Hap)\n                       Hap!  You go left...\n\n             The men nod.\n\n                                 WILL (cont'd)\n                       Go!\n\n             They rush out the door and split directions.  Will crouches\n             down by the trap door and...\n\n             INT. TUNNEL - CONTINUOUS\n\n             ...drops down into a dark, dank TUNNEL.  Water dripping.\n             FOOTFALLS echoing.  Will cocks his head.  Left or right?\n             Starts sprinting down towards the lighter end of the tunnel,\n             his own footsteps bouncing against the tunnel walls.  He\n             rounds a curve.  Sound recedes...\n\n             EXT. TUNNEL - CONTINUOUS\n\n             ...He exits the tunnel onto the rocky beach.  Stops short.\n\n             FOG\n\n             has enveloped everything - obscuring all vision, dulling all\n             sound.  Like a strange dream.  Eerie.\n\n             Will blinks against the thick whiteness.  Strains to hear any\n             sound, anything.  There's only the distant LAPPING of the\n             water.\n\n             He tightens his grip on his gun and plunges into the fog.\n             Quick, careful steps.  Stumbles over a rock.  Waves his gun\n             in defense.  Eyes wide open like a blind man...\n\n             SUDDENLY\n\n             a GUNSHOT.  Off to the right.  Will whips his head around.\n\n             EXT. UP ON THE BEACH - CONTINUOUS\n \n             Ellie, alone, jumps at the sound.  Reaches for her weapon...\n\n             EXT. DOWN THE BEACH - CONTINUOUS\n\n             Will heads towards the sound.  Reaching out for approaching\n             rocks.  Scrambles over a small bank and finds...\n\n             FARRELL rolled up into a fetal position on the ground. \n             Clutching his thigh.  Blood seeping through his fingers.  He\n             looks up.\n\n                                 FARRELL\n                       Sorry about...\n\n                                 WILL\n                       Where is he?\n\n             Farrell can't answer that.\n\n                                 WILL (cont'd)\n                           (impatient)\n                       Where'd the shot come from?\n\n             Farrell lifts his bloody hand.  Points off towards the water.\n\n                                 FARRELL\n                       Over there.\n\n             Will disappears back into the fog, leaving Farrell behind.\n\n             Clambers back down towards the water, pausing every few \n             seconds to listen, to adjust.  Heart POUNDING.  Blood \n             pumping.  Like an animal tracking its prey.  Leaps up onto a\n             plateau of rocks when...\n\n             SUDDENLY\n\n             a DARK FIGURE\n\n             flashes past him.  The killer!  Inches away.  Will wheels\n             around...\n\n                                 WILL\n                       Freeze!\n\n             CRACK!  Squeezes off a shot.  Misses!  Can't believe it.\n             Goes for another... Nothing!  Jammed!  The figure,\n             disappearing.  Will tosses his Smith and Wesson, reaches\n             behind his back and whips out his SMITH 39/13...\n\n             EXT. UP ON THE BEACH - CONTINUOUS\n \n             Ellie, weapon drawn, making her way down the rocks.  A HAND\n             suddenly grabs her arm.\n\n                                 VOICE (O.S.)\n                       Dammit, Ellie!...\n\n             Fred emerges from the fog.\n\n                                 FRED (cont'd)\n                       Put that thing away!  Farrell's down!...\n\n             CRACK! as another shot rips through the air.  Fred and Ellie\n             freeze.\n\n             EXT. DOWN BY THE WATER - MINUTES LATER\n\n             Fred and Ellie, skittering down the rocks.  Getting closer to\n             the water.  Hear a voice ring out...\n\n                                 VOICE (O.S.)\n                       Hap!\n\n             The fog starts to dissipate.  They reach the water to see...\n\n             WILL DORMER\n\n             kneeling beside the body of his partner.  Lying in the water.\n             Shot in the stomach.  Blood dribbling from his mouth.  Will\n             grabs him up by the collar.\n\n                                 WILL\n                       Hap!\n\n             Starts shaking the limp body.  Teeth clenched.\n\n                                 WILL (cont'd)\n                       Hap!\n\n             Hap's head, rolls back.  Mouth agape.  Face white...\n\n             Will, rips off his tie.  Presses it to the gaping wound...\n             trying to stop the bleeding...warm blood, pumping into the\n             water...\n\n             Ellie watches.  Horrified.  Fred races over to the body.\n             Feels for Hap's pulse.\n\n                                 FRED\n                       Dormer...\n\n             Will, shaking Hap again.  Jaw set.  Eyes intense.  Veins\n             popping up along his temples.  Fred catches his shoulder.\n\n                                 FRED (cont'd)\n                       Dormer!  He's gone.\n\n             Will looks up at Fred.  His face contorts.\n\n             Suddenly leaps to his feet.  Grabs a rock and hurls it\n             savagely into the thick fog.\n\n             INT. CHIEF CHARLES NYBACK'S OFFICE - NIGHT\n\n             Chief Nyback sits in his chair.  Fingers interlaced.  A \n             somber expression on his face.\n\n                                 CHIEF NYBACK\n                       And then you lost him.\n\n             Will sits opposite him.  Wet, dishevelled, dirty.  Hap's\n             blood smeared all over his shirt.  Staring off into space.\n\n                                 WILL\n                       And then I lost him.  In the fog.\n\n                                 CHIEF NYBACK\n                       About how long 'til you heard the\n                       suspect's second shot?\n\n             Will, hesitates.\n\n                                 WILL\n                       Twenty, thirty seconds.  I followed the\n                       sound down to the water.  That's where...\n\n             He blinks.  Looks down.  Swallows.\n\n                                 WILL (cont'd)\n                       That's where I found Hap.\n\n             Nyback sighs, shakes his head.  Reaches down to his bottom\n             drawer and pulls out a bottle of bourbon and a glass.\n\n                                 CHIEF NYBACK\n                       I think you need a glass of this.\n\n             He goes to unscrew the bottle, but Will shakes his head.\n             Stands.  Paces.  Rakes his hand through his hair.\n\n             Turns suddenly and swipes his arm across Nyback's desk.\n             Everything CRASHES to the floor.\n\n                                 WILL\n                           (yells)\n                       Why didn't I know about that goddamn\n                       tunnel, Charlie?\n\n             Nyback looks up at him.  Calm.\n\n                                 CHIEF NYBACK\n                       There's a bunch of those tunnels out\n                       there, Will.  From bunkers over sixty\n                       years old.  I don't even know half of\n                       them myself, and I grew up here.\n\n             Will clenches his fists.\n\n                                 WILL\n                       I had him, Charlie.  Right in front of\n                       me.  Not two feet.  I could smell the son-\n                       of-a-bitch.  Playing with me.  And I\n                       missed the shot.  He was right there and\n                       I missed the shot!  Then my goddamned gun\n                       jammed...\n\n             Nyback gets up.  Limps over to his old friend.\n\n                                 CHIEF NYBACK\n                       Will, you can't blame yourself.\n\n                                 WILL\n                       I had him!\n\n                                 CHIEF NYBACK\n                       It's only gonna make you crazy.\n\n             Just then there's a soft KNOCK on the door.  The men look\n             over.  Ellie sticks her head in.  Speaks in a tone that\n             belies that a man has recently died.\n\n                                 ELLIE\n                       You wanted to see me?\n\n             Will turns his back to her.  Nyback heads over.\n\n                                 CHIEF NYBACK\n                       Right, Ellie.\n\n             Ellie flicks a look at the pile on the floor.  At Will's\n             back.\n\n                                 CHIEF NYBACK (cont'd)\n                       I want you to take care of the\n                       investigation into Detective Eckhart's\n                       shooting.\n\n             Ellie looks at him.  Confused.  Lowers her voice.\n\n                                 ELLIE\n                       But what about the Connell case?  I'm on\n                       the Connell case.\n\n             Nyback puts a hand on her shoulder.\n\n                                 CHIEF NYBACK\n                       We need paperwork, Ellie.  You know that.\n                       Just write up a quick report.\n\n             Ellie's shoulders droop.  Thought she was playing with the\n             big boys.  Just then Will turns abruptly and grabs his coat.\n\n                                 WILL\n                       I'm going to check on the roadblocks...\n\n             Nyback catches his arm.\n\n                                 CHIEF NYBACK\n                       You're no good right now, Will.  Go back\n                       to the Lodge.  Try to get some rest.\n\n             Will looks at him.  Know's he's right.\n\n             EXT. ROAD - NIGHTMUTE - DAY\n\n             CLOSE ON a SQUEALING tire, ripping around a curve...\n\n             INT./EXT. SILVER JEEP CHEROKEE - CONTINUOUS\n\n             Will driving.  Speeding.  Scenery whipping past the window.\n             His hands, tight around the steering wheel.  The hula-girl,\n             dancing beneath the rear view mirror, a smile plastered to\n             her face.\n\n             He grows suddenly pale.  Pulls the Cherokee off to the side.\n\n             EXT. STREET - CONTINUOUS\n\n             Will jumps out of the Cherokee, leaving the door open.  Runs\n             down an ALLEY behind a row of shops.\n\n             INT. ALLEY - CONTINUOUS\n\n             A couple industrial trash bins.  Will leans his hand against\n             the wall and vomits.  Hovers for a moment, saliva dripping\n             from his mouth.  Braces himself.  Heaves again.  Hears a \n             BUZZING behind him.  Turns.\n\n             A DEAD DOG lying next to a dumpster.  FLIES buzzing around\n             its head.  Teeth bared.  Eyes wide open.\n\n             Like it's watching him.\n\n             INT. PIONEER LODGE - LATER\n\n             Will walks up to reception.  No one there.  Just wants his\n             key.  Rings the bell.  In the back room, he hears a RADIO.\n\n                                 RADIO\n                       ...earlier this evening after an aborted\n                       attempt to apprehend a suspect.  He was\n                       forty-five...\n\n             It clicks off abruptly.  Rachel appears in the doorway.\n             Takes in the blood on Will's shirt.\n\n                                 RACHEL\n                       I'm sorry about your partner.\n\n             Will looks at her.  She walks over to the desk.\n\n                                 RACHEL (cont'd)\n                       It's been on the radio for the last two\n                       hours.  Nothing but that.  Like when they\n                       found Kay Connell's body.\n                           (sympathetic smile)\n                       We're not used to this sort of thing up\n                       here.\n\n             She reaches for his key.\n\n                                 RACHEL (cont'd)\n                       He was standing right there just a couple\n                       of days ago.  Your partner.  Exactly\n                       where you are now.\n                           (beat)\n                       I hope I was nice to him.\n\n             Will takes his key.\n\n                                 WILL\n                       You were nice to him.  He liked you.\n\n             He smiles faintly, turns to go.  Just then the phone RINGS.\n\n                                 RACHEL\n                           (answering)\n                       Pioneer Lodge?...\n                           (listens)\n                       Hold on a second.  He's right here.\n\n             Will stops.  Turns.  Rachel holds up the phone.  Covering the\n             mouthpiece.\n\n                                 RACHEL (cont'd)\n                       John Warfield.  He's called a couple of\n                       times.\n\n             Will's stomach drops.  That's the last phone call in the \n             world he wants to take.  Rachel reads his face.\n\n                                 RACHEL (cont'd)\n                       Want me to lie?\n\n             Will shakes his head.  Steps back and takes the phone.\n             Clears his throat.\n\n                                 WILL\n                           (into phone)\n                       Dormer.\n\n             PAUSE.  A bemused VOICE on the other end.\n\n                                 WARFIELD'S VOICE\n                       Detective Dormer.  I've been trying to\n                       reach you.  I was very sorry to hear\n                       about your partner, Detective Eckhart.\n                       It must have been a terrible shock, what\n                       happened this morning.\n\n             Will.  Not giving this asshole an inch.  Rachel, trying not\n             to listen.\n\n                                 WILL\n                           (into phone)\n                       That's not exactly how I'd put it.\n\n                                 WARFIELD'S VOICE (cont'd)\n                       No, no.  I suppose not.  But I look\n                       forward to reading the report.  Very\n                       sad.  Very sad.  Funny...\n\n                                 WILL\n                           (into phone)\n                       What do you mean, \"Funny?\"\n\n                                 WARFIELD'S VOICE\n                       Oh, nothing.  Just that I felt Detective\n                       Eckhart and I, Hap and I, were starting\n                       to make a real connection before you\n                       left.  I sensed that he was ready to get\n                       some things off his chest.  Did you\n                       sense anything like that, Detective?  I\n                       mean, as his partner?...\n\n             Will, squeezing the phone cord with his bloody fist.\n\n                                 WARFIELD'S VOICE (cont'd)\n                       ...You were his partner for, what, about\n                       ten years?...\n\n             Will turns from Rachel.  Eyes burning.  Voice steady.\n\n                                 WILL\n                           (into phone)\n                       You know why everyone hates you,\n                       Warfield?  It's not your questions, it's\n                       not your press conferences, it's not even\n                       your cheap suits; everyone hates you\n                       'cause day after day you suck the marrow\n                       out of real cops when you never had the\n                       balls to become one yourself.  Well I got\n                       to tell you, it's a shame you're not up\n                       here with me because I'd love to show you\n                       right now just what a real cop is capable\n                       of.  You just remember that when you're\n                       sitting at your bullshit desk reading\n                       your bullshit report on my dead partner!\n\n             SLAM!  He hangs up the phone.  Runs his hand through his\n             hair.  Turns back to Rachel.\n\n                                 WILL (cont'd)\n                       Next time.  Go ahead and lie.\n\n             EXT. ROCKY BEACH - OUTSIDE NIGHTMUTE - MORNING\n\n             Fog everywhere.  Dense.  White.  Suffocating.\n\n             We're running through it.  Clambering over rocks.  Hearing\n             the sound of our own BREATHING.  Our own HEARTBEAT.\n             Adrenaline pumping.  An animal tracking its prey...\n\n             SUDDENLY a DARK FIGURE\n\n             flashes past.  Just inches away.  Playing with us.  Taunting\n             us.  We whip round with our weapon and...\n\n             INT. WILL'S ROOM - LATE NIGHT\n\n             BANG!  Will bolts upright in bed.  A film of sweat over his\n             body.  Breathing hard.  The sound that woke him: the window\n             shade FLAPPING open.  LIGHT floods the room.\n\n             Will gets up.  Goes over to the shade and pulls it down.  It\n             lurches up halfway.  He tugs it down again.  It slaps all the\n             way open.  Will yanks it down so hard it rips off the window.\n\n                                 WILL\n                       Goddammit!\n\n             He gets tangled in it.\n\n                                 WILL (cont'd)\n                       Goddamned...thing!\n\n             Pulls it off and flings it in the corner.\n\n             INT. WILL'S ROOM - 4:22 A.M.\n\n             The digital clock flips to a new minute:  4:23.  Will,\n             pacing.  Scratching at his stubble.  Unable to sleep.  Keeps\n             stepping on a SQUEAKY floorboard.\n\n             Slows near the ADJOINING DOOR that leads into Hap's room.\n             Hovers.  Lightly pushes the door open.  Sees...\n\n             THE PICTURES on the bedside table.  A WOMAN and three teenage\n             GIRLS.  Hap's family.\n\n             INT. BATHROOM - 5:18 A.M.\n\n             Water gushing out of the faucet.  Will's WATCH sitting on the\n             sink's edge.  5:18.\n\n             Will reaches up into the open medicine cabinet for a bottle\n             of aspirin.  Shakes out a couple.  Cups his hand under the\n             water and knocks the pills back.\n\n             Closes the medicine cabinet and CRIES out...\n\n             HAP'S REFLECTION\n\n             looming behind him.\n\n                                 HAP\n                       They're watching us, Will...\n\n             Will whirls around...\n\n                                 WILL\n                       Hap!\n\n             ...nothing.  No one's there.\n\n             EXT. MAINSTREET - NIGHTMUTE - MORNING\n\n             CLOSE ON running shoes, POUNDING the tarmac.  PULL BACK to\n             reveal Will running down Nightmute's main street.  Eyes\n             bloodshot.\n\n             A COUPLE NATIVE ALASKANS walking into a hardware store.  Stop\n             talking and glance over at him.\n\n             A YOUNG MOTHER in her husband's work shirt.  Lifts her small\n             KIDS into the cab of a 4x4.  Watches him pass.\n\n             AN OLDER MAN fixing the broken \"E\" on his store front.  Turns\n             at the sound of Will's footfall.\n\n             Everyone edgy.  Cautious.  A murderer amongst them.\n\n             Will continues on.  Looking straight ahead.  Wipes the sweat\n             from his neck.  Slows to a stop just outside the...\n\n             LOCAL CONVENIENCE STORE\n\n             A blown-up picture of KAY CONNELL in the window.  Below, a\n             painted sign:  We miss you, Kay.\n\n             A stack of newspapers by the front door.  The \"Nightmute\n             Ledger.\"  The headline:  Seattle Cop Killed by Suspect.\n\n             Will picks one up.  Stares down at it.  Rain starts to dot\n             the paper.\n\n                                 CHIEF NYBACK (O.S.)\n                       ...We're going to bring down a couple of\n                       guys from Ridgemount, but I want us to\n                       step up the investigation here...\n\n             INT. BULLPEN - NIGHTMUTE PD - CONTINUOUS\n\n             Rain hammering against the windows.  Chief Nyback addresses\n             the bullpen.  Everyone's there except Farrell.\n\n                                 CHIEF NYBACK\n                       ...Nightmute hasn't lost an officer in\n                       thirty-seven years, and even though\n                       Detective Eckhart wasn't from here, he\n                       was as good as one of us on this case.  I\n                       had the honor of working with him down in\n                       Seattle for a number of years.  He was a\n                       fine detective and an even better man.\n\n             Will stands nearby, watching the rain hit the windows.  His\n             suit pants are slightly wrinkled.  Nyback nods towards Fred.\n\n                                 CHIEF NYBACK (cont'd)\n                       Fred, you'll be working with Detective\n                       Dormer directly from now on.\n\n             Fred, stroking his moustache, nods.  Nyback turns to Will.\n\n                                 CHIEF NYBACK (cont'd)\n                       Will?  Anything you'd like to add?\n\n             Will looks up.  Everyone's eyes turn to him.  He shakes his\n             head.\n\n                                 CHIEF NYBACK\n                       Okay.  Then let's get to it.\n\n             Feet shuffling.  Chairs scraping the floor as people get up.\n             A sense of determination in the air.  Will grabs his coat.\n\n                                 ELLIE (O.S.)\n                       Detective Dormer?\n\n             He turns.  Ellie is beside him, holding a map.\n\n                                 ELLIE (cont'd)\n                       I'm sorry to bother you, but I was asked\n                       to write the report on...\n                           (lowers eyes)\n                       ...you know what I was asked to write the\n                       report on...\n                           (looks back up)\n                       ...Could you, just to be accurate, for\n                       the report, could you just point out\n                       where you were when you saw Detective\n                       Eckhart yesterday?\n\n             She holds out the map.  It's of the small stretch of\n             coastline.  Red circles marking various points.\n\n             Will looks down at her.  Takes the map.  Turns it around.\n\n                                 WILL\n                       It's good to be accurate, Ellie.  You're\n                       doing your job.\n\n             He looks down at the map.  Ellie watching his face.\n\n                                 ELLIE\n                       I'm so sorry about what happened.  I know\n                       you did everything you could...\n\n             Will points to a spot.  Cutting her off.\n\n                                 WILL\n                       I was here.\n\n             Hands her back the map.  Smiles.  Just then Fred walks up.\n\n                                 FRED\n                       Dormer.  Still no sign of the bullet that\n                       went through Farrell.\n\n                                 WILL\n                       I'm going to the hospital to talk to him\n                       now.\n                           (looks at his watch)\n                       You get the search party together.  No\n                       fewer than thirty people.  I'll meet you\n                       in exactly twenty-five minutes.  Don't\n                       waste any time.\n\n             He pulls on his coat and heads for the door.  Fred watches\n             him leave.  Sticks a toothpick in his mouth.\n\n                                 FRED\n                       Partner or no partner.  That guy's a\n                       prick.\n\n                                 ELLIE\n                       He has to be a prick, Fred.  He's a great\n                       detective.\n\n             INT. HOSPITAL ROOM - ST. FRANCIS HOSPITAL - DAY\n\n             CLOSE ON the cover of one of the paperbacks, Otherwise\n             Engaged by Walter Byrd.\n\n             PULL BACK to reveal Farrell lying in a hospital bed in\n             striped pajamas, reading it.  A tear runs down his cheek as\n             he turns the page.\n\n             A SNICKERS BAR is tossed onto his lap.  He looks up.  Face\n             brightens.\n\n                                 FARRELL\n                       Detective Dormer!\n\n            Will stands by his bed.  Farrell puts down the book.  Picks\n            up the Snickers.\n\n                                 FARRELL (cont'd)\n                       You don't seem like the bring-an-\n                       underling-who's-in-the-hospital-a-\n                       Snickers-bar kind of guy.\n\n                                 WILL\n                       I'm not.\n\n             He pulls up a chair.  Nods to the paperback.\n\n                                 WILL (cont'd)\n                       How's the book?\n\n             Farrell bites into the candy bar.\n\n                                 FARRELL\n                       Oh, a real tear-jerker.  Brody, the good\n                       guy, just got shot.\n\n             He stops chewing.  Realises the association.  Swallows\n             uncomfortably.\n\n                                 FARRELL (cont'd)\n                       Oh.  I'm sorry.  About Hap.  Detective\n                       Eckhart.\n\n                                 WILL\n                       Thanks.\n\n                                 FARRELL\n                       I wish I'd had the chance to get to know\n                       him better.  Take him fishing or\n                       something.\n\n                                 WILL\n                       He would have liked that.\n\n                                 FARRELL\n                       We just gotta catch the bastard, right?\n\n                                 WILL\n                       That's why I'm here.  I need to know\n                       exactly what you saw yesterday, Farrell.\n\n                                 FARRELL\n                       What I saw?\n\n                                 WILL\n                       Anything.  It's important.\n\n             Farrell takes another bite of the Snickers.  Like a little\n             boy.  Furrows his brow, trying to remember.\n\n                                 FARRELL\n                       Pretty much nothing.  That fog was so\n                       thick.  The bullet seemed to come out of\n                       nowhere.  I don't even remember seeing \n                       any shapes.  Then I saw you.  But only\n                       when you came up close.  Then you\n                       disappeared again.\n                           (shrugs)\n                       I guess I heard more than I saw.\n\n             Will sighs, rubs his eyes.\n\n                                 FARRELL (cont'd)\n                       Sorry.\n\n                                 WILL\n                       No.  No.  Don't be sorry.  It's not your\n                       fault.\n\n             Just then a NURSE comes in with a Dixie cup.  Pretty,\n             freckled face.  Not much older than Kay Connell.\n\n                                 NURSE\n                       Time for your meds.\n\n             Farrell smiles at her, winks at Will.\n\n                                 FARRELL\n                       Lonnie and I went to high school\n                       together.\n\n             Lonnie gives him the cup.\n\n                                 LONNIE\n                       Just take the pills, Farrell.\n\n                                 WILL\n                       How's the leg?\n\n                                 FARRELL\n                       Oh, you know.  Don't feel that much.\n                       Bullet went right through.\n\n                                 WILL\n                       Right.  Got lost in the rocks.\n\n                                 FARRELL\n                       We'll get the other one, though.\n\n             Will looks up.  Farrell pops the rest of the Snickers in his\n             mouth.\n\n                                 FARRELL (cont'd)\n                       After the autopsy.\n\n             INT. HALLWAY - HOSPITAL - LATER\n\n             Will walks down the hallway.  Light pouring in from a set of\n             high windows.  He looks tired.  Set-upon.\n\n             POV of SOMEONE\n\n             WATCHING HIM.  From a doorway.  Not close, not far.  A HAND\n             comes into view.  Small.  Bruised knuckles.  Holds on to the\n             door jamb.  Watches as...\n\n             Will suddenly stops.  Skin prickling at the back of his neck.\n             Turns and looks around.\n\n             A MAN in a wheelchair.\n \n             A LITTLE GIRL tugging at her hospital gown.\n\n             A couple of NURSES laughing at check-in.\n\n             An empty doorway.\n\n             Nothing.\n\n             EXT. ROCKY BEACH - OUTSIDE NIGHTMUTE - MORNING\n\n             Back at the beach.  We see nothing but fog.  A VOICE comes\n             through.\n\n                                 ELLIE (O.S.)\n                       ...and it was at this point that Detective\n                       Dormer headed towards the noise...\n\n             Ellie emerges from the fog.  Carrying the map and talking\n             into a small tape recorder.  She's climbing over the rocks,\n             wearing a windbreaker a couple sizes too big.\n\n             A UNIFORMED OFFICER follows, carrying a camera.  She turns to\n             him.\n\n                                 ELLIE (cont'd)\n                       Remember, Kepp, shoot everything...\n                           (back to the tape recorder)\n                       ...wherein he discovered the wounded\n                       Detective Farrell Brooks, having been\n                      shot in the vastus externus of the upper\n                      left thigh...\n\n             She climbs over the same bank Will Dormer climbed two\n             evenings before.  Finds...\n\n             ANOTHER UNIFORMED OFFICER, hanging out and smoking.\n\n                                 ELLIE (cont'd)\n                       Francis!\n\n             He looks up.  Pimples on his chin.\n\n                                 FRANCIS\n                       What?\n\n                                 ELLIE\n                       You're supposed to be Farrell.  Shot in\n                       the thigh and writhing in pain.\n\n                                 FRANCIS\n                       C'mon, Ellie.  What's it matter?\n\n                                 ELLIE\n                       Accuracy.  That's what.\n                           (points to the ground)\n                       Now get down.\n\n             Francis looks up at her.  Flicks his cigarette away and gets\n             down amongst the rocks.  Holds his thigh like he was shot.\n\n                                 FRANCIS\n                       Ow.\n\n             CLICK!  Kepp takes the picture.\n\n             EXT. DOWN BY THE WATER - MINUTES LATER\n\n             Ellie sloshes through the water.  Ankles getting cold.\n             Cheeks pink.  But it doesn't matter.  She's investigating.\n\n                                 ELLIE\n                           (into tape recorder)\n                       ...shortly after hearing the second shot,\n                       Detective Dormer continued through the\n                       water until he spotted the body, lying\n                       approximately fifteen feet away.\n\n             She stops.  Looks at the map.  At the spot Will pointed out.\n     \t     Looks back up.  Fog.  Clicks off the recorder.  Calls out.\n\n                                 ELLIE (cont'd)\n                       You there, Rich?\n\n             A VOICE calls back.  Someone pretending to be Hap.\n\n                                 VOICE (O.S.)\n                       Yeah.  And I'm freezing my nads off!\n\n             Ellie furrows her brow.  Just then...\n\n             FRANCIS appears.  Slips on a rock but catches his fall.\n\n                                 FRANCIS\n                       Ellie!  Think I found something!\n\n             EXT. ROAD NEAR BEACH - DAY\n\n             CLOSE ON a row of FEET.  Mostly boots.  Some more beat-up\n             than others.  Inching forward along a road.\n\n                                 WILL (O.S.)\n                       ...Anything catches your eye, you put it\n                       in a bag.  Anything looks strange, you\n                       put it in a bag...\n\n             PULL BACK to reveal a long line of PEOPLE stretched out\n             across the road about a mile up the beach.  Some old, some\n             young.  Linking arms and moving forward.  Looking down.  The\n             SEARCH PARTY.\n\n             Will, walking up and down behind the line.  Talking through a\n             megaphone.\n\n                                 WILL (cont'd)\n                       ...Anything he may have dropped, moved,\n                       kicked, or stepped on, you put in a bag.\n                       Cigarette butts, gum wrappers, paper\n                       clips, coins, buttons - nine times out of\n                       ten a suspect leaves something behind...\n\n                                 VOICE (O.S.)\n                       Detective?\n\n             Will turns.  A couple burly GUYS with some BLOODHOUNDS.\n\n                                 BURLY GUY #1\n                       Where do you want us?\n\n             Will points over to the woods on the other side of the road.\n\n                                 WILL\n                       The woods.  One group heading south, the\n                       other heading north.\n\n             Nods to Fred who's standing nearby.  He hands the guys two\n             radios.\n \n                                 FRED\n                       Make sure they're set to channel 6...\n\n             Just then two young OFFICERS pull up in a squad car.  Young\n             and apple-cheeked.  The first one holding a piece of paper.\n\n                                 OFFICER #1\n                       We did the interviews with all the nearby\n                       houses like you asked.\n\n                                 WILL \n                       Anything?\n\n                                 OFFICER #1\n                           (shakes his head)\n                       Here's a list of who we talked to.\n\n             Hands the list to Will.  He glances it.\n\n                                 WILL\n                       Alright.  Go back and set up some follow-\n                       ups for this afternoon.\n\n             The Officers nod, put the car in reverse.  Fred saunters\n             over.  Nods towards the searchers.\n\n                                 FRED\n                       You don't think they should start further\n                       back?\n\n             Will shakes his head.\n\n                                 WILL\n                       He had to have exited here.  Over those\n                       boulders.  I saw him move, he's nimble.\n                       Would have taken the hardest way out.\n\n             Fred shrugs, skeptical.  Just then, his cell phone BLEATS.\n             He reaches for it.\n\n                                 FRED\n                           (into phone)\n                       Duggar...\n\n             Will looks back at the search team.  Slow.  Meticulous.\n\n                                 FRED (cont'd)\n                           (into phone)\n                       Where was it?\n\n             A local WOMAN.  At the end of the line.  Glances over her\n             shoulder.  Looks at Will.  Smiles.  You'll help us catch him.\n\n                                 FRED (cont'd)\n                           (into phone)\n                       Okay. \n                           (slaps phone closed)\n                       That was Ellie.\n\n             Will turns back to him.\n\n                                 FRED (cont'd)\n                       They found Farrell's bullet.  Says it\n                       looks like a 357.  After the autopsy Rich\n                       can drive 'em both to the lab in\n                       Anchorage.  Have a murder weapon by\n                       morning.\n\n             Fred crosses his arms.  Sarcastic.\n\n                                 FRED (cont'd)\n                       That is, if it's alright with you.\n\n             EXT. PIONEER LODGE - NIGHTMUTE - NIGHT\n\n             Thunder RUMBLING.\n\n             INT. PIONEER LODGE - NIGHTMUTE - NIGHT\n\n             Rachel winding an old grandfather clock with a key.  Looks\n             about a hundred years old.\n\n             Will enters the lobby.  Soaked through.  Carrying an armload\n             of wet files.  Rachel turns, sees him.  Reaches over to an\n             umbrella stand.  Hands him an umbrella.\n\n                                 RACHEL\n                       Here.  It's on the house.\n\n             Will takes it.  Preoccupied.\n\n                                 WILL\n                       Thanks.\n\n             He starts up the stairs.  Notices Rachel straining to return\n             the key to the top of the clock.  Backtracks to help her.\n             She gets it without his help.\n\n                                 RACHEL\n                       I got it.\n                           (smiles)\n                       Don't know why I bother.  It's been\n                       broken for two years.\n\n                                 WILL\n                       Habit.\n\n             Rachel looks at him.  Can't figure this guy out.  Remembers\n             something.\n\n                                 RACHEL (cont'd)\n                       Oh.  A man came by to see you earlier.\n                       Said he was your new partner.\n\n             A TINGLE skips down Will's spine.  He looks at her.\n\n                                 WILL\n                       Fred Duggar?\n\n                                 RACHEL\n                       No.  He didn't say what his name was.\n                       Only that you were expecting him.\n\n                                 WILL\n                       I'm not expecting anyone.\n\n                                 RACHEL\n                       That's not what he thinks.\n\n                                 WILL\n                       What did he look like?\n\n             Rachel thinks for a second.  Leaning against the clock.\n\n                                 RACHEL\n                       Short.  Dark hair.  Not that memorable.\n\n             Will nods, rubs his forehead.  Suddenly has a pounding\n             headache.  Turns for the stairs.  Hesitates.\n\n                                 WILL\n                       I need to borrow something.\n\n             INT. WILL'S ROOM - NIGHT\n\n             CLOSE ON a nail.  One THWACK of a hammer and it bites into\n             the wall.  PULL BACK to reveal Will nailing the corner of a\n             blanket to one side of the window.  An ad hoc curtain.\n\n             He finishes that side.  Starts to stretch the blanket across\n             the window.  Hesitates.  Looks outside.  To the left.  To the\n             right.  To see if anybody's out there.  If anybody's\n             watching.  Sees instead...\n\n             A LONE TUGBOAT chugging across the harbor.  Pulling a huge\n             freighter.  Will squeezes his eyes shut.  Opens them again.\n             Pulls the blanket fully across the window.\n\n             INT. WILL'S ROOM - 1:05 A.M.\n\n             The FILES spread across the floor.  Their edges buckled from\n             the rain.  Dozens of pictures of Kay Connell.  School\n             records.  Private letters.  Health files.  Coroner's report.\n\n             Will.  Pacing.  Back and forth.  Thinking.  Over that same\n             SQUEAKY floorboard.  The clock reads: 1:05.\n\n             INT. WILL'S ROOM - 2:20 A.M.\n\n             Will lying in bed.  On top of the blanket.  Wide awake.\n             Staring at the ADJOINING DOOR.  Into Hap's room.\n\n             EXT. PIONEER LODGE - NIGHTMUTE - LATE NIGHT\n\n             Will, in a sweatshirt and coat, heads down the front steps of\n             the Pioneer Lodge.  Jams his hands in his pockets.  The walk\n             of an insomniac.\n\n             EXT. MAINSTREET - NIGHTMUTE - LATE NIGHT\n\n             Will walking down main street.  In the middle of the road.\n             The dead of night.  No cars.  The sky a blinding white.\n\n             Hears some rowdy NOISE coming from a corner bar, beer lights\n             flickering.  A WOMAN rides by on a bicycle.  Birds SINGING.\n \n             Not day.  Not night.  Stuck somewhere in between.  Like a\n             dream.\n\n             Turns down a side street.  Passing more stores.  Guns and\n             Ammo.  Patty's Hair and Nails.  General Store.  Comes upon\n     \n             THE ALLEY\n\n             where he vomited the day before.  Stops.  Sees the DEAD DOG,\n             still down at the end.  Half obscured by the dumpster.\n\n             Will wavers, pale.  Suddenly...\n\n             A HOMELESS MAN emerges from the shadows.  Big.  Wild-eyed.\n             Awakened from his sleep.  Will, quickly backtracks to the\n             sidewalk.  Spooked.\n\n             JUST THEN the CRACK! of bat hitting ball.  He turns.  In the \n             distance.  Nightmute Elementary School.\n\n             EXT. NIGHTMUTE ELEMENTARY - LATE NIGHT\n\n             A Little League game in full swing.  The uniforms, a little\n             faded.  The diamond, a little unkempt.  A smattering of\n             SPECTATORS.  Mostly dads with six-packs.\n\n             Will wanders over to the fence.  Spots Ellie sitting alone on\n             the bottom bleacher.\n\n                                                                   CUT TO:\n\n             POV OF SOMEONE\n\n             WATCHING HIM.  From afar.  The SOUNDS of the game, delayed a\n             few seconds.  Watches as Will crosses to the bleachers...\n\n                                                              CUT BACK TO:\n\n             ...and sits down next to Ellie.  She turns, surprised.\n\n                                 ELLIE (cont'd)\n                       Detective Dormer!  What are you doing\n                       here?\n                           (looks at watch)\n                       It's two-thirty in the morning.\n                       Shouldn't you be asleep?\n\n             Will glances out at the game.\n\n                                 WILL\n                       I could say the same thing about you.\n\n                                 ELLIE\n                       Oh.  We always have play-offs in the\n                       middle of the night.  It's the best time.\n\n                                 WILL\n                       Who's playing?\n\n                                 ELLIE\n                       The Puffins and the Hawks.  We're in\n                       extra innings.  The Hawks have a really\n                       good line-up this year.\n\n             She sips on a take-out coke.  Looks back at the game.  A\n             plump, redheaded GIRL comes up to bat.  Blows a bubble.\n\n                                 ELLIE\n                       That's my sister.\n\n             Will looks over just in time to see the girl swing and miss\n             by a mile.  Ellie cups her hands around her mouth.\n\n                                 ELLIE (cont'd)\n                           (calling out)\n                       That's okay, Lib!\n                           (to Will)\n                       Usually she's better.\n\n                                 WILL\n                       She your only sibling?\n\n                                 ELLIE\n                           (nods)\n                       Twelve years younger.\n\n             Libby takes another swing.  Connects with the ball.  Drops\n             the bat and runs to first.  Ellie gives a sharp WHISTLE.\n\n                                 ELLIE (cont'd)\n                       What about you?  You have any siblings?\n\n                                 WILL\n                       No.\n                           (rubs his eyes)\n                       Well.  I had a brother.  He died when I\n                       was eleven.\n\n             Ellie, sits up...\n\n                                 ELLIE\n                       Oh, I shouldn't have...\n\n                                 WILL\n                       It's okay.  Happened a long time ago.  He\n                       was killed in a fire.  In New Mexico.\n\n                                 ELLIE\n                       That must have been awful for you.\n\n             Will leans back.  Stretching his legs.  Remembering.\n\n                                 WILL\n                       Not really. \n                           (slight smile)\n                       I remember I was more embarrassed that he\n                       had died.  Embarrassed that it made me\n                       different.  So I didn't tell the other kids\n                       at school what had happened.  They'd ask \n                       me where he was, where he'd gone.  And I'd\n                       make up stories.  He was visiting an aunt up\n                       north, he'd broken his leg, he was in a \n                       Swiss boarding school.  Stuff like that.\n                           (shakes his head)\n                       Nice kid, huh?  Just kept making up more\n                       and more lies...\n\n             Suddenly, he stops talking.  Slowly sits up.  Sensing \n             something.  Ellie, noticing the shift.\n\n                                 ELLIE\n                       You okay?\n\n             The row of DADS behind them.  Jump up and start CHEERING.\n\n                                                                   CUT TO:\n\n             POV OF THE PERSON\n\n             WATCHING WILL.  Sees him sit up.  Look around.  That same\n             prickle at the back of his neck.  A KID slides home just as...\n\n                                                              CUT BACK TO:\n\n             ...Will stands.  Trying to shake the feeling.\n\n                                 WILL\n                       I'm going back to the Lodge, Ellie.\n                       Still need to go through some of Kay\n                       Connell's school records.\n\n                                 ELLIE\n                           (unsure)\n                       Okay.\n\n             He turns to go, scanning the area.  Ellie calls after him.\n\n                                 ELLIE (cont'd)\n                       Try to get some sleep!\n\n             EXT. NIGHTMUTE MORGUE - EARLY MORNING\n\n             The Nightmute morgue.  Next morning.  A SQUAD CAR pulls up.\n             Francis gets out, whistling.  Starts for the morgue's\n             entrance.\n\n             INT./EXT. JEEP CHEROKEE - EARLY MORNING\n\n             Will in the Cherokee.  Dark circles under his eyes.  Suit\n             jacket wrinkled.  Pulls in next to Francis' squad car.\n\n                                 WILL\n                           (calls out window)\n                       Officer!...\n\n             Francis turns.\n\n                                 WILL \n                       I'll pick it up.  You head back to the\n                       station.\n\n             INT. HALLWAY - NIGHTMUTE MORGUE - EARLY MORNING\n\n             Will walking down a hallway.  Fluorescent lights.\n             Cinderblock walls.  On his cell phone.\n\n                                 WILL\n                           (into phone)\n                       Duggar - I'm at the coroner's now.  I'll\n                       be back in about twenty minutes...\n\n             Stops at an open doorway in time to see\n    \n             THE CORONER pull a sheet over the cold, blue body of Hap\n             Eckhart.\n\n             Will's heart lurches.  He grabs on to the door jamb.  Wasn't\n             ready for that.  The coroner looks up.\n\n                                 CORONER\n                       Detective.  Thought you were sending one\n                       of your lackeys.\n\n             Will clears his throat.  Closes his cell phone.\n\n                                 WILL\n                       I thought it was better if I came.  Under\n                       the circumstances.\n\n             The coroner nods.  Goes to wash her hands.\n\n                                 CORONER\n                       It's different when you know them, isn't\n                       it?\n                           (nods to clipboard)\n                       Just sign over there and she's all yours.\n\n             Shrugs off her lab coat.  She's wearing a blue dress.  Looks\n             like a piano teacher.  Heads into an adjoining office.\n\n             Will.  Alone.  Steps into the room.  The smell of\n             formaldehyde.  Bloody instruments on a stainless steel tray.\n             Walks towards the clipboard, eyes flicking over to the shape\n             under the sheet when...\n\n             SUDDENLY Hap's HAND drops down.  Thick fingers.  Wedding\n             band.\n\n             Will jumps...\n\n                                 CORONER (O.S.)\n                       Your partner didn't suffer much...\n\n             The coroner re-emerges from the office with a manila\n             envelope.  Hap Eckhart written on it in black pen.\n\n                                 CORONER (cont'd)\n                       Maybe for a minute or two.\n\n             Will rubs his face.  Tries to focus on the clipboard.  The\n             coroner holds out the envelope.  Smiles.\n\n                                 CORONER (cont'd)\n                       Just enough time to reflect.\n\n                                 WILL\n                       Thanks, Doc.\n\n             He takes the envelope.  The coroner peers up at him.\n\n                                 CORONER\n                       You're looking a little green, Detective.\n\n             INT. BULLPEN - NIGHTMUTE PD - DAY\n\n             Fred Duggar, dialing the phone at his cluttered desk.\n\n                                 WILL (O.S.)\n                       So where's the other bullets?\n\n             He looks up.  Will standing before him, holding the manila\n             envelope.\n\n             INT. STORAGE ROOM - NIGHTMUTE PD - DAY\n\n             CLOSE on a key slipping into a padlock.  Opens with a CLICK!\n\n             PULL BACK to reveal Fred and Will in a small storage room.\n             Standing in front of an army-green LOCKER.  The evidence\n             locker.  Room's stuffed with old files and boxes.  MOOSE\n             ANTLERS hanging over a small window.  Will glances up.\n\n                                 WILL\n                       What's with all the moose antlers around\n                       here?\n\n             Fred throws a look over his shoulder.  Opens the locker.\n\n                                 FRED\n                       Lots of moose.\n\n             INSIDE THE LOCKER - another manila envelope.  The name on\n             this one: Farrell Brooks.\n\n             Fred reaches back for the other envelope.  Will, hesitant to\n             give it to him.  Feeling the bump of the bullet in the bottom\n             corner.  Hands it over.  Wipes his brow.\n\n                                 WILL\n                       When's Rich coming?\n\n             Fred slides it in beside Farrell's.  Closes the locker door.\n\n                                 FRED\n                       I'll call him now.\n\n                                 WILL\n                       First I need a copy of the key.\n\n             Fred turns, a twinkle in his eye.\n\n                                 FRED\n                       This isn't Seattle, Detective.  We don't\n                       have copies.\n                           (holds up key)\n                       This is the only one.\n\n             Will looks at him.  At the key.  Plucks it from his hand.\n             Just then Nyback's SECRETARY appears in the doorway.\n\n                                 SECRETARY\n                       Detective Dormer?  Telephone.\n\n             INT. BULLPEN - NIGHTMUTE PD - DAY\n\n             The secretary hands Will the phone.  Pulls something from\n             under the desk.  A beat-up BOX.  Will's name on it.\n\n                                 SECRETARY\n                       This came for you earlier.\n\n             Will glances at it.  Takes the phone.  Rubs his eyes.\n\n                                 WILL\n                           (into phone)\n                       Dormer.\n\n             Nothing.  Someone's there but they're not saying anything.\n             Will, too tired for this shit...\n\n                                 WILL (cont'd)\n                       Goddammit, Warfield, if you're gonna\n                       check up on me every...\n\n             Then...the VOICE.  A MAN's voice.  Not John Warfield's.\n             This voice is medium-ranged.  Higher.  Nose sounds stuffed.\n\n                                 MAN'S VOICE\n                       I bet you haven't been getting much\n                       sleep.\n\n             Will straightens.  Something weird.\n\n                                 WILL\n                           (into phone)\n                       What?\n\n             A little TITTER on the other end.\n\n                                 MAN'S VOICE\n                       You lower-48s.  You think the white\n                       nights are kind of neat.  Then you can't\n                       sleep for days.  I've seen it happen\n                       about a million times.  But you can't\n                       sleep for a different reason.\n\n                                 WILL\n                           (into phone)\n                       Who is this?\n\n             A PAUSE.  Will loosens his tie.\n\n                                 WILL \n                           (into phone)\n                       I said, who is this?\n\n             The voice.  Dropping to a WHISPER.\n\n                                 MAN'S VOICE\n                       I saw what really happened, Will...\n\n             Will, furrows his brow.\n\n                                 MAN'S VOICE\n                       I saw you kill your partner.  With your\n                       back-up weapon.  Out there on the beach.\n                       I saw you shoot him dead...\n\n             CLOSE ON\n\n             Will Dormer's face.\n\n             As all the blood drains from it.\n\n             As all SOUND\n\n             fades around him.\n\n             As his heart\n \n             begins to POUND against his chest.\n\n             He falters, reaching out for the desk.  To steady himself.\n             As if the floor's just dropped out beneath him.  Eyes,\n             darting around the bullpen...\n\n                                 WILL\n                           (sotto, into phone)\n                       Now you listen to me...\n\n                                 MAN'S VOICE\n                       Don't worry.  I won't tell anyone.  Oh,\n                       and I saw you take my gun.  My uncle's\n                       old 357.  I dropped it in the rocks.\n                       But you can go ahead and keep that.\n\n             CHIEF NYBACK, exits his office.  Looks at Will and smiles.\n\n                                 MAN'S VOICE (cont'd)\n                       ...I mean...\n                           (beat)\n                       ...Now that we're partners.\n\n             CLICK.  The line goes dead.\n\n             Will, throat constricted.  Listening to the DIAL TONE.\n             Smiles back at Nyback.  Turns.  Slowly hangs up the phone.\n             White as a sheet.  Trying to act normal.  Trying to act calm.\n             SOUND returning to the bullpen, like nothing's different.\n             Looks over at\n\n             THE BOX\n\n             sitting on the edge of the secretary's desk.  He reaches for\n             it.  Carefully, rips the packing tape.  Bends back a flap.\n             Inside, some dark blue material.  An embroidered daisy.\n  \n             Kay Connell's knapsack.\n\n             EXT. NIGHTMUTE POLICE DEPARTMENT - DAY\n\n             Will, heading for the Cherokee.  Clutching the box.  Face\n             pale, pace quick.  Everything's different now.\n\n                                 ELLIE (O.S.)\n                       Detective Dormer!\n\n             He closes his eyes.  Now is not the time.  Reaches the\n             Cherokee.  Yanks open the driver's side door.  Ellie catches\n             up with him.  Out of breath.\n\n                                 ELLIE\n                       You look like you're in a hurry.  I just\n                       wanted to ask you about these pictures.\n\n             She smiles, holds up some PHOTOGRAPHS.  They're of the BEACH.\n             The ones Kepp took.  Almost all fog.\n\n                                 ELLIE (cont'd)\n                       I know they're not great quality, but\n                       this is where you said you were when you\n                       first saw Detective Eckhart, right?\n\n             Will.  Barely glancing at them.  Tosses the box into the car.\n\n                                 WILL\n                       Right.\n\n             Gets in and closes the door.  Puts his hand over the box.\n             Ellie comes up to the window.\n\n                                 ELLIE\n                       But here's the thing.  I retraced your\n                       exact steps according to your statement.\n                       You couldn't have seen Detective Eckhart\n                       from there.  I mean, not in that fog.\n\n                                 WILL\n                       Then change it.\n\n                                 ELLIE\n                       How much closer would you say you were?\n\n                                 WILL\n                       I don't remember.\n\n                                 ELLIE\n                       Five feet?  Seven feet?\n\n             Will, about to seriously lose his shit.  Looks at Ellie.\n             Eyes dark, distant.\n\n                                 WILL\n                       Listen, Ellie.  I don't have time for\n                       this shit.  Five feet, seven feet, twenty\n                       feet.  Put down whatever you want in your\n                       report, alright?\n\n             He turns the ignition.  Pulls out with a SQUEAL.  Ellie\n             steps back, watching him drive away.  More curious than\n             stung.\n\n             EXT. OUTSIDE NIGHTMUTE - DAY\n\n             The Cherokee.  Parked off-road.  A remote spot by the water.\n             The driver's side door, left open.  The PING-PING-PING of the\n             interior BELL.\n\n             EXT. BREAKFRONT - DAY\n\n             Will Dormer, walking along a breakfront.  Aimless.  One foot\n             in front of the other.  Staring out at nothing.  The endless\n             sea.  Waves CRASHING.  Wind HOWLING.  Seagulls SCREECHING.\n\n             Everything.  Closing in on him...\n\n             He stumbles over a rock.  Grabs his head in his hands.\n\n             Stunned.  Guilty.  Ashamed.  Fucked.\n\n             He saw it.  He saw it!\n\n             A WAVE, explodes nearby.  Drenching him in sea spray.\n\n             Will turns, raking his hand across his face.  Blinking.  Eyes\n             stinging.  Trying to focus.  Trying to think this through...\n\n             Hears a dog BARKING in the distance.\n\n             Shakes his head.  Looks at his watch.\n\n             Got to deal with the problem at hand.\n\n             INT. WILL'S ROOM - PIONEER LODGE - DAY\n\n             Will, bursts into his room at the Lodge.  The shoulders of\n             his coat still wet with sea spray.  Crosses to the area of\n             the floor where Kay Connell's files are still spread out.\n\n             Starts pressing the floorboards with the toe of his boot.\n             Testing.  Testing.  Until...he finds the one that SQUEAKS.\n\n             Gets down on his knees.  Hesitates.  Then jams his fingers in\n             around the loose board.  Starts pulling it up.  Face\n             reddening.  Knuckles whitening.  Slips his hand into the gap.\n\n             Pulls out a muddy 357 RUGER.\n\n             The killer's gun.\n\n             Will, stares down at it.\n\n             INT. ALLEY - DAY\n\n             Will, standing at the mouth of the ALLEY.  Just like the\n             night before.  Steps inside.  Cautious.  Eyes darting.\n             Peering into the shadows for the HOMELESS MAN...\n\n             Not there.  Coast's clear.  Heads for the dumpster at the end \n             of the alley.  Shoves it aside.  Looks down at...\n\n             The DEAD DOG.  Rancid.  Rotting.  Will gags.  Holds a\n             handkerchief to his face.  Waving away the flies.\n\n             Then.  Pulls the 357 Ruger from his pocket.  Shrugs his coat\n             off and wraps it around his hand and the gun.  Looks away.\n             Fires a muffled SHOT into the dog's side.  The body kicks.\n\n             Crouches down.  Feels along the dog's ribs for the bullet's\n             point of entry.  Finds it.  Pulls out a PENKNIFE and extends\n             one of the blades.  Cuts into the gash, fingers probing deep\n             for the lodged bullet.  He finds it.  Pulls it out.\n\n             Looks back at the dog.  Takes a deep breath.  Wipes his brow.\n             A little smear of the dog's blood left on his forehead.\n             Turns and pulls a bottle of RUBBING ALCOHOL from his pocket. \n             Douses the bullet.  Cleaning it.  Glancing at his watch.\n             Running out of time...\n\n             EXT. NIGHTMUTE POLICE DEPARTMENT - DAY\n\n             The rear of the Nightmute PD building.  Will, looking around,\n             heads briskly for the back door...\n\n             INT. HALLWAY - NIGHTMUTE PD - DAY\n\n             ...steps into the HALLWAY leading towards the bullpen.  Hears \n             VOICES.  Nearby.  Ducks back.  Waiting for them to fade.\n\n             Safe.  Heads down towards the STORAGE ROOM.  Glancing briefly\n             at the PICTURES hanging on the wall.  Of old time POLICE\n             OFFICERS.  Striking brave poses...\n\n             INT. STORAGE ROOM - NIGHTMUTE PD - DAY\n\n             The storage room.  Hot.  Stifling.  The moose antlers LOOMING\n             over his shoulder.  Will pulls the evidence locker key from \n             his pocket.  Unlocks the padlock.  Swings the door open.\n\n             Pulls the Hap Eckhart envelope out.  Throwing a look over his\n             shoulder.  Opens it.  Shakes out the bullet that was lodged\n             in Hap's spine.  Then fishes a plastic bag from his pocket.\n             The bullet he shot into the dead dog.  Drops that into the\n             envelope and reseals it.  Hands shaking.\n\n             Something.  Catches the corner of his eye.  He turns.\n\n             HIS REFLECTION in the locker mirror.  The blood smear still\n             on his forehead.\n\n                                 FRED (O.S.)\n                       Dormer...\n\n             Will jumps.  Quickly wipes the smear off and turns.  Fred \n             Duggar standing behind him.  RICH by his side.  Will clears\n             his throat, shoves Hap's envelope into Fred's hand.  Then\n             Farrell's.  Angry.\n\n                                 WILL\n                       These should have gone out two hours ago.\n\n             SLAMS the locker door and brushes past him.  Fred and Rich\n             exchange a glance.\n\n             EXT. CEMETERY - NIGHTMUTE - DAY\n\n             CLOSE ON a YOUNG GIRL's face.  Dark hair held up in two\n             barrettes, wind tousling the curls.  Reading from a piece of\n             paper. \n\n                                 YOUNG GIRL\n                       ...And that's how I think Kay would want\n                       us to remember her...\n\n             PULL BACK to reveal Kay Connell's funeral.  PEOPLE standing\n             by the grave, most of them HIGH SCHOOLERS.  The sky's a\n             brilliant blue.  Red fireweeds blanket the hillside.\n\n                                 YOUNG GIRL (cont'd)\n                       ...Swimming, reading, hiking through the\n                       Kebaughs...\n\n             FRED, ELLIE AND WILL\n\n             stand off to the side.  Dressed in black.  Fred looks like\n             he's never worn a tie before.  Ellie holds a potted plant.  A\n             gift for the bereaved.\n\n                                 YOUNG GIRL (cont'd)\n                       ...playing her flute, meeting at Darrow's\n                       after school...\n\n             Will.  Eyes bloodshot.  Not really listening.  Not really\n             paying attention.  A thousand miles away.  Tugs at his\n             collar.  Feels tight.\n\n                                 YOUNG GIRL \n                       ...And always, always with a smile on her\n                       face.\n\n             The young girl looks up.  Folds the paper closed.  People\n             SNIFFLE.  Mrs. Connell, reaches out to squeeze her arm.\n\n             Some CHILDREN.  Start circulating with plastic buckets.\n             Filled with white carnations.  Handing them out.\n\n                                 VOICE (O.S.)\n                       Want one?\n\n             Will, startled, looks down.  A LITTLE GIRL stands before him.\n             Curly hair.  Glasses.  Holding up a bucket.  He shakes his\n             head.  Looks back up at\n\n             THE MOURNERS lining up to place the carnations on Kay's\n             casket.\n\n             AN OLD MAN with a brass-tipped cane.  Two GIRLS, look like\n             sisters, holding each other up.  A MAN with a thick red\n             beard.  A LITTLE BOY, about five, clutching a FLUTE tied with\n             a pink ribbon...\n\n             Will, looks away.  Then.  At the end of the line.  Something\n             catches his eye.\n\n             RANDY STETZ\n\n             in tight jeans and a down vest.  In front of him stands a \n             GIRL with white-blonde hair.\n\n             From the torn pictures in Kay Connell's room.\n\n             Will, straightens at the sight of her.\n\n             Sees Randy surreptitiously caress her ass.\n\n             EXT. CEMETERY - LATER\n\n             The service is over.  People are heading back to their cars.\n             Fred yanks off his tie.  Looks at Ellie.\n\n                                 FRED\n                       We should go say hello to Mrs. Connell.\n\n             He starts off.  Ellie, looks back at Will.\n\n                                 WILL\n                       You go ahead.  I'll be there in a second.\n\n             Ellie nods.  Catches up to Fred.  Will turns his attention\n             back to RANDY AND THE GIRL.  Over at the far end of the \n             cemetery.  Standing next to Randy's motorcycle.\n\n             EXT. AT THE EDGE OF THE FOREST - MINUTES LATER\n\n             Randy gets on his bike, strapping his helmet on.  The girl's\n             about to get on behind him.\n\n                                 WILL (O.S.)\n                       Why don't I give her a ride?\n\n             They look over.  WILL walking towards them.  The wind\n             whipping his jacket.  His tie.  Randy makes a face.\n\n                                 RANDY\n                       Thought I smelled something.\n\n                                 WILL\n                       Good to see you, too, Randy.\n\n             Will arrives at the bike.  The girl, TANYA FRANCKE, looks at\n             him curiously.  Her long white-blonde hair, her skin almost\n             translucent.  Something sexy about her.  Has the carnation\n             stuck in the buttonhole of her jean jacket.\n\n                                 TANYA\n                       Who're you?\n\n             EXT. GRAVESITE - CONTINUOUS\n\n             Fred shakes Mrs. Connell's hand.  Ellie waits.  Looks over\n             and sees\n \n             WILL standing with Tanya and Randy.\n\n             Shifts the plant in her hands.\n\n             EXT. AT THE EDGE OF THE FOREST - CONTINUOUS\n\n             Will shows the gold shield on his belt.\n\n                                 RANDY\n                       Fuckin' cop.\n\n             Randy kick starts the bike.  It dies.  He kicks it again.\n             Calls out over his shoulder.\n\n                                 RANDY\n                       You coming or not?\n\n             INT. CHEROKEE - FOREST - DAY\n\n             Sunlight dappling through tall fir trees.  Will drives.\n             Tanya sitting next to him.  Her black skirt riding up.\n             Picking at the flaking polish on her nails.\n \n                                 TANYA\n                       I never met anyone from Seattle before.\n\n                                 WILL\n                       You're not missing much.\n\n                                 TANYA\n                       What are you doing in this shit-hole\n                       town?\n\n             Will, shifts.  Looks over.\n\n                                 WILL\n                       You were good friends with Kay Connell,\n                       weren't you?\n\n             Tanya hesitates.  Pulls a cigarette from her purse.\n\n                                 TANYA\n                       I was her best friend.\n\n                                 WILL\n                       Best friend?\n\n                                 TANYA\n                       Since grade school.\n\n                                 WILL\n                       That's a long time.\n\n                                 TANYA\n                       We were like sisters.  Knew everything\n                       about each other.\n\n                                 WILL\n                       Must be tough for you.  What happened.\n\n             Tanya shrugs.  Lights the cigarette.  Takes a drag.\n\n                                 TANYA\n                       Everybody says I'm holding up great,\n                       considering.  Don't even care if I go to\n                       school.  They're all worried I haven't\n                       cried yet.\n\n             She stretches.  Her midriff showing.  Shifts her body towards\n             Will.\n\n                                 TANYA (cont'd)\n                       But there's no law against not crying,\n                       right?\n\n                                 WILL\n                       What about Kay's other friends?\n\n             Tanya makes a face.  Reaches out and taps the hula-girl.\n\n                                 TANYA\n                       Do we have to talk about Kay?  I don't\n                       want to talk about her right now.  Let's\n                       just drive.  Go somewhere.\n\n             Will looks over at her.  She blows out a plume of smoke.\n             Smiles.  Seductive.\n\n                                 WILL\n                       You want me to take you somewhere?\n\n                                 TANYA\n                       Long as it's fun.\n\n             She reaches out a sinewy arm.  Starts massaging the back of\n             Will's neck.\n\n                                 TANYA (cont'd)\n                       Young, impressionable girl left alone\n                       with older, Seattle detective.  Who knows\n                       what we could get up to.\n\n             Will, impervious to the touch.  Head, throbbing.  Reaches for\n             the gear.  His foot, pressing harder on the gas.\n\n             EXT. CHEROKEE - FOREST ROAD - CONTINUOUS\n\n             SCREECH!  The Cherokee whips around a curve.\n\n             INT. CHEROKEE - CONTINUOUS\n \n             Tanya giggles.  Likes the speed.  Will, goes even faster.\n\n             EXT. CHEROKEE - CONTINUOUS\n \n             The Cherokee breaks free from the forest.  Racing along a\n             coastal road.  Water CRASHING against the rocks.\n\n             Up ahead, a LOGGING TRUCK coming the other way.  The Cherokee\n             shifts lanes.  Heading straight for the truck.\n\n             INT. CHEROKEE - CONTINUOUS\n\n             Tanya looks out at the truck.  Still giggling.\n\n                                 WILL\n                       How about this.  You like this?\n\n             The truck BEEPS.  Will goes faster.  Tanya takes her hand\n             from Will's neck.  Holds on to her seat.\n\n             EXT. CHEROKEE - CONTINUOUS\n\n             The gap's closing fast.  The truck BEEPS again.\n\n             INT. CHEROKEE - CONTINUOUS\n\n             Tanya looks over at Will.  Not giggling any more.\n\n                                 TANYA\n                       Hey...\n\n                                 WILL\n                       Thought you wanted something fun...\n\n             Will goes even faster...\n\n             EXT. CHEROKEE - COASTAL ROAD\n\n             The truck and the Cherokee.  On a collision course.  The\n             truck BEEPS wildly.\n\n             INT. CHEROKEE - CONTINUOUS\n\n             Tanya squirming in her seat.  Not liking this any more.\n\n                                 TANYA\n                       Move over!\n\n             Will staring dead ahead.  Tensing his jaw.  The TRUCK...\n             bearing down on them...\n\n             Tanya reaches for the wheel...Will pushes her hands away...\n             The TRUCK...a breath away...\n\n                                 TANYA (cont'd)\n                           (screaming)\n                       Move over, you crazy fuck!\n\n             EXT. CHEROKEE - COASTAL ROAD\n\n             The truck and the Cherokee...just feet from each other...at\n             the last moment...the Cherokee jerks out of the way...\n\n             EXT. ICICLE FISHING CANNERY - DAY\n\n             ...SCREECHES to a stop near an old sign, Icicle Cannery.\n             Gravel flying.  Will gets out.  Slams his door.  Rounds the \n             car and opens Tanya's door.  She's screaming at him.\n\n                                 TANYA\n                       You crazy son-of-a-bitch!  You could have\n                       killed us!\n\n             Will reaches in and pulls her out of the car.\n\n                                 TANYA (cont'd)\n                       Ow!  You're hurting me!\n\n             Will pulls her up a steep hill of garbage and broken crates.\n             Pushes her down the other side.  She stumbles.\n\n                                 TANYA (cont'd)\n                       You want to tell me what the fuck this is\n                       all about?\n\n             Will stands above her, on the hill.  His face set like stone.\n\n                                 WILL\n                       You and Kay were like sisters?\n\n                                 TANYA\n                       That's what I said.\n\n                                 WILL\n                       Told each other everything.\n                           (heads down the hill)\n                       That why your picture's torn up in the\n                       top drawer of her bureau?\n\n             Tanya steps back.\n\n                                 WILL (cont'd)\n                       Why her boyfriend's hand was clamped on \n                       your ass at her funeral?\n\n             He grabs her by the arm.  Jerks it up.  She CRIES out.  Will\n             leans in.\n\n                                 WILL (cont'd)\n                       You like games, little girl?  Well how\n                       about this one - you're standing right\n                       where her naked body was found wrapped up\n                       in a garbage bag.\n\n             Tanya's eyes grow wide.  She looks around her.  Disgusting,\n             rotten.  A SEAGULL pecking at the body of a dead bird.  She\n             tries to break away...\n\n                                 TANYA\n                       No...\n\n                                 WILL\n                       Who was Kay seeing besides Randy Stetz?\n\n             Tanya looks away.\n\n                                 WILL (cont'd)\n                       Who gave her those dresses?\n\n             She struggles more.  No good.  Will's grip is like a vice.\n\n                                 WILL (cont'd)\n                       I need a name.\n\n                                 TANYA\n                       I don't know.\n\n                                 WILL\n                       You don't know.\n\n                                 TANYA\n                       She wouldn't tell me!\n\n                                 WILL\n                       But you were such good friends...\n\n             Tanya, squirming.  Angry.\n\n                                 TANYA\n                       It was like some big fucking secret!\n\n                                 WILL\n                       What was?\n\n                                 TANYA\n                       She kept saying she was gonna get out of\n                       here.  Leave us all behind.  That he was\n                       going to take her!\n\n                                 WILL\n                       Who?\n\n                                 TANYA\n                       My arm!\n\n                                 WILL\n                       Who?\n\n                                 TANYA\n                       She used some stupid code name.\n\n                                 WILL\n                       What was it?\n\n                                 TANYA\n                       Brody...I don't know...\n                           (crying)\n                       ...Something Brody!\n\n             Will straightens.  He's heard that name before.\n\n             Suddenly Tanya jams her heel into his shoe.  He CRIES out.\n             She breaks away from him.  Runs up the hill.  Turns.  Tears\n             streaking her face.  Throws the carnation to the ground.\n\n                                 TANYA (cont'd)\n                       You happy now, you fucking bastard?\n\n             INT. BOOKSTORE - NIGHTMUTE - DAY\n\n             CLOSE ON a FINGER.  Running along a row of book spines.\n             Brundt...Buckley...Buss...Buckham...Byrie...\n\n             PULL BACK to reveal will in Nightmute's small bookstore.\n             Still in his funeral clothes.\n\n             In the \"Mystery!\" section.  Not finding what he wants.  Then,\n             something catches his eye:  A BARGAIN BIN at the end of the \n             aisle.  Will limps down to it.  Avoides eye-contact with a\n             YOUNG WOMAN shelving \"New Arrivals!\"\n\n             Reaches into the bin.  Rummages through some paperbacks.\n             Then he finds it:  Otherwise Engaged by Walter Byrd.\n             Underneath the title, he finds what he's looking for:\n             Another J. Brody Mystery.  Flips to the inside of the cover.\n\n             A BLURRY PICTURE of Walter Byrd.  Head turned to the side.\n             Walter Byrd was born in Watson Lake, Canada.  He graduated...\n\n             Will's eyes skip down to the bottom:\n\n             Mr. Byrd currently lives in Umkumiut, Alaska, with his two\n             labrador retrievers, Lucy and Desi.\n\n             Will looks up.  Slaps the book closed.\n\n             INT./EXT. CHEROKEE - ROAD - DAY\n\n             Will drives, sipping take-out coffee.  Trying to fight the \n             stinging in his eyes.  Passes a sign:  Umkumiut, 30 miles.\n\n             EXT. TESORO ALASKA GAS STATION - UMKUMIUT - DAY\n\n             Will stands in a phone booth at the gas station.  Flips\n             through the phone book.  His finger tracing down the \"B\"s.\n             Finds it:  Walter Byrd, 451 S. Diamond Tooth, Apt. B.\n\n             EXT. DIAMOND TOOTH ROAD - UMKUMIUT - DAY\n\n             Sky's become overcast.  Will stands across the street from a\n             pale blue building.  On the ground floor, a tackle store.\n             Above, looks like several apartment units.\n\n             He starts across.\n\n             INT. HALLWAY - APARTMENTS - DAY\n\n             Will heads down a narrow hallway.  Tiled floor.  Passes door\n             \"A.\"  Stops at the next one, \"B.\"  Knocks.  Hears nothing but\n             the muted tv from apartment \"A.\"  Pulls out his gloves.\n\n             INT. WALTER BYRD'S APARTMENT - DAY\n\n             With a CLICK the door swings open.  Will, gloves on, pockets\n             his credit card.  Hears the CHING CHING of dog collars as\n \n             TWO LABRADOR RETRIEVERS stand at attention, GROWLING.  Will's\n             prepared.  Takes a bag of treats from his pocket.\n\n                                 WILL\n                       Lucy.  Desi.\n\n             The dogs break.  Trot over to him.  Wolf down the treats.\n             Will scans the place.  Small, cheap.  Matching sofa and easy\n             chair, corduroy upholstery.  The walls, lined with old 1950s\n             movie posters.  All second-rate detective movies:  \"Another\n             Shot in the Dark,\" \"Lady Luck,\" \"He wore a Black Hat.\"\n\n             Will walks across the room.  Repulsed.  The pathetic hovel of \n             a killer.  Looks into the\n   \n             BEDROOM\n\n             Single bed.  Books and magazines.  A half-eaten tuna sandwich\n             on the bedside table.  \"NYPD BLUE\" calendar on the wall.\n\n             It's quiet.  He walks over to a large DESK by the window.\n             Scattered papers.  Computer.  Mini cassette recorder.\n     \n             On the wall, hundreds of newspaper articles.  Some yellowing,\n             some fresh.  All about cops: \"Officer Louis Saved My Life!\"\n             \"Shoot-out in Soho,\" \"South Street Cop Takes Down Drug\n             Ring,\" \"Seattle Cop Killed by Suspect...\"\n\n             Will curls his lip.  Starts looking through the papers on the\n             desk.  Underneath a stack, he finds an 8x10 PHOTOGRAPH.  It's\n             of Byrd, standing in front of a big, lakeside HOUSE.  A RADIO\n             TOWER in the background.  Walter Byrd's face is blurred,\n             turned to the side.  The photo from the book bio.\n\n             Will takes it.  Starts roughly opening drawers.  A box of\n             animal crackers, a rubber band ball.  Then, shoved in the\n             back of the top drawer, an APPOINTMENT BOOK.  Will flips\n             through to today's date.  Blank.  Shoves the book into his\n             pocket.  Slams the door closed.\n  \n             Then reaches back for his Smith 39/13.  Checks the magazine.\n             Slaps it back in place.  He's ready.\n\n             SUDDENLY the phone RINGS.  A beige rotary on the desk.\n             Plugged into an ancient answering machine.  It RINGS again.\n             The answering machine WHIRS.  Then BEEPS.\n\n                                 WALTER'S VOICE\n                       Now you're mad at me.\n\n             Will freezes.\n\n                                 WALTER'S VOICE (cont'd)\n                       ...I spotted your car around the corner.\n                       You must have been in a hurry.  Put some\n                       pieces together.  Don't worry, I would\n                       have done the same thing...\n\n             Will turns back to the window.  Looking furiously...\n\n                                 WALTER'S VOICE (cont'd)\n                       Anyway...\n                           (blows nose)\n                       ...I'm not coming home.  So you\n                       shouldn't wait there all day.  I mean,\n                       they'll wonder about you at the station.\n                       You should be careful about following\n                       procedure, Will, especially now that...\n\n             Will lunges for the phone.  Snatches it up just as CLICK! the\n             tape cuts off.\n\n                                 WILL\n                       Goddammit!\n\n             Enraged, he PUNCHES the receiver through the wall.\n\n             INT. HALLWAY - APARTMENTS - DAY\n\n             Will exits the apartment.  Cradling his hand.  Looks down at\n             the tile floor.  Scanning it for a broken tile.  Finds one.\n             Bends down and plucks out a broken corner.\n\n             Places it carefully where the bottom of the door meets the\n             door jamb.  Just then.  His BEEPER goes off.\n\n             INT. BULLPEN - NIGHTMUTE PD - DAY\n\n             Will strides into the bullpen.  Wounded hand in pocket.\n             Ellie hunts and pecks at a typewriter.  Glances up.\n\n             Fred, over in the corner.  SLAMS a drawer in the filing\n             cabinet.  Turns.\n\n                                 FRED\n                       Forget your pager?\n\n                                 WILL\n                       What?\n\n                                 FRED\n                       I beeped you over two hours ago.\n\n             Holds out a one-page report.\n\n                                 FRED (cont'd)\n                       Got a fax from the lab.  Murder weapon\n                       was a 357 Ruger.\n\n             Will takes the report.  Heads over to the coffee machine.\n\n                                 WILL\n                       Good.\n\n                                 FRED\n                       And something else that might interest \n                       you.\n\n             He reaches into his desk drawer and pulls out a book.  Holds\n             it up.  Otherwise Engaged.  In hardback.\n\n                                 FRED (cont'd)\n                       Remember this?\n\n             Will blinks.\n\n                                 WILL\n                       No.\n\n                                 FRED\n                       One of the paperbacks we found in Kay\n                       Connell's knapsack.\n\n             Will pours himself a cup of coffee.  Trying to keep the\n             stream steady.  Ellie continues typing...CLACK...CLACK...\n\n                                 WILL\n                       That's right.\n\n                                 FRED\n                       Mrs. Connell found this copy in the \n                       house.\n                           (opens it up)\n                       It's signed.  Personally.\n\n                                 WILL\n                       So?\n\n                                 FRED\n                       This is a local writer.  Kay had all his\n                       books.  I think we should check it out.\n\n             CLACK...CLACK...CLACK...Will rubs his chin.  Looks back at\n             the report.  Judicious.\n\n                                 WILL\n                       I don't think it'll lead anywhere.\n\n             The CLACKING stops.  SILENCE.  Will turns around.  Ellie's\n             staring right at him - that isn't like him.\n\n             He turns back to Fred.  Beat.\n\n                                 WILL (cont'd)\n                       Well.  If he's local.  Give him a call.\n\n             The CLACKING resumes.\n\n             INT. STAIRWAY - DIAMOND TOOTH ROAD - UMKUMIUT - LATE NIGHT\n\n             A dark stairway.  Late at night.  Will, bathed in shadows.\n             Climbs to the top.  Quietly, carefully.  He heads down a\n             hallway.  We recognise it.  Back where Walter Byrd lives.\n \n             Will approaches apartment \"B.\"  Slowly pulls out his weapon.\n             Cocks it.  Waits a beat then swings out in front of the door.\n             Ready to fight.  Ready to confront.  Looks down...\n\n             Tile corner's still there.\n\n             INT./EXT. CHEROKEE - UMKUMIUT - NEXT DAY\n\n             CLOSE ON Walter Byrd's APPOINTMENT BOOK laying open.\n             Scrawled in pencil:  8:30.  Dr. Agee.\n\n             PULL BACK to reveal Will sitting in the parked Cherokee.  The\n             appointment book on the passenger seat.  Been there all night.\n\n             Insomnia.  Taking its toll.  His hair, no longer neatly\n             combed.  His face, pale and unshaven.  His eyes, dragged open\n             from fatigue.  Looks like the whole world's pulling him down.\n             Staring down the street at a\n   \n             BRICK BUILDING on the corner.  A placard by the front door:\n             Dr. Florence Agee, D.D.S.\n\n             Will checks his watch.  Rubs his eyes with the heels of his\n             hands.  Suddenly.  Something tells him to look up.\n\n             A MAN\n\n             in the distance, walking along the road.  Towards Dr. Agee's.\n             He's in his forties.  Short, shoulders sloped.  Wears a \n             beige, zip-up windbreaker, khakis, brown desert boots.\n\n             WALTER BYRD\n\n             has a bulky hearing aid in one ear.  Is looking down at the\n             road.  Glances up.\n\n             LOCKS EYES WITH WILL\n\n             Byrd, slows his pace.\n\n             Will, reaches for the door handle.\n\n             SUDDENLY\n\n             Byrd turns in the other direction, starts walking fast.\n\n             Will leaps out of the Cherokee and heads after him.\n\n             WALTER BYRD\n\n             his short legs pumping, spots a TOUR BUS across the road.\n             Veers over to it.\n\n             WILL\n\n             a runner's stride.  Weaves through PEOPLE.  Closing in on\n             Byrd.  Sees his plan.  Cuts across the road just as...\n\n             A PICK-UP\n\n             rounds the corner.  THUMP!  Broadsides him.  Will's pitched\n             up and over the hood.  Falls hard on the tarmac.  Dazed for a\n             second.  Blood, gushing from his forehead.  Hears the PICK-UP\n             DOOR open...FEET running over to him.\n\n                                 WOMAN'S VOICE (O.S.)\n                       Are you alright?  You popped out from\n                       nowhere!\n\n             More FEET running over.\n\n                                 MAN'S VOICE (O.S.)\n                       He okay?\n\n             Will opens his eyes.  Trying to focus.  Looks up and sees, in\n             the distance...WALTER BYRD getting on the tour bus.\n\n             Will struggles to his feet.  The OLD LADY who hit him,\n             wearing overalls.  Reaches out.\n\n                                 OLD LADY\n                       I don't think you should move.\n\n             Will stands, wavering.  Flashes her his badge.\n\n             INT./EXT. PICK-UP\n\n             The old lady rips along in the truck.  Will sits in the\n             passenger seat, a handkerchief to his forehead.  It's soaked\n             with blood.  The lady looks over.\n\n                                 OLD LADY\n                       You sure you're okay?\n\n                                 WILL\n                       I'm fine.\n\n                                 OLD LADY\n                       Careful not to bleed on my interior.\n\n             Will looks over at her.  Shifts in his seat.  Ouch.  Feels\n             like a couple cracked ribs.  Peers out the windshield at the\n             TOUR BUS a few cars ahead of them.\n\n             EXT. WINDY ROAD - CONTINUOUS\n\n             AERIAL VIEW of the pick-up tailing the tour bus.  A windy\n             coastal road.  Beyond it, a blanket of endless evergreens.\n\n             EXT. FERRY STATION - OUTSIDE UMKUMIUT - DAY\n\n             A FERRY at the end of the pier.  A small wooden booth for\n             selling tickets.  Beautiful, sweeping snow-capped mountains\n             on the other side of the bay.  Nothing else for miles around.\n\n             The pick-up pulls up next to the bus and a couple other cars.\n             Will jumps out.  Scans the area for Byrd.  Nothing.  Then,\n             sees the last few PEOPLE boarding the ferry.\n\n             INT. FERRY - MINUTES LATER\n\n             Ferry's getting pitched around in the roiling water.  Most\n             everyone is inside.  TOURISTS with throw-away cameras,\n             backpacks, anoraks, CHILDREN.  Some looking sea-sick in the\n             corner.\n\n             Will weaves through the crowd.  Eyes darting, searching.  The\n             ferry lurches to one side, the crowd sways, Will spots\n\n             WALTER BYRD standing by a window.\n\n             INT. WINDOW - FERRY\n\n             Walter holds on to the railing.  Looking at the view, the sea\n             spray.  Will comes up.  Stands next to him.  Cognizant of the\n             people around them.\n\n                                 WILL\n                       Walter Byrd.\n\n             Walter continues looking out the window.  That same stuffed-\n             nose voice.\n\n                                 WALTER\n                       When I was seven my mother and\n                       grandmother took me to Vancouver.  We\n                       were walking along the street one day\n                       when these two men ran past and snatched\n                       my grandmother's purse right from under\n                       her arm.  Right from under her arm.  That\n                       night a police officer came to our hotel \n                       room to ask us questions.  Stood the\n                       whole time.\n\n             The ferry pitches again.  Will grabs on to the railing.\n             Looking down at this little man.  Hate in his eyes.\n\n                                 WALTER (cont'd)\n                       His uniform looked brand new.  His shoes\n                       and badge were polished, his billy club,\n                       his belt buckle.  All perfect.  He was\n                       like a soldier, but better.\n\n             Walter reaches up to blow his nose.  Will's eyes look on in\n             disgust - his knuckles are still red and swollen.  From\n             beating Kay Connell to death.\n\n                                 WALTER (cont'd) \n                       Made a huge impression on me.  His\n                       goodness.  Gave me an instant respect for\n                       the police.  I tried to become a cop when\n                       I left high school, but...\n\n             He points to his hearing-aid.\n\n                                 WALTER (cont'd)\n                       Congenital problem.\n\n             The ferry's engine HUMS to a stop.  Walter smiles.\n\n                                 WALTER (cont'd)\n                       Oh.  We're here.\n\n             EXT. GENDREAU GLACIER - DAY\n\n             Gendreau Glacier.  Spilling down between two huge mountains.\n             Enormous in its whiteness, its coldness, its silent power.\n\n             Will and Walter walk up its face, away from the other\n             tourists.  Walter leads the way.  Hands in his pockets.\n\n                                 WALTER\n                       You know this glacier moves a quarter of\n                       an inch every day?\n\n             He points off to the horizon.\n\n                                 WALTER (cont'd)\n                       And on a clear day you can see all the\n                       way over to Newtok.  There's a beautiful\n                       aviary over there.  We can go sometime.\n\n             Will's lip curls.  Watching him.\n\n                                 WALTER (cont'd)\n                       It's actually cool for this time of year.\n                       Normally the temperature runs about...\n\n             SUDDENLY Will lunges at him.  Walter's eyes widen in surprise\n             as he grabs him up by the collar.  Nose to nose.  Will barely\n             keeping control.\n\n                                 WILL\n                       You think this is a nice meeting we're \n                       having here?  Friendly?  Two people\n                       getting acquainted?\n                           (jerks him harder)\n                       You sick, coward, fuck.  I get up every\n                       morning of my life just to bring someone\n                       like you down.  Beating a seventeen year-\n                       old girl to death.  Washing her\n                       afterwards, cleaning her.  Make you feel\n                       like a real man?\n                           (tightens his grip)\n                       Huh?\n\n             Walter flounders.\n\n                                 WILL (cont'd)\n                       I outta end this right now.  Take a rock\n                       and smash your fucking skull in...\n\n             His jaws tense, nostrils flare.  Walter, red-faced,\n             sputtering...\n\n                                 WALTER \n                       I stood right behind you...I saw you look\n                       right into his eyes and shoot him...\n\n             Will clenches his teeth.\n\n                                 WALTER (cont'd)\n                       ...Seattle's great hero.  Shooting his\n                       own partner.  I saw it all...\n\n                                 WILL\n                       That was an accident!  You hear me?  I\n                       didn't know it was him!\n                           (shakes him hard)\n                       I didn't know it was him!\n\n             Just then a SHRIEK.  Will looks over\n\n             A COUPLE KIDS.  Further down the glacier.  Having a snowball\n             fight.\n\n             Will looks back at Walter.  Has to take it easy.  Shoves him\n             away in disgust.  Walter falls down onto the snow.  Dislodges  \n             his hearing aid.\n\n             Watches Will pace.  Head throbbing.  Ribs, screaming in pain.\n\n                                 WALTER\n                       Then why lie about it?\n\n             Walter brushes the snow off the dislodged hearing aid.  Puts\n             it back around his ear.\n\n                                 WALTER (cont'd)\n                       I mean, I'm all for bending the truth.\n                       That's what I do in my novels.  It's my \n                       trade you might say.  But why cover it\n                       up?\n\n             Gets up.  Brushes the snow from his butt.  Checks something\n             in his pocket.\n\n                                 WALTER (cont'd)\n                       You don't have to tell me if you don't\n                       want to.  I'm sure you have some reason.\n                       Something noble.  I have faith in that.\n \n             Looks down at the kids.  Shakes his head.\n\n                                 WALTER (cont'd)\n                       They should be bundled up better.\n\n                                 WILL\n                       What's your game, Byrd?\n\n             Walter turns back to him.\n\n                                 WALTER\n                       No game.\n\n                                 WILL\n                       The phone call.  The knapsack.\n\n             Walter shrugs.\n\n                                 WALTER\n                       I figured we're partners on this one.  I\n                       mean, after what I saw...\n\n             Will stops short.  Eyes burning.  It's all he can do not to\n             throttle this weed.\n\n                                 WILL\n                       Let's get one thing straight, Byrd.  We are\n                       partners on nothing.\n\n             Walter looks at him.  Scratches his head.\n\n                                 WALTER\n                       I research my novels.  I know the \n                       procedures.  You'd have cuffed me back at\n                       the ferry.  You'd have called for back-\n                       up, read me my rights, and gotten a\n                       search warrant for my apartment.  You're\n                       a well-respected detective.  There's\n                       no reason for you to be talking to me\n                       right now...\n\n             He takes out a handkerchief.  Blows his nose.\n\n                                 WALTER (cont'd)\n                       ...except that we could help each other.\n\n             Will stares at him.\n\n                                 WALTER (cont'd)\n                       So.  We're at an impasse.\n\n             Will runs his hands through his hair.  Half-crazed.  Heart\n             pounding.  Turns to watch...\n\n             THE KIDS down the glacier.  Making angels in the snow.  Their\n             GIGGLES carried along by the wind.\n\n             Will, squeezes his eyes shut.  Trapped.  About to defy every\n             instinct in his body.\n\n                                 WILL\n                           (sotto)\n                       You're going to get a phone call.\n\n             Walter steps up, tapping his hearing aid.\n\n                                 WALTER\n                       I'm sorry?\n\n                                 WILL\n                       I said you're going to get a phone call.\n\n                                 WALTER \n                           (perks up)\n                       Oh?\n\n                                 WILL\n                       Kay Connell had a signed copy of one of\n                       your books.\n\n                                 WALTER\n                       Thought you might find that.\n\n                                 WILL\n                       You're going to be brought in for\n                       questioning.\n\n             Walter smiles.  Pleased.\n\n                                 WALTER\n                       Down at the station?\n\n                                 WILL\n                           (hisses)\n                       Yes down at the station.\n\n             Walter rubs his hands together.  Thinking.\n\n                                 WALTER\n                       Okay.  Okay.  Brought in for questioning.\n                       Good.  I can write this.\n\n             JUST THEN the ferry blows its HORN.  Low and loud.  Walter\n             looks down at it.\n\n                                 WALTER (cont'd)\n                       Ferry's leaving.\n\n             He starts down.  Will watches him pass, has no choice but to\n             follow.  Walter, going over the details in his head.\n\n                                 WALTER (cont'd)\n                       Something to divert...\n\n             Snaps his fingers.  An idea.\n\n                                 WALTER (cont'd)\n                       My gun.  You still have my gun, right?\n\n             Will nods.  Walter smiles.  Spreads out his hands.\n\n                                 WALTER (cont'd)\n                       Then that's the wild card.  Every\n                       detective story has a wild card.\n\n                                 WILL\n                       What do you mean, \"wild card?\"\n\n             TOURISTS.  Boarding the ferry.\n\n                                 WALTER\n                       Next ferry's in forty-five minutes.\n\n             Walter heads over to the ramp.  Will stops, grabbing his\n             side.  A PANG through his ribs.  Excruciating.  Calls out to\n             Walter.\n\n                                 WILL\n                       What do you mean \"wild card?\"\n\n             Walter looks back.  Waves.\n\n                                 WALTER\n                       You'll know.  At the questioning.\n\n             Gives his ticket to the TICKET TAKER.  Gets on.  Walks back\n             to the stern.  Looks out at Will.  The HORN sounds again.\n\n             Walter, at the rail.  Smiles.  The ferry's engine, churning\n             up water.  Starting forward just as...\n\n             Walter takes a MINI CASSETTE RECORDER from his pocket.  Holds\n             it up for Will to see.\n\n             Will, on shore, sees it.  A cold flash ripping through his \n             body.  That motherfucker.  Bolts through some tourists\n             towards the ramp but...\n\n             A couple of GUYS are just pulling it in.  The Ticket Taker,\n             grabs his arm.\n\n                                 TICKET TAKER\n                           (to Will)\n                       Full up.\n\n             Will, jerks his arm away.  Stares off at the ferry.  Walter\n             Byrd and his tape recorder.  Receding into the distance.\n\n             INT. CONVENIENCE STORE - NIGHTMUTE - DAY\n\n             CLOSE ON a counter top.  Stuff thrown down.  Aspirin.  Band-\n             aids.  Gauze.  Medical tape.  First aid cream.  Back pills.\n             Sleeping pills.  Bottle of scotch.\n\n             PULL BACK to reveal Will standing at the counter in the\n             convenience store.  His entire body aching.  The CASHIER,\n             throws him a look.\n\n                                 WILL\n                       I have a cold.\n\n             EXT. CONVENIENCE STORE - MINUTES LATER\n\n             Will exits the store.  A bag under his arm.  We Miss You, Kay\n             looming over his shoulder.  Steps out onto the sidewalk and\n             sees...\n\n             ELLIE leaning against her truck.  Waiting for him.  Smiles.\n\n                                 ELLIE\n                       Which way are you walking?\n\n             A tingle, all across Will's body.  Christ.  This girl's\n             everywhere!  He hunches into his coat.  Flicks up his collar.\n             Doesn't want her to see him fully.  Nods down the road.\n\n                                 WILL\n                       Back to the Lodge.\n\n             Ellie grabs her bag.  Joins him.  They start walking.\n\n                                 ELLIE\n                       I needed to get your signature on\n                       something.\n\n             She pulls a folder from her bag.\n\n                                 ELLIE (cont'd)\n                       The report on Detective Eckhart.  Chief\n                       made me finish it this morning.  Said it\n                       was taking too long.\n\n             Will takes the file.  Flips it open.  The death of his\n             partner.  Neatly typed.  Neatly stapled.  Pulls out a pen.\n\n                                 ELLIE (cont'd)\n                       Aren't you going to read it?\n\n                                 WILL\n                       I trust you.\n\n             He signs.  Hands it back to her.  She slips it into her bag.\n\n                                 ELLIE (cont'd)\n                       Now I can help you with the Connell case. \n                       That writer's coming in tomorrow.  Walter\n                       Byrd.\n\n             A slight stutter in Will's step.\n\n                                 WILL\n                       Duggar called him?\n\n                                 ELLIE\n                       About an hour ago.  Said he was more than\n                       happy to cooperate.\n\n             Ellie looks over at Will as they cross the street.  Studying\n             his face.  His gait.  Noticing the slight limp in his right\n             leg.  The cut on his forehead.\n\n                                 ELLIE (cont'd)\n                       You haven't been sleeping much, have you,\n                       Detective Dormer?\n\n             They arrive at the stone steps of the Pioneer Lodge.\n\n                                 WILL\n                       Not really.\n\n                                 ELLIE\n                       Isn't that the difference between a good\n                       cop and a bad cop?  A good cop can't\n                       sleep 'cause a piece of the puzzle's\n                       missing.  A bad cop can't sleep 'cause\n                       his conscience won't let him.\n                           (smiles)\n                       You said that once, remember?\n\n             Will, finally looks at her.\n\n                                 WILL\n                       No.  But it sounds like something I\n                       would've said.\n\n             Turns and starts up the steps.\n\n                                 WILL (cont'd)\n                       See you tomorrow, Ellie.\n\n             Ellie, watches him for a second.  Then calls out.\n\n                                 ELLIE\n                       Oh!  I forgot to tell you.  The Puffins\n                       won.\n\n             Will stops, turns to look back at her.  Confused.\n\n                                 ELLIE (cont'd)\n                       The baseball game.  Our team...\n\n             Slings the bag over her shoulder.\n\n                                 ELLIE (cont'd)\n                       ...We won.\n\n             INT. WILL'S ROOM - PIONEER LODGE - LATE NIGHT\n\n             Clock flicks to 3:00 A.M.  Will, pacing in his room.  Shirt\n             off.  Rib cage wrapped in a bandage.  Looking through...\n\n             A STACK OF MESSAGES.  All from John Warfield.  He discards\n             them one by one.  Can barely focus...\n\n             SUDDENLY the phone RINGS.  He lunges for it.\n\n                                 WILL\n                           (grabbing it)\n                       Listen to me, you son-of-a-bitch...\n\n             Interrupted by a CLICK...\n\n                                 RECORDED VOICE\n                       ...I saw you look right into his eyes\n                       and shoot him...\n\n             Walter Byrd's voice.  Recorded from that afternoon.\n\n                                 RECORDED VOICE (cont'd)\n                       ...Seattle's great hero.  Shooting his\n                       own partner.  I saw it all...\n\n             Will, hears his own voice...\n\n                                 RECORDED VOICE (cont'd)\n                       That was an accident!...\n\n                                 WILL\n                       Goddammit, Byrd!\n\n             Then, another clumsy CLICK.  Walter Byrd gets on.\n\n                                 WALTER\n                       You'd have done the same thing, Will.  I\n                       know you would...\n\n             He hangs up.\n\n             Will SLAMS down the receiver.  Then again.  And again.  Yanks\n             the cord out of the wall and HURLS the phone across the room.\n\n             EXT. ROCKY BEACH - OUTSIDE NIGHTMUTE - MORNING\n\n             ...The DARK FIGURE.  Disappearing back into the fog.  Closing\n             in around him like milky water...\n\n             We whip out our SMITH 39/13...plunge in after him...taking\n             chase...BREATHING hard...leaping from rock to rock...the FOG,\n             blanket thick...tightening around us...\n\n             Our feet.  Hit water.  Up to our ankles.  Icy cold.  We\n             run...sloshing through...when...\n\n             SUDDENLY\n\n             A DARK FIGURE.  Appears ahead.  Big and hulking...CRASHING\n             towards us...\n\n             We raise our weapon...quick as a flash...as the FIGURE\n             emerges...\n\n             And in a split second...\n\n             WE LOCK EYES WITH FIGURE's - his eyes, brown and gentle...\n\n             CRACK!  We fire!  The FIGURE grips his gut, falls into the\n             water.\n\n             Heart POUNDING.  Adrenaline PUMPING.  We slosh towards the\n             body.  Something...catching our eye...\n\n             A 357 RUGER\n\n             lying in the rocks.  Off to the side.  We grab it.  Turn back\n             to the body...\n\n             And stop cold.\n\n             That's when it hits us.  That's when we realize...\n\n             INT. WILL'S ROOM - LATE NIGHT\n\n             Will bolts up.  White as a sheet.\n\n                                 WILL\n                       I didn't know!\n\n             His body, drenched in sweat.  His breathing, quick and\n             ragged.  Caught up in the twisted sheets of his bed.  Looks\n             across the room and sees\n\n             HAP\n\n             sitting in the corner.  Eating an apple with a penknife.\n\n                                 HAP\n                       You sure about that, buddy?\n\n             He smiles.  Sympathetic.  Looks over at the window just as...\n\n             The BLANKET.  Drops to the floor.  \n\n             LIGHT floods the room.\n\n             INT. WILL'S ROOM - 4:02 A.M.\n\n             With a GRUNT Will puts his back into it.  Shoving the heavy\n             oak bureau towards the window.  Sweat beading his face.\n\n             A...few...more...shoves.  And the bureau finally stands in\n             front of the window.  WIll stands back to take a look.  Only\n             covers half of it.\n\n                                 WILL\n                       Fuck!\n\n             INT. WILL'S ROOM - 4:35 A.M.\n\n             Red-faced, Will leans into the wooden armoire.  Shimmying it \n             towards the window...\n\n                                                                   CUT TO:\n\n             EXT. PIONEER LODGE - NIGHT\n\n             Ellie.  Sitting in her truck.  Parked behind the Pioneer\n             Lodge.  Rubbbing her eyes.  Sleepy.  Looking up at\n   \n             WILL'S WINDOW\n\n             concerned.\n\n                                                              CUT BACK TO:\n\n             INT. WILL'S ROOM - 4:35 A.M.\n\n             With one last heave, Will gets the armoire to the window.\n             Light still shining through the cracks.\n\n             INT. WILL'S ROOM - 4:50 A.M.\n\n             Will shoving magazines, blankets, sheets, pillows.  Anything.\n             To fill the cracks.  To cover the light.  His eyes.  Like a\n             crazy man's...\n\n             SUDDENLY a knock on the door.  Will turns.\n\n                                 RACHEL (O.S.)\n                       Detective Dormer?\n\n             INT. HALLWAY - CONTINUOUS\n\n             Rachel standing out in the hallway.  Will opens the door.\n\n                                 RACHEL\n                           (startled by his appearance)\n                       Will...I...\n\n                                 WILL\n                       What is it?\n\n                                 RACHEL\n                       There's a guy down the hall.  Complaining\n                       about the noise.\n                           (beat)\n                       Says he can't sleep.\n\n             Will gives a half-smile.  Fucking irony.  Heads back into...\n\n             INT. WILL'S ROOM - CONTINUOUS\n\n             ...his room.  Rachel follows.  Looks around at the mess.\n\n                                 RACHEL\n                       Are you alright?\n\n             Will grabs up a sweater.\n\n                                 WILL\n                       I'm fine.\n\n             He heads back over to the window.  Rachel now notices all the\n             stuff piled up.  Softens her voice.\n\n                                 RACHEL\n                       Did something happen?\n\n             Will.  Cramming the sweater into a crack.\n\n                                 WILL\n                       No.\n\n             Rachel walks up behind him.  His cramming, more desperate.\n             More urgent.\n\n                                 RACHEL\n                       Will...\n\n             He grabs a magazine.\n\n                                 WILL\n                       The light.  It keeps coming in...\n\n             Rachel reaches out.  Catches his arm.\n\n                                 RACHEL\n                       Will.\n\n             He stops.  Looks down at her hand.\n\n                                 RACHEL (cont'd)\n                       What happened?\n\n             Will suddenly realises what he's doing.  Absurd.  Pathetic. \n             Pitiful.  Slowly turns to face Rachel.\n\n             Her eyes, looking up at him.  His shoulders droop.\n             Exhausted.  Rachel reaches up.  Catches him in her arms.\n             Strong arms.  Caring.  Will buries his face in her neck.\n             Wants to be swallowed up.\n\n             Rachel holds him.  Arms encircling.  Will breathes her in.\n             Sweet, soft, safe.\n\n             Looks up.  His mouth suddenly finding hers.  A kiss, hungry,\n             urgent.  His arms move to surround her.\n\n             INT. WILL'S ROOM - LATER\n\n             Will and Rachel in bed.  Spooning.  Rachel behind will, her\n             finger tracing his scar.  Rain DRUMS against the window.\n\n             Will.  Watching the raindrops streaming down the glass.\n             Casting strange shadows against the wall.\n\n                                 WILL\n                       There was this guy named Weston Dobbs.\n                       Twenty-four.  Worked as a part-time stock\n                       boy in a copy store.  Every morning he'd\n                       sit at the only window in his apartment\n                       and watch an eight year-old boy get\n                       picked up by his carpool across the\n                       street.  And every afternoon he'd watch\n                       the boy get dropped off again.  He did\n                       this for about six months.  Until one day\n                       he got up the nerve to cross the street\n                       and grab the boy before his carpool came.\n                       Kept him in his apartment for three days.\n                       Tortured him.  Raped him.  Made him do\n                       things...\n\n             Will tenses his jaw.  Rachel, listens in horror.\n\n                                 WILL (cont'd)\n                       When he was done, he got a rope and a\n                       kitchen stool and hanged the boy in the\n                       basement of the apartment building.  But\n                       he didn't do a good enough job.  The\n                       little boy's neck didn't break and he\n                       died from shock.  The landlord found him\n                       five days later.\n\n             Rachel reaches for Will's hand.  Squeezes it.\n\n                                 RACHEL\n                       One of your cases?\n\n                                 WILL\n                       Me and Hap.  A year and a half ago.  I\n                       knew the second I met Dobbs that he was\n                       guilty.  Smug, cold.  Dead eyes.  We had\n                       circumstantial evidence, but nothing to\n                       tie him to it.  Nothing concrete.  Went\n                       over every inch of that apartment.\n\n             He pauses.\n\n                                 RACHEL\n                       What happened?\n\n             Will turns slowly over to face her.  Her hair, splayed out on\n             the pillow.  Her cheeks, flushed.  Her eyes, listening.\n\n                                 WILL\n                       We took some blood samples from the boy's\n                       body and planted them in his apartment.\n                           (beat)\n                       Arrested him the next day.\n\n             Rachel looks at him.  Goose pimples on her arms.  Realising\n             the weight of the confession.\n\n                                 RACHEL\n                       Will.\n\n                                 WILL\n                       There've been other cases.  Where we've\n                       changed results.  Pushed witnesses.\n                       Manipulated evidence.\n                           (rubs his face)\n                       But Dobbs.  I wanted Dobbs more than\n                       anything.\n\n             He sits up.  Abrupt.  Wincing from the pain in his ribs.\n             Rests his arms on his knees.\n\n                                 RACHEL\n                       What if someone finds out?\n\n                                 WILL\n                       We're under investigation now.  Back in\n                       Seattle.\n                           (beat)\n                       Hap wanted to talk.  As soon as we got\n                       back.  Thought he could work out some\n                       kind of deal.\n\n             Rachel rubs his shoulder.\n\n                                 RACHEL\n                       Well, that's not going to happen now.\n\n             Will closes his eyes.  The rain, PATTERING.  Rhythmic.\n\n                                 WILL\n                       Do you think it was wrong?  What we did?\n\n             There's a PAUSE.  Rachel, studying Will's back.  The cuts.\n             The bruises.  Not sure how to answer.\n\n                                 RACHEL\n                       There are two kinds of people in Alaska. \n                       Those who were born here and those who've\n                       come here to escape something in their\n                       lives.\n                           (beat)\n                       I wasn't born here, Will.  I'm in no\n                       position to judge anyone.  I'm not about\n                       that any more.\n\n             Looks out the window.\n\n                                 RACHEL (cont'd)\n                       It's all about what you're willing to\n                       live with.\n\n             INT. WILL'S ROOM - MORNING\n\n             The clock reads 6:00.  Will pulls on his trousers.  Goes to\n             strap on his Smith 39/13 holster.  Grimaces with pain.  Looks\n             at his back in the full-length mirror.  BLACK BRUISES seeping\n             out from under his bandage.\n\n             Puts the 39/13 and holster in the top drawer of the bureau.\n             Turns and looks down at Rachel.  Sleeping soundly.\n\n                                 FRED (O.S.)\n                       You were acquainted with the deceased,\n                       Kay Connell?\n\n             INT. INTERROGATION ROOM - CONTINUOUS\n\n             Will in the interrogation room.  Standing by the window.\n             Tensed jaw.\n\n                                 WALTER (O.S.)\n                       Yes I was.\n\n             WALTER BYRD\n\n             sits at the table.  Hair combed, wet.  Shirt newly starched.\n             A Styrofoam cup of coffee in front of him.  Playing the part.\n\n             Fred sits opposite him.  Report file open.  Ellie, next to\n             Fred.  Taking notes.  She's combed her hair, too.\n\n                                 FRED\n                       In what manner?\n\n             Walter smiles modestly.  Looks over at Ellie.\n\n                                 WALTER\n                       She was, not quite a \"fan.\"  More an avid\n                       reader of my detective novels.\n\n                                 ELLIE\n                       When did you first meet her?\n\n             Fred shoots Ellie a look.  She closes her mouth.\n\n                                 WALTER\n                       A year ago.  At one of my signings.\n\n             Ellie hands Fred the hardback of Otherwise Engaged.  He holds\n             it up.  Opened to the signature.\n\n                                 FRED\n                       Where you signed this?\n\n                                 WALTER\n                       That's right.\n\n                                 FRED\n                       What happened at that signing?\n\n                                 WALTER\n                       She flattered me about my writing.  Asked\n                       if she could visit me.  To talk about my\n                       books.\n\n                                 FRED\n                       Did she?\n\n                                 WALTER\n                       Yes.  Not that much at first.  But then\n                       she became more comfortable.  Started \n                       visiting me every week...\n\n             Will, from over by the window.  Interrupts.\n\n                                 WILL\n                       What was the nature of your relationship?\n\n             Walter looks over.  Wide-eyed.\n\n                                 WALTER\n                       What do you mean, Detective Dormer?\n\n             Will turns.  Accusatory.\n\n                                 WILL\n                       She was an attractive girl.  Did you have\n                       sex with her?\n\n             Walter blinks.\n\n                                 WALTER\n                       She was only seventeen.\n\n                                 WILL\n                       But she was an attractive girl.\n \n                                 WALTER\n                       I suppose.\n\n                                 WILL\n                       Did you have sex with her?\n\n             Fred shoots Will a look.  Ellie, watching him.\n\n                                 WALTER\n                       No.\n\n                                 WILL\n                       But you wanted to.\n\n                                 WALTER\n                       I was a mentor to her.\n\n             Will heads over to Walter's chair.  Fists clenched in his\n             pockets.\n\n                                 WILL\n                       You gave her gifts.\n\n                                 WALTER\n                       Yes.\n\n                                 WILL\n                       Expensive dresses.  A heart necklace.\n\n                                 WALTER\n                       Yes.\n\n                                 WILL\n                       Doesn't sound like a mentor to me.\n\n                                 WALTER\n                       I gave her things she didn't have.\n                       Couldn't have.\n\n             He turns to Fred and Ellie.\n\n                                 WALTER (cont'd)\n                       Her family lives on Mr. Connell's\n                       disability.  It isn't much.\n\n             Fred stops Will with a look.  Had enough.\n\n                                 FRED\n                       We understand, Mr. Byrd.\n                           (to Will)\n                       You want to sit down, Detective?\n\n             Tense BEAT.  Will stares at Walter.  Revulsion.  Heads back\n             over to the window.\n\n                                 WALTER\n                       She wasn't happy.  I was someone to talk\n                       to.\n\n                                 FRED\n                       How do you mean?\n\n                                 WALTER\n                       That boyfriend.  Randy.\n\n             Fred, sits up.\n\n                                 FRED\n                       Randy Stetz?\n\n                                 WALTER\n                       That's right.\n\n                                 WILL\n                       What about him?\n\n                                 WALTER\n                       He.  Well, he...\n\n             Walter hesitates.  Takes a sip of coffee.\n\n                                 WALTER (cont'd)\n                       I don't want to talk out of school.  Kay\n                       told me things in the strictest of\n                       confidence.  As a friend.\n\n                                 FRED\n                       Mr. Byrd.  Anything you can tell us could\n                       help out with this case.\n\n             Walter furrows his brow.  Taps his hearing aid.\n\n                                 WALTER\n                       Well.  He hit her.\n\n             Ellie's eyes widen.  Fred glances at Will.  But Will's too\n             busy watching this little man weave his web.\n\n                                 FRED\n                       Are you sure about that?\n\n                                 WALTER\n                       She'd come to me, sometimes in the middle\n                       of the night.  Bruises all over her back,\n                       her upper arms.  I pled with her to let\n                       me call the police, but she wouldn't hear\n                       it.  Wanted to keep it a secret.\n\n                                 ELLIE\n                       Randy Stetz beat Kay Connell?\n\n                                 FRED\n                           (angry)\n                       Ellie.\n\n             Walter looks right at her.\n\n                                 WALTER\n                       He has a terrible rage.  Kay even said he\n                       carried a handgun around with him.\n\n             Fred stands.  This is big.  Calls out the door.\n\n                                 FRED\n                       Margaret!  Get Judge Biggs on the phone!\n                           (to Will)\n                       I'll get another warrant for Stetz's\n                       place.\n\n             Walter takes a sip of his coffee.  Cup's empty.  Holds it out\n             to Ellie.  Smiles.\n\n                                 WALTER\n                       Could I have some more coffee, Detective\n                       Burr?\n\n             Ellie nods, takes the cup.  Heads over to the coffee machine.\n             Fred turns back to the door...\n\n             AND AT THAT MOMENT Walter levels a look right at Will.\n\n             Mouths the words Wild Card.\n\n             A shiver down Will's spine.  Wild card.  The gun.  Randy.\n\n             ELLIE\n\n             over at the coffee machine.  Pouring coffee.  Glances up at\n             the window.  Catches the reflection of the two men.\n\n             An intense look between them.\n\n             EXT. ROCKY BEACH - OUTSIDE NIGHTMUTE - DAY\n\n             CLOSE ON a BOOT.  Jumping down onto a black rock.\n\n             PULL BACK to reveal Ellie walking out on the beach.  Heading\n             down towards the water.  Thinking.\n\n             INT. RANDY STETZ'S ROOM - NIGHTMUTE - DAY\n\n             A dark, narrow boarding room.  A HAND reaches through an open\n             window.  Feels for the lock on the door.  CLICK.\n\n             Will enters Randy Stetz's place.  Cigarette butts, electric\n             guitar, Hustler centerfolds tacked on the walls.\n\n             He looks around.  Every inch of him revolting against what\n             he's about to do.\n\n             EXT. ROCKY BEACH - CONTINUOUS\n\n             The sound of waves.  A slight breeze.  Ellie walking along\n             the water.\n\n             Looking down.  Brow furrowed.  Stops and puts her hands on\n             her hips.\n\n             INT. RANDY STETZ'S ROOM - CONTINUOUS\n\n             Will heads over to a hanging sheet on the other side of the\n             room.  Pulls it aside.  A MOTORBIKE being repaired.  Parts\n             and tools all over the place.\n\n             Pulls the 357 Ruger from his pocket with a handkerchief.\n             Spots a COFFEE CAN on a shelf.  Filled with thick oil.\n\n             EXT. ROCKY BEACH - CONTINUOUS\n\n             Something catches Ellie's eye.  GLINTING from between the\n             rocks.  She bends down.  Pulls a pencil from her backpack.\n             Spears something and holds it up.\n\n             A SHELL CASING.\n\n             INT. RANDY STETZ'S ROOM - CONTINUOUS\n \n             Will, drops the 357 into the oil.  Turns and heads back\n             across the room.  Hesitates.  At the door.  Turns back.\n             Looking at the oil can.  Takes a step back towards it when he\n             hears...\n\n             The sound of a SQUAD CAR.  Pulling up outside.\n\n             Too late.\n\n             EXT. RANDY STETZ'S ROOM - LATER\n\n             Will stands just outside the doorway into Randy's room.\n             UNIFORMED OFFICERS inside searching the place.  Tearing down\n             pictures.  Turning out doors.  Ripping up carpet.  Randy's\n             voice.  In protest.\n\n                                 RANDY (O.S.)\n                       You can't fucking do this!\n\n             Will hears some SCUFFLING.  The sheet being pulled down.  The\n             CLATTER of tools.\n\n                                 RANDY (O.S.)\n                       Hey!  I'm working on that!\n\n             Parts pulled off the shelves.  The bike, shoved to the side.\n             Then.  A SILENCE.  Followed by...\n\n                                 OFFICER (O.S.)\n                       Found something.\n\n             Will shuts his eyes.  Heavy FOOTSTEPS head over to the bike.\n             Someone's pulled the gun from the can.\n\n                                 RANDY (O.S.)\n                       What the fuck is that!\n\n             Fred's voice, calm.\n\n                                 FRED (O.S.)\n                       That's it.  Let's bag it.\n\n             More FOOTSTEPS.  Randy, desperate.\n\n                                 RANDY (O.S.)\n                       That's not mine, man!  That's not mine!\n\n             Will opens his eyes.  Fred's voice.  Almost sympathetic.\n\n                                 FRED (O.S.)\n                       Randy...\n\n                                 RANDY (O.S.)\n                       No way, man!\n\n             More SCUFFLING.  A chair knocked over.  Something SMASHES.\n             Will looks down at the floor as\n\n             FRED AND A UNIFORMED COP struggle to drag Randy through the\n             doorway.  Randy writhes, kicks, tugs.  Screams.\n\n                                 RANDY (cont'd)\n                       That ain't mine!\n\n             Fred grabs Randy's shoulder.\n\n                                 FRED\n                       C'mon, Randy.\n\n             Randy squirms.  Turns.  Looks right into Will's eyes.  Gone\n             is the bluster.  Gone is the attitude.  Randy Stetz, lost\n             kid.  Tears streaming down his face.\n\n                                 RANDY\n                       I swear to God.  I didn't kill her.  I \n                       swear to God...\n\n             EXT. GARAGE APARTMENT - DAY\n\n             Will stands outside the garage apartment.  Wind whipping his\n             coat.  Watches as a Nightmute PD SQUAD CAR pulls off with\n             Randy Stetz in the back.\n\n             Fred sees him, heads over.\n\n                                 FRED\n                       You look like shit, cowboy.\n\n             Will shifts his eyes to him.\n\n                                 WILL\n                       That's an understatement.\n\n             Fred half-smiles.  Watches the receding squad car.\n\n                                 FRED\n                       Looks like we can wrap this one up.\n\n             Will barely nods.  Fred pulls his baseball cap on.\n\n                                 FRED (cont'd)\n                       We're getting together for a couple of\n                       beers later on.  Might not be the Seattle\n                       thing to do.  But you're welcome to come.\n\n             Fred puts out his hand to shake.  Truce.  Will looks at him.\n             Takes it.\n\n             INT. SHANTY BAR - NIGHTMUTE - NIGHT\n\n             CLOSE ON a tray of dark beer.  Five glasses, foam sloshing.\n\n                                 FARRELL (O.S.)\n                       I can't believe it.  Randy Stetz.\n\n             PULL BACK to reveal Farrell, Rich, Francis, and Will sitting\n             at a small, round table.  Fred's passing out the beers.  Dive\n             bar.  MUSIC blaring.  3 a.m. Happy Hour! banner on the wall.\n             Place packed with rough-looking FISHERMEN.\n\n             Rich takes a glass from Fred.\n\n                                 RICH\n                       What do you mean, you can't believe it?\n\n                                 FRANCIS\n                       He was an asshole.\n\n                                 FARRELL\n                       That doesn't mean anything.\n\n             Fred sits.  Takes a sip of his beer.  To Farrell.\n\n                                 FRED\n                       Didn't you grow up with him?\n\n             Farrell shifts in his seat.\n\n                                 FARRELL\n                       Our dads were on the same boat.\n                           (to Will)\n                       We used to wait for them together.\n\n             Will nods.  Jostled by the crowd.  Reaches for his beer.\n\n                                 FRANCIS\n                       He used to pick fights at the gas\n                       station.\n\n                                 RICH\n                       And remember when he did all those donut\n                       holes that one summer?\n\n             He and Francis GUFFAW.\n\n                                 FRED\n                       Just a bad seed.\n\n             Farrell looks over at Will.\n\n                                 FARRELL\n                       How do you like our beer?\n\n             Will slams down his empty glass.  Squeezes his eyes open and\n             shut.  Loud music.  Cigarette smoke.\n\n                                 WILL\n                       I like it fine.\n\n             Fred pats Will's shoulder.\n\n                                 FRED\n                       What Detective Dormer needs is a little\n                       shut-eye.\n\n                                 RICH\n                       The white nights been hard on you?\n\n                                 WILL\n                       They haven't been easy.\n\n             Francis grabs a handful of peanuts.\n\n                                 FRANCIS\n                       They don't have titanium shades over at\n                       the Pioneer.\n\n                                 RICH\n                       Well no wonder.\n\n                                 FRANCIS\n                       You lose all sense of time.\n\n                                 FARRELL\n                       Better than Fred's home town.\n\n             Will turns to Fred.  Wiping the foam from his moustache.\n\n                                 FRED\n                       My people are from Barrow.  Way up north.\n\n                                 RICH\n                       In the winter there's no sunlight for\n                       five straight months.\n\n                                 FRED\n                       Like being swallowed up in a black hole.\n\n             JUST THEN.\n\n                                 ELLIE (O.S.)\n                       Hi, guys.\n\n             They look up.  Ellie standing by their table.  Jeans, down\n             vest.  Hair tousled.\n\n                                 FRED\n                       Nancy Drew!  Pull up a seat!\n\n                                 FRANCIS\n                       You hear what happened, Ellie?\n\n                                 ELLIE\n                       Yeah.\n\n                                 RICH\n                       Pretty cool.\n\n                                 FARRELL\n                       Rich found the gun.\n\n                                 ELLIE\n                       I know.  I heard.\n\n             Fred leans back in his seat.  Eyeballs Ellie.\n\n                                 FRED\n                       Something's on Nancy's mind.\n\n             Ellie reaches into her vest pocket.  Pulls out a Ziploc with\n             the SHELL CASING inside.\n\n                                 ELLIE\n                       I found this out on the beach.\n\n                                 FARRELL\n                       What is it?\n\n                                 ELLIE\n                       Shell casing.  9mm.\n\n             Will, blanches.\n\n                                 FRANCIS\n                       Let it go, Ell.  We got the bad guy.\n\n                                 ELLIE\n                       None of us carries a 9mm duty weapon.\n                       And the murder weapon was a 357.\n\n             Rich throws peanut shells at her.\n\n                                 RICH\n                       Get a hobby, will ya?\n\n             Ellie brushes off the shells.  Looks right at Will.\n\n                                 ELLIE\n                       It's a legitimate point, isn't it,\n                       Detective Dormer?\n\n             Everyone turns to Will.  Their faces, spinning.  He nods.\n\n                                 WILL\n                       It's legitimate.\n\n                                 ELLIE\n                       Worth pursuing?\n\n             He looks up.  Holds her gaze.  Then turns away.  Grabs the\n             side of the table.\n\n                                 WILL\n                       The case is closed, Ellie.\n                           (gets up)\n                       I got the next round.\n\n             The guys don't protest.  Will starts heading for the bar.\n             Weaving through broad shoulders, massive backs.  Smoke.\n             MUSIC.  Laughter.  Arguing.  A mass of bodies and sound.\n             Like being swallowed up in a black hole...\n\n             Looks back at the table.\n \n             Ellie, watching him.\n\n             EXT. ELLIE'S HOUSE - NIGHT\n\n             Ellie's truck pulls up in front of a small house.  She jumps\n             out.  \n\n             INT. FRONT HALLWAY - HOUSE - NIGHT\n\n             SLAM!  Ellie heads through the front door like a gust of\n             wind.  Thunders up the stairs.  Calls out.\n\n                                 ELLIE\n                       Me, Pop!\n\n             We hear the TV in the other room.  An older MAN, Ellie's\n             father, appears in the doorway.  Thick glasses, grey stubble,\n             big paunch.  Wearing a flannel robe.\n\n                                 ELLIE'S DAD\n                       Ellie?  You okay?\n\n             Ellie appears at the top of the stairs.\n\n                                 ELLIE\n                       Where's all my academy stuff?\n\n             INT. BASEMENT\n\n             Pitch black, then, CLICK! as a bare lightbulb's switched on.\n             Ellie stands beneath it.  Piles of crap everywhere.\n\n             She steps through the quagmire of old bikes, fans, auto\n             parts.  Over to a stack of cardboard BOXES in the corner.\n\n             She nudges through them, reading the writing on the tops.  In\n             thick black pen.  Shoves a couple aside.\n\n             Then.  Finds what she's looking for.  Pulls down a box\n             marked:  Ellie Acad.  Tears it open.\n\n             INSIDE - piles of papers, polaroids of her and her FRIENDS,\n             schedules, syllabi, handbooks.  Stuff from her Academy year.\n             At the bottom, a report.  The title:  \"Securing the Crime\n             Scene,\" the Leland Street Murders.  By Eleanor P. Burr.\n\n             Ellie pulls it out.  Sits down on an old stool.  Opens to the\n             middle of the report.  Her finger, tracing down the \n             typewritten page.  Flips to the next page.  Then the next.\n             The next.  Then.  She spots it.\n\n             THREE-QUARTERS DOWN THE PAGE, her finger finds the\n             sentence:...Detective Dormer's unregistered Smith and Wesson\n             model 39/13 9mm, to immobilize Langley...\n\n             Ellie looks up.  Chews her bottom lip.\n\n             EXT. MARINERS MEMORIAL - OUTSIDE NIGHTMUTE - DAY\n\n             CLOSE ON a huge wave CRASHING against a retaining wall.\n             Spray flying.\n\n             PULL BACK to reveal a small monument by the sea.  A stone\n             cupola with a bronze statue underneath.  The sky, black with\n             clouds.\n\n             INT. MARINER'S MEMORIAL - CONTINUOUS\n\n             Walter Byrd waits under the Mariner's Memorial.  Wind\n             whipping his jacket, the green sea churning behind him.  Next\n             to a fifteen-foot statue of a SEAMAN, tall, rugged, tough.\n             Holding on to a thick coil of rope.\n\n             Hunches against the wind.  Watches as...\n \n             WILL approaches the monument.  Sonics sweatshirt, wrinkled\n             coat.  Face drawn and haggard.  Angry.\n\n                                 WALTER\n                           (smiles)\n                       Hi, Will...\n\n             Will enters the monument.\n\n                                 WILL\n                       What the hell are you doing calling me at \n                       the station?\n\n             A gust of wind WHORLS through the monument.\n\n                                 WALTER\n                       I figured we should touch base.  Compare\n                       notes.  I think it went well.  What did\n                       you think?\n\n             Will's eyes pierce into him.\n\n                                 WILL\n                       Randy Stetz is in jail.\n\n                                 WALTER\n                       Told you I could write an ending.\n\n                                 WILL\n                       Congratulations.\n\n             Will holds out his hand.\n\n                                 WILL (cont'd)\n                       The tape.\n\n             Walter looks at the open hand.  Hugs his jacket to him.\n\n                                 WALTER\n                       I thought maybe we could talk some more.\n\n                                 WILL\n                       There's nothing more to talk about.\n\n                                 WALTER\n                       But we work so well together...\n\n             Will breaks.  Rushes Walter.  Slams him against one of the\n             concrete pilasters.\n\n                                 WILL\n                       We do nothing well together.\n                           (SLAMS him again)\n                       Nothing!  You understand me?\n\n             Another wave CRASHES.  Sprays them.  Walter looks up into\n             Will's bloodshot eyes.\n\n                                 WALTER\n                       You run on two settings, Will.  I've \n                       noticed that...\n\n             Will tightens his grip.\n\n                                 WALTER (cont'd)\n                       You jump from calm to rage in the blink\n                       of an eye.  That's okay.  I do that too.\n\n             He holds up the tape.  Will grabs it, shoves Walter to the\n             side.  Yanks the tape out of the cassette.  Steps back and\n             HURLS it into the sea.  Waves engulf it hungrily.\n\n             Walter watches him.\n\n                                 WALTER (cont'd)\n                       You're not sleeping, are you?\n\n                                 WILL\n                       What the hell do you know?\n\n                                 WALTER\n                       Kay told me.  She comes to me, you know.   \n                       Tells me things.  About you.  About me.\n\n             PAUSE.\n\n                                 WALTER (cont'd)\n                       Does Detective Eckhart come to you?\n\n             Will curls his fists.\n\n                                 WALTER (cont'd)\n                       Does he ask you why you shot him?\n\n             Whips around...\n\n                                 WILL \n                       I told you that was an accident!\n\n                                 WALTER\n                       Then so was mine...\n\n                                 WILL\n                       Don't you pull that shit with me.\n\n                                 WALTER\n                       I didn't want to kill her, Will.\n\n             Steps closer to him.  Beseeching.\n\n                                 WALTER (cont'd)\n                       When she called me that night from the\n                       party, she'd had a fight with Randy.\n                       Wanted to talk.  I told her to meet me at\n                       our special place.  The cabin at the\n                       beach...\n\n             A couple RAVENS alight nearby.  Flapping their wings.\n             SCREECHING into the wind.\n\n                                 WALTER (cont'd)\n                       ...When she came she was barefoot.  And\n                       there was liquor on her breath.  I only\n                       wanted to comfort her.  To touch her.\n                       She could have at least let me do that.\n                       Her skin...it was like everything I'd\n                       ever written about.\n\n             A dark shadow crosses his face.  Holds on to the coiled rope\n             of the statue.  Will hisses.\n\n                                 WILL\n                       Couldn't get it up, Walter?\n\n                                 WALTER\n                       It was when I went to kiss her.  She\n                       started laughing.  I got angry.  After\n                       all I'd given her.  All I'd shared with\n                       her.  I just wanted to make her stop.\n                       That's all.\n\n             Walter.  Squeezing the bronze rope.\n\n                                 WALTER (cont'd)\n                       From calm to rage in the blink of an eye.\n\n             Locks eyes with Will.  Conspiratorial.\n\n                                 WALTER (cont'd)\n                       Remember?\n\n             WILL'S HAND shoots out.  Clamps around Walter's neck.\n\n                                 WILL\n                       Like this?\n\n             Walter's face, starts turning red.\n\n                                 WALTER\n                       Yes.  Like that.\n\n                                 WILL\n                       This an accident, Walter?\n\n                                 WALTER\n                       If you want it to be...\n\n             Will looks deep into Walter's eyes.  Squeezing harder.  Pure\n             hatred.\n\n                                 WILL\n                       It took ten minutes to beat Kay Connell\n                       to death.  Ten minutes.\n\n             Their eyes, locked.  Veins, popping along Walter's temples.\n             Lip quivering...\n\n             JUST THEN a BELL sounds in the distance.  Will looks up.\n\n             A LINE OF FISHING BOATS coming back in.\n\n             Will, looks back at Walter.  Throws him to the ground.\n             Sickened.\n\n                                 WILL (cont'd)\n                       Get the fuck out of town, Byrd.  Leave\n                       and never come back.\n\n             Walter COUGHS.  Holding his neck.  Enjoying this.\n\n                                 WALTER\n                       I have a summer house up by Kgun Lake.\n                       I'm going to write my next novel there.\n                       It's about a famous detective who goes\n                       bad.\n\n             Will shoots him a look.\n\n                                 WALTER (cont'd)\n                       Just kidding.\n\n             He pulls himself to his feet.  A little unsteady.  Takes out\n             a handkerchief.  Dabs his forehead.\n\n                                 WALTER (cont'd)\n                       The never coming back part, though.  I'm\n                       not sure.  To tell you the truth this has\n                       been kind of fun.  Going to the station,\n                       meeting all those nice people.  Talking\n                       with you.\n\n             He shrugs.  Walks past Will.\n\n                                 WALTER (cont'd)\n                       I might miss it.\n\n             Will turns.  Watches him walk away.  Walter hesitates.  Turns\n             back.\n\n                                 WALTER (cont'd)\n                       I especially like that new detective.\n\n             Will looks at him.  Back straightening.\n\n                                 WALTER (cont'd)\n                       Detective Burr.\n                           (smiles)\n                       I liked her very much.  Has a real\n                       vitality.\n\n             Will's stomach jumps.  Walter turns back.  Continues on.\n\n             The little man in a beige windbreaker.\n\n             INT. CHIEF CHARLES NYBACK'S OFFICE - NIGHTMUTE PD - DAY\n\n             CLOSE ON a HAND.  Signing the bottom of a form.\n\n                                 CHIEF NYBACK (O.S.)\n                       I was hoping not to send you back with so\n                       much paperwork, Will.\n\n             PULL BACK to reveal Chief Nyback sitting at his desk.  Will\n             stands before him.  Signing papers.  A bottle of bourbon on\n             the desk.  Some paper cups half filled.\n\n                                 CHIEF NYBACK (cont'd)\n                       When are you taking off?\n\n             Will checks his watch.\n\n                                 WILL\n                       Six-thirty.\n\n             Fred, standing over by the filing cabinet.  Toothpick in his\n             mouth.\n\n                                 FRED\n                       If Spencer's not too drunk to fly.\n\n             Nyback chuckles.\n\n                                 CHIEF NYBACK\n                       Can't talk you into staying for a couple of\n                       days?  Do some fishing?  Show you what\n                       normally goes on around here.\n\n             Will shakes his head.\n\n                                 WILL\n                       I have to get back.\n\n                                 CHIEF NYBACK\n                       Too bad...\n\n             Looks over at Fred picking his teeth.\n\n                                 CHIEF NYBACK (cont'd)\n                       ...Brought some real class to the place.\n                       But, Seattle needs its hero back.\n                           (stands)\n                       Couldn't have done it without you, Will.\n\n             Will caps the pen.  Uncomfortable.  Nods towards Fred.\n\n                                 WILL\n                       Had a lot of help from Nightmute's \n                       finest.\n\n             JUST THEN the door swings open.  They look over as\n\n             ELLIE hurries in.  She smiles.  Looks tired.\n\n                                 ELLIE\n                       Didn't want to miss anything.\n\n                                 CHIEF NYBACK\n                       Detective Dormer's not leaving for a few\n                       hours.\n\n                                 ELLIE\n                       Good.\n\n                                 CHIEF NYBACK\n                       Maybe you could drive him to Spencer's.\n\n                                 ELLIE\n                       Sure.\n\n             An awkward beat.  Ellie walks over to Will.  Looks up.\n             Suddenly throws her arms around him.\n\n                                 ELLIE (cont'd)\n                       I thought what you did on this case was\n                       amazing.\n\n             Will holds his hands out.  Not sure what to do.  Looks down\n             at the top of Ellie's head.\n\n             ELLIE'S HAND\n\n             slips down his back.  Feeling for a holster.  For that 39/13.\n             Nothing.  She breaks away.\n\n                                 ELLIE (cont'd)\n                       We're really going to miss you around\n                       here.\n\n             She and Will lock eyes.  Hold for a beat.\n\n             He knows exactly what she was trying to do.\n\n             INT./EXT. JEEP CHEROKEE - NIGHTMUTE - DAY\n\n             Will, driving down Nightmute's main street.  He takes a left.\n             Goes up a hill.  Glances out the window.  Passing by\n\n             THE CEMETERY.  A cluster of headstones.  Something catches\n             his eye.  He stops the car.\n\n             EXT. CEMETERY - NIGHTMUTE - DAY\n\n             Will, walking up to the wrought-iron gate surrounding the\n             cemetery.  Stops.  Puts his hands up to the bars.\n\n             KAY CONNELL'S GRAVE\n\n             on the other side.  Newly dug.  A mound of dirt.  Flowers,\n             scattered by the wind.  Daughter and Friend...1982-1999.\n\n             Will.  Grips the bars.  As if he's seeing it for the first\n             time.  Really seeing it.\n\n             Closes his eyes.\n \n             What have I done?\n\n             INT. WILL'S ROOM - PIONEER LODGE - EVENING\n \n             Will's REFLECTION in the mirror.  He's showered.  Hair's\n             combed.  Put on a clean suit.  Steps back.  Smooths down his\n             lapels.  Just right.\n\n             Turns to face the room.  Bed's made, mess cleaned up.  He\n             heads over to the bureau, pulls out his Smith 39/13.  Lays it\n             on the bed.\n\n             Unclips his badge from his belt.  Lays it on the bed.  Takes\n             something from the bedside table.  The BULLET found in Hap\n             Eckhart.  Lays it on the bed.\n\n             All neat.  All ordered.\n\n             Reaches under the mattress.  Pulls out the PHOTOGRAPH of a\n             blurry Walter Byrd standing in front of a house.  A radio\n             tower in the background.  The call numbers: WKOZ.\n\n             Will studies it.  Tears it in half.\n\n             INT. BACK ROOM - PIONEER LODGE - EVENING\n\n             Rachel in the back room behind reception.  A pullman's\n             kitchen, a desk, an old recliner.  Pouring some milk into a\n             bowl for a CAT.  A stray.\n\n             Will walks in.  Rachel turns, smiles.\n\n                                 RACHEL\n                       I found a new friend.\n\n             Will walks up to her.  Puts his arms around her.  Holds her,\n             smells her, kisses her neck.  Pulls away.  Looks into her\n             eyes.\n\n                                 RACHEL (cont'd)\n                       Will.  What is it?\n\n             He doesn't answer.  The cat, rubs against his leg.  PURRING.\n\n             INT./EXT. JEEP CHEROKEE - EVENING\n\n             Will driving along a forest road.  Eyes dead ahead.  A map on\n             the passenger seat.  By the fold, Kgun Lake circled in pencil.\n\n             INT. BULLPEN - NIGHTMUTE PD - CONTINUOUS\n\n             Ellie working at her desk.  Looks up at the clock: 6:00.\n             Gets up, grabs her down vest.  Heads for the door.  Farrell\n             sticks the tip of his crutch in her path.  She stumbles.\n\n                                 ELLIE\n                       Very funny, Farrell...\n\n             EXT. ROAD TO KGUN LAKE - EVENING\n\n             AERIAL VIEW of the silver Jeep Cherokee.  The only car on the\n             road.  The sky, white-grey.  The trees, a blanket of green.\n             The Cherokee heads around a hairpin curve.\n\n             INT. LOBBY - PIONEER LODGE - EVENING\n\n             Rachel at reception.  Reading the paper.  Ellie walks in.\n\n                                 ELLIE\n                       Hi, Rachel.\n\n             INT./EXT. JEEP CHEROKEE - ROAD TO KGUN LAKE - EVENING\n\n             Will, scanning the treeline.  Takes a left fork then stops.\n             Thought he saw something.  Grinds the gear, backs up.  Takes\n             another look.\n\n             IN THE DISTANCE, a radio tower.  WKOZ.\n \n             INT. HALLWAY - OUTSIDE WILL'S ROOM - EVENING\n\n             Rachel and Ellie, standing outside Will's room.  Ellie knocks\n             again.\n\n                                 RACHEL\n                       I would have seen if he came back.\n\n             INT. WILL'S ROOM - PIONEER LODGE - EVENING\n\n             The CLICK of a key and the door opens.  Ellie strides in.\n\n                                 ELLIE\n                       Detective Dormer?\n\n             She stops.  Rachel behind her.  Taking in the strange feeling\n             in the room.  Walks over to the bed.  Eyes riveted on the\n             39/13.  On the bullet.  Rachel, behind her.\n\n                                 RACHEL\n                       What is all this?\n\n             Ellie, her mind races.  Notices TORN PHOTOGRAPH PIECES in the\n             trash can.  Reaches in and pulls some out.  A puzzle.\n\n             INT./EXT. JEEP CHEROKEE - LAKE KGUN\n\n             Will stops the car at the end of a narrow dirt driveway.\n             Looming before him...\n\n             A HOUSE right on the lake.  Tall, wooden, in disrepair.\n             Chipping yellow paint.  A ghost of what it once was.  The\n             house from the photograph.  \n\n             INT. STUDY - HOUSE\n\n             The CLANG of electric typewriter keys bang out a title:\n             BLINK OF AN EYE, by Walter By\n\n             WALTER BYRD hunched at his typewriter.  In an old study.\n             Books stacked everywhere.  Light patches on the walls where\n             pictures used to hang.\n\n             BARKING outside.  Walter cocks his head.  Gets up.  Walks\n             over to the window.  \n\n             OUTSIDE.  Will walking up to the house.  Lucy and Desi\n             jumping around him.\n\n             INT. LIVING ROOM - SUMMER HOUSE\n\n             Will opens the screen door with a CREAK.  Steps into the\n             living room.\n\n             Recoils from the smell.  Flies BUZZING.  Yellow plastic\n             covering the sofas.  Boxes, books, papers, pictures piled\n             high everywhere.  Wallpaper faded, peeling.\n\n             Everything, decaying.\n\n             INT./EXT. ELLIE'S TRUCK - CONTINUOUS\n\n             Ellie ripping along the forest road in her truck.  Gripping\n             the wheel.  The photograph pieces, taped together on the\n             passenger seat.\n\n             INT. SUMMER HOUSE - CONTINUOUS\n\n             Will heads down a hallway.  Dark, narrow, floorboards worn.\n             More shit stacked up.\n\n             Each step, careful, quiet.  Tracking.  Listening.  A BREEZE\n             sweeps through.  The burned-out lightbulb hanging from the \n             ceiling, starts swinging.\n\n                                 WALTER (O.S.)\n                       Here to visit me?\n\n             Will whips around.\n\n             WALTER standing there.  At the other end of the hallway.\n             Shoulders slumped.\n\n             Will shakes his head.\n\n                                 WILL\n                       No.\n\n             FLIES, bouncing against the screen door.\n\n                                 WILL (cont'd)\n                       I'm here to end this.\n\n             Walter looks around.\n\n                                 WALTER\n                       Where's your back-up?\n\n                                 WILL\n                       No back-up.\n\n                                 WALTER\n                       You're not following procedure.\n\n                                 WILL\n                       Procedure went out the window a long time\n                       ago.\n\n             Walter looks at him.\n\n                                 WALTER\n                       We're on the same side, Will.  You know\n                       that.  After what we've been through\n                       together.  We're partners.  Bound by a\n                       secret.\n\n             Will takes a step forward...\n\n                                 WILL\n                       That's where you're wrong, Walter.\n\n             Slowly reaches into his jacket...\n\n                                 WILL (cont'd)\n                       There is no secret.  Because the biggest\n                       difference between you and me is what we\n                       will or will not live with...\n\n             Pulls out his SMITH AND WESSON.  Walter.  Looks at the gun.\n             Inches back.\n\n                                 WALTER \n                       Will...\n\n             SUDDENLY, darts out of sight.  Swings back into the doorway\n             with a SHOTGUN...\n\n             BAM!  Will's shoulder explodes with blood.\n\n             EXT. DRIVEWAY - SUMMER HOUSE - CONTINUOUS\n\n             Ellie, jumping out of her truck.  Hears the sound.  Looks up\n             at the big, yellow house.  Pulls out her Glock 40.\n\n             INT. HALLWAY - CONTINUOUS\n\n             Walter walking down the hall.  Will, writhing on the floor,\n             reaches for his back holster...gun's not there!\n\n             Walter stands over him.  Swings his leg back and...CRACK!\n             Kicks will in the ribs.  The pain, blinding.  Will GASPS.\n\n             CRACK! again, CRACK! again, CRACK! again.  Walter's face.\n             Calm, flushed.  A vein along his temple.  \n\n             Will's eyes flutter.  Blood, spewing from his lips.  A THUD!\n             to his kidneys.  Walter stops, out of breath.  Hand on hip.\n\n                                 WALTER\n                       You give the police a bad name, Will.\n\n             WILL'S HAND suddenly shoots out.  Grabs the shotgun barrel.\n\n             WALTER stumbles back.  The shotgun goes off.  BAM!  Chunks of\n             ceiling rain down.  Walter falls to the ground.\n\n             EXT. SUMMER HOUSE - CONTINUOUS\n\n             Ellie, heart POUNDING.  Kicks the front door open...\n\n             INT. HALLWAY - CONTINUOUS\n\n             Will, covered in dry wall, struggling to his feet.  Reaches\n             for his Smith and Wesson.\n\n             WALTER'S DESERT BOOT kicks it out of the way.  It SKITTERS\n             down the hall.\n\n             Walter grabs his shotgun.  Scrambles to his feet.  Runs down\n             to the end of the hall.  Ducks into...\n\n             INT. LIBRARY\n\n             ...the library.  Dirty shelves, strings of dust.  Endless\n             books.  He races over to a cabinet.  Yanks open a DRAWER...\n\n             INT. HALLWAY - CONTINUOUS\n\n             Will, on his feet, trying to focus.  His suit, soaked with\n             blood.  Looking for his gun.  Spots it, in the corner...\n\n             INT. LIBRARY\n\n             Walter jerks open another drawer.  A STACK OF BOOKS teeter on\n             the top of the cabinet.  He finds what he needs.  SHELLS.\n             Grabs a handful...\n\n             THE BOOKS tumble down on top of him.  He CRIES out, covering\n             his head...touches his ear, panics - hearing aid's gone!\n             Looks up.  Will, coming down the hall...\n\n             INT. HALLWAY\n\n             Will hobbles into the library.  Sweeps the room with this gun.\n             No Walter.\n\n             Steps on something, crushing it.  Looks down.  Walter's\n             hearing aid.  Kicks it aside.\n\n             INT. FRONT HALL - CONTINUOUS\n    \n             Ellie.  In the front hall.  Following procedure.  Right hand\n             gripping the gun.  Left supporting the butt.\n\n             Blinks away sweat.  Facing three doorways.\n\n             INT. DINING ROOM\n\n             Will limps into the dining room.  Furniture stacked high.\n             Eyes, darting.  Gun, covering.  Trying to stay conscious...\n\n             BANG!  The screen door.\n\n             INT. FRONT HALL - CONTINUOUS\n\n             Ellie.  Gun swinging.  Doorway one.  Doorway two.  Doorway \n             three...SUDDENLY\n\n             A FIGURE\n\n             runs past number one.  Big.  Shadowy.  The flash of a GUN.\n             She wheels toward it.  Finger on the trigger...\n\n             SLO-MO...The FIGURE, passing.  Her heart, POUNDING.  Her\n             finger...squeezing...\n\n             Will Dormer or Walter Byrd?\n\n             At the last second, she jerks the gun away.  The figure \n             disappears.  She swallows.  Gripping the gun.  Follows.\n  \n             EXT. BACK YARD - SUMMER HOUSE\n\n             The sky, heavy with clouds.  The air, foreboding.  Will\n             steals out the screen door.  Gun cocked.  Eyes scanning.\n             Wind, bending the weeds, the trees.\n\n             BAM! a shot.  Out of nowhere.  Rips into his thigh.  Will\n             CRIES out.  BAM! a second shot.  Whizzes past him...\n\n             INT. LIVING ROOM - CONTINUOUS\n\n             ...CRACK! the shot bites into the window frame.  Wings Ellie\n             halfway across the room.  She drops to the floor.  Clutching\n             her shoulder.  Flesh wound.\n\n                                 ELLIE\n                       Shit!\n\n             Pulls herself over to a SIDEBOARD for cover.  Shrinks behind\n             it.  Notices\n\n             A PLASTIC BAG sticking out from one of the drawers.  Nudges\n             it open.  A flowered dress, some panty-hose, strands of long\n             dark hair...\n\n             EXT. BACK YARD - SUMMER HOUSE\n\n             Will.  On the ground.  Gripping his leg.  Looking wildly\n             around.  No sign of Walter.  Then.  He sees it.\n\n             Lucy and Desi.  Down by the boathouse.\n\n             INT. BOATHOUSE\n\n             The boathouse.  Old, rotted wood.  Crumbling beams.\n\n             Walter stands at a window.  Re-loading his shotgun.  He\n             fumbles, drops a shell.  It rolls towards a crack in the\n             floor.  Falls into the LAKE WATER below.\n\n             CLICK!  Walter levels the shotgun out the window.\n\n             WALTER'S POV - the long, undulating WEEDS outside.\n\n             EXT. WEEDS\n   \n             Will.  Pulling himself through the weeds.  Losing blood fast.\n             Dragging his body.  Approaches the side of the BOATHOUSE.\n\n             WALTER'S GUN BARREL, sticking out.\n\n             Will ducks his head.  Winces in pain.  Breathing, becoming\n             ragged.  Rounds to the other side.  Hoists himself up to\n             another WINDOW.  Cautiously looks in...\n\n             WALTER at the far window.\n\n             Will jerks back.  Steps on the dock.  A plank CREAKS.  Shit.\n             Peers back through the window.  \n    \n             WALTER.  Still looking out.  Didn't hear a thing.\n\n             Will remembers.  Walter doesn't have his hearing aid.  He's\n             deaf on that side.\n\n             INT. BOATHOUSE\n\n             Walter, looking out the window.\n\n             OVER HIS SHOULDER - we see Will climbing in through the\n             window.  Smearing blood along the sill, favoring his leg.\n             Stands straight.  Levels his gun at Walter's back.\n\n                                 WILL\n                           (softly)\n                       Walter?\n\n             Nothing.  Walter continues staring out the window.  Will\n             raises his voice.\n\n                                 WILL (cont'd)\n                       Walter!\n\n             Walter jumps, whips around.  Comes face to face with the \n             barrel of Will Dormer's gun.  Surprised.  Absently touches\n             his deaf ear.\n\n                                 WALTER\n                       Wild card.\n\n                                 WILL\n                       Drop the gun, Walter.\n\n             Walter looks at Will's 45.\n\n                                 WALTER\n                       That jammed the last time, remember?\n\n             The men LOCK EYES.  Wind HOWLING through the boathouse.\n             Killer and Detective.  Only a bullet separating them.\n\n             WALTER suddenly jerks up his shotgun...\n\n             BANG!  He stumbles back.  Hit in the gut.\n\n             Will's Smith and Wesson, smoking.  No longer jammed.\n\n             Walter, touches the blood.  Looks back at Will.  Staggering.\n             CRACK!  The rotting floor gives way beneath him.  He CRIES\n             out, falls.  Drops into the icy water below.\n\n             SILENCE.  Will steps over to the hole.  Looks down at\n     \n             WALTER, floating on his back.  Looking up at him.  Water\n             washing over his body.  Eyes, pleading.  Fading.  A wave,\n             gently pulls him away.\n\n                                 WILL\n                       Another J. Brody mystery.\n\n             EXT. BOATHOUSE\n\n             Will staggers out on to the dock.  Drops his gun.  Crashes to\n             his knees.  Falls back.  His face, pale.  Lying against the\n             wood of the dock.\n\n             RAIN DROPS.  Start to fall.  Washing the blood from his skin.\n             Puckering the lake water.  Will's eyes...flutter...\n\n             FOOTSTEPS...running along the dock.  Heavy boots...\n\n                                 ELLIE (O.S.)\n                       Detective Dormer!\n\n             Will squints against the rain.  Makes out the face of\n\n             ELLIE hovering over him.  He gives a half-smile.\n\n                                 WILL\n                       God, you're a pain in the ass.\n\n             Ellie kneels down next to him.  Pulls over her vest.  Covers\n             him.\n\n                                 ELLIE\n                       You're shot.\n\n             Will looks at her bloody shoulder.\n\n                                 WILL\n                       You, too.\n\n             Ellie, tearing off her boot.  Yanks off her sock.\n\n                                 ELLIE\n                       I'm going to make a tourniquet.\n\n             Will, fading fast.\n\n                                 WILL\n                       Walter Byrd killed Kay Connell.  Her\n                       things are in the house.\n\n                                 ELLIE\n                       I know.\n\n                                 WILL\n                       Byrd's dead.\n\n             Ellie, wraps the sock around his leg.  Starts twisting.  Will\n             grimaces.  Ellie swallows.  Doesn't want to ask this.\n\n                                 ELLIE\n                       You shot Detective Eckhart, didn't you?\n\n             Will nods.\n\n                                 WILL\n                       Yes.\n\n             A pained looks crosses Ellie's face.\n\n                                 ELLIE\n                       Did you mean to?\n\n             Will shakes his head.\n\n                                 WILL\n                       No.  But I covered it up.  I lied.\n\n                                 ELLIE\n                       Why?\n\n             RAIN, drumming down around them.  Will, takes a deep breath.\n\n                                 WILL\n                       Because I just couldn't be wrong.\n                           (looks at her)\n                       Don't ever get that way, Ellie.  Don't \n                       ever lose your way.  It blurs the line.\n\n             His blood, pumping out in rivulets.  Ellie looks down at him. \n             Her hero.  Moves up to the wound in his arm.\n\n                                 ELLIE\n                       This one looks worse.\n\n             Will reaches up a feeble hand.  Stops her.\n\n                                 WILL\n                           (whispers)\n                       Just let me sleep, Ellie...\n\n             His eyelids, growing heavy.\n\n                                 WILL (cont'd)\n                       Let me sleep.\n\n             Ellie blinks away the tears.  Knows what he means.  What he\n             wants.  Watches as the calm spreads over him.\n\n             Will closes his eyes.\n\n                                 ELLIE\n                       No!\n\n             Will opens his eyes.  She ties the second sock around his\n             arm.\n\n                                 ELLIE (cont'd)\n                       I will not let you sleep.  If you've lost\n                       your way then you have to make it right.\n                       That's the only way.  That's what you'd\n                       tell me.  I've been a detective for four\n                       weeks and I say you're coming with me.\n\n             She gets up.  Slips her arms under his shoulders.  Starts\n             hoisting him up.\n\n                                 ELLIE (cont'd)\n                       C'mon...\n\n             Will.  Struggling to his knees.  Every inch of him, screaming\n             in pain.  Gets to his feet.  Arm slung around this tiny,\n             young woman.\n\n                                 WILL\n                       What about your shoulder?\n\n                                 ELLIE\n                       Don't worry.  I'll have a cool scar.\n\n             And they head, slowly but surely, back down the dock.\n                                                          \n                                                                 FADE OUT.\n\n\n\n\n\n\n\n\nInsomnia\nWriters :   Hilary Seitz\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In the small fishing town of Nightmute, Alaska, 17-year-old Kay Connell (Crystal Lowe) is found murdered. LAPD detectives Will Dormer (Al Pacino) and Hap Eckhart (Martin Donovan) are sent to assist the local police with their investigation, at the request of police chief Nyback (Paul Dooley), an old colleague of Will's. Also, an intense Internal Affairs investigation in Los Angeles is about to put Dormer under the microscope. Eckhart reveals that Internal Affairs has offered him an immunity deal in exchange for his testimony regarding one of Dormer's past cases. Eckhart says that he has no choice but to accept the deal, to Dormer's frustration.\nDormer comes up with a plan to lure the murderer back to the scene of the crime. The attempt fails, however, and the suspect flees into the fog. The police chase, and the suspect shoots one through the leg. Dormer soon fires at a figure in the fog. On his way to the fallen figure, he picks up a .38 pistol the suspect has dropped. He then discovers that he has shot Eckhart. As he dies, Eckhart accuses Dormer of murdering him. Because of Eckhart's pending testimony against Dormer; Dormer knows that Internal Affairs will never believe the shooting was an accident. He tells his colleagues Eckhart was shot by the suspect. He doesn't mention he has the .38. Ellie Burr (Hilary Swank), a young police officer, is put in charge of the investigation of Eckhart's shooting. Police find the bullet that sliced the first officer's leg, a .38 caliber. That night, Dormer walks to an alley and fires the .38 pistol into an animal carcass. He retrieves the bullet and cleans it, then visits the morgue. The staffer hands him the bagged bullet retrieved from Eckhart's body. She is unfamiliar with its type. He leaves and switches the bullet with one from the .38.\nOver the next few days, Dormer is plagued by insomnia, brought on by his guilt over killing Eckhart and further exacerbated by the perpetual daylight. He then starts receiving anonymous phone calls from the suspect, who claims to have witnessed Dormer kill his partner. The police are aware that Kay was a fan of a local crime writer named Walter Finch (Robin Williams) after looking through her belongings. Dormer looks up his address and breaks into his apartment. Finch soon comes home, realizes the police have arrived, and evades Dormer after a chase.\nDormer returns to Finch's apartment. While there, he plants the .38 to frame Finch. Finch later contacts him and arranges a meeting on a ferry. Finch wants help in shifting suspicion to Kay's abusive boyfriend Randy Stetz (Jonathan Jackson) and will stay silent about Dormer's role in the Eckhart shooting in return. Dormer gives advice on handling police questioning. After Finch leaves Dormer on the ferry, he shows the detective a tape recorder he used to record the conversation.\nFinch calls Dormer and tells him that Kay's death was \"an accident\"—he beat her to death in a fit of rage after she rejected his advances. The next day, Finch, under Dormer's instruction, gives false testimony at the station. Yet he surprises the detective when he says Randy had a gun. Dormer realizes Finch discovered his plant and has hidden it at Randy's home. He races to Randy's house to find the gun before other officers, but is unsuccessful; Randy is arrested. Finch offers to give Burr letters indicating that Randy abused Kay, and asks her to come and collect evidence from his summer home the next day.\nBurr finds a 9mm shell casing at the scene, which conflicts with the bullet type found in Eckhart's body. She reads old case files from investigations Dormer was involved in and learns he has carried a 9mm, suspecting he has been lying about who shot Eckhart. Dormer confides in the hotel owner, Rachel Clement (Maura Tierney) about the Internal Affairs investigation: He fabricated evidence to help convict a pedophile he was certain was guilty of murdering a child, and who would have been set free if Eckhart had testified.\nDormer searches Finch’s apartment for an address for his lake house, and realizes Finch intends to kill her after finding Kay's letters in the apartment. As Burr and Finch move through his house, Finch knocks Burr unconscious. Dormer reaches the cabin, but is too disoriented to fight off Finch from lack of sleep. Burr saves Dormer, while Finch escapes. Burr reveals she knows Dormer shot Eckhart. He admits it but says he is no longer certain if it was an accident. From his shed, Finch shoots at them, and Burr returns fire, allowing Dormer to sneak around to Finch's location. Finch and Dormer shoot each other, killing Finch and fatally wounding Dormer. Burr rushes to Dormer's aid and comforts him by affirming that Eckhart's shooting was accidental, then moves to throw away the shell casing evidence to preserve Dormer's secret. He stops Burr, telling her not to lose her way, before he dies."}