{"title": "Jade", "full_text": "Jade Script at IMSDb.\n\n\n\n\n\nThis script was brought to you by :\n  The Internet Movie Script Database\n  www.IMSDb.com\n\n\n\n\n\n\n\n\n\n\n\n\n\nJade\nWriters :   Joe Eszterhas\nGenres :   Action  Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "San Francisco Assistant District Attorney David Corelli (Caruso) is called to the murder scene of prominent businessman Kyle Medford, found stabbed to death in his home by an antique hatchet. Police detectives Bob Hargrove and Petey Vesko find photographs in Medford's safe of Governor Lew Edwards (Crenna) having sex with a prostitute, later identified as Patrice Jacinto. During questioning, Patrice reveals that she and other women were paid by Medford to have sex with wealthy men at his beach house in Pacifica. She also informs them that the most desired prostitute among the clients was a woman known only as \"Jade.\"\nIn a private meeting with Governor Edwards and aide Bill Barrett, Corelli is warned not to make the photographs public. Corelli is then almost killed when his brake line is deliberately cut and his vehicle goes out of control while driving down a steep hill.\nThe detectives find fingerprints on the hatchet belonging to Katrina Gavin, a clinical psychologist and former lover of Corelli's who eventually married his close friend, defense attorney Matt Gavin. When interviewed, Katrina explains that Medford gave her a tour of his antique collection on the day in question, but claims to have nothing to do with his death.\nAt Medford's beach house, Corelli and the detectives find various drugs, alcohol, and sex toys as well as hidden video cameras. They conclude Medford was recording the sex sessions in order to blackmail the men. Corelli is shocked to discover Katrina on one of the tapes; the revelation renews the detectives interest in her as a suspect.\nPatrice arranges to meet Corelli at a restaurant to discuss Jade's identity, but she is killed in a hit-and-run accident by an unknown assailant driving a black 1993 Ford Thunderbird. Corelli, witnessing the murder first-hand, chases the assailants' vehicle in vain. The detectives discover the Gavins own a similar Thunderbird and therefore suspect Katrina of killing Patrice, but when they find the actual vehicle used in the hit-and-run abandoned, it appears someone may be trying to frame Katrina.\nKatrina is again brought in for questioning and this time is shown the sex tape. Matt, in his capacity as her attorney, ends the interrogation before she fully explains her involvement. When confronted at their home, Katrina admits to her husband that she did have sex with the man on the tape, due in part to her knowledge of Matt's many affairs.\nKatrina visits Corelli at his apartment and tries unsuccessfully to seduce him. She admits having felt sexually liberated by sleeping with several men at the beach house. Meanwhile, the only witness to identify Katrina at the Pacifica beach house, a man named Henderson, is found murdered. Corelli informs the detectives at the crime scene that Katrina couldn't have killed him because she and Corelli were together at the time.\nBack at his apartment, Corelli is met by Matt, who holds him at gunpoint and angrily accuses him of having sex with Katrina. He denies it and persuades Matt that his wife's life is in danger. They hurry to the Gavin home, where Det. Hargrove and Governor's aide Barrett have come to search for the incriminating photos of the Governor. Katrina interrupts their search and Hargrove tries to kill her, but Corelli and Matt arrive and Hargrove is shot by Matt.\nCorelli goes to the Governor for a guarantee of Katrina's safety by leveraging his possession of the photographs. The Governor denies any knowledge of Hargrove's or Barrett's actions, but insinuates they were both acting on his behalf. As she gets ready for bed at home, Katrina finds photographs laid out in her bathroom of her having sex at the beach house. Matt admits to Katrina that he killed Medford, certain that Medford eventually would blackmail them both. He then tells Katrina to \"introduce me to Jade\" the next time they \"make love\"."}