{"title": "Kalifornia", "full_text": "\"KALIFORNIA\"\n\n                                      Screenplay by\n\n                                       Tim Metcalfe\n\n                                   Based on a story by\n\n                              Stephen Levy and Tim Metcalfe\n\n                                      SHOOTING DRAFT\n\n                \n\n               EXT. - NIGHT\n\n               It's raining like hell. Flashes of lightning reveal momentary \n               glimpses of a decayed urban/industrial landscape. Far below \n               us, a mysterious glistening wet rock lies engulfed in the \n               drowning earth. We descend toward the rock. Sporadic flashes \n               of lightning distort our perspective of the stone. It looks \n               strangely beautiful, like a diamond stuck in the dark mud... \n               Closer... Closer...\n\n               Suddenly, STRONG MALE HANDS cut across the frame and wrench \n               it free from its muddy grave. Even closer... And we discover \n               that the underbelly of this beautiful rock is teeming with \n               every kind of slithering repulsive insect... FLASH!!* \n               Lightning obliterates the frame.\n\n               (* FLASHES OF LIGHT from lightning, car headlights, \n               photographic strobe units and flashlights are used throughout \n               the following sequences as recurring transitional devices.)\n\n               CITY STREET EXT. NIGHT\n\n               We can barely see the darkened street in a run down part of \n               an inner city -- what we can see looks half demolished. \n               Flash!!\n\n               Through chain link fencing, the blinding headlights of a \n               70'S CHEVY arc into frame. For an instant we see the fleeting \n               image of a PRETTY TEENAGE GIRL. On her feet a pair of bright \n               red high heeled shoes. The Chevy pulls up next to her.\n\n               INT. 70'S CHEVY - NIGHT\n\n               FLASH!! An oncoming car's headlights streak across the beat \n               up Chevy's windshield... revealing... THE DRIVER, 45ish, as \n               he leans across the passenger seat and opens the car door.\n\n               The pretty teenage girl slides into the car. Dressed only in \n               a skirt and T-Shirt, she's soaked to the skin. Make-up runs \n               down her face and her hair sticks to her bare shoulders. She \n               seems nervous... scared even.\n\n                                     PRETTY TEENAGE GIRL\n                         Thanks.\n\n               As she closes the car door the man notices that her hand has \n               been injured. It's bound with coarse white toweling and \n               stained with blood. In her other hand, she clings tightly to \n               a cheap yellow leather purse. He reaches forward and puts \n               his hand on the gear-shift, the back of his hand brushing \n               against her leg, she moves away. He slides the gear-shift \n               into drive.\n\n               Another car's headlights flare the windshield as he pulls \n               out into the night.\n\n               INT. ROOFLESS OLD WAREHOUSE - NIGHT\n\n               Suddenly... a powerful photographic strobe light ignites! \n               Revealing a decrepit warehouse interior. Silhouetted briefly \n               against the paint chipped walls are two figures: A man, BRIAN \n               KESSLER, 25, short chopped hair dressed in black on black, \n               and a woman, CARRIE LAUGHLIN, 25, short black hair and tight \n               black clothes. Carrie holds a 35mm still camera, an umbilical \n               cord runs to a strobe light. Brian holds a flashlight in one \n               hand, a tape recorder in the other. He begins speaking into \n               the tape recorder.\n\n                                     BRIAN\n                         Her father worked the night shift \n                         here. Most nights he'd bring her \n                         with him.\n                              (pause)\n                         She was eleven years old.\n\n               His flashlight scans the ominous environment. Carrie takes \n               flash photo.\n\n               EXT. CONSTRUCTION SITE - NIGHT\n\n               Emerging from the blackness... The same strong male hands \n               that unearthed the rock now pulls his rain soaked jacket \n               clear of his torso. A crude bandage wrapped around one of \n               the fingers. The rock is slipped up under his jacket... up \n               against his bare chest. The jacket is pulled down to conceal \n               the rock and the faceless figure drifts away.\n\n               INT. ROOFLESS OLD WAREHOUSE - NIGHT\n\n               The beam of Brian's flashlight sweeps through the darkness, \n               revealing another room.\n\n                                     BRIAN\n                         This is it. This is the where he'd \n                         take her whenever he had the urge to \n                         molest her.\n\n               The flashlight finds the corner in question. Flash!! The \n               warehouse lights up again, revealing a huge machine room.\n\n                                     BRIAN\n                         Of course! Nobody would have heard \n                         her cries over the noise of the \n                         machines.\n\n               INT. 70'S CHEVY - NIGHT\n\n               A male hand wipes the steamy condensation clear of his car's \n               front window. The windshield wipers swipe incessantly at the \n               constant sheet of rain beyond.\n\n                                     DRIVER\n                         Damn! This defroster never works...\n\n               The driver fidgets blindly with the various levers and knobs. \n               He finally manages to get the defroster and heater to work. \n               The girl leans forward into the stream of warm air.\n\n                                     PRETTY TEENAGE GIRL\n                         ...Mmm... feels good.\n\n               She closes her eyes, lets it blow across her face. He watches \n               her. His eyes linger on her body.\n\n                                     DRIVER\n                         Have a problem with your car?\n\n               She pulls her wet hair off her bruised face and gives him a \n               nervous smile.\n\n                                     PRETTY TEENAGE GIRL\n                         No.\n                              (beat)\n                         My problem's with men.\n\n               He throws a curious look at her, then back to the highway.\n\n               INT. ROOFLESS OLD WAREHOUSE - NIGHT\n\n               Brian's flashlight moves around the room.\n\n                                     BRIAN\n                         This is where she murdered her first \n                         victim. They found his body over in \n                         the corner, shot through the head.\n\n               The flashlight continues to search through the darkness.\n\n                                     BRIAN\n                         They found her second victim over \n                         there.\n\n               Another flash!!!!!\n\n               INT. 70'S CHEVY\n\n               Very close on the girl's yellow purse... as the metal zipper \n               is pulled open. The driver notices her opening the purse.\n\n                                     PRETTY TEENAGE GIRL\n                         Okay if I smoke?\n\n                                     DRIVER\n                              (unconvincingly)\n                         ...sure.\n\n               The driver watches as she reaches into the purse... out a \n               soggy pack of matches. She looks at them... I look to the \n               driver.\n\n                                     PRETTY TEENAGE GIRL\n                         My matches are all wet. You got a \n                         lighter?\n\n                                     DRIVER\n                              (scans the dashboard)\n                         Yeah. It's here somewhere. It's my \n                         wife's car. Ah... there it is.\n\n               He pushes the cigarette lighter in to heat. Out of the corner \n               of his eye, he sees the girl's hand slip back in her purse. \n               And stay there. She stares at the car lighter and... waits. \n               The driver glances at her, then back to the lighter.\n\n               INT. ROOFLESS OLD WAREHOUSE\n\n               FLASH!! As another strobe light ignites. Tape recorder hand, \n               Brian continues...\n\n                                     BRIAN\n                         She lured them here with the promise \n                         of sex.\n                              (beat)\n                         Imagine the anger and hatred she \n                         must have felt returning to this \n                         place. Did she use that to help her \n                         pull the trigger?\n\n               Carrie snaps another shot. Flash!! The blinding flash \n               illuminates the night rain streaming in through the fractured \n               remains of the ceiling.\n\n                                     CARRIE\n                         Shhhhhhhhh.\n\n               Brian stops talking. Carrie scans the darkness. From the \n               quiet...\n\n               A Thunderous Roar!!\n\n               INT. 70'S CHEVY - NIGHT\n\n               A Blinding Flash!!\n\n               As... a semi-trailer crosses paths with the 70'S CHEVY.\n\n               Close on the girl. An intent expression on her face as she \n               watches and waits... for the cigarette lighter to eject. His \n               hand reaches deeper into her purse. The Driver tenses as he \n               sees this. Suddenly...\n\n               POP!! The lighter ejects.\n\n               The Driver reaches for the dash. The girl hurriedly lifts \n               something out from inside the bag. The Driver yanks the \n               lighter out... and whips a look to the girl.\n\n               INT. ROOFLESS OLD WAREHOUSE\n\n               Brian's flashlight sweeps across the shadowed remains of the \n               rafters and catwalks. Scanning... Listening... Brian and \n               Carrie glance tentatively at each other... Then slowly Carrie \n               lifts the portable strobe unit upward until it is pointing \n               into the rafters. Carrie fires a shot, triggering a brilliant \n               Flash!!\n\n                                                                    CUT TO:\n\n               Flash! Out of the inky black... The glistening wet rock \n               emerges, hurtling downwards... Tumbling end over end through \n               the night rain...\n\n               INT. 70'S CHEVY\n\n               The girl pulls a pack of cigarettes out of her purse. She \n               looks curiously to the driver whose hand is trembling \n               slightly.\n\n                                     PRETTY TEENAGE GIRL\n                         What's the matter?\n\n                                     DRIVER\n                              (unconvincingly)\n                         ...nothing.\n\n               The girl reaches out, steadies his trembling hand... and \n               pulls the red hot coil to the cigarette between her lips.\n\n               When... in a THUNDEROUS CRASH!! The glistening wet rock comes \n               smashing through their windshield!!!!\n\n               EXT. FREEWAY - NIGHT\n\n               The CHEVY brakes... Skids across the rain-slicked pavement \n               and turns a somersault, landing upside down on its hood.\n\n               ANOTHER ANGLE: CLOSER\n\n               The CAMERA DRIFTS ACROSS the fractured front end of the \n               overturned CHEVY. The twisted hunk of metal hisses... \n               steams... groans. The front tire spins lazily to a halt on \n               its mangled axle.\n\n               IN THE BACKGROUND - HIGH OVERHEAD\n\n               We see a man standing on a highway overpass. He's leaning on \n               the railing and calmly looking down at the wrecked car.\n\n               CLOSER\n\n               EARLY GRAYCE, 25, athletic build, big watery eyes, jet black \n               hair, stands by the railing. Rain streaks down his \n               expressionless face. He dropped the rock.\n\n               EARLY'S POV - THE 70'S CHEVY\n\n               Lying in the deserted highway. The Driver crawls out covered \n               with blood. Still clutched in his hand is the car cigarette \n               lighter. Its red hot coil extinguishing quickly to a faint \n               glow.\n\n               ANGLE: CLOSER ON EARLY\n\n               Calmly looking down with no pity. Even closer... Water running \n               down his face. Closer yet... On his eye... And right into \n               the dilated pupil.\n\n               As we enter it -- it's like being in a dark winding tunnel \n               filled with the hum of dynamos and the loud rhythmic pumping \n               of powerful machinery.\n\n               FROM SOMEWHERE IN THE BLACKNESS\n\n               The distant echo of a Woman's voice.\n\n                                     KIM (O.S.)\n                         Are you dead or alive?\n\n               INT. APARTMENT - BRIAN'S EAR - LATER THAT NIGHT\n\n               Still hearing the whine from some tremendous dynamo, we emerge \n               from the inside of BRIAN'S RIGHT EARDRUM, pulling back far \n               enough to see his face.\n\n                                     KIM (O.S.)\n                         Brian?\n\n               Brian is distracted, distant, not paying attention to the \n               game of \"Twenty Questions\" that he is playing.\n\n                                     BRIAN\n                         Dead.\n\n                                     KIM (O.S.)\n                              (sarcastic)\n                         Obviously!\n\n               NEW ANGLE\n\n               A small party in progress. Graduate student types, smoking, \n               drinking. The usual. Carrie and Brian stand out in this group, \n               their look is more stylized, their attitude less complacent. \n               Carrie, in particular, looks restless.\n\n                                     CARL\n                         Man or woman?\n\n                                     BRIAN\n                         Man.\n\n               Carrie tunes in and pays attention to the game.\n\n                                     CLAUDIA\n                         Real or fictional.\n\n                                     BRIAN\n                         Real.\n\n                                     CARRIE\n                         Ted Bundy.\n\n               Brian's eyes dart to Carrie. The look on his face tells \n               everyone she nailed it. Brian gets up to get another drink. \n               Several people laugh, amazed that Carrie knows Brian so well.\n\n                                     CLAUDIA\n                         What a guess!\n\n                                     CARL\n                         Doesn't count, she's disqualified.\n\n                                     CARRIE\n                         Why?\n\n                                     CARL\n                         Because you've been living with him, \n                         and his thesis for the last year and \n                         a half.\n                              (beat)\n                         He's probably been researching Ted \n                         Bundy all week.\n\n                                     PETER\n                         Carl, you are the world's worst loser!\n\n               Carl looks over to Carrie. She gives him the finger and a \n               cheeky smile.\n\n               CAROL, sitting next to Carrie, asks...\n\n                                     CAROL\n                         Any word from that gallery?\n\n                                     CARRIE\n                         Not yet.\n\n                                     CAROL\n                         Nervous?\n\n                                     CARRIE\n                         ...Apprehensive. Let's not forget \n                         these are the people who banned the \n                         Mapplethorpe show. Anyway, \n                         California's loaded with galleries.\n\n                                     CAROL\n                              (nods toward Brian)\n                         You mean 'Ted Bundy's' finally agreed \n                         to leave?\n\n               Carrie watches Brian disappear into another room.\n\n                                     CARRIE\n                         ...Soon as he finishes his thesis.\n\n                                     CAROL\n                         Listen, Eric's been \"finishing\" his \n                         for over three years now.\n\n               Carrie lights a cigarette. Her frustration is showing.\n\n                                     CARRIE\n                         Yeah, well Brian's got 'til the end \n                         of the summer, then I'm outta here.\n\n               She gets up and begins weaving her way through the crowded \n               room. Carol follows.\n\n                                     CAROL\n                         I'm sorry, but I just can't see you \n                         veggin' out in LA-LA LAND.\n\n                                     CARRIE\n                         Oh, I don't know... I think that \n                         once I dye my hair blonde, buy a \n                         string bikini and cultivate that \n                         tan... I could be veggin' out with \n                         the best of 'em...\n                              (does a valley-\n                              girl/beach bunny)\n                         Like fer shurr!\n\n               Carrie and Carol share a strained laugh.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               INT. APARTMENT KITCHEN - FEW MOMENTS LATER\n\n               The room's crowded with people. There's a lot of noise -- \n               \"shop talk,\" banter. Clipped conversations overlap, as we \n               find Brian with his friend Eric. They are in the midst of \n               making a blender of margaritas.\n\n                                     BRIAN\n                         I'm talking about the mind and \n                         culpability of a serial killer. \n                         Someone who has no ability to \n                         distinguish between right and wrong \n                         should not be imprisoned, let alone \n                         executed.\n\n               Eric dumps in a handful of ice cubes as Brian pours in the \n               booze.\n\n                                     ERIC\n                         Oh, here we go again. Let's just lay \n                         it all at the altar of misfiring \n                         synapses, amok biochemicals and \n                         horrendous childhoods.\n\n                                     BRIAN\n                         Look, it's a fact, most of these \n                         people suffer from a severe chemical \n                         brain imbalance.\n                              (beat)\n                         That enough Tequila?\n\n                                     ERIC\n                         Probably not...\n\n               Brian pours in the rest of the bottle.\n\n                                     BRIAN\n                              (to Eric)\n                         The answer is research and treatment \n                         under hospital supervised conditions, \n                         not the electric chair!\n\n               Eric looks for triple sec in the cupboards. PETER overhears \n               them on his way to the refrigerator.\n\n                                     PETER\n                         Yeah, until it's your mother's head \n                         they find in the refrigerator.\n\n               He pulls open the refrigerator door and grabs two beers. \n               Carrie steps up behind Brian.\n\n                                     BRIAN\n                         Executing the killer wouldn't bring \n                         my mother back.\n\n                                     CARRIE\n                         Thank god!\n\n               Brian turns to see Carrie now behind him. She wraps her arms \n               around his neck.\n\n                                     BRIAN\n                              (sarcastic to Carrie)\n                         Ha, ha.\n\n                                     ERIC\n                         Yeah, but it'd sure make you feel \n                         better, wouldn't it?\n\n                                     BRIAN\n                         No, it wouldn't make me feel better.\n\n               Peter finds triple sec in the refrigerator.\n\n                                     PETER\n                         ...Looking for this?\n\n               Eric takes the triple sec from Peter and pours some in the \n               blender. He turns it on. It whines.\n\n                                     CARRIE\n                              (to Brian)\n                         If I have to listen to one more \n                         \"tweed\" talk about his dissertation, \n                         I'm going to throw up.\n\n                                     ERIC\n                              (to Brian)\n                         Label it anyway you want, the bottom \n                         line is these people are evil, plain \n                         and simple.\n\n                                     BRIAN\n                              (continuing with Eric)\n                         Okay, now you want to talk about \n                         good versus evil? Well then let's \n                         start with Adam and Eve and the snake.\n\n                                     CARRIE\n                         Who do I have to blow to get out of \n                         here?\n\n                                     BRIAN\n                              (reconsiders)\n                         A... I gotta go.\n\n               EXT. LUCKY STREET GRILL\n\n               A relic from the fifties with large glass windows. The rain \n               has stopped but the streets are still wet. Early's piece of \n               shit Grand Prix pulls into the lot. He gets out and walks \n               into the diner.\n\n               INT. DINER - NIGHT\n\n               The place is almost empty. Early, still wet from the rain, \n               walks to the counter and sits down. He calls out to the \n               kitchen.\n\n                                     EARLY\n                         Coffee and a bowl of chili, please.\n\n                                     WAITRESS (O.S.)\n                         ...Be right there.\n\n               The only other customer is an OLD MAN, sitting at the counter \n               nearby nursing a cup of coffee. His face half hidden under a \n               rain soaked hat. Early selects a tune from the countertop \n               juke box.\n\n               OLD MAN'S POV\n\n               Out of the corner of his eye he sees a bug (from the concrete \n               block) crawl out of Early's sleeve and onto the counter.\n\n                                     OLD MAN\n                              (from beneath his \n                              shadowy brim...)\n                         The Antichrist'll be a woman, in a \n                         man's body. Seven heads and seven \n                         tails.\n\n               Early gazes at the Old Man curiously, then calls out to the \n               waitress...\n\n                                     EARLY\n                         Make that to go.\n\n               Early notices the small bug crawling across the counter. He \n               leans closer to it and watches it. After a moment, he THWACKS \n               it off the counter with his thumb and finger. The bug lands \n               on the hot iron griddle with a SIZZLE!\n\n               EARLY glances at the Old Man again... then scoots over one \n               stool closer to him. Early seems curious to want to get a \n               glimpse under the brim of the Old Man's hat.\n\n               IN THE BACK KITCHEN AREA\n\n               The waitress is bagging Early's order to go... when the front \n               door slams shut!\n\n               FRONT DINING AREA\n\n               The waitress re-enters the room. It's empty. Neither the Old \n               Man nor Early are there. With Early's food in hand, she makes \n               her way along the rear of the counter toward the front door. \n               She glances around curiously. On the griddle, the remains of \n               something black and charred smoulders. Closer to the entrance, \n               she stares at the front door. The sign that hangs in its \n               window has been turned... the backside which faces her reads \n               \"OPEN.\"\n\n               AT THE FRONT DOOR\n\n               She wonders about the sign for a moment, then stares curiously \n               out the window... not a soul in sight. She locks the door \n               and begins closing up for the night. She turns to make her \n               way to the rear of the diner then notices something. Slowly \n               she moves along the side wall, past a number of highbacked \n               booths.\n\n               HER POV\n\n               Sitting on one of the funky old leather seats in a booth are \n               a pair of RED HIGH HEELED SHOES (the same pair worn earlier \n               by the Pretty Teenage Girl). The Waitress glances nervously \n               about the interior. No one in sight.\n\n               AT THE BOOTH\n\n               She reaches down slowly and picks up the pair of shoes. Looks \n               at them closely. Stares at the inside lining. Then suddenly \n               out of the quiet... a voice.\n\n                                     EARLY\n                         ...Size 6.\n\n               The Waitress spins a startled look to the booth beyond hers! \n               Early leans out from behind the highback partition.\n\n                                     EARLY\n                         That's right ain't it, size 6?\n\n               The Waitress... smiles, nods shyly.\n\n                                     EARLY\n                         Happy birthday Adele.\n\n                                     ADELE\n                         Early, you are so sweet.\n\n               This is ADELE CORNERS. She's 17, pretty, uneducated and \n               Early's girlfriend. She steps over to him, gives him a kiss, \n               then sits down on the seat across from him. She starts to \n               try on her new shoes.\n\n                                     ADELE\n                         I feel kind of like the wizard of \n                         oz, you know when she gets the red \n                         shoes.\n\n                                     EARLY\n                         Well Dorothy, why don't you hand me \n                         that chili there.\n\n               She passes the bag to Early. He digs in. Between bites, he \n               glances over to Adele who's enthusiastically pulling on the \n               new shoes.\n\n               INT. BRIAN AND CARRIE'S LOFT APARTMENT - LATER THAT NIGHT\n\n               A door swings open spilling light into a darkened room. Brian \n               and Carrie, a little drunk, return home from the party.\n\n               Their apartment is in an old converted industrial building \n               in a funky low rent part of town.\n\n               Brian walks ahead, Carrie trails behind him, peeling off her \n               clothes. She begins unzipping her dress, unnoticed by Brian.\n\n                                     BRIAN\n                         Tonight turned out to be pretty \n                         interesting.\n\n                                     CARRIE\n                         The party?\n\n               She grabs a leather cap that sits on a chair.\n\n                                     BRIAN\n                         The warehouse. I'm not that drunk.\n\n                                     CARRIE\n                         It was definitely the high point of \n                         the evening.\n\n               Carrie's dress falls to the floor.\n\n                                     BRIAN\n                              (getting excited)\n                         Just being there where it really \n                         happened. It was different... more \n                         visceral.\n\n                                     CARRIE\n                         Mmm... I love it when you talk like \n                         that.\n\n               Brian is at the foot of the bed, he turns to see... Carrie \n               has transformed. She has stripped down to her black bra and \n               panties, fishnet stockings, a nightporter style leather cap. \n               A surprised Brian stands there a moment. Looking at Carrie. \n               She looks great.\n\n               OMITTED\n\n               Carrie pushes Brian back onto the bed.\n\n               OMITTED\n\n               Carrie climbs on top of him. She kisses his neck. Slowly \n               starts working her lips across his chest and down his stomach.\n\n               EXT. EARLY'S TRAILER - MORNING\n\n               A solitary trailer sits alongside a run down house.\n\n               INT. EARLY'S TRAILER - MORNING\n\n               Through the soot tinged atmosphere, sunlight filters in past \n               the curtained windows. Early is lying face down in bed, his \n               right arm extended over the side. Adele is in the kitchen \n               half dressed, and unsuccessfully attempting to iron one of \n               Early's shirts. She realizes the iron is out of water, she \n               sets it down and steps to the sink and fills a glass with \n               water. As she does she glances at a cactus on the counter.\n\n               OMITTED\n\n                                     ADELE\n                         You thirsty Lucy?\n\n               OMITTED\n\n               She waters her small cactus (Lucy).\n\n                                     ADELE\n                         Bet that feels good, don't it?\n\n               NEW ANGLE - THE REFRIGERATOR\n\n               Adele smiles then notices that a photo held to the fridge by \n               a decorative magnet has fallen to the floor. She picks it \n               up.\n\n                                     ADELE\n                         Now if that ain't Momma's little \n                         angel.\n\n               Adele puts it back onto the fridge. It is a photo of a young \n               Early with his mother. In the photo Early appears to be about \n               ten or eleven. he stands next to his mother. Her arm is draped \n               over his shoulders, she is holding a drink. A cigarette butt \n               dangles between her fingers. Nearby a portable radio is tuned \n               to music, when the local radio jingle comes on and segues to \n               the news.\n\n               NEW ANGLE ON EARLY\n\n               A handkerchief bandana is tied around his head and over his \n               eyes.\n\n               The NEWSCASTER'S voice gets louder.\n\n                                     NEWSCASTER (O.S.)\n                         ...two more victims last night, when \n                         a twenty pound rock smashed through \n                         the windshield of their car...\n\n               CLOSER - EARLY'S FACE\n\n               Slowly he reaches to his face and lifts the bandana up off \n               one eye. Even closer on his left eyelid. It flutters... pops \n               open and blinks. Now... his eyeball stares right at us. The \n               pitch black pupil contracts in the morning light. The \n               newscaster's voice continues to amplify...\n\n                                     NEWSCASTER\n                         This was the third such attack in \n                         the past month and while an extensive \n                         police operation is underway... no \n                         arrests have yet been made.\n\n               The newscaster's voice quickly fades away. Early calmly closes \n               his eyes and drifts back to sleep.\n\n               EXT. EARLY'S TRAILER - LATE MORNING\n\n               Early emerges from the trailer drinking a bottle of beer. He \n               looks around the yard, it's full of various kinds of useless \n               junk. He walks over to his car. Adele appears in the doorway \n               of the trailer in her bathrobe.\n\n                                     ADELE\n                         Early...\n\n               She glances around to make certain that no one's looking, \n               then 'flashes' her body to Early with a giggle.\n\n                                     ADELE\n                         Have a good one.\n\n               Early smiles. Adele turns back into the trailer then, \n               remembers...\n\n                                     ADELE\n                         Oh... I forgot to tell you, Mr. \n                         Diebold was by again yesterday.\n\n               Early looks at the run down house next door where Diebold \n               lives. A beat up red pick-up is parked in front.\n\n                                     ADELE\n                         He said, if he ain't got the rest of \n                         his money by the end of the month, \n                         he's gonna \"kick us the...\n                              (spells the word fuck \n                              to avoid saying it)\n                         F-U-C-K outta here.\"\n\n               Early works his jaw, thinking.\n\n                                     EARLY\n                         He said that, huh? Cursed in front \n                         of you?\n\n               Adele nods.\n\n                                     ADELE\n                         You gonna talk to him?\n\n               Early gets in his car.\n\n                                     EARLY\n                         If he comes back, don't answer the \n                         door.\n\n               Early revs the raspy engine.\n\n                                     ADELE\n                         Suppose he hears me inside?\n\n               Adele's words are unheard as Early pulls away flinging his \n               beer bottle at a couple of chained PITBULLS in Diebold's \n               front yard.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               INT. BRIAN AND CARRIE'S LOFT - AFTERNOON\n\n               Brian enters the darkened loft interior.\n\n                                     BRIAN\n                         I picked up some Chinese. Did you \n                         hear from the gallery?\n\n               Brian turns the corner, he's immediately greeted by a series \n               of erotic images being projected on the far wall. They are \n               slides of Carrie's photographic work. In regard to the nature \n               and content of Carrie's photographic work, her photographs \n               address the sexual collision of opposites. \"What if's.\" The \n               subjects of her photographs are hypothetical and highly \n               unlikely partners. Studies in contract. Moments of passion.\n\n                                     BRIAN\n                              (tentative)\n                         You got your slides back.\n\n               From across the room, he hears Carrie's disembodied voice. \n               He drifts toward the couch.\n\n                                     CARRIE\n                         Yeah, same old shit. Too graphic... \n                         not suitable for mass consumption... \n                         one of those... I forget. Who cares.\n\n               Brian finds her slumped down on the couch. He sits down. \n               She's got a drink in her hand. A bottle on her lap. She \n               continues to click through the slides. As she rambles on, \n               it's obvious that she's definitely under the influence of \n               something 90 proof.\n\n                                     CARRIE\n                         Christ Brian I'm dying here... you \n                         are too, you just don't know it yet. \n                         You're too busy working on that damned \n                         thesis... And, thing is... when you \n                         finally do finish it, it's just gonna \n                         get filed away on some shelf at the \n                         University Library... then what?\n\n               Brian can see she's upset. Drowsy from the booze. He just \n               watches her. Listens. Her words linger in his head.\n\n                                     CARRIE\n                              (continues)\n                         I thought you wanted to be a writer.\n\n                                     BRIAN\n                              (quietly)\n                         ...I do.\n\n                                     CARRIE\n                         Then you can write anywhere. Let's \n                         get out of here, while we still can.\n\n                                     BRIAN\n                         Carrie, come on... we can leave \n                         anytime we...\n\n                                     CARRIE\n                         No we can't. We can never leave once \n                         you start talking about tenure... \n                         and vacation pay... and parking \n                         privileges and... oh shit! let's \n                         just go to California now, right \n                         now, before it's too late.\n\n                                     BRIAN\n                         ...just like that?\n\n                                     CARRIE\n                         Just like that. Load up the Lincoln... \n                         point it West... stop when we hit \n                         the fucking ocean.\n\n               The bold graphic sexual photographs of Carrie's continue to \n               accentuate her comments.\n\n                                     CARRIE\n                         That's half the kick anyway. Doing \n                         something you've never done before. \n                         Experiencing something... different. \n                         Something... unpredictable.\n\n               Brian notices an envelope on the floor nearby. He picks it \n               up. Opens it. Inside, he finds the photographs Carrie took \n               at the warehouse. Interested, he shuffles through them. He \n               becomes more and more intrigued with what he sees.\n\n                                     BRIAN\n                         ...These are great.\n\n               He glances over to Carrie... she's fallen asleep. He reaches \n               over and quietly pulls the drink glass from her hand.\n\n               EXT. EARLY'S TRAILER - LATE AFTERNOON\n\n               Early's Grand Prix has a head of steam up as it tears across \n               the drive and hangs a hard right into his parking space next \n               to the trailer. Suddenly, Early hits the brakes hard! Another \n               car is parked there.\n\n               INT. EARLY'S TRAILER\n\n               Early spills through the doorway.\n\n                                     EARLY\n                         Adele, who's car's that out...\n\n               Early spots his PAROLE OFFICER standing in the bedroom area \n               snooping around. He has a prosthetic hand which he uses to \n               search through Early's things.\n\n                                     PAROLE OFFICER\n                         She's not here.\n\n               The Parole Officer hiccups throughout the scene.\n\n                                     EARLY\n                         What are you doin' here? I ain't \n                         supposed to be at the Parole Office \n                         'til tomorrow, two o'clock.\n\n               Early notices the man looking through some of his letters \n               and papers.\n\n                                     PAROLE OFFICER\n                         Social call.\n\n               The Parole Officer opens one of the closet doors, pilfers \n               through things inside, as if searching for something. Early \n               is getting pissed off but says nothing.\n\n                                     PAROLE OFFICER\n                         You're supposed to call me when you \n                         lose your job Early. I stopped by \n                         the mirror factory today, you left \n                         quite a mess behind there.\n\n                                     EARLY\n                         Wasn't my fault...\n\n               He lifts his crudely bandaged middle finger.\n\n                                     EARLY\n                         ...It was dangerous there and they \n                         treated me like shit.\n\n               Parole Officer steps over to the refrigerator, opens it, \n               snoops around inside.\n\n                                     PAROLE OFFICER\n                              (swallows a hiccup)\n                         Yeah... Well you never have been \n                         'treated right'... Have you?\n                              (hiccup)\n                         Your father was pickin' on you when \n                         he threw you out of the house for \n                         stealing the tires off his truck. \n                         The Marines misunderstood you when \n                         they gave you that dishonorable \n                         discharge.\n\n               He finishes with the refrigerator and continues his search \n               through the drawers and cabinets of the trailer.\n\n                                     PAROLE OFFICER\n                              (hiccup)\n                         ...The police were way out of line \n                         when they stopped you from beating \n                         that bartender half to death. And no \n                         doubt God'll be pickin' on you on \n                         Judgement Day...\n\n                                     EARLY\n                         I ain't got nothing against God. \n                         It's the people he let come into the \n                         world... lot of them should have \n                         been stopped at the door. What are \n                         you looking for?\n\n               The Parole Officer ignores the question. He steps up to a \n               sink overflowing with dirty dishes.\n\n                                     PAROLE OFFICER\n                         That girlfriend of yours ain't much \n                         for housekeeping, is she.\n\n               Early dismisses the place with a glance.\n\n                                     EARLY\n                         I'm thinking about moving...\n\n               Early opens the refrigerator, grabs a bottle of beer.\n\n                                     EARLY\n                         Maybe down to Texas... Probably get \n                         some work on them offshore oil rigs. \n                         Hear the pay's good... hell, the \n                         weather's got to be better'n here.\n\n               Early sits down at the table. The Parole Officer steps over \n               to him.\n\n                                     PAROLE OFFICER\n                         What are you talking about? You know \n                         you can't leave the state.\n                              (hiccup)\n                         What you can do is get a job.\n\n               The Parole Officer pulls a slip of paper from his shirt \n               pocket, sets it on the table.\n\n                                     PAROLE OFFICER\n                         You be at this personnel office, \n                         Friday, three o'clock sharp.\n\n                                     EARLY\n                         What is it?\n\n                                     PAROLE OFFICER\n                         ...Janitor's job.\n\n                                     EARLY\n                         Oh man... come on, I don't want no \n                         janitor job.\n\n               Early lifts his beer for another drink. The Parole Officer's \n               prosthetic hand snaps tight around the neck of the beer \n               bottle, just inches from Early's lips.\n\n                                     PAROLE OFFICER\n                         Hey, I don't give two shits about \n                         what you want or don't want... I'm \n                         telling you to be there Friday, three \n                         o'clock sharp or the sheriff will be \n                         here for dinner. You understand?\n\n               With that Early looks up at the man, almost defiantly, then \n               stands up. The Parole Officer hiccups again. Early stares at \n               him for a moment.\n\n                                     EARLY\n                         You oughta think about putting a bag \n                         over your head... Might cure them \n                         hiccups.\n\n               The Parole Officer shakes his head in disgust and walks out \n               of the trailer to his car.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               BRIAN'S DESK IN ANOTHER PART OF LOFT APARTMENT - NIGHT\n\n               Brian's in the midst of working his way through pages and \n               pages of thesis notes scattered atop his desk. Using \n               chopsticks he shovels Chinese straight out of the carton as \n               he studies Carrie's warehouse photographs.\n\n               CARRIE'S POV\n\n               As we approach Brian from behind, moving closer, closer.\n\n               NEW ANGLE - BRIAN'S DESK\n\n               Carrie steps up behind him. She's rubbing her eyes, having \n               just awakened. A hangover beckons. Brian notices her.\n\n                                     BRIAN\n                         Hey. I didn't have the heart to wake \n                         you.\n\n                                     CARRIE\n                         Thanks. What are you doing?\n\n                                     BRIAN\n                         Well, I sat down with my tapes and \n                         your photographs, which are great by \n                         the way... and I started writing.\n\n               Carrie grabs his container of Chinese and takes a few bites. \n               Listens.\n\n                                     CARRIE\n                         So how's it going?\n\n                                     BRIAN\n                         ...I think it's the best stuff I've \n                         done.\n\n               Carrie glances over his shoulder at his writing.\n\n                                     BRIAN\n                         ...and I think I know why.\n\n                                     CARRIE\n                         Why?\n\n                                     BRIAN\n                         Because I was there. And for a moment \n                         that night I understood how she came \n                         to pull the trigger.\n\n                                     CARRIE\n                              (sarcastic)\n                         This mean your finally going to finish \n                         your thesis?\n\n                                     BRIAN\n                         Look, fuck the thesis. I think there's \n                         a book here. Your photographs and my \n                         research, together.\n\n                                     CARRIE\n                         A book on the warehouse murders?\n\n                                     BRIAN\n                         A book on some of the most infamous \n                         murderers in America. I want to go \n                         to where they lived and where they \n                         killed and I want you to photograph \n                         it.\n\n               Brian reaches down to the floor and pulls a large map of the \n               United States up and lays it out on his desk. He traces a \n               route West. Along the way, specific locations have been \n               circled.\n\n                                     BRIAN\n                         What I'm thinking is, we can drop \n                         down through Tennessee, across \n                         Arkansas and into Texas, from there \n                         it's a straight shot into California.\n                              (pause)\n                         \"We don't stop... until we hit the \n                         fucking ocean.\"\n\n               OMITTED\n\n                                     CARRIE\n                         It's about fucking time, Kessler! \n                         I'd just about given up on you.\n\n                                     BRIAN\n                         We don't have enough money, but we'll \n                         figure something out.\n\n               Carrie steps up to Brian.\n\n                                     BRIAN\n                         ...It's either the best idea I've \n                         had in a long time... or there's way \n                         too much MSG in this stuff.\n\n               Brian looks at the container of Chinese in his hand. Carrie \n               takes it from him, sets it down on the road map. Kisses him.\n\n               EXT. EARLY'S TRAILER - DAWN\n\n               Early exits the trailer and climbs into his Grand Prix.\n\n               INT. GRAND PRIX\n\n               Early tries to get the engine to tick over. Then... He sees \n               JOHN DIEBOLD, his landlord, emerge from his house and begin \n               lumbering toward the Grand Prix. The two panting ugly-ass \n               pitbulls trot alongside their master.\n\n                                     DIEBOLD\n                              (shouts)\n                         Hold on a minute there boy!\n\n                                     EARLY\n                         Shit!\n\n               Early tries the engine again. Still won't start. Diebold, \n               getting closer. The dogs are barking.\n\n                                     DIEBOLD\n                         Goddamit, you're gonna settle up \n                         that rent here and now.\n\n               Hurriedly, Early tries the engine one more time. It starts. \n               Grinning from ear to ear, Early pulls away before Diebold \n               and his dogs reach him.\n\n               Pissed, Diebold grabs a rock and hurls it, hitting Early's \n               car.\n\n               The car stops, dead in its tracks.\n\n                                     DIEBOLD\n                         I've had it with your bullshit boy. \n                         I want my money.\n\n               INT. GRAND PRIX\n\n               Early looks in the rear-view mirror and sees... Diebold \n               standing there confrontational.\n\n               Early throws the gearshift into reverse...\n\n               EXT. EARLY'S TRAILER\n\n               Tires screeching, the car surges toward Diebold and the dogs. \n               Scared shitless... Diebold begins back peddling. Confused, \n               the pitbulls bark, then follow suit.\n\n               Early laughs as he stalks Diebold.\n\n               Diebold jumps out of the way of the Grand Prix just as it \n               pulverizes his portable barbecue.\n\n               Early shifts it into drive and barrels out of the drive.\n\n               NEW ANGLE - DIEBOLD\n\n               As soon as the Grand Prix is out of sight...\n\n                                     DIEBOLD\n                              (hollering)\n                         You sonofabitch! Come back here!\n\n               Furious, he turns to find Adele staring at him from the window \n               of her trailer.\n\n                                     DIEBOLD\n                         That's it! You tell him... I want \n                         you both the fuck out of here by \n                         Sunday or I'm gonna call the Police.\n\n               Adele starts laughing, she tries to hide it with her hand.\n\n                                     DIEBOLD\n                         ...You won't be laughing come Sunday \n                         little girl.\n\n               Muttering to himself, he turns back toward his house. He \n               then notices what Adele is laughing at. One pitbull is trying \n               to hump the other.\n\n                                     DIEBOLD\n                         Elvis! Get the fuck off him!\n\n               NEW ANGLE - ADELE\n\n               Peering out at him from the trailer window laughing at the \n               dogs.\n\n               EXT. PARKING LOT - UNIVERSITY\n\n               Brian pulls up in his BLACK '62 LINCOLN CONTINENTAL. The \n               suicide doors and leather interior have seen better days. \n               Brian locks his car and walks into the building.\n\n               INT. LOBBY OF THE ADMINISTRATION BUILDING - AFTERNOON\n\n               Brian steps up to a large bulletin board. He sees several \n               'Ride-Share' notes to various cities on the board. He pins a \n               Ride-Share note onto the board. We see the note is headlined \n               in red - \"CALIFORNIA\"\n\n                                     CAROL\n                         You know, they say one of these \n                         days...\n\n               Brian glances over his shoulder.\n\n                                     BRIAN\n                              (sarcastic)\n                         ...the whole thing's going to slide \n                         into the ocean... Yeah, I know.\n\n               Carol peers over Brian's shoulder and reads the note.\n\n                                     CAROL\n                         \"Looking for someone to take turns \n                         at the wheel and share expenses... \n                         on a week long cross country blue-\n                         highways tour of historic murder \n                         sites...\"\n                              (beat)\n                         You gotta be kidding. Who in their \n                         right mind would want to do that?\n\n                                     BRIAN\n                         ...I would.\n\n               Brian smiles at her and walks away.\n\n                                     CAROL\n                              (watching Brian walk \n                              away)\n                         Like I said...\n\n               She shakes her head.\n\n                                     EARLY\n                         Where's the personnel office at?\n\n               Carol turns to see Early.\n\n                                     RITA\n                              (points down the hall)\n                         First door on the left.\n\n               She walks away. Early's eye catches the bulletin board, he \n               sees in bold red marker - \"CALIFORNIA.\"\n\n               EXT. EARLY'S TRAILER - LATE THAT NIGHT\n\n               Adele steps out of the trailer.\n\n                                     ADELE\n                         Early?\n\n               She walks carefully around the junk piles. It's dark; hard \n               to see. She comes to the edge of a deep dark hole and peers \n               in... She can't see anything but hears the rustling of a \n               shovel digging.\n\n                                     ADELE\n                         Early? You down there?\n\n               The sound of digging stops.\n\n                                     EARLY\n                              (from inside the hole)\n                         What's up Adele? Dinner ready?\n\n                                     ADELE\n                         Almost.\n\n               After a moment's hesitation, Early resumes his digging.\n\n                                     ADELE\n                         Early...\n\n               The digging stops again.\n\n                                     ADELE\n                         Tell me more about California.\n\n               The moonlight illuminates his face when he looks up at her.\n\n                                     EARLY\n                         Well... for one thing... They think \n                         faster out there, on account of all \n                         that warm weather they got; cold \n                         weather makes people stupid, that's \n                         a fact.\n\n                                     ADELE\n                         I guess that'd explain why there's \n                         so many stupid people around here.\n\n                                     EARLY\n                         Yeah, and in California you never \n                         have to buy fruit 'cause it's all on \n                         the trees everywhere you turn...\n                              (beat)\n                         ...and, 'course there ain't no speed \n                         limit out there, and all drugs are \n                         legal... And I heard your first \n                         month's rent is free; state law. I \n                         figure 'til we get settled we can \n                         just move around month to month...\n\n                                     ADELE\n                         What'll we do out there?\n\n                                     EARLY\n                         Well... the very first thing we're \n                         gonna do... is get us a couple of \n                         six packs of Lucky Lager and climb \n                         up on toppa' that famous Hollywood \n                         sign and howl at the moon...\n\n               Early lets out a playful howl, as Adele looks up over her \n               shoulder at the moon.\n\n                                     ADELE\n                         You know... I read once... Ain't \n                         nothin' on that big old moon 'cept \n                         some old golf balls those astronauts \n                         left behind.\n\n                                     EARLY\n                         Bull. That ain't right... Government \n                         sends people there all the time, \n                         just don't want us to know about it.\n\n               Adele smiles and begins walking back to the trailer.\n\n                                     ADELE\n                         Don't be long now, dinner's 'bout \n                         ready.\n\n                                     EARLY\n                         I heard that.\n\n               After a moment, Early climbs out of the hole and stands in \n               the moonlight for a moment. We see that he's completely naked \n               except for a pair of high top steel toed work boots. Early \n               gazes up into the night sky, looking at the cold white moon.\n\n               EXT. BRIAN AND CARRIE'S LOFT - DAWN\n\n               Brian exits loft carrying two bags. Carrie is also carrying \n               a bag, and smoking a cigarette, as they walk to the car.\n\n                                     CARRIE\n                         What did he sound like on the phone?\n\n               OMITTED\n\n                                     BRIAN\n                         Real polite. Kept calling me 'sir.'\n\n               Brian throws the bags in the open trunk with the other bags.\n\n                                     BRIAN\n                              (grins)\n                         I like that.\n\n                                     CARRIE\n                         I still think we should have met \n                         them first.\n\n                                     BRIAN\n                         Beggars can't be choosers. They were \n                         the only ones who answered the ride \n                         share note, remember?\n\n               Carrie bows her head and folds her hands in mock prayer.\n\n                                     CARRIE\n                         Please God, we're gonna be stuck \n                         with these people for a week, don't \n                         let them be as boring as Brian's \n                         friends. Anything... but that.\n\n               Brian throws a needling glance to Carrie and slams the car \n               hood shut. They both get into the car, Brian behind the wheel.\n\n               INT. LINCOLN\n\n                                     BRIAN\n                         Oh, yeah... He had a real thick accent \n                         right outta \"Deliverance.\"\n                              (quotes from the movie)\n                         \"Still? Who said anything about a \n                         still? Get ya ass up in them woods!\"\n\n                                     CARRIE\n                         Funny, very funny.\n\n               Brian starts the car. It backfires loudly startling Carrie. \n               Brian laughs.\n\n                                     BRIAN\n                              (quoting again)\n                         \"Aintry? This river don't go to \n                         Aintry.\"\n\n               EXT. LINCOLN ON STREET\n\n               The engine revs again and the Lincoln pulls away down the \n               street.\n\n               EXT. BUS STATION - DAWN\n\n               PAN UP from Adele's new red high-heeled shoes. We hear Adele \n               speaking with an unfamiliar tone of authority to her voice.\n\n                                     ADELE\n                         We shouldn't be doin' this, Early. \n                         You leavin' the state, ridin' around \n                         with strangers... besides, what kinda \n                         people would want to stop at places \n                         where other people was murdered.\n\n               The camera slowly reveals Adele... and the fact that she is \n               alone as she voices her concerns. Then from behind her Early \n               approaches. Just in time to hear...\n\n                                     ADELE\n                         What if they're dangerous?\n\n                                     EARLY\n                         They ain't dangerous Adele. They're \n                         writers.\n\n               Startled, Adele drops her shoulder bag. It lands on top of a \n               couple of cardboard boxes and a beat up old duffle bag -- \n               all their possessions. A few personal items spill out of it.\n\n                                     ADELE\n                         Early Grayce!\n\n               She kneels down to pick things up.\n\n                                     ADELE\n                              (changes subject)\n                         Did you settle things with Mr. \n                         Diebold?\n\n                                     EARLY\n                         Yeah I left him with the car... We're \n                         all squared up now.\n\n               EARLY'S POV\n\n               As Adele picks up her spilled personal possessions, Early \n               notices her prized cactus in the bag.\n\n                                     EARLY\n                         What's this?\n\n               He angrily reaches in and grabs it.\n\n                                     ADELE\n                         Early!\n\n               She reaches for the cactus but misses.\n\n                                     EARLY\n                         What kind of a person would carry a \n                         cactus in her purse!\n\n               Adele bites her lip almost crying. Suddenly, Early looks \n               past Adele to see something, Adele turns too.\n\n               NEW ANGLE\n\n               The Lincoln comes gliding into view.\n\n               INT. LINCOLN - PULLS INTO BUS STATION - DAWN\n\n               Through the windshield we see Early... Adele by his side.\n\n                                     CARRIE\n                         You've got to be kidding me, they \n                         look like Okies!\n\n               Brian honks the horn, Early waves back.\n\n                                     CARRIE\n                         Jesus... They've probably got five \n                         bucks between them. Turn around.\n\n                                     BRIAN\n                         Lighten up...\n\n               ON EARLY AND ADELE\n\n                                     ADELE\n                         Geez, they look kinda weird.\n\n                                     EARLY\n                         You just smile, let me do all the \n                         talking.\n\n                                     ADELE\n                         How many times you gonna tell me \n                         that?\n\n                                     EARLY\n                              (smiling at Brian)\n                         As many times as it takes.\n\n               EXT. BUS STATION\n\n               Brian stops the Lincoln and gets out. He approaches Early \n               and shakes his hand, then Adele's.\n\n                                     BRIAN\n                         Hi I'm Brian... Early, and you must \n                         be Adele.\n\n               An awkward moment as everyone just stands there... until \n               Brian reaches for Adele's bag.\n\n                                     BRIAN\n                         Let me help you.\n\n               Brian picks up her bag and carries it to the Lincoln. Adele \n               is instantly won over by the gesture -- Early leery of it.\n\n               INT. LINCOLN\n\n               Carrie watches as Brian and Early carry their things to the \n               trunk. Carrie leans forward and sets the trip odometer to \n               zero. When she sits back up, Adele is standing at her window.\n\n                                     ADELE\n                         Hi, I'm Adele.\n\n                                     CARRIE\n                              (reserved)\n                         Carrie.\n\n               She turns away from the window...\n\n                                     ADELE\n                              (shyly)\n                         I like your hair.\n\n               Carrie turns back, rolls down window...\n\n                                     CARRIE\n                         ...Pardon?\n\n                                     ADELE\n                         ...I said, I like your hair.\n\n                                     CARRIE\n                         ...Thank you.\n\n               She turns and sees Early reflected in the side mirror watching \n               her. He grins at her, Carrie looks away.\n\n               NEW ANGLE: FROM INSIDE THE TRUNK OF THE LINCOLN\n\n               Brian crams the last of the bags in, as Early watches.\n\n                                     BRIAN\n                         Tight fit.\n\n                                     EARLY\n                         Best kind.\n\n               Brian looks to him, Early grins and winks. Brian slams the \n               Lincoln trunk lid shut.\n\n               SCREEN TO BLACK\n\n               EXT. EARLY'S BURNING TRAILER - DAWN\n\n               From the blackness... The camera rises from a pile of rubble. \n               As it ascends we reveal Diebold's pitbulls howling and digging \n               at a mound of fresh earth where Early's hole used to be.\n\n               The crackling flames of a nearby fire illuminate the scene. \n               Deep in the distance, the wail of approaching sirens.\n\n               ANOTHER ANGLE\n\n               Reveal that it's Early's trailer and car that are on fire.\n\n               INT. TRAILER\n\n               Flames consume the magazine photos of Elvis and Priscilla, \n               Farrah and Ryan, Early and Adele. Along with them, the black \n               and white photo of young Early and his mother.\n\n               EXT. BUS STATION - DAWN - OVERHEAD ANGLE\n\n               On the Lincoln as it exits the Bus Station. The camera \n               descends toward a lone trash can, to find there, lying amidst \n               the debris inside... Adele's cactus.\n\n               EXT. CITY STREETS - MORNING\n\n               The Lincoln passes through on its way out of town.\n\n               INT. MOVING LINCOLN - MORNING\n\n               Brian behind the wheel, Carrie riding shotgun. Early and \n               Adele are sitting in the back seat. An awkward silence \n               prevails. Brian clears his throat.\n\n                                     BRIAN\n                         Uh, we can stop somewhere if you and \n                         Adele haven't had time for breakfast, \n                         Early.\n\n                                     EARLY\n                         Well, it's like this, Mr. Kessler.\n\n                                     BRIAN\n                         Brian.\n\n                                     EARLY\n                         Well, it's like this, Bri'. I don't \n                         eat much in the mornin', never have. \n                         Maybe a beer once in a while; Lucky \n                         Lager's my favorite.\n\n               Brian raises his eyebrow a tad, but is not really curious \n               about it.\n\n                                     ADELE\n                         It's because of what he read in a \n                         book once... That folks needin' \n                         breakfast is a myth, or whatever, \n                         put out by those cereal people.\n\n               A glance passes between Brian and Carrie. Is she for real?\n\n               CARRIE'S POV - IN VANITY MIRROR\n\n               Early motions Adele not to talk so much.\n\n               NEW ANGLE\n\n                                     BRIAN\n                         So what do you do Early?\n\n                                     EARLY\n                         Oh... I do some work up at the Merrick \n                         Mirror factory, or I used to...\n\n                                     ADELE\n                         One night we figured out how much \n                         bad luck he must have comin' from \n                         all them mirrors he broke...\n                              (beat)\n                         Four hundred and ninety four years \n                         to work it all off... After he dies, \n                         he'll have to keep coming back to \n                         earth over and over and over...\n\n                                     CARRIE\n                         Karma.\n\n               Adele and early show no sign of understanding the word.\n\n                                     ADELE\n                         What?\n\n                                     CARRIE\n                         Karma...\n                              (beat)\n                         You know, if you do something bad to \n                         somebody fate will pay you back by \n                         something bad happening to you.\n\n                                     ADELE\n                         That French ain't it?\n\n               Carrie glances at the odometer on the dash... THE FIRST MILE \n               clicks over.\n\n               EXT. LINCOLN - OUTSKIRTS OF THE CITY\n\n               Everyone takes a last look at the familiar countryside. Carrie \n               is snapping photos of the twisting concrete overpasses and \n               the gloomy grey sky beyond.\n\n               INT. LINCOLN\n\n               Adele watches Carrie, intrigued by the obvious skill Carrie \n               shows with the camera. Brian glances into the rear-view mirror \n               at Adele.\n\n                                     BRIAN\n                         So Adele, did Early happen to mention \n                         the places we'll be stopping at?\n\n               ON ADELE'S REFLECTION IN MIRROR... then Early leans in front \n               of her.\n\n                                     EARLY\n                         Yeah Bri' I did.\n\n               Adele leans against Carrie's front seat.\n\n                                     ADELE\n                              (to Carrie)\n                         Are you takin' the pictures?\n\n                                     CARRIE\n                              (surprised)\n                         ...Yeah.\n\n                                     ADELE\n                         Is it hard to learn?\n\n                                     CARRIE\n                         Not really.\n\n               Early pulls Adele back toward the back seat.\n\n                                     EARLY\n                              (to Brian)\n                         You gonna talk to the people who did \n                         those murders?\n\n                                     BRIAN\n                         That's a good idea. Unfortunately \n                         most of them have been executed.\n\n                                     EARLY\n                         ...Too bad.\n\n               EXT. LINCOLN\n\n               Lincoln drives off down the highway.\n\n               EXT. EARLY'S TRAILER - LATER\n\n               Police and Firemen sift through the smoking ruins of Early's \n               trailer. The Parole Officer pulls up in his car, he gets out \n               and approaches a Police Officer.\n\n                                     PAROLE OFFICER\n                         What happened?\n\n                                     POLICE OFFICER\n                         Who are you?\n\n                                     PAROLE OFFICER\n                         His Parole Officer.\n\n                                     POLICE OFFICER\n                         Right, I talked to you on the phone. \n                         They say it's a torch job, that sound \n                         like your boy?\n\n                                     PAROLE OFFICER\n                         Could be.\n\n                                     POLICE OFFICER\n                         Where would we find him?\n\n                                     PAROLE OFFICER\n                         Hell if I know, crazy son of a bitch \n                         said he was thinking of moving to \n                         Texas.\n\n                                     POLICE OFFICER\n                         Without his car?\n\n               We see the smoldering remains of Early's Grand Prix. In the \n               background Diebold's pitbulls are being dragged away by a \n               Dog Wrangler.\n\n                                     POLICE OFFICER\n                         What about the owner of the house...\n                              (reads from note pad)\n                         ...this John Diebold, any idea where \n                         he might be?\n\n                                     PAROLE OFFICER\n                         No, but I can tell you he's not gonna \n                         be too happy about this.\n\n               From inside Early's hole we hear a voice call out.\n\n                                     LABORER (O.S.)\n                         Jesus Christ!\n\n               Parole Officer and Police Officer turn back toward the \n               trailer, as people rush to the site.\n\n               NEW ANGLE - OVERHEAD\n\n               The camera aerials down past those gathering around the \n               freshly dug hole to... a Laborer standing at the bottom of \n               the pit. Alongside his shovel, we see that a man's arm has \n               been unearthed.\n\n               LOW ANGLE UP TO THE TOP OF THE HOLE\n\n               The Police and Parole Officer join several others standing \n               there.\n\n                                     PAROLE OFFICER\n                         ...Diebold?\n\n                                     POLICE OFFICER\n                         ...That'd be my guess.\n\n                                     PAROLE OFFICER\n                         Looks like somebody cut off his ring \n                         finger.\n\n                                     POLICE OFFICER\n                         Well now I'd say that's the least of \n                         Mr. Diebold's problems.\n\n               The two men look to one another... as others begin to unearth \n               the body.\n\n               EXT. MOVING LINCOLN DRIVING DOWN COUNTRY ROAD\n\n               Close up, Diebold's ring on a hand twisting open a bottle \n               cap. Pull back to reveal that it is Early as he opens a bottle \n               of Lucky Lager beer and takes a sip. On the back seat between \n               them sits a brown paper bag. Adele reaches into the bag and \n               pulls out a cheap pocket camera. Excitedly she rips open the \n               box and pulls out the camera. She leans over and kisses Early.\n\n                                     ADELE\n                         Thank you.\n\n               Early reaches in the bag and pulls out a small plastic bottle \n               of mineral water and an orange juice.\n\n                                     EARLY\n                         All right, who gets the...\n                              (can't pronounce name)\n                         ...water.\n\n               Carrie turns around, Early hands her the water. Early leans \n               forward and hands Brian the orange juice.\n\n                                     EARLY\n                         Here you go Bri'. Got a couple a \n                         bags of chips and some jerky, just \n                         holler if you want some.\n\n               Then Early reaches past Brian to the rear-view mirror and \n               hangs a plastic St. Christopher statue around it.\n\n                                     EARLY\n                         Can't hurt.\n\n                                     BRIAN\n                         How much do I owe you?\n\n                                     EARLY\n                         Forget it.\n\n               Adele struggles to understand the camera instructions on the \n               side of the box. She leans forward and shows Carrie her \n               camera.\n\n                                     ADELE\n                              (embarrassed)\n                         Guess I don't know the first thing \n                         about cameras.\n\n               Carrie deliberates her response for a moment, then...\n\n                                     CARRIE\n                         Well, the first thing... is you need \n                         film. Preferably black and white.\n\n               Carrie pulls a roll of film out of her bag and takes Adele's \n               camera to load.\n\n                                     ADELE\n                         You wouldn't have any color film, \n                         would ya?\n\n                                     CARRIE\n                         ...Yeah, sure.\n\n               She pulls a roll of color film out of her camera bag and \n               quickly snaps it into the camera.\n\n                                     ADELE\n                         I like things in color, pink, purple, \n                         and red. I dunno, black and white is \n                         kinda... boring.\n\n               Carrie points the camera at a smiling Adele and snaps the \n               first picture.\n\n                                     CARRIE\n                         You just aim and press the button.\n\n               Adele takes the camera.\n\n               INT. LINCOLN\n\n               Adele focuses her camera at the scenery out the side window \n               of the car.\n\n                                     ADELE\n                         Look, Pigeon Forge!\n\n               ADELE'S POV\n\n               Road sign to Pigeon Forge.\n\n               EXT. LINCOLN\n\n               Adele leans out the side rear window to get a better view.\n\n                                     ADELE\n                         I've heard of that! It's where Dolly \n                         Parton has her park. \"Dollywood\". I \n                         just think that's so clever. \n                         Hollywood. Dollywood. Get it?\n\n               With that, she plops back down into the back seat.\n\n               INT. LINCOLN\n\n                                     EARLY\n                              (under his breath)\n                         Shush, Adele.\n\n                                     ADELE\n                         Early, can we stop there... just for \n                         a little while.\n\n               EXT. HIGHWAY\n\n               As we see the car disappearing into the distance, we can \n               still hear Adele rambling on.\n\n                                     ADELE (O.S.)\n                         ...I've always wanted to go there... \n                         It could be such fun.\n\n                                                                  FADE OUT:\n\n               EXT. LARGE ISOLATED OLD FARM - AFTERNOON\n\n               The Lincoln approaches on a dirtroad and passes a mailbox \n               with the name \"BAXTER\" on it. The Lincoln turns into the \n               long driveway.\n\n               INT. LINCOLN - SAME TIME\n\n               Brian begins talking into a small portable tape recorder.\n\n                                     BRIAN\n                         The Novaks are all gone but the fence \n                         that Michael Zaruba was hired to put \n                         up is still here.\n\n               He glances to Carrie, who fires off several photos of the \n               fence and yard.\n\n               The Lincoln continues slowly down the long drive... Up ahead \n               through the windshield Brian sees a beautiful old farm house.\n\n                                     BRIAN\n                         The Novaks embraced the young drifter \n                         as one of their own.\n\n               EXT. LINCOLN\n\n               The Lincoln slows to a halt. Carrie and Brian exit the car \n               and begin walking toward the house. Early follows. Adele, \n               uncertain about what's transpiring, trails behind.\n\n                                     ADELE\n                         Hey you two.\n\n               Brian and Carrie turn to see... Adele training a camera on \n               them.\n\n                                     ADELE\n                         Give me a smile now.\n\n               Brian and Carrie look to one another then force a weak smile. \n               Early jumps in and throws a pair of devil's horns up behind \n               Brian's unsuspecting head as... the shutter clicks.\n\n               Brian and Carrie quickly turn their attention back on the \n               house.\n\n                                     BRIAN\n                              (continues into tape \n                              recorder)\n                         Neighbors said he was a quiet young \n                         man, who was often seen pushing the \n                         children on the swing set.\n\n               An unusual bird house and a tricycle sit in the front yard. \n               To the side of the house are the remains of an old swing \n               set. Carrie finds an interesting angle on the swing set, \n               with the house in the background, SNAP! She fires off a shot.\n\n                                     BRIAN\n                              (continuing)\n                         Everything was fine until the day \n                         the family ran out of work for \n                         Michael, and had to ask him to leave.\n\n               As Carrie frames up another shot, Early crosses in front of \n               her camera. Realizing he is in Carrie's photo he stops and \n               poses. Carrie looks to Brian.\n\n                                     BRIAN\n                         Sorry, Early... Could you step out \n                         the way, for a second?\n\n               Early is surprised that they don't want him in the photograph. \n               He wanders away from the front of the house. Meanwhile, Adele \n               photographs the moment.\n\n                                     BRIAN\n                         The first one to die was the nine \n                         year old daughter...\n\n               Just then... A NINE YEAR OLD GIRL comes running from around \n               the side of the house. She stops dead when she sees all of \n               them. Carrie snaps a final photo.\n\n                                     BRIAN\n                         Hello.\n\n               The little girl scans all their faces.\n\n                                     BRIAN\n                         ...My name's Brian, what's yours?\n\n               The little girl remains silent. Brian rolls a look to Carrie \n               then back to the little girl.\n\n                                     BRIAN\n                         ...Could I speak to your parents?\n\n               After an awkward pause, the little girl silently crosses the \n               yard to the porch and opens the front door.\n\n                                     GIRL\n                              (rudely)\n                         Pa! There's more of them.\n\n               EXT. REAR OF HOUSE - SAME TIME\n\n               Looking into the house through a kitchen window we can see \n               into the entrance hall and through to the open front door. \n               Brian waits outside on the porch, as the little girl enters \n               the house looking for her father. Inside the kitchen, right \n               next to the window, is a side table with a telephone and a \n               purse on it.\n\n               Suddenly... Early's reflection appears in the window; he has \n               obviously seen the purse.\n\n               AT THE FRONT DOOR\n\n               Brian motions for Carrie to join him.\n\n               AT THE SWING SET\n\n               Adele watches Brian and Carrie for a moment, then loses \n               interest. She stands on the seat of the swing and begins \n               swinging.\n\n               AT THE REAR OF THE HOUSE\n\n               Early tries to push up the kitchen window. It barely lifts \n               three inches before jamming. Through the room we see the \n               little girl and her father step to the front door.\n\n               EXT. FRONT DOOR\n\n               A MIDDLE AGED FARMER with tanned leathery skin. He is not \n               happy. Brian extends his hand...\n\n                                     BRIAN\n                              (friendly)\n                         Hi, my name is Brian Kessler.\n\n               The father says nothing and does not respond to the extended \n               hand. Brian retracts his hand.\n\n                                     BRIAN\n                              (continues -- less \n                              confident)\n                         I'm a writer, I'm working on a book \n                         about famous murderers.\n\n               AT THE SWING SET\n\n               Adele swings higher. Her summer dress ripples in the wind. A \n               smile on her face.\n\n               EXT. KITCHEN WINDOW\n\n               Early's entire arm is through the opening. His shoulder \n               presses against the window pane. But still he can't reach \n               the purse. So, he grabs the tablecloth and begins pulling it \n               toward him. The purse slides closer, inch by inch. All the \n               while, he keeps one eye on the Farmer across the room.\n\n               EARLY'S POV (ACROSS THE ROOM) The Farmer's back is turned to \n               the kitchen as he listens silently to Brian.\n\n                                     BRIAN\n                         ...I'm sure you're aware that this \n                         is the Novak house...\n\n               AT THE SWING SET\n\n               Adele swings even higher. She's lost in the moment. Euphoric.\n\n               EXT. FRONT DOOR\n\n                                     BRIAN\n                              (corrects himself)\n                         ...I mean, this was the Novak house...\n                              (pause)\n                         With your permission I'd like to \n                         come in and photograph...\n\n               Before Brian can finish, the man slams the door in his face.\n\n               INT. KITCHEN (ANGLE ON FARMER)\n\n               The Farmer turns away from the front door.\n\n                                     FARMER\n                              (muttering)\n                         Goddamned ghouls...\n\n               IN THE KITCHEN\n\n               We see that Early and the purse have gone.\n\n               EXT. FRONT DOOR\n\n               Brian is surprised. He just stands there a moment. He's not \n               sure whether to knock again.\n\n               EXT. SWING SET\n\n               The empty swing sways back and forth.\n\n               EXT. LINCOLN\n\n               Brian and Carrie walk back to the car.\n\n                                     BRIAN\n                              (upset)\n                         We could have been in and out of \n                         there in less than ten minutes...\n\n                                     CARRIE\n                         Hey, I got some great stuff... it's \n                         okay.\n\n               Brian continues on in a huff until Carrie breaks stride and \n               stops. She pulls him next to her.\n\n                                     CARRIE\n                         It's okay... okay?\n\n               Brian glances back at the house. She interrupts his glance, \n               kisses him.\n\n                                     BRIAN\n                              (continuing on the \n                              heel of the kiss)\n                         ...That house is part of American \n                         history now, whether he likes it or \n                         not.\n\n               They enter the car.\n\n                                     EARLY\n                         Forget about it Bri'. I wouldn't be \n                         surprised if that Karma thing don't \n                         come back and get him.\n\n               Carrie, surprised at Early's new found philosophical belief. \n               She looks into her side view mirror... And sees Early smiling \n               back at her. Carrie looks away...\n\n               CARRIE'S POV\n\n               Shifts from the mirror to the house in the background... as \n               the car pulls out of the driveway, the little girl watches \n               from her porch.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               EXT. - LINCOLN PULLS UP TO MOTEL AND PARKS.\n\n               INT. MOTEL RESTAURANT - NIGHT\n\n               A small roadside diner. A fair number of people inside having \n               dinner. Adele, Early, Carrie, and Brian are seated at one of \n               the tables.\n\n               AT THEIR TABLE\n\n               Carrie watches Early eat with a kind of horrible, rude \n               fascination. He has no table manners at all. He eats with \n               his elbows on the table, fork wedged in the fist of his right \n               hand. All the while, he chews with his mouth open. He's \n               serious about his \"eating.\"\n\n                                     BRIAN\n                              (studying his map)\n                         Well we've come three hundred miles \n                         so far. Not a bad day's haul.\n\n               Early doesn't bother to respond. He keeps eating.\n\n                                     BRIAN\n                         You got any family or friends in \n                         California, Early?\n\n               CU ANGLE ON EARLY\n\n               With a piece of bread he mops up the gravy on his plate.\n\n                                     EARLY\n                              (chewing)\n                         Nope... You?\n\n               ANGLE UNDER THE TABLE\n\n               Early's foot itches... He tries to scratch it but it doesn't \n               do any good.\n\n                                     BRIAN (O.S.)\n                         No.\n\n                                     ADELE (O.S.)\n                         Me neither. How 'bout you Carrie?\n\n                                     CARRIE (O.S.)\n                         No.\n\n               ANGLE - THE GROUP\n\n               As Brian folds up the map. Early takes off his boot, then \n               his well-worn sock. Carrie's look of disgust grows as Early \n               brings his foot up onto his lap and scratches it while he \n               eats. Carrie puts her fork down: dinner is over for her.\n\n                                     ADELE\n                         ...Well, least we got each other. \n                         That's somethin'.\n\n               OMITTED\n\n               OMITTED\n\n               Brian looks up, sees Carrie's expression... Then what's \n               causing it... Early mops up the last bit of food on his plate. \n               He notices Brian and Carrie staring at him and slowly puts \n               his foot back down on the floor -- then the sock.\n\n               Brian picks up the check to see the total... Starts pulling \n               his wallet out... Isn't quite sure how to bring up the tab \n               to Early.\n\n                                     EARLY\n                         Thanks Bri', I'll get the next one.\n                              (prompts Adele)\n                         Think it's time we hit the sack.\n\n               Early winks at Brian, Carrie catches the wink. Early and \n               Adele get up and head for the door. Adele waves goodnight.\n\n                                     ADELE\n                              (to Carrie)\n                         Sweet dreams.\n\n               INT. CARRIE AND BRIAN'S MOTEL ROOM - NIGHT\n\n               Close on Carrie, she is reflected in a mirror. Reveal, Carrie \n               wearing only a T-shirt is at the vanity angrily brushing her \n               teeth. In the bathroom next to her, a bath is running. In \n               the adjacent bedroom, Brian is in the bed working on his \n               notes.\n\n               INT. BATHROOM\n\n                                     CARRIE\n                              (spits out a mouthful \n                              of water)\n                         You mean because I object to having \n                         somebody take off their shoe and \n                         scratch their foot while I'm eating \n                         I'm prejudiced?\n\n               INT. BEDROOM - SAME TIME\n\n                                     BRIAN\n                              (reading notes)\n                         He can't help the way he was raised. \n                         I kinda feel sorry for him.\n\n               INT. BATHROOM\n\n               Carrie pauses in brushing her teeth.\n\n                                     CARRIE\n                         Feel sorry for him? Obviously you \n                         didn't get a whiff of that sock?\n\n                                     BRIAN (O.S.)\n                         Bitch, bitch, bitch!\n\n                                     CARRIE\n                              (under her breath)\n                         Up yours.\n\n                                     BRIAN\n                         I heard that.\n\n               INT. BATHROOM\n\n               Carrie finishes brushing her teeth. Secretively she gives \n               Brian the finger...\n\n                                     BRIAN (O.S.)\n                         ...heard that too.\n\n               Carrie glances at the bath water running in the tub. It's \n               rusty brown and disgusting. She pulls the plug on the bath \n               idea.\n\n               INT. EARLY AND ADELE'S MOTEL BATHROOM ROOM - SAME TIME\n\n               The tap is running at the sink as Early empties the stolen \n               purse. He adds the last few coins to a small pile of cash.\n\n                                     EARLY\n                         Can you believe thirty bucks for \n                         this room... for what? A lumpy \n                         mattress, that crummy TV and a \n                         crapper.\n\n                                     ADELE (O.S.)\n                         Early, sing me a song.\n\n               Early continues to sift through all the items from the purse.\n\n                                     EARLY\n                         Which one.\n\n               INT. EARLY AND ADELE'S MOTEL ROOM\n\n               Adele starts to sing a song.\n\n               OMITTED\n\n               Early start sing with her... As the song ends.\n\n                                     ADELE\n                              (laughs)\n                         Hey can we go to that Chinese \n                         restaurant when we get to Los Angeles? \n                         You know, to see all them famous \n                         footprints?\n\n               ON EARLY IN BATHROOM\n\n               Early reaches down into the bottom of the purse and pulls \n               out a pair of glistening stainless steel scissors.\n\n                                     EARLY\n                         Only if they let me put mine down \n                         too.\n\n               He stares at the scissors curiously, then switches off the \n               bathroom light.\n\n               DARKNESS\n\n                                     BRIAN (O.S.)\n                         Look Carrie, we're gonna be stuck \n                         with these people for a week...\n\n               Click, a light is turned on. Revealing...\n\n               INT. BRIAN AND CARRIE'S ROOM - SAME TIME\n\n               Brian has turned on the nightstand light. He and Carrie are \n               lying in bed.\n\n                                     BRIAN\n                         ...And all I'm saying is I think we \n                         ought to try and get along with them. \n                         That's all.\n\n                                     CARRIE\n                         You try, I'm gonna pretend they're \n                         with somebody else.\n\n                                     BRIAN\n                         Carrie.\n\n                                     CARRIE\n                         I don't want to talk about it.\n\n               Brian turns the light off. From the blackness...\n\n                                     CARRIE\n                         Pretty smooth how he stiffed us on \n                         dinner?\n\n               Brian switches the light back on.\n\n                                     BRIAN\n                         He didn't stiff us. He paid for the \n                         gas remember.\n\n               Silence... Brian reaches out for the light... when\n\n                                     CARRIE\n                         I'm telling you he's nearly broke \n                         and we're going to end up paying for \n                         those two.\n\n               Brian decides to leave the light on. He moves closer to \n               Carrie. He slides up against her backside. He reaches for \n               her under the sheets. Kisses her neck.\n\n                                     BRIAN\n                         You finished?\n\n               Carrie pushes her body up against his in response.\n\n                                     CARRIE\n                         ...Um, maybe... maybe not.\n\n               Brian's mouth moves down along her back. He slips beneath \n               the sheets. From the expression on her face, she obviously \n               approves... Yet she can't resist slipping in another remark...\n\n                                     CARRIE\n                         ...Um... Funky fucking sock.\n\n               Carrie rolls over on her back. Brian moves on top of her. \n               Kisses her stomach.\n\n                                     CARRIE\n                         ...and what's with that hair? Is \n                         that grease or motor oil or what?\n\n               Carrie reaches down and grabs two fists full of Brian's hair. \n               She pulls him to her. He slides up along her chest, kissing \n               her. Things heat up. She reaches out, grasps his arms. Pulls \n               him closer.\n\n                                     CARRIE\n                         ...you believe that tattoo? Looks \n                         like he had another girls name there \n                         and carved it out.\n\n               Brian bites at her neck. She stops talking. His sweating \n               shoulder presses against her face. She turns her head to \n               encourage him.\n\n               In the dresser mirror... she sees their shadowy reflections. \n               Their bodies atangle under the sheets.\n\n                                     CARRIE\n                         ...and that body odor.\n\n               Their reflection in the mirror intrigues her. Intoxicates \n               her. His aggression excites her. She pulls him into her. The \n               metal bedframe bangs against the motel wall repeatedly as \n               they make love.\n\n               Then slowly, the camera bisects the plaster and lumber divider \n               and emerges in the next room...\n\n               TO FIND\n\n               Early leaning quietly against the same wall. Listening to \n               them. As he does, he uses the scissors to cut through the \n               crusty bandage on his finger. Then, across the room he notices \n               Adele in bed asleep... the scissors stop.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               EXT. EARLY'S MOTEL ROOM - MORNING\n\n               Early exits his motel room, opens a bottle of Lucky Lager \n               against a soda dispenser, and walks over to the motel diner.\n\n               INT. MOTEL DINER\n\n               Early enters the diner drinking his morning beer. Adele is \n               not with him. He spots Brian and Carrie seated opposite one \n               another in one of the booths. He walks up to their table and \n               drops down uninvited on the seat next to Carrie.\n\n                                     BRIAN\n                         Morning...\n\n               Early lifts his beer bottle in salute.\n\n                                     EARLY\n                         Bri'.\n\n                                     CARRIE\n                         Where's Adele?\n\n                                     EARLY\n                         She wasn't feeling so good.\n\n               The WAITRESS arrives with a menu, offers it to Early.\n\n                                     WAITRESS\n                         Breakfast?\n\n                                     EARLY\n                              (burps)\n                         Nah... Don't eat breakfast. Never \n                         have.\n\n               The Waitress notices Early's bottle of beer.\n\n                                     WAITRESS\n                         Ah sir... sir.\n\n               She gets Early's attention.\n\n                                     WAITRESS\n                              (concerned)\n                         We ah... don't have a liquor license \n                         here. So I'm afraid...\n\n                                     EARLY\n                         Well don't be, I got plenty more \n                         where this one came from.\n\n               The Waitress gives him a curious look and walks away.\n\n               Just then, Brian look past Early... A surprised expression \n               crosses Brian's face. Early turns to see... Adele approaching \n               the table. Her hair has been crudely chopped to resemble \n               Carrie's. It looks like shit.\n\n                                     CARRIE\n                              (at a loss for words)\n                         You cut your hair.\n\n               Adele smiles, pleased with Carrie for noticing. She sits \n               down next to Brian.\n\n                                     ADELE\n                         Early cut it.\n                              (smiles at Early)\n                         ...Once he gets an idea in his head \n                         there's no holding him back.\n\n               Carrie looks to Brian curiously. Adele is distracted by a \n               small cactus on the window near the table.\n\n                                     BRIAN\n                         Nice job Early.\n\n               Carrie notices Adele's 'new' (stolen) purse... We see the \n               wheels turning in Carrie's head. How? Where?\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               EXT. MOTEL - LATER\n\n               Early walks toward the Lincoln. It is parked outside Brian \n               and Carrie's room. The front door is ajar, he pushes it open. \n               He sees Carrie's reflection in the bathroom mirror, she's in \n               her underwear, pulling on her jeans. Early watches her for a \n               moment. There's no mistaking what's on his mind... as his \n               eyes scan her body. Carrie pulls on her T-shirt, steps out \n               of the bathroom and sees Early just outside the door.\n\n                                     EARLY\n                         ...Need a hand with those bags?\n\n                                     CARRIE\n                         No, thanks, I can manage.\n\n               INT. MOTEL ROOM - SAME TIME\n\n               Carrie turns back to the dresser and gathers up the last few \n               things. She glances into the dresser mirror looking for \n               Early's reflection at the door, but he's gone. Relieved, she \n               turns the corner to grab her bags and finds Early standing \n               right there! Looking at her. He startles her.\n\n                                     EARLY\n                         I got 'em.\n\n               He picks up her bags and walks out of the room. Carrie watches \n               him, then she steps to the doorway.\n\n                                     BRIAN (O.S.)\n                         All set?\n\n                                     CARRIE\n                              (startled)\n                         Fuck!\n\n                                     BRIAN\n                         Take your time.\n\n               CARRIE LOOKS BACK TO EARLY\n\n               CARRIE'S POV - EXT. MOTEL\n\n               Early places the bags in the Lincoln's trunk. Adele sees \n               Early carrying Carrie's bag, Adele looks jealous.\n\n               EXT. MOTEL\n\n               In the foreground Carrie's door closes.\n\n               TO BLACK.\n\n               EXT. LINCOLN/HIGHWAY - LATER\n\n               Lincoln passes through frame.\n\n               INT. MOVING LINCOLN - NOON\n\n               Brian at wheel, Carrie next to him loading her camera. Early \n               in the back seat, Adele next to him pulls out some make up \n               from her bag, we see the little cactus from the motel lobby. \n               She begins to put on some lipstick. Early reaches into the \n               frontseat and grabs the manuscript that sits between Brian \n               and Carrie.\n\n                                     EARLY\n                              (starts to read)\n                         This the book your writing?\n\n                                     BRIAN\n                         It's just a work in progress, kinda \n                         rough.\n\n                                     EARLY\n                         This guy killed a mess of people.\n\n                                     BRIAN\n                         Who?\n\n                                     EARLY\n                         Henry Lucas.\n\n                                     BRIAN\n                         Henry Lee Lucas. Well he was only \n                         convicted of killing eleven but he \n                         claimed to have killed over three \n                         hundred.\n\n                                     EARLY\n                         Wonder what all them people done \n                         made him so mad?\n\n               Brian looks to Early in his rear-view mirror.\n\n               BANG!!\n\n               The front tire blows... the car lurches. Brian reacts, pulling \n               the Lincoln to the side of the road in a dusty halt.\n\n               EXT. LINCOLN/HIGHWAY - NOON\n\n               Brian and Early unload the trunk to get to the spare tire.\n\n               AT THE RIGHT FRONT TIRE\n\n               Brian struggles with the wheel and the jack.\n\n                                     EARLY\n                         Here Bri' let me do that.\n\n               Early takes over. He pulls off his shirt, jacks the car up \n               and begins replacing the wheel with ease.\n\n                                     EARLY\n                         How did he get away with it for so \n                         long anyhow?\n\n                                     BRIAN\n                         He almost always killed strangers. \n                         Spent years moving on from one place \n                         to another. That made it real hard \n                         to track him down.\n\n               Carrie scans the landscape with her camera. She sees Adele \n               walking around a small roadside graveyard. She is reading \n               the epitaphs on the headstones. Carrie fires off a few shots. \n               Then she sees Early, she can't help but notice Early's lean \n               body. She zooms in on his muscles and prison tattoo. Click!!\n\n               Early completes the task. Together he and Brian begin putting \n               everything back in the trunk.\n\n               Suddenly, from behind, Adele jumps onto Early's back, \n               surprising him. He gives her a \"horsey ride\" around the \n               Lincoln.\n\n               ON CARRIE\n\n               She notices Early's wallet on the ground.\n\n               ON EARLY AND ADELE\n\n               She's riding him, covering his eyes playfully.\n\n               ON CARRIE\n\n               She picks up the wallet.\n\n               BENEATH THE LINCOLN\n\n               Early's feet galloping.\n\n               ON CARRIE\n\n               She opens the wallet to find two one dollar bills inside.\n\n               WITH EARLY AND ADELE\n\n               As they come around the side of the car and to a stop in \n               front of Carrie. She holds up his wallet... watches his eyes.\n\n                                     CARRIE\n                         You dropped this.\n\n                                     ADELE\n                         Early Grayce if this ain't your lucky \n                         day.\n\n               She hands the wallet back to him. Something between them \n               goes unspoken.\n\n               EXT. A GAS STATION - LATER THAT DAY\n\n               The Lincoln pulls in.\n\n               INT. LINCOLN\n\n                                     BRIAN\n                         I guess it's your turn to pay Early.\n\n               Early nods and Brian looks over to Carrie, making sure she \n               heard. The four of them get out of the car.\n\n               EXT. GAS PUMP ISLAND\n\n               Early starts toward the gas station store. He checks his \n               wallet, two dollars left. Carrie and Adele lean against the \n               car. Carrie lights up a cigarette. She watches Early to see \n               what his next move will be. Brian removes the gas cap and \n               sticks the gas pump nozzle in. It pumps away.\n\n               CLOSE ON THE GAS METER\n\n               It starts turning over... $$$$$ Click... Click... Click...\n\n               EXT. GAS STATION\n\n               (crossing the tarmac)... with Early. His face expressionless. \n               His mind racing...\n\n               EXT. GAS PUMP ISLAND\n\n               Brian walks around the Lincoln; checking the tires. Carrie \n               watches Early intently.\n\n               CLOSE ON EARLY\n\n               He walks toward the entrance.\n\n               HIS POV\n\n               Inside the store he sees a video surveillance camera. It \n               worries him. Distracts him momentarily.\n\n               Suddenly from behind him... o.s. A car horn HONKS LOUDLY!\n\n               Early turns to see a late model Mercedes behind him. He just \n               gazes at the driver. Aggravated, the driver leans on the \n               horn and motions Early out of his way. Early stares at the \n               man a moment longer, then steps to one side and lets the car \n               pull past him.\n\n               WIDE ON THE GAS STATION\n\n               A FAT MAN in his late thirties exits from behind the wheel \n               of the Mercedes. Early watches him as he takes a money clip \n               from his pocket and walks toward the entrance to the mini \n               market.\n\n               EXT. GAS PUMP ISLAND\n\n               The gas meter dial continues to go around. $$$$$ Click... \n               Click... Click...\n\n               NEW ANGLE\n\n               The girls leaning against the car. Adele watches Carrie take \n               a drag on her cigarette.\n\n                                     ADELE\n                         I used to smoke before I met Early. \n                         But he broke me of that.\n\n               Her remark gets Carrie's attention.\n\n                                     CARRIE\n                         Broke you?\n\n               ON EARLY\n\n               He watches the Fat Man inside the office.\n\n               EARLY'S POV - EXT./INT. GAS STATION\n\n               The Fat Man pays THE ATTENDANT for gas and is handed the \n               restroom key.\n\n               EXT. GAS PUMP ISLAND\n\n               Brian walks to the front of the Lincoln. He passes Carrie \n               and Adele...\n\n                                     ADELE\n                         Early don't think women should smoke \n                         or curse or drink liquor.\n\n                                     CARRIE\n                         So you don't do any of those things.\n\n               Carrie takes a quick look to the mini-market. She's lost \n               sight of Early.\n\n                                     ADELE\n                         Better not, or Early'd whip me.\n\n                                     CARRIE\n                              (back to Adele)\n                         He whips you?\n\n               INT./EXT. BATHROOM\n\n               The Fat Man turns the key and enters the bathroom. The door \n               starts to swing shut behind him, but...\n\n               TWO FINGERS catch it before it does.\n\n                                     ADELE (O.S.)\n                         Only when I deserve it.\n\n               EXT. GAS PUMP ISLAND\n\n               Brian lifts the hood of the Lincoln... Reaches for the \n               radiator cap.\n\n               INT. BATHROOM\n\n               The Fat Man is standing at the urinal. He has a ureterostomy \n               bag he's emptying, when...\n\n               Early's hand hits the blow dryer. A whirring sound fills the \n               room. The Fat Man turns his head. Early lunges at him from \n               behind, yanks his head back and rips a switchblade across \n               his throat!\n\n               EXT. GAS PUMP ISLAND - CU\n\n               A BLAST of steam from the radiator startles Brian!\n\n               INT. BATHROOM\n\n               The Fat Man clutches at his throat. Sees the blood on his \n               palms. He looks up in shock. Early pounds the man's head \n               into the wall.\n\n               EXT. GAS PUMP ISLAND\n\n               Brian checking the oil, pulls out the dip stick.\n\n               NEW ANGLE: CU\n\n               Black oil runs down the metal blade.\n\n               INT. BATHROOM\n\n               The Fat Man falls to his knees against the urinal. His hand \n               grasping the lever. The urinal flushes. Water flows. The Fat \n               Man's blood mixes with it. The urinal overflows. The blood \n               tinged water spills onto the white tile floor. Early pries \n               the dead man's fist off the lever.\n\n               EXT. GAS PUMP ISLAND\n\n               Brian slams the Lincoln's hood shut.\n\n               INT. BATHROOM\n\n               Early struggles to turn the fat corpse over.\n\n               EXT. GAS PUMP ISLAND\n\n               Brian steps up to the gas nozzle and pulls it out of the \n               car.\n\n               INT. BATHROOM\n\n               Early reaches in the dead man's pocket and removes his money \n               clip.\n\n               EXT. GAS PUMP ISLAND\n\n               The gas meter stops turning.\n\n               INT. BATHROOM\n\n               Early calmly washes his hands in the beat up ceramic sink. \n               He pulls a comb from his pocket and combs his hair in the \n               mirror.\n\n               EXT. GAS PUMP ISLAND\n\n               Brian pulls a squeegee across the front windshield. Water \n               washes the dirt away.\n\n               INT. BATHROOM - EXTREME CU\n\n               The bloody water spiralling down the drain hole.\n\n               EXT. GAS STATION\n\n               Early exits the bathroom... and runs straight into Brian, \n               about to enter.\n\n                                     EARLY\n                              (friendly)\n                         Hey Bri'... ah... You don't want to \n                         go in there. It's a real mess, if \n                         you know what I mean.\n\n               Brian glances at the bathroom door. Down below, a thin stream \n               of the Fat Man's blood begins to trickle out from under the \n               door... just barely touching the toe of Brian's shoe.\n\n                                     BRIAN\n                         That bad?\n\n                                     EARLY\n                         ...Then some.\n\n               Early puts his arm around Brian and turns him back toward \n               the car.\n\n               AT THE CAR\n\n               Adele takes a photo of them, approaching. The attendant steps \n               up to Carrie.\n\n                                     ATTENDANT\n                              (to Carrie)\n                         Comes to twenty eight dollars.\n\n                                     CARRIE\n                         Talk to him.\n\n               Carrie points to Early. As Brian and Early approach the car, \n               Early pulls out the money clip.\n\n                                     EARLY\n                         Call it an even thirty.\n\n               Early peels off thirty bucks from the money clip. He sees \n               Carrie watching him, Early smiles.\n\n                                     EARLY\n                         I'll drive Bri'.\n\n               Hearing that, Carrie climbs into the back seat. Adele climbs \n               over the backrest into the frontseat.\n\n                                     EARLY\n                         Adele, get in the back.\n\n               She climbs again into the backseat.\n\n               EXT. LINCOLN CRUISING\n\n               INT. LINCOLN DRIVING DOWN THE ROAD - DAYTIME\n\n               Early is driving. Brian riding shotgun, is making some notes \n               in his manuscript. Adele is teaching a reluctant Carrie to \n               play a card game called \"SNAP.\"\n\n                                     ADELE\n                         ...Hey you're good. Thought you said \n                         you never played before?\n\n                                     CARRIE\n                         I haven't... I'm a fast learner.\n\n               ON EARLY AND BRIAN\n\n                                     EARLY\n                         ...They never caught that Black Dolya \n                         Killer, huh?\n\n                                     BRIAN\n                         Dahlia, no.\n\n                                     EARLY\n                         Now why is that?\n\n                                     BRIAN\n                         Some people think it's because he \n                         never killed again. He just \n                         disappeared back into society.\n\n                                     EARLY\n                         You don't sound too convinced 'bout \n                         that?\n\n                                     BRIAN\n                         I always thought it was the work of \n                         a serial killer. Anyone who took \n                         that much time and care bisecting \n                         another human being must have been \n                         enjoying it and would have done it \n                         again. And again. Until someone \n                         stopped him.\n\n                                     EARLY\n                         That your... \"theory\", ain't that \n                         what they call it?\n\n                                     BRIAN\n                         Yeah.\n\n                                     EARLY\n                         You wanna hear mine?\n\n               Carrie listens in as she continues to play cards with Adele.\n\n                                     BRIAN\n                              (amused)\n                         Sure.\n\n                                     EARLY\n                         Ain't you goin' to record it?\n\n               Brian picks up his tape recorder.\n\n                                     BRIAN\n                              (into tape)\n                         Early Grayce, June twenty third.\n\n               Brian hands Early the hand held tape recorder.\n\n                                     EARLY\n                              (into tape)\n                         Well I'll just bet he's still alive. \n                         Old, livin' in some trailer park or \n                         somethin' somewhere, but still alive. \n                         Thinkin' every night 'bout what he \n                         done. Goin' over and over it in his \n                         mind. How smart he was for getting \n                         away with it.\n\n               Carrie is chilled by the intensity of Early's remark. She \n               watches him out of the corner of her eye. SMACK! Adele's \n               hand hits the pile of cards and she wins the game. Startled, \n               Carrie turns back to Adele.\n\n                                     ADELE\n                              (to Carrie)\n                         You lose!\n\n                                     BRIAN\n                              (to Early)\n                         I suppose anything's possible.\n\n               Brian puts one leg across the other and goes back to his \n               notes.\n\n               NEW ANGLE: CLOSE UP BRIAN'S SHOE\n\n               Revealing... the blood encrusted toe of his shoe.\n\n               NEW ANGLE: CU ON EARLY\n\n                                     EARLY\n                         You ever play any pool Bri'?\n\n               EARLY'S POV\n\n               Up ahead a HONKY TONK BAR with a large sign \"POOL TABLES, \n               BOWLING & MUSIC\"\n\n               EXT. COUNTRY ROAD\n\n               The Lincoln passes by the LARGE SIGN.\n\n                                     BRIAN (O.S.)\n                         I can hold my own...\n\n               EXT. MOTEL - DUSK\n\n               A high angle looks down on the modest cluster of rooms below. \n               The motel sign pulses erratically in foreground. Moths flicker \n               about the light.\n\n               CLOSER\n\n               The Lincoln is parked in front of Brian and Carrie's room. \n               The horn honks. Early is behind the wheel, engine running. \n               Brian steps out of the motel room.\n\n                                     CARRIE (O.S.)\n                         Hey Minnesota Fats!\n\n               Carrie appears at the door holding her camera.\n\n                                     CARRIE\n                              (sarcastic)\n                         Don't forget your key.\n\n               She hands Brian the key.\n\n                                     BRIAN\n                         Why'd I open my big mouth?\n\n               Brian takes the key and walks to the car.\n\n               Carrie sees Adele standing outside her door. Brian enters \n               the Lincoln.\n\n                                     CARRIE\n                              (to Adele)\n                         Why didn't you go with them?\n\n               The Lincoln pulls away.\n\n                                     ADELE\n                         I told you how Early feels 'bout a \n                         woman drinking.\n\n                                     CARRIE\n                         How'd you meet Early?\n\n               Carrie swings the camera around to Adele, and snaps off a \n               shot.\n\n                                     ADELE\n                              (grins)\n                         I was hitchhiking' one day and he \n                         picked me up. At first I wasn't gonna \n                         get in on account of his car was in \n                         such sorry shape. I said, \"I ain't \n                         never seen a white man drivin' a car \n                         like this.\"\n\n               Carrie snaps another shot of Adele. Every once in a while \n               Adele feels like she should be \"posing\" for the shots that \n               Carrie's taking of her. So, occasionally, as she carries on \n               her conversation with Carrie, she does.\n\n               CARRIE'S POV THRU CAMERA\n\n                                     ADELE\n                              (continues)\n                         An' he said right back, \"You shouldn't \n                         judge by appearances little lady... \n                         this vehicle might just be a flying \n                         saucer disguised as a car, for all \n                         you know.\"\n\n               CARRIE'S POV THRU CAMERA - AS SHE ZOOMS IN TIGHTER ON ADELE\n\n                                     ADELE\n                         Well, I got in and we got to talkin', \n                         and the next thing I know, I'd moved \n                         in with him in this old trailer.\n                              (beat)\n                         Hey! Wouldn't it be something if we \n                         all ended up sharing a house together \n                         in California?\n\n               ON CARRIE\n\n               She lowers the camera from her eye and studies Adele.\n\n                                     CARRIE\n                         You know I can fix that haircut for \n                         you, if you want?\n\n                                     ADELE\n                         You can?\n\n               EXT. BOWLING ALLEY BAR - NIGHT\n\n               A nondescript \"joint\" on the outskirts of town. American \n               cars. American pickup trucks parked outside. The Lincoln \n               pulls into foreground and parks. Early gets out of the Lincoln \n               and looks around.\n\n                                     EARLY\n                         I wonder if there's any \"doors\" out \n                         here?\n\n               Brian exits the Lincoln and looks at Early questioning.\n\n                                     EARLY\n                         You know... \"openings\" to other \n                         dimensions.\n                              (pause)\n                         I read there are a lot of them out \n                         West, mostly in the desert. They say \n                         if you know what you're doing, you \n                         can travel anywhere in the Universe \n                         in a matter of seconds. Wouldn't \n                         that come in handy?\n\n               Brian looks at him blankly. He can't think of a thing to say \n               in response. Early walks toward the entrance of the bar. \n               Brian joins him.\n\n                                     BRIAN\n                         By the way, I'm not much of a pool \n                         player.\n\n                                     EARLY\n                         Shit, it ain't hard to play pool. I \n                         can teach you everything ya need ta \n                         know.\n\n                                     BRIAN\n                         Yeah?\n\n                                     EARLY\n                         Hell yeah! I'll even spot ya a few \n                         points first game.\n\n                                     BRIAN\n                         Wait a minute. You're gonna hustle \n                         me?\n\n                                     EARLY\n                         Nah... how much money have you got?\n\n               They both laugh and enter the bar.\n\n               CARRIE'S MOTEL ROOM - SAME TIME\n\n               Adele is sitting in a chair in front of the dresser mirror \n               drinking a beer. Carrie is cutting her hair. In the mirror \n               Adele watches Carrie for a moment. She notices the cigarette \n               dangling from her lips.\n\n                                     ADELE\n                         How do you get your cigarette to \n                         stay there like that.\n\n               Carrie looks in the mirror.\n\n                                     CARRIE\n                         I'm cool.\n\n                                     ADELE\n                         Could I try that?\n\n               Carrie takes out a fresh cigarette and hands it to Adele. \n               Together they stare into the mirror with their dangling \n               cigarettes. Adele drops her cigarette, as she reaches down \n               for it she notices Carrie's portfolio.\n\n                                     ADELE\n                         What's this?\n\n                                     CARRIE\n                         It's a portfolio of my work.\n\n                                     ADELE\n                         Your pictures. Can I see 'em?\n\n                                     CARRIE\n                         Sure.\n\n               Adele grabs the black leather binder and sets it in her lap. \n               Carrie continues to cut Adele's hair. Adele opens the binder \n               and takes a look at the first erotic image and slaps the \n               cover back down. She's embarrassed.\n\n                                     ADELE\n                         Jesus!\n\n               Carrie watches her in amusement. After a moment, Adele \n               reconsiders, and opens the book. She gazes at the shocking \n               photograph.\n\n                                     ADELE\n                         You took this picture?\n\n                                     CARRIE\n                         Took 'em all.\n\n               Carrie resumes cutting Adele's hair. Adele thumbs through \n               several photographs.\n\n                                     CARRIE\n                         That's me.\n\n                                     ADELE\n                         No it is not!\n\n                                     CARRIE\n                         Hold still.\n\n                                     ADELE\n                         Sorry. Boy I'll tell ya, if Early \n                         found a picture of me like that I'd \n                         be black and blue for a week.\n\n               Adele notices Carrie's scowl in the dresser mirror. Carrie \n               stops cutting.\n\n                                     CARRIE\n                              (suddenly serious)\n                         You shouldn't let him do that to \n                         you...\n\n                                     ADELE\n                         Do what?\n\n                                     CARRIE\n                         Adele... are you serious?\n\n                                     ADELE\n                              (defensive)\n                         You think Early's bad to me, don't \n                         you?\n\n                                     CARRIE\n                         Yeah.\n\n               Carrie starts cutting Adele's hair again.\n\n                                     ADELE\n                         Well... You're wrong. I ain't saying \n                         Early ain't never hit me... but he \n                         never hurt me.\n\n               When Carrie doesn't respond, Adele grabs Carrie's scissor \n               hand and stops her from continuing. Carrie looks at Adele's \n               reflection in the dresser mirror.\n\n                                     ADELE\n                              (continues)\n                         ...When I was fourteen years old \n                         three boys raped me in the back of a \n                         truck, and beat me so bad I was in \n                         bed for almost four months...\n                              (beat)\n                         ...I feel safe with Early, most the \n                         time he treats me pretty good. And I \n                         know he wouldn't let nothin' like \n                         that ever happen to me again...\n\n               Carrie is speechless, Adele looks in the mirror at her new \n               haircut.\n\n                                     ADELE\n                         Hey, that ain't so bad now.\n\n               INT. BOWLING ALLEY BAR\n\n               The patrons are young men and women. Eighteen to thirty. The \n               River's Edge kids today. Leather. Ludes and Beer. Wasted. \n               Rowdy.\n\n               We follow one of the waitresses through the bar... As she \n               passes by a pool table one of the players, A LARGE YOUNG \n               CRACKER, makes a grab at her...\n\n                                     LARGE YOUNG CRACKER\n                         When you gonna give me so o' that!\n\n               She spins safely out of his reach.\n\n                                     WAITRESS\n                         Maybe when you grow up a little sonny.\n\n               Some guys, close enough to hear her over the noise, laugh at \n               her put down. She moves on until she reaches...\n\n               Brian standing near a small high table. Early's not with \n               him. She sets four beers down on the table. Brian tries to \n               talk to her over the music. He leans in close. His mouth to \n               her ear.\n\n                                     BRIAN\n                         These aren't Lucky Lager, I ordered \n                         Lucky Lager.\n\n                                     WAITRESS\n                         Sorry honey, 'ain't nothin Lucky \n                         around here.\n\n               The waitress laughs. Brian smiles and glances around the \n               room. He notices the Large Young Cracker staring at him.\n\n               ACROSS THE ROOM\n\n               Early steps out of the bathroom and makes his way back to \n               Brian.\n\n               NEW ANGLE ON BRIAN\n\n               He watches the waitress disappear into the crowd, then turns \n               to find the Large Young Cracker in his face!\n\n                                     YOUNG CRACKER\n                         What did you say to her city boy!\n\n               The Young Cracker is obviously very drunk.\n\n                                     BRIAN\n                         Nothing, I jus...\n\n                                     YOUNG CRACKER\n                              (cuts him off)\n                         What's a jism gargling cum drunk \n                         fairy like you looking at a pretty \n                         girl like that for anyway?\n\n               The Young Cracker doesn't notice Early return from the \n               bathroom. He moves in next to Brian. Early is relaxed and \n               nonchalant as he looks over the Young Cracker. He leans closer \n               to Brian.\n\n                                     EARLY\n                              (matter of factly)\n                         You'd better hit him first Bri', \n                         'cos it's comin'.\n\n               With his eyes on Brian, Early grabs a beer. Brian is scared, \n               and confused, with one ear and one eye on the Young Cracker, \n               the other on Early.\n\n                                     YOUNG CRACKER\n                         This yur' boyfriend?\n\n                                     BRIAN\n                              (dumbfounded)\n                         What?\n\n                                     EARLY\n                         Hit him.\n\n               Early looks at the beer.\n\n                                     EARLY\n                              (angry)\n                         Bri' this shit ain't Lucky Lager!\n\n               Early takes a swig off the beer, grimaces and sprays it out. \n               It hits the Young Cracker. The Cracker looks down at his \n               shirt in shock. Early is oblivious.\n\n                                     YOUNG CRACKER\n                              (to Early)\n                         Hey Asshole!\n\n               Brian is frozen, confused, doesn't know who to address. Early \n               continues to ignore the Young Cracker.\n\n                                     BRIAN\n                         They don't stock it here Early.\n\n                                     YOUNG CRACKER\n                              (to Early, furious)\n                         Why you fuckin'...\n\n               The Young Cracker moves to hit Early. Early swiftly smashes \n               his beer bottle into the oncoming face. The Young Cracker \n               doubles over clutching his face in agony. Early kicks him in \n               the face, sending the Young Cracker to the ground. Early \n               finishes him off with several more kicks from his heavy work \n               boots.\n\n               Two large tough guys approach Early and Brian. Brian's heart \n               racing, Early cool as a cucumber. Instead of taking on Early, \n               they stop, reach down and drag the unconscious man away. The \n               waitress returns to their table.\n\n                                     WAITRESS\n                         Sorry about that, he's always causing \n                         trouble.\n\n               She sets down two beers and two shots, doubles.\n\n                                     WAITRESS\n                         These are on the house.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               INT. CARRIE AND BRIAN'S MOTEL ROOM - NIGHT\n\n               Carrie and Adele split the last bottle of beer between them. \n               They are sitting on the floor and Adele has Carrie's foot in \n               her lap. She's painting Carrie's toenails bright red. Neither \n               of them is feeling any pain.\n\n                                     ADELE\n                         My momma's a beautician. Guess that's \n                         where I get it from. She wouldn't \n                         hear of my moving in with Early... \n                         on account of his just getting out \n                         of jail and all. Ain't seen her in \n                         nearly a year now. I wish she'd call \n                         me, just once.\n\n                                     CARRIE\n                              (interrupting)\n                         What's Early been in jail for?\n\n                                     ADELE\n                              (reluctantly)\n                         Carryin' a gun.\n\n                                     CARRIE\n                         ...Anything else?\n\n                                     ADELE\n                         An' resistin' arrest... At least \n                         that's what the Police said.\n\n                                     CARRIE\n                         Jeez... Adele!\n\n               Adele realizes she has said too much, looks at her watch.\n\n                                     ADELE\n                         I'd better be goin'. It's late.\n\n               Adele hastily weaves her way out the door.\n\n                                     CARRIE\n                         Great.\n\n               Carrie stares down at her feet. Red toenails. Cottonballs \n               between the toes.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               EXT. THE BOWLING ALLEY BAR\n\n               Early and Brian exit the bar. They make their way to the \n               Lincoln. On the way...\n\n                                     EARLY\n                         Got to see a man about a mule.\n\n               Brian looks at Early, doesn't understand.\n\n                                     EARLY\n                         Gotta take a piss.\n\n               Early branches off behind the car.\n\n                                     EARLY\n                         Any reebs left in the back seat?\n\n               Early starts to take a leak.\n\n                                     EARLY\n                         Aaahhhhh...\n                              (relief)\n                         That's what we used to call a beer \n                         when we was kids... Beer spelled \n                         backwards.\n\n               Brian reaches in the back seat and grabs the last Lucky Lager. \n               He crosses to the other side of the car and hands Early the \n               beer.\n\n                                     BRIAN\n                         Last one.\n\n               Early stares at the last of the Lucky Lagers.\n\n                                     EARLY\n                         ...Well I probably drunk more than \n                         my share, anyway... you go on an' \n                         have it.\n\n                                     BRIAN\n                         No, it's all yours. It's on me... \n                         for saving my ass back there.\n\n               Early takes the beer.\n\n                                     EARLY\n                         Hey, that's what buddies are for, \n                         right...?\n\n               Early polishes off the rest of the bottle and heaves it into \n               the woods.\n\n                                     EARLY\n                              (voice drops almost \n                              to a whisper)\n                         You know those doors I was talking \n                         about? Found two of them back in \n                         Kentucky. Shit, I wasn't even looking \n                         for one the first time. Me and the \n                         boys are just swingin' our sickles \n                         by the side of the road, and I turned \n                         around and there it was... this door \n                         with this bright blinding white light \n                         all around it... course I'm thinkin' \n                         I must be sunstroked or somethin'... \n                         so I close my eyes figurin' I'll \n                         count ten and it'll be gone right... \n                         so I'm countin'...\n                              (he closes his eyes)\n                         ...1-2-3-4-5... an' I'm 'bout ta \n                         piss myself right... -6-7-8-9... 10. \n                         An' I open my eyes slow, spectin' it \n                         won't be there right...\n\n               When Early opens his eyes, he sees a concerned look on Brian's \n               face.\n\n                                     EARLY\n                              (unconvincingly)\n                         ...and it wasn't.\n\n               An awkward silence.\n\n               Then Early starts laughing. Brian follows suit. They both \n               climb back in the car. Their forced laughter trails off.\n\n               Brian shifts the Lincoln back into gear and segues \n               awkwardly...\n\n                                     BRIAN\n                         What were you \"swinging a sickle\" \n                         for?\n\n               Early stares at Brian. For a moment Brian is unsure what \n               Early will say, or do? Then Early grins...\n\n                                     EARLY\n                         For... 'bout three years.\n\n               Brian brakes their eye contact, looks back out onto the \n               highway and just drives off.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               INT. BRIAN AND CARRIE'S MOTEL ROOM - LATER\n\n               The door opens revealing Brian silhouetted in the doorway. \n               Under the influence of Lucky Lager, he fumbles with the key... \n               gets inside and noisily shuts the door behind him. Carrie \n               remains stonily silent, in the dark.\n\n                                     BRIAN\n                         Gotta see a man about a mule... What's \n                         wrong?\n\n               A few seconds pass.\n\n                                     CARRIE\n                         The same thing that's been \"wrong\" \n                         the whole trip. Your good buddy Early.\n\n               Carrie, in bed, switches on the side table light. Reveals \n               Brian leaning on the wall trying to get his shoes off without \n               falling over.\n\n                                     BRIAN\n                         Who said he's my good buddy?\n\n                                     CARRIE\n                         You sure been acting like you were...\n                              (redneck accent)\n                         ...Out whoopin' it up, a drankin' \n                         and ever' thang.\n\n               Brian points to the empty beer bottles on the table.\n\n                                     BRIAN\n                         Hey come on, you two were drinking \n                         too... so what's the big deal.\n\n               Brian throws his shoes somewhere and heads toward the \n               bathroom.\n\n                                     CARRIE\n                         Yeah, and you should've seen how \n                         terrified she was that he'd find \n                         out. He beats her.\n\n                                     BRIAN\n                         How do you know that?\n\n                                     CARRIE\n                         She told me...\n                              (adding)\n                         ...but only when she \"deserves\" it. \n                         Did you know he was in jail?\n\n               BATHROOM\n\n               Brian turns on the light. Takes a piss. A long one.\n\n                                     BRIAN\n                         Yeah, for stealing a car. Aaahhhh.\n\n               Suddenly, from right behind him:\n\n                                     CARRIE (O.S.)\n                         Bullshit!\n\n               Startled, Brian turns to see Carrie.\n\n                                     CARRIE\n                         ...He told her it was for carrying a \n                         gun, but the truth could be murder \n                         for all we know.\n\n               No response from Brian. Carrie walks away.\n\n               LIVING ROOM\n\n               Carrie steps over to the bed, pulls the sheets back. Brian \n               leans out the bathroom door:\n\n                                     BRIAN\n                         Stop being so fucking melodramatic! \n                         If it was murder he'd still be locked \n                         up or on parole, in which case he \n                         wouldn't be allowed to leave the \n                         state.\n\n                                     CARRIE\n                         Maybe he wasn't allowed to leave! \n                         Geezus Brian!\n\n               Brian smacks himself on the forehead (a sarcastic \"how stupid \n               of me!\") He pulls his shirt off over his head, and admits...\n\n                                     BRIAN\n                              (sarcastically)\n                         Of course! The accent, the clothes, \n                         and those table manners!... He's got \n                         to be a mass murderer!\n                              (pause)\n                         What else could he be?\n\n               He switches off the bathroom light, steps out of the doorway, \n               and begins to pull his jeans off. Carrie climbs into bed.\n\n                                     BRIAN\n                         You know, it wouldn't even surprise \n                         me if he turned out to be... a \n                         Republican!\n\n               Brian tosses his jeans and moves toward the bed. Carrie \n               switches off the the only light in the room. In the dark, we \n               hear a thud as Brian trips over a chair.\n\n                                     BRIAN\n                         Goddamnit!... my fucking toe!\n\n               EXT. BRIAN AND CARRIE'S MOTEL ROOM - A MOMENT LATER\n\n               Carrie leaves the motel room, ice bucket in hand.\n\n                                     CARRIE\n                              (to Brian inside room)\n                         Try not to lose consciousness 'til I \n                         get back.\n\n               EXT. MOTEL CORRIDOR\n\n               At the far end of a narrow hallway, Carrie finds an ice \n               machine rumbling away noisily. The only illumination, a single \n               fluorescent light bulb, hangs suspended above it.\n\n               AT THE ICE MACHINE\n\n               With her arm buried inside the ice machine, Carrie scavenges \n               for what little ice there is... when, out of the corner of \n               her eye, she notices...\n\n               SOMEONE standing at the other end of the corridor. The \n               silhouette of a man.\n\n               Carrie stops. Her eyes scan the claustrophobic hallway for \n               another way out. There is none.\n\n               She tries to ignore the situation. Grabs another handful of \n               ice cubes. The man approaches. Carrie stops again. Her mind \n               races. The man's face slowly becomes visible as he nears the \n               fluorescent light. It's Early.\n\n                                     EARLY\n                         Ain't you done enough drinking for \n                         tonight?\n\n                                     CARRIE\n                         ...Brian hurt his foot.\n\n               Early reaches past her into the ice machine and grabs a \n               solitary cube. He puts it in his mouth, sucks on it. His \n               torso is drenched in sweat. He catches Carrie staring at \n               him.\n\n                                     EARLY\n                         Sometimes... Don't know why it is... \n                         I get so hot I can't stand it. I \n                         just start sweating like a dog. You \n                         ever get like that?\n\n                                     CARRIE\n                              (tenuous)\n                         No.\n\n               Early spits the ice cube back into his hand. He presses it \n               against the back of his neck.\n\n                                     EARLY\n                         I can feel it start to run down my \n                         neck...\n                              (he turns his back to \n                              show her)\n                         ...and down my back... right into my \n                         pants.\n\n               Carrie follows a bead of ice water as it slides down between \n               his shoulder blades and along his back.\n\n                                     EARLY\n                         ...and everything starts stickin' \n                         together... keeps running down the \n                         back of my legs like two rivers racin' \n                         for my boots, see who gets there \n                         first.\n\n               He snaps a look back to Carrie and finds her looking at his \n               ass. She diverts her glance.\n\n                                     EARLY\n                         You never get that hot, huh?\n\n               Carrie shakes her head no. Early looks in his hand to see \n               that his ice cube has melted.\n\n                                     CARRIE\n                         I gotta get back before this ice \n                         melts.\n\n               Carrie tries to slip past him. He reaches back into the \n               machine, momentarily blocking her exit. He grabs another ice \n               cube. His face only inches from hers.\n\n                                     EARLY\n                         ...never?\n\n                                     CARRIE\n                         No, never. Excuse me.\n\n               He pops the ice cube in his mouth and lets her pass.\n\n                                     EARLY\n                         You like Skynard?\n\n               No response, Early chews up the ice cube.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               EXT. LINCOLN LEAVING THE MOTEL - NEXT MORNING\n\n               The car crawls out of the parking lot.\n\n               INT. LINCOLN\n\n               Carrie is driving. Brian is contending with a major hangover. \n               There is still a silent tension between Brian and Carrie \n               from the argument the night before. Early is in the back \n               with Adele. Brian moves his head and moans.\n\n                                     ADELE\n                         My daddy always took sauerkraut juice \n                         and tobasco sauce for a hangover, \n                         mixed in one egg not two, and some \n                         tomato juice...\n\n               From the front seat, Brian's hand springs up in a desperate \n               plea for an end to Adele's colorful description.\n\n                                     BRIAN\n                         I'm okay, thanks.\n\n               Brian rolls down his window for some fresh air, as the car \n               pulls away.\n\n               EXT. LINCOLN ON HIGHWAY - MOMENTS LATER\n\n               THE CAR IS HEADING DOWN A COUNTRY ROAD.\n\n               INT. LINCOLN\n\n               Carrie glances over at Brian, who is now asleep next to her. \n               She looks up into her rear-view mirror...\n\n               CARRIE'S POV: IN THE MIRROR\n\n               Early is asleep, leaning against the door. Adele is rummaging \n               through a large canvas bag on the seat next to her. \n               Suddenly... The wail of an approaching ambulance gets Carrie's \n               attention. It roars by. Carrie glances in the mirror again. \n               The next instant, unexpectedly...\n\n               EXT. LINCOLN\n\n               She furiously pulls the car off the road to an abrupt halt.\n\n               INT. LINCOLN\n\n               Brian's heads bangs against the side window.\n\n                                     BRIAN\n                         What! What!\n\n               Carrie nods toward the back seat. Brian turns and sees Adele \n               looking back at them questioningly. Beside her, Early rustles.\n\n                                     BRIAN\n                         What is it?\n\n                                     CARRIE\n                         Look again!\n\n               Brian notices that Adele's rummaging has revealed an automatic \n               pistol in the open canvas bag. Brian stares at it. Early's \n               eyes open.\n\n               EXT. PARKED LINCOLN - LATER\n\n               A deserted plain. It's very quiet here. Until the silence is \n               broken by the sound of gunshots. Reveal Early teaching Brian \n               how to shoot. A row of tin cans are set up on a rusty old \n               car. It's obvious that Brian's enthralled with the idea of \n               shooting the gun. Even if he isn't hitting anything.\n\n                                     EARLY\n                         Only thing my old man ever gave me \n                         is that goddamn .45.\n\n               Brian fires off another shot, misses again.\n\n                                     EARLY\n                         Bri', you're jerkin' it when you \n                         pull the trigger, hold it real steady.\n\n               Nearby stands an unhappy Carrie. Adele pulls her yoyo out of \n               her pocket.\n\n                                     ADELE\n                         Boys'll be boys.\n\n               Carrie doesn't respond. Adele offers the yoyo to Carrie.\n\n                                     ADELE\n                         You know any tricks?\n\n               Carrie shakes her head no. Adele withdraws her offer.\n\n                                     ADELE\n                         You wanna learn some?\n\n               Again Carrie declines. Her steely gaze returns to Brian.\n\n               ON EARLY AND BRIAN\n\n               Early helps Brian to hold the gun.\n\n                                     EARLY\n                         Steady... Breath in... now let half \n                         of it out, and... fire.\n\n               BANG!! The can flies off the tree stump. Brian turns to Carrie \n               to see her reaction... but she's already on her way back to \n               the car, and she's furious. Concerned, Brian starts to follow \n               after her... But Early grabs his attention.\n\n                                     EARLY\n                         Bri, I want you to keep this gun... \n                         consider it a present. Never know, \n                         California could turn out to be a \n                         dangerous place.\n\n               Brian gazes at the gun resting in the palm of his hand.\n\n               EXT. AN EMPTY HIGHWAY - DAY\n\n               The Lincoln rolling along.\n\n               INT. LINCOLN\n\n               Brian is driving. Carrie keeps to herself. In her side mirror \n               she catches a glimpse of Early curled up in Adele's lap. She \n               watches a moment longer... and realizes that they are making \n               out. Beginning to kiss and touch one another.\n\n               EXT. HIGHWAY NEAR ABATTOIR - LATE AFTERNOON\n\n               The Lincoln turns off the main highway onto a dirt road. In \n               the distance, we see a large rundown building.\n\n               INT. AN OLD DESERTED ABATTOIR - AFTERNOON\n\n               The Lincoln pulls up to the ramshackle structure. Brian \n               glances to the back seat to make a remark to Early and Adele \n               and sees that they are amorously engaged.\n\n               Brian and Carrie start to gather their stuff. Carrie opens \n               the glove compartment, inside are boxes of film... and the \n               .45 automatic. She takes a few packs of film, and closes the \n               glove compartment.\n\n                                     EARLY\n                         Tell ya Bri., I'm still a little \n                         sleepy,... think Adele and me are \n                         gonna take us a fiesta.\n\n                                     CARRIE\n                              (pissed off)\n                         Siesta.\n\n               Carrie reaches over and takes the keys from the ignition, \n               locks the glove compartment and pockets the key. Both she \n               and Brian exit the car. As they start to walk toward the \n               structure Brian hears a sound, he turns back to see. Adele \n               leaning forward into the frontseat as the lincoln's big white \n               top starts to come up.\n\n               INT. ABATTOIR\n\n               Even in daylight, the interior of the dilapidated old building \n               is equal parts unnerving, austere, and menacing. The last \n               rays of sunlight stream through what remains of the windows. \n               The light falls on a long ominous row of wicked looking meat-\n               hooks hanging from the ceiling.\n\n               Carrie is getting her camera equipment ready. She's quiet \n               and uncommunicative.\n\n               NEW ANGLE\n\n               CLOSE, on a small audio cassette player as it comes to rest \n               on a giant butcher block table in the center of the room. \n               Brian pops a cassette in the player.\n\n                                     CARRIE\n                         What's that?\n\n                                     BRIAN\n                         A copy of a tape they found. He \n                         recorded everything.\n\n               Camera in hand, Carrie begins to move about, despite the \n               fact that this place repels her.\n\n               Brian presses a button on the audio cassette player. The \n               small tinny speaker plays a bad recording of something we \n               slowly come to realize is the unmistakable sounds of a woman \n               being tortured and pleading for her life.\n\n               FLASH!! FLASH!!\n\n               Carrie fires off a series of shots from different angles. \n               Brian scans the place trying to imagine what happened. Screams \n               from the audio tape bounce off the walls.\n\n                                     BRIAN\n                              (speaks into his small \n                              hand held tape \n                              recorder)\n                         His mother had him working in here \n                         before he was eight years old... \n                         killing animals with a sledgehammer \n                         that was bigger than he was.\n\n               Brian and Carrie walk through the remains of a doorway into \n               another room.\n\n                                     BRIAN\n                         When she was pissed at him, she'd \n                         beat the shit out of him and lock \n                         him in here overnight...\n\n               The pleas for help and screams on the tape subside to a steady \n               whimpering.\n\n                                     BRIAN\n                              (continuing)\n                         ...Eventually the boy wakes up one \n                         morning, picks up that sledgehammer \n                         and starts hurting back.\n\n               FLASH!! FLASH!!\n\n               Carrie takes a few more shots of the ominous interior. Then \n               she stops, turns and walks out of the room. She's had enough. \n               Brian follows after her.\n\n                                     BRIAN\n                         There's more...\n\n                                     CARRIE\n                         I'm finished.\n\n               Carrie stops to pick up the rest of her gear.\n\n                                     BRIAN\n                         Look... I know you're pissed off \n                         about the gun, and I don't blame \n                         you...\n\n               Carrie wheels around to face him.\n\n                                     CARRIE\n                         Brian, I'm not pissed off. God damm \n                         it, turn that thing off.\n\n               She switches off the cassette player.\n\n                                     CARRIE\n                         I'm scared. A week ago you would \n                         never have even thought to pick up \n                         that gun. This afternoon you're out \n                         there wielding it around like Clyde \n                         fucking Barrow, for Christ's sake! \n                         What's with you?\n\n                                     BRIAN\n                         Okay, it was a cheap thrill, it was \n                         stupid, I admit it, alright?\n                              (pause)\n                         But let's not blow this. Not now... \n                         Let's just get the photos.\n\n                                     CARRIE\n                         I can't believe I agreed to do this.\n\n               OMITTED\n\n                                     BRIAN\n                         Oh come on, don't give me that shit... \n                         you wanted to take these photos as \n                         much as I wanted you too.\n\n                                     CARRIE\n                         Wrong! I was willing to do whatever \n                         it took to get you up off your ass \n                         and on the way to California... \n                         There's a big difference.\n\n               Carrie storms out of the place. She exits the tunnel, and \n               makes her way toward...\n\n               THE LINCOLN\n\n               As she approaches it, through the rear windshield she sees... \n               Early and Adele fucking wildly!\n\n               Carrie wants to turn away, but she can't stop watching them. \n               Fascinated, she raises the camera to her eye and zooms in on \n               them.\n\n               THROUGH CARRIE'S CAMERA LENS: ON EARLY AND ADELE\n\n               Early is sitting against the back seat. Adele is straddling \n               him. Carrie's finger finds the shutter button.\n\n               Early's arms move up under Adele's dress... Her hands press \n               up against the roof. She's trembling... Wavering... Carrie's \n               finger presses down on the button, CLICK!!\n\n               Then in one swift movement Early sweeps Adele onto the back \n               seat. Close on Early's face. He's sweating... Lips moving... \n               Talking dirty to Adele.\n\n               Keeping her finger on the button, Carrie rapid fires through \n               a whole roll of film. She's oblivious to the whine of the \n               motor drive once all the film is shot out.\n\n               Then unexpectedly!! Early looks directly into the camera, at \n               Carrie. And smiles... And continues to fuck Adele.\n\n               A chill rushes through Carrie, she almost drops the camera. \n               She runs back toward the tunnel... and right into Brian's \n               arms. He startles her. She pulls away from him.\n\n                                     CARRIE\n                         Brian I want him out of our car!\n\n                                     BRIAN\n                         Why, what did he do?\n\n                                     CARRIE\n                         Brian get him out of the car. Next \n                         gas station either he leaves or I \n                         do!\n\n               OMITTED\n\n               EXT. DESERT - DUSK\n\n               The Lincoln passes through frame. In the background, the \n               surreal image of an industrial complex bathed in an eerie \n               artificial light.\n\n               INT. LINCOLN PULLS INTO A GAS STATION - TWILIGHT\n\n               An electrical storm is in full swing.\n\n               EXT. GAS STATION\n\n               The Lincoln barely comes to a stop at the pumps before Carrie \n               storms out of the car and heads toward the gas station \n               interior. She leaves Brian to break the news to Adele and \n               Early.\n\n               INT. GAS STATION\n\n               The only person inside is a YOUNG MALE ATTENDANT. He's \n               watching TV behind the counter as Carrie enters. On the TV \n               we see a NEWSMAN. We only catch fragments of what he is saying \n               because the storm outside is affecting the TV reception.\n\n                                     CARRIE\n                         Twenty dollars in the tank and a \n                         carton of cigarettes.\n\n               In fact, each time the lightning flashes occur all of the \n               electrical power at the station is affected. The fluorescent \n               lights outside and inside begin to flicker and falter \n               sporadically.\n\n                                     NEWSMAN\n                         ...the ex-mental patient with a \n                         history of arrests is still at \n                         large...\n\n               Static.\n\n               Carrie looks at the TV, watches for a moment. It doesn't \n               hold her attention. She looks away and notices Adele leaving \n               the car. Adele walks toward a Coke machine at the other end \n               of the gas station.\n\n                                     ATTENDANT\n                         Here's your cigarettes...\n\n               Carrie turns back toward him.\n\n                                     ATTENDANT\n                         ...And change. Better be careful, \n                         looks like a bad one coming. Where \n                         you headin'?\n\n                                     CARRIE\n                         California.\n\n                                     ATTENDANT\n                         Hear it never rains there. Must be \n                         nice.\n\n               He buttons up his rain coat and goes out into the night to \n               gas up the Lincoln. Carrie pulls a pack of cigarettes from \n               the carton, nervously lights one up. She looks out the window \n               toward the Lincoln.\n\n               EXT. GAS PUMPS\n\n               Through flashes of lightning and thunder she sees Brian in \n               the car talking to Early. Early listening quietly. Brian \n               looking adamant yet apologetic. The attendant fills the \n               Lincoln's tank.\n\n               INT. GAS STATION\n\n               Simultaneously, as Carrie watches this... Behind her on the \n               TV screen... A wave of interference scrambles the picture.\n\n                                     NEWSCASTER\n                         ...we would like to repeat...\n\n               Static.\n\n                                     NEWSCASTER\n                         ...there is a nationwide manhunt \n                         for...\n\n               Static.\n\n               INT. GAS STATION - ON THE TV\n\n               The static clears and the Newscaster appears.\n\n                                     NEWSCASTER (O.S.)\n                         ...is believed responsible for the \n                         murders of his landlord John \n                         Diebold...\n\n               Static.\n\n               EXT. GAS PUMPS - TIGHTER ON LINCOLN\n\n               Brian's still talking -- using his hands to explain. Early \n               is watching him with a resigned expression.\n\n               INT. GAS STATION - ON THE TV\n\n               A video tape image of a familiar gas station recorded by a \n               surveillance camera.\n\n                                     NEWSCASTER\n                         ...of the fatal stabbing and robbery \n                         of Mr. Joseph Davies Robbins...\n\n               NEW ANGLE ON CARRIE\n\n               She stares at the TV with growing horror as she notices a \n               familiar black Lincoln in the background. In mid-ground, a \n               male figure approaches the video camera unknowingly. Slowly, \n               Early's image becomes visible.\n\n                                     NEWSCASTER\n                         If you see this man...\n\n               Carrie panics, turns toward the door and runs smack into the \n               arms of a dripping wet Early Grayce! Early stares at her and \n               drops his bag to the ground.\n\n                                     EARLY\n                         I ain't ridin' in no bus... bitch.\n\n               Then... Early notices himself on the TV.\n\n                                     NEWSCASTER (O.S.)\n                         ...call your local police or FBI...\n\n               Static.\n\n               Early grabs Carrie around the neck and yanks her into the \n               back office. He pushes her down onto a chair.\n\n                                     EARLY\n                         You just sit there and keep your \n                         mouth shut.\n\n               He searches behind the cash register and finds a sawed-off \n               shotgun. He shuts the TV off.\n\n                                     EARLY\n                         I knew that boy'd have a hogleg here \n                         somewhere.\n\n               The Attendant rushes back in from the pouring rain. Early \n               points the sawed-off shotgun at him.\n\n                                     EARLY\n                         Get over here.\n\n               Early forces him into the office.\n\n                                     EARLY\n                         Sit your ass down in that corner.\n\n               Adele enters the adjacent room. She checks out the various \n               vending machines in search of candy. Early taps on the window \n               and motions her into the office. She sees Carrie in the chair, \n               scared to death, and Early aiming the gun at the Attendant.\n\n                                     ADELE\n                         Early, what're you doin'?\n\n                                     EARLY\n                         Go back to the car and keep Brian \n                         there. I don't want him in here...\n                              (beat)\n                         Do it Adele... Now!\n\n               Adele looks back at Carrie, then hurries out. Early empties \n               the cash register.\n\n                                     EARLY\n                         What's your name, boy?\n\n                                     ATTENDANT\n                              (very scared)\n                         Walter Livesy.\n\n                                     EARLY\n                         Think. I might just have to kill you \n                         Walter. How do you feel about that?\n\n                                     ATTENDANT\n                         Not so good. You sure you have to?\n\n                                     EARLY\n                         I don't know. Wish I did.\n\n                                     CARRIE\n                         Early, just think...\n\n                                     EARLY\n                         Shut your mouth.\n\n               INT. LINCOLN\n\n               Adele opens the door on the driver's side looking scared. \n               Brian is in the passenger seat. He's looking in the glove \n               compartment for a map. The .45 automatic Early gave Brian is \n               clearly visible. Adele stares at it.\n\n                                     BRIAN\n                         Adele, what are you doing back here?\n\n               Adele gets in and starts looking under the seats.\n\n                                     ADELE\n                         ...Lost my purse... Could you help \n                         me look for it? It's probably under \n                         the seat.\n\n               INT. GAS STATION\n\n               The Attendant is reaching up, handing Early the money from \n               his pockets. Carrie is seated in front of him.\n\n                                     EARLY\n                         Where you from Walter?\n\n                                     ATTENDANT\n                              (nervous shake)\n                         Vernon, Florida.\n\n                                     EARLY\n                         Never heard of it, any huntin'?\n\n                                     ATTENDANT\n                         Turkey mostly.\n\n                                     EARLY\n                         Turkey's are real smart. Smarter \n                         than most people think...\n\n               Early rips the phone out of the wall.\n\n                                     EARLY\n                         Tell you what Walter, you lie down \n                         there now... You make sure you stay \n                         put for a while after we leave... \n                         Okay?\n\n               The attendant nods yes.\n\n                                     ATTENDANT\n                         ...Mind if I hold that Bible?\n\n                                     EARLY\n                         What do you need a Bible for?\n\n               The attendant has no response.\n\n                                     EARLY\n                         You think I'm goin' to kill you. \n                         Well that'd make me a liar then \n                         wouldn't it?\n\n                                     ATTENDANT\n                         No sir.\n\n               Early takes the Bible off the desk and hands it down to the \n               Attendant.\n\n                                     EARLY\n                         Here you go.\n\n               The frightened young man lies face down on his stomach \n               clutching the Bible and starts to pray.\n\n               On the counter next to him Early notices a large stuffed \n               \"happy face\" display. \"Free with every 20 gallon purchase.\"\n\n               He grabs one, stares at its face curiously.\n\n                                     EARLY\n                              (mumbles to himself)\n                         I wonder if Adele would like one of \n                         these?\n                              (beat)\n                         Nah...\n\n               Suddenly... He puts the barrel of the gun between the \"happy \n               face\" eyes... Points it at the back of the attendant's head.\n\n               Carrie begins to scream. Early pulls the trigger.\n\n               The blast explodes the \"happy face\" and rips into the back \n               of the Attendant's head, killing him.\n\n               INT. LINCOLN - SIMULTANEOUSLY\n\n               A thunderous crackle of lightning all but masks the gunshot. \n               The rain starts pouring down.\n\n                                     BRIAN\n                         What was that?\n\n               Adele stares blankly back.\n\n               INT. GAS STATION\n\n               The room fills with billowing down stuffing. As the stuffing \n               floats to the floor it sticks to their hair, skin and \n               clothes...\n\n                                     EARLY\n                              (surprised at the \n                              feathers)\n                         What the fuck!\n\n               INT. LINCOLN\n\n               Brian opens the door to leave.\n\n               EXT. GAS STATION\n\n               Early drags Carrie out of the office toward the car. Brian \n               sees them running toward the car. They spill into the back \n               seat. Brian sees Carrie is upset.\n\n                                     BRIAN\n                         Carrie, what's wrong?\n                              (to Early)\n                         Early, we went through this already, \n                         you have to leave.\n\n               From the back seat Early wipes some more feathers from his \n               face, then points the Attendant's gun at Brian's head.\n\n                                     EARLY\n                              (spits out a feather)\n                         'Fraid not Bri'... Drive Adele.\n\n               Adele starts the car. She pulls out of the station and into \n               the rainstorm.\n\n               INT. GAS STATION\n\n               The last of the feathers fall like snow. The whole room is \n               now white except for a red stain around the head of the dead \n               Attendant.\n\n               INT. LINCOLN - A MOMENT LATER\n\n               The car moves down the highway. Early in the back seat is \n               still trying to brush away feathers.\n\n                                     EARLY\n                         Hate to be an Indian-giver but I'm \n                         gonna have to ask for my gun back.\n\n               Brian reaches in the glove compartment. He removes the gun \n               and hands it to Early.\n\n                                     BRIAN\n                              (to Early)\n                         What happened back there?\n\n               Carrie sits in the corner of the back seat, covered in \n               feathers but not even noticing them.\n\n                                     CARRIE\n                         He shot him in the head... oh God!\n\n               Adele turns to the back of the car to face Carrie.\n\n                                     ADELE\n                              (raising her voice)\n                         He did not, you liar. Take that back.\n\n               The Lincoln swerves off onto the side of the road. Adele \n               looks to the front again and steers it back onto the highway.\n\n                                     CARRIE\n                         He's a killer, Brian... He's fucking \n                         insane.\n\n                                     EARLY\n                         Everybody just shut up!\n\n               Early picks some more feathers off himself.\n\n                                     EARLY\n                         You two just cooperate and do what I \n                         say, and we'll all arrive safe and \n                         sound in California, as planned... \n                         unless, of course, Adele don't kill \n                         us first with her driving.\n\n               NEW ANGLE - EXTREME CU\n\n               The St. Christopher statue swings from the rear-view mirror. \n               The windshield wipers sweep back and forth against the pouring \n               rain.\n\n               EXT. AN ISOLATED ABANDONED STORE - NEXT MORNING\n\n               The Lincoln pulls up at the rear of the store. Adele exits \n               carrying a couple of bags of Chinese take-out food.\n\n               INT. ABANDONED STORE\n\n               Adele enters the decrepit store. The others are inside. Brian \n               and Carrie are tied up. Brian watches Early intently as he \n               takes one of the bags from Adele. He begins opening one of \n               the carry out containers.\n\n                                     EARLY\n                         What the hell is this stuff?\n\n                                     ADELE\n                         It's Chinese food. It was the only \n                         place open. You said you was starving, \n                         you'd eat anyth...\n\n               Early opens another container. Stares curiously at the \n               contents.\n\n                                     EARLY\n                         Yeah but, what is it?\n\n                                     ADELE\n                         I don't know, they didn't speak too \n                         good English.\n\n               Early sets the container down.\n\n                                     EARLY\n                         And just what exactly are the Chinese \n                         doing here in the middle of the \n                         American desert anyway?... Didja get \n                         the beer?\n\n               Adele somewhat reluctantly hands Early a bottle of beer from \n               a second bag.\n\n                                     EARLY\n                         ...\"Chink\" beer!\n\n               Early notices that Brian is watching him intently. He mistakes \n               Brian's interest for hunger.\n\n                                     EARLY\n                         Oh hell, I'm sorry Bri. Adele, honey, \n                         untie Brian, he's starving over there.\n                              (pause)\n                         Carrie, you want some?\n\n               Carrie doesn't respond at all. Adele unties Brian.\n\n               Early pulls out his gun, puts it on the table next to him. \n               Brian sits across from Early. He watches as Early rummages \n               impatiently through the carry out paraphernalia.\n\n                                     EARLY\n                         Where's the damn forks and spoons \n                         at!\n\n               Frustrated, Early finally takes a gulp of Chinese food right \n               out of the container. It goes down rough.\n\n                                     EARLY\n                         ...Is it just me, or has this whole \n                         trip been goin' downhill ever since \n                         we ran outta Lucky Lager?\n\n               Brian picks up a pair of chopsticks, then reconsiders, puts \n               them back down and, like Early, gulps from the container.\n\n               NEARBY, Carrie sits quietly. As she listens to the two men \n               talk... she notices something on her arm. She lifts her arm \n               up to get a closer look.\n\n               HER POV\n\n               She sees that a few of the white down feathers still cling \n               to her. Closer... and she sees that one of the tiny feathers \n               is tinged with blood. The Gas Station Attendant's. It freaks \n               her.\n\n               ON BRIAN AND EARLY\n\n                                     BRIAN\n                              (quietly)\n                         How many people have you killed Early?\n\n               Early stops... thinks for a moment.\n\n               ON CARRIE\n\n               She tries to brush the bloodied feather away... but with her \n               hands bound, she can't reach it.\n\n               ON BRIAN AND EARLY\n\n                                     EARLY\n                         Well now, how many people d'you see \n                         me kill?\n\n               Brian shakes his head.\n\n                                     BRIAN\n                         None.\n\n               ON CARRIE\n\n               In quiet desperation, she raises her arm to her lips... and \n               blows the solitary blood tinged reminder away.\n\n               ON BRIAN AND EARLY\n\n               Early stares at Brian.\n\n                                     EARLY\n                         ...Well then, that's how many I \n                         killed.\n\n                                     BRIAN\n                              (unconvincingly)\n                         If you say so.\n\n                                     EARLY\n                         Damn right I do.\n\n               ON ADELE\n\n               Adele watches the tiny down feather drift to the floor.\n\n               ON BRIAN AND EARLY\n\n               Early picks up a different container and gulps some down. \n               After a moment...\n\n                                     EARLY\n                         You never killed anyone have you \n                         Bri'?\n\n               Brian shakes his head no.\n\n                                     EARLY\n                         You never even seen anybody killed, \n                         right?\n\n               Brian stops eating and looks at Early.\n\n                                     BRIAN\n                         What are you getting at?\n\n               Early leans closer to him.\n\n                                     EARLY\n                         You wanna tell me how'n the hell you \n                         gonna write a book 'bout somethin' \n                         you don't know nothin' 'bout?\n\n               Eye to eye, the two men stare at one another. Brian has no \n               answer.\n\n                                     EARLY\n                         Ya see what I'm sayin'?\n                              (beat)\n                         Ha!\n\n                                     BRIAN\n                              (nervously mimes the \n                              same)\n                         ...Ha.\n\n               Early goes back to gulping down his dinner. This time he \n               gets a spicy one.\n\n                                     EARLY\n                              (a nod toward the \n                              carry out container)\n                         ...watch out for that stuff, it bites.\n\n               Brian gazes at the cluster of Chinese carry-out food \n               containers. An ironic reminder of an earlier conversation. \n               He lets out a weak ironic laugh.\n\n                                     BRIAN\n                              (recollecting to \n                              himself)\n                         ...way too much MSG.\n\n               EXT. LINCOLN - TRAVELING - DAY\n\n               INT. LINCOLN DRIVING DOWN BACKROADS - DAY\n\n               Early is behind the wheel, not a care in the world. Adele \n               sits beside him playing with her camera. She turns and aims \n               the camera at Brian and Carrie in the back seat, their hands \n               are bound.\n\n                                     ADELE\n                         Smile.\n\n               Neither makes any attempt at smiling. Adele snaps their photo \n               anyway. In the front seat, she sits quietly for a moment \n               then leans over to Early and whispers something to him.\n\n                                     EARLY\n                         No way. I guarantee you he was \n                         breathing when I walked outta there.\n\n               Adele sits back quietly. Carrie wants to speak but doesn't.\n\n                                     EARLY\n                         Hey... Ain't we getting near the \n                         next murder site... Bri?\n\n                                     BRIAN\n                         Forget about it, doesn't matter.\n\n                                     EARLY\n                         Hell it don't...\n                              (beat)\n                         ...Hand me Brian's map there Adele. \n                         One day I'm gonna pass some store \n                         and see your book in the window. Me \n                         and Adele gonna buy a copy for our \n                         coffee table.\n\n               NEW ANGLE\n\n               Carrie silently fuming in the back seat. Brian stares at the \n               rope that binds his wrists.\n\n               EXT. OLD DESERTED MINE AREA - LATER THAT DAY\n\n               The Lincoln drives down the dirt access road and stops. They \n               all get out, Early unties Brian and Carrie.\n\n                                     EARLY\n                         Figured your hands might be starting \n                         to hurt.\n\n               Early looks down the hill to the old mine building.\n\n                                     EARLY\n                         Let's have a look. You girls coming?\n\n               Carrie's steely gaze answers Early's question.\n\n                                     ADELE\n                         Can I just wait here?\n\n               Early leans into the car and picks up Adele's camera.\n\n                                     EARLY\n                         Don't worry Bri', I'll take the \n                         pictures.\n                              (to Adele, with a \n                              kiss to her cheek)\n                         ...you stay here with Carrie.\n                              (to Carrie)\n                         You run off... Bri' pays the price. \n                         Karma, remember?\n\n               Pistol in hand, Early follows Brian down the hill. Adele \n               begins nervously playing with her yoyo.\n\n               Carrie watches as Brian and Early disappear around a bend in \n               the dirt road. Out of the corner of her eye, she hones in on \n               Adele's yoyo.\n\n               Adele becomes increasingly intense about manipulating the \n               yoyo, controlling it. Until she's lost in it. A momentary \n               refuge.\n\n                                     ADELE\n                         This is called walk the dog.\n\n               NEW ANGLE - EXTREME CU\n\n               A huge excruciatingly tight shot of the yoyo in slow motion. \n               Its string unraveling as it spins downward. Carrie pulls her \n               gaze away.\n\n               CARRIE'S POV\n\n               The desolate surrounding landscape, a bright blue sky, the \n               scrubbrush. And no one who can help them. Carrie turns and \n               looks over her shoulder down the hill.\n\n               EXT. OLD MINE BUILDING\n\n               The old mine building, rusted and deserted since the late \n               '20's.\n\n                                     EARLY\n                         So tell me... what happened here?\n\n                                     BRIAN\n                         Two brothers, prospectors, lived \n                         here. Up until a few years back.\n\n               Flash! -- Early takes a photo with the Instamatic.\n\n                                     EARLY\n                              (coaxing)\n                         ...and?\n\n                                     BRIAN\n                         They picked up hitchhikers... young \n                         men... and brought them back here.\n\n               Early scans the grounds.\n\n                                     EARLY\n                         Where'd they do it?\n\n               Reluctantly Brian leads Early toward the old mine building. \n               At the opening, Early hesitates.\n\n                                     EARLY\n                         Bri.\n\n               Brian stops in his tracks.\n\n               EXT. LINCOLN - TIGHT CLOSE UP\n\n               Adele's yoyo skitters across the gravel road surface.\n\n               EXT. OLD MINE BUILDING\n\n               Brian turns back to Early.\n\n                                     EARLY\n                         This ain't going to give me \n                         nightmares, is it?\n\n               EXT. LINCOLN - TIGHT CLOSE UP\n\n               Then in a snap!... the yoyo recoils into Adele's palm.\n\n               CARRIE'S POV\n\n               A distant empty ribbon of road.\n\n               ON CARRIE\n\n               Her eyes searching for anyone who could help.\n\n                                     ADELE (O.S.)\n                         This is one of my favorites... rock \n                         the cradle.\n\n               INT. OLD MINE BUILDING\n\n               Brian and Early are silhouetted against the dying sky. Flash!! \n               Early takes another photo.\n\n                                     BRIAN\n                         ...They asked them just before they \n                         were executed why they did it. They \n                         said \"to be famous.\"\n                              (beat)\n                         Why do you do it?\n\n               Flash!! Early takes a flash photo of Brian, momentarily \n               blinding him.\n\n                                     EARLY\n                         Do what Bri?\n\n               Early moves slowly toward Brian.\n\n                                     BRIAN\n                         We both know you didn't have to kill \n                         that gas station attendant.\n\n               Brian's eyes dart nervously to the gun dangling in Early's \n               palm. Flash!\n\n               EXT. LINCOLN - TIGHT CU\n\n               In slow motion Adele's hands manipulate the yoyo and string.\n\n               INT. OLD MINE BUILDING\n\n                                     BRIAN\n                         You wanted to.\n                              (beat)\n                         Why?\n\n               Flash! Brian flinches. Early remains silent as he closes in \n               on Brian.\n\n                                     BRIAN\n                         It make you feel good? Powerful?\n                              (Flash!)\n                         Superior, what? Come on Early, tell \n                         me something.\n                              (Flash!)\n                         Were you angry?\n\n               Early's boot lands toe to toe with Brian's shoe.\n\n                                     BRIAN\n                              (tentative)\n                         Who are you angry with Early... your \n                         mother, your father?\n\n               Eye to eye, the two men stand there.\n\n                                     EARLY\n                         You want to know about my daddy, \n                         I'll tell you about my daddy, Bri...\n\n               EXT. LINCOLN\n\n               Carrie walks over to Adele at the car. Adele doesn't miss a \n               beat with her yoyo.\n\n                                     CARRIE\n                         Adele, listen to me... Early's sick; \n                         he should be in a hospital.\n\n               Adele screws up the trick. She pulls the yoyo off her finger \n               and throws it in the back seat. She leans into the front \n               seat and cranks the radio up to the max. Closing her eyes, \n               she begins moving to the music, and tries to ignore Carrie.\n\n                                     CARRIE\n                              (shouting over the \n                              music)\n                         The police are after him, he's a \n                         murderer!\n\n                                     ADELE\n                              (uncertain)\n                         ...That's not true.\n\n                                     CARRIE\n                              (shouting)\n                         What?\n\n                                     ADELE\n                              (shouting back)\n                         That's not true!\n\n               NEW ANGLE\n\n               A POLICE CAR pulls into frame, unnoticed by Carrie and Adele \n               in the background.\n\n               INT. POLICE CAR\n\n                                     MALE OFFICER\n                         Let's take a look.\n\n                                     FEMALE OFFICER\n                         I'll call in the plate.\n\n               The Male Officer exits, unlocking his holster. The Female \n               Officer picks up the police radio and calls in the license \n               plate number.\n\n               EXT. LINCOLN NEAR MINE AREA\n\n               The radio is blaring. Adele continues to dance despite \n               Carrie's pleas.\n\n                                     CARRIE\n                              (shouting)\n                         ...I wouldn't lie to you, Adele. . . \n                         I saw him kill that man.\n\n                                     ADELE\n                              (defensive)\n                         Early didn't kill nobody, he wouldn't \n                         do that. I don't know why you're \n                         saying those things. You ain't my \n                         friend.\n\n               With that, Adele stops her dancing and turns away from \n               Carrie... To see the Male Officer walking toward them.\n\n                                     ADELE\n                         Please don't say anything Carrie.\n\n               The Male Officer continues toward them. It looks like he's \n               talking to them... but his voice is inaudible under the \n               deafening radio.\n\n               NEW ANGLE: FAVORING THE TWO POLICE OFFICERS\n\n               The Female Officer sticks her head out of the police car and \n               yells to her partner. He turns to listen.\n\n                                     FEMALE OFFICER\n                         We got a match, I'll call for back \n                         up.\n\n               As the Male Officer turns back, he sees Adele reach into the \n               front seat of the Lincoln. The Male Officer draws his revolver \n               and levels it at Adele.\n\n               NEW ANGLE: FAVORING ADELE AND CARRIE\n\n               Click! Adele shuts the radio off, total silence. As Adele \n               leans back out of the car, she turns, facing directly into \n               the barrel of the Male Officer's gun.\n\n                                     MALE OFFICER\n                         All right ladies, I want both of you \n                         to slowly step away from the ca...\n\n               BANG! A single gunshot rings out! The Male Officer jerks \n               back and falls to the ground. Adele screams! Carrie whips a \n               panicked glance around and sees... Early running toward them. \n               Brian, bewildered, follows behind.\n\n               BRIAN'S POV (RUNNING)\n\n               Ahead of him, he watches Early race past the wounded Male \n               Officer. He kicks the Officer's revolver out of reach and \n               rushes toward the police car.\n\n               Early fires his gun repeatedly as he charges the car!\n\n               The Female Officer pulls her gun and starts to get out of \n               the car, when... a shot shatters the windshield hitting her \n               in the chest. She collapses back onto the seat.\n\n               ON BRIAN\n\n               He stops at the sight of the wounded Male Officer. Shocked, \n               he watches the man writhing in pain. His hands clutching his \n               crotch. His blood oozes into the dirt.\n\n               Early approaches the police car. He sees the dead cop and \n               hears the radio dispatcher.\n\n                                     POLICE RADIO\n                         Officer needs help, shots fired, six \n                         Adam five, one eighty-seven, suspects \n                         wanted in multiple murders. Location \n                         unknown, last seen...\n\n               Brian is not sure what to do. He looks around... sees the \n               Officer's handgun lying in the dirt. He takes a step toward \n               it, when... another gunshot rings out! Brian stops. Looks to \n               the police car. He sees Early standing there, smoke belching \n               from the dashboard... the police radio is dead.\n\n               Early walks back toward Brian and the others. He steps over \n               to the injured Male Officer on the ground.\n\n                                     EARLY\n                         Tell me that don't hurt.\n\n               Early picks up the wounded cop's gun. He hands it to Brian \n               as he trains the .45 automatic at Brian's chest.\n\n                                     EARLY\n                         Shoot him. You'll be doing him a \n                         favor.\n\n               Brian looks to Early in disbelief.\n\n               OMITTED\n\n                                     BRIAN\n                         No, no, I can't.\n\n               Early cocks the pistol and pushes the barrel to Brian's head. \n               Brian looks down at the wounded cop who is writhing in pain.\n\n                                     EARLY\n                         (No,) It's the answer to all them \n                         questions of yers.\n\n               Brian won't do it. He drops the gun to the ground.\n\n                                     EARLY\n                         Now you'll never know.\n\n               Early cocks his pistol.\n\n                                     BRIAN\n                         ...Don't do it. Early, look at him, \n                         look at his face. That's not your \n                         father.\n\n               Early stares at the wounded cop's face.\n\n                                     EARLY\n                         I know that. That there is a policeman \n                         in a world of pain. And this is what \n                         you call a mercy killin'.\n\n               Early shoots the cop again. The cop lays still.\n\n               Early reaches down and takes the dead cop's handcuffs. He \n               casually points the little camera at the dead cop. Flash!!\n\n               EXT. LINCOLN - ON BACKROADS - LATER\n\n               The Lincoln hurtles down the road.\n\n               INT. LINCOLN\n\n               Early driving. Adele in the passenger seat looks bewildered. \n               Carrie and Brian in back, handcuffed, eyes hollow with \n               exhaustion and fear. Then out of the quiet...\n\n                                     EARLY\n                         I'm still waiting.\n\n               Adele looks across the seat to Early. Her face drained of \n               all expression.\n\n                                     EARLY\n                              (disappointed)\n                         Not so much as a simple \"thank you.\"\n\n               Adele at a loss. Finally... confused...\n\n                                     ADELE\n                              (empty)\n                         ...thank you.\n\n                                     EARLY\n                         Thank you for what?\n                              (becoming aggravated)\n                         What are you thanking me for Adele?\n\n                                     ADELE\n                              (hesitantly, she admits)\n                         ...I don't know.\n\n                                     EARLY\n                         Well Adele... it was for...\n                              (screaming at her)\n                         ...saving your fucking life back \n                         there!\n\n               She shrinks away from him.\n\n                                     EARLY\n                              (gesturing with his \n                              fingertips a fraction \n                              apart)\n                         Darlin' you were 'bout that far from \n                         spendin' the night at the morgue. \n                         You understand?\n\n                                     CARRIE\n                         He wasn't going to shoot her, you \n                         murdering son of a bitch!\n\n               Early looks into the rear-view mirror. Brian tries to defuse \n               the situation.\n\n                                     BRIAN\n                         Carrie... stop it.\n\n                                     CARRIE\n                              (explodes)\n                         What the fuck is wrong with you \n                         Brian!? If you'll stop taking notes \n                         for once and open your eyes... you'll \n                         see that he is a homicidal fucking \n                         killer. He is... for real!\n\n                                     BRIAN\n                         Shut up Carrie, please... just shut \n                         up!\n\n               EXT. LINCOLN ON DESERTED HIGHWAY - SUNSET\n\n               The Lincoln drives along an old deserted highway passing \n               occasional gas stations and dilapidated motels.\n\n               INT. LINCOLN ON DESERTED HIGHWAY - SUNSET\n\n               Early is driving. He notices something in the distance.\n\n               EARLY'S POV - NIGHT\n\n               Off in the distance... an oasis of greenery.\n\n               OMITTED\n\n               Sequence omitted from original script.\n\n               EXT. THE MUSGRAVE HOUSE - ARIZONA/UTAH BORDER - DUSK\n\n               A home in a secluded valley near the desert. It has a cactus \n               garden. The garden is illuminated so it can be enjoyed at \n               night.\n\n               Reveal... the Lincoln parked by the front door.\n\n               EXT. LINCOLN - CLOSER\n\n               Adele gazes out the passenger-side window. She's enthralled \n               by the sight of all the cacti.\n\n                                     ADELE\n                         ...I luv' cactuses 'cos they're so \n                         strong. Don't need much care really.\n\n               Reveal Brian handcuffed to the steering wheel beside her. He \n               cranes his neck to see out the rear window...\n\n               BRIAN'S POV\n\n               Early steps up to the front door of the house and rings the \n               bell. Carrie stands beside him. A light comes on inside. The \n               door slides open a crack and MRS. MUSGRAVE, an attractive \n               older woman with silver hair, peers out with a puzzled look.\n\n               INT. LINCOLN - SAME TIME\n\n               Adele rambles on.\n\n                                     ADELE\n                              (far away)\n                         ...You can forget about 'em forever \n                         and then look at 'em and they're \n                         doin' even better than before.\n\n                                     BRIAN\n                              (watching the house)\n                         Adele... we gotta do something before \n                         Early kills someone else.\n\n               BRIAN'S POV\n\n               Of Early and Carrie as they are let into the house.\n\n               INT. LINCOLN\n\n               Adele is still rambling on about her interest in cacti.\n\n                                     ADELE\n                         ...There ain't nothin' can kill 'em. \n                         They can live for two even three \n                         hundred years.\n\n                                     BRIAN\n                         Adele for god sake please lis...\n\n                                     ADELE\n                              (she glances over to \n                              Brian)\n                         There ain't nothing we could do. \n                         Once Early sets his mind on somethin', \n                         well thats the end of that.\n\n               Adele drifts back to the cacti.\n\n               INT. MUSGRAVE LIVING ROOM - A LITTLE LATER\n\n               CLOSE ON A PORCELAIN CACTUS\n\n               One of many we now reveal to be atop a fireplace mantle. \n               Adele leans in against the mantle and scrutinizes the cactus.\n\n               Carrie and Brian sit on the floor, back to back, their arms \n               bound around the leg of a piano by a pair of police handcuffs. \n               Mrs. Musgrave is standing nearby. She's overwhelmed. Numb. \n               She pours herself a glass of bourbon.\n\n                                     MRS. MUSGRAVE\n                              (to herself)\n                         It's just like in that dream I had. \n                         If only I had seen their faces.\n\n               She takes her drink and sits down on the couch nearby. Adele \n               drops down quietly on the chair next to her.\n\n                                     ADELE\n                              (tries to cheer Mrs. \n                              Musgrave up)\n                         You've got beautiful cactuses here, \n                         I just love 'em. My momma used to \n                         keep a garden.\n\n               Mrs. Musgrave downs most of her drink with the first try. \n               Distressed, her head slumps down.\n\n                                     EARLY (O.S.)\n                              (from the kitchen)\n                         Hey Bri... You ever stop to think \n                         that if you switched the two letters \n                         in your name...\n                              (entering the room)\n                         ...it would spell Brain.\n\n               Early, his pistol wedged in his belt, appears from the kitchen \n               eating a sandwich. Between bites... He walks over and rips \n               the phone out of the wall unit. He glimpses Mrs. Musgrave.\n\n                                     EARLY\n                         What's wrong with her?\n\n                                     ADELE\n                              (sorry for her)\n                         She had a dream that somethin' like \n                         this was gonna happen.\n\n               Early notices the glass of bourbon in her trembling hands. \n               He steps over to her and takes the glass away.\n\n                                     EARLY\n                         I'll bet she did.\n\n               He sets the glass down next to a recent picture of Mrs. \n               Musgrave and an ELDERLY MAN with silver hair.\n\n                                     EARLY\n                         Where's your husband?\n\n                                     MRS. MUSGRAVE\n                              (lying)\n                         ...I'm a widow.\n\n               Early looks at her, he doesn't believe her.\n\n               EXT. MUSGRAVE HOUSE - NIGHT\n\n               Everything is quiet beneath the star studded sky. The same \n               elderly man pictured with Mrs. Musgrave is studying the sky \n               through a powerful telescope. MR. MUSGRAVE is an amateur \n               astronomer. o.s. the SOUND of a door opening. Then footsteps.\n\n                                     MR. MUSGRAVE\n                              (excited)\n                         Is that you Peaches? Come, you must \n                         see Saturn tonight. The rings are \n                         sensational!\n\n               INT. STUDY - GLASS DISPLAY CASE\n\n               Early leans into frame, staring at the display case.\n\n               EARLY'S POV\n\n               Inside of it is a four foot long replica of the first ATOMIC \n               BOMB, \"Fat Boy.\" Faded newspaper articles on the wall indicate \n               Mr. Musgrave had something to do with the bomb's initial \n               construction. An old photo on the bookshelf shows a much \n               younger Mr. Musgrave in a '50's kitchen. He is laughing and \n               embracing a '50's style female mannequin.\n\n                                     MR. MUSGRAVE (O.S.)\n                         My oh my, this is quite rare, quite \n                         rare indeed. Come have a look...\n\n               Early's eyes drift over to a set of golf clubs that sit in \n               the corner of the room.\n\n               MR MUSGRAVE'S POV - THROUGH TELESCOPE\n\n               The planet Saturn and its glorious rings.\n\n                                     MR. MUSGRAVE (O.S.)\n                         Peaches?\n\n               OMITTED\n\n               THWACK!! The planet turns into a blur of light... then \n               blackness.\n\n               INT. LIVING ROOM - SAME TIME - ON BRIAN AND CARRIE\n\n               Brian and Carrie are still cuffed to the piano, in the \n               background we see Mrs. Musgrave and Adele looking out the \n               window into the backyard.\n\n                                     BRIAN\n                              (whispers to Carrie)\n                         You gotta talk to her. She looks up \n                         to you, she'll listen to you.\n\n                                     CARRIE\n                         I tried talking to her at the mine. \n                         It didn't work.\n\n                                     BRIAN\n                         Then try again, (it's our only \n                         chance.)\n\n               EXT. HOUSE - LATER\n\n               Early is leaning on a golf club looking through the telescope.\n\n                                     ADELE (O.S.)\n                         Early?\n\n               He pulls his eye away as Adele arrives.\n\n                                     ADELE\n                              (excited)\n                         Early, Mrs. Musgrave has the most \n                         beautiful little guest house out \n                         back and... well, no one's stayin' \n                         in it... it's just empty. And she \n                         said if me and you wanted to, well \n                         maybe we...\n\n               Suddenly, o.s., a scream pierces the moment!\n\n               Early and Adele turn toward the doorway to see Mrs. Musgrave \n               screaming. The older woman's eyes staring past Adele to the \n               floor nearby. Adele follows the terrified woman's gaze to \n               find... Mr. Musgrave's body lying on the floor. A bloodied \n               wound in the back of his head. All of Adele's enthusiasm \n               drains from her face.\n\n                                     EARLY\n                              (to Mrs. Musgrave)\n                         Well 'Peaches'... you're a widow \n                         now.\n\n               Mrs. Musgrave collapses to the floor.\n\n               INT. LIVING ROOM - SHORT WHILE LATER\n\n               Brian and Carrie are still cuffed to the piano. Across from \n               them, Early sits in an overstuffed chair looking through \n               Carrie's collection of erotic photography.\n\n                                     EARLY\n                              (to Brian)\n                         Have you seen this one? That don't \n                         leave much to the imagination now \n                         does it?\n\n               He looks at another photograph. Confused, he turns it upside \n               down, stares at it.\n\n               INT. THE DEN - SAME TIME\n\n               Mrs. Musgrave is laid out on the couch. Adele, deep in \n               thought, watches over the older woman. Finally Adele reaches \n               into her purse, pulls out her small potted cactus then walks \n               across the room to a table. Its top is covered with small \n               potted cacti. She gently places hers among them.\n\n               ON MRS. MUSGRAVE\n\n               Mrs. Musgrave begins to regain consciousness. Her eyes open \n               to find... Adele standing over her. Adele brings her finger \n               to her lips -- Shhhh.\n\n               INT. LIVING ROOM\n\n               Early looks through several more photos. He stops on one of \n               a nude woman's torso. Early looks at it for a moment... then \n               extends the photo out toward Carrie, comparing it to her.\n\n                                     EARLY\n                              (smiles and shakes \n                              his head in disbelief)\n                         That's you ain't it?\n\n               Carrie doesn't answer him. Then, in the background directly \n               behind Early... Adele and Mrs. Musgrave quietly appear. Carrie \n               notices them as they start to cross the hallway to the \n               kitchen. Early sees Carrie's eyes glance past him. He turns \n               to see why... when...\n\n                                     CARRIE (O.S.)\n                         You're right Early...\n\n               Early stops. Looks back to Carrie. Brian also turns to her \n               curiously.\n\n                                     CARRIE\n                         ...It is me. Do you like it?\n\n               Early looks at the photo again. Adele and Mrs. Musgrave now \n               cross safely to the kitchen. Carrie eyes meet Early's. He \n               smiles, pulls the nude photo of her close to his face... and \n               licks it.\n\n               INT. KITCHEN - SAME TIME\n\n               Adele quietly opens the back door.\n\n                                     ADELE\n                         Go on now... please.\n\n               Mrs. Musgrave is confused, is it a trick? She looks into \n               Adele's eyes... and knows it's not. The old lady turns and \n               walks out into the dark desert. Adele stands at the open \n               door, watching Mrs Musgrave escape.\n\n                                     ADELE\n                              (in a whisper)\n                         ...Call me.\n\n               INT. LIVING ROOM - A MOMENT LATER\n\n               Early finishes looking through the photographs. He closes \n               the cover of the portfolio.\n\n                                     EARLY\n                         Well they say there's room fur all \n                         kinds in California... and that's \n                         where we're gonna be this time \n                         tomorrow. California.\n                              (beat)\n                         Adele honey?\n\n               INT. KITCHEN\n\n                                     EARLY (O.S.)\n                         Adele?\n\n               Early enters, and sees Adele standing at the back door. Adele \n               turns to face him. Early looks past her into the night and \n               realizes what she's done. He strides across the room pulling \n               the pistol from his waistband.\n\n               AT THE KITCHEN DOOR\n\n               Early pushes Adele out of the way.\n\n                                     EARLY\n                              (shouting)\n                         Peaches! Come on back here. There \n                         ain't nothin' for you to be afraid \n                         of.\n\n               EARLY POV - EXT. CACTUS GARDEN\n\n               Aside from the occasional pools of light illuminating the \n               cacti, it's very dark. There's no sign of Mrs. Musgrave.\n\n               INT. KITCHEN\n\n               He steps outside and starts firing his gun into the \n               blackness... bullets THUNK into the cacti.\n\n                                     EARLY\n                              (shouting over the \n                              gunfire)\n                         Nobody wants to hurt you Peaches!\n\n                                     ADELE\n                         Early! Stop!!\n\n               Desperate, Adele grabs a large potted cactus. She rushes \n               toward Early. Swinging the cactus like an unwieldy bat, she \n               pummels the side of his head. He stumbles forward, \n               disappearing into the darkness. Adele stands outside the \n               kitchen door, bewildered. Then...\n\n                                     EARLY (O.S.)\n                         Oww! Oww!! -- FUCK!!!!\n\n               Early re-emerges from the shadows. Adele's eyes widen when \n               she sees him. His cheek has long bloody gashes where the \n               cactus ripped the flesh.\n\n                                     EARLY\n                              (perplexed)\n                         Honey... What do you think you're \n                         doin'?\n\n               Adele starts to cry.\n\n                                     EARLY\n                         Oh, n'jus what in hell you crying \n                         'bout? I'm the one got hit.\n\n                                     ADELE\n                         I changed my mind, Early. I'm not \n                         gonna climb up that Hollywood sign \n                         with you... I decided. I think your \n                         mean, and you hurt people.\n\n               A look comes over Early's face that we've never seen before. \n               That he's never felt before. Hurt. He doesn't know how to \n               deal with it. And he definitely doesn't like it.\n\n               INT. LIVING ROOM - SAME TIME (INTERCUT WITH PREVIOUS SCENE)\n\n                                     BRIAN\n                         Carrie, watch for Early.\n\n                                     CARRIE\n                         What are you going to do?\n\n                                     BRIAN\n                         I'm going to try and lift the end of \n                         the piano. If I can... slide your \n                         cuffs free.\n\n               Carrie glues her eyes to the kitchen doorway. Brian presses \n               his back up under the belly of the piano and using all his \n               strength manages to lift the piano an inch off the floor. \n               Carrie slides her cuffs out from under the leg.\n\n                                     CARRIE\n                         What about you?\n\n                                     BRIAN\n                         I don't know.\n\n               Carrie's eyes dart back toward the kitchen. Then she notices \n               a chair nearby.\n\n                                     CARRIE\n                         Can you lift it again? Just lift it, \n                         hurry.\n\n               Carrie grabs the chair. As Brian lifts the piano, she pushes \n               the chair beneath the underside of it. It holds the piano \n               suspended an inch off the floor. Brian drops to the floor \n               and slips the cuffs free.\n\n               When... a solitary gunshot rings out from the cactus garden.\n\n               A moment later, Early steps quietly into the room. He's \n               pulling the last few cactus needles from his face. He sees \n               Brian and Carrie standing.\n\n                                     EARLY\n                         You two been busy in here.\n\n                                     BRIAN\n                         What happened to Adele?\n\n                                     EARLY\n                         Well, let's put it this way.\n                              (beat)\n                         I need me a new woman.\n\n               A shocked silence. Brian and Carrie look to one another. \n               Carrie moves toward the kitchen but Early stops her! Brian \n               rushes at him. Early sticks the .45 automatic in his face!\n\n                                     EARLY\n                         Sorry about this Bri...\n\n               He starts to squeeze the trigger.\n\n                                     CARRIE\n                              (desperate)\n                         Early, don't.\n\n               Early stops. He looks to Carrie.\n\n                                     CARRIE\n                         I'll do whatever you want. You want \n                         me to go with you, I'll go with you. \n                         Just don't kill him.\n\n               Early deliberates the situation, then eases up off the \n               trigger... and smiles to Brian.\n\n               Then, without warning, he hits Brian over the head with the \n               butt of the .45 automatic. Brian falls to the floor \n               unconscious.\n\n               OMITTED\n\n               EXT. MUSGRAVE HOUSE - EARLY MORNING\n\n               As Early finishes tieing one of the replicant bombs, Little \n               Boy onto the hood. He reaches down and grabs a six pack of \n               beer on the ground and shoves it in the back seat, then slides \n               into the driver's seat next to an anxious Carrie. Carrie is \n               now wearing one of Adele's floral dresses.\n\n                                     EARLY\n                         Think anyone will notice?\n\n               Carrie doesn't answer, Early laughs.\n\n               INT. LINCOLN\n\n               Early looks out over the expanse of the desert. He sees a \n               dirt fire road.\n\n                                     EARLY\n                         I'll bet there's a 'door' out there... \n                         save us some time.\n\n               Carrie doesn't understand what he means. Nonetheless, she \n               nods her head in agreement.\n\n               EXT. MUSGRAVE HOUSE\n\n               The Lincoln heads out, past the cactus garden, into the \n               darkness.\n\n               THE LINCOLN'S HEADLIGHTS REVEAL\n\n               Adele's lifeless body on the ground near her beloved cacti.\n\n               FADE TO BLACK WITH THE DEPARTING HEADLIGHTS\n\n               INT. MUSGRAVE LIVING ROOM - MORNING\n\n               Brian is handcuffed on the floor. His eyes open slowly as he \n               begins to regain consciousness. He senses someone behind \n               him. He pivots around to see Mrs. Musgrave kneeling down to \n               help him.\n\n               EXT. DESERT - SAME TIME\n\n               In the distance, a cloud of dust reveals the Lincoln, \n               traveling at high speed along the dirt fire road.\n\n               INT. LINCOLN - SAME TIME\n\n               Early still behind the wheel. Carrie sits up against the \n               passenger side door. She is tense and guarded. Out the window, \n               nothing but empty desert.\n\n                                     EARLY\n                         Pass me a beer hon'.\n\n               Carrie quietly responds. She kneels on the front seat and \n               reaches into the back. She grabs a bottle by its neck, and \n               pulls it from the six pack of beer. Bottle in hand, she \n               hesitates a moment...\n\n               NEW ANGLE: EARLY'S POV IN THE DRIVING MIRROR\n\n               Early watches Carrie.\n\n                                     EARLY\n                         You wanna hit me with that, huh?\n\n               NEW ANGLE\n\n               Carrie reconsiders and sits back in the far corner of the \n               front seat.\n\n                                     CARRIE\n                              (not looking at him)\n                         No.\n\n               She hands the bottle to him. Early reaches out for the beer, \n               but instead of taking it, he clasps his hand over hers.\n\n               He looks at her and begins to squeeze...\n\n                                     EARLY\n                         Stop lyin'... I can see right through \n                         you.\n\n               Early squeezes even harder -- Carrie begins to wince with \n               pain. She waits for the glass bottle to shatter in her hand.\n\n                                     EARLY\n                         Who d'ya think you're foolin'?\n                              (beat)\n                         I know you better than you think...\n\n                                     CARRIE\n                              (confused)\n                         ...You're hurting me...\n\n               Early hits the brakes. The car screeches to a halt in a cloud \n               of dust. Early squeezes on her hand even harder and begins \n               to drag her toward him.\n\n                                     EARLY\n                         I seen the way you been lookin' at \n                         me since we met... Snappin' my photo \n                         when you thought I wasn't lookin'. \n                         Wanting me...\n\n               Carrie turns her head away. Early pulls her closer.\n\n                                     EARLY\n                         I saw you when I killed that boy...\n\n               He grabs her hair with his other hand... Pulls her head around -- \n               forcing her to look at him. Early has Carrie right up against \n               him, looking right into her eyes.\n\n                                     EARLY\n                              (whispers)\n                         You were plenty hot.\n\n                                     CARRIE\n                              (explodes)\n                         You sick twisted fuck! You don't \n                         know shit about me.\n\n               She struggles trying to free herself. Early, his face only \n               inches from hers, smiles...\n\n                                     EARLY\n                         Sick... some people might say takin' \n                         photos of me and Adele humpin' in \n                         the back of the car is sick.\n\n               Carrie struggles even harder, but Early tightens his hold.\n\n                                     EARLY\n                         ...You know what I mean?\n\n                                     CARRIE\n                         ...I know I'd love to smash this \n                         bottle right in your fucking face.\n\n               Suddenly... Early releases Carrie, taking the beer from her. \n               Carrie retreats back into the corner of the passenger side.\n\n                                     EARLY\n                         That's better... Honesty... I like \n                         that in a woman.\n\n               He gives her a grin, then opens the bottle.\n\n                                     EARLY\n                         But I'll tell ya... when we get to \n                         California, we're gonna have to do \n                         something 'bout that gutter mouth of \n                         yours.\n\n               Early takes a gulp of beer.\n\n               EXT. LINCOLN - SAME TIME\n\n               Early throws the bottle of beer out the window (it ain't \n               Lucky Lager), slams the Lincoln into \"drive\" and accelerates \n               along the dirt road.\n\n               INT. MUSGRAVE LIVING ROOM\n\n                                     MRS. MUSGRAVE\n                         He's pulled out all the lines. The \n                         nearest phone is twenty miles east \n                         of here.\n\n               Brian notices an old pickup truck parked outside.\n\n               EXT. MUSGRAVE HOUSE - THE NEXT MOMENT\n\n               An anxious Brian hustles into the cab of the pickup truck. \n               Some tools are in the back. Brian still wears the handcuffs \n               around his wrists. Mrs. Musgrave stands near the front door.\n\n                                     BRIAN\n                         Which way did they go?\n\n                                     MRS. MUSGRAVE\n                              (pointing)\n                         He took the fire road.\n\n                                     BRIAN\n                         Take your car and get to that phone. \n                         Call the police.\n\n               Brian starts the pickup and drives off.\n\n               EXT. DESERT - LATER\n\n               The wind has picked up. An old wooden gate blocks the fire \n               road. On either side, barbed wire as far as the eye can see. \n               The Lincoln roars into frame and powers through the barrier.\n\n               The gate smashes into splintered pieces of wood.\n\n               INT. LINCOLN - SAME TIME\n\n               Carrie leans against the passenger door. Early's eyes scan \n               the open desert -- looking for the elusive 'doors.' Carrie \n               reaches for her pack of cigarettes. Early, without a word, \n               reaches out and takes the pack from her. He crumples it up \n               and throws it out the window.\n\n               NEW ANGLE\n\n               Carrie's eyes go to the instrument panel. The temperature \n               gauge is in the red.\n\n               EXT. DESERT\n\n               The pickup truck arrives at a crossroads and skids to a halt. \n               Brian tries to guess which direction to take. Then he spots \n               Early's discarded beer bottle up ahead. The truck accelerates \n               straight ahead, tires spinning.\n\n               EXT. DESERT - LATER, THE SUN IS ON THE HORIZON\n\n               The winds continue to escalate, blowing harder and harder. \n               The Lincoln approaches on the fire road. A trail of steam is \n               streaming out from under the hood, blinding Early's view.\n\n               Finally, Early slams on the brakes and skids 180 degrees to \n               a halt... Steam pours out of the Lincoln's grill. The Lincoln \n               has had it.\n\n               Early is indifferent and looks around. About a hundred yards \n               away, barely visible through the growing sand storm, an old \n               1950's style building.\n\n               INT. LINCOLN\n\n               Early opens the back door. He grabs a box of supplies (some \n               rope, a kerosene lamp etc.)\n\n                                     EARLY\n                         Come on.\n\n               Carrie slowly begins to respond. She slides across the front \n               seat.\n\n               NEW ANGLE: CLOSE ON THE INSTRUMENT PANEL\n\n               Carrie's hand crosses frame and pulls out a knob on the dash.\n\n               EXT. DESERT - LATE AFTERNOON\n\n               The sun is starting to set behind a distant mountain range. \n               In the far distance... The pickup truck, revealed by its \n               trail of dust, crosses the vast landscape.\n\n               EXT. '50'S DESERT HOUSE\n\n               Early and Carrie struggle through the growing sand storm. \n               Carrie throws a last curious glance back to the Lincoln as \n               they reach the front door.\n\n               INT. '50'S DESERT HOUSE\n\n               The front door is kicked open. Early enters the room with \n               Carrie in tow.\n\n               CLOSE ON EARLY\n\n               He looks around the room... A smile forms on his face.\n\n                                     EARLY\n                         Howdy, my name's Early Grayce and \n                         this is my girl Carrie. I hope you \n                         don't mind us bargin' in like this \n                         but a... we was on our way to \n                         California when our car broke down, \n                         and...\n\n               EARLY'S POV (AS HE EXPLAINS)\n\n               A living room fully decorated in '50's furniture. Sand covers \n               everything... Including...\n\n               A FAMILY OF FOUR MANNEQUINS placed around the room: The father \n               sits in front of the TV... The mother (the same mannequin as \n               in Mr. Musgrave's old picture) is toppled over a kitchen \n               counter... The little girl is seated at a table... The little \n               boy is playing with his toy plane on the floor.\n\n                                     EARLY (O.S.)\n                         Well... it's gettin' pretty rough \n                         out there, so if it's all the same \n                         to you, we'll be staying the night.\n\n               EXT. '50'S HOUSE\n\n               Early slams the front door shut.\n\n               CAMERA PULLS AWAY - REVEALING\n\n               The building is a single story '50's home of extremely cheap \n               construction. It's in bad condition.\n\n               EXT. DESERT - THE SMASHED WOODEN GATE\n\n               The last rays of the setting sun reveal the pickup truck \n               heading toward the smashed remains of the wooden gate. The \n               pickup truck hurtles through the opening left by the Lincoln.\n\n               NEW ANGLE\n\n               On a collapsed old wooden sign. It lies on the ground a few \n               feet away from the gate posts.\n\n               \"DREAMLAND\" - NUCLEAR TEST RANGE DANGER - KEEP OUT\n\n               INT. '50'S DESERT HOUSE - NIGHT\n\n               Wind and sand blow freely through the remains of the windows. \n               A solitary kerosene lamp dimly illuminates the living room \n               area. Its flickering light finds... Early, stripped to the \n               waist, crouched over the broken TV set. He fidgets with the \n               knobs. Then the mangled rabbit ears antenna. Carrie sits on \n               some blankets in the corner next to the couch. She's scared \n               to death. Her eyes scan the battered room. Debris everywhere.\n\n               Amidst all of it, Carrie's erotic photographs have been placed \n               about the room.\n\n               ON EARLY\n\n               Still unable to get the TV to work, he smacks it a good one \n               on the side.\n\n               With the smack!... Carrie whips her look back toward Early... \n               To find he's lost interest in the TV. He turns toward Carrie. \n               Stares at her for a moment. Then with a hint of a smile, he \n               begins to move toward her. The time has arrived.\n\n               He reaches down, grabs her by the shirt and pulls her to her \n               feet. Carrie doesn't resist. He's rough with her as he kisses \n               her on the lips. Carrie pulls her mouth away from his. She \n               seems confused, unsure of her feelings. Early watches her, \n               until her eyes come back to his. Then she steps forward \n               crowding her body against his, as she slips one hand around \n               his neck and kisses him deep and hard...\n\n               Suddenly Early breaks the kiss and backhands Carrie hard \n               across the face. She lands on the floor several feet away, \n               the palm of her right hand is bleeding.\n\n               Early looks down to his waist to find a large piece of glass \n               protruding from his side.\n\n               He pulls the glass shard out, blood drips down his side and \n               onto his jeans.\n\n               Carrie gets up and races into the back bedroom, frantically \n               looking for a way out, there is none. On the bed the two \n               adult mannequins now lie naked. They have been placed, \n               intertwined in a grotesque sexual position.\n\n               Carrie turns and rushes back toward the door. Early intercepts \n               her and throws a punch to her stomach, which doubles her \n               over. Then Early sends a second punch to her face, she \n               stumbles backward, landing onto the bed amongst the \n               mannequins. Early begins undoing his belt.\n\n                                     EARLY\n                              (friendly)\n                         You'll like it...\n\n               A violent gust of wind sends several of the erotic photos \n               swirling through the air. One of the photos whips across \n               Early's chest. The wind holds it there momentarily.\n\n                                     EARLY\n                         Not a lot, but you'll like it.\n\n               Early peels Carrie's photo off him, the blood from his wound \n               covers the back of it. He slaps it against the nearest wall. \n               It sticks. He walks toward her.\n\n               INT. PICKUP TRUCK - BRIAN'S POV\n\n               The high winds have turned into a full fledged sandstorm. \n               Brian is still driving dangerously fast. The dim lights of \n               the old pickup illuminate only a short stretch of dirt road \n               ahead and the swirling sand.\n\n               He passes a road sign: 'DEVASTATION DRIVE'\n\n               Then... As the pickup truck comes around a corner Suddenly... \n               directly in front of him -- Headlights!!\n\n               Brian reacts... too late!!\n\n               The pickup truck ploughs into the vehicle, and tumbles end \n               over end through the open desert, before finally coming to \n               an abrupt halt.\n\n               INT. '50'S DESERT HOUSE - NIGHT\n\n               With each thrust of Early's body, Carrie's badly bruised \n               face contorts with pain and hatred\n\n               FADE IN:\n\n               EXT. DESERT\n\n               Sand blows in through the smashed windshield of the wrecked \n               pickup truck. Brian is upside down with his eyes shut. A \n               trickle of blood runs down his face. Camera booms up a dirt \n               slope to reveal the Lincoln, beyond it on the hill above \n               sits the desert house. The glow of the kerosene lamp is \n               visible through the windows.\n\n                                                                  FADE OUT:\n\n               EXT. DESERT HOUSE - DAWN\n\n               The storm is over... No sand blowing. No wind. No nothing.\n\n               COMPLETE SILENCE!!!!\n\n               The dawn light reveals the devastated '50's house to be one \n               of a cluster, set at the end of a 'Doom Town' cul-de-sac.\n\n               INT. '50'S HOUSE - SAME TIME\n\n               In the darkened bedroom, Early's solitary figure rustles \n               atop the bed. Slowly, he awakens. His eyes open. Across the \n               bed, a pair of handcuffs is locked around the bedpost. In \n               the other cuff is Carrie's motionless hand.\n\n               Then, out of the corner of his eye, Early sees something in \n               one of the nearby rooms. Curious, he stands, shoves the .45 \n               automatic in his waistband and walks toward the hallway.\n\n               As he passes through the living room and enters the hallway, \n               his face contorts with a strange sense of wonderment.\n\n               EARLY'S POV\n\n               A blinding light is shafting through cracks and broken gaps \n               around the front door frame... It looks like a magical \"door\" \n               shrouded in a wall of light!\n\n               ON EARLY\n\n               In disbelief he pulls his gaze away from the \"door\"... and \n               sees through a window at the opposite end of the house... \n               the morning sun rising. With that he turns his attention \n               back to the front door!\n\n                                     EARLY\n                         I knew there was doors out here!\n\n               He walks toward the doorway of light. He grins as he opens \n               the \"door\" and steps through it. The sunlight momentarily \n               blinding him.\n\n               EARLY'S POV\n\n               A black shadow hurtles toward him out of the brightness... \n               Eventually it blocks out all the light until... WHAAMM!!!!\n\n               EXT. DOOR\n\n               A blow knocks Early back through the doorway. He slams to \n               the ground, on his back. The gun falls from his jeans and \n               slides across the floor. A look of joyful amazement over the \n               blood covered remains of his face, he tries to get up, but \n               can't.\n\n               EARLY'S POV\n\n               Brian, silhouetted, steps into the doorway. He holds a shovel \n               raised, ready to deliver a second, fatal blow... but when he \n               sees Early incapacitated on the floor, he lowers the shovel \n               to his side. His handcuffed hands reach down and picks up \n               Early's gun. He trains it on Early, then walks around him to \n               enter the house. Brian's eyes slowly adjust to the interior...\n\n               EARLY'S POV\n\n               From on his back, Early looks out the open \"door.\" He sees \n               two large shards of glass standing vertical in the sand, \n               reflecting the sun's rays back toward the house. He realizes \n               that the glass, placed there by Brian, is what created the \n               effect of the \"door.\" He starts to laugh.\n\n                                     EARLY\n                              (laughing)\n                         That was damn tricky of you Bri.\n\n               Brian searches for Carrie.\n\n                                     BRIAN\n                         Carrie... Carrie... it's over.\n\n               ON BRIAN\n\n               He moves into the back bedroom and finds Carrie. She is \n               crouched on the floor, handcuffed to the bedframe. He moves \n               to help her. As he gets closer, he sees her badly bruised \n               face and realizes what's taken place throughout the night.\n\n               Brian stops. The sympathetic expression on his face changes. \n               With hatred in his eyes, he pivots around, strides out of \n               the bedroom and moves toward the front of the house to Early. \n               in the front room Gun in hand, Brian rushes back into the \n               room. He wields the pistol toward the ground where Early \n               lay... but Early's not there.\n\n               Brian's eyes dart around the room... then suddenly, from \n               behind him, Early grabs him!\n\n               He wrenches Brian's head back and whips his belt buckle knife \n               toward his throat!\n\n               Brian manages to lift his hands to his neck an instant before \n               the knife tears through his flesh. The knife slices a vicious \n               wound across the back of Brian's right hand. He drops the \n               gun to the floor. Brian elbows Early in the ribs and pulls \n               away from him. He reaches to the ground for the gun, but \n               Early kicks him in the stomach and sends him crumbling to \n               his knees.\n\n                                     EARLY\n                         Go ahead Bri, ask me something.\n                              (beat)\n                         You wanna know how I'm feeling'? \n                         Well I'd say I'm feelin' pretty damn \n                         good.\n\n               On all fours, Brian reaches out for the gun, but Early kicks \n               it across the room.\n\n                                     EARLY\n                         How 'bout you? You feelin' good?\n\n               Another kick to Brian's chest. The wind rushes out of him.\n\n                                     EARLY\n                         ...'Cause you sure don't look so \n                         good.\n                              (beat)\n                         Or maybe you're feelin'... powerful. \n                         That it, you feeling powerful? \n                         Superior? I know I am.\n\n               Early unloads a ferocious kick to the side of Brian's face! \n               His head snaps back, his handcuffed arms buckle and he falls \n               flat to the ground.\n\n                                     EARLY\n                         What? Am I angry with my daddy? Now \n                         why would I be angry with my daddy... \n                         you're the one hit me with the shovel. \n                         And you're the one's gonna wish you \n                         hadn't.\n\n               With one last effort, Brian manages to pull himself back up \n               to his knees. He focuses on the gun ahead of him and tries \n               to crawl toward it. But Early's foot shoves Brian. He flips \n               over onto his back, landing in front of the bedroom doorway. \n               Early moves toward him, knife in hand.\n\n               As Early moves toward Brian, unexpectedly from inside the \n               doorway, the torso of the female child mannequin whips past. \n               Her hardened molten face slams into Early's bloodied face. \n               Early stumbles backward.\n\n               Brian crawls for the gun and grabs it. From his knees he \n               turns, steadies the weapon, takes a quick breath... and fires. \n               Hitting Early square in the chest!\n\n               Early falls to the ground on his back. Brian lifts himself \n               to his feet.\n\n               He sees that Carrie has dragged the bedframe to the doorway, \n               and in her free hand she holds the child mannequin by the \n               leg.\n\n               Gun in hand, Brian steps over to Early. Early's body is still. \n               Blood oozes from the hole in his chest. On a silver chain \n               around his neck is the key to Brian and Carrie's handcuffs. \n               Brian reaches down and grabs the keys... when suddenly Early's \n               arm springs up from his side. His hand grabs Brian's shirt \n               collar. Brian is startled by the move, then realizes that \n               Early's hold is weak. His fingers tremble. Finally his arm \n               drops back down to his side.\n\n                                     EARLY\n                         Hey Bri... I think I need a doctor. \n                         What d'ya say?\n\n               The two men stare at one another for a moment... then Brian, \n               with one hand still on the handcuff keys, shoves the .45 \n               automatic firmly under Early's chin.\n\n               CLOSE ON BRIAN\n\n                                     BRIAN\n                         ...Sorry 'bout this Early.\n\n               o.s. BANG!! rings out as...\n\n               CLOSE UP on the chain and keys snapping free from Early's \n               neck.\n\n               CLOSE UP on Brian's handcuffs hitting the dusty wooden floor.\n\n               CLOSE UP on Carrie's handcuff swinging empty against the \n               rusty bedpost.\n\n                                                             TRANSITION TO:\n\n               A montage of the photographs taken throughout the journey.\n\n               Last image: A book \"On The Road To Madness\" By Brian Kessler.\n\n                                         THE END\n\n\n\n\n\nKalifornia\nWriters :   Tim Metcalfe\nGenres :   Crime  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Brian Kessler (David Duchovny) is a graduate student in psychology and a journalist, who has written an article about serial killers, which draws interest from a publisher that offers him a book deal. After the book deal advance is spent, Brian realizes that he needs to start working on finishing his book. His photographer girlfriend Carrie Laughlin (Michelle Forbes) persuades him to move to California, and they decide to drive from Pittsburgh, Pennsylvania to California and visit infamous murder sites along the way. Short on funds, Brian posts a ride-share ad.\nMeanwhile, psychopathic parolee Early Grayce (Brad Pitt) has just lost his job. His parole officer (Judson Vaughn) learns of this and comes to the trailer park where Early lives with his young girlfriend Adele Corners (Juliette Lewis). Early refuses the officer's offer of a job as a college janitor, saying he wants to leave the state. The officer informs him that if he does not keep the appointment, he will be returned to prison. Early decides to go to the job interview. However, when he is on his way out, he is confronted by the landlord over non-payment of rent. Early grows violent and spins out in his car, chasing the man all over the park.\nEarly spies the ride-share ad at the college and calls Brian, who agrees to meet him the following day. Early sends Adele ahead then murders the landlord before joining Adele to wait for Brian and Carrie. Carrie's first response to seeing the rough-hewn couple is to suggest Brian turn the car around and leave, but Brian asks her to give the plan a chance, and she reluctantly agrees.\nOn the road, unbeknownst to his companions, Early murders a man in a gas station bathroom and steals his money. When they arrive at the first hotel, he cuts Adele's hair to match Carrie's. At another hotel, Early invites Brian out to play pool, leaving Adele and Carrie alone together. Adele reveals to Carrie that she is a rape victim and that she views Early as her protector, even though her mother did not approve because Early had just been released from prison. Carrie is alarmed by Brian's growing fascination with Early and nonchalant response to the news that Early has been in prison. She gives him an ultimatum: either they rid themselves of Early and Adele, or she will leave.\nAt the next gas station, Carrie glimpses a newscast with footage of Early and the announcement he is a suspected murderer. Early kills the gas station attendant and continues the trip with the couple as hostages. They encounter two police officers, whom Early shoots. They next come to the home of an elderly couple. Early beats the man to death, but Adele allows the woman to flee. As Early rushes to find the woman, Adele confronts him and says she wants nothing more to do with him. Early fatally shoots Adele, strikes Brian on the head, and kidnaps Carrie.\nBrian regains consciousness, and the elderly woman gives him the keys to her truck. Brian arrives at an abandoned nuclear testing site and surprises Early, hitting him in the head with a shovel. Brian finds Carrie bloodied and handcuffed to a bed, having been sexually assaulted. Early, who was only stunned, attacks Brian and they struggle until Early is hit over the head by Carrie. When Early continues the attack, Brian kills him.\nThe film ends with Brian and Carrie in a California beach house. Carrie, who now sports long hair (eschewing the short style that Early had Adele emulate during the trip), tells Brian that a gallery is interested in her art, and he suggests they go out to celebrate."}