{"title": "Legend", "full_text": "LEGEND\nORIGINAL SCREENPLAY by WILLIAM HJORTSBERG\n\n2nd Draft Revised 10 March 1984\n\n\n1EXTERIOR FOREST NIGHT\n\nHuge trees taper upward like columns supporting the roof of heaven. \nMoonlit dewdrops spangle a delicate spiderweb. The setting is \ntranquil and utterly majestic.\n\nOver the brow of a distant hill, a pair of brilliant light beams \nscintillate in an etheral ballet.\n\nNumerous small animals gather to behold this wonder. They stand on \nthe hillcrest, staring down as if at the Nativity.\n\nSquirrels, quail, hedgehogs, mice, pheasants and badgers, natural \nenemies untied by the radiant LIGHT. \n\nA magnificent stag watches, numbers of tiny songbirds perched in his \nbranching antlers.\n\n1A EXTERIOR FOREST NIGHT \n\nPULL BACK: from the hilltop, through ferns and brambles to a steep \nembankment where umbrella-sized toadstools cluster. \n\nA snarling face APPEARS under a mushroom cap. This is BLIX a brigand \ngoblin hunter. Clad in decrepit armor and slung with savage weapons, \nhe is a terrifying figure. \n\nBlix WHISTLES. The SOUND is unexpectedly lovely, a nightingale's \ncall. \n\nFurther back, three other goblins return the BIRDCALL. They bristle \nwith weaponry. POX is a pig-faced fop wearing tattered lace and \nflithy brocade. Tiny BLUNDER and TIC are both masked by grotesque \nhelmets. Swarms of gnats drone above their hidden heads. They creep \nforward to join Blix. \n\n1B GOBLIN'S POV : HILLTOP \n\nThe distant animals silhouetted by dazzling LIGHT. \n\n1C EXTERIOR FOREST NIGHT\n\nBlix signals an advance and the goblins creep through the forest \ntowards the hilltop.\n\nA moth lands on a twig two feet from Tic's head. He turns. His \nincredibly sticky tongue uncoils from within the helmet seizing the \nmoth and retracting with it, quick as a flash.\n\nAs the goblins near the hilltop, the fantastic LIGHT gradually \nilluminates their hideous features. A tiny mouse runs out of the \neye-slits on Blunder's helmet, circles the crest, and runs back in \non the other side. \n\nBlix signals silently for the other goblins to spread out.\n\nThe goblins crawl separately through the underbrush.\n\nPox comes snout to snout with a wild piglet. Terrified, the little \nshoat SQUEALS and scampers off. \n\n2 DELETED\n\n2A CLOSE : ANIMALS \n\nAlerted by the NOISE, they face the impending threat. The startled \nanimals run for cover down the hillside. \n\n3 DELETED \n\n3A EXTERIOR FOREST NIGHT \n\nBlix charges forward, brandishing his crossbow. \n\nBLIX: Kill. . . . ! \n\nBlix runs over the top of the hill and down into the gully beyond, \nclosely followed by Tic, Pox, and Blunder. Brilliant clumps of \nforget-me-nots are everywhere, like disgarded jewels. \n\n3B GOBLIN'S POV : DISTANT FOREST \n\nThe pair of shining LIGHT BEAMS race away between the trees. \n\n4 DELETED \n\n5 DELETED\n\n5A EXTERIOR FOREST NIGHT\n\nThe goblins watch the LIGHT BEAMS disappear. Blix GROWLS in \nfrustration. \n\nBLUNDER(musing): . . . . Fast as a hound dog with his ass on fire. . \n. . \n\nBlunder spots a SHINING silver hair caught on the bark. He reaches \nup and plucks it free. \n\nPOX: What's that . . . . ? L-l-let me see, old chap. \n\nBLUNDER: No! It's mine! \n\nBlunder hides the hair behind his back, but Pox quickly grabs the \nother end. \n\nPOX: Give it to m-m-m-me! \n\nBoth goblins pull on the hair. Miraculously, it does not break, but \nstretches between them like spun steel. \n\nBLUNDER: Turn loose, anus features! \n\nPOX: Hard cheese! \n\nA furious tug of war. Pox pulls his knife and tries unsuccessfully \nto cut the hair. \n\nBLUNDER: It's mine you rectum! Mine! Mine! \n\nBlix marches up and furiously bangs their heads together. Pox and \nBlunder fall dazed to the ground. \n\nBlix holds the silver hair shining above his head and studies it. \n\nBLIX: Disgusting and pure, like a prayer. . .. \nThere be magic in this hair.\nThe beast ran off, faster and faster. \nWe must take this to our Master. \n\n6 EXTERIOR VAST LANDSCAPE NIGHT \n\nAn incredible landscape, fantastically contoured hills rise above \nthe monnbright mist. The four goblins dismount, tie up their devil \nsteeds, and disappear over the brow of a hill. \n\n6A EXTERIOR HILLSIDE NIGHT \n\nThe goblins scramble down a steep hillside towards a desolate \nwasteland below. A mysterious malevolant shape looms on the far \nhorizon. \n\n7 EXTERIOR SINISTER EVERGLADE NIGHT\n\nA miasmic Jurassic swamp. Stunted trees rise like amputated limbs \nfrom the fetid water. \n\nThe goblins pick their way across the bog towards a distant island, \nstepping from submerged logs to crumbled chunks of masonary to \nfloating lily pads.\nA cracked marble plinth juts out of the water. The goblins creep by \na towering skeletal statue playing a bone violin. \n\n7A EXTERIOR BOG NIGHT \n\nA v-shaped ripple undulates past them like the wake of a submerged \ncrocodile. \n\nBlix unhooks a dead rat from his game belt and tosses it from his \ngame belt and tosses it onto the scummy surface. There is an angry \nswirl and it is gone. \n\nBlix waves the goblins on and they climb onto a huge root twisting \nout of the water like a petrified serpant. \n\nThe ominous wake cruises back and forth like a shark. Blunder \nfollows its progress with fear-widened eyes. \n\nBLUNDER:Wish i was still a leprecaun. . . .\nStay clear of nasty places\nlike this and do nothing all day but \nsing and dance and guzzle wine in the sunshine. . . .\n\nFurious, Blix turns on him, his finger to his lips. \n\nBLIX: Shhhh! \n\nUnchastened, Blunder whirls on Pox and repeats the gesture: \n\nBLUNDER: Shhhh! \n\nPox follows suit with Tic: \n\nPOX: Shhhh! \n\nNot to be outdone, Tic turns to silence whoever might be behind him. \n\nTIC: SHHHHH! \n\n7B EXTERIOR BOG NIGHT \n\nHAIRY MEG MUCKLEBONES rises out of the bog, huge and hideous. The \nwater hag is half corpse, half serpant. She seizes Tic and \ndisappears beneath the foul surface. The goblin's final CRY trembles \nin the chill night air. \n\n7C EXTERIOR BOG NIGHT\nBlix, Pox, and Blunder are terrified. They scramble over the twisted \nroot in a wild panic, leaping onto a floating log. \n\nBLUNDER: Run. . . . ! Panic. . . . ! Emergency. . . . ?\n\nThe log rolls beneath their frantic feet. They barely keep their \nbalance. \n\nPOX: Frog spit!\n\nBLUNDER: Snail Sperm!\n\nBLIX: All together. . . .now or never!\n\nThe goblin co-ordinate like tiny lumberjacks, running in unison. The \nrolling log drifts forward.\n\nPOX: J-j-jolly good! Team spirit and all that!\n\nThe log runs against the island and the goblins hop ashore.\n\n8 EXTERIOR GREAT TREE NIGHT\n\nAn enormous blasted tree crowns the ruins of a forgotten castle. \nTangled roots grip the anicient stones like the tenacles of a \nmalformed sea monster. An atmosphere of eternal evil hovers over the \nsite. \n\nThe goblins stare back across the bog. \n\nBLUNDER: Poor Tic. . . .\n\nBLIX(growling with anger): Forget Tic! Less is always more.\n\nPOX: Better we spilt three ways than four! \n\nBlix hurries up the crumbling steps. Pox and Blunder follow. \n\nThe steps lead under gigantic twisting roots. Blix finds a small \nopening and slips inside. \n\nPox and Blunder like this less and less but follow their leader \nwithout complaint.\n\n9 INTERIOR GREAT TREE NIGHT \n\nThe three goblins tumble down a steep slope. The giant tree is a \nvast hollow stump, open to a moonlit sky, surrounding a smaller tree \ntransfixed by a curved bronze horn, an instrument of unspeakable \nevil. \n\nPox and Blunder stare up like open-mouthed tourists. Blix is \nimpatient. \n\nBLIX: Boost me. . . . ! Hurry. . . . ! We must sound the summons \nbefore the dawn. . . . \n\nThe three goblins form a teetering ladder with Blix wobbling at the \ntop and Blunder crushed at the bottom. \n\nBlix blows into the horn with all his might. Nothing happens. \nSuddenly, he breaks wind! \n\nPox and Blunder grimace. \n\nBlix blows again into the horn.\n\nThere is no sound. Dead leaves and dust puff out of the bell, \nfollowed by three SQUEALING bats. \n\nThe supporting goblins wobble. Pox steps on Blunder's head. \n\nBlix blows a third time into the great horn. \n\nThe unholy SOUND reverbarates like the wailing of all the doomed \nsouls in Purgatiory. \n\n10 EXTERIOR FOREST(VARIOUS ANGLES) NIGHT\n\nAs the evil SOUND moans, the forest creatures react with terror. \n\nSquirrels, rabbits, and mice dart fearfully for cover. Birds flock \nto their nests. Only the night creatures, the wolves, weasels, and \nowls perk up thier ears to listen.\n\n11 INTERIOR GREAT TREE NIGHT\n\nThe three goblins cower terrified among the gnarled roots.\n\nBLUNDER: Now what. . . . ?\n\nBLIX: We sit. . . . We wait. . . . That be our fate! \n\n11A EXTERIOR GREAT TREE NIGHT\n\nThe goblins wait up on the upper platform of the ruined castle. Blix \nsits apart from the others, staring out across at the bog. The light \nof a campfire casts their shifting shadows against the huge trunk of \nthe hollow tree.\n\nBlix plays with the silver hair.\n\nBLIX(to himself): Moving silent like the breeze.\nSoft as shadows, still as trees,\nDarkness be in all we sees. \nHe lives in silence, he lives in fire, \nHe lives in all that's dark and dire. \n\nA mysterious floating shape approaches out of the distance. It is a \nblack cloak, wafting through the mist like an airborne manta ray. \n\n12 EXTERIOR BOG NIGHT \n\nThe flying cloak wraps about the statue of the skeletal fiddler. The \nwind presses it tight, revealing the skull through the cloth. \n\nSuddenly, the statue's head turns to look at the great tree. \n\n13 EXTERIOR GREAT TREE NIGHT \n\nBlix walks to to the edge of the platform, peering into the night. \n\nBLIX: Look in the gloom, search out the tomb. \nThat be where you find our sire.\n\nThe pedestal is empty. The statue of the fidder has vanished! \n\nBlix gets down on his knees, genuflecting, toward the the open bog. \n\nThe black shadow of the LORD OF DARKNESS falls across him. \n\nDarkness towers over the ruined castle platform, a huge horned \nfigure drpaed in bacl cloth. An awesome silence ensues. \n\nBlunder and Pox kneel, heaping ashes and dirt upon thier heads. \n\nBLIX: Hail O great One. . . . divine and dark! \nStrong like a lion, swift like a shark. \n\nBlix offers the silver hair up to Darkness. \n\nBLIX: Though I'm not worthy of the task Great Lord, I found this for \nyour amusment. \n\nBlunder leaps to his feet and grabs the hair from Blix. \n\nBLUNDER: Don't listen to them mealy-mouthed lies boss. . . . I'm the \none who found it. . . . Me! Blunder the Bold! \n\nThere is a bight FLASH OF LIGHT. Blunder HOWLS with pain. \n\nBlunder stares at his arm in dismay. His hand is gone, magically \nreplaced by a grotesque birdclaw. \n\nBLUNDER(stunned): Thank you, Lordship . . . . \n\nBlunder experimently clenches and unclenches his new bird claw. \n\nPOX: Quite stylish, actually. . . . \n\nDarkness dangles the shining silver hair in front of him. \n\nDARKNESS: Where. . . . ? \n\nBLIX: In the woods, six leagues back, \n'Tween Twin Oaks and the Dragon's Track. \n\nDARKNESS: Did my bold hunters chance to see quarry which\ncast this spoor? \n\nBLIX: I stalked it, Sire, but much too slow, \nWhat beast it be I do not know. \n\nDARKNESS: This hair is from an angel of light. . . It comes \nthis way rarely. . . I must have this creature!\n\nBLIX: Oh Divine Dark One, teach us how to catch this \ncreature. \n\nPOX: Your instruction would be m-m-most \nap-p-preciated. \n\nBLUNDER: Amen! I wants to learn! I craves knowledge! \n\nDARKNESS: No trap of yours will work. . . . There is only \nlure for such disgusting goddness. . . .one bait which never \nfails. . . . \n\nBLIX: Name the bait, Lord. . . . \n\nDARKNESS: Innoncence! \n\n14 EXTERIOR COTTAGE MEADOW DAY \n\nA beautiful flower-spangled meadow alive with songbirds.\n\nBaby rabbits frolic in the tall grass where industrious squirrels \nforage for acorns and nuts. \n\nA delicate fawn gambols under the watchful eye of the doe. Clouds of \nmulti-hued butterflies swirl overhead. \n\nWaist-deep in flower, a young princess skips SINGING across the \nmeadow. Her name is LILI. She wears splendid brocades and carries a \nbouquet wrapped in a lace napkin. Like these blossoms, she is \nbeautiful and fresh and innocent. \n\nTiny birds fly down and land on her head and shoulders. She laughs \nas a warbling wren takes a seed from her lips. \n\nLILI(singing): Come down sparrow, sing me good morning. \nRise up sun, light the arch of the sky. \nLiving river, turn light to diamonds,\nWhen I look in my true love's eyes. \n\nLili runs towards a distant thatched-roofed cottage. \n\n15 EXTERIOR BOULDER AT EDGE OF WOODS DAY \n\nBlix, Pox, and Blunder hide behind a boulder, watching the girl. \n\nBLIX(whipering): Darkness say the perfect lure Always be a virgin \npure. . . . \n\n15A EXTERIOR COTTAGE AT EDGE OF WOODS DAY \n\nThe WOODCARVER'S WIFE is hangin up the washing when Lili sneaks from \nbehind the cottage. \n\nGrinning micheviously, Lili unfastens one end of the clothes-line \nand lets it drop. \n\nThe laundry flutters onto the new-mown grass, A sheet drpaes around \nthe outraged wife. \n\nWIFE: Dad-blamed faeries! \n\n16 INTERIOR COTTAGE DAY \n\nThe cottage is snug and homey with smoke-blackened beams and hand-\npegged furniture. A WOODCARVER sleeps by his bench surrounded by \nwood-shavings and roughed-out toys. \n\nLili steps into the sunlight streaming through the open doorway. Her \nbeauty is etheral, an angel descending. \n\nFinches peck at newly-made tarts laid on a trestle table to cool. \nThey rise to the rafters as at Lili's approach. \n\nThe Princess peeks around the room. She tiptoes to the hearth and \nlifts the stewpot lid, dipping a finger in for a taste. \n\nSpying the tarts, she grabs one and eats it hurriedly, leaving a \ntelltale crumb on her upper lip. \n\nThe clock tolls the hour. A carved wooden maiden piroettes from the \ninterior, pursued by a skeletal fiddler playing a bone fiddle. Lili \nis fancinated. \n\nThe Woodcarver's Wife enters. She curtsies to the Princess. \n\nWIFE: God Bless Your Highness. A royal visit is ever a joy. \n\nLILI: I've not come to visit, Nell \n\nWIFE: Won't you stay for a tart? \n\nNell pulls a tray from the oven. \n\nWIFE(cont): They're fresh-baked. \n\nLILI: I've no time today. \n\nWIFE(teasing): The Princess must have a sweetheart waiting. \n\nLILI: Nonsense! \n\nWIFE: Surely the king forbids such folly \n\nLILI: What my father doesn't know won't hurt him. \n\nWIFE: The wilful heart invites despair, \nLike blind men creeping in a dragon's lair. \n\nWith Nell's back turned, Lili steals another tart, hiding it among \nthe flowers in her bouquet. \n\nLILI: Neither country provebs nor king's command can keep me\nout of the woods today.\n\nWIFE: Then it's common sense ought. These woods be thick\nwith spriggen and banshee!\n\nLILI: Is that why you've hung a bell over the door? \n\nWIFE: Aye, and spread the floor with flax and salt. My babe \nwon't be stole by faeries. \n\nThe Princess starts merrily for the sun-bright doorway. \n\nLILI(laughing): More salt, Nell. . . .! You'll worry \nyourself to death if you're not careful. \n\nLili runs out like a naughty child. The Woodcarver's Wife \nleans against the door jamb and calls after her:\n\nWIFE: Beware of toadstool rings and willow trees. . . . ! \nStay away from old oaks! \n\n17 EXTERIOR FOREST PATH TO GLADE DAY \n\nHiding behind a moss-coverd log, Blix, Pox, and Blunder watch \nPrincess Lili run SINGING through the woods, oblivous to any sign of \ndanger. \n\nBLIX(scowling): May be innocent. . . . May be sweet. . . . \nAin't half as nice as rotten meat. . . . ! \n\n18 EXTERIOR JACK'S FOREST GLADE DAY \n\nA lovely glade surrounded by tall trees, Breathlessly, Lili runs in \nfrom the woods. She is familair with this spot. It is her trysting \nplace \n\nLILI(calling): Jack. . . . ! I know you're here. . . . Jack! \n\nLili looks around in exasperation. Behind her, something wild and \nmysterious swings through the trees like an animal. \n\nLILI(cont): Jack? Where are you. . . . ? Answer me! \n\nLili is apprehensive at getting no reply. She hears the RUSTLE of \nthe leaves but does not see the sun-dappled figure leaping from limb \nto limb overhead. \n\nLILI(frightened)(cont): Oh, Jack. . . . please say something if \nyou're here. . . . \n\nJACK O' THE GREEN, a legendry \"Green Man\" who lives the free life of \na hermit in the woods, drops down from a tree behind the Princess, \nlanding without a sound. He is barefoot, about sixteen, and wears \nwoven ivy leaves and skins. \n\nStartled, Lili SCREAMS. \n\nLILI(cont): Jack! You scared the life out of me. \n\nJack says nothing, staring at her shyly. Lili hands him the flowers. \n\nA JAY flies down out of the greenery and lands RASPING on Jack's \nshoulder. He imitates the bird expertedly, The Jay answers him in \nEnglish: \n\nJAY: She brings a gift as fair as herself. \n\nLili LAUGHS, It all seems magic to her. \n\nLILI: You're so clever, Jack. . . . See what you can find in \nthe flowers. \n\nJack pokes in the bouquet and discovers the stolen tart. He stuffs \nit immediately into his mouth. \n\nJACK: Mmmmmmm. . . . \n\nLILI: Sweet? \n\nJAY: Sweets from the sweet. \n\nJACK: I know someone sweeter.\n\nLili blushes. \n\n19 EXTERIOR ANOTHER PART OF THE FOREST DAY\n\nConcealed behind the trees, Blix, Pox and Blunder watch the Green \nMan and the Princess wander down a meandering path.\n\nPox picks a spider from his web, pops it in his mouth, and crunches \nit down with a happy smile.\n\n19A EXTERIOR MEANDERING PATH DAY \n\nSeveral birds perch on Jack's head and shoulders. Squirrels, rabbits \nand hedgehogs play about his feet. Jack feeds them nuts and berries \nfrom his pouch, answering their chatter expertedly. Jack understands \nthe language of all wild creatures. \n\nWhen a frisky wren flies warbling overhead, Lili hesitantly returns \nits call. \n\nJACK: That was very good. . . .just right. \n\nLILI: Teach me rabbit like you promised.\n\nJACK: Rabbit is much harder than wren. \n\nLILI: Let me try. I'm a very good student. . . . My father \nthinks I'm brilliant. . . \n\nLili toys with the silver madallion pendant she wears, causing \nreflected sunlight to shine in Jack's eyes. \n\nLILI(cont): See how brilliant I am! \n\nJACK(laughing): Stop it. . . . ! I can't see! \n\nLILI: Don't I dazzle you with my wisdom? \n\nLili seems to glow with sunlight. Jack stares at her, rapt with \nlove. \n\nJACK: Much more than wisdom dazzles me. \n\nLili LAUGHS and hangs her madallion around his neck. \n\nLILI: Then teach me rabbit. \n\nJACK: Not today. . . . There's something really special I \npromised to show you. \n\nLILI(delighted): Oh, Jack. Do you mean it? \n\nJACK: If it pleases you. \n\nLILI: More than anything! \n\nJACK: This is their season. They won't pass here again \nfor a long, long time. . . . If you want to see them, you \nmust do everything I tell you. \n\nLILI: I swear. . . on my honour! \n\nJACK: I'm taking you to a very special place. . . it's \nsort of sacred. Nobody but me knows where it is, and, \nwell. . . . \n\nLILI(impatient): What? Tell me! \n\nJack unwraps the lace napkin from Lili's bouquet. \n\nJACK: You'll have to wear a blindfold. \n\nLILI(coyly): Don't you trust me, Jack? \n\nJACK: I'll always trust you, Lili. . . . \n\n20 EXTERIOR FOREST PATH, GLADE TO STREAM DAY \n\nJack holds Lili's hand, leading her blindfolded along a path through \nthe woods. Distant thunder RUMBLES. \n\nJACK: Storm's coming. . . .\n\nLILI: Who cares? Haven't you a cosy place to hide? \n\nJACK: Many places. . . .None fit for a princess. . . . \n\nLILI: In these woods you are the prince, Jack. . . . \nI am only a pauper here. . . .\n\nJack turns to face a radiantly smiling Lili. He bends towards her, \ncloser and closer, and, for a moment, seems about to steal a kiss. \nShe waits, smiling, sensing what is about to happen. In the end, \nJack's innoncence and timidity get the best of him and he turns \naway. Without his knowledge Lili lifts a corner of the blindfold and \nmischievously peeks. \n\n20A EXTERIOR BEHIND A TREE NEAR THE PATH DAY\n\nThe three goblin peer around a mossy trunk. \n\nBLUNDER: Yuck! Did you see what he was gonna do? \nMakes me want to puke!\n\nBLIX: I swear by all the bats above, \nNothing's quite so foul as love!\n\n21 EXTERIOR UNICORN STREAM AND GLADE DAY \n\nA sun-glided amphithtre within the darker confines of the forest. \nSparkling like a ribbon of diamonds, a stream flows down the middle. \n\nJack leads Lili out of the woods and unties the napkin from around \nher eyes. \n\nLILI(aewstruck): Oh, Jack. . . .! It's magic! \n\n21A EXTERIOR STREAMSIDE SHUBBERY DAY \n\nSome time has passed. Lili is uncomfortable and restless.\n\nLILI: How much longer? \n\nJACK: Be patient! \n\nLili kneels by the bank of the streem, cupping water into her hands. \nJack stops her from drinking. \n\nLILI: I'm thristy! \n\nJack points at a huge viper moving sinously along the bank. \n\nJACK: It's poisened the brook. \nNo animal will drink here now. \n\nLILI(indignant): I want some water. \n\nJACK: Shhh! \n\nLILI: Don't tell me to be quiet. . . .! \nI'm a princess!\n\nJack pulls Lili back into hiding. \n\nJACK(very softly): Just watch! True royalty\napproaches. . . .\n\n22 EXTERIOR THE STREAM (JACK & LILI'S POV) DAY \n\nThe radiant LIGHT BEAMS GLEAM through the trees. A moment later, a \nsplendid white unicorn moves down the hillside to the edge of the \nstream. This is a stallion. He holds his head proudly. His mate \nstands at the edge of the woods. \n\nLILI(OS): Ohh....They're so beautiful.... \n\nThe unicorn dips his horns into the stream. \n\nJACK(OS): The alicorn purifies the water. . . . \n\nThe stallion watches his mare approach to drink. She is slighter and \nmore delicate, but every inch as mignificent. \n\nJACK(cont)(OS): There's no creature with more \npower or magic. . . . As long as they roam the earth, \nevil cannot harm the pure of heart. . . .\n\n23 EXTERIOR LARGE BOULDER OPPOSITE CLEARING DAY\n\nThe three goblins crouch hiding.\n\nBLUNDER(disgusted): Ugly one-horned mules!\n\nBLIX: Shhh! \n\n24 EXTERIOR CLEARING DAY\n\nThe Princess is entranced.\n\nLILI: Such grace. . . . Can you speak\ntheir language?\n\nJACK: A little. . . .it's very hard.\nUnicorns talk only of love and laughter. \nDark thoughts are almost impossible for \nthem to express.\n\nLILI: Oh Jack. . . I must touch one.\n\nJACK(alarmed): No!\n\nLILI: I want to!\n\nJack restrains the Princess when she attempts to get up from hiding.\n\nJACK: It is forbidden. These are sacred \nanimals.\n\nLILI: Nothing is forbidden me!\n\nJACK: Don't ever say that! You risk\nyour immortal soul. \n\nLili pulls free and steps into the clearing.\n\nLILI: You sound like my confessor. . . . \nI only want to touch one.\n\nThe Princess strides defiantly into the open meadow.\n\nThe unicorns watch the girl from across the stream. They snort and \npaw the ground.\n\nLili stands alone, holding her arms to the unicorns.\n\nLILI(singing): Like a child feels watching a rainbow.\nLike a brid feels the first time it flies\nI feel magic stirring within me,\nWhen I look in my true love's eyes.\n\nThe Stallion's nostrils flare. His strong neck arches. Sunlight \ngleams on his horn as he charges.\n\nFrom Lili's POV the stallion is terrifying as he thunders towards \nher acroos the stream.\n\nThe stallion rears and prances, racing around the Princess as if \ndrawn foward on an invisable lead.\n\nJack watches from the underbrush, his outrage tinged with more than \na touch of jealously.\n\n25 EXTERIOR BOULDER DAY\n\nBlix, Pox and Blunder peer from their hiding-place. Evil leers \nbrighten their impish features.\n\nPOX(whipering): M-m-might as well be fish\nin a barrel. . . One would hope for a \nt-t-touch more sp-p-port. . . .\n\nBlix clamps his hand over Pox's mouth.\n\nBLIX: Pox! Shut your yap!\n\n26 EXTERIOR CLEARING DAY\n\nThe lureof the virgin is too strong for the unicorn to resist. Lili \nmakes no move as the trembling stallion stands before her, the \nrapier tip of his horn pressed against her breast. It is obvious he \ncould kill her is an instant.\n\nThe Princess calmly reaches out and caresses his muzzle. \n\nLILI(singing): When the darkness falls like a curtain\nAnd the rivers and streams turn to ice,\nI have summer and daylight forever\nWhen I look in my true love's eyes.\n\nAcross the stream, the mare paces back and forth, obviously \nagitated.\n\n27 EXTERIOR BEHIND THE BOULDER DAY\n\nBlix pulls a long black flute from his quiver. He takes a dried \nhornet from a black snail-shell with a hinged lid and slips it into \nhis flute, aiming the instrument like a blowgun.\n\nBLUNDER: Steady....take your time....\nDon't miss...\n\nBlix silences the foolish golbin with a ferocious scowl. His cheeks \npuff. There is a soft PHUT of expelled breath.\n\n\n28 EXTERIOR CENTRE OF CLEARING DAY\n\nThe poisened hornet sails the air and strikes the hornet on the \nhaunch.\n\nStung, the unicorn bolts through the clearing, disappearing into the \nundergrowth with the mare hard on his heels.\n\nThe Princess stands be confused and bewildered.\n\nDistant THUNDER disturbs the tranquility.\n\nJack rushes to Lili's side.\n\nLILI: Oh, Jack, it was so lovely...\nlike a dream.\n\nJACK(angry): You're lucky it wasn't a \nnightmare!\n\nLILI: Don't be such a scold.... Come,\nI'll chase your fears away.\n\nThe Princess takes Jack by the hand and leads him from the clearing.\n\n29 EXTERIOR FOREST (UNICORN HUNT) DAY\n\nThe unicorns plunge through brambles and fern clumps. Leaping a \ndeadfall log, the stallion stumbles. He struggles to his feet and \ncontinues running.\n\nThe three goblins gallop pell-mell on their devilish steeds. There \nis nothing comical about them now.\n\n30 EXTERIOR RING POND DAY\n\nJack and Lili sit atop a high promontory jutting over a crystalline \npond.\n\nLILI: Sweet William did a-hunting go,\nIn the wood where faeries dwell.\nFrom dawn to dusk roamed he to and fro,\nLost, O lost, all under thier spell.\n\n31 EXTERIOR FOREST (UNICORN HUNT) DAY\n\nThe stallion stagger, his gait increasingly unstable as the poisen \ntakes effect.\n\nThe mare nuzzle his flank where the envenomed hornet struck. It is a \nvirulent ound, red and swollen.\n\nThe war-like SHOUTING of the goblins grows even closer.\n\nThe unicorns pause at a fork in the trail. The stallion motions with \nhis head. Sadly, the mare compreheads and flees down the divergent \npath to safetly.\n\nThe stallion stands his ground. When the three goblin hunters gallop \ntowards him, he turns and limps into the woods.\n\n32 EXTERIOR RING POND DAY\n\nJack lies beside Lili, listening raptly to her poem.\n\nLILI(reciting): Came he at last to where bluebells grow,\nHe heard them ring, 'tis true to tell.\nHe lay him down and did not know\nThe flower's sound was his own death knell.\n\nAnd while he slept came teh lady fair,\nAnd gathered him up behind her saddle.\nNow, all young hunters of bluebells beware\nSweet William rode straight through the \ngate of Hell.\n\nJack is lost in Lili's smile.\n\nJACK: When I get to heaven, I know just\nhow the angels will sound.\n\nLILI(enjoying it): Do you flatter all the girls\nlike that, Jack?\n\nJACK(embaressed) It's the truth.\n\nLili kisses Jack sweetly. He doesn't respond.\n\nLILI(smiling): Are you afraid of my kiss?\n\nJACK: I'm afraid you'll break my heart.\n\nLILI: Then still your heart... You\nare dear to me as life itself.\n\nJACK: Only because I amuse you...Like some\ntrained bear!\n\nLILI: That's not true! I do love\nyou, Jack. You must believe me!\n\nJACK: And if I so....no good can come\nfrom it. I am only a Green Man, without\nland or title...no name or wealth to \nbring you.\n\nThe Princess her golden ring on and off her finger.\n\nLILI: What does it matter. I don't care\nabout any of that.\n\nJACK: But it does matter....! If not \nnow....Someday. What about when the time \ncomes for you to marry?\n\nLILI: I want to marry you.\n\nJACK: That's impossible!\n\nLILI: Not if it's what you really \nwant, Jack.\n\nLili shows Jack her ring.\n\nLILI(cont): Don't you wish this was our\nwedding ring?\n\nJACK: What if I say yes...? Will my wish\ncome true?\n\nLILI: It is my right as a princess to\nset a challenge for my suitors.\n\nLili throws her ring high over their heads. It glitters through the \nair, tumbling over and over in the long drop to the pond.\n\nLILI(cont): I will marry whoever finds this \nring.\n\nThe ring spalshes into the cnetre of the pond. Jack strips off his \nleafy cloak and dives headlong from the cliff.\n\n33 EXTERIOR UNICORN DEATH ARENA DAY\n\nSweat-streaked, the unicorn staggers out of the tree onto a sweeping \ngreen meadow brilliant with pink bloosoms. Froth bubbles on his \nnostrils. His wide azure eyes betray his panic.\n\nThe goblins ride onto the flower-bright meadow. They jump down from \ntheir mounts in a frenzy.\n\nBLUNDER(excited): We got him now....!\nWe got him now!\n\nThe stallion stumbles forawrd, making a last futile effort to attack \nthe goblins. Limbs leaden, head hanging, the noble animal settles \nagainst a sapling and slides to the ground.\n\nThunder RUMBLES overhead. A wild wind whips the pink blossoms into \nthe air.\n\n34 EXTERIOR UNDERWATER RING POND DAY \n\nThe golden ring drifts down, tumbling in a lazy spiral.\n\nJack's pale form stabs through the crystal water. The distant glint \nof the sinking ring lures him on.\n\nThe ring settles into the mud at the bottom, concealed by waving \nweeds.\n\nJack searches blindly as clouds of silt billow about him.\n\n35 EXTERIOR UNICORN DEATH ARENA DAY\n\nThe three goblins advance towards the fallen unicorn through a pink \nblizzrd of wind blown blossoms.\n\n35A EXTERIOR SKY DAY\n\nThe black clouds boil and CRASH, thunderheads mounting one upon \nanother in a dark maelstrom.\n\n36 EXTERIOR UNICORN DEATH ARENA DAY\n\nThe goblins stands around the fallen unicorn. Blunder turns away as \nPox seizes the end of the alicorn, lifting it off the ground. Blix \nswings an evil battle-axe high up over his head.\n\nJagged lightning splits the raging darkness as the black blade \nfalls.\n\nBlix waves the severed alicorn in triumph.\n\nThe whirling pink petals turn instantly into white snowflakes.\n\n37 EXTERIOR RING POND DAY\n\nApolcalyptic winds SCREAM through the forest. Lightning FLASHES.\n\nThe world is plunged into winter darkness.\n\nLili clings to a tree trunk.\n\nLILI(in desparation): Jack! Help me!\n\nThe Princess can't maintain her grip. The icy blasts knock her to \nthe ground and she crawls to the cliff edge.\n\nLILI(cont)(screaming): Jack!\n\nThe her horror, Lili sees a skin of ice form over the surface of the \npond.\n\nLILI(cont) (sobbing): Oh, dear God.... Jack.....\nno....\n\nFighting the raging winds, Lili stumbles to the pond and pounds on \nthe ice in frustration. It is no use.\n\nLILI (cont): ....got to get help!\n\nFrantically, Lili runs off into the storm-whipped woods.\n\n38 EXTERIOR UNDERWATER RING POND DAY\n\nJack turns and looks up at the dark surface. He storkes upwards, \nonly to bump his head into something solid at the top. The pond is \ncovered by a sheet of ice!\n\n39 EXTERIOR RING POND DAY\n\nJack's contorted face is seen through the ice.\n\nHe breaks the frozen surface with his fist and his gasping head \nthrusts into the air.\n\nJACK(shouting): Lili....!\n\nHis words are lost on the wind.\n\n40 EXTERIOR COTTAGE MEADOW DAY \n\nWinter shrouds the tiny homestead. Immobile goats, chickens and \nducks stand silent as snow statues in the farmyard.\n\nLili runs from the frozen forest and stumbles up the cottage steps. \n\n41 INTERIOR COTTAGE (FROZEN) DAY\n\nThe Princess barges in, wild-eyed and distraught.\n\nFrost rimes the walls and furnishings. Everything glisten like sugar \ncandy. The Woodcarver and his wife are frozen solid.\n\nLILI: Nell....! Arthur....!\n\nLili touches the wife's gelid cheek.\n\nLILI: Nell....? Oh, nooooo!\n\nLili is shocked to discover the wife is frozen.\n\nThe Princes throws herself sobbing across the bed.\n\nSOUNDS of SNORTING and SHOUTING come from outside\n. \nLili scratches the frost off the window pane in the sleeping alcove.\n\n42 LILI'S POV : THROUGH WINDOW\n\nThe noisy goblins ride up on a makeshift sleigh of lashed animal \nbones. They stop outside and clamber out. Blix has the alicorn \ntucked under his arm.\n\n43 INTERIOR COTTAGE DAY\n\nTerrified, Lili runs wildly across the cottage and clims the ladder \nto the loft.\n\n43A INTERIOR COTTAGE LOFT DAY\n\nBarrels and chests are stored here. Cured bacon and hams hang from \nthe rafters. Lili hides in a corner with several twig brooms and a \nbutter churn. She wraps herself in an old quilt snatched from an \nopen trunk.\n\nSnows blows in through a hole in the roof, covering the floor \ntimbers. Three-inch gaps between the planks permit a view into the \ncottage interior.\n\n43B LILI'S POV : BETWEEN PLANKS\n\nThe front door slams open and the goblins stumble laughing inside.\n\nBLIX: Mortal world turned to ice,\nHere be goblins' paradise!\n\n43C INTERIOR COTTAGE DAY\n\nBlunder sinks his handaxe onto the kitchen table as he saunters past \nthe frozen tarts.\n\nBLUNDER: Lots to eat!\n\nPox runs forward to the cradle and seizes the frozen baby, baring \nhis tusks for the feast.\n\nPOX: I s-s-simply adore m-m-milk-fed meat!\n\nBLUNDER: What're you....? Some kinda animal?\n\nHorrified, Lili GASPS (OS) in the loft.\n\nThe goblins cock their ears to listen. Pox SNARLS and drops the baby \nback in the cradle.\n\nCurious, Blunder starts up the ladder to the loft, but changes his \nmind half-way, more interested in what Blix is doing.\n\nBLIX: Why eat cold? It's better hot!\n\nBlix points the alicorn at the frozen stewpot on the hearth. It \nbegins to steam and bubble, magically boiling without a fire \nunderneath.\n\nPOX: Am-m-mazing! How did you d-d-d-do that, old, ch-ch-chap?\n\nBlix is equally surprised by the alicorn's power. He CACKLES and \naims it at the clock on the mantle.\n\nThe clock's hand spin wildly around backwards, the carved figures \ndarting in and out at fives times their normal speed.\n\nBlix launches on an orgy of destruction, waving the alicorn like a \nmagic wand. Plates shatter, the cradle rocks. furniture topples, \nToby mugs come WAILING alive, painted wooden toys dance and caper.\n\nThe goblins SHRIEK with impish joy.\n\n43D INTERIOR LOFT (FROZEN) DAY\n\nLili watches the havoc through the gaps in the floor.\n\nBlix points the alicorn straight up. Snow flies wildly around the \ncrouching Princess.\n\nThe broom and the butter churn begin a mad dance across the crowded \nloft.\n\nIt is all the Princess can do to keep from screaming.\n\n43E INTERIOR COTTAGE (FROZEN) DAY\n\nAs a grand finale, Blix points at Nell's frozen figure, blowing her \nskirts above her waist.\n\nPOX(languidly): M-m-most amusing Blix....most\nterribly amusing.\n\nBLUNDER: This is sure our lucky day.\nKilled that ugly one-horn dead as a cowplop\non a birthday cake!\n\nBLIX: Prattle, prattle like a priest!\n(pointing to himself)\nIt was me who shoot the beast!\n\nPOX: Without the p-p-princess for bait,\nyou'd never gotten close....\nB-b-beauty brought the b-b-beast\nto bay.\n\nBLUNDER: She's so sweet....I could\neat her brains like jam!\n\n43F INTERIOR LOFT (FROZEN) DAY\n\nLili slumps against the wall, aghast at what she's just overheard.\n\n43G INTERIOR COTTAGE DAY\n\nBlunder and Pox fill a sack with frozen tarts.\n\nPOX: I'd like such her b-b-bones!\n\nBlix points the alicorn at the cottage door. It flies open with a \nCRASH.\n\nBLIX: Better hurry! Can't be late!\n\nBlix marches out of the door. The other two goblins follow, darrging \ntheir sacks of tarts.\n\nBLUNDER: When we deliver that horn, \nPox ol' buddy, Darkness gonna give us a humongous big\nreward.\n\nBlunder and Pox leave, slamming the door behind them.\n\nAfter a long pause, Lili creeps sobbing down the ladder from the \nloft.\n\nLILI: Oh, God.... God....\n\nThe Princess stumbles across the cottage towards Nell.\n\nLILI(cont) What have I done...? I didn't\nwant the unicorn to die.... All I did\nwas touch it....\n\nLili pleads with the frozen Wife, as if begging for her forgiveness. \nShe is interrupted by the gruff voice of a House BROWNIE.\n\nBROWNIE(OS): You're a wicked, wicked girl!\n\nLili looks up and sees a long-bearded Brownie standing next to the \nclock on the mantle.\n\n43H LILI'S POV : BROWNIE\n\nBROWNIE: The world is in a fine mess\nbecause of you.\n\n43I BROWNIE'S POV : LILIbr \nLILI(desperately) : I'll make it somehow....\nI swear it...! I don't care what happens to\nme.\n\n43J LILI'S POV : BROWNIE\n\nBROWNIE: Words...mere words.... Bolds\ndeeds be needed now! Look at you!\nPampered and soft! Never done a day's\nwork in your life....\n\nLILI(OS): Who are you?\n\nBROWNIE: Me...? I'm the house brownie...\nI keep dust devils under the bed and all\nthe china cracked.... You know how a watched pot\nnever boils? I do that...and I'm\na wizard at turning sweet milk sour....\n\nThe front door CRASHES loudly open.\n\n43K INTERIOR COTTAGE (FROZEN) DAY\n\nLittle Blunder swaggers into the cottage.\n\nLili covers her face with the quilt and holds herself rigid as if \nfrozen. The Brownie ducks out of sight.\n\nBlunder stalks to the kitchen table and pulls his axefree. He does a \ndouble-take on spotting the Princess. The tiny goblin can't remember \ncan't remember if he saw her earlier or not.\n\nHe pokes her and lifts her skirt to peek at her legs. He is stopped \nshort by Blix's angry CRY outside:\n\nBLIX(OS): Blunder! Move your butt! On the double!\n\nBlunder hurries to the door.\n\nLili relaxes when she hears it SLAM.\n\nLILI: Thank God....\n\nLili looks up at the mantle.\n\nLILI(cont) (sobbing): Can you....help me?\n\n437 LILI'S POV : BROWNIE\n\nBROWNIE: Can I what?\n\nLILI(OS): Help me....\n\nBROWNIE(sadly): I'd like to....but I'm\na domestic sort of chap....no good at all\nwhere demons are concerned....\n\n43M BROWNIE'S POV : LILI\n\nLILI: Then I'll do it myself! I'll follow those \ngoblins....somehow.....\neven if it costs my life!\n\n43N LILI'S POV : BROWNIE\n\nBROWNIE: I like your spirit! There's always \nhope when a brave heart back a noble cause....\nbut what chance have you? They have the alicorn!\nThe power is theirs!\n\n43O BROWNIE'S POV : LILI\n\nThe Princess resolutely hurries about the cottage, gathering things \nto eat and other useful items.\n\nLILI: I will do it! You'll see....I\nfooled them now, didn't I.... Well,\nI'll do it again easy as pie....\n\nLili starts for the door.\n\nBROWNIE(OS): Wait....! Take this....!\n\nLili turns back.\n\n43P LILI'S POV : BROWNIE\n\nThe Brownie pulls a golden feather from his cap and tosses it down \nto Lili.\n\nBROWNIE: 'Tis from the tail of the cockatrice....\nMake you as fleet as a running deer. And better, when\nthings seem at their darkest, 'twill remind\nyou always that hope is alive....\n\n43Q BROWNIE'S POV : LILI\n\nThe Princess tucks the feather into her bodice.\n\nLILI: Thank you....Hope is just what\nI need.\n\nLili rushes from the cottage back into the snow.\n\n44 EXTERIOR FOREST (SNOW TRAVELER) DAY\n\nA full-scale blizzard drives down through the naked tree limbs. Jack \nslogs forward, near frozen.\n\nJACK(calling): Lili....! Lili....!\n\nJack sees a tiny bird, frozen solid on a branch. He takes it \ntenderly down, trying to warm it with his breath.\n\nJACK(cont): What's happened....\n\nStanding rigid all around him are numbers of frozen animals.\n\nHe can do nothing for the bird and trudges on into the storm.\n\nJACK(cont)(calling): Lili....! \n\nUp ahead, the figure of a man is barely discernible.\n\nJack runs to the man, thinking himself saved..\n\nJack discovers the man is frozen, like the bird. His initial shock \ngives way to releif. The man is his salvation after all.\n\nQuickly, he unties the stranger's travel bags and cloak.\n\nJACK(cont): God rest your soul.... I know you\nwon't mind if I borrow your things.\n\nJack wraps himself in the claok and finds a tinder box in the travel \nbag.\n\nHe scrapes together a pile of twigs, striking sparks with the flint \nand steel to start them smouldering.\n\n45 DELETED : TRANSPOSED TO 46D\n\n46 EXTERIOR FAERIE CIRCLE NIGHT\n\nA campfire blazes. Jack sleeps beside a tiny fire, shivering under \nhis new cloak.\n\nA tiny glowing LIGHT streaks out of the woods. It circles around \nJack. The LIGHT touches the fire and it BLAZES up like a bonfire, \nwaking Jack.\n\nJACK: What....?\n\n46A JACK'S POV : LIGHT\n\nJack stares at the radiant buble hanging above him. He sees a tiny \nwoman-child with delicate dragonfly wings trapped inside. This is \nLUNA.\n\nJACK (cont)(OS): Who're you?\n\n46B EXTERIOR FAERIE CIRCLE NIGHT\n\nLuna ZOOMS off into the treetops.\n\nJack grabs a flaming brand and jumps to his feet.\n\nJACK (cont): Who's there....?\n\nWatching him through the drifting smoke in GUMP, an elf no more than \nthe waist high. Slightly built, he is near-naked in spite of the \ncold. His face is that of a child, yet his eyes shine with a wisdom \ncenturies old.\n\nGUMP(smiling mysteriously): Here you be a forest\nchild and not know the Gump....\n\nJACK: Gump, is it?\n\nGUMP: Aye, Jack.... Honeythorn Gump at \nyour service.....\n\nThe air is filled with frenzied CLICKS and SNAPS: stones tapping, \nstick's rubbing, logs being thumped, etc.\n\nNumbers of green-glowing eyes stare at Jack out of the shadows.\n\nJACK (frightened): How d'you know my name?\n\nGUMP: How does a migrating swallow know \nthe way south in winter....? Or a \nspawning salmon find the tiny freshet of\nhis birth from the black cold depths of the\nmysterious sea....? I know everything, Jack!\n\nJACK: Everything....? Why has this\nhappened? Why is it winter now?\n\nGUMP: I'd be a powerful wizard indeed could I answer....\n(shrewdly): Suppose you tell me , Jack.\n\nJack in uncomfortable.\n\nJACK: Me? How can I do that?\n\nGUMP: You know these woods as well as\nany elf.... Did you not see \nsomething odd today? Any strange spirits?\nDid nothing untoward happen?\n\nJACK: No....well.... I took Lili to see\nthe unicorns.....\n\nGUMP (furious): You did what?\n\nNumbers of elves and faeries appear out of the dark woods. They come \nin all sizes, from sprites no larger than squirrels to plump hobmen \nas big as small children.\n\nBROWN TOM is a plump, tipsy leprechaun, draped with pots and pans \nlike a tinker; SCREWBALL, a tiny pixie wearing an ill-fitting cap \nand garments tassle with flowers.\n\nFAERIES (whispering in chorus): What....? \nCodfish and cockles....! Never....! Pewterpots and....\npumpkins....! Poo-poo pudding....! Doo-doo \ndumplings....! Shit-willy whatnot....!\n\nGUMP: Silence!\n\nThe whipering stops. All eyes are on Jack. He writhes with guilt \nunder thier scrunity.\n\nJACK(deepling ashamed): Oh God, \nshe touched him....\n\nA GROAN rises from the crowd of faeries. They are outraged. Gump is \nthe maddest of all. His face darkens. His eyes glow. He trembles \nwith banshee fury.\n\nGUMP: Touched it! A mortal laid hands \non a unicorn?\n\nBROWN TOM: Bad....terrible bad!\n\nJACK: We meant no wrong.\n\nGUMP (screaming): What was it you did \nmean, Jack!\n\nJACK: Nothing....\n\nGUMP (cold and hard): Nothing, he calls it!\n\nJACK: I wanted to share something special \nwith her.\n\nGUMP: Well.... I have something now to share with you....a lively \nreel to warm your bones!\n\nGump magically pulls a violen out of thin air.\n\nJACK: I'm in no mood for dancing.\n\nGUMP(screaming with wrath): Squawk! Squawk!\nNo more talk.... Do you think you can\nupset the order of the\nuniverse and not pay the price?\n\nBrown Tom produces ancient bag pipes, Screwball a tambourine. The \nother wee folk tune up an incredible variety of oddly-shaped \ninstryemnts : seashell trumpets, acorn cellos, gossets, serpentines, \nblossom-bell horns, bone flutes, all manner of drums and rattles.\n\nA wild and haunting overture begins. The rhythm is complusive.\n\nJack cannot control his body. His feet move against his will.\n\nJACK(frantic): No! I want no part of\nyour nonsense.\n\nGump leers demonically.\n\nGUMP: Time to dance, Jack!\n\nPlaying his fiddle, Gump is possessed, demonic.\n\nScrewball beats on a log with a pair of shin bones. The faerie \norchestra breaks into an other-world melody. Jack leaps and jumps \nlike a zombie.\n\nJACK: No...! Please....!\n\nBROWN TOM(chanting): Round and round and round and round,\nBefore you're lost, you must be found\n. \nThe tempo increases. The musicians leap and cavort.\n\nJack twists and capers, dancing against his will.\n\nSCREWBALL(chanting): In and out and up and down, \nBehind each smile there lurks a frown.\n\nGump leaps wildly, fiddling like a demon. Jack is a prisoner of the \nfrenzied music.\n\nBROWN TOM(chanting): Spin and spin and spin and spin, To learn to \nlose you first must win.\n\nGumps hops into the fire, dancing and playing as sparks leap about \nhim. The music grows wilder. Jack will never survive.\n\nSCREWBALL(chanting): Twist and reel and toe and heel,\nThe end to pain is to learn to feel!\n\nJack's face is a mask of agony. With supreme effort, he hurls \nhimself onto the ground, his body jerking spasmodically to the \nmusic.\n\nJACK(screaming):Enough!\n\nThe faerie orchestra falters, their tempo broken.\n\nGUMP(angry): Is the music not to your liking?\n\nJACK(gasping): I....won't....go....on...Take\nmy life, if you must.... What I did\nis unforgiveable....\n(boldly) But, I did it for love! And I'd do\nit again! I love Lili with all my heart and\nwould sooner die than break a \npromise!\n\nGump stares at Jack. A tender expression softens his flinty eyes.\n\nGUMP: Hmmmm..... Love, you say....? Love is \nanother story....\n\nJACK: I meant no disrespect....\n\nGUMP: Answer me this riddle and\nall is forgiven.\n\nJACK: And if I cannot?\n\nGUMP: Why, Jack....then 'tis your\ndeath song I'll be playing.\n\nJACK: Ask away, and pray God my answer\npleases you.\n\nGUMP: What is a bell that does not ring,\nYet, its knell makes the angels sing?\n\nGump laughs, knowing Jack can't solve his riddle. Jack frowns in \nconcentration, then grins, as the memory of Lili's song rushes back.\n\nJACK: Bluebells!\n\nGUMP: What?\n\nJACK: The flower. Bluebells. To hear\nthen ringing means your life is\nat an end.\n\nGump hurls his violin to the ground and stomps on it.\n\nGUMP: Damnation! Codfish and cockles!\nGammon and trotters!\n\nScrewball and Brown Tom run for cover as Gump explodes in an insane \nfury. He throws himself to the ground, kicking and SCREAMING.\n\nGUMP(cont): Rabbot noodles....! Schweinhundt\nsaukraut mit schlagober....!\nPiddle-puddles und ka-ka crumpets....!\nPiss pots and thunder mugs!\nDemkopf doo-doo brains riddle-widdler!\n\nAbruptly, Gump stands and dusts himself off as if nothing had \nhappened. He smiles at Jack and holds out his tiny hand.\n\nGUMP(cont): You bested me, Jack....\nBested me.... bested me...\n\nJACK(modestly): A riddle with an answer\nis like an empty cup when you're \nthirsty for wine.\n\nGUMP: Well spoke! And if it's wine you\nwant, it's wine we shall have.\n\nGump claps his hands and four tiny glasses magically APPEAR, \nfloating in the air before them.\n\nAnother clap and Brown Tom's hat POPS off his head, revealing a wine \nbottle balanced underneath.\n\nGUMP(cont): A small measure of entertainment \nat best.\n\nGumps snaps his fingers and the wine bottle floats off Brown Tom's \nhead, pausing to in mid-air to fill each bobbing glass.\n\nGUMP(cont): Elderberry wine....no finer drink \nunder heaven.\n\nEach one takes a glass. Gump raises his in a toast.\n\nGUMP(cont): Here's to Jack....riddle-solver....\ndancing fool, and faerie friend.\n\nThey all clink glasses. Jack regards his with suspicion.\n\nJACK: I'm honoured, Gump....But no more tricks!\n\nGUMP(to the others): Here be precious summertime frozen\ninto a winter memory and the blamed \nfool won't drink faerie wine for fear of\nenchantment.\n\nThey all drink, Jack with some relunctance. The faeries enjoy the \nwine. Jack gags, as if he's swallowed fire.\n\nJACK(coughing): Pranks....! Is that all you're good\nfor....! I've lost Lili....! Gump!\nHelp me! Use your magic to find her....\nset the world right.\n\nGUMP: Changing this frozen hell is beyond\nmy modest powers.\n\nJACK: Is there nothing you can do?\n\nGUMP: If you want more tricks, I'm your\nman.... but, for big questions, you must \ngo elsewhere.\n\nJACK: But don't you care what's happened?\n\nGUMP: Course we care.... What good's the \nworld locked in a season of death?\nNo folks to scare on a summer's\nnight....\n\nBROWN TOM: No babies to tickle....\n\nSCREWBALL: No lovers to tease....\n\nGUMP: No more spells to cast....Does that\nsound like an enjoyable prospect?\n\nJACK: We must find the answer!\n\nGUMP: That we must. But first, we better \nsee that no harm's come to the\nunicorns.\n\nSCREWBALL: I sadly fear the worst....\n\nGumps claps his hands and everyone is magically holding\nluminous flower lanterns.\n\n46C EXTERIOR DEEP FOREST NIGHT\n\nSeen from a distance, the lantern-lit faerie procession glows like \nfoxfire between the massive trees.\n\n46D EXTERIOR SNOW (LILI TRACKS GOBLINS) NIGHT\n\nPrincess Lili tuns swiftly between the frozen trees, following the \ntracks of the goblins. The quilt is torn, her hair dishevelled. She \npauses at the top of a small, steep hill. \n\nThe tracks of the goblins' sleigh pass below.\n\nLili jumps from the hilltop, leaving the quilt floating behind like \na discarded skin. It is an incrediable leap.\n\nShe lands with the sureness of a wild woodland creature and runs \noff, hair streaming behind, following the trail of the sled.\n\n47 EXTERIOR UNICORN DEATH ARENA NIGHT\n\nThe faerie procession moves out of the woods onto the frozen meadow.\n\nFAERIES(singing together): What can you do when there's Nothing to \nbe done?\nSing a little song\nAnd have fun, fun, fun....\n\nThe silhouette of the unicorn is glimpsed in the glow of the faerie \nlanterns.\n\nLed by Jack, the faeries run towards the recumbent stallion.\n\nWisp stoops and picks up an arrow dropped by the goblins.\n\nGUMP: This is goblins' work....\nPowerful demons are agaisnt us!\n\nJack kneels sadly beside the ice-glazed unicorn.\n\nThe SOUND of CRASHING HOOFBEATS alerts the faeries as the mare \nunicorn thunders out of the trees.\n\nBROWN TOM: Take cover, laddies!\n\nThe faeries dive for protection. Only Jack stands his ground.\n\nThe mare charges straight at Jack. He is knocked to his knees as she \ngallops past.\n\nThe unicorn wheels about. Jack scrambles to his feet.\n\nShe charges again, skidding to a stop on the frozen grass. Her \nalicorn is aimed straight at Jack's throat.\n\nGUMP: Run, Jack!\n\nJACK: The fault was mine. I owe her \nmy life.\n\nGUMP: Nobly spoken, lad, and nobility\nis her gift in return.\n\nThe mare makes a soft NOISE deep in her throat. It is a cross \nbetween whale song and the cooing of doves.\n\nJack responds in kind, imitating the sound exactly.\n\nSCREWBALL: What's he saying? What's\nit mean?\n\nBROWN TOM (shrugging): Search me.... I speak\nsome rabbit, but not a word of unicorn.\n\nThe unicorn continues, a SOUND as close to music as anything in \nnature. Jck listens intently and answers her.\n\nGUMP: Come on Jack, don't keep us in\nthe dark.\n\nJACK: The dark is where we'll stay....\nWe're cursed. All warmth and light\nwas lost when the stallion died.\n\nBROWN TOM: Is there naught we can do?\n\nJACK: We must get the alicorn back.\nOnly then will the world return to normal.\n\nGUMP: And how do faeries fight a demon?\n\nJACK: She says we're to find a champion....\na mortal, bold of heart and pure in\nspirit.\n\nSCREWBALL: Look....! Look....!\n\nScrewball points to the mare's hoofprints in the snow. Tiny wild \nflowers spring to life within each indentation.\n\nJACK: That is the warmth of her soul.\nNot even death's icy hand can stop\nit!\n\nSCREWBALL: Little good her soul'll do us now.\n\nBROWN TOM: Screwball's right. Where we gonna \nfind a champion when every mortal can swing a\nsword is froze stiff as an icicle?\n\nGUMP: Don't give up so quick, lads.\n(feeling Jack's arm)\nYou sure you're mortal?\n\nJACK(indignant): Course I am!\n\nBROWN TOM(dubious): What sort of mortal\nspeaks unicorn?\n\nSCREWBALL: Why aren't you frozen then?\n\nJACK: I don't know.... I was underwater....\nand when I came up for air, everything\nwas covered with ice.\n\nGUMP: You'll do.... We best get you\nsome weapons.\n\nJACK(puzzled): Weapons....? What are they?\n\nBROWN TOM (dubious): He's no champion,\nGump.\n\nGUMP: We'll have to make him one....\nor kill him trying....!\nFollow me!\n\nGump leads Jack and the others into the woods. The unicorn follows. \n\nFAERIES(singing together): What can you do when there's\nnothing to be done?\nSing a little song \nAnd have fun, fun, fun....\n\n48 EXTERIOR GREAT TREE NIGHT\n\nLili creeps around the base of the tree, making no sound. She moves \nwith the grace of an animal and hides behind a gnarled root where \nshe can watch the goblins.\n\nBlix holds court, surrounded by a lantern's glow. Pox sits on a bit \nof crumbling masonary. Blunder watches Blix gesture with the \nalicorn.\n\nBLIX: Look at us! Waiting around like\nlackies....and for what? We're the \nones with the power!\n\nBLUNDER: You shouldn't talk like, Blix.\nWe gets in plenty big trouble!\n\nBLIX: I'm not afraid! Not even Darkness lasts \nforever!\n\nBlix aims the alicorn at Blunder, causing a burst of fire to erupt \nbeneath the tiny, helmeted goblin.\n\nBlunder YELPS and runs off, clutching his flaming backside.\n\nBlix roars with laughte. Power has gone completely to his head.\n\nBLIX (cont): Watch out, Pox!\n\nBlix points the alicorn at Pox. Fire explodes beneath the pig-faced \ngoblin. He leaps SCREAMING into the air.\n\nBlix points the alicorn at the fire he started and it grows larger.\n\nBLIX (cont): Higher.... higher....\nBurning fire! \nMaking music\nLike the choir!\n\nBlunder and Pox watch Blix make the fire fountain into the air.\n\nThe heavens blaze. Lili is dazzled.\n\nSomething very strange is happening within the swirling column of \nflame. Gradually, a demonic face emerges,\n\nOutlined in the fire we see the leering face of Darkness!\n\nPox and Blunder applaud Blix's rebellion.\n\nPOX/BLUNDER (chanting): Higher.... higher..\nBurning fire!\nMaking music \nLike a choir!\n\nThe three unsuspecting goblins looks up and see the demonic Lord of \nDarkness flaming above them.\n\nBlix tosses the alicorn into the air. Blunder unwittingly catches \nit.\n\nBLIX: Greetings, Worship....\n\nPOX: W-w-welcome, Great Lord....\nD-d-darkest of the ....\n\nDARKNESS: Your devotion disgusts me? You \ninsignificant strands of toad slobber!\n\nBlix and Pox drop grovelling to their knees, covering their heads \nwith leaves and dirt.\n\nBlunder can't control himself. He rushes forward and points the \nalicorn up at Darkness.\n\nBLUNDER: Hear me, you angels of light!\nYour reign is over! A new order \nbegins! All the imps of Hell will \ndance freely over this dark land....\nI hold the power....\n\nDARKNESS: Enough!\n\nDarkness points a burning finger at Blunder. The alicorn is rippef \nfrom the goblin's graps and flies up to Darkness. Blunder YELPS in \nterror.\n\nSomething terrible happens: the ground around Blunder begins to \nsoften. To his horror, the little goblin sinks under as if into \nquicksand.\n\nBLUNDER: Please.... It was only a joke...\nI didn't mean it.... Honest....!\n\nBlunder is in up to his neck. \n\nBLUDNER (cont): Whatsamatter? Have you no sense of\nhumour? I hope you choke of faerie \nbreath and flower petals!\n\nBlunder's hand points up from the earth. Darkness ZAPS it, turning \nit to another chicken-claw!\n\nBlunder is gone without a trace; sucked under with a disgusting \nSLURP.\n\nDarknesss HOWLS his triumph to the heavens.\n\nFrom her place of concealment, Lili overhears every word.\n\nDARKNESS: Did you think this alicorn a mere\nplaything....? With it my empire \nis eternal! Before I ruled only \nthe night. Now, my minions will\nfrolic in darkness until the end \nof time.\n\nDarkness aims the alicorn at the column of fire started by Blix, \ntracing an arc of flames through the night.\n\nLike a mad orchestra conductot with a magic baton, Darkness controls \nthe fire's movements. The blaze twists and swirls across the black \nnight, blazing meteor trails, bright as the aeora.\n\nBLIX (fawning): Forgive this intrusion.... My\ngoblins are a free-spirited lot.\nI like to encourage their....\ninitiative. What do you think of\nthis policy, Master?\n\nColumns of flame shower around the Dark Lord and from within thier \nincendiary interiors, evil wraith-like spirits emerge, swirling like \nghosts.\n\nBright as comets, numbers of etheral flaming spirits orbit their \nfiery master. Darkness stands in total control within their mighty \nconflagration, the alicorn his sceptre.\n\nSuddenly, with the pure clarity of a BELL CHIME, the presence of \nDAYLIGHT is detected.\n\nThe reflected glow of the coming dawn tinges the ground and casts it \nluminence over Darkness and the goblins.\n\nDARKNESS (cont) (writhing): What is this light...?\n\nBeams of rising sunlight advance down the tree trunks.\n\nDarkness recoils, wrapping his flaming cloak about him.\n\nDARKNESS (cont): You killed the final unicorn....\nIs this not true?\n\nBlix and Pox exchange guilty looks.\n\nBLIX: This is true....\n\nPOX: Undeniably t-t-true, Lord.\n\nDarkness is on to them. He points with the alicorn.\n\nDARKNESS: You lie! Here is dawn!\n\nPOX: Well.... almost t-t-true....\ness-s-sentially true....\n\nBLIX: That stallion is dead, dead as dreams,\ndead as legend....\n\nDARKNESS: OUT WITH IT!\n\nSunlight is half-way to the ground. Darkness shrinks, shrivelling \nlike a dying ember.\n\nPOX: But.... but.... the m-m-mare still\nlives...\n\nDARKNESS: If even one unicorn walks the \nearth, my power is not complete....\n\nBLIX: Just a female.... She has no\npower...\n. \nThe ground grows very light. Darkness melts into the campfire.\n\nDARKNESS: Only the power of creation....?\nGet that female....! I command\nyou.... In the name of Darkness....\n\nSunlight strikes the ground. Darkness is gone! His arm holding the \nalicorn aloft the fire is the last to disappear.\n\nLili backs silently into the shadows surrrounding the Great Tree.\n\n49 EXTERIOR FOREST PATH DAY\n\nLili runs straight into a driving blizzard. A distant SOUND alerts \nher and she pauses to listen.\n\nIt is Jack and the faeries, SINGING. Jack's voice carries above the \nothers.\n\nJACK & THE FAERIES (os): When times are hard and things look bad,\nDon't feel blue and don't feel sad....\n\nA look of astonished joy comes over Lili's face. As the SOUND of \nsinging FADES, she runs towards it, calling eagerly.\n\nLILI: Jack....! Ja-aack!\n\n50 EXTERIOR PATH TO GUMP'S CAVE DAY\n\nJack and the faeries troop march through the blizzard, all SINGING \nmerrily.\n\nJACK & THE FAERIES (singing): If your down, wearin' a frown,\nThat's the time to dance like a clown!\n\nJack hears something in the distance and stops to listen.\n\nLILI (very faint) (os): Ja-aack.... Ja-aack....\n\nJACK (bewildered): Lili....?\n\nThe SOUND of her distant call is erased by the howling storm. Jack \nsadly decides it was a trick of the wind and hurries to catch up \nwith the others.\n\n51 EXTERIOR FOREST PATH DAY\n\nLili stops running. There is nothing but the wailing wind.\n\nLILI (softly): Jack....? Oh, Jack....\n\nA solitary tear starts from her eyes, only to freeze on her cheek \nlike a diamond beauty spot.\n\nLILI (cont): Please God.... help me!\n\nLili drops sobbing to her knees. Through her grief, she sees the \nunicorn's track in the snow, each hoofprint gay with tiny blooming \nflowers.\n\nHer courage restored, Lili follows this meandering trail of \nburgeoning life through the forest.\n\n52 EXTERIOR ENTRANCE TO GUMP'S CAVE DAY\n\nGumps leads the way a huge BOULDER lodged uner the roots of a giant \ntree.\n\nGUMP (proudly): Here's my home, Jack.... What\nd'you think of that for a front\ndoor?\n\nJack thinks Gump is pulling his leg.\n\nJACK (in jest): Be some job in getting it open.\n\nGUMP: Think you so?\n\nGump WHISTLES. Immediately, two eyes blink open on the front of the \nboulder, and he is seen to have facial features.\n\nBOULDER: Morning', Gump....\n\nThe Boulder stands on a pair of tiny legs and waddles forth from \nunder the tree roots, REVEALING the entrance to a cavern.\n\nHe promptly trips and rolls over and over in the snows, his tiny \nstone feet kicking wildly in the air.\n\nGUMP (bowing): After you, Jack....\n\nJack enters apprehensively udner the twisting roots.\n\nJACK: Thank you....\n\nThe other faeries follow, leading the unicorn.\n\n53 INTERIOR MOUTH TO CAVE DAY\n\nAn earthern antechamber under the tree, high enough for Jack and the \nunicorn. There is a small wooden door at the far end, sealed with a \nbright brass padlock.\n\nGUMP: Brown Tom. Stay here with the\nunicorn and guard her well.\n\nBROWN TOM: Like me own life!\n\nGUMP: Better than that! She's the last \nof her kind.\n\nGump marches to the little wooden door. He inserts a finger into the \npadlock, twisting it like a key. Instantly, the pops apart. Gump \nopens the door and enters a low tunnel beyond.\n\n54 INTERIOR TUNNEL DAY\n\nTree roots twist down like dead men's fingers and clutch the ancient \nrune stones lodged in the earthen walls.\n\nGump and Screwball walk upright in the damp tunnel, but Jack is \nforced to crawl on his hands and knees. Luna flies above thier heads \nlike a tiny neon insect.\n\nGUMP: Right this way....\n\nGump pauses by another wooden door, sealed with a brass lock. He \nopens it instantly with his magic touch.\n\nSCREWBALL: Home, sweet home!\n\n55 INTERIOR GUMP'S CAVE DAY\n\nJack and the faeries enter a cost burrw furnished with carved wooden \nchairs and tables, a porcelain stove and bundles of herbs hanging \nfrom the ceiling. The simple furniture is overwhlemed by vat piles \nof treasure: gemstones, pearls, chests heaped with gold coins.\n\nGUMP: Fit for a king's ramsom!\n\nJack in awe as he wades through the ankle-high loot.\n\nJACK: Such riches.... I feel I must be\ndreaming....\n\nGUMP: If life is a dream, better you dread\nthe waking!\n\nScrewball fills a golden helm with rubies and pours them out over \nhis head. He laughs like a child in a sandpit.\n\nJACK: ....beautiful....\n\nGUMP: Mere trinkets.... Let's find you\nsomething useful.\n\nLuna's golden LIGHT streaks down and whirls around Jack's head. He \nswats futilely at her.\n\nJACK: Stop it....! Go away....!\n\nGUMP: Easy.... Luna only seeks a little \naffection.\n\nLuna hovers beside Jack's cheek.\n\nJACK: I meant no disrespect, but....\nouch! Make her stop, will you,\nGump!\n\nGUMP: Does your blood run so cold? You'll \nbe a corpse before your time.\n\nGump unstoppers a silver wine decanter and pours three goblets full.\n\nJACK: What does she want from me?\n\nGUMP: Foolish question....\n(handing Jack a goblet)\nDrink, and wamr your heart.\nThe answer's at the bottom of \nyour cup.\n\nJack sniffs his goblet suspiciously. This time, he is careful not to \ndrink when the faeries do.\n\nGUMP (cont): Now then.... down to business.\n\nGump pulls a bejewlled broadsword free from its scabbard. It is a \nremarkably beautiful weapon. \n\nJACK: What's this....? Something to cook\nwith?\n\nGump and Screwball exchange a hopeless look.\n\nGUMP(patiently): This is a weapon, Jack.... As fine\na weapon as you'll ever see.\n\nJACK(curious: So, that's a weapon.... What's it\ndo?\n\nSCREWBALL: World is doomed, if you ask me.\n\nScrewball goes back to playing with the jewels.\n\nGump pulls a silk handkerchief from his belt.\n\nGUMP: A little demonstration.\n\nGump tosses the kerchief high in the air and it wafts slowly down. \nThe little elf is an expert swordsman. He whirls the weapon in a \ngleaming blur, slicing the drifting handkerchief neatly in half.\n\nGUMP(cont): With such a blade you could behead\nan ogre as easily as uncapping a \nsoft-boiled egg.\n\nJACK: That's really something.... Can I\ntry?\n\nGump hands the sword to Jack.\n\nGUMP: You're the champion, aren't you?\n\nJack picks up half the kerchief off the jewel-littered floor and \ntosses it into the air. As it flutters down, he swings wildly with \nthe broadsword. Gump has to duck to avoid having his own head \nchopped off.\n\nGUMP(cont): Watch out....! You'll get the hang of \nit in time.... Now, we best see \nabout some armour..... Screwball!\n\nSCREWBALL: Coming right up!\n\nScrewball flips open the lid of a chest. Folded inside is a golden \nchain-mail coat of exquisite workmanship.\n\nGUMP: Go on.... see if it fits.\n\nJack slips the coat over his head. It fits perfectly.\n\nGUMP (nodding approval): It will turn a broadhead arrow\nar fifty yards.\n\nSCREWBALL: He might pass for a champion in \nthat.\n\nGUMP: Have a look at yourself, Jack.\n(pointing: Use yonder shield for a mirror.\n\nJACK(confused): ....Shield?\n\nGUMP(exasperated): The round shiny thing over there.\n\nSCREWBALL: Clothes never made the man....\n\nGump silences Screwball with a stern look and and stalks over to a \nsmall carved desk.\n\nThere is a loud, MUSICAL CHIME. Gump pulls a remarkable instrument \nfrom a pouch on his belt: a wonderous crystal globe filled with \nwhirling miniature worlds.\n\nGUMP(studying globe): Hmmm... getting late. Almost half-\nway past the morning mayfly hatch...\n. \nSCREWBALL(sullen): Too cold for mayflies now....\n'Sides, I ain't got no timepeice.\n\nGUMP: You first must know how \nto tell the time.\n\nSCREWBALL: I ain't got nothing....\n\nGUMP: No more chatter....! I've got work\nto do.\n\nGump sits at the desk setting his timepeice beside him and rummaging \namong his papers.\n\nJack kneels before a brightly polished shield and studies his \nreflection.\n\nLuna round and round his head.\n\nSCREWBALL: Think I'll brew some tea.\n\nScrewball snatches variosu herbs off the ceiling.\n\nSCREWBALL(cont): Colt's foot and sassafrass...\nMaybe a spot of spearmint....\nSt John's Wort not bad.... and\na little foxglove.\n\nScrewball feverishly stuffs a silver teapot full of dried herbs.\n\n56 DELETED\n\n57 EXTERIOR PATH TO GUMP'S CAVE DAY\n\nThe unicorn's flowering footprints lead Lili to Gump's cave.\n\nShe pauses to consider the situation. Snowflakes glisten in her \ntangled hair. She is fiercly beautiful.\n\nDeciding nothing is amiss, Lili stalks silently inside.\n\n58 INTERIOR MOUTH OF CAVE DAY\n\nA small cooking fire flickers under blackened pots and an iron \nskillet. The mare unicorn is bedded down on a blanket of straw. \nBrown Tom lies fast asleep against her flank.\n\nThe unicorn lifts her head when Lili tiptoes in.\n\nBrown Tom is jerked awake as the mare climbs to her feet, snorting \nwith rage.\n\nBROWN TOM: What....? What....? \nWho's there?\n\nLILI: I'm Princess Lili.... I.....\n\nBROWN TOM: You! You're the cause of \nall our sorrow!\n\nThe Princess drops to her knees.\n\nLILI: I know it was wrong.... Everything\nis my fault.\n(weeping)\nPlease.... please forgive me.\n\nBROWN TOM: I ain't the one ye should be asking.\n\nLILI: I want to make it up to her....\nI followed the goblins! They gave the alicorn \nto the Lord of Darkness!\n\nBROWN TOM: Good lass! You're a plucky\nlittle partridge at that.\n\nLILI: We can't stay here! It's not safe!\nDarkness sent the goblins to hunt\nthe mare... If I found her, so will\nthey....We msut go!\n\n59 DELETED\n\n60 INTERIOR MOUTH OF CAVE DAY\n\nBrown Tom looks past Lili to the mouth of the cave.\n\nBROWN TOM: Too late!\n\nPox and Blix stand in the entrance, aiming their wicked, barbed \narrows straight at the hearts of Lili and Brown Tom.\n\nBrown Tom swings an iron skillet back over his head in a warrior's \nstance.\n\nBROWN TOM: If you imps're looking for a\nfight, ye've come to the chap\nwho'll oblige ye.\n\nBLIX/POX: Kill....! K-k-kill...!\nKill...!\n\nBlix and Pox loose their arrows, renocking the bows with incredible \nspeed.\n\nBrown Tom moves like lightning, using the skillet as a shirld to \ndeflect the arrows raining about him.\n\nLili stands in front of the mare, striving to protect the unicorn's \nbody with her own.\n\nBrown Tom lepas acrobatically about with the skillet. A fusillade of \narrows CLANGS OFF its iron surface.\n\nA lucky shot peirces Brown Tom's hat. Dark red liquid streams down \nhis face. His eyes roll up in mortal terror.\n\nBROWN TOM: Dick-o-Tuesday's duck! They've done\nfor me!\n\nBrown Tom staggers in a dramatic half-circle, toppling straight over \nbackwards, stiff as a board.\n\nThe mare unicorn rears WHINNYING on her hind-quarters.\n\nThe goblin hunters advance. Blix spreads a heavy net wide.\n\nThe black shadow on the net falls across Lili and the unicorn like \nan evil spider web.\n\n61 INTERIOR GUMP'S CAVE DAY\n\nScrewball's teapot steams merrily. He sits stop a jewel cask \nenjoying a cup. A horned Viking helmet several sizes too large \ncovers his head down to the bridge of his nose.\n\nGump works at his desk, marking out distances on an ancient chart \nwith a pair of golden dividers. Dozens of parchment mps are spread \nin front of him.\n\nGUMP(muttering): Forty leagues from the Dragon's\nTrack.... another half-span past \nthe basilisk den.\n\nGump lifts his elbow and the curled parchment rolls together.\n\nGUMP (cont)(annoyed): Wirrikows and dopplegangers!\n\nSCREWBALL: Spot of tea, Gump....?\nHelp calm your nerves...\n\nGUMP: Not now! I'm busy with navigation.\n\nOn the other side of the cave, Jack practices a variety of thrusts \nand passes with his sword in front of the polished shield.\n\nLuna buzzes around him like a miniature meteorite.\n\nJACK: That's not so bad.... What do you\nthink, Luna?\n\nJack studies his reflection in the shield.\n\nThere is a BURST OF LIGHT behind him. Luna materialises as a child-\nsized woman with gossamer wings. She wraps her slender arms around \nhis neck.\n\nLUNA: I think you look like a hero.\n\nJACK: What! H'd you do that?\n\nJack spins around, but Luna is gone. Only the tiny dot of LIGHT \nhovers in the air.\n\nJACK(cont) (puzzled): Magic....\n\nJack looks back at the shield and there is a full-sized Luna hugging \nhis reflection.\n\nLUNA: Nobody knows nut you. it's our\nsecret....\n(kissing his cheek)\nPromise?\n\nJACK (squirming): Don't do that.\n\nLUNA(another kiss): Better promise....\n\nJACK: All right, all right....\nI promise.\n\nA loud, MUSICAL CHIEME interrupts Gump's work. he looks around for \nhis timepiece but it is nowhere in sight.\n\nGUMP: Hmmmm...? Screwball!\n\nSCREWBALL (all innocence): Something I can\ndo for you, Gump?\n\nGUMP: Hand it over....!\n\nSheepishly, Screwball pulls Gump's timepeice from inside his tunic \nand gives it back.\n\nSCREWBALL: Well, well, well....\nhow'd that get in there? Must be\nsome kinda magic...\n\nGUMP: Sneak thief's magic!\n(studies timepiece)\nJack! it's time we were on\nour way!\n\nAt the SOUND of Gump's voice, Luna TRANSFORMS instantly back to a \ndot of light.\n\nJACK: I'm ready as I'll ever be....\n\nJack picks up the shield and starts after Gump and Screwball. Luna \nflies overhead.\n\n62 INTERIOR MOUTH OF CAVE DAY\n\nBrown Tom lies flat on his back as Jack and the faeries emerge from \nthe tunnel. \n\nGump rushes to his fallen friend, lifting him in his arms.\n\nGUMP: Brown Tom....? You can't be dead....!\nOh, this is is terrible.... terrible!\n\nBrown Tom opens his eyes and looks feebly about.\n\nBROWN TOM (in a daze): Why, Wisp.... \nthey kill you, too?\n\nGUMP: Course they didn't! What in blazes\nare you talking about?\n\nBrown Tom rolls his eyes up at the arrow piercing his hat.\n\nBROWN TOM: Goblins shot me through\nthe brain pan.\n\nGump yanks off Brown Tom's hat. Bits of broken wine bottle tumble \nout. Gump reagrds his friend with scorn.\n\nGUMP: Your brains are one spot an\narrow'd do no harm!\n\nJACK: Where's the unicorn?\n\nSheepishly, Brown Tom pulls the arrow from his hat.\n\nBROWN TOM: I'm afeered the goblins took her.\nDid me best to fight them off, but\nthey swarmed up by the hundreds.... Horrid\ncreatures they were. The Princess warned \nme, but....\n\nJACK: Princess Lili?\n\nBROWN TOM: Aye.\n\nJACK(overjoyed): She's alive!\n\nBROWN TOM: She was living still \nwhen they killed me.\n\nGUMP: You'll earn your champion's spurs\nthis day, Jack.... We'll follow their\ntracks in the snow. Foul weather's on our\nside for a change.\n\n62A EXTERIOR FOREST DAY\n\nJack and the faeries march through the woods holding lanterns, into \nthe teeth of a driving blizzard.\n\n63 INTERIOR GREAT HALL DAY\n\nBlix and Pox kneel nervously before the Throne of Darkness. A huge \nfire blazes in the hearth.\n\nPOX: Hail m-most great, and d-d-darkest\nof the dark!\n\nBLIX: Though we be nothing in your sight,\nWe bow before your strength and might!\n\nWe hear Darkness speak, but see only his bat-winged shadow spread \nlike an inky cloak across the two kneeling goblins.\n\nDARKNESS (os): Can you fawning sycophants\ndo more than grovel? What of the task I set you?\n\nPOX: D-d-done, Lord. We have the \nm-m-m-m-m-m.... the unicorn.\n\nDARKNESS(os): Where is she?\n\nBLIX: In the dungeon like a treasure, \nAwaiting your darkest pleasure.\n\nDARKNESS (os): Very good.... You two are not\nentirely devoid of talent.\n\nPOX: There's m-m-more, Sire....\n\nBLIX: Though unworthy of your magnificence,\nTrifles without consequence,\nWe present with all due deference....\nA gift. \n\nDARKNESS (os): Gift....? What sort of gift?\n\nBLIX: This thing you once called innocence.\n\nDARKNESS (os): Innocence...? I must behold this \nwonder....\n\nDarkness stares into the fire.\n\nAs Darkness grimps the arm of his throne, his fingers start to melt, \ndripping to the dank stone floor.\n\n64 INTERIOR DUNGEON DAY \n\nDarkness bleeds through the groin vault ceiling, speading like a \nstain across the curving stones.\n\nBelow, the unicorn is locked in a steel halter, a woven steel cable \nbinding her to an iron windlass.\n\nThe Princess paces the dark and dripping cell. Her dress is in \ntatters, her hair tangled. There is something wild and free about \nher now, and yet she has never appeared more alluring.\n\nThe melting shadow of Darkness drips from the ceiling, forming a \nsmall demonic shape as it falls.\n\nWe hear the BEATING of Darkness' heart in time with each evil drip. \nThe sound grows LOUDER and LOUDER until the echo reverberates within \nthe vaulted chamber.\n\nLili is terrified. She looks frantically around as the pulsing rhytm \ncontinues. The Princess sees nothing and hugs the unicorn's neck for \ncomfort.\n\n64A INTERIOR GREAT HALL DAY\n\nDarkness contemplates the raging flames, his heartbeat THUNDERING.\n\n65 EXTERIOR HILL ABOVE GREAT TREE BOG DAY\n\nJack and the faeries stare out at the tree-crowned ruin and \nsurrounding bog.\n\n65A EXTERIOR BOG DAY\n\nJack and the faeries wade forward through the drifting curtains of \nmist.\n\nJACK: Legend says the Dark Castle stood\nin olden days when evil anarchy\nruled the land.... The wicked still\ncome here to sacrafice.\n\nGUMP: They worship the demon....\n\nSCREWBALL: It's ugly! I hate it!\n\nGUMP: Good! You shall go first....\n\n65B INTERIOR GREAT HALL DAY\n\nCLOSE ON: Darkness. For the briefest instant, we see the smouldering \neyes of the demon GLOWING in anitcipation out of the shadows.\n\n65C EXTERIOR BOG DAY\n\nAlthough Jack is in no trouble, the water is rapidly growing too \ndeep for the faeries. Gump urges Screwball forward:\n\nGUMP: Go on! Hurry up!\n\nSCREWBALL: All the time me.\nSame old story.\n\nScrewball clibs up onto a floating lily pad.\n\nAn undulating v-shaped wake moves through the water alongside as \nthey step from lily pad to lily padf and clamber onto a long, \ntwisting root.\n\nWithout warning, an emaciated green arm shoors out of the water and \ngrabs Screwball. He is gone under the surface with a scream.\n\nBROWN TOM: Screwball!\n\nJACK: What was that?\n\nGUMP: Big trouble!\n\nJack grips the hilt of his sword and rushes to the spot where \nScrewball disappeared.\n\nJACK: We've got to do something.\n\nBefore Jack can finish, Meg Mucklebones rises out of the bog behind \nhim. She tosses Screwball aside and hauls Jack into her cadaverous \nembrace.\n\nMEG: Foul tasting faerie.....! Come to\nme, juicy boy!\n\nJack YELPS in horror.\n\nMEG (cont): Who be this tender morsel\ndisturbing Meg Mucklebones' rest?\n\nJACK(terrified): They call me Green \nJack ma'am.\n\nThe faeries watch in dismay.\n\nBROWN TOM: Our champion's a goner, he is.\n\nThe fearsome hag pinches Jack with her wicked talons.\n\nMEG: What a fine fat boy you are....\n\nJACK: You don't mean to eat me,\ndo you ma'am?\n\nMEG: Oh, indeed I do....\n\nJACK: That would be a shame, Miss Meg.\nYou're so lovely. You deserve far \nbetter than scrawny little\nme....\n\nThe flattery gives Hairy Meg a pause; she simply can't resist it.\n\nMEG: Hmmmm....think me fair, do you, Jack?\n\nJACK: All the heavenly angels must \nenvy your beauty.\n\nMEG: Ooooo....what a find meal you'll make,\nbe the rest of you as sweet\nas your tongue.\n\nJACK: Let me go and I'll sing songs\nof praise to you.\n\nMEG: Let you go? Don't be daft. I've\nhad naught but muskrat and snakes \nall this month.... bit of rancid\ngoblin, too....\n\nJACK: But....but....don't you like\nmy words?\n\nMEG: Words are little help in \nfilling an empty stomach....\n\nJACK: Then fill your soul with loveliness.\nLook into your glass and feast on\nbeauty.\n\nMEG: There's no looking-glass here....\nSometimes, when the moon is full,\nI'll chance to see my reflection\nin the bog.\n\nJack glances at the shield hanging over his shoulder.\n\nJACK: My shield would serve you well.\n\nMeg Mucklebones takes Jack's shield, partially releasing him from \nher clammy clutches.\n\nMEG: What a splendid idea! \nYou be so clever, Jack.\n\nHanging onto Jack with one hand, Hairy Meg bends over the shield.\n\nJACK: Your radiance is the alchemy\nthat makes rusted steel shine like \nsilver.\n\nMeg primps and preens: an obscene parody of a pretty maiden at her \nvanity table.\n\nMEG: Oooo! That's nice! I be the envy\nof any princess in the land.\n\nWhile Meg is pre occupied with her grotesque reflection, Gump \ncatches the Jack's eyes. The cunning elf silently mouths the word: \n'sword', pointing to his waist at the same time.\n\nJACK: Better, you are a queen without\na peer.... a reigning angel.\n\nJack nods to Gump and silently draws his sword. Meg doesn't notice \nthing.\n\nMEG: You have such discerning taste \nfor so young a boy....\n\nMeg turns to face him with a fearful pucker of her tattered lips.\n\nMEG (cont): Come, Jack....give us\na kiss before dining.\n\nJack petrified with fear.\n\nGUMP(shouting): Give her the kiss of \ncold steel, Jack!\n\nJack swings blindly with his eyes closed. It is a lucky stroke, Meg \nMucklebones' head flies from her shoulders.\n\nJACK(astonished): I did it!\n\nThe decapitated hag sinks back beneath the scummy surface.\n\nGUMP: Like a chmapion, Jack.\n\nBROWN TOM: Bravo!\n\nJACK: How's Screwball?\n\nSCREWBALL: Chewed, but not disgested....\n\nJack points his sword at the hollow tree.\n\nJACK: Then on to victory!\n\nFAERIES (all together): On to victory!\n\n65D INTERIOR GREAT HALL DAY\n\nA huge fire blazes in the gaping hearth. Darkness stands before it, \nalmost a shadow in his midnight cloak.\n\nDARKNESS: I've been an exile for too long....\nbanished by the sun.... forced to\nhide in the bowels of the earth....\nOn the eve of my greatest victory, this....\nchild of nature appears.... It has been an eternity\nsince I felt such desire.... I could know \nher in an instant. She is helpless.... and yet....\n(anguished)\nWhat is wrong with me, Father?\n\nA VOICE IN THE FIRE answers Darkness; majestic and sepulrchral; the \nflames billow out as it speaks:\n\nVOICE: You hold the world in your grasp....\nSupreme power belongs to you... yet \nyour triumph is meaningless!\n\nDARKNESS: Meaningless?\n\nVOICE: What do you gain from it? What pleasure\ncomes from ruling a pack of imps and\ngoblins....? Souls already black.... This\ninnocent creature fascinates you because \nonly she can appreciate the enormity\nof your achievement.\n\nDARKNESS: I'll take her then!\n\nVOICE: A hollow victory! She remembers \nthe world as it was, when she loves your\nnew order you will triumph! Woo her....\nwin her.... break her spirit....\n\nDARKNESS: Thank you, Father.... Your\nwisdom is ever my guide.\n\nVOICE: Remember.... She must desire you....\nnothing else matters!\n\n65E EXTERIOR GREAT TREE DAY\n\nJack and the faeries step ashore on the island. Gump makes a \nmystical sign with his hands.\n\nJACK: What's that?\n\nGUMP: For our protection, Jack. You must \nbe ready.... Remember, Darkness is a liar....\na treacherous fiend! Don't listen to him. \nNever believe what you see.....\n\nJACK: He won't fool me.\n\nGUMP: Don't be so sure! No human has \never set foot in this place before! \n66 INTERIOR GREAT TREE DAY\n\nJack and the faeries stare up at the massive horn embedded in the \ninner tree.\n\nScrewball starts to climb towards it.\n\nSCREWBALL: What a nice big trumpet....! Bet\nit sounds louder than anything....\n\nGump hauls him back down by the seat of his pants.\n\nGUMP: Don't touch it! Our lives are\nlost if it blows!\n\nJack finds an opening hidden between the roots of the inner tree.\n\nJACK: In here! I've found a passage!\n\nJack drops inside.\n\n66A INTERIOR GREAT HALL DAY\n\nThe moment Jack enters the inner tree, a deep TREMOR reverberates \nthrough the subterranean Castle of Darkness.\n\nDraped in shadows before the fire, the Dark Lord looks up at this \ndisturbance.\n\nDARKNESS (to the fire): I feel a presence....!\nSome power invades my sanctity....\n\nVOICE (from the flames): Every wolf suffers \nfleas.... 'tis easy enough to\nscratch!\n\nThe flames surge out towards Darkness, embracing him.\n\n67 INTERIOR TINY ANTECHAMBER DAY\n\nLike the catacombs of Paris, the walls are decorated with bones and \nhuman skulls. At each corner of the open ceiling is a carved demonic \nhead. Jack and the faeries stand looking up.\n\nGUMP(gloomily): The decor of death....\n\nBROWN TOM: Tells you somthing 'bout\nhim what lives here.\n\nSCREWBALL: It's a dead end....\n\nJack searches along the ossuary walls.\n\nJACK: Doesn't make sense.... Check\nthe walls. There must be some sort\nof secret key....\n\nScrewball doesn't join the other faeries in the search. He is \nattracted by several round stone balls lying in the rubble. Picking \nup three with a happy grin, he begins to juggle.\n\nSCREWBALL: One-two-three....\nfidde-dee-dee....\n\nGump sees what Screwball is doing and flies into a rage.\n\nGUMP: Screwball! Drop those this \nminute!\n\nScrewball tosses the balls carelessly over his shoulder. One lands \nin the stone cornice near the ceiling and rolls along, gathering \nmomentum as it passes through the open mouths of each gargoyle.\n\nThe balls disappears into the mouth of the final gargoyle. It is \nswallowed with an emphatic GULP.\n\nAll at once, the roof slides shut above.\n\nBROWN TOM(alarmed): Newt-finger marmalade!\n\nThe floor pulls suddenly open and they all plummet SCREAMING into \nempty space. Luna circles, a dot of light above tthe bottomless pit.\n\nLUNA (wee voice): Oh, dear.... Oh, dear...\n\nThe tiny faerie whirls in a blur of indecision before streaking down \ninto the dark opening after her falling friends.\n\n68 INTERIOR CAVE CHUTE DAY\n\nLike prisoners on a fairground helter-skelter, Jack and the faeries \nspin down a seemingly endless curvinbg chute.\n\nGUMP(singing): When times're hard and thing look bad,\nDon't feel blue and don't feel sad....\n\nJACK: How can you sing at a time\nlike this?\n\nGUMP: Can you think of anything \nbetter to do?\n\nThey hurtle through festooned cobwebs, stirring up smokey clouds of \nancient dust.\n\n69 INTERIOR CAGE AND ALCOVE DAY\n\nThe end of the chute opens into an iron cage. Jack and the faeries \ntumble through onto a pile of straw. Luna is right behind, bright as \na firefly.\n\nBROWN TOM: Ouch! Ow!\n\nSCREWBALL: Where are we?\n\nGump stares woefully at the iron bars.\n\nGUMP: Some place we don't want to be!\n\nA scuffling NOISE in the far side of the cage attracts their \nattention. Blunder pops up from a pile of straw, still wearing his \nhelmet.\n\nBLUNDER: Shhhh! What is this?\nA chatterbox convention?\nSCREWBALL: Who be you, bucket-head?\n\nGUMP: Stay clear of that imp! He's\na hell hound goblin!\n\nBLUNDER: What I am won't help me \nnone, nor you neither....\n\nBlunder pulls off his helmet. He is Screwball's indenical twin!\n\nBLUNDER(cont): ....even if you is my brother!\n\nScrewball can't believe his eyes.\n\nSCREWBALL(astonished) Blunder...!\n\nBLUNDER: Screwball....!\n\nThey rush into each other's arms.\n\nGUMP (to Jack): A Buttercup family reunion....!\nI can't believe it.... Last I remember,\nhe sold Screwball a jug of dragon's tears\nthat turned out to be cow piss!\n\nSCREWBALL: What happened to you?\n\nBLUNDER(flexing his bird claw): It's a long story....\nLet's just say I went look for adventure and \nfound more'n I could handle....\nDoesn't matter now anyway... We're all of us\nin the same fix....\n\nJACK: Just what sort of fix is that?\n\nBLUNDER: The kitchen of the Lord of \nDarkness! All of us be on his menu!\n\nSCREWBALL: I knew it! I knew it! Should\nof stayed at home....\n\nBLUNDER: That's right, brother, me'n you \nis barbeque!\n\nBROWN TOM: Wish I had a drink....\n\nJACK: Only dead meat waits for the\nstewpot! Spring the lock, Gump!\n\nGump examines the huge padlock with a frown.\n\nGUMP (wearily): Iron is sore trouble for elves.\n\nSCREWBALL: Magic's no good against it.\n\nJack slumps down in the corner to think things over. The faeries \nmill about by the opposite wall.\n\nJack stares at the bars. Luna orbits his head.\nJACK: I know I promised.... but it's the only way....\n\nLuna buzzes him furiously.\n\nJACK(cont): Sure it's a secret... It'll\nkeep forever when we're all dead....\n\nJack glances guiltily at the whirling dot of LIGHT.\n\nJACK(cont) (to Gump): Why not have Luna fly\nout between the bars and find a key?\n\nGUMP(shaking his head): She's much too small....\ncould never lift it...\n\nJACK(blurting it out): Not if she changes \nsizes like she can!\n\nGUMP: What?\n\nThere is a bright FLASH of faerie-light and Luna stands full-sized \nbefore them, her gossamer wings a-tremble.\n\nGUMP(cont)(outraged): You wilful sprite! How dare \nyou keep such secrets?\n\nLUNA: They're mine to keep! But I'll do\nwhat you ask.... if you kiss me, Jack.\n\nJACK: That's easy enough.\n\nJack kisses her chastely on the cheek.\n\nLUNA: Call that a kiss? Am I not sweet?\n\nJACK(eager to please): Sweeter than bee\npollen on a summer wind.\n\nLuna moves in close to Jack.\n\nLUNA: Sweet is the wind thats blows me to \nyou....\n\nJack gently pushes her away.\n\nJACK: It's not possible. I'm in love....\n\nLUNA: A faerie's love makes anything \npossible....\n\nA soft cocoom of faerie LIGHT engulfs Luna. She metamorphoses within \nit, emerging as Princess Lili.\n\nLUNA/LILI: ....even you heart's desire.\n\nLuna/Lili embraces Jack. It is sweet and tempting.\n\nJACK(resisting): No.... this isn't real....\n\nScrewball and Blunder giggle and snigger.\n\nLUNA/LILI: Oh, but it is.... I'm warm and alive\nand happy to be in your arms.\n\nJack is nearly enchanted, but after a delicious moment, he pushes \naway.\n\nJACK: I can't do it....! This is faerie glamour!\n\nA brilliant aura of faerie LIGHT envelops Luna/Lili and she \nTRANSFORMS into her true winged-form\n. \nLUNA(bitterly): You....! You....mortal! I\ncould vex you! Dance you life away!\n\nJACK: Threats can't make you love you.\nHuman hearts don't work that way.\n\nLUNA: What care I for human heart?\nSoft and spiritless as porridge!\nA faerie's heart beats fierce and free.\n\nThere is a furious pytotechnic whirlwind and, in an instant, Luna \nreturns to a tiny dot of LIGHT.\n\nJACK: Luna....?\n\nWithout an answer, Luna flies out between the iron bars.\n\nJACK(cont) (to the faeries): I.... didn't mean\nto hurt her.\n\nGUMP(scornful): Your fine senseibilities\nhave left us here to rot.\n\nThe SOUND of heavy footsteps approaches, accompanied by rough, \ntuneless SINGING.\n\nCOOK(os): ....this li'l piggie went to market....\nanudder li'l pigge got eat.... pig-meat\npie, l'l piggie die....\n\nBLUNDER: Oh, no! He's coming...!\nHide! Hide! Hide!\n\nBlunder conceals himself under a pile of straw. A deformed shadow is \ncast across the cage.\n\nSCREWBALL: Blunder's got the right idea!\n\nScrewball hides in the straw. Jack and the other immediately do the \nsame.\n\nA fiendish demon COOK opens the cage door. He is ten feet tall and \nunspeakably ugly. He peers blindly inside, sniffing the air with his \nhideous nose.\n\nCOOK: ....pig-pig-pig...\n. \nThe Cook gropes inside the cage.\n\nThe Cook reaches deep into the straw pile in teh corner and grabs \nBlunder.\n\nBLUNDER: Help....! Lemme go...?\nTurn me loose, you tub o' guts!\n\nThe cook hauls Blunder out, kicking and screaming. He locks the cage \nabd stumps away.\n\nBLUNDER(cont): I hope I give you heart-burn!\n\nAfter a bit, the faeries and Jack peer up out of the straw.\n\nSCREWBALL(woefully): Fricasseed faeries, the lot of us....\n\nBROWN TON: Lambs to the slaughter....\n\nJack draws his sword.\n\nJACK: Not without a fight!\n\nTransformed back to full-size, Luna tip-toes into the alcove outside \nthe cage, her hands coyly behind her.\n\nGUMP: Luna....!\n\nLUNA(maliciously): You look like mourners at your\nown funeral.\n\nGUMP(angry): Come back to dance on \nour graves!\n\nLUNA: I'd gladly frolic on Jack's....\n\nShe LAUGHS and holds up a large iron key.\n\nLUNA(cont): ....but this cage shan't be \nyour tomb!\n\nLuna tosses the key in to Gump. Instantly, she reduces to a tiny dot \nof LIGHT and flies out of the alcove.\n\nGUMP: Well done!\n\nGump unlocks the barred door and they all clamber out. Screwball \nsteps on Brown Tom's head in his eagerness.\n\nSCREWBALL: Lemme outta this stink hole!\n\nBROWN TOM: Mind you bleeding foot!\n\nGUMP: Shhhh! \n\nJack is the last of all.\n\nJACK: Keep behind me in case\nthere's trouble.\n\nSword in hand, Jack ;eads the faeries out of the alcove into\nthe kitchen.\n\n70 INTERIOR KITCHEN DAY\n\nHuge ovens belch fire and smoke. The vast hearth blazes. Like the \nlower reaches of Hell, the Dark Lord's kitchen is a place where all \nhope is abandoned.\n\nJack and the faeries creep through the brimstone haze.\n\nBROWN TOM: Terrible sight for a sober\nman to see....\n\nJACK: Quiet!\n\nThe demon Cooks blocks the way, chopping meat with a montrous \ncleaver, A SECOND COOK, every bit as terrifying, SNORES by the \nhearth. Trussed to a spit, Blunder hangs upside-down nearby.\n\nJack motions the faeries on. The blind Cook turns them, sniffing the \nair.\n\nCOOK: Whut be there?\n\nJack and the faeries duck behind a huge bellows.\n\nSCREWBALL: ....Back in the frying pan!\n\nGump clamps his hand over Screwball's mouth.\n\nGrasping his cleaver, the Cook advances towards them.\n\nCOOK(sniffing): Be it live victuals?\n\nFrom where he hangs, Blunder sees the faeries' plight.\n\nBLUNDER(calling out): Hey....!\nLard belly!\n\nThe Cook turns, angered by this insult.\n\nCOOK: Whut say, pip-squeak?\n\nBLUNDER: Two things down here look \njust alike!\n\nCOOK: Wuzzat?\n\nBLUNDER: Your face and my ass!\n\nThe Cook GROWLS with fury.\n\nCOOK: Bash in you face! Den it no be \nso pretty!\n\nThe Cook backhands poor Blunder, smacking him about like a punching \nbag.\n\nJack and the faeries make a break for the exit.\n\nBlunder manages to work one arm free from his bonds.\n\nCOOK(cont): Whut you got to say now,\npork pie?\n\nBlunder rears back and punches the Cook in the jaw. Stunned,\nhe topples over over backwards a great CRASH.\n\n70A INTERIOR GREAT HALL DAY \n\nThe reverberations tremble through the immense underground castle. \nDarkness listens by the fire. \n\nDARKNESS: Do you feel it, Father....? \nA force....loose in my domain.... \n\nVOICE(out of fire): Guard well what is yours! \n\nDARKNESS(roaring): BRING INNOCENCE TO ME! \n\n71 INTERIOR KITCHEN CORRIDOR DAY \n\nThe faerie band gathers in the foul, dripping corridor. Irregular \ntorchlight casts a lurid glow across the broken stones. \n\nBROWN TOM (gasping for breath): \n.....saved....by a goblin.... Never \nthought....I'd see....the day.... \n\nJACK: Wish we could repay the favour! \n\nSCREWBALL: My brother can take of himself. \n\nGUMP: Screwball's right! It's more important \nwe find the unicorn. \n\nJACK: And Lili! \n\nBROWN TOM: Where do we start? \n\nGUMP: We must find the dungeons. Legend has \nis they house such sirriw that death \nis a gift....albeit one rarely granted. \n\nScrewball sits down defiantly. \n\nSCREWBALL: Think I'll stay right here thank you \nvery much. \n\nGump grabs hold of Screwball's ear and hauls him back up. \n\nGUMP: Not so fast! You search with the \nrest of us! \n\nScrewball hugs Jack's leg. \n\nSCREWBALL: All right! I'm going with Jack! \n\nGUMP: No you won't. Be faster if we \nsplit up. \n\nScrewball looks both ways, deciding which seems safest. \n\nSCREWBALL: Fine! I'm going this way! \n\nBROWN TOM: I'm going that way! \n\nThey both turn and collide, falling flat on their rumps. \n\nJACK: Wait....! Better to search in \nteams, Gump and me together. Brown \nTOm, you and Screwball look in the \nother direction. \n\nGump hauls out his ornate timepeice. \n\nGUMP: Right! Let's synchronise! We meet \nback here in twice five hundred \nbeats of a bluebird's heart. \n\nBrown Tom takes a similar timepeice from under his tunic and studies \nits intricate interior. \n\nBROWN TOM: Best to allow another couple dozen \nbutterfly breaths in case we get \nthirs....er, get lost.... \n\nGUMP: No grog shops down here, Brown Tom. \n\nJACK: Let's hurry! \n\nJack and Gump run off along the corridor, followed by Luna's glowing \nLIGHT. Screwball watches without moving. \n\nSCREWBALL: Know what I want to know? \n\nBROWN TOM: What? \n\nSCREWBALL: Why me? \n\nBrown Tom gives Screwball a swift kick in his rear. \n\nBROWN TOM: Why not? \n\nThe two little elves scamaper off together. \n\nSCREWBALL: I hate it....I hate it.... \nI hate it.... \n\n72 INTERIOR DUNGEON DAY \n\nThe iron-studded dungeon days swing magically open as Lili watches, \nher eyes aglow with animal fire. She crouches beside the unicorn, \nresting on her haunches in an easy feline fashion. \n\nLili rises like a sleepwalker, unable to resist the compulsion \nluring her toward the open doorway. \n\nThe chained unicorn WHINNIES pitifully. Princess Lili looks back \nwithout expression as she leaves. \n\n73 DELETED \n\n74 DELETED \n\n75 INTERIOR ANOTHER CORRIDOR DAY \nLuna's bobbing LIGHT leads the way as Jack and Gump hurry along the \nrubble-choked corridor. Alerted by the SOUND of something, they dart \ninto the shadows. \n\nGUMP: Quick, Jack! \n\nJack and Gump watch in horror as a cracked EGG the size of a \nwatermelon runs down the corridor on armor-scaled chicken legs, led \non either side by a Demon holding a chain leash. \n\nJack draws his sword. The Demons stop and the Egg begins to crack. \n\nJACK: I'll scramble that one! \n\nGump restrains him. The Egg cracks apart. \n\nGUMP: Don't trust your eyes! All is \nenchanted here. \n\nThe Egg breaks into pieces and a dripping winged monster emerges; a \ndiabolic cross between a bat and a pterodactyl. It emits a fearsome \nSHRIEK and flies off down the corridor followed by the twin \nattendant Demons. \n\nJack and Gump hurry on in the opposite direction. \n\n75A INTERIOR DUNGEON CORRIDOR DAY \n\nScrewball and Brown Tom creep timorously forward. They are alerted \nby the SOUNDS of something approaching. A hideously deformed shadow \nfall across the opposite wall. \n\nThe two faeries clutch each other in terror and duck into the \nshadows. \n\nIt is Princess Lili! She passes the evles' hiding place as if in a \ntrance. \n\n76 INTERIOR VIADUCT DAY \n\nJack and Gump emerge on a narrow span arching across the vast \ncentral of the undreground castle. Similiar viaducts, above and \nbelow, bridge the awesome chasm. \n\nThe Green Man and the faerie gawk at the sheer magnitude of it all. \n\nJACK: Not even kings live like this.... \n\nOn a high span above, Jack sees Princess Lili drifting by like a \nsomnabulist. \n\nJACK (cont): My God! Gump, look! It's Lili! \n\nGUMP: Don't believe it, Jack. \n\nJACK (yelling): Lili ! \n\nThe SOUND ECHOES through the vast space. \n\n77 INTERIOR LILI'S VIADUCT DAY \n\nThe Princess pauses. A section of parapet has broken off and she \nwanders to the edge, staring down into the void. For a precarious \nmoment, she teeters on the brink, seemingly about to fall. \n\nJACK (os) (calling): Li-li ! \nThe Princess does not respond, wobbling like a dreamer on the narrow \nedge of disaster. She leans against the ruined parapet and a bug \nchunk of masonry breaks away, tumbling and bouncing into the abyss. \n\nJACK (cont) (os) (calling): It's Ja-ack ! \n\nLili's face is blank. She turns and continues blindly on her way. \n\n78 INTERIOR VIADUCT DAY \n\nJack stares up at Lili's retreating form. \n\nJACK: It's her. I know it. \n\nGUMP: Don't be so hasty! Remember who we're dealing with. \n\nJACK: I've got to reach her! \n\nJack races off. Gump runs along behind. \n\n78A INTERIOR GREAT HALL DAY \n\nThe shadowy figure of Darkness looms over a band of deformed PYGMIES \nwith needle-sharp teeth and wickedly curved talons long as pitchfork \ntines. \n\nDARKNESS: My enemies approach.... destory them! \nDarkness points an evil finger and the Pygmies scurry CACKLING off. \n\n79 DELETED \n\n80 INTERIOR LILI'S VIADUCT DAY \n\nJack and Gump hurry out onto the arching span. The Princess is \nnowhere in sight. \n\nGUMP (running after): Slow down....! \nUse some caution! \n\nJACK: This way! \n\nJack runs on into the corridor in the direction taken by Lili. Gump \nfollows after. \n\n81 INTERIOR RAIN CORRIDOR DAY \n\nLili wanders down a long colonnade with dangling vine-like roots. A \nglistening magic rain falls from the granite ceiling. Her blank eyes \nstare straight ahead. \n\nJack and Gump appear at the opposite end of the passage in time to \nsee the Princess drift out of sight. \n\nJACK: There she is....! Lili....! \n\nJack and Gump run to catch up, pushing through root tendrils agleam \nwith rain. Suddenly, they are attacked by SCREAMING Pygmies. \n\nGUMP: Jack! \n\nJACK (drawing his sword): Demons! \n\nThe nimble Pygmies leap about them, lethal talons slashing through \nthe drizzle. \n\nJack and Gump retreat, backing between clingling rootlets. \n\nGUMP: Quick! In here! \n\nGump yanks open a heavy oaken door in the side wall and they duck \ninside, slamming it shut in the teeth of the attacking Pygmies. \n\n81A INTERIOR SEALED CORRIDOR DAY \n\nJack strains against the door handle, struggling to keep the portal \nshut tight. There is less space than in a closet. The corridor \nbehind them is completely bricked over. \n\nGUMP: Trapped....! \n\nCLOSE ON DOOR: With great force, the Pygmies' claws stab through the \nthick wood like stiletties. Their needle tips are mere inches from \nJack and Gump. \n\nThe door's inner surface is studded with talons. Jack suddenly SLAMS \nthe door open with such force it swings into the side wall with a \nloud CRASH. \n\nThe Pygmies' frenzied SCREAMING ends in abrupt SILENCE. \n\nJack and Gump peer cautiously out. \n\n81B INTERIOR RAIN CORRIDOR DAY \n\nThe Pymies hang unconscious on the other side of the door, dangling \nfrom their imbedded talons. \n\nJACK: Come on! \n\nJack and Gump run into the rain. \n\n82 INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY \n\nJack and Gump hurry around the corner just as Lili heads towards a \npair of massive doors swinging slowly open at her approach. \n\nJACK (calling): Lili! Wait! \n\nGump grabs Jack's arm and yanks him to a stop. \n\nGUMP: Don't be daft! She's under a spell! \n\nLili enters and the doors swing closed behind her. \n\n83 INTERIOR GREAT HALL DAY \n\nAn enormous chamber draped with black cloth surrounded by tall \nBaroque columns. Winged demons writhe in the shadows above. A long \nblack table reaches down the centre of the room. All is lit by \nfirelight. The gaping hearth, with its entablature of monumental \nsculpture, is flanked by a pair of massive ebony thrones, carved in \na hideous, twisting mass of tendons, sinews and museles. \n\nWhen the imposing doors swing closed, Lili's spell is broken. She \nstares in terror at her news surroundings. \n\nSomething weird and mysterious approaches from out of the draped \nshadows. It is a magnificent high-collared black gown, waltzing like \na ghost across the black marble floor. There is no one wearing the \ngarment! \n\nFascinated, Lili watches the dress circle towards her. She finds it \nirresistable. Taking hold of the gown's empty sleeves she begins to \ndance, spinning round and round to the impulsive music. \n\n84 INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY \n\nJack paces back and forth in front of the sealed doors. \n\nJACK: Why did you stop me? \n\nGUMP: We best reconnoitre. What if it's \na trap? \n\nGump and Jack strain to see through the crack between the doors. \n\n85 INTERIOR GREAT HALL DAY \n\nLili dances by herself, turning slow dreamy circles before the \nblazing fire. She is now WEARING the splendid black gown! \n\nReflected firelight GLITTERS in the shadows. An open jewel box \nspills its sparkling treasure onto an ornate table. Lili is lure \nlike a moth to the flame. \n\nShe steps up onto an oversized footstool by the table. The ebony \ncasket brims with gemstones. Lili's eyes dazzle. A carved ebony \nfigure of a skeleton turns slowly out of the centre, holding in its \nup lifted arms the most exquisite black diamond necklace the mind \ncan imagine. \n\nThe Princess sucks in her breath. The temptation is too great. She \nimpulsively takes the necklace and hops down from the stool. \n\nThe high collar of her gown makes fastening the clasp difficult and \nwithout thinking, she backs towards the wall, fumbling behind her \nneck. \n\nShe leans against a sculpted marble frieze of souls in torment, \nconcentrating on the tricky clasp. All at once, a piece of sculpture \nbecomes ANIMATE. Powerful arms reach out to fasten the necklace. For \na moment Lili doesn't notice, grateful for the help. Then, she \nrealises what is happening and SCREAMS. \n\nThe musular black arms reach for her as she pulls away in terror. \nLili turns to run, but is stopped short by her reflection in a tall \ncheval glass mirror. She looks furtively about, making certain she \nis unobserved. Alone, she admires her perfect image. \n\nCLOSE ON MIRROR: Beneath Lili's pleased expression we see the evil \nface of Darkness APPEAR like a man emerging from under water. \n\nDarkness penetrates the surface of the mirror. \n\nLili backs away, GASPING soundlessly with terror. \n\nDarkness steps forth through the glass into the room, clad in black \nfinery. \n\nLili staggers. Darkness reaches to embrace her and the Princess \nSHRIEKS at the top of her lungs. The moment he touches her shoulder, \nshe slumps tothe floor, unconscious. \n\nDarkness stands over the fallen girl, his heartbeat pulsing like \nmuffled thunder. Something almost like a smile creases his hideous \nfeatures as he rolls a lock of Lili's hair between his clawed \nfingers. \n\nThe Princess blinks and opens her eyes. She is horrified to find \nDarkness kneeling over her and frantically tries to get away. \n\nDARKNESS: Do not be afraid, lady.... \n\nLili GASPS like a stranded fish. She is catatonic with fear. \n\nDARKNESS (cont): I mean you no harm. \n\nDarkness offers the Princess his hand. \n\nDARKNESS (cont): How like you my gifts...? Does \nthe gown not please you? Come.... \ntell me.... \n\nLili's terror renders her speechless. \n\nDARKNESS (cont): The colour is most suitable... We \nsanctify the death of the old world \nand the birth of a new order.... \nYou are the guest of honour. \n\nLili WEEPS and tugs at the black dress. \n\nLILI: ....of dishonour...! Take this \naway.... Please! I beg you! \n\nDarkness advances on Lili. The slow kettldrum THROB of his heart \nunderscores his words. \n\nDARKNESS: Your soul in like some dark nectar.... \nI cannot rest unril I taste its \nsweetness. \n\nLILI (frantic): Never! I hate you! I hate this \ndress! \n\nDARKNESS: Can you speak so of your bridal \ngown....? \n\nLILI (screaming): Nooooooooo! \n\n86 INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY \n\nJack and Gump listen by the closed doors to Lili's peircing scream \n(OS). Jack is desparate and half-draws his sword from the scabbard. \n\nJACK: What has he done to her?\n\nGump restrains the boy.\n\nGUMP: You have no power to stop it....\nBe thankful she lives.\n\nJack shoves his sword back in disgust.\n\nJACK (bitterly): Some champion....\nWhat good is this fancy sword?\n\nGUMP: It's not the sword that counts, but\nthe man who swings it....\n\n87 INTERIOR GREAT HALL DAY \n\nLili slumps to the cold stone floor, WEEPING. Darkness bends \nsolicitously over her.\n\nDARKNESS: Why the tears?\n\nLILI (sobbing): ....everything is lost....\npoor Jack....\n\nDARKNESS: Why weep for him? He left you\nalone to die!\n\nLILI: No! He'd never do that! He was\nkilled....like everything else....\n\nDARKNESS (glancing over his shoulder): Yes.... But\nwhy mourn? You have a new and grander destiny!\n\nLILI: Consort of some cowardly vile toad\nwho slinks through the night!\n\nDARKNESS: Not so! I requite to shadow's\nsolace and dark of the night.... Sunshine is my\ndestroyer!\n\nLILI (scornful): You think you're so powerful....\nand hide in the ground like a mole!\n\nDARKNESS (smiling): This too will change. \nThe last unicorn dies tonight....!\nAs her blood ebbs, the sun sets forever. \nThere shall never be another dawn!\n\nLILI (horrified): No....! You can't....\nYou mustn't....\n\nDarkness throws back his evil head and LAUGHS.\n\n88 INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY \nThe demonic LAUGHTER of Darkness carries through the massive doors.\n\nJACK: He means to kill the mare, Gump!\n\nGUMP: Don't mourn the corpse\n'til the coffin's in the ground.\n\nDARKNESS (OS): My dominion shall encompass\nthe enternal night!\n\nGUMP: As long as the sun still shines, \nso does hope!\n\nJACK (bitterly: Sun doesn't shine down here.\n\nJack fingers Lili's silver medallion hanging around his neck\nand from out of the blue, inspiration strikes.\n\nJACK (cont) (grinning): Wait a minute....! I \nthink I know a way.\n\n89 INTERIOR GREAT HALL DAY\n\nLili stares at Darkness with terror and loathing.\n\nDARKNESS: The world shall be at last as \nnature intended....a place of chaos and\nanarchy!\n\nLILI: You're mad!\n\nDARKNESS: Aye, Lady, and proud to be so! \nFor in madness lies the soul of all \nthat's noble.... Can you fathom the loneliness\nof untold eons lived in darkness? My spirit\nwas forged in that black fire....\n\nLILI: You live alone because you are\nloathsome! The contagion of your wicked heart demands\nisolation.\n\nDARKNESS: Nay, mistress. I've found\nmy mate and you know it. We're just \nalike, you and I. Beneath the skin\nwe are already one.\n\nLILI: Never!\n\nDARKNESS: 'Twas your sin trapped the unicorn.\nEven now, the evil seed of what you've \ndone blooms within you!\n\nLILI (shrieking): You lie! You're\nrepulsive!\n\nDARKNESS (stung by her words): No more so than you!\nCan't you sense it? That is why I desire you. \nI need someone to share the dark secrets of my \nsoul.\n\nLILI: You....? You disgust me! You're\nnothing but a beast!\n\nDARKNESS: Everyone is a beast....only most are\nafraid to see it!\n\nDarkness compels Lili over to the mirror with the force of his will.\n\n90 LILI'S POV : MIRROR \n\nLili sees her reflection in the glass. The lovely feminine\nfeatures ALTER into those of a cat-like beast.\n\nDARKNESS (os): This mirror shows how we really are....\nBehold your true reflection.\n\n91 INTERIOR GREAT HALL DAY \n\nLili pulls free from his graps and turns from the glass. Her\nface remains lovely and unchanged.\n\nLILI (frantic): No! You're working magic on me!\nI won't believe it!\n\nDARKNESS: My Lady misjudges me... I am no\ncommon trickster.... look at\nyou hands!\n\nLili's fingers transform before her eyes: hooked claws spring from \ntheir tips, coarse black hair pushes the skin.\n\nDARKNESS (cont) (Laughing): My mirror\nnever lies.\n\nLili's lovely face undergoes the same tranmutation she\nwitnessed in the mirror. She feels fur-covered sheeks and\npointed ears. This time, her SCREAM is hysterical.\n\nDarkness places a protective arm around Lili.\n\nDARKNESS (cont): Glory in your animal nature.\nIt is your triumph!\n\nLILI: I'm hideous!\n\nDARKNESS: No! The puling, pallid creature you\nwere was truly something disgusting.\nNow you are magificent.... a fierce goddess!\n\nLili jerks away, HISSING and showing her claws.\n\nLILI: Damn you!\n\nDARKNESS: We are both of us damned, my Queen.\n\nDarkness bows with mock formality, ALTERING into his own shadows, \nwhich slides through a crack in the paving stones.\n\nLili cannot resist her reflection. Horrified anew. she falls to the \nfloor, WEEPING.\n\n91A EXTERIOR SKY DAY \n\nRound and red, the great disc of the setting sun slides towards the \ndistant horizon.\n\n92 INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY \n\nCrazed by anxiety, Jack finds the keyhole and cups his hands around \nit.\n\nJACK (calling out): Lili....? Can you\nhear me....?\n\n93 INTERIOR GREAT HALL DAY \n\nLili huddles WEEPING on the cold stones.\n\nJACK (os): ....Lili....?\n\nAt the sound of Jack's voice, the Princess looks up with a start.\n\nLILI: ....Jack?\n\nJACK (os): Over here....\nBy the door....\n\nLili turns eagerly turns to the door.\n\nLILI: Oh, Jack....dear Jack! Can it\nreally be you? I was afraid you \nwere dead.\n\n93A INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY \n\nJACK: Thank God you're all right! I didn't\nknow what to do.... I never want to\nlose you again....\n\n93B INTERIOR GREAT HALL DAY \n\nLili pauses before the keyhole, out of Jack's line of sight.\n\nLILI: Jack, my love....my precious\nlove! I pray it's you and not more\nwicked magic.\n\n93C CORRIDOR OUTSIDE GREAT HALL DAY \n\nJACK: It's me, you can be sure of that....\nand there's magic on our side, too.\n\n93D INTERIOR GREAT HALL DAY \n\nLILI: It's all my fault....the unicorn....\neverything....\n\nJACK (os): My fault as much as yours....\nDon't worry. We're here to save you.\n\nLILI (sadly): I'm far past saving,\nsweet Jack....\n\nA huge tears wells in Lili's eye and flies out toward the keyhole, \ndefying gravity.\n\n94 INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY\n\nLili's tear flies through the keyhole and strikes Jack's face like a \nhorizontal raindrop. He touches the spot curiously.\n\nGUMP (amazed): How did you do that?\n\nJACK (to Gump): I didn't do anything....\n(into keyhole) let me see your face. \nIt will give me hope....\n\nJack strains to see through the keyhole.\n\n\n95 INTERIOR GREAT HALL DAY \n\nLili stares at the keyhole in horror.\n\nJACK (os): ....just to glimpse your smile....\n\nLILI (grief-stricken): No.... I can't....\nforget me, Jack....\n\nThe Princess reaches out her animal's paw and covers the keyhole.\n\n96 INTERIOR CORRIDOR OUTSIDE GREAT HALL DAY \n\nAs the LIGHT in the opening grows DARK, Jack tenderly places his \nhand next to Lili's.\n\nJACK: Lili....? I love you....\n\nGump pulls frantically on Jack's arm.\n\nGUMP: Come, Jack. We've no time \nto spare.... Remember your plan?\n\nSadly, Jack takes his hand from the keyhole and follows Gump back \nalong the corridor.\n\n\n97 INTERIOR GREAT HALL DAY \n\nPrincess Lili lies SOBBING. High above, the winged figures watch \nher. The music THROBS, underscoring a low, rhythmic CHANTING. Like \nsome ghastly chorus fro, Hell, the living statuary sings in unison \nto Lili:\n\nSTATUARY (singing): Bride of Night.... Bride of Night....\nDarkness is your heart's delight!\nHail to Darkness! Hail the Night!\nHis the Power and the Might!\nMaster of Chaos, Lord of Doom,\nSing his praises from the tomb!\n\nLili lifts her head, listening to the sepulchral SINGING. Her eyes \nburn like a tiger's. She bares her fangs, and from her throat issues \na bone-chilling HOWL.\n\n98 INTERIOR DUNGEON CORRIDOR DAY \n\nScrewball and Brown Tom stop short in their tracks when they hear \nthe SOUND of a distant HOWL echoes in the shadows. \n\nSCREWBALL (trembling): I vote we run like hell! \n\nThe two faeries scamper off into darkness. \n99 INTERIOR DUNGEON CORRIDOR DAY \n\nGump, Jack and a woman-sized Luna wait outside the kitchen door as \nBrown Tom and Screwball come running up. Gump studies his ornate \ntimepiece.\n\nGUMP: Where were you? In another three flicks \nof a badger's tail it'll be half-past.\n\nSCREWBALL: Sorry....time slips away\nwhen you're having so much fun.\n\nBROWN TOM (out of breath): We....found the mare\n....chained....in the dungeon below.\n\nGump shoves his timepiece back in his belt.\n\nGUMP: Excellant.... Who has a bit of\nparchment?\n\nThe two faeries search in their clothing. Screwball produces a \nplethora of trash: marbles, string, old doll's eyes, coloured bird's \neggs, ancient coins, etc. At last he finds a crumbled peice of \nsheepskin.\n\nSCREWBALL: Here.... I was saving it\nto write me will on.\n\nBROWN TOM: Where there's a will there's\na....\n\nGUMP: Shush, both of you....! Jack has a \nplan....a good one....\n\nGump squats on the floor, and, using a triangle and some charcoal, \ndivides the parchment into mysterious lines and angles.\n\nGUMP (mumbling): ....angle of refraction equals....\nangle of incidence....multiplied by a \nfactor of fourty.....divided by the\nsquare root of a google-plex....\n\nGump SNAPS his fingers triumphantly.\n\nGUMP (cont): Perfect! It will work like a charm, Jack!\n\nJACK: Let's get started! What we need to \ndo is sneak back into the kitchen and \ngather all the plates and \nplatters....\n\nSCREWBALL: Oh no! Not me! Seen enough\nof that kitchen, I have!\n\nBROWN TOM: Don't be so pig-headed! \nYou can trust Gump.\n\nSCREWBALL: I'd sooner trust a rat \nin the ghetto!\n\nBROWN TOM: Well.... trust Jack then.\n\nJack eases open the kitchen door.\n\nJACK: Remember....just the shiny ones....\n\nJack leads the way back into the kitcheb. Gump urges the other two \nto follow.\n\nGUMP: ....and be quiet! Soft as\nthistledown, that's the faerie way.\n\n100 INTERIOR KITCHEN DAY \n\nJack and the faeries tiptoe cautiosuly into the kitchen.\n\nBoth Demon Cooks are asleep, the encountered first is stretched out \nacross his chopping block, SNORING like a dragon with indisgestion.\n\nThe unfortunate Blunder turns slowly over the coals, hog-tied to a \nspit. A bright red apple is stuffed in his mouth. Jack and Gump rush \nto his side.\n\nGump pulls the apple from Blunder's mouth.\n\nBLUNDER (frantic): Get me outta here! Please!\nWhile I'm still medium rare!\n\nGUMP: Quiet....! You're a free imp\non one condition....\n\nBLUNDER(very loud): Condition....! What condition?\nLoose me or I'll make such....\n\nGump shoves the apple back into Blunder's mouth, stoppering his loud \ncomplaint.\n\nGUMP: Any more noise and you're\nshish-ka-bob....\n\nBlunder nods eagerly.\n\nGUMP (cont): You do what we tell you....\nunderstand?\n\nMore eager nodding from Blunder.\n\nGUMP (cont): Swear it!\n\nGump pulls the apple out of Blunder's mouth.\n\nBLUNDER: I swear! On the festering\nforelock of Nicodemus!\n\nJack cuts Blunder's bonds and the little imp hops nibmly out of the \nfireplace.\n\nBLUNDER: A thousand thanks....\n\nJack boosts Gump and Screwball up onto the mantle where the polished \nplates are stacked.\n\nJACK: Up we go!\n\nLuna TRANSFORMS into a dot of LIGHT and flies up to the cimnet \npieces, REMATERIALISING there in her full size.\n\nJACK (cont): Your turn, Blunder.\n\nJack lifts Blunder onto his shoulds so he can climb to the first \nlevel of the three-tiered mantle. Blunder joins Screwball, Gump and \nLuna as they rush about the mantlepiece, frantically gathering \nshield-sized plates.\n\nOne by one, the faeries toss the plates down to Jack, who stacks \nthem in Brown Tom's arms.\n\nBrown Tom staggers through the kitchen carrying a teetering tower of \nplates. He can't see where he is going and trips over the nozzle of \nthe giant bellows.\n\nThe plates fall with a deafening CRASH!\n\nBoth ferocious blind Cooks are awakened by the NOISE.\n\nSECOND COOK: Huh....! Wuzzat?\n\nJack and the faeries freeze in place as the Cook rises and pulls his \nhuge cleaver from the chopping block.\n\nCOOK (sniffing the air): Meat....! Me\nsmells fresh meat!\n\nJack draws his sword and steps between the awesome Cook and Brown \nTom, sprawled helplessly on the floor.\n\nSECOND COOK: Find meat!\n\nJACK: Over here!\n\nThe blind cook lunges for Jack. He wields his deadly cleaver with \namazing accuracy for one without sight.\n\nCOOK: Chop it up!\n\nJack ducks past the Cook, smacking him on the leg with the flat of \nhis blade. The huge demon YELPS in pain.\n\nThe Second Cook picks up a skillet, wielding it like a club.\n\nSECOND COOK: Smash....! Me smash!\n\nJack is caught between the two demon Cooks. He cannot face one \nwithout turning his back on the other.\n\nGump sees Jack's predicament and leaps from the mantle onto the \nSecond Cook's head with a wild CRY:\n\nGUMP: Schweinhundt!\n\nGump clings to the Second Cook like a terrier, confusing him and \ngiving Jack time to dart acrobatically out of the way.\n\nJACK (jabbing the Cook): Gotcha!\n\nCOOK: Cut you in half!\n\nA mighty swing from the Cook misses Jack, who executes a nimble \nback-flip. The Cook cleaves through a hanging side of meat by \nmistake.\n\nThe Second Cook grabs hold of Gump and shakes him.\n\nSECOND COOK: Sweet, sweet blood....\n\nUp on the mantle, Screwball and Blunder exchange a helpless look. \nGump is a goner unless they do something. They a simultaneous \nunspoken conclusion, and leap onto the Second Cook's back.\n\nSCREWBALL (calling out): Rooster toes....!\n\nBLUNDER (calling out): ....pig whiskers!\n\nFaced with this new twin threat, the Second Cook drops GUmp, who \nimmediately bities him on the leg.\n\nSECOND COOK: Whut.....! Who now? Ouch!\n\nJack fights a rearguard action, stabbing at the savage Cook as he \nretreats.\n\nJACK: Best you can do?\n\nCOOK: You gonna be mince-meat!\n\nJack back onto a steep stone ramp against the far wall.\n\nJACK: Got to catch me first!\n\nThe Cook's cleaver CLANGS against the ramp, missing Jack by inches.\n\nThe Second Cook has his hands full. Brown Tom has joined the fray \nand clings to his other leg while Blunder and Screwball claw and \npunch at his head.\n\nSCREWBALL & BLUNDER: Hit him....!\nSock him....!\n\nStaggering under the full weight of the faerie onslaught, the Second \nCook lurches in circles.\n\nSECOND COOK: Kill....! Smash....!\n\nFurious, the Second Cook swings his heavy skillet at Screwball and \nBlunder. He misses them completely, hitting himself square on the \nhead and knocking himself out.\n\nThe faeries leap off as the demon toppes backwards into the \nfireplace.\n\nGUMP: We must help Jack!\n\nThe faeries race to the foot of the ramp. Jack parries the Cook's \nfearsome swing. The Cook presses him relentlessly. The CLASH of \nsteel rings through the cavernous kitchen.\n\nThe faeries start up the ramp like a tiny cheering section.\n\nBLUNDER: Stick him a good one!\n\nSCREWBALL: Cut him down to size, Jack!\n\nGiant wine barrels are stacked at tge top of the ramp. The Cook back \nJack against them. There is no further room for retreat.\n\nCOOK: Gonna spill your guts, boy.\n\nThe Cook swings his cleaver from the hip. Jack nimbly springs out of \nharm's way. The cleaver drives full force into one of the chocks \nsupporting the pyramid of wine barrels.\n\nGRUMBLING, the Cook yanks his cleaver free. This pulls the chock \nloose from under the bottom barrel.\n\nCOOK (cont) (Listening): Wuzzat....?\n\nThe entire stack of barrels shifts, rolling towards the Cook.\n\nCOOK (cont): Bad news!\n\nThe Cook runs for his life. The huge hogshead RUMBLE forward in a \nwooden avalanche.\n\nJack crouches at the top of the ramp. As the Cook runs past he \nsticks the sword-blade between his legs and trips him up.\n\nThe Cook tumbles, head over heels, down the ramp.\n\nHalf-way up, the faerie band sees the giant barrels ROLLING towards \nthem.\n\nSCREWBALL (horrified): Sodom and Glockamora!\n\nThe faeries turn and run.\n\nThe barrels CRASH on top of the fallen Cook, knocking him senseless \nas they CONTINUE rolling.\n\nThe faeries dive for cover in the arched opening of the kitchen \ndoorway at the bottom of the ramp.\n\nThe barrels CRUNCH into the kitchen wall. Because they are larger \nthan the doorway, the faeries crouching inside are spared.\n\nOceans of wine flood out in a dark tidal wave, forcing the door and \nwashing the little people into the corridor beyond.\n\n101 INTERIOR KITCHEB CORRIDOR DAY \n\nBrown Tom is beside himself with delight. He scoops up wine with \nScrewball's helmet and pours it on top of his head..\n\nBROWN TOM: Whoopeeeeeee!\n\nJack appears in the shattered doorway, sword in hand.\n\nJACK: Hate to break up the\nparty, but there's work to be\ndone!\n\nGump jumps to his feet.\n\nGUMP: Hurry! Get those plates~\n\nJack sheathes his sword and rushes into the kitchen.\n\nScrewball and Blunder follow, but Brown Tom lingers behind, scooping \nthe helmet full of wine.\n\nBROWN TOM: Just a wee taste....\n\nGump kicks Brown Tom smartly in the pants.\n\nGUMP: Move! Or I make your head ring\nworse than any hangover!\n\nGump chases Brown Tom back into the kitchen.\n\n101A INTERIOR KITCHEN DAY \n\nThe faeries gather up the fallen plates. Jack stares thoughtfully at \nthe fireplace, where the body of the Second Cook has snuffed out the \nflames.\n\nGUMP: What's on your mind, Jack?\n\nJACK: Smoke rising.... That chimney\nmust go clear to the top.\n\nGump peers into the hearth.\n\nGUMP: Not much to hold onto. Take a \npeapod pixie to make the climb.\n\nScrewball steps proudly forward.\n\nSCREWBALL: I'll do it!\n\nThe faeries are astonished. Screwball never volunteers.\n\nGUMP: What? Can I believe my ears?\n\nSCREWBALL: Don't see why not. Ain't \nI small enough for the job?\n\nBLUNDER (proudly): No job's too\nsmall for the Buttercup brothers....\n\nSCREWBALL (on his knees: Please, Gump.... let me try.\nI know I'm always trouble, but I want\nto make it up to you....\nProve that I won't let you down.\n\nBROWN TOM: Be sure ya don't fall down!\n\nGUMP: All right! Do it! But be swift.\n\nSCREWBALL: Thank you....thank you....\nYou'll never regret it....\n\nJack boosts Screwball up into the chimney.\n\nJACK: I'm proud of you, Screwball.\n(handing him a plate)\nDon't drop it....\n\nGUMP (calling up): We'll send Luna with \na signal when all is ready.\n\n101B INTERIOR CHIMNEY DAY \n\nScrewball clings to the smoke-blackened bricks, staring up the \nnearly endless shaft at a small circle of light far above.\n\nBROWN TOM (os) (calling from below): Always\nknew you'd be going places, Screwball....\nGood luck....!\n\nSCREWBALL (to himself): I'm goin' places,\nall right.... straight to the top and on\noutta this hell-hole.... No more\nkitchen....no more demons.... Just the \neasy life for Screwball Buttercup....\n\n101C INTERIOR KITCHEN DAY \nA shining gold plate is propper on the Secnd Cook smouldering in the \nfireplace.\n\nLuna positions another plate against the bellows, taking care to get \nthe angle right.\n\nGump stands between the bellows and the shattered kitchen door, \nmeasuring the nagle with a curious hand-held instrument.\n\nGUMP: Little more to the left, Luna....\nthat's better..just a touch more....\nperfect.\n\n101D INTERIOR KITCHEN CORRIDOR DAY \n\nBlunder and Brown Tom run off carrying armloads of plates.\n\nJack leans a platter against the corridor wall, adjsuting it \nprecisely.\n\nJACK (calling): How's that, Gump?\n\nGUMP (os): Dead centre....!\n\n102 INTERIOR GREAT HALL DAY \n\nLili's tears have dried. She prowls the majestic hall with regal \ndignity. Something magic occurs at the baquet table: each crystal \ngoblet fills mysteriously with black wine as she passes; every empty \nbowl and platter suddenly is heaped with an incredible things to \neat-all of it black!\n\nThe food is beautiful in spite on its colour. Lili stares a it with \nundisguised hunger. Some animal instinct warns her not to trust this \ngleaming ebony feast, but she's famished and snatches up an apple \nbright as ploish anthracite.\n\nDARKNESS (os): Good....eat....\n\nLili GASPS, dropping the apple. Darkness sits in one of the twin \ngrostesque thrones flanking the hearth.\n\nDARKNESS (cont): The food is for your enjoyment.\n\nLILI: I don't want it! I'm\nnot hungry!\n\nDARKNESS: Do you lie just to please me?\n\nLILI: I do nothing for your pleasure!\n\nDarkness gestures to the opposing throne.\n\nDARKNESS: You are so like a child, milady.\nSit, and we'll talk.\n\nLili makes no move towards the chair. \n\nDARKNESS (CONT) (gently): Like a \nchild, you expect anger and\ndefiance will upset me.... These\nare the qualities I admire most....\n\nLili snarls, fangs gleaming in the firelight.\n\nLILI: So.... I'd love to rip out your\nthroat, yet it would pain you more\nif I licked your hand....\n\nDARKNESS: All I desire is that you\nsit in that chair and talk with me.\n\nLili approaches the grotesque throne. Like some impossible organism, \nit pulses in anticipation.\n\nLILI: Sit....? Here....?\n\nDARKNESS: Yes. Please....\n\nLILI: I prefer to stand.\n\nFor a moment, Darkness nearly sucumbs to anger. The viens in his \nforehead throb. His talons grip his throne in a spam of fury.\n\nDARKNESS (snarling): Sit....!\n\nDarkness shrewdly realises rage won't work and he relaxes with a \ntwisted smile.\n\nDARKNESS: (cont): .....or stand. As \nyou wish.... It's enough that we're\nalone together.... just the two of\nus....\n\n102A CLOSE: MATCHING FIREPLACE OPPOSITE \n\nAcross the Great Hall from the blazing hearth is an identical \nfireplace. This one is cold, but not empty. Covered with soot and as \nblack as a Moor, Screwball climbs into VIEW between the massive \nandirons.\n\nDARKNESS (cont) (os): All of time\nawaits us....why not make a start.\n\nScrewball puts down his plate and tiptoes into the Great Hall \ntowards the banqueting table.\n\nLILI (os): A start at what....?\n\n102B INTERIOR GREAT HALL DAY\n\nDarkness leans forward in his throne, smiling at Lili.\n\nDARKNESS: Simple conversation....\n\nLILI: What do we possibly have to\ntalk about?\n\nDARKNESS: Thoughts....dreams....\nambitions....\n\nLILI: I have no interest in your\nfoul ambition.\n\nDARKNESS: Desire then....surely we \nbeasts all have desire.\n\n102C INTERIOR GREAT HALL (MATCHING FIREPLACE OPPOSITE) DAY\n\nUnseen, Screwball climbs up onto the banquet table. He can't believe \nhis good fortune. A bounteous feast surrounds him.\n\nLILI (os): You'd never dream what \nI desire....\n\nDARKNESS (os): Don't be so sure....\nDreams are my speciality\n\nScrewballs stuffs his tunic with black fruit. He rushes about, \ntreading on the feast in his crazed delirium at beung surrounded by \nsuch plenty.\n\nDARKNESS (cont) (os): It is through\ndreams I influence mankind. I have \ndreams of my own.... dreams of enternity\nwith you....no more silence....no\nmore loneliness....\n\n102D INTERIOR GREAT HALL DAY \n\nLili LAUGHS in the face of Darkness.\n\nLILI (scornfully): Such drivel! You\nsound like some simpering schoolboy!\n\nDARKNESS: I'll wager there was a \ntime when the attention of a \ndevoted schoolbvoy were entirely to\nyour liking.\n\nLili regards her claws with a savage sneer.\n\nLILI (snarling): I know what I'd do\nwith such meat now!\n\nDARKNESS: ....all things change, lady.\nThe pleasures of youth become the\nregrets of maturity....\n\nA loud CRASH on the banquet table causes Darkness to look around. He \nSEES Screwball standing by the centrepiece, about to shove a whole \nchicken in his mouth.\n\nDARKNESS (cont) (angry): What're\nyou doing here?\n\nBlackened with soot, Screwball easily passes for a goblin.\n\nSCREWBALL (all innocence): .....am\nI early....?\n\nDARKNESS: You impudent imp!\n\nSCREWBALL: I thought the invitation\nsaid half-past....\n\nDARKNESS (roaring): GET OUT!\n\nScrewball gets the message. He drops the chicken and hops down off \nthe banquet table, running to the opposite fireplace for all he's \nworth.\n\nDARKNESS (cont) (gently to Lili): Sit....\nI value your thoughts. Why not share them\nwith me?\n\nLili looks at the grotesque throne.\n\nLILI: No more than that....just sit?\n\nDARKNESS (nodding): Sit....\n\nLili steps up onto the oversized footstool. Inches behind her, the \nmonstrous throne swells and throbs like an organic creature, the \npowerful sinews rippling with desire.\n\nLILI (a feline smile): Doesn't\nseem such an outrageous request....\n\nThe Princess prepares to sit, her luscious, silk-swathed bottom only \ninches from the lavcivious surface of the squirming throne.\n\nDARKNESS: You'll never regret granting\nme this favour....\n\nLili's eyes glitter as she teases him.\n\nLILI: What shall we talk about?\n\nDARKNESS (impatient): Just sit!\n\nThe febric of Lili's gown brushes the writihing throne. In another \nsecond she will be sitting. Unexpectedly, she stands up tall on the \nfootstool.\n\nLILI: Such a disagreeable chair....must\nbe terribly uncomfortable. I think \nI'll stand if you don't mind.\n\nDarkness barely controls his raging anger.\n\nDARKNESS: I prefer you to sit!\n\nLILI: I'd rather stand, thank you.\n\nDarkness's forehead swells with fury.\n\nDARKNESS: Sit!\n\nLILI: No.... Not now....\n\nDarkness puffs like an adder in his frenzy, rising up to tower over \nLili.\n\nDARKNESS (roaring): I command you to sit!\n\nLili is utterly unafraid. She LAUGHS at the swollen image of \nDarkness.\n\nLILI: Don't be silly.\n\nLili hops down from the footstool.\n\nDARKNESS (screaming with rage): SIT, DAMN YOU!\n\nLili sashays past him, twitching her gown in an unashamedly wanton \nfashion. Her hearty LAUGH is as loud as the outraged ROARS of \nDarkness.\n\nLILI (laughing): Never.... never....\n\n103-110 DELETED\n\n110A INTERIOR DUNGEON CHASM DAY \nJack scales a plate like a golden discus across the chasm to Brown \nTom waiting on the viaduct above.\n\nJack hurls another plate.\n\nSuddenly, the Winged Monster, hatched from the walking Egg, glides \nSHRIEKING from the shadows. It catches the plate in its saw-toothed \nbeak and dives at Jack. Gump sees it first.\n\nGUMP: Jack....!\n\nDropping the plate, the Winged Monster rips at Jack. The Green Man \ndraws his sword and defends himself. The fight is savage and brief. \nJack hacks the Monster out of the air. It lies, flapping and broken \nat his feet. Gump touches him sympathetically on the arm.\n\nJACK: ....I'm all right....Let's\nget on....to the dungeon....\n\nGUMP (pensive): You have power \nwithin I never imagined. \n\n111 INTERIOR GREAT HALL DAY \n\nDarkness stares at the Princess in a towering rage. She \nflirtatiously pretends to be interested in a bit of fruit before \nrejecting it in favour of another, which also proves not to her \nliking.\n\nDARKNESS: I'm not above my own little\npranks, milady.... Should you have\na taste for them.\n\nLILI: No doubt they're as foul as\nthe stuff you set on your table....\n\nDarkness relaxes, taking his cue from Lili's mocking tone.\n\nDARKNESS: Foul....or fair, such distinctions\nare entirely arbitrary, my dear.... Does\nnot the lowly toad think his mate fair, \nwarts and all....?\n\nLILI: Do you suggest I will think \nyou fair some day?\n\nDARKNESS: In time....and time we surely\nhave... stretching before us....\ninfinity....like a merciful curtain closing\noff the past....\n\nDarkness moves gracefully to Lili's side and kneels before her.\n\nDARKNESS (cont): I beseech you...do not reject\nmy foods as you do my food.... Never have I\nabased myself so before another....It is not\nhumility that brings me low, mistress.... but\nlove....\n\nLILI: Love?\n\nDARKNESS: Aye, love.... You think my\nheart a barren desert where only\nhate can flower....A much finer blossom\nshow its petals now....nourished by\nsorrow....watered with your tears...\n(baring his breast)\nI offer you this rose, Princess!\n....my heart....my soul....\n\nLili is astonished. She walks away to consider what Darkness\nhas said.\n\nDarkness watches her slyly. His expression reveals his words\nto have been a ruse. He gloats in anticipation.\n\nLili turns back to face him. Darkness immediately resumes his look \nof adoration.\n\nLILI: You dizzy me, lord.... I never\nthought to hear the word 'love' \nspoken again....\n\nDARKNESS: You'll hear it forever.\n(shouting)\nI love you!\n\nLILI: If such is true....hope \nis yet alive...\n(regarding her claws)\nThese talons can caress as well as kill....\n\nThey are interrupted by the SOUND of a CHIME. An unseen clocks tolls \nthe hour.\n\nDarkness stares up into the shadows.\n\nDARKNESS: It grows late....\n\n111A EXTERIOR SKY DAY \n\nThe setting sun blazes through distant drifting clouds, tinting the \nsky in a riot of colours. Another CHIME is heard.\n\n111B INTERIOR GREAT HALL DAY \n\nThe SOUND of the unicorn's frightened whinny carries up from the \ndungeons below.\n\nDARKNESS (laughing): Our wedding\nfeast is in good voice....Think\nyou not?\n\nLili cunningly disguises her alarm.\n\nLILI: I admire your thrift, my lord,\nboth the meal and entertainment\nin a single dish.\n\nDarkness appreciates this joke.\n\nDARKNESS: Are you anxious to see blood flow?\n\nLILI: As you are to drink it!\n(smiling slyly)\nWill the groom grant his bride her wish\non this night?\n\nDARKNESS (beaming with pleasure): \nYou have but to ask my savage beauty.\n\nLili leers, baring her feline teeth.\n\nLILI: I want to kill the unicorn!\n\nDarkness claps his hands with joy.\n\nDARKNESS: Lady, you make me proud....\n\n111C INTERIOR CHIMNEY DAY \n\nScrewball struggles up the endless chimney, past hideous gargoyles \nand ancient skeletons imbedded in the blackened bricks.\n\nThe SOUNDS of conversation CARRY UP from below.\n\nLILI (OS): I will do it with joy....!\nLet the unicorn's blood anoint our love!\n\nSCREWBALL: Crumpets and candlesticks....!\nShe's gonna kill it!\n\nLILI (OS): ....and in the eternity\nawaiting us, I will happily sit on your throne\nas befits the Queen of Darkness!\n\nSCREWBALL: I can't let that happen....Why,\nit's not civilized!\n\nClutching the golden plate, Screwball struggles upwards like\na tiny mountaineer.\n\nHe reaches into a grinning skull for a handhold and the jaws\nclamp shut on his fingers.\n\nSCREWBALL (cont): Billygoat dumplings!\n\nScrewball yanks his hand free, nearly losing his balance. His terror \ngives him renewed energy and he scrambles frantically up the inside \nof the chimney.\n\n111D EXTERIOR TOP OF CHIMNEY DAY \n\nThe chimney pot is shaped like a monstrous demon. Black as a sweep, \nScrewball emerges at the top and looks around.\n\nThe distant sun is a dying ember resting on the surrounding rim of \ndark mountains. We HEAR the SOUND of a clock CHIME!\n\n111E INTERIOR DUNGEON CORRIDOR DAY \n\nA distant CHIME stops Gump in his tracks. He pulls out his timepiece \nfrom the pouch and studies it.\n\nGUMP: ....not much time....\n\n111F INTERIOR GREAT HALL DAY\n\nPrincess Lili stretches out her arms towards Darkness.\n\nLILI: Bring me to the wretched beast.\n\nDarkness takes her arm and leads her towards the blazing hearth.\n\nThe unicorn's distant whinny ECHOES from below.\n\nDARKNESS: This way, fair beauty. I hear a \nthroat begging to be cut.\n\nLili hesitates when she realises Darkness intends to lead\nher straight into the flames.\n\nLILI (fearful): No....! It's impossible!\n\nDarkness steps into the leaping flames. He turns and takes\nLili's hand.\n\nDARKNESS: Now you are my queen. Nothing is\nimpossible....Come....it takes but a \nsingle step....Find the faith....\n\nDarkness looks deep into Lili's eyes. She places her tiny\nfoot among the white glowing coals. Nothing happens. Not\neven the fur is singed.\n\nLili smiles. Her fear vanishes. She stands at the side of her \nmaster. Darkness wraps a powerful arm about the girl and they are \nconsumed by flames, becoming one with the blaze around them.\n\n112 DELETED\n\n113 INTERIOR DUNGEON DAY\n\nUnseen by the deformed goblin GUARDS, the faeries creep out of the \nshadows and take cover behind a squat stone column.\n\nJack positions Blunder in the corridor entrance with the final plate \nbefore joining the others.\n\nJACK: Everything's ready....\n\nGUMP: And you, Jack? Your greatest\nchallenge is still to come....\n\nDarkness and Princess Lili emerge, arm in arm, out of a background \ncurtain of fire. They sweep majestically down the stone steps to \nwhere the unicorn is chained.\n\nSilent as mice, Jack and the faeries peer around at them. Jack is \nhorrified by Lili's bestial appearance. \nJACK: ....oh, God....! Lili....\n\nGUMP: Judge her with your heart, not\nyour eyes.\n\nBlix and Poxand the other goblin Guards scramble to attention as the \nregal pair ascends.\n\nBLIX: Greetings....\n\nPOX: S-s-s-salutations....\n\nDARKNESS: Silence....! Prepare the unicorn \nfor sacrafice!\n\nThe goblins hurry to comply. Blix selects a grotesque black \ngreatsword from among a rack of weapons.\n\nPox furiously pedals a grindstone. Blix applies the blade. Showers \nof sparks shower onto the glistening floor.\n\nBehind the column, the watching faeries are desparate. Luna's \nglowing LIGHT hovers above their heads.\n\nBROWN TOM: The game is lost....for all\nof Jack's pretty plan...\n. \nJACK: No! It'll work! It must!\n\nGUMP: Luna! Fly up to Screwball! Tell\nhim it's time!\n\nQuick as a FLASH, Luna STREAKS off into the shadows.\n\nBlix carries the sharpened greatsword to Darkness, offering it with \na low bow.\n\nDARKNESS: Excellent.... Let the ritual\nbegin....\n\nThe demon Guards stand in a semi-circle around the unicorn. Blix and \nPox open tattered black prayer books. Darkness steps to a twisted \nlectern and READS from a sinister volume.\n\nDARKNESS: In the beginning, there was\nnothing....a void of darkness, a cold\nenternity of silence....\n\nPOX: Endless night, black as death!\nMother of Shadows protect us!\n\nThe assembled Guards answer in a ghastly CHORUS:\n\nCHORUS OF GUARDS: Mother of Shadows, renew us!\n\nPOX: Dream Sister....eclipse our pain!\n\nCHORUS OF GUARDS: Night Bride....restore our strength!\n\n114 INTERIOR KEEP AND CORRIDORS DAY\n\nLuna BLAZES straight up out of the abysmal keep; a tiny shooting \nstar. The demons' ceremony continues (OS):\n\nDARKNESS (OS): ....and when the perfect void\nwas corrupted by Light, a great wailing was\nheard and all the brethern fled in terror....\n\nLuna rockets along the ruined corridors of the labyrinth.\n\nCHORUS OF GUARDS (OS): Deliver us, O' \nDarkness, from all fear....\n\n115 INTERIOR DUNGEON DAY \n\nDarkness steps forward. His booming VOICE disturbs the sleeping abts \nand sends them wheeling in clouds around his head.\n\nDARKNESS: Hear me, ye Powers of the Night! We\noffer this sacrafive in honour of you....\n\nDarkness reaches up and seizes a fluttering bat from out of the air.\n\nDARKNESS (cont): Here is our offering....\nsanctified with blood....\n\nDarkness crushes the bat to a pulp and splatters the unicorn's white \nflank with its blood. Darkness struggles mentally with the mare.\n\nDARKNESS (cont): ....and with fire!\n\nDarkness touches his fingertip to the unicorn's haunch. The hide \nsmoulders instantly, leaving an ugly brand.\n\nCHORUS OF GUARDS: Blood and fire, born of Night....\nBlood and fire, drown the Light!\n\nThe unicorn rears back. Her hooves CLATTER on the cold\nstones.\n\nDARKNESS: I pray you, Father, accept my \nsacrafice....Let Light be orever extinguished!\nLet the Age of Darkness begin!\n\nDarkness contorts with the strain on imposing his will on the \nunicorn. He dominates the mare and she grows calm.\n\nAs the Demon Guards CHANT, Blix and Pox strain at the winch. They \ndrag the unicorns towards the chopping block.\n\n116 DELETED\n\n116A EXTERIOR TOP OF CHIMNEY DAY\n\nScrewball stands watching the sunset. One hands holds the plate, the \nother polishes a black apple on his tunic.\n\nSCREWBALL (singing under his breath):\n....nickety-nackety....noo-noo-noo....\n\nThe apple is bright as obsidian. Screwball smiles at his reflection \non its gleaming surface.\n\nSCREWBALL (cont) (singing): ....fiddle-\ndee-widdle-dee....\n\nScrewball takes a big bite of the apple.\n\nScrewball grins, chewing happily. Not a care in the world.\n\nIt hits him like a stroke. His eyes cross and he toppes, dropping \nthe plate.\n\nLuna comes BLASTING out of the chimney like a tracer bullet.\n\nLUNA (tiny voice): Screwball!\n\nScrewball falls onto the rim of the chimney.\n\nIn a brilliant BURST OF LIGHT, Luna materialises into her grown \nself, catching the plate an instant before it drops over the edge.\n\nLUNA (cont): Do it!\n\nLuna looks sadly down on Screwball, touching him with her toe.\n\nLUNA (cont): Screwball...wake up!\n\nScrewball SNORES loudly.\n\nLUNA (cont): Oh, Screwball....\n\nLuna aims the golden plate at the ruby BLAZE of the setting\nsun. She aims a beam of LIGHT straight down the chimney.\n\n116B INTERIOR CHIMNEY DAY\n\nThe beam of LIGHT descends the dark shaft like a golden waterfall. \n\n116C INTERIOR KITCHEN DAY \n\nThe beam of LIGHT moves like a searchlight inside the fireplace, \ncriss-crossing the Second Cook's body as it misses the propped plate \nhe holds by inches.\n\n117 INTERIOR DUNGEON DAY\n\nWorking together, the two goblins turn the iron winch. Bit by bit, \nthe cable is drawn forward onto the drum.\n\nThe unicorn's neck is stretched across the block.\n\nDarkness stands before Lili, offering the greatsword.\n\nDARKNESS: Once your hands were too delicate\nfor such a task....spinning and weaving \nwere more their work....\n\nLILI: Let my loom be made of flesh and blood....\nI am sister to the Fates!\n\nLili eagerly seizes the sword.\n\nDARKNESS: What a queen you'll make!\n\nJack slumps against the wall, desparate.\n\nJACK: Come on, Screwball....\n\nGUMP: She means to do it, Jack!\nShe's one of them!\n\nJack stares at Lili.\n\nGump grabs a long black bow from a weapon rack, and an arrow from a \nquiver beside it.\n\nGUMP (cont): I'm going to stop her!\n\nJACK: Gump, wait! I trust her!\n\nGump fits an arrow onto the bowstring.\n\nThe unicorn is helpless before Lili. Blix locks the winch, securing \nthe cable.\n\nDARKNESS: My lady, the birth of a new\nworld awaits your stroke.\n\nLili swings the greatsword high over head.\n\nCHORUS OF GUARDS (chanting):\nBlood and fire....eternal ice!\nBlood and fire....and sacrafice....\n\nGump draws back the arrow in the longbow, aiming at Lili.\n\nJACK: No....! Don't...!\n\nJack grabs the bow. He and Gump struggle for the weapon.\n\n118 DELETED\n\n119 DELETED\n\n120 DELETED\n\n120A INTERIOR KITCHEN DAY\n\nThe beam of LIGHT hits the plate held by the Second Cook in the \nfireplace. It STREAKS across the the plate leaning on the bellows, \nZIGZAGGING out into the corridor.\n\n120B INTERIOR KEEP DAY \n\nThe beam of LIGHT ZOOMS out of the corridor, strikes the plate on \nthe viaduct, and REFLECTS down into the lowest depths of the castle.\n\n121 INTERIOR DUNGEON DAY \n\nGump is determined to shoot Lili. Jack, equally determined to stop \nhim.\n\nJACK: I trust her, Gump....I'll\nalways trust her....\n\nGUMP: Foolish, mortal!\n\nThe beam of LIGHT STREAMS in through the corridor. Blunder REFLECTS \nit off his plate towards the others.\n\nStruggling for the bow, Jack and Gump kick over the propped shielf \nthe moment the LIGHT beam reaches it.\n\nBROWN TOM: Stop lads....! The light!\n\nA wild LAUGH bursts from Lili's throat. She swings the sword with \nall her might.\n\nThe blade arcs through the air, a glittering SUNBURST where it \ncarves through the deflected beam of LIGHT.\n\nLili aims not for the mare, but for the line restraning her. The \nsword severs the woven cable.\n\nLILI (exultant): Run! You're free....!\n\nThe unicorn plunges into the shadows. Only the ECHO of her hoofbeats \nremain.\n\nJack and Gump stop struggling. Jack dives for his fallen shield.\n\nDarkness pulls a weapon from his belt. It is the stallion's alicorn \nmounted as a shortsword.\n\nDARKNESS (sneering savagely): Innocence!\n\nHuge and terrible, Darkness lunges for Lili, driving the alicorn \nstraight through her side.\n\nLili is pierced by the horn. She GASPS, supported by the Demon's \nhold on the blade.\n\nMiraculously, Lili's features alter and TRANSFORM. The fangs and \nclaws disappear. Her fur melts like the morning dew. She is an \ninnocent maiden once more.\n\nLili slides dying off the alicorn and falls to the ground.\n\nJack holds his shield in the beam of LIGHT, angling in a bright \nswath towards Darkness.\n\nJACK: Burn....! You evil bastard....\n\nThe LIGHT hits Darkness like an express train. He HOWLS, blasted in \na smoking whirlwind across the dungeon.\n\nDarkness cowers on his knees, SCREAMING in the LIGHT.\n\nAll the goblins scatter HOWLING from the LIGHT. \n\nBrown Tom capers a happy two-step around Gump, who stares straight \nup into the central keep.\n\nBROWN TOM: ....and we'll dance on the \nblack devil's grave....\n\nGUMP'S POV : LOOKING UP: The beam of LIGHT dims and goes\nout.\n\nBROWN TOM (OS): What's wrong....? What's\nhappening, Gump?\n\nGump shrugs, looking sadly at Jack and the darkened shield\nhe holds.\n\nGUMP (sadly): Sunset....\n\nWith a savage SNARL, Darkness staggers off into the gloon, trailing \ntrendrils of smoke.\n\nJack drops the shield and rushes to Lili's side. He kneels and \ncradles her in his arms.\n\nThrowing back his head, Jack HOWLS like a wild animal. His CRY is a \nwolf-wail of utter despair.\n\nGump runs frantically up to grieving Green Man.\n\nGUMP: No, Jack....Quick! He's after the mare!\n\nGump seizes the grotesque sacraficial greatsword.\n\nGUMP (cont): The world needs a champion!\n(handing Jack the black sword)\nUse this against him!\n\nJack snatches the sword. He rises cold with fury and runs off into \npursuit of Darkness. \n\n122 DELETED \n\n123 DELETED\n\n124 DELETED\n\n125 DELETED\n\n125A INTERIOR TUNNEL NIGHT\n\nThe unicorn gallops through a desolate landscape of broken columns \nand grumbled masonry.\n\n126 EXTERIOR EDGE OF THE WORLD NIGHT \n\nA precipice jutting over eternity. The unicorn runs along a narrow \ntrail bordering the edge of the abyss, highlighted by a bright \nbackdrop of comets and stars.\n\n126A INTERIOR TUNNEL NIGHT \n\nCLOSE ON: The black hooves of Darkness as he runs relentlessly along \nthe unicorn's track. \n\nPULL BACK to show Darkness TRANSFORMED into a muscular black unicorn \nstallion. He surges onward, an explosion of strength. FLAMES flare \nfrom his nostrils.\n\n126B EXTERIOR EDGE OF THE WORLD DAY \n\nThe huge black unciron THUNDERS out of the cavern-mouth.\n\nThe mare stand alone, trapped on a final promontory.\n\nThe black stallion REARS and charges the mare....\n\nBlack and terrible, the devil stallion rises over the mare, striking \nout with his fearsome hooves.\n\nThe mare staggers before this onslaught of evil, falling to the \nground amid flying black feet.\n\nThe black stallion paws the ground, preparing to ram his alicorn \ninto the fallen mare.\n\nJack runs out from the dark cavern, gripping the evil greatsword \nwith both hands. He sees the stallion tower above the mare\n\nJACK (calling out): Darkness....!\nYou rotten filth!\n\nThe superb black unicorn turns to meet this new challenge. He \nSNORTS, breathing fire, and lowers his head, charging straight at \nJack.\n\nJack stands his ground, greatsword poised, as the huge black \nstallion gallops towards him, hooves striking SPARK.\n\nJack swings with all his might as the demon unicorn ROARS\nslavering past.\n\nThe greatsword passes straight through the black beast, as if it \nwere striking a ghost.\n\nJack is knocked off balance by the fury of the charge, but he \nmanages to stay on his feet as the stallion wheels and attackes \nagain.\n\nThe black unicorn's red eyes BLAZE as he crashes into Jack.\n\nThe Green Man is thrown awkwardly to one side. He loses the \ngreatsword and sprawls helpless on the ground.\n\nDazed, Jack rises on his elbows.. He sees the black hooves of \nDarkness standing before him.\n\nLooking up, Jack sees the Lord of Darkness TRANSFORMED back to his \noriginal form. He holds his alicorn sword pointed straight at the \nboy's heart.\n\nDARKNESS: Always a pleasure to take a \nbrave man's life. \n\nDarkness thrusts down with the alicorn, but Jack rolls skillfully \naside and counds to his feet.\n\nJACK: ....haven't killed me yet....\n\nJack draws his own sword and swings at Darkness, who parries with \nthe alicorn. SPARKS fly.\n\nJack swings again. Darkness catches the blade in his bare hand and \nholds Jack immobile to meet his malevolent gaze.\n\nDARKNESS: ....Oh, but I have...\n\nJack is speechless with horror.\n\nDARKNESS (cont): Don't you know me, boy,\ndon't you know from whence I come....\n\nThe muscle hump behind Darkness's neck bulges and cracks. It bursts \nopen and a pair of leathery bat wings unfold. Jack's horror is \ncomplete.\n\nDARKNESS (cont): Time to die....\n\nDarkness drives the alicorn sword into Jack's chest, running him \nthrough.\n\nJack's eyes are wide with astonishment. Is this what it's like to \ndie?\n\nDarkness pulls the alicorn out of Jack. There is no blood! No trace \nof a wound remains on his flesh. Jack blinks in wordless amazement.\n\nDARKNESS (cont): So...! I should have\nknown....We're just the same! You're\nimmortal, Jack!\n\nJACK (disbelieving): No....! I'm not!\nI'm human....\n\nDARKNESS (laughing): Who was your mother?\n\nJACK (confused): I....don't know....\n\nDARKNESS: Who was your father?\n\nJACK: ....I....can't remember....\n\nDARKNESS: How long have you lived in \nthe forest?\n\nJACK: All my life....! I...I....\nknow who I am....\n\nDARKNESS: You pitiful fool! An immortal\nall this time and never knew....\n(laughing)\nDon't you see, Jack? Don't you understand\nyour power....! Together we could rule \nthe universe!\n\nJACK (bewildered): .....together....?\n\nDARKNESS: There'd be nothing to stop us!\nNo power could stand in our way! We're\njust the same, Jack....You and I.....\neternal....!\n\nJack struggles to understand the immensity of this\nrevelation. He wavers in the face of the demon's persuasiveness.\n\nAll at once, the mare unicorn gallops up from the shadows, white and \npure.\n\nShe spears Darkness straight his mid-section. The evil Lord SCREAMS, \nstaring down at the shining alicorn thrsut out of his chest.\n\nDARKNESS (cont): ....Father....! Protect me....\n\nDarkness starts to shrink. The mare lifts the writhing demon high in \nthe air, impaled like a kicking insect.\n\nRearing, the unicorn arches her neck and tosses Darkness over toe \nedge into the abyss.\n\nDarkness tumbles into the haze. His final HOWL is a lament from the \ndepths of Hell.\n\nAt the last moment, the falling figure of Darkness TRANSFORMS into \nthe flapping black cloak and sails off into the shadows.\n\nJack picks up the alicorn. He wraps his other arm around the \nunicorn's neck. They stand together at the edge of the world, united \nin a victorious embrace.\n\n126C EXTERIOR MOUTH OF CAVERN NIGHT \n\nThe faeries gather at the entrance. Screwball is there, half asleep. \nLuna is full-sized. Pale and sleeping, Lili lies on the black cloak. \nThe faeries stand around her, eyes downcast.\n\nJack rides up, mounted on the unicorn. Surrounded by light, he is \nmore than a champion. He is divine. The faeries are delighted.\n\nGUMP: Why....Jack....solved \nyour riddle at last....\n\nBROWN TOM: Should've known no \nmortal could speak unicorn \nlike that....\n\nJACK: How is Lili?\n\nGUMP: Sadly beyond the help of faerie\nmagic. She's under a powerful spell....\nIt's like a riddle....\n\nJack understands. He brightens into a smile.\n\nJAC: I know the answer....! Lift\nher to me, gently....\n\nJack hands Gump the alicorn as the faeries gather Lili in their \narms, lifting her above their heads.\n\nJack carefully pulls the enchanted Princess in front of him across \nthe unicorn's withers.\n\nJACK (cont): We'll meet again, dear friends....\n\nJack touches his heels to the unicorn's flanks and they\ngallop off in a CLATTER of hoofbeats.\n\nGUMP (waving): Ride like the wind,\nJack....\n\nBROWN TOM: Wish we could go with him....\n\nGUMP: And why not? I know some magic\nwords that'll do the trick!\n\nSCREWBALL: Oh no! Not me! I hate to travel\nlike that....makes me sick.\n\nGUMP: Stand back....! The sky's the \nlimit!\n\nSCREWBALL: Can't stand your bumpy\ntakeoffs....\n\nAbruptly, Screwball SHOOTS into the air, flying out of\nsight.\n\nGUMP: Screwball! Wait for the spell....\n\nSCREWBALL (os): ....I never do....\n\nGump gestures magically.\n\nGUMP: Eiderdown and milkfeed fluff....\n\nAll at once, Gump, Blunder, and Brown Tom STREAK off into space. \nLuna watches them go. TRANSFORMING into a dot of LIGHT, she speeds \nup after them.\n\n127 EXTERIOR FOREST (RIDE MONTAGE) NIGHT \n\nJack clings to Lili as the unicorn thunders through the midnight \nforest, darting like quicksilver between the shadowy trees, leaping \nimpossible chasms, splashing across streams in a burst of moonlit \nspray.\n\n127A EXTERIOR SKY NIGHT \n\nThe full moon hangs above like the lantern of God as the faeries \ntumble through the clear night sky. Gump rides the alicorn like a \nbroomstick.\n\nFar below, magically white and fluid as free-roving moonbeam, the \nunicorn carries her passengers across the nocturnal forest with the \nease of a dreamer transported through time.\n\n128 EXTERIOR RING POND DAY \nIt is not yet sun-up. The first faint trace of the false dawn tints \nthe eastern horizon. Everywhere, the snow is melting. It is like \nspringtime, with bold patches of green showing through the frozen \nlandscape.\n\nA bright beam of LIGHT APPROACHES, weaving between the giant trees. \nIt is Jack and Lili, mounted on the unicorn.\n\nJack rides up onto the high rock overinghanfing the ponnd and slides \neasily to the ground with Lili in his arms.\n\nThe unicorn doesn't move. She stands watching as Jack gently rests \nLili down on the mossy earth.\n\nJack strips off his golden mail coat and steps on the edge of the \npromontory. He dives gracefully into the pond.\n\n128A EXTERIOR FOREST DAY \n\nScrewball in the lead, the faeries CRASH down through the trees, \nbouncing to a stop on the forest floor.\n\nSCREWBALL: Ow!\n\nBROWN TOM: Ouch!\n\nGUMP (cheerfully): Home again!\n\nThe bedraggled faeries scowl at Gump.\n\n129 EXTERIOR UNDERWATER DAY \n\nJack streaks down, streaming air bubbles like a comet's tail.\n\n129A EXTERIOR UNICORN DEATH ARENA DAY \n\nThe faeries gather around the frozen unicorn stallion. His alicorn \nhas been restored. Wreathed in flowers, it stands majestically out \nfrom his forehead.\n\n129B EXTERIOR UNDERWATER DAY \n\nJack strokes deeper and deeper into the pond, past undulating weeds \nand curious fish.\n\n129C EXTERIOR UNICORN DEATH ARENA DAY \n\nFaeries are all about, dancing and SINGING around the statuesque \nunicorn. They pelt one another with petals. The mare stands demurely \nto one side, draped in blossoms.\n\n129D EXTERIOR UNDERWATER DAY \n\nAt the bottom, Jack moves carefully, trying not to stir up the muck. \nHe gently parts the drifting trendrils, searching among the water \nweeds.\n\n129E EXTERIOR TREETOP DAY \n\nHigh above the faerie celebration, beautiful MUSIC is HEARD. It is \nGump, playing his violin in uppermost branches of a towering pine. \nDelicate as the call of a meadow lark, Gump's music rises sweetly \ninto the heavens. It is just dawn. The sun's GLOW blazes in the \neast.\n\n129F EXTERIOR UNDERWATER DAY \n\nA winking GLEAM catches Jack's eyes and he reaches out an eager \nhand.\n\nA cloud silt issues from his grasp as he opens his fingers. Centred \non his palm, golden and perfect, is Lili's ring.\n\n129G EXTERIOR UNICORN DEATH ARENA DAY \n\nRound and full, the sun rises. The golden sun rays pierce through \nthe trees and start across the open meadow. Gump's music continues, \nmore lyrical than ever.\n\nAs the sunlight advances, bright spring flowers push up through the \nonce-frozen earth.\n\n129H EXTERIOR UNDERWATER DAY \n\nJack turns and strokes upwards, higher and higher, towards the \nshining ceiling of light far above.\n\n129I EXTERIOR UNICORN DEATH ARENA DAY \n\nGump's music swells to a crescendo. The life-giving sunlight reaches \nacross the meadow and strikes the flank of the dormant stallion.\n\n130 EXTERIOR RING POND DAY \n\nJack breaks the surface, holding the ring triumphantly above his \nhead.\n\n130A EXTERIOR CLIFF ABOVE POND DAY \n\nThe Princess sleeps under the tree. She no longer wears the black \nwedding gown, but is dressed as before. Jack's armour has also \ndisappeared.\n\nJack kneels before Lili and slips the ring onto her finger.\n\nHe takes the girl into his arms and kisses her passionately on the \nmouth.\n\nLili smiles. Her eyelids flutter.\n\n131 DELETED\n\n132 DELETED\n\n133 DELETED\n\n134 EXTERIOR UNICORN DEATH ARENA DAY\n\nThe unicorn's sunlit flesh twitches, dislodging a butterfly warming \nhis wings on his haunch.\n\nIn a single, beautiful movement, the stallion rises to his feet. He \narches his powerful neck and CALLS to his mate. The magic animals \ngallop off together across the open meadow.\n\n135 DELETED\n\n136 DELETED\n\n136A EXTERIOR RING POND DAY\n\nPrincess Lili awakens.\n\nLILI: Oh....! Jack! What a dream\nI've had!\n\nThe Princess smiles when she sees the ring on her finger.\n\nLILI (cont): Such a terrible dream....\nI could never tell you....\n\nLili looks around, but Jack is nowhere in sight.\n\nLILI (cont): Jack....? Where are you....?\n(calling)\nGreen Jack!\n\nGetting no reply, Lili wanders off in search of Jack.\n\n137 EXTERIOR JACK'S FOREST GLADE DAY \n\nPuzzled, Lili searches the familiar place.\n\nLILI (calling): Jack....! Where are you\nhiding now?\n\nThe wind surges through the treetops. The leaves all move together \nas if they were a single living organism.\n\nJack's VOICE is heard out of the waving trees.\n\nJACK (os): I'm everywhere, Lili....my\nspirit lives in everything....\n\nLILI: Jack.... Don't play games with me!\nI love you!\n\nJACK (os): I....love.....you...\n\nLILI: Will you be here tomorrow?\n\nUnseen in the bushes, Gump and the faeries hide, grinning as\nthey watch Lili.\n\nJACK (os): I'm always here, Lili....\nwhenever you come....\n\nMystified, but happy, Princess Lili picks a flower and wanders off \ninto the sun-bright woods.\n\nEND CREDITS ROLL\n\n138 EXTERIOR MEADOW DAY \n\nA lush broad expanse, boldly pattered with wild flowers. Breasting \nthe waving grass like a swimmer in the sea, the unicorn bounds \njoyfully in total freedom.\n\nMounted on the animal's back, his arms in victory, Jack rides like a \ntriumphant angel. His hair and skin are tinted green! He is the \nincarnation of all that is magical in Nature.\n\n\nT H E E N D\n\n\n\n\n\n\nLegend\nWriters :   William Hjortsberg\nGenres :   Fantasy  Adventure  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In 2009, a genetically re-engineered measles virus, originally created as a cure for cancer, turns into a lethal strain which kills 90% of those it infects, and mutates the remaining 10% into predatory, nocturnal mutants called \"Darkseekers\" who are extremely vulnerable to sunlight and other sources of UV. Three years after the outbreak, US Army virologist Lieutenant Colonel Robert Neville (Will Smith) lives an isolated life in the ruins of New York City, which is now deserted, unsure if any other uninfected humans are left in the world.\nThe effects of the virus vary in other species. Animals that coexist with humans like rats and domestic dogs are infected but wild animals like deer and lions are unaffected. The city has fallen into ruins and overgrown vegetation covers crumbling buildings and wild deer roam the streets while being preyed upon by lions that have escaped Central Park Zoo. Neville's daily routine includes experimentation on infected rats to find a cure for the virus and trips through Manhattan to hunt for food and supplies. He also waits each day for a response to his continuous recorded radio broadcasts, which instruct any uninfected survivors to meet him at midday at the South Street Seaport. Flashbacks reveal that his wife (Salli Richardson) and daughter (Willow Smith) died in a helicopter accident during the chaotic evacuation of Manhattan, prior to the military-enforced quarantine of the island in 2009, in which Neville stays behind on the island as military personnel. Neville's loneliness is mitigated by the companionship of his German Shepherd Sam (given to him by his daughter Marley as a puppy before she died in the helicopter crash to protect him), interaction with mannequins he has set up as patrons at a video store, and recordings of old television broadcasts. At night, he barricades himself and Sam inside his heavily fortified Washington Square Park home to hide from the Darkseekers. One day while waiting for survivors, Sam follows a deer into a dark building while she and Robert were hunting. Neville cautiously goes in after her and finds the deer's corpse along with Sam, but the building is infested by a colony of Darkseekers, both manage to escape unharmed and the attacking Darkseekers are killed by the sunlight.\nNeville finds a promising treatment derived from his own blood, so he sets a snare trap and captures a female Darkseeker while a male Darkseeker (termed \"Alpha Male\" in the script, and played by Dash Mihok) watches from the shadows. Back in his laboratory in the basement of his house, Neville treats the female without success. The next day, he is ensnared in a trap similar to the one he used to capture the female, and by the time he manages to escape, it is dark and he is attacked by infected dogs. Neville and Sam manage to kill them, but Sam is bitten in the fight. Neville brings Sam home and injects her with a strand of his serum, but when she shows signs of infection and tries to attack him, Neville is forced to strangle her to death. The next night, driven over the edge by loneliness, he ventures out and suicidally attacks a group of Darkseekers. He is nearly killed, but is rescued by a pair of immune survivors, Anna (Alice Braga) and a young boy named Ethan (Charlie Tahan), who have traveled from Maryland after hearing one of his broadcasts. They take the injured Neville back to his home, where Anna explains that they survived the outbreak aboard a Red Cross evacuation ship from São Paulo and are making their way to a survivors' camp in Bethel, Vermont. Neville angrily argues that no such survivors' camp exists.\nNeville once again attempts to administer a potential cure to the infected woman in his laboratory, but the next night, a group of Darkseekers, who had followed Anna and Neville back the night before, attacks the house and overruns its defenses. Neville, Anna, and Ethan retreat into the basement laboratory, sealing themselves in with the female Darkseeker on which Neville has been experimenting. Discovering that the last treatment was successful, Neville draws a vial of her blood and gives it to Anna, before shutting Ethan and her inside a coal chute in the back of the lab. He then takes a grenade and kills the Darkseekers and himself, saving the cure.\n\nThe alpha male makes a butterfly-shaped smear on the glass. Neville realizes that the alpha male is identifying the female upon which he was experimenting by a butterfly tattoo, and the alpha male wants her back. Neville puts his gun down and returns the female. Neville and the alpha male both stare each other down; Neville apologizes to the Darkseekers; the alpha male accepts his apology, and the Darkseekers leave. Shocked by the ordeal, Neville sits down for a moment in his laboratory. Looking over the pictures of his numerous test subjects, the implications of his research methods begin to dawn on him. The final shot follows Neville, Anna, and Ethan as they drive away towards the survivors' camp in Vermont with the antidote."}