{"title": "Legion", "full_text": "LEGION\n\n \n\n         \n                                Written by\n          \n                        Peter Schink & Scott Stewart\n\n          \n\n          \n\n                                          10.31.07 Final Draft\n          \n\n          TITLE OVER BLACK\n\n          \n\n          \n          \"Come, ye children, listen to me.   I will teach you\n          the fear of the LORD.\"\n\n          \n\n          \n\n                                        PSALM 34:11\n\n          \n\n          THE MOJAVE DESERT - DUSK\n          Vast.    Barren.   No signs of life.\n          A BLOOD RED SUN is sinking behind the distant mountains.    The\n          unbearable heat will soon become an unbearable cold.\n          A YOUNG WOMAN'S VOICE.    Solemn.   Weary.   Determined.\n\n                                WOMAN'S VOICE\n                      When I was a little girl, my mother\n                      would remind me each night before\n                      bed to be sure to open my heart to\n                      God, for he was kind, merciful and\n                      just. Things changed after my\n                      father left a few years later,\n                      leaving her to raise me and my\n                      brothers alone in a little place\n                      out on the edge of the Mojave\n                      Desert. She never talked about a\n                      kind and merciful God again.\n                      Instead she spoke of a prophecy.\n                      Of a time when all the world would\n                      be covered in darkness and the fate\n                      of Mankind would be decided. One\n                      night I finally got up the courage\n                      to ask my mother why God had\n                      changed, why was he mad at his\n                      children. \"I don't know,\" she\n                      said, tucking the covers around me,\n                      \"I guess he just got tired of all\n                      the bullshit.\"\n          And with these words the last trace of sunlight is SNUFFED\n          OUT, leaving us in:\n\n          DARKNESS...\n          A darkness filled with the sounds of SIRENS, GLASS\n          SHATTERING, SPORADIC GUNFIRE...a CITY FALLING INTO CHAOS.\n          TITLE:   \"Los Angeles, December 23rd - 1:02 a.m.\"\n\n          \n\n          A BLOOD RED MOON\n          reflected in a greasy puddle of water. Might just be the\n          smog that's making it that ominous color. Then we notice\n          something moving in the reflection. A dark shape, growing,\n          coming down at us fast. Beat...then WHAM!\n\n          TWO BLACK BOOTS\n          land hard in the water...and we're in:\n\n          \n\n                                                                      2.\n\n          \n\n          \n\n          \n\n          EXT. AN ALLEY WAY - LATE NIGHT\n\n          A DARK FIGURE in a tattered trench coat tumbles onto the\n          pavement, hands out to slow the impact. A beat then slowly\n          he climbs to his feet, recovering from what seems to have\n          been quite a fall. He has chiseled features, shaved head,\n          deep-set eyes. Looks like he's been through one hell of a\n          fight.\n          His name, we will come to know, is MICHAEL.\n          He quickly checks out his surroundings, nothing but brick\n          walls above him. Where'd this guy jump from?\n          A RUMBLE of thunder...then RAIN starts to hammer down.   Seems\n          to motivate him.\n          Michael pulls his overcoat tight around his body and dashes\n          toward the mouth of the alley. He reaches the STREET just in\n          time to see a FLEET OF POLICE CARS tearing around the corner,\n          SIRENS WAILING, heading this way.\n          He reels back into the alley way, ducks down behind a trash\n          dumpster, as the BLUE AND RED LIGHTS of the POLICE CARS whip\n          past.\n          Michael waits for the lights to disappear, then he pulls a\n          MASSIVE ORNATE KNIFE from his jacket. Considers it grimly.\n          Runs his finger along its edge. Blood beads up. Razor\n          sharp.\n          Michael begins to peel off his overcoat, revealing his bare\n          chest underneath...and skin literally covered with DARK\n          TATOOS. Hard to see what they are in this light.\n          As his coat falls to the ground, we DRIFT over to the BRICK\n          WALL behind him where we see MICHAEL'S SHADOW crouch over,\n          and then...\n\n          ...TWO LARGE SHAPES UNFOLD FROM HIS BACK, STRETCHING UP INTO\n\n          WHAT ARE UNMISTAKABLY...THE SHADOW OF WINGS.\n          The RAIN POUNDS harder, as if punishment from the heavens.\n          The glint of the KNIFE coming down fast.\n\n          A HORRENDOUS SOUND OF FLESH TEARING AWAY FROM BONE...\n\n          ...THE BLOODY KNIFE CLATTERING TO THE PAVEMENT...\n\n          ...FOLLOWED BY MICHAEL'S UNGODLY SCREAM RISING UP FROM THE\n          ALLEY WAY. And then SILENCE...\n\n          CLOSE ON THE GUTTER, AS BLOOD BEGINS TO FLOW FREELY, MIXING,\n\n          SWIRLING WITH THE RAIN...\n\n          \n\n                                                                     3.\n\n          \n\n          \n\n          \n\n          EXT. CITY STREET - A SHORT WHILE LATER\n\n          Michael, face tight with pain, trench coat back on, steps out\n          of the alley, stares with determination at a dark storefront\n          across the street.\n\n          \"GUN & SPORT WORLD\"\n\n          \n\n          INT. GUN & SPORT WORLD - A SHORT WHILE LATER\n\n          Cavernous. A Costco for survivalists.    Quiet except for the\n          sound of RAIN, then...\n          SMASH! Michael drops down through one of the skylights in a\n          shower of glass.\n\n          \n\n          INT. GUN & SPORT WORLD - BATHROOM - MOMENTS LATER\n\n          Michael bursts in. Tosses a first-aid kit into the sink.\n          His trench coat falls to the floor and here in the\n          fluorescent light, we get a better look at him.\n          His thin but stunningly well muscled body is TATTOOED\n          shoulder to ankle with INTRICATE WRITING. The man's flesh is\n          a living book. But the writing is in no language we\n          recognize.\n          He turns his back to the mirror, revealing two HORRIFICALLY\n          OPEN WOUNDS running down between both shoulder blades.\n\n          FRESH. BLOODY.\n          He threads a needle not with thread, but with FISHING WIRE,\n          and begins to STITCH the wounds closed. BLOOD POOLS on the\n          cement floor around his feet.\n\n          \n\n          INT. GUN & SPORT WORLD - MOMENTS LATER\n\n          Trench coat and a shirt back on, Michael races along the\n          ENDLESS RACKS OF GUNS, searching for just the right weapons,\n          his every movement precise, as if he's trained his whole life\n          for this.\n          Weapon after ferocious weapon gets tossed into rifle bags.\n          Whatever this guy's preparing for, it's big.\n          Rifle bags filled, Michael heads for the exit.   Stops cold.\n          The place is locked up tight.   Metal gate over the front\n          doors, bars over the windows.   How the hell's he going to get\n          out of here?\n\n          \n\n                                                                         4.\n\n          \n\n          \n\n          \n\n          INT. LAPD SQUAD CAR - DRIVING - SAME\n\n          Two COPS, world weary, cruise through downtown. That's\n          BURTON behind the wheel, ESTEVEZ riding shotgun.\n          The POLICE RADIO is ABUZZ WITH ACTIVITY.      Busy night.\n          Burton stares out at the city's rain soaked denizens with a\n          deep hatred, the shadows looming in doorways, the\n          streetwalkers.\n\n                              BURTON\n                    Goddamn' animals. Nights like this\n                    I wish I could take a match to this\n                    city just so I could watch all\n                    these motherfuckers burn.\n\n                              ESTEVEZ\n\n                        (LAUGHS)\n                    A good ol' boy barbecue, huh?\n          Burton doesn't even smile.       He's dead fucking serious.\n\n                              BURTON\n                    A fresh start. That's what this\n                    place needs.\n          He holds his finger up like a pistol. Aims it at the people\n          they pass, picking them off one by one.\n\n                                  BURTON\n                    Pow!   Pow!     Pow!\n          Now Burton laughs, a dark, mean laugh.      Estevez eyes his\n          partner, wary.\n\n                              ESTEVEZ\n                    Jesus... You know Burton, I'm so\n                    happy we get to share beautiful\n                    moments like this. They really\n                    brighten my da--\n          KABOOM! Through the WINDSHIELD, we see a storefront EXPLODE\n          just ahead, raining fiery debris onto the squad car.\n          Burton slams on the breaks and the cops look up just in time\n          to see...\n\n          \n\n          EXT. GUN & SPORT WORLD - CONTINUOUS\n\n          Michael, bulging rifle bags in each hand, stepping brazenly\n          out of the GAPING HOLE he's blown in the front of the store.\n\n          \n\n                                                                      5.\n\n          \n\n          \n\n                              ESTEVEZ (O.S.)\n                    Freeze!\n          Estevez and Burton are already out of the squad car,\n          crouching behind the open doors, GUNS trained on Michael.\n\n                              ESTEVEZ\n                    Drop the bags! Hands on your head!\n          In the distance, the POP-POP of GUNFIRE. The POLICE RADIO\n          CRACKLES with URGENT CHATTER. MANY VOICES TALKING AT ONCE.\n          \"Shots fired...Code Three...Officer down!\"\n          The cops shift about nervously, trying to stay focused.\n\n                              MICHAEL\n                        (sensing their unease:)\n                    It's starting. There isn't much\n                    time.\n          The cops shoot a quick, anxious glance at each other -- \"what\n          the hell?\" -- then they turn back to Michael.\n\n                              BURTON\n                    Shut the fuck up and drop the bags\n                    now!\n          Michael lets the gun bags hit the ground.\n\n                              ESTEVEZ\n                    Hands on your head!    On your head!\n          Michael slowly places his palms on his skull.\n\n                              BURTON\n                    Turn around! Turn the fuck around!\n          Michael slowly turns around.    Calm.\n          Estevez rushes in to restrain Michael, grabbing his wrist,\n          FINGERS TIGHTENING. Michael closes his eyes, a terrible\n          decision made.\n          And that's when he moves, a fucking blur!\n          In an instant Michael's broken the cop's arm, spinning him\n          helplessly around, turning him into a human shield. Now it's\n          Michael who's in charge, gun to Estevez's head, facing off\n          with Burton.\n          Burton struggles to find a shot, can't.\n\n                              BURTON\n                    Let `em go!\n\n          \n\n                                                                     6.\n\n          \n\n          \n\n                              ESTEVEZ\n                    Take the shot, Burton!\n\n                              BURTON\n                    I said let `em fuckin' g-g-g-g--\n          Suddenly Burton starts to SHAKE, the words stuck in his\n          throat like a skipping record.\n\n                               ESTEVEZ\n                    Burton!?\n          THE STREET LAMPS BEGIN TO FLICKER AND STROBE, adding to the\n          confusion.\n          Burton squeezes his eyes shut in pain, his WHOLE BODY\n          QUAKING, heels CLICKING the pavement, as if some massive\n          pressure were building inside him.\n          And with the horrific sound of CRACKING BONES, BURTON'S MOUTH\n\n          BEGINS TO TWIST INTO AN IMPOSSIBLY WIDE SMILE LIKE A BIZARRE\n\n          CLOWN!\n          His eyes SNAP OPEN, focused, the force inside him now fully\n          in control.\n          Burton looks at Michael with calm recognition, his voice\n          GUTTURAL..INHUMAN. A man possessed.\n\n                              BURTON\n                    What are you doing, Michael?   These\n                    weren't your orders.\n          Estevez looks at his partner with confusion.\n\n                              ESTEVEZ\n                    What did you say?\n          Michael, however, seems to know exactly who he's talking to.\n\n                              MICHAEL\n                    I'm following my own orders now.\n\n                              BURTON\n                    Then you will die along with the\n                    child.\n\n                              ESTEVEZ\n                    Burton, you fuckin' know this guy?!\n          BLAM! Burton shoots his partner in the head. Estevez drops,\n          leaving Michael without cover. Burton re-aims, but Michael's\n          faster, already FIRING back.\n          Bullets rip up the concrete. SMASH!   The squad car window\n          SHATTERS, Burton's chest EXPLODING!\n\n          \n\n                                                                    7.\n\n          \n\n          \n          And down he GOES, leaving Michael the only one left standing.\n          Smoke rising from his gun.\n          With soldier-like efficiency, Michael picks up the rifle bags\n          and begins to load them into the trunk of the squad car.\n          He gets in the car and FLOORS IT, ROARING AWAY, as the\n          FLICKERING STREET LAMPS FINALLY GO OUT IN RAPID SUCCESSION, a\n          wave chasing him, PLUNGING THE ENTIRE CITY INTO DARKNESS...\n\n                                                        SMASH CUT TO:\n\n          \n\n          JEEP HANSON (LATE TEENS)\n          Bolts awake.   Breathing hard.   Covered with sweat.\n\n          \n\n          INT. JEEP'S ROOM - JUST BEFORE DAWN\n\n          Jeep switches on a lamp, illuminating this incredibly cramped\n          bedroom. Not much larger than the bed itself. He's got\n          shaggy hair, a sensitive face, clearly not big on sunlight.\n\n          \n\n          EXT. DESERT - PRE-DAWN\n\n          A couple of ancient SILVERSTREAM TRAILERS are bathed in the\n          eerie blue light of night's final moments. It looks like the\n          trailers haven't moved from this patch of barren ground in\n          decades. A single strand of colored Christmas lights dot the\n          trailers roof lines, marking the season.\n          One of the trailer doors CREAKS open and Jeep steps wearily\n          out into the cool western morning. Home.\n          Nothing but desert for miles in all directions, save for a\n          two lane HIGHWAY and a weather beaten TRUCK STOP DINER that\n          Jeep and his father will open for business in a few hours.\n          Jeep gazes up to the diner's slanted roof where a large sign\n          glows like a beacon in the darkness:\n\n          \"PARADISE FALLS GAS `N' GRUB\"\n          A beat as Jeep contemplates the sign.\n\n                              CHARLIE (O.S.)\n                    You okay, Jeep?\n          Jeep turns to see CHARLIE, a very pregnant girl of about\n          twenty, standing in the trailer doorway, rubbing the sleep\n          from her eyes. Even with the trailer-trash veneer, she's\n          strikingly beautiful.\n\n          \n\n                                                                8.\n\n          \n\n          \n\n                              JEEP\n                    Sorry to wake you, Charlie.\n\n                              CHARLIE\n                        (stepping out of the\n                         trailer, hands on her\n\n                         BELLY)\n                    Wasn't you. He's been kickin' up a\n                    storm all night. Must know\n                    somethin' I don't.\n          She approaches Jeep.   Sees the strain in his eyes.\n\n                              CHARLIE\n                    Another bad dream?\n          He struggles for a moment, nods.\n\n                               CHARLIE\n                    It's just stress, Jeep, that's all.\n                    You do too much worryin'. About\n                    this place. About your dad.\n\n                        (BEAT)\n                    About me...\n          A glimmer of a smile crosses Jeep's face.\n\n                              JEEP\n                    You're the only thing I like\n                    worrying about.\n\n                              CHARLIE\n                    See what I mean? You're worried\n                    about a girl eight months pregnant\n                    and it isn't even your baby. Now\n                    that's enough to give anybody\n                    nightmares.\n          Jeep turns away, dejected.\n\n                              JEEP\n                    Go ahead, make fun of me.\n                    Everybody else does.\n\n                              CHARLIE\n                        (turns him back around)\n                    C'mon, I was only kiddin'. You\n                    know how much I appreciate\n                    everything you and Bob are doing\n                    for me, but a month from now, this\n                    baby'll have a new family and I'll\n                    have to start thinkin' about what\n                    the hell I'm doin' with my life.\n          This is not news Jeep wants to hear.\n\n          \n\n                                                                      9.\n\n          \n\n          \n\n                              JEEP\n                    So you're still going through with\n                    it...?\n\n                              CHARLIE\n                    Jeep, I'm not ready to be a mama.\n                    Christ, I can barely take care of\n                    myself as it is.\n\n                              JEEP\n                    I could help you. We could do it\n                    together, you know? I want to.\n          Charlie smiles sadly at him, touched by his sweetness, but\n          this just isn't where she's at.\n\n                              CHARLIE\n                    You gotta stop carryin' the weight\n                    of the world on your shoulders.\n          Jeep nods, tries to hide the fact that he's dying inside.\n\n                              CHARLIE\n                        (rubbing her arms)\n                    Now can we go back in? I'm\n                    freezing my ass off out here.\n\n                               JEEP\n                    Go on.   I'll be right there.\n          Charlie kisses him on the cheek and heads back to the\n          trailer. He watches her, longing in his eyes. With the\n          clank of the door, she's gone.\n          And over Jeep's troubled look, the perennial holiday cheer of\n          FRANK CAPRA'S \"IT'S A WONDERFUL LIFE\" MIXES up.\n\n                              JIMMY STEWART (V.O.)\n                    I don't know whether I like it very\n                    much being seen around with an\n                    angel without any wings.\n\n                                                            CUT TO:\n\n          \n\n          IT'S A WONDERFUL LIFE PLAYING ON A CRUMMY TV\n          Jimmy Stewart as George Bailey has just met Clarence, his\n          guardian angel-in-training. The signal ROLLS and SNOWS in\n          and out. We hear a WHACK, which causes the image to\n          momentarily improve and then slowly roll back the other way.\n\n                              CLARENCE (ON TV)\n                    Oh, I've got to earn them and\n                    you'll help me, won't you?\n\n          \n\n                                                                  10.\n\n          \n\n          \n\n          \n\n          INT. PARADISE FALLS GAS `N' GRUB - DAY\n\n          BOB HANSEN (late 40's), owner and proprietor of this fine\n          roadside establishment, attempts to fix the old TV hanging in\n          the corner above the counter by banging the shit out it.\n          The restaurant itself has the kind of grungy diner charm\n          you'd hope to find in a place last renovated in 1963. An old\n          plastic Christmas tree strung with flickering lights and\n          tinsel occupies a lonely corner. Next to that, a faded\n          diorama of the NATIVITY SCENE. The kind you might order off\n          the Shopping Network.\n          Bob considers the TV with a frown. He deftly rolls an\n          ENGRAVED SILVER ZIPPO back and forth over the nicotine\n          stained fingers of his right hand. Must be a nervous habit.\n          You can tell just by looking at the man that he's a beer\n          drinker.\n          Behind the counter, a black man named PERCY WALKER (60's) is\n          cooking up a storm on the grill with spectacular one-handed\n          dexterity. You do get pretty good at this sort of thing when\n          your other hand has long been replaced by a METAL HOOK.   The\n          dog tags around his neck tell the story. His white cook's\n          hat has been temporarily replaced by a red Santa hat.\n\n                              PERCY\n                    Lord as my witness, Bob, one of\n                    these days that thing's gonna hit\n                    you back.\n\n          WHACK!\n\n                              BOB\n                    Whaddya talkin' about, Percy? We\n                    got a special relationship here.\n\n          WHACK!\n\n                              PERCY\n                    Yeah, they got names for that kind\n                    a relationship.\n          The JUKEBOX on the other side of the diner starts up with the\n          MERLE HAGGARD tune \"I'M A LONESOME FUGITIVE\".\n          A stunning looking sixteen-year-old GIRL with dyed-black hair\n          and a piercing or three, is leaning seductively over the\n          jukebox, swaying gently to the music. The headband doubling\n          as her mini-skirt reveals her knock-out figure in a way that\n          really doesn't leave much up to the imagination. She's a\n          billboard of rebellion.\n\n                              SANDRA (O.S.)\n                    It's disgusting.\n\n          \n\n                                                                  11.\n\n          \n\n          \n\n                              HOWARD (O.S.)\n                    You're right. It is disgusting.\n          Watching the scintillating action from a booth across the\n          diner is a conservatively dressed SUBURBAN COUPLE. SANDRA\n          and HOWARD ANDERSON. Fish out of water.\n\n                              SANDRA\n                    Really, how can she go out in\n                    public wearing that?\n\n                              HOWARD\n                    I don't know. Why don't we just\n                    ask her?\n\n                              SANDRA\n                    Howard, don't. You'll embarrass\n                    me.\n\n                              HOWARD\n                        (shouting across the\n\n                         DINER)\n                    Audrey, honey? Your mother was\n                    wondering if you got dressed this\n                    morning with the specific intention\n                    of showing your ass off to the\n                    entire world?\n          The girl who we now know as AUDREY ANDERSON turns to Howard\n          with a caustic smile.\n\n                               AUDREY\n                    Yeah, that's cuz I woke up hoping\n                    to get double teamed by a couple of\n                    meth head truckers in the bathroom\n                    of some desert shithole.\n\n                        (BEAT)\n                    Good thing we stopped here.\n          And with that she turns back to the jukebox. Percy watches\n          the exchange discreetly from behind the counter. Loving it.\n          Howard turns back to his wife.   Rigid smile.\n\n                              HOWARD\n                    I feel satisfied with that answer.\n                    I really do.\n          Sandra buries her face in her hands.\n\n                              SANDRA\n                    I'm being punished for something, I\n                    know it.\n\n          \n\n                                                                    12.\n\n          \n\n          \n          Across the diner, Audrey goes back to swaying dreamily to the\n          music, which is suddenly overtaken by BASS BUMPIN' HIP-HOP.\n\n                                                              CUT TO:\n\n          \n\n          DRIFTING OVER A VAST EXPANSE OF WESTERN DESERT\n          The noontime sun bakes the strip of highway slicing through\n          this barren country.\n          A BLACK CADILLAC ESCALADE blazes a path.   HEAVY BEATS thunder\n          from within.\n\n          \n\n          INT. ESCALADE - DRIVING - CONTINUOUS\n\n          The stereo in this rig could shake mountains. KYLE WILLIAMS\n          (late 20's) handsome as hell, thug style. A straight up bad\n          boy.\n          He passes a weathered road sign:\n\n          \"ENTERING PARADISE FALLS, NEXT SERVICES 50 MILES\"\n          Kyle's expression says this is not good news.\n          He grabs his cell phone off the passenger seat.   No signal.\n\n                              KYLE\n                    Shit...\n          He spots the truck stop diner just up the road ahead...\n\n          \n\n          EXT. PARADISE FALLS GAS `N' GRUB - CONTINUOUS\n\n          The Escalade pulls off the highway and rolls to a stop at the\n          lonely row of old gas pumps.\n          Kyle gets out and surveys the scenery with dismay. Now in\n          the daytime we see this is truly a place time forgot.\n          Attached to the diner is a MECHANIC'S BAY. Grease stains and\n          rusty car parts litter the ground. Behind the place is the\n          SILVERSTREAM TRAILER we saw Jeep step out of earlier.\n          The only thing here that looks fairly new is the UHAUL TRUCK\n          parked in front of the garage with its hood up.\n          Kyle grabs a crumpled hand drawn map from the front seat and\n          flattens it out on the roof of the car. He spins it around.\n          Which way is north?\n\n          \n\n                                                                   13.\n\n          \n\n          \n\n                               KYLE\n                    Darren, your fuckin' directions\n                    suck, man.\n          He checks his cell phone again. No chance of a signal way\n          out here. So he shuffles around to the side of the diner in\n          search of a pay phone.\n          The good news is that he finds one.   The bad news is that\n          it's been broken for ten years.\n          Leaning next to the broken phone, however, is Charlie wearing\n          a shabby, faded WAITRESS uniform stretched tight around her\n          very pregnant belly. Adding to her perfect mother-to-be look\n          is that cigarette dangling from her lips. The plastic name\n          tag pinned to her chest says \"CHARLIE\".\n\n                              KYLE\n                    Hey...\n          She eyes him, mildly intrigued, takes a drag.\n\n                              KYLE\n                    You know that shit right there\n                    ain't good for the baby.\n          She lets out a long slow exhale.\n\n                              CHARLIE\n                    Guess I should think `bout quittin'\n                    then.\n\n                              KYLE\n                    Now hold on, girl, let me bum one\n                    before you do.\n\n                              CHARLIE\n                    You can buy a whole pack inside.\n\n                              KYLE\n                    Tell ya what. You let me have one\n                    of yours, and I'll give you two\n                    from the new pack you're gonna sell\n                    me.\n          She considers him for a moment, then pulls out a cigarette.\n          Lights it off the end of hers then hands it to him. Kyle\n          takes a drag, pulls out his crumpled map.\n\n                              KYLE\n                    Am I in the right place?\n\n                              CHARLIE\n                        (peers at the map)\n                    Only if nowhere's right, `cause\n                    that's where you are.\n\n          \n\n                                                                    14.\n\n          \n\n          \n\n                              KYLE\n                    Sonuvabitch. There another phone\n                    around here? You know, one that\n                    works?\n\n                              CHARLIE\n                    Bob'll probably let you use the\n                    diner phone if you ask him real\n                    nice...And pay `im somethin'.\n\n                              KYLE\n                    I can handle that.   You got\n                    pancakes here?\n\n                              CHARLIE\n                    Yeah, we got a buttermilk stack for\n                    three seventy-five. We also got\n                    french toast for four dollars if\n                    you're into that. I personally\n                    like the pancakes though.\n\n                              JEEP (O.S.)\n                    You okay, Charlie?\n          They both turn to see Jeep behind the diner, wearing\n          mechanic's coveralls and holding a DUSTY OLD CRIB. Charlie\n          quickly hides her cigarette behind her back. Busted.\n\n                              CHARLIE\n                    Yeah, I'm okay. This guy's just\n                    lost.\n          Jeep nods, uncertain, eyes Kyle another moment, then he\n          shuffles along out of sight. Charlie brings the cigarette\n          back up to her lips. An awkward beat.\n\n                              KYLE\n                    Three seventy-five, huh?\n\n          \n\n          INT. PARADISE FALLS GAS `N' GRUB - DAY\n\n          The DOOR JINGLES.   Charlie and Kyle enter.\n          Audrey's eyes light up when she sees Kyle. He notices her as\n          well. How couldn't he? She's directing every ounce of sex\n          appeal she has in his direction.\n          Her parents, on the other hand, shoot a look of utter fear in\n          Kyle's direction, as if he personified their worst suburban\n          nightmare.\n          Charlie heads to the register. Digs out a fresh pack of\n          smokes from underneath the counter.\n\n          \n\n                                                                 15.\n\n          \n\n          \n\n                              CHARLIE\n                    I hope Salem Lights are okay,\n                    `cause that's all we got left.\n\n                              KYLE\n                    If I can smoke `em, I'll take `em.\n\n                              BOB (O.S.)\n                    Where ya been, Charlie?\n          Bob steps off the chair.\n\n                              BOB\n                    This ain't a resort you know.    I\n                    got orders stacking up here.\n          In truth there aren't any orders stacking up, but it\n          certainly makes Bob feel better to say it.\n\n                              BOB\n                        (sees the two cigarettes\n                         Kyle's handing her)\n                    You best not be smokin' again.    Not\n                    in your condition.\n\n                              CHARLIE\n                        (gestures to the diner)\n                    Bob, do you see where am I right\n                    now? Can my condition really get\n                    any worse? `Sides, you ain't one\n                    to talk.\n\n                               BOB\n                    What?   I quit two years ago.\n\n                              CHARLIE\n                    Yeah, so why you still carryin'\n                    that fancy lighter `round for?\n\n                              BOB\n                    It was a gift from my ex-wife,\n                    alright? I'm sentimental. I don't\n                    wanna forget how much I hate her\n                    guts.\n\n                               KYLE\n                    Hey man?\n          Bob turns to Kyle.   Doesn't like what he sees.\n\n                              KYLE\n                    Can I use your phone? My cell\n                    doesn't get a signal out here and\n                    the pay phone outside is busted.\n          Bob is about to respond when:\n\n          \n\n                                                                  16.\n\n          \n\n          \n\n                              HOWARD (O.S.)\n                    Excuse me...?\n          Howard approaches, oblivious to the conversation he's\n          interrupting.\n\n                               HOWARD\n                    Any news about when our truck might\n                    be fixed? You said your boy would\n                    have us on the road two hours ago.\n                    The rate we're going, we'll be\n                    lucky to make it to Scottsdale by\n                    Christmas.\n          Bob's expression darkens at this news.\n\n                              BOB\n                    Goddamn it. Where the hell is\n                    Jeep?\n\n                                                             CUT TO:\n\n          \n\n          A GRIMY PIECE OF WOOD\n          A cloth wipes away the dirt, revealing the partial image of\n          an ANGEL carved into the surface.\n\n          \n\n          INT. MECHANIC'S BAY - CONTINUOUS\n\n          Jeep is carefully cleaning the old wooden crib on a\n          workbench. There's an unsettling intensity in his eyes, as\n          if fear itself were driving him.\n\n                              BOB (O.S.)\n                    Hey, Leonardo...!\n          Jeep freezes, knows he's in trouble He reluctantly turns to\n          see his father standing next to the Anderson's broken-down\n          Uhual.\n\n                              BOB\n                    The fact that this truck's hood's\n                    up mean anything to you?\n          Jeep stares at the ground.   Couldn't be anymore\n          uncomfortable.\n\n                              JEEP\n                    Yeah...\n\n                              BOB\n                        (approaches, peering past\n                         him to the crib)\n\n                              (MORE)\n\n          \n\n                                                                 17.\n\n          \n                              BOB (cont'd)\n                    Whaddya workin' on that's so\n                    goddamn important you're not doin'\n                    your job?\n\n                                 JEEP\n                    Nothin'...\n          Jeep tries feebly to block his path, fails.\n          Bob looks down at the crib with dismay.\n\n                              JEEP\n                    Found it under a bunch of stuff in\n                    the storage shed. I know you never\n                    like to throw anything away...\n          Bob considers him, softens.\n\n                              BOB\n                    Whaddya doin'?\n\n                                 JEEP\n                    What...?\n\n                              BOB\n                    Jeep, I like Charlie. I do. And I\n                    think it's real good of you to lend\n                    her a helping hand, but she is not\n                    your responsibility.\n\n                              JEEP\n                        (heard this before, pushes\n                         past him)\n                    Oh whatever, leave me alone.\n\n                              BOB\n                    Don't walk away from me while I'm\n                    talkin' to you!\n\n          \n\n          EXT. PARADISE GAS `N' GRUB - CONTINUOUS\n\n          Jeep walks out toward the gas pumps, but Bob's right\n          alongside him, not giving up.\n\n                              BOB\n                    How long you gonna follow her\n                    around like a puppy dog? Cleanin'\n                    up the messes she makes while she\n                    steps out with every guy around\n                    here other than you?!\n          Jeep stiffens.   Turns to his father:\n\n                              JEEP\n                    Don't say that about her!     She's\n                    not like that!\n\n          \n\n                                                          18.\n\n          \n\n          \n          Bob gives Jeep a hard stare.    Yeah, she is.\n\n                              BOB\n                    You really think she's gonna stick\n                    around here after that baby's born\n                    and off her hands?\n          Jeeps shakes his head, burns.\n\n                              JEEP\n                    Look, I know it doesn't make any\n                    sense to you, but it's just\n                    something I have to do.\n          Bob sighs, feels for his boy.\n\n                               BOB\n                        (points up at the PARADISE\n                          FALLS sign)\n                    See that up there? Your mother\n                    thought I was crazy for wanting to\n                    buy this place, middle of\n                    nowhere...But I just knew this was\n                    what I was supposed to do. Told\n                    your mom, \"just wait.\" Told her\n                    when they finally ran the freeway\n                    through here like they were\n                    plannin' on, this place would be\n                    like Grand Central Station.\n\n                        (BEAT)\n                    But I was wrong. The freeway never\n                    came and now the only people who\n                    ever stop here are the ones who are\n                    lost.\n\n                        (BEAT)\n                    And your mom? Well she got tired\n                    of waitin'.\n\n                              JEEP\n                    C'mon Dad. You can't blame\n                    yourself for what she did--\n\n                               BOB\n                    Yeah, I can. And I'm sayin' you're\n                    about to make the same damn mistake\n                    I made, believing in something\n                    that's never gonna happen...Or\n                    someone.\n\n                        (BEAT)\n                    It's time for you to move on from\n                    this place, Jeep. I don't wanna\n                    see you wake up one morning old and\n                    pissed off, realizing you're lost\n                    just like everybody else who stops\n                    here.\n\n          \n\n                                                                     19.\n\n          \n\n          \n          Jeep looks up at his father, his words hanging heavily.    A\n          tough pill to swallow.\n\n                              BOB\n                    Now get to work on that truck. I\n                    wanna have these people on the road\n                    by nightfall.\n          Bob walks back into the diner.\n          Jeep is about to turn back to the garage when he notices\n          something off in the distance.\n          Ominous DARK CLOUDS line the horizon to the south like a\n          living wall. He shifts his gaze up the highway to the north.\n          Same thing. DARK CLOUDS are pushing their way over the\n          distant mountains. A storm is coming.\n\n          \n\n          INT. PARADISE FALLS GAS `N' GRUB - SAME\n\n          Bob reenters the diner to find Kyle sitting at the counter,\n          digging into a plate of banana pancakes.\n          Kyle is about to address him again, when something else\n          steals Bob's attention.\n\n                               BOB\n                        (holding up a silencing\n\n                         HAND)\n                    Yeah, wait a minute.\n          The TV has gone on the fritz again.   Only now the image is\n          mostly snow.\n          Bob climbs back onto the chair.   Faces the TV.\n\n                              BOB\n                    What's wrong with you today?\n\n          WHACK!\n          The image flickers but doesn't improve.\n\n                              PERCY\n                    I told you to get the satellite TV.\n                    But you don't wanna listen.\n\n                              BOB\n                    What the hell do I need that crap\n                    for?\n\n                              PERCY\n                    History Channel, man!\n\n          \n\n                                                                    20.\n\n          \n\n          \n\n                              BOB\n                    I got all the history I can take.\n\n                              CHARLIE\n                    That's for sure.\n\n                              BOB\n                    What's your problem now?\n\n          WHACK!\n\n                              CHARLIE\n                    Where do I start?\n\n                              BOB\n                    You know this was the top-of-the-\n                    line model when I bought it.\n\n                              CHARLIE\n                    Yeah, in the Fifties.\n\n                              BOB\n                    You shouldn't be watchin' anyways.\n                        (rubs his hands together)\n                    Okay, baby, this is gonna do it.\n          Bob gives the TV one final wallop -- WHACK!\n          And the picture snaps into FOCUS.    Only it isn't the picture\n          he was expecting.\n          The STARK GRAPHIC OF THE EMERGENCY BROADCASTING SYSTEM and\n          its accompanying HOLLOW TONE fill the diner.\n          Everybody in the place stops and turns to the TV.\n\n                               BOB\n                    See?   Clear as day.\n\n                              PERCY\n                    Nice work, Bob. What the hell's\n                    that?\n\n                              BOB\n                    It's just one of those test things.\n          That'd be true, except for the words at the bottom of the\n          screen, which read:\n\n          \"THIS IS NOT A TEST\"\n          Bob switches the channels.    All the same.\n\n                              CHARLIE\n                    Don't look like a test.\n\n          \n\n                                                                      21.\n\n          \n\n          \n          Bob steps off the chair and backs slowly away from the TV as\n          if a little distance will bring some clarity. He bumps into\n          Kyle.\n\n                               KYLE\n                     Yo, am I the Invisible\n                     motherfuckin' Man here?    Do you\n                     have a phone or not?\n          Kyle peels a five dollar bill off a serious WAD OF CASH.\n          That gets Bob's attention. Bob snaps the money out of his\n          hand.\n\n                               BOB\n                     In the back past the kitchen.   Make\n                     it fast.\n          Kyle hustles passed Percy.\n          Charlie is standing by the Anderson's table, clearing dishes.\n          Everybody's eyes are locked on the TV.\n\n                               SANDRA\n                     If there's a real emergency aren't\n                     they supposed to give us some\n                     information about what to do?\n\n                               HOWARD\n                     I'm sure it's a mistake.\n\n                               BOB\n                     Hey, Percy, give that old radio of\n                     yours a shot. Maybe they got some\n                     news about the TV.\n          Percy grabs an old battery powered radio off a kitchen shelf.\n          Switches it on.\n          STATIC.   He spins the dial until he reaches a clear signal.\n          The same HOLLOW TONE of Emergency Broadcasting.   Station\n          after station the same thing.\n          The diner is overwhelmed by a chilling chorus of HOLLOW\n          TONES. Everyone goes very still.\n\n                               KYLE (V.O.)\n                     Let me talk to him...\n\n          \n\n          INT. DINER - BACK OFFICE - SAME\n\n          Kyle sits at a messy desk in this dark, wood paneled back\n          office, phone to his ear.\n\n          \n\n                                                                  22.\n\n          \n\n          \n\n                               KYLE (CONT'D)\n                        (on phone)\n                    Cuz a father should be able to talk\n                    to his son, that's why. Now put\n                    `im on the phone.\n                        (a beat then a smile)\n                    Is that my little man...? Yeah,\n                    well I'm working hard, so that I\n                    can be with you. You bein' good?\n                        (strange STATIC can be\n\n                          HEARD)\n                    Wait... You're breakin' up.\n                    Hello...?\n                        (hangs up in frustration)\n                    Shit!\n          Kyle stews a beat, then picks up the phone to redial.\n          Frowns. No dial tone.\n\n                              KYLE\n                    What the hell...\n          He keeps trying.    Nothing.\n\n                              HOWARD (V.O.)\n                    Maybe there was an earthquake?\n\n          \n\n          INT. DINER - SAME\n\n          Everyone is looking at Howard.\n\n                               HOWARD\n                    They keep sayin' we're overdue for\n                    a big one.\n\n                              PERCY\n                    Lot a folks could be hurt.\n\n                              BOB\n                    Not if it was centered in the\n                    desert.\n\n                                HOWARD\n                    Exactly.    Could be nothing to worry\n                    about.\n\n                              SANDRA\n                    So then why's the TV out?\n\n                              HOWARD\n                    Maybe it just hit the relay\n                    stations. Aren't those usually in\n                    remote areas?\n\n          \n\n                                                            23.\n\n          \n\n          \n\n                              BOB\n                    Yeah, `cause of the radiation they\n                    give off.\n\n                              PERCY\n                    There ain't no radiation comin'\n                    from those things. Plus that don't\n                    explain the radio being out too.\n                    Some of those stations broadcast\n                    over hundreds of miles. Any quake\n                    that big and we would a felt it.\n\n                              CHARLIE\n                    Percy's right. I didn't feel\n                    nothing.\n\n                              AUDREY\n                    Maybe it's a terrorist attack or\n                    something...?\n\n                              SANDRA\n                        (covers her mouth)\n                    Oh god...\n          Everyone considers that grimly, then:\n\n                              BOB\n                    Well, for cryin' out loud. There's\n                    no use in speculating. I'll just\n                    call my brother up in Needles. He\n                    must a heard something.\n\n                              KYLE (O.S.)\n                    I don't think so.\n          Kyle has reappeared in the diner.\n\n                              BOB\n                    Whaddya talkin' about?\n\n                              KYLE\n                    Phone's dead. Just tried to make a\n                    call.\n\n                              BOB\n                    You're shittin' me.\n          Kyle shakes his head, sits down at the counter.\n\n                              SANDRA\n                    Oh, this is just great.\n\n                              BOB\n                    Relax, Mrs. Anderson. Nothing to\n                    get excited about. Probably just\n                    working on the lines.\n\n                              (MORE)\n\n          \n\n                                                                   24.\n\n          \n                              BOB (cont'd)\n                    Sides, I'm sure Jeep'll have your\n                    truck fixed up quick as can be, and\n                    then you'll be on your way.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Jeep is buried under the Uhaul's hood, working at something\n          with a socket wrench. It's not going well.\n\n                               JEEP\n                    Damn it!\n          He pulls himself up. Grease covers his face and hands.       The\n          sound of a CAR APPROACHING catches his attention.\n          He watches as a beat up EIGHTIES CUTLASS SUPREME pulls off\n          the highway and rolls to a stop at the pumps. It's a mystery\n          how anyone could see through the LAYER OF DUST on that\n          windshield.\n          After a moment the car door pops open and the LEGS OF AN\n          ELDERLY WOMAN swing down to the ground, followed by the metal\n          frame and wheels of a walker.\n          The LITTLE OLD LADY gets out of the car, steadies herself on\n          the walker, and then slowly makes her way toward the diner\n          with the rickety frailness of an old turtle. Jeep watches\n          her disappear inside.\n          He then looks toward the horizon again.   The WALL OF DARK\n          CLOUDS are growing ever closer.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          A JINGLE as the old lady enters. She surveys the scene as if\n          feasting on paradise. Maybe her eyes aren't so good.\n\n                              CHARLIE\n                    Have a seat wherever you want,\n                    Ma'am. Specials are on the board.\n\n                              OLD WOMAN\n                    Thank you, dear.\n          The old lady settles at a table across from the Andersons.\n          She smiles at them pleasantly.\n          Charlie is about to hand her a menu, when:\n\n                              OLD WOMAN\n                    Oh, I already know what I want.\n\n                              CHARLIE\n                    Okay, what'll it be?\n\n          \n\n                                                                    25.\n\n          \n\n          \n\n                              OLD WOMAN\n                    I'll have the steak, please.\n\n                              CHARLIE\n                    And how'd you like that cooked?\n\n                              OLD WOMAN\n                    Rare if you would. And water, no\n                    ice.\n\n                              CHARLIE\n                    Coming right up.\n\n                              OLD WOMAN\n                    Charlie, is it?\n\n                              CHARLIE\n                    Yeah.\n\n                              OLD WOMAN\n                    What an unusual name for a girl.\n\n                              CHARLIE\n                    So they say. I'll be right back\n                    with your water.\n          The old lady turns to the Andersons.\n\n                              OLD WOMAN\n                    Hello, I'm Gladys. Gladys Foster.\n\n                              SANDRA\n                    Nice to meet you, Gladys. I'm\n                    Sandra and this is my husband\n                    Howard.\n\n                              GLADYS\n                    What a nice young couple you are.\n                    What brings you out to these parts?\n\n                              SANDRA\n                    We're moving out to Scottsdale.\n                    But our truck broke down, and so\n                    we're stuck here while it's being\n                    fixed.\n\n                              GLADYS\n                    Oh, what a nuisance.\n          A FLY begins to buzz around Gladys's head.    She doesn't seem\n          to notice it.\n\n                              SANDRA\n                    Say, Gladys, it seems the lines are\n                    down around here. The phone and\n                    TV, you know?\n\n                              (MORE)\n\n          \n\n                                                                  26.\n\n          \n                              SANDRA (cont'd)\n                    And I just was wondering if you\n                    might have heard something on your\n                    way up? You know, about what's\n                    going on?\n          Gladys smiles strangely.\n\n                               GLADYS\n                    Oh, don't worry yourself about\n                    that, sweetheart. It'll all be\n                    over soon.\n          Sandra nods at the old woman, unsure of what to make of that\n          response.\n          The fly that was circling her head, now lands on GLADYS'S\n          FACE. It crawls across her cheek without her reacting in the\n          least.\n          Howard and Sandra exchange looks.    Creepy.\n          The door JINGLES and Jeep walks in. He heads straight for a\n          quiet huddle with Bob. All the while though, he keeps one\n          eye fixed on the old lady sitting at the table near the\n          Andersons. Something about her...\n\n                              JEEP\n                    The carburetor's shot.    Don't know\n                    why. Looks brand new.\n\n                              BOB\n                        (glances over at the\n\n                         ANDERSONS)\n                    Ah, shit. They're gonna be pissed.\n\n                              JEEP\n                    I could try to rebuild it, but it'd\n                    take a while, and I don't think we\n                    have all the parts. If we call\n                    right now, we might be able to get\n                    a new one down here tomorrow\n                    morning.\n\n                              BOB\n                    That's not gonna happen.    Goddamn\n                    phone's out.\n\n                              JEEP\n                    What?\n          Across the diner, Charlie places a bloody red steak in front\n          of Gladys.\n\n                              GLADYS\n                    Thank you, dear. How far along are\n                    you?\n\n          \n\n                                                                    27.\n\n          \n\n          \n          Charlie rests a hand on her belly.\n\n                              CHARLIE\n                    Just about there.\n\n                              GLADYS\n                    The father must be very proud.\n\n                              CHARLIE\n                    I wouldn't know.\n\n                              GLADYS\n                    You mean he's...\n\n                              CHARLIE\n                    Out of sight. Out of mind.\n\n                                 GLADYS\n                    Oh, I see.     So you're not married,\n                    I take it?\n          A fly lands on Gladys's steak. Charlie tries to wave it\n          away. But another one lands in its place.\n\n                                 CHARLIE\n                    Nope.\n          Gladys starts to dig in to the steak with a real\n          ferociousness you wouldn't expect from an old lady.   More\n          FLIES begin to land on her body. On her food.\n          Charlie is still trying to wave them away.\n\n                              GLADYS\n                    That's too bad.\n\n                              CHARLIE\n                    No, I prefer it that way. I don't\n                    a need a man tellin' me what to do.\n\n                              GLADYS\n                    But what about the baby?\n\n                              CHARLIE\n                    I've got it under control.\n\n                              GLADYS\n                    Yeah, but it's gonna burn.\n          Charlie freezes. The Andersons turn to look as well.   Kyle\n          glances over from the counter.\n\n                              CHARLIE\n                    What did you just say?\n\n          \n\n                                                                    28.\n\n          \n\n          \n\n                              GLADYS\n                        (all smiles)\n                    I said your fucking baby's gonna\n                    burn.\n          Charlie shakes her head at the woman, not giving in.\n\n                              CHARLIE\n                    Go to hell, lady.\n          She slaps the check down on the table and walks back toward\n          the kitchen, passing Jeep and Bob.\n\n                              BOB\n                    What happened?\n\n                              CHARLIE\n                    Total fucking Jesus freak.\n          Gladys begins to laugh innocently as she continues to devour\n          her meat. Red juice drips down her chin. The flies are\n          swarming now. How did so many get in here?\n          Sandra and Howard are mortified at this sudden turn of\n          events.\n\n                              GLADYS\n                    All those babies.    They're gonna\n                    burn.\n\n                              SANDRA\n                    Gladys, please. There's no reason\n                    to --\n          Gladys's head suddenly whips toward her.\n\n                              GLADYS\n                    Shut up, you stupid fucking cunt!\n                    All you do is complain! Complain!\n                    Complain!\n          Sandra covers her mouth in shock.    Everybody in the diner is\n          now focused on the old lady.\n          Howard gets up from the booth.\n\n                              SANDRA\n                    Howard, it's okay!     Don't listen to\n                    her!\n          But Howard's already standing over Gladys.\n\n                              HOWARD\n                    Who the hell do you think you are,\n                    lady?! Now, I'd like you to\n                    apologize to my --\n\n          \n\n                                                                    29.\n\n          \n\n          \n\n          GLADYS LUNGES AT HOWARD AND TAKES A MONSTROUS BITE OUT OF HIS\n\n          NECK! SHE PULLS BACK TO REVEAL A MOUTH FILLED WITH TINY\n\n          RAZOR SHARP TEETH.\n          EVERYBODY FREAKS as Howard crumbles to the floor.\n          Gladys rockets to her feet, knocking her table over.   Blood\n          covers her face and chest.\n\n                              GLADYS\n                    You're all going to fucking die!\n          Percy is the first to react. From behind the counter, he\n          whips a heavy metal frying pan at Gladys that knocks her head\n          sideways. THWACK!\n          BONES BREAK AND BURST FROM HER NECK.   Impossibly, Gladys is\n          still standing.\n          She lets out an INHUMAN SCREAM and SCRAMBLES ACROSS THE\n          DINER, knocking tables and chairs over in her wake.\n          Bob pulls a shotgun from behind the counter.\n\n                              BOB\n                    Don't move!\n          But Gladys not only moves, SHE SCURRIES RIGHT UP THE FUCKING\n\n          WALL LIKE SOME KIND OF BIZARRE CRAB!\n          Bob can't believe his eyes. But he gets over it real fast,\n          as the crab lady rushes toward him -- ACROSS THE CEILING --\n\n          UPSIDE DOWN!\n          BOB PUMPS THE SHOTGUN, trying to take her down, but he can't\n          track her fast enough. Instead he blows ENORMOUS HOLES in\n          the ceiling, a rain of plaster.\n          Gladys drops down right in front of Bob.\n\n                               BOB\n                        (struggles to cock the\n\n                          GUN)\n                    Fuck!\n          Gladys smiles sweetly before SLAPPING HIM CLEAR ACROSS THE\n\n          ROOM!\n          The shotgun clatters to the floor at Jeep's feet. He\n          snatches it up and aims it at Gladys who turns calmly to face\n          him.\n\n                              PERCY\n                    Shoot her, Jeep!\n          Jeep's about to fire, when the old lady's EYES GO ALL WHITE.\n\n          \n\n                                                                       30.\n\n          \n\n          \n\n                               GLADYS\n                         (a sickly sweet smile)\n                     You'll never save her.\n          Jeep freezes, stunned by her words, overwhelming fear\n          paralyzing him where he stands.\n\n                               PERCY\n\n                     SHOOT THE FUCKING BITCH!\n          Gladys rockets straight at him!\n          But Jeep's too afraid to move.    He clamps his eyes shut,\n          bracing himself for the end.\n\n          BLAM!   BLAM!   BLAM!\n          A RAIN OF BULLETS RIP INTO GLADYS, taking her down like an\n          animal.\n          Jeep slowly opens his eyes.   His gun's still cocked.\n          Gladys lies dead in a smoldering, bloody heap at his feet.\n          He turns to see Kyle with smoke rising from the barrel of his\n          silver plated WESTERN ARMS 45. If everyone wasn't so\n          shocked, they'd probably be wondering why this guy is packing\n          such serious heat.\n\n                               SANDRA (O.S.)\n                     Somebody help me!\n          Sandra is on the floor with her husband.     Blood pours freely\n          from his neck.\n          Kyle stares at the dying man -- a moment of hesitation --\n          then he rushes to help.\n\n                               KYLE\n                     Press your hands over the hole!\n          Sandra looks fearfully up at Kyle, at the gun still in his\n          hand.\n\n                               KYLE\n                     Don't look at me like that, lady!\n                     I'm tryin' to fuckin' help you!\n                     Now put your goddamn hands over the\n                     hole before your husband bleeds to\n                     death!\n          Obeying, she cups her hands over the hole in his neck,\n          desperately trying to stop the flow of blood leaking out\n          between her fingers. Percy scrambles over with a first-aid\n          kit and together he and Kyle get to work on Howard's neck.\n\n          \n\n                                                                    31.\n\n          \n\n          \n          A few feet away, Charlie helps Bob, bruised and bleeding, to\n          his feet.\n\n                               BOB\n                    The fuck was that?!   What the fuck\n                    was that!?\n          Across the diner, Audrey is pushed back into a booth, her\n          knees pulled tightly to her chest, shivering. Her adult\n          facade giving way to that of a frightened child\n          A DROP OF RED HITS AUDREY'S CHEEK, causing her to look up and\n          see Gladys's TRAIL OF BLOOD DRIPPING FROM THE CEILING. An\n          ungodly horror.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Kyle, Percy, Sandra and Audrey frantically carry Howard, his\n          neck bandaged, to the back of the Escalade.\n\n          \n\n          INT. ESCALADE - CONTINUOUS\n\n          Howard lies in the back seat. Sandra by his head, clasping\n          his hands in hers. Audrey by his feet. Percy rides shotgun.\n          Kyle struggles to get the key in the ignition.\n          The engine ROARS to life.\n\n          \n\n          EXT. PARADISE FALLS GAS `N' GRUB - CONTINUOUS\n\n          The Escalade fishtails onto the highway.\n\n          \n\n          INT. ESCALADE - CONTINUOUS\n\n          Kyle grips the wheel.   Picking up speed.\n\n                              KYLE\n                    How far to the hospital?\n\n                              PERCY\n                    Seventy, maybe eighty miles.\n          Kyle shoots him a look. Eighty miles?! Pedal to the floor\n          time. Audrey leans forward from the back seat.\n\n                              AUDREY\n                    What's that on the road?\n          Up ahead, the DARK CLOUDS Jeep saw earlier have finally\n          closed in, descending onto the highway like a WALL.\n\n          \n\n                                                                     32.\n\n          \n\n          \n\n                               KYLE\n                     They're fuckin' clouds!   What the\n                     fuck do they look like?\n\n                               AUDREY\n                     Not clouds. Clouds don't buzz.\n          She's right.    They're black... Undulating... BUZZING!\n\n          PING!   PING!   PING!\n          Suddenly HUNDREDS OF TINY BUGS begin to HIT the windshield --\n\n          SPLAT!\n          And that's when they realize it... Those aren't clouds.\n\n          THEY'RE FLIES!\n          The Escalade enters the SWARM. The car is PUMMELED by\n          insects, the windshield instantly covered in BLACK AND RED\n          bug guts. Driving blind!\n          The sound of FLIES SPLATTERING and BUZZING is deafening!\n          Everyone SCREAMS as hell surrounds them...\n\n          \n\n          INT. DINER BATHROOM - SAME\n\n          Bob is hunched over the steaming sink, pounding a can of\n          light beer. Jeep is leaning against the wall, looking like\n          he's about to puke or faint.\n\n                                BOB\n                     I don't understand how she was\n                     still standin' after Percy hit `er\n                     with that goddamn fryin' pan.\n                     Broke her fuckin' neck. I saw it.\n                     I swear I did.\n\n                         (BEAT)\n                     And did you see that kid's gun?\n                     The hell's he doin' with a gun like\n                     that?\n          Bob looks over at Jeep, sees him trembling.\n\n                               BOB\n                     It's okay, Jeep.   It's okay.\n          But for Jeep it's not okay.   He's hurting real bad inside.\n\n                               JEEP\n                     I couldn't pull the trigger. I\n                     froze. I saw what I needed to do,\n                     but I was afraid...\n                         (breaks down)\n                     She could've killed you!\n\n                               (MORE)\n\n          \n\n                                                                   33.\n\n          \n                              JEEP (cont'd)\n                    Or Charlie...She would've killed me\n                    if it wasn't for...\n          He can't get the words out.   Bob rests a hand on his boy's\n          shoulder.\n\n                               BOB\n                    There's nothin' to be ashamed of,\n                    Jeep.\n\n                        (BEAT)\n                    Not everybody can play the hero.\n          Before Jeep can respond, they hear the sound of the front\n\n          DOOR JINGLE.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          Bob and Jeep appear from the back, as Kyle, Percy, Audrey and\n          Sandra carry Howard into the diner, all of them stumbling,\n          gasping for air. Charlie moves in to help.\n          Percy races for the back.\n\n                              BOB\n                        (catching Percy by the\n\n                         ARM)\n                    Where you going?!\n\n                              PERCY\n                    To get my bible!\n\n                              BOB\n                    The hell you need that for?!\n\n                               PERCY\n                    Well somebody's gotta start\n                    prayin'...\n          Bob's about to respond when he hears the BUZZING.\n          Bob, Charlie and Jeep slowly approach the windows to see the\n\n          SOLID UNDULATING BLACK CURTAIN OF FLIES SURROUNDING THE TRUCK\n\n          STOP'S PERIMETER A FEW HUNDRED YARDS OUT.\n          Everything in the diner is suddenly cast in DARK RED as the\n          day's remaining sunlight filters through the swarm.\n          Apocalyptic.\n          No one breathes.\n\n                                                              CUT TO:\n\n          \n\n                                                                   34.\n\n          \n\n          \n\n          \n\n          A BLACK HAND AND A HOOK TEAR A SHIRT OPEN\n          Revealing a bloody mess of muscles and tendons chewed down to\n          the bone.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Percy and Charlie are tending to Howard. Sandra is holding\n          her husband's hand, trying to comfort him, while Audrey\n          watches from a distance with grim fascination.\n\n                              PERCY\n                        (raises a bottle of\n\n                         ALCOHOL)\n                    Okay, hold `em steady.\n\n                              CHARLIE\n                        (nods, peakish, to\n\n                         HERSELF)\n                    Oh god, please don't throw up.\n          Howard writhes as Percy pours alcohol on the wound.\n          Sandra can't help but stare at Percy's hook.\n          Meanwhile across the diner, Bob and Jeep peel back the\n          tablecloth to examine Gladys' bullet riddled corpse. Kyle\n          stands over them with Bob's shotgun trained on the body --\n          just in case.\n          Gladys is a real horror show. Bones jut out at obtuse angles\n          from her neck -- a result of the blow to her head from\n          Percy's frying pan.\n\n                              BOB\n                    She's cold as a freakin' ice cube.\n                    If I hadn't just seen her walk in\n                    here, I'd say the old bag's been\n                    dead for hours.\n          Bob rolls Gladys over, revealing her face -- her enlarged\n          mouth filled with dozens of razor sharp baby teeth.\n\n                              KYLE\n                    Well, I don't care how long she's\n                    been dead, the bitch ain't stayin'\n                    in here with us.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - A FEW MINUTES LATER\n\n          Bob, Kyle and Jeep quickly drag Gladys's body wrapped in the\n          plastic table cloth a short ways from the diner. They warily\n          eye the curtain of FLIES no more than a hundred yards out.\n\n          \n\n                                                                       35.\n\n          \n\n          \n\n                              BOB\n                    I don't get it.    Why don't they\n                    come closer?\n\n                              KYLE\n                    How the fuck am I supposed to know,\n                    man? You askin' me to explain the\n                    behavior of a motherfuckin'\n                    pestilence.\n          A CLANK and Jeep notices the old lady's car keys have dropped\n          to the ground.\n\n                              JEEP\n                        (holding up the keys)\n                    You guys!\n\n          \n\n          GLADYS' CUTLASS SUPREME\n          Its windows are completely caked with dust. The men WIPE\n          AWAY a layer of brown from the glass, allowing them to peer\n          inside the car.\n\n                              BOB\n                    You see anything?\n\n                              KYLE\n                    No Twilight Zone shit if that's\n                    what you mean.\n          Jeep slips the key into the driver's side door.     Unlocks it.\n\n                              BOB\n                    Careful. Old lady could have some\n                    kind of rabid poodle locked up in\n                    there.\n          Jeep slowly swings the door open and that's when the smell\n          hits them.\n\n                               KYLE\n                    Agh!   What the fuck is that?\n          Bob covers his nose.\n\n                                 BOB\n                    Jesus.\n          Kyle opens the passenger door, looks in.      Dark, dirty.   But\n          nothing unusual.\n\n                              KYLE\n                    Nothin' here.\n\n          \n\n                                                                    36.\n\n          \n\n          \n\n                              JEEP\n                    How `bout the trunk?\n          They go around to the BACK OF THE CAR.   Jeep slips the key\n          in.\n          The trunk POPS open, revealing a PILE OF DEAD CATS.   ROTTING.\n\n          MAGGOT INFESTED.\n          Bob quickly slams the trunk closed.    The guys are reeling\n          with disgust.\n          Kyle's trying to blow the stench from his nose.\n\n                              KYLE\n                    Bitch's got motherfuckin' dead cats\n                    in her hoopty! What the fuck is\n                    wrong with white people?!\n\n                              BOB\n                    Least now we know where that smell\n                    was coming from.\n\n                              KYLE\n                    Yeah, it was a real motherfuckin'\n                    necessity we figured that out, man.\n\n                               JEEP\n                        (sees something up the\n\n                         ROAD)\n                    Hey...\n          They turn to see HEADLIGHTS growing larger in the dim haze.\n          A POLICE CRUISER careens off the highway and skids to a wild\n          stop in front of the diner. Its ENGINE RATTLES as the dust\n          clears around it. No movement can be seen behind its bug\n          splattered windows.\n\n                              BOB\n                    Okay, now we're talkin'.\n\n                              JEEP\n                    Wait a minute. Check it out. It's\n                    LAPD. What's an LA cop doing way\n                    out here?\n          Bob and Jeep look over at Kyle.\n\n                              KYLE\n                    I'm from Nevada, man.\n          They consider the police car a moment more. See the\n          SHATTERED PASSENGER WINDOW, the BLOOD STAINS.\n\n          \n\n                                                                    37.\n\n          \n\n          \n\n                              BOB\n                    Give me the shotgun.\n          Kyle hands the shotgun over to Bob.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Charlie's face lights up when she sees the police car.\n\n                              CHARLIE\n                    Oh, thank God, the police!\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          The door of the POLICE CAR OPENS as Charlie races from the\n          diner.\n          The three men see her moving toward the car.    Jeep's face\n          goes slack.\n\n                              JEEP\n                    Charlie, wait!\n          The men begin to run toward her...\n          While out of the police car steps...\n\n          MICHAEL\n          Charlie freezes a few feet from the car when she sees those\n          piercing eyes already familiar to us. Michael looks at her,\n          as if she was exactly who he expected to see.\n          In moments Bob, Kyle and Jeep form a protective shield in\n          front of Charlie. Bob raises the shotgun.\n\n                              BOB\n                    Take one step closer and I'll drop\n                    you right here.\n          A long beat as Michael considers Bob.   Icy cold.\n\n                               MICHAEL\n                    That how you greet all your\n                    customers?\n\n                              BOB\n                    Mister, after what we've been\n                    through here today, you're lucky we\n                    didn't shoot you first and greet\n                    you later. Now let me see your\n                    teeth.\n          Michael stares at him blankly.\n\n          \n\n                                                                       38.\n\n          \n\n          \n\n                              BOB\n                    Your teeth goddamn it!       Lemme see\n                    `em!\n          Michael offers up a dangerous smile, revealing a not so well\n          kept but definitely normal set of teeth. Bob and the others\n          ease slightly.\n\n                              JEEP\n                    No, shark teeth, Pop.\n          Bob lowers the gun.\n\n                               BOB\n                    Okay... Suppose you tell us your\n                    name then.\n\n                                 MICHAEL\n                    Michael.\n\n                              BOB\n                    Sorry about all that, Michael.\n                    This old lady just went crazy\n                    inside my place here. She had\n                    these teeth. Never seen anything\n                    like `em. Practically bit a man in\n                    half.\n          Michael remains silent.       Doesn't seemed shocked in the least\n          by what he's heard.\n\n                              BOB\n                    So what are you doin' out here?\n                    Gotta say you don't exactly look\n                    like a police officer. Even one\n                    from L.A. Then again, you have to\n                    be, right? I mean, who the hell'd\n                    be crazy enough to steal a cop car?\n          Bob chuckles for a moment. When Michael doesn't respond in\n          kind, Bob falls silent. Anxious. He slowly raises the\n          shotgun again.\n          Michael sizes up this raggedy group. His gaze drifts over to\n          the loosely wrapped body in front of the diner. The plastic\n          table cloth flaps wildly in the wind. Turning back to Bob:\n\n                              MICHAEL\n                    You don't know, do you?\n\n                                 KYLE\n                    Know what?\n\n          \n\n                                                                     39.\n\n          \n\n          \n\n                              CHARLIE\n                    We don't know anything. Nothing's\n                    working here. The TV, the radio,\n                    the phone...\n          Michael just shakes his head.\n\n                              MICHAEL\n                    I'm running out of time.\n          Michael steps toward Charlie with a sense of purpose, but Bob\n          blocks his path, brandishing the shotgun.\n\n                               BOB\n                    Back off, fella...\n\n                        (BEAT)\n                    Now, I don't care if this is the\n                    second coming of Jesus fucking\n                    Christ, I say it's time for you to\n                    either get talkin' or get the hell\n                    outta here!\n          In a BLUR OF MOVEMENT, Michael rips the shotgun from Bob's\n          hands. It all happens so fast that Bob is stunned to find\n          himself holding air.\n          He's even more stunned to now have the barrel of the gun\n          pressed to the bridge of his nose. Everyone freezes.\n\n                               KYLE\n                    Easy!   Easy!\n          Michael's expression is totally calm.   Merciless.\n\n                              JEEP\n                    C'mon, Dad, tell `em you're sorry.\n                    Tell `em you were only kidding!\n          But Bob can't even speak, he's so scared.   He squeezes his\n          eyes closed.\n\n                              CHARLIE\n                    Let `em go!\n          Michael's eyes flit momentarily in Charlie's direction.\n          Considering her.\n          The diner door opens and Percy steps cautiously out with hand\n          and hook held up to show no threat. He's followed by Sandra\n          and Audrey.\n          Michael sees them, but offers no indication that he cares.\n\n          \n\n                                                                   40.\n\n          \n\n          \n\n                               PERCY\n                    Now, son, I'm sure you don't wanna\n                    go spillin' blood for no good\n                    reason in front of all these decent\n                    people, do ya? Our friend Bob here\n                    ain't worth the trouble it'd cause\n                    ya.\n\n                        (BEAT)\n                    So whaddya say `bout just lettin'\n                    `im go and then you can be on your\n                    way? Nice `n' easy.\n          But Michael doesn't seem to register this plea.   It's not\n          looking good.\n          No one BREATHES. That's when Kyle notices something out in\n          the direction of the road.\n\n          DOZENS OF TINY HEADLIGHTS APPEARING IN THE DARK HAZE.\n\n          APPROACHING.\n\n                              KYLE\n                    What the--?\n          Michael turns, sees the lights.\n\n                              MICHAEL\n                    They're here.\n          Michael whips the gun away from Bob's head and thrusts it\n          back into his hands. Bob's looks down at the gun,\n          speechless.\n\n                              MICHAEL\n                    You're going to need this.\n          Michael walks swiftly around to the trunk of the cruiser.\n          Pops it, revealing a staggering ARSENAL OF WEAPONRY.\n\n          HE BEGINS TO LOAD GUN AFTER GUN.\n          Percy stares out at the lights, eyes wide.\n\n                              PERCY\n                    Lord, have mercy.\n                        (waving back Audrey and\n\n                         SANDRA)\n                    You ladies best get back inside.\n\n                              SANDRA\n                    What is it? What's happening? Who\n                    is this man? Why's he driving a\n                    police car?\n\n                              AUDREY\n                    Shut up, mom!\n\n          \n\n                                                                    41.\n\n          \n\n          \n          Audrey pulls her mother back into the diner.\n          Michael hands an MP5 SUB-MACHINE GUN to Kyle. Another one\n          goes to Percy. Finally he places a third one in Jeep's\n          hands, who stares down at it anxiously.\n\n                               BOB\n                    Wait. I don't think that's such a\n                    good idea.\n\n                              JEEP\n                    Dad, I can handle it.\n\n                              BOB\n                        (to Michael)\n                    He's just a kid --\n\n                              JEEP\n                    I said, I can handle it!\n          Michael's eyes narrow, studying Jeep.\n\n                              MICHAEL\n                    He can handle it. He doesn't have\n                    a choice.\n          Michael pulls out twin MP5s for himself. GLOCK 9s are tucked\n          everywhere they can go. Michael tosses clip belts to the\n          men. Boxes of shotgun shells. The works.\n\n                              MICHAEL\n                    If you want to live, you'll do\n                    exactly as I say.\n          He slams the trunk closed and approaches Charlie.   He cocks a\n          Glock and hands it to her.\n\n                               MICHAEL\n                    When you fire, you keep your thumb\n                    off the slide. Don't hesitate.\n                    Don't do anything brave. There's\n                    no safety.\n          He gives her a hard look.   She nods nervously.   Trusting him\n          but not sure why.\n          Michael marches into the diner. Kyle glances quickly at the\n          others, then he bolts after Michael.\n          Percy follows.   Then Charlie.\n          Now it's only Jeep and his father left.\n\n                              BOB\n                    C'mon, Jeep. We gotta go!\n\n          \n\n                                                                          42.\n\n          \n\n          \n          And Bob rushes into the diner.\n          A moment as Jeep looks out toward the road.\n\n          THE HEADLIGHTS ARE GROWING BRIGHTER.       CLOSER.\n          He contemplates the sub-machine gun in his hands.\n\n                                  JEEP\n                     Fuck it.\n          And races after his father.\n\n                                                                     CUT TO:\n\n          A DEAD BOLT\n          Thrown.   Locking the diner door.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          Frantic activity. Kyle and Michael push a booth in front of\n          the door, sealing off the entrance.\n          Tables are turned on their sides to form makeshift shields.\n          Window blinds are snap closed.\n\n          \n\n          THE BACK OFFICE - CONTINUOUS\n          Jeep races in, locks the back door.       Then he pushes a desk in\n          front of it.\n\n          \n\n          IN THE DINER - CONTINUOUS\n          The place is transformed. Locked up tight.        The ROAR OF\n          ENGINES outside grows ever LOUDER, CLOSER.\n          Sandra huddles on the floor with Howard, his head in her lap.\n          She's running her hands gently through his hair, trying to\n          keep calm. He opens his eyes. Pale, weak from blood loss.\n\n                                 HOWARD\n                     Sandra?    What's happening?\n\n                                  SANDRA\n                     It's okay!     Everything's okay!\n          Sandra closes her eyes.        Struggling to believe it.\n          Suddenly the ELECTRICITY GOES OUT, dipping the room into\n\n          DARKNESS.\n\n          \n\n                                                                  43.\n\n          \n\n          \n          We hear CRIES OF ALARM.   TOTAL BLACK.   Chaos.\n\n                              BOB (V.O.)\n                    Jeep, get the flashlights!\n\n                              PERCY (V.O.)\n                    Everybody just stay still!\n\n                              KYLE (V.O.)\n                    Now that we're locked in here, what\n                    the fuck are we supposed to do?\n          A flicker of LIGHT. And then FLASHLIGHT BEAMS CUT THROUGH\n          THE DARKNESS...coming to rest on Michael's pale face.\n          Michael looks up at the ceiling.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - NIGHT\n\n          A hatch opens and out comes Michael followed by Bob, Percy\n          and Kyle. They quickly take their places behind the\n          \"Paradise\" sign. Pitch black surrounds them.\n          The RUMBLE OF ENGINES is gone, leaving only the RUSH OF THE\n          WIND coming up off the desert.\n\n                              KYLE\n                    Where the hell did they go?\n          Bob turns to Michael sharply.\n\n                              BOB\n                    Alright, Rambo. You got us up\n                    here. Now you mind explaining what\n                    the fuck we're fighting?\n          Michael is about to answer, when:\n\n                              PERCY\n                    Listen!\n          Over the wind, another sound becomes audible.\n          The delicate chime of a CALLIOPE.\n\n                              PERCY\n                    You hear what I'm hearing?\n\n                              BOB\n                    Yeah...The hell is that?\n          The CALLIOPE MUSIC grows louder, the melody more distinct.\n          Now we recognize the song: SANTA CLAUS IS COMING TO TOWN.\n          But instead of filling them with cheer, it fills them with\n          dread.\n\n          \n\n                                                                   44.\n\n          \n\n          \n\n                              PERCY\n                    It sounds almost like...\n\n                                 KYLE\n                    Ice cream.\n          TWO HEADLIGHTS appear in the   darkness. And sure enough, an\n          ICE CREAM TRUCK rolls slowly   toward the diner. The EERIE\n          CALLIOPE MUSIC emanates from   a speaker on its roof. It's too\n          dark to see who's behind the   wheel.\n\n                              KYLE\n                    You've got to be fuckin' kidding\n                    me.\n\n                              MICHAEL\n                    Alright. There's a safety switch\n                    on the side of your gun. Push it\n                    all the way down. Two clicks.\n          The men quickly do as they're told.\n\n                              MICHAEL\n                    Now when this starts, you hold on\n                    tight, you hear me? If you don't,\n                    you're going to blow your hand off.\n                    Understand?\n          Kyle, Bob shoot quick anxious looks at Percy.\n\n                              PERCY\n                    The fuck y'all lookin' at me for?\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Jeep faces the boarded up front door, awkwardly holding the\n          MP5, trying to assume a tough guy posture. If only he could\n          stop shaking, it might be believable.\n          Charlie and Audrey peer between the slats covering the\n          windows. The ICE CREAM TRUCK'S HEADLIGHTS fan across the\n          diner.\n          Audrey and Charlie back away from the windows.\n          Charlie stops next to Jeep. Senses him shaking. Rests a\n          hand on his arm. And that seems to help...a little.\n          Howard smiles weakly at the familiar sound of the CALLIOPE.\n\n                               HOWARD\n                    Oh, honey, listen.    It's the Ice\n                    Cream Man.\n\n          \n\n                                                                      45.\n\n          \n\n          \n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - SAME\n\n          The Ice Cream Truck pulls to a stop with its headlights\n          facing the diner.\n          Everyone aims their guns at the truck.     Tense.\n          From the Ice Cream Truck...a DARK BLOODY SHOE STEPS to the\n          ground.\n          MOVING up the long grey pant leg spotted with blood stains to\n          reveal a skeletally thin man in tattered coveralls. Say\n          hello to THE ICE CREAM MAN.\n          He looks like he's been through hell -- literally. As he\n          steps into the beams of the headlights we can see him even\n          more clearly.\n          He's tall. Too tall. His clothes don't seem to fit him.\n          And he's unnaturally thin as if he's been stretched like\n          taffy. If he got down on all fours, you might mistake him\n          for some kind of spider. He surveys the diner, the garage,\n          the roof -- assessing the situation.\n          On the roof, the men wait for something to happen.\n\n                              KYLE\n\n                        (WHISPERS)\n                    Ah, he don't look that bad.\n          The Ice Cream Man's gaze snaps up to the roof.      He heard.\n\n                                 KYLE\n                    Oh, shit.     Oh, shit.   Oh, shit.\n          That's when the Ice Cream Man's JAW UNHINGES, STRETCHING\n\n          TORTUROUSLY DOWN TO NEARLY THE MIDDLE OF HIS CHEST! ROW\n          AFTER ROW OF A RAZOR SHARP TEETH FORM with the sickening\n          sound of CRACKING OF BONES.\n          From his new mouth, the Ice Cream Man lets out an earth\n          shattering HOWL.\n          Everyone except Michael is practically hyperventilating with\n          fear.\n\n                                 MICHAEL\n                    Get ready!\n          And the ICE CREAM MAN BOLTS for the diner with STARTLING\n          SPEED! His movements aren't at all like those of a normal\n          man, but rather like some kind of HUMAN INSECT.\n          Michael aims.\n\n          \n\n                                                                       46.\n\n          \n\n          \n\n          BLAM!   BLAM!   BLAM!\n          Bullets rip into the creature's body, knocking him flat on\n          his back. Still. Arms and legs in a twisted, twitching\n          mess.\n          Michael keeps his aim.    Waits.   The CALLIOPE music continues\n          to play.\n\n                               KYLE\n                     Is that it?\n          Not even close. A RUMBLING OF ENGINES. HEADLIGHTS. A\n          freeway full of VEHICLES of every variety punch through the\n          wall of dust, racing toward the diner. They are THE\n\n          COMMUTERS.\n\n                                MICHAEL\n                     Now!   Shoot now!\n          The men let loose with FEROCIOUS FIREPOWER.\n\n          WINDSHIELDS SHATTER!    TIRES BLOW OUT!   ENGINES EXPLODE!\n          Vehicles swerve and COLLIDE!\n          DARK SHAPES bolt from the burning vehicles, scattering.\n          In the FLASH OF BATTLE we catch glimpses of them: BUSINESS\n\n          PEOPLE. CONSTRUCTION WORKERS. EVEN AN ENTIRE HIGH SCHOOL\n          FOOTBALL TEAM. All deformed by some demonic force. Many\n          mere BALLS OF FLAME drifting through the darkness.\n\n                               MICHAEL\n                     Spread out! Don't let them get\n                     close to the windows!\n          The DARK SHAPES converge on the diner from all directions.\n          They move so strangely fast it seems that their feet don't\n          actually touch the ground.\n          From the roof it's a full-on turkey shoot as the men follow\n          Michael's instructions and cut down everything in sight.\n          Their faces lighting up with each FLASH.\n          SHELL CASINGS spray from their weapons like water drops from\n          a sprinkler.\n          BODIES BURST and crumble to the dirt. The creatures don't\n          seem to be afraid of dying. Their strategy appears to be in\n          their sheer numbers.\n          With each wave, the dark figures get ever closer to the\n          diner.\n\n          \n\n                                                                        47.\n\n          \n\n          \n          ON BOB firing madly.    Then...   CLICK!   CLICK!   Oh, no.   He's\n          out of ammo.\n\n                                 BOB\n                    Shells!\n          Percy tosses him a box of shells. But Bob fumbles the catch\n          and the box slides halfway down the sloped roof.\n\n                                 BOB\n                    Fuck!\n          With the gun still in one hand, Bob reaches frantically down\n          for the ammo. Stretching... Further...\n\n          A HIDEOUSLY WOUNDED MIDDLE-AGED HOUSEWIFE CATAPULTS UP FROM\n          BELOW THE ROOFLINE! Her hair must have been in curlers\n          before most of it BURNED AWAY. Her nightdress hangs in\n          tatters off her body. Her jaw CLICKS RAPIDLY, as she\n          clatters up at Bob like a GIANT INSECT.\n          Bob tries to pull back, but he has no traction and he starts\n          to slip down toward her. She's coming fast!\n          Percy sees his friend in trouble.\n\n                                 PERCY\n                    Bob!\n          Bob swings the shotgun like a club -- CRACK! -- knocking the\n          bitch clear off the roof. But the move has made his slide\n          even faster. He drops the shotgun, trying to hold on, but he\n          can't stop!\n\n          BOB IS ABOUT TO HIT THE EDGE WHEN THE HORRID WOMAN POPS UP\n\n          RIGHT IN FRONT OF HIM!\n          She doesn't even have a chance to react as Bob does something\n          akin to a swimmer's push right off her body! WHAM!\n          The creature goes flying back off the roof and the opposing\n          force halts Bob's slide.\n\n                              PERCY\n                        (extending his hook)\n                    Grab my hand!\n          Bob reaches up and clasps Percy's hook, praying that it stays\n          on.\n          But this chick ain't finished yet. Up she comes once more.\n          Her razor sharp fingernails claw up the metal roof. SCREECH!\n\n                                 BOB\n                    Gun!\n\n          \n\n                                                                     48.\n\n          \n\n          \n          Percy tosses Bob a Glock. Fortunately this time Bob deftly\n          catches it with his free hand just as the deranged woman\n          pounces on him.\n\n                              BOB\n                        (jamming the gun in her\n\n                         MOUTH)\n                    Fuck off!\n          BLAM! BLAM! BLAM! The back of her head EXPLODES. Her body\n          goes limp. Bob struggles to push the corpse off of him.\n\n                              BOB\n                    Pull me up!\n          Percy extends his hook hand, helping Bob ascend to safety.\n\n          \n\n          INT. PARADISE GAS `N' GRUB - SAME\n\n          Hiding in the shadows... listening to sounds of WAR just\n          outside.\n          Sandra squeezes her hands over her ears.   A few feet away,\n          Audrey clutches a butcher's knife.\n          Jeep's eyes darting from one window to another.   Trying to\n          keep it together.\n          Charlie is crouched down behind the counter, holding the\n          handgun close to her pregnant belly. Distant EXPLOSIONS\n          rattle the plates on the shelves.\n          Charlie peers out from behind the counter to look at the\n          front windows.\n          Momentary FLASHES of intense light outline the closed blinds.\n          Another FLASH lights up Charlie's face.    Staring.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - SAME\n\n          Percy is swivelling left and right, firing like mad.\n\n                              PERCY\n                    Come on, motherfuckers!   Come on!\n          Closer and closer the creatures come.   Most are eviscerated\n          by the fire from the rooftop.\n\n          \n\n                                                                     49.\n\n          \n\n          \n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          ON CHARLIE staring at the window.    CLOSER.   Charlie's eyes go\n          wide as --\n          SMASH!   A DARK SHAPE crashes through the window.    Glass,\n          sand and dust swirl in.\n          Audrey and Sandra SCREAM.\n          Charlie springs up from her hiding place, gun ready.\n          Jeep spins around, pointing his gun, searching frantically\n          for the intruder. It's so dark!\n\n                              JEEP\n                    Where is it?!\n          Audrey shakes her head, tears streaming down her cheeks. She\n          looks over at her mother. Sandra's eyes are closed. It's\n          too much.\n\n                               AUDREY\n                    Mom!   Open your eyes!\n\n                               SANDRA\n                    I can't!   I can't!\n          Suddenly Howard's body is TORN AWAY from Sandra. Something's\n          got hold of his legs!   That gets Sandra's eyes open!\n\n                              SANDRA\n                        (springing after her\n\n                         HUSBAND)\n                    Howard!\n          Howard screams deliriously as he's dragged rapidly through\n          the diner toward the broken front window. He flails about,\n          desperately trying to grab a hold of something.\n          Sandra scrambles after her husband.   Reaching for him.\n\n                               AUDREY\n                    Daddy!\n          The creature reaches the window. Sandra dives for Howard's\n          outstretched hands. She has him!\n          The creature's progress is abruptly halted at the shattered\n          window.   It turns back toward Sandra -- a shaft of light\n          falling across its face, reveals:\n          A TEENAGE GIRL of about Audrey's age.   Her skin is a deathly\n          blue. Her pupils a GHASTLY WHITE.\n\n          \n\n                                                                   50.\n\n          \n          Deep human fingernail scratches have torn open the bloated\n          flesh on her arms, neck and face. The self-inflicted wounds\n          of a drug addict. Her voice is not QUITE HUMAN.\n\n                              TEENAGE GIRL\n                    See what you made me do, mother!?\n          Sandra screams, holds on.\n\n                              SANDRA\n                    No!\n          Charlie and Audrey rush to Sandra's side, grabbing Howard's\n          arms.\n          Jeep is right behind them ready to fire at the creature, but\n          with the women in the way, he can't get a clear shot. So he\n          discards the gun and grabs Howard's arms.\n          Howard screams as his body is torturously stretched.   A human\n          tug-of-war.\n\n          ON HOWARD'S FEET -- TWO MORE SETS OF SINEWY MUSCLE AND BONE\n\n          CLAWS REACH THROUGH THE WINDOW AND GRAB HIS LEGS.\n          Howard's body lurches further out the window.\n\n                              SANDRA\n                    Howard!\n          Howard's torso is almost entirely out the window. Charlie\n          daringly reaches for Howard's belt, desperate to gain\n          leverage.\n\n          ANOTHER DISFIGURED HAND PUNCHES THROUGH THE BLINDS AND LOCKS\n\n          ONTO CHARLIE'S ARM!\n          Charlie screams as she's yanked painfully toward the window,\n          losing her grip on Howard's belt.\n          Through the broken window, she sees the face of a RAGGEDY\n          LOOKING MAN. He smiles at her like a father coming home to\n          his baby girl.\n\n                              RAGGEDY MAN\n\n                        (SWEETLY)\n                    There you are!\n          And he starts to pull her arm even harder...Other creatures\n          suddenly notice her as well, focusing their attack as if she\n          alone was their target.\n          Jeep immediately let's go of Howard and dives for Charlie,\n          grabbing her free arm just before she's pulled through.\n\n          \n\n                                                                      51.\n\n          \n\n          \n          Without the help, Audrey and Sandra can't hold on any longer.\n          Howard is ripped from of his family's hands and out the\n          window.\n\n                                 AUDREY\n                    Daddy!\n\n          \n\n          EXT. PARADISE GAS `N' GRUB - ROOF - SAME\n\n          The tide is turning. The men seem to have gotten their game\n          on and the dark shapes are starting to pull back.\n\n                              KYLE\n                    They're running!      We got `em!\n          Kyle turns happily to Michael.     Gone.   Kyle looks around the\n          roof with alarm.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Only a few more inches separate Charlie and certain death\n          through the window. Jeep's losing her!\n\n          A FLASH OF STEEL.    SCHING!\n          Charlie and Jeep fall back into the diner, the claw like\n          hands still grasping Charlie's arm no longer attached to\n          their owners.\n          Michael leaps over her, a butcher's knife in one hand, a\n          machine gun in the other. He lights up everything in his\n          path. The window blinds become a WALL OF FIRE. Creatures\n          SCREECH and flee into the night, having successfully taken\n          their first victim.\n          Charlie flings the severed appendages off her and she and\n          Jeep scoot away from the window.\n          Hysterical, Sandra tries to push past Michael. She's going\n          after Howard. He intercepts her before she can make it out.\n\n                                 SANDRA\n                    Let me go!     He's alive!\n          Sandra slaps at him frantically as he carries her away from\n          the window and thrusts her down into a back booth.\n\n                              SANDRA\n                    He's alive!\n\n                                 MICHAEL\n                    No...     Not anymore.\n          Sandra breaks down.\n\n          \n\n                                                                         52.\n\n          \n\n          \n          As Charlie climbs slowly to her feet -- a sudden pain.       She\n          clutches her belly. Winces.\n          Jeep catches her arm to steady her.\n\n                              CHARLIE\n\n                        (RECOVERING)\n                    I'm okay. I'm fine.\n          She glances back at Michael.       He's watching her.   Those eyes.\n\n                                 CHARLIE\n                    Thanks...\n\n                              MICHAEL\n                    I told you not to do anything\n                    brave.\n          Charlie doesn't know how to respond.      She's about to say\n          something when --\n          Kyle rushes into the room.       A smile on his face.\n\n                              KYLE\n                    We got `em runnin'!\n          Then Kyle notices the broken window, takes in the room, his\n          excitement falling.\n\n                              KYLE\n                    Where's Howard?\n          No one responds.   Sandra and Audrey are huddled together.\n          Crying.\n          Bob and Percy follow Kyle in, still shaking from the\n          adrenaline.\n\n                              MICHAEL\n                    Someone needs to be on the roof.\n\n                                 KYLE\n                    I'll go.\n          Bob grabs Kyle's arm.\n\n                              BOB\n                    Hold on.\n                        (approaches Michael,\n\n                         DETERMINED)\n                    You better start talking.\n          All eyes on Michael.    These people want answers.      Finally:\n\n          \n\n                                                          53.\n\n          \n\n          \n\n                              MICHAEL\n                    The first time God lost faith in\n                    Man he sent a flood. The second\n                    time...he sent what you see\n                    outside.\n          Everyone takes that in for a moment, then:\n\n                              PERCY\n                    You sayin' this is the\n                    Apocalypse...?\n\n                               MICHAEL\n                    I'm saying this is an\n                    extermination.\n\n                        (BEAT)\n                    Those things out there are vessels.\n                    The Possessed. The weakest willed\n                    are the easiest to turn.\n\n                              KYLE\n                    Possessed by what?    Demons?\n\n                              MICHAEL\n                    No...by angels.\n          That silences the room.\n\n                              PERCY\n                        (pulls out his bible)\n                    Son, I don't know what bible you\n                    been readin', but in my version,\n                    the angels are the good guys.\n          Michael looks squarely at Percy.\n\n                              MICHAEL\n                    That's where your book is wrong.\n\n                              SANDRA\n                    How come you know so much about\n                    them?\n\n                              MICHAEL\n                    I know because until last night, I\n                    was on their side.\n\n                              JEEP\n                    You mean you're...\n          Michael considers Jeep, then:\n\n                              MICHAEL\n                    Not anymore...\n\n          \n\n                                                                     54.\n\n          \n\n          \n\n                              BOB\n                    Right and yesterday I was the\n                    fuckin' Easter Bunny. You know,\n                    fuck this. I don't even believe in\n                    God.\n\n                              MICHAEL\n                    That's fine, because He doesn't\n                    believe in you either.\n          Bob stares at Michael, uncertain how to respond to that.\n\n                              PERCY\n                    C'mon, Bob. Have you looked\n                    outside recently? Those aren't\n                    exactly our regular customers out\n                    there.\n\n                              BOB\n                    How do we know he didn't bring them\n                    here himself?\n\n                              CHARLIE\n                    He brings them here and then he\n                    saves us from them? You're a\n                    genius, Bob.\n          Bob falls silent, confounded.\n          Audrey hesitantly approaches Michael.\n\n                              AUDREY\n                    So you're here to protect us?\n\n                               MICHAEL\n                    Not you...\n                         (looks at Charlie)\n                    Her.\n          Charlie reacts in shock, as all eyes are suddenly on her.\n\n                               CHARLIE\n                    Me?!   Why me?!\n\n                              MICHAEL\n                    Because your child is the only hope\n                    humanity has of surviving.\n          In response to that, Charlie does the only thing someone can\n          do when told such a thing. She LAUGHS.\n\n                               CHARLIE\n                    No way!\n          But Michael isn't joking and Charlie's laughter becomes\n          genuine fear.\n\n          \n\n                                                                  55.\n\n          \n\n          \n\n                              CHARLIE\n\n                        (STUNNED)\n                    Jesus Christ...\n\n                               MICHAEL\n                    Exactly.\n          Jeep stares at Charlie, as if suddenly his entire life is\n          starting to make sense.\n\n                              JEEP\n                    You're sayin' she's the mother of\n                    the Messiah?\n\n                              BOB\n                    Wait a minute, isn't Mary supposed\n                    to be a vi--\n\n                              CHARLIE\n                    Go fuck yourself, Bob!\n\n                              PERCY\n                    Makes you wonder about Mary.\n\n                              CHARLIE\n                        (approaches Michael, panic\n                         setting in)\n                    Look, this is not possible! I'm\n                    just a waitress! I'm nobody! I\n                    can't give birth to the Savior of\n                    Mankind!\n                        (and finally)\n                    I don't even own a car!\n\n                              MICHAEL\n                    None of that matters anymore.\n                    Either your child lives or Mankind\n                    dies.\n\n                              KYLE\n                    So what, we're supposed to just\n                    hold those things off until Mary\n                    over there squeezes one out?\n\n                              MICHAEL\n                    That's right.\n\n                              CHARLIE\n                    That can't be. I'm only eight\n                    months pregnant.\n\n                              KYLE\n                    Oh we're fucked.     We are so fucked!\n\n          \n\n                                                                      56.\n\n          \n\n          \n\n                              SANDRA\n                    How are we supposed to survive here\n                    for a month?\n\n                              MICHAEL\n                    We won't have to...\n          At this Charlie goes white, the realization hitting her.\n\n                              CHARLIE\n                    It's coming soon, isn't it?\n          Michael nods.\n          Charlie sways on her feet.   Jeep rests a hand on her\n          shoulder, steadying her.\n          With a CLANK Michael re-arms his weapon, turns to the group\n          with finality.\n\n                               MICHAEL\n                    If you want to live you'll do what\n                    I say. This first attack was a\n                    test of our strength. The next one\n                    will be a test of our weakness.\n\n                        (BEAT)\n                    Something much worse is on its way.\n          Everyone exchanges terrified looks.   Finally, Kyle steps\n          forward.\n\n                              KYLE\n                    Okay, what's your plan?\n\n                              MICHAEL\n                    We'll keep watch on the roof in\n                    shifts of two. Jeep, go get some\n                    tools. We need to close up this\n                    window before somebody else goes\n                    out.\n          Jeep looks anxiously at Charlie, silent, scared, and then he\n          follows after Michael, leaving Charlie to stare at the\n          SHATTERED WINDOW, the blinds flipping wildly in the wind.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - ROOF - LATE NIGHT\n\n          Percy and Kyle keep watch, rifles at their sides. They're\n          wrapped up from head to toe in blankets to protect them from\n          the cold and the flies.\n          Percy scans the horizon.   Momentary SPECTRAL FLASHES dot the\n          darkness.\n\n          \n\n                                                                   57.\n\n          \n\n          \n\n                               PERCY\n                    They're out there. Sons of\n                    bitches. I can feel `em.\n\n                        (BEAT)\n                    Damn it's cold!\n          Percy makes the unconscious motion of rubbing his \"hands\"\n          together to keep them warm. Kyle notices. Sees the dog\n          tags.\n\n                              KYLE\n                    You were in the Army?\n\n                              PERCY\n                    Navy, two tours. But the second\n                    one didn't work out so well, so I\n                    didn't get to go back for a third.\n                    Suppose that makes me lucky in a\n                    way. Served with Bob, you know.\n                    That's how I ended up in this\n                    place.\n\n                              KYLE\n                    What was it like?    Being in a war?\n\n                               PERCY\n                    Dark.   Like this.\n          Kyle nods. Scared. He takes out his 45.     Nervously switches\n          it from hand to hand.\n\n                              PERCY\n                    So what's with that gun?\n\n                               KYLE\n                    What?\n\n                              PERCY\n                    Your piece. The one you killed\n                    grandma with. Don't reckon it's\n                    for huntin' buck.\n\n                              KYLE\n                    No. I uh -- keep it for\n                    protection.\n\n                              PERCY\n                    Protection from what?\n\n                              KYLE\n                    From people.\n          Percy looks at him skeptically.\n\n                               PERCY\n                    People.\n\n          \n\n                                                                     58.\n\n          \n\n          \n\n                              KYLE\n                    Yeah, people who might try to give\n                    me a hard time, you know?\n\n                              PERCY\n                    Just regular people or uh...\n\n                              KYLE\n                    Yeah, well, no, not regular,\n                    regular people.\n\n                              PERCY\n                    Irregular people then.\n\n                               KYLE\n                    I'm talkin' people whose job it is\n                    to give other people a hard time.\n                    Kinda person who doesn't get enough\n                    fiber in their diet, you know what\n                    I'm sayin?\n\n                              PERCY\n                    So it's a work thing, is it?\n\n                                KYLE\n                    Exactly.    Strictly business.\n\n                              PERCY\n                    This business of yours... You like\n                    it?\n          Kyle's eyes narrow.\n\n                              KYLE\n                    Who the fuck are you to be sweatin'\n                    me, man? I got my reasons for\n                    doin' what I do.\n          Percy just stares at him, penetrating.     Finally:\n\n                              PERCY\n                    When I was a kid my father would\n                    sit by my bed every night before\n                    I'd go to sleep and he'd say to me,\n                    Percy, if you don't wake up\n                    tomorrow, if it turns out that\n                    today was your last day on earth,\n                    would you be proud of what you've\n                    done in this life? Cuz if you\n                    ain't, then you better start\n                    gettin' square.\n          Kyle looks at Percy, fear in his eyes, then he turns back to\n          the darkness...and the evil that surrounds them.\n\n                                                                CUT TO:\n\n          \n\n                                                                     59.\n\n          \n\n          \n\n          \n\n          THE SILVER ZIPPO\n          rolls between dirty fingers.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - NIGHT\n\n          Bob plays with his trusty zippo with one hand and grills up\n          some steaks with the other. He pauses in his cooking every\n          few moments to take a slug from a can of beer. Can't get it\n          down fast enough.\n          Sandra sits at the counter across from him, staring at a\n          prescription bottle tipped in front of her, pills spread\n          around.\n          Bob glances over, sees the devastation in her eyes. He pulls\n          another can of beer from underneath the counter, pops it and\n          places it in front of her.\n\n                              BOB\n                    On the house.\n          She looks up at him.    Smiles weakly.   Takes a sip.\n\n                                 SANDRA\n                    Thanks.\n\n                              BOB\n                    You hungry?\n\n                              SANDRA\n                    Couldn't eat if my life depended on\n                    it.\n\n                              BOB\n                    Well I figure just cuz the world's\n                    coming to an end, it doesn't mean a\n                    man's gotta starve. All I can say\n                    is thank heavens they left the gas\n                    on.\n          Sandra takes another sip of beer.   Considers it.\n\n                              SANDRA\n                    Never much cared for beer.\n                    Howard's the beer drinker in the\n                    family.\n          The moment the words leave her mouth, the grief hits her\n          again. She gathers up some pills from the counter, tosses\n          them back and downs her beer like there's no tomorrow. This\n          is a battle she's losing.\n\n          \n\n                                                                  60.\n\n          \n\n          \n          Meanwhile in a booth across the diner, Audrey is fiddling\n          with Percy's old radio. Back and forth on the dial.\n          Listening for anything. Nothing but STATIC.\n          Up at the front of the diner, Jeep silently helps Michael\n          nail broken table planks across the shattered window. He\n          eyes the strange tatoos running down Michael's arms, the two\n          jagged wounds visible above his shirt line.\n\n                              JEEP\n                    What did you do...you know, before\n                    you came here...?\n          Michael considers the question a beat, then:\n\n                              MICHAEL\n                    I was a soldier, a general, in His\n                    army.\n\n                              JEEP\n                    Well, what changed?   What made you\n                    leave?\n\n                              MICHAEL\n                    I was given an order I didn't\n                    believe in...\n                        (off Jeep's look:)\n                    He lost faith. I hadn't.\n          Michael drives the last nail into place, securing the window.\n\n                              JEEP\n                    So what happens to you...after this\n                    is over?\n          Michael pauses a beat, as if unsure how much to say, then:\n\n                              MICHAEL\n                    Sometimes we have to face the thing\n                    we fear the most in order to be\n                    free of it.\n          Michael picks up his gun.\n\n                              MICHAEL\n                    It's almost time for the next\n                    shift.\n          Michael heads for the roof, leaving Jeep to stare after him,\n          deep in thought.\n\n                                                            CUT TO:\n\n          \n\n                                                                   61.\n\n          \n\n          \n\n          \n\n          EXT. PARADISE FALLS GAS `N' GRUB - DAWN\n\n          The faintest glint of sunlight through the dark red dusty\n          haze. A new day has forced itself into existence.\n          TITLE:   \"December 24th - 6:05am\"\n\n          \n\n          EXT. PARADISE GAS `N' GRUB - ROOF - MORNING\n\n          Michael is searching the horizon in front of the diner for\n          movement. His expression focused, determined.\n          On the other side of the roof, Bob keeps watch, struggling to\n          stay awake. The beer taking over. His eyes droop closed.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Sandra awakens with a start.\n\n                                 SANDRA\n                     Howard?\n          But Howard's not there. And everyone else in the diner is\n          still asleep. The drugs have started to wear off... and her\n          fear is returning.\n\n          \n\n          INT. DINER BATHROOM - CONTINUOUS\n\n          Sandra splashes water on her face.   Stares at herself in the\n          mirror. A living wreck.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - BACK OFFICE - CONTINUOUS\n\n          Sandra steps out of the bathroom.\n\n                               VOICE\n                         (a whisper)\n                     Sandra...\n          Sandra freezes.\n\n                               SANDRA\n                     Who's there?\n          A beat then:\n\n                                 VOICE\n                     Sandra...\n          Sandra spins around.    Searching.\n\n          \n\n                                                                      62.\n\n          \n\n          \n\n                                 SANDRA\n                    Howard?     Is that you?\n          It sure sounded like Howard.\n\n                                 VOICE\n                    Help me...     Please...\n          This time, it's clear where the voice is coming from.      Sandra\n          turns to face the BACK DOOR. A desk blocks it.\n          Sandra ever so slowly approaches the door.\n\n                              VOICE\n                        (from behind the door)\n                    Help me. Sandra...\n          Sandra is stricken.    What the hell is she going to do?\n          That's when Sandra notices the TRANSOM WINDOW above the door.\n          She climbs onto the desk and stretches up until she can see\n          out.\n\n          SANDRA'S POV:\n          Howard. Her husband. Ten feet away from the door.     NAILED\n\n          TO AN UPSIDE-DOWN CROSS.\n          But wait. It gets worse. His skin is covered with horrible\n          black boils. And even worse than that. Howard's boils are\n          breathing.\n          Sandra goes slack with horror.\n\n                              HOWARD\n                    Help me, please!\n          Howard's torn open shirt reveals the BREATHING PUSTULES\n          covering his body. He writhes in slow, excruciating agony.\n\n                                 SANDRA\n                    Howard!\n          Sandra scrambles down off the desk and frantically pushes it\n          away from the door. She's reaching for the dead bolt when\n          Audrey and Kyle appear in the doorway.\n\n                                 AUDREY\n                    Mom!\n          Kyle races to restrain Sandra.\n\n                                 SANDRA\n                    Let me go!     He's alive!\n\n          \n\n                                                                     63.\n\n          \n\n          \n          She struggles against him, throwing a wild elbow that tags\n          Kyle in the face. Down he goes.\n          Sandra is about to open the door when Audrey pounces on her.\n\n          \n\n          INT. PARADISE GAS `N' GRUB - SAME\n\n          The SHOUTING from the back office awakens the rest of the\n          sleepers. Percy springs up. Charlie is shaking Jeep.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - SAME\n\n          The ROAR OF WIND ripping off the plain is all that can be\n          heard. ON BOB as his head drops down with drunken fatigue.\n          Sleep.\n\n          RISING OVER HIM TO SEE...\n          Howard nailed to the upside-down cross below.\n\n          \n\n          INT. PARADISE GAS `N' GRUB - BACK OFFICE - SAME\n\n          Sandra and Audrey are locked in battle. Sandra slaps Audrey\n          hard. Audrey stumbles over Kyle and hits the floor. Percy\n          appears in the doorway.\n          Now is her last chance. Sandra whips open the back door and\n          that's when the world hits SLOW MOTION.\n          Howard is there.    A few feet away.   Alive.\n          Sandra races toward him.    Just behind her comes Percy.\n\n                                SANDRA\n                    Howard!\n          And that's when the speed ACCELERATES TO NORMAL --\n          -- and the boils covering Howard's body explode -- spraying\n          streams of dark fluid toward Sandra --\n          -- just at the moment Percy spins around her, shielding her\n          from the spray, which hits him in the back. But he's not\n          stopping. Percy pushes Sandra back into the diner, the door\n          SLAMMING closed behind them.\n          Percy releases Sandra, letting her stumble hysterically into\n          the room. Kyle and Jeep grab her, forcing her to the ground.\n          But she's not fighting anymore.\n          Charlie turns to look at Percy who is still standing with his\n          back to the door, breathing heavily.\n\n          \n\n                                                                        64.\n\n          \n\n          \n\n                                 CHARLIE\n                       Percy?\n          He takes a step forward, then falls to ground.\n          The entire back side of his body is gone.      Burned away.\n\n                                                                CUT TO:\n\n          \n\n          A SHEET\n          covering a body.\n\n          \n\n          EXT. PARADISE FALLS GAS `N' GRUB - FREEZER ROOM - DAY\n\n          Percy's body lies covered on the table. Bob stares ruefully\n          at his dead friend. A broken man. Tears stream down his\n          face. He rolls the Zippo between his fingers.\n          Jeep watches his father from the doorway.\n\n                                 JEEP\n                       We should get back out there...\n\n                                 BOB\n                       Just gimme another minute with him,\n                       okay?\n          Jeep nods, quietly leaves his father at the side of his dead\n          friend.\n\n                                                                CUT TO:\n\n          \n\n          SANDRA'S FACE\n          Catatonic.\n\n          \n\n          INT. PARADISE FALLS GAS `N' GRUB - A SHORT WHILE LATER\n\n          Michael and Bob are tying Sandra to a chair. Not like it\n          looks like she's capable of going anywhere, but you never\n          know.\n          Across the diner, Charlie eyes Michael cautiously. Michael\n          never goes for more than a few moments without looking up at\n          her. It's not lecherous. More like a protective father\n          making sure his child hasn't strayed too far.\n          In a booth, Audrey watches, red-eyed, as Michael restrains\n          her mother. Then she returns her attention to Percy's radio.\n          Tuning. Trying to find something, anything in the STATIC.\n\n          \n\n                                                                       65.\n\n          \n\n          \n          She brings her ear up close.      Wait.   Is that a VOICE?\n          She adjusts the antenna, trying to bring the signal into\n          focus. CLEARER.\n\n                                 AUDREY\n                     Hey...\n          CLEARER.   Yes.   It's a VOICE!\n\n                               AUDREY\n                     Hey! You guys, I think I got\n                     something here!\n          Everyone drops what they're doing and quickly gathers around\n          the radio.\n\n          THROUGH THE HAZE OF STATIC, A GRAVELY, TIRED VOICE.      STRAINED\n\n          BEYOND BELIEF. BUT STILL BROADCASTING.\n\n                                RADIO VOICE\n                     ... battling has been fierce. The\n                     numbers of casualties are unknown\n                     but all indications are that they\n                     must be unimaginably large.\n\n                         (BEAT)\n                     If you're just joining us, we're\n                     getting some of the first bits of\n                     good news, if you can call it that,\n                     since this apocalypse began just\n                     twenty-four ago. A human militia\n                     has formed on the outskirts of Las\n                     Vegas and has begun to engage the\n                     enemy. Also down in the Four\n                     Corners area, we've been receiving\n                     unconfirmed reports of another\n                     resistance force gathering in Red\n                     Rock National in the northern\n                     Mojave Desert area.\n\n                               JEEP\n                     Red Rock...\n\n                               CHARLIE\n                     That can't be more than an hour up\n                     the highway from here.\n\n                               AUDREY\n                     Does that mean we can leave?\n\n                                 MICHAEL\n                     No.    We're not going anywhere.\n\n                               BOB\n                     What the hell are you talkin'\n                     about? This is our chance!\n\n          \n\n                                                                   66.\n\n          \n\n          \n\n                                  MICHAEL\n                       We can't risk being on the move\n                       when the child comes. It's too\n                       dangerous.\n          Bob looks over at Charlie, defeated. She shakes her head,\n          anger building. She sweeps some plates off the counter and\n          races for the bathroom.\n\n                                 RADIO VOICE\n                       ... And as we fight this new\n                       enemy, may God give us the strength\n                       to survive and show mercy for those\n                       of us who are already lost...\n\n                                                             CUT TO:\n\n          \n\n          A CIGARETTE\n          being lit.\n\n          \n\n          INT. DINER BATHROOM - NIGHT\n\n          Charlie stands at the sink, cigarette to her lips, water\n          running, stealing a private moment. She takes a deep drag,\n          feels the smoke filling her lungs, defiant.\n          Then she catches a look at herself in the mirror, runs her\n          hand along the curvature of her belly. Tears well up in her\n          eyes, fear and anger overtaking her.\n          She stamps out the cigarette in a fit of frustration.\n\n          \n\n          INT. DINER - A SHORT WHILE LATER\n\n          It's quiet. DRIFTING past sleeping figures to find Charlie,\n          wide-awake, sitting at a booth, lost in thought.\n\n                                 JEEP (O.S.)\n                       Guess it's your turn not to sleep.\n          Charlie looks up to see Jeep sit down across from her.\n\n                                   CHARLIE\n                       Hey...\n          Jeep sees the strain on her face.\n\n                                   JEEP\n                       You okay?\n\n          \n\n                                                                     67.\n\n          \n\n          \n\n                              CHARLIE\n                    You mean besides the fact that I\n                    just found out that I'm the mother\n                    of the Messiah?\n          Jeep smiles, nods.\n\n                               CHARLIE\n                    Crazy thing is...I didn't want this\n                    baby. I even went down to the\n                    clinic, you know that?\n                        (off Jeep's reaction:)\n                    I remember sitting there in the\n                    waiting room, absolutely sure I was\n                    doin' the right thing...And that's\n                    when the feeling started. Like I\n                    was falling into the deepest,\n                    darkest hole imaginable. I\n                    couldn't breathe, I couldn't speak.\n                    I kept thinking this must be what\n                    death is like. And when finally\n                    they called my name, I ran.\n\n                        (BEAT)\n                    For a while after that I tried\n                    pretending that it was just cold\n                    feet, that I could go back if I\n                    wanted to, that I could decide to\n                    end it like I'd planned. Then I'd\n                    start to have that feeling again\n                    and I knew I didn't have a choice.\n                    Somehow this had already been\n                    decided. And it made me hate this\n                    thing that's been growing inside\n                    me.\n          A long beat, as Jeep considers her, then:\n\n                              JEEP\n                    You shouldn't say things like that,\n                    Charlie. It isn't right. You'll\n                    get through this. I know you will.\n          She turns to him, the bitterness overtaking her:\n\n                              CHARLIE\n                    How come you have so much faith in\n                    me, Jeep? God knows I've never\n                    given you or anybody else a reason\n                    to. Or is it that you just can't\n                    find any other hard-luck case to\n                    follow around?\n          Jeep's face hardens.   He gets up.   Hurt.   Frustrated.\n\n          \n\n                                                                     68.\n\n          \n\n          \n\n                              JEEP\n                    You know, you're not the only who's\n                    suffered, okay? Let me know when\n                    you stop feeling sorry for\n                    yourself.\n          And with that, Jeep walks away, leaving Charlie to stare\n          after him, disturbed and surprised by his response.\n\n                                                            CUT TO:\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - LATE AFTERNOON\n\n          Sand and wind.    The INVISIBLE SUN is sinking.\n          Kyle and Audrey are bundled together on the roof, keeping\n          watch. Kyle is showing her how to hold the MP5.\n\n                              KYLE\n                    ...Then you just flip this --\n          Audrey flips the safety.\n\n                              AUDREY\n                    Yeah, I got it. All the way down.\n                    Two clicks.\n          She points the gun out into the haze like she's been holding\n          one all her life.\n          Off Kyle's surprised look:\n\n                              AUDREY\n                    Dated this guy last summer. A\n                    marine. Had a thing for guns.\n                    Parents hated him.\n\n                              KYLE\n                    I bet they did.\n          After a moment, Audrey switches the safety back on.   Hands\n          the gun over to Kyle.\n          Audrey stares into the red nothingness surrounding them. Her\n          expression growing distant. She seems to have aged years\n          overnight.\n\n                              AUDREY\n                    My parents hate everything I do.\n                    That's why we were moving.\n\n                                KYLE\n                    Yeah?\n\n          \n\n                                                                         69.\n\n          \n\n          \n\n                              AUDREY\n                    They thought a more \"wholesome\"\n                    environment would help me \"change\n                    my ways.\" So fucked up. Only\n                    reason they care at all is cuz they\n                    don't want to be embarrassed in\n                    front of their friends at the\n                    country club.\n          Kyle considers her thoughtfully.\n\n                              KYLE\n                    The only time my old man ever paid\n                    attention to me was when I was\n                    doing somethin' bad. So you know\n                    what I did?\n\n                               AUDREY\n                    What?\n\n                              KYLE\n                    I got really good at being bad.\n          She smiles at this confession.    Can obviously relate.   He\n          wipes a tear from her cheek.\n          She leans in.   Kisses him.   Passionately.   Desperately.\n          His hands trace over her body.\n          She claws at him. Her passion growing out of control.\n          She's practically devouring him. Kyle can barely keep up.\n          It's like something else beyond sensual need has taken over.\n          She moves down his chest.     Further.   Kyle leans his head\n          back. Further.\n          Just then the SPOT LIGHTS that illuminate the roof sign come\n          to life.   The young couple stops to look up at the brilliant\n          red word \"Paradise\" illuminated above them.\n          Down below, the gas pumps LIGHT UP.      The station's\n          FLUORESCENTS flicker on.\n\n          \n\n          INT. PARADISE FALLS GAS `N' GRUB - SAME\n\n          All at once the entire diner COMES BACK TO LIFE.\n          The jukebox WHIRS ON, filling the room with Merle Haggard's\n          \"I'm a Lonesome Fugitive\".\n          Bob's TV glows with bright rolling STATIC.\n          The electric fan spins on above the grill.\n\n          \n\n                                                                    70.\n\n          \n\n          \n          Jeep and Michael move to look through the slats at the\n          window.\n          Charlie is giving Sandra some water through a straw.\n          Bob wanders in, squinting at the sudden presence of light.\n\n                              BOB\n                    We back in business?\n\n                              MICHAEL\n                    I don't think so.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - SAME\n\n          The truck stop is lit up like a Christmas tree. If you\n          didn't know better, you might mistake the place for business\n          as usual. Kyle and Audrey stand on the roof, taking in the\n          dramatic change.\n\n                              AUDREY\n                    Is it over?\n\n                              KYLE\n                    I don't know.\n          HEADLIGHTS appear on the highway.\n\n                              KYLE\n                        (raising his gun)\n                    You better get downstairs.\n\n                              AUDREY\n                    No, I can handle it.\n          Kyle stares at Audrey's beautiful, determined face.    Then he\n          pulls out his silver 45.\n\n                              KYLE\n                        (handing her the gun)\n                    Just in case.\n          The headlights become a FAMILY MINIVAN careening wildly off\n          the highway to stop at the pumps.\n\n                                 KYLE\n                    Get ready.\n          They aim their weapons at the vehicle.\n          A well dressed MAN in his mid-thirties jumps out of the car.\n          He looks around nervously, scared. Then, seeing that the\n          coast is clear, he offers a calming wave to his WIFE and\n          YOUNG BOY who wait anxiously for him inside the car.\n\n          \n\n                                                                     71.\n\n          \n\n          \n          He races around to the gas pump.\n\n                              KYLE\n                        (lowering his gun)\n                    Wait a minute.\n\n                              AUDREY\n                    Kyle, are they...\n          A distant SCREECH from behind. Kyle and Audrey spin to look\n          out over the back side of the diner.\n          AN ARMY OF DARK SHAPES are swarming in fast.\n          Kyle looks urgently back at the family.    The father lifts the\n          pump. Flips the lever.\n\n                              KYLE\n                    It's a trap. They saw them coming\n                    and turned on the lights. It's a\n                    fucking trap!\n          Kyle and Audrey wave their arms frantically at the family.\n\n                             KYLE AND AUDREY\n                    Hey! Get back in your car!      It's a\n                    trap!\n          But down below, the man can only hear the sound of RAGING\n          WIND as he pumps the gas.\n          Kyle fires his gun in the air.   BLAM!   BLAM!     BLAM!\n          At the sound of gunfire, the man looks quickly up to the\n          roof.   His family heard it too and they start to SCREAM TO\n          HIM. The man can only see silhouettes in this light, but\n          he's not waiting around to see if it's friend or foe.\n          Audrey watches in horror as the dark shapes reach the diner.\n\n                              AUDREY\n                    They're not gonna make it.\n          The father dashes to the driver's side.    He throws open the\n          door.\n          But he's too late. He looks over his shoulder just in time\n          to see a BLUR OF MOVEMENT RUSHING AT HIM.\n          His BLOOD PAINTS the car windows.\n          Kyle raises his MP5 to fire upon the dark shapes that\n          surround the vehicle like swarming insects.\n          The wife and boy scream hysterically as they are torn from\n          the vehicle by skeletal hands.\n\n          \n\n                                                                      72.\n\n          \n\n          \n\n                              AUDREY\n                        (pushing his barrel down)\n                    Wait! You'll hit them too!\n          So Kyle makes a desperately courageous play. He leaps onto\n          the roof's sloped overhang -- sliding fast -- he drops to the\n          ground in front of the diner.\n\n                              AUDREY\n                    Kyle!\n          Kyle charges the dark mob. Creatures peel away from the\n          woman and boy to confront Kyle head-on.\n          He lets loose with a rain of bullets, eviscerating everything\n          that comes at him.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          The group gathered at the window sees Kyle racing out toward\n          the pumps.\n\n                               BOB\n                    Jesus Christ, what the hell is that\n                    boy doin'!\n\n                              CHARLIE\n                    We have to get `im back in here!\n          Bob springs into action.   Pushes the booth away from the\n          front door.\n          The sound of a gun COCKING.\n          Bob looks over to see Michael pointing a gun at his head.\n\n                              MICHAEL\n                    Don't. You open that door and we\n                    could all be dead.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          The Possessed move in from all sides, but Kyle is remarkably\n          agile, dropping one after another in a stunning display.\n          He closes in on the family, blasting back the creatures\n          huddled around them.\n          He finds the YOUNG BOY curled up with his hands protectively\n          covering his face.\n          Kyle swoops down and gathers the boy into his arms.\n\n          \n\n                                                                     73.\n\n          \n\n          \n\n                                 KYLE\n                    I got you!\n          Kyle moves on to the mother. But something odd is happening.\n          The creatures have stopped coming at him.\n          In fact, they're just standing there watching him.   Waiting.\n          Kyle freezes.   CLOSE ON HIM as he senses something terribly\n          wrong.\n\n                                 YOUNG BOY (O.S.)\n                    Mister...\n          Kyle looks over at the boy in his arms.   GHOSTLY WHITE EYES\n          stare back at him.\n\n                               YOUNG BOY\n\n                        (WHISPERS)\n                    Fooled ya.\n\n          A FLASH OF TEETH AS KYLE'S THROAT IS TORN OUT.\n          Kyle drops to his knees.\n          Up on the roof, Audrey watches helplessly as Kyle falls.\n\n                                 AUDREY\n                    Kyle!\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Bob kicks over a table in disgust.\n\n                              BOB\n                    Damn it all to hell!\n\n                               CHARLIE\n                    Oh, no.   Audrey...\n          Out the window they see Audrey drop down from the roof and\n          run towards Kyle.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          The young boy stands over Kyle, silently watching the life\n          drain from his body.\n          The boy looks up to see Audrey approaching fast. Tears\n          suddenly appear in his eyes. He opens his arms pleadingly to\n          her.\n\n          \n\n                                                                      74.\n\n          \n\n          \n\n                                 YOUNG BOY\n                    I'm sorry!     I didn't mean to!\n\n                                 AUDREY\n                    Fuck you!\n          Audrey raises the 45 and ...     CLICK.   CLICK.   CLICK.\n          She keeps pulling the trigger.    Nothing.\n          The boy's tears stop instantly. He looks at her with an\n          eerie calm for someone so young.\n\n                              YOUNG BOY\n                    You're gonna die now.\n          The boy moves toward Audrey, stepping over Kyle's body.\n          Audrey backs away. She looks toward the entrance to the\n          diner. Blocked by advancing creatures.\n          They're everywhere.    She's trapped.\n          She notices the open door to the MINIVAN.     And so she BOLTS.\n          Audrey dives into the car as the throng of creatures rapidly\n          closes in. She hammers the auto door lock. CLUNK!\n          She moves to the center of the car as gruesome faces press\n          against the windows. A nightmare come to life.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Panic.\n          Charlie rushes to Michael's side.\n\n                              CHARLIE\n                    Do you have no heart?!     She's just\n                    a kid!\n          But he's immovable.\n\n                              CHARLIE\n                    You can't let her die!\n                        (grabbing a gun from the\n\n                         TABLE)\n                    I swear if you don't do something,\n                    I will!\n          Charlie COCKS the gun, moves toward the door.\n\n                                 MICHAEL\n                    Wait.\n\n          \n\n                                                                    75.\n\n          \n\n          \n          Charlie looks back at him, defiant.   No one breathes.   Then:\n\n                              MICHAEL\n                        (raising his guns)\n                    Open the door.\n          Bob springs into action, clearing the door and flipping the\n          dead bolt. The door is opened and Michael charges passed\n          Charlie and out into hell.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          With stunning calm, Michael marches straight for the pumps.\n          IN THE MINIVAN, Audrey screams as the windows begin to CRACK.\n          She's running out of time.\n          Michael grabs a gas pump, flips the lever and points it at\n          the minivan. What's he up to?\n          The creatures covering the car turn to look at Michael as if\n          they've just now noticed him.\n          And that's when he starts spraying gas at them. But wait,\n          there's more to this trick. Up comes Michael's Glock in his\n          other hand and BLAM! BLAM! BLAM!\n          The spray of gas EXPLODES into a SPRAY OF FIRE!\n          The MINIVAN is engulfed in flames.\n          Creatures tear away from the car like fiery comets through\n          the night.\n          The windows EXPLODE, showering Audrey with tiny shards of\n          glass.\n          Michael drops the gas pump.\n          He reaches through a fire rimmed broken car window and\n          unlocks the door.\n          Audrey looks up to see Michael's expressionless face CIRCLED\n\n          BY A RING OF FIRE.\n\n                              MICHAEL\n                    Come with me.\n          Meanwhile, fire is spreading quickly under the car...\n          Michael pulls Audrey from the flaming vehicle.\n\n                              MICHAEL\n                    Run.\n\n          \n\n                                                                    76.\n\n          \n\n          \n          And together they run toward the open diner door.\n\n          BEHIND THEM THE MINIVAN EXPLODES.   A BALL OF FIRE ROARS AT\n\n          THEM!\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          Everyone's eyes go wide at the insanity they're witnessing.\n          Audrey is the first one in.\n          Michael is almost there.   But the fire is faster, ENGULFING\n\n          HIM IN FLAME!\n\n                               CHARLIE\n                    Michael!\n\n                              BOB\n                        (pulling Charlie away from\n                         the door)\n                    Get back!\n          BURSTING OUT OF THE FLAMES, Michael marches confidently into\n          the diner. Jeep slams the door CLOSED just as the WALL OF\n\n          FIRE REACHES THEM.\n          Everyone hits the deck as the FIRE SHOOTS THROUGH THE SLATS\n          covering the windows like spindly fingers reaching for prey.\n          Michael's clothes are a smoky, smoldering mess.   Jeep and Bob\n          rush to pat him down.\n          Audrey's coughing from the smoke.\n\n                              CHARLIE\n                    I'll get some water!\n          Charlie dashes behind the counter to the sink.    She fills up\n          a pitcher of water.\n          She turns away from the sink with the filled pitcher...\n          And SCREAMS!\n          The YOUNG BOY with the lifeless white eyes stands before her\n          wielding an ENORMOUS BUTCHER'S KNIFE.\n          The pitcher shatters LOUDLY on the floor.\n          The boy swings the knife at her, slicing open the waitress\n          outfit covering her pregnant belly.\n          Charlie tumbles back to the ground behind the counter. She\n          frantically pushes herself away from the approaching boy.\n\n          \n\n                                                                       77.\n\n          \n\n          \n          But she doesn't have far to go before she'll run out of room\n          to maneuver.\n\n                                 YOUNG BOY\n                       C'mon, don't be scared. I just\n                       wanna play with your baby.\n          That's it.    She's backed against the end of the counter!\n          The boy raises the knife to strike.\n          Charlie grabs a baking pan off a shelf. Swings it out in\n          front of her body like a shield, as the KNIFE IS DRIVEN DOWN.\n          CLANG! The knife hits the pan hard and stops. But the boy's\n          hands don't. They slip off the handle and run right down the\n          blade.\n          The knife CLATTERS to the ground.\n          The boy instinctively raises his hands to strike again, but\n          there's no knife.\n          Charlie watches in horror as the boy calmly realizes that his\n          THUMBS ARE MISSING. Blood sprays from the stumps.\n          Charlie pulls her legs in close then rockets them out at the\n          boy's chest. He's catapulted away from her.\n          Michael leaps over the counter, landing in front of Charlie,\n          guns ready for action. But the boy is gone.\n\n                                 MICHAEL\n                       Are you hurt?\n          Charlie shakes her head no.\n\n                                 CHARLIE\n                       Where is he?!\n          That's when the electricity goes out once again, PLUNGING THE\n\n          DINER BACK INTO DARKNESS.\n\n                                 JEEP'S VOICE\n                       He's still in here!\n          FLASHLIGHT BEAMS fan out across the diner.\n          LIGHTING under chairs.    Under tables.\n\n                                 BOB'S VOICE\n                       Where the fuck is he?!\n          A SCAMPERING SOUND... MOVING FAST.    Everybody spins to track\n          the location of the sound.\n\n          \n\n                                                                       78.\n\n          \n\n          \n          As soon as they move in one direction, the SCAMPERING is\n          heard in another.\n          Jeep's LIGHT CATCHES SOMETHING ON THE GROUND.      A TRAIL OF\n\n          BLOOD.\n\n                                JEEP\n                      He's bleeding!\n\n          THE BEAMS OF LIGHT JOIN TOGETHER, MOVING FAST TO TRACK THE\n\n          BLOOD ACROSS THE DINER WHERE IT ENDS AT...\n\n          A WALL...\n          Jeep raises his LIGHT UP THE WALL WHERE THE TRAIL OF BLOOD\n\n          REACHES THE CEILING AND...STOPS.\n\n                                BOB\n                      What the fuck?\n\n          SCREECH!   THE BLOODY BOY SPRINGS OFF A TABLE BEHIND THEM AND\n\n          LANDS ON BOB'S BACK.\n          Bob flails around trying to pull the boy's small, but deadly\n          strong arms away from his neck.\n\n                                   JEEP\n                      Dad!\n          Jeep can't get a clear shot.       Bob's gasping for air.\n          Michael grabs the boy and fiercely rips him off of Bob's\n          back. He swings the boy around like a living shot put.\n\n                                   MICHAEL\n                      Get ready!\n          Jeep and Bob whip up their guns as Michael throws the wicked\n          creature into the air.\n          Sandra's vacant face flickers in the light as the SOUND OF\n          GUNFIRE AND INHUMAN SCREAMING fill the diner.\n          And then in moments...      All is QUIET.\n          BEHIND THE COUNTER, Audrey helps Charlie to her feet.       She\n          WINCES. Doubles over, clutching her stomach.\n\n                                   CHARLIE\n                      Oh, no!\n          Michael lowers his flashlight.      CLEAR FLUID runs down\n          Charlie's legs.\n\n                                                                 CUT TO:\n\n          \n\n                                                                   79.\n\n          \n\n          \n\n          \n\n          EXT.   PARADISE GAS `N' GRUB - LATE NIGHT\n\n          Inky darkness.   A flickering light emanates from within the\n          diner.\n          TITLE:   \"December 25th - 3:33am\"\n          The sound of CHARLIE'S SCREAM, carries us to:\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - LATE NIGHT\n\n          Charlie, drenched in sweat is writhing on the ground with\n          Michael holding down her arms and Audrey kneeling between her\n          legs. Pots of steaming water surround them.\n\n                               AUDREY\n                     What am I supposed to do? Just\n                     `cause I'm a girl doesn't mean I\n                     automatically know how to do this!\n\n                               MICHAEL\n                     Just do as I say.\n\n                               AUDREY\n                     Yeah, but, how do you know how to\n                     do this?!\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - SAME\n\n          Bob and Jeep keep watch.\n          The SPECTRAL LIGHTS in the distance seem to be growing larger\n          -- closer.\n          Charlie's SCREAMING rises up from below.\n\n                                BOB\n                     What a way to bring a child into\n                     the world.\n                         (looks over at Jeep)\n                     She ever tell you his name?\n\n                               JEEP\n                     She's never said. I just assumed\n                     it was Joe Danvers. You know how\n                     she's always had a thing for bad\n                     boys.\n          Bob hears the spite in Jeep's voice.\n\n          \n\n                                                                     80.\n\n          \n\n          \n\n                              BOB\n                    Jeep, sooner or later she'll\n                    realize you're the best thing\n                    that's ever happened to her.\n\n                              JEEP\n                    I thought you said I should move\n                    on?\n\n                              BOB\n                    Can't a father be wrong sometimes?\n          Jeep considers Bob with a smile, then comes the sound...\n          A DEEP, LONG, BODY RUMBLING TONE rising up off the plain, as\n          if emanating from the largest HORN ever constructed.\n\n                              JEEP\n                    What was that...?\n          The SPECTRAL LIGHTS dot the landscape now with untold\n          numbers.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          Michael reacts to the sound. An urgency comes over him.\n          Audrey arrives with more steaming water.\n\n                              AUDREY\n                    What is that?!\n\n                              MICHAEL\n                    He's coming. We have to hurry.\n\n                              AUDREY\n                    Who's coming? Whaddya mean hurry?\n                    This isn't something you can\n                    exactly hurry, is it?\n\n                              MICHAEL\n                    Charlie, I need you to push. I\n                    need you to push as hard as you\n                    can.\n\n                              AUDREY\n                    Michael, who's coming?!\n          Charlie pushes, tears streaming down her face, delirious with\n          pain. It's a gruesome, bloody affair. It's getting close.\n\n                              MICHAEL\n                    We're almost there...\n\n          \n\n                                                                    81.\n\n          \n\n          \n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - ROOF - SAME\n\n          Jeep and Bob watch helplessly as the ARMY OF CREATURES has\n          closed within a hundred yards of the diner. Their ranks\n          stretch back seemingly without end into the darkness.\n\n                              JEEP\n                    We're not gonna make it outta here,\n                    are we?\n          Bob looks at his son.   The agony stretched across his face.\n\n                              BOB\n                    I'm sorry Jeep. This shouldn't be\n                    happening to you...\n          Jeep rests a comforting hand on his father's shoulder. Bob\n          pulls his son close and hugs him with all his might, tears\n          filling his eyes.\n\n          \n\n          INT. PARADISE GAS `N' GRUB - SAME\n\n          Amidst the dirt and darkness, Charlie lets out a final\n          agonizing SCREAM...\n          ...and then comes a BABY'S CRIES.   Audrey, eyes wide, holds\n          up the CHILD. Stunned. Elated.\n\n                              AUDREY\n                    Oh my god...we did it!    Charlie,\n                    you did it!\n          Audrey places the child in Charlie's arms. She stares at the\n          baby, holding it at a distance, unsure of whether to embrace\n          it or be terrified by it. A commitment she's not yet ready\n          to make, even at this late hour.\n\n                              AUDREY\n\n                        (CONFUSED)\n                    It's okay. The baby's okay.\n          Charlie looks to Audrey, tears streaming down her face.\n\n                              CHARLIE\n                    I don't...I...\n          Audrey looks to Michael, unsure.\n\n                              MICHAEL\n                    Take him... Give her a minute.\n          Audrey nods, takes the baby back from Charlie, tries to\n          soothe him by pacing around the diner.\n\n          \n\n                                                                        82.\n\n          \n\n          \n\n                                AUDREY\n                      It's okay...It's okay...Shhh...\n          Another DRONE OF THE HORN RATTLES THE WALLS.      Menacing.\n          Closer.\n          Audrey   reacts, crosses to the counter, turns on the radio,\n          trying   to drown out the sound of the approaching menace. Out\n          of the   STATIC, the haunting sounds of BING CROSBY singing\n          SILENT   NIGHT fills the room. The quiet before the storm.\n          Michael helps Charlie quickly clean herself up.     She stares\n          at him, a burning spite in her eyes.\n\n                                CHARLIE\n                      So are we safe now?   Is it over?\n\n                                MICHAEL\n                      No. Killing the child would have\n                      ended the war before it had begun.\n                      Now, at least, he will have a\n                      chance to grow up, a chance to lead\n                      the world out of darkness.\n          Those words provide her little comfort.\n\n                                CHARLIE\n                      And what happens until then...?\n\n                                MICHAEL\n                      You'll need to teach him how.\n          Charlie shakes her head, this is all too much.\n\n                                CHARLIE\n                      What makes you think I can do that?\n                      What makes you think I want to do\n                      that? If he's so important, why\n                      don't you take him?\n\n                                MICHAEL\n                      Each of us has a burden. This one\n                      is yours and yours alone. Maybe\n                      someday you'll understand what that\n                      means.\n          Off Charlie's look, we move across the diner where Audrey\n          approaches her mother, kneels down in front of her. Despite\n          how much her mother pisses her off, it breaks her heart to\n          see her in such a demoralized state.\n\n                                AUDREY\n                      Mama? Can you hear me?\n                          (holds up the baby)\n                      We did it...The baby's alive.\n\n                                (MORE)\n\n          \n\n                                                                   83.\n\n          \n                                 AUDREY (cont'd)\n\n                        (BEAT)\n                    Mama?\n          If Sandra hears her daughter, it doesn't show in her face.\n          Tears well up in Audrey's eyes as she moves away from her\n          mother. But we HOLD here and...\n          DRIFT DOWN BEHIND THE CHAIR TO REVEAL Sandra's hands are\n          loosening the bonds. BLOOD TRICKLES from where the rope's\n          cut through her skin.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          DRIFTING THROUGH the dark shapes as the BABY'S CRIES\n          reverberate up and down the ranks. They begin to look about\n          frantically, agitated by the sound. Some even begin to back\n          away from the diner.\n\n                                                         DISSOLVE TO:\n\n          \n\n          EXT. DESERT - CONTINUOUS\n\n          Off in the distance, the diner is but a dim flickering light\n          above the plain. It could almost be mistaken for a stable in\n          a desert town a long time ago.\n          THREE STARS burn bright and low in the black sky.\n          All around us the DARK CREATURES are cowering from sound of\n          the CRYING INFANT whose wails seem to grow even LOUDER the\n          further away from the diner we get.\n\n          \n\n          HIGH ABOVE THE TRUCK STOP\n          In the darkness below we see the lights of the legions of\n          creatures dot the landscape and at the center of it all, the\n          truck stop.\n          The sound of WINGS BEATING AGAINST THE WIND.\n\n          AND WE'RE DRIFTING DOWN TOWARD THE DINER ENTRANCE.   LIKE A\n\n          BIRD CIRCLING ITS PREY.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Jeep and Bob enter the diner to see Michael helping Charlie\n          to her feet, while Audrey continues to pace, the bundle of\n          bloody blankets cradled in her arms.\n\n                              JEEP\n                    Something's happening.    They're\n                    moving away.\n\n          \n\n                                                                       84.\n\n          \n\n          \n\n                              MICHAEL\n                    The Possessed can't come near the\n                    child, so He sent someone that can.\n                    Someone like me.\n\n                                 BOB\n                    Who?\n\n                              MICHAEL\n                    Gabriel. My lieutenant.      He's come\n                    to do what I wouldn't.\n          ON JEEP as the realization hits him.\n\n                              JEEP\n                    Your orders...\n          Michael looks at Jeep.\n\n                              JEEP\n                    You were the one who was supposed\n                    to kill the baby? That was the\n                    order you didn't obey.\n          Michael nods grimly.    Charlie looks urgently at Michael.\n\n                              CHARLIE\n                    What's he talking about?\n          The baby CRIES LOUDER.\n\n                              CHARLIE\n                    Michael, what the hell's he talking\n                    about?!\n\n                              MICHAEL\n                    There was never meant to be a\n                    Second Coming. But we've just\n                    changed that. The child lives.\n                    The future is unwritten. There's\n                    still hope.\n          Charlie, shaken by this revelation, reaches out to Audrey.\n\n                                 CHARLIE\n                    Audrey...?\n          Audrey moves to hand over the baby to Charlie...\n\n          ...AND THAT'S WHEN SANDRA SPRINGS OUT OF HER CHAIR AND\n\n          SNATCHES THE BABY FROM AUDREY'S ARMS!\n          Sandra backs away from them, moving toward the front door.\n          Hers is the face of madness.\n\n          \n\n                                                                    85.\n\n          \n\n          \n\n                               SANDRA\n                     Stay away from me!    Don't come any\n                     closer!\n\n                                AUDREY\n                     Mom!\n\n                               BOB\n                     Don't do it, lady!\n\n                               SANDRA\n                     You heard what he said. They just\n                     want the baby. Maybe if we just\n                     give it to them, then they'll let\n                     us go!\n          Michael cocks his gun.   Points it at Sandra.\n\n          THE HORN BLARES ONCE MORE, DEAFENING, SHAKING EVERYTHING IN\n\n          THE DINER. IT'S RIGHT OUTSIDE THE DOOR.\n          Charlie squares off with Sandra, panic in her eyes.\n\n                               CHARLIE\n                     Give him to me!\n\n                               SANDRA\n                     Why?! You never wanted him in the\n                     first place!\n          Charlie stares at her in horror, the truth of those words\n          rattling her to the very core.\n\n                                CHARLIE\n                     No...   I...\n          Sandra is almost to the front door.\n\n                               SANDRA\n                     It's just one baby.   Just one.\n\n          CRASH!   THE DOOR IS TORN OFF ITS HINGES.\n          A brilliant SPECTRAL LIGHT pours into the diner.\n          Sandra is blinded.   She raises a hand to block the light.\n          And that's when Michael fires.    BLAM!\n          Sandra staggers back, blood dripping from the hole in her\n          forehead, and...\n\n          ...THE BABY GOES FLYING OUT OF HER HANDS!\n          Charlie screams and the WORLD MOVES INTO SLOW MOTION...   And\n          everything suddenly goes very QUIET.\n\n          \n\n                                                                     86.\n\n          \n\n          \n          Michael fires again.   Blowing Sandra's body back through the\n          doorway.\n          Jeep watches the baby sail SLOWLY through the air.\n          The time for Jeep to act is now!\n          Jeep DIVES for the baby...catching the bundle of rags mere\n          inches from the ground! And then he looks up to see...\n          The dark SILHOUETTE OF A MAN approaching from out of the\n          spectral light. A MAN WITH WINGS.\n          Jeep's eyes grow wide as the FIERCE ANGEL steps into the\n          diner. But this looks like no angel we've seen before.\n          This is a creature built for war. Rough hewn, battle\n          scarred. His body armor making him appear disturbingly\n          insect like. His wings are not feathery or gentle. Rather\n          they are hard, mechanical, an organic machine.\n          The angel's wings retract with clockwork-like precision.\n          And now that we see the his face clearly, we notice his\n          striking resemblance to Michael. We might even mistake them\n          for brothers.\n          His name is GABRIEL.\n          Gabriel raises a massive, ferocious, strangely mechanical\n          looking MACE in his powerful hands.\n          And the world returns to NORMAL SPEED as Gabriel brings the\n          mace arcing down at Jeep.\n          Jeep rolls! CLANG! The weapon just misses him, hitting the\n          floor in a spray of sparks, literally CRACKING THE GROUND.\n          Gabriel brings the mace up again.   Jeep won't be so lucky\n          twice.\n\n                              BOB (O.S.)\n                    Sonuvabitch!\n          Bob charges at the creature, sub-machine gun blazing.\n          Gabriel reacts by instantly UNFOLDING HIS WINGS and launching\n          himself into the air. The bullets clawing up the wall behind\n          him.\n          But Bob's heroic move has given Jeep time to get up and run\n          with the baby for the back of the diner. He thrusts the\n          child into Charlie's hands. And without even thinking, she\n          pulls the child protectively to her chest.\n\n          \n\n                                                                    87.\n\n          \n\n          \n          Gabriel drops down in front of Bob, whipping his wings around\n          like a deadly, RAZOR SHARP FAN!\n          Bob stops firing, a look of surprise stretches over his face.\n          His gun falling from his hands.\n          Blood begins to pour out of the slice across his belly.\n\n                               JEEP\n                    No!\n          With a sweep of his hand, Gabriel sends Bob flying across the\n          diner where he crashes down behind the counter near the\n          stove.\n          Michael GRABS JEEP'S HAND before the boy can rush back into\n          the fray.\n\n                               MICHAEL\n                    No, Jeep! You must protect the\n                    child now!\n\n                               JEEP\n                    Me?!   What about you?\n\n                              MICHAEL\n                    My path ends here. You are the\n                    true protector. You always have\n                    been.\n          Jeep shakes his head, panic setting in.\n\n                              JEEP\n                    But I don't know what to do!\n\n                              MICHAEL\n                    Find the Prophets.   Learn to read\n                    the instructions.\n          Michael lets go of Jeep's hand and turns away to face\n          Gabriel, leaving Jeep to contemplate those final words.\n\n                              JEEP\n                    Prophets? What Prophets?   What\n                    instructions?!\n          And that's when Jeep opens his hand to find the KEYS to\n          Michael's Police Cruiser.\n          Jeep looks up from the keys to see Charlie, Audrey and the\n          baby. The responsibility crashing in on him. Then he closes\n          his hand around the keys, determination building.\n\n                               JEEP\n                    C'mon!\n\n          \n\n                                                                  88.\n\n          \n\n          \n          Charlie looks past Jeep to see Michael returning to the fray.\n\n                                 CHARLIE\n                    Wait!     We can't leave him!\n\n                              JEEP\n                    We have no choice!    We have to get\n                    to Red Rock!\n          He pulls Charlie past the counter toward the back office.\n          Jeep stops when he sees his father's broken body lying on the\n          ground by the stove in a pool of his own blood.\n          Bob's half open eyes focus on his son. In his outstretched\n          hand is that goddamn ZIPPO LIGHTER... and next to that, a\n          BROKEN GAS PIPE leading to the stove.\n          Jeep is terrified.\n\n                                 JEEP\n                    Dad!\n          Jeep tries to help him up.\n\n                              BOB\n                    Leave me, Jeep.     My place is here,\n                    remember?\n\n                              JEEP\n                    But Dad...!\n          Bob smiles weakly at his son and says simply:\n\n                                 BOB\n                    Run.\n          And so Jeep, fighting back tears, does what his father says.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - BACK OFFICE - CONTINUOUS\n\n          Audrey and Jeep push the desk away from the door.\n          Charlie opens it.    Sand swirls in around her.\n          And Jeep leads the trio out the door.\n\n          \n\n          INT. PARADISE GAS `N' GRUB - SAME\n\n          Michael and Gabriel square off in the diner, not like\n          enemies, but like brothers on opposite sides of a terrible\n          family conflict.\n\n          \n\n                                                                    89.\n\n          \n\n          \n\n                              MICHAEL\n                    I knew he'd send you, Gabriel. You\n                    were always so eager to please Him.\n\n                              GABRIEL\n                    Unlike you...the rebellious son.\n                        (noticing Michael's scars)\n                    Pity about your wings. They would\n                    have helped you now.\n\n                              MICHAEL\n                    To not feel their burden...is a\n                    dream.\n\n                              GABRIEL\n                    You think you can defy Him and not\n                    pay the price?\n\n                              MICHAEL\n                    The child lives. What happens to\n                    me doesn't matter now.\n\n                               GABRIEL\n                    Yours is a fool's sacrifice. You\n                    can help them sneak out the back\n                    door, but they won't escape.\n\n                        (BEAT)\n                    And neither will you, brother.\n          Michael slowly approaches Gabriel.\n\n                               MICHAEL\n\n                        (SOFT)\n                    I'm not running anymore.\n          Gabriel hesitates, doubt clouding his face.    This was not\n          what he was expecting.\n\n                              MICHAEL\n\n                        (SENSING)\n                    Join with me. You don't need do\n                    this. There's another way.\n          A beat, then Gabriel's expression hardens.\n\n                              GABRIEL\n                    There is no other way...\n          He pulls back from Michael, raising the mace -- SCHING! --\n          LONG DEADLY SHARP SPIKES BURSTS FROM ALL ITS SIDES...as if it\n          wasn't bad-ass enough.\n          And the fight begins.\n\n          \n\n                                                                    90.\n\n          \n\n          \n          It's mace against machine gun and strangely enough, it seems\n          under Gabriel's deft control, the mace is the vastly superior\n          weapon.\n          With the aid of his wings, Gabriel moves with staggering\n          speed, defying gravity to avoid the rain of bullets. The\n          place is getting absolutely shot to hell.\n          Michael leaps from table top to table top as Gabriel brings\n          the mace brutally down -- splintering everything it touches.\n          Michael leaps onto the last unbroken table top -- spins to\n          fire. Gabriel pushes into the air, jabbing a spike straight\n          into the barrel of Michael's MP5. The gun explodes in\n          Michael's hands, sending him rocketing backwards where he\n          lands on the counter.\n          Gabriel swoops in fast. Michael kicks him in the chest,\n          sending him fluttering back.\n          Michael thrusts himself to his feet.   Gabriel recovers, jabs\n          again.\n          Michael grabs a hold of Bob's ceiling mounted TV for support\n          and lifts his body just above the deadly spike.\n          Michael kicks Gabriel in the head, momentarily stunning him.\n          Michael dives at Gabriel, landing an awesome flurry of\n          punches.\n          Gabriel is rattled back by the assault.   He clumsily lifts\n          his mace and thrusts with it.\n          Michael narrowly evades the razor point, which drives into a\n          wall.\n          Michael smashes down on Gabriel's wrist, CRACKING the bones.\n          A swift kick to the chest and Gabriel is thrust crashing\n          back, losing his grip on the weapon.\n          Michael takes a running leap onto Gabriel's back.\n          Gabriel launches wildly into the air, trying to throw Michael\n          off. They hit the ceiling, but Michael hangs on. Choking\n          the life out of Gabriel.\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - CONTINUOUS\n\n          Audrey and Jeep help Charlie quickly move around the side of\n          the diner where the cruiser is parked. They are buffeted by\n          winds and sand.\n          Jeep puts Charlie and the baby into the front passenger seat\n          while Audrey hustles in back.\n\n          \n\n                                                                    91.\n\n          \n\n          \n          Jeep rounds to the driver's side.     Hops in.\n\n          \n\n          INT. POLICE CRUISER - CONTINUOUS\n\n          Jeep frantically tries to get the right key into the\n          ignition.\n          It's in.\n          Jeep turns the key but the ENGINE STRUGGLES TO FIRE UP.\n          Panic.\n\n                               CHARLIE\n                     Come on, Jeep!\n\n                               JEEP\n                     I'm trying!\n          Jeep gives it some gas, but the ENGINE'S NOT CATCHING.\n          A DARK SHAPE POUNCES ONTO THE HOOD OF THE CAR. The light\n          catches it, revealing the disfigured face and beard of a\n          SHOPPING MALL SANTA CLAUS, his oversized belly gruesomely\n          distended.\n          Charlie screams.\n\n                                JEEP\n                     Fuck!\n          Jeep pumps the gas and the ENGINE BURSTS TO LIFE!\n          The creature's about to punch a fist through the glass\n\n                               JEEP\n                         (throwing the car in\n\n                          REVERSE)\n                     Hang on!\n          Jeep floors it, causing the cruiser to rocket backwards\n          toward the highway.\n\n          BUT THE CREATURE HANGS ON!\n          Jeep pulls the wheel hard and the cruiser whips around a full\n          180 onto the road.\n\n          THE CREATURE SHOOTS OFF THE CAR AND HITS THE ASPHALT.\n          Jeep throws it in drive just as the POSSESSED SANTA rises\n          from the pavement.\n          Pedal to the metal.\n\n          \n\n                                                                  92.\n\n          \n\n          \n          The creature doesn't have a chance as the cruiser PLOWS into\n          him.\n          BONES CRUNCH as a flash of red and white is sent sailing over\n          the car and tumbling down onto the road behind them in a\n          cloud of dust.\n          Jeep clenches the wheel, pedal to the floor.\n\n                              JEEP\n                    Okay, we need to figure out our\n                    weapon situation.   Hopefully\n                    Michael didn't take everything out\n                    of the car.\n          Jeep places his Glock on the dash. He sees that he's got a\n          police issue shotgun in the front seat rack. Charlie\n          searches under her seat.   Pulls out a...GRENADE.\n\n                              CHARLIE\n                    Is this what I think it is?\n\n                             JEEP\n                    Yes. Now just put it down...\n                    Slowly.\n          Charlie places it onto the seat.\n          Audrey fishes around in the backseat.\n\n                              AUDREY\n                        (holding up each item)\n                    Okay, all I got is a flare gun\n                    thing. Looks like we got a box of\n                    flares to go with it.\n\n                               JEEP\n                    Okay. Okay. Handgun. Shotgun. A\n                    a flare gun... And a grenade.\n                    Alright.\n                        (hands Charlie the Glock)\n                    Load this.\n\n                        (BEAT)\n                    Audrey, can you figure out how to\n                    load that flare gun without killing\n                    us all?\n\n                                 AUDREY\n                    I can try.\n\n                              JEEP\n                    Try real hard, okay?\n          Audrey anxiously sets about loading the flare gun.\n\n          \n\n                                                                     93.\n\n          \n\n          \n\n          \n\n          INT. PARADISE FALLS GAS `N' GRUB - SAME\n\n          Gabriel flies into a wall in an attempt to crush Michael.    He\n          fails that but succeeds in leaving a massive dent.\n          Gabriel runs/flies for the opposite wall. This one doesn't\n          hold and the two enemies crash through it into the bathroom.\n          Unbelievably Michael is still holding on.\n          Gabriel is up. He thrusts himself back into the bathroom\n          mirror. It shatters painfully behind Michael.\n          Gabriel rages out of the bathroom and into the diner.\n          Michael continues to ride him like a wild bull.\n          Gabriel slams Michael into a wall once more.   It's a brutal\n          struggle.\n          Gabriel spots his mace sticking out of the wall within arms\n          reach.\n          He grabs it, holding it futilely in front of him. From this\n          angle he'd never be able to hit Michael with it. Gabriel's\n          strength is giving way. Michael is winning.\n          Gabriel lets out a tremendous ROAR and plunges one of the\n          mace's long spikes into his own stomach. Michael's eyes go\n          wide with surprise, his grip loosens. Gabriel has run them\n          both through.\n          Gabriel rips the mace from his body and stumbles forward.\n          Blood pours from a huge hole in Michael's chest.   Right\n          through his heart.\n          Gabriel looks down at the hole in his own belly. Not nearly\n          as bad as Michael's. Apparently there's not a lot of blood\n          left in this guy.\n          Michael falls to his knees.   Weakening.\n          Gabriel looms over Michael.   Michael looks up at him, blood\n          leaking from his mouth.\n\n                              GABRIEL\n                    You always wanted to live like one\n                    of them...Now you'll know how it\n                    feels to die like one of them.\n          Gabriel raises the mighty mace above his head.\n          Michael closes his eyes.   Submitting.\n          The mace comes swinging down...\n\n          \n\n                                                                       94.\n\n          \n\n          \n\n          \n\n          INT. POLICE CRUISER - DRIVING - SAME\n\n          The cruiser hits the FLY STORM. Black. Nothing is visible\n          beyond the windows. BUZZING surrounds them. DEAFENING.\n          Jeep turns on the windshield wipers.     Hits the brights.\n          PING!   PING!   PING!   Driving blind!\n          ON THE SPEEDOMETER as their speed slows to a crawl.\n\n                                  AUDREY\n                     Go faster!\n\n                               JEEP\n                     I can't fuckin' see!\n          Charlie's desperately trying to soothe her SCREAMING baby.\n          ON THE AIR VENTS as FLIES start crawling in.\n\n                                  JEEP\n                     Oh, no.\n\n          \n\n          INT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Gabriel is looking down upon Michael's broken body.\n          Something is happening to his skin. The DARK WRITING THAT\n          COVERS HIS BODY is beginning UN-WRITE itself and DISAPPEAR...\n\n          \n\n          INT. POLICE CRUISER - DRIVING - SAME\n\n          Charlie is struggling to close the air vents to stop the\n          inflow of BUZZING insects. It's not working!\n          She looks to Jeep in desperation, but something more\n          frightening catches her attention.\n          The INTRICATE WRITING is beginning to appear on Jeep's arm,\n          snaking its way up from his wrists like VINES.\n\n                               CHARLIE\n                     Jeep, your arm!\n          Jeep sees it, eyes go wide.\n\n                               CHARLIE\n                     What is it?\n          A beat, as Jeep remembers Michael's parting words...\n\n          \n\n                                                                     95.\n\n          \n\n          \n\n                              JEEP\n                    The instructions...\n\n          \n\n          INT. PARADISE GAS `N' GRUB - SAME\n\n          Gabriel watches as the last of the writing FADES from\n          Michael's body when he hears a faint CLICKING sound from\n          somewhere in the diner.\n          Gabriel moves gracefully through the destroyed diner, toward\n          the source of the CLICKING.\n          He steps behind the counter and finds Bob lying in a massive\n          pool of blood.\n          It takes the creature a moment to realize that the CLICKING\n          sound is coming from Bob's SILVER ZIPPO.\n          Bob is focusing every last ounce of life in his body to\n          lighting that lighter. CLICK... CLICK... CLICK...\n          Bob looks at Gabriel.\n\n                               BOB\n                    Sorry...   We're closed.\n          And with one last brush of his thumb, Bob's trusty ZIPPO\n\n          IGNITES.\n          Gabriel's eyes go wide as the TINY FLAME DANCES in front of\n          the stove's broken gas line.\n          Gabriel spins and runs like hell as the gas explodes.\n\n          A STREAM OF FIRE ENGULFS HIM AS HIS WINGS UNFOLD AND HE LEAPS\n\n          INTO AWESOME FIERY FLIGHT.\n\n          \n\n          INT. POLICE CRUISER - DRIVING - CONTINUOUS\n\n          The MASSIVE EXPLOSION rocks the slow moving vehicle.\n          In the rearview mirror, Jeep sees the CLOUD OF FIRE\n          MUSHROOMING UP in the sky behind them. It's eerily\n          magnificent.\n\n                              CHARLIE\n                    The swarm, it's fading!\n          Jeep looks back to the road as, sure enough, the FLY SWARM\n          suddenly dissipates all around them, revealing a CLEAR VIEW\n          of the highway ahead. Jeep knows at what price this good\n          fortune has come.\n\n          \n\n                                                                     96.\n\n          \n\n          \n\n                              JEEP\n                    Thank you...\n\n          AND THAT'S WHEN THE WORD \"PARADISE\" CRASHES DOWN LIKE A BALL\n\n          OF FIRE ONTO THE ROAD DIRECTLY IN FRONT OF THEM!\n\n                                JEEP\n                    Oh, shit!\n\n          \n\n          EXT. HIGHWAY - CONTINUOUS\n\n          The cruiser PUNCHES through the burning \"Paradise\" sign,\n          smashing it into fiery pieces!\n          The cruiser charges on down the endless highway, burning bits\n          of sign swirling in its wake.\n\n          \n\n          INT. POLICE CRUISER - DRIVING - CONTINUOUS\n\n          From the back seat, Audrey watches the fire recede into the\n          distance.\n\n                              AUDREY\n                    I can't believe it.   Is it really\n                    over...?\n          Up front Jeep stares out at the dark road ahead.\n\n                              JEEP\n                    No...It's just starting...\n\n          \n\n          EXT. PARADISE FALLS GAS 'N' GRUB - SAME\n\n          Burning wreckage everywhere.\n          DRIFTING THROUGH IT until we settle on the SPIKE-SCEPTER\n          stuck firmly in the ground. Flames ring the handle.\n\n          \n\n          EXT. HIGHWAY - SAME\n\n          The cruiser blazes down the highway.\n\n          \n\n          INT. POLICE CRUISER - DRIVING - SAME\n\n          Charlie cradles the baby, apprehensive. The baby looks up at\n          her, smiles. She can't help but smile back at him. Jeep\n          eyes her.\n\n          \n\n                                                                    97.\n\n          \n\n          \n\n                              JEEP\n                    Better not hold him too long.\n                    Might get attached.\n          Charlie looks over, feels his lingering anger.\n\n                              CHARLIE\n                    Look, I'm sorry for what I said to\n                    you earlier, `bout you following me\n                    around. I didn't mean it.\n\n                              JEEP\n                    Nothin' to be sorry about. It's\n                    true. I did follow you around. At\n                    least now I know there was a good\n                    reason.\n          Charlie's reacts, a bit stung.\n          Jeep tries to hide his pleasure that the tables have turned\n          at least a little. Charlie is about to respond when Audrey\n          leans in from the back seat.\n\n                              AUDREY\n                    We're here.\n          She points ahead to a beaten up road sign that says:\n          \"Now Entering Red Rock National Park, Next Rest Stop 30\n\n          MILES\"\n\n                              JEEP\n                    Okay, all we gotta do is --\n\n          CRASH!\n          The roof buckles above them.   The windows BLOW OUT.\n\n          \n\n          EXT. RED ROCK NATIONAL PARK ROOD - CONTINUOUS\n\n\n          GABRIEL SMASHES DOWN ON THE CRUISER'S ROOF WITH MASSIVE\n\n          FORCE!\n\n          USING HIS MIGHTY WINGS FOR BALANCE HE BEGINS TO STOMP ON THE\n\n          ROOF, CRUSHING IT DOWN AS IF IT WERE A SODA CAN!\n\n          \n\n          INT. POLICE CRUISER - DRIVING - CONTINUOUS\n\n          Jeep, Charlie and Audrey slip frantically down in their seats\n          as the roof presses down at them. The windows BURST.\n          Jeep grabs the Glock and fires wildly up at the roof.\n\n          \n\n                                                                     98.\n\n          \n\n          \n\n          \n\n          EXT. POLICE CRUISER - DRIVING - CONTINUOUS\n\n          Gabriel takes a direct hit in the thigh, causing him to slide\n          off the roof and onto the trunk where he grabs a hold of the\n          rear window frame for support.\n\n          \n\n          INT. POLICE CRUISER - DRIVING - CONTINUOUS\n\n          With tremendous strength, Gabriel pulls his upper body\n          through the broken back window toward Audrey.\n\n                              AUDREY\n                    Jeep!\n          Jeep swings the gun around.\n\n                              JEEP\n                    Duck!\n          BLAM! Gabriel takes one in the shoulder, but it doesn't slow\n          him down.\n\n                              JEEP\n                    Audrey, the flare gun!\n          Audrey desperately tries to load a flare while avoiding\n          Gabriel's grasp. Jeep can't get off another shot without the\n          risk of hitting Audrey.\n          Gabriel is almost entirely in the car now.\n          Audrey swings the flare gun toward Gabriel, but he knocks her\n          hand aside just as she pulls the trigger and the flare goes\n          off INSIDE THE CAR!\n          Jeep ducks. The CAR SWERVES MADLY. The flare RICOCHETS\n          through the cabin, lighting it up like the Fourth of July!\n          Gabriel lunges for Charlie just as the flare bounces off the\n          windshield - PING! - and nails him right in the face, SETTING\n\n          HIS HAIR ABLAZE.\n          And that gives Jeep the chance to swing around and FIRE.\n          BOOM! Gabriel is blown back partially through the rear\n          window. He holds onto the car with an iron grip. Starts to\n          pull himself back in. Nothing slows this guy down.\n          Jeep pulls the trigger again and...CLICK.    No bullets!\n          Audrey frantically reloads the flare gun. Brings it up to\n          fire, but he's too fast! WHACK! Gabriel knocks her into the\n          side of the car with a sweep of his hand. She's out cold.\n\n          \n\n                                                                     99.\n\n          \n\n          \n          Now he's clawing his way unobstructed toward Charlie again.\n          Jeep knows there's only one thing to do.\n\n                              JEEP\n                    Get down on the floor!\n          Charlie pushes herself and the baby down on the floor in\n          front of the passenger seat.\n          Jeep PUNCHES IT.   The speedometer leaps ahead.\n\n          70...80...90...\n          Gabriel's now completely in the car.   They're helpless.\n          Gabriel lunges over the passenger seat, grasping for Charlie,\n          his ferocious hand only inches from her and the baby, when...\n\n                              AUDREY (O.S.)\n                    Get off her, you fucking asshole!\n          Audrey leaps onto Gabriel, pulling him away from Charlie just\n          in time. He flails wildly about but this young girl rides\n          him like one helluva a cowboy.\n\n          100...110...120...\n\n                              AUDREY\n                    Do it, Jeep! Do it now!\n\n          JEEP SLAMS ON THE BREAKS, SENDING GABRIEL AND AUDREY SHOOTING\n\n          FORWARD THROUGH THE WINDSHIELD LIKE A BULLET.\n          The intertwined bodies of Gabriel and Audrey hit the road\n          with a sickening crunch and ROLL INTO A BALL OF FIRE.\n\n          \n\n          EXT. RED ROCK PARK - CONTINUOUS\n\n          The Cruiser spins out of control, swerving off the road and\n          careening into a large rock formation.\n          This ride is over.\n\n          \n\n          INT. POLICE CRUISER - CONTINUOUS\n\n          Jeep's side of the car is crushed.   Blood is running down his\n          forehead.\n          Charlie crawls up from the floor.\n\n                              CHARLIE\n                    C'mon, Jeep!\n\n          \n\n                                                                    100.\n\n          \n\n          \n          He tries to focus on her.\n\n                                CHARLIE\n                    Jeep!\n          She kicks open her door and begins pulling him out.\n\n                                JEEP\n                    The baby?\n\n                                CHARLIE\n                    Alive.\n\n                              JEEP\n                    And what about...\n\n                              CHARLIE\n                    Nothing could have survived that.\n\n                              JEEP\n\n                        (ANGUISHED)\n                    Audrey...\n\n                              CHARLIE\n                    She saved us, Jeep. Audrey saved\n                    us. Now c'mon, we gotta go!\n          Charlie, the baby bundled in her hands, leads Jeep away from\n          the demolished Cruiser.\n\n          \n\n          EXT. RED ROCK RIDGE - PRE-DAWN\n\n          Jeep and Charlie, battered and bruised, struggle to make the\n          long climb up the ridge.\n          Charlie looks up.\n          STARS completely fill the pre-dawn sky.   Breathtaking.\n\n                              CHARLIE\n                    How can this happen?\n\n                                JEEP\n                    What?\n\n                               CHARLIE\n                    How can this happen in a world so\n                    beautiful?\n          Jeep follows her gaze to the sky.\n          Endless stars.    Confounding.\n          Jeep shifts his eyes to the TOP OF THE RIDGE just ahead.\n\n          \n\n                                                                    101.\n\n          \n\n          \n\n                              JEEP\n                    C'mon, we're almost there.\n          They are only a few steps from the EDGE OF THE RIDGE when --\n\n          GABRIEL ROCKETS UP IN FRONT OF THEM!\n          Charlie screams! Jeep pushes her and the baby out of the way\n          just as Gabriel comes down hard in front of them, kicking up\n          a cloud of dust.\n          Gabriel's mechanical wings haltingly retract. The crash has\n          done some serious damage. Much of his skin has burned away.\n          Chunks of his armor and flesh are missing as well, including\n          a large part of his head, revealing that under his human\n          visage is a NIGHTMARISH CREATURE.\n          Gabriel charges at Jeep fast. Jeep whips up his Glock, BLAM!\n          Gabriel takes the bullet, then slaps the gun out of Jeep's\n          hand.\n          Jeep throws a wild punch, connects with Gabriel's chin,\n          rocking him back. More annoyed than surprised, Gabriel\n          knocks Jeep savagely to the ground.\n          Jeep struggles quickly to his feet, comes right back at\n          Gabriel swinging. But Gabriel simply knocks him to the dirt\n          again.\n          Jeep slowly gets up once more, bleeding, hurt.   Raises his\n          fists. This kid will simply not give up.\n          Jeep moves in again, swinging hard, but Gabriel blocks it,\n          shoots out a hand and grabs Jeep by throat, lifting him clear\n          off the ground.\n\n                              GABRIEL\n                    So brave. So pointless. You\n                    should have worried more about\n                    saving yourself.\n          Jeep's feet dangle. His eyes bulge out. He claws at\n          Gabriel's iron-fast grip, but there's no hope.\n          Charlie watches in horror.\n\n                               CHARLIE\n                    Stop!   Please! Don't kill him!\n          But Gabriel is doing just that. Jeep is rapidly losing\n          consciousness. The battle is lost.\n\n                              GABRIEL\n                    Go to sleep...\n          Jeep's eyes flutter.   He's almost gone.\n\n          \n\n                                                                   102.\n\n          \n\n          \n\n                               CHARLIE\n                    Stop it!   I'LL GIVE YOU THE BABY!\n          This gets Gabriel's attention.\n          Charlie climbs to her feet, holding the bloody bundle out to\n          him.\n\n                              CHARLIE\n                    I don't want this responsibility!\n          Tears run down her face.   She's dead fucking serious.\n          Gabriel lets go of Jeep.   He falls to the ground, gasping\n          desperately for air.\n\n                              JEEP\n                    Charlie, no!\n          Gabriel takes the bundle from Charlie, turning away from her.\n\n                              GABRIEL\n                    \"And as the child's cries are\n                    extinguished, an eternal darkness\n                    at last descended upon the world.\"\n          He peels the cloth back, revealing...\n\n          THE GRENADE.\n          He spins around to face Charlie.\n          She's holding the pin.\n\n          KABOOM!\n\n          GABRIEL IS BLOWN TO BLOODY BITS.\n          The creature is gone at last.\n          The sound of a BABY COOING.\n          Charlie picks the child up out of the brush.\n          She helps Jeep to his feet and together they slowly make\n          their way to the top of the ridge.\n\n          \n\n          EXT. RED ROCK RIDGE - DAWN\n\n          Jeep and Charlie stand overlooking the desert valley below.\n          ON THEIR FACES, reacting to what they see.\n          Charlie takes Jeep's hand in hers.\n\n          \n\n                                                                      103.\n\n          \n\n          \n\n                               JEEP\n                     We made it.\n\n                               CHARLIE\n                     Yep, we sure did.\n          And now we see it too:\n\n          \n\n          THE MOJAVE DESERT - DAWN\n          Vast.   Barren.   No signs of life.\n          No resistance force.    No nothing.\n\n          \n\n          ON JEEP AND CHARLIE\n          Taking it in.     Breathing hard.\n\n                               JEEP\n                     I'm sure they're just over the next\n                     ridge.\n          He glances at Charlie.    Worry in her eyes.\n\n                               CHARLIE\n                     What if we're on our own now?\n\n                                JEEP\n                     Don't be afraid.    We'll be okay.\n\n                         (BEAT)\n                     Believe me.\n          At those words, Charlie looks deep into Jeep's eyes.       Sees a\n          confidence in them she's never seen before.\n          And she leans in and kisses him.      Tender.\n          When they part, Jeep stares back at her with surprise.      Then\n          the surprise melts into a smile.\n          And they descend the ridge...out of sight, leaving us with a\n          view once again of --\n\n          \n\n          THE MOJAVE DESERT - DAWN\n          A BLOOD RED SUN rises behind the distant mountains. The\n          unbearable cold will soon become an unbearable heat.\n          And we're back where we started.\n          A YOUNG WOMAN'S VOICE.    Solemn.   Weary.   Determined.\n\n          \n\n                                                                   104.\n\n          \n\n          \n\n          IT'S CHARLIE'S VOICE.\n\n                              CHARLIE'S VOICE\n                    Someday when my son is older, I\n                    will tell him about the time of his\n                    birth when all the world was\n                    covered in a great darkness...\n\n                                                          DISSOLVE TO:\n\n          \n\n          INT. CAR - DRIVING - MORNING - WEEKS LATER\n\n          Jeep is at the wheel. He looks aged, scarred from the\n          experience. His exposed arms are completely covered with the\n          INTRICATE WRITING...The Instructions. The boy he once was is\n          gone at last and the warrior protector has replaced him.\n\n                              CHARLIE'S VOICE\n                    ... And how just at the moment when\n                    everything seemed lost...\n          Charlie sits across from him, the baby cradled in her arms.\n          It's strange, but you might actually mistake them for a happy\n          family. Of course you'll have to ignore the ARSENAL OF\n          WEAPONRY in the back seat.\n\n                              CHARLIE'S VOICE (CONT'D)\n                    ...a mighty warrior fell in order\n                    to save me.\n          Jeep glances over at Charlie and the baby.   He smiles at the\n          image of maternal bliss.\n\n                              CHARLIE'S VOICE (CONT'D)\n                    And a boy faced his fear and rose\n                    up to save us all.\n          The sun shines through the car windows, filling our eyes with\n          its fiery light.\n\n          \n\n                                     THE END \n\n\n\n\n\nLegion\nWriters :   Peter Schink  Scott Stewart\nGenres :   Action  Fantasy  Horror  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "After Joan Randall (Blanche Bates) accuses her fiancé Jim Cleeve (Eugene Strong) of being a coward, he joins a gang of outlaws called the Border Legion. Feeling guilty about how she treated him, Joan follows after Jim and is soon attacked by gang leader Jack Kells (Hobart Bosworth), whom she shoots.\nIn the coming days, Joan nurses the outlaw back to health, earning his undying gratitude and a promise that he will always protect her. Later, when Jim reclaims her, Jack follows after the couple and threatens him. As the law closes in on the Border Legion, Jack tries to prevent the gang from using Joan as a hostage. During a confrontation, Jack is killed by his own gang. A posse soon arrives and save Joan and Jim."}