{"title": "Lord of War", "full_text": "Lord of War\nWriters :   Andrew Niccol\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "The film begins with a voice-over introduction by Yuri Orlov (Nicolas Cage), a Ukrainian-American gunrunner: Over 550 million firearms worldwide means one firearm per twelve people on the planet; he wonders how to arm the other eleven. Opening credits are set to the Buffalo Springfield song \"For What It's Worth\", and depict the life of a 7.62×39mm cartridge from construction in a Soviet Union weapons factory, to being shipped across the world to an African warzone, loaded into the magazine of an AK-47, and fired into the head of a child soldier.\nIn the early 1980s, Yuri is visiting a Brighton Beach restaurant, where a Russian mobster kills two would-be assassins. He is inspired to go into the arms trade, comparing the constant need for weapons to the similar human need for food. At his father's synagogue, he contacts an Israeli to obtain an illegal Uzi. After completing the first sale, Yuri convinces his brother Vitaly (Jared Leto) to become his partner, and they leave their jobs at the family restaurant behind.\nYuri's first big break comes in the 1982 Lebanon War, when he sells guns to all sides of the conflict, despite witnessing war crimes and atrocities. As Yuri becomes more successful in the war's aftermath, his business comes to the attention of Interpol, and in particular idealistic agent Jack Valentine (Ethan Hawke). Valentine is after glory rather than money, making it impossible for Yuri to bribe him as he does other government agents within Interpol and elsewhere in 1989.\nDuring a sale in Colombia, a drug lord pays with six kilos of cocaine instead of cash, and shoots Yuri with one of his own pistols when the two argue. Yuri relents, later finding the sale of the cocaine paid better than money would have. After sampling their profits, Vitaly becomes heavily addicted and absconds with an entire kilogram, prompting a lengthy search before he is discovered in a remote village. After several months, Yuri checks Vitaly into rehab, and continues alone. He lures childhood crush Ava Fontaine (Bridget Moynahan) to a false photo shoot and subsequently marries her. They later have a son, Nikolai (Nicky).\nYuri's second big break is the dissolution of the Soviet Union. After Mikhail Gorbachev resigns on Christmas Day 1991, Yuri flies to Ukraine and illegally buys tanks and weapons through his uncle, a former Soviet General. Expansion to Africa leads to Andre Baptiste Sr. (Eamonn Walker), a ruthless dictator waging a never-ending civil war in Liberia. During one flight into Africa, Yuri's cargo plane is intercepted and forced to land by a fighter jet commandeered by Jack Valentine and Interpol. He escapes arrest by landing outside the nearby city, and by simply handing out the cargo to locals, he ensures no weapons are on the plane by the time Valentine arrives. Surveillance of Yuri and his activities continues at his home in the United States, however. Unable to charge Yuri, Valentine tells Ava he is an arms dealer, prompting her to confront him and demand he stop his illegal business. For a time, Yuri agrees, but Andre Baptiste Sr. offers him even more money and soon he goes back.\nYuri soon goes to complete a sale in Africa in 2001, where a militia force allied with Andre Baptiste Sr. is visibly preparing to destroy a refugee camp. When Vitaly sees the militia hack an escaping woman and child to death with a machete, he pleads with Yuri to walk away. Yuri refuses; if he backs out, the militia will simply kill the Orlov brothers along with the refugees. Stricken with guilt, Vitaly steals a pair of grenades, destroying one of the weapons trucks and killing Baptiste Jr. Before he can reach the second truck, he is gunned down by RUF soldiers. Before expiring, Vitaly attempts to arm the remaining grenade but is prevented by Yuri, who surrenders it to the soldiers. Yuri reluctantly accepts half of the original diamond payment for the remaining weapons.\nAt home, Ava has discovered Yuri's cache of his arms dealing activities. She leaves with their son while Yuri's parents disown him after learning the circumstances surrounding the death of Vitaly and the true extent of Yuri's activities. When the U.S. Customs finds a bullet in Vitaly's corpse, Valentine arrests Yuri, who predicts correctly that a knock at the door will signal his release as a \"necessary evil\" who distributes weapons so major governments can deny involvement. Despite his losses, Yuri returns to arms dealing. Yuri remarks that it's what he does best, and that arms dealers are most likely to inherit the world one day \"because everyone else is too busy killing each other.\" His final advice to the viewer is, \"Never go to war, especially with yourself.\"\nAn onscreen postscript states that private dealers conduct less business than the five largest arms exporters – the United States, United Kingdom, Russia, France, and China – who are the five permanent members of the United Nations Security Council."}