{"title": "Lord of Illusions", "full_text": "Lord of Illusions\nWriters :   Clive Barker\nGenres :   Fantasy  Horror  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In the Mojave Desert in 1982, a man named Nix (von Bargen) has gathered a cult in an isolated house. Nix calls himself \"The Puritan\" and has the ability to use real magic. He plans to sacrifice a young girl that he has kidnapped. While Nix is preaching to his followers, a group of former cult members –Swann (O'Connor), Pimm (Traylor), Quaid (Latimore) and Jennifer Desiderio (Tousey)– arrive to stop him. After the initial confrontation with the cultists, Nix's assistant Butterfield escapes and Swann is attacked by Nix. Nix uses his powers, inducing in Swann the vision of “Flesh with a God's Eyes\", causing him to see his friends as monstrous figures. The kidnapped girl shoots Nix through the heart with Swann's gun. Quaid and Jennifer shoot him until he falls. Swann snaps out of his vision and fastens an ironwork mask over Nix's head, who appears to die. Swann declares that they will bury Nix so deep that no one will ever find him.\nThirteen years later, New York City private detective Harry D'Amour (Bakula) is investigating an insurance fraud case in Los Angeles. D'Amour has a long-standing interest in the occult, and has some renown from his involvement with a recent exorcism. During the investigation, D'Amour discovers a fortune teller shop owned by Quaid, where he is relentlessly attacked by a skinhead with unusual strength. D'Amour finds Quaid suffering from multiple stab wounds. As he dies, Quaid warns D'Amour that “The Puritan” is coming. D'Amour reports the incident to the police, but they can't find the bald man's body.\nSwann, now a famous stage illusionist, lives in a Beverly Hills mansion with his wife, Dorothea (Janssen). Swann informs Dorothea that Nix's followers have murdered Quaid. Dorothea suggests they hire D'Amour to investigate the murder. Swann's assistant, Valentin (Swetow), collects D'Amour, informing him that Swann is a performer, not a \"real\" magician. They attend Quaid's funeral, where D'Amour is introduced to Dorothea. He agrees to work for her and she invites him to Swann's magic show. Butterfield and the bald man are in the audience. Swann performs a new death-defying illusion, but it goes wrong and he is killed on stage. D'Amour investigates the accident backstage, and is attacked by Butterfield and the bald man. D'Amour impales the bald man on a prop.\nD'Amour learns that Jennifer Desiderio is now institutionalized. D'Amour visits her and sees that she is irrevocably insane. When he mentions Swann, she becomes violently agitated and screams warnings about Nix and \"The Puritan\". Jennifer flees into the street, where she is hit and killed by a car. After hours, D'Amour enlists Inferno's help to get into The Repository, a special room in the Magic Castle that supposedly contains every magic secret known to man. In the Repository they discover files hidden behind a trap wall and D'Amour learns that Swann's \"illusions\" involved real magic.\nD'Amour goes to The Magic Castle, where he meets Billy Inferno, another illusionist. During pointed questioning at a members meeting, D'Amour manages to infuriate one of the more influential members, drawing his ire and demands that other members disallow D'Amour further access and cooperation. Inferno has heard of Nix described as a legend, and believes that Nix was the individual who taught Swann. He later goes to Swann's house to confront Dorothea about the truth of who and what Nix was exactly. She reveals that she was the girl that Nix kidnapped, and that she married Swann because she felt she owed her life to him, Dorothea and D'Amour then make love. Afterwards he is attacked by a man engulfed in fire. Suspecting a ruse, D'Amour opens Swann's coffin and finds that the body inside is fake. Valentin explains that he helped Swann fake his death. D'Amour agrees to allow Valentin and Swann's ruse to continue. At the funeral, D'Amour follows a suspicious looking man who turns out to be Swann. Knowing of D'Amour and Dorotheas' tryst, a jealous Swann attacks D'Amour with magic, but fails. D'Amour convinces an emotionally hurt Swann to help him put an end to Nix's cult.\nButterfield attacks Valentin and kidnaps Dorothea. Butterfield uses Dorothea as a hostage to force Valentin to recover Nix's body. After finding Nix's corpse, Butterfield stabs Valentin and takes the corpse back to the old house in the desert. There, his cultists (13 years later) have returned to witness Nix's resurrection and follow him once again. Butterfield removes the iron mask and Nix regains consciousness. Swann and D'Amour, acting on information given by the dying Valentin, arrive. Butterfield attacks D'Amour. Swann attacks Butterfield and tells D'Amour to rescue Dorothea. Nix, instructing his followers to prepare to receive his wisdom, opens a hole in the ground beneath him and Dorothea and turns the earth to quick sand that swallows the cultists. He declares that only Swann is worthy of receiving his knowledge.\nD'Amour finds Nix and Dorothea just as Nix is dropping her into the hole. D'Amour rescues Dorothea. As they flee, D'Amour and Dorothea are attacked by Butterfield, whom D'Amour kills. Swann agrees to act as Nix's disciple in an effort to stall for time. Nix sees through the ruse and attacks Swann with magic. Nix invokes \"Flesh with a God's Eyes\" on D'Amour. Dorothea shakes him back to consciousness. She finds D'Amour's gun and shoots Nix in the head. Nix uses his powers to fling Dorothea aside, and then begins to transform into a hideous creature. Swann uses magic to help D'Amour deliver a final blow to Nix. Nix is distracted and falls into the hole, now filled with lava. Dorothea holds Swann in her arms, as he succumbs to his injuries. D'Amour sees that Nix, hideously injured but alive, is summoning a whirlwind, which ends up sealing the hole. Dorothea and D'Amour escape the house and walk into the desert."}