{"title": "Man on Fire", "full_text": "Man On Fire\n\n\n\n                   by\n\n             Brian Helgeland\n\n\n\n          Based on the novel by\n              A.J. Quinnell\n\n\n\n\n            February 10, 2003\n                 (V 2.0)\n\n\n\n\nProperty of New Regency Productions, Inc.\n\nWork in Progress 2/10/03                                    1.\n\n\n\"Man On Fire\"\n\nOPENING TITLE SEQUENCE\n\nEXT.   MEXICO CITY - DAY\n\nHigh over the city on a bright Sunday morning, the sun\npounding its way through the orange haze of smog. As we\ndescend toward the clots of traffic blocking the streets:\nthe sounds of a Mass being sung.\n\nA CATHOLIC CHURCH\n\nThe big wooden doors open to release the parishioners\ninside. Feature a tall, lanky 18-YEAR-OLD. Holding his\nGIRLFRIEND'S hand, anxious for Sunday to really begin.\nThey don't notice the traffic suddenly thin, like a\nfaucet's been cranked down. They move toward a Mercedes\n500. As a CHAUFFEUR holds the back door open for them...\n\nA GRAND MARQUIS\n\nSqueals around the corner, lurches to a stop alongside\nthe Mercedes. FOUR MEN get out flashing  badges. In a\nmoment they're hustling Eighteen toward the car, stiff-\narming the chauffeur. As the girlfriend  cries and the\ngossip among the parishioners begins...\n\nThe Grand Marquis pulls away.\n\nINT.   GRAND MARQUIS - DAY\n\nThey shove eighteen down to the floor of the backseat.\nThese guys are not the police.\n\nA switchblade is flicked open. Practiced hands slit the\nboy's Sunday suit from the base of his neck to his heels.\nEighteen yelps as the blade draws blood across one calf.\n\nDuct tape is wrapped around his hands, eyes, and head.\n\nEXT.   WOODED AREA - DAY\n\nThe Marquis is parked across from another CAR. FOUR NEW\nGUYS wait as Eighteen is hauled out of the Marquis. His\nclothes drop away like a snake shedding its skin. He\nstands naked, bound and blind. Eighteen is handed over\nfrom one group to the other.\n\nINT. TELEPHONE - UPSCALE HOME - MEXICO CITY - DAY\n\nThe phone rings. A bomb going off. Eighteen's\ndistraught FATHER (family photos of the boy on the wall)\nanswers.\n\nWork in Progress 2/10/03                                    2.\n\n\nREVERSE TO REVEAL a battery of POLICE and NEGOTIATORS in\nthe room with him. One of them listens in, waves fingers\nat him as the negotiations begin.\n\nINT.   VIDEO SURVEILLANCE OF AN 8' X 4' CELL - DAY\n\nA wall smeared with God-knows-what. Facing   it, Eighteen\nstands naked blindfolded and shivering. The   back of his\nleg still bleeds. He shifts nervously as a   little JACK\nRUSSELL TERRIER eagerly licks the blood off  his calf.\n\nA MAN ('The Dreamer'), we don't see his face, negotiates\nby cell phone. Voice calm. As he runs numbers, he slaps\nhis thigh. Jack Russell trots over, gets an ear\nscratched.\n\nAt a motion from the man, Eighteen is taken down to the\nground. Straddled by two men, his head is mummified in\ntape leaving one ear exposed.\n\nCUT TO T.V. - Rosanna Garcia Guerrero, editor of REFORMA\nnewspaper, being interviewed, \"...organized crime\nsyndicates...growth of kidnapping in Mexico over the last\ntwo years.\"\n\nEXT.   UPSCALE HOUSE - DAY\n\nAs a hand removes a ziplock baggie from the mailbox. A\nglimpse of something we don't want to see. An ear\npartially obscured by sweating plastic and a blood smear.\n\nEXT.   CITY SQUARE - MEXICO CITY - NIGHT\n\nA MERCEDES driving around the square, Eighteen's father\nwaving a white shirt out the window like a surrender\nflag.\n\nEXT.   BRIDGE - NIGHT (3 AM)\n\nFootbridge over railway sandwiched between freeway.\nEmpty train blazes through. Dangerous, deserted downtown\nneighborhood. Looks more like \"war torn Beirut\", burnt\nout cars and trash. The 18 year old's father, naked to\nthe waist, walks from the family Mercedes over the\nfootbridge carrying a pillowcase full of cash to a semi-\nderelict car on the opposite side with a white piece of\nfabric taped in the rear windshield and trunk open. He\nslams the pillow case in the trunk and leaves.\n\nEXT.   DOWNTOWN MEXICO CITY - TWILIGHT\n\nRUSH HOUR. A red stream of headlights separated from a\nwhite stream of taillights by a narrow median.\n\nWork in Progress 2/10/03                                        3.\n\n\nHORNS blare as a CAR stops. Eighteen, still blindfolded,\nis dumped on the median. The car pulls away.\n\nHe stands there in the whirlwind. Pathetically SCREAMING\nfor help. More horns, shouts, no help.\n\nEND MAIN TITLES.   Goes to black.\n\n                          CREASY'S VOICE\n             Ezekiel 25:17 Blessed is he who in the\n             name of charity and good will shepherds\n             the weak through the valley of darkness\n             for he is truly his brother's keeper and\n             the finder of lost children.\n\n                                                 DISSOLVE TO:\n\nINT.   AGO'S - MEXICO CITY - DAY\n\nSamuel Valencia Ramos and his lawyer Jordan Kalfus in the\nprivacy of an alcove table. Jordan is well heeled, well\nconnected and well oiled. In that order. Samuel, at 40,\nalready has the patrician look that has served the male\nmembers of his family for generations. They discuss the\nkidnapping, a headline on the paper Jordan tosses aside.\n\n                          JORDAN\n             The family paid the ransom and he was\n             returned two days later.\n                    (laughs; chews)\n             His father still hasn't gotten up the\n             nerve to ask him if they fucked him up\n             the ass.\n\n                          SAMUEL\n             And now every mother with money in Mexico\n             City wants bigger and better bodyguards.\n             My own wife included.\n\n                          JORDAN\n             If she pisses you off, you get another one.\n\n                          SAMUEL\n                    (laughs grimly)\n             Do you know what she told me last night?\n\n                                                 FLASH TO:\n\nINT.   SITTING ROOM - RAMOS VILLA - MEXICO CITY - NIGHT\n\nSamuel sits at his baby    grand piano playing a gentle\nrendering of 'Delibes'.     His American wife LISA stands\naway from him. Just the     sight of her back reveals a\npitch perfect petulance.    She tells him:\n\nWork in Progress 2/10/03                                       4.\n\n\n                          LISA\n             A man's worth can be judged by what he\n             has or what he owes. Only the amount\n             matters.\n\n                          SAMUEL\n             And bankruptcy. Where will that put me\n             in the social strata?\n\n                          LISA\n             I'm only asking for one thing. And it's\n             not an extravagance. It's not even for\n             me; it's for our daughter.\n\n                             SAMUEL\n             Our daughter.\n\nShe turns at that: a woman so beautiful it nearly hurts\nto look at her. She stares, plays him like Chinese\nCheckers.\n\n                          LISA\n             Our child's safety is at stake.\n\n                          SAMUEL\n                    (stops playing)\n             These people are professionals. They\n             don't waste their time taking children\n             whose fathers are virtually bankrupt.\n\n                          LISA\n             Samuel, it is not something we should\n             skimp on. A bodyguard's presence in the\n             car or outside the school was at least\n             some form of deterrent. Now he's gone, I\n             feel totally exposed.\n\nShe just stares at him.    He melts.\n\n                                                  RETURN TO:\n\nINT.   AGO'S - MEXICO CITY - DAY\n\nJordan smiles at his client, enjoys seeing him squirm.\n\n                          SAMUEL\n             Of course I care about Pinta. She'll be\n             as beautiful as her mother one day.\n\n                           JORDAN\n             Yeah?   And if she was ugly?\n\nSamuel rolls his eyes. Jordan laughs.       Beheading two\ncigars, he passes one to Samuel.\n\nWork in Progress 2/10/03                                5.\n\n\n                         JORDAN\n            All my clients have kidnap and ransom\n            insurance.\n\n                         SAMUEL\n            I have a policy, AIG. It covers me and\n            my family and when it runs out in sixty\n            days, without a bodyguard, I will not be\n            able to renew it.\n\n                         JORDAN\n            I know you need to please Lisa. An ass\n            like that is hard to find. Good\n            bodyguards are even harder.\n\n                         SAMUEL\n                   (interrupts)\n            I know! I just had to let one go because\n            I couldn't afford him!\n\nJordan lights his cigar.\n\n                         JORDAN\n            You need a bodyguard of some description.\n            It's a dangerous world we live in. But\n            you will get what you pay for. He\n            doesn't need to be Superman, does he?\n            Can you go fifteen grand?\n\n                           SAMUEL\n            For a year?\n\n                         JORDAN\n            For a few months. Hire someone cheap.\n            You have to have a bodyguard to keep the\n            insurance. Then fire him for\n            incompetence. The important thing is\n            Lisa's daughter will return to school.\n\nSamuel finally follows the logic.\n\n                         SAMUEL\n            And Lisa will be able to save face.    We\n            won't be the only family without a\n            bodyguard.\n\n                         JORDAN\n            Her beauty fucks with your mind.\n\n                         SAMUEL\n            For an American she understands this\n            country very well.\n\nWork in Progress 2/10/03                                   6.\n\n\n                           JORDAN\n              She understands men.\n\nAs Samuel puffs his cigar in satisfaction...\n\nEXT.    CORRIDOR - MEXICO CITY AIRPORT - DAY\n\nAs a 747 is towed by in the background, a MAN strides at\nus. CREASY. Even in movement, he has a stillness, an\nair of isolation. He's set apart from other living\nthings.\n\nHe wears dark sunglasses, carries a well-worn leather\nbag. Inscrutable. Disconnected. A bit frightening.\nThe discipline of a soldier. The independence of a\ngunslinger.\n\nAutomatic baggage teller (Red Light, Green Light).\nCreasy feeds the machine with his perforated customs\ncard. Light flashes RED.\n\nCUSTOMS MAN\n\nHe flips through Creasy's passport. Even the stamps have\nstamps. Thailand. Somalia. Cuba. Columbia. Hong\nKong. Saudi Arabia. Every country in Europe. Guy's\nbeen around.\n\nCustoms looks up from the ink blue American Eagle to the\ndeep matte black of Creasy's sunglasses.\n\nNOTE:    Italics denotes the lines spoken in Spanish.\n\n                           CUSTOMS\n              Where are you coming from?\n\n                           CREASY\n              South America.\n\n                           CUSTOMS\n              Where are you staying in Mexico?\n\n                           CREASY\n              I'm on to Juarez.\n\n                           CUSTOMS\n              Why?\n\n                           CREASY\n              I have a friend there.\n\nCustoms looks at Creasy a moment. He doesn't look like a\nman who has 'friends'. Finally, customs smiles.\n\nWork in Progress 2/10/03                                   7.\n\n\n                          CUSTOMS\n             I cannot see your eyes, Senor.\n\nCreasy slips off the sunglasses. His eyes are deserted.\nInevitable. Customs can only look into them a moment.\nHe indicates for Creasy to put his bags on a conveyor\nbelt leading to an X-ray machine. Creasy lifts his bag\nonto the conveyor. The official hits the start button.\nThe bag drives forward towards the X-ray machine.\n\nCreasy pauses, then offers up a license from his wallet.\n\n                             CUSTOMS\n             Senor?\n\n                          CREASY\n             It's a permit to carry a gun in Columbia.\n             The gun you're about to find in that\n             suitcase.\n\nPolaroid FLASH\n\nShot of Creasy straight on.     Shot of Creasy profile.\n\nFLASH.   Fingers being fingerprinted.\n\nJUMPCUTS - suitcase being stripped and ripped (MIDNIGHT\nEXPRESS), pack of Marlboro, bottle of Jack Daniels,\nglimpse a weathered Bible (New Testament), intercut with\nseven pieces of blue steel separated in different parts\nof the bag, ie. toiletries, underwear, lining of\nsuitcase.\n\nThe seven pieces laid together look remarkably like a\nwell travelled Sig Sauer 226. Creasy smiles.\n\nEXT. JUAREZ, MEXICO FOUR BIG BURLY SUV'S - DRIVING\nACROSS THE BORDER CHECKPOINT - DAY\n\nINT. SUV - DAY\n\nSix Japanese BUSINESSMEN jabber on cellphones. PAUL\nRAYBURN sits up front trying not to spill coffee on the\nmini Uzi cradled in his lap. As his own cell phone\nrings, he answers.\n\n                             RAYBURN\n             Rayburn here.\n\nINT. CUSTOMS HOLDING TANK - MEXICO CITY - DAY\n\nCreasy on payphone.\n\nWork in Progress 2/10/03                                        8.\n\n\n                            CREASY\n               When did Mexican Customs start getting\n               smart?\n\nRAYBURN's SUV\n\n                             RAYBURN\n               Creasy???   Where the fuck are you?\n\nCUSTOMS JAIL\n\n                             CREASY\n               I'm here.\n\nRAYBURN's SUV\n\n                            RAYBURN\n               What do you mean, I'm here?\n\nCUSTOMS JAIL\n\n                            CREASY\n               I'm in a Customs holding tank in Mexico\n               City International. Bring a bunch of\n               cash... about 5K. I'm going to need it.\n\nINT. CUSTOMS AREA - A BACK OFFICE\nRayburn has 5K U.S. dollars laid out on      the desk between\nhim, the Customs official, and Creasy.       The remains of\nthe suitcase are spread around the room.       The main\noffender, the gun being front and center      next to the\ncash. Looks like the official is going       to fold.\n\n                            RAYBURN\n               This is going to cost you big time.\n\nINT. STRIP BAR - Rethink Location\n\nA stripper does a half hearted grind as Rayburn and\nCreasy sit at the bar sharing a bottle of 'Jack'.\n\n                            RAYBURN\n               You got a secondary search and you had a\n               gun.\n\n                            CREASY\n               Listen it was a calculated risk. I've\n               done it a million times and never got\n               caught.\n\n                            RAYBURN\n               Everything happens once if you live long\n               enough.\n\nWork in Progress 2/10/03                                     9.\n\n\n                         CREASY\n            It doesn't make sense to x-ray your bags\n            coming off the plane.\n\n                         RAYBURN\n            This is Mexico, they do everything\n            backwards.\n\nCreasy hits the 'Jack'.\n\n                         RAYBURN\n            So what's wrong?\n\n                         CREASY\n            Nothing wrong.\n\n                         RAYBURN\n            Don't give me that bullshit.\n\nCreasy changes subject.\n\n                         CREASY\n            So how's business?\n\n                         RAYBURN\n            Japanese are here in a big way. Cheap\n            labor. Factory space. But they feel a\n            lot safer living over the border in El\n            Paso. I ferry 'em back and forth. They\n            think I'm John-fucking-Wayne.\n\n                         CREASY\n            But don't you stay in El Paso?\n\n                         RAYBURN\n            Fuck, I love Mexico.   I live like a king\n            down here.\n\nCreasy takes a look around the Seedy Bar.\n\n                         CREASY\n            Yeah, right...\n\n                         RAYBURN\n            Oh, like you haven't been in worse\n            places.\n\n                         CREASY\n            And a level five shithole is better than\n            a level six. Your logic's inescapable.\n\nRayburn laughs. Creasy takes the bottle.     Creasy's hand\nis mottled by old burn marks.\n\nWork in Progress 2/10/03                                    10.\n\n\n                            RAYBURN\n               You been working?\n\n                            CREASY\n               Not for eight months. I was in Columbia\n               looking around, but, nothing seemed\n               interesting.\n\n                            RAYBURN\n               How long you staying, Crease?\n\n                            CREASY\n                      (shrugs)\n               Got no plans, Rayburn, Nothing on. Just\n               wanted to see you, how you were. Came by\n               on impulse.\n\nRayburn studies his friend a beat, just seeing the cracks\nthat weren't there last time they met.\n\n                            RAYBURN\n               You did something on impulse?\n\n                            CREASY\n               Everything happens once if you live long\n               enough.\n\nCreasy smiles.\n\nINT.   PINTA'S BEDROOM - MEXICO CITY - NIGHT\n\nNine-year-old PINTA MARTIN RAMOS stares out at the\ngarden, a bit like Creasy, but only a ten yard stare.\nPinta's eyes brim with life. She folds her hands, closes\nher eyes, prays. 'Chopin' drifts up from downstairs.\nSamuel on the baby grand.\n\n                            PINTA\n               Dear God. I do not ask for health. Or\n               wealth. People ask you so often that you\n               can't have any left. Give me God what\n               you still have. Give me what no one else\n               asks for. Amen.\n\nPinta grabs a battered old TEDDY BEAR and climbs into\nbed. She pulls the covers up, looks over as her door\nopens.\n\nLisa enters.    Pinta is her daughter.\n\n                            LISA\n               You should be sleeping, baby.\n\nWork in Progress 2/10/03                                   11.\n\n\n                         PINTA\n            I'm trying, mom.\n\nLisa strokes her head, smiles.\n\n                            LISA\n            Good news.     You're going back to school.\n\n                          PINTA\n                    (sits up; excited)\n            When?\n\n                         LISA\n            Samuel is going to hire a new bodyguard.\n            It may take a few days, but you're going\n            back.\n\nPinta lets it sink in.   Lisa kisses her goodnight.\n\n                         PINTA\n            Could he speak English?     Emilio couldn't\n            speak English.\n\n                        LISA\n            We'll see. And thank your father in the\n            morning. A man always needs to be\n            thanked.\n\nEXT. - JUAREZ DESERT - DAWN\n\nFour SUV's blast along a desert highway on their way to\npick up some Japanese businessmen. Rayburn rides\nshotgun, Creasy in the back. Rayburn looks like he slept\nin his clothes. Creasy looks crisp and clean.\n\n                         RAYBURN\n            That's right, a bodyguard.\n\nCreasy looks at him blankly.\n\n                         RAYBURN\n            Your Spanish is good enough.     You\n            certainly look the part.\n\n                         CREASY\n            You're crazy. People would hire a has-\n            been, Ray? A drunk?\n\n                         RAYBURN\n            Well, you'd have to keep it under\n            control.\n\nWork in Progress 2/10/03                                  12.\n\n\n                         CREASY\n            And what if, just say, there was a kidnap\n            attempt?\n\n                         RAYBURN\n            You do your best. They won't be paying\n            you enough to perform miracles.\n\nCreasy just shakes his head.\n\n                         RAYBURN\n            It's not exactly a scam, Crease. Even at\n            half speed you're pretty damn good.\n\n                          CREASY\n            A bodyguard has to be close to someone\n            all the time. Willing to talk. I'm not\n            good at that.\n\n                         RAYBURN\n            So you'll be the silent type.    People\n            will appreciate that.\n\nCreasy shakes his head, looks out the window.\n\n                         RAYBURN\n            What are you doing here?\n\n                         CREASY\n            I came to visit you.\n\n                         RAYBURN\n            Bullshit. I've known you fifteen years.\n            You don't visit.\n\n                         CREASY\n            A bodyguard... Who's the guy?\n\n                           RAYBURN\n            Samuel Ramos.    Owns one of the plants in\n            Juarez. The    Jap car industry is in the\n            toilet. He's    trying to persuade Ford to\n            partner with   him. I think he's in\n            trouble. He    asked me if I knew anyone he\n            could trust.\n\n                         CREASY\n            Oh, now you think I can be trusted.\n\n                         RAYBURN\n            Take a job, Creasy. Breathe some air.\n            Then decide if you want to... stick\n            around or not.\n\nWork in Progress 2/10/03                                       13.\n\n\nRayburn throws him a VHS from the glove box.\n\n                          RAYBURN\n             Instructional tape on what I tell my\n             clients about bodyguarding.\n\nCreasy looks back at Rayburn who's just a little too\nperceptive for comfort.\n\nEXT.   MERCEDES - MEXICO CITY SUBURBS - DAY\n\nA dark Mercedes maneuvers the turns.\n\nINT.   MERCEDES - DAY\n\nCreasy at the wheel.    Samuel sits in the back.   Studying.\n\n                          SAMUEL\n             You drive easily. Smoothly.\n\nCreasy doesn't answer, just drives.\n\n                          SAMUEL (CONT'D)\n             Were you provided with a gun?\n\n                             CREASY\n             Yes.\n\n                          SAMUEL\n             Show me, please.\n\nCreasy takes his right hand off the wheel, reaches under\nhis jacket and passes back a beat-to-shit looking PISTOL.\n\n                             SAMUEL (CONT'D)\n             What is it?\n\n                          CREASY\n             Nine millimeter. A Sig Sauer 226.\n\n                          SAMUEL\n             Have you used this type before?\n\nCreasy just nods.   Doesn't like the show and tell.\n\n                             SAMUEL\n             Is it loaded?\n\n                             CREASY\n             It's loaded.\n\nSamuel hands back the gun.\n\nWork in Progress 2/10/03                                   14.\n\n\n                          SAMUEL\n             You will meet my wife first. She would\n             like it if you are presentable, polite\n             and respectful. You'll be the fifth\n             candidate she's seen this week.\n\nSamuel flips through a manila folder.\n\n                          SAMUEL\n             Your resume is impressive. Nine years in\n             the Army. Extensive counter terrorism\n             work. I shouldn't be able to afford you\n             in my current state. What's the catch?\n\n                          CREASY\n                    (honest)\n             I drink.\n\n                          SAMUEL\n             How does it affect you?\n\n                          CREASY\n             My coordination. Reaction time. If top\n             professionals try to kidnap your\n             daughter, the service will be on par with\n             the pay.\n\n                          SAMUEL\n             And what if amateurs try it?\n\n                          CREASY\n             I'll probably kill them.   Is that likely?\n\n                          SAMUEL\n             No. And no one is to know of your\n             drinking problem. That includes my wife.\n\nAs they pull up to the Ramos' impressive hacienda.\n\nINT.   SITTING ROOM - RAMOS VILLA - MEXICO CITY - NIGHT\n\nWhere Lisa is flipping through TV channels; Sky News,\nCNN, etc... Each one showing some terrorist act - West\nBank protest, Madrid car bombing.\n\nSamuel and Creasy, meanwhile, enter behind her.      She\nclicks it off, looks back at them.\n\n                          LISA\n             The world of our children.   How dare\n             they?\n\nWork in Progress 2/10/03                                      15.\n\n\n                         CREASY\n                   (shrugs)\n            It's war. The weakest suffer the most.\n\n                         LISA\n            You're American.\n\n                            CREASY\n            So are you.\n\n                         SAMUEL\n                   (introducing)\n            My wife, Mr. Creasy.\n\n                         LISA\n            Lisa Martin Ramos, Mr. Creasy.\n\nLisa steps over, shakes Creasy's hand.    Gives him a quick\nonce over.\n\n                         LISA (CONT'D)\n            Would you like a drink?\n\nCreasy doesn't hesitate, doesn't look at Samuel and has\nno irony in his answer.\n\n                            CREASY\n            Thank you.     Scotch and a little water.\n\nShe steps to the bar to make it.\n\nCREASY - FROM SOMEONE'S POV\n\nSlightly sinister.   Watching from the frame of the door.\n\n                         LISA\n            You've done much of this work before?\n\n                            CREASY\n            Never.\n\nSamuel sells, covers for Creasy's reticence.\n\n                         SAMUEL\n            He has experience in related work.     A\n            great deal of it.\n\n                         LISA\n            Do you have any family, Mr. Creasy?\n\nCreasy hesitates for an imperceptible beat.\n\n                          CREASY\n            No.   I do not have family.\n\nWork in Progress 2/10/03                                          16.\n\n\nAnd then, somehow, Creasy is aware of being watched.        His\neyes flicker over, just in time to see...\n\nPINTA\n\nCrouched low. In the doorway. She stares back at him a\nbeat, then disappears around the corner.\n\nSITTING ROOM\n\nCreasy frowns.    Lisa steps over with Creasy's drink.\n\n                            CREASY\n               Thank you.\n\nShe makes a point of looking into his eyes. Creasy looks\nback into hers with complete indifference, something she\nhas not experienced even from dying men.\n\nShe abruptly turns away.    Confused for a moment.\nFinally:\n\n                            LISA\n               Pinta!\n\nA few moments and Pinta arrives.       'Cool Hand Pinta'.\n\n                            PINTA\n               Yes, mom?\n\n                            LISA\n               This is Mr. Creasy.\n\nPinta walks over and very formally holds out her hand.\nCreasy shakes it. An odd beat.\n\n                            LISA\n               Pinta, show him to his room.\n\nSamuel reacts.    Creasy got the job.\n\n                            PINTA\n               This way, Mr. Creasy.\n\nWhat an actress. As he follows her out.        Samuel sits at\nhis baby grand and begins to play.\n\n                            LISA\n               I think it's nice he's American.\n\n                            SAMUEL\n               I think it's fantastic.\n\nWork in Progress 2/10/03                                     17.\n\n\n                         LISA\n            You realize that you've brought a killer\n            into the house.\n\nSamuel is stopped short by that one.    She steps over and\nkisses her husband on the cheek.\n\n                            LISA\n            Thank you.     I feel better now.\n\nEXT./INT. HOUSE - SUNSET\n\nPinta leads the way. All enthusiasm, away from her\nparents. A 150 pound black German Shepherd greets them.\nSniffs Creasy's pant leg, unsure.\n\n                         PINTA\n            Do you like dogs, Mr. Creasy?\n\n                         CREASY\n            If they like me.\n\n                         PINTA\n            Frank doesn't take to most people.       Do\n            you speak German?\n\n                         CREASY\n                   (in German)\n            Ein Klines Bisschen.     [A tiny bit.]\n\n                         PINTA\n            Frank only responds to commands in\n            German. He was trained in Frankfurt.\n            My Dad loves the idea of having a dog\n            around, but hates the fact he lives\n            inside.\n\nCreasy follows her.   Frank pads along after them.\n\nCREASY'S ROOM\n\nNot like downstairs, but comfortable enough.\n\n                         PINTA\n            We fixed the room up two weeks ago.       Mom\n            and I. It's nicer than before.\n\nCreasy takes a stroll around it, ignoring her.\n\n                         PINTA\n            You've got a CD player if you like music.\n            I like music a lot.\n\nWork in Progress 2/10/03                                    18.\n\n\nCAW! Creasy looks over at a CAGE on a stand holding a\nMACAW. It tilts its head at the big man.\n\nA TV and VHS machine in the corner.\n\n                            PINTA\n               That's 'Bird.' Emilio forgot to take him\n               with when he left.\n\n                               CREASY\n               Who's Emilio?\n\n                            PINTA\n               My last bodyguard. He drove me to school\n               in the morning and picked me up in the\n               afternoon.\n\nFinally Creasy turns, looks at her hard.\n\n                            CREASY\n               I'm here for you?\n\nPinta smiles huge, nods.\n\n                            PINTA\n               In between you can take Mom shopping and\n               to lunch. Does that sound alright, Mr.\n               Creasy?\n\n                             CREASY\n               Creasy.   Just call me Creasy.\n\n                            PINTA\n                      (big grin)\n               Creasy...\n\nFrank's tail wags imperceptibly.\n\n                            PINTA\n               Looks like he approves of you.\n\nAnd then, walking on air, she's out the door.\n\nCreasy sets up his room with meticulous precision that\ncomes from years in the military. Front and center he\narranges his shrine: an almost empty bottle of scotch and\na glass (engraved from an earlier encounter) next to a\npack of Marlboros and his weathered Zippo. Then, his\nbeaten up gun and holster. A well-travelled New\nTestament is placed in the drawer.\n\nCREASY'S BAG\n\nWork in Progress 2/10/03                                     19.\n\n\nHe reaches in between the shirts, pulls out a fresh\nbottle of scotch. He breaks the seal, unscrews the cap.\n\nHe pours a double... triple... wait, what do you call a\nfull glass of scotch?\n\nCAW!   The macaw squawks it's disapproval.\n\nHe ejects the shell from the breach of the 9mm, tries to\ncatch it on the back of his hand. An old game with\nhimself.\n\nHis hand is too shaky. The bullet bounces off, hits the\nfloor. Creasy picks it up. Ejecting the magazine, he\nstarts to oil the weapon.\n\nCAW! As the macaw squawks, Creasy looks up. It doesn't\nfeel like this relationship is going to work.\n\nINT.   PINTA'S BEDROOM - NIGHT\n\nA battered TEDDY BEAR watches as Lisa sits on the foot of\nthe bed, tucks Pinta in.\n\n                          LISA\n             School tomorrow, baby.\n\nPinta smiles, happy at the thought.\n\n                          PINTA\n             I like him, Mom.\n\n                           LISA\n             You do?\n\n                          PINTA\n             He's like a great big bear.\n                    (a secret smile)\n             'Creasy bear'...\n\nLisa smiles, kisses her goodnight.    As she starts out...\n\n                          PINTA\n             There's something about him.\n\nLisa turns, looks back at her daughter.\n\n                          PINTA\n             I think he's been sick. He's alright\n             now, but I think he's been very, very\n             sick.\n\nWork in Progress 2/10/03                                     20.\n\n\n                           LISA\n              Well, think about going to sleep.   Good\n              night, baby.\n\nLisa exits.   Pinta looks over at the battered teddy bear.\n\n                           PINTA\n              Just like you, a big old bear.\n\n                                                  CUT TO:\n\nCREASY\n\nIn his room. Tests his mag spring with his thumb, begins\nloading up. The full magazine joins with those already\nloaded.\n\nAnother glass of scotch is poured.\n\nCreasy's hands oil the holster. The Sig Sauer is slipped\nin. The holster is hung over the corner post of the bed.\n\nA map is flattened. Creasy's finger traces various\nroutes, pencils them in. From the house to Pinta's\nschool.\n\nThe macaw squawks again. Creasy steps over, takes the\ncage and carries it to the open window. He opens the\ncage door.\n\n                           CREASY\n              Now's your chance.\n\nThe bird flies, disappears out the window.\n\nINT.   LISA & SAMUEL'S BEDROOM - NIGHT\n\nSpent, glistened in sweat, the couple lay side by side.\n\n                           LISA\n              She likes him.\n\n                            SAMUEL\n              Hmm?\n\n                            LISA\n              Creasy.   Pinta likes him.\n\n                           SAMUEL\n              Pinta loves school. She'd like Count\n              Dracula is he took her back there.\n\nWork in Progress 2/10/03                                   21.\n\n\nLisa just smiles, knows her daughter better.\n\n                                                 CUT TO:\n\nCREASY'S ROOM\n\nCreasy's drinking in the dark next to the window,\nlistening to the sounds of Mexico City at night.\n\nThe empty scotch glass is set down.    Ominously sober.\n\nINT. PINTA'S BEDROOM - EARLY MORNING\n\nBrushing her hair, Pinta wanders to the window at the\nsound of a car hood closing. Creasy is down below going\nover the car; a dark BLUE MERCEDES. As he checks\nunderneath...\n\nThe \"Car Wash Guy\", Pedro, trying to engage Creasy.\nFrank looks on, seems like he disapproves of Pedro.\n\nINT.   MERCEDES - DAY\n\nCreasy sits grimly behind the wheel. Pinta exuberant\nbeside him. Traveling route number one from home base to\nschool. Pinta looks at Creasy's hands on the wheel. The\nback of the right one is swirled with scars.\n\n                          PINTA\n             Where are you from, Creasy?\n\n                          CREASY\n             The United States.\n\n                            PINTA\n             I know.    But which state?\n\nCreasy checks the rearview mirror. A banged up white\nTOYOTA COROLLA pulls out behind him.\n\n                          CREASY\n             No state in particular.\n\nPinta frowns; this is going to take some work.\n\n                          PINTA\n             My mom and me are from Houston, Texas.\n             Have you been there?\n\nCreasy has his eyes on the mirror.\n\n                            CREASY\n             No.\n\nWork in Progress 2/10/03                                   22.\n\n\n                         PINTA\n            You can drive and talk at the same time,\n            can't you?\n\n                         CREASY\n                   (turns left)\n            No.\n\n                            PINTA\n            Why not?\n\n                         CREASY\n            I'm looking for potential.\n\nCreasy checks the mirror. The white Corolla continues\nthe way it was going. False alarm.\n\n                            PINTA\n            Potential?     I don't understand.\n\n                         CREASY\n            Places where the road bends, places away\n            from buildings, places where the traffic\n            thins out. But you don't have to\n            understand. I do. So no talking.\n\n                         PINTA\n            Are you going to quit?     My last bodyguard\n            quit.\n\n                         CREASY\n            Let me guess, you wouldn't stop talking?\n\n                         PINTA\n            Someone gave him more money than we\n            could.\n\n                         CREASY\n            I'm a bargain.\n\n                         PINTA\n            Being black, is that a positive or\n            negative for a bodyguard in Mexico?\n\n                         CREASY\n            Time will tell.\n\n                         PINTA\n            There were 24 kidnappings in Mexico City\n            in the last six days. Four a day. What\n            do you think about that, Mr. Creasy?\n\nWork in Progress 2/10/03                                     23.\n\n\n                          CREASY\n             Pretty impressive. Maybe I need to up my\n             fee or get a larger gun.\n\nShe looks at his scared right hand, then him.     All\ncuriosity.\n\nEXT.   CONVENT SCHOOL GATES - MEXICO CITY - DAY\n\nCreasy pulls the Mercedes up out front.   He notes the\nhigh walls, the heavy gates.\n\n                          PINTA\n             Beep the horn.\n\nCreasy hits it. A beat and then a   shutter opens at eye\nlevel. Pinta waves from the car.    A moment later the\ngate is being slowly pushed open by  an old WATCHMAN.\nCreasy drives in toward a rambling,  ivy-clad building set\nin spacious grounds.\n\nCOURTYARD\n\nCreasy parks, get out of the car.   He looks around,\nappraising the lay of the land.\n\n                          PINTA\n             Isn't it beautiful?\n\nPinta's name is called. An elderly gray-haired NUN walks\nover from the entrance. Pinta runs over, kiss her\nwarmly on both cheeks, then leads her toward Creasy.\n\n                          PINTA\n             Sister Anna, the headmistress.\n                    (to nun; proudly)\n             This is Creasy, my bodyguard.\n\nSister Anna shakes his hand.\n\n                           SISTER ANNA\n             Mr. Creasy.\n\n                          PINTA\n             No, Sister, he told me just to call him\n             Creasy. He's American. From no state in\n             particular.\n\n                          SISTER ANNA\n             You must look after our Pinta. We're so\n             happy to have her back in school. Run\n             along now, Pinta.\n\nPinta waves goodbye, bounds away.   They watch her go.\n\nWork in Progress 2/10/03                                   24.\n\n\n                          SISTER ANNA\n             She's late, Mr. Creasy.\n\n                          CREASY\n             Yeah, I've got to get used to the routes.\n             I -- It won't happen again.\n\n                          SISTER ANNA\n             No offense, but I'm sorry that your\n             profession needs to exist.\n\n                          CREASY\n             So am I, Sister.\n\n                          SISTER ANNA\n             Do you ever see the hand of God in what\n             you do?\n\n                          CREASY\n             Not for a long time, sister.\n\n                          SISTER ANNA\n             The bible says, \"Be not overcome of evil,\n             but overcome evil with good.\"\n\n                          CREASY\n             Romans, chapter 12, verse 21.\n\nSister Anna is impressed.   She nods her 'props' to\nCreasy.\n\n                          CREASY\n             I'm the sheep that got lost.\n\nINT.   MERCEDES - CONVENT SCHOOL GATES - DAY\n\nCreasy pulls out, starts down the street. He's only gone\na hundred meters when SIRENS kick up. A police car\nbehind him. Creasy shakes his head.\n\n                          CREASY\n             Here we go again.\n\nCreasy pulls over, digs around the front seat as TWO\nSLOPPY COPS head over.\n\n                          SLOPPY COP ONE\n             Do you speak English, Senor?\n\n                           CREASY\n             Yeah.   And Spanish.\n\n                          SLOPPY COP ONE\n             You have an identification?\n\nWork in Progress 2/10/03                                   25.\n\n\nCreasy hands them his PASSPORT and a printed LETTER. A\nlegitimate firearms license for bodyguard work witnessed\nby Rayburn.\n\nCreasy deliberately puts one hand on the steering wheel,\nthen the other. Minimizing the confrontation.\n\n                          CREASY\n             It's a temporary license for the gun I'm\n             carrying. I just went through all of\n             this at the airport.\n\nINT.   BIG BURLY SUV - DRIVING TOWARD THE BORDER - DAY\n\nSix Japanese BUSINESSMEN jabber on cellphones. Rayburn's\ndaily routine. He sits up front an Uzi cradled in his\nlap. As his own cell phone rings, he answers.\n\n                          RAYBURN\n             Rayburn here. Creasy, what's up?\n                    (listens; laughs)\n             Yeah?\n\n                                                CUT TO:\n\nPOLICE LINE-UP WALL - As Creasy's MUG SHOT is flashed.\n\nCREASY'S HAND - As he's fingerprinted.\n\n                          CREASY\n             There's still ink on my fingers from last\n             week.\n\n                                                CUT TO:\n\nRAYBURN'S SUV\n\n                          RAYBURN\n             You got tossed. Don't trust the cops,\n             especially the Judicials.\n                    (listens; laughs again)\n             Oh you know that?\n\nINT. BAR - DAY\n\nCreasy slams a Jack and Coke.\n\nEXT.   HIGH STREET - MEXICO CITY - DAY\n\nCreasy striding, the frivolous shoppers like another\nspecies as he moves through them. Might as well wear a\nshark fin. He spots something: a MUSIC STORE.\n\nWork in Progress 2/10/03                                      26.\n\n\nINT.   MUSIC STORE - MEXICO CITY - DAY\n\nCreasy finds the section he's looking for, searches a\nrack. There. As he pulls a particular CD, we are not\nprivy to what it is.\n\nEXT.   COURTYARD - PINTA'S SCHOOL - DAY\n\nCreasy waits, smoking a Marlboro light, separate from the\nother drivers and bodyguards. The bodyguards stand\ntogether sharing cigarettes and stories. Give him a\nshare of unfriendly looks. Creasy could care less.\n\nThe doors open and the children pour out. PINTA exits, a\nhuge grin as she spots Creasy. Creasy palms the\nMarlboro. The frown on his might as well be chiseled in\nmarble.\n\nINT.   MERCEDES - ROLLING -DAY\n\nPinta rides shotgun alongside Creasy.     She looks out the\nwindow, realizes...\n\n                          PINTA\n             We're taking a different way home.\n\n                             CREASY\n             That's right.\n\nPinta thinks about it, realizes what he's doing, smiles.\n\n                             PINTA\n             I understand.     Smart.\n\nNo answer from Creasy.     It's hard not to feel foolish\naround this kid.\n\n                          PINTA\n             Did you like school, Creasy?\n\n                             CREASY\n             No.\n\n                             PINTA\n             Not at all?\n\n                             CREASY\n             No.\n\n                             PINTA\n             But why not?\n\nCreasy's hoping she'll just shut up.\n\nWork in Progress 2/10/03                                    27.\n\n\n                              PINTA\n              Hmmm?\n\n                           CREASY\n              It wasn't a school like yours and there\n              was no Sister Anna.\n\n                           PINTA\n              So you were unhappy?\n\n                           CREASY\n              Being unhappy is a state of mind.   I\n              never thought about it.\n\n                              PINTA\n              Oh...\n\nPinta watches Creasy a moment, trying to figure a way in.\nShe looks at his scarred right hand on the wheel.\n\nThen, as she reaches out...\n\n                           PINTA\n              What happened to...\n\nAnd touches it.\n\n                              PINTA\n              ...your hand?\n\nCreasy gives her a look, devoid of humanity for an\ninstant.\n\n                           CREASY\n              No more questions.\n\nWhen he speaks again he's colder; he's decided something.\n\n                           CREASY\n              I'm not paid to be your friend.   I'm paid\n              to protect you.\n\nThey drive on in silence. Creasy finally glances over.\nPinta stares straight ahead, her chin quivering.\n\n                           CREASY\n                     (exasperated)\n              And don't start crying.\n\n                           PINTA\n              I'm not crying.\n\nBut she is.   As Creasy stops at a red light...\n\nWork in Progress 2/10/03                                      28.\n\n\n                            CREASY\n               Look, this is the way I am.   I don't like\n               questions. I --\n\nAnd she's out the door.\n\n                            CREASY\n               Shit.\n\nCreasy shoulders open his door, bolts out.\n\nINTERSECTION\n\nCreasy has barely straightened himself and Pinta is\nalready getting back in the car. This time in the\nbackseat.\n\nCreasy sighs. The light goes green.     Scooters whine away\nand horns blare.\n\nMERCEDES\n\nCreasy sits back behind the wheel.\n\n                            PINTA\n               You can take me home now, Mr. Creasy.\n\nCreasy looks back at her, but she stares straight ahead.\nAs the chorus of horns continues, Creasy continues driving.\n\nINT.   KITCHEN - RAMOS VILLA - DAY\n\nCreasy sits at the table   with the old gardener GOMEZ\n(we've seen him trimming   hedges and such in earlier\nexteriors). Gomez's just    cleaned his plate and is going\nafter any remnants with a   crust of bread. Creasy hasn't\ntouched his.\n\nMARIA, the cook, enters.    As she clocks Creasy's plate...\n\nINT.   CREASY'S ROOM - SUNSET\n\n'Chopin' drifts across the courtyard. Samuel is a very\naccomplished player.\n\nCreasy sits in a chair in the twilight by the window, a\nglass of scotch in his hand. A knock at the door.\n\n                            CREASY\n               Come in.\n\nThe door opens.    It's Lisa.\n\nWork in Progress 2/10/03                                  29.\n\n\n                         LISA\n            Mr. Creasy, I wanted to make sure you\n            have everything you need.\n\n                           CREASY\n            I'm fine.\n\n                         LISA\n            Is the food alright?    Maria tells me that\n            you didn't eat.\n\n                         CREASY\n            The food's fine. Sometimes I don't eat.\n\n                         LISA\n                   (smiles)\n            It insults Maria. Slip it to the dog if\n            you have to... Do you mind if I talk to\n            you for a moment?\n\nHe shakes his head. Lisa glides into the room like a\ndancer, sits down at the foot of the bed.\n\n                         LISA\n            How are you getting along with Pinta?\n\n                         CREASY\n            We'll be okay once she realizes I'm not a\n            new toy.\n\n                         LISA\n                   (smiles)\n            Yes, she told me.   Do you have children,\n            Mr. Creasy?\n\n                           CREASY\n            No.\n\n                         LISA\n            You should know they're tenacious when\n            they want something. And Pinta wants to\n            be friends.\n\n                         CREASY\n            You're paying me to protect her, not\n            amuse her. Right?\n\nA beat and then Lisa nods.\n\n                         CREASY\n            Look. Maybe this isn't going to work.\n            Maybe you should ask your husband to hire\n            someone... more sociable.\n\nWork in Progress 2/10/03                                    30.\n\n\n                          LISA\n             No, you're right. You were hired to\n             protect her, that's enough. I'm\n             confident you'll do that.\n\nLisa stands, is about to start out when she sees his gun\nand holster hanging from the corner of the bed. It gives\nher pause. Something sexy about it and Creasy's\nproximity.\n\n                          LISA\n             I didn't realize you had a gun.    I know\n             that's silly to say.\n\nCreasy doesn't answer, just watches her.\n\n                          LISA\n             It makes it all seem so serious.\n\n                          CREASY\n             It is serious, Mrs. Ramos.\n\n                          LISA\n             Please, it's Lisa... I'll be coming with\n             you tomorrow. I have lunch with friends.\n\nFinally, Lisa just shrugs and disappears out the door.\nCreasy slugs down a gulp of scotch.\n\nINT.   PINTA'S BEDROOM - NIGHT\n\nPinta, blankets up, teddy bear beside her, says her\nprayer.\n\n                          PINTA\n             Give me God what you still have.    Give me\n             what no one else asks for.\n\nThen, she listens as Linda Ronstadt's \"Blue Bayou\" starts\nto drift through the open window, down from the room\nabove.\n\n                          RONSTADT\n             \"I'm going back someday, come what may,\n             to Blue Bayou...\"\n\nINT.   CREASY'S ROOM - NIGHT\n\nHe stands in the dark, in front of the glow of the\nstereo. The empty bag from the record store. This is\nthe CD he bought. As the song ends, Creasy hits the back-\nup button. \"Blue Bayou\" begins again. Creasy takes the\n9mm from its holster. As he sits back in his chair...\n\nWork in Progress 2/10/03                                    31.\n\n\nINT.   PINTA'S BEDROOM - NIGHT\n\nPinta listens to the music, figures a way to dance to it.\n\nINT.   CREASY'S ROOM - NIGHT\n\nCreasy sits in the dark with his 'Blue Bayou'. Creasy\ndoes not look right. Holding the 9mm, he ejects the\nround, tries to catch it on the back of his hand. No\ngood.\n\nHe chambers another round.     Tries again.   Nope.\n\n                          LINDA RONSTADT\n             Well I'll never be blue, my dreams come\n             true, on Blue Bayou...\n\nINT.   PINTA'S BEDROOM - NIGHT\n\nPinta still dancing, finding a way to be with Creasy\nwhether he knows it or not. Frank, the dog, watches her\nevery move, perplexed.\n\nINT.   CREASY'S ROOM - NIGHT\n\nAs the song repeats, Creasy chambers yet another round.\nFeels like he misses a beat as he loads one shell into\nthe chamber. Pinta sings along oblivious. Suddenly the\nbarrel is at his forehead and the trigger has been\npulled. No gun shot. A click. Hammer against shell.\nCreasy is confused. He ejects the shell and catches it\nin the palm of his hand. Macro photograph / a small dimple\non the back of the shell is the only evidence of his\nactions. Pinta still dances.\n\nINT.   RAYBURN'S BEDROOM - MEXICO CITY - NIGHT 3.A.M.\n\nRayburn in bed with his beautiful 19-year-old Mexican\nWIFE and their four-year-old SON.\n\nAs she leans down to kiss her son, a cellphone rings.\nRayburn looks over at the nightstand. FIVE CELLPHONES\nthere, one of them ringing. Rayburn finds it.\n\n                            RAYBURN\n             Rayburn...    Creasy! What's wrong?\n\nEXT.   RAMOS HOUSE - NIGHT\n\nCreasy stands at the edge of the drive, the house dark\nbehind him. On his cell phone.\n\nWork in Progress 2/10/03                                     32.\n\n\n                         CREASY\n            I said, have you ever had a nine\n            millimeter round that just didn't go off?\n\n                                        INTERCUT THE FOLLOWING:\n\nRayburn pulling away, sitting on the edge of the bed.\n\n                         RAYBURN\n            You mean a misfire?\n\n                         CREASY\n            I mean nothing. The hammer came down and\n            nothing happened. Dimple on the primer.\n\n                         RAYBURN\n            I've heard of it. Never happened to me\n            though. Maybe the firing pin's off.\n\n                            CREASY\n            Maybe...\n\nCreasy is troubled about it all to say the least.\n\n                         RAYBURN\n            It's like we always used to say: a bullet\n            always tells the truth. What were you\n            shooting at?\n\nCreasy doesn't answer.    He holds the bullet up, looks at\nit.\n\n                            RAYBURN\n                      (focusing; concerned)\n            Creasy?\n\n                         CREASY\n            Sorry I woke you, Ray.\n\nCreasy clicks off the phone. He starts back toward the\nhouse, but stops short again.\n\nThere she is. Pinta. Standing in the window of her\nroom. She's been watching him. It's like Creasy seeing\nher for the first time. And she's been watching him\nforever. No easy answer for it. They're connected\nsomehow.\n\nINT. CREASY'S ROOM - NIGHT\n\nFingers putting the special bullet into an old matchbox.\nIt takes it place of honor front and center on the\nshrine. Next to the Marlboros and scotch. The New\nTestament is set down nearby.\n\nWork in Progress 2/10/03                                   33.\n\n\nCU - Creasy asleep in his bed for the first time.\n\nINT.   MERCEDES - ROLLING - DAY\n\nSilent Creasy driving. Lisa and Pinta in the back.\nCreasy steals a look in the mirror. Pinta stares\nstraight ahead. But when Creasy looks away, Pinta steals\na look at him.\n\nEXT.   STREET - MEXICO CITY - DAY\n\nAs the mercedes crosses an intersection, a white TOYOTA\nCOROLLA turns right, pulls in thirty meters behind it.\n\nINT.   MERCEDES - ROLLING - DAY\n\nCreasy clocks the Corolla, frowns. He pulls a piece of\npaper from his pocket. But nothing to write with.\n\n                          CREASY\n             Pinta, do you have a pencil?\n\n                          PINTA\n             I go to school, don't I?\n\nSarcasm. He stays calm, doesn't let on what he's\nthinking.\n\n                           CREASY\n             Please?\n\nHer little hand comes over the top of the seat with a\npencil. Creasy takes it, slows to let the Corolla catch\nup. He squints into the mirror to read the plate.\n\nLisa is oblivious, but as Pinta looks back over her\nshoulder...\n\nBRAKE LIGHTS up ahead. Creasy lurches to a stop.    The\nCorolla swerves around them disappears ahead.\n\n                           CREASY\n             Sorry.\n\n                          LISA\n             The traffic takes some getting used to.\n\nAs Creasy cranes for a view, another WHITE Corolla comes\nby headed the opposite way. They're everywhere. This\nrelaxes Creasy's paranoia. As he laughs to himself.\n\nWork in Progress 2/10/03                                       34.\n\n\nEXT.   COURTYARD - CONVENT SCHOOL - DAY\n\nThey pull in through the gates. The Mercedes parks;\nCreasy gets out. Pinta kisses her mother on the cheek.\n\n                               PINTA\n               Bye, Mom.\n\n                            LISA\n               Don't forget your towel.\n\nPinta gets out with book bag and her      towel. As she\nstarts to walk past Creasy without a      word, he holds out\nher pencil. She holds up, shows him       a SECOND PENCIL,\ncontinues on her way. Doesn't need       him.\n\nMERCEDES\n\nCreasy gets back in, starts away.\n\n                            LISA\n               She has swimming practice today.    You'll\n               need to pick her up at the pool.\n\nCreasy just nods. He doesn't want anything to do with\nLisa either. Thoughtful, Lisa looks out the window.\n\n                            LISA\n               I talked to her. She understands.     She\n               won't bother you anymore.\n\nAs Creasy just drives.\n\nEXT.   AGO'S - MEXICO CITY - DAY\n\nCreasy waits in the street, stands by the Mercedes. He\nchecks his watch, looks around. The minutes do not pass\nquickly. He looks over as the restaurant door opens and\nLisa exits with Jordan Kalfus and his Latin wife EVELYN.\n\n                               LISA\n                         (sees him)\n               Creasy!\n                      (stepping over)\n               Meet Jordan and Evelyn.\n\nCreasy nods.    They study him with interest.\n\n                            JORDAN\n               So you're the bodyguard?\n                      (Creasy nods again)\n               You used to be, what did they used to\n               call it, a soldier of fortune?\n\nWork in Progress 2/10/03                                 35.\n\n\nJordan doesn't quite hide his disdain. Creasy nods a\nfinal time, lets his eyes drift to a 1000 yard stare.\n\n                          EVELYN\n                   (giggles)\n            Does he talk?\n\nAs Lisa gives her a dirty look, Evelyn whispers...\n\n                           EVELYN\n            He's sexy...\n\nJordan looks in the direction Creasy looks.\n\n                         JORDAN\n            You see any danger out there?\n                   (laughs)\n            The fear's worse than the reality.\n\nJust a blankness from Creasy.\n\n                         JORDAN\n            I always wanted to ask a bodyguard, would\n            you take a bullet for your employer, for\n            Samuel?\n\nA condescending smile as Jordan awaits his answer.\n\n                         CREASY\n            I wasn't hired to guard Mr. Ramos.\n\n                         JORDAN\n            For Pinta then?\n\n                           LISA\n            Jordan!\n\n                         CREASY\n            If something happened, my reaction would\n            be to fight to protect her. I have\n            skills in that respect. Pinta would\n            benefit by the fact that... I'm a\n            soldier.\n\n                         JORDAN\n            What kind of an answer is that?\n\n                         CREASY\n            The answer is the truth.   The question is\n            foolish.\n\nLisa smiles at the answer, kisses Jordan on the cheek.\n\nWork in Progress 2/10/03                                     36.\n\n\n                          LISA\n             Jordan, thank you for the lovely lunch.\n             I promise not to let Evelyn spend too\n             much.\n\nEvelyn doesn't see it, but Creasy does. Jordan just lets\nhis fingers trace the top of Lisa's ass.\n\nAs she and Evelyn head for the car, Creasy is there to\nopen the door.\n\nMERCEDES\n\nCreasy gets behind the wheel. Pulls into traffic. As he\ngoes, he checks the rear view mirror. Jordan remains\nstanding on the curb watching the car pull away.\nSomething odd about it all.\n\nEXT.   PUBLIC POOL - MEXICO CITY - DAY\n\nLoud. Chaotic. Reminiscent     of a lunatic asylum. Creasy\narrives at the public pool.    A practice. Several\nbodyguards gather at one end   of the pool. Give Creasy a\nless than friendly look. As    he looks for Pinta...\n\nA GUN goes off.\n\nSees: The smoke from the starting pistol as the SWIMMERS\nsplash into the water.\n\nHe sees Pinta in the pool. The fifty yard dash. She's\nin fifth. Then fourth. Creasy walks along beside her.\nThird. Second and closing. And at the wall, still\nsecond.\n\nShe surfaces, frustrated.    As she sees Creasy there...\n\nINT.   MERCEDES - DAY\n\nCreasy drives. Pinta in back, writing in her notebook.\nNot speaking, but a weird sort of harmony. Finally.\n\n                            CREASY\n             You're fast.\n\n                          PINTA\n             Once I get in the water but not starting\n             off. By the time I catch up, it's too\n             late.\n\nShe keeps writing.   The number \"2\" over and over.\n\nWork in Progress 2/10/03                                   37.\n\n\nINT.   CREASY'S ROOM - NIGHT\n\nCreasy sits in his chair drinking scotch.     All alone\nneedless to say.\n\nCreasy takes the instructional VHS on bodyguards that\nRayburn gave him and plugs it into the VCR. It's in\nJapanese. Shakes his head. He switches off the VCR and\nsurfs the TV channels instead. Sees talk show with the\neditor of REFORMA newspaper, ROSANNA GUERRERO, talking\nabout organized crime in Mexico.\n\nFrom out the window, a CAW, then again.     Yet again.\n\nFinally, Creasy stands goes to the window. He leans out,\nsees Pinta's window across the lawn from him.\n\nPinta standing on the terrace. Another CAW.\n\nCreasy decides to play.    He CAWS in return.\n\nPinta looks around.    Creasy does a pretty good\nimpersonation.\n\nHears Pinta CAW again.\n\n                          CREASY\n             Hey... Pinta...\n\nShe looks up at him.\n\n                          CREASY\n             What are you doing?\n\n                          PINTA\n             Calling for Emilio's macaw.    I thought I\n             heard him.\n\n                          CREASY\n             Do you think he'll come back?\n\n                            PINTA\n             Maybe.    Did you hear him?\n\n                            CREASY\n             No.\n\n                          PINTA\n             How do you think he got out?\n\n                          CREASY\n                    (a beat)\n             Well, I let him go.\n\nWork in Progress 2/10/03                                     38.\n\n\n                          PINTA\n             It's better to be free, right?\n\n                           CREASY\n             Yes.   Actually, he was driving me crazy.\n\nCreasy disappears back inside. Pinta smiles big before\nletting the stick drop to the ground.\n\n                          PINTA\n             I got you to talk, Creasy bear.\n\nBlue Bayou plays.   Pinta now listens to Creasy's sound.\n\n                          RONSTADT\n             \"...I'm so lonesome all the time, since I\n             left my baby behind, on Blue Bayou.\"\n\nEXT.   RAMOS VILLA - DAY\n\nA DRIVER gets Samuel's and Lisa's luggage into a car.\nThey're on their way, kissing Pinta goodbye.\n\n                          LISA\n             I'll call you from Detroit, baby.\n\n                          PINTA\n             You're going to miss Mexican Halloween.\n             The Day of the Dead.\n\n                          SAMUEL\n             You enjoy it for us, Pinta.\n\nLisa gives her a look. Don't make this harder than it has\nto be. Finally, Pinta nods.\n\nCreasy waits quite a discreet distance away by the\nMercedes. She steps over, stops to wave goodbye one last\ntime, then gets in back. As Creasy shuts the door.\n\nINT.   MERCEDES - MEXICO CITY ROAD - DAY\n\nCreasy drives, glances in the mirror at Pinta in the back\nseat. She wipes away a tear just as it forms.\n\n                          CREASY\n             They'll be back in a week.\n\n                          PINTA\n             They can stay for two weeks.   I don't\n             care.\n\nShe's got a toughness Creasy likes.   As she looks out the\nwindow, he looks ahead.\n\nWork in Progress 2/10/03                                       39.\n\n\nINT.   KITCHEN - RAMOS VILLA - DAY\n\nCreasy eats.\n\n                            CREASY\n               The food is excellent, Maria.     You have a\n               real talent.\n\nMaria beams with pleasure.\n\n                            MARIA\n               My pleasure, Creasy.\n\nPinta enters  in a RED SATIN DEVIL'S OUTFIT. She looks a\nbit forlorn  as she sits at opposite ends of the table\nfrom Creasy.   As she stares at her plate, Creasy starts\nto laugh at  what an odd sight she is. All dressed up and\nno place to  go.\n\nWrong move. Pinta stands, marches out of the room.        As\nMaria and Creasy exchange a look...\n\nEXT./INT.   WINDOW - RAMOS VILLA - DAY\n\nPinta the devil stares sadly out here window. Then there\nit is! The macaw. Sitting on the opposite roof.\n\nEXT.   ATTIC WINDOW - RAMOS VILLA - DAY\n\nPinta pushes it open, climbs out onto the slope of the\nroof. This doesn't look like such a good idea. As she\ncrosses, disappears over the peak.\n\nIt's a game of catch me if you can. 'Bird' looks at\nPinta right in the eye. She gingerly moves closer. The\nbird moves away, just out of her reach each time.\n\nCHIMNEY\n\nPinta coming down the other slope.      There's the macaw.\n\n                             PINTA\n               Come on.   Come on.   Bird!\n\nThe fourth time Pinta's fingers are centimeters away.\nShe reaches and suddenly slides along the slick tile\ncovering this section of the roof. Frank's in the yard\nbarking loudly.\n\nNear the edge, she manages to stop.      Whew!\n\nShe scrambles up a few feet. A tile snaps off. She\nslides again. This time right off the edge.\n\nWork in Progress 2/10/03                                      40.\n\n\nShe catches the rain gutter. Hangs thirty feet above the\nground. A concrete landing below. As the gutter creaks:\n\nINT.   KITCHEN - DAY\n\n                           PINTA'S VOICE\n             CREASY!\n\nCreasy is on his feet, out the door in a heartbeat.\n\nEXT.   SIDE YARD - DAY\n\nCreasy dashes around just as the gutter drops on one\nside. Pinta drops ten feet, jerks to a stop as the\ngutter stops, then drops the last twenty feet...\n\n...landing in a hedge.   Creasy dashes over.\n\n                           CREASY\n             Pinta!\n\nShe's in a lot of pain, but moving her arms and head.\nFrank's licking her face.\n\n                           PINTA\n             It hurts.\n\n                           CREASY\n             Where?\n\n                          PINTA\n                    (Short)\n             Everywhere!\n\nShe puts her hands to the left side of her ribs.     Creasy\ncarefully probes with his fingers. She winces.\n\n                          CREASY\n             I don't think they're broken.     Anywhere\n             else?\n\n                           PINTA\n             My ankle.\n\nAs Maria huffs and puffs her way up.\n\n                          CREASY\n             I'm going to get you out, okay?\n\nPinta nods. Creasy eases his arms under, around her,\nlifts her out as gently as possible. She disappears in\nhis arms.\n\nWork in Progress 2/10/03                                     41.\n\n\n                             PINTA\n             Oh, Creasy...\n\nAnd she bursts into tears. Maria looks up at the thirty\nfoot fall. Begins to cross herself.\n\n                            CREASY\n             It's okay.    She's just scared.\n\nCreasy cradles her, pats her back.      As Pinta says his\nname like a mantra...\n\nINT.   HOTEL ROOM - DETROIT - NIGHT\n\nLisa on the phone. Fantastic in a black evening dress.\nThe Ford car industry dinner awaits her entrance.\n\n                          LISA\n             You're sure she's alright?\n\nSamuel enters from the bathroom, concern on his face.\n\n                            LISA\n             Okay, good,   you're sure.\n                    (to   Samuel)\n             He took her   for an X-ray, but it's just a\n             bruise and   a sprain.\n\nShe turns her back so Samuel can zip her dress up.\n\n                          LISA\n             Thank you, Creasy.      Give her my love.\n\nINT.   STAIRCASE - RAMOS VILLA - NIGHT\n\nCreasy makes his way up, enters...\n\nPINTA'S BEDROOM\n\nPinta in bed propped up by a pillow, teddy bear beside\nher. Frank at the head of the bed.\n\n                          PINTA\n             The night you arrived, Mom asked you if\n             you had a family and you lied, didn't\n             you?\n\n                          CREASY\n             White lie. I didn't have a family. But\n             I did have two kids. They're adults now.\n\nIt's a sensitive subject so Pinta moves on.      She nods.\nCreasy looks at the bear. An odd beat.\n\nWork in Progress 2/10/03                                     42.\n\n\n                          CREASY\n             Do you always sleep with him?\n\n                          PINTA\n             I'm too old for him.     Don't tell my\n             friends.\n\n                          CREASY\n             I don't talk to them much.     Does he have\n             a name?\n\nPinta thinks just a beat, then shakes her head 'no'.\nLiar.\n\n                          CREASY\n             I spoke to your mother.     She sends her\n             love.\n\nPinta nods. Creasy stands there a beat, then heads for\nthe door. Almost out, he looks back.\n\n                           CREASY\n             Some bodyguard I turned out to be.       Good\n             night, Pinta.\n\nHe's halfway out the door.\n\n                           PINTA\n             Creasy?   Could you play the song?\n\nCreasy is confused a moment, but when he sees her open\nwindow, he realizes.\n\n                           CREASY\n             Blue Bayou.   You got it.\n\nHe goes.   As Pinta eases back with a sigh and a smile...\n\nEXT.   MERCEDES - RAMOS HOUSE - DAY\n\nPedro the 'car wash guy' puts the finishing touches to\nthe Mercedes.\n\nUsing crutches, Pinta hobbles over. Creasy opens the\nback door for her. But when she gets there, she\nhesitates.\n\n                          PINTA\n             I think I'll sit in the front.     There's\n             more room for my foot.\n\nCreasy makes no big deal of it. He takes her crutches,\nopens the front. As she scoots inside... Frank waits\nand watches. Creasy calls to him.\n\nWork in Progress 2/10/03                                      43.\n\n\n                          PINTA\n             He's only allowed to travel in the car on\n             weekends. Dad says the car will smell\n             'doggie'.\n\nINT.   MERCEDES - ROLLING - DAY\n\nBoth of them up front. Pinta is happy to be there and\nCreasy doesn't seem to mind.\n\n                          CREASY\n             Did you sleep alright?\n\n                            PINTA\n             Yes.\n\n                          CREASY\n             How's the ankle? Can you put your weight\n             on it?\n\n                            PINTA\n             It's   not too bad. Will it take a long\n             time   before it's better? Our big swim\n             meet   is in three weeks. Interschools.\n             I was   going to swim in the one hundred\n             meter   freestyle.\n\n                          CREASY\n             In a week you should be fine.\n\nThey drive on a few silent beats, until...\n\n                          PINTA\n             Doesn't matter. I always finish second.\n\n                          CREASY\n             You need to practice.\n\nPinta looks at him hopefully, but Creasy catches himself.\nHe's not going to coach a little girl. Finally...\n\n                            PINTA\n             I will.\n\nINT.   KITCHEN - RAMOS VILLA - EVENING\n\nGomez, Maria and Creasy again joined by Pinta.    As Creasy\nplaces a fork of meat into his mouth...\n\n                          PINTA\n             Creasy, what's a concubine?\n\nCreasy opens his mouth, takes the fork of meat back out.\n\nWork in Progress 2/10/03                                   44.\n\n\n                         CREASY\n            Why do you ask?\n\n                         PINTA\n            It was in a book at school.   Concubine.\n\nMaria and Gomez wait to see how he'll answer.\n\n                         CREASY\n            Well, it's a sort of wife.\n\n                         PINTA\n            But the Emperor of China had 1000 of\n            them! How can that be?\n\n                         CREASY\n            In the West, it's one wife for one\n            husband, but different cultures have\n            different rules.\n\n                         PINTA\n            It must be difficult having lots of\n            wives.\n\n                         CREASY\n            You feel sorry for the husband?\n\n                         PINTA\n                   (in Spanish)\n            Yeah. Can you imagine my mother\n            multiplied by a thousand?\n\nMaria and Gomez burst out laughing. So funny that Creasy\nsmiles. Pinta lights up at the sight. A huge victory.\n\n                         PINTA\n            Creasy, you're smiling.\n\nHe reverts to a frown. Now Pinta bursts out laughing.\nAnd Creasy can't help but smile again.\n\n                            CREASY\n            I guess I am.\n\nPinta changes subject.\n\n                         PINTA\n            So how come you know so much about those\n            countries?\n\n                         CREASY\n            I had to do my homework on them when I\n            worked there. Also I enjoy history.\n\nWork in Progress 2/10/03                                  45.\n\n\n                          PINTA\n             What did you do in Asia? Is that where\n             you met the man with cigarettes?\n\n                          CREASY\n             No, that was in Columbia.\n\n                                                CUT TO:\n\nGOMEZ\n\nHumming to himself as he brushes the leaves out of the\nempty SWIMMING POOL.\n\n                                                CUT TO:\n\nCU of a water faucet unloads 100 gallons a minute.\n\nA MAN'S HAND.   BLACK.\n\nRaises up against the blue sky. Like a kid playing\nCowboys and Indians. The finger pulls an imaginary\ntrigger.\n\nRAMOS POOL\n\nIn her swimsuit and cap, Pinta crouches in makeshift\nstarting blocks.\n\n                            CREASY\n             Bang!\n\nPinta takes off. Splashes into the water.     Not to\nCreasy's satisfaction.\n\n                          CREASY\n             No, no, come back.\n\nPinta turns in the water, looks back at him.\n\n                          CREASY\n             You don't flinch when a gun goes off; you\n             react. You go. Don't listen for the\n             sound; don't anticipate it. Concentrate\n             on the sound itself.\n\n                          PINTA\n             I don't understand.\n\n                            CREASY\n             Don't worry.    You will.\n\nCreasy points at the blocks.    Pinta gets out of the\nwater.\n\nWork in Progress 2/10/03                                  46.\n\n\nShivering, Creasy throws a towel around her and\nrubs her down.\n\nINT.   MERCEDES - ROLLING\n\nOn the way to school. Pinta is stealing looks at\nCreasy's right hand. She knows the answer must be\nserious, but she has to ask.\n\n                          PINTA\n             Creasy, what happened to your hand?\n\nCreasy looks at her a moment, deciding. Pinta\npractically holds her breath, watches him, knows the\nanswer may come. Creasy checks the mirror, watches the\nroad.\n\n                          CREASY\n             A man asked me questions once.   He smoked\n             a lot. There was no ashtray.\n\nThat's it. End of explanation. Creasy continues\nwatching the road. Pinta watches him.\n\n                          CREASY\n             Remember you asked me what state I was\n             from?\n\n                            PINTA\n             Yes.\n\n                          CREASY\n             Where you're from isn't so much about\n             geography; it's about events. Where\n             you're from is what happened to you.\n\n                          PINTA\n             Good things happen, too, Creasy.\n                    (smiles big)\n             Like meeting me.\n\n                          CREASY\n                    (after a beat)\n             I guess that really does make me a hard\n             case.\n\nAs the two of them share a LAUGH...\n\nINT.   3RD FLOOR HALLWAY - RAMOS VILLA - NIGHT\n\nLisa walking toward Creasy's room. As she moves to\nknock, she sees the door is ajar, hears voices. She\npeeks in.\n\nWork in Progress 2/10/03                                     47.\n\n\nCreasy and Pinta sit on the floor, pencils, papers and a\nbook spread out before them. Doing her history homework.\n\nLISA'S POV - OF CREASY\n\nHe's charming and great with Pinta.     And sexy... Evelyn\nwas right.\n\n                          PINTA\n             Do you have a girlfriend, Creasy?\n\n                           CREASY\n             No.\n\n                          PINTA\n             Did you used to?\n\n                           CREASY\n             Yeah.   Two or three.\n\nLisa continues to watch the little play. She smiles,\nknocks on the door as she opens it. Pinta and Creasy\nboth look back over their shoulders.\n\n                          LISA\n             Creasy, tomorrow, after you drop off\n             Pinta, could you come back to take me to\n             get my hair done?\n\nCreasy nods. They both continue to look at her.      She\ngets the feeling she's interrupting.\n\n                          LISA\n             Alright, I'll leave you two to your\n             history.\n\nAs she goes...\n\nEXT.   HAIRDRESSERS - ZONA ROSA - DAY\n\nMexico City traffic is heavy. Cars and people. Creasy\nstands by the car across the street. Cooling his heels.\nHe can just catch a glimpse of Lisa in the shop.\n\nSuddenly the traffic seems to finish, expending itself.\nThe street goes ominously quiet. Creasy's antennae go\nup.\n\nA police car comes prowling down the empty street.\nCreasy makes eye contact with the guys up front.\n\nThen, Creasy spots a BUSINESSMAN coming out of a doorway\nwith a BODYGUARD attached. The bodyguard is speaking\ninto a two-way radio.\n\nWork in Progress 2/10/03                                    48.\n\n\nCreasy's sixth sense tweaks as a Mercedes 500 pulls up to\ncollect the businessman.\n\nAnd the cop car disappears around the corner even as TWO\nMEN start toward the businessman.\n\nLisa exits the hairdresser's.    Looks stunning.\n\nCreasy starts across the street toward her.\n\nA second car squeals around the corner behind the\nMercedes and everything goes to Hell.\n\nGUNFIRE erupts.\n\nAnd then Creasy is there.\n\nHis arm around Lisa's waist, sweeping her off her feet.\nThe next thing she knows she flattened on the ground in a\nshop doorway, Creasy on top of her. Shielding her.\n\nThe bodyguard beside the businessman is killed. The body\nguard in the Mercedes trades a full magazine before he's\nshot.\n\nA PEDESTRIAN is killed.\n\nLiza screams as the glass above and behind them shatters.\n\nThe businessman is hustled into the back of the second\ncar.\n\nLisa sees the gun in Creasy's hands.\n\nShe hears the slamming of the car door, the screeching of\ntires. A parked VAN also hauling ass out of there. But\nthen she's aware of something else.\n\nCreasy on top of her.   She feels his weight, his heat...\n\n                            CREASY\n             Don't move.\n\nShe watches as he rises, goes to the curb. One bodyguard\nis sprawled dead across the ground. Red blood on the\nsidewalk. As Lisa closes her eyes.\n\nINT.   MERCEDES - STREET - DAY\n\nLisa sits in the backseat. Through the window we can see\nCreasy wrap up his statement to a member of the JUDICIAL\nPOLICE. Finally he gets in the car, starts to drive.\n\nWork in Progress 2/10/03                                      49.\n\n\n                          LISA\n             Murdering people in the street... You\n             had your gun, why didn't you shoot them?\n\nThe shoulders in front of her just shrug.\n\n                          CREASY\n             Nothing to do with me. Or you. Besides,\n             there was another one in the passenger\n             side of the van with a sawed-off shotgun.\n             If I'd started shooting his friends, he\n             would've had me. And you.\n\nQuiet a beat. Lisa pulls a sliver of glass from her\nhair, looks from it to Creasy.\n\n                          CREASY\n             A minimum close protection team consists\n             of four men for high threat targets and\n             environments. Even in a low threat\n             situation, you need two guards plus a\n             security trained driver.\n\nShe shakes involuntarily. It's hitting her.      As they\nmake eye contact through the mirror...\n\nEXT.   HIGHWAY UNDERPASS - MEXICO CITY - DAY\n\nThe Mercedes parked. Creasy and Lisa up against it.\nFucking. No cultured way to put it. Like animals. A\nprimal release for both of them.\n\nEXT.   COURTYARD - PINTA'S SCHOOL - DAY\n\nPinta waiting alone. Creasy's late. Then the gate\nswings back; the Mercedes drives through. Smiling, she\nhurries over, hops in the passenger seat.\n\nMERCEDES - ROLLING\n\n                          PINTA\n                    (happy to see him)\n             You're late.\n\n                           CREASY\n             I'm sorry.\n\n                          PINTA\n             You were never late before, I was\n             worried.\n\nCreasy doesn't answer.    He actually looks guilty.   Pinta\nwatches him a moment.\n\nWork in Progress 2/10/03                                    50.\n\n\n                          PINTA\n             Where's my mother?\n\n                          CREASY\n             I dropped her at home.\n\n                          PINTA\n             It's no wonder you're late.      Why didn't\n             she just come with you?\n\nCreasy doesn't answer, just grunts. Pinta keeps looking\nat him and it suddenly all makes sense.\n\nHe looks over at her, starts to say something, then\nthinks better of it. Finally...\n\n                          PINTA\n             Do you think my mother likes you?\n\nShe's for sure pissed. Definitely aware and definitely\njealous. Creasy's a bit amazed, not sure how to respond.\n\n                          CREASY\n             I think she's afraid of me.      But not the\n             same way most people are.\n\nPinta considers this.   Then..\n\n                          PINTA\n             I'm not afraid you, Creasy.\n\n                          CREASY\n             I know you're not.\n\n                          PINTA\n             Are you afraid of me?\n\nCreasy looks at her, almost like he's deciding.\n\n                             CREASY\n             I used to be.     At first.   But not\n             anymore.\n\nHer smile is huge.\n\n                             PINTA\n             Good.\n\nEXT.   GARDEN POOL - RAMOS VILLA - DAY\n\nHeated. Steam rising off the water. PINTA stands with\nher eyes closed. Creasy, standing beside her, brings TWO\nBLOCKS together with a WHACK!\n\nWork in Progress 2/10/03                                       51.\n\n\nPinta flinches at the sound. She opens her eyes, shrugs\nan apology at him. Creasy frowns, shakes his head.\nPinta closes her eyes again. He starts walking around\nher. Frank oversees the whole program.\n\n                          CREASY\n             The gunshot holds no fear.    Say it.\n\n                          PINTA\n             The gunshot holds no fear.\n\n                          CREASY\n             You welcome the sound. The sound is what\n             lets you go. The sound is what frees\n             you. You are a prisoner in those blocks\n             until you hear the sound.\n\nEyes closed, she's drifted off with his voice. And\nCreasy WHACKS them together right in front of her face.\n\nPinta smiles at the sound.     Creasy smiles at the sight.\n\nEXT.   RAMOS POOL - DAY\n\nWHACK!   Pinta bolts from the blocks.    SPLASHES.\n\nWHACK! WHACK! WHACK! Pinta surges.      Pinta arcs.    Pinta\nknifes into the water.\n\nPinta touches the far wall of the pool, the finish line.\nCreasy checks his watch, claps.\n\n                          PINTA\n             I'm tough, Creasy.    I'm tough as you.\n\n                          CREASY\n             There's no such thing as tough.    You're\n             either trained or untrained.\n\nPinta raises her arms overhead, makes like Rocky across\nthe shallow end. Creasy shakes his head in amusement.\n\nINT.   LISA'S BEDROOM - DAWN\n\nFirst light is just tracing outlines against the window.\nLisa alone in bed, staring at the ceiling. Frightened at\nwhat she's feeling.\n\n                                                 CUT TO:\n\nCREASY\n\nSleeping, looking sexy.\n\nWork in Progress 2/10/03                                   52.\n\n\nEXT.   COURTYARD - RAMOS HOUSE - DAY\n\nAs the Mercedes pulls in, another car is ahead of it.\nSamuel is home, a DRIVER pulls his LUGGAGE from the\ntrunk.\n\nPinta gets out of the Mercedes.\n\n                           PINTA\n             Hi, Dad.\n\nHe gives her a pat on the head. Simultaneously, Samuel\nfixes Creasy with a look, strides purposefully over. He\nthrusts out his hand, shakes Creasy's.\n\n                          SAMUEL\n             I want to thank you, Creasy.   For what\n             you did for my wife.\n\nCreasy wants to choke, but he just nods, looks past\nSamuel to Pinta who looks bemused. He doesn't even want\nto know exactly what she knows.\n\nThe Car Wash Guy, - Pedro, ingratiates himself with\nSamuel.\n\nINT.   CREASY'S ROOM - NIGHT\n\nCreasy's finger presses play. \"Blue Bayou\" begins.\nPlaintive, haunting. As he moves to sit in his chair, he\npasses the scotch bottle. It has gone unopened.\n\nHe ejects the shell from the breach of the 9mm, smoothly\ncatches it on the back of his hand. Rock steady.\nFrank's tail wags.\n\nINT.   PINTA'S ROOM - NIGHT\n\nWhere the song drifts down. Pinta smiles, closes her\neyes. Now she can go to sleep.\n\nINT.   LISA & SAMUEL'S ROOM - NIGHT\n\nSamuel makes love to his wife. But Lisa looks past him,\nthrough the walls and floors to where that song plays.\n\n                          LINDA RONSTADT\n             I'm going back someday, come what may, to\n             Blue Bayou.\n\nWork in Progress 2/10/03                                     53.\n\n\nINT.   CREASY'S ROOM -NIGHT\n\nCU of Creasy.\n\n                                                 DISSOLVE TO:\n\nEXT.   PARKING LOT - MUNICIPAL POOL - DAY\n\nThe big swim meet. Race day. A lot of security, men\nspeaking into their wrists. For a public gathering the\nmood almost seems ominous. Creasy and Pinta exit the\nMercedes. Pinta watches wistfully as her fellow STUDENTS\nstream toward the water with their PARENTS.\n\n                          PINTA\n             What's so important in Los Angeles?\n\n                          CREASY\n             Your father has business.\n\n                            PINTA\n             Why today?    And why'd she have to go with\n             him?\n\nCreasy shrugs. No comforting answer for her.     He looks\naround at some of the other bodyguards.\n\n                          CREASY\n             Good luck. I'll be waiting here when\n             you're done.\n\nBut she's shaking her head adamantly.    Determined.\n\n                          PINTA\n             You're coming with me.\n\nEXT.   SWIMMING MEET - MUNICIPAL POOL - DAY\n\nA big MARQUEE has been set up alongside the pool.\nColtish girls in swimsuits. Parents socialize, drink\ncocktails. Richly dressed. Bodyguards and security are\noutside of it, on the perimeter.\n\nCreasy looks completely out of place.\n\n                          PINTA\n             Stand near the finish line.\n\nPinta starts away.\n\n                            CREASY\n             Pinta.\n\nShe turns, looks back at him.\n\nWork in Progress 2/10/03                                     54.\n\n\n                            CREASY\n            The blocks.\n\n                         PINTA\n                   (smiles; knows)\n            I'm a prisoner in them.    Until the\n            gunshot sets me free.\n\nCreasy nods. He smiles. He's serious now. As he\nwatches her head off for the track, Sister Anna steps up.\n\n                         SISTER ANNA\n            Mr. Creasy, nice to see you.\n\nAnd now Creasy is completely out of place.\n\n                         CREASY\n                   (apologetic)\n            Pinta's parents are in Los Angeles.      I\n            was going to wait in the courtyard,\n            but...\n\nShe takes his arm, pats his hand.\n\n                         SISTER ANNA\n            Today you are her father.\n\nAs Creasy lets this sink   in, looks out where Pinta is\nwarming up. Sister  Anna   smiles, heads off to a group of\nparents. We're left  with   Creasy. Confused Creasy. But\nclarity is creeping in.    As the sky opens up around\nhim...\n\n                                                   CUT TO:\n\nSTARTER'S PISTOL\n\nPointed up at precisely 45 degrees.    BAAAANGG!\n\nSTARTING BLOCKS\n\nEyes closed serenely, Pinta surges forward, leaving\neveryone behind.\n\nCREASY\n\nSees it. She hasn't even hit the water and he already\nknows she's won.\n\nPINTA\n\nSPLASH! Ten meters in before she breaks the surface.\nHer head sweeping left and then right.\n\nWork in Progress 2/10/03                                   55.\n\n\nWherever her competitors are, it's somewhere behind her.\nAnd the future, everything ahead, is wide open.\n\nTURN WALL - UNDERWATER\n\nPinta somersaults, kicks off and is gone.\n\nSURFACE\n\nAnd the finish line seems to come to her.\n\nTHE CROWD\n\nCheers enthusiastically as she reaches the finish wall.\n\nCREASY\n\nWatches her, satisfied with what he's done.\n\nPinta hauls herself out of the water and runs.\n\nA beeline for Creasy. And the poor fucker doesn't even\nunderstand, until she's leaping the last few feet...\n\nInto his arms.\n\n                          PINTA\n             I won, Creasy! I won!\n\nShe loves him...   Creasy hugs her.   He loves her back.\n\nINT.   TRADITIONAL RESTAURANT - MEXICO CITY - NIGHT\n\nA MARIACHI BAND roams. We see Creasy but not who he's\nwith. A date? As we come around it's Pinta. Sitting\nwith them, Rayburn and his wife. And a sleeping four-\nyear-old.\n\nNOTE: Rethink following dialogue with reference to\nCreasy / Rayburn background.\n\n                          PINTA\n             My Dad said all your friends were dead.\n\n                          RAYBURN\n             All but one. The most important one.\n             When we were eighteen, we made an\n             agreement to \"take the world\" together.\n\n                          CREASY\n             Then one day, he calls and says, 'I'm in\n             love and I'm moving to Mexico.' I said\n             what happened to the plan?\n\nWork in Progress 2/10/03                                    56.\n\n\n                         RAYBURN\n            I said the plan was right here.\n\nRayburn looks at beautiful 19-year-old Alicia and their\nfour-year-old son sleeping.\n\n                         CREASY\n            I hung up on him. When I met Alicia, I\n            got it.\n\nAlicia blows Creasy a kiss.\n\n                         CREASY\n            Can I kiss her now, or after you've gone\n            to bed?\n\nLaughter.\n\n                         PINTA\n            Okay, I think now is as good as time as\n            any.\n\nShe takes out a velvet pouch from her pocket. She holds\nit out to Creasy. He looks at her, takes it from her\nhand. His thick fingers fumble with a delicate\ndrawstring.\n\nPinta waits for his reaction as Creasy pours a simple,\nbut fine MEDALLION and chain into the palm of his hand.\n\n                         PINTA\n            I bought it with my own money.     I saved\n            it.\n\nCreasy is really affected, tries to hide it.    She takes\nit, slips it over his head.\n\n                         PINTA\n            It's St. Jude, the patron saint of lost\n            causes.\n\n                         RAYBURN\n            And hard cases. Creasy's the reason St.\n            Jude became a Saint in the first place.\n\n                         PINTA\n            Yeah, that's right.\n\nCreasy looks at it, considers.\n\n                         CREASY\n            Thank you, Pinta, it's beautiful.\n\nWork in Progress 2/10/03                                  57.\n\n\nPinta kisses him. As the Mariachi band drifts over,\nRayburn grabs his wife by the hand.\n\n                          RAYBURN\n             Come on, baby. I feel like a third\n             wheel. Watch the kid.\n\nThey dance. A waiter steps over, refills Creasy's water\nglass. As he drinks...\n\n                          PINTA\n             Could I ask you a question?\n\n                          CREASY\n             Could I stop you?\n\n                          PINTA\n             You don't drink like you used to.\n\n                          CREASY\n             That's not a question.\n\n                          PINTA\n             I know because I go in your room and\n             check the bottles.\n\n                          CREASY\n             Still not a question.\n\n                          PINTA\n             My mom drinks, too...    Why do people\n             drink, Creasy?\n\n                          CREASY\n             Now that's a question. I don't know\n             about your Mom. For me, the problem\n             isn't in the glass. The problem's in\n             between my ears.\n\n                          PINTA\n             You think too much?\n\n                           CREASY\n             Yeah. Because at one time, I didn't\n             think enough.\n\nPinta nods, thinks she understands.\n\nINT.   AIRPORT - MEXICO CITY - DAY\n\nSamuel and Lisa on the moving escalator. Home from Los\nAngeles. They look down through the glass, see Creasy\nwaiting for them below. And finally, Lisa frowns.\n\nWork in Progress 2/10/03                                      58.\n\n\n                         LISA\n            He has to go, Samuel.\n\n                            SAMUEL\n            What?   Who?\n\n                            LISA\n            Creasy.\n\n                           SAMUEL\n            Why?    You were so pleased with him.\n\n                         LISA\n            Pinta likes him too much.\n                   (a beat)\n            She thinks of him as a father.\n\n                         SAMUEL\n            That's ridiculous.\n\n                            LISA\n            It's not.\n\nSamuel thinks about it, is almost apologetic.\n\n                         SAMUEL\n            I've just been so busy, Lisa.\n\n                            LISA\n            He has to go.\n\nSamuel looks at her, wonders at her adamancy.\n\n                         SAMUEL\n            The three month trial ends in a week. I\n            just won't confirm the position. That\n            possibility was understood when I hired\n            him.\n\nLisa gives him a look. She wants it done today.     But for\nonce, Samuel is stronger than his wife.\n\n                         SAMUEL\n            I won't create bad feelings. And another\n            week won't make a difference.\n\nOff the escalator, they turn toward Creasy waiting\nunaware.\n\n                         SAMUEL\n            It will be a hard break.\n\n                            LISA\n            She's young.     She'll get over it.\n\nWork in Progress 2/10/03                                    59.\n\n\n                          SAMUEL\n             I wasn't thinking of Pinta.\n\nAs Lisa looks over at Samuel, he's reaching out his hand,\nsmiling big.\n\n                          SAMUEL\n             Creasy, how are you?\n\nAs they shake hands...\n\nINT.   SITTING ROOM - RAMOS VILLA - DAY\n\n                          PINTA\n             I don't want to play piano!   I want to\n             swim!\n\n                          SAMUEL\n             No discussion, Pinta. Mr. Lozzi is a\n             famous teacher. If he accepts you, you\n             will play.\n\nAs Pinta marches out of the room...\n\nEXT. RAMOS VILLA- DAY\n\nThe sounds of Samuel's baby grand resonates throughout\nthe villa. An impassioned rendering of a Mozart\nsymphony.\n\nPinta is looking for Frank. Today is Saturday and on\nweekends Frank is allowed to travel with them. And today\nshe is claiming all her rights.\n\n                           PINTA\n             Frank.   Frankie.\n\nPinta whistles.\n\n                          CREASY\n             Pinta, we've got to go.   Travel sucks at\n             this time.\n\n                           PINTA\n             Frank.   Frankie.\n\nINT.   MERCEDES - ROLLING - DAY\n\nCreasy driving.   Pinta looking noble and brave.\n\n                          CREASY\n             That's strange. Frank was a no-show.\n             Not like him to miss a ride.\n\nWork in Progress 2/10/03                                   60.\n\n\n                          PINTA\n                    (distant)\n             You should break all my fingers, Creasy,\n             then tape them back together. I won't be\n             able to play the piano, but I could still\n             swim.\n\n                          CREASY\n             Don't be a baby. You're tougher than\n             that.\n\n                          PINTA\n             There's no such thing as tough, Creasy.\n             Just trained and untrained.\n\n                          CREASY\n                    (smiles)\n             Then be trained.\n\n                          PINTA\n             I'm going to keep people safe someday.\n             Just like you.\n\n                             CREASY\n             Be a swimmer.\n\n                          PINTA\n             I could do it. Remember the day   you\n             wanted the pencil? I know why.    And I\n             saw that car again. I wrote the   license\n             number in my notebook. Except I   missed\n             the last number.\n\nCreasy checks his mirror, nothing back there now.     He\nthen looks at Pinta. A bit amazed.\n\n                          CREASY\n             You'll have to show me that number when\n             we get home.\n\nEXT.   VIA BUENOS AIRES - MEXICO CITY - DAY\n\nA wide avenue. The Mercedes pulls up parks in the only\nopen spot. Creasy and Pinta get out. We walks her\nacross the street, along the lawn to the apartment\nbuilding. They look up at the sound of piano keys\ntinkling above. Then:\n\nCreasy looks at her, smiles to himself.   Pinta looks\nback.\n\n                          CREASY\n             Continue to play in the wrong key, like\n             you're dyslexic.\n\nWork in Progress 2/10/03                                     61.\n\n\n                           PINTA\n            Dyslexic?\n\n                         CREASY\n            Like St. Jude. A hopeless case that has\n            a complete block about 'C' Minor. But\n            remember, \"Whoever resists authority will\n            bring judgement upon themselves.\" New\n            Testament, Romans 13.\n\n                         PINTA\n            You got that right.\n\n                         CREASY\n            You'll be back in the water in twenty-\n            four hours.\n\nCreasy presses the buzzer. As they wait, Pinta sees\nsomething, reaches down to pull a DANDELION from a crack\nwhere the sidewalk meets the wall. She smiles at Creasy.\n\n                         PINTA\n            For you, Creasy.\n\nCreasy takes it from her. He's saved by the bell as a\nsecond buzzer answers the first. Creasy pulls the door\nopen. Pinta heaves a resigned sigh.\n\n                         CREASY\n            Remember 'dyslexic.'\n\nAs Pinta nods, disappears inside...\n\n                                               DISSOLVE TO:\n\n2ND FLOOR WINDOW\n\nThe curtains rustle in the breeze. The sound of badly\nplayed scales. And then sounds of frustration.\n\nThen, the sound of the teacher playing.   Pinta appears in\nthe window for just a moment.\n\nCREASY\n\nLooking up from the window of the Mercedes. As Pinta is\ncalled back inside, Creasy checks out, twirls the\ndandelion Pinta gave him. HUMS to himself. \"Blue\nBayou.\"\n\n                                               CUT TO:\n\nWork in Progress 2/10/03                                       62.\n\n\nTHE STREET\n\nCreasy leaning against the Mercedes. Traffic pounding\nby. The dandelion is stuck in a button hole of his\nshirt.\n\nAnd then suddenly traffic thins out. Reminiscent of the\nprevious two kidnappings. It's a process. Creasy\nstraightens up.\n\nA Judicial POLICE CAR cruises by, slowly. Creasy makes\neye contact with the two cops up front. The same guys\nwho were at Zona Rosa.\n\nCreasy starts across the street toward the apartment\nbuilding. At the same time as...\n\nThe door bangs open. Pinta exiting. She spots Creasy, a\nhuge grin on her face. She was not accepted.\n\nAnd a white TOYOTA COROLLA coming the other way.\n\nThe police car reverses back, cutting Creasy off from\nPinta. The COPS getting out, big smiles on their faces.\n\nTHE COROLLA\n\nSlides to a stop in front of Pinta, blocking her path to\nCreasy. And as TWO MEN leap out from the backseat...\n\n                           CREASY\n                     (drawing his 9mm)\n              Run, Pinta, run!\n\nBut she's rooted with fear.\n\nAnd the men are almost on her.\n\nCreasy raises the 9mm overhead.    BANG!\n\nAnd the sound frees her.   Pinta runs!\n\nDucking under a flailing arm.    Quick and lithe.   Trying\nto reach her bodyguard.\n\nThe cops drawing Uzi's..\n\nCreasy plants himself, the Sig Sauer now level.     He fires\ntwice into COP ONE, dead center in the chest.\n\nPinta runs.   Chased by the TWO MEN.\n\nCOP TWO returns fire wildly: the Mercedes hit in a ten\nbullet line.\n\nWork in Progress 2/10/03                                        63.\n\n\nCreasy fires two more rounds into COP TWO who's hit high\nin the chest and throat. Precise.\n\nCreasy pivots, strides calmly forward, firing at the men\nchasing Pinta. BOOM! BOOM! BOOM!\n\nMAN ONE goes down, hit in the ribs.\n\nA bullet slams Creasy in the back, fired from inside the\nCorolla.\n\nCreasy fires back.    BOOM!    BOOM!\n\nMAN THREE falls dead, hit just below his nose, just above\nhis teeth. The FAT DRIVER fires, now, and Creasy is hit\nin the shoulder.\n\nAnd Pinta disappears into the traffic.        Gone.\n\nMAN TWO, who has abandoned chasing Pinta, fires again.\n\nCreasy drops the 9mm as he is hit in the stomach.      He\nfalls to his knees.\n\nThe dandelion starts to come apart.      Drifting away, piece\nby piece.\n\nSlack-jawed, Creasy looks about. Sees the FAT DRIVER\nheaving himself out of the Corolla while MAN TWO scans\nfor Pinta who's nowhere in sight.\n\nShe got away!   Creasy smiles even as he crumples over on\nhis side.\n\n                              PINTA'S VOICE\n            CREASY!\n\nAnd Pinta is back. Running toward Creasy. She can't\nleave him like this. She was safe and now she's back.\n\n                              CREASY\n            NOOO...\n\nShe runs to him, wraps her arms around him.\n\n                              PINTA\n            Creasy...\n\nMAN TWO catches up, tears Pinta away, starts back for the\nsedan. Creasy can only blink after them.\n\n                              PINTA\n            Creasy!\n\nWork in Progress 2/10/03                                       64.\n\n\nIt's not a cry for help.     It's anguish for him.\n\n                            CREASY\n              Pinta...\n\nMAN TWO crams her in the back seat, follows. The fat\ndriver gets back in behind the wheel. As the door slams\nshut, wheels spin, grip and the Corolla accelerates away.\n\nWe just see Pinta look back through the rear windshield.\nAn anguished image before she's pulled back down.\n\nCreasy makes a wish.     Not for himself, but for her.\n\n                           CREASY\n              Don't die, Creasy, don't die.\n\nAnd everything goes very, very,\n\nBLACK\n\nSound breaks through first. The whir and beep of medical\nequipment. And we fade back into:\n\nINT.    HOSPITAL ROOM - MEXICO CITY - DAY\n\nCreasy hooked up. Tubes running in and out of the\nunconscious man. And he's suddenly surrounded.\n\nThe CHIEF of the Judicial Police and several uniformed\nOFFICERS. At the foot of the bed several NEWSPAPER\nREPORTERS and PHOTOGRAPHERS.\n\n                           CHIEF\n              This man, Senor Robert Creasy, an\n              American citizen, is under arrest for the\n              murder of two police officers, Hector\n              Gonzalez and Pablo Lunara. He is also\n              the prime suspect in the kidnapping of\n              Pinta Martin Ramos.\n\nOne of the officers props up Creasy's head.     The chief\npuffs his chest out and flashes flash.\n\nINT. RAMOS VILLA - BASEMENT - DAY\n\nSounds of a DOG BARKING\n\nBruno opens the door to a very distraught Frank.     Someone\nhad locked him in there.\n\n                                                 CUT TO:\n\nWork in Progress 2/10/03                                   65.\n\n\nLISA\n\nSitting catatonic. In the dark. Halfway to mourning\nalready. A HUBBUB drifts up from the rooms below.\n\nINT.   SITTING ROOM - RAMOS VILLA - MEXICO CITY - DAY\n\nA bedraggled-looking Samuel sits with Jordan by the\nphone. An INSURANCE COMPANY LAWYER is here as well.\nMaria cries softly in a doorway.\n\nMONTAGE - of chaos and panic. Judicial police are trying\nto set up shop. Tape recorders. Listening devices.\nVideo cameras.\n\nJUMPCUTS:\n\n                          LAWYER\n             When did he say he would call back?\n\nCut to\n             Do not tell them you have a kidnap\n             policy.\n\nCut to\n             They usually ask for three times the\n             amount they expect...\n\nThey react as two vehicles pull up outside. Chaos as the\nfront door opens. MEN IN SUITS, several POLICEMEN.\nTheir very well-groomed leader is COLONEL TAZINARI.\n\n                          TAZINARI\n             Senor Ramos. I am Ernesto Tazinari,\n             commandante of the Judicial anti-\n             kidnapping division.\n\n                          JORDAN\n             We do not need or want police\n             involvement. I am the negotiator. We\n             feel a better guarantee of getting Pinta\n             back without your involvement.\n\n                           TAZINARI\n             I have a written order from the Public\n             Ministry. Two police officers were\n             killed.\n                     (he holds up the phone)\n             This is the Attorney General Navarro\n             Bernal Diaz.\n\nJordan accepts reality.    They're taking control.\n\nWork in Progress 2/10/03                                   66.\n\n\n                           TAZINARI\n              The law requires an intervention by the\n              authorities \"de officio.\"\n\nA ringing phone sounds like an bomb exploding in the\nroom. A technician answers. Jordan takes the receiver.\nWe hear the conversation. The kidnapper only wants to\ntalk to the father. Everybody is one headsets,\nmonitoring. Samuel listens carefully. Jordan prompts\nhim with hand-written replies on a notepad. Samuel\nnegotiates the amount via notes from his lawyer.\n\nQUICK CUTS:\n\n                           SAMUEL\n              It's impossible. I cannot afford thirty\n              million. I will need to borrow the\n              money.\n\nSamuel proposes five million.   Kidnapper gets angry.\nDemands 20 million.\n\n                                                CUT TO:\n\n                           SAMUEL\n              The realities are I do not have access to\n              this type of money.\n\nThey settle at ten million.   The kidnapper gives a list\nof instructions.\n\n                                                CUT TO:\n\n                           KIDNAPPER\n              Two and a half million in two different\n              bags. The bags you can get from Save-On.\n              Fifteen gallon, black canvas, divide the\n              money equally.\n\nSamuel is on another phone talking to family friends\nasking if they will front a hundred thousand dollars\neach. Which will be paid back by the K & R insurance in\n45 days.\n\n                                                CUT TO:\n\n                           SAMUEL\n              Yes, I will give you interest.\n\n                           KIDNAPPER\n              I will instruct you on the exchange over\n              the next 24 hours.\n\nWork in Progress 2/10/03                                    67.\n\n\nLisa is nowhere to be found.   Locked in her bedroom in\ndarkness with Frank.\n\nEND MONTAGE\n\n                                                 CUT TO:\n\nINT.   ENTRY LOBBY - HOSPITAL - DAY\n\nAnother showcase press conference.     More REPORTERS and\nnow TV NEWS CREWS.\n\n                           CHIEF\n              The girl is a Mexican citizen. Her\n              father is Samuel Valencia Ramos.\n\nINT. HOSPITAL HALLWAY - WINDOW OVERLOOKING PRESS\nCONFERENCE\n\nRosanna, the woman we saw on T.V. earlier, stands\nwatching and listening. Incredulous and angry.\n\nMIGUEL MANZANO the Director of AFI (also seen earlier\non TV), approaches with his two assistants and kisses\nRosanna on the cheek.\n\n                           ROSANNA\n              A bodyguard was shot trying to protect a\n              9 year old. The bodyguard's American.\n              Not only that he's black.\n\n                           MANZANO\n              Is that good or bad?\n\n                           ROSANNA\n              That's good. Really good. He shot and\n              killed two judicial cops and a kidnapper\n              died in the attack. They're saying he's\n              responsible.\n\nManzano looks bemused, as he eats a sugary pastry.\nRosanna heads into the press conference.\n\nINT.   ENTRY LOBBY - HOSPITAL - DAY\n\n                           REPORTER ONE\n              Beside the American in custody, are any\n              other Americans involved in the\n              kidnapping?\n\n                           CHIEF\n              We're looking into it.\n\nRosanna can't believe what she's hearing.\n\nWork in Progress 2/10/03                                   68.\n\n\n                          ROSANNA\n             The two officers who were killed.\n             Records show they were off duty at the\n             time.\n\nThe Chief frowns at the sight of Rosanna, knows what a\nroyal pain in the ass she is. Manzano awaits his answer.\n\n                             CHIEF\n             I'm not sure.     All I know is they died\n             bravely.\n\nHe turns, points out another reporter.\n\n                          ROSANNA\n             If they were off duty, why were they in a\n             patrol car? What exactly were they doing\n             at the scene of a kidnapping?\n\nHe stares back over at her, furious.     Rosanna smiles.\n\n                          ROSANNA\n             Were they known for their exceptional\n             good luck?\n\n                          CHIEF\n             They were known for their professionalism\n             and integrity!\n\nINT.   STAIRWELL DOOR - HOSPITAL - DAY\n\nIt opens and out slides Rayburn. He looks down the\nhallway. Press conference is still going down that way.\nRayburn heads the other way.\n\nBut as he tries to enter Creasy's room, he's met in the\ndoor by TWO THUG COPS, in uniform.\n\n                             COP ONE\n             No visitors.\n\nCop two pokes a finger into Rayburn's chest.\n\n                             COP TWO\n             Who are you?\n\n                          RAYBURN\n             I'm here to see my friend.\n\nCop two pokes him again.     Goading him.\n\n                          COP TWO\n             Identification.\n\nWork in Progress 2/10/03                                     69.\n\n\nRayburn swallows his anger, starts fishing for his\nwallet. Suddenly, the thugs snap to attention. Manzano\nis on the way down followed by ADJUTANT and TWO\nPLAINCLOTHES.\n\nIgnoring the proffered salutes, Manzano finishes his\npastry, licks his fingertips as he regards Rayburn.\n\n                          MANZANO\n             When I heard it was this hospital I was\n             so pleased. There's a pastry shop\n             nearby. Delgado's. Do you know it?\n\nRayburn shakes his head.\n\n                          MANZANO\n             The best pastries in Mexico.\n\nManzano holds out his right hand.\n\n                          MANZANO (CONT'D)\n             Miguel Manzano.\n\nINT.   CREASY'S ROOM - HOSPITAL - DAY\n\nCreasy out of it still.    Rayburn and Manzano at the foot\nof the bed.\n\n                          RAYBURN\n             He's not a cop killer.\n\n                          MANZANO\n             I'm sure he isn't. Though he's certainly\n             adept at killing.\n\n                          RAYBURN\n             He was doing his job, protecting the\n             girl. If police were involved, you\n             figure it out. I'm here for him.\n\n                           MANZANO\n             So am I.\n\nAnd Creasy stirs.   Rayburn leans into his friend, Manzano\njust behind him.\n\n                          RAYBURN\n             You hear me, Crease?\n\nCreasy's eyes slit open.\n\n                          RAYBURN (CONT'D)\n                    (whispers)\n             You got three of the fuckers.   All dead.\n\nWork in Progress 2/10/03                                     70.\n\n\n                           CREASY\n             Pinta...\n\n                          RAYBURN\n             Two days gone. They're negotiating a\n             ransom.\n\n                          MANZANO\n             These things take time, Mr. Creasy.\n\nCreasy closes his eyes.\n\nINT.   RAMOS HOUSE (SIMULTANEOUS)\n\nTechnicians, police, Tazinari, Jordan, and Samuel all\nlisten intently to the call.\n\n                          VOICE\n             You have the money.\n\n                           JORDAN\n             Yes.\n\n                          VOICE\n             OK,repeat the drop instructions.\n\n                          JORDAN\n             The money, 10 million U.S. will be\n             divided into two 15 gallon black canvas\n             bags each containing five million which\n             will be checked at the bank by the K&R\n             agent. Then driven to the house in an\n             armored car where it will be transferred\n             to the delivery car.\n\n                          VOICE\n             The car will not be powerful and have no\n             trunk.\n\nIntercut the above with real time visuals illustrating\nthe process:\n\n1. INT. BANK    Teller counting the money witnessed by K&R\nagent.\n\n2. EXT. BANK Two bags being loaded into the armored\ncar. K&R agent watching.\n\n3. EXT. RAMOS HOUSE - DRIVEWAY Two bags being\ntransferred to the family Mercedes.\n\nThe K&R agent notices the Mercedes has a flat tire.     A\nsecond Mercedes is exchanged for the first.\n\nWork in Progress 2/10/03                                        71.\n\n\nThe two bags are transferred inside the garage. Jordan\nsupervises the transfer while the K&R agent takes an\nincoming call.\n\nINT. RAMOS HOUSE\n\nThe call between The Voice and Jordan continues.\n\n                         JORDAN\n            I need a driver to drive Samuel, the\n            father.\n\n                           VOICE\n            No.    Why?\n\n                         JORDAN\n            He has a heart condition.     Angina.   He\n            responds badly to stress.\n\n                         VOICE\n            OK. You will arrive at Columbus Circle\n            and Reforma Avenue at 3AM. You will\n            drive around the square two times.\n            Samuel will remove his shirt and hold it\n            out the window to I.D. the car.\n\nEXT. COLUMBUS CIRCLE - 3 AM\n\nThe delivery car with a white shirt held out of the\nwindow.\n\n                         VOICE     (V.O.)\n            There is a payphone     on the Southeast\n            corner. The phone      will ring. You will\n            answer and wait for     instruction.\n\nSamuel exits the car and goes to the payphone.      The phone\nis ringing. Samuel picks it up and listens.\n\nINT. RAMOS HOUSE - NIGHT\n\n                         JORDAN\n            We need proof of life.\n\nPAUSE.\n\n                         VOICE\n            Is the father, there?\n\nJordan hands the phone to Samuel.\n\n                           SAMUEL\n            Hello.\n\nWork in Progress 2/10/03                                    72.\n\n\n                          VOICE\n             If this girl's life  is as important to\n             you as it is to me,  do not play with the\n             process. Family is   everything. I am a\n             professional. You   keep your word and I\n             will keep mine.\n\nINT. DARKENED HALLWAY - HOSPITAL - NIGHT\n\nCreasy being wheeled down the hall by a tough plain-\nclothed Federal Policeman. Followed by Rayburn, Manzano,\nand Rosanna. The uniformed JUDICIAL POLICE are powerless\nto stop them.\n\n                          RAYBURN\n             What's the deal here?\n\n                          ROSANNA\n             I wouldn't gamble leaving him here.\n             These guys will kill him in a heartbeat\n             'while trying to stop him from escaping.'\n\nEXT. TRUNKLESS CAR - MEXICO CITY - NIGHT\n\nSamuel driving.   Tazinari dialing his cellphone.\n\n                          SAMUEL\n             He said no phones!\n\n                          TAZINARI\n             You do your job. I'll do mine.\n\nEXT.   BRIDGE OF THE AZTECS - NIGHT\n\nSamuel's car is parked on the  south side of the bridge.\nA shirtless Samuel carries two  large duffle bags\ncontaining ten million dollars  across the bridge. We see\nTazinari again dialing up his  cell phone.\n\n                          VOICE (V.O.)\n             Leave the money in the trunk of the car\n             with white paper taped to the windshield,\n             then return to your car and go home. Do\n             not look back.\n\nSamuel finds the car, leaves the bag in the trunk, he\nturns and heads back over the bridge.\n\n                          VOICE (V.O.)\n             Remember, I am a professional. If you\n             keep your word, I will keep mine. If you\n             do not, then God be with your child.\n\nWork in Progress 2/10/03                                     73.\n\n\nAs Samuel is walking back across the bridge. Suddenly\ngunfire from where he came, along with shouting and\nyelling. Samuel crouches and runs in the dark back to\nhis car with Tazinari.\n\nINT.   VETERINARIAN'S CLINIC - MEXICO CITY - DAY\n\nCages of mangy looking mutts. Pull back to reveal Creasy\non his hospital bed, IVs and all.\n\nRayburn sits nearby. He looks up as Creasy stirs, wakes\nagain. Creasy's eyes flicker to his friend, ask the\nfirst question on his mind. Pinta...\n\nRayburn looks away, can't face his friend.   And suddenly,\nCreasy knows.\n\n                           CREASY\n             She's dead.   Isn't she?\n\nRayburn finally nods. And with that gesture, God takes\neverything away. It might as well be the Old Testament.\nAnd we are about to get Biblical.\n\nCreasy turns his head, looks up at the ceiling.\n\n                          RAYBURN\n             It was a fuck up. Someone hijacked the\n             drop. The kidnapper, his nephew got\n             killed.\n\nCU of Creasy's face with his back to the room.     A\nthousand yard stare. His eyes glaze over.\n\nFLASHBACK\n\nINT. CAR - MEXICO CITY\n\nCU of Pinta looking up at Creasy. The camera ramps into\nPinta's smile. A small, but a sinificant moment in terms\nof their connection.\n\nINT. LISA & SAMUEL'S BEDROOM - DAY\n\nThe curtains are drawn tight. Slivers of light\nilluminate the darkened room. Lisa sits on the end of\nthe bed humming a nursery rhyme. She rocks gently.\n\n                          VOICE (V.O.)\n             You betrayed me. You killed my nephew\n             and took the money.\n\n                          K&R AGENT\n             No, not us...No we did not.\n\nWork in Progress 2/10/03                                   74.\n\n\n                          VOICE (V.O.)\n             Remember my words. Family is everything\n             and do not play with the process.\n\nThe phone line goes dead.\n\nINT.   VETERNARY CLINIC - DAY\n\nCreasy still staring into space.\n\n                          RAYBURN\n             She's dead Creasy.\n\nCreasy blinks away a solitary tear.\n\nINT. VETERNARIANS CLINIC HALLWAY - DAY\n\nDogs barking constantly. Manzano walks the hall flanked\nby a DOCTOR and a NURSE. A second policeman, Manzano's\nadjutant, brings up the rear carrying two heavy binders.\n\n                          MANZANO\n             She's dead. They fucked with 'the\n             process' and his nephew died.\n\n                          DOCTOR\n             He suffered gunshot   wounds to the upper\n             extremity, chest and   abdomen. He has a\n             collapsed lung which   is stabilized,\n             injured his spleen,   which we may have to\n             remove and ruptured   his intestine. He's\n             on strict bedrest or   there's a good\n             chance we could lose   him.\n\n                          NURSE\n             A strange man. He has much experience of\n             hospitals.\n\n                          MANZANO\n             Did he say so?\n\n                           NURSE\n             No.   But a nurse knows.\n\n                                                 CUT TO:\n\nMUGSHOT\n\nManzano and the adjutant have pulled chairs up alongside\nthe bed. The adjutant flips through one of the binders.\nEach page holds a single MUGSHOT. Each time Creasy\nshakes his head, the adjutant flips to the next photo.\n\nWork in Progress 2/10/03                                   75.\n\n\n                           MANZANO\n            Nothing?\n\nCreasy shakes his head.\n\n                         MANZANO\n            Excellent work by the way. Three men\n            dead. Only ten rounds fired.\n\nCreasy shakes his head at the next shot.\n\n                         MANZANO\n            If two of the men in my division could\n            shoot like that, I could get rid of the\n            other thirty-six.\n\nOne of the dogs starts to bark. Another. Soon ten of\nthem. The VET ASSISTANT enters, shouts at them to quiet.\nManzano ignores it, motions the adjutant to flip pages.\n\n                         CREASY\n            What am I doing here?\n\n                         MANZANO\n            Believe it or not, you're safe here. The\n            Judicial police will kill you. If they\n            can.\n                   (re: book)\n            This page?\n\n                           CREASY\n            No.\n\nThe adjutant reaches the last page.   Creasy shakes his\nhead.\n\n                         MANZANO\n            You have a rather checkered past. Mr.\n            Creasy. Your Interpol file is six pages\n            long.\n\n                         CREASY\n            Am I a suspect?\n\n                          MANZANO\n            No.   It would be convenient, but no.\n\nAs Manzano packs up his mugshot books...\n\n                         CREASY\n            Show me mugshots of Mexican policemen.\n            Maybe then we'll get somewhere.\n\nWork in Progress 2/10/03                                     76.\n\n\n                          MANZANO\n             All these photos you just saw were of\n             policemen. Sadly they're protected. La\n             Hermanidad. The brotherhood.\n\nManzano heads off.   As Creasy watches after him...\n\nINT.   DOG PENS - NIGHT\n\nCreasy sitting on the gurney, Rayburn buttons his shirt.\n\n                           RAYBURN\n                     (whispers)\n             Okay?\n\nCreasy nods. Rayburn gets Creasy's arm over his\nshoulder, eases him off the gurney till his feet hit the\nfloor.\n\nCreasy winces, but the two of them start to walk out.\n\nEXT.   BACK SIDE - VETERINARIAN CLINIC - NIGHT\n\nAn SUV rolling away. Lights out, engine off. It coasts\na hundred yards before the engine turns over. Rayburn\nbehind the wheel. As it sweeps past camera...\n\nINT.   SUV - ROLLING - NIGHT\n\nRayburn constantly checking the rear view.   No pursuit in\nsight. He looks over at Creasy.\n\n                          RAYBURN\n             How do you feel?\n\nCreasy looks over at him, finally shrugs.\n\n                          CREASY\n             Stomach's gone. But... okay.\n\n                          RAYBURN\n             I'll get you up to the border. Friend of\n             mine'll take you in to San Diego. Drop\n             you right at the hospital.\n\nCreasy's not really listening. He's been looking in the\npassenger side view mirror. Nothing back there. Creasy\nsits up. A bit of an effort.\n\n                          CREASY\n             Got a thing I gotta do first.\n\nWork in Progress 2/10/03                                       77.\n\n\nEXT.   VIA BUENOS AIRES - MEXICO CITY - DAY\n\nScene of the crime. Typical Mexican 'roadside shrines'\nwhere the policemen fell. A pyre of flowers where Pinta\nwas scooped up, Creasy's blood still staining the\nsidewalk alongside. A car pulls up...\n\nRosanna Guerrero gets out with a REPORTER and\nPHOTOGRAPHER. She directs them in Spanish. The reporter\nstarts making notes; the photographer snaps photos of the\nshrine.\n\nRosanna stands by the flower pyre. Something catches her\neye. A balled-up piece of paper and a half-burned candle\nbeside it. As she picks it up, she spots something else.\n\nAcross the street, Creasy walks. An awkward hitch in his\nstride. Outside the apartment of the piano teacher,\nsurveying the scene with experienced eyes. Unaware of\nRosanna\n\nCREASY (FLASHBACK)\n\nCorolla.   Muzzle flashes.    Pinta screaming...\n\n                             FEMALE VOICE\n             Creasy...\n\nCreasy wheels.   There's Rosanna.\n\n                          ROSANNA\n             A lot of people are looking for you.\n\n                          CREASY\n             I guess that makes you the smart one.\n\n                          ROSANNA\n             We're interested in the same thing.         I'm\n             writing a story.\n\nCreasy walks away from her.     Rosanna catches up and holds\nout a plastic ziploc.\n\n                          ROSANNA\n             This might interest you.       I found it\n             across the street.\n\nCreasy empties the contents of the ziplock into his hand.\nA small ball of paper and the remains of a black candle.\nCreasy unballs the paper. It's a photo.\n\nFLASH:   Creasy at the police station.      His photo taken.\n\nWork in Progress 2/10/03                                     78.\n\n\n                             ROSANNA\n               It's Santa Muerte. Death worship. The\n               religion of La Hermanidad. There's a\n               curse on you.\n\n                            CREASY\n               It's a little late.\n\nHe hands it back to her, not interested.    As he turns to\ngo.\n\n                            ROSANNA\n               What are you going to do?\n\nCreasy doesn't answer.\n\n                            ROSANNA\n               I can help. I have a situation Mr.\n               Creasy. There is a brotherhood called Le\n               Hermanidad which protects both high\n               ranking Government officials, corrupt\n               police, and organized crime at a level\n               that is very difficult for me to touch.\n               I believe you were a victim of this\n               organization. You and this story may\n               help to unmask them.\n\nCreasy looks carefully at Rosanna.    Right now he trusts\nno one.\n\n                            CREASY\n               Thank you.\n\nHe walks away towards Rayburn.\n\nEXT.   RAMOS HOUSE - DAWN\n\nThe SUV parked a discreet distance away. Rayburn grinds\nout another cigarette, mutters to himself.\n\nINT.   CREASY'S ROOM - DAWN\n\nBruno lets him in. Nothings been touched.     Creasy\nretrieves his bullet from his shrine along   with the\n'Jack', Marlboros, and New Testament. Puts    his few\npossessions in a bag. MOVE WITH him as he    silently\ncrosses out into the hall, heads toward...\n\nPINTA'S ROOM\n\nHe stands there a moment. His pain entirely his own.\nAnd then he goes to Pinta's little desk, finds her school\nnotebook buried in a pile. He flips through it until he\nfinds...\n\nWork in Progress 2/10/03                                        79.\n\n\nThe LICENSE PLATE NUMBER Pinta jotted for him. Then he\nnotices the notebook is really a diary. Every page\nreferences her day to day relationship with Creasy. \"I\nlove you Creasy Bear.\" He hears soft footsteps. Creasy\nturns.\n\nLisa stands in the doorway in her nightgown, her eyes\ndrilling through Creasy.\n\n                            LISA\n                      (softly)\n               You let them take her.     She loved you and\n               you let them take her.\n\nCreasy just blinks at her as the words blast through him.\n\n                            LISA\n               Why are you here?     Why didn't you die?\n\n                            CREASY\n               Because...\n                      (shrugs)\n               I was already dead.\n\nEyes brimming, Lisa has no more words.       But Creasy comes\nbearing cold comfort.\n\n                              CREASY\n               I want you   to know something.\n                      (a   beat)\n               I'm going   to kill them. Anyone who opens\n               their eyes   at me.\n\nLisa doesn't answer, but the connection between them is\nsuddenly monumental. Finally, Creasy looks away. He\npicks up Pinta's battered, old TEDDY BEAR.\n\n                              LISA\n               Creasy...\n\nHe turns, but she doesn't look back at him.\n\n                            LISA\n               Kill them, Creasy.\n\nCreasy nods.    He will.    As he continues away...\n\n                            LISA (CONT'D)\n               Kill them all.\n\nEXT. GARDEN / POOL - RAMOS HOUSE\n\nCreasy exits the house and stands by the pool. Frank\nappears tail wagging and attempts to comfort Creasy.\n\nWork in Progress 2/10/03                                       80.\n\n\nLeaves blow across the surface of the water. Underwater\nslow motion, a wall turn. It looks remarkably like\nPinta.\n\n\"Blue Bayou\" drifts through the air. Soft, in the ether\nsomewhere. Creasy hears it, half raises his head.\n\n                          PINTA'S VOICE\n             Why Blue Bayou, Creasy? Is that where\n             you're from?\n\nShe's standing behind him. Wearing the all too familiar\none piece swimsuit, she towels her wet hair.\n\n                          CREASY\n             Blue Bayou is a dream, Pinta.     Like you.\n\n                          PINTA GHOST\n             Dreams are beautiful, Creasy-Bear, but\n             life is better.\n\n                          CREASY\n                    (smiles)\n             Why are you here?\n\n                          PINTA GHOST\n             I have to watch you now.\n\nCLOSE ON CREASY\n\nThe words are a salve, a balm.     He turns, looks back over\nhis shoulder. He's all alone.\n\nINT.   SUV - NEAR RAMOS - MEXICO CITY - DAWN\n\nRayburn looks over his shoulder, sees Creasy walking down\nthe street. Clutching a teddy bear.\n\nCreasy gets in the car.    Rayburn drives.\n\n                          RAYBURN\n             You'll be Stateside by suppertime.\n\nNo answer.   Finally, as Rayburn lights a cigarette...\n\n                          CREASY\n             I'm going to need help, Ray.\n\nRayburn grinds out the cigarette he just lit, knows what\njust was asked. Creasy needs help unleashing a plague.\n\nWork in Progress 2/10/03                                        81.\n\n\n                         RAYBURN\n            Fuck. Look at you; you won't last a day\n            the shape you're in. Unless you stop\n            bleeding you should have your spleen\n            removed.\n\n                           CREASY\n            Yes or no?\n\n                         RAYBURN\n                   (after a beat)\n            I won't kill again. Hunt people. I gave\n            that up. Anything else? It's yours.\n\nCreasy reaches into a pocket, hands Rayburn a hand\nwritten list. Rayburn reads, his eyes widening.\n\n                         RAYBURN\n            Jesus, Creasy. You're talking war.\n\nINT. PUBLIC SWIMMING POOL - MEXICO CITY\n\nThe surface breaks as Creasy enters the water     wearing a\nred T-shirt to hide the bandages. He begins      a slow\nlaborious stroke.  A pale attempt at getting     back into\nshape. A ribbon of  maroon trails him through     the water.\n\nINT. GARAGE - SUBURBS MEXICO CITY - NIGHT *RETHINK\nLOCATION*\n\nFluorescents flicker on. A Fiat up on the hydraulic\nlift. A section of the garage is portioned off by heavy\nsteel sheeting with a padlocked door.\n\nOne of the two men unlocks it.      Creasy and Rayburn enter.\n\nPARTITION\n\nThree long steel tables.    Covered with weapons.\n\n                         RAYBURN\n            Candy store. Every town in Mexico has\n            one if you know what door to bang on.\n\nCreasy stops by the pistols.\n\n                         CREASY\n            I'll take the .45 and the Webley .32.\n\n                         RAYBURN\n            I know it's old fashioned, but it's\n            reliable. Like us.\n\nWork in Progress 2/10/03                                    82.\n\n\nNext he's looking at grenades.   He hefts two different\nchoices.\n\n                         CREASY\n            I need less than standard packing. Can\n            you knock up a case for fifteen of each?\n\nHe picks up a double barrel shotgun, checks the line of\nit. He flicks open the breach, snaps it shut.\n\n                         CREASY\n                   (indicating)\n            Cut the stock here. The barrel here.\n            Make sure you file it smooth.\n                   (looks around)\n            Rocket launchers?\n\n                         RAYBURN\n            Different door. Not far from here.\n\nJUMP CUTS of the following being loaded into a bag: .45\nColt, ammo, clips, bodyarmor (the kind you wear under\nyour clothing), nightvision scope, a couple of flash-bang\ngrenades, flex-cuffs, a silent 9mm Beretta, a small\nshotgun, pepper spray, and four cellphones.\n\n                                               CUT TO:\n\nOVER TELEPHONE RINGING\n\nEXT. REFORMA PRESS BUILDING\n\nRosanna picks up phone.\n\nEXT. PHONEBOOTH - REFORMA AVENUE\n\nCreasy holding the card Rosanna gave him.\n\n                         CREASY\n            Maybe I can help your situation and you\n            mine.\n\n                         ROSANNA\n            So where do we begin?\n\n                         CREASY\n            I need the name and address of the owner\n            of a Toyota Corolla, license number\n            ME31704...We didn't get the last digit so\n            I need the ten possible matches.\n\n                         ROSANNA\n            So what do I get in return?\n\nWork in Progress 2/10/03                                   83.\n\n\n                          CREASY\n             Let's see how the relationship develops.\n             I'll call you in the AM. Thanks.\n\nCreasy hangs up.\n\nINT.   AFI OPERATION CENTER - MEXICO CITY - DAY\n\nManzano, Rosanna, and technicians are listening to voice\nanalysis tapes of various kidnappers. They're\nstruggling. Rosanna hands the piece of paper with the\nlicense plate number to Manzano.\n\n                          MANZANO\n             He'll die of his wounds; bleed to death\n             before he can do anything.\n\n                          ROSANNA\n             He sounded strong to me.      Stronger than\n             we are.\n\nRosanna pauses.\n\n                          ROSANNA\n             Because he's outside. Because he's not\n             tied to the same system we are.\n\n                          MANZANO\n             We did voice analysis of the last five\n             high profile kidnappings, including the\n             little girl. The same man 'The Dreamer'.\n             Listen to this.\n\nManzano plays back a recording of the Kidnapper.\n\n                          VOICE\n             \"I used to run through the streets of\n             Neza because I was scared of being fucked\n             with. I swore one day I would cross the\n             street walking. Now I walk.\"\n\n                          ROSANNA\n             He's protected by La Hermanidad.\n\n                            MANZANO\n             I know this.    Your point?\n\n                          ROSANNA\n             Creasy is not a policeman. My sense is\n             he could be very valuable to us.\n\nRosanna waits for a response.    None.\n\nWork in Progress 2/10/03                                       84.\n\n\n                          ROSANNA\n             Then what do you have to lose?\n\n                          MANZANO\n             It's a moral issue. On one hand you're\n             cleaning up the bad guys, but in another\n             way we are feeding the problem that\n             produces bad guys.\n\nFinally deciding, Manzano turns, holds out his hand.      As\nRosanna hands him the paper with the partial license\nwritten on it.,\n\nEXT.   APARTMENT BUILDING - MEXICO CITY - DAY\n\nJORGE RAMIREZ, the 350 lb. driver who shot Creasy in the\nshoulder exits. Whistling to himself, gets behind the\nwheel of a Fiat 500.\n\nUnaware he's being shadowed by a man on a scooter.\nCreasy.\n\nEXT.   FIAT 500 - DAY\n\nAs it comes to a stop. Jorge gets out. We hear the\nscooter whine as Jorge crosses the street and enters a\nPUBLIC BUILDING.\n\nEXT.   PUBLIC BUILDING - DAY\n\nCreasy watches and waits.    Time lapse of the building\n\nJorge exits the building still trying to get the last\nbutton of his police uniform closed. He's a cop. He\nstruggles to get behind the wheel of the Fiat. The car\nis tiny.\n\nSomeone's getting in on the passenger side.\n\nAs Jorge starts to protest, Creasy rams a Sig into his\ngut. At the same time, he takes Jorge's gun from its\nholster.\n\n                            CREASY\n             Drive.\n\n                          JORGE\n                    (incredulous)\n             Do you know who I am?\n\n                          CREASY\n             You are Jorge Ramirez.\n\nCreasy jams him in the gut again.\n\nWork in Progress 2/10/03                                      85.\n\n\n                            CREASY\n             Drive.\n\nJorge starts the engine.    As he eases out into traffic.\n\nEXT.   CLIFFSIDE - MEXICAN CITY - DAY\n\nA car graveyard sitting on top of a 300 foot cliff\noverlooking a real tough barrio. Gravel crunches under\nthe Fiat's tires as it drives to the edge of a cliff.\n\n                            CREASY'S VOICE\n             Stop here.    Turn off the ignition.\n\nINT.   FIAT 500 - DAY\n\nJorge does as he's told. Suddenly the Sig comes down\nhard. WHACK! As Jorge's vision explodes...\n\nINT.   FIAT 500 - DAY\n\nStill in the driver's seat, Jorge wakes. The first thing\nhe sees is that his hands are taped to the steering wheel\nwith his pudgy white fingers exposed. He is naked,\nreminiscent of the 18 year old in the opening sequence.\n\n                          CREASY\n             Can you hear me?\n\nJorge nods, the pain in his head blinding.\n\n                          CREASY\n             I am going to ask questions. If you\n             don't answer, fully and truthfully, you\n             will suffer much more than you have to.\n\nCreasy opens Pinta's notebook to a blank page near the\nend. He clicks open a pen.\n\nCreasy presses in the car's cigarette lighter.\n\nThen he opens a buck knife.    Jorge winces at the sound of\nthe blade locking.\n\n                          CREASY (CONT'D)\n             I'm going to cut your fingers off.     One\n             by one. If I have to.\n\nThe cigarette lighter pops back out.\n\n                          CREASY\n             That's to cauterize the stubs.\n\nWork in Progress 2/10/03                                    86.\n\n\nHoly sweet Jesus... Sweat drips down Jorge's forehead.\nHe tries to master his fear. Swallows dry.\n\n                           JORGE\n              Do you know who I am?\n\n                             CREASY\n              Who are you?\n\n                           JORGE\n              I am the President of La Hermanidad.\n\nWithout warning Creasy reaches up with the buck knife, a\nflash of steel.\n\nThe big man howls, his left ear suddenly missing, starts\nan epic struggle, practically breaking the wheel off the\nsteering column. He is like a bucking Rhinoceros.\n\nHe howls as Creasy sprays his face with pepper spray.\n\nEXT.    FIAT 500 - DAY\n\nThe passenger side door opens and Creasy stumbles out.\nSome of the pepper spray has gotten in his face as well.\n\nCreasy wipes his tearing eyes. And then he turns.\nHefting the knife in his hand, he marches back toward the car.\n\n                             JORGE'S VOICE\n              No!   No!\n\nAnd then a terrible SCREAM. BLOOD squirts against the\ninside of the windshield. The car rocks on its shocks.\nAnd then another terrible SCREAM.\n\n                                                  CUT TO:\n\nJORGE\n\nStares at the stump of his right forefinger, smoke rising\nup off it. Creasy sticks the lighter back in its hole.\n\nAnd Creasy looking at him, devoid of emotion.\n\n                           JORGE\n              Wh- wh- what do you want to know?\n\nIt takes a moment for Creasy to come back.    He picks up\nthe pen and notebook.\n\n                           CREASY\n              The Ramos kidnapping.   How did it work?\n\nWork in Progress 2/10/03                                    87.\n\n\n                         JORGE\n            I don't know. We were just given\n            instructions to take her.\n\n                         CREASY\n            Ordered by who?\n\nJorge hesitates.   As Creasy sets the pen down...\n\n                            JORGE\n            I don't know.\n\nCreasy jerks back Jorge's middle finger, raises the\nknife.\n\n                         JORGE\n                   (a mile a minute)\n            I don't know! We work in parts. A    voice\n            calls in a kidnapping. We deliver   the\n            target to the guardians. We don't   even\n            know them. They might transfer to   other\n            guardians. The negotiators and the\n            bosses don't even see the target.   They\n            just make the deal!\n\n                         CREASY\n            Who ordered it?\n\n                         JORGE\n            The cops call him 'The Dreamer'.\n\n                         CREASY\n            Where do I find him?\n\n                         JORGE\n                   (shrugs; terrified)\n            I don't know. No one knows.\n\nCLOSE ON CREASY\n\nScream, as the knife comes down. Creasy tosses the finger\nout the window, wipes some of Jorge's blood off his\ncheek.\n\n                         JORGE\n            I don't know, I swear.\n\n                         CREASY\n                   (after a beat)\n            I believe you.\n\n                         JORGE\n                   (crying)\n            I'm professional. I just do my job.\n\nWork in Progress 2/10/03                                    88.\n\n\n                            CREASY\n             Me, too.    Tell me about the guardians.\n\n                          JORGE\n             He called me on the cell phone to set a\n             time and location for the switch.\n\n                            CREASY\n             Who's he?\n\n                          JORGE\n             The one who transferred Pinta to their\n             car.\n\nFLASHBACKS: See Pinta being manhandled from the white\nFiat to the trunk of Grand Marquis. She has been bound\nand taped around the mouth and eyes.\n\nCreasy looks like he'll kill him on the spot.     Muzzles\nhis Sig into the palm of Jorge's right hand.\n\n                            CREASY\n             Who's he?\n\n                          JORGE\n             I don't know, but I know his face.\n\nCreasy cocks the trigger.\n\n                          JORGE\n             I see him sometimes at the handball court\n             in Chapultepec on a Saturday afternoon.\n\n                          CREASY\n             How do I recognize him.\n\n                          JORGE\n             He has a tattoo covering two-thirds of\n             his back. He is part of the Brotherhood.\n\n                          CREASY\n             In the next hour, where do I find your\n             partner?\n\n                          JORGE\n             One-one-three Arco Iris.    Third floor.\n\nCreasy closes the notebook, caps the pen.    It's over.\n\nEXT.   CLIFFSIDE - MEXICAN CITY - DAY\n\nA gunshot echoes over the barrio. Creasy gets out of the\ncar, reaches back to release the emergency brake.\n\nWork in Progress 2/10/03                                     89.\n\n\nThe Fiat 500 goes over the cliff.\n\nEXT.   VIA ARCO IRIS - MEXICO CITY - DAY\n\nKids playing SOCCER. One of them kicks an errant pass.\nIt skips down the street toward an approaching Creasy.\n\nThe kids shout for him to kick the ball back, but he\nignores them. As the kids curse him out, Creasy enters 1-\n1-3...\n\nBOOM UP alongside the building. A man steps to a third\nfloor window... man two who stuffed Pinta into the car.\nHis name is Sandri. And we're inside.\n\nSANDRI (Italian Immigrant)\n\nPutting his cufflinks through his shirt sleeves. Wearing\na shoulder holster. A satisfied smile as he looks back\ninto the room. At the bed. A 17-year-old GIRL under the\nsheet.\n\n                           GIRL\n                    (nods)\n             When will I see you again?\n\nPulling  on his suit coat, Sandri steps to the door. He\nmimes a  pistol action with his forefinger and thumb. He\nopens it  to find himself staring square into the eyes of\nCreasy.   He rests the twin barrels of the sawed-off\nshotgun  square against Sandri's chest.\n\n                          CREASY\n             Her name was Pinta.\n\nSandri registers the name.   Creasy swings the shotgun\ndown to Sandri's groin.\n\nEXT.   VIA ARCO IRIS - MEXICO CITY\n\nBA-BOOM.   A flock of pigeons explode out of the Jacaranda\ntrees.\n\n                                               CUT TO:\n\nBLACKNESS SCREEN\n\n                          CREASY'S VOICE\n             Roman's Chapter 13:21. Do not be\n             overcome by evil, but overcome evil with\n             good. There is no authority except from\n             God.\n\nWork in Progress 2/10/03                                     90.\n\n\nEXT.   PUBLIC POOL - MEXICO CITY\n\nCreasy swimming toward the far wall. As he rolls, kicks\noff, it's Pinta who emerges from the bubbles swimming\nback the over way.\n\nPinta swims through the a maroon cloud filtering through\nthe water.\n\n                                              CUT TO:\n\nCU of Pinta's diary. Creasy opens it up. The bullet\nsits in the center crease. He thumbs through the pages\nstopping on different days. Pinta's V.O. Illustrating\nthose pages.\n\nEXT. CHAPULTEPEC PARK - DAY\n\nHandball court. Intense game with big money stakes. A\nsea of criminal faces cheer on the gladiators from the\nbleachers. It's a close match.\n\nA 200 pound Guardian removes his T-shirt before serving.\nTurns to reveal a huge tattoo across two-thirds of his\nback. Creasy registers his prey.\n\nEXT. BARRIO SUNSET\n\nA small Russian Taurus crests a hill and descends into\nHell. A frightening looking Barrio. Burnt out cars and\ndead dogs line the sidewalks. Creasy tails the Guardian\non his moped into the center of a trash dump. The focal\npoint being a semi-derelict church within a gated\ncompound. Our 'tattooed handball genius' exits the\nTaurus. Reaches in back for the groceries.\n\nINT.   GUARDIA DE SEGUIDAD - SUNSET\n\nA knock. GUARDIAN TWO steps over, carries a pistol.     He\nslides back a speakeasy slot to reveal our tattooed\nGuardian.\n\n                           GUARDIAN TWO\n             Hola!\n\nEXT.   DOOR - SUNSET\n\nGuardian One stands at the slot. Creasy is pressed up\nagainst the wall out of sight. He holds the shotgun\nwrapped in a ragged beach towel.\n\nAs the door unlocks and opens and Guardian One steps in,\nCreasy slides in right behind him.\n\nWork in Progress 2/10/03                                       91.\n\n\nINT.    GUARDIA DE SEGUIDAD - SUNSET\n\nAs the butt of the shotgun makes contact with Guardian\nTwo's mouth. Blood spouts as his front teeth are smashed\nin.\n\nAs he raises his hands to his face, the pistol he holds\ndischarges into the ceiling. Guardian One watches as\nCreasy clubs him again in the head.\n\nFrightened footsteps running on the other side of a\nplywood wall. A female voice yelling from the other\nroom. Creasy gauges their whereabouts.\n\nBOOM!    Creasy fires into the wall.    Wall explodes.\n\nGuardian Three freezes mid stride.      It's a tough looking\nwoman in her 40's.\n\nINT. GRUBBY KITCHEN ROOM - DAY\n\nThe three guardians stand facing the wall. Hands bound\nwith tape or cuffed. Naked (like our 18 year old) other\nthan their dirty skivvies.\n\nCreasy holds up a picture of Pinta.      An I.D. picture\ntaken from her schoolbook.\n\n                           CREASY\n              Tell me about the girl.\n\nAll three look...and with a strange defiant arrogance.\n\n                           GUARDIAN ONE\n              Who the fuck's that?\n\nBOOM! BOOM!    Creasy kills Guardian One.\n\nINTERCUT THE FOLLOWING:\n\nThe two Guardians each bound in two different rooms.\nBoth have their eyes taped shut. Creasy interrogates\nGuardian Two.\n\n                           CREASY\n              How does it work?\n\n                           GUARDIAN TWO\n              Everything on the cellphone. We wait for\n              calls. We have no number to call.\n\nCreasy picks a cell phone up off the table, hits redial.\nIt's a blocked line.\n\nWork in Progress 2/10/03                                 92.\n\n\n                             CREASY\n             Who pays you?\n\n                          GUARDIAN TWO\n             We have an ATM bank card. We draw out\n             300 dollars every two weeks.\n\nCreasy takes the ATM card from Guardian Two's shirt\npocket as he lies on the floor.\n\n                          CREASY\n             What's the PIN number?\n\n                             GUARDIAN TWO\n             The what?\n\n                          CREASY\n             The number you use at the bank machine.\n\n                          GUARDIAN TWO\n             Four-seven-four-seven.\n\n                          CREASY\n             Who killed her? You?\n\n                             GUARDIAN TWO\n             No!\n\n                          CREASY\n             Don't lie to me.\n\n                          GUARDIAN TWO\n             The boss did or his brother.\n\n                          CREASY\n             Who's the boss?\n\n                          GUARDIAN TWO\n             We don't know! We never see his face!\n             We have to wait in the other room. He\n             was screaming to the girl that...\n\nFLASHBACK:   Guardians POV.    Hearing the above.\n\n                          GUARDIAN TWO\n             ...his nephew was killed in the exchange.\n             And the money was stolen.\n\n                             CREASY\n             What money?\n\nWork in Progress 2/10/03                                       93.\n\n\n                           GUARDIAN TWO\n              The ransom money. At the drop. He said\n              Tazinari, one of the policemen had taken\n              it. He was crazy.\n\n                           CREASY\n              Who's Tazinari?\n\n                           GUARDIAN TWO\n              Head of the antikidnapping division.\n\nFLASHBACK: Guardians POV.     See the wall shake from a\nbodily impact..\n\nBOOM!    Creasy shoots Guardian Two.\n\nGUARDIAN THREE (Female)\n\nBecomes a panicked whirling dervish at the sound. A\nmoment later Creasy is there. Tearing the tape off her\neyes.\n\n                            CREASY\n              Show me.\n\nINT.    12' X 6' CELL - GUARDIA DE SEGUIDAD - NIGHT\n\nThe white tiled room we saw Pinta held in.    The door\nopens and Guardian Three leads Creasy in.\n\n                           FEMALE GUARDIAN\n              He was screaming about the money and his\n              dead nephew. He threw the little girl\n              against the wall.\n\nThe Female Guardian points. Creasy steps over.       There's\na smear of BLOOD against the wall.\n\n                           FEMALE GUARDIAN\n              She fell. She wasn't moving. They threw\n              her body in the trunk of the car and\n              drove away.\n\nFLASHBACK: Guardian's POV through window. We glimpse\nthrough a dirty window, Pinta's body being put into a car\ntrunk.\n\n                            CREASY\n              Who?   Who's they?\n\n                           FEMALE GUARDIAN\n              The boss's brother, I recognize his\n              voice. It's high pitched. We call him\n              Woody Woodpecker.\n\nWork in Progress 2/10/03                                          94.\n\n\n                            CREASY\n               Now listen to me. If you tell me where\n               to find the boss. I will let you live.\n\n                              FEMALE GUARDIAN\n               Please.    I don't know.\n\nAnd Creasy stands there a moment. Realizes she is\ntelling the truth. Lost. And the sound that snaps him\nout of it... A GIRL CRYING. And Creasy is suddenly\nmoving down...\n\nTHE HALLWAY\n\nAfter the sound.    He kicks open a door.       There!\n\nIn a 8' X 4' room.       A 12-year-old GIRL.    Bound and\nblindfolded.\n\nFLASHCUT:   We think it's Pinta for a heartbeat, but it's\nnot.\n\n                                                     CUT TO:\n\nEXT.   GUARDIA DE SEGUIDAD - NIGHT\n\nA window to the left explodes as the room is enveloped in\nflames. The front door opens, a weird sight. Creasy\nexits holding both the 12-year-old's hand and the Female\nGuardian who's bound and blindfolded in her underwear.\n\nThey walk straight at camera as flames shoot out of the\nroof. Creasy has set the place on fire. Creasy is on\nfire. And as they continue to walk towards us...\n\n                                                     CUT TO:\n\nBLACK SCREEN\n\n                            CREASY'S VOICE\n               Roman chapter 13:7. Therefore whoever\n               resists authority will bring judgement on\n               themselves. Now it is time to awake out\n               of sleep for our salvation is nearer than\n               we first believed.\n\nINT.   ROSANNA'S OFFICE - NEWSPAPER BUILDING - NIGHT\n\nA telephone ringing.       Rosanna at her desk.    She picks up\nthe phone.\n\n                            ROSANNA\n               Rosanna Guerrero.\n\nWork in Progress 2/10/03                                    95.\n\n\n                            CREASY'S VOICE\n             It's Creasy.\n\n                          ROSANNA\n             Where are you?\n\n                         CREASY'S VOICE\n             Los Arcos. Was a little girl kidnapped\n             recently? About twelve maybe?\n\n                            ROSANNA\n             Last night.    Do you know something?\n\n                          CREASY'S VOICE\n             What was her name?\n\n                           ROSANNA\n             Camila.   Camila Valencias.\n\nEXT.   ALLEYWAY - ACROSS FROM NEWSPAPER - NIGHT\n\nCreasy on the cellphone, the small Russian Taurus in the\nbackground. He stands outside the building still holding\nthe little girl's hand. She has the same lost look he\ndoes. Female Guardian in the back of car.\n\n                            CREASY\n             Camila.\n\nThe girl looks up at the name.\n\n                           CREASY\n                    (into phone)\n             I've got her.\n\nEXT.   ICE CREAM STAND - BUSY MEXICAN CITY STREET - NIGHT\n\nCreasy hands the girl an ice cream cone. He looks over\nas Rosanna hurries over from across the street.\n\nCreasy puts the little girl's hand into Rosanna's.\n\n                          CREASY\n             I need something. Do you have banking\n             connections?\n\n                          ROSANNA\n                    (hesitates, then...)\n             I have connections.\n\nCreasy hands her the ATM card.\n\nWork in Progress 2/10/03                                    96.\n\n\n                          CREASY\n             The PIN number is 4-7-4-7.    I need to\n             know whose account it is.\n\nRosanna notices the blood on Creasy's shirt.    Near his\nstomach.\n\n                          ROSANNA\n             Where do I find you?\n\n                          CREASY\n             I'll call you tomorrow.\n\nCreasy looks at the girl and starts off, then looks back.\n\n                          CREASY\n             What do you know about the cop?\n             Tazinari. The one who made the ransom\n             drop with Samuel Ramos?\n\n                          ROSANNA\n             He's an old fashioned patrone with the\n             worst reputation. He's high on my hit\n             list.\n\n                          CREASY\n             Where does he live?\n\n                          ROSANNA\n             He lives in a Judicial Compound. He\n             travels by motorcade. He has better\n             protection than George Bush. Even more\n             importantly he is part of La Hermanidad.\n             His reach is far and wide.\n\n                          CREASY\n             Give me the address.\n\nNOTE: THE FOLLOWING SCENE SHOULD PLAY AT THE BURNED OUT\nSAFEHOUSE WITH ROSANNA.\n\nINT.   MANZANO'S OFFICE - AFI HQ - NIGHT\n\nA beehive. Cops. Photos of dead kidnappers on the wall:\nJorge and Sandri. Sandri emasculated, one hand missing.\nJorge behind the wheel, fingers stubs and a missing ear.\n\n                          ADJUTANT\n             Two in one day. And they died very\n             badly. Sandri and Jorge were prime\n             suspects in twelve kidnappings in the\n             last six months.\n\nManzano studies the photo of Jorge.\n\nWork in Progress 2/10/03                                    97.\n\n\n                         MANZANO\n            Whoever did this was methodical,\n            unafraid. Was Jorge's mugshot in the\n            photos we showed Creasy?\n\n                         ADJUTANT\n            No, I checked. But right   after Sandri\n            was shot, a girlfriend of  his was found\n            naked, hysterical in the  street. She\n            said it was a man fitting  Creasy's\n            description who shot him.\n\n                         MANZANO\n            Mr. Creasy was, and maybe is again, a\n            very lethal human being.\n\n                         ADJUTANT\n            You don't seem very surprised?\n\nManzano looks at his Adjutant, pleased with his\nperception. But he isn't sharing.\n\n                         MANZANO\n            What's surprising these days?\n\nAn AFI agent brings over a plate of red shredded chicken.\nManzano takes a bite, moans in pleasure.\n\n                           MANZANO\n            Your sister?    Only a virgin cooks like\n            this.\n\n                         AGENT\n                   (laughs)\n            Your man's here. Interrogation room two.\n\n                                                CUT TO:\n\nSURVEILLANCE ROOM\n\nSeen through a two-way mirror.   Manzano watches as...\n\nRayburn sits at a steel chair, bolted to the floor.\nRayburn's eyes are closed. In meditation. Then, slowly,\nhis arms extend out to the sides. Manzano is curious as,\nslower still, Rayburn extends both hands out in front of\nhim, palms up. Must be a Zen thing.\n\nThen, both MIDDLE FINGERS are extended. With eyes still\nclosed, Rayburn mouths 'fuck you'. Manzano bursts a\nlaugh.\n\n                                                CUT TO:\n\nWork in Progress 2/10/03                                    98.\n\n\nINTERROGATION ROOM TWO\n\nRayburn opens his eyes, looks over as Manzano enters.\nStill eating, he hands Rayburn a second plate of chicken.\n\n                         MANZANO\n            Pollo Pibil. Chicken and chorizo\n            sausage. Hmmmh. They marinate it in\n            lemon and orange juice. It's a stew\n            really.\n\n                         RAYBURN\n                   (sets it down)\n            I already ate.\n\nManzano enjoys another bite, then...\n\n                         MANZANO\n            Tell me about your friend Creasy.\n\n                         RAYBURN\n            You just said it. He's my friend.\n            Nothing else to say.\n\n                         MANZANO\n            I read the file. You and Creasy have\n            seen quite a bit together.\n\n                         RAYBURN\n            Two tourists who never went home.\n\n                         MANZANO\n            You helped him get this job.\n\n                         RAYBURN\n            That's what friends do.\n\n                         MANZANO\n            Yes. But if I traced Creasy to you,\n            others will do it as well. Their\n            facilities are as good as my own, if not\n            better.\n\n                         RAYBURN\n            I can take care of myself.\n\n                         MANZANO\n            You and Creasy both. A two man army\n            according to Interpol. Panama. Lebanon\n            with the Druze. Desert Storm. Where you\n            were contracted by the U.S. Army to hunt\n            down elite Iraqi military commanders.\n                   (laughs)\n            You two were a married couple.\n\nWork in Progress 2/10/03                                    99.\n\n\n                          RAYBURN\n            The kind that gets divorced, but still\n            stay friends.\n\n                         MANZANO\n            What happened to him?   What happened to\n            Creasy?\n\nRayburn flinches at some bitter memory.\n\n                         RAYBURN\n            None of your business. Or mine for that\n            matter. I got nothing more to say.\n\n                         MANZANO\n            This is my jurisdiction. I want these\n            men as much as Creasy does.\n\n                         RAYBURN\n            He'll deliver more justice in a weekend,\n            than ten years of your courts and\n            tribunals. So stay out of his way.\n\n                         MANZANO\n            I plan to. I'll even help him if I can.\n            He's going to lead me to the 'The\n            Dreamer'. Someone I want very badly.\n            But I'd like to understand him. Give me\n            that.\n\n                         RAYBURN\n            Pinta Martin Ramos is just a number to\n            you. Tragic, a public outcry, but a\n            number. One more dead.\n\n                         MANZANO\n            What was she to Creasy then?\n\n                         RAYBURN\n            Light. At the end of a long, dark\n            tunnel. Somehow, she showed him it was\n            alright to live again.\n\n                         MANZANO\n            And they took that away.\n\n                         RAYBURN\n            A man can be an artist in anything.\n            Stone, paint, words. Food. Anything if\n            his soul is true to it. Creasy's art is\n            death. And he's about to paint his\n            masterpiece.\n\nThe words sink in.   Manzano understands their magnitude.\n\nWork in Progress 2/10/03                                   100.\n\n\n                          RAYBURN\n             Me? I got Jap businessmen to drive\n             across the border. So, if you'll do me a\n             favor and let me the fuck out of here...\n\nEXT.   MANZANO'S OFFICE - NIGHT\n\nFramed commendations fall to the carpet as Rosanna slams\nup against the wall of Manzano's office. Skirt up around\nher waist, Manzano moves inside of her. Between breaths:\n\n                          MANZANO\n             Is it true? Creasy saved the little girl\n             that was kidnapped yesterday.\n\n                          ROSANNA\n             And left three more dead men.\n\nShe bites the heel of his palm to keep from crying out.\n\n                          MANZANO\n             When you talked to him, did he look sane?\n\n                         ROSANNA\n             No. Not by the rules of polite society\n             at least.\n\n                          MANZANO\n             I think he's... magnificent.\n\nAs they both climax, pressed up hard against each\nother...\n\n                          MANZANO\n                    (smiles)\n             You only fuck me to get information.\n\n                          ROSANNA\n                    (smiles back)\n             You only give information so you can fuck\n             me.\n\n                          MANZANO\n             A beautiful circle.\n\nHe kisses her, turned on again already.\n\n                          ROSANNA\n             Let's put Creasy to press. There's a\n             vigilante cleaning up Mexico. An\n             unstoppable hero.\n\nAs Manzano considers this, likes it, Rosanna takes the\nATM card out from her bra.\n\nWork in Progress 2/10/03                                      101.\n\n\n                          ROSANNA\n             And as long as we're talking information,\n             there's something else as well.\n\n                          MANZANO\n                    (as he takes card)\n             I should start going for your tits first.\n\nEXT. SWIMMING POOL - MEXICO CITY - DAY\n\nUnderwater as Pinta swims. As she spins, kicks off the\nwall, it's Creasy who comes out the other side. A plume\nof red blossoming off his side.\n\nThis is done over and over, faster and faster, closer and\ncloser. The blood becomes darker, bigger. And we push\ninto that blood until it's finally obscuring everything.\n\nEXT.   NEWSSTAND - MEXICO CITY - EARLY MORNING\n\nA row of newspapers being set out.     Creasy's face on the\nfront page of every one of them.\n\nEXT.   NEIGHBORHOOD STREET - MORNING\n\nA quaint old Mexico neighborhood. We follow a long\ncanvas bag being carried through the streets. Carried by\nCreasy. Toward the end of the street and a ground floor\napartment. Walks past a canary yellow Coup deVille,\nwhich has seen better days.\n\nINT.   GROUND FLOOR APARTMENT - MORNING\n\nAn elderly couple eating lunch. The HUSBAND looks over\nat a knock on the door. He stands, answers it. Creasy\nslides in, eases the door shut behind him. Gun in hand.\n\n                          CREASY\n             I'm not here to hurt you. I need to\n             borrow your house and your car. Are you\n             the proud owners of the Coupe deVille?\n\nEXT.   JUDICIAL COMPOUND - MORNING\n\nA military operation as Tazinari is led out to his car.\nTwo heavy gray sedans wait. Tazinari gets in the back of\nthe second car with his AIDE-DE-CAMP. The door is shut\nbehind them.\n\nMERCEDES\n\nThe door closes with an hermetic whump. The two cars\npull away toward the opening FRONT GATES.\n\nWork in Progress 2/10/03                                    102.\n\n\nINT.   GROUND FLOOR APARTMENT - DAY\n\nCreasy has just finished taping the old couple to two\nchairs.\n\n                          CREASY\n             If you promise to speak softly and not to\n             shout, I won't have to tape your mouths.\n\nThe old man looks to his wife, then back to Creasy.\nNods.\n\nThe old man watches as Creasy opens he canvas bag, pulls\nout two metal tubes that he screws together. It's a\nROCKET LAUNCHER. Next he pulls out a cone-shaped\nmissile. The old man is starting to look curious.\n\n                          CREASY\n             Did you know you have a dishonest\n             policeman living in your neighborhood?\n\nCreasy depresses the fins on the missile and slides it\nback into the tube.\n\n                          OLD MAN\n             I know of you. You're the American. The\n             bodyguard who's killing the kidnapper.\n\nCreasy doesn't answer, steps into the center of the room.\n\n                          OLD MAN\n             In the church, they say to forgive.\n\n                          CREASY\n             Forgiveness is between them and God.\n             It's my job to arrange the meeting.\n\nCreasy looks back and forth between two shuttered windows\nand in a line to the wall with a household Catholic\nalter. Christ on the cross sits front and center.\n\n                          CREASY\n             Do you have an old blanket you don't care\n             about? I don't want to burn that wall.\n\nINT.   GROUND FLOOR APARTMENT - DAY\n\nA figure rises, framed in the window.\n\nAnd Pinta stands beside him.   As she puts her fingers in\nher ears...\n\nCreasy looks back over his shoulder, but of course she's\nnot there.\n\nWork in Progress 2/10/03                                      103.\n\n\nCreasy fires the rocket launcher. A gout of flame erupts\nfrom the back. But Creasy has hung a blanket on the\nwall.\n\nINT.   LEAD CAR - DAY\n\nEyes widening as the first rocket streaks toward them.\nThe driver stands on the brakes. The car explodes, is\nobliterated really, from the inside out.\n\nEXT. STREET - DAY\n\nTazinari's car slams into the debris of the lead car and\nslides sideways against a wall wedging it in. Real\ntight.\n\n                                               CUT TO:\n\nCREASY\n\nA 'Man On Fire' strides through the smoke and dust. A\nshotgun at his side and a Molotov cocktail in his left\nhand.\n\nWithout missing  a stride he unloads both barrels into the\ndrivers window.   A scary prospect even though it's bullet-\nproof. The lit   Molotov explodes beneath the car.\nSilence. Then a   dull impact explosion. 30 feet of\nflames envelope  the car. The driver and Tazinari both\nprisoners inside  their own car.\n\nThe driver exits releasing a full clip from his Uzi.\nCreasy nails him with a single shot to the head.\n\nTazinari exits through the flames hands high in the air.\n\n                                               CUT TO:\n\nEXT.   BRIDGE OF THE AZTECS UNDERPASS- MEXICO CITY - NIGHT\n\nThere sits the canary yellow Coupe deVille. Eyes and\nmouth taped shut, hands and ankles bound by flex-cuffs.\nTazinari stands there.\n\nCreasy steps up, pulls the tape off Tazinari's eyes.     He\nlooks about, relatively calm considering.\n\n                          CREASY\n             You know where you are?\n\nAs Tazinari tries to process...\n\nWork in Progress 2/10/03                                     104.\n\n\n                         CREASY\n            Under the bridge. Where the deal went\n            south. Now why don't you tell me what\n            went down?\n\nCreasy tears the tape off his mouth.\n\n                         TAZINARI\n            Do you know who I am? I am the\n            commandante of the Judicial anti-\n            kidnapping division.\n\n                         CREASY\n            And one of the founding members of La\n            Hermanidad.\n\n                           TAZINARI\n            Correct!\n\nCreasy pulls the buck knife from his pocket, flips  it\nopen. As Tazinari reacts, Creasy spins him round,   slits\nhis clothes up from ankle to neck. The cloth drops   away,\nsome hanging at Tazinari's wrists. Tazinari has a   sudden\nloss of attitude.\n\n                                                CUT TO:\n\nClose up: Tazinari hands being cuff flexed and tied to\nside view mirrors of the Coupe deVille.\n\nCut back to see Tazinari, naked other than his Calvin\nKlein skivvies, spread-eagled across the grill of the\ncar, butt forward (Reminiscent of 'the woods scene' in\nDELIVERANCE)\n\nCreasy rips down his Calvins. CU of Tazinari's face\nwinces with either pain or extreme discomfort.\n\n                         CREASY\n            That's not my dick. That's the barrel of\n            your own gun. Shoved up your own ass.\n\nAs Tazinari reacts...\n\n                         CREASY (CONT'D)\n            .44 Magnum. Now, how's your hearing?\n\nWe hear the CLICK of the trigger being cocked back.\n\n                         TAZINARI\n            Please, don't...\n\nWork in Progress 2/10/03                                  105.\n\n\n                         CREASY\n            It's all up to you, commandante.    Tell me\n            about you and 'The Dreamer'.\n\nCreasy puts a tape recorder on the hood and presses the\nrecord button.\n\n                         TAZINARI\n            I don't know him. I saw the opportunity\n            and got lucky.\n\n                           CREASY\n            Lucky how?\n\n                         TAZINARI\n            That he used policemen. That you killed\n            them, it made it a police matter. The\n            Ramos family couldn't refuse our\n            involvement.\n\n                           CREASY\n            And?\n\n                         TAZINARI\n            And I had my men ready.\n\n                         CREASY\n            You stole the drop.\n\nMORE FLASHES: As we see this happen. POV from opposite\nside of the bridge. POV from the drop car. See the\nmoney drop get ambushed by unknown faces. 'The nephew'\ngets shot. The kidnapper running the show sounds like\nWoody Woodpecker, high pitched squeaky voice.\n\n                         CREASY (CONT'D)\n            You done it before?\n\nTazinari doesn't answer.   Creasy gives the Magnum a\ntweak.\n\n                          TAZINARI\n            Yes.   Many times.\n\n                          CREASY\n            O.K.   So tell me more.\n\n                         TAZINARI\n            There was no ten million dollars.\n\n                         CREASY\n            The ransom was ten.\n\nWork in Progress 2/10/03                                    106.\n\n\n                          TAZINARI\n             Two and a half. That's how much there\n             was.\n\n                          CREASY\n             Don't lie to me!\n\n                          TAZINARI\n             Two and a half! The rest was paper!\n             Strips of paper!\n\nFLASHBACK:   Tazinari, in his office, sifting through the\npaper.\n\n                          CREASY\n             Maybe your men stole from you.\n\n                           TAZINARI\n             No. Whoever took the rest took it before\n             the exchange.\n\n                          CREASY\n             Who gave the bags to Ramos?\n\n                           TAZINARI\n             His lawyer.   Jordan Kalfus.\n\nFLASHBACK: Ramos House. Bags of cash being switched\nfrom the Mercedes with the flat tire to the 2nd Mercedes\nin the garage. See that Jordan does the switch, four\nbags on the floor.\n\n                                               CUT TO:\n\nAs Creasy thinks.   Tazinari has been stretched to his\nlimit.\n\n                          TAZINARI\n             That's all I know! Please. I'm sorry\n             for the girl. But it was business! I'm\n             a professional.\n\n                          CREASY\n             That's what everybody keeps saying.\n\nCreasy switches off the tape recorder and pockets it.\n\nRelief for Tazinari as the .44 Is withdrawn. Creasy\nwalks around the car Tazinari now looking like a naked\nhood ornament. Butt first.\n\nWork in Progress 2/10/03                                  107.\n\n\nEXT. FREEWAY EMERGENCY OFF RAMP - DAY\n\nAverage speed 80 m.p.h. This is Mexico. Creasy slips\nthe clutch, jumps out, and the Coup deVille kangaroos\nforward down the ramp. Gathering momentum into the\noncoming traffic. Tazinari screams right on impact.\n\nINT. FRANK LLOYD WRIGHT 'KNOCK OFF' - MEXICO CITY\n\nFlambouyant, beautiful 16-year-old boy with a black eye\nand bloody nose. Jordan's boyfriend. Terrified and in\ntears runs down the hallway. Creasy following.\n\n                                                CUT TO:\n\nINT. SWIMMING POOL - DAY\n\nA huge maroon cloud covers the center of the pool. In\nthe middle of the cloud is Jordan face down floating on\nthe surface dressed in his beige linen suit.\n\nUNDERWATER\n\nCLOSE UP of Jordan face down. We glimpse what we don't\nwant to see. Black holes where his eyes and mouth were.\nHis ears missing.\n\nCreasy not terribly impressed.   Just pissed that he's\nlate.\n\nCreasy on a cell phone talking to Rosanna\n\n                          CREASY\n             Another favor... get me banking info on\n             Jordan Kalfus. U.S. deposits or\n             withdrawals. Thanks. Oh, get me the\n             same on Samuel Ramos.\n\n                          ROSANNA\n             How do I contact you?   We still don't\n             have the ATM info.\n\n                           CREASY\n             You don't, I'll call you. Oh! I have a\n             tape recording that I am sure will\n             interest you.\n\nEXT. MUNICIPAL POOL - MEXICO CITY - DAY\n\nCreasy doing laps. He swims the last few meters\nunderwater. As he surfaces, Pinta waits by the edge.\nShe nods in grim satisfaction.\n\nWork in Progress 2/10/03                                  108.\n\n\nHe isn't doing well. The cloud of deep red emanating\nfrom his stomach envelopes his whole body.\n\nINT.   DINING ROOM - EVENING\n\nSamuel eats dinner silently. Lisa just stares into\nspace, nursing a vodka. Even great marriages cannot\nsurvive the trauma of kidnapping and subsequent death.\n\nThe door opens and they expect to see Maria with the\ndeserts. Creasy enters and sits at the table like a\ndinner guest.\n\n                          CREASY\n                    (to Samuel)\n             I'm going to talk to your wife. If you\n             move or say one word, I'll kill you.\n\nHe takes a Colt Officer model .45 semi-automatic pistol\nout of his waistband and lays it on the table in\npreparation for something, we don't know what. He turns\nto Lisa.\n\n                          CREASY\n             I'm going to tell you a story. Your\n             lawyer is dead. Someone didn't want him\n             talking. Last week he wired $2.5 million\n             into his U.S. bank account. Colonel\n             Ernesto Tazinari is also dead. He\n             hijacked the ransom drop, another $2.5\n             million. If my arithmetic is correct it\n             means $5 million remains.\n\nCreasy looks to Samuel.\n\n                          CREASY\n             Your husband magically had five million\n             deposited in a U.S. bank account last\n             Friday.\n\nLisa's eyes never leave Creasy's...trying to discern\nwhether this is true or not.\n\n                          CREASY\n             They planned it, Samuel and Kalfus.\n\n                             LISA\n             Planned what?\n\nWork in Progress 2/10/03                                     109.\n\n\n                         CREASY\n            An autosequestra. Kalfus arranged for\n            Pinta to be taken to a safehouse. I'm\n            sure he thought she'd sit there for three\n            days eating pizza and watching TV. It\n            didn't work out that way. Everything got\n            fucked up when I killed the cops and\n            Tazinari saw an opportunity.\n\nLisa screams.   Creasy gestures with a finger to his lips.\n\n                         CREASY\n            On the surface it was low risk and high\n            return. This was the third autosequestra\n            Jordan had organized for clients. The\n            other two succeeded.\n\nSamuel looks to Lisa.\n\n                          SAMUEL\n            Our lifestyle was in jeopardy. My pain\n            and weakness only fueled your anger and\n            determination. I wasn't sure about\n            whether to go through with it or not.\n            Then I woke up one day and it was done.\n                   (beat)\n            Jordan was supposed to take care of it.\n\nThrough all of the above, Creasy removes the special\nbullet held in the seam of his wallet. The misfire.     He\nempties the other cartridges from his gun.\n\nLisa suddenly attacks Samuel in a violent, emotional\noutburst of tears, screaming, and rage. Drawing blood\nfrom his nose and upper lip. Samuel smothers Lisa's arms\nbeneath his. He appears strong and decisive for the\nfirst time.\n\nCreasy very carefully takes the bullet, puts it into the\nmagazine and chambers the round. He looks into Samuel's\neyes.\n\n                         CREASY\n            A bullet does not lie. A bullet tells\n            the truth. And the truth will set you\n            free.\n\nCreasy hands Samuel the gun.\n\n                         CREASY\n            In many ways I think this bullet should\n            be shared between you and Lisa.\n\nWork in Progress 2/10/03                                    110.\n\n\nCreasy exits the room. Samuel kisses Lisa on the\nforehead and exits onto the terrace.\n\nA GUNSHOT.\n\nINT.   DINING ROOM - NIGHT\n\nLisa just sits.    Where will she find air to breathe?\n\nEXT.   MEXICO CITY - NIGHT\n\nLife moves on with its brutal inevitability.    This is a\nriver whose course cannot be altered.\n\n                          PINTA'S VOICE\n             From the backseat I can see   Creasy's eyes\n             in the mirror. He watches    and thinks.\n             He never smiles. I wish I    was back in\n             the front seat with him. I    wish he would\n             smile.\n\nCreasy looks up from the notebook and out at the city.\nAnd a smile comes. But it's bitter and hopeless.\n\nIt's half grief, half not knowing where to go next, what\nto do. And he's dying. He knows that too. Creasy dials\na number on a cell phone.\n\n                             CREASY\n             Hola...\n\n                             ROSANNA'S VOICE\n             Creasy.\n\n                                                 CUT TO:\n\nCLOSE ON ROSANNA\n\nInside somewhere.\n\n                          ROSANNA\n             I traced the PIN. I have an address for\n             you. But I need to see you.\n\n                          CREASY\n             I show, you give me the information?\n\n                             ROSANNA\n             Deal.\n\n                             CREASY\n             Where?\n\nWork in Progress 2/10/03                                    111.\n\n\nINT. AFI OPERATIONS CENTER - NIGHT\n\nBack on Rosanna. We see she's sitting in the AFI\nOperations Center amongst Technicians, surveillance and\nlistening devices, and Manzano.\n\nWe can hear the interior of a family house, kids, a\nfrustrated mother, a Mexican soap playing in the B.G.,\nover speakers.\n\n                         TECHNICIAN\n                   (to Manzano)\n            We got the whole place wiretapped. But\n            no males that sound anything like 'The\n            Dreamer'.\n\n                           MANZANO\n            He'll show.\n\nManzano is carrying a 8\" X 10\" digital blow up of a\nhandsome Mexican John Gotti type in some nightclub\nenvironment.\n\n                           ROSANNA\n            Who's that?\n\n                         MANZANO\n            He's the man, 'the Boss?' My guys got\n            into the house on the pretext of giving\n            cholera shots. We had to inject the\n            whole Barrio. We bugged the house and\n            stole the picture of him. Manzano looks\n            at Rosanna. Now's the time to really\n            pressure him. Lets publish his picture\n            in tomorrow's edition.\n\nRosanna understands the consequences makes light of them.\n\n                         ROSANNA\n            So how are going to recipricate?\n\nManzano discreetly slides his hands up her crotch.\n\n                                               CUT TO:\n\nEXT. ROSANNA APARTMENT - NIGHT\n\nHer car draws up. Her driver exits and opens her door.\nShe steps out. But waiting inside is a welcoming\ncommittee. A HOODED FIGURE wielding a shotgun who shoots\nthe driver in both knees.\n\nWork in Progress 2/10/03                                      112.\n\n\nHOODED FIGURE waves the shotgun under Rosanna's nose. A\nwarning. Then disappears into the darkness.\n\n                                                 CUT TO\n\nINT. ROSANNA'S APARTMENT\n\nRosanna in her apartment in the dark.     A tear trails her\ncheek.\n\nCU of the proofsheet of the next day's newspaper.     The\nBoss' picture, full frame.\n\nEXT.   RESTAURANT - MEXICO CITY - NIGHT\n\nCreasy moves in the shadows looking remarkably strong\nconsidering his wounds.\n\nCREASY - SURVEILLANCE POV\n\nCameras whirring. Video being shot.     He hasn't arrived\nalone. As he disappears inside...\n\nINT.   CLOSED RESTAURANT - NIGHT\n\nThe OWNER watches nervously as   Creasy approaches wearing\na wool CAP. A pale attempt at    disguising his identity.\nThere's a newspaper folded on   his dais, more photos of\nCreasy, his dead targets, the   story of his vendetta.\n\n                          CREASY\n             I'm looking for Rosanna Guerrero.\n\n                            OWNER\n             This way.\n\nEmpty restaurant, chairs  on tables. An    exterior\nstreetlight illuminates  the darkness.    The owner leads\nhim down a row of empty  booths. Creasy    slows, stops as\nhe sees the only person  waiting for him   is Manzano. As\nManzano smiles.\n\n                          MANZANO\n                    (holds up paper)\n             Hombre en fuego. Man On Fire. That's\n             what the papers have named you.\n\n                          CREASY\n             It's what you and Rosanna named me.\n             Right?\n\nWork in Progress 2/10/03                                  113.\n\n\n                         MANZANO\n            Sit, Creasy. Everything that happens\n            from now on does so with my permission.\n                   (smiles)\n            Really. You won't find a better carne\n            asada in all of Mexico.\n\nThe table is covered in an arrangement of the best food\nyou will ever find in Mexico. Creasy sits.\n\n                         MANZANO\n                   (laughs at himself)\n            The last few days may represent the best\n            police work of my life.\n\n                         CREASY\n            What do you want?\n\n                         MANZANO\n            The same thing as you. Except, my reach\n            isn't as long as yours. My father was a\n            policemen, did you know that?\n\n                         CREASY\n            I don't know shit about you.\n\n                         MANZANO\n            He was one of the original founders of\n            'Le Hermanidad' in the days when it\n            represented good not evil.\n\nManzano smiles; he likes Creasy.\n\n                         MANZANO\n            He was murdered. And now here I am.\n            Trying to honor his memory. Hamstrung by\n            bureaucracy and corruption. The\n            organization that he began now protects\n            criminals at the highest level where I\n            would need a Presidential finding in\n            order to expose it...or you.\n\nThe WAITER steps over; Manzano waves him off.\n\n                         MANZANO\n            My family lives in Miami.   Because of the\n            death threats.\n\n                         CREASY\n            It's not worth it. Be with them instead.\n\nWork in Progress 2/10/03                                   114.\n\n\n                         MANZANO\n            It galls me to watch you. You can do as\n            much in days as I can in years. Men like\n            the 'The Dreamer' are protected. Out of\n            everyone's grasp it seems, but yours.\n\n                         CREASY\n            Are you going to arrest me or talk me to\n            death?\n\nManzano laughs again.   Genuine.   Creasy cracks him up.\n\n                         MANZANO\n            My country needs justice. Proper\n            justice. Gunning men down in the street\n            only feeds the violence. They need to\n            be brought to trial. Dealt with\n            properly.\n            Then people will respect the law. When\n            they see it works.\n\n                         CREASY\n            So you are going to talk me to death.\n\n                         MANZANO\n            You walk out and deal justice. You're\n            what I wish I could be.\n                   (another laugh, then a beat)\n            The policemen who kills you, his family\n            will have all they want.\n\n                         CREASY\n            Then I hope the one who gets me has got\n            lots of kids. What do you want?\n\n                         MANZANO\n            I want to arrest you for murder! I want\n            to shake your hand and reload your gun!\n            I want to kill my pride and give you my\n            blessing.\n\n                         CREASY\n            My deal is with Rosanna. I knew you guys\n            were up to something. Are you two\n            fucking?\n\n                         MANZANO\n            No, but I have to admit I thought about\n            it.\n\n                        CREASY\n            Liar. Just tell me who the bank card\n            belongs to. Name and address.\n\nWork in Progress 2/10/03                                       115.\n\n\n                             MANZANO\n               You have no interest in making things\n               easy, do you?\n\n                            CREASY\n               I'm not... easy.\n\nManzano reaches into his pocket. He pulls out a folded\nPIECE OF PAPER and a PRESCRIPTION BOTTLE. He hands the\nbottle out first.\n\n                             MANZANO\n               Percodan.   I imagine you need handfuls by\n               now.\n\nCreasy makes no move to take it. Manzano sighs, sets it\ndown in front of him. Regarding the paper...\n\n                            MANZANO\n               Account belongs to a woman we think is\n               The Dreamer's girlfriend. Reina Rosas,\n               who is 8 months pregnant.\n\nCreasy holds his hand out.     Manzano hesitates.\n\n                            MANZANO\n               The plan is the girlfriend will lead you\n               to the Boss. You'll lead me, and I'll\n               arrest him. Agreed?\n\nCreasy doesn't respond. Finally Manzano gives him the\npaper, a mimeographed mugshot, and address scrawled on it.\nCreasy stands. As he scoops up the pills. Creasy starts\nout.\n\n                            MANZANO\n               Creasy...\n                      (Creasy turns)\n               I'd have liked to have known you under\n               different circumstances.\n\n                            CREASY\n               Off the top of my head, I don't know what\n               they could've been.\n\nAs Creasy departs...\n\n                                                    FADE TO BLACK.\n\nBLACK SCREEN\n\nWork in Progress 2/10/03                                    116.\n\n\n                            CREASY'S VOICE\n               Romans chapter 13:4 - therefore whoever\n               resists authority will bring judgment on\n               themselves. Now it is time to awake out\n               of sleep for our salvation is nearer than\n               we first believed.\n\nEXT. NEWSSTAND - DAY\n\nFull page photo of 'the boss' on the front page of\nREFORMA.\n\nEXT.   ROCK WALL HOUSE - MEXICO CITY - DAY\n\nA tiered house built into the rock face that runs through\nMexico City. A scooter is parked. A man sits on it\nwaiting, wearing a crash helmet to hide his now well\nknown features. Creasy.\n\nCREASY - VIDEO FEED\n\nIt's difficult to say where they are coming from. The\nview passes from one screen to another. As Creasy's\npasses, we hear the whispered crackle of radio\ncommunications.\n\nGROUND LEVEL\n\nCREASY sits up as a car pulls up, and a MAN gets out.\nCreasy checks the digital \"8x10\" even though this face is\nindelibly imprinted on his brain.\n\nIt's not \"The Dreamer.\"    Not as handsome, but there's a\nresemblance.\n\nThe MAN unlocks the front door, checks the street first\nand then enters.\n\nCreasy regroups mentally and physically. Checks the\nmagazine in his SIG SAUER. Chambers rounds into his\nshotgun. Looks up and sees a six-year-old on a bicycle\napproach the front door. A ten-year-old opens the door\nfrom inside. The six-year-old struggles to get his\nbicycle through the doorway.\n\nCreasy moves. He holds the shotgun against his leg as he\nstrides across the street. \"Man on Fire.\"\n\nThe bicycle makes it in.    And the door is closing...\n\nCreasy gets a foot in, forces his way inside.\n\n                                                 CUT TO:\n\nWork in Progress 2/10/03                                      117.\n\n\nMANZANO'S OFFICE - AFI HQ\n\nManzano listens to a radio over a desk speaker.\n\n                             VOICE\n              He's inside.    What should we do?\n\n                           MANZANO\n                     (keys mic)\n              Do nothing.\n\nINT.   HALLWAY - DAY\n\nThe pregnant woman, Reina Rosas, SCREAMING BLOODY MURDER\nas Creasy fills the space behind her. Creasy follows as\nshe runs.\n\nLIVING ROOM\n\nCreasy faces Reina, heavily pregnant. Silence. Two\nother kids hide behind her. Suddenly the wall next to\nCreasy explodes in a hail of bullets.\n\nWe realize Creasy caught one round in the chest. He's\ndown on one knee... uses the shotgun as a crutch. Reina\nis screaming.\n\nHear a door torn open. Creasy      moves to the sound.   A\nMAN has run out the back...\n\nEXT. HOUSE - BACK COURTYARD\n\nCreasy steps into courtyard, turns, a VW Bug coming right\nat him...\n\nAims his weapon.\n\nTHE MAN\n\nDucks down... windshield shatters from the blast of\nCreasy's shotgun... Bug slams into wall. The Man rolls\nout... using the door as a shield.\n\nBARRIO\n\nThe Man   flees into a labyrinth of packing-crate houses on\ncar-tire   foundations out into street. Running hard, too\nhard for   Creasy in his condition. He is losing a lot of\nblood.    He stops.\n\nCREASY\n\nBehind the wheel of the Volkswagon, roars out chasing.\n\nWork in Progress 2/10/03                                    118.\n\n\nNow through the maze of poverty... Creasy drives hard...\nno sign of the Man... empty eyes of poverty looking\nback... mostly women and children... They clearly see\nCreasy... fully exposed... driving a car with no\nwindshield... He slams the car into reverse.\n\nSomeone says \"Creasy\" aloud... now more faces to turn...\nchildren looking directly through his absent windshield.\n\nOne skinny kid runs ahead of Creasy. The boy points at\none cardboard house propped up against a brick and stucco\nwall.\n\nINT. VOLKSWAGON\n\nCreasy pops the clutch... straight into a small house...\ntaking whole walls of cardboard... to the back brick\nwall... The 'Man' is pinned violently between the car and\nthe wall.\n\n                                               CUT TO:\n\nBARRIO\n\nCreasy, shotgun in one hand, the injured Man in the\nother... walks through the barrio... a small crowd is\nyelling, \"Creasy, MAN ON FIRE\" (in Spanish: Hombre en\nFuego).\n\nINT.   LIVING ROOM - REINA ROSAS HOUSE - DAY\n\nThe Man badly broken and bleeding lies on the floor, flex-\ncuffed. Reina screams at Creasy. Creasy's popping\nPercodan's. The hysteria is peaking. Creasy chambers a\nround and shoots man through left knee. Screams then\nsilence.\n\n                            CREASY\n             Reina Rosas.\n\n                            REINA\n             Si.\n\n                          CREASY\n             How do you contact 'the Boss'?\n\nReina hesitates.\n\nCreasy chambers another round and holds the gun to man's\nright knee.\n\n                          REINA\n             We page him and he calls back on this\n             cell phone.\n\nWork in Progress 2/10/03                                     119.\n\n\n                         CREASY\n            What is his name?\n\n                            REINA\n            Daniel.\n\n                            CREASY\n            Daniel what?\n\nHe pulls the hammer back.\n\n                         REINA\n            Daniel Rosas Sanchez.\n\n                         CREASY\n            So you're married to him? And this looks\n            remarkably like his brother.\n\nCreasy looks to man semiconscious on the floor.   She nods\n\n                         CREASY\n            What is his name?\n\n                         REINA\n            Aurillio Rosas Sanchez.\n\nINT. AFI SURVEILLANCE TRAILER\n\nTechnician listens into the living room conversation and\nspeaks to Manzano over the radio.\n\n                         TECHNICIAN\n            What do we do?\n\n                         MANZANO (V.O.)\n            Do nothing. Prepare yourself for an\n            incoming call.\n\nAFI GROUP\n\ncongregating around maps, and a \"Triggerfish,\" a means of\ntracing the location of a cell phone.\n\nINT. LIVING ROOM\n\nCell phone ringing.   Creasy pauses -- picks up the cell.\n\n                         CREASY\n            Hello Daniel. I've got your family and I\n            want to negotiate.\n\n                            DANIEL\n            Mr. Creasy.     What do you want?\n\nWork in Progress 2/10/03                                       120.\n\n\n                            CREASY\n              I want you.\n\nSeveral beats of silence.    We can hear Daniel's\nbreathing.\n\n                           DANIEL\n              How much do you want?\n\n                           CREASY\n              It's non-negotiable.\n\n                           DANIEL\n              Two million U.S.... Three million U.S.?\n\n                           CREASY\n              I told you, non-negotiable.\n\nDaniel hangs up.\n\n                                                CUT TO:\n\nAFI TRAILER\n\nMANZANO listening.\n\n                            MANZANO\n              Damn.\n\n                                                CUT TO:\n\nLIVING ROOM\n\nCell phone ringing.\n\n                            CREASY\n              Yeah.\n\nDaniel has a different attitude, a lot more amenable.     He\ntries to speak to Creasy very logically about a very\nillogical subject.\n\n                           DANIEL\n              The most important thing in life is\n              family. And there you are. You have my\n              family. What do you want?\n\n                            CREASY\n              I want you.\n\n                           DANIEL\n              This is not possible. But in that house\n              I have money. If I tell you where --\n\nWork in Progress 2/10/03                                       121.\n\n\n                         CREASY\n                   (interrupts)\n            Your brother wants to talk to you.\n\nHolding the shotgun with his right hand, Creasy holds the\nphone to Aurillio's ear.\n\n                            AURILLIO\n            Daniel?\n\nBOOM! Creasy shoots Aurillio in his right kneecap.      As\nAurillio HOWLS in agony...\n\n                         CREASY\n            Listen to me. Listen! I'm going to take\n            your family apart piece by piece.\n\nThe line goes dead.    Hang up.   Creasy's ready to explode.\n\n                         REINA\n            Under the sink. We have money under the\n            sink. Six million dollars. It's wet but\n            good.\n\nThe phone begins to ring again.      Creasy answers.\n\n                            CREASY\n            Yeah.\n                      (silence)\n            Yes.\n\n                           DANIEL\n            Listen!    I will give you a life for a\n            life.\n\n                         CREASY\n            What do you mean?\n\n                         DANIEL\n            Her life for your life.\n\nCreasy's confused.\n\n                            CREASY\n            Whose life?\n\nCreasy's confused.\n\n                           DANIEL\n            The girl's.    Pinta's.\n\n                         CREASY\n            You're a liar. Pinta's dead.\n\nWork in Progress 2/10/03                                          122.\n\n\n                            DANIEL\n               I'm a businessman. A dead girl is worth\n               nothing. She is alive.\n\nA long beat.\n\n                            CREASY\n               I want proof of life.     What did she call\n               her bear?\n\nDANIEL hangs up.\n\nINT. LIVING ROOM\n\nAurillio moans on the floor. Reina says the rosary. The\nkids cry. The phone rings. Creasy listens, not capable\nof speaking.\n\n                             DANIEL\n               Creasy.   She calls the bear 'Creasy\n               Bear.'\n\nTime stands still for Creasy.        Words evaporate.    Liquid\nfilm in Creasy's eyes.\n\nCLOSE UP of Creasy's shocked face. He pulls down his\nshirt collar. Bubbles of blood form and reform over his\nchest wound as the maroon spreads across his chest and\nstomach.\n\n                                CREASY\n               Okay.   Where?\n\nAFI SURVEILLANCE VAN\n\nVans on the move.      Team Leader, radios.\n\n                            TEAM LEADER\n               We received enough of a signal to at\n               least put him in the Zona Colonia. Shit\n               not enough time. He hung up.\n\nINT. VW BUS\n\nCreasy driving. Great AC without the front windshield.\nKeeps him awake. Daniel Sanchez V.O. detailing the drop.\nCreasy trying desperately to drive and write down the\naddress.\n\n                            CREASY\n               Lisa, don't hang up on me.     Pinta is\n               alive.\n\nINTERCUT WITH:\n\nWork in Progress 2/10/03                                    123.\n\n\nINT. LISA'S BEDROOM\n\nBlinds are drawn. Slivers of light illuminate her\nemotionally drained face.\n\n                         LISA\n                   (silence)\n            I don't believe you.\n\n                         CREASY\n            I want you to get into your car now and\n            meet me on the south end of the\n            footbridge between Reforma and the\n            freeway junction. In 45 minutes.\n\n                            LISA\n            You're lying.     I don't believe you.\n\n                         CREASY\n            Then don't come.\n\nHe disconnects.   He cannot waste his ebbing strength.\n\nEXT. BRIDGE OF THE AZTECS - SUNSET\n\nDarkness has fallen. Few people are on the street as\nCreasy pulls to the south end of the bridge. He parks...\nlooks around... it's deserted. She's not coming. Checks\nhis watch, turns and walks toward the bridge. The Ramos\nMercedes drives up the bridge. Headlights off. Lisa is\ndriving. She exits the car.\n\nShe runs to catch Creasy.\n\n                         LISA\n            Creasy... Wait.\n\n                         CREASY\n            Stay here. If you do something stupid,\n            we won't get her back.\n\nHe climbs the steps of the bridge trying to maintain his\ndignity through the pain. He can see cars parked on the\nother side.\n\nOTHER SIDE OF THE BRIDGE - Creasy's POV\n\nCreasy's dreamlike POV (Is it real or a dream) A\ndriver exits a shadowed car and opens the passenger door.\nA SMALL FIGURE in a hooded sweat shirt and sweat pants\nexits the car. Confused. Disoriented.\n\nCREST OF THE BRIDGE\n\nWork in Progress 2/10/03                                     124.\n\n\nCreasy waits. Breathing labored breaths. He sees it all.\n\nOTHER SIDE OF THE BRIDGE\n\nThe driver unties little hands. Removes a blindfold from\nunder the hood. He steps away. Offering no help.\n\nThe small figure is confused.\n\nCREST OF THE BRIDGE\n\nCreasy calls out:\n\n                             CREASY\n               Pinta.   Pinta.\n\nShe turns and looks. It looks remarkably like her even\nunder the hooded sweatshirt. She begins to run. Across\nthe street, up the steps toward Creasy. A screaming\ntrain flashes beneath. Car headlights illuminate the\nbridge.\n\nTime stands still and the 'city sounds' fade out to\nnothing.\n\nShe runs up the remaining stairs and sprints across the\nbridge. Her hood blows off revealing her full face.\nIt's definitely Pinta. Camera ramps as he jumps into\nCreasy's arms. This is not the little girl we\nexperienced in the beginning of the movie. The\nexperience she just endured has been life changing. All\nof a sudden we have a 40 year old head on an 8 year old\nbody.\n\nShe wraps herself around him. He picks her up.     We\nglimpse a simple tear on his cheek. They talk.     But we\ndo not hear the words.\n\nShe notices her mom on the far side of the bridge.\nCreasy maneuvers her toward Lisa.\n\nBefore she goes to her mother we hear:\n\n                            PINTA\n               I love you, Creasy... And you love me,\n               right?\n\nCreasy nods.    The inference is that he will see her in a\nfew minutes.\n\nWe start to hear Linda Ronstadt painfully, quietly on the\nwind singing \"Blue Bayou.\" He continues to walk across\nto the opposite side of the bridge and gets into the\nkidnappers' car.\n\nWork in Progress 2/10/03                                          125.\n\n\nThere's a certain sort of calm of him.\nHe closes the door, he lays his head against the back\nwindow. He looks out at PINTA at the other side of the\nbridge, where she's screams for Creasy. \"Blue Bayou\"\ngets LOUDER. Pinta now knows it was a lie. Creasy is\nnot coming back. We're shooting through the glass of the\nback window. We se Mexico City reflected in the glass.\nAs the car pulls out, time slows, and we see Creasy lay\nhis head back and close his eyes as the car descends down\ninto a dark tunnel.\n\nPinta can see Creasy's face, eyes slowly closing. He can\nhear her screams before being enveloped by the night. As\n\"Blue Bayou\" continues...\n\nEXT.    MEXICO CITY STREETS - DAY\n\nDark spot in the road. Suddenly Police lights, on the\nroofs of four cars, flash simultaneously in front, in\nblocking position. The driver turns and looks back\nwanting to escape. He has a blacked out AFI armored van\nright on his rear bumper. Nowhere to go.\n\nSWAT at his door.    He's pulled and proned out onto the\nroad.\n\nManzano enters the driver's seat.       Reaching back to\nCreasy. Grabs his hand.\n\n                           MANZANO\n              I'm your chauffeur now, Creasy.\n\nManzano does a U-turn.    Heading away.     On his portable\nradio.\n\n                          MANZANO\n              All units. Commence the operation.\n              Repeat. Commence.\n\nHe reaches back again.\n\n                            MANZANO\n              Creasy?   Creasy?\n\nCLOSE UP - Two hands clasp.\n\nCreasy's left with Manzano's right. A strong grip.         Then\nno response. Manzano pulls to the curb.\n\nManzano reaches Creasy's wrist.       Takes his pulse.\nCreasy's gone.\n\nBeat.\n\nWork in Progress 2/10/03                                     126.\n\n\nManzano kneels.   Still holding Creasy.   Unfolds Creasy's\nfingers.\n\nCLOSE UP - Pinta's medallion of St. Jude clutched in his\nhand.\n\nManzano punches the seat again again and again.\n\n                           MANZANO\n            Goddamn you.\n\nEXT. GUARDIAN'S CAR - HIGH ANGLE U-TURN\n\nManzano looks at Creasy and makes a decision.\n\n                         MANZANO\n                   (keys mic)\n            Hold at the perimeter.   Until I enter.\n\nEXT. DANIEL'S COMPOUND\n\nDark, suburban Cuernavaca street. Creasy's car rounds\nthe corner. Security outside the compound motions to\nopen the garage doors. The driver of the car is\nfaceless. Street light reflections across the\nwindshield.\n\nThe car enters the gates. A collection of armed bodies\nappear in the courtyard curious to see this national\nhero. \"Hombre en Fuego.\"\n\nThe car stops. Nothing. This beat seems interminable.\nA hand opens the rear door: His forehead explodes. The\ndriver door opens barely two shots, two more bodies drop.\n\nPanic and confusion. Everybody runs for cover. An\noverhead helicopter illuminates the mayhem in the\ncourtyard. An armored vehicle rams through the gates.\n\nManzano explodes out of the driver's door in slow motion.\nHe is clearly on a mission. He strides through the\nmayhem, Creasy's Sig Sauer in one hand, and a .45 auto in\nthe other.\n\nManzano's guide to his destination is the 'The Dreamer's'\nlittle Jack Russell running back to his master on\ninstinct.\n\nManzano moves purposefully. His surrounding environment\nis Chaplinesque in its chaos. He enters a long walkway\nto a patio, following the dog. Daniel Sanchez appears at\nthe end of the hall. We ramp him into slow motion. The\nMexican version of Gotti. He raises his arms, prepared\nfor the inevitable. The outcome is a given.\n\nWork in Progress 2/10/03                                  127.\n\n\nManzano unloads a magazine into him and we -\n\nFREEZE FRAME\n\nSUPER TITLE:    \"HOMBRE EN FUEGO\"\n\nBLACKNESS.\n\n                            CREASY'S VOICE\n               Ezekiel 25:17. Blessed is he  who in the\n               name of charity and good will shepherds\n               the weak through the valley of darkness\n               for he is truly his brother's keeper and\n               the finder of lost children.\n\n\n\n\n\nMan On Fire\nWriters :   Brian Helgeland\nGenres :   Action  Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In 2003, burnt-out ex-CIA officer and former U.S. Marine Corps Force Reconnaissance officer John Creasy (Denzel Washington) looks for work and reunites with old friend and comrade Paul Rayburn (Christopher Walken), who runs a security firm in Mexico. Because of the extremely high rate of kidnappings in Mexico City for ransom money, businessman Samuel Ramos (Marc Anthony) hires Creasy through Rayburn to guard his nine-year-old daughter \"Pita\" (Dakota Fanning), intending to keep him on for only a short period in order to renew his kidnap and ransom insurance on Pita. Creasy suffers from alcoholism, depression and severe guilt as a result of his past work as a counterinsurgency fighter and assassin, and so works for Samuel at a rate far below what his experience would command. At first Creasy distances himself socially from Pita, but the two soon develop a friendship, which allows Creasy to overcome his demons and to act as a mentor and surrogate father-figure to the girl.\nAfter a piano lesson, Pita is abducted in public. Creasy kills four of the kidnappers including two corrupt policemen, but he is shot multiple times and collapses. Creasy is hospitalized but is moved to a veterinarian hospital by Miguel Manzano (Giancarlo Giannini), an agent of the Agencia Federal de Investigación (AFI), who suspects Creasy is an assassination target by rogue police. Meanwhile, the Ramoses agree to deliver a dead drop ransom of US$10 million per the instructions of \"La Voz\" (\"The Voice\") (Roberto Sosa), the mastermind behind the kidnapping ring. Samuel's attorney, Jordan Kalfus (Mickey Rourke), arranges for the ransom money to be collected from Samuel's kidnapping insurance policy, then arranges for it to be delivered to the kidnappers. The drop, however, is ambushed by members of \"La Hermandad\", a Mexican crime syndicate composed of corrupt police officers, leading to several of the ring members killed and the money being stolen. The Voice notifies the Ramos' that Pita will be killed in retribution.\nCreasy leaves the hospital before fully recovering from his wounds and vows to Pita's mother Lisa (Radha Mitchell) that he will kill everyone involved in Pita's abduction. Rayburn supplies Creasy with firearms and explosives, while Mariana Guerrero (Rachel Ticotin), a journalist investigating the kidnappings, and Manzano, offer their support. Creasy tortures and murders several targets by cutting off their fingers and stopping the bleeding with a car cigarette lighter for their information and eventually learns from the \"La Hermandad\" general that the bags they stole at the ransom drop contained only $2.5 million actual currency while the rest was blank paper.\nInvestigating further, Creasy finds Kalfus dead and evidence of Samuel's desperate financial situation. He confronts Samuel and Lisa for the truth behind the kidnapping. Samuel confesses to Creasy and Lisa that he agreed to Kalfus' plan to stage Pita's kidnapping, so he could pay off business debts by fraudulently collecting the insurance money. He planned to keep $5 million for himself and split the rest between Kalfus and the kidnappers. He also confesses to killing Kalfus who lied that Pita would be safely returned after the ransom was paid. Creasy leaves a 9MM pistol and one misfired round, he saved from his own previously attempted suicide, for Samuel, who commits suicide.\nUsing the information provided by Creasy, The Voice's identity is revealed to be Daniel Sánchez, who Mariana exposes in the newspapers. Creasy shows up at Sánchez's ex-wife's house and is shot by his brother Aurelio (Gero Camilo), who then tries unsuccessfully to escape. Creasy calls Daniel Sánchez and threatens to kill his family, but Sánchez reveals that Pita is still alive and offers to free her in exchange for Aurelio and if Creasy surrenders himself. Creasy agrees and informs Lisa to meet him at the exchange site. He and Pita share a tearful goodbye before he surrenders himself and is driven away by the kidnappers. Creasy dies peacefully en route from his gunshot injuries. Daniel Sánchez is later killed by Manzano during an AFI arrest."}