{"title": "Mary Poppins", "full_text": "***** MARY POPPINS *****\n\n\n\nBert:\n\nAll right, ladies and gents,\n\nComical poems suitable for the occasion, extemporized and thought up before your very eyes.\nAll right, here we go.\n\n\tRoom here for everyone gather around\n\n\tThe constable's \"responstable.\" Now, how does that sound?\n\n\tHello, Miss Lark I got one for you.\n\n\tMiss Lark likes to walk in the park with Andrew.\n\nHello, Andrew.\n\n\tAh, Mrs. Cory a story for you.\n\n\tYour daughters were shorter than you, but they grew.\n\n\tDear Miss Persimmon--\n\n\nMiss Persimmon:\n\nYes?\n\n\nBert:\n\n\tWind's in the east, mist comin' in.\n\n\tLike something is brewin' about to begin\n\n\tCan't put me finger on what lies in store\n\n\tBut I feel what's to happen, all happened before.\n\nI'm sorry. Where was I? Thank you, one and all, for your kind support. Ah, Miss Lark, thank you.\nCrikey. Bless you, guv. Generosity itself, that's what you are. No charge.\n\nOh, it's you! Hello. Number 17 Cherry Tree Lane, you say? All right. Come along with me. This\nhere's Cherry Tree Lane. Nice little spot, you might say. Number 17's just down a bit. Now, this\nimposing edifice what first greets the eye, is the home of Admiral Boom, late of His Majesty's\nNavy. Likes his house shipshape, he does, shipshape and Bristol fashion at all times.\n\n\nAdmiral Boom:\n\nTime gun ready?\n\n\nMr Binnacle:\n\nReady and charged, sir.\n\n\nAdmiral Boom:\n\nThree minutes and six seconds.\n\n\nMr Binnacle:\n\nAye, aye, sir.\n\n\nBert:\n\nWhat he's famous for is punctuality. The whole world takes its time from Greenwich. But\nGreenwich, they say, takes its time from Admiral Boom. What cheer, admiral?\n\n\nAdmiral Boom:\n\nGood afternoon to you, young man. Where are you bound?\n\n\nBert:\n\nNumber 17. Got some parties here in tow what wants to see it.\n\n\nAdmiral Boom:\n\nEnter that in the log.\n\n\nMr Binnacle:\n\nAye, aye, sir.\n\n\nAdmiral Boom:\n\nA word of advice, young man: storm signals are up at number 17. Bit of heavy weather brewing\nthere.\n\n\nBert:\n\nThank you, sir. Keep an eye skinned. Here we are. Number 17 Cherry Tree Lane. Residence\nof George Banks, Esquire. Hello, hello, hello. The admiral's right. Heavy weather brewin' at\nnumber 17, and no mistake.\n\n\nMrs. Brill:\n\nLeave her alone!\n\n\nEllen:\n\nShut up!\n\n\nMrs. Brill:\n\nI'll show you. Don't you be trying to stop the wretched creature! Let her go, that's what I say, and\ngood riddance! I never liked her from the moment she set foot in the door.\n\n\nEllen:\n\nBut who gets stuck with the children with no nanny in the house? Me, that's who!\n\n\nMrs. Brill:\n\nHer and her high and mighty ways! And that face of her that would stop a coal barge, it would.\n\n\nKatie Nanna:\n\nIndeed, Mrs. Brill! I wouldn't stay in this house another minute, not if you heap me with all the\njewels in Christendom.\n\n\nEllen:\n\nNo, no, Katie Nanna, don't go!\n\n\nKatie Nanna:\n\nStand away from that door, my girl!\n\n\nEllen:\n\nBut what am I gonna tell the master about the children?\n\n\nKatie Nanna:\n\nIt's no concern of mine. Those little beasts have run away from me for the last time.\n\n\nEllen:\n\nThey must be somewhere. Did you look around the zoo in the park? You know how Jane and\nMichael is. Coo! You don't think the lion could've got at them, do ya? You know how fond they\nwas of hangin' around the cage.\n\n\nKatie Nanna:\n\nI said my say, and that's all I'll say. I've done with this house forever.\n\n\nMrs. Brill:\n\nWell, hip, hip, hooray! And don't stumble on the way out, dearie.\n\n\nEllen:\n\nNow, now, Katie Nanna!\n\nMrs. Banks! She's home!\n\n\nMrs. Banks:\n\n\tOur daughter's daughters will adore us\n\n\tAnd we'll sing in grateful chorus\n\n\t\"Well done, Sister Suffragette\"\n\nGood evening, Katie Nanna, Ellen. We had the most glorious meeting! Mrs. Whitbourne-Allen\nchained herself to the wheel of the prime minister's carriage. You should've been there.\n\n\nKatie Nanna:\n\nMrs. Banks, I would like a word with you.\n\n\nMrs. Banks:\n\nAnd Mrs. Ainslie, she was carried off to prison, singing and scattering pamphlets all the way!\n\n\nKatie Nanna:\n\nI'm glad you're home, madam. I've always given the best that's in me.\n\n\nMrs. Banks:\n\nOn, thank you, Katie Nanna. I always knew you were one of us.\n\n\tWe're clearly soldiers in petticoats\n\n\tAnd dauntless crusaders for women's votes\n\n\tThough we adore men individually\n\n\tWe agree that as a group they're rather stupid\n\n\nKatie nanna:\n\nMrs. Banks.\n\n\nMrs. Banks:\n\n\tCast off the shackles of yesterday\n\n\tShoulder to shoulder into the fray\n\n\tOur daughter's daughters will adore us\n\n\tAnd they'll sing in grateful chorus\n\n\t\"Well done, Sister Suffragette\"\n\n\nKatie Nanna:\n\nBeing that as it may, I do not wish to offend, but I--\n\n\nMrs. Banks:\n\n\tFrom Kensington to Billingsgate\n\n\tOne hears the restless cries\n\n\tFrom every corner of the land: womankind arise\n\n\tPolitical equality and equal rights with men\n\n\tTake heart for Mrs. Pankhurst has been clapped in irons again\n\n\tNo more the meek and mild subservients we\n\n\tWe're fighting for our rights, militantly - never you fear\n\n\nKatie Nanna:\n\nIf I may have a word, Mrs. Banks.\n\n\nMrs. Banks:\n\n\tSo cast off the shackles of yesterday\n\n\t\n\nKatie Nanna:\n\nMrs. Banks!\n\n\nMrs. Banks:\n\n\tAnd shoulder to shoulder into the fray\n\n\tOur daughter's daughters will adore us\n\n\tAnd they'll sing in grateful chorus - \"well done\"\n\n\nKatie Nanna:\n\nMrs. Banks.\n\n\nMrs. Banks:\n\n\t\"Well done\"\n\n\nKatie Nanna:\n\nMrs. Banks.\n\n\nMrs. Banks:\n\n\t\"Well done, Sister Suf--\"\n\n\nKatie Nanna:\n\nMrs. Banks!\n\n\nMrs. Banks:\n\nWhat is it, Katie Nanna?\n\n\nKatie Nanna:\n\nMrs. Banks, I have something to say to you.\n\n\nMrs. Banks:\n\nWhere are the children?\n\n\nKatie Nanna:\n\nThe children, madam, to be precise, are not here. They've disappeared again.\n\n\nMrs. Banks:\n\nKatie Nanna, this is really too careless of you. Doesn't it make the third time this week?\n\n\nKatie Nanna:\n\nThe fourth, madam. And I for one have had my fill of it. I'm not one to speak ill of the children,\nbut--\n\n\nMrs. Banks:\n\nOh, please, when do you expect them home?\n\n\nKatie Nanna:\n\nI really couldn't say. And now if you'd be good enough to compute my wages, I'll--\n\n\nMrs. Banks:\n\nOh, gracious, Katie Nanna! You're not leaving? What will Mr. Banks say? He's going to be cross\nenough as it is to come home and find the children missing. Ellen, put these things away. You\nknow how the cause infuriates Mr. Banks.\n\n\nEllen:\n\nYes, ma'am.\n\n\nMrs. Banks:\n\nKatie Nanna, I beseech you. Please reconsider. Think of the children. Think of Mr. Banks. He\nwas just beginning to get used to you.\n\n\nAdmiral Boom:\n\nPosts, everyone! Four, three, two, one. Fire!\n\n\nMrs. Banks:\n\nKatie Nanna, I do beseech you--\n\n\nKatie Nanna:\n\nMy wages, if you please.\n\n\nMr. Banks:\n\nBit early tonight, aren't you, admiral?\n\n\nAdmiral Boom:\n\nNonsense. Bang on the dot, as usual. How are things in the world of finance?\n\n\nMr. Banks:\n\nNever better. Money's sound. Credit rates are moving up, up, up. And the British pound is the\nadmiration of the world.\n\n\nAdmiral Boom:\n\nGood man.\n\n\nMr. Banks:\n\nHow do things look from where you stand?\n\n\nAdmiral Boom:\n\nBit chancy, I'd say. The wind's coming up and the glass is falling. - don't like the look of it.\n\n\nMr. Banks:\n\nGood, good, good.\n\n\nAdmiral Boom:\n\nBanks, shouldn't wonder if you weren't steering into a nasty piece of weather. Banks! Do you\nhear me?\n\n\nMr. Banks:\n\nHello, Katie Nanna. That must be heavy. Allow me.\n\n\nKatie Nanna:\n\nHmph!\n\n\nMr. Banks:\n\nWhat a very pretty hat.\n\n\tI feel a surge of deep satisfaction\n\n\tMuch as a king astride his noble steed - thank you.\n\n\tWhen I return from daily strife, to hearth and wife\n\n\tHow pleasant is the life I lead\n\n\nMrs. Banks:\n\nDear, it's about the children.\n\n\nMr. Banks:\n\nYes, yes, yes.\n\n\tI run my home precisely on schedule\n\n\tAt 6:01 I march through my door\n\n\tMy slippers, sherry and pipe are due at 6:02\n\n\tConsistent is the life I lead\n\n\nMrs. Banks:\n\nGeorge, they're missing.\n\n\nMr. Banks:\n\nSplendid. Splendid.\n\n\tIt's grand to be an Englishman in 1910\n\n\tKing Edward's on the throne it's the age of men\n\n\tI'm the lord of my castle the sovereign, the liege\n\n\tI treat my subjects, servants children, wife with a firm but gentle hand, noblesse oblige\n\n\tIt's 6:03 and the heirs to my dominion\n\n\tAre scrubbed and tubbed and adequately fed\n\n\tAnd so I'll pat them on the head and send them off to bed\n\n\tAh, lordly is the life I lead\n\nWinifred, where are the children?\n\n\nMrs. Banks:\n\nThey're not here, dear.\n\n\nMr. Banks:\n\nWhat? Well, of course they're here! Where else would they be?\n\n\nMrs. Banks:\n\nI don't know, George\n\n\nMr. Banks:\n\nYou don't know?\n\n\nMrs. Banks:\n\nWell, they're missing. Katie Nanna has looked everywhere.\n\n\nMr. Banks:\n\nVery well. I'll deal with this at once.\n\nGive me the police station, quickly, please.\n\n\nMrs. Banks:\n\nI don't think we need bother the police, dear. The facts of the matter--\n\n\nMr. Banks:\n\nKindly do not attempt to cloud the issue with facts. One fact, and one fact alone is crystal clear!\nKatie Nanna's faltered at her post. She's let the family down. And I shall bring her to boo-- oh.\nShe's left us, hasn't she?\n\n\nMrs. Banks:\n\nYes, dear, only just.\n\n\nMr. Banks:\n\nWhat, uh-- yes. George Banks here. Yes. 17 Cherry Tree Lane. It's a matter of some urgency.\nI should like you to send a policeman around immediately.\n\n\nMrs. Banks:\n\nThe policeman's here, George!\n\n\nMr. Banks:\n\nWhat? Oh, how very prompt. What wonderful service. Thank you so much. Good night. Come\nin, constable. Come in.\n\n\nConstable:\n\nThank you, sir. While going about my duties on the other side of the park, I noted some\nvaluables that had gone astray. I believe they're yours, sir.\n\n\nMr. Banks:\n\nValuables?\n\n\nConstable:\n\nCome along, now. Come along.\n\n\nMrs. Banks:\n\nJane! Michael!\n\n\nMr. Banks:\n\nWinifred, please don't be emotional.\n\n\nConstable:\n\nOh, I wouldn't be too hard on 'em, sir. They've had a long, weary walk today.\n\n\nMr. Banks:\n\nChildren, come here at once. Well?\n\n\nJane:\n\nI'm sorry we lost Katie Nanna, Father. You see, it was windy. And the kite was too strong for us.\n\n\nConstable:\n\nIn a manner of speaking, sir, it was the kite that ran away, not the children.\n\n\nMr. Banks:\n\nThank you, Constable. I think I can manage this.\n\n\nJane:\n\nActually it wasn't a very good kite. We made it ourselves. Perhaps if you helped us to make\none--\n\n\nConstable:\n\nAh, that's the ticket, sir. Kites are skittish things. Why, only last week with me own youngsters--\n\n\nMr. Banks:\n\nI'm very grateful to you, Constable, for returning the children. And I'm sure that if you go to the\nkitchen, Cook'll find you a plate of something.\n\n\nConstable:\n\nThank you, sir. I shall now return to my duties.\n\n\nJane:\n\nThank you, Constable.\n\n\nConstable:\n\nGood night, miss. Good night, ma'am. Good night, sir. Cook'll find me something. I never--\n\n\nMrs. Banks:\n\nI'm awfully sorry about this, George. I'll expect you'll want to discuss it.\n\n\nMr. Banks:\n\nI would indeed! Ellen, take Jane and Michael upstairs straightaway.\n\n\nEllen:\n\nYes, sir. I knew it. When all's said and done, who bears the brunt of everything around here?\nMe, that's who! They don't want an honest, hard-workin' girl around here. They need a ruddy\nzookeeper.\n\n\nMrs. Banks:\n\nI'm sorry, dear, but when I chose Katie Nanna, I thought she would be firm with the children. She\nlooked so solemn and cross.\n\n\nMr. Banks:\n\nWinifred, never confuse efficiency with a liver complaint.\n\n\nMrs. Banks:\n\nI'll try to do better next time.\n\n\nMr. Banks:\n\nNext time? My dear, you've engaged six nannies in the last four months! And they've all been\nunqualified disasters.\n\n\nMrs. Banks:\n\nI quite agree.\n\n\nMr. Banks:\n\nChoosing a nanny for the children is an important and delicate task. It requires insight, balanced\njudgment, and an ability to read character. Under the circumstances, I think it might be apropos\nto take it upon myself to, uh, select the next person.\n\n\nMrs. Banks:\n\nOh, would you, George?\n\n\nMr. Banks:\n\nObviously the way to find a proper nanny, is to go about it in a proper fashion. I shall put an\nadvertisement in The Times. Take this down please.\n\n\nMrs. Banks:\n\nYes, of course, dear.\n\n\nMr. Banks:\n\nWanted. Uh, no. Uh, required. Nanny: firm, respectable, no nonsense.\n\n\tA British nanny must be a general\n\n\tThe future empire lies within her hands\n\n\tAnd so the person that we need\n\n\tTo mold the breed\n\n\tIs a nanny who can give commands\n\nYou getting this, Winifred?\n\n\nMrs. Banks:\n\nOh, yes, dear. Every word.\n\n\tA British bank is run with precision\n\n\tA British home requires nothing less\n\n\tTradition, discipline and rules must be the tools\n\n\tWithout them, disorder, catastrophe, anarchy\n\n\tIn short you have a ghastly mess\n\n\nMrs. Banks:\n\nSplendid, George! Inspirational. The Times will be so pleased.\n\n\nJane:\n\nFather?\n\n\nMr. Banks:\n\nYes?\n\n\nJane:\n\nWe've discussed everything, and we're very sorry about what we did today.\n\n\nMr. Banks:\n\nI should certainly think so.\n\n\nJane:\n\nIt was wrong to run away from Katie Nanna.\n\n\nMr. Banks:\n\nIt was indeed.\n\n\nJane:\n\nAnd we do so want to get on with the new nanny.\n\n\nMr. Banks:\n\nVery sensible. I shall be glad to have your help in the matter.\n\n\nJane:\n\nWe thought you would. That's why we wrote this advertisement.\n\n\nMr. Banks:\n\nAdvertisement for what?\n\n\nJane:\n\nFor the new nanny.\n\n\nMr. Banks:\n\nYou wrote an advert--\n\n\nMrs. Banks:\n\nGeorge, I think we should listen.\n\n\nJane:\n\nYou said you wanted our help.\n\n\nMr. Banks:\n\nBut, I-- oh, very well.\n\n\nJane:\n\n\"Wanted: a nanny for two adorable children.\"\n\n\nMr. Banks:\n\n\"Adorable.\" well, that's debatable, I must say.\n\n\nJane:\n\n\tIf you want this choice position\n\n\tHave a cheery disposition\n\n\nMr. Banks:\n\nJane, I don't--\n\n\nJane:\n\n\tRosy cheeks, no warts\n\n\nMichael:\n\nThat's the part I put in.\n\n\nJane:\n\n\tPlay games, all sorts\n\n\tYou must be kind you must be witty\n\n\tVery sweet and fairly pretty\n\n\nMr. Banks:\n\nWell, of all the ridic-\n\n\nMrs. Banks:\n\nGeorge, please!\n\n\nJane:\n\n\tTake us on outings give us treats\n\n\tSing songs bring sweets\n\n\tNever be cross or cruel never give us castor oil or gruel\n\n\tLove us as a son and daughter\n\n\tAnd never smell of barley water\n\n\nMichael:\n\nI put that in, too.\n\n\nJane:\n\n\tIf you won't scold and dominate us\n\n\tWe will never you give you cause to hate us\n\n\tWe won't hide your spectacles so you can't see\n\n\tPut toads in your bed or pepper in your tea\n\n\tHurry, nanny\n\n\tMany thanks\n\n\tSincerely\n\n\nJane & Michael:\n\n\tJane and Michael Banks\n\n\nMr. Banks:\n\nThank you. Most interesting. And now I think we've had quite enough of this nonsense. Please\nreturn to the nursery.\n\n\nMrs. Banks:\n\nThey were only trying to help. They're just children.\n\n\nMr. Banks:\n\nI'm well aware they're just children, Winifred. I only congratulate myself that I decided to step in\nand take a hand. \"Play games, sing songs, give treats.\" Ridiculous. There's no question in my\nmind whatsoever. Now is the time for action.\n\nGive me The Times, please. No, I do not know the number.\n\n\nMrs. Banks:\n\nOh, George, you're always so forceful.\n\n\nMrs. Banks:\n\nThe Times? George Banks here. 17 Cherry Tree Lane. I wish to place an advertisement in your\ncolumn.\n\n\nAdmiral Boom:\n\nTime gun ready?\n\n\nMr. Binnacle:\n\nReady and charged, sir.\n\n\nAdmiral Boom:\n\nI'll take the report, Mr. Binnacle.\n\n\nMr. Binnacle:\n\nThe wind has changed, Sir. Seems to be comin' in from a new quarter.\n\n\nAdmiral Boom:\n\nSo it is.\n\n\nMr. Binnacle:\n\nSir?\n\n\nAdmiral Boom:\n\nWhat is it?\n\n\nMr. Binnacle:\n\nBit of somethin' or other taking place off the port bow.\n\n\nAdmiral Boom:\n\nGhastly looking crew, I must say!\n\n\nEllen:\n\nCoo! There's a fair queue of nannies outside, sir. Shall I show 'em in?\n\n\nMr. Banks:\n\nEllen, I said 8:00, and 8:00 it shall jolly well be. You see? Twelve seconds to go. Ten, nine,\neight---\n\n\nMrs. Banks:\n\nPosts! Seven, six, five, four, three, two, one!\n\n\nMr. Banks:\n\nEllen, it is now 8:00.\n\n\nEllen:\n\nYes, sir.\n\n\nMr. Banks:\n\nBut I have told you time and time again, Ellen, I dislike being hurried into things.\n\n\nJane:\n\nI don't understand. They're not what we advertised for at all.\n\nMichael, look!\n\n\nMichael:\n\nPerhaps it's a witch.\n\n\nJane:\n\nOf course not. Witches have brooms.\n\nIt's her. It's the person. She's answered our advertisement.\n\n\nMichael:\n\nRosy cheeks and everything.\n\n\nMr. Banks:\n\nEllen, you may now show them in, one at a time.\n\n\nEllen:\n\nYes, sir. You may come in one at a time.\n\n\nMary Poppins:\n\nThank you.\n\n\nEllen:\n\nOh.\n\n\nMary Poppins:\n\nYou are the father of Jane and Michael Banks, are you not? I said, you are the father of Jane\nand Michael Banks.\n\n\nMr. Banks:\n\nWell, well ye-- yes, of course, I mean. Uh-- you brought your references, I presume. May I see\nthem?\n\n\nMary Poppins:\n\nOh, I make it a point never to give references. A very old-fashioned idea to my mind.\n\n\nMr. Banks:\n\nIs that so? We'll have to see about that then, won't we?\n\n\nMary Poppins:\n\nNow then, the qualifications. \"Item one: a cheery disposition.\" I am never cross. \"Item two: rosy\ncheeks.\" Obviously. \"Item three: play games, all sorts.\" Well, I'm sure the children will find my\ngames extremely diverting.\n\n\nMr. Banks:\n\nMay I? Eh, this paper? Where did you get it from? I thought I tore it up.\n\n\nMary Poppins:\n\nExcuse me. \"Item four: you must be kind.\" I am kind, but extremely firm. Have you lost\nsomething?\n\n\nMr. Banks:\n\nAh! Yeah. That paper, you see. I thought that I--\n\n\nMary Poppins:\n\nYou are George Banks, are you not?\n\n\nMr. Banks:\n\nWhat?\n\n\nMary Poppins:\n\nAnd you did advertise for a nanny, did you not?\n\n\nMr. Banks:\n\nGeorge Banks.\n\n\nMary Poppins:\n\nVery well then.\n\n\nMr. Banks:\n\nI tore it up, turned it over. Tore it up again and threw it in there. Yes.\n\n\nMary Poppins:\n\nI beg your pardon. Are you ill?\n\n\nMr. Banks:\n\nI hope not.\n\n\nMary Poppins:\n\nNow, about my wages. The reference here is very obscure.\n\n\nMr. Banks:\n\nVery obscure.\n\n\nMary Poppins:\n\nWe must be very clear on that point, mustn't we?\n\n\nMr. Banks:\n\nYes, we must indeed.\n\n\nMary Poppins:\n\nI shall require every second Tuesday off.\n\n\nMr. Banks:\n\nEvery Tuesday.\n\n\nMary Poppins:\n\nOn second thoughts, I believe a trial period would be wise. Hmm. I'll give you one week. I'll know\nby then. I'll see the children now. Thank you.\n\n\nClose your mouth please, Michael. We are not a codfish. Well, don't stand there staring. Best\nfoot forward. Spit spot!\n\n\nMrs. Banks:\n\nGeorge? Aah! George, what on earth are you doing? I thought you were interviewing nannies.\n\n\nMr. Banks:\n\nI was! I was!\n\n\nMrs. Banks:\n\nYou mean you've selected one already?\n\n\nMr. Banks:\n\nYes, it's done. It's, it's all done.\n\n\nMrs. Banks:\n\nWell, where is she?\n\n\nMr. Banks:\n\nWhat? Well, eh, she's in the nursery of course, I mean. I put her to work straightaway, I mean.\n\n\nMrs. Banks:\n\nHow clever of you! I would have muddled the whole thing. Tell me, is she everything that we'd\nhoped she be?\n\n\nMr. Banks:\n\nWell, I - it all happened rather quickly. I mean, I-- I, uh--\n\n\nMrs. Banks:\n\nWill she be firm? Will she give commands? Will she mold our young breed?\n\n\nMr. Banks:\n\nYou know, Winifred, I think she will. I think she will.\n\n\nMrs. Banks:\n\nIn that case, perhaps you'd better tell Ellen to dismiss the others.\n\n\nMr. Banks:\n\nThe others? Oh, yes. Ellen?\n\n\nEllen:\n\nY-yes, sir?\n\n\nMr. Banks:\n\nTell the other applicants they may go. The position has been filled.\n\n\nEllen:\n\nThe others, sir?\n\n\nMr. Banks:\n\nYes, the others. How many n-nannies does she think we need in this house?\n\n\nEllen:\n\nThe position has been filled.\n\n\nJane:\n\nI'm afraid the nursery isn't very tidy.\n\n\nMary Poppins:\n\nIt is rather like a bear pit, isn't it?\n\n\nMichael:\n\nThat's a funny sort of bag.\n\n\nMary Poppins:\n\nCarpet.\n\n\nMichael:\n\nYou mean to carry carpets in?\n\n\nMary Poppins:\n\nNo. Made of.\n\n\nJane:\n\nThis is your room, and there's a lovely view of the park.\n\n\nMary Poppins:\n\nHmm. Well, it's not exactly Buckingham Palace. Still, it's clean. Yes, I think it will be quite\nsuitable. Just needs a touch here and there. Well, first things first. I always say, the place to\nhang a hat is on a hat stand. Ah! This will never do! I much prefer seeing all of my face at the\nsame time.\n\n\nMichael:\n\nThere-- but there was nothing in it.\n\n\nMary Poppins:\n\nNever judge things by their appearance. Even carpetbags. I'm sure I never do. A thing of beauty\nis a joy forever. Mmm, a little more light, perhaps.\n\n\nMichael:\n\nWe better keep an eye on this one. She's tricky.\n\n\nJane:\n\nShe's wonderful.\n\n\nMary Poppins:\n\nMuch better! Now, let me see. That's funny. I always carry it with me. It must be here\nsomewhere.\n\n\nMichael:\n\nWhat?\n\n\nMary Poppins:\n\nMy tape measure.\n\n\nMichael:\n\nWhat do you want it for?\n\n\nMary Poppins:\n\nI want to see how you two measure up. Well, that's the funniest thing I ever saw. I know it's\ndown here somewhere. Ah, ha-ha, ha-ha! Here it is. Good. Come along, then. Quickly. Head up,\nMichael. Don't slouch. Just as I thought. Extremely stubborn and suspicious.\n\n\nMichael:\n\nI am not!\n\n\nMary Poppins:\n\nSee for yourself.\n\n\nMichael:\n\n\"Extremely stubborn and sus--\"\n\n\nMary Poppins:\n\nSuspicious.\n\nNow you, Jane. Mmm. \"Rather inclined to giggle. Doesn't put things away.\"\n\n\nMichael:\n\nHow 'bout you?\n\n\nMary Poppins:\n\nVery well. Hold this for me. As I expected. \"Mary Poppins. Practically perfect in every way.\"\n\n\nJane:\n\nMary Poppins! Is that your name? It's lovely.\n\n\nMary Poppins:\n\nThank you. I've always liked it. Now, shall we get on with it?\n\n\nJane:\n\nGet on with what?\n\n\nMary Poppins:\n\nIn your advertisement, did you not specifically request to play games?\n\n\nJane:\n\nOh, yes!\n\n\nMary Poppins:\n\nVery well, then. Our first game is called \"well begun is half done.\"\n\n\nMichael:\n\nI don't like the sound of that.\n\n\nMary Poppins:\n\nOtherwise entitled, \"let's tidy up the nursery.\"\n\n\nMichael:\n\nI told you she was tricky.\n\n\nMary Poppins:\n\nShall we begin?\n\n\nJane:\n\nIt is a game, isn't it, Mary Poppins?\n\n\nMary Poppins:\n\nWell, it depends on your point of view. You see,\n\n\tIn every job that must be done,\n\n\tThere is an element of fun.\n\n\tYou find the fun, and snap!\n\n\tThe job's a game.\n\n\tAnd every task you undertake\n\n\tBecomes a piece of cake\n\n\tA lark, a spree it's very clear to see\n\n\tThat a spoonful of sugar helps the medicine go down\n\n\tThe medicine go down\n\n\tMedicine go down\n\n\tJust a spoonful of sugar helps the medicine go down\n\n\tIn a most delightful way\n\n\tA robin feathering his nest\n\n\tHas very little time to rest\n\n\tWhile gathering his bits of twine and twig\n\n\tThough quite intent in his pursuit,\n\n\tHe has a merry tune to toot\n\n\tHe knows a song will move the job along\n\n\tFor a spoonful of sugar helps the medicine go down\n\n\tThe medicine go down\n\n\tMedicine go down\n\n\tJust a spoonful of sugar helps the medicine go down\n\n\tIn a most delightful way\n\n\tThe honeybees that fetch the nectar from the flowers to the comb\n\n\tNever tire of ever buzzing to and fro\n\n\tBecause they take a little nip from every flower that they sip\n\n\tAnd hence\n\n\nReflection:\n\n\tAnd hence\n\n\nMary Poppins:\n\n\tThey find\n\n\nReflection:\n\n\tThey find\n\n\nMary Poppins & Reflection:\n\n\tTheir task is not a grind\n\nMary Poppins:\n\nCheeky.\n\nDon't be all day about it, please.\n\n\nMichael:\n\nLet me out! Let me out! Let me out!\n\n\nMary Poppins:\n\nWell, that was very--\n\nThank you now-- when you've quite finished!\n\nThank you. That will be quite sufficient. Hats and coats, please. It's time for our outing in the\npark.\n\n\nMichael:\n\nI don't want an outing. I want to tidy up the nursery again.\n\n\nMary Poppins:\n\nEnough is as good as a feast. Come along, please. Let me look at you. Well, you're not as well\nturned out as I'd like. Still, there's time. There's time. Spit spot! And off we go.\n\n\nJane & Michael:\n\n\tFor a spoonful of sugar helps the medicine go down\n\n\tThe medicine go down\n\n\tMedicine go down\n\n\tJust a spoonful of sugar helps the medicine\n\n\tGo down in the most delightful way\n\n\nBert:\n\n\tChim chiminy, chim chiminy chim chim cheroo\n\n\tI does what I likes and I likes what I do\n\nHello, art lovers.\n\n\tToday I'm a screever and as you can see\n\n\tA screever's an artist of highest degree\n\n\tAnd it's all me own work\n\n\tFrom me own memory\n\nWell, not Royal Academy, I suppose. Still they're better than a finger in your eye, ain't they?\n\n\tChim chiminy, chim chiminy chim chim cheroo\n\n\tI draws what I likes and I likes what I drew\n\n\tNo remuneration do I ask of you\n\n\tBut me cap would be glad of a copper or two\n\n\tMe cap would be glad of a copper or two\n\nWait! Don't move. Don't move a muscle. Stay right where you are. I'd know that silhouette\nanywhere! Mary Poppins!\n\n\nMary Poppins:\n\nIt's nice to see you again, Bert. I expect you know Jane and Michael.\n\n\nBert:\n\nWell, I've seen 'em here and about. Chasin' a kite last time, weren't it?\n\n\nJane:\n\nMary Poppins is taking us to the park.\n\n\nBert:\n\nTo the park? Not if I know Mary Poppins. Other nannies take children to the park. When you're\nwith Mary Poppins, suddenly you're in places you've never dreamed of. And quick as you can\nsay \"Bob's your uncle,\" the most unusual things begin to happen.\n\n\nMary Poppins:\n\nI'm sure I haven't the faintest idea what you're talking about.\n\n\nBert:\n\nWell mind, it's not my place to say, but what she's probably got in mind, is a jolly holiday\nsomewheres or other. Something along these lines, I shouldn't be surprised. \"Punting on the\nThames.\" That's always good if you like an outing. Here we go.\n\nThe circus. How about a lovely circus? Lions and tigers. World-famous artistes performing\ndeath-defyin' feats, of dexterity and skill before your very eyes. Ta-da! Ta-da!\n\n\nJane:\n\nOh, that's lovely. If you please, I'd much rather go there.\n\n\nBert:\n\nBeautiful, ain't it? A typical English countryside, as done by a true and lovin' hand. Though you\ncan't see it, there's a little country fair down that road and uh, over the hill.\n\n\nMichael:\n\nI don't see any road.\n\n\nBert:\n\nWhat? No road? Just wants a bit of somethin' here, and a bit of somethin' there. There. A\ncountry road suitable for travel and high adventure.\n\n\nJane:\n\nPlease may we go, Mary Poppins? Please? Such a lovely place. Don't you think it's lovely, Mary\nPoppins?\n\n\nBert:\n\nNow's the time, Mary Poppins. No one's lookin'.\n\n\nJane & Michael:\n\nPlease, Mary Poppins. Please! Please, Mary Poppins. Please!\n\n\nMary Poppins:\n\nI have no intention of making a spectacle of myself, thank you.\n\n\nBert:\n\nAll right, I'll do it myself.\n\n\nMary Poppins:\n\nDo what?\n\n\nBert:\n\nBit of magic.\n\n\nMichael:\n\nA bit of magic?\n\n\nBert:\n\nIt's easy. Let's see. You think. You wink. You do a double blink. You close your eyes and jump.\n\n\nJane:\n\nIs something 'sposed to happen?\n\n\nMary Poppins:\n\nBert, what utter nonsense! Ohh! Why do you always complicate things that are really quite\nsimple? Give my your hand, please, Michael. Don't slouch. One, two.\n\n\nBert:\n\nMary Poppins, you look beautiful.\n\n\nMary Poppins:\n\nDo you really think so?\n\n\nBert:\n\nCross my heart you do. Like the day I met ya.\n\n\nMary Poppins:\n\nYou look fine, too, Bert.\n\n\nMichael:\n\nI thought you said there was a fair.\n\n\nBert:\n\nSo I did. Down the road behind the hill, remember?\n\n\nJane:\n\nCome on! I hear the merry-go-round.\n\n\nBert:\n\nTell 'em Bert sent ya.\n\n\nMary Poppins:\n\nDon't fall and smudge the drawing.\n\n\nBert:\n\n\tAin't it a glorious day\n\n\tRight as a mornin' in May\n\n\tI feel like I could fly\n\n\nMary Poppins:\n\nNow, Bert. None of your larking about.\n\n\nBert:\n\n\tHave you ever seen\n\n\tThe grass so green\n\n\tOr a bluer sky\n\n\tOh, it's a jolly holiday with Mary\n\n\tMary makes your heart so light\n\n\nMary Poppins:\n\nYou haven't changed a bit, have you?\n\n\nBert:\n\n\tWhen the day is gray and ordinary\n\n\tMary makes the sun shine bright\n\n\nMary Poppins:\n\nOh, honestly!\n\n\nBert:\n\n\tOh, happiness is bloomin' all around her\n\n\tThe daffodils are smilin' at the dove\n\n\tWhen Mary holds your hand you feel so grand\n\n\tYour heart starts beatin' like a big brass band\n\n\nMary Poppins:\n\nYou are lightheaded.\n\n\nBert:\n\n\tIt's a jolly holiday with Mary\n\n\tNo wonder that it's Mary that we love\n\n\nAnimals:\n\n\tOh, it's a jolly holiday with Mary\n\n\tMary makes your heart so light\n\n\tWhen the day is gray and ordinary\n\n\tMary makes the sun shine bright\n\n\tOh, happiness is bloomin' all around her\n\n\tThe daffodils are smiling at the dove oink, oink.\n\n\tWhen Mary holds your hand\n\n\tYou feel so grand\n\n\tYour heart starts beatin' like a big brass band\n\n\tIt's a jolly holiday with Mary\n\n\tNo wonder that it's Mary that we love\n\n\nMary Poppins:\n\nThank you.\n\n\nTurtles:\n\nOur pleasure, Mary Poppins.\n\n\nMary Poppins:\n\n\tOh, it's a jolly holiday with you, Bert\n\n\tGentlemen like you are few\n\n\nBert:\n\nA vanishing breed, that's me.\n\n\nMary Poppins:\n\n\tThough you're just a diamond in the rough, Bert\n\n\tUnderneath your blood is blue\n\n\nBert:\n\nCommon knowledge.\n\n\nMary Poppins:\n\n\tYou'd never think of pressing your advantage\n\n\tForbearance is the hallmark of your creed\n\n\nBert:\n\nTrue.\n\n\nMary Poppins:\n\n\tA lady needn't fear\n\n\tWhen you are near\n\n\tYour sweet gentility is crystal clear\n\n\tOh, it's a jolly holiday with you, Bert\n\n\tA jolly, jolly holiday with you\n\n\nBert:\n\nWaiter! Waiter!\n\n\nMary Poppins:\n\nNow then, what'd be nice?\n\n\tWe'll start with raspberry ice\n\n\tand then some cakes and tea\n\n\nWaiter\n\n\tOrder what you will\n\n\tThere'll be no bill\n\n\tIt's complimentary\n\n\nMary Poppins:\n\nYou're very kind.\n\n\nWaiter:\n\nAnything for you, Mary Poppins. You're our favorite person.\n\n\nBert:\n\nRight you are.\n\n\nIt's true that Mavis and Sybil have ways that are winnin'\n\nAnd Prudence and Gwendolyn set your hearts spinnin'\n\nPhoebe's delightful\n\nMaude is disarming\n\n\nWaiters:\n\nJanice Felicia Lydia\n\n\nBert:\n\n.. charming\n\nCynthia's dashing,\n\nVivian's sweet,\n\nStephanie's smashing\n\nPriscilla a treat\n\n\nWaiters:\n\nVeronica Millicent Agnes and Jane\n\n\nBert:\n\nconvivial company time and again\n\nDorcas and Phyllis and Glynis are sorts\n\nI'll agree they're three jolly good sports\n\nBut cream of the crop\n\nTip of the top\n\n\nBert & Waiters:\n\nIs Mary Poppins\n\nAnd there we stop\n\n\n\tWhen Mary holds your hand\n\n\tYou feel so grand\n\n\tYour heart starts beatin' like a big brass band\n\n\tIt's a jolly holiday with Mary\n\n\tNo wonder that it's Mary that we love\n\n\tNo wonder that it's Mary that we love\n\n\tNo wonder that it's Mary that we love\n\n\nMichael:\n\nYa-hoo! Ya-hoo! Ya-hoo! Ya-hoo! -ya-hoo!\n\n\nJane:\n\nOur own private merry-go-round.\n\n\nBert\n\nVery nice. Very nice, indeed, if you don't wanna go nowhere.\n\n\nMary Poppins:\n\nWho says we're not going anywhere? Oh, guard!\n\n\nGuard:\n\nRighto, Mary Poppins.\n\n\nMary Poppins:\n\nThank you.\n\n\nGuard:\n\nThey're off! It's Mary Poppins leadin' by two lengths. Jane is second by a length. Michael third.\n\n\nMichael:\n\nMy horse is the fastest.\n\n\nBert:\n\nDo you hear that, mate? Do you wanna put up with that? That's the ticket! Come on, my lad. Is\nthat the best you can do?\n\n\nMichael:\n\nHurry up, boy. Hurry up!\n\n\nMary Poppins:\n\nNot so fast, please. Michael! Now really, Bert. You're as bad as the children.\n\n\nBert:\n\nSorry. Whoa, boy! Whoa! Whoa. Easy, boy. Whoa. Whoa. Just a bit of high spirits, Mary\nPoppins.\n\n\nMary Poppins:\n\nPlease control yourself. We are not on a racecourse.\n\nFollow me, please.\n\nGood morning.\n\n\nHunter:\n\nOh, yes, quite. Wha-- I say! Have you ever?\n\n\nHorse:\n\nNever!\n\n\nHunter:\n\nView halloo!\n\n\nHorse:\n\nOh, yes, definitely. A view halloo.\n\n\nFox:\n\nView halloo?\n\nFaith and begorra! 'Tis them redcoats again!\n\n\nDogs:\n\nView halloo! View halloo! View halloo!\n\n\nFox:\n\nOh, musha, musha.\n\n\nBert:\n\nPoor lit'l bloke. Let's give him a hand.\n\n\nFox:\n\nSaints preserve us! Yikes!\n\n\n\nTally ho!\n\n\nBert:\n\nDa-doo, da-doo! Up you go. Now hang on.\n\n\nFox:\n\nWould you look at that now? 'Tis an elegant merry-go-round horse. Come on and fight, you dirty\nomadhauns. I can lick the lot of ya's. Faster, me beauty! Faster!\n\n\nMary Poppins:\n\nOh, riders, would you be so kind as to let me pass?\n\n\nHorse Rider:\n\nCertainly, ma'am.\n\n\nMary Poppins:\n\nThank you.\n\n\nHorse Rider:\n\nNot at all, ma'am.\n\n\nSpectator 1:\n\nExcellent time, gentlemen.\n\n\nSpectator 2:\n\nOh, yes, quite. - perfect day for it, of course.\n\n\nMary Poppins:\n\nOh. Oh, how nice.\n\n\nCrowd:\n\nHooray! Hooray! Hooray! Hooray! Hooray! Hooray! Hooray!\n\n\nPhotographer:\n\nHold still, now. Watch for the dickie bird.\n\n\nReporter 1:\n\nUh, how does it feel, Mary Poppins, winning the race?\n\n\nMary Poppins:\n\nOh, well I--\n\n\nReporter 2:\n\n- gaining fame and fortune.\n\n\nMary Poppins:\n\nUh, yes.\n\n\nReporter 3:\n\nHaving your picture taken for the newspaper.\n\n\nMary Poppins:\n\nUh, oh, actually, I'm delighted.\n\n\nReporter 4:\n\nBesides having your extreme good looks, if I may say so.\n\n\nMary Poppins:\n\nOh, well, I wouldn't go--\n\n\nReporter 3:\n\nThere probably aren't words to describe your emotions.\n\n\nMary Poppins:\n\nNow, now, now, now, gentlemen, please. On the contrary, there's a very good word. Am I right,\nBert?\n\n\nBert:\n\nTell 'em what it is.\n\n\nMary Poppins:\n\nRight! It's ...\n\n\tSupercalifragilistic- expialidocious\n\n\tEven though the sound of it is something quite atrocious\n\n\tIf you say it loud enough you'll always sound precocious\n\n\tSupercalifragilistic- expialidocious\n\n\nGroup:\n\n\tUm diddle diddle diddle um diddle ay\n\n\tUm diddle diddle diddle um diddle ay\n\n\tUm diddle diddle diddle um diddle ay\n\n\tUm diddle diddle diddle um diddle ay\n\n\nBert:\n\n\tBecause I was afraid to speak when I was just a lad\n\n\tMe father gave me nose a tweak and told me I was bad\n\n\tBut then one day I learned a word that saved me achin' nose\n\n\nBert & Mary Poppins:\n\n\tThe biggest word you ever heard and this is how it goes\n\n\tOh, supercalifragilistic- expialidocious\n\n\tEven though the sound of it is something quite atrocious\n\n\tIf you say it loud enough you'll always sound precocious\n\n\tSupercalifragilistic- expialidocious\n\n\tUm diddle diddle diddle um diddle ay\n\n\tUm diddle diddle diddle um diddle ay\n\n\nGroup:\n\n\tUm diddle diddle diddle um diddle ay\n\n\tUm diddle diddle diddle um diddle ay\n\n\nMary Poppins:\n\n\tHe's traveled all around the world and everywhere he went\n\n\tHe'd use his word and all would say, \"there goes a clever gent\"\n\n\nBert:\n\n\tWhen dukes and maharajahs pass the time of day with me\n\n\tI'd say me special word and then they'd ask me out to tea\n\n\nBert & Mary Poppins:\n\n\tOoh, supercalifragilistic- expialidocious\n\n\tEven though the sound of it is something quite atrocious\n\n\tIf you say it loud enough you'll always sound precocious\n\n\tSupercalifragilistic- expialidocious\n\n\tUm diddle diddle diddle um diddle ay\n\n\tUm diddle diddle diddle um diddle ay\n\n\nMary Poppins:\n\nYou know, you can say it backwards,\n\nWhich is, Dociousaliexpiistic- fragilcalirupus.\n\nBut that's going a bit too far, don't you think?\n\n\nBert:\n\nIndubitably.\n\n\nMary Poppins:\n\n\tSo when the cat has got your tongue there's no need for dismay\n\n\nBert:\n\nHear, hear!\n\n\nMary Poppins:\n\n\tJust summon up this word and then you've got a lot to say\n\n\tBut better use it carefully or it could change your life\n\n\nDrummer:\n\nFor example.\n\n\nMary Poppins:\n\nYes?\n\n\nDrummer:\n\nOne night I said it to me girl, and now me girl's me wife.\n\nOw! And a lovely thing she is, too.\n\n\nGroup:\n\n\tShe's supercalifragilistic- expialidocious\n\n\tSupercalifragilistic- expialidocious\n\n\tSupercalifragilistic- expialidocious\n\n\tSupercalifragilistic-expialidocious\n\n\nMary Poppins:\n\nJane! Michael! Stay close now. Oh, Bert, all your fine drawings.\n\n\nBert:\n\nWell, there's more where they came from. Meantime, I'm changing businesses. This here is\nlovely hot chestnut weather.\n\n\nMary Poppins:\n\nCome along, children. Bye, Bert.\n\n\nBert:\n\nBye-bye.\n\n\nJane:\n\nBye, Bert.\n\n\nBert:\n\nBye. Bye, Jane and Michael.\n\n\nMichael:\n\nBye, Bert.\n\n\nBert:\n\n\tChim chiminy, chim chiminy chim chim cheroo\n\n\tLa dum da da dum da da da da dum\n\n\nMichael:\n\nNo, no, I won't take your nasty medicine!\n\n\nJane:\n\nDo we have to, Mary Poppins?\n\n\nMary Poppins:\n\nPeople who get their feet wet, must learn to take their medicine.\n\n\nMichael:\n\nI don't want it. I'm not gonna--\n\n\nJane:\n\nOh! Lime cordial! Delicious!\n\n\nMichael:\n\nStrawberry! Mmm!\n\n\nMary Poppins:\n\nR-r-rum punch. Quite satisfactory.\n\n\nJane:\n\nMary Poppins, you won't ever leave us, will you?\n\n\nMary Poppins:\n\nDo you have a handkerchief under your pillow? Mm-hmm.\n\n\nMichael:\n\nWill you stay if we promise to be good?\n\n\nMary Poppins:\n\nOch! That's a piecrust promise. Easily made, easily broken.\n\n\nJane:\n\nWhatever would we do without you?\n\n\nMary Poppins:\n\nI shall stay until the wind changes.\n\n\nMichael:\n\nBut, Mary Poppins, how long will that be?\n\n\nMary Poppins:\n\nSilence, please. It's time to go to sleep.\n\n\nJane:\n\nOh, we couldn't possibly go to sleep! So many lovely things have happened today.\n\n\nMary Poppins:\n\nDid they?\n\n\nJane:\n\nYes! When we jumped into Bert's chalk picture.\n\n\nMichael:\n\nAnd we rode the merry-go-round, and all the horses jumped off, and--\n\n\nJane:\n\nAnd we all went riding in the countryside!\n\n\nJane & Michael:\n\nTally ho! Tchunga! Tchunga! Yikes!\n\n\nMary Poppins:\n\nReally?\n\n\nJane:\n\nMary Poppins, don't you remember? You won the horse race!\n\n\nMary Poppins:\n\nA respectable person like me in a horse race? How dare you suggest such a thing.\n\n\nMichael:\n\nBut I saw you do it!\n\n\nMary Poppins:\n\nNow, not another word or I shall have to summon the policeman. Is that clear?\n\n\nMichael:\n\nIt did happen! I saw it!\n\n\nMary Poppins:\n\nGo to sleep.\n\n\nMichael:\n\nNo, I don't want to go to sleep.\n\n\nJane:\n\nMary Poppins, we're much too excited!\n\n\nMary Poppins:\n\nVery well, suit yourselves.\n\n\tStay awake don't rest your head\n\n\tDon't lie down upon your bed\n\n\tWhile the moon drifts in the skies\n\n\tStay awake don't close your eyes\n\n\tThough the world is fast asleep\n\n\tThough your pillow's soft and deep\n\n\tYou're not sleepy as you seem\n\n\tStay awake don't nod and dream\n\n\tStay awake don't nod and dream\n\n\nAdmiral Boom:\n\nGlorious day, Mr. Binnacle. Glorious! No one sleeps this morning. Put in a double charge of\npowder.\n\n\nMr. Binnacle:\n\nA double charge? Aye, aye, sir.\n\n\nAdmiral Boom:\n\nShake things up a bit, what?\n\n\nMrs. Banks:\n\nLovely, lovely morning, Ellen.\n\n\nEllen:\n\nIndeed it is, ma'am.\n\n\nMrs. Banks:\n\nHave you put the spoiled eggs in my carryall?\n\n\nEllen:\n\nYes, ma'am.\n\n\nMrs. Banks:\n\nAfter our meeting at the Albert Hall, we're all going to Downing street, to throw things at the\nprime minister. Oh, how distinguished you look this morning, George.\n\n\nMr. Banks:\n\nWhat's all that fearful caterwauling in the kitchen?\n\n\nMrs. Banks:\n\nIt's cook singing.\n\n\nMr. Banks:\n\nCook singing? What's wrong with her?\n\n\nMrs. Banks:\n\nShe's happy as a cricket. As a matter of fact, since you hired Mary Poppins, the most\nextraordinary thing seems to have come over the household.\n\n\nMr. Banks:\n\nIs that so?\n\n\nMrs. Banks:\n\nTake Ellen for instance. She hasn't broken a dish all morning.\n\n\nMr. Banks:\n\nReally? Well, that is extraordinary.\n\n\nMrs. Banks:\n\nAnd another thing. She and Cook usually fight like cats and dogs, but today--\n\n\nMrs. Brill:\n\nLet me hold the door for you, Ellen dear.\n\n\nEllen:\n\nThanks ever so, ducks.\n\n\nMr. Banks:\n\nEllen, stop making that offensive noise! And shut the window! That bird's giving me a headache.\n\n\nEllen:\n\nYes, sir. Quiet! You're giving the master a headache.\n\n\nMrs. Banks:\n\nI'm so sorry you're not feeling well this morning, George.\n\n\nMr. Banks:\n\nWho said I'm not feeling well? I'm fit as a fiddle. I just don't understand why everyone's so\nconfoundedly cheerful!\n\nJane & Michael:\n\n\tSupercalifragilistic- expialidocious\n\n\tSupercalifragilistic-expialidocious\n\n\tSupercalifragilistic- expialidocious\n\n\nMrs. Banks:\n\nHow lovely. Thank you, my darling.\n\n\nJane & Michael:\n\n\tSupercalifragilistic-expialidocious\n\n\nJane, Michael, Ellen & Mrs. Brill:\n\n\tSupercalifragilistic- expialidocious\n\n\nMr. Banks:\n\nStop! Stop! Stop!\n\n\nJane:\n\nGood morning, Father.\n\n\nMr. Banks:\n\nGood morning.\n\n\nJane:\n\nMary Poppins taught us the most wonderful words.\n\n\nMichael:\n\n\tSupercalifragilistic- expialidocious\n\n\nMr. Banks:\n\nWhat on earth are you talking about? Supercali-- super-- or whatever the infernal thing is.\n\n\nJane:\n\nIt's something to say when you don't know what to say.\n\n\nMr. Banks:\n\nYes, well, I always know what to say. Go on, hurry along, please.\n\n\nJane:\n\nYes, father.\n\n\nJane & Michael:\n\n\tSupercalifragilistic- expialidocious\n\n\nMr. Banks:\n\nWinifred, will you be good enough to explain this unseemly hullabaloo?\n\n\nMrs. Banks:\n\nI don't think there's anything to explain, do you? It's obvious that you're out of sorts this morning.\nThe children just came in to make you feel better.\n\n\nMr. Banks:\n\nI should like to make one thing quite clear, once and for all. I am not out of sorts. I am in a\nperfectly equable mood. I don't require being made to feel better!\n\n\nMrs. Banks:\n\nBut you're always saying that you wanted a cheerful and pleasant household.\n\n\nMr. Banks:\n\nWinifred, I should like to make a slight differentiation between the word cheerful and just plain\ngiddy irresponsibility.\n\n\nMrs. Banks:\n\nExcuse me, dear. Posts, everyone, please!\n\n\nMr. Banks:\n\nI have no objection to anyone being cheerful or pleasant. But I do expect a certain decorum. I\ncan tell you one thing, Winifred. I don't propose standing idly by and letting that woman, Mary\nPoppins, undermine the discipline and-- there's something odd, I may say extremely odd about\nthe behavior of this household since that woman arrived. And I want you to know that I've\nnoticed it!\n\n\nMrs. Banks:\n\nYes, dear.\n\n\nMr. Banks:\n\nOne thing more.\n\n\nMrs. Banks:\n\nYes, dear?\n\n\nMr. Banks:\n\nI suggest you have this piano repaired. When I sit down to an instrument, I like to have it in tune.\n\n\nMrs. Banks:\n\nBut, George, you don't play.\n\n\nMr. Banks:\n\nMadam, that is entirely beside the point!\n\n\nMary Poppins:\n\nNow, let me see. First of all, we must go to the piano tuners. And then we go to Mrs. Cory's sh--\nMrs. Cory's shop for some gingerbread.\n\n\nJane:\n\nAh, gingerbread!\n\n\nMary Poppins:\n\nAnd then we go to the fishmonger's, I think, for a nice dover sole and a pint of prawns. Uh,\nMichael, stop stravaging along behind.\n\n\nAdmiral Boom:\n\nAhoy, there! Ahoy! Good day to you!\n\n\nMary Poppins:\n\nGood morning, Admiral.\n\n\nAdmiral Boom:\n\nMichael, what fine adventure are we off upon today? Going to fight the Hottentots? Dig for buried\ntreasure?\n\n\nMichael:\n\nWe're going to buy some fish.\n\n\nAdmiral Boom:\n\nVery good! Proceed at flank speed.\n\n\nMichael:\n\nAye, aye, sir.\n\n\nAdmiral Boom:\n\nLet's put our backs into it, lad. More spit and polish. That's what's wanted around here.\n\n\nJane:\n\nIt's Andrew!\n\n\nMary Poppins:\n\nUh, not so fast, please. I can't understand a word you're saying. Again? Och! Oh, the poor man!\nBless you. Well, yes, of course. There's not a moment to lose. I'll go straightaway. And thank\nyou very much.\n\n\nJane:\n\nWhat did he say?\n\n\nMary Poppins:\n\nHe said, \"you're welcome.\"\n\n\nJane:\n\nWhat else did he say?\n\n\nMichael:\n\nI don't think he said anything.\n\n\nMary Poppins:\n\nYou know best, as usual.\n\n\nJane:\n\nI thought we were gonna buy some fish.\n\n\nMary Poppins:\n\nThere's been a change of plans. Come along, please. Don't straggle.\n\nAndrew, worrying won't help anyone. Why don't you go home and put your feet up?\n\nOh, Bert, I'm glad you're here.\n\n\nBert:\n\nI came over the moment I heard.\n\n\nMary Poppins:\n\nWell, how is he?\n\n\nBert:\n\nI've never seen him as bad as this, and that's the truth.\n\n\nMary Poppins:\n\nOh!\n\n\nBert:\n\nHow about them? It's contagious, you know.\n\n\nJane:\n\nShall we get spots?\n\n\nMary Poppins:\n\nOh, highly unlikely.\n\nOh, uncle Albert!\n\n\nUncle Albert:\n\nOh, bless me. Bless my soul. It's Mary Poppins! I'm delight-- -I'm delighted to see you, Mary.\n\n\nMary Poppins:\n\nUncle Albert, you promised!\n\n\nUncle Albert:\n\nOh, I kn-- I know, I-- but I tried. Really, I did, my dear. I-- but I so enjoy laughing, you know? And,\nwell-- and when I start, it's all up with the-- that's what happens to me. I love to laugh! Oh, my\ngoodness! I can't help it. You can see that. I just like laughing, that's all.\n\n\nMary Poppins:\n\nJane, don't you dare! You'll only make him worse. It's really quite serious!\n\n\nBert:\n\nYes, whatever you do, keep a straight face. Last time, it took us three days to get him down.\n\n\nUncle Albert:\n\n\tI love to laugh\n\n\tLoud and long and clear\n\n\tI love to laugh\n\n\tIt's getting worse every year\n\n\tThe more I laugh\n\n\tThe more I fill with glee\n\n\nMary Poppins:\n\nYou're no help at all.\n\n\nUncle Albert:\n\n\tThe more the glee\n\n\tThe more I'm a merrier me\n\nIt's embarrassing.\n\n\tThe more I'm a merrier me\n\n\nMary Poppins:\n\n\tSome people laugh through their noses\n\n\tSounding something like this -- dreadful!\n\n\tSome people laugh through their teeth, goodness sakes\n\n\tHissing and fizzing like snakes\n\nNot at all attractive to my way of thinking.\n\n\nBert:\n\n\tSome laugh too fast\n\n\tSome only blast\n\n\tOthers, they twitter like birds\n\n\nMary Poppins:\n\nYou know, you're as bad as he is.\n\n\nBert:\n\nThen there's that kind what can't make up their mind\n\n\nUncle Albert:\n\n\tWhen things strike me as funny I can't hide it inside\n\n\tAnd squeak as the squeakelers do\n\n\tI've got to let go with a ho ho ho ho\n\n\tAnd laugh too\n\nHow nice! I was hoping you'd turn up.\n\n\nBert:\n\nTurn up!\n\n\nUncle Albert:\n\nWe always have such a jolly time.\n\n\nUncle Albert & Bert:\n\n\tWe love to laugh\n\n\tLoud and long and clear\n\n\tWe love to laugh\n\n\tSo everybody can hear\n\n\tThe more you laugh\n\n\nMary Poppins:\n\nWhoops, don't you two start. Come back down here.\n\n\nUncle Albert & Bert:\n\n\tThe more you fill with glee\n\n\tThe more the glee\n\n\tThe more we're a merrier we\n\n\nUncle Albert:\n\nOh, welcome, children! Welcome! Make yourselves comfortable.\n\n\nBert:\n\nThat's right. Pull up a chair.\n\n\nUncle Albert:\n\nOh, pull up--\n\n\nMary Poppins:\n\nI must say, you're a sight, the lot of you!\n\n\nBert:\n\nSpeaking of sight, it reminds me of me brother. He's got a nice cushy job in a watch factory.\n\n\nUncle Albert:\n\nIn a watch factory? What does he do?\n\n\nBert:\n\nHe stands about all day and makes faces!\n\n\nUncle Albert:\n\nHe makes faces in a watch fact-- you made that up.\n\n\nBert:\n\nI know.\n\n\nUncle Albert:\n\nThat's so good!\n\n\nMary Poppins:\n\nSuch behaviour! Well, it's the most disgraceful sight I've ever seen, or my name isn't Mary\nPoppins.\n\n\nBert:\n\nSpeaking of names, I know a man with a wooden leg named Smith.\n\n\nUncle Albert:\n\nWhat's the name of his other leg? Wasn't that funny? What's the name of his other--\n\n\nMary Poppins:\n\nNow, then, children, it's time for tea. I will not have my schedule interrupted.\n\n\nUncle Albert:\n\nOh, please stay. Look, I have a splendid tea all ready for you.\n\n\nMary Poppins:\n\nAnd it's getting cold!\n\n\nUncle Albert:\n\nWell, I had hoped that maybe, that you would just, that-- splendid! Thank you very much! Keep\nyour feet back. Mind the bread and butter. Now, watch it, children.\n\n\nBert:\n\nI knew she could bring it off. And a proper tea it is, too.\n\n\nMary Poppins:\n\nNext thing, I suppose, you'll be wanting me to pour out. Oh, well. If I must, I must. If you'll just\nstop behaving like a pack of laughing hyenas! Two lumps, uncle Albert?\n\n\nUncle Albert:\n\nYes, please.\n\n\nMary Poppins:\n\nUh, Bert?\n\n\nBert:\n\nUh, no, no, thank you. No sugar for me.\n\n\nJane:\n\nI'm so glad you came. It wouldn't be any fun without you.\n\n\nMary Poppins:\n\nHere, and you may pour some milk for Michael and yourself.\n\n\nBert:\n\nNice weather we're having this time of year, don't you think?\n\n\nUncle Albert:\n\nOh, yeah. Uh, speaking of weather, the other day when it was so cold, a friend of mine went to\nbuy some long underwear, you know. The shopkeeper said to him, \"How long do you want it?\"\nand my friend said, \"Well, from about September to March.\"\n\n\nMary Poppins:\n\nJane! Control yourself! Children, will you please sit up properly at the table? Your tea, uncle\nAlbert.\n\n\nUncle Albert:\n\nOh, thank you, my dear. I'm having such a good time. I wish that you could all stay up here all\nthe time.\n\n\nMichael:\n\nWe'll jolly well have to. There's no way to get down.\n\n\nUncle Albert:\n\nOh, no, there is a way. Frankly I, I don't like to mention it, because you have to think of\nsomething sad.\n\n\nMary Poppins:\n\nThen do get on with it, please!\n\n\nUncle Albert:\n\nLet me see. I've got the very thing. Yesterday when the lady next door answered the bell, there\nwas a man there. And the man said to the lady, \"I'm terribly sorry. I just ran over your cat.\"\n\n\nJane:\n\nOh, that's sad.\n\n\nMichael:\n\nThe poor cat.\n\n\nUncle Albert:\n\nAnd then the man said, \"I'd like to replace your cat.\" and the lady said, \"That's all right with me,\nbut how are you at catching mice?\"\n\nWell, you know I started out sad. I, I try, really I do. But, but everything ends up so hilarious, I\ncan't-- I can't help--\n\nMary Poppins:\n\nThat will be quite enough of that! It's time to go home.\n\n\nJane:\n\nOh, that is sad.\n\n\nMichael:\n\nOh, no!\n\n\nUncle Albert:\n\nOh, that's sad. That's the saddest thing I ever heard.\n\n\nMary Poppins:\n\nCome along, children. Spit spot!\n\n\nUncle Albert:\n\nMust you really go? You know, people come to see me all the time, you know. And, and we have\nsuch a lovely time, and then they have to go home. And, and I'm very, very sad about the whole\nthing.\n\n\nMichael:\n\nDon't worry. We'll come back soon.\n\n\nJane:\n\nWe had a lovely time.\n\n\nMary Poppins:\n\nUh, keep an eye on uncle Albert, will you, Bert?\n\n\nBert:\n\nI'll sit with him a while.\n\n\nMary Poppins:\n\nThank you. Come on.\n\n\nBert:\n\nUncle Albert, I got a jolly joke I saved for just such an occasion. Would you like to hear it?\n\n\nUncle Albert:\n\nI'd be so grateful.\n\n\nBert:\n\nRighto. Well, it's about me granddad, see? And one night, he had a nightmare, he did. So\nscared that he chewed his pillow to bits. Yes. To bits.\n\n\nUncle Albert:\n\nYes.\n\n\nBert:\n\nNext morning I says, \"How do you feel, granddad?\"\n\n\nUncle Albert:\n\nYes.\n\n\nBert:\n\nHe says, \"Oh, not bad. A little down in the mouth!\"\n\nYeah, I always say there's nothing like a good joke.\n\n\nUncle Albert:\n\nNo. And that was nothing like a good joke! That-\n\n\nAdmiral Boom:\n\nBit late tonight, aren't you, Banks? I say, Banks! Is anything the matter, Banks? Banks!\n\n\nJane:\n\nOh, Father, we're so glad you're home!\n\n\nMichael:\n\nWant to hear a joke?\n\n\nJane:\n\nWe had the most wonderful afternoon with Mary Poppins.\n\n\nMichael:\n\nSpeaking of afternoons, the joke goes like this. I know a man with a wooden leg named Smith.\n\n\nMr. Banks:\n\nSmith? We don't know anyone called Smith.\n\n\nMichael:\n\nAnd there was a second chap, and the second chap says, \"What's the name of his other leg?\"\n\n\nJane:\n\nAnd we had a lovely tea party on the ceiling!\n\n\nMr. Banks:\n\nOh, children, please be quiet.\n\n\nJane:\n\nMary Poppins says if we're good, she'll take us there again.\n\n\nMr. Banks:\n\nOh. Oh, Mary Poppins said that, did she? Will you please return to your room. Mary Poppins,\nwill you be kind enough to come with me?\n\n\nMary Poppins:\n\nAs you wish.\n\n\nMr. Banks:\n\nMary Poppins, I very much regret what I must say to you.\n\n\nMrs. Banks:\n\nGood evening, George. Is anything the matter?\n\n\nMr. Banks:\n\nI'm afraid there is.\n\n\nMrs. Banks:\n\nI, I'd love to stay, but I have to dress for my rally in Hampstead.\n\n\nMr. Banks:\n\nWinifred, it is my wish that you be present!\n\n\nMrs. Banks:\n\nOh, yes, George, of course.\n\n\nMr. Banks:\n\nMary Poppins, I must confess I am extremely disappointed in you.\n\n\nEllen:\n\nShe's for it now. I've heard the master do this speech before.\n\n\nMr. Banks:\n\nI don't deny that I am partially responsible for allowing the children to spend their days on\nworthless frivolity to the exclusion of all else! But it is high time they learned the seriousness of\nlife!\n\n\nMrs. Banks:\n\nBut, George, they're only children.\n\n\nMr. Banks:\n\nPrecisely. And in the light of what has happened--\n\n\nMrs. Banks:\n\nGeorge, are you certain you know what you're doing?\n\n\nMr. Banks:\n\nI believe I do, Winifred.\n\n\tA British bank is run with precision\n\n\tA British home requires nothing less\n\n\tTradition, discipline and rules\n\n\tMust be the tools\n\n\tWithout them disorder, chaos, moral disintegration\n\n\tIn short you have a ghastly mess\n\n\nMary Poppins:\n\nI quite agree.\n\n\nMr. Banks:\n\n\tThe children must be molded shaped and taught\n\n\tThat life's a looming battle to be faced and fought\n\nIn short, I am disturbed to hear my children talking about popping in and out of chalk pavement\npictures, consorting with racehorse persons, fox hunting. Yes, well I don't mind that quite so\nmuch. At any rate, it's traditional. But tea parties on the ceiling? I ask you. Having tea parties on\nthe ceiling and highly-questionable outings of every other kind!\n\n\tIf they must go on outings\n\n\tThese outings ought to be\n\nFraught with purpose yes, and practicality\n\nThese silly words like\n\n\tSuperca-- super-- superca-\n\n\nMary Poppins:\n\nSupercalifragilistic- expialidocious.\n\n\nMr. Banks:\n\nYes, well done. You said it.\n\n\tAnd popping through pictures\n\n\tHave little use, fulfill no basic need\n\n\tThey've got to learn the honest truth\n\n\tDespite their youth\n\n\tThey must learn\n\n\nMary Poppins:\n\n\tAbout the life you lead\n\n\nMr. Banks:\n\nExactly.\n\n\nMary Poppins:\n\n\tThey must feel the thrill of totting up a balanced book\n\n\tA thousand ciphers neatly in a row\n\n\nMr. Banks:\n\nQuite right.\n\n\nMary Poppins:\n\n\tWhen gazing at a graph that shows the profits up\n\n\tTheir little cup of joy should overflow\n\n\nMr. Banks:\n\nPrecisely!\n\n\nMary Poppins:\n\n\tIt's time they learned to walk in your footsteps\n\n\nMr. Banks:\n\nMy footsteps.\n\n\nMary Poppins:\n\n\tTo tread your straight and narrow path with pride\n\n\nMr. Banks:\n\nWith pride.\n\n\nMary Poppins:\n\n\tTomorrow just as you suggest\n\n\tPressed and dressed\n\n\tJane and Michael will be at your side\n\n\nMr. Banks:\n\nSplendid! You hit the nail right on the-- at my side? Where are we going?\n\n\nMary Poppins:\n\nTo the bank, of course, exactly as you proposed.\n\n\nMr. Banks:\n\nI proposed?\n\n\nMary Poppins:\n\nOf course. Now, if you'll excuse me. Tomorrow's an important day for the children. I shall see\nthey have a proper night's sleep. Good night.\n\n\nMr. Banks:\n\nWinifred, did I say that I was going to take the children to the bank?\n\n\nMrs. Banks:\n\nIt certainly sounded that way, dear.\n\n\nMr. Banks:\n\nOh. And why not? A capital idea! Just the medicine they need for all this slipshod, sugary female\nthinking they get around here all day long. Quite right. Good idea. Quite right. Good idea. Quite\nright.\n\n\nJane:\n\nMary Poppins, we won't let you go!\n\n\nMary Poppins:\n\nGo? What on earth are you talking about?\n\n\nMichael:\n\nDidn't you get sacked?\n\n\nMary Poppins:\n\nSacked? Certainly not! I am never sacked!\n\n\nJane:\n\nOh, Mary Poppins!\n\n\nJane & Michael:\n\nHurrah, hurray, hurray, hurray, hurray, hurray--\n\n\nMary Poppins:\n\nNeither am I a Maypole. Kindly stop spinning about me.\n\n\nMichael:\n\nBut?\n\n\nMary Poppins:\n\nGoats butt, birds fly, and children who are going on an outing with their father must get some\nsleep. Come along, please.\n\n\nJane:\n\nAn outing with father?\n\n\nMary Poppins:\n\nYes.\n\n\nMichael:\n\nI don't believe it.\n\n\nJane:\n\nHe's never taken us on an outing before.\n\n\nMichael:\n\nHe's never taken us anywhere.\n\n\nJane:\n\nHowever did you manage it?\n\n\nMary Poppins:\n\nManage what?\n\n\nJane:\n\nYou must've put the idea in his head somehow.\n\n\nMary Poppins:\n\nWhat an impertinent thing to say! Me putting ideas into people's heads? Really!\n\n\nJane:\n\nWhere's he taking us?\n\n\nMary Poppins:\n\nTo the bank.\n\n\nJane:\n\nOh, Michael, the city! And we'll see all the sights, and father can point them out to us.\n\n\nMary Poppins:\n\nWell, most things he can. But sometimes a person we love through no fault of his own, can't see\npast the end of his nose.\n\n\nJane:\n\nPast the end of his nose?\n\n\nMary Poppins:\n\nYes. Sometimes a little thing can be quite important.\n\n\nMichael:\n\nOh, look! The cathedral.\n\n\nJane:\n\nFather passes that every day. He sees that.\n\n\nMary Poppins:\n\n\tEarly each day to the steps of St. Paul's\n\n\tThe little old bird woman comes\n\n\tIn her own special way to the people she calls\n\n\tCome buy my bags full of crumbs\n\n\tCome feed the little birds show them you care\n\n\tAnd you'll be glad if you do\n\n\tTheir young ones are hungry\n\n\tTheir nests are so bare\n\n\tAll it takes is tuppence from you\n\n\tFeed the birds tuppence a bag\n\n\tTuppence, tuppence tuppence a bag\n\n\tFeed the birds that's what she cries\n\n\tWhile overhead her birds fill the skies\n\n\tAll around the cathedral\n\n\tThe saints and apostles\n\n\tLook down as she sells her wares\n\n\tAlthough you can't see it\n\n\tYou know they are smiling\n\n\tEach time someone shows that he cares\n\n\tThough her words are simple and few\n\n\tListen, listen she's calling to you\n\n\tFeed the birds tuppence a bag\n\n\tTuppence, tuppence tuppence a bag\n\n\tThough her words are simple and few\n\n\tListen, listen she's calling to you\n\n\tFeed the birds tuppence a bag\n\n\tTuppence, tuppence tuppence a bag\n\n\nMr. Banks:\n\nNow remember that a bank is a quiet and decorous place, so we must be on our best behaviour.\n\n\nMichael:\n\nBut I thought it was your bank.\n\n\nMr. Banks:\n\nYes, well, I'm one of the younger officers, so in a sense it is, sort of.\n\n\nJane:\n\nMichael, look! It's her!\n\n\nMr. Banks:\n\nWho? It's who?\n\n\nJane:\n\nThe bird woman. Just where Mary Poppins said she would be. You do see her, don't you,\nFather?\n\n\nMr. Banks:\n\nWell, of course I can see her. Do you think I can't see past the end of my nose?\n\n\nJane:\n\nListen, Father, she's saying it.\n\n\nBirdwoman:\n\nFeed the birds. Tuppence a bag.\n\n\nMr. Banks:\n\nWell, of course she's saying it. What else would she be saying?\n\n\nJane:\n\nPlease may we feed the birds?\n\n\nMr. Banks:\n\nWhatever for?\n\n\nMichael:\n\nI have tuppence from my money box.\n\n\nJane:\n\nJust this once, please?\n\n\nMr. Banks:\n\nWaste your money on a lot of ragamuffin birds? Certainly not.\n\n\nJane:\n\nBut Mary Poppins-\n\n\nMr. Banks:\n\nI am not interested in what Mary Poppins says. Nor do I wish to keep hearing her name for the\nremainder of the day. Now come along!\n\n\nMichael:\n\nBut it's my tuppence!\n\n\nMr. Banks:\n\nMichael, I will not permit you to throw your money away! When we get to the bank, I shall show\nyou what may be done with your tuppence. And I think you'll find it extremely interesting.\n\n\nMr. Dawes:\n\nHello, Banks. What's all this about?\n\n\nMr. Banks:\n\nThese are my children, Mr. Dawes.\n\n\nMr. Dawes:\n\nWell, so I assumed. But why are they here?\n\n\nMr. Banks:\n\nThey wish to open an account, sir.\n\n\nMr. Dawes:\n\nOh, indeed?\n\n\nMr. Banks:\n\nYes.\n\n\nMr. Dawes:\n\nAnd just how much money do you have, young man?\n\n\nMichael:\n\nTuppence. But I want it to feed the birds.\n\n\nMr. Banks:\n\nShh, shh, shh, shh, shh.\n\n\nMr. Dawes (Snr):\n\nTuppence? Tuppence? Precisely how I started.\n\n\nMr. Banks:\n\nThat's the chairman of the bank, the elder Mr. Dawes. A giant in the world of finance.\n\n\nMichael:\n\nA giant?\n\n\nMr. Banks:\n\nShh, shh, shh.\n\n\nMr. Dawes:\n\nUh, Father, these are Banks's children. They want to open an account.\n\n\nMr. Dawes (Snr):\n\nOh, they do, do they, boy? Excellent. Excellent. We can al-always use, al-always use more\nmoney to, to put to work for the bank, can't we, boy?\n\nSo, you have tuppence? May I be permitted to see it?\n\n\nMichael:\n\nNo. I want it to feed the birds!\n\n\nMr. Dawes (Snr):\n\nFiddlesticks, boy! Feed the birds and what have you got? Fat birds!\n\n\tBut if you invest your tuppence\n\n\tWisely in the bank\n\n\tSafe and sound\n\n\tSoon that tuppence safely invested in the bank\n\n\tWill compound\n\n\tAnd you'll achieve that sense of conquest\n\n\tAs your affluence expands\n\n\tIn the hands of the directors\n\n\tWho invest as propriety demands\n\n\nMr. Banks:\n\nMay I, sir?\n\n\nMr. Dawes (Snr):\n\nCarry on, Banks.\n\n\nMr. Banks:\n\nYou see, Michael, you'll be part of...\n\n\tRailways through Africa\n\n\nMr. Dawes (Snr):\n\nExactly!\n\n\nMr. Banks:\n\n\tDams across the Nile\n\n\nMr. Dawes (Snr):\n\nThe ships. Tell them about the ships.\n\n\nMr. Banks:\n\n\tFleets of ocean Greyhounds\n\n\nMr. Dawes (Snr):\n\nMore, tell them more!\n\n\nMr. Banks:\n\n\tMajestic self-amortizing canals\n\n\nMr. Dawes (Snr):\n\nOh, it fires the imagination!\n\n\nMr. Banks:\n\n\tPlantations of ripening tea all from\n\n\nBank Directors:\n\n\tTuppence prudently thriftily, frugally\n\n\tInvested in the\n\n\nMr. Dawes (Snr):\n\n\tTo be specific\n\n\nBank Directors:\n\n\tIn the Dawes, Tomes Mousley, Grubbs, Fidelity Fiduciary Bank\n\n\nMr. Dawes (Snr):\n\nVery well, my boy, give me the money.\n\n\nMichael:\n\nNo, I won't! I want it to feed the birds.\n\n\nMr. Dawes (Snr):\n\nBanks!\n\n\nMr. Banks:\n\nYes, sir. Now, Michael.\n\n\tWhen you deposit tuppence in a bank account\n\n\nMr. Dawes (Snr):\n\nGo on!\n\n\nMr. Banks:\n\n\tSoon you'll see\n\n\nMr. Dawes (Snr):\n\nTell him more!\n\n\nMr. Banks:\n\n\tThat it blooms into credit of a generous amount semi-annually\n\n\nBank Directors:\n\n\tAnd you'll achieve that sense of stature\n\n\tAs your influence expands\n\n\tTo the high financial strata\n\n\tThat established credit now commands\n\n\nMr. Dawes (Snr) & Directors::\n\nYou can purchase first and second trust deeds. Think of the foreclosures! Bonds, chattels,\ndividends, shares. Bankruptcies. Debtor sales. Opportunities. All manner of private enterprise.\nShipyards. The mercantile. Collieries. Tanneries. Corporations. Amalgamations.\n\nBanks!\n\n\nMr. Dawes (Snr):\n\nWhile stand the banks of England, England stands. Oh, oh, oh, oh! When fall the banks of\nEngland, England falls!\n\n\nMr. Banks:\n\nYou see, Michael? All for the lack of...\n\n\nBank Directors:\n\n\tTuppence patiently, cautiously trustingly invested in the\n\n\tTo be specific in the Dawes, Tomes, Mousley, Grubbs, Fidelity Fiduciary Bank\n\n\t\n\nMr. Dawes (Snr):\n\nWelcome to our joyful family of investors.\n\n\nMichael:\n\nGive it back! Gimme back my money!\n\n\nMr. Banks:\n\nMichael, behave.\n\n\nMr. Dawes (Snr):\n\nBanks!\n\n\nMichael:\n\nGive it to me!\n\n\nMr. Banks:\n\nMichael, behave.\n\n\nMichael:\n\nJane! Jane! Gimme back my money!\n\n\nMr. Banks:\n\nJane! Michael! Michael! Michael!\n\n\nMichael:\n\nGimme back my money!\n\n\nMr. Banks:\n\nMichael!\n\n\nClient 1:\n\nThere's something wrong. The bank won't give someone their money!\n\n\nClient 2:\n\nWell, I'm going to get mine! Come along, young man! I want every penny!\n\n\nClient 3:\n\nAnd mine, too!\n\n\nClient 4:\n\nAnd give me mine, too!\n\n\nBanker:\n\nStop all payments. Stop all payments.\n\n\nMr. Banks:\n\nMichael! Jane!\n\n\nMichael:\n\nGive me my money!\n\n\nMr. Banks:\n\nChildren, come back here.\n\n\nMr. Dawes (Snr):\n\nStop those children.\n\n\nMr. Banks:\n\nJane! Michael!\n\n\nMicheal:\n\nGimme my money back! I want my money! Come on.\n\n\nDirector:\n\nStop those children! Stop those children!\n\n\nOld Woman:\n\nCome with me, my dears. Granny'll hide you!\n\n\nBert:\n\nHere, here, half a mo.\n\n\nMichael:\n\nLeave her alone! Leave my sister alone!\n\n\nBert:\n\nEasy, now. Your old friend ain't gonna hurt ya.\n\n\nJane:\n\nBert, it's you!\n\n\nBert:\n\nIn the flesh, and at your service.\n\n\nMichael:\n\nYou're filthy!\n\n\nBert:\n\nOh, perhaps a smudge or two. It so happens that today I'm a chimney sweep.\n\n\nJane:\n\nOh, Bert, we're so frightened.\n\n\nBert:\n\nNow, now, don't take on so. Bert'll take care of you like I was your own father. Now, who's after\nyou?\n\n\nJane:\n\nFather is.\n\n\nBert:\n\nWhat?\n\n\nMichael:\n\nHe brought us to see his bank.\n\n\nBert:\n\nI don't know what we did, but it must've been something dreadful.\n\n\nMichael:\n\nHe sent the police after us, and the army and everything.\n\n\nJane:\n\nMichael, don't exaggerate.\n\n\nBert:\n\nWell, now, there must be some mistake. Your dad's a fine gentleman and he loves ya!\n\n\nJane:\n\nI don't think so. You should've seen the look on his face.\n\n\nMichael:\n\nHe doesn't like us at all.\n\n\nBert:\n\nWell, now that don't seem likely, does it?\n\n\nJane:\n\nIt's true.\n\n\nBert:\n\nLet's sit down. You know, begging your pardon, but the one my heart goes out to is your father.\nThere he is in that cold, heartless bank day after day, hemmed in by mounds of cold, heartless\nmoney. I don't like to see any living thing caged up.\n\n\nJane:\n\nFather in a cage?\n\n\nBert:\n\nThey makes cages in all sizes and shapes, you know. Bank-shaped some of 'em, carpets and\nall.\n\n\nJane:\n\nFather's not in trouble. We are.\n\n\nBert:\n\nOh, sure about that, are you? Look at it this way. You've got your mother to look after you. And\nMary Poppins, and Constable Jones and me. Who looks after your father? Tell me that. When\nsomething terrible happens, what does he do? Fends for himself, he does. Who does he tell\nabout it? No one! Don't blab his troubles at home. He just pushes on at his job, uncomplaining\nand alone and silent.\n\n\nMichael:\n\nHe's not very silent!\n\n\nJane:\n\nMichael, be quiet. Bert, do you think Father really needs our help?\n\n\nBert:\n\nWell, not my place to say. I only observe that a father can always do with a bit of help. Come on,\nI'll take you home.\n\n\tChim chiminy, chim chiminy chim chim cheree\n\n\tA sweep is as lucky as lucky can be\n\n\tChim chiminy, chim chiminy chim chim cheroo\n\n\tGood luck will rub off when I shakes hands with you\n\n\tOr blow me a kiss and that's lucky too\n\n\tNow as the ladder of life has been strung\n\n\tYou might think a sweep's on the bottommost rung\n\n\tThough I spends me time in the ashes and smoke\n\n\tIn this whole wide world there's no happier bloke\n\n\tChim chiminy, chim chiminy chim chim cheree\n\n\tA sweep is as lucky as lucky can be\n\n\tChim chiminy, chim chiminy chim chim cheroo\n\n\tGood luck will rub off when I shakes hands with you\n\n\nBert & Children:\n\n\tChim chiminy, chim chiminy chim chim cheree\n\n\tA sweep is as lucky as lucky can be\n\n\tChim chiminy, chim chiminy chim chim cheroo\n\n\tGood luck will rub off when I shakes hands with you\n\n\nMrs. Banks:\n\nOh, Ellen, see who that is, and send them away. I'm dreadfully late!\n\n\nEllen:\n\nYes, ma'am.\n\n\nBert:\n\nWell, I'll be gettin' along now.\n\n\nJane:\n\nOh, please stay 'til father comes home. He'll feel much better if you shake hands with him.\n\n\nEllen:\n\nIt's the children, ma'am.\n\n\nMrs. Banks:\n\nOh, I thought they were with their father. You haven't been running off again, have you? You\nknow how terribly it upsets me.\n\n\nBert:\n\nOh, they haven't exactly been running away, ma'am. They have had bit of a fright, though. Need\nsomeone to look after 'em.\n\n\nMrs. Banks:\n\nOh, of course! Mary Poppins will. Oh, no, it's her day off! Ellen, I wonder if you would--\n\n\nEllen:\n\nNo, ma'am. I haven't done me brasses yet.\n\n\nMrs. Banks:\n\nWell, will you ask Mrs. Brill?\n\n\nEllen:\n\nNot for a hundred quid, ma'am. This here is baking day, and you know how cook is!\n\n\nMrs. Banks:\n\nWhat about you, sir? You've been so kind in looking after the children.\n\n\nBert:\n\nWh-- uh, me, ma'am? W-well, well, I-I-I have to be moving along. The Lord Mayor's got a\nstopped-up chimney.\n\n\nMrs. Banks:\n\nChimney. How clever of you to know. Our drawing room chimney's in the most ghastly condition.\nSmokes incessantly.\n\n\nBert:\n\nW-w--\n\n\nMrs. Banks:\n\nThank you so much!\n\n\nBert:\n\nBut--\n\n\nMrs. Banks:\n\nBesides, it'll amuse the children.\n\n\nBert:\n\nThe Lord Mayor's gonna be terrible put out.\n\n\nMrs. Banks:\n\nOh, thank you so much. I do appreciate it. I must hurry. Our gallant ladies in prison are waiting\nfor me to lead them in song! Good-bye, my darlings. See you soon.\n\n\nBert:\n\n\tI choose me bristles with pride, yes, I do\n\n\tA broom for the shaft\n\n\tAnd a brush for the flue\n\n\nJane:\n\nOh, it's awfully dark and gloomy up there.\n\n\nBert:\n\nThere now. You see how wrong people can be? That there is what you might call a doorway to\na place of enchantment.\n\n\tUp where the smoke is all billowed and curled\n\n\t'Tween pavement and stars\n\n\tIs the chimney sweep world\n\n\tWhen there's hardly no day\n\n\tNor hardly no night\n\n\tThere's things half in shadow\n\n\tAnd halfway in light\n\n\tOn the rooftops of London\n\n\tCoo, what a sight.\n\n\nJane:\n\nI do wish we could go up there.\n\n\nMichael:\n\nSo do I! I like chimneys.\n\n\nBert:\n\nOh, rightly so! A chimney is a wondrous thing. She's built tall right up there on the roof. When\nthe wind is just right, it blows across her top, then draws the smoke right up the flue. Here. Feel\nthe pull on the end of that brush. It's like I got a whale on the end of the line, ain't it? Michael,\n\n\nMary Poppins:\n\nBe careful. You never know what may happen around a fireplace. Oh, bother!\n\n\nJane:\n\nMichael! Michael, come back down here. Michael! Michael, where are you?\n\n\nBert:\n\nWell, that's a bit awkward. I must say!\n\n\nMary Poppins:\n\nBert, I'll thank you to stop putting ideas in their heads! There goes the other one.\n\n\nBert:\n\nShall I go after 'em?\n\n\nMary Poppins:\n\nWell, we can't have them gallivanting up there like kangaroos, can we?\n\n\nJane:\n\nMichael, don't be frightened. Everything's going--\n\n\nMary Poppins:\n\nWill you put your things on at once? Hurry up, please. Spit spot!\n\n\nBert:\n\nHere you are! I thought you'd left us.\n\n\nJane:\n\nWe didn't mean to.\n\n\nBert:\n\nWell, no harm done. The truth is, this is what you might call a fortuitous circumstance. Look\nthere. A trackless jungle just waiting to be explored. Why not, Mary Poppins?\n\n\nJane:\n\nOh, please, Mary Poppins?\n\n\nMichael:\n\nPlease!\n\n\nMary Poppins:\n\nOh, well. If we must, we must. Fall in. Look lively, look lively. Jump to it! Jump to it! Get in line.\nAttention! A-show arms! A-right turn! Quick march!\n\n\nMichael:\n\nHello there!\n\n\nBert:\n\nIt's just good, clean soot, Michael.\n\n\nBert:\n\nAs far as we go, right?\n\n\nMary Poppins:\n\nNot at all.\n\n\nBert:\n\nWhat did I tell ya? There's the whole world at your feet. And who gets to see it, but the birds, the\nstars and the chimney sweeps?\n\n\nMary Poppins:\n\nQuite nice, but we should all get in out of the night air. Follow me, please.\n\n\tChim chiminy, chim chiminy chim\n\n\tChim cheree when you're with a sweep you're in glad company\n\n\nBert:\n\n\tNowhere is there a more happier crew\n\n\nBert & Mary Poppins:\n\n\tThan them what sings chim chim cheree, chim cheroo\n\n\tChim chiminy chim chim cheree chim cheroo\n\n\nChimney Sweeps:\n\nCheroo! Cheroo! Cheroo! Cheroo! Cheroo! Cheroo!\n\n\nBert:\n\nIt's all me pals!\n\n\tStep in time!\n\n\tStep in time!\n\n\nBert & Chimney Sweeps:\n\n\tStep in time!\n\n\tStep in time!\n\n\tStep in time!\n\n\tStep in time!\n\n\tStep in time, step in time\n\n\tCome on, mateys, step in time\n\n\tStep in time\n\n\tStep in time,\n\n\tStep in time\n\n\tStep in time,\n\n\tStep in time\n\n\tNever need a reason never need a rhyme\n\n\tWe step in time, we step in time\n\nKick your knees up!\n\n\tKick your knees up step in time\n\n\tKick your knees up, step in time\n\n\tNever need a reason never need a rhyme\n\n\tKick your knees up step in time\n\nRound the chimney!\n\n\tRound the chimney step in time\n\n\tRound the chimney, step in time\n\n\tNever need a reason never need a rhyme\n\n\tRound the chimney we step in time\n\nClap like a birdie.\n\n\tClap like a birdie step in time\n\n\tClap like a birdie, step in time\n\n\tNever need a reason never need a rhyme\n\n\tClap like a birdie in time\n\nUp on the railing.\n\n\tUp on the railing step in time\n\n\tUp on the railing, step in time\n\n\tNever need a reason never need a rhyme up\n\n\tOn the railing step in time\n\nOver the rooftops!\n\n\tOver the rooftops step in time\n\n\tOver the rooftops, step in time\n\n\tNever need a reason never need a rhyme\n\n\tStep it time,\n\n\tOver the rooftops\n\n\tOver the rooftops\n\nLink your elbows!\n\n\tLink your elbows, step in time\n\n\tLink your elbows, step in time\n\n\tLink your elbows,\n\n\tLink your elbows,\n\n\tLink your elbows\n\n\tStep in time,\n\n\tStep in time\n\n\tStep in time,\n\n\tStep in time\n\n\tNever need a reason never need a rhyme\n\n\tWhen you step in time you step in time\n\nMary Poppins, step in time! There you go, Mary Poppins! Lucky old Bert! Come on, Mary\nPoppins! Here we go, mate! Here we go! Make room for her! Go! Ain't she marvelous? Ain't she\nbeautiful? Lovely. Tell your mum! Hello, hello, hello! More! More! Mary, do it again! Come on,\nMary, do it again. Here we go.\n\n\nAdmiral Boom:\n\nWe're being attacked by Hottentots!\n\n\nMr. Binnacle:\n\nAye, aye, sir.\n\n\nAdmiral Boom:\n\nCheeky devils! Give 'em what for! Empty the shot lockers!\n\n\nMr. Binnacle:\n\nAye, aye, sir!\n\n\nAdmiral Boom:\n\nMove along, Mr. Binnacle. Handsomely now. Teach the beggars a lesson.\n\n\nMr. Binnacle:\n\nGun ready, sir.\n\n\nAdmiral Boom:\n\nStand by. Fire!\n\nFire! Well hit, sir! Very well hit!\n\n\nMrs. Brill:\n\nAah! They're at it again!\n\n\nChimney Sweeps:\n\n\tThey're at it again!\n\n\tStep it time,\n\n\tAt it again\n\n\tStep in time\n\n\tThey're at it again\n\n\tStep it time ow!\n\n\tOw,\n\n\tStep in time\n\n\tOw,\n\n\tStep in time\n\n\tNever need a reason never need a rhyme\n\n\tWhoa!\n\n\tStep in time\n\n\nMrs. Banks:\n\nOh, Ellen, when you have a second.\n\n\nChimney Sweeps:\n\n\tVotes for women, step in time\n\n\tVotes for women, step in time\n\n\nMrs. Banks:\n\nOh, no, really, not at the moment.\n\n\nChimney Sweeps:\n\n\tVotes for women\n\n\tVotes for women!\n\n\nEllen:\n\nIt's the master!\n\n\nChimney Sweeps:\n\n\tIt's the master,\n\n\tStep in time\n\n\tIt's the master, step in time\n\n\nMr. Banks:\n\nWhat's all this?\n\n\nChimney Sweeps:\n\n\tWhat's all this\n\n\tWhat's all this?\n\n\tWhat's all this\n\n\tWhat's all this\n\n\tWhat's all this\n\n\tWhat's all this\n\n\tLink your elbows, step in time\n\n\tWhat's all this?\n\n\tKick your knees up what's all this?\n\n\tStep in time\n\n\tKick your knees up\n\n\tKick your knees up Bert.\n\n\tKick your knees up\n\n\tKick your knees up in time\n\n\nGood luck, guv'nor. Lovely time! Had an elegant time, guv'nor.\n\n\nMichael:\n\nGood luck, guv'nor.\n\n\nJane:\n\nOh, father, every one of those sweeps shook your hand. You're going to be the luckiest person\nin the world!\n\n\nMary Poppins:\n\nCome along, children. Spit spot.\n\n\nMr. Banks:\n\nJust a moment, Mary Poppins. What is the meaning of this outrage?\n\n\nMary Poppins:\n\nI beg your pardon?\n\n\nMr. Banks:\n\nWill you be good enough to explain all this?\n\n\nMary Poppins:\n\nFirst of all, I would like to make one thing quite clear.\n\n\nMr. Banks:\n\nYes?\n\n\nMary Poppins:\n\nI never explain anything.\n\n\nMr. Banks:\n\nYes. Banks here. Mr. Dawes! I'm most dreadfully sorry, sir, about what happened at the bank\ntoday. I can assure you that-- tonight, sir?\n\n\nMr. Dawes:\n\nYes, Banks. We'll expect you at 9:00 precisely.\n\n\nMr. Dawes (Snr):\n\nWithout fail.\n\n\nMr. Dawes:\n\nWithout fail.\n\n\nWhy, yes, Banks. It's extremely serious.\n\n\nMr. Dawes (Snr):\n\nWe regret this course of action.\n\n\nMr. Dawes:\n\nWe regret this course of action.\n\n\nMr. Dawes (Snr):\n\nAfter all, you have been with us a good many years.\n\n\nMr. Dawes:\n\nAfter all, you have been with us a good many years.\n\n\nMr. Dawes (Snr):\n\nAs was your father before you.\n\n\nMr. Dawes:\n\nAs was your father before you.\n\n\nMr. Banks:\n\nYes, Mr. Dawes. I shall be there at 9:00.\n\n\tA man has dreams of walking with giants.\n\n\tTo carve his niche in the edifice of time.\n\n\tBefore the mortar of his zeal\n\n\tHas a chance to congeal\n\n\tThe cup is dashed from his lips!\n\n\tThe flame is snuffed a-borning.\n\n\tHe's brought to wrack and ruin in his prime.\n\n\nBert:\n\nLife is a rum go, guv'nor, and that's the truth.\n\n\nMr. Banks:\n\nYou know what I think? It's that woman Mary Poppins. From the moment she stepped into this\nhouse, things began to happen to me!\n\n\nBert:\n\nMary Poppins?\n\n\nMr. Banks:\n\nYes, yes, of course.\n\n\tMy world was calm, well-ordered, exemplary.\n\n\tThen came this person with chaos in her wake\n\n\tAnd now my life's ambitions go\n\n\tWith one fell blow\n\n\tIt's quite a bitter pill to take.\n\nIt's that Poppins woman! She did it!\n\n\nBert:\n\nI know the very person you mean. Mary Poppins. She's the one what sings...\n\n\tA spoonful of sugar that is all it takes\n\n\tIt changes bread and water into tea and cakes\n\n\nMr. Banks:\n\nYou see? That's exactly what I mean! Changing bread and water into tea and cakes!\n\n\nBert:\n\nIndeed!\n\n\nMr. Banks:\n\nNo wonder everything's higgledy-piggledy here.\n\n\nBert:\n\n\tA spoonful of sugar goes a long, long way\n\n\tHave yourself a healthy helpin' everyday\n\nAn healthy helpin' of trouble, if you ask me.\n\n\nMr. Banks:\n\nDo you know what she did? I realize it now. She tricked me into taking Jane and Michael to the\nbank. That's how all the trouble started.\n\n\nBert:\n\nTricked you into taking the children on an outing?\n\n\nMr. Banks:\n\nYes.\n\n\nBert:\n\nOutrageous! A man with all the important things you have to do. Shameful! You're a man of high\nposition. Esteemed by your peers.\n\n\tAnd when your little tykes are cryin' you haven't time to dry their tears\n\n\tand see them grateful little faces smilin' up at you\n\n\tbecause their dad he always knows just what to do\n\n\nMr. Banks:\n\nWell I mean, look, I, I don't think I ca-- -\n\n\nBert:\n\nLike you say, guv'nor.\n\n\tYou've got to grind, grind, grind at that grindstone\n\n\tThough childhood slips like sand through a sieve\n\n\tAnd all too soon they've up and grown\n\n\tAnd then they've flown\n\n\tAnd it's too late for you to give\n\n\tJust that spoonful of sugar to help the medicine go down\n\n\tThe medicine go down\n\n\tMedicine go down\n\nWell, good-bye, guv'nor. Sorry to have troubled you.\n\n\nJane:\n\nFather? We're sorry about the tuppence. We didn't know it would cause you so much trouble.\n\n\nMichael:\n\nHere, father, you can have the tuppence.\n\n\nJane:\n\nWill that make everything all right?\n\n\nMr. Banks:\n\nThank you.\n\n\nMr. Dawes (Snr):\n\nCome in!\n\nTake your hat off, Banks.\n\n\nMr. Banks:\n\nGood evening, gentlemen.\n\n\nMr. Dawes (Snr):\n\nWell, get on with it. Go on.\n\n\nMr. Dawes:\n\nUh, yes, Father. In 1773, an official of this bank, unwisely loaned a large sum of money, to\nfinance a shipment of tea to the American colonies. Do you know what happened?\n\n\nMr. Banks:\n\nYes, sir. Yes, I think I do. Uh, uh, as the ship lay in Boston harbor, uh, a party of the colonists\ndressed as Red Indians, uh, boarded the vessel, behaved very rudely, and, and threw all the\ntea overboard. This made the tea unsuitable for drinking, even for Americans.\n\n\nMr. Dawes:\n\nPrecisely. The loan was defaulted. Panic ensued within these walls. There was a run on the\nbank!\n\n\nMr. Dawes (Snr):\n\nFrom that time to this, sir, there has not been a run on this bank until today! A run, sir, caused\nby the disgraceful conduct of your son. Do you deny it?\n\n\nMr. Banks:\n\nI do not deny it, sir. And I shall be only too glad to assume responsibility for my son.\n\n\nMr. Dawes (Snr):\n\nWhat are you waiting for? Get on with it!\n\n\nMr. Dawes:\n\nUh, y-yes, Father.\n\n\nDirector 1:\n\nNo, not that!\n\n\nDirector 2:\n\nSteady on.\n\n\nMr. Dawes (Snr):\n\nWell, do you have anything to say, Banks?\n\n\nMr. Banks:\n\nWell, sir, they do say that when there's nothing to say, all you can say I-\n\n\nMr. Dawes (Snr):\n\nConfound it, Banks! I said, do you have anything to say?\n\n\nMr. Banks:\n\nJust one word, sir.\n\n\nMr. Dawes (Snr):\n\nYes?\n\n\nMr. Banks:\n\nSupercalifragilistic- expialidocious.\n\n\nMr. Dawes (Snr):\n\nWhat?\n\n\nMr. Banks:\n\nSupercalifragilistic- expialidocious. Mary Poppins was right. It's extraordinary. It does make you\nfeel better!\n\n\nMr. Dawes (Snr):\n\nWhat are you talking about, man? There's no such word.\n\n\nMr. Banks:\n\nOh, yes. It is a word. A perfectly good word, actually. Do you know what there's no such thing\nas? It turns out, with due respect, when all is said and done, that there's no such thing as you!\n\n\nMr. Dawes (Snr):\n\nImpertinence, sir!\n\n\nMr. Banks:\n\nSpeaking of impertinence, would you like to hear a perfectly marvelous joke? A real snapper!\n\n\nMr. Dawes (Snr):\n\nJoke? Snapper?\n\n\nMr. Banks:\n\nYes. There are these two wonderful young people, Jane and Michael. And they meet one day\non the street, and Jane says to Michael, \"I know a man with a wooden leg named Smith.\" and\nMichael says, \"Really? What's the name of his other leg?\"\n\n\nMr. Dawes (Snr):\n\nThe man's gone mad. Call the guard!\n\n\nMr. Banks:\n\nSupercalifragilistic- expialidocious. I'm feeling better all the time!\n\n\nMr. Dawes:\n\nBanks, don't you dare strike my father!\n\n\nMr. Banks:\n\nThere's the tuppence. The wonderful, fateful, Supercalifragilistic- expialidocious tuppence.\nGuard it well. Good-bye!\n\n\nMr. Dawes (Snr):\n\nBanks, where are you going?\n\n\nMr. Banks:\n\nI don't know. I might pop through a chalk pavement picture, and go for an outing in the country.\nOr I might seize a horse off a merry-go-round, and win the derby! Or I might just fly a kite! Only\nPoppins would know!\n\n\nMr. Dawes (Snr):\n\nPoppins?\n\n\nMr. Banks:\n\nMy nanny. She's the one who sings that ridiculous song.\n\n\tA spoonful of sugar makes the medicine go down\n\n\tThe medicine go down\n\n\tThe medicine go down\n\n\tThe medicine--\n\n\nMr. Dawes:\n\nMad as a march hare.\n\n\nMr. Dawes (Snr):\n\nA wooden leg named Smith. A wooden leg named Smith. A wooden le--\n\n\nMr. Dawes:\n\nFather? Father! Father, come down! Daddy! Daddy, come back!\n\n\nAdmiral Boom:\n\nWind's come around, blowing dead on from the west!\n\n\nMichael:\n\nShe doesn't care what happens to us.\n\n\nJane:\n\nShe only promised to stay 'til the wind changed. Isn't that right, Mary Poppins?\n\n\nMary Poppins:\n\nWill you bring me my hat stand, please?\n\n\nJane:\n\nMary Poppins, don't you love us?\n\n\nMary Poppins:\n\nAnd what would happen to me, may I ask, if I loved all the children I said good-bye to?\n\n\nConstable:\n\nYes, sir, that's right. George W. Banks. 17 Cherry Tree Lane. About six foot one, I'd say, sir. Oh,\nyes, we rang up his bank first thing this morning. The only thing we discovered was, he'd been\ndischarged last night. No telling what he might do in a fit of despondency.\n\n\nEllen:\n\nWouldn't hurt to have them drag the river. There's a nice spot there by Suffolk bridge. Popular\nwith jumpers.\n\n\nMrs. Banks:\n\nReally, Ellen!\n\n\nConstable:\n\nHe seemed to have been a fine, stable gentleman, sir. No hanky-panky, if you know what I\nmean. Oh, regular habits, sir. Well, far as anyone knows.\n\n\nMr. Banks:\n\n\tThe medicine go down\n\n\tThe medicine go down\n\n\tJust a spoonful of sugar\n\n\nMrs. Brill:\n\nIt's him!\n\n\nMr. Banks:\n\n\tHelps the medicine go down\n\n\nEllen:\n\nOr something that sounds like him.\n\n\nConstable:\n\nMrs. Banks, could we have a little less noise on the premises? I can't make out what the\ninspector's sayin'.\n\n\nMr. Banks:\n\n\tIn the most delightful way\n\n\tJust a spoonful of sugar makes the medicine go down\n\n\nMrs. Banks:\n\nGeorge! Oh, George, you didn't jump in the river. How sensible of you.\n\n\nConstable:\n\nIt's all right, sir. He's been found! No, alive! Or so I presume. He's a-kissin' a-Mrs. Banks.\n\n\nMrs. Banks:\n\nI've been so worried. What happened at the bank?\n\n\nMr. Banks:\n\nI've been sacked, discharged, flung into the street.\n\n\tA spoonful of sugar makes the medicine go down\n\n\nEllen:\n\nGone off his crumpet. That's what he's done.\n\n\nMr. Banks:\n\n\tThe medicine go down\n\n\nEllen:\n\nDotty as you please.\n\n\nMrs. Banks:\n\nGeorge, what on earth were you doing in the cellar?\n\n\nMr. Banks:\n\nYou'll see in a moment. Where are the children? Jane? Michael?\n\n\nMrs. Banks:\n\nYour father's calling you.\n\n\nMichael:\n\nIt doesn't sound like Father.\n\n\nMr. Banks:\n\nJane? Michael?\n\n\nMary Poppins:\n\nRun along. Spit spot!\n\n\nMichael:\n\nYou won't go, Mary Poppins, will you?\n\n\nMary Poppins:\n\nSpit spot.\n\n\nMichael:\n\nHe mended it!\n\n\nJane:\n\nIt's wonderful! However did you manage it?\n\n\nMr. Banks:\n\n\tWith tuppence for paper and strings\n\n\tYou can have your own set of wings\n\n\tWith your feet on the ground\n\n\tYou're a bird in flight\n\n\tWith your fist holding tight\n\n\tTo the string of your kite\n\n\tOh, oh, oh\n\n\tLet's go fly a kite\n\n\tUp to the highest height\n\n\tLet's go fly a kite\n\n\tAnd send it soaring\n\n\tUp through the atmosphere\n\n\tUp where the air is clear\n\n\tOh, let's go fly a kite\n\n\nMrs. Banks:\n\nA proper kite needs a proper tail, don't you think?\n\n\nConstable:\n\nThat's what I said, sir. Go fly a kite! Oh, no, sir. No, I, I don't mean you personally.\n\n\nBanks Family:\n\n\tLet's go fly a kite\n\n\tUp to the highest height\n\n\tLet's go fly a kite and send it soaring\n\n\tUp through the atmosphere\n\n\tUp where the air is clear\n\n\tOh, let's go fly a kite\n\n\nBert:\n\n\tWhen you send it flying up there\n\n\tAll at once you're lighter than air\n\n\tYou can dance on the breeze\n\n\tOver houses and trees\n\n\tWith your fist holding tight\n\n\tTo the string of your kite\n\n\nKite Flyers:\n\n\tOh, oh, oh \n\n\nMichael:\n\nNow!\n\n\nKite Flyers:\n\n\tLet's go fly a kite\n\n\tUp to the highest height\n\n\tLet's go fly a kite and send it soaring\n\n\nMr. Dawes:\n\nOh, there you are, Banks. I want to congratulate you. Capital bit of humor. Wooden leg named\nSmith. Or Jones or whatever it was. Father died laughing.\n\n\nMr. Banks:\n\nOh, I'm so sorry, sir.\n\n\nMr. Dawes:\n\nOh, no, nonsense. Nothing to be sorry about. Never seen him happier in his life. He left an\nopening for a new partner. Congratulations.\n\n\nMr. Banks:\n\nThank you, sir. Thank you very much indeed, sir.\n\n\nKite Flyers:\n\n\tUp through the atmosphere\n\n\tUp where the air is clear\n\n\tOh, let's go fly a kite\n\n\nUmbrella:\n\nThat's gratitude for you. Didn't even say good-bye.\n\n\nMary Poppins:\n\nNo, they didn't.\n\n\nUmbrella:\n\nLook at them. You know, they think more of their father than they do of you.\n\n\nMary Poppins:\n\nThat's as it should be.\n\n\nUmbrella:\n\nWell, don't you care?\n\n\nMary Poppins:\n\nPractically perfect people never permit sentiment to muddle their thinking.\n\n\nUmbrella:\n\nIs that so? Well, I'll tell you one thing, Mary Poppins, you don't fool me a bit.\n\n\nMary Poppins:\n\nOh, really?\n\n\nUmbrella:\n\nYes, really. I know exactly how you feel about these children. And if you think I'm gonna keep\nmy mouth shut any longer, I--\n\n\nMary Poppins:\n\nThat will be quite enough of that, thank you.\n\n\nBert:\n\nGood-bye, Mary Poppins. Don't stay away too long.\n\n\n***** THE END *****\n\n\n\n\n\n\n\nMary Poppins\nWriters :   Bill Walsh  Don DaGradi\nGenres :   Family  Comedy  Musical  Fantasy  Drama  Animation\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In Edwardian London, 1910, Cockney one-man band Bert is entertaining a crowd when he senses a change in the wind. Afterwards, he directly addresses the audience and gives them a tour of Cherry Tree Lane, stopping outside the home of the Banks'. George Banks returns home from his job at the bank to learn from his wife Winifred that their hired nanny, Katie Nanna, has left their service after his children, Jane and Michael, ran away again. They are returned shortly after by the local constable, who reveals that the children were dragged away by their kite. The children ask their father to help build a better kite, but he dismisses them. Taking it upon himself to hire a nanny, George advertises for a stern, no-nonsense nanny. Jane and Michael present their own advertisement for a kinder, sweeter nanny, but George rips up the letter and throws the scraps in the fireplace, which magically float up and out into the air.\nThe next day, a queue of elderly, sour-faced nannies appear outside. However, a strong gust of wind blows the nannies away, and Jane and Michael witness a young nanny descend from the sky using her umbrella. Presenting herself to George, Mary Poppins calmly produces the children’s now restored advertisement and agrees with its requests, but promises the astonished banker she will be firm with his children. As George puzzles over the ad’s return, Mary hires herself and meets the children, baffling them with her behaviour and bottomless carpet bag. She helps the children to tidy their nursery through song, before heading out for a walk in the park.\nOutside, they meet Bert who now works as a screever, drawing chalk sketches on the pavement. Mary uses her magic to transport the group into one of the drawings, which becomes an animated countryside setting. While the children ride on a nearby carousel, Mary Poppins and Bert go on a leisurely stroll and are served tea by a quartet of penguin waiters. Mary enchants the carousel horses, which leave the carousel and rescue an Irish fox from a fox-hunt. They participate in a horse race which she wins. When asked to describe her victory, Mary announces the nonsense word “Supercalifragilisticexpialidocious”. On another outing, the four meet Mary's jovial Uncle Albert who has floated up in the air due to his uncontrollable laughter. They join him for a tea party on the ceiling, telling jokes.\nGeorge becomes increasingly bothered by the cheery atmosphere of his family and considers firing Mary Poppins. Mary inverts his attempt, instead convincing him to take the children to the bank for a day. George takes Jane and Michael to the bank, where they meet his employers, Mr. Dawes Sr. and his son. Dawes aggressively attempts to have Michael to invest his tuppence in the bank, snatching the money from him. Michael demands it back, causing other customers to misinterpret and all demand their money back, causing a bank run. Jane and Michael flee the bank, getting lost in the East End until they run into Bert, now a chimney sweep. He escorts them home, suggesting their father does not hate them but has his own troubles to deal with. The three and Mary venture onto the roof where they have a dance number with other chimney sweeps until George returns home. George receives a phone call from his employers, telling him to meet them later for disciplinary action. George speaks with Bert who tells him that while he needs to work, he should spend more time with his children before they grow up. Jane and Michael give their father Michael’s tuppence in the hope to make amends.\nGeorge walks through London to the bank, where he is given a humiliating cashiering and is dismissed. Looking to the tuppence for words, he raucously blurts out, \"Supercalifragilisticexpialidocious!\", tells one of Uncle Albert's jokes the children originally told him, and happily heads home. Dawes mulls over the joke, but finally \"gets\" it, and floats up into the air, laughing. The next day, the wind changes, meaning Mary must leave. A happier George is found at home, having fixed his children’s kite, and takes the family out to fly it. In the park, the Banks meet Mr. Dawes Jr, who reveals that his father died happily laughing from the joke and re-employs George as a junior partner. With her work done, Mary flies away with Bert bidding her farewell, telling her not to stay away too long."}