{"title": "Max Payne", "full_text": "MAX PAYNE\n          \n          \n          \n                       Written by\n          \n                  Beau Michael Thorne\n          \n          \n          \n          \n                                                8/24/2007\n\n                                               OVER BLACK:\n          \n                                MAX'S VOICE\n                                                              C\n                      I don't believe in heaven, but I have\n                      this idea about it. Something I heard in\n                      a song.\n          \n          FADE IN:\n          \n           White.\n          \n              pristine, empty frame.   Clean and peaceful.\n          \n                                 MAX'S VOICE\n                      Heaven is a place where nothing ever\n                      happens.\n          \n          There's gentle motion in the blank frame, like swirling 16mm\n          grain. A RUMBLE starts to build, low but growing louder...\n          \n          The grain moves faster, big chunks fluttering, now a dirty\n          dishwater grey. The RUMBLE becoming a HOWLING WIND.\n          \n          Churning black water LAPS at the bottom of the frame...\n          \n          EXT. HUDSON RIVER - DAWN\n          \n          A blizzard, at the peak of its power. Visibility zero, New\n          York reduced to the hulking shapes of buildings on the banks.\n          MAX PAYNE thrashes in the water, a long way from shore.\n          \n          \n                                MAX'S VOICE\n                      There's an army of bodies under this\n                      river. Criminals, people who ran out of\n                      time, out of friends.\n          \n          \n          Chunks of ice float in the dirty water around him. Max's\n          body freezing, skin turning blue. Heavy winter clothes\n          saturating, like an anchor dragging him down...\n          \n                               MAX'S VOICE\n                      The next time they drag this river,\n                      they'll find me on the bottom with the\n                      rest of them. And there won't be anybody\n                      left to say I was different.\n           \n          Max's face sinks below the surface...\n          \n                                                                CUT TO:\n          \n          \n          \n          INT. HALLWAY - DAY\n          \n          Nothing to orient us to the location, the time. Just a flash\n          of golden light filling the hall, warm as the river was cold.\n          Around a closed door, sunlight streams through the gaps...\n          \n          BEDROOM\n          \n          A WOMAN sleeps on the bed, curled up around a bundled BABY.\n          Is this the final, peaceful memory of a drowning man?\n          \n          Something's wrong, then: the woman's body in an unnatural\n          position, more thrown than laid across the bed. The crib\n          tipped over, blankets scattered. Her eyes frozen open.\n          \n          Something BLACK flutters against the window pane, CRACKING\n          into the glass. The sound of the BLIZZARD creeps in...\n          \n          RESUME - HUDSON RIVER\n          \n          Wind POUNDS the river where Max had once been, but there's no\n          more thrashing in the water. Mixed in behind the falling\n          snowflakes, BLACK SHAPES swirl and dive closer to the water.\n          \n                              MAX'S VOICE\n                    I could feel the dead down there, just\n                    below my feet. Reaching up to welcome me\n                    as one of their own.\n          \n          Max breaks the surface - GASPING, STRUGGLING against the\n          undertow. Not simply trying to breathe...trying to swim.\n          \n                              MAX'S VOICE\n                    It was an easy mistake to make.\n          \n                                                            CUT TO:\n          \n          EXT. STREET (NYC) - NIGHT\n          \n          Abruptly, the snow is gone. Just a bitter wind left in its\n          place, whipping through desolate streets long after midnight.\n          Shuffling up the littered sidewalk, three rough-looking MEN\n          duck out of the wind by descending down to the subway...\n          \n          On the dark side of the street, a pair of BOOTS follows them.\n          \n          TITLE CARD:      ONE WEEK EARLIER\n          \n          INT. ROSCOE ST. STATION - DAY\n          \n          A filthy platform, empty except for the three Men huddled on\n          a bench. A squeaking TURNSTILE catches their ear...\n          \n          The same boots grind towards the Men. We don't see the\n          walker's face, distracted by something else: a gleaming gold\n          wristwatch. As if to make certain the Men notice, he pulls\n          back his sleeve to check the time. Quarter past three...\n          \n          The watch glints as it passes into a dark doorway marked\n          `MEN'S.' The Men follow, exchanging wicked grins. Too easy.\n          \n          SUBWAY BATHROOM\n          \n          The Men slink into the bathroom, smirking at their oblivious\n          prey at the sink. Steam rising, he sets the watch on the\n          edge of the sink before washing his hands...\n          \n                                 MAN #1\n                       Hey, that's a really nice watch.\n          \n          No answer. One of the Men LOCKS the door.       At the sound of\n          the lock SNAPPING, he raises his head...\n          \n          Max Payne, but not yet the man struggling for life in the\n          river: clean-shaven, skin like bleached bone. Haunted eyes.\n          In the murky mirror, Max sees the Men circling closer...\n          \n                                 MAN #1\n                           (drooling over the watch)\n                       Kinda reminds me of one I lost--\n          \n                                 MAX\n                       You didn't lose it. You pawned it up on\n                       128th a few hours ago.\n          \n          Max shuts off the water and calmly turns to face them.\n          \n                                 MAX\n                           (nodding to Man #2)\n                       Ask Doug. He was there with you.\n          \n          Doug frowns, deeply confused about being called by his name.\n          \n                                 DOUG\n                       You've been following us all night?\n          \n                                 MAX\n                       No.\n                            (pointing)\n                       I'm only following you.\n          \n          While Doug digests that, PAWNSHOP pulls a pistol and trains\n          it on Max's forehead. The third man - not much more than a\n          KID, visibly frightened - backs towards the door.\n          \n                                                      \n          \n                                                                     4.\n                     \n          \n          \n                                 PAWNSHOP\n                       You a cop, or something?\n          \n                                 MAX\n                       Not tonight.\n          \n                                 PAWNSHOP\n                       Too bad.\n                           (to Doug)\n                       Go get my watch.\n          \n          Distractedly eyeballing Max, Doug brushes the watch off of\n          the sink. It hits the dirty tile, delicate crystal CRACKING.\n          \n          In a sudden blur of movement, Max has one hand on the pistol,\n          the other one SMASHING into Pawnshop's windpipe...\n          \n          Doug steps forward to help... BOOM! The pistol goes off as\n          Max pries it free. Max looks up at Doug. Nowhere to run, he\n          races into the farthest stall and SLAMS the door.\n          \n          In the same instant, the Kid bolts for the door. Max has to\n          pick: follow or stay with the man he's tracking...\n          \n          In the stall, Doug crawls on his stomach across the sticky\n          floor, trying to squeeze under the divider. Max raises the\n          pistol and BLASTS a hole through the door of the next stall.\n          \n                                 DOUG\n                         (craving, eyes closed)\n                       Watch over me, watch over me...\n          \n          The newly-perforated door flies open. Handcuffs SNAP,\n          restraining a WHIMPERING Doug to the toilet pipe.\n          \n                                 MAX\n                       Open your eyes, now.\n          \n          Doug finds himself staring at the pistol's front sight. Max\n          reaches into his pocket and produces a tattered photograph...\n          It's the woman from Max's golden vision in the river.\n          \n                                 MAX\n                       Have you ever seen her before?\n          \n          Doug shakes his head violently, confusion and terror rising.\n          \n                                 MAX\n                       You got busted robbing a house in New\n                       Jersey with William Preston three--\n          \n                               DOUG\n                     Bill's dead.\n          \n                               MAX\n                     That's why I'm talking to you.\n                         (moving the photo closer)\n                     Did he ever say anything about this\n                     woman? Did you ever hear anyone--\n          \n                               DOUG\n                     Bill died because their wings couldn't\n                     lift him up.\n          \n                               MAX\n                     No, he got shot robbing a liquor store.\n                     What are you talking about?\n          \n                               DOUG\n                          (incoherent, rambling)\n                     Their wings are golden, the feathers only\n                     look black...\n          \n          Sighing, Max unlocks Doug from the pipe, hauling him up and\n          slamming into the wall as he cuffs his hands behind his back.\n          \n          PLATFORM\n          \n          Max stalks out of the bathroom, pushing Doug ahead of him.\n          Down on the tracks, the Kid shrinks into the shadows...\n          \n          SUBWAY TUNNEL\n          \n          The Kid runs down the dark tracks, nervously glancing back at\n          the receding light of the platform.   He slows gradually,\n          relaxing as escape seems certain.\n          \n          Down to a walk, he startles at movement in the tunnel ahead:\n          FLAPPING WINGS - a bird, lost and trapped underground?\n          \n          The Kid freezes, his frightened BREATHS almost enough to\n          drown the sound out. It grows, though, more WINGS joining...\n          \n          He turns to retreat up the tracks, but the WINGS suddenly\n          seem to be echoing towards him from all directions.\n          \n          Panicked, the Kid becomes disoriented in the growing RACKET,\n          the tunnel ahead begins to glow brighter as he spins...\n          \n          Visible now in the growing light, BLACK SHAPES flicker above\n          the tracks - dozens becoming hundreds, swelling larger, their\n          POUNDING wings joined by a train RUMBLING closer...\n          \n          \n                                                                          \n          \n                                                                      6.\n                     \n          \n          \n          Frozen, the Kid can only squint into the headlights closing\n          in, petrified by the dark wings SWIRLING around him...\n          I\n           NT. COLD CASE OFFICE - DAY\n          \n          The front room of the cold case department is a mess - desks\n          piled high with paperwork and a week's worth of coffee cups.\n          \n          Halfway in the front door, a young DETECTIVE stands holding a\n          box of his belongings. He looks around for signs of life.\n          SERGEANT ADAMS wanders down the hall, frowning at the draft.\n          \n                                 SGT. ADAMS\n                       You my new guy?\n          \n                                 DETECTIVE\n                       I didn't think anybody was here.\n          \n                                 SGT. ADAMS\n                       Everybody's usually a little late.\n          \n          HALLWAY\n          \n          Sgt. Adams leads the detective down a hall, giving the tour.\n          \n                                 SGT. ADAMS\n                       All the cold investigations in the city\n                       are collected and delivered over to us.\n                       We call each witness to see if they can\n                       add anything to their original statement.\n          \n                                 DETECTIVE\n                       And if they can?\n          \n                                 SGT. ADAMS\n                       We send the file back to the original\n                       precinct for follow-up. Don't get your\n                       hopes up, though.\n          \n          The Sergeant continues towards the center of the building,\n          farther from the light of the windows. He stops at a door.\n          \n                                 SGT. ADAMS\n                       Once you've gone through the file and\n                       come up empty, bring it here...\n          \n          FILE ROOM/MAX'S OFFICE\n          \n          They enter a windowless cave, long rows of metal cabinets\n          stretching on forever into the heart of the building. At a\n          desk in the corner, Max slumps over a stack of files.\n          \n          \n                                                                           \n          \n          D\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n                                                                       7.\n                     \n          \n          \n                                 SGT. ADAMS\n                       Max here handles our filing. Once it\n                       hits his desk, a case is officially dead.\n          \n           ax looks up, dark circles from his long night in the subway.\n          He nods, but the Detective is too busy making a note to see.\n                               D\n                                  ETECTIVE\n                       What if there's no phone number for a\n                       witness? Should I follow up in person?\n          \n                                 SGT. ADAMS\n                       Nope, we don't do that down here.\n          \n           iscretely, Max slides his cut-up knuckles under the desk...\n          \n                                 DETECTIVE\n                       I don't understand, then how--\n          \n                                 SGT. ADAMS\n                       How do you solve that unsolvable murder\n                       mystery and redeem yourself?\n          \n                                 DETECTIVE\n                       The grand jury couldn't find--\n          \n                                 SGT. ADAMS\n                       Stop. Trust me, there's a tragic story\n                       behind why I'm here giving you this tour.\n                       We all did something, so just save it.\n                           (moving for the door)\n                       Follow me to the break room...\n          \n          The Detective turns to Max, embarrassed after his reprimand.\n          \n                                 DETECTIVE\n                       We should get a beer after work, or\n                       something...\n          \n          Max smiles and nods, but his eyes give him away as a liar:\n          \n                                  MAX\n                       Yeah.   Maybe so.\n          \n          HALLWAY\n          \n          The Detective steals a look at Max as Adams shuts his door.\n          \n                                 DETECTIVE\n                       So what did he do?\n          \n          \n          \n                                                                            \n          \n          W\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n                       J\n          \n          \n          \n          \n                                                                       8.\n                     \n          \n          \n                                 SGT. ADAMS\n                           (sharply)\n                       Nothing.\n          \n          Naturally, this reaction piques the detective's curiosity.\n          \n                                  SGT. ADAMS\n                       R\n                        emember when you were a kid, and you'd\n                       hold your breath when you went past a\n                       graveyard?\n          \n          The detective nods.     Adams glances through the window at Max.\n          \n                                 SGT. ADAMS\n                        ust...try to leave him alone.\n          \n          MAX'S OFFICE\n          \n          Max sneaks a sideways glance to the door, watching Adams lead\n          the new Detective away. Once they're gone, Max reaches into\n          his desk and removes a file... `PRESTON, WILLIAM A.'\n          \n           ax goes to a rusted cabinet and buries the file deep inside.\n          \n          INT. MAX'S APARTMENT - NIGHT\n          \n          A lock POPS.     Max steps inside, only silence to greet him.\n          \n          Max lays his jacket across the back of a worn leather chair,\n          footsteps REVERBERATING because there's little other\n          furniture to absorb the sound. He keeps walking...\n          \n          KITCHEN\n          \n          ...past a table with one chair, past gleaming counters. Max\n          fills a glass of water from the tap. Eyes blank, patient.\n          \n          LIVING ROOM\n          \n          Carefully, Max rests the full glass on the arm of the chair.\n          Reaching underneath the chair, Max produces an artist's\n          sketchbook and places it delicately on the table before him.\n          \n          Sith trembling hands, Max turns back the battered cover...\n           uddenly, colors burst into the monochrome room: bright\n          swirls of oil pastels sketch out a still life in Technicolor.\n          \n          Gradually, Max's eyes lose their hardness. His breaths come\n          FASTER, ragged. Jaw clenched, he turns the page...\n          \n          \n          \n                                                                            \n          \n                                 V\n          \n          \n          \n          \n          I\n          \n          \n          \n          \n                                                                         9.\n                     \n          \n          \n          More flowing brush strokes, the artist's feminine initials...\n          Max reaches up to turn the page, hands shaking severely...\n          \n          He takes hold of the corner of the page, but his muscles\n          won't cooperate - as if the page ways more than Max can lift.\n          \n          Max's skin flushes red...tears almost welling...\n          \n          And then at once, Max slams the book shut and turns away.\n          \n          CLOSET\n          \n          The door swings open. Hanging inside, the battered coat we\n          saw Max wear in the subway. A pistol on a hook by the door.\n          Urban armor, scarred by countless nights of service.\n          \n          Max dresses himself for battle, eyes returning to stone.\n          \n          EXT. STREET - NIGHT\n          \n          Max climbs out of the subway into a neighborhood with a foot\n          in two worlds: the buildings are old and crumbling, but the\n          shops inside are sleek and expensive. A jarring combination.\n          M\n           ax walks up the street, brushing past HOMELESS PEOPLE and\n          FASHIONISTAS jostling for the same space on the sidewalk.\n          \n           NT. APARTMENT BUILDING - HALLWAY\n          \n          The hallway is ancient brick, but the doors are pristine\n          steel. Pausing at one with a dozen locks, Max KNOCKS.\n          \n          The door cracks.    An EYE appears.   Squinting, evaluating.\n          \n                                  OICE (O.S.)\n                       You can't come here anymore.\n          \n                                 MAX\n                       William Preston was a dead end.\n          \n          The door cracks enough to reveal the speaker: TREVOR, skinny-\n          fat in an sharp suit and sunglasses, shirt open a little far.\n          \n                                 TREVOR\n                       You can't come here, I said. I'm done\n                       helping you. I've already...\n                           (lowering his voice)\n                       ...paid my debt to society, you know?\n                       I've cooperated enough.\n          \n                                 MAX\n                       We need to talk.   Won't take long.\n          \n                    T\n          \n          \n          \n          \n                    I\n          \n          \n          \n          \n                              M\n          \n          \n          \n          \n                                                                     10.\n          \n          \n          \n          TREVOR'S APARTMENT - ENTRANCE HALL\n          \n          Max follows Trevor inside. The narrow brick entry opens into\n          a cutting-edge loft beyond, filled with modern art and a\n          gathering of BEAUTIFUL PEOPLE milling around enjoying it.\n          \n                              TREVOR\n                    I thought you found Bill's partner.\n          \n                              MAX\n                    I did, but Doug only wanted to talk about\n                    pigeons, or something. I need a new\n                    name, someone robbing houses to feed a\n                    habit around that same time.\n                              T\n                               REVOR\n                    Three years is a lifetime for guys like\n                    that. One way or the other, they're\n                    probably all gone now.\n                        (a little self-satisfied)\n                    Either way, I'm not the one to ask\n                    anymore. I cater to a better class, now.\n          \n          One of the guests catches Max's eye: NATASHA, young and\n          beautiful, returns his gaze for an extra moment and smiles.\n          \n                              MAX\n                    I can see that.\n          \n                              TREVOR\n                    This is a party. These are my friends.\n                    You remember friends?\n          \n                               AX\n                    I need another name, or I start frisking\n                    your friends.\n          \n          Trevor stands his ground, not flinching at Max's threat.\n          \n                               TREVOR\n                      don't have one to give you, Max. Look,\n                    you've gone through all your living\n                    leads, now you're running out of dead\n                    ones...\n                        (beat)\n                    I don't think this guy's out there.\n          \n          Max nods, fatigue fighting the determination in his eyes.\n          \n                              TREVOR\n                     ry sleeping at night every now and then,\n                    you'd see that for yourself.\n          \n                                                                          \n          \n          W\n          \n          \n          \n          \n          M            N\n          \n          \n          \n          \n                       Y\n          \n          \n          \n          \n                       T\n          \n          \n          \n          \n                                                                     11.\n                     \n          \n          \n          Max doesn't answer. His eyes have drifted back to Natasha.\n          She plucks a drink from a passing tray, revealing a dark\n          smudge across the inside of her wrist as she does.\n          \n                                 TREVOR\n                       I'd invite you in, but...\n          \n          Suddenly intent, Max pushes past Trevor and into the loft.\n          \n                                 MAX\n                        hanks.\n          \n          LIVING ROOM - CONTINUOUS\n          \n          Max weaves through the party towards Natasha, out of place in\n          his utilitarian clothes. She looks up as he gets closer...\n                               N\n                                  ATASHA\n                        ou decided to stay for a while.\n          \n          She speaks with a Russian accent - smiling, a little nervous.\n          Rather than answering, Max's eyes drop to her wrist.\n          \n                                 NATASHA\n                        ow it's your turn to say something...\n          \n           ax takes her hand, gently turning it to reveal her tattoo: a\n          black wing, stylized feathers tracing faint blue veins.\n          \n                                 MAX\n                       That's interesting.\n          \n                                 NATASHA\n                       Thank you. It's...\n                           (glancing past Max)\n                       Shit.\n          \n          Max follows her gaze to the front door, where Trevor is\n          nervously greeting another new arrival: MONA SAX. She's\n          striking, beautiful but also a little frightening. It\n          doesn't hurt that she's flanked by BODYGUARDS. Russian Mob.\n          \n          Seeing Natasha standing with Max, Mona barrels across the\n          room towards them. People stand aside to let her pass.\n          \n           ithout preamble, Mona begins YELLING at Natasha in Russian.\n          Natasha RESPONDS in kind, clearly intimidated by Mona.\n          \n          Abruptly, Mona grabs Natasha's arm, jerking her off balance.\n          \n                                 MAX\n                       Why don't you let go--\n          \n                                                                           \n          \n          S\n          \n          \n          \n          \n                                                                     12.\n                     \n          \n          \n                                 MONA\n                           (in perfect English)\n                       Mind your business.\n          \n          Mona returns to Natasha, dragging her towards the door.\n          Natasha's tone becomes PLEADING, physically no match for\n          Mona. Max steps in, reaching up to touch Mona's shoulder...\n          I\n           t happens in a flash: Mona spins and takes hold of Max's\n          arm. Incredibly, he's just as fast, slipping free of the\n          grip that would surely have snapped his wrist...\n          \n          For a moment, Max and Mona stare each other down. Surprised,\n          reevaluating each other. Natasha continues to TALK, her\n          Russian anxious as Mona's bodyguards push through the crowd.\n          \n          Mona's eyes drop to Max's chest, where the tussle pulled his\n          coat open to reveal a low-pro holster and tarnished badge.\n          \n          With the flick of her wrist, Mona stops her guards' advance.\n          \n          The crowd begins to notice the altercation. Natasha keeps\n          TALKING, trying desperately to make peace and reassure Mona\n          of something. Mona's eyes cut between Natasha and Max...\n          \n           till apprehensive, Mona shakes her head and walks away.\n          \n                                  NATASHA\n                       My sister.\n                           (beat)\n                       Sort of a bitch.\n          \n          As Max nods at the understatement, Trevor rushes over,\n          forcing a broad smile to reassure his guests. He pulls Max's\n          coat closed over the badge and ushers him towards the door.\n          \n                                 TREVOR\n                       You have to go. Now.\n          \n                                 MAX\n                           (pulling free)\n                       Fine. I just want to ask her something\n                       first...\n          \n          Max turns to the spot where Natasha had been.   She's gone.\n          \n          HALLWAY - LATER\n          \n          The party has grown more crowded. Max fights his way down a\n          dark hall, searching the shadowed faces he passes. Back\n          here, the music is nothing but GROWLING BASS.\n          \n          \n                                                                           \n          \n                                 N\n          \n          \n          \n          \n          S\n          \n          \n          \n          \n          A\n          \n          \n          \n          \n                                                                    13.\n                     \n          \n          \n          A flickering glow escapes the gaps around one door...\n          \n          DARK ROOM\n          \n          A ring of candles in the center of the floor provides the\n          only light. It's not enough to really see the PEOPLE inside.\n          We hear them CHANTING, low voices MURMURING in unison...\n          \n          Quick glimpses in the candle light, bare flesh writhing.\n          Cast on the walls, corresponding shadows twist and shift...\n          \n          A black feather billows across the floor between candles.\n          Spreading up the wall, a new shadow rises above the rest...\n          \n              pair of wings - long and distorted in the candle light.\n          \n          Max appears in the doorway as the shadows loose their shape -\n          Max only catching a glimpse, not sure what he's seeing...\n          \n          HALLWAY\n          \n          As Max strains to see detail in the dark room, a face\n          materializes in the haze: cheeks laced with tattoos, eyes\n          twinkling flames sunk in deep shadow. JACK LUPINO.\n          \n           uddenly, Max turns and sees Natasha standing beside him.     We\n          immediately notice something different about her: staring\n          boldly into Max's eyes, all her earlier shyness vanished.\n                               N\n                                  ATASHA\n                       Looking for me?\n          \n          Natasha glances through the door at the shifting shadows,\n          smiling at what she sees. Max follows her eyes...\n          \n                                 MAX\n                       Were you in there?\n          \n                                  ATASHA\n                           (shrugging, coy)\n                       Take me somewhere, I'll tell you.\n          \n          INT. MAX'S APARTMENT - NIGHT\n          \n          Max leads Natasha inside. Before he can even shut the door,\n          Natasha pounces - kissing, hands running over his body. As\n          he pushes back, Natasha's hands slip into Max's pockets...\n          \n          Abruptly, Natasha breaks away and looks around the apartment.\n          \n                                 NATASHA\n                       You just move in?\n          \n                                                                         \n          \n                       I\n          \n          \n          \n          \n                       T\n          \n                                 M\n          \n          \n          \n          \n                                                                       14.\n                     \n          \n          \n          Not really interested, Natasha walks deeper into the room.\n          \n                                  AX\n                        hree years ago. So we're somewhere,\n                       now: who was that guy--\n          \n          In response, Natasha unbuckles her pants and lets them drop.\n          Still walking, opening her shirt on her way out of the room.\n          \n          HALLWAY\n          \n          Max moves down the hallway, following a trail of clothing.\n          From inside a room, we hear the faint sound of CHANTING...\n          \n          BEDROOM\n          \n          In Max's bed, a thin sheet barely covers Natasha's body. Her\n          lips tremble with a slurred SONG. With predatory eyes, she\n          watches Max stop in the doorway, something holding him back.\n                               N\n                                  ATASHA\n                           (frustrated sigh)\n                       Fine. What was her name?\n          \n                                 MAX\n                       Who?\n          \n                                 NATASHA\n                       The girl from the boring story you want\n                       tell me. The one that ends with you\n                       living here. Very sad.\n          \n          Caught off guard, Max tries to figure out how much he'll say.\n          Natasha resumes CHANTING as she waits - a stream of frantic\n          SYLLABLES rattling off, nothing recognizable as words.\n          \n                                 NATASHA\n                         tell you what...\n                           (beat, evil smile)\n                       Call me by her name.\n          \n                                 MAX\n                           (startled)\n                       What?\n          \n          Natasha grins, legs spreading, sheet starting to fall away...\n          \n                                 NATASHA\n                       That way you can make love to her again,\n                       just like she never left you.\n                           (shrill, mocking voice)\n                       Oh, Max, I miss you...\n          \n                                                                             \n          \n          A\n          \n          \n          N\n          \n          \n          \n          \n                       Y\n          \n          \n          \n          \n                                    M\n          \n          \n          \n          \n                                                                    15.\n                     \n          \n          \n          Like a switch, Max's face closes off again.\n          \n                                  AX\n                       You should go.\n          \n                                    NATASHA\n                       Excuse me?\n          \n                                 MAX\n                           (exhausted, to himself)\n                       There's nothing you can tell me.\n          \n          Natasha explodes out of the bed, springing up naked in front\n          of Max - shoulders heaving with rage, eyes wild black holes.\n                               N\n                                  ATASHA\n                        ou're kicking me out of your bed?\n          \n          For a moment, it seems like Natasha is about to attack.    Not\n          physically intimidated, Max stares at her in disbelief.\n          \n                                    MAX\n                       Yeah.\n          \n          Natasha stomps into the hall, gathering her clothes. She\n          pulls a cell phone from her crumpled pants and dials...\n          \n                                 NATASHA\n                           (on phone)\n                       Owen, pick up if you're awake...\n          \n          Max watches her disappear down the hall, front door SLAMMING\n          a moment later. He looks around, silence returning again.\n          \n          EXT. STREET - NIGHT\n          \n          Natasha walks down a dark, desolate block, the sound of her\n          HEELS echoing off of the crumbling buildings around her. Her\n          eyes are still wild, her stride quick and aggressive.\n          \n          A group of MEN huddle in a stairway to avoid the wind. As\n          Natasha passes, they look up at her with equally wild eyes.\n          \n           atasha steps off the sidewalk and into an alley, plunging\n          into the darkness like she's been there many times before.\n          In the distance, faint MUSIC rumbles through the street.\n          \n              moment later, the few working lamps on the street dim...\n          \n                      N\n          \n          \n          \n          \n          R\n          \n          \n          \n          \n          A\n          \n          \n          \n          \n                                                                         16.\n          \n          \n          \n          ALLEY\n          \n          Natasha barrels down the alley, squinting to see ahead.        The\n          music is a little louder, BASS shaking the dumpsters.\n          A\n              wind picks up, garbage blowing...\n          \n          Suddenly unsettled by something, Natasha's pace slows.      She\n          tenses, all her swagger vanishing before our eyes...\n          \n              can RATTLES in the alley behind her.    Natasha spins...\n          \n          Nothing - just the FLICKERING of moths swarming the alley's\n          only light, their shadows black shapes against the bricks.\n          \n          The sound of much larger BEATING WINGS fills the alley...\n          \n          Eyes wide with terror, Natasha searches for something in the\n          shapes cast by the moths, dread deepening as she finds it:\n          \n           eal winged shapes mix with the shadows, FLAPPING wildly...\n          \n          Natasha CRIES OUT, stumbling back.      She turns, running...\n          \n                                 NATASHA\n                       ot yet!   Please, just let me...\n          \n          Natasha's SCREAMS seem lost in the chaos of wind and WINGS\n          and distant MUSIC. She suddenly stops running...\n          \n          More SHADOWS assemble ahead of her, their black wings open.\n          \n          INT. MAX'S APARTMENT - BEDROOM - MORNING\n          \n          Max hurriedly dresses, wearing the same suit from yesterday.\n          He picks up his keys, searching around for something else -\n          feeling the pockets of his jacket, down in the cushions...\n          \n          OFFICE\n          \n          Max moves up the sidewalk, nearly at the steps of his office.\n          A rough-running ENGINE idles up the street, getting closer.\n          Slowly, Max realizes that he's being followed. He turns...\n          A\n           LEX HILLMAN sits behind the wheel - about Max's age, but in\n          much rougher condition, everything about him a little ashen.\n          He watches Max turn away from the office and move closer.\n          \n          Max returns Alex's stare. We don't know if they're about to\n          smile or open fire. They don't seem to know, either.\n          \n          Alex slides over and throws the passenger side door open.\n          \n                    S\n          \n          \n          \n          \n          A\n          \n          \n          \n          \n                                                                   17.\n          \n          \n          \n          INT. ALEX'S CAR - DAY\n          \n          Alex and Max ride in silence, a palpable tension in the car.\n          \n           lex pulls a pack of cigarettes from his pocket and shakes\n          one out. He holds the pack out to Max, who shakes his head.\n          \n          Alex nods, smiling, using his lighter and then laying it with\n          the pack within Max's reach. Max doesn't even glance down.\n          After a silent moment, Alex looks over at Max and frowns.\n          \n                              ALEX\n                    You're not serious, are you?\n          \n          Shaking his head in disbelief, Alex pulls to the curb.\n          T\n           hey've parked at a crime scene - the alley in front of them\n          sealed with police tape, COPS posted to keep onlookers away.\n          \n                              MAX\n                    What's this?\n          \n          Alex pulls a flask from under his seat, taking a quick pull.\n          \n                              ALEX\n                    I need you to look at something.\n          \n          EXT. ALLEY - DAY\n          \n          Alex approaches the alley, pulling on a leather jacket and\n          snapping a badge onto his belt. The cops let him pass.\n          \n          Max follows Alex, slowing as he crosses the police tape. By\n          the crowd of CSI TECHS, what started here didn't end well.\n          There's blood everywhere, a dozen white sheets on the ground.\n          \n                              MAX\n                    What happened to them?\n          \n                                 ALEX\n                    Her.     Just one.\n          \n          Confused, Max studies the sheets. On second look, they\n          aren't covering anything quite big enough to be a whole body.\n          \n                              ALEX\n                     omebody found her leg near the sidewalk,\n                    called it in a few hours later. We found\n                    the other one in the dumpster over there.\n          \n                              DETECTIVE #1 (O.S.)\n                    I don't believe it.\n          \n                                                                       \n          \n          M\n          \n          \n          \n          \n                                 A\n          \n          \n          \n          \n                                                                      18.\n                     \n          \n          \n          Max and Alex turn to see that they've attracted spectators,\n          the other DETECTIVES D the alley watching them intently.\n                               in\n          \n                                  ETECTIVE #1\n                       Don't tell me you two are gonna start\n                       working together again. I'd--\n          \n                                  LEX\n                           (ignoring)\n                       What do we know?\n          \n                                 DETECTIVE #1\n                       Only that it didn't happen here. Beyond\n                       that, I don't even know how to describe\n                       it in my report. `Disassembled,' that's\n                       the word we came up with.\n          \n          The Detective grins, proud of his wit. Alex and Max move on\n          without comment. Max looks at the sheets, shaking his head.\n          \n                                 MAX\n                       Why are you showing me this?\n          \n          Alex pulls out a plastic evidence bag, holding it out...\n          \n          Max's wallet.\n          \n                                 ALEX\n                       We found it here, by her heart.\n          \n          Inside the clear bag, Max's ID picture is smeared with blood.\n          \n                                 ALEX\n                       As far as we know, the victim--\n          \n                                 MAX\n                           (quiet)\n                       Natasha.\n          \n           ax kneels down over a tarp. The edge is pulled back,\n          revealing a pale forearm with a delicate tattoo of a wing.\n          \n                                 MAX\n                           (remembering)\n                       They couldn't lift him up...\n          \n                                 ALEX\n                       What did you just say?\n          \n          Max looks up at Alex, who is suddenly quite agitated. He\n          glances back at the other detectives - they're staring at\n          Alex and Max, whispering something amongst themselves.\n          \n                                                                            \n          \n          F\n          \n          \n          \n          \n                                                                   19.\n                      (2)\n          \n          \n                              ALEX\n                    We need to talk, Max. Tonight.\n                        (writing something)\n                    Here's my address...\n          \n                              MAX\n                    For God's sake, I know where you--\n          \n                              ALEX\n                        (somber)\n                    No, I moved out.\n          \n          Alex hands over the address and hurries away, leaving Max\n          standing in the alley, surrounded by Natasha's remains.\n          \n          EXT. APARTMENT BUILDING - NIGHT\n          \n          Max steps out of his car, moving up the sidewalk to a\n          surprisingly nice apartment building: uniformed doorman, the\n          works. Double-checking the address, Max steps inside...\n          \n          INT. APARTMENT BUILDING - HALLWAY - NIGHT\n          \n          Near the end of the hall, Max stops at an apartment door.\n          The wood is splintered, pieces of the frame hanging loose...\n          \n           orced open.\n          \n          Max checks the hall in both directions, drawing his pistol...\n          \n          ALEX'S APARTMENT - LIVING ROOM\n          \n          Careful not to make a sound, Max steps into a living room so\n          messy that it's hard to say for sure if it's been ransacked.\n          Max flips a switch by the door, but no lights come on.\n          \n                               MAX\n                    Alex?   Are you in here?\n          \n          Max pauses so his eyes can adjust to the traces of\n          streetlight sneaking through the blinds. He moves deeper...\n          \n          KITCHEN\n          \n          Pistol ready, Max moves into the kitchen. Dirty dishes,\n          flies swarming around the necks of countless liquor bottles.\n          U\n           nseen behind Max's back, the front door pushes closed...\n          \n          HALLWAY\n          \n          Max creeps down a hallway.   His shoes CRUNCH in something:\n          \n                                                                        \n          \n          A\n          \n          M\n          \n          \n          \n          \n                                                                     20.\n                     \n          \n          \n          A broken mirror scattered in the hallway, the pieces growing\n          more concentrated towards the dark end of the hall.\n          \n          Max reaches an open doorway.   Cautiously, he sweeps inside...\n          \n          In the hallway behind Max, SOMETHING moves in the shadows.\n          \n           ax moves deeper into the darkness, gleaming shards of mirror\n          grinding underfoot. Something lies in the floor ahead...\n          \n            BODY - legs stretched across the hall, upper torso not\n          visible inside a room. A badge on the belt, a service\n          revolver limp in it's fingers, tattered leather jacket.\n          \n          Alex.\n          \n          At the moment that registers, a NOISE in the hallway behind\n          him sends Max ducking for cover in the doorway beside him.\n          Max crouches, gun raised, staring at Alex's motionless body.\n          \n                               MAX\n                       Alex!\n          \n          FOOTSTEPS grow closer...slow, steady...\n          \n          Max uses the fragments of mirror scattered around Alex's\n          legs, each giving a tiny view of the hallway...\n          \n          One piece shows a FIGURE moving closer, shrouded in darkness.\n          A\n           nother reflection shows a set of eyes. Frozen. Frantic.\n          It's Alex, staring at Max, seeming to silently beg for help.\n          Max looks from the reflection to the legs. There's no way...\n          \n          There's no way Alex's head is still attached to his body.\n          \n          Thunderstruck, Max looses track of the shadows moving closer\n          to his hiding spot, unable to pull his eyes away from Alex.\n          The Figure lunges out of the shadows, slamming into Max...\n          \n          The Dark Shape's slashing blows glint in the moonlight, cold\n          metal slicing the air faster than Max can fend off...\n          \n                                                             CUT TO:\n          \n          A RAPID SERIES OF IMAGES:\n          \n          Max drags himself up the hall, hands slicing on the shards.\n          The air echoes with angry VOICES, LAUGHTER and SCREAMS.\n          Blood drips down the walls, shadows teem with movement...\n          \n          \n          \n                                                                        \n          \n                                 B\n          \n          \n          \n          \n                       T\n          \n          \n          \n          \n                       Y\n          \n          \n          \n          \n                                                                       21.\n                     \n          \n          \n          The FLAPPING grows louder, gusting WIND scattering glass.\n          Max SHOUTS, disoriented, instinctively pushing himself on.\n          Alex's eyes, frozen wide, watch as Max crawls closer...\n          \n          Shadows in the air above Max roil with movement. Demonic\n          HOWLS rattle the windows. Max reaches out to Alex...\n          \n          Above them, black wings POUND.\n          I\n           NT. HOSPITAL ROOM - DAY\n          \n          Max's eyes pop open.\n          \n          He lies in a hospital bed, surrounded by flashing machinery.\n          Beyond the soft WHIR of equipment fans, the room is silent.\n          \n                                 BB (O.C.)\n                       The E.R. doctor's old man was a patrolman\n                       in the 45th. I got him to get you a\n                       private room.\n          \n          In a chair by the bed, BB HENSLEY (50s) watches Max wake up.\n          BB's face is weathered and hard, but his smile is kind.\n          \n                                 BB\n                        our contact information was... pretty\n                       out of date, you know, but one of the\n                       dispatchers remembered me and your dad\n                       riding together back in the day.\n          \n          Max nods groggily, struggling to find his bearings...\n          \n          Suddenly, something breaks through.\n          \n                                 MAX\n                       Alex.\n          \n          BB nods, shivering at the mental image his name produces.\n          \n                                 BB\n                        he first unit to respond must've scared\n                       them away before they could do the same\n                       thing to you. Pretty remarkable,\n                       considering your luck.\n          \n                                 MAX\n                       He was trying to tell me something.\n          \n                                  B\n                       Was he alive when you showed up?   Did you\n                       get a look at the guys who--\n          \n          \n                                                                             \n          \n                                  M\n          \n          \n                       J\n          \n          \n          \n          \n                                  M\n          \n          \n          \n          \n                                                                        22.\n                     \n          \n          \n                                   MAX\n                       No.   I get Bflashes, but it's...wrong.\n          \n                                  B\n                       I hate to say it, but you need to come up\n                       with something better than that. They've\n                       got nothing for leads, so the whole force\n                       has you pegged as the prime suspect.\n          \n                                  AX\n                       You tell them where to find me.\n          \n                                  BB\n                       No need.   The funeral starts in an hour.\n          \n          Max pops up, tangling the IV tubes running into his hand.\n          \n                                 BB\n                        ust slow down.   You need to--\n          \n          Max wraps the clear tube around his hand and SNAPS it free.\n          \n                                  AX\n                       What I need is to borrow some dress\n                       blues. Can you help me out?\n          \n                                 BB\n                           (reluctant)\n                       Yeah. My office is on the way.\n          \n          As Max takes an unsteady step onto the cold tile floor, a\n          concerned BB throws his overcoat across Max's shoulders.\n          \n          INT. BB'S CAR - DAY\n          \n          BB and Max ride in silence, RADIO overpowered by the blasting\n          heater. Max closes the overcoat over his hospital gown.\n                               D\n                                  .J. (V.O.)\n                       --with a major system moving down from\n                       Canada tonight, transportation\n                       authorities are bracing for a blizzard...\n          \n          BB pulls against the curb on a block unfamiliar to Max.\n          \n          EXT. ASGARD BUILDING - DAY\n          \n          A massive stone structure, squat like a military fortress and\n          black under the storm clouds. There have been updates over\n          the years, but nothing could to hide the age of the building.\n          \n          \n          \n                                                                              \n          \n          I\n          \n          \n          \n          \n                           (\n          \n          \n          \n          \n                                 B\n          \n          \n          \n          \n                                                                      23.\n                     \n          \n          \n          BB starts across the sidewalk to the entrance. Max follows,\n          giving a confused frown at the building they're approaching.\n          \n                                 MAX\n                       You quit working for Aesir?\n          \n          BB leads Max through a wrought-iron gate, into a small\n          courtyard leads back to the thick wood doors of the entrance.\n          \n                                   B\n                       I didn't quit, they made me head of\n                       security for the whole parent company.\n                       That comes with its own building, such\n                       that it is.\n                            beat)\n                       Check this out.\n          \n          A proud parent, BB points at a deep pit in the stone wall.\n          \n                                 MAX\n                           (impatient)\n                       It's a bullet hole.\n          \n                                 BB\n                       Yeah, from a musket ball. The British\n                       used this place as a military prison\n                       during the Revolutionary War. Think\n                       about that. It's older than St. Paul's.\n          M\n           ax looks up at the crumbling gargoyles perched above.\n          \n           NT. ASGARD BUILDING - BB'S OFFICE - DAY\n          \n          The double doors fly open onto a massive office - dark wood\n          panelling, a wall of windows glowing white from the snow.\n          \n          Max goes to the windows. Spreading out bellow him, the wide\n          black expanse of the East River rolls past. Bridges arc up\n          into the storm clouds and disappear before they hit Brooklyn.\n          \n                                 BB\n                       W\n                        hen the weather isn't so shitty, the\n                       view is unbelievable.\n                           (going to the closet)\n                       I'm not making any guarantees that any of\n                       this will fit.\n          \n          While BB roots around inside, Max absently scans his desk.\n          \n          A slick company newsletter - `AESIR PHARMACEUTICALS.' On\n          the cover, NICOLE HORNE - 50's, dignified, not quite smiling.\n          `A HOLIDAY MESSAGE FROM THE CEO' printed below her face.\n          \n                                                                            \n          \n          E\n          \n          \n          \n          \n          M\n                       I\n          \n          \n          \n          \n                       T\n          \n          \n          \n          \n                       T\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n                                                                       24.\n                     \n          \n          \n                                 BB\n                       I saved one of those for you.\n                           (off Max's confusion)\n                       Third page from the back.\n          \n          Max flips the pages - smiling scientists, sparkling labs...\n          \n           ICHELLE PAYNE, bright smile illuminating a bland corporate\n          portrait. The same face in the photo Max showed the Junkie.\n          \n                                 BB\n                        hey're going to set up some kind of\n                       scholarship in her name.\n          \n          Taken by surprise, Max doesn't seem to hear BB's explanation.\n          \n                                   BB\n                        hey kept coming to me for suggestions\n                       over what she might want. I guess since\n                       we go back so far, maybe they think I'm\n                           (\n                       family. Nobody knew how to find you...\n                             beat)\n                       I said art. She liked art, right?\n          \n          Max nods, turning his eyes away from the photograph.\n          \n                                 BB\n                        t's a nice thing, a scholarship.   Good\n                       way to remember somebody.\n          \n           ax eagerly takes the old uniform from BB, happy to have\n          something else to focus on. BB studies his body language.\n          \n                                 BB\n                       You still haven't been out there, have\n                       you?\n          \n          Max doesn't answer, slipping into a wrinkled dress shirt.\n          \n           XT. CEMETERY - DAY\n          \n          Cars line the drive leading into the cemetery. People leave\n          their warmth and hurry through the iron gates - these\n          mourners especially determined, a community out to honor a\n          fallen brother. BB and Max follow them onto the...\n          \n          CEMETERY PATH\n          \n          Max's eyes are on the cemetery. BB follows his gaze...\n          Two marble angels on the hill. One smaller than the other.\n          \n          \n          \n                                                                             \n          \n                                 M\n          \n          \n          \n          \n          B\n          \n          \n          \n          \n          M\n                           (\n          \n          \n          \n          \n                                                                      25.\n                     \n          \n          \n                                 BB\n                           (gently pushing)\n                       It's a nice spot. I'll go up there with\n                       you after, if you want...\n          \n          Max shakes his head.\n          \n          Up ahead, a young mother tends to two little girls dressed in\n          black, escorted through the cemetery gate by the HONOR GUARD.\n          CHRISTA HILLMAN, Alex's widow. Face blank, still in shock.\n\n                               B\n                                  B\n                            suddenly anxious)\n                       Go ahead up and say something to Christa.\n                       I'll find us some seats...\n          \n           ax threads his way through the mass of UNIFORMED COPS\n          waiting to enter the cemetery. One by one they notice Max,\n          jaws clenching. Max doesn't realize the gauntlet he's in,\n          distracted by a glance of BB slinking into the graves...\n          \n          ...where NICOLE HORNE watches the funeral from among the\n          headstones, almost overdressed in head-to-toe black. Close\n          at hand, JASON COLVIN holds Nicole's umbrella.\n          \n           B approaches Nicole, body language weak and deferential...\n          \n          Max glances back at the path and finds himself facing a wall\n          of angry cops. He keeps walking, no sign of backing down.\n          \n                                 CHRISTA (O.C.)\n                       Let him through.\n          \n          Even with the cops making way, the walk to Christa is hard -\n          the heartbreak and grief on her face slowing Max's gait.\n          \n                                  AX\n                       Christa, I'm really sorry about what--\n          \n                                 CHRISTA\n                       Don't talk to me like some stranger.\n          \n          Christa's eyes bore into Max with all the weight of a long\n          and deep friendship, momentarily shaming him into silence.\n          \n                                 CHRISTA\n                       Who did this to him, Max?\n          \n                                 MAX\n                       We don't have a lot, yet...\n          \n          Christa steps towards Max, teeth gritted with powerless rage.\n          \n                                                                            \n          \n                      N\n          \n          \n          \n          \n                      I\n          T\n          \n          \n          \n          \n                                                                   26.\n                      (2)\n          \n          \n                                CHRISTA\n                          (seething)\n                      When everything happened to you, Alex\n                      completely fell apart. He ruined his\n                      life, he cared that much. So what are\n                      you going to do for him, now?\n          M\n           ax could melt under those eyes, but Christa turns her back\n          and continues up the path to Alex's waiting coffin.\n          \n          Shamed, Max turns away and starts back down the path alone.\n          \n                                BRAVURA\n                      Detective Payne?\n          \n          Everyone turns to see JIM BRAVURA (40s) leaning on the fence.\n          \n                                 BRAVURA\n                       .A.   I need you to come with me.\n          \n           hough they'd been moments from brawling, there's a common\n          reaction from the other cops: nobody likes this guy. Max\n          looks around, humiliated.\n          \n                                 MAX\n                       ow?\n          \n                                 BRAVURA\n                      Now.\n          \n          GRAVESIDE\n          \n          The honor guard stands in formation by the flag-draped\n          casket. The PRIEST waits, his bible ripping in the wind...\n          \n          Christa twists around in her chair, looking down at the\n          cemetery gate. She sees the crowd, Max being escorted away.\n          \n                                CHRISTA\n                          (sad, to the priest)\n                      Okay.\n          \n          Above them all, Nicole Horne stands like a shadow between the\n          graves, too far away to hear the words of the priest.\n          \n          INT. BRAVURA'S OFFICE\n          \n          A cramped office, packed with boxes - a civil servant's tomb.\n          Wedged behind the desk, Bravura sorts through his notes. Max\n          and BB sit across the desk, left on ice while Bravura reads.\n          \n          \n          \n                                                                         \n          \n                       I\n          \n          \n          \n          \n                       H\n          \n          \n          \n          \n                                                                        27.\n                     \n          \n          \n          Bravura slides a folder over to Max - photographs of the\n          alley, Natasha's covered body. Bravura watches his reaction.\n          \n                                 BRAVURA\n                        ow'd the girl have your wallet?\n          \n                                 MAX\n                       She stole it.\n          \n                                 BRAVURA\n                       Like...picked your pocket?\n          \n          Max shrugs.\n          \n                                 BRAVURA\n                       So you didn't know she was a prostitute?\n          \n          The slightest uncomfortable look passes between Max and BB.\n          \n                                 MAX\n                       No, I didn't.    We met through a friend.\n          \n                                 BRAVURA\n                       Trevor Duncan. He's your friend?\n          \n                                  MAX\n                       I guess.\n          \n                                 BRAVURA\n                       That's classy. You know what Trevor does\n                       for a living, I assume?\n          \n                                 MAX\n                       He used to snitch for me.\n          \n                                 BRAVURA\n                       T\n                        ell me, Max, what's a glorified file\n                       clerk still need a snitch for?\n          \n          Max stays stone-faced, burying any emotion Bravura could use.\n          \n                                  BRAVURA\n                         see.   So you'd piss in a cup for us,\n                       right?\n          \n                                 BB\n                           (standing)\n                       I think you just said the magic words.\n                       Call once you hear from the union lawyer.\n          \n          Bravura replaces Natasha's pictures with a stack of shots\n          taken in Alex's apartment. Despite himself, Max freezes.\n          \n                                                                              \n          \n                     L\n          \n          \n          \n          \n          B\n          \n          \n          \n          \n                     Y\n          \n          \n          \n          \n                                                                      28.\n                      (2)\n          \n          \n                               BRAVURA\n                      ou and Detective Hillman haven't worked\n                     together since your reassignment. What\n                     made you get back in touch?\n          \n          Max is distracted by the photographs: enormous blood stains\n          in stark flash bulb light, no longer hidden by the shadows.\n          \n                               MAX\n                     He wanted me to help him with something.\n          \n                                  BRAVURA\n                            (making a note)\n                     And?\n          \n          Max looks up from the picture, realizing he's been baited\n          into saying more than he'd meant to. He starts for the door.\n          \n                               MAX\n                     That's what I'm going to do.\n          \n           ravura gives Max a hard look.      Mad, but genuinely searching.\n          \n                               BRAVURA\n                      ook at this from my perspective: I've\n                     got two bodies in ten body bags. You\n                               M\n                     were the last person to see either one...\n          \n                                AX\n                         (pointing to the photos)\n                     And some of that blood is mine.     Good\n                     luck with your case.\n          \n          As Max storms out, BB calmly stands and pulls on his jacket.\n          \n                               BB\n                     Nice work, detective.\n          \n          As BB turns to leave, Bravura stands from behind his desk.\n          \n                               BRAVURA\n                     You've been around long enough to know\n                     I'm his only way out.\n          \n          BB looks back and sees the business card Bravura's holding\n          out. After a conflicted moment, BB slips it into his pocket.\n          \n          ELEVATOR\n          \n          Still fuming from the encounter with Bravura, Max watches the\n          numbers over the door fall. BB stands beside him, anxious.\n          A car load of PEOPLE surround them, pressed tightly together.\n          \n                                                                           \n          \n          M\n          \n          \n          \n          M\n          \n          \n          \n          \n          A\n          \n          \n          \n          \n                                                                       29.\n                     \n          \n          \n                                 BB\n                       Well, I hope that felt good.\n          \n          Max doesn't respond, eyes drifting to the directory mounted\n          above the buttons. `2ND FLOOR, TRAFFIC VIOLATIONS,' `5TH\n          FLOOR, NARCOTICS....'\n          \n                                 BB\n                       It makes you look guilty. You understand\n                       that, right? Now it's not just Alex's\n                       unit that thinks you're the guy...\n          \n          Max's eyes find `10TH FLOOR, HOMICIDE DIVISION.'\n          \n          The doors open with a CHIME, and the CROWD presses forward.\n          H\n           ALLWAY - CONTINUOUS\n          \n          BB steps out with the other passengers, still talking to Max.\n          \n                                 BB\n                       You need friends on the force right now.\n                       There's only so much I can do outside...\n          \n          BB turns to see if his words are doing anything to reach Max.\n          \n          However, Max is still standing in the elevator, the only one\n          left on the car. He presses the button for the tenth floor.\n          \n                                 BB\n                       Where are you going?\n          \n          The doors LURCH shut.\n          \n          HOMICIDE OFFICE\n          \n          Max steps into the room.\n          \n           t once, you're struck by how this is the opposite of the\n          cold case department: desks cluttered by labor instead of\n          neglect, DETECTIVES engaged in their telephone conversations.\n          \n          Eyes start to find him.\n          \n           ax marches forward, ignoring the spreading wave of shock.\n          \n          Max stops at a door marked `ALEX HILLMAN.'    It's locked.\n          \n           ax JIGGLES the door knob.\n          \n          \n          \n          \n                                                                             \n          \n          F\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n          B\n          \n          \n          \n          \n                                                                       30.\n                     \n          \n          \n                                    DETECTIVE #1\n                              (shouting)\n                       Hey!\n          \n          Max doesn't look up.       He keeps SHAKING the handle, desperate.\n          \n                                 DETECTIVE #1 (cont'd)\n                       Hey asshole, that door's locked for a\n                       reason.\n          \n          One by one, the detectives climb to their feet, expressions\n          showing outrage and anger. They close in on Max...\n          \n                                 DETECTIVE #2\n                       God damn it, that means you need a--\n          M\n           ax gives the knob a final twist, and the door swings open.\n          \n                                 MAX\n                           (to himself)\n                       There wasn't ever a key.\n          \n          Max steps inside.       Enraged, the detectives start to follow...\n          \n           ut the door SLAMS again in their faces.\n          \n          ALEX'S OFFICE\n          \n          The doorknob RATTLES, no method this time. SHOUTS and BANGS\n          ring through the door. Ignoring it, Max surveys the room...\n          \n          The office is bare, no decorations or personal touches. Max\n          walks deeper into the room, opening a filing cabinet. Empty.\n          \n          Trying to remain calm while the door SHAKES violently, Max\n          turns his attention to the desk. One drawer empty...\n          \n          Max tries another drawer, and finds this one locked.\n          \n           ax drives his boot into the drawer, AGAIN and AGAIN.\n          \n                                 DETECTIVE (O.C.)\n                       What are you doing in there?\n          \n          Teeth gritted against the pain, Max delivers a final KICK.\n          \n          The drawer front shatters and collapses.       Max reaches inside.\n          \n           iles - not criminal jackets like the ones in Cold Case.\n          More official, somehow. Max flips through one at random...\n          \n          `GREEN, OWEN A.'       Not a mug shot, but a military ID photo.\n          \n                                                                            \n          \n          M\n          \n          \n          \n          \n          A\n          \n          \n          \n          \n                                                                   31.\n                     \n          \n          \n          Out in the hall, the crowd of detectives seems to grow\n          larger, the POUNDING on the door becoming more severe.\n          T\n           he SLAMMING sounds outside push Max deeper into the desk,\n          frantically spilling the contents onto the floor...\n          \n          Michelle's face.\n          \n          Max's eyes go wide.\n          \n          Another photograph of Michelle.\n          \n           nother.\n          \n          Shaking, Max's hands dig deeper...\n          \n          An impact sends CRACKS splitting up the length of the door...\n          \n          HOMICIDE OFFICE\n          \n          Two detectives throw their shoulders into the door. The rest\n          crowd around them, foaming at the mouth to get inside to Max.\n          \n          One more lunge...\n          \n          The door SHATTERS, sending the detectives tumbling inside...\n          \n          ALEX'S OFFICE\n          \n          Photos and documents are scattered across the floor, over\n          Alex's desk, mixed in with the fragments of the broken desk.\n          \n          From an open window, the storm's first flurries drift inside.\n          \n          Max is gone.\n          \n          EXT. STREET - NIGHT\n          \n          The snowfall has picked up, flurries giving way to thick\n          heavy flakes already sticking to the sidewalk. Max leans\n          into the stinging wind, lost in the night's revelations.\n          \n          Hax slows abruptly, looking back at the street behind him...\n           eavy shadows pool around the alleys, doorways and swelling\n          cars. The streetlights seem to carry less in the snow.\n          \n          A FIGURE walks down the opposite sidewalk. With heavy snow\n          filling the space between them, it's hard to make out much...\n          \n          ...but there's something flowing out from the figure's back.\n          \n          \n                                                                       \n          \n                       W\n          \n          \n          \n          \n          T\n          \n          \n          \n          \n                                                                      32.\n                     \n          \n          \n          Max turns back to the sidewalk ahead, jaw clenching...\n          \n          ALLEY\n          \n          Abruptly, Max's ducks into the mouth of alley. Back pressed\n          to the cold brick, he draws his pistol and CHAMBERS a round.\n          Unseen by Max, something moves in the shadows behind him...\n          \n           he street lamps begin to sputter. In the strobing light,\n          long black shadows billow from the Figure's shoulders...\n          \n          Max backs away from the corner, deeper into the dark alley\n          where three SHAPES are surging forward to meet him...\n          \n          Max dodges, but his pistol's KNOCKED to the pavement. Max\n          stumbles, bringing up his guard. The Man charges again. Max\n          sidesteps, grabbing an arm as he does, SNAPPING the bone...\n          O\n           ut on the street, the Man's SCREAMS mix with the howling\n          wind. The Figure steps into the street, towards the alley...\n          \n          Max is jumped from all sides, opponents finally coordinating\n          to overwhelm him. The Figure steps out of the wind...\n          \n          ...and what seemed to be wings turns out to be a long coat.\n          Mona Sax moves closer, opening that coat to reveal a thick\n          metal chain. Max GROWLS as arms pull him upright.\n          \n                                 MAX\n                       Lose your dog?\n          \n          Mona whips the chain into Max's face, CLANKING as it strikes\n          bone. Instantly, blood begins streaming from his mouth...\n          \n                                 MONA\n                       We need to talk about my sister.\n          \n          The chain CRACKS again, Max's teeth rattling from the blow.\n          \n                                 MAX\n                        hoever killed your sister did the same\n                       thing to my partner--\n                           (louder)\n                       It was the same person.\n          \n                                  MONA\n                       Yeah.   You.\n          \n          Mona HITS Max again, this time in the shins.    Max CRIES OUT.\n          \n          \n          \n          \n                                                                            \n          \n                                    M\n          \n          \n          \n          \n                             (\n          \n          \n          \n          \n                                                                      33.\n                     \n          \n          \n                                 MAX\n                            slurred)\n                       So stupid...\n          \n          Slowly at first, Mona WHIRLS the chain into a larger loop...\n          \n                                 MONA\n                       You left your wallet lying beside her\n                       body. Who's stupid?\n          M\n           ax slumps to the side, spitting out a stream of blood...\n          \n                                 MAX\n                       Does that sound like something a Homicide\n                       cop would get wrong?\n          \n          Mona whips the chain faster, CUTTING the air...thinking...\n          Gasping at the pain, Max slowly straightens up again.\n          \n                                 MAX\n                       You know somebody named Owen?\n          \n          Mona lets the chain's speed gradually slow again.\n          \n                                 MONA\n                       Owen Green?\n          \n                                 MAX\n                       Natasha called him on her way out of my\n                       apartment. Give me one day to--\n          \n          Mona drops the chain with a CLANK.\n          \n                                     ONA\n                       No.   Now.\n          \n          She motions for her men to haul Max to his feet.\n          \n          INT. OWEN'S BUILDING - HALLWAY - NIGHT\n          \n          Mona and Max storm down a dim apartment hallway in tense\n          silence. Max wipes the blood from the cuts on his face.\n          \n                                 MAX\n                       Who is this guy?\n          \n          Mona lets her coat fall open, revealing a machine gun.\n          \n                                 MONA\n                       Somebody my sister used to hang around\n                       with. Nice kid.\n                                 (MORE)\n          \n                                                                            \n          \n                                                                       34.\n                                  MONA(CONT'D)\n                           (chambering a round)\n                       You better hope he backs your story up.\n          \n                                 MAX\n                       I have things I need to ask him, myself.\n          \n          Mona flashes Max a look before POUNDING on a door.\n          \n                                 MONA\n                           (calling through the door)\n                       Owen, open up.\n          \n          A louder, longer KNOCK.\n          \n                                 MONA\n                       Open--\n          \n          A muted SCREAM filters through the door, cutting her short.\n          Max DRIVES his boot into the door, splintering the jam...\n          \n          INT. OWEN'S APARTMENT - CONTINUOUS\n          \n          Max and Mona rush into the room, breath smoking from the\n          cold. All of the windows are open. Gusts of snow blow\n          inside, drifts of white powder extending into the room...\n          \n                                 MAX\n                           (calling out)\n                       Owen?\n          \n          He SCREAMS his response from the next room.    They rush...\n          \n          LIVING ROOM\n          \n          ...through the door, weapons drawn.    Both stop short:\n          \n          OWEN GREEN is all alone in the room. SCREAMING, swatting at\n          empty air around him, each limb moving a different direction.\n          M\n           ax lowers his pistol - ready for anything, not for this.\n          \n          Owen's feet slip over the snow, toes curling desperately on\n          the ice, searching for traction as they slide closer...\n          \n                                 OWEN\n                           (breathless, to no one)\n                       Help me.\n          \n          ...to an open window on the other side of the room.\n          \n                                 MONA\n                       Owen?\n          \n          \n                                                                             \n          \n          .\n          \n          \n          \n          \n                                                                       35.\n                     \n          \n          \n          He doesn't seem to hear - sweat streams down his terrified\n          face, snowflakes frosting the perspiration on his chest.\n          Owen's eyes are instead drawn through the open windows...\n          \n           ..where SILHOUETTES flicker against the storm-darkened sky.\n          \n          Oblivious to the shapes outside, Max and Mona watch Owen's\n          terror intensify, his dervish dance growing more frantic...\n          \n          Outside every window, BLACK SHAPES float closer in the air\n          above the street - vaguely human, long wings POUNDING...\n          \n          ...sending gusts of wind ripping through the windows, kicking\n          up snow and ice. Max and Mona shrink back, shielding their\n          eyes at the blast as Owen's tortured SCREAMS fill the room...\n          \n          Twisting like he's trying to pull free from invisible hands,\n          Owen reaches the window. As if trying to push back, his\n          hands and feet fly up to the trim around the window...\n          \n                                 MAX\n                       Owen, wait...\n          \n          Unable to turn around, Owen's eyes find the reflected images\n          of Max and Mona in the window he's being pulled to...\n          H\n           is attention is torn from their reflections on top of the\n          glass by the spectres looming beyond it outside. Their claws\n          reach in, raking his body, pulling him closer...\n          \n          Realizing that Owen isn't stopping, Max rushes towards him.\n          \n                                 OWEN\n                           (screaming)\n                       Make them stop, tell them I can't fly...\n          \n          Max lunges forward, trying in vain to cover yards...\n          \n          ...when Owen only has inches.    He's ripped into the void...\n          \n          EXT. OWEN'S BUILDING - CONTINUOUS\n          \n          Max throws himself forward into the window, looking down...\n          \n          ...where Owen falls, looking up at Max helplessly...\n          \n          ... then less terrified, as the wind keeps RUSHING past...\n          \n          ...and then, just before impact, relieved.\n          \n          Owen CRASHES into the sidewalk.\n          \n          \n                                                                             \n          \n          B\n          \n          \n          \n          \n                                                                    36.\n                     \n          \n          \n          Mona races up to join Max in the window. For a stunned beat\n          they look down at the shattered body of Owen Green - his\n          unblinking eyes frozen on the heavens, collecting snowflakes.\n          \n                                 MONA\n                           (shaken)\n                       What did we just see?\n          \n          No answer, Max studies Owen's twisted body. Long, finger-\n          like bruises trace out from his neck, blending with the\n          tattoos that lace his grey skin. Grinning skulls, the USMC\n          eagle/globe/anchor...\n          \n          ...and a pair of wings, just like Natasha's.\n          I\n           NT. TATTOO PARLOR - NIGHT\n          \n          Max drops a Polaroid of Owen's tattoo onto a glass counter.\n          \n           lue water ripples through translucent pipes in the walls and\n          floor, the air of the small room glowing like the ocean. A\n          mirrored ceiling repeats the tattoo parlor again above.\n          \n                                 MAX\n                       You're sure this is the place?\n          \n                                 MONA\n                       Natasha had all her work done here.\n          \n          An elderly TATTOO ARTIST moves up behind the counter.\n          \n                                 ARTIST\n                       Something I can help you with?\n          \n          Max slides the photograph across to the Tattoo Artist.\n          \n                                 MAX\n                       What if I wanted this tattoo?\n          \n                                 TATTOO ARTIST\n                       Then you're probably in the Marine Corps.\n          \n                                 MAX\n                           (pointing to the wings)\n                       This one.\n          \n          The Artist stoops closer, tensing when he sees the design.\n          Mona leans over the counter, locking onto the Artist's eyes.\n          \n                                 MONA\n                       What is it?\n          \n          \n                                                                          \n          \n                                                                       37.\n                     \n          \n          \n          As encouragement, Mona lets her coat open to reveal her gun.\n          \n                                 TATTOO ARTIST\n                           (intimidated)\n                       It's a Norse superstition. The Vikings\n                       used to wear them for protection.\n          \n                                 MONA\n                       Trust me, my sister had all the guardian\n                       angels she needed.\n          \n                                 TATTOO ARTIST\n                       Not angels. Valkyries.\n          T\n           he Artist goes to a shelf bulging with old books - his\n          reference library. He searches through dusty volumes...\n          \n          Just past the shelves, a doorway is cracked open. A young\n          APPRENTICE artist hovers in the dark and listens in on the\n          conversation unnoticed - sweating, his pupils drawing back...\n          \n          Returning with a book, the Artist finds the page: a winged\n          woman led by a pack of wolves over a grizzly battlefield.\n          \n                                  TATTOO ARTIST\n                       In Norse mythology, the only way you get\n                       to go to heaven is to die in violence.\n                       Die in your sleep, you go to hell.\n                       Valkyries fly over the battlefields,\n                       picking out the righteous dead. They\n                       reward the people who draw first blood.\n                           (beat)\n                       A soldier's angel.\n          \n          Nodding, Mona lets her gun drift away from the Artist.\n          \n                                 TATTOO ARTIST\n                       I'm generally thrilled to have referral\n                       business, but I tell people looking for\n                       those wings to find ink closer to home.\n          \n                                 MONA\n                       Where's home?\n          \n                                 TATTOO ARTIST\n                       Some club down in Alphabet City.\n          \n          Mona turns to leave, satisfied, but Max is stuck on the book -\n          the valkyrie's empty eyes, bloody bodies at her feet...\n          \n                                 MAX\n                       Protection from what?\n          \n                                                                             \n          \n          I\n          \n          \n          \n          \n                                                                      38.\n                      (2)\n          \n          \n          Suddenly, all the lights go out.\n          T\n           he pipes stop glowing, blackness replacing the blue lights.\n          \n          Out of the corner of his eye, Max sees a DARKER SHADOW race\n          across the room towards them, almost too fast to be human...\n          \n          Max and Mona have time to duck; the Artist isn't so lucky. A\n          CRACK of bone, the old man's skull taking the brutal force...\n          \n          Mona's weapon BARKS, a short burst RIPPING through the air.\n          \n           n the momentary fire, Max can see the Shape swinging a club.\n          The bat CUTS through the air, SMASHING open glass pipes in\n          the wall behind Max, the shards raining down over him...\n          \n          The Figure charges at Max again.   Max's pistol CRACKS.\n          \n          The room is abruptly silent.\n          \n          The lights flash on.   Mona steps out of the back room...\n          \n          Max is stunned to find himself standing over nothing more\n          monstrous than the Apprentice - one hand over the hole in his\n          chest, the other weakly swinging a shard of glass at Max.\n                               A\n                               PPRENTICE\n                        (gurgling, to Max)\n                    They see you...they see you...\n          \n                              MONA\n                    Do you know this guy?\n          \n          Max shakes his head, struck mute by the look in the dying\n          man's eyes.\n          \n          INT. MAX'S CAR - NIGHT\n          \n          Max pushes the car over slick streets, clothes covered in the\n          Artist's blood. Lost in thought, Mona looks out the window.\n          \n                              MONA\n                        (without conviction)\n                    Maybe it isn't anything new.   People get\n                    strung out, act crazy...\n          \n                              MAX\n                    You think they were both on something?\n          \n          \n          \n          \n                                                                           \n          \n          M\n          \n          \n          \n          \n                                                                    39.\n                     \n          \n          \n                                  MONA\n                       Crystal meth, maybe, some amphetamine\n                       that raises your body temperature in an\n                       overdose. Explains why they were both\n                       sweating like that, trying to cool off.\n                           (beat)\n                       Of course, a junky won't usually jump out\n                       the window if there's someone left in the\n                       room to beg or rob.\n          \n           ax nods his agreement, replaying Owen's death in his mind.\n          \n                                 MAX\n                       You were standing right beside me.\n          \n                                    MONA\n                       And?\n          \n                                 MAX\n                       Jumped is not the word I'd use.\n          \n          \n          EXT. RAGNA ROK - DUSK\n          \n          In a block of abandoned storefronts, only one retains a spark\n          of life, its red sign burning in the dying light: RAGNA ROK.\n          T\n           he streets are more crowded there, people shuffling towards\n          that sign and the sounds of DARK MUSIC filtering from inside.\n          \n          INT. MAX'S CAR - DUSK\n          \n          Max's car turns onto the block, slowly approaching Ragna Rok.\n          Max and Mona silently absorb the scene on the street. Even\n          from halfway down the block, BASS from the club reaches them.\n          \n                                 MONA\n                       They all look...\n          \n          Across the street, Max watches someone dragging a limp body\n          by one leg. Nobody he walks past seems to notice.\n          \n                                    MAX\n                       Like Owen.\n          \n          Max keeps his speed slow, idling away up the block.\n          \n                                 MAX\n                       This isn't anything I've seen before.\n          \n          \n          \n          \n                                                                          \n          \n                                 M\n          \n          \n          \n          \n                                                                       40.\n                     \n          \n          \n          Ragna Rok recedes in the mirror, the block between it and the\n          car studded with more smoldering cars and dead-eye faces,\n          their numbers seeming to grow even as Mona watches.\n          \n                                  ONA (CONT'D)\n                       You ever been to Rome?\n          \n          Max doesn't answer, the coming plague before him registering.\n          Mona glances up at a passing street sign - \"LITTLE ITALY.\"\n          \n                                 MONA (CONT'D)\n                       Better cities than this one have fallen.\n                           (pointing to the curb)\n                       This is far enough.\n          \n          Mona opens her car door and climbs out, leaning back inside.\n          \n                                 MONA (CONT'D)\n                       Sorry about the chain.\n          \n          Mona SLAMS the door and moves off down the sidewalk, blending\n          into the crowd. Max drops the car into gear, giving one last\n          glance to Ragna Rok before pulling away.\n          T\n           here's some flicker of movement on the rooftop...\n          \n          U\n          EXT. RAGNA ROK - ROOFTOP - DUSK\n          \n           p on the roof, MUSIC inside the club RATTLES old pipes.\n          Perched at the edge of the roof, a figure CHANTS along...\n          \n          Jack Lupino - the tattooed face we caught   a glimpse of in the\n          candle light of Trevor's party, now fully   visible in the\n          failing sun and no less frightening. His    colorless eyes\n          absorb the street, the SCREAMS, Max's car   pulling away...\n          \n          On his back, the tattoos of two elaborate black wings. Steam\n          rises from ink-blackened skin, snow melting before it lands.\n          \n          INT. MAX'S APARTMENT - NIGHT\n          \n          Max sits in his chair in the silent room, turning the pages\n          of Michelle's book. There's more than grief on his cut and\n          bruised face tonight, hands not trembling the way they were.\n          \n          Fruit bowls, delicate charcoal nudes flip past...\n          \n          Frustrated, Max lets the images drift by with less sentiment:\n          images no longer speaking to the questions he needs answered.\n          With an exasperated sigh, Max slams the book closed...\n          \n          A faint white sliver appears in the cover.\n          \n                                                                             \n          \n          T\n          \n          \n          \n          \n                                                                    41.\n                     \n          \n          \n          Max leans closer. It's the corner of a piece of paper,\n          protruding from a razor-thin cut in the spine of the\n          sketchbook, invisible under all but the closest inspection.\n          \n          Max runs his thumbnail into the gap, spreading glue CRACKLING\n          - he flinches, almost afraid to cause the book pain.\n          F\n           or a moment, Max is caught between his desire to protect the\n          memento and to see what's hidden inside. A deep breath...\n          \n          With a sharp pull, the cover of the book SHEARS away.\n          \n          The pages wad and wrinkle, old paint flaking off. The cover\n          he'd caressed RIPS. Fluttering to the floor, a sheaf of\n          yellowed pages hidden in the cover flutter to the floor.\n          \n          Max opens the folded pages. The first is nearly identical to\n          what we saw inside: a bouquet of flowers, unfinished. Max\n          scrutinizes the pencil strokes...suddenly, his eyes go wide:\n          \n          A little pair of bat-like wings. In the corner of the page,\n          having nothing to do with the rest of the still life.\n          \n          Max turns to the next page. There's a another drawing of\n          wings - larger this time, pencil strokes more energetic.\n          \n          Horrified by what he's seeing, Max's hands tremble as they\n          turn the page. On the next, the wings are the main drawing.\n          \n          On the next, they're scrawled in smeared ink.\n          \n                                 MAX\n                           (nauseous, to himself)\n                       No...\n          \n          The wings begin to lose their shape, overlapping.\n          \n          Growing together.\n          \n          The last page is completely black.\n          \n          INT. COP BAR - NIGHT\n          \n          Even with everybody out of uniform, the builds and body\n          language mark this as a cop bar. BB rushes inside, hair\n          giving him away as having been asleep shortly before.\n          \n           he bar is still decorated with plastic mistletoe and fake\n          snow. BB looks at the BARTENDER, who motions to the back...\n          \n                                                                       42.\n          \n          \n          \n          BACK BOOTH\n          \n          BB fights his way to a corner booth, where Max is slumped\n          over a beer and a shot. A matching set wait for BB across\n          the table. BB pulls off his coat and sits, forced casual.\n          \n                                  BB\n                       It was sitting at this very table that\n                       your father told me I needed to retire.\n                           (beat)\n                       For about a minute, I just sat here\n                       thinking about knocking him out of his\n                       chair. The job was everything to me, to\n                       the point that I couldn't see the writing\n                       on the wall - what it was doing to my\n                       marriage, my health. Your old man knew\n                       if I was going to listen to reason, it\n          B            could only happen in here.\n          \n           B stoops down to find Max's eyes, trying for a connection.\n          \n                                 BB\n                       There's nothing you can't say in here.\n                       It's like hallowed ground.\n          \n          For a long beat, Max works up the nerve to speak.\n          \n                                 MAX\n                       I watched a guy throw himself out of a\n                       window tonight. The things he was saying-\n          \n                                 BB\n                       Any guy who throws himself out a window,\n                       I wouldn't pay any attention to the\n                       things he said.\n          \n                                 MAX\n                       The problem is, I knew what he was\n                       talking about.\n          \n          BB tries to nod his understanding, but concern creeps in.\n          \n                                 MAX\n                       I haven't been really afraid of anything\n                       since...that night.\n          \n                                 BB\n                       And you are now?\n          \n                                 MAX\n                       There's something going on, and I can't\n                       find a rational explanation for it.\n                                 (MORE)\n                                                                             \n          \n                                    B\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n          B\n          \n          \n          \n          \n                                                                        43.\n                                     MAX(CONT'D)\n                       There's...something out there, hurting\n                       people--\n          \n                                 BB\n                       Okay, calm down.\n          \n                                    MAX\n                       It's real.     I'm not crazy.\n          \n                                 BB\n                       Then stop acting like it. Max, you're\n                       breaking into offices, I.A. is all over\n                       you, you won't even show up for work...\n          \n                                 MAX\n                       The night Alex died, there was something\n                       else in the room with us. I saw it.\n          \n                               B\n           B goes a bit pale, smile fading as Max's words continue.\n          \n                                  B\n                       It's really important that you be careful\n                       how you talk to people about this, okay?\n                       You're already under suspicion--\n          \n                                 MAX\n                       It's the same thing these people are\n                       seeing right before they die.\n                           (beat, pained)\n                       I think Michelle saw it, too.\n          \n                                 BB\n                       For God's sake, don't drag her into this.\n          \n           ax stands up, storming towards the exit. BB pulls out a\n          thick money clip and overpays before following...\n          \n          EXT. COP BAR - NIGHT\n          \n          BB rushes out, struggling to keep up with Max's longer legs.\n          \n                                 BB\n                       What's really going on here?\n          \n                                 MAX\n                       Alex found something out about what\n                       happened to her. Something new.\n          \n                                  B\n                       There's no way.    He would have told us.\n          \n                                 MAX\n                       He was trying, right before he died...\n          \n                                                                              \n          \n                           (\n          \n          \n          \n          \n                                                                   44.\n                     \n          \n          \n                                 BB\n                       Listen, okay? Why don't you come back\n                       with me, let Beth make up the guest room\n                       for you. Just for tonight.\n          \n          Max nods, but keeps moving away from BB.\n          \n                                 BB\n                       You need to take some time. Get some\n                       sleep, heal up. See if it still feels\n                       real after that...\n          \n                                    MAX\n                       It's real.\n          \n          Max crosses against the light, cutting through the driving\n          snow. BB tries to follow, but traffic pushes him back.\n          H\n           elpless, BB can only bury his hands in his pockets and watch\n          Max fade away. After a moment, he pulls something out...\n          \n          A business card: `J. BRAVURA, I.A.'\n          \n          EXT. TRAIN PLATFORM - NIGHT\n          \n          In a ticket booth, an elderly ATTENDANT shivers by a space\n          heater, ticket windows plugged with make-shift insulation.\n          \n          The attendant looks up from his book and sees Max approaching\n          through the snow. Max slows as he gets closer, looking up at\n          the glowing threshold to the trains beyond. He stops.\n          \n                                 ATTENDANT\n                           (via intercom)\n                       You riding?\n          \n          Max holds for a moment. For all the danger he's faced, this\n          is the most hesitation we've seen from him so far.\n          \n                                 ATTENDANT\n                            via intercom)\n                       If you're coming, you better come on.\n                       Way it's looking, might be the last train\n                       tonight.\n          \n          Max takes a step into the light of the ticket booth. The\n          attendant opens the ticket slot, letting a gust of freezing\n          air blow inside. Max slides a few bills through.\n          \n          Ticket in hand, Max starts his solitary march to the trains.\n          \n                          (\n          \n          \n          \n          \n                                                                     45.\n          \n          \n          \n          INT. GOGNITTI'S HOTEL - BAR - NIGHT\n          A\n            dingy, dark bar on the first floor of an even sleazier\n          hotel. It's nearly empty, only the dedicated DRUNKS\n          venturing out in the storm. The front door swings open...\n          \n          The old men shiver at the stiff blast of wind rushing in,\n          turning to look. Napkins flutter. Snowflakes blow inside.\n          \n          From a booth in the corner, VINNIE GOGNITTI (50s, pudgy)\n          shoots a hard look at the open door, not immediately\n          recognizing the SILHOUETTE in the passage...\n          \n                              VINNIE\n                    In or out, asshole.\n          \n          Mona steps inside, boots heavy with ice. Her MEN follow.\n          Flanked by MEN of his own, Vinnie freezes when he sees Mona.\n          \n                                 VINNIE (CONT'D)\n                    So?\n          \n                               MONA\n                    We need to talk.\n                        (beat)\n                    Talk.\n          \n          Gradually, Vinnie and his men relax.\n          \n                               VINNIE\n                    Shut the door, then. You Ruskies may be\n                    used to it, but I'm freezing my dick off\n                    over here.\n          \n          BACK OFFICE\n          \n          They've packed into a tiny back office - Russian gunmen on\n          one side of the desk, Italians on the other. Mona and Vinnie\n          represent their different sides, the only people seated.\n          \n                                 VINNIE\n                    Okay.     So talk.\n          \n                              MONA\n                    Something was taken from me. It involves\n                    a club in Italian territory, so I need\n                    your blessing to go make it right.\n                              V\n                               INNIE\n                    You're asking my permission?\n                         smirking to his men)\n                    Well in that case, sweetheart...\n          \n                                                                          \n          \n                                    M\n          \n          \n          \n          \n          V\n          \n          \n          \n          \n                                                                       46.\n                     \n          \n          \n          Mona looks Vinnie over, bored to death by the whole thing.\n          \n                                 MONA\n                       I said `blessing.'\n          \n                                 VINNIE\n                       Oh. Well, blessing might cost extra.\n                       Which club are we talking about?\n          \n                                    MONA\n                       Ragna Rok.\n          \n           innie tries to keep a poker face, but the name chills him.\n          \n                                 MONA (CONT'D)\n                       Over on Avenue--\n          \n                                 VINNIE\n                       Yeah, I know.\n                           (beat, rattled)\n                       Sure, fine. You have my\n                       permission...blessing, whatever.\n          \n          Mona frowns, her wishes granted a little too easily.\n          \n                                 MONA\n                       You do still control that block, right?\n                       It's south of--\n          \n                                 VINNIE\n                       The guy's name is Jack Lupino.\n          \n                                 MONA\n                       Well, that sounds Italian to me.\n          \n                                 VINNIE\n                       He's no kind of Italian I've ever seen.\n                       Tattooed freak, a real sicko from what we\n                       hear.\n          \n                                  ONA\n                           (sneering)\n                       You're afraid of tattoos, now?\n          \n                                 VINNIE\n                       When the club first opened, I sent\n                       somebody down to collect the...you know,\n                       fire insurance. A day goes by, and I\n                       don't see him. Then I get two boxes\n                       delivered to me. One box's got my guy's\n                       hands and ears in it. The other box has\n                       a quarter of a million dollars in cash.\n          \n                                                                             \n          \n          E\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n                                                                     47.\n                      (2)\n          \n          \n                                MONA\n                      This neighborhood has been your family's\n                      forever. Two-fifty large is all it takes\n                      to--\n          \n                                 VINNIE\n                      What got my attention, Mona, was that the\n                      boxes were delivered by a cop car. A guy\n                      in uniform hands them to me in broad\n                      daylight.\n                          (beat)\n                      I'm not scared of tattoos, or freaks, or\n                      mouthy Russian bitches. But whoever's\n                      watching over Lupino, whoever it is you\n                      really need to bless you walking inside\n                      Ragna Rok...him, I am scared of.\n          \n          EXT. SUBURBAN TRAIN STATION - NIGHT\n          \n          The platform is cleaner than the ones in the city - dressed\n          up for the tastes of the COMMUTERS who step off of the train.\n          \n          Max threads his way through the handful of exhausted\n          BUSINESSMEN arriving home, moving out into the darkness.\n          \n          EXT. SUBURBAN NEIGHBORHOOD - NIGHT\n          \n          The snow's driving just as hard out here, but peaceful houses\n          with warm windows glowing make the storm feel comforting. In\n          the yards, forgotten sleds disappear under new powder, gone\n          for good by morning. Snowmen distort as they swell.\n          \n          Max Payne trudges up the center of the street, a black streak\n          spoiling the peace of the evening. A trespasser.\n          T\n           HE HOUSE\n          \n          One house on the block stands out: there's no neatly shoveled\n          driveway, no colorful Christmas lights flashing from the\n          eaves. A black void behind every window, no life inside.\n          \n           ax stands in the street, looking up at the house.\n          \n                                BB (V.O.)\n                      She was thirty-five. The daughter, two\n                      months. From what we could tell, it\n                      started out as a robbery.\n          \n           XT. HOUSE - BACK YARD\n          \n          A row of footprints lead around back.\n          \n          \n                                                                          \n          \n          G\n          \n          \n          \n          \n                       M\n          \n          \n          \n          \n                       B\n          \n          \n          \n          \n                       B\n          \n          \n          \n          \n                                                                    48.\n                     \n          \n          \n                                 BB (V.O.)\n                        oth of the men had records, mostly\n                       bullshit - possession, petty theft.\n          \n          Hanging in the overgrown hedges, an overlooked scrap of\n          yellow police tape shimmers in the wind.\n          \n                                 BB (V.O.)\n                        ut that day...I don't know. They had\n                       something else on their minds.\n          \n          Max stands at the back door. He touches the unpainted wood\n          around the glass, repairs never fully complete.\n          \n                                 BB (V.O.)\n                        ax was maybe ten minutes late.\n          \n          Max reaches for the handle...hesitant to actually touch...\n          \n                                                               CUT TO:\n          \n          INT. HOUSE - LATE AFTERNOON (FLASHBACK)\n          \n          A living room in the stillness of evening, golden air packed\n          like amber around baby bottles and toys on the coffee table.\n          The front door opens, and a man steps inside...\n          \n          Max Payne, different in every way: the malnourishment and\n          neglect gone from his face, a fullness in his frame from\n          M\n          regular home-cooked meals. Shave and a haircut. Nice suit.\n          \n           ax picks up the mail from the floor and strolls inside...\n          \n          KITCHEN\n          \n          Tie loosened, Max gets a beer from the fridge. Unwinding, he\n          takes a long sip and begins sorting through the mail.\n          \n           lancing up from the mail, Max sees the kitchen door...\n          \n          Glass smashed.    Blinds torn.   Standing open.\n          \n          STAIRWAY\n          \n          Max charges upstairs.    MEN'S VOICES echo down from above.\n          \n                                 MAX\n                           (calling out)\n                       Michelle!\n          \n          His eyes aren't hard yet. Rushing up the stairs, we see\n          Max's faith in the world start to crack for the first time...\n          \n                        (\n          \n          \n          \n          \n                                                                    49.\n          \n          \n          \n          HALLWAY - CONTINUOUS\n          \n          Max turns the corner into a hallway bathed in golden\n          afternoon light, the same one he saw in the river...\n          \n          Between Max and the end of the hall, two JUNKIES are huddled\n          against a door. Twisting the handle, SMACKING the wood.\n          \n          Max pulls a pistol from a low-pro holster, stepping forward.\n          \n                              MAX\n                        (calling out)\n                    Michelle?\n          \n          The Junkies turn to Max, eyes black and glassy.    Sick smiles.\n          \n                              MAX\n                         shouting to the door)\n                    Michelle, I'm right here...\n          \n          Without a word, the Junkies charge.\n          \n          Max takes aim and BLASTS one of them in the forehead. The\n          M\n          other keeps rushing, swinging a long knife at Max's neck.\n          \n           ax ducks, a quarter-second and a quarter-inch from a slit\n          throat. The swing throws the thin man off balance...\n          \n          He tries again - ropy muscles straining skin speckled with\n          tracks. Max grabs his arm, throwing the thin man off\n          balance. They go down to the hardwood floor together.\n          \n          Too close to line up a shot, Max drives the butt of the\n          pistol into the man's nose, SPLITTING it across the bridge.\n          Blood spatters his gaunt face, but those eyes never change...\n          \n                                 JUNKIE\n                    It's okay.     They're angels, now.\n          \n          Straining, he moves the knife's tip closer to Max's belly...\n          \n          Max jams the barrel under the Junkie's leering jaw and PULLS\n          THE TRIGGER. Blood atomizes into a hanging cloud around him.\n          \n          Max jumps up and races to the door.    Locked from the inside.\n          \n                              MAX\n                        (calling, frantic)\n                    Michelle!\n          \n          Max throws his shoulder into the door, SNAPPING the hinges...\n          \n                                 B\n          \n          \n          \n          \n                                                              C\n          \n          \n          \n          T\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n                                                                      50.\n          \n          \n          \n          BEDROOM - CONTINUOUS\n          \n          The momentum sends Max tumbling inside...\n          \n          A MAN slips out of the window, one leg still inside...\n          \n           ax OPENS FIRE at the retreating shape.\n          \n          Curtains billow in front of the open window, a summer sunset\n          outside. Max lets the gun fall to his side, breathing hard.\n          M\n           ichelle huddles on the bed, baby wrapped tight in her arms.\n          Max rushes over to her, reaching out to touch her shoulder.\n          \n                              MAX\n                    Michelle...\n          \n          Her mouth is wide open, eyes unfocused.    Muscles slack.\n          \n          Michelle's not stunned.    She's not unconscious.\n          \n           he baby isn't just sleeping.\n          \n          The moment that hits him, the lights go out of Max's eyes.\n          \n                                                                UT TO:\n          \n          INT. BEDROOM - NIGHT\n          \n          Max stands at the door, seeing the room with those same eyes.\n          \n          The furniture is gone, all the carpet ripped out. One window\n          is still open, no frilly curtains blocking the blackness\n          outside. Snow gusts in, piling on the sill.\n          \n                              BB (V.O.)\n                    We looked everywhere for the third guy,\n                    but there was nothing to go on. Not a\n                    hair of him left behind.\n          \n          Slowly marching across the room, Max SLAMS the window shut.\n          \n          INT. ASGARD BUILDING - BB'S OFFICE - NIGHT\n          \n          BB stands in the window, watching the storm.\n          \n                               B\n                    I called in a favor before I retired, had\n                    him transferred to Cold Case while he\n                    dealt with the shock of it. I thought it\n                    we were patient, gave him time, Max would\n                    come back to his old self again.\n          \n                                                                         \n          \n                                                                      51.\n                     \n          \n          \n          Bravura sits in front of the desk, watching BB. When BB\n          finally looks over, the weight of the story showing in his\n          eyes, Bravura's face B\n                               doesn't reveal any hint of emotion.\n          \n                                  B\n                       Look, I called you because I thought I\n                       recognized something in you. I thought\n                       if we could talk off the record--\n          \n                                 BRAVURA\n                       I'm listening.\n          \n                                 BB\n                           (emotional)\n                       This isn't just some job stress freak-\n                       out. This is a man who lost everything,\n                       and who deserves a little understanding\n                       from the rest of us. If you'd known him\n                       before...\n                           (beat, pained)\n                       You'd want to believe him, too.\n          \n                                 BRAVURA\n                       Believe him about what?\n          \n          Not expecting this turn in the conversation, Bravura sits up.\n          \n                                 BRAVURA\n                       Are you saying you think Max did have\n                       something to do with Alex's murder?\n          \n                                 BB\n                       Absolutely not. Alex was his partner,\n                       they were like brothers...he couldn't\n                       have. There's no way.\n          \n                                 BRAVURA\n                       Then what are we talking about?\n          \n                                 BB\n                       Look, Max is like a son to me. Don't put\n                       me in a position to have to hang him.\n                           (beat, pained)\n                       But you should hear the kinds of things\n                       he's saying...hallucinations, none of it\n                       makes any sense to me. I'm worried he's\n                       going to get into another situation\n                       before I can convince him to come in.\n                                 B\n                                  RAVURA\n                       Are you telling me he was--\n          \n          \n                                                                            \n          \n          T\n          \n          \n          \n          \n          B\n          \n          \n                               B\n          \n          \n          \n          \n                               B\n          \n          \n          \n          \n                                                                    52.\n                      (2)\n          \n          \n                              BB\n                    I'm telling you to find him tonight,\n                    before somebody else gets hurt.\n          \n          Bravura nods, reeling from the revelation of this new\n          information. BB picks up his coat and starts for the door.\n          \n                              BB\n                    Is there anything we can do to help you\n                    bring him in? Unofficially, of course...\n          \n                              BRAVURA\n                    Bringing him in won't be a problem.\n                    Where I need your help will be his--\n          \n                               B\n                    Why do you say that?\n          \n          Bravura stands, finishing a note.\n          \n                               RAVURA\n                    A New Jersey unit ID'd him near his old\n                    house. It shouldn't be long.\n          \n           B nods, somberly mulling this over.\n          \n                              BB\n                    You have to find him first, protect him.\n                    Some of the guys from Alex's unit beat\n                    you to him, they won't wait for a trial.\n          \n          EXT. STORAGE SPACE - NIGHT\n          \n          At the edge of a strip mall, a ramshackle personal storage\n          business sits behind a razor-wire fence. Inside the fence,\n          rows of stalls for rent, covered by metal garage doors.\n          \n           here's the faint sound of METAL STRETCHING, and Max is over\n          the fence. He moves through the rows, reading the numbers.\n          \n          A padlock hangs from the door, shining metal glazed over with\n          a sheet of ice. Max finds a pristine key on a ring in his\n          pocket. Hands shaking, he cracks the ice and tries...\n          I\n           NT. STORAGE SPACE\n          \n          The garage door raises, cold metal RATTLING as it rolls up.\n          \n          Max stands silhouetted in the doorway, looking in on ragged\n          stacks of cardboard boxes. His breath blooming around him.\n          \n          \n          \n                                                                          \n          \n          `\n          \n          \n          \n          \n          T\n          \n          \n          \n          \n          W\n          \n          \n          \n          \n                                                                    53.\n                     \n          \n          \n          Max steps inside, pulling a box marked `GARAGE' out into the\n          light. Opening it, he roots around and finds a flashlight.\n          Switched on, a golden beam cuts through the blue shadows.\n          \n          Max walks deeper into the space, brushing the light over the\n          boxes. He holds his hand over one, as if warming it...\n          \n          Max opens the box.\n          \n           aiting for him under the flaps, a stuffed animal stares up\n          at Max from inside the box. Silly grin, frozen eyes shining.\n          \n          Hands trembling, Max pushes the toy aside. Deeper in the\n          box, he finds a framed picture and pulls it into the light...\n          \n          The photograph is of Max - younger, cleaner, genuinely\n          smiling. Posed along with him, Olan Mills-style, are\n          Elizabeth and the baby. Gauzy backdrop, church clothes.\n          \n          Max studies it, haggard new face reflecting in the glass...\n          \n          Abruptly, Max jumps up and moves away from the box. Long\n          strides, trying in vain to physically shake the memories, to\n          block out the emotions with something productive...\n          \n          The flashlight beam keeps sweeping, deeper and deeper. Max\n          chokes back tears, occasionally glancing at the baby box.\n          \n           he beam hits on a document box in the back row.   `OFFICE.'\n          \n          Max rushes over, nearly tipping the other boxes in his hurry\n          to throw the lid off the document box. Rows of folders, all\n          M\n          neatly labeled with feminine script.\n          \n           ax brushes his fingers over the tabs, smiling sadly.    Each\n          year numbered -- `1998,' `1999,' `2000'...\n          \n                                 MAX\n                           (to himself)\n                       Okay, Chelle. Help me, here...\n          \n          Max's fingers skim to the last file in the box, marked\n          `2004.' Much thinner than the others. Her last year.\n          \n          Only one file in the final section. Max opens it, finding\n          pages of handwritten notes, photocopies, drawings...\n          \n          Closing the file, he checks the name on the tab and frowns.\n          \n           PROJECT VALHALLA.'\n          \n          T\n          \n          \n          \n          \n                              V\n          \n          \n          \n          \n                                                                     54.\n          \n          \n          \n          EXT. STORAGE SPACE - NIGHT\n          \n          Max steps out of the storage locker. He tucks the manila\n          folder inside his coat and pulls the metal door closed.\n          \n          He starts away, retracing his steps to the fence. Mind\n          reeling with what he's just seen, the memories flooding back--\n          \n          There's a second set of footprints in the snow before him.\n          \n          Max freezes, their significance immediately registering.\n          \n                               OICE (O.S.)\n                    Stay where you are!\n          \n          A YOUNG COP steps out of the shadows behind Max, pistol\n          trained on the back of his head. The cop's eyes are wide\n                               M\n          with panic. He assumes an awkward, textbook firing position.\n          \n                               AX\n                        (turning slowly)\n                    Relax, I'm a cop.\n          \n                              YOUNG COP\n                    Don't move! I know who you are.\n          \n           he gun stays trained on Max.    Slowly, he raises his hands.\n          \n                              MAX\n                    Just relax. I need you to trust me for a\n                    minute...\n          \n                             YOUNG COP\n                    Yeah? Is that what you said to your\n                    partner?\n          \n                              MAX\n                    You don't understand.\n          \n                              YOUNG COP\n                        (gesturing with the gun)\n                    Lay down on your face.\n          \n          Max studies the cop - stiff legs unsteady on the deep snow,\n          his frostbitten fingers wrapped around the trigger. Trapped\n          between two rows of locked doors, Max has no cover to run.\n          \n          Peeking through the snow at Max's feet, an extension cord\n          snakes under the shivering cop's legs and down the corridor.\n          \n          \n          \n          \n                                                                         \n          \n          T\n          \n          \n          \n          \n                                                                       55.\n                     \n          \n          \n                                 MAX\n                           (bending down)\n                       Okay, just take it easy.\n          \n          Max starts to lay down, causally laying his hand over the\n          power cord. The cop edges closer, smirking as Max complies.\n          \n                                 YOUNG COP\n                       Word's gotten around about the sick shit\n                       you did to him, too. If I were you, I'd\n                       get ready for sort of a long ride back\n                       into the city...\n          \n          Max wraps his hand around the cord and whips it tight...\n          \n          The cop pitches backward, squeezing off a SHOT as he falls.\n          Before he can fire again, Max pounces on the cop, driving a\n          T\n          knee into his chest and wrenching the pistol away.\n          \n           he cop twists in the extension cord, unplugging the lights.\n          Max DRIVES the butt of the pistol into the side of his head.\n          \n           he cop goes limp. Max pulls the clip, clears the chamber\n          and lets the gun fall in the snow beside the unconscious cop.\n          \n          Struggling to his feet, Max races down the corridor and\n          scaling the icy chain link. He drops into the snow,\n          immediately breaking into a dead run on the other side.\n          \n          INT. ELEVATOR - NIGHT\n          \n          An express elevator HISSES upwards at great speed, the sleek\n          interior like a European sports car. Alone inside, Jason\n          Colvin watches the blur of numbers with dread.\n          \n          A muted CHIME, and the doors draw back...\n          \n          INT. AESIR SKYSCRAPER - PENTHOUSE OFFICE - NIGHT\n          \n          Thin steel beams loft through the air, three stories of open\n          air encased by glass, a silent void projected into the heart\n          of the storm. In the center of the room, a single black bar.\n          \n          It's a desk, obsidian, polished to a mirrored sheen. Aesir\n          International's cool blue logo reflects across its surface.\n          \n          Jason Colvin approaches the desk, nervously watching the\n          shadowed figure of Nicole Horne read through a document.\n          Every hair, every stitch of clothing perfect.\n          F\n           ootsteps ECHOING, he reaches the desk and waits for a beat.\n          \n          \n                                                                             \n          \n          O\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n          `\n          \n          \n          \n          \n          N\n          \n          \n          \n          \n                                                                       56.\n                     \n          \n          \n                                 COLVIN\n                       We have a problem.\n          \n           icole cuts her eyes to Colvin - withering, a current of fear\n          passing through him. With great effort, she smiles.\n          \n          INT. TRAIN - NIGHT\n          \n          Max slumps in his seat, watching the black sky whip past.\n          The manila folder closed in his hands, fingers tracing the\n          edges. Slowly, carefully, he lets the folder fall open.\n          \n          Max's eyes skim across the handwritten notes, lingering over\n          underscored phrases and circled words. Drinking it in.\n          \n          On the next page, a sketch of black wings pulls Max's\n          attention. With dread, he reads a note below the drawing:\n          \n           SUBJECTS DESCRIBE DEMONIC VISIONS, HYSTERICAL RAGE...'\n          \n                                 MAX\n                           (to himself)\n                       Subjects?\n          \n          The hypnotic motion of the train begins to change, the rhythm\n          of the RAILS faltering a little.\n          \n           ax turns the page. More wings, each in a slightly different\n          style, each version surrounded by descriptive notes...\n          \n          Max skims, excited, as the train's HICCUPS grow worse...\n          \n          As the blue and black world sweeps past outside the window,\n          Max's face softens almost into a smile...\n          \n          All the lights go out.    The train rapidly loses speed...\n          S\n           tartled voices MURMUR. Windows that had been black glow to\n          life as the passengers' eyes adjust to the dark car...\n          \n           utside, the moonless night becomes a hazy expanse of blue\n          snow, covering the embankments along the railroad tracks and\n          the broken-down houses in the distance.\n          \n          The darkness changes Max, too, hardening his face again. He\n          tucks the folder safely into his coat and zips it up tight.\n          \n          At the front of the car, the windows begin to fill with\n          light. The door opens, a flashlight beam sweeps inside...\n          \n          Pistol between his knees, Max pulls the hammer back...\n          \n          \n                                                                         \n          \n          C\n          \n          \n          \n          \n                                                                    57.\n                     \n          \n          \n          An obese CONDUCTOR (40s) steps inside. Immediately, all of\n          the other passengers begin to QUESTION HIM at once.\n          \n                                 CONDUCTOR\n                           (shouting over)\n                       Ladies and gentlemen, please remain calm.\n                       The storm's caused a power failure, but\n                       it's absolutely nothing to worry about.\n                       We'll be up and running again before\n                       long.\n          \n          Movement outside catches Max's eye. A FIGURE in the shadows\n          alongside the train. Gravel CRUNCHES. Voices WHISPER.\n          \n                                 CONDUCTOR (cont'd)\n                       Our policy is to move everyone up to the\n                       front car until the lights come on again.\n                       It'll be a little warmer if we're all\n                       together...\n          M\n           ax splits his attention between the other passengers and the\n          window, watching for more movement outside...\n          \n          Suddenly, the Figure breaks in the opposite direction - no\n          attempt at quiet, a POUNDING run away from the train.\n          \n           onfused, Max straightens up.    The temperature has changed...\n          \n          THREE MORE FIGURES, running in the opposite direction.    Away\n          from the train, up the snowy tracks it's yet to cross.\n          \n                                 MAX\n                           (recognizing)\n                       Get out of the train.\n          \n          PASSENGERS fill the aisle. High school girls sneaking into\n          the city... An old man going to work... Drunk yuppies in red\n          and green scarves, on their way back from a Holiday party...\n          \n                                 MAX\n                           (shouting)\n                       Get out--\n          \n          An EXPLOSION rips through the front of the car and swells, a\n          ball of fire smashing through the car and blowing it apart...\n          \n          EXT. CITY STREET - NIGHT\n          \n          Up and down the dark street, shadowed GHOULS break windows\n          and claw at abandoned cars, searching for anything of value.\n          \n          \n          \n                                                                          \n          \n          F\n          \n          \n          \n          \n          W\n          \n          \n          M\n          \n          \n          \n          \n                                                                  58.\n                     \n          \n          \n          Moving comfortably through the shadows, Mona follows the\n          general movement towards a BASSY QUAKE farther up the block.\n          \n          A red neon `RAGNA ROK' bloodies the snow in the air, marking\n          the entrance to the club responsible for the RUMBLE...\n          I\n           NT. RAGNA ROK - NIGHT\n          \n          Inside, that music is EARSPLITTING - a jet engine at 200\n          beats per minute. Lights strobe past red gels, frozen\n          glimpses of thin limbs and black pupils on the dance floor.\n          \n           ona melts into a corner, inconspicuously watching the room.\n          \n           inding around the dance floor, CLUBGOERS - some ragged, some\n          in nice clothes - queue at a metal door in the back wall.\n          One after another, they wait for their moment to enter...\n          \n          There's a disturbance at the front door. Black-clad Guards\n          force open a rift in the crowd on the dance floor...\n          \n          Jack Lupino walks inside the rift - his tattooed face red and\n          black, eyes calmly sweeping out across the riotous crowd...\n          \n           ROM THE DANCEFLOOR\n          \n          Lupino moves through bodies roiling like a parted sea, sheer\n          walls of twisting flesh towering above him to the rafters.\n          \n          Mixed within, the wings POUND and SWEEP, blotting the light.\n          \n          Hell.\n          \n          INT. BB'S HOUSE - BEDROOM - NIGHT\n          \n          BB crawls out from under the quilts, careful not to wake his\n          WIFE. He passes windows frosted with ice, on his way to...\n          \n          HALLWAY\n          \n          BB shuffles down the hall, shivering in his boxers. He\n          pauses at the thermostat, frowning to find the heat cut off.\n          B\n           B turns, startling as Max steps out of the shadows - steps\n          stiff with pain, clothes dripping icy water across the floor.\n          \n                                 BB\n                           (terrified)\n                       Max? What are you doing?\n          \n          Max opens his coat and pulls out the file, now badly wrinkled\n          and soggy. He opens it and hands BB a newspaper clipping.\n          \n                                                                       \n          \n                                   M\n                       I\n          \n          \n          \n          \n                                   B\n          \n          \n          \n          \n                                   M\n          \n          \n          \n          \n                                                                      59.\n                     \n          \n          \n          `25 CIVILIANS KILLED IN AL-HASAMAH MASSACRE'\n          \n                                 BB\n                       Those grunts who went crazy in Iraq?\n          \n                                  AX\n                       Go a little further, read what they did\n                       to the bodies. It's the same as what\n                       happened to Alex and that girl.\n          \n          BB reads on, frowning.\n          \n                                  B\n                       Where did you get this?\n          \n                                   MAX\n                       Michelle.\n          \n          BB looks up, startled, as Max pages through Michelle's notes.\n          \n                                  MAX\n                       It's all in her notes: people describing\n                       fevers, hallucinations...their lymph\n                       nodes swell until their necks bruise like\n                       something's been choking them.\n                           (pointing to the drawings)\n                       The angels they all talk about? Michelle\n                       talks about eye spasms that make things\n                       seem to flutter. Mixed with the other\n                       delusions, that starts looking like\n                       wings...\n                           (beat)\n                       She wasn't seeing them. She was trying\n                       to figure out why other people were.\n                                  B\n                                  B\n                         thought she was working on allergy\n                       medicines.\n          \n                                  AX\n                       Somebody at Aesir knows what--\n          \n                                 BB\n                           (thunderstruck)\n                       Oh, my God.\n          \n          Slowly, BB turns to show Max the grief in his eyes.\n          \n                                   BB\n                       It's me.    I killed Alex.\n          \n          \n          \n                                                                            \n          \n                    B\n          \n          \n          \n          \n                    Y\n          \n          \n          \n          \n                                                                   60.\n                      (2)\n          \n          \n                              MAX\n                    What are you talking about?\n          \n                              BB\n                    He came to me about six months ago,\n                    asking about one of the executives at\n                    Aesir. At the time I had no reason to\n                    connect it to Michelle, I just thought...\n                        (beat, torn up)\n                    I tried to warn him, this guy has\n                    connections to some scary people--\n          \n                               MAX\n                    Who?   What's his name?\n          \n          BB hesitates, rattled by the rage in Max's eyes.\n          \n                               BB\n                    Jason Colvin. He used to be the head of\n                    the pharmaceutical division, but he's\n                    moved up over the last few years.\n                        (beat)\n                    I guess Michelle probably reported\n                    directly to him...\n          \n          Max barely nods, jaw clenched as he scoops up the documents.\n          \n                              BB\n                     ou've got copies of this stuff, right?\n          \n          Thinking for a moment, Max sets the folder down again and\n          turns away towards the dark hallway. BB picks up the folder.\n          \n                              BB\n                     e careful, Max.\n          \n          Max doesn't respond, storming off into the shadows.\n          \n          EXT. RAILROAD TRACKS - DAWN\n          \n          The snow isn't deep near the charred and twisted metal of the\n          train, melted by the fireball. Police tape rings the area.\n          D\n           ETECTIVES wander between yellow tarps in the train, sipping\n          coffee. Out on the tracks, Bravura works alone.\n          \n                              HOMICIDE COP\n                    Looks like ten bodies, give or take.\n                    Even in New York, that ought to be enough\n                    to earn Payne the spike.\n          \n          \n          \n                                                                         \n          \n                                 Y\n          \n          \n          \n          \n                       B\n          \n          \n          \n          \n                                                                       61.\n                     \n          \n          \n                                 BRAVURA\n                       The blast point is outside the train.\n          \n          None of the detectives want to encourage him by answering.\n          \n                                 BRAVURA\n                        ased on the spread of the wreckage...\n                       they moving very fast, either.\n          \n                                 HOMICIDE COP\n                       He forced them to stop, first.\n          \n          Bravura nods at the explanation, but without conviction.       He\n          continues to scan the wreckage, still not satisfied...\n          \n                                 BRAVURA\n                       So he had the bomb with him inside, but\n                       he decided to walk outside to detonate\n                       it?\n          \n                                 HOMICIDE COP\n                       Are you asking if that seems like odd\n                       behavior from a guy who cut his partner's\n                       head off?\n          \n          The Young Cop from the storage building slips down the snowy\n          bank and towards Bravura. His face is bruised and swollen.\n          \n                                  OUNG COP\n                       You wanted to see me?\n          \n                                 HOMICIDE COP\n                       Careful what you say to him, if you ever\n                       want to make detective...\n          \n                                 YOUNG COP\n                           (to Bravura, guarded)\n                       I already filled out a report.\n          \n          Bravura sees the Young Cop aware of the detective's presence.\n          \n                                 BRAVURA\n                       Show me where it happened, then.\n          E\n           XT. STORAGE FACILITY - MORNING\n          \n          Bravura and the Young Cop stand on the spot where he fought\n          Max the night before - disturbed snow, the frayed cord...\n          \n                                 YOUNG COP\n                       He jumped out and wrapped that cord\n                       around me, and before I had a chance...\n          \n                                                                             \n          \n                       I\n          \n          \n          \n          \n          A\n          \n          \n          \n          \n                                                                    62.\n                     \n          \n          \n          Bravura nods at the bullshit, focus drawn to Max's locker.\n          \n                                 BRAVURA\n                           (pointing)\n                       He was coming out of here?\n          \n          When the Young Cop nods, Bravura starts to step inside.\n          \n                                 HOMICIDE COP\n                       Hey, real cops are working here...\n          \n          INT. MAX'S STORAGE LOCKER - MORNING\n          \n          A few CSI TECHS take photographs of Max's storage locker.\n          Bravura walks through, eyes quickly scanning the distracting\n          jumble of boxes. The Homicide Cop follows, exasperated.\n          \n           t the back, Bravura stops and picks something up. It's the\n          lid of the box, `OFFICE' written in Michelle's pen.\n          \n          Bravura looks around. There's no document box to match the\n          lid. However, there are dust-free rectangles in the dirt.\n          \n                                 BRAVURA\n                           (to a CSI tech)\n                       Where's the stuff you guys moved?\n          \n                                 CSI TECH\n                       Nothing's been moved.\n          \n                                 HOMICIDE COP\n                       What, you playing detective now?\n          \n          On a mission, Bravura scans the rest of the room. He sees\n          another open box, a colorful stuffed animal peeking out.\n          Bravura opens it, startled by the family portrait.\n                               B\n                                  RAVURA\n                           (studying the photo)\n                       This is his wife?\n          \n          Bravura finally looks up to see the Homicide cop smirking.\n          \n                                 BRAVURA\n                         spent four hours up at Homicide going\n                       through Alex's desk and cataloging\n                       pictures of this woman, and not one of\n                       you bastards bothered to mention that she\n                       was Max Payne's wife?\n          \n          \n          \n          \n                                                                          \n          \n                                                                        63.\n                     \n          \n          \n                                  HOMICIDE COP\n                           (shrugging)\n                       If Alex was getting a little something on\n                       the side--\n          \n                                 BRAVURA\n                       Who are you protecting?\n          \n          Bravura charges closer, carrying enough force that the much\n          larger Homicide Cop steps back. His cool facade crumbles.\n          \n                                 HOMICIDE COP\n                       Nobody, we just...why would anybody talk\n                       to IA without a reason?\n          \n                                 BRAVURA\n                           (livid)\n                       You've got a reason, now. Tell me\n                       everything you know about this woman,\n                       starting with her name.\n          \n          EXT. AESIR BUILDING (MIDTOWN) - DAY\n          \n          The city is starting to shut down under the relentless snow -\n          the sidewalks are nearly empty, only cabs on the icy streets.\n          \n          The Aesir corporate offices gleam in the diffuse light, a\n          pillar of glass and steel disappearing up into the storm...\n          \n          R\n          Jason Colvin steps out of a cab and marches up the steps.\n          \n           ECEPTION AREA\n          \n          Stepping off of the elevator, Colvin passes a RECEPTIONIST.\n          \n                                 COLVIN\n                       You should go on home, already.   There's\n                       nothing going on today...\n          \n                                 RECEPTIONIST\n                       Well, there's someone in your office...\n          \n          COLVIN'S OFFICE\n          \n          Colvin steps through the doorway and stops short.\n          \n          Max stands behind Colvin's desk, inspecting the photographs\n          hanging on the wall. He's cleaned himself up a little.\n          \n                                 MAX\n                           (pointing to a photo)\n                       This your daughter?\n          \n                                                                              \n          \n                                  M\n          \n          \n          \n          \n                              (\n          \n          \n          \n          \n                       N\n          \n          \n          \n          \n                                  M\n          \n          \n          \n          \n                                                                      64.\n                     \n          \n          \n                                 COLVIN\n                       Yes, it is. Three years old.\n          \n          For reasons Colvin can't fathom, Max's mood seems to darken\n          even farther. Colvin sees the badge clipped to his belt.\n          \n                                  COLVIN\n                       Is there something I can help you with,\n                       detective?\n          \n                                  AX\n                       You can tell me about Project Valhalla.\n          \n                                 COLVIN\n                           (nervous laugh)\n                       I think you might have the wrong...\n          \n          Barely keeping his poker face, Colvin eyes the phone.\n          \n                                 MAX\n                        eed to make a call?\n          \n                                 COLVIN\n                       Maybe I'd better.\n          \n          Max motions for Colvin to go ahead. While the executive's\n          shaking hands dial the number, Max closes and LOCKS the door.\n          \n                                 COLVIN\n                       Yes, there's a detective here...\n                            to Max)\n                       What did you say your name was?\n                                 M\n                                   AX\n                       Max.\n          \n          Abruptly, Max RIPS the phone cord out of the wall.\n          \n                                  AX\n                           (low)\n                       She was my wife.\n          \n          The words, Max's flat delivery, catch Colvin like ice water.\n          Still holding the dead receiver, Colvin staggers back...\n          \n                                  COLVIN\n                           (stunned)\n                       Excuse me?\n          \n                                 MAX\n                       Michelle Payne was my wife.\n          \n          \n                                                                            \n          \n                                                                     65.\n                      (2)\n          \n          \n          What color there was to begin with drains out of Colvin.\n          \n                              COLVIN\n                    What--\n          \n                              MAX\n                    Before you say anything else, I want you\n                    to know who I am.\n          \n                              COLVIN\n                    Please, wait...\n          \n          Max throws his elbow up, CRUSHING Colvin's nose.\n          \n          INT. AESIR BUILDING - LOBBY - DAY\n          \n          Bravura enters the soaring lobby of the Aesir building,\n          stomping his shoes clean. He approaches the front desk.\n          \n                              BRAVURA\n                        (flashing his badge)\n                    I need to talk to somebody about a woman\n                    who used to work here.\n          \n          COLVIN'S OFFICE\n          \n          Colvin's eyes flutter open.   His nose is smashed flat.\n          \n          He's being held upright by his belt, which loops around his\n          neck and the headrest of his ergonomic chair. His wrists are\n          bound to the armrests with strips of his tie.\n          \n          Max sits on the edge of the desk, heavy lamp in his hand.\n          \n                              COLVIN\n                        (weakly, eyeing the lamp)\n                    Please don't hit me again.\n          \n          Max wraps the cord in his hand and jerks it free from the\n          lamp, which he tosses with a CRASH. The cord, he keeps.\n                               M\n                               AX\n                    A week ago, I thought the universe had\n                    turned against me. Everything I loved\n                    was gone, and for some reason I'd been\n                    left here to suffer alone.\n          \n          Max strips back the insulation on the cord, exposing two\n          frizzed bundles of wire: one brass, the other silver.\n          Positive and negative. Colvin watches, apprehensive.\n          \n          \n          \n                                                                          \n          \n          T\n          \n          \n          \n          \n                       B\n          \n          \n          \n          \n                                                                       66.\n                     \n          \n          \n                                 MAX\n                        ut it wasn't the universe that took my\n                       family away from me.\n          \n          Max plugs in the cord.\n          \n                                 MAX\n                       It was you.\n          \n          He crouches by Colvin, wire in each hand, moving them closer.\n          \n                                 MAX\n                       Tell me about Valhalla.\n          \n          Colvin struggles to pull away from the approaching wires...\n          \n                                 COLVIN\n                       There is no--\n          \n          Max brushes the bare wires against Colvin's throat.\n          \n           here's a bright SPARK.       Colvin SCREAMS.\n          \n                                  MAX\n                       Tell me.\n          \n                                 COLVIN\n                       There's no Project Valhalla anymore.   I\n                       shut it down years ago.\n          \n          A timid KNOCKING starts on Colvin's door, VOICES calling in.\n          Max waits for more, eyes frozen, wires hanging ready.\n          \n                                 COLVIN\n                           (reluctant)\n                       It was a disaster. The drug was so\n                       addictive, the damage it did to the mind\n                       was so devastating that we lost our\n                       government funding. By the end, we\n                       couldn't even guarantee the safety of our\n                       scientists administering the experiment.\n                       Test subjects would follow them home and\n                       kill them for an extra dose.\n                                 M\n                                  AX\n                       Is that what happened to Michelle?\n          \n                                 COLVIN\n                       Nobody knows what happened to her.\n          \n          Max picks up a cup of coffee from the desk and pours it over\n          Colvin's face as he struggles more frantically.\n          \n                                                                             \n          \n          C\n          \n          \n          \n          \n                           (\n          \n                               C\n          \n          \n          \n          \n                                                                    67.\n                      (2)\n          \n          \n          Max brings the wires closer to Colvin's wet skin.\n          \n                               OLVIN\n                         terrified)\n                    People thought Michelle might be a\n                    whistle-blower. That she wasn't loyal\n                    enough to Aesir, and she might go public\n                    about the program.\n          \n          Max's eyes thaw, hit by the first true words about her death.\n          \n          LOBBY\n          \n          Bravura sits in the lobby, impatiently skimming a magazine.\n          On the far side of the enormous room, movement draws his eye:\n          \n          A line of black-clad SECURITY GUARDS swiftly moving in\n          formation into a stairwell. SWAT precision, heavy hardware.\n          \n          Bravura springs up, approaching the Guards left at the door.\n          \n                              GUARD\n                    Authorized personnel only.\n          \n          Bravura pulls out his badge, and plans to keep moving...\n          But the guards don't immediately part. They look at each\n          other, silently conferring. Bravura's eyes light up.\n          \n                               BRAVURA\n                    Don't look at him.    Move aside.\n                         (louder)\n                    I\n                      'm authorized.\n          \n           OLVIN'S OFFICE\n          \n          Max lets the wires fall away.   Solemnly, he draws his pistol.\n          \n                              COLVIN\n                    Why are you asking me about this?\n          \n                              MAX\n                    I already told you.    Be quiet, now.\n          \n          Max chambers a round, leaving his hand up to block the spray.\n          \n                              COLVIN\n                    But why today? It's over, I got rid of\n                    everything before they moved me out of\n                    the division--\n          \n          \n          \n          \n                                                                          \n          \n          F\n          \n          \n          \n          \n                           (\n          \n          \n          \n          \n                                                                       68.\n                     \n          \n          \n                                 MAX\n                       Then you haven't been Downtown lately,\n                       because you missed a spot.\n          \n          Colvin looks up, Max's words suddenly scarier than the gun.\n          \n                                 COLVIN\n                       Are you telling me that there are people\n                       out there taking the drug again?\n                            urgent)\n                       How many of them?\n          \n          Max shakes his head.    Colvin's eyes show real terror.\n          \n                                 COLVIN\n                       I knew it, I knew something was going on.\n                       I told her the numbers were too good--\n          \n          The POUNDING outside the door is louder, more VOICES calling.\n          \n                                 VOICE (O.C.)\n                           (calling through the door)\n                       Mr. Colvin, are you okay in there?\n                       Security's on its way...\n          \n          Max turns to the door - trapped, ready to fire on what comes\n          through. Colvin looks at Max, a sudden realization dawning.\n          \n                                 COLVIN\n                       They're not coming for you.\n          \n                                 MAX\n                       What are you talking about?\n          \n          Colvin begins to struggle harder than ever, but his fear\n          isn't directed at the man with the gun standing over him.\n                               C\n                                  OLVIN\n                       You only know my name because somebody\n                       high up decided to cut me loose.\n                           (gesturing)\n                       There's a safe in the wall. It's open.\n          \n           earing a trap, Max pushes aside a painting and pulls open\n          the door. A small stack of DVDs sits inside.\n          \n                                 COLVIN\n                       Show that to whoever will watch. If this\n                       thing spreads, nothing will keep the rest\n                       of you safe.\n          \n          \n          \n                                                                             \n          \n                           (\n          \n          \n          \n          \n                                                                     69.\n                      (2)\n          \n          \n          Max looks at the middle manager, desire to pull the trigger\n          slowly losing out to the credibility of Colvin's story.\n          \n          Max unfastens the belt, using it to hoist Colvin to his feet.\n          \n                                COLVIN\n                          (terrified)\n                      Wait, I'm not ready...\n          \n          HALLWAY\n          \n          OFFICE WORKERS draw back and GASP as Colvin's bloody face\n          appears. Max is close behind, holding the belt around\n          Colvin's neck, pressing his pistol to the back of his head.\n          \n                                MAX\n                      Back up, all of you.   Make a path.\n          \n          There's a disturbance at the back of the crowd - glimpses of\n          black uniforms fighting forward. The Guards.\n          \n          Max pivots, holding Colvin towards the Guards as a shield.\n          \n                                MAX\n                           calling to the guards)\n                      Stay back, or I'll--\n          \n          CRACK!    Colvin's head snaps back, blood spraying over Max.\n          T\n           he crowd goes crazy, SCREAMING and trampling each other...\n          More SHOTS ring out, ripping through Colvin as Max lets his\n          lifeless body fall and hides his retreat in the scramble...\n          \n          The Guards chase after Max, slowed by the panicking crowd...\n          \n          STAIRWELL\n          \n          Exhausted, Bravura plods up steps to a landing. Suddenly,\n          AUTOMATIC WEAPONS erupt nearby. He fumbles for a cell phone.\n          \n                                 BRAVURA\n                      This is Jim Bravura, IA. You need to\n                      tell the units responding to the Aesir\n                      call to come equipped for automatic--\n                          (frowning)\n                      The Aesir building, nobody's called\n                      anything in yet?\n                          (beat)\n                      Hell yes, I'd like to report something.\n                      We've got machine gun fire in Midtown.\n          \n          \n          \n                                                                           \n          \n          M\n          \n          \n          \n          \n                                                                         70.\n                     \n          \n          \n          Bravura snaps his phone shut, trying to regulate his breath.\n          Drawing a tiny service revolver he creeps to the door...\n          \n          HALLWAY\n          \n          Max stumbles up the hall. He chances a look back at the\n          black-clad GUARDS crashing through office workers...\n          \n          A BURST of machine gun fire POUNDS the floor in front of\n          Max's feet. More Guards seal off the hall ahead. Nowhere\n          else to go, Max grips a cubicle wall and vaults over...\n          M\n           ax gets a few careful SHOTS off from his new elevation,\n          dropping Guards who've lost sight of him as he jumps from\n          desk to desk, working deeper into the maze of cubicles...\n          \n          The fastest Guards race ahead to block off a burning `EXIT'\n          sign. Max's boots THUNDER across desks, papers flying...\n          \n          The Guards ahead FIRE, but Max shows now sign of slowing.\n          Overhead lights EXPLODE, smoke and sparks raining down...\n          \n          Max launches himself into the air, pistol CRACKING as he\n          falls. Bullets RIP through the retreating Guards...\n          \n          Max hits the ground hard, scrambling through the exit...\n          \n          ANOTHER HALL\n          \n          ...and around the corner.\n          \n                                 BRAVURA\n                           (shouting)\n                       Put your hands up!\n          \n          Max slides to a stop, startled to see Bravura aiming at him.\n          While he doesn't exactly comply, Max does lower the barrel.\n          \n                                 BRAVURA\n                           (more human)\n                       You need to come in now, before anything\n                       else gets pinned on you.\n          \n           ax shakes his head.       HEAVY BOOT STEPS rumble closer...\n          \n                                 MAX\n                       She was trying to stop it.\n          \n                                    BRAVURA\n                       Stop what?     Tell me what's happening--\n          \n          \n          \n                                                                              \n          \n          `\n          \n          \n          \n          \n          S\n          \n          \n          \n          A\n          \n          \n          \n          \n          .\n          \n          \n          \n          \n          G\n          \n          \n          \n          \n                                                                     71.\n                     \n          \n          \n          Bullets STRAFE the wall just above Max's head. He dives to\n          the ground, plaster dust and smoke pluming above him.\n          W\n           hile Max scrambles for cover, Bravura charges forward,\n          waving his badge in the air above him.\n          \n                                  BRAVURA\n                       NYPD!   Hold your fire!\n          \n           uards flow into the hall, a black mass bristling FIRE. It\n          takes a split second for Bravura to realize they aren't\n          stopping. He slips, tumbling back as bullets RIP past him...\n          \n                                 BRAVURA\n                           (screaming)\n                       Hold your fire!\n          \n          Finally, the machine guns go quiet. Smoldering gunpowder\n          clouds the hallway. Bravura and the Guards search...\n          \n           ..but Max has disappeared into the smoke.\n          \n          EXT. STREET - NIGHT\n          \n          Mona struggles up a narrow street, buffeted by the wind.\n          Ahead, flashing blue and red lights electrify the snow.\n          \n            squad car idles towards her, searchlight flashing into dark\n          shadows. Mona ducks her head away as the spotlight finds her\n          at her building door. For a moment, she's in a whiteout.\n          \n           lowly, the cop car moves on. Mona starts to use her key...\n          but the lock has already been forced open.\n          \n          INT. MONA'S APARTMENT - NIGHT\n          \n          Mona steps inside, ready for ambush.    She turns the corner...\n          \n          Max sits on her couch, scraped and scorched from his escape.\n                               M\n                                  AX\n                           (pointing to the TV)\n                       You need to see this.\n          \n          ON SCREEN:\n          \n          Over black, the Aesir corporate logo flashes up, quickly\n          replaced by a simple block-letter title card:\n          \n           PROJECT VALHALLA: PROMOTIONAL SPOT #3'\n          \n          \n          \n                                                                         \n          \n          S\n          \n          S\n          \n          \n          \n          \n          O\n          \n          \n          \n          \n                                 A\n          \n          \n          \n          \n          O\n          \n          \n          \n          \n                                                                      72.\n                     \n          \n          \n                                 ANNOUNCER (V.O.)\n                       From the beginning of time, great\n                       generals have all wrestled with one\n                       undeniable truth - morale wins battles.\n          \n           ver an up-tempo ROCK SOUNDTRACK, a slick montage of war\n          imagery: tanks roaring over sand dunes, missiles ripping\n          through palace walls, American troops firing machine guns...\n          \n                                 ANNOUNCER (V.O.) (CONT'D)\n                       Fear, fatigue, loss of focus...the future\n                       of combat medicine lies in the mind of\n                       the soldier.\n          \n          A cutting-edge lab, SCIENTISTS working complex machinery.\n          \n                                  NNOUNCER (V.O.) (CONT'D)\n                       Thanks to breakthroughs made by Aesir\n                       Pharmaceuticals, the military of tomorrow\n                       will be able of unlock the limitless\n                       potential inside every soldier.\n          \n           n screen, the shot cuts to the interview of a YOUNG SOLDIER\n          in uniform. He smiles easily, confident, eyes alert but\n          maybe a little distant. Something familiar about him...\n          \n                       H         YOUNG SOLDIER (V.O.)\n                        ow has my experience in combat changed\n                       since being selected for Project\n                       Valhalla?\n                           (beat, smiling)\n                       I'm never scared, for starters.\n          \n           uperimposed under his face: `PVT. JACK LUPINO.'\n          \n           tartled, Mona moves closer to the screen.\n          \n                                 MONA\n                       That's the guy.\n          \n                                 MAX\n                       What are you talking about?\n          \n                                 MONA\n                       He's the one behind Ragna Rok. It's his\n                       club where the drug's being sold.\n          \n                                 LUPINO (V.O.)\n                       You face down a group of insurgents and\n                       instead of fear, you're filled\n                       with...peace, I guess.\n                                 (MORE)\n          \n                                                                            \n          \n          S\n          \n          \n          \n          \n                              M\n          \n          \n          \n          \n                                                                    73.\n                      (2)      LUPINO(CONT'D)\n                    Like you're aware of the power you have\n                    in your own hands to make the world a\n                    better place.\n          \n          Max studies Lupino's image - thinner, no visible tattoos.\n          All-American. There's already something in his eyes, though.\n          \n          As Mona sits back down, Max brushes past her to get his coat.\n          \n                               ONA\n                    So what do we do now?\n          \n          Max stands up from the couch and starts away. Confused, Mona\n          tries to follow, but stumbles when something pulls her back:\n          \n           he looks down to see she's been handcuffed to her chair.\n          \n                               MONA\n                    What are you doing?\n                         (beat, louder)\n                    Uncuff me.\n                         (beat, louder still)\n                    Hey!\n          \n          On screen, Lupino smiles, beads of sweat forming on his face.\n          Deliberately, Max stops the DVD and cuts off the television.\n          \n                    W         MONA\n                     hat is this? You think just because he\n                    killed your partner, you can decide\n                    whether I--\n          \n          When Max finally speaks, the sound scrapes out of his throat\n          like he hasn't used his voice in years:\n          \n                              MAX\n                    He killed my wife.\n          \n          Mona struggles at the cuff, chain CLANKING but holding.\n          \n                              MONA\n                    I've been inside that club.   You don't\n                    have a chance on your own.\n                        (realizing)\n                    But you don't care.\n          \n          Max stoops down to pick up Mona's machine gun where it leans\n          against the base of the couch. Mona THRASHES helplessly.\n          \n                              MONA\n                    You don't want my help, because you think\n                    if he puts you out of your misery, you'll\n                    get to see her again.\n          \n                                                                         \n          \n          E\n          \n          \n          \n          \n          B\n          \n          \n          \n          \n          I\n          \n          I\n          \n          \n          \n          E\n          \n          \n          \n          \n                                                                    74.\n                      (3)\n          \n          \n          Without a look back, Max starts out the door.\n          \n                                MONA\n                      I hope that's really the way it works.\n          \n          The door pulls shut behind him.\n          \n           XT. RAGNA ROK - NIGHT\n          \n          The red neon sign is only an ember, muted under caked ice.\n          \n           n a chair blocking the front door, a GUARD watches the\n          silent street, shivering uncontrollably.\n          \n           NT. RAGNA ROK - NIGHT\n          \n          Inside, the dance floor is empty. Sitting at the top of the\n          stairs, another GUARD sleeps, rifle propped beside him.\n          \n           ACK ROOM\n          \n          A room like the inside of a smoker's lung - walls painted\n          black, haze from candles and whatever else blurring the air.\n          Jack Lupino sits on the floor surrounded by candles, watching\n          the flames with manic focus. Two GUARDS stand above him.\n          I\n           nto a bent spoon, Lupino taps greenish powder from a small\n          glass vial. He uses the candle to heat the spoon. Checking\n          his watch, one of the guards produces a cell phone and dials.\n          \n                                GUARD #1\n                          (on phone)\n                      All quiet, 4 a.m.\n          \n          Lupino dips a needle into the spoon, drawing the bubbling\n          green liquid into the body of the syringe.\n          \n           XT. RAGNA ROK - NIGHT\n          \n          The guard stomps his feet, trying in vain to keep some blood\n          flowing. Blowing in his hands, he looks both ways down a\n          street that is still just as empty as it has been for hours.\n          \n                                GUARD\n                          (chattering, to himself)\n                      Screw this...\n          \n          Frozen fingers fumbling with the keys, the Guard opens the\n          door. Moving the chair just inside the doorway, the guard\n          settles in the alcove...\n          \n          \n          \n                                                                          \n          \n          L\n          \n          \n          \n          \n          M\n          \n          \n          \n          \n                                 L\n          \n          \n          \n          \n                                                                        75.\n                     \n          \n          \n          He pulls the door shut. It won't. Something's blocking it.\n          The guard stands up, opens it wider to build some momentum...\n          \n          Max stands on the top step.\n          \n          BACK ROOM\n          \n          Lupino shoots up, gritted teeth tugging his belt tourniquet\n          tight. Eyes clinched, beads of sweat already forming.\n          \n          The muffled BLAST of a machine gun, out on the dance floor.\n          The Guards surrounding Lupino spring into action.\n          \n                                 GUARD #1\n                       W\n                        ait here, Mr. Lupino.\n          \n          Lupino lets the belt slip free, a deep SIGH rattling out. He\n          opens his eyes, just in time for us to see the irises\n          retracting. Candles shine in the black holes left behind.\n          \n                                  UPINO\n                       I don't need protection.   I have my own.\n          \n          The Guards at the door lock and load, moving out...\n          \n          BALLROOM\n          \n          Max walks into the ballroom, motionless Guard bleeding out on\n          the dance floor before him. Gunsmoke hangs in the air...\n          \n          In that final stillness, Max checks his clip.     Stone-faced.\n          \n          Thundering BOOTS echo out from the belly of the building.\n          Doors fly open - Guards racing out from the kitchen on the\n          first floor, two more from the office CRASHING out upstairs.\n          \n           ax OPENS UP, flames of automatic fire lighting his way.\n          \n          BACK ROOM\n          \n          Lupino and the Guards listen to the SHOOTING grow closer.\n          Suddenly, the metal door flies open, BANGING at the stop.\n          With lightning reflexes, THE GUARDS BLAST down the hallway.\n          \n           upino slowly stands, eyes glowing in the guard's muzzle\n          flash. Forgotten now, he fades away into the smoke.\n          \n          The Guards crumble and fall until the room goes SILENT.\n          M\n           ax melts out of the smoke, weapon raised.     Hunting.\n          \n          \n          \n                                                                              \n          \n          I\n          \n          \n          \n          \n                       C\n          \n          \n          \n          \n          L\n          \n          \n          \n          \n          U\n          \n          \n          \n          L\n          \n          \n          \n          \n                                                                     76.\n                     \n          \n          \n          The back room is deeper than the poor light gives away.\n          Max's boots grind over burned-out candles, occult runes...\n          \n          Lupino launches out of the darkness at Max.   Before he sees\n          it coming, Lupino drives a hard punch into Max's skull.\n          \n          Max stumbles forward, ears ringing from the blow. Lupino\n          draws a gleaming knife from his boot and springs on Max.\n          \n           upino swings the knife so quickly it becomes a blur, blade\n          WHISTLING as it cuts through the smoke. He slashes the knife\n          across Max's thigh, dropping him to the ground.\n          \n           nable to stand, Max thrusts the rifle up for protection.\n          The blade CLANKS against the barrel, carving deep trenches in\n          the stock, finally gashing the back of Max's fingers.\n          \n          Blood rushes from the cuts, loosening Max's grip on the\n          weapon. Teeth gnashing like an animal, Lupino reaches out\n          and tries to pull the machine gun out of Max's hands.\n          \n           upino buries the knife into Max's shoulder.    He CRIES OUT.\n          \n                                 LUPINO\n                        an you hear them, now?\n          \n          Lupino drives his knee into Max's chest. Arm numb from the\n          stab wound, Max's grip on the gun is slowly overpowered.\n          Helplessly watching it slip away, Max SCREAMS with rage...\n          E\n           XT. RAGNA ROK - NIGHT\n          \n          Outside, no voice could carry on that raging WIND. TWO\n          FIGURES walk up the street, closing slowly on Ragna Rok.\n          \n           NT. RAGNA ROK - BACK ROOM - NIGHT\n          \n          Lupino leans over Max, one hand grinding the knife deeper\n          into his shoulder, the other wrenching the machine gun free.\n          Max desperately tries to dig his nails into the grip...\n          \n                                 LUPINO\n                       We'll see which one us they're flying\n                       for. We'll see who they love best.\n          \n          Sweat streams down Lupino's face, dripping down onto Max.\n          Fingernails splitting, Max finally loses hold of the gun.\n          The sudden shift in momentum pitches Lupino back.\n          \n          For an instant, they are apart.\n          \n          \n          \n                                                                          \n          \n          S\n          \n          \n          \n          \n          B\n          \n          \n          \n          \n                       Y\n          \n          \n          \n          \n                             (\n          \n          \n          \n          \n                                                                       77.\n                     \n          \n          \n          In that instant, Max pulls the knife from his own shoulder\n          and buries it to the hilt in Lupino's stomach.\n          \n          Lupino drops the machine gun. Max clamps his hand over\n          Lupino's throat, using his grip to force the knife deeper.\n          While Lupino GASPS, eyes wide, Max struggles to his feet.\n          \n                                 MAX\n                       Who is your contact at Aesir?\n          \n          Lupino looks down at the knife in his stomach.       Fascinated.\n          \n                                 MAX\n                            louder)\n                       Who sent you after Michelle?\n                                 L\n                                  UPINO\n                           (with difficulty)\n                       You are so blessed.\n          \n          Max looks at Lupino - up close, his undyed skin is ashen and\n          pockmarked, older than his age. Blood drools from his lips.\n          Lupino's eyes swim around, lost in a fog of drugs and pain.\n          \n                                 MAX\n                        ou don't know what I'm talking about, do\n                       you?\n          \n          Lupino's eyes stop swimming.    For a moment, he sees Max.\n          \n                                 LUPINO\n                       The angels are not done with you yet.\n          \n          Lupino's skull explodes.\n          \n          Max spins towards the hall, but another SHOT rakes across his\n          shoulder and slings him to the ground. Defenseless, Max can\n          only lift his eyes to see who's coming to finish it...\n          \n           B steps out of the smoke.\n          \n          As Max reels at the sight of BB, JOE SALLE (50'S) rumbles in.\n          \n           alle stomps on Max's wrist, in the same motion telescoping a\n          metal baton and CRACKING it across his skull. With the grace\n          of an old pro, Salle snaps on a pair of handcuffs.\n          \n                                   MAX\n                             (in shock)\n                       BB?\n          \n          Max is hauled to his feet - bleeding, cuffed, and trapped.\n          \n                                                                            \n          \n          B\n          \n          \n                                 B\n          \n          \n          \n          \n                    G\n          \n          \n          \n          \n                           (\n          \n          \n          \n          \n                    A\n          \n          \n          \n          \n                                 M\n          \n          \n          \n          \n                                                                     78.\n                      (2)\n          \n          \n          And BB walks right on by.\n          \n                               AX\n                    What's going on here, BB?\n          \n          As Max watches in disbelief, BB paces around the room taking\n          stock - noting the dead Guards, crouching over Lupino's body.\n                               B\n                               B\n                     t ease, soldier.\n          \n          Max struggles to break free of Salle's grasp.\n          \n                                 MAX\n                    Hey!\n          \n                                 JOE SALLE\n                           (draws pistol, re. Max)\n                    Now?\n          \n                              BB\n                    Not unless you feel like carrying him out\n                    of here. Max knows me, and I definitely\n                    don't know Mr. Lupino.\n          \n                              MAX\n                         shouting)\n                    Look at me, BB.    At least face what\n                    you're doing...\n          \n          BB finally does look at Max.    Cold, dead eyes.   A stranger.\n          \n                                 BB\n                     row up.\n          \n          EXT. RAGNA ROK - NIGHT\n          \n          BB steps through the door, over the guard's upturned chair.\n          \n          The blizzard has won - streets and sidewalks no longer\n          scraped, cars long abandoned under their icy cocoons. The\n          fifth largest city in the world, reduced to a ghost town.\n          \n                               B\n                    Happy New Year.\n          \n           B strides out in front, taking in the sight. It might as\n          well be a desert, white sand sifting around their boots,\n          buildings rising above like black canyon walls.\n          \n          Max shuffles along behind BB, head bent low in the wind.\n          Plumes of his ragged breaths trailing out behind him.\n          \n                                                                          \n          \n                                                                        79.\n                     \n          \n          \n                                 BB (cont'd)\n                       Look at it from my perspective: this\n                       thing is going to be a true epidemic.\n                       One hundred percent dependence within a\n                       few doses, and we control the only\n                       source. This is so much bigger than\n                       Lupino's little bar. This is every\n                       street corner in the City in a month,\n                       nation wide in two.\n          \n          Max keeps trudging, one foot in front of the other. BB looks\n          annoyed that he's not getting a reaction out of him.\n                               B\n                                  B\n                       I hope you're not over there blaming me.\n                       Really, this is Michelle's fault.\n          \n          Max's eyes start to burn.     BB sneaks a peek, encouraged.\n          \n                                 BB\n                       She had no right to put me in that\n                       situation. Asking me to pass up this\n                       kind of an opportunity to help her rat\n                       out my bosses...I'm sorry, but that's\n                       unreasonable.\n          \n          Max's head snaps up, eyes simmering with rage.     BB smiles.\n          \n                                  BB\n                       But then again, who could blame her for\n                       getting confused, being married to such a\n                       righteous man. So maybe it is your\n                       fault, after all.\n                           (beat)\n                       Just like your old man. Always knew you\n                       were better than everyone else--\n          \n                                  MAX\n                       No.   Just better than you.\n          \n          BB's smile seems to double.     He considers Max for a moment.\n          \n                                 BB\n                       For what it's worth, he didn't know\n                       Michelle was going to die.\n          \n          Max starts walking again, doesn't raise his eyes. The seed\n          has been planted, though. BB plays with the silence.\n          \n                                 BB\n                       He thought they were going out there to\n                       scare her, destroy her research.\n          \n          M\n          \n          \n          \n          \n          F\n          \n          \n          \n          \n          T\n          \n          \n          \n          \n          F\n          \n          \n          \n          \n                                                                   80.\n          \n          \n          \n          FLASHBACK: MAX'S KITCHEN - DUSK\n          \n          Looking up from the mail, Max sees the smashed kitchen door.\n          R\n           ESUME - EXT. STREET - NIGHT\n          \n          Max keeps walking, trying to fight off the memories. BB\n          strolls along beside him, taking his time with the story.\n          \n                              BB\n                    I'd arranged with the other guys to\n                    finish the job.\n          \n           LASHBACK: MAX'S HALLWAY - DUSK\n          \n          Max races into the hallway bathed in golden light.\n          \n          Between Max and the end of the hall, two JUNKIES are huddled\n          against a door. Twisting the handle, SMACKING the wood.\n          \n                              BB (V.O.)\n                    He locked them out of the bedroom, tried\n                    CPR...boy scout shit.\n          \n           he Junkies turn to Max, eyes black and glassy.   Sick smiles.\n          \n          RESUME - EXT. STREET - NIGHT\n          \n          Max looks nauseous.    BB sees it, thrilled.\n          \n                              BB\n                        (smiling)\n                    And as thanks, you nearly blew his head\n                    off while he crawled out the window.\n          \n           LASHBACK: MAX'S HALLWAY - DUSK\n          \n          Max throws his shoulder into the door, SNAPPING the hinges...\n          \n          BEDROOM - CONTINUOUS\n          \n          A MAN slips out of the window, one leg still inside...\n          \n           ax OPENS FIRE at the retreating shape.\n          \n          RESUME - EXT. STREET - NIGHT\n          \n          Max's gait begins to falter, lost in the memory he's played a\n          thousand times, the images shifting to show something new...\n          B\n           B watches eagerly, waiting for what comes next...\n          \n          S\n          \n          \n          \n          \n                               M\n          \n          \n          \n          \n                                                                     81.\n          \n          \n          \n          FLASHBACK: MAX'S BEDROOM - DUSK\n          \n          Max charges in, again firing on the man escaping...\n          \n          ...but this time, we watch the glass behind the billowing\n          curtains. The fabric ripples, revealing a reflection...\n          \n          Alex.\n          \n                              BB (V.O.)\n                    That's funny, to me.\n          \n          A momentary flash of his profile, a mask of guilt and shame.\n          \n          RESUME - EXT. STREET - NIGHT\n          \n          Max stops walking.   All of his will gone.\n          \n          BB steps closer, drinking in the pain in Max's eyes.\n          \n                              BB\n                    You really didn't know?\n          \n          With a shrug, BB turns away from Max's fury and moves on...\n          \n          INTERSECTION - CONTINUOUS\n          \n          Above them, traffic signals strain under thick icicles.\n          Intermittently, the lights go dark, the power faltering.\n          \n                               AX\n                        (soft)\n                    You should have killed me then, when you\n                    had a chance.\n          \n                              BB\n                    I learned something from your father,\n                    years ago. Always give people a choice.\n          \n           tepping into the intersection, BB stops. Abruptly, Joe\n          Salle closes with Max, meaty hand clamping onto his arm.\n          \n                                BB\n                    He gave me the choice between early\n                    retirement or facing the charges he was\n                    going to bring against me. He sat me\n                    down in that bar and explained that I\n                    could either give up the thing I loved,\n                    or I could have it taken away by force.\n                    That (was my choice.\n                          beat)\n                                (MORE)\n          \n                                                                          \n          \n                       I\n          \n          \n          \n          \n                                                                   82.\n                                   BB(CONT'D)\n                       You could have put a gun in your mouth\n                       any time you wanted. Or, you could have\n                       kept living in the hell I made for you.\n                       That's your choice.\n          \n          BB smiles.\n          \n                                 BB\n                       Just out of curiosity, though: why don't\n                       I have a chance now?\n          \n          Max's eyes are clear - almost peaceful for the first time.\n          \n                                 MAX\n                       Because now I know it's you.\n          \n          BB moves closer, the arrogance in his smile deepening.\n          \n                                 BB\n                       Well, you're--\n          \n          Suddenly, Max launches himself forward - a fullback's\n          explosion into the line that catches Salle by surprise...\n          \n          Hands cuffed behind his back, Max drives his shoulder into\n          BB's jaw, splitting his lip. BB tumbles back into the snow.\n          \n          Joe brings the club out again, bashing Max across the head,\n          using it to choke Max until his struggles lose power.\n          \n                                 JOE SALLE\n                       Okay, enough. This is far enough.\n          \n          BB looks around, wiping the blood from his lip. His eyes\n          fall on a mound of construction rubble in a vacant lot.\n                               B\n                                   B\n                       Hang on.\n          \n                                  JOE SALLE\n                       BB...\n          \n          BB stands and walks onto the lot, kicking away snow until he\n          exhumes a cinder block in the rubble pile. BB picks it up.\n          \n                                 BB\n                        've got something better.\n          \n          Carrying the cinder block, BB starts off down a different\n          street. Grudgingly, Salle pushes Max along after him.\n          \n          Visible a few blocks away, the black body of the river waits.\n          \n                    I\n          \n          \n          \n          \n                        (\n          \n          \n          \n          \n          H\n          \n          \n          \n          \n          L\n          \n          \n          \n          \n                                                                     83.\n          \n          \n          \n          EXT. PIER - NIGHT\n          \n          An ancient shipping pier juts out into the river, murky water\n          high and roiling around its pilings from the stormy weather.\n          B\n           B motions for Max and Joe Salle to follow him out onto the\n          pier, its planks buried under a thick sheet of ice.\n          \n                              BB\n                        (to Salle, taking Max)\n                    Grab me some of that rope.\n          \n          BB drops the cinder block at Max's feet, CRACKING the ice.\n          \n                              BB\n                    It's not like we didn't see it coming.\n          \n          Clamping onto Max's arm, BB unlocks his handcuffs.\n          \n                              BB\n                    Sullen, withdrawn...Max just never seemed\n                    the same after the tragedy.\n          \n           ights running the length of the pier flicker, eventually\n          dying altogether. All down the shore, the power fails.\n          \n                              BB\n                    It's a good thing his father didn't live\n                    to see it, though. Bill Payne's only\n                    son, a strung-out suicide.\n          \n           idden in the now deeper darkness, BB pulls something from\n          his coat: two glass vials like Lupino's, filled with the same\n          green powder. He tucks them into Max's coat pocket.\n          \n                              BB\n                         smiling)\n                    It would have eaten him alive.\n          \n                              MAX\n                    Bravura's not going to buy it.\n          \n                              BB\n                    Sure? Not even once the autopsy turns up\n                    traces in your blood?\n          \n          Max looks at BB, trying to understand how that could be.\n          \n                              BB\n                      dosed you that night at Alex's, just to\n                    make sure things were fuzzy. Compliments\n                    of the house.\n          \n                                                                          \n          \n                       J\n          \n          \n          \n          \n                                                                   84.\n                     \n          \n          \n          Seeing that BB has removed Max's cuffs, Salle hurries over.\n          The motion puts both men off balance on the slick boards...\n          \n                                 BB\n                        oe, why don't you calm down...\n          \n          Salle grabs Max's arm. Max looks down at Salle's feet, hard-\n          soled shoes slipping. Salle anticipates his next thought...\n          \n          Abruptly, Max jerks his arm away.\n          \n          Not able to let go in time, Salle's feet fly out from under\n          him. The big man crashes down hard on his side.\n          \n          Max ducks and stumbles forward...\n          \n          BB FIRES, missing. Max looks back. Beached on his side, Joe\n          Salle draws his pistol, the next shot coming any moment...\n          \n          Max slips. Struggling to right himself, hands scraping over\n          rough planks, another shot CRACKS inches from Max's legs...\n          \n          With nowhere else to go, Max turns to the water. Boots\n          slipping, he lunges for the edge, careening over...\n          \n          RIVER - CONTINUOUS\n          \n          Max SPLASHES down into the dark water, body twisted in an\n          awkward position, wind blasted from his lungs by the impact.\n          SHOTS from the pier above CUT into the water around him...\n          \n          Max dives under as much as he can stand it in the frigid\n          water, swimming farther from shore. Shots continuing to\n          SPLASH around him, the current pulls him into deeper water...\n          P\n           IER\n          \n          BB and Salle FIRE with less conviction. In the water, the\n          disturbance made by Max grows smaller as he's swept away.\n          \n          BB lowers his gun, motioning for Salle to do the same.\n          \n                                  BB\n                       It's fine, as cold as that water is...\n                           (beat)\n                       Just in case, though. Make sure.\n          \n          Salle frowns, shoots BB a look.\n          \n                                 JOE SALLE\n                       How?\n          \n                                                                     85.\n          \n          \n          \n          RIVER\n          \n          Max lifts his head. The wide expanse of the river stretches\n          around him, surface broken by swirling pocks of falling snow.\n          \n          The current caries him farther from piers and buildings\n          receding into snow, as black as the water they rise above.\n          Turning, Max sees that the opposite shore is even farther.\n          \n          Slowly, the exhilaration of escape begins to change. Icy\n          water bites his skin. Muscles beginning to tremble...\n          \n          Limbs heavy with saturated clothing, joints seized by cold,\n          Max tries to swim against the current with little success.\n          \n          Max sinks lower, churning water lapping his face.    GASPING\n          BREATHS becoming SPUTTERING COUGHS...\n          \n                                                               CUT TO:\n          \n          INT. HALLWAY - TWILIGHT (VISION)\n          \n          Max moves down the hallway, the familiar golden light.    Boots\n          A\n          stepping quiet, past the bloody and motionless bodies.\n          \n           t the bedroom's door, Max pauses.   Unable to go through.\n          \n          Michelle's body faces away, bundle cradled in her arms.\n          \n          As Max stands watching, Michelle's body stirs...\n          \n          EXT. RIVER - NIGHT\n          \n          Max breaks the surface: COUGHING, GASPING, flailing his arms.\n          It's hopeless; he immediately begins to sink again.\n          Desperation, panic move his limbs, but for nothing.\n          \n          Max Payne slips under without so much as a ripple.\n          \n          INT. HALLWAY - TWILIGHT (VISION)\n          \n          Tentatively, Max crosses the threshold into the bedroom.\n          \n          Michelle's eyes open, aware that she's being watched from the\n          doorway. She looks up at Max, a lazy smile forming.\n          \n          The bundle of blankets stirs. Michelle grins down at their\n          infant daughter, offering her finger to the tiny pink hand.\n          \n          Max edges closer, overwhelmed by the sight. Michelle pats\n          the bed beside them, inviting Max to sit. He doesn't move.\n          \n          \n                                                                          \n          \n          M\n          \n          \n          \n          \n                       H\n          \n          \n          \n          \n                           (\n          \n          \n                                 C\n          \n          \n                       H\n          \n          \n          \n          \n                                 C\n          \n          \n          \n          \n                                                                    86.\n                     \n          \n          \n                                 MICHELLE\n                       Are you home?\n          \n          For a long moment, Max drinks in the sight of his family...\n          \n          EXT. RIVER - PRE-DAWN\n          \n          Out in the middle of the river, the white curtain of blowing\n          snow parts to reveal a dark shape, drifting in the fog. Like\n          an island in the black water, a small boat bobs in place...\n          T\n           he CAPTAIN steps out onto deck, zipping his coat against the\n          weather while talking into a two-way radio. Faintly visible\n          around him, larger ships are outlined by twinkling lights.\n          \n                                  APTAIN\n                           (into radio)\n                       You know how blind I am, I'm not crashing\n                       into the dock again. When the power--\n          \n          A THUD against the hull of the ship; something in the water.\n          \n                                 CAPTAIN\n                        ang on a second.\n          \n          The Captain leans over the gunwale. A body floats below the\n          surface, BUMPING as it bobs in the wake.\n          \n                                  APTAIN\n                            to himself)\n                       Jumpers.\n          \n          The Captain swings a gaff, SPLASHING and glancing the sharp\n          hook across the body. He tries again, a solid hit...\n          \n          A hand breaks the surface, weakly grabbing the pole.\n          \n                                 CAPTAIN\n                        oly shit...\n                           (to the engine room)\n                       Somebody get out here!\n          \n          EXT. DOCK - NIGHT\n          \n          The boat barrels out of the fog, moving too fast towards the\n          pier. The Captain and his FIRST MATE crouch over Max.\n          \n                                 FIRST MATE\n                       It's too late. He's frozen solid.\n          \n           ax lies on the deck, ice water streaming from his clothes.\n          He's blue-gray, shivering violently, tiny puffs of breath...\n          \n                                                                          \n          \n                           (\n          \n          \n          \n          \n                                 C\n          \n          \n          \n          \n                                 F\n          \n          \n                       D\n          \n          \n          \n          \n                       C\n          \n          \n          \n          \n                                                                         87.\n                     \n          \n          \n          The boat tries to ease into the dock, but is moving too fast:\n          it CRASHES against the pilings. The gathered CROWD SHOUTS.\n          \n                                 CAPTAIN\n                           (calling to the pier)\n                       Somebody get some blankets.\n          \n          The Captain and Mate lift Max's rigid body up to the pier.\n          People start to inspect his cut and battered body.\n          \n                                 CAPTAIN\n                        all the cops, he's bleeding everywhere.\n          \n          Catatonic to this point, Max suddenly tries to shake his\n          head. He attempts to sit up, but hands force him down.\n          Powerless, Max's eyes desperately look around, searching...\n          \n                                 CAPTAIN\n                        on't move. We've got help coming.\n          \n          Hand shaking violently, Max reaches inside his coat and pulls\n          out the vials BB planted. Trembling, he flips the caps away.\n          \n                                  IRST MATE\n                       What is that? What's he...\n          \n          With everything he has, Max opens his chattering jaws and\n          dumps the green-tinged powder into his mouth.\n          \n                                  APTAIN\n                       Great, a junkie bleeding on my boat.\n          \n          The dust on Max's lips liquefies.    His trembling grows worse.\n          \n          The crowd parts, and a MAN rushes up with blankets.       He\n          kneels down over Max, whose body keeps shaking.\n                               M\n                                  AN\n                            touching Max, confused)\n                       He doesn't really feel that bad...\n          \n                                 CAPTAIN\n                       What do you mean, he's a block of ice...\n          \n          The captain touches Max's skin, jerking away in shock.\n          \n                                 FIRST MATE\n                       Maybe it's a fever already.\n          \n          Max pushes their hands away, his strength suddenly regained.\n          Unsteadily, Max climbs to his feet. The crowd pulls away.\n          \n          \n                                                                             \n          \n                               B\n          \n          \n          \n          \n                                                                     88.\n                      (2)\n          \n          \n                              CAPTAIN\n                    Let him go, then.\n          \n          Max wobbles up the planks, the snow fall not quite as hard as\n          it had been when he went into the water.\n          \n          Max's gait grows more steady, each step forcefully forward...\n          \n          One by one, the flakes become burning embers drifting from\n          the sky. Max marches ahead, bits of fire raining over him.\n          \n          INT. POLICE STATION - INTERROGATION ROOM - NIGHT\n          \n          A exhausted man in the uniform of a GUARD slumps in an\n          interrogation room. Bravura paces the floor, grilling him.\n          \n                               BRAVURA\n                    Okay.   Again, from the beginning.\n          \n          Before the Guard can answer, the door flies open. Without a\n          word, the RANKING OFFICER summons Bravura into the hall...\n          \n          HALLWAY\n          \n          ...where a row of more GUARDS are handcuffed to a bench.\n          \n                    U         RANKING OFFICER\n                     nder what authority are you\n                    interrogating these men?\n          \n                               RAVURA\n                    An investigation into departmental\n                    corruption. They're material witnesses--\n          \n                              RANKING OFFICER\n                    Just between you and me, I wouldn't count\n                    on these men being any kind of witnesses\n                    at all. I served with a few of them, and\n                    remember what kind of officers they were.\n          \n          From the bench, Bravura sees the smirks from the Guards.\n          \n                              BRAVURA\n                    What kind would that be?\n          \n                               RANKING OFFICER\n                    Cops.   Real cops.\n          \n          At the far end of the hall, a group of serious-looking men in\n          DARK SUITS file out of the elevator. Bravura cracks a smile.\n          \n                                 RANKING OFFICER\n                        o offense.\n          \n          The Suits get closer, revealing badges on their belts.   FBI.\n          \n                                 BRAVURA\n                       None taken.\n                           (to the lead agent)\n                       Agent Taliente, I'd like you to meet a\n                       real cop.\n          \n          The Ranking Officer and the Agent shake hands.    Icy.\n          \n          Standing in the doorway of an office down the hall, a\n          DETECTIVE shrinks back to his desk and picks up the phone.\n          \n                                 DETECTIVE\n                           (on phone)\n                       Let me talk to BB.\n          \n          EXT. ASGARD BUILDING - NIGHT\n          \n          With dead streetlights, the hulking black shape of the Asgard\n          building looms like a mountain at the end of the block.\n          \n           ax moves up the street, steam rising from his clothes as\n          they dry from the heat of his skin. Sweat beads on his face.\n          \n          Max enters Asgard's courtyard, the Gothic facade rising high\n          above. He passes through its security lights, shadow casting\n          down onto the clean white snow like a projection screen...\n          \n          Invisible to the naked eye, more shadows of winged shapes\n          dart and swoop in the air above Max's outline on the snow.\n          \n          INT. ASGARD BUILDING - BB'S OFFICE - NIGHT\n          \n          BB POUNDS the receiver down onto the phone, CRACKING the\n          base. Joe Salle watches him angrily pulling on his coat.\n          \n                                 JOE SALLE\n                       What's going on downtown?\n          \n                                 BB\n                       Bravura called in the Feds.\n          \n          BB storms for the door, surprised to turn back and see that\n          Salle hasn't followed him. The big man scowls, nervous.\n          \n                                 BB\n                        or God's sake, come on. Max is dead,\n                       they've got nothing else.\n          \n          \n          ENTRY HALL\n          \n          BB and Salle storm down the steps into the main entry hall.\n          \n                                  B\n                       Get up to the armory, hide the--\n          \n          Salle grabs BB by the arm.\n          \n          On the floor between them and the front door, two guards\n          sprawl face-down in enormous pools of their own blood.\n          \n                                 JOE SALLE\n                       He's not dead. He's here.\n          \n                                   BB\n                       Bullshit.    There's no way--\n          \n          At that moment, they both see movement in the shadows...\n          \n          Max steps forward into the light - soaked in blood up to his\n          elbows, eyes black and animalistic. No longer himself.\n          \n           oe Salle reaches for his pistol. With freakish reflexes,\n          Max raises one of the guard's machine guns and OPENS FIRE.\n          \n          BB and Salle fall back, diving into an ancient elevator car.\n          Slugs ricocheting, BB and Salle struggle to shut the doors.\n          \n          From Max's POV: as the elevator doors slam shut, a glimpse of\n          BB's face stretching and distorting into a demonic grin...\n          \n          ELEVATOR\n          \n          BB and Salle watch the floor number rise.       BB finds his cell.\n          \n                                 JOE SALLE\n                       Who are you calling?\n          \n                                   BB\n                       Her.\n          \n          By Salle's face, that's a thought scarier than Max.\n          \n          INT. AESIR BUILDING - PENTHOUSE OFFICE - NIGHT\n          \n          The giant glass-walled penthouse office of the Aesir building\n          sits above the storm clouds. Up here, dawn is close.\n          \n          Nicole Horne watches the storm below her feet.       She ANSWERS.\n          \n          \n          \n          \n                                  NICOLE HORNE\n                           (even)\n                       This isn't a number you use.\n          \n          INTERCUT - HORNE'S OFFICE/ELEVATOR\n          \n                                 BB\n                         need you to send a helicopter to my\n                       building. NThe storm's breaking...\n          \n                                 NICOLE HORNE\n                        here was a shoot-out in my building\n                       yesterday, twenty floors from where I'm\n                       sitting. A secretary was killed.\n          \n                                 BB\n                       I understand an executive named Jason\n                       Colvin was also among the dead.\n                       Senseless tragedies, all.\n          \n          Nicole sighs, eyes still fixed on the window.\n          \n                                 BB\n                       Everything's fine, we're just--\n          \n                                 NICOLE HORNE\n                       This was more than you were ready for.\n          \n                                 BB\n                       What is that supposed to mean?\n          \n                                 NICOLE HORNE\n                       Perhaps our partnership has run its\n                       course.\n          \n                                 BB\n                       Think pretty hard about that. I'm about\n                       to be surrounded by Federal agents--\n          \n                                 NICOLE HORNE\n                           (shadenfreude)\n                       Good heavens, BB. Best of luck.\n          \n                                 BB\n                       Who needs luck? They're going to love\n                       the stories I can tell.\n          \n                                  NICOLE HORNE\n                       Careful.\n          \n                                 BB\n                           (losing it)\n                       Send the helicopter, then.\n          \n          After a moment, Horne lets her eyes drift shut.        She smiles.\n          \n                                 NICOLE HORNE\n                       It's on its away.\n          \n          INT. ASGARD BUILDING - HALLWAY - CONTINUOUS\n          \n          The elevator opens and BB steps out, snapping his phone shut.\n          \n                                  BB\n                       Take everybody and get downstairs.    I\n                       want no less than his head.\n          \n          HALLWAY\n          \n          Max turns the corner into a long hallway of prison-like\n          offices. Emergency lights flicker through barred windows...\n          \n          A group of GUARDS look up and see Max at the same moment.\n          Max is without hesitation, SHOOTING two before they can raise\n          their weapons. Falling back, the others start FIRING...\n          S\n           uddenly, an office down the hall bursts to life - a ROAR of\n          flapping wings, light from the window strobing with movement.\n          \n          Max doesn't seek cover, walking into BLAZING machine guns...\n          \n          One by one, all the offices FLICKER with fluttering wings.\n          Max marches on, rage-filled eyes set in a lifeless face...\n          \n          ARMORY\n          \n          Guards empty the weapons lockers, loading for bear as the\n          sounds of GUNFIRE grow closer. BB and Salle supervise.\n          \n                                 BB\n                       Take some C4, wire it so he can't make it\n                       to the roof. I'll wait on the chopper.\n          \n          Salle's mistrust of BB is painted all over his face.\n          \n                                 BB\n                           (smiling)\n                       You know I won't leave without you.\n          \n          \n          \n          \n          CORRIDOR\n          \n          Max FIRES, plaster from shattered walls caking on his sweat-\n          soaked skin. Guards take cover, fall back for position...\n          \n          With every shot fired, the muzzle flash glows in Max's empty\n          black eyes, the flames glowing brighter as he advances...\n          \n          GREAT HALL\n          \n          ...into the vast, open space at the heart of the building.\n          GUARDS appear at the other end of the hallway, OPENING UP.\n          Their SHOTS echo, the great room ringing like a cave.\n          \n          Max lifts his eyes - what had been four stories now seems\n          like forty, the top not visible behind hazy black smoke.\n          \n          Bullets WHISTLE past Max's ear. Distracted, he RETURNS FIRE,\n          but his eyes are drawn back to the black smoke above.\n          SOMETHING moves in the clouds, swirling closer...\n          \n          STAIRWELL\n          \n          More Guards THUNDER up steps littered with spent casings. In\n          their haste, they don't notice the thin gap in one window...\n          \n           LENDER FINGERS slip in with the swirling snow, opening it...\n          \n          GREAT HALL (MAX'S POV)\n          \n          Crashing back into Max's perspective, a RUSHING WIND presses\n          down from the black clouds above, the darkness spreading.\n          Max's legs buckle, his machine gun scattering SHOTS...\n          \n          The room goes darker as it gets louder, light blotted out by\n          WINGED CREATURES drifting down from above, circling closer...\n          \n          Max stumbles, buffeted by their POUNDING WINGS. CHOKING on\n          sulfurous smoke, hair smoldering, skin starting to singe...\n          \n          ANOTHER HALLWAY\n          \n          A small group of Guards race forward, dodging the bodies of\n          others Max met along the way. They hesitate, form ranks...\n          \n          GREAT HALL - CONTINUOUS\n          \n          ...and the frightened Guards charge into the great room.\n          \n          It is silent. Smokeless. Just a hall. Blood streaks the\n          walls, flows between the crumpled carcasses of more dead\n          GUARDS. At the far end of the hall, something moves:\n          \n          \n          \n          Max. On his hands and knees, rivers of sweat flowing.\n          Confused, the group of Guards approach Max. Weapons ready.\n          \n          MAX'S HALLUCINATION\n          \n          Crushed inside the DEAFENING blackness, Max lifts his eyes to\n          see LEERING DEMONS gazing down, distorted versions of...\n          \n          GREAT HALL - CONTINUOUS\n          \n          ...the four Guards, who look down on Max's trembling, sweat-\n          logged body on the floor. He's MUTTERING, CHANTING...\n          \n          So easy it almost doesn't seem fair, a Guard aims his pistol.\n          \n          Suddenly, bullets RIP through the Guards from behind. No\n          chance to respond, bodies torn open with a merciless BLAST of\n          machine gun fire. They fall around Max, joining the rest.\n          \n          Gun smoking, Mona rushes up the hallway to Max.\n          \n          MAX'S HALLUCINATION\n          \n          The Demons fade away, their howling SCREAMS lingering behind.\n          Awaiting the next horror, Max is shocked by something else:\n          White light splits open the smoke, cutting the black in two.\n          \n          GREAT HALL\n          \n          Mona kneels down over Max, lifting up his head. Max's skin\n          is pale, slick like melting wax. His eyes are empty.\n          \n          There's nothing gentle in her touch - she SLAMS Max's head\n          back onto the cold marble, jerking him up again by his hair.\n          \n                                 MONA\n                       Max!\n          \n          Gradually, Max's black eyes start to find Mona's face.\n          M\n           AX'S HALLUCINATION\n          \n          The white light grows brighter, blasting away shadows and\n          smoke. In its center, traces of Mona's face appear.\n          \n          GREAT HALL\n          \n          Max starts to sit up, gazing with confusion at the hallway.\n          \n                                 MONA\n                       You don't have much time.\n          \n          \n          Max nods.    No idea if he understands, Mona helps him up.\n          \n                                 MONA\n                       I'll do what I can to slow them down, but\n                       you have to hurry.\n          \n          Max looks back at Mona, clearly having some idea of what that\n          means for her. They look at each other for a long moment.\n          \n                                 MONA\n                       You're not done yet.\n          \n          EXT. ASGARD BUILDING - ROOF - DAWN\n          \n          Sickly light glows in the east. The snow has all but\n          stopped. BB strides across the roof, hope in his eyes.\n          \n                                  BB\n                           (on phone)\n                       The weather's broken, your pilot is going\n                       to have no problem landing.\n          \n          INT. AESIR SKYSCRAPER - PENTHOUSE OFFICE - DAWN\n          \n          Nicole Horne sits at her desk, watching the storm recede.\n          \n          A red light flashes on her phone.     She ignores it.\n          \n          INT. ASGARD BUILDING - HALLWAY - DAWN\n          \n          Joe Salle kneels over a pile of C4 bricks, wiring a bomb. He\n          tenses, hearing something in the hall behind him. Raising\n          his hands and turning slowly, he finds Mona waiting.\n          \n                                 MONA\n                       Where's the detonator?\n          \n          Slowly, Salle holds it out for Mona.     She grabs the remote.\n          \n                                  JOE SALLE\n                       There's more like this all over. Even if\n                       the building doesn't collapse, this floor\n                       is gone.\n                           (beat)\n                       Careful with that thing, is what I'm\n                       saying. I'm sure you and I can work\n                       something out.\n          \n          Suddenly, BOOT STEPS ring up the hallway behind Mona.\n          \n                                  UARDS\n                       Drop your weapon!\n          \n          Salle smiles.\n          \n          BB'S OFFICE\n          \n          Max staggers through the door to BB's office. Out the big\n          windows, the East River begins to glow with approaching dawn.\n          \n           ax scans the room for BB, his vision still plagued by\n          flickering shadows, hallucinations receding but not yet gone.\n          He pauses at the glass, caught by his twisted reflection.\n          \n           ax can see his own wings.\n          \n          HALLWAY\n          \n          Salle holds out his hand for the detonator. Behind Mona,\n          elevator doors open to reveal more Guards. They file out...\n          \n                                 JOE SALLE\n                           (to the Guards)\n                       Hurry, Max's already upstairs.\n                           (to Mona, frustrated)\n                       Just hand it over.\n          \n          Mona watches the guards file towards the stairs. Behind her,\n          the elevator car waits, empty, the doors starting to close...\n          \n                                 JOE SALLE\n                        B's done for, but this thing doesn't\n                       have to stop. I'm his number two, and\n                       somebody has to take over for Lupino.\n                       Like I said, we can work something out.\n          \n          Ever so casually, Mona takes a step back onto the elevator.\n          The doors HISS along their tracks, converging...\n          \n                                 JOE SALLE\n                            frowning, confused)\n                       Give me one reason we can't do business.\n          \n          Mona presses the button on the detonator.\n          \n          BB'S OFFICE - CONTINUOUS\n          T\n           he window Max stands in front of SHATTERS in the EXPLOSION,\n          his demonic image bursting into a thousand shards of glass...\n          \n          EXT. ASGARD BUILDING - DAWN - CONTINUOUS\n          \n          From the ground, the explosion rains glass down over the Feds\n          and waiting SWAT team. Shielding his eyes, Bravura squints\n          up at the flames in the windows. Taliente pats his shoulder.\n          \n          \n          \n          \n                                                                        97.\n                     \n          \n          \n                                 BRAVURA\n                       Try to take Payne alive, if there's\n                       anything left.\n          \n          Taliente nods.    On his signal, the SWAT team mobilizes.\n          \n          INT. ASGARD BUILDING - BB'S OFFICE - DAWN\n          \n          Wind GUSTS through the shattered windows of BB's office. Max\n          brushes away diamonds of broken glass, struggling to stand.\n          \n           hin rims of color have returned to his eyes. Human again.\n          Max draws his pistol and strides through the roof door...\n          \n          EXT. ASGARD BUILDING - ROOFTOP - DAWN - CONTINUOUS\n          \n          A shower of bullets strikes the doors as he steps outside.\n          Max can't react. Bullets shred the door behind him, one slug\n          hitting Max in the stomach and knocking him to the ground.\n          \n           cross the roof, BB keeps FIRING until his pistol CLICKS.        BB\n          returns his attention to the sky, hopelessly waiting.\n          \n                                 BB\n                       It's unbelievable. All that snow, and...\n                       Watch it end up being a beautiful day.\n          \n           ritting his teeth, Max struggles to his knees. Blood rushes\n          between his fingers, streaming out of the hole in his side.\n          \n           earing Max's effort, BB turns away from the empty sky.\n          Using the pistol as a crutch, Max finally stands...\n          \n                               BB\n                       You want my confession, first?   You came\n                       all this way for it...\n          \n          BB tosses his useless weapon aside.\n          \n                                 BB\n                           (mock penitent)\n                       Forgive me, Max, for I have sinned. I\n                       should have bet more on you, and less on\n                       that helicopter.\n          \n          Max limps closer, pistol swinging at his side.     A thin trail\n          of blood follows behind him in the snow...\n          \n          BB watches Max's approach, his swagger rapidly failing.\n          \n          \n          \n          \n          \n                                 BB\n                       Just get to it, already. That's all I\n                       ask. You've earned it, so just...\n          \n          With the pain in his stomach causing some difficulty, Max\n          pulls the pistol's slide back to check for a live round.\n          \n          BB watches Max's preparations, terror growing. Unable to\n          resist his panic, BB abruptly tries on a helpless smile.\n          \n                                 BB\n                       But I want you to listen to me, first.\n                       Just try to hear what--\n          \n          Max raises the pistol and PULLS THE TRIGGER. The slug hits\n          BB in the center of the forehead, snapping his neck back.\n          \n          The shell casing twirls down, landing in the snow without a\n          sound. BB's corpse lands a moment later with a clumsy THUD.\n          \n          Max lets the gun slip out of his hand and walks past the body\n          - BB's eyes frozen on the sky, red halo slowly expanding.\n          \n          Max reaches the edge, the river's black body revealed below.\n          His gait falters, blood filling each footprint in the snow...\n          \n          INT. ASGARD BUILDING - BB'S OFFICE - DAWN\n          \n          The SWAT team streams through the door, racing for the roof.\n          \n          EXT. ASGARD BUILDING - ROOFTOP - DAWN\n          \n          Max stands at the roof's edge. A stiff wind buffets against\n          his chest, forcing his unsteady legs to sway a little.\n          \n          Slowly, his eyes drift from the water below to the sky...\n          \n                                                                CUT TO:\n          \n          INT. MAX'S BEDROOM (VISION) - TWILIGHT\n          \n          From the doorway, Max watches Michelle smiling down at their\n          baby, who grabs at her finger with a wide grin.\n          \n                                 MAX'S VOICE\n                       I don't believe in heaven.\n          \n          Gently, Max takes a seat on the edge of the bed beside them.\n          \n                                                                  99.\n          \n          \n          \n          EXT. ASGARD BUILDING - ROOFTOP - DAWN\n          \n          Max looks up at the sky. Behind him, the SWAT team races\n          outside, swarming and BARKING orders at Max, weapons raised.\n          \n          Max drops to his knees. He raises his hands, one dripping\n          with his own blood. But his eyes stay on the sky...\n          \n                              MAX'S VOICE\n                    But I have this idea about it.\n          \n          ...where a tiny tear opens in the clouds, revealing steel\n          grey dawn beyond.\n          \n                                                          FADE OUT.\n          \n                              THE END\n          \n \n\n\n\n\nMax Payne\nWriters :   Beau Michael Thorne\nGenres :   Action  Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Detective Max Payne (Mark Wahlberg) is a three-year veteran in the Cold Case Unit of the New York City Police Department (NYPD). He is consumed with investigating and finding the murderer of his wife Michelle and their infant child Rose. Max's snitch, Trevor, supplies information that leads Max to three drug addicts in an empty train station. They attempt to rob Max in a bathroom; instead, Max interrogates one of them about his family’s murder, with no results. While one of the drug addicts runs away he is attacked by shadowy, winged man-creatures and is hit by a train. At Trevor's apartment, Max meets Natasha Sax (Olga Kurylenko), who gets into an argument with her sister, Mona (Mila Kunis). When Natasha storms off, Max searches for her in the back where partiers are using the drug \"Valkyr\". Max is silently confronted by Jack Lupino (Amaury Nolasco), but Natasha takes Max back to the party. Max notices Natasha’s tattoos and wants information about them, so he invites her back to his apartment. However, when Natasha tries to seduce Max, she makes insensitive comments about his wife, and Max kicks her out. Natasha leaves through an alley, and is attacked by the winged shadow creatures.\nThe next morning Natasha is found dead, and Max's wallet is discovered at the crime scene. Max becomes the prime suspect in the case, with his old partner, Alex Balder (Donal Logue), taking part in the investigation. Alex notices the tattoo on Natasha's arm is similar to one found in the case file of Max's wife. Alex tries to contact Max, but getting no response, he quickly leaves for Max's apartment. When Max arrives home, he finds the door ajar and his place a mess. Alex lies dead inside, and as Max investigates, he is knocked unconscious from behind.\nMax wakes up in a hospital with his trusted friend BB Hensley (Beau Bridges), his father's former partner in the NYPD, at his bedside. Hensley is now head of security of the pharmaceutical company Aesir Corporation. Max leaves the hospital early to pay his respects to Alex, but is kicked out by Alex's upset wife Christa (Nelly Furtado). While being questioned by Lieutenant Jim Bravura (Chris 'Ludacris' Bridges) of Internal Affairs, Max storms out and searches Alex's desk, finding Owen Green's name in Natasha's case file. Later, Max is confronted by Mona, who assumes Max killed her sister, but Max persuades her to help him find the actual killer. Max and Mona find Green (Joel Gordon) but cannot save him, as Owen was hallucinating and as a result falls out of a building to his death.\nMax and Mona visit Natasha's tattoo parlor. The tattoo artist tells them Natasha's tattoo represents the wings of a Valkyrie, which, in Norse mythology, are creatures that decide the fate of warriors in battle. Max then goes to take some of Michelle's belongings out of storage and ends up discovering that documents from when she worked at the Aesir Corporation have gone missing. Max meets BB at a diner and demands the name of Michelle's old supervisor.\nMax interrogates the supervisor, Jason Colvin (Chris O'Donnell), in his office at Aesir and learns that Michelle was associated with a military contract to create super-soldiers using the highly addictive drug Valkyr. Only a few subjects showed positive results; the rest saw hallucinations and eventually went insane, so the project was terminated. Jason agrees to testify, as long as Max protects him. When a skeptical Max asks Jason who he is supposed to be protecting him from, Jason answers: \"The man that killed your wife!\" Max agrees, and starts to escort Jason out of his office, but as they leave, armed Aesir security forces appear and kill Jason.\nMax escapes with the evidence and shows the video to Mona. It explains the Valkyr project; Lupino is a former Marine and his testimony explains that, while taking the drug, Lupino feels invincible, with no side effects (unlike most other test subjects). Max goes to Lupino's hideout, Ragna Rok. While fighting Lupino, Max's defeat appears to be certain until BB arrives and kills Lupino. Max gets knocked unconscious after the brawl as he is leaving the hideout.\nBB explains that he is selling Valkyr and admits to killing Michelle because she inadvertently came across incriminating documents. BB plans to drown Max in the river, with a weight secured to his ankle and Valkyr in his pocket, hoping to make it look like a drug-induced suicide. But before he can be tied to the weight, Max escapes by jumping into the icy river. He swims to shore and, to prevent hypothermia, consumes both vials of Valkyr, transforming himself into a super-soldier with visions of Valkyries. Max follows BB back to the Aesir building. Assisted by Mona, he kills many Aesir security employees. Max eventually confronts BB on the building's helipad and kills him. His vengeance complete, he falls to his knees, ready to die. He sees a vision of his daughter and wife, who tells him \"Not yet, Max.\" He comes to, as the sun cuts through the clouds and a SWAT team surrounds him.\nIn a post-credits scene, Max meets with Mona at a bar, where she shows him a newspaper article about Aesir's soaring stock price, with a picture of CEO Nicole Horne, presumably their next target."}