{"title": "Midnight in Paris", "full_text": "Midnight in Paris\nWriters :   Woody Allen\nGenres :   Comedy  Fantasy  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Gil Pender, a successful but creatively unfulfilled Hollywood screenwriter, and his fiancée Inez, are in Paris vacationing with Inez's wealthy, conservative parents. Gil is struggling to finish his first novel, centered on a man who works in a nostalgia shop. Inez dismisses his ambition as a romantic daydream, and encourages him to stick with lucrative screenwriting. Gil is considering moving to Paris (which he notes, much to the dismay of his fiancée, is at its most beautiful in the rain). Inez is intent on living in Malibu. By chance, they are joined by Inez's friend Paul, who is described as both pedantic and a pseudo-intellectual, and who speaks with great authority but questionable accuracy on the history and artworks of Paris. Paul contradicts a tour guide at the Rodin Museum, and insists that his knowledge of Rodin's relationships is more accurate than that of the guide. Inez admires him; Gil finds him insufferable.\nGil gets drunk one night when Inez has gone off dancing with Paul and his wife, and becomes lost in the back streets of Paris. At midnight, a 1920s Peugeot Type 176 car draws up beside him, and the passengers, dressed in 1920s clothing, urge him to join them. They go to a party for Jean Cocteau where the astonished Gil realizes that he has been transported back to the 1920s, an era he idolizes. He encounters Cole Porter, Alice B. Toklas, Josephine Baker and Zelda and Scott Fitzgerald, who take him to meet Ernest Hemingway. Hemingway offers to show Gil's novel to Gertrude Stein, and Gil goes to fetch his manuscript from his hotel. However, as soon as he leaves, he finds he has returned to 2010 and the bar where the 1920s literati were drinking has disappeared.\nGil attempts to bring Inez to the past with him the following night, but she becomes impatient and peevishly returns to the hotel. Just after she leaves, the clock strikes midnight and the same car arrives, this time with Hemingway inside. He takes Gil to meet Stein, who agrees to read his novel and introduces him to Pablo Picasso and his lover Adriana. Adriana and Gil are instantly attracted to each other. Stein reads aloud the novel's first line:\nAdriana says that she is hooked by these few lines and has always had a longing for the past, especially the 1890s.\nGil spends each of the next few nights in the past. His late-night wanderings annoy Inez, and arouse the suspicion of her father, who hires a private detective to follow him. Gil spends more and more time with Adriana, who leaves Picasso for a brief dalliance with Hemingway. Gil realizes he is falling in love with her, leaving him in conflict. He confides his predicament to Salvador Dalí, Man Ray and Luis Buñuel, but being surrealists they see nothing strange about his claim to have come from the future, finding it to be perfectly normal. They discuss the impossibility of Gil's relationship with Adriana, and each of the artists envisages a different masterpiece inspired by such an unusual romance. Later on Gil suggests to a young Luis Buñuel a movie plot, which is none other than the plot of Buñuel's own 1962 film The Exterminating Angel, and leaves while Buñuel continues to question the plot idea.\nWhile Inez shops for expensive furniture, Gil meets Gabrielle, an antique dealer and fellow admirer of the Lost Generation. He buys a Cole Porter seventy-eight, and then finds Adriana's diary from the 1920s on a book stall by the Seine, which reveals that she was in love with him. Reading that she dreamed of receiving a gift of earrings from him and then making love to him, Gil attempts to steal a pair of earrings from Inez to give to Adriana, but is thwarted by Inez's early return from a trip.\nGil buys earrings for Adriana and, returning to the past, declares his love for her. As they kiss, they are invited inside a horse-drawn carriage by a richly-dressed couple and are transported back to the 1890s Belle Époque, an era Adriana considers Paris's Golden Age. They are taken to Maxim's Paris and to the Moulin Rouge, where they meet Henri de Toulouse-Lautrec, Paul Gauguin, and Edgar Degas. Gil asks what they thought the best era was, and the three determine that the greatest era was the Renaissance. The enthralled Adriana is offered a job designing ballet costumes, and proposes to Gil that they stay, but Gil, upon observing that different people long for different \"golden ages\", has an epiphany, and realizes that despite the allure of nostalgia, it is better to live in the present. Adriana elects to stay in the 1890s, and they part.\nGil rewrites the first two chapters and retrieves his draft from Stein, who praises his progress as a writer and tells him that Hemingway likes it, but questions why the main character has not realized that his fiancée (based on Inez) is having an affair with a pedantic character (based on Paul).\nGil returns to 2010 and confronts Inez. She admits to having slept with Paul, but dismisses it as a meaningless fling. Gil breaks up with her and decides to move to Paris. Inez's parents agree with Gil when he tells her that they are not right for each other. Amid Inez's pique, Gil calmly leaves, after which Inez's father tells her and her mother that he had Gil followed, though the detective has mysteriously disappeared. (He was transported to the Versailles of Louis XVI and Marie Antoinette, which the characters toured earlier in the film), and is \"now\" fleeing from the agents of the State.\nWalking by the Seine at midnight, Gil bumps into Gabrielle and, after it starts to rain, he offers to walk her home and they learn that they share the love of Paris in the rain."}