{"title": "Mute Witness", "full_text": "MUTE WITNESS\r\n\r\n                              (1994)\r\n\r\n\r\n\r\n                           Screenplay by\r\n\r\n                           Anthony Waller\r\n\r\n\r\n\r\n CREDITS (First part)\r\n\r\n White letters on black screen. We hear the sound of a radio with a\r\n lot of statics. Apparently, someone is scanning the channels.\r\n After we've heard different channels, the scanning stops on a\r\n channel with jazz music.\r\n\r\n With a loud sound, the credits stop, the black screen moves away\r\n to the right and is replaced by :\r\n\r\n FILM SET - BEDROOM - INTERIOR DAY\r\n (it is actually day-time, but the scene in the film being shot is\r\n supposed to take place during the night. So all the artificial\r\n lights make us believe it is night-time)\r\n\r\n We still hear the sound of the radio.\r\n\r\n We are on a film set, even though we don't know it yet. The way it\r\n is filmed makes us believe we are in a real bedroom.\r\n\r\n A bedroom, seen through a window. Nice, clean, elegantly furnished\r\n and very well lit. Large bed. On the other side of the room from\r\n the window, a young woman is seated in front of desk facing the\r\n wall. The young woman stands up, with a paper document in her\r\n hand. She is wearing thick hoses, large slippers and a man's white\r\n shirt, which hangs down to the middle of her thighs.\r\n\r\n She walks out of the bedroom, to the next room. The window opens,\r\n and the camera, which acts as the eyes of the intruder, looks\r\n around the room.\r\n\r\n       VOICE ON THE RADIO\r\n       We interrupt this program to bring you a special news\r\n       bulletin.\r\n\r\n The camera moves to the next room :\r\n\r\n FILM SET - DINING ROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\n A dining-room with a large mantlepiece. In the center of the room,\r\n a round dining table with four chairs around it. The table is set,\r\n ready for dinner.\r\n\r\n       VOICE ON THE RADIO\r\n       Ernest Strohbecker and two accomplices escaped from a\r\n       maximum-security ward in Bellevue Hospital last night...\r\n\r\n The camera (and consequently the eyes of the intruder) keeps on\r\n looking around the room and then focus on the radio set sitting on\r\n a small table.\r\n\r\nClose shot on the radio. The volume of the radio goes up.\r\n\r\n       VOICE ON THE RADIO\r\n       ... after brutally stabbing two nurses and a custodian to\r\n       death. Strohbecker is extremely dangerous, brutal and\r\n       unpredict...\r\n\r\n The radio is suddenly switched off.\r\n\r\n The camera moves upward to show us the corridor and the open door\r\n of the bathroom in the corridor.\r\n\r\n       THE YOUNG WOMAN (Voice over)\r\n       Harry ?\r\n\r\n FILM SET - BATHROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\n Close shot on the mirror, in front of which the young woman is\r\n standing. She looks a bit surprised by the sudden silence of the\r\n radio, but very soon goes back to her make-up.\r\n\r\nFILM SET - CORRIDOR - INTERIOR DAY (NIGHT in the film)\r\n\r\nThe camera (and consequently the eyes of the intruder) moves along\r\nthe corridor, toward the door of the bathroom. It stops very\r\nshortly to look at the young woman, still taking care of her make-\r\nup, and moves away to look at the open door on the other side of\r\nthe corridor.\r\n\r\nFILM SET - KITCHEN - INTERIOR DAY (NIGHT in the film)\r\n\r\nA kitchen. There is no light and the room is very dark. Close shot\r\non the row of knives hanging on the wall. A man's hand takes one\r\nof the knives.\r\n\r\nFILM SET - BATHROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\nThe young woman opens a small closet, temporarily hiding her face\r\nto the camera. She takes a lipstick and start doing her lips.\r\n\r\nClose-up shot on the woman's lips, with the lipstick moving around\r\nthem.\r\n\r\nBack to the mirror, showing the reflection of the young woman. She\r\nopens the small closet. In the mirror, which covers the door of\r\nthe closet, we see a man approaching slowly, with a knife in his\r\nhand.\r\n\r\nClose-up shot on the woman's lips.\r\n\r\nFILM SET - CORRIDOR - INTERIOR DAY (NIGHT in the film)\r\n\r\nHigh-angle shot of the corridor, seen from the ceiling.\r\n\r\nThe woman comes out of the bathroom. She sees something, stops and\r\nwalks slightly backward.\r\n\r\n       THE YOUNG WOMAN\r\n       Harry ?\r\nShe walks to an half-open door and closes the door.\r\n\r\n       THE YOUNG WOMAN\r\n       Harry ?\r\n\r\nWhen she closes the door, a corpse, who was hidden by the half-\r\nopen door, falls, face down, on the floor. The woman screams.\r\n\r\nThe corpse on the floor. It is a man with blood on his face. The\r\nwoman bends down on the man and shakes him.\r\n\r\n       THE YOUNG WOMAN\r\n       Harry !\r\n\r\nShe turns him around to look at his face. We see the white shadow\r\nof a man coming out of a room.\r\n\r\nFILM SET - DINING ROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\nA white telephone in the foreground. The girl runs toward the\r\ntelephone. She dials on the phone. We see the mysterious man in\r\nthe background, slowly walking into the room, coming from the\r\ncorridor. The girl has the telephone handset on her ear, but\r\napparently, she gets no tone. She frenetically taps on the\r\ntelephone hook to make it work. Then she sees the cut wire on the\r\nphone and picks it up. The man is coming closer to her. He has a\r\nblack mask on his face, and a white apron covered with blood.\r\n\r\nThe woman sees the man. She drops the phone and walks back until\r\nshe reaches the wall. She moves out of the room to :\r\n\r\nFILM SET - BEDROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\nThe woman walks back until she reaches the bed. The man, covered\r\nwith blood, has his knife raised above his head. The woman falls\r\nbackward on the bed. The man raises his knife above the woman's\r\nbody. The woman screams. The man stabs repeatedly the woman with\r\nhis knife, and then moves away from the bed.\r\nFILM SET - DINING ROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\nThe man enters the room and takes the mask away from his face.\r\n\r\nFILM SET - BEDROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\nApparently, the woman is not dead and she walks to the desk.\r\n\r\nFILM SET - DINING ROOM - INTERIOR DAY (NIGHT in the film)\r\n\r\nThe man crosses the room.\r\n\r\nThe bedroom can be seen through the large open door between the\r\ntwo rooms. The woman tries to steady herself by holding on the\r\ndesk, but she falls down on the floor, and the desk with her.\r\n\r\nThe man sits himself on a table, and searches the breast pocket of\r\nhis shirt for a cigarette.\r\n\r\nThe woman crawls on the floor toward the dining room. She is\r\nholding her stabbed stomach.\r\nThe man rolls a cigarette.\r\n\r\nThe woman stands up, holding on bookshelves set on the wall\r\nbetween the two rooms.\r\n\r\nThe man licks the paper of his cigarette.\r\n\r\nThe woman still holds on the bookshelves.\r\n\r\nThe man has put the cigarette in his mouth. A hand moves into the\r\nshot, holding a lit match to his cigarette.\r\n\r\nThe woman falls on the floor, with the bookshelves falling on top\r\nof her.\r\n\r\nThe two men, the one who stabbed the girl and Arkadi, the one who\r\nlit the other man's cigarette, they both look at the woman and\r\nlaugh.\r\n\r\nThe woman crawls out from underneath the bookshelves. She stands\r\nup, holding on the table.\r\n\r\nBack to the two men. A hand comes into the shot, holding a metal\r\nflask to Arkadi. He doesn't take it and the camera moves on the\r\nright to a third man sitting near the two other ones. He drinks\r\nfrom the flask.\r\n\r\nThe camera moves to the right of the shot, and the title of the\r\nfilm appears in white letters on a dark screen. The camera keeps\r\non moving from one face to another, apparently the faces of the\r\nmembers of the film crew. And on those faces, we see :\r\n\r\nCREDITS (Part Two)\r\n\r\nIn the background, we hear the noises of the girl who keeps on\r\nfalling down and breaking the furniture.\r\nClose up on a dial. A needle is moving on the dial, on which,\r\nbesides numbers, is written «Groove Depth» and «Batteries».\r\n\r\nThe woman falls down. Since she was holding on the tablecloth, the\r\ntablecloth comes away with her, and everything that was on the\r\ntable falls down on the floor.\r\n\r\nArkadi and the «murderer» are laughing.\r\n\r\nClose shot on the face of the sound engineer, with the earphones\r\non his ears.\r\n\r\nBy now, we've started to understand that what we have seen up till\r\nnow is not real, but is part of the shooting of a film, a strange,\r\na bit gory film, but still a film.\r\n\r\nThe sound engineer shushes the two laughing man down, and looks\r\ndown at his tape recorder.\r\n\r\nClose shot of the tape recorder.\r\n\r\nThe camera moves to the right, and shows a female hand writing on\r\na clipboard, then moves up and shows a large stopwatch hanging\r\nfrom a cord around the neck of the writing girl. The camera keeps\r\non moving up to show the face of the writing girl. She is Karen\r\nHughes, the assistant director and girlfriend of the director. She\r\nlooks at what is going on around the set and squints her eyes,\r\napparently not liking it.\r\n\r\nThe camera moves to the right and shows the face of Billy Hughes,\r\nKaren's sister and FX make-up artist.\r\n\r\nBack to the actress playing the part of the stabbed woman. She\r\nholds the corner of a chest of drawer, and makes everything on top\r\nof that piece of furniture fall on the floor, including several\r\nbottles of alcohol.\r\n\r\nBack to Karen and Billy. Billy represses a laughter behind her\r\nhand.\r\n\r\nClose shot on Lyosha, a young assistant camera operator, looking\r\nat Billy and smiling. Then close shot on Billy's face.\r\n\r\nThe actress holds the drapes of the nearest window. She falls down\r\non the floor tearing the drapes and breaking the curtain-rod off\r\nthe wall.\r\n\r\nKaren and Billy are both laughing silently.\r\n\r\nThe actress gets slowly out from under the torn drapes.\r\n\r\nLyosha looks at the actress, and then at Billy.\r\n\r\nBilly looks at the actress, and then at Lyosha.\r\n\r\nClose up shot on Lyosha's face, smiling.\r\n\r\nBilly walks behind Karen's back to the other side of Karen. Karen\r\nlooks at her, and then looks in the direction into which Billy is\r\nlooking.\r\nLyosha keeps on smiling.\r\n\r\nKaren whispers in Billy's ear.\r\n\r\n       KAREN (whispering)\r\n       He has the hots for you.\r\n\r\nBilly answers in sign language. We understand that Billy cannot\r\nspeak, but she isn't deaf.\r\n\r\n       BILLY (in sign language)\r\n       For me ? No.\r\n\r\nThe actress, half-covered with the drape, drags the curtain-rod\r\nbehind her.\r\n\r\nBilly is smiling and Karen is looking at the scene with her mouth\r\nhalf open.\r\n\r\nClose shot on a smiling bearded film crew member. The camera then\r\nmoves to the right, to an open ring binder, with a hand following\r\nwhatever is written on the document. The camera keeps on panning\r\non the right, showing part of instruments and people's hands,\r\nwhile we hear some whining noises coming from the actress.\r\n\r\nEND OF CREDITS\r\n\r\nThe camera stops on a close shot on Andy Clarke's face. Andy is\r\nthe film director.\r\n\r\nThe actress looks like a ghost with the drape covering her. She\r\nslowly falls down on the floor, among the mess she has created by\r\nbreaking and dropping every prop in sight.\r\n\r\nAndy looks thunderstruck by what he sees on the set.\r\n\r\nClose up shot on the camera. A button just switched off, showing\r\nthat there is no more film inside the camera.\r\n\r\nAndy looks at the camera and sighs.\r\n\r\n       ANDY\r\n       Cut. Brilliant.\r\n\r\nHe puts his hands on his eyes.\r\n\r\nThe actress, still lying on the floor under the drape, raises the\r\ndrape to look at Andy.\r\n\r\n       ANDY (yelling)\r\n       Natasha !\r\n\r\nHe stands up.\r\n\r\nBoth Andy and Natasha, the interpreter, walks toward the still\r\nlying actress and squats around her.\r\n\r\n       ANDY\r\n       Okay, I think we have a little communication gap here.\r\nNatasha translates in Russian what Andy just said.\r\n\r\n       ANDY\r\n       When I said «more»...\r\n\r\nNatasha translates.\r\n\r\n       ANDY\r\n       ...I didn't mean trash the fucking set.\r\n\r\nNatasha translates.\r\n\r\n       ANDY\r\n       This is not Chekhov. You're not the star. You're just\r\n       another victim.\r\n\r\nNatasha translates.\r\n\r\nThe actress tries to understand what Andy tells her through\r\nNatasha.\r\n       ANDY\r\n       You get stabbed. You die.\r\n\r\nNatasha translates\r\n\r\n       ANDY\r\n       I want to see the pain.\r\n\r\nNatasha translates.\r\n\r\n       ANDY\r\n       I want to see the blood spurting.\r\n\r\nNatasha translates. Andy turns around to Billy and Karen standing\r\namong the film crew members.\r\n\r\n       ANDY (voice over)\r\n       Billy, where was the blood ? I want to see her bleed to\r\n       death.\r\n\r\nBilly answers in sign language.\r\n\r\n       ANDY (to Billy)\r\n       Okay ?\r\n       (to the actress)\r\n       Okay ?\r\n\r\nThe actress, still lying on the floor under the drape, nods her\r\nhead.\r\n\r\n       ANDY (voice over)\r\n       Let's do it again, folks !\r\n\r\nA man yells some orders in Russian. Billy walks to the actor\r\nplaying the murderer, sitting on a prop. She checks his blood\r\ndevice. She takes the knife and plugs a tube coming from the man's\r\nshirt on the knife's handle. She explains, by signs, how the knife\r\nworks, and he nods. Billy fixes something inside his shirt and he\r\nreacts when Billy touches his stomach.\r\n\r\n       THE ACTOR\r\n       Oh !\r\n\r\nHe smiles. Billy squeezes a small bag full of fake blood. She has\r\njust taken that bag from the inside of the man's shirt. The actor\r\nkeeps on smiling and Billy doesn't seem to like the man's smile.\r\nShe puts the bag back inside the actor's shirt. Then Billy signs\r\nher sister for her to come. Karen joins Billy, who explains to the\r\nactor what he has to do, and Karen translates Billy's sign\r\nlanguage.\r\n\r\n       KAREN\r\n       You make the blood flow by squeezing the bag with your\r\n       elbow. Okay ?\r\n\r\n       THE ACTOR\r\n       Sure.\r\n\r\n       KAREN\r\n       We're gonna be here till Christmas, right ?\r\n       (turning around and calling)\r\n       Natasha !\r\n\r\nNatasha joins the group.\r\n\r\n       NATASHA\r\n       Yes.\r\n\r\n       KAREN\r\n       Tell him you make the blood flow by squeezing the bag with\r\n       your elbow.\r\n\r\nShe mimes the squeezing movement while speaking. Natasha\r\ntranslates in Russian. Karen nods her head. The actor says a few\r\nwords in Russian, nodding his head.\r\n\r\n       KAREN\r\n       Okay.\r\n\r\nBilly looks at Natasha.\r\n\r\n       NATASHA (voice over)\r\n       Tell her that he will get it right next time.\r\n\r\n       KAREN\r\n       Mmmm... She heard you. You all keep forgetting she can hear\r\n       you perfectly well.\r\n\r\nBilly smiles.\r\n\r\n       NATASHA (voice over)\r\n       Oh, I'm sorry.\r\n\r\n       BILLY (in sign language)\r\n       It's okay.\r\n\r\nThe actor laughs.\r\nLyosha, who actually is the assistant operator, is behind the\r\ncamera, near the camera operator. Andy sits down on his chair.\r\n\r\n       ANDY\r\n       Okay, from the top.\r\n\r\nHis Russian assistant, standing near the camera, with an open ring\r\nbinder in his hands, says a few words in Russian. We hear an angry\r\nvoice in the background.\r\n\r\n       THE VOICE\r\n       Stop. Stop. Stop!\r\n\r\nOn the dining room part of the set, where the young Russian\r\nactress broke everything in sight, two men are trying to fix the\r\nbroken furniture. Another one, a tall man with a beard, talks very\r\nangrily in Russian.\r\n\r\nAndy, still seated on his chair, looks at his Russian assistant.\r\n\r\n       ANDY\r\n       What's the holdup ?\r\nThe angry bearded man speaks angrily in Russian.\r\n\r\nAndy looks and listens at him and then turns toward his Russian\r\nassistant, trying to speak, but is cut off twice by the angry\r\nvoice of the man.\r\n\r\nThe bearded Russian man walks away. Then he comes back and shows\r\nhis wristwatch, saying a few more angry words in Russian.\r\n\r\nAndy looks up at his Russian assistant.\r\n\r\n         ANDY\r\n         What is he saying ?\r\n\r\n         THE RUSSIAN ASSISTANT\r\n         He says he's awfully sorry, but he needs at least a day to\r\n         redress the set.\r\n\r\n         ANDY (yelling)\r\n         A day ?\r\n\r\n         THE RUSSIAN ASSISTANT\r\n         Yeah.\r\n\r\nAndy stands up and slaps his thighs, looking very nervous.\r\n\r\n         ANDY\r\n         Okay, well, let's just do the close-up of the corpse now,\r\n         and that'll wrap it for today.\r\n\r\nThe Russian assistant says a few words in Russian. Andy makes a\r\nsign to the camera operator for him to come closer to him. The\r\noperator joins Andy.\r\n\r\n         ANDY\r\n         All right. Okay. So, what I want to do is zoom in, do a\r\n         slow zoom into the puddle of blood...\r\nOn another part of the set, behind the dining room, Billy kneels\r\ndown in front of a big ancient-looking wooden trunk.\r\n\r\nOn the lid of the trunk is written, in white large capital\r\nletters : «KEEP OUT ! BILLY'S BOX». Billy opens the trunk. Inside,\r\non the inside part of the lid, various props, and in the trunk\r\nitself, a big square plastic bottle and, in a plastic box, plenty\r\nof smaller bottles.\r\n\r\nBehind   Billy, who is still kneeling in front of the trunk, we see\r\nLyosha   walking around. He looks at Billy, who feels she is being\r\nlooked   at. She turns around and looks at Lyosha. Natasha walks\r\ntoward   Billy.\r\n\r\n         NATASHA\r\n         Billy.\r\n\r\nNatasha kneels down to be at Billy's level.\r\n\r\n         NATASHA\r\n         Madame Olga wants some sugar in her blood again.\r\nBilly laughs.\r\n\r\n       BILLY (in sign language)\r\n       Thank you.\r\n\r\nBilly stands up and starts pulling the big heavy square plastic\r\nbottle out of the trunk. Lyosha comes to help Billy pull the\r\nbottle out of the trunk. They both slowly put the bottle down on\r\nthe floor. Billy looks up at Lyosha, who is smiling to her. Then\r\nhe walks away. Billy, kneeling on the floor, opens the bottle.\r\nKaren walks in from behind the trunk. She leans on the open lid of\r\nthe trunk.\r\n\r\n       KAREN\r\n       So, he's kind of cute.\r\n\r\nBilly is pouring a bag of sugar in the bottle.\r\n\r\n       KAREN\r\n       Three months in Moscow, cold winter nights...\r\n\r\nBilly smiles.\r\n\r\n       KAREN\r\n       Just a thought.\r\n\r\nBilly makes several language signs.\r\n\r\n       KAREN\r\n       Billy, that's what Mom would say.\r\n\r\nBilly looks at her sister.\r\n\r\nAnother part of the set, near the entrance of the set. The\r\nbuilding janitor, wearing a more or less official cap, just walked\r\nin. Karen sees the janitor and waves at him. Billy looks in the\r\njanitor's direction.\r\n       KAREN\r\n       Hi.\r\n\r\nBilly waves at the janitor, who waves back at the girls. Then he\r\nyells something in Russian. Billy and Karen look at each other.\r\nThey seem to understand what he says. Billy shows two finger to\r\nhim. The janitor says something in Russian and walks away.\r\n\r\nThe dining-room set. The young Russian actress is sitting on the\r\nfloor among the debris she has created and she is putting lipstick\r\non her lips, looking at her face in a small pocket mirror. Billy\r\nwalks in with a small plastic case in her hands. She sits on the\r\nfloor next to the actress and puts the box down beside her. She\r\ntakes the lipstick and the mirror away from the actress' hands,\r\nand puts them down on the floor. Then she gives her a little piece\r\nof white cotton to wipe the lipstick out of her lips. The actress\r\ntakes it and starts wiping her lips. Then Billy takes some make-up\r\nto put it on the actress' face. A male hand puts a light meter\r\nclose to the actress' face.\r\n\r\nA strong light starts playing on Billy's face, and we hear a\r\nRussian voice who seems to come from a loudspeaker.\r\n\r\nThe upper part of the film set. Three big spotlights on a rack. An\r\nelectrician is playing with one of them.\r\n\r\nBilly puts her hand above her eyes to try to locate who is sending\r\nthat strong light on her face.\r\n\r\nThe electrician says a few words in Russian.\r\n\r\nThe actress looks up to see who is talking.\r\n\r\nCloser shot on the electrician sitting on the spotlight rack. He\r\nis Arkadi, the man who was sitting next to the actor playing the\r\nmurderer, and who offered him a light for his cigarette. He speaks\r\nin Russian with a queer smile on his face.\r\n\r\nNatasha squats down near Billy and the actress, to speak to Billy.\r\n\r\n       NATASHA\r\n       He says use more white like a real dead body.\r\n\r\nBilly covers her eyes and looks up at the spotlight rack.\r\n\r\nArkadi smiles and winks to Billy.\r\n\r\nBilly closes her plastic case.\r\n\r\nThe actress eats a piece of cake. She lies down on the floor.\r\n\r\n       ANDY (voice over)\r\n       Okay, Boris, get everyone ready.\r\n\r\nBilly, using a pair of tweezers, puts something, which looks like\r\na cherry, out of a small bottle and into the actress' mouth.\r\n\r\n       A VOICE OVER WITH A RUSSIAN ACCENT\r\n       Out of frame, Billy.\r\nBilly stands up and walks away.\r\n\r\nThe camera, and the group of people around it. Andy is sitting on\r\nhis director's chair, and Karen is kneeling on the other side of\r\nthe camera, writing on a clipboard. A clapperboard girl walks in\r\nfront of the camera, says a few words in Russian, claps her\r\nclapperboard and walks away. We hear a loud noise, and most of the\r\nspotlights are suddenly switched off. Andy looks up at the\r\nspotlight racks.\r\n\r\n       ANDY\r\n       What... what is going on now ?\r\n\r\nBilly, standing in the half-dark set with her plastic case in\r\nfront of her, looks up around her as more spotlights are switched\r\noff with loud noises.\r\n\r\nAlex, who must be the assistant producer, walks toward Andy,\r\ntapping his wristwatch.\r\n\r\n       ALEX\r\n       Andy. Sorry, it's six o'clock.\r\n\r\n       ANDY\r\n       One shot, one more shot !\r\n\r\n       ALEX\r\n       We have no time.\r\n\r\nBilly opens her arms in a gesture of despair.\r\n\r\nAll the people around Andy start leaving the set.\r\n\r\n       ANDY\r\n       One shot ! I can't believe this.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR EVENING\r\n\r\nNight is coming. The sky is grey. In the background, a group of\r\npeople is coming out of a building.\r\n\r\nAndy and Billy are crossing the parking lot. Cars are driving\r\naround them : the film crew members are leaving the studio. Andy\r\nwaves his hand at one of them.\r\n\r\nAndy and Billy come to a white car parked near a red car. Karen is\r\nwalking on the other side of the white car. She opens the driver's\r\ndoor. Billy is standing near the red car, and looking for\r\nsomething in her purse. She can't find it and looks disappointed.\r\nShe taps on the roof of her car.\r\n\r\nKaren was ready to get inside her car, but, when she hears Billy's\r\ntapping, she looks up. Billy explains something in sign language.\r\nAndy doesn't understand and turns towards Karen\r\n\r\n       KAREN\r\n       She needs to go get Strohbecker's face.\r\n\r\nAndy claps his hands.\r\n       ANDY\r\n       Ohh ! Right ! His dummy falls off the balcony on Monday.\r\n\r\n       KAREN\r\n       We'll wait for you here.\r\n\r\nBilly starts walking away. Andy turns toward Karen.\r\n\r\n       ANDY\r\n       Karen, she's got her own car.\r\n\r\nBilly explains something in sign language.\r\n\r\n       KAREN\r\n       Okay. Okay. Don't forget tonight.\r\n\r\nShe opens the door of her car. Andy turns around to face Billy.\r\n\r\n       ANDY\r\n       Yeah, yeah, yeah! Fiesta ! I'm making my famous chili con\r\n       Clarke.\r\nNear Andy's car, Alex, the assistant producer we just saw on the\r\nset, is opening the door of his car.\r\n\r\n       ANDY\r\n       Alex !... what do you say ? You coming ?\r\n\r\nAlex has already opened the door of his car.\r\n\r\n       ALEX\r\n       Sorry. I have tickets for the Bolshoi Ballet tonight.\r\n\r\nAndy sneers.\r\n\r\n       ANDY\r\n       Well, try and stay awake.\r\n\r\nAndy opens the door, gets inside the car and closes the door.\r\n\r\nCINEMA STUDIO - BILLY'S WORKSHOP - INTERIOR EVENING\r\n\r\nClose up shot on a green hideous mask held with both hands by\r\nBilly.\r\n\r\nAround Biily, all the props used for the film she is working on,\r\nor other films. Billy puts the green mask down. She looks around\r\nfor something. She throws away various masks she doesn't need.\r\nBilly is kneeling near a large box used as a table. On the box\r\nsomething is written in large capital Russian letters. Around\r\nBilly, a lot of props are scattered around. Apparently, Billy\r\ncan't find what she is looking for, and sits back on her heels in\r\ndespair. She hears a loud noise. She sits up when she hears the\r\nnoise. She tries to figure out what that noise means. She stands\r\nup and runs toward a window.\r\n\r\nThe sky is darker. The night is coming soon. Billy looks through\r\nthe window.\r\nOn the parking lot, seen trough the bars of the window, the\r\njanitor is crossing the yard with his dog.\r\n\r\nBilly opens the window and turns around, looking for something to\r\nhit the metal bars of the window. She takes a spear from a suit of\r\narmor. Then she bangs on the bars of the window with the long\r\nhandle of the spear.\r\n\r\nOn the parking lot, seen through the bars of the window, the\r\njanitor keeps on walking around with his dog, apparently not\r\nhearing the noise made by Billy. Then he closes the main door of\r\nthe studio parking lot.\r\n\r\nBilly drops the spear on the floor and runs away from the window.\r\n\r\nCINEMA STUDIO - CORRIDOR - INTERIOR NIGHT\r\n\r\nA large corridor. A door opens and Billy rushes out. She opens a\r\ndoor at the end of the corridor and runs out.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\nThe gallery around the top of the set. A door opens and Billy runs\r\nalong the gallery.\r\n\r\nAt ground level, we see Billy coming down the stairs leading to\r\nthe gallery. Billy runs across the film set, which seems not to\r\nhave been used recently.\r\n\r\nBilly reaches a heavy metal door and tries to open it... without\r\nany success. She kicks it.\r\n\r\nCINEMA STUDIO - ANOTHER ROOM - INTERIOR NIGHT\r\n\r\nThe parking lot seen trough the heavy metal bars of a door. It is\r\ndarker than before and completely empty. Close-up shot on an big\r\npadlock and a thick chain set across the bars of the door.\r\n\r\nKAREN AND ANDY'S APARTMENT - KITCHEN - INTERIOR NIGHT\r\n\r\nWe hear very loud rock music.\r\n\r\nClose shot on the gas stove. Ground meat is cooking in a frying\r\npan. Chopped onions are being poured into another frying pan from\r\na wooden cutting board.\r\n\r\nAndy is spraying some spices on the meat. He is wearing an apron\r\ntied around his waist. He tastes his «cuisine» from a spoon. He is\r\nbobbing up an down in rhythm with the music. Andy makes the round\r\nspice rack spin around very fast and picks up a jar from the rack.\r\nThen he pours spices from two different jars with both hands, in\r\nrhythm with the music, miming a drummer beating his drums with his\r\nsticks. Then he pours tomato sauce from a can into a saucepan. He\r\nthrows the empty can away.\r\n\r\n       ANDY\r\n       Yeah !\r\n\r\nHe takes another spice jar. But the lid of the jar comes off, and\r\nall the spices fall down into the meat. He puts the empty jar\r\ndown.\r\n\r\n       ANDY\r\n       Damn !\r\n\r\nHe takes the lid off the meat. We hear the phone ringing. Andy\r\nlowers the volume of the music from the radio set hanging on the\r\nwall. The phone is still ringing.\r\n\r\n       ANDY\r\n       Honey ! Honey, can you get that ?\r\n\r\nAndy takes the meat frying pan out of the stove to pour the meat\r\ninto the onions frying pan.\r\n\r\nKAREN AND ANDY'S APARTMENT - LIVING ROOM - INTERIOR NIGHT\r\n\r\nThe kitchen seen from the dark living room. There is no door\r\nbetween kitchen and living room, just a wide open arch. The phone\r\nis still ringing. Andy turns around.\r\n\r\n       ANDY\r\n       Honey !\r\n\r\n       KAREN (voice over)\r\n       I'm in the shower !\r\n\r\nAndy puts the frying pan back on the stove and runs in the living-\r\nroom. He picks up the phone from a table.\r\n\r\n       ANDY\r\n       Hello ?... Hello ?\r\n\r\nCINEMA STUDIO - A ROOM - INTERIOR NIGHT\r\n\r\nClose dark shot of Billy with the telephone handset to her ear.\r\nShe taps on the microphone of the handset. The telephone set is on\r\na small shelf fixed on the wall.\r\n\r\nKAREN AND ANDY'S APARTMENT - LIVING ROOM - INTERIOR NIGHT\r\n\r\nEven if the volume of the radio has been lowered, it is still loud\r\nenough for Andy not to be able to hear Billy's tapping. A hissing\r\nsound, coming from the kitchen, makes him turn around.\r\n\r\nKAREN AND ANDY'S APARTMENT - KITCHEN - INTERIOR NIGHT\r\n\r\nOn the stove, a big stew pot is hissing, and water is leaking\r\nbetween the lid and the pot.\r\n\r\nKAREN AND ANDY'S APARTMENT - LIVING ROOM - INTERIOR NIGHT\r\n\r\nAndy takes the telephone set and runs toward the kitchen. But the\r\ncord is a bit too short and is stretched tight just when he\r\nreaches the kitchen. He drops the telephone set on the floor.\r\n\r\n       ANDY\r\n       Hello ?\r\n\r\nHe tries to reach the stove control panel while still holding the\r\ntelephone handset to his ear.\r\n\r\nKAREN AND ANDY'S APARTMENT - KITCHEN - INTERIOR NIGHT\r\n\r\nAndy's hand is trying to reach the control panel of the stove.\r\n\r\nCINEMA STUDIO - A ROOM - INTERIOR NIGHT\r\n\r\nBilly is still tapping on the microphone of the telephone.\r\n\r\n       ANDY (voice over from the telephone)\r\n       Hello ?\r\n\r\nKAREN AND ANDY'S APARTMENT - KITCHEN - INTERIOR NIGHT\r\n\r\nAndy puts the telephone back on its hook on the set on the floor\r\nof the kitchen.\r\n\r\nCINEMA STUDIO - A ROOM - INTERIOR NIGHT\r\n\r\nWe hear the disconnection tone of the telephone. Billy puts is\r\nback on its hook on the small shelf on the wall. She leans on the\r\nshelf, feeling dispirited.\r\n\r\nMOSCOW - AERIAL SHOT - EXTERIOR NIGHT\r\n\r\nAerial shot of Moscow, with all the cars driving on the main\r\nhighways. The camera pans to the right and reaches an high brick\r\nbuilding near the river.\r\n\r\nFade in to :\r\n\r\nKAREN AND ANDY'S APARTMENT - KITCHEN - INTERIOR NIGHT\r\n\r\nAndy is setting some food on a plate on the small table. The music\r\nis off. We hear the waiting tone of the telephone.\r\n\r\n       KAREN (voice over)\r\n       Didn't it even cross your mind ?\r\n\r\nKAREN AND ANDY'S APARTMENT - LIVING ROOM - INTERIOR NIGHT\r\n\r\nKaren is seated at the table, holding the telephone handset to her\r\near. We still hear the waiting tone. The telephone set is beside\r\nher on the table, where three candles are burning in three\r\ncandlesticks.\r\n\r\n       KAREN\r\n       It could've been Billy.\r\n\r\n       ANDY (voice over from the kitchen)\r\n       I was thinking about dinner.\r\n\r\nFull shot of the room, with Karen seated at the table, and Andy in\r\nthe kitchen in the background, still fixing dinner.\r\n\r\n       ANDY\r\n       I'm still thinking about dinner.\r\n\r\n       KAREN\r\n       She's not there either. Shit.\r\n\r\nShe shuts the telephone by pressing on the hook, still keeping the\r\nhandset to her ear. We ear the long tone of the telephone.\r\n\r\n       KAREN\r\n       Okay. Ohh !\r\n\r\nShe dials another number.\r\n\r\nCINEMA STUDIO - BILLY'S WORKSHOP - INTERIOR NIGHT\r\n\r\nThere are no light, and the room is completely dark. We hardly see\r\na huge bear and a bat. The camera pans on the right, tilting\r\nslightly down. The camera comes to Billy, seated behind a desk and\r\ndialing on a telephone set. She puts the handset to her ear, but\r\nonly gets a busy tone. She puts the phone down on its hook.\r\n\r\nDocuments are scattered on the desk. A draught makes one of the\r\ndocuments fly away. Billy looks surprised by what just happened.\r\nSome more papers fly away. She looks on her right at a door with\r\nfrosted small window panes, which closes shut by itself.\r\nOn the top of the door, a small bell is ringing.\r\n\r\nBilly looks at the door and stands up\r\n\r\nCINEMA STUDIO - CORRIDOR - INTERIOR NIGHT\r\n\r\nA long dark corridor. A door opens on the right, ringing the small\r\nbell. It's the door of Billy's workshop. Billy walks out of the\r\nroom. In the dark, we only see the dark outline of her figure. She\r\nstops, not sure about where she is going to go next. Eventually,\r\nshe starts walking slowly. She stops again when she hears voices\r\nspeaking in Russian. Then she starts walking again.\r\n\r\nA metal door with a notice hanging from the handle. Zoom on the\r\nnotice, on which something is written in Russian. Actually, it is\r\nan elevator door.\r\n\r\nCINEMA STUDIO - ELEVATOR - INTERIOR NIGHT\r\n\r\nBilly peeks from behind the elevator door to look at what is going\r\non down below.\r\n\r\nHigh angle shot of the elevator shaft. We hear voices speaking in\r\nRussian and we see some light at the bottom of the shaft, where\r\nthe cabin is.\r\n\r\nBilly is still peeking into the elevator shaft. A draught is\r\nwaving her hair. She moves away.\r\n\r\nCINEMA STUDIO - CORRIDOR - INTERIOR NIGHT\r\n\r\nBilly closes the door of the elevator. She walks toward the\r\nstaircase, and starts walking downstairs. Through the open door of\r\nthe staircase, we see her stopping, because she just heard a faint\r\nsound of a telephone ringing.\r\n\r\nKAREN AND ANDY'S APARTMENT - LIVING ROOM - INTERIOR NIGHT\r\nKaren is still seated behind the table and listening to a\r\ntelephone which keeps on ringing without any answer. Andy walks\r\nslowly toward the table, coming from the kitchen. Karen looks very\r\nnervous. Suddenly we hear a clicking noise in the telephone.\r\n\r\n       KAREN\r\n       Hello, Billy !\r\n\r\nKaren looks up at Andy.\r\n\r\n       KAREN\r\n       Thank God. She's there. Are you all right ?\r\n\r\n       ANDY\r\n       Ask her about the mask.\r\n\r\nKaren shushes Andy with her hand.\r\n\r\n       KAREN\r\n       You want to tap something through ?\r\nCINEMA STUDIO - BILLY'S WORKSHOP - INTERIOR NIGHT\r\n\r\nBilly is holding the telephone next to her ear. She taps on the\r\nmicrophone with her finger.\r\n\r\nKAREN AND ANDY'S APARTMENT - LIVING ROOM - INTERIOR NIGHT\r\n\r\nKaren has the telephone handset squeezed between her head and her\r\nshoulder.\r\n\r\n       KAREN\r\n       Wait. Wait. Wait.\r\n\r\nAndy turns around because he just heard a hissing noise in the\r\nkitchen. He runs toward the stove.\r\n\r\n       ANDY\r\n       Oh, man !\r\n\r\n       KAREN (voice over)\r\n       A...O...\r\n\r\n       ANDY\r\n       Oh, man !\r\n\r\nIn the kitchen, Andy tries to save his cooking.\r\n\r\n       KAREN\r\n       ...L ?\r\n\r\nAndy puts his frying pan down into a large white plastic can full\r\nof water, where it starts hissing.\r\n\r\n       ANDY\r\n       Man ! Oh, man !\r\n\r\n       KAREN\r\n       Was it L ? The second letter, was it L ?\r\nKaren shushes Andy with her hand.\r\n\r\n       ANDY\r\n       Shit !\r\n\r\nAndy is getting his frying pan out of the plastic can.\r\n\r\n       KAREN\r\n       A-L-L ?\r\n\r\nWhile Karen is trying to understand her sister's message, Andy is\r\nbanging the frying pan on the side of the can, to get rid of\r\neverything that was inside it.\r\n\r\n       KAREN\r\n       O...kay !\r\n\r\nShe smiles.\r\n\r\nIn the kitchen, Andy looks at his empty frying pan.\r\n       ANDY\r\n       We're eating out tonight.\r\n\r\n       KAREN\r\n       Okay. So are you coming over now ?\r\n\r\nCINEMA STUDIO - BILLY'S WORKSHOP - INTERIOR NIGHT\r\n\r\nBilly keeps on tapping on the microphone.\r\n\r\n       KAREN (voice over on the telephone)\r\n       Do you have the mask ?\r\n\r\nBilly taps again.\r\n\r\nKAREN AND ANDY'S APARTMENT - LIVING ROOM - INTERIOR NIGHT\r\n\r\n       KAREN\r\n       Well, don't worry. Just get over here.\r\n\r\n       ANDY\r\n       You hungry ?\r\n\r\n       KAREN\r\n       Bye.\r\n\r\nAndy throws the frying pan in the can of water, where it hisses\r\nagain. Karen looks at Andy, puts the telephone down and makes a\r\nface.\r\n\r\nCINEMA STUDIO - STAIRCASE - INTERIOR NIGHT\r\n\r\nBilly is running downstairs.\r\n\r\nCINEMA STUDIO - A FILM SET - INTERIOR NIGHT\r\n\r\nThe entrance of a film set. We hear some giggles. The door opens,\r\nBilly enters and closes the door behind her.\r\nIn the background, spotlights are switched on above a scenery :\r\napparently, someone is shooting a film. Billy walks noiselessly\r\nacross the empty part of the set. As Billy comes closer to the lit\r\npart of the set, we hear strange noises that sound like a woman\r\nhaving an orgasm.\r\n\r\nWith Billy in the background, we see a camera with an operator\r\nbehind it.\r\n\r\nOn a bed, two actors are having sex. The female, a blonde woman,\r\nis naked, the male has his pants down to his ankles and is wearing\r\na T-shirt and a white mask.\r\n\r\nBilly looks slightly embarrassed by what she sees.\r\n\r\nClose shot on the face of the camera operator, looking into the\r\nviewfinder of his camera. He is Lyosha, the young man who was\r\ncourting Billy.\r\n\r\nThe blonde naked woman is moaning. She is a slightly plump woman\r\nwith hair too blonde to be true. She could be in her forties.\r\nBilly, still looking slightly embarrassed, is also smiling.\r\n\r\nThe woman is faking a very strong orgasm.\r\n\r\n       LYOSHA (voice over)\r\n       Stop ! Stop ! Stop !\r\n\r\nThe woman instantly stops faking her orgasm and gets up from the\r\nbed. Lyosha talks in Russian to the woman, who is still lying on\r\nthe bed. Her «lover», lying on the woman, is answering Lyosha in\r\nRussian.\r\n\r\nLyosha looks back into his viewfinder.\r\n\r\nWe hear the woman, moaning again. Billy walks around the set.\r\n\r\nClose shot on the face of the «lover». He is wearing the mask\r\nBilly has been looking for. In the background behind the man, we\r\nsee Billy, looking from behind an open window in the scenery.\r\n\r\nLyosha looks up from his viewfinder, then back again into it.\r\n\r\nThe woman's «lover» slaps her gently on the face, but keeps on\r\nhaving sex with her. The man slaps her again but much harder this\r\ntime. She screams.\r\n\r\nBilly looks surprised by what she sees.\r\n\r\nThe man holds the woman down on the bed with both hands. He slaps\r\nher very hard several times and then hits her with his fist.\r\n\r\nBilly closes her eyes, disgusted by what she sees. We hear the\r\nwoman being hit and screaming.\r\n\r\nThe woman seems very surprised by what is happening to her. The\r\nman keeps on hitting her. She tries to cover her face from the\r\nblows she is getting repeatedly.\r\nLyosha smiles, looking very happy with what is happening on the\r\nset.\r\n\r\nThe woman tries to get the man away from her. She grabs his mask\r\nand throws it away. Underneath the mask, the man has another black\r\nvery close-fitting fabric mask hiding his face, which could be a\r\nblack stocking. He grabs both her hands with one of his hands, and\r\nholds them above her head. Then he takes a black strong ribbon\r\nfrom under the bed and ties her hands with it. The woman is now\r\nvery frightened and tries to get free. The man slaps her very\r\nhard.\r\n\r\nClose shot on a pillow being lifted by the hand of the man. Under\r\nthe pillow, there is a long very sharp knife.\r\n\r\nBilly can't believe what she sees.\r\n\r\nThe man takes the knife and slowly lifts the knife above his head.\r\n\r\nBilly looks more and more frightened. She has tears in her eyes.\r\nShe is crying silently with her fist in her mouth.\r\nThe man start stabbing the woman. Her blood is splashing on the\r\nwall and the man's T-shirt. The woman is covered with her own\r\nblood.\r\n\r\nBilly starts walking away from the window and across the set.\r\n\r\nThe woman doesn't seem to move anymore, but the man is still\r\nstabbing her.\r\n\r\nBilly walks backward across the set and she bumps into a hatstand\r\nwhich falls down. Everything that was in the open purse hanging on\r\nthe hatstand - hairbrush, keys, lighter, make-up things, etc. -\r\nfalls on the floor. A plastic diskette-case skids on the floor and\r\nslips under a big wooden wardrobe.\r\n\r\nLyosha, alerted by the noise, stands up from his camera.\r\n\r\nBilly is kneeling on the floor near the fallen hatstand.\r\n\r\nLyosha goes back to his camera.\r\n\r\nBilly, kneeling on the floor, puts everything back into the purse.\r\nThen she stands up, puts the hatstand back on its legs and walks\r\naway from it. She hides behind the large wooden wardrobe. Lyosha\r\nwalks slowly toward the place where Billy is hiding. Billy walks\r\naway and Lyosha stops near the hatstand.\r\n\r\nCINEMA STUDIO - CORRIDOR - INTERIOR NIGHT\r\n\r\nThe long dark corridor. In the foreground on the left, the\r\nstaircase, the only part of the set where there is light\r\n(apparently coming from the windows and the street lights). Billy\r\nis running upstairs. She enters the corridor, where she starts\r\nrunning, just when Lyosha appears in the staircase, running after\r\nBilly. When he reaches the landing, Lyosha switches on the lights\r\nin the corridor. Just before Lyosha enters the corridor, in the\r\nbackground, we see Billy hiding in a nook, a small partition, in\r\nthe corridor.\r\n\r\nLyosha looks for her. Billy seems suddenly interested by something\r\nup on the wall across from her. It is a sign for an emergency\r\nexit. Billy looks in the direction the sign is pointing at. It is\r\nthe emergency exit.\r\n\r\nLyosha is coming toward Billy's hiding. He stops to listen for a\r\nmeaningful noise. He opens a door to look into a room. Billy peeks\r\nfrom behind her hiding nook. She runs toward the emergency exit,\r\nwhich is located toward the end of the long corridor.\r\n\r\nThe open door, and just behind it, Lyosha looking into the room.\r\nHe switches the light off, just as Billy reaches the emergency\r\nexit. He walks out of the room, and closes slowly the door behind\r\nhim. He looks at the far end of the corridor.\r\n\r\n       LYOSHA\r\n       Hey !\r\n\r\nHe walks a couple of steps and stops. He turns around and says a\r\nfew words in Russian.\r\nBilly is hiding behind a big red vending machine at the far end of\r\nthe corridor. Lyosha looks around him and Billy looks at the\r\nemergency exit.\r\n\r\nClose shot on the handle of the emergency door. Then the camera\r\npans on the left and stops on the red emergency box, with the door\r\nkey inside. Near the key, is posted a long notice in Russian.\r\n\r\nLyosha walks slowly toward Billy. He tries to open a door, but it\r\nis locked. We hear him talking in Russian.\r\n\r\nBilly is still hidden behind the red vending machine.\r\n\r\n       LYOSHA\r\n       Hello ?\r\n\r\nLyosha keeps on walking slowly toward Billy.\r\n\r\n       LYOSHA\r\n       Is anyone there ?\r\n\r\nLyosha is looking at the far end of the corridor. He crosses\r\ntoward a door.\r\n\r\n       LYOSHA\r\n       I can explain.\r\n\r\nHe opens the door and walks inside the room.\r\n\r\nBilly peeks cautiously from behind the machine, and sees the open\r\ndoor. She runs toward the emergency exit. She breaks the glass\r\nwith her hand and grabs the key.\r\n\r\n       LYOSHA (voice over)\r\n       Ho ?\r\n\r\nBilly runs back toward the vending machine, behind which she hides\r\nagain.\r\n\r\nLyosha walks out of the room, leaving the door open, and looks at\r\nthe far end of the corridor.\r\n\r\nBilly is still hidden behind the vending machine. Lyosha is coming\r\ntoward her. Billy moves slowly along the wall, keeping her back as\r\nclose as possible of the wall. She opens a door and enters a dark\r\nroom. She closes the door behind her.\r\n\r\nLyosha reaches the vending machine, and starts running toward the\r\nemergency exit. He stops near the emergency box with its broken\r\nglass. He looks inside the emergency box. His finger comes out of\r\nthe box, with the tip covered with Billy's blood. He tries to open\r\nthe emergency door, which is locked.\r\n\r\nCINEMA STUDIO - STORE ROOM - INTERIOR NIGHT\r\n\r\nA dark store room, with large windows. The door opens and Lyosha\r\nwalks in. He runs to the window. He looks outside, but seeing\r\nnothing significant, he turns around and walks a couple of steps\r\ninside the room. He stops and looks around. He starts walking\r\nagain across the room. Suddenly something catches his eye.\r\n\r\nClose shot on the bottom of a long drape. There is a thin space\r\nbetween the bottom of the drape and the floor. And on this thin\r\nspace, the tip of a shoe is showing. Lyosha walks slowly toward\r\nthe drape. He pulls the drape open with a very quick movement.\r\nSeveral racks of shoes were actually hidden by the drape.\r\n\r\nCINEMA STUDIO - BILLY'S WORKSHOP - INTERIOR NIGHT\r\n\r\nA door opens in the back of the room and Billy walks in the room.\r\nThere is some light coming from the door. Billy walks to the main\r\ndoor of the room and opens it. She raises her arm and grabs the\r\nbell at the top of the door to silence it. She walks out of the\r\nroom.\r\n\r\nCINEMA STUDIO - CORRIDOR - INTERIOR NIGHT\r\n\r\nThe long corridor. The lights are still on. Billy walks out of her\r\nworkshop and closes the door. She starts running along the\r\ncorridor toward the emergency exit. She suddenly stops, when she\r\nhears a door opening. She runs back toward the staircase and hides\r\nnear the entrance of the staircase. In the background, we see\r\nLyosha coming out of a room. The camera pans toward the staircase\r\nand Billy. A door opens on the floor below, and the large shadow\r\nof a man is projected on the wall of the staircase. Billy runs on\r\nthe other side of the landing, while the man starts climbing the\r\nstairs. He is Arkadi, the electrician working on Andy's film, and\r\nthe one who was playing with a spotlight on Billy's face. He is\r\nbare-chested, which makes us believe he was the poor actress'\r\nmurderer. He reaches the landing and stops.\r\n\r\nBilly is still hiding in a dark corner. She sees Arkadi coming on\r\nthe landing.\r\n\r\n       ARKADI\r\n       Lyosha !\r\nLyosha is coming to meet Arkadi. They speak in Russian.\r\n\r\nBilly looks at the two men, then she moves silently away from\r\nthem. She reaches the door of the elevator, which is supposed to\r\nbe out of order, and opens it. She puts the key of the emergency\r\nexit door in her mouth, and start climbing down the elevator shaft\r\nemergency ladder.\r\n\r\nCINEMA STUDIO - ELEVATOR - INTERIOR NIGHT\r\n\r\nBilly climbs down the emergency ladder, trying not to miss the\r\nsteps.\r\n\r\nHer face is now on the level of the bottom of the door of the\r\nelevator. There is a small gap between the bottom of the door and\r\nthe floor, which enables Billy to peek at what is going on in the\r\ncorridor.\r\n\r\nA shoe appears in the gap between the door and the floor.\r\n\r\nClose shot on the small window at the top of the elevator door.\r\nArkadi's face appears in the window. He looks around inside the\r\nelevator shaft.\r\n\r\nBilly is not in front of the gap anymore, but hiding in the dark.\r\nShe puts the key in front of the gap.\r\n\r\nArkadi tries to open the door of the elevator. But it is locked.\r\nThe blood on his hand proves that Arkadi was actually the poor\r\nactress' murderer. Through the small window, he looks around in\r\nthe shaft.\r\n\r\nBilly tries not to be seen through the gap.\r\n\r\nArkadi still looks around in the shaft. He turns his head to talk\r\nin Russian to Lyosha.\r\n\r\nBilly has got the key back between her teeth. We hear the two men\r\ntalking in Russian.\r\n\r\nArkadi's face moves away from the window. Some lights are switched\r\noff, making the window slightly darker.\r\n\r\nBilly moves away from the wall of the shaft and falls. She catches\r\nthe elevator cables.\r\n\r\nClose shot on Billy's face. She is holding the cables. She makes a\r\nface because of the pain. She doesn't have the key in her mouth\r\nanymore.\r\n\r\nClose shot on a concrete ledge somewhere along the shaft. The\r\nemergency door key drops on it, then moves away from it.\r\n\r\nBilly is trying to climb back up to the door.\r\n\r\nWe see the elevator cabin at the bottom the shaft, and Billy in\r\nthe foreground, trying to climb back up. There is some light in\r\nthe cabin. We hear some strange noise in the shaft. Billy looks\r\ndown at where the noise is coming from.\r\nClose shot on the key, seen through the chicken wire roof of the\r\ncabin, and resting on the floor of the cabin.\r\n\r\nBilly, still holding the cables, starts going slowly down. She\r\nmisses a step but holds on the cables. She keeps on going down the\r\nshaft. She eventually reaches the roof of the cabin. We hear\r\nmuffled voices talking in Russian.\r\n\r\nBilly sits down on the roof of the cabin to rest a little. Through\r\nthe chicken wire that covers the roof of the cabin, she sees the\r\nkey on the floor of the cabin. She tries to open a panel in the\r\nchicken wire. It is stuck but she eventually succeeds in opening\r\nit. She moves the panel on its hinges and rests it against the\r\nwall. We still hear the muffled voices talking in Russian. Billy\r\nstarts climbing down in the opening in the chicken wire.\r\n\r\nBilly drops down on the floor of the cabin. The front door of the\r\ncabin is wide open showing the well lit store room in front of the\r\ncabin. But the cabin is not completely at the same level as the\r\nroom : it is slightly higher. We hear banging noises in the\r\nbackground.\r\nBilly looks at the room and is suddenly frightened by something.\r\nShe stands up and looks up at the roof of the cabin. She climbs\r\nback toward the roof. We see Lyosha in the room, walking toward\r\nthe elevator.\r\n\r\nLyosha is coming closer, carrying a large plastic trash bag on his\r\nshoulder. When he reaches the elevator, he takes the bag down from\r\nhis shoulder, and drops it in the gap between the bottom of the\r\ncabin and the floor of the room. The plastic bag drops down to the\r\nbottom of the shaft.\r\n\r\nBilly, lying on the roof of the cabin, is looking through the\r\nchicken wire.\r\n\r\nArkadi is walking toward the elevator, carrying a bag on his\r\nshoulder, and pulling another one on the floor.\r\n\r\nClose shot on the key, which was not actually on the floor of the\r\ncabin, but on the floor of the room, just outside the cabin. The\r\nplastic bag, pushed by Arkadi under the cabin, pushes the key in\r\nthe gap.\r\n\r\nLyosha and Arkadi are standing just outside the cabin. Lyosha is\r\npushing another bag in the gap. The two men then walk away from\r\nthe cabin.\r\n\r\nBilly climbs down from the roof of he cabin and stands up on the\r\ncabin floor. Seeing Lyosha, she squats down, but Lyosha walks\r\naway.\r\n\r\nBilly climbs out of the cabin. Then she enters the gap and starts\r\nclimbing down the shaft, using the emergency ladder.\r\n\r\nThe bottom of the shaft is full of plastic bags and various\r\ndebris. Billy reaches the bottom and steps on the bags. She kneels\r\ndown and starts searching for her key. Suddenly, we hear a very\r\nloud noise. Billy, startled by the noise, stands up.\r\nLyosha is looking through the gap at the bottom of the shaft. He\r\nturns around and talks in Russian to Arkadi.\r\n\r\n       LYOSHA\r\n       Arkadi !\r\n\r\nBilly is hiding among the plastic bags.\r\n\r\nLyosha is still calling Arkadi.\r\n\r\n       LYOSHA\r\n       Arkadi !\r\n\r\nHe talks to him in Russian.\r\n\r\nArkadi comes near Lyosha with a powerful flashlight, and, with it,\r\nhe looks into the bottom of the shaft. The light from the\r\nflashlight is playing on the bags.\r\n\r\nClose shot of Billy's face, hidden among the bags. The light moves\r\nnear Billy's face, then moves to a transparent bag, near Billy,\r\nwith a head inside. Billy looks up at the bag. She screams\r\nnoiselessly. Suddenly she turns around, because she has seen\r\nsomething else.\r\n\r\nClose shot of the emergency door key, lying among the debris,\r\nbrightly lit by Arkadi's flashlight.\r\n\r\nArkadi walks away from the elevator, followed by Lyosha. Before\r\nleaving, they close the outside door of the elevator. After the\r\ndoor has been closed shut, the elevator shaft becomes completely\r\ndark.\r\n\r\nBilly slowly comes out of the bags. She takes the key. Then she\r\nslowly stands up, puts the key in the pocket of her sleeveless\r\njacket and starts climbing the emergency ladder along the wall of\r\nthe shaft. She climbs just a few step to reach the first door, the\r\nbasement door.\r\n\r\nClose shot of the small window on the door of the elevator, seen\r\nfrom outside the shaft. Billy's face appears in the window. The\r\nbasement is completely dark.\r\n\r\nBilly tries to open the door, but it is locked. She bangs on it\r\nwith her hand. Then she shakes it violently. She looks up, on the\r\nverge of tears. She sighs. Then she hears some steps.\r\n\r\nArkadi is coming carrying a powerful lamp.\r\n\r\nBilly looks very frightened. The light from the lamp plays on her\r\nface.\r\n\r\nBilly moves away from the door.\r\n\r\nCINEMA STUDIO - BASEMENT - INTERIOR NIGHT\r\n\r\nArkadi stops near the locked door of the elevator, puts his lamp\r\ndown on the floor, and takes a key out of his pocket.\r\n\r\nCINEMA STUDIO - ELEVATOR - INTERIOR NIGHT\r\nBilly climbs on the emergency ladder in the shaft\r\n\r\nCINEMA STUDIO - BASEMENT - INTERIOR NIGHT\r\n\r\nArkadi opens the door of the elevator.\r\n\r\nCINEMA STUDIO - ELEVATOR - INTERIOR NIGHT\r\n\r\nBilly looks very frightened.\r\n\r\nCINEMA STUDIO - BASEMENT - INTERIOR NIGHT\r\n\r\nArkadi is kneeling down by the lamp. He starts to stand up. He is\r\ncarrying a plastic bag which he has taken away from inside the\r\nelevator shaft. He walks away, leaving the door open.\r\n\r\nCINEMA STUDIO - ELEVATOR - INTERIOR NIGHT\r\n\r\nBilly climbs down the shaft.\r\n\r\nCINEMA STUDIO - BASEMENT - INTERIOR NIGHT\r\nArkadi walks away in the basement. Billy slowly comes out of the\r\nelevator door and runs away in the opposite direction from Arkadi.\r\nShe hides behind a pillar, because she sees Arkadi's lamp in the\r\nbackground. Arkadi is coming back, and Billy moves around the\r\npillar to be hidden from Arkadi's eyes. Arkadi stops near the\r\nelevator. He opens the elevator's door.\r\n\r\nBilly runs away. She trips on something and makes a little noise.\r\nShe stops.\r\n\r\nArkadi, coming out of the elevator, looks in Billy's direction.\r\n\r\nBilly opens a door and walks out.\r\n\r\nArkadi slowly walks away from the elevator door.\r\n\r\nThe door closes smoothly behind Billy.\r\n\r\nCINEMA STUDIO - STAIRCASE - INTERIOR NIGHT\r\n\r\nBilly is walking rapidly upstairs.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nThe door of the set opens and Billy walks in. She walks slowly\r\nthrough the set, looking around her. Suddenly, the big spotlights\r\nare switched on one by one.\r\n\r\nIn the electricians' control cabin, we see Lyosha switching the\r\nlights on. More spotlights are switched on.\r\n\r\nBilly is running around on the set, trying to avoid the lights.\r\nShe reaches the scenery and jumps out of one of the scenery\r\nwindows.\r\n\r\nA searchlight, controlled by Lyosha. The searchlight is following\r\nBilly.\r\nBilly tries to avoid the searchlight. She runs away toward the\r\nexit of the set. She meets Arkadi coming back on the set, but she\r\nkeeps on running.\r\n\r\n       ARKADI\r\n       Billy !\r\n\r\nBilly starts climbing a ladder, but before climbing, she pushes a\r\nheavy piece of furniture to block the bottom of the ladder. The\r\npiece of furniture falling down makes other props fall down.\r\nArkadi starts moving the props out of his way. He reaches the\r\nbottom the ladder.\r\n\r\n       ARKADI\r\n       Wait. I explain.\r\n\r\nHe starts climbing the ladder, turning his head around to yell :\r\n\r\n       ARKADI\r\n       Lyosha !\r\nIn the electricians' control cabin, hearing his name, Lyosha looks\r\noutside the cabin.\r\n\r\n       ARKADI (voice over)\r\n       Lyosha !\r\n\r\nHe says a few words in Russian.\r\n\r\nA gallery near the ceiling of the set. Billy is running along the\r\ngallery.\r\n\r\nLyosha runs out of the electricians' control cabin and on the\r\ngallery.\r\n\r\nBilly runs down a few steps and outside the room. From the other\r\nside of the gallery, Lyosha comes running after her.\r\n\r\nCINEMA STUDIO - STAIRCASE - INTERIOR NIGHT\r\n\r\nLyosha runs downstairs.\r\n\r\nCINEMA STUDIO - CORRIDOR - INTERIOR NIGHT\r\n\r\nThe long dark corridor, with the staircase in the foreground.\r\nLyosha runs in the corridor from the staircase, but before\r\nentering the corridor, he switches the lights on. With the lights\r\non, we can see Billy running away to the far end of the corridor.\r\nLyosha runs after her.\r\n\r\nZoom on the emergency door, coming closer to us.\r\n\r\nBilly is running toward the door.\r\n\r\nBilly puts the key in the keyhole. She opens the emergency door\r\nand shuts it behind her.\r\n\r\nLyosha runs toward the door. He pushes it open.\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nThe other side of the door, opening on a small gallery leading to\r\nthe emergency ladders set along the exterior wall of the building.\r\n\r\nThe door is been violently pushed open by Lyosha. With Lyosha's\r\nviolent push, Billy falls backward, above the balcony of the\r\ngallery and down on the yard below.\r\n\r\nBilly falls on her back on a huge pile of used film metal boxes.\r\n\r\nLyosha bends over the balcony and looks down at Billy.\r\n\r\nBilly is lying among the boxes and moves her head.\r\n\r\nA blurred dark picture with lights dancing around. It is what\r\nBilly's eyes are seeing when she tries to focus after her fall.\r\nShe sees the blurred picture of Lyosha running down the emergency\r\nladder along the wall of the building.\r\n\r\n       KAREN (voice over)\r\n       Hello!\r\nThe corner of the building. A shadow is moving hidden by the\r\nbuilding.\r\n\r\n       KAREN (voice over)\r\n       Hello ?\r\n\r\nLyosha is bending over Billy. When he hears Karen's voice, he\r\nlooks up.\r\n\r\n       KAREN (voice over)\r\n       Is anybody there ?\r\n\r\nKaren appears at the corner of the building, looking around.\r\n\r\n       LYOSHA\r\n       Come here, quickly !\r\n\r\nKaren runs toward them.\r\n\r\n       KAREN\r\n       Oh, my God, Billy.\r\n\r\n       LYOSHA\r\n       Quickly !\r\n\r\nKaren runs toward Billy, still lying on the film boxes in the\r\nforeground. She bends over her.\r\n\r\n       KAREN\r\n       What did happen ?\r\n\r\n       LYOSHA\r\n       I don't know.\r\n\r\nLyosha looks up at the gallery where Billy fell from.\r\n\r\n       LYOSHA\r\n       She slipped and fall bad. Poor Billy.\r\n\r\nKaren yells in Andy's direction.\r\n\r\n       KAREN\r\n       Andy, she's at the back !\r\n\r\n       LYOSHA\r\n       Get the doctor, quickly.\r\n\r\n       KAREN\r\n       You go. I'll stay here with her.\r\n\r\nBilly is trying to say something to her sister.\r\n\r\n       KAREN\r\n       Let go of her.\r\n\r\n       LYOSHA\r\n       No, I must hold her. She must not move.\r\n\r\nLyosha's hand is restraining Billy's arm.\r\n       LYOSHA\r\n       Danger she'll never walk again if she move.\r\n\r\nBilly is moving nervously, trying to get her arm free to talk to\r\nher sister.\r\n\r\n       LYOSHA\r\n       Go !\r\n\r\n       KAREN\r\n       Yeah, okay.\r\n\r\nBilly tries to move her hand away from Lyosha and bangs on a film\r\nbox.\r\n\r\n       KAREN (yelling in voice over)\r\n       Andy !\r\n\r\nShe bends over Billy.\r\n\r\n       KAREN\r\n       Billy !... Billy, you mustn't move... You may become\r\n       paralyzed. It's dangerous... Don't worry. I'll be right\r\n       back... I promise.\r\n\r\nKaren starts moving away from Billy\r\n\r\n       KAREN\r\n       Andy !\r\n\r\nBilly moves nervously, raises from the film boxes and looks\r\ndesperately at Karen.\r\n\r\nKaren just saw Billy's last expression and seems worried.\r\n\r\nBilly is trying to articulate some words.\r\nKaren runs back toward Billy. She reaches the pile of film boxes\r\nand bend over Billy. She looks at Lyosha.\r\n\r\nAndy is walking toward them.\r\n\r\n       ANDY\r\n       What's going on ?\r\n\r\nKaren turns toward Andy.\r\n\r\n       KAREN\r\n       Andy, go with the janitor...\r\n\r\nLyosha seems worried.\r\n\r\n       KAREN (voice over)\r\n       ...and fetch an ambulance !\r\n\r\nAndy joined the janitor with his dog.\r\n\r\n       KAREN (voice over)\r\n       Billy's had an accident.\r\n       ANDY\r\n       What ?\r\n\r\nLyosha says something in Russian to the janitor.\r\n\r\n       KAREN (voice over)\r\n       Don't just stand there !\r\n\r\nKaren looks at Andy.\r\n\r\n       KAREN\r\n       Do it now !\r\n\r\nThe dog barks. Andy turns toward the janitor\r\n\r\n       ANDY\r\n       Ambulance !\r\n\r\nThe janitor answers in Russian. The dog keeps on barking. Andy\r\npushes the janitor toward his office.\r\n\r\n       ANDY\r\n       Come on !\r\n\r\nThey both walk away.\r\n\r\nKaren bends over Billy.\r\n\r\n       KAREN\r\n       It's all right, sweetie.\r\n\r\nBilly is still moving restlessly.\r\n\r\n       KAREN\r\n       I'm here now and an ambulance is on its way.\r\n\r\nKaren pushes Lyosha's hand away.\r\n       KAREN\r\n       Let go of her. She's trying to say something.\r\n\r\nLyosha stands up. Billy talks to Karen with her hand.\r\n\r\n       KAREN\r\n       Police ?\r\n\r\nBilly keeps on signing.\r\n\r\n       KAREN\r\n       Murder ?\r\n\r\nShe looks up at Lyosha.\r\n\r\nLyosha shrugs his shoulders and makes a face that means he doesn't\r\nknow what Billy is talking about.\r\n\r\n       KAREN\r\n       Andy ! Andy !\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nThis the set where the poor actress was brutally murdered.\r\n\r\nBilly is seated between Karen and Andy. She has a disoriented look\r\non her face, and a blanket is wrapped around her shoulders. Karen\r\nis tenderly stroking Billy's shoulder. We hear some laughing and\r\npeople talking in Russian.\r\n\r\nLyosha and Arkadi are talking to an uniformed Russian policeman,\r\nwho seems to be in charge of the inquiry. Consequently, he will\r\nbe, from now on, mentioned as «First Policeman»\r\n\r\nThe other policeman (who shall be mentioned as «Second Policeman»)\r\nis kneeling down, looking at something on the floor, and the\r\njanitor is standing in a corner with his dog on a leash.\r\n\r\nLyosha, Arkadi and the first policeman are still talking together.\r\nThey slowly walk toward the rest of the group. The second\r\npoliceman, who was still kneeling down, stands up.\r\n\r\nBilly is listening to Lyosha, apparently trying to lip-read and\r\nunderstand what he says. Lyosha turns toward her.\r\n\r\n       LYOSHA\r\n       Excuse me. It's true. We just fake murder. If we really\r\n       want to murder...\r\n\r\nThe two uniformed policemen are listening to Lyosha.\r\n\r\n       LYOSHA (voice over)\r\n       ...why make film of it ?\r\n\r\nLyosha and Arkadi both laugh.\r\n\r\n       LYOSHA\r\n       We're not stupid, really.\r\nThe janitor is trying to follow the conversation. We hear a\r\npoliceman talking in Russian.\r\n\r\nArkadi answers in Russian.\r\n\r\nArkadi must have said something funny, because the policemen are\r\nlaughing.\r\n\r\nLyosha and Arkadi look at Billy.\r\n\r\n       ARKADI\r\n       No, no. Sorry.\r\n\r\nBilly doesn't look at Arkadi, but Karen does.\r\n\r\n       ARKADI (voice over)\r\n       We understand how she feel. She think she see...\r\n\r\nBack to Lyosha and Arkadi\r\n\r\n       ARKADI\r\n       ...a real murder and panic.\r\nBilly taps on Karen's arm. Karen looks up at Arkadi.\r\n\r\nThe first policeman looks at the paper he is holding in his hand.\r\n\r\n       FIRST POLICEMAN\r\n       Where did you see the murder from ?\r\n\r\nBilly stands up and, pointing her finger, shows where she was\r\nduring the murder.\r\n\r\nThe two policemen both turn around to look at the place Billy is\r\nshowing. The second policeman moves away and the first one looks\r\nat his paper.\r\n\r\n       FIRST POLICEMAN\r\n       And it was this man ?\r\n\r\nHe points at Arkadi.\r\n\r\nBilly, seated again, points at Arkadi.\r\n\r\nLyosha looks at Arkadi.\r\n\r\nThe first policeman resumes the reading of his paper.\r\n\r\n       FIRST POLICEMAN\r\n       But you say here : «He wore a stocking pulled over his\r\n       head.»\r\n\r\nBilly looks very angry and keeps on pointing at Arkadi.\r\n\r\n       FIRST POLICEMAN\r\n       «And then they chased me through the building and try to\r\n       kill me as well.»\r\n\r\nArkadi yells something in Russian. Lyosha also says something in\r\nRussian, but with a quieter voice.\r\n       ANDY\r\n       Guys ! Guys ! English, please.\r\n\r\nArkadi stops yelling. Lyosha speaks to him. Arkadi pushes him\r\naway.\r\n\r\n       ARKADI\r\n       We make test for you.\r\n\r\nThe first policeman looks at Arkadi, and then at Billy.\r\n\r\n       ARKADI\r\n       For your film. We try make blood much big.\r\n\r\nAndy looks at Arkadi and then at Billy.\r\n\r\nClose shot on Billy, enabling us to read her words on her lips.\r\n\r\n       BILLY (in sign language)\r\n       He's lying !\r\n       LYOSHA (voice over)\r\n       Sorry, Billy.\r\n\r\nBilly looks at Lyosha\r\n\r\n       LYOSHA\r\n       We not tell you. Keep secret not to hurt your feelings.\r\n\r\n       ANDY\r\n       I would've let you done tests.\r\n\r\nKaren slaps Andy.\r\n\r\n       KAREN (whispering)\r\n       Andy.\r\n\r\nKaren tries to tell silently to Andy to shut up.\r\n\r\n       ANDY\r\n       What I mean is... What I mean is... Let's see their film.\r\n       I'll know if it's real.\r\n\r\nBilly nods her head, approving what Andy just said.\r\n\r\n       FIRST POLICEMAN (voice over)\r\n       You're right.\r\n\r\nThe first policeman looks at the two men, and speaks in Russian to\r\nthem.\r\n\r\nArkadi and Lyosha both look slightly embarrassed. Lyosha starts\r\nwalking away.\r\n\r\nKaren looks, with a worried eye, to the departing Lyosha.\r\n\r\n       KAREN\r\n       Wait. Stop !\r\nKaren runs after Lyosha.\r\n\r\n       KAREN\r\n       He could expose the film.\r\n\r\nThe first policeman takes Lyosha's arm and talks to him in\r\nRussian.\r\n\r\n       FIRST POLICEMAN\r\n       Let her do it. Please.\r\n\r\n       KAREN\r\n       Okay.\r\n\r\nKaren starts working on the hermetic bag used as a portable dark\r\nroom. Karen puts her arms inside the bag.\r\n\r\n       KAREN\r\n       This lets you unload the film without needing a darkroom.\r\n\r\n       FIRST POLICEMAN\r\n       I see.\r\nClose shot on Arkadi's face. He looks very menacing.\r\n\r\nAndy starts taking his jacket off.\r\n\r\n       ANDY (whispering)\r\n       God, it's hot in here.\r\n\r\nIn the background, Arkadi is bending down on something we don't\r\nsee. He looks up at Karen.\r\n\r\n       KAREN (voice over)\r\n       If he had exposed the film to the light, he could have\r\n       destroyed all the evidence.\r\n\r\nBilly looks at Arkadi, still busy doing something that we don't\r\nsee.\r\n\r\n       KAREN (voice over)\r\n       Actually, I haven't done this since film school.\r\n\r\nArkadi stands up from whatever he was doing.\r\n\r\n       KAREN (voice over)\r\n       Right. It's safe in the can now.\r\n\r\nArkadi walks around the group.\r\n\r\n       KAREN (voice over)\r\n       Here. Take it to the lab immediately...\r\n\r\nClose shot on Arkadi walking away.\r\n\r\n       KAREN (voice over)\r\n       ...for developing.\r\n\r\nBilly, who understands something wrong is going on with Arkadi,\r\nstamps her feet.\r\nKaren gives the film to the first policeman.\r\n\r\n       KAREN\r\n       It's okay... It's okay.\r\n\r\nArkadi is walking slowly with something that looks like a knife in\r\nhis hand. We hear Billy clapping her hands. Andy turns around to\r\nlook at Billy.\r\n\r\nBilly points to Arkadi and tries to explain something in sign\r\nlanguage.\r\n\r\nKaren looks at Billy.\r\n\r\n       KAREN\r\n       Murder weapon ? Where ?\r\n\r\nArkadi grabs Andy and pushes him against the wall.\r\n\r\nKaren screams.\r\nArkadi stabs Andy in the stomach with his knife. Andy screams. He\r\nhas blood on his cheek. Arkadi keeps on stabbing Andy.\r\n\r\nThe first policeman takes his gun out of his belt.\r\n\r\nBoth policemen grab Arkadi from behind. They pull him away from\r\nAndy. They have both drown their guns.\r\n\r\nKaren rushes toward Andy, whose shirt is covered with blood.\r\n\r\nKaradi, still restrained by the two policemen, is yelling in\r\nRussian.\r\n\r\n       LYOSHA (voice over)\r\n       Stop. Stop. Stop!\r\n\r\nArkadi drops his knife, and it remains attached to his wrist by a\r\nplastic tube. Actually, it was a fake prop knife.\r\n\r\nAndy stutters, trying to explain something to Karen.\r\n\r\n       ANDY\r\n       I'm...\r\n\r\n       KAREN\r\n       What ?\r\n\r\n       ANDY\r\n       I'm fine. I'm fine. I'm fine.\r\n\r\n       KAREN\r\n       You...\r\n\r\n       ANDY\r\n       Oh, my God!\r\n\r\nKaradi shows the knife to the policemen. He makes the retractable\r\nblade work, to prove it is harmless.\r\nBilly walks to her trunk and notices that the padlock on the lid\r\nhas been broken. She opens the trunk. She takes the fake blood can\r\nout of the trunk : it is almost empty.\r\n\r\nThe policemen taste the fake blood.\r\n\r\n       FIRST POLICEMAN\r\n       Tastes sweet.\r\n\r\n       ANDY\r\n       It's for the actors. They put the stuff in their mouths.\r\n\r\nBilly stamps her foot. They all turn toward her. She explains\r\nsomething in sign language.\r\n\r\n       FIRST POLICEMAN\r\n       What she say ?\r\n\r\n       KAREN\r\n       That it's her knife. They broke into her box and used all\r\n       the blood.\r\n       FIRST POLICEMAN\r\n       So now she say it was a trick.\r\n\r\nBilly keeps on talking in sign language. Karen translates.\r\n\r\n       KAREN\r\n       It happened so fast she couldn't see the knife clearly.\r\n\r\n       FIRST POLICEMAN\r\n       But everything else she saw tonight was clear ? Huh ?\r\n\r\nBilly keeps on talking in sign language. Karen translates.\r\n\r\n       KAREN\r\n       The body in the elevator shaft. She saw that.\r\n\r\nBilly points to the elevator door.\r\n\r\nCINEMA STUDIO - BASEMENT - INTERIOR NIGHT\r\n\r\nThey are all walking in the basements toward the elevator. Several\r\nof them are carrying torches. Billy is still wrapped in the\r\nblanket.\r\n\r\nThey reach the elevator and Arkadi opens the door. The first\r\npoliceman points his torch in the bottom of the elevator shaft.\r\nThe dog barks. The janitor tries to calm it down. There are many\r\nplastic trash bags scattered in the bottom of the shaft. The first\r\npoliceman talks in Russian to the second one. Apparently, he asks\r\nhim to go down to the bottom of the shaft and look at the bags.\r\nThe second policeman doesn't look very happy to do it.\r\n\r\nBut he does go down in the shaft, and starts looking into the\r\nbags. He even pours the content of the first one out of the bag.\r\nBut there are only trashes in the bag.\r\n\r\nArkadi and Lyosha look at each other.\r\nThe second policeman finds a bloody sheet in a bag.\r\n\r\nLyosha talks to him in Russian. And the first policeman apparently\r\ntells him to do what Lyosha just asked\r\n\r\nReluctantly, he second policeman tastes the blood on the sheet. He\r\nsmiles and says a word in Russian.\r\n\r\nThe first policeman repeats that word to Lyosha\r\n\r\n       KAREN\r\n       What ?\r\n\r\n       ANDY\r\n       What ? What ?\r\n\r\n       FIRST POLICEMAN\r\n       Sweet. It is fake blood.\r\n\r\n       ANDY\r\n       It's fake blood.\r\n       KAREN\r\n       They could have soaked the sheets in fake blood afterwards.\r\n\r\n       FIRST POLICEMAN\r\n       But... where is the body ? Huh ?\r\n\r\nThe second policeman keeps looking through the trash bags.\r\n\r\nThe first policeman shows the paper, he is still holding, to\r\nBilly.\r\n\r\n       FIRST POLICEMAN\r\n       Here you say, \"A head cut off.\"\r\n\r\nThe second policeman has just emptied another bag. He makes a sign\r\nmeaning «Nothing significant» and talks in Russian.\r\n\r\nArkadi answers something that makes Lyosha and the two policemen\r\nlaugh.\r\n\r\nBilly says something in sign language.\r\n\r\n       KAREN\r\n       Oh ! Wait. Wait. Ah ! She says... Well, there were more\r\n       bags in there before.\r\n\r\nThe first policeman seems a bit fed up with Billy.\r\n\r\n       ARKADI\r\n       No, she's right. I will show you.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nThey are all coming out of the basement on a ramp that reaches the\r\nyard and the parking lot around the building. Arkadi is leading\r\nthem.\r\n       ARKADI\r\n       From lift shaft we take the rubbish here. Fast. Easy.\r\n\r\nThe janitor says something in Russian. They have reached the large\r\nplastic trash containers where all the trashes from the studio are\r\ndropped off, waiting for the garbage collectors to take them away.\r\nThe second policeman raises the lid of a container, while the\r\nfirst policeman looks inside. Arkadi takes a bag out of another\r\ncontainer and drops it on the ground. The second policeman looks\r\ninside the bag with his flashlight. There seems to be a head\r\ninside the bag. The policeman pours the content of the bag on the\r\nground. Actually the head was just a mask !\r\n\r\n       ANDY\r\n       Hey, we need that.\r\n\r\nHe picks up the mask from the rubbish. He wipes it with his hand.\r\nThe first policeman gives his card to both Billy and Karen.\r\n\r\n       FIRST POLICEMAN\r\n       Sorry, I can do nothing for you now. But I will call you\r\n       after I see the film. Okay ? Sorry.\r\nHe walks away. The second policeman shakes hands with Arkadi and\r\nLyosha and goes away with his chief.\r\n\r\nBilly rests her head on Karen's shoulder.\r\n\r\nLyosha looks at her, shrugs and smiles.\r\n\r\nANDY'S CAR - INTERIOR NIGHT\r\n\r\nClose up shot on Billy's face, seated in the back of the car. She\r\nlooks very sad and disappointed.\r\n\r\nAndy is driving, with Karen seated next to him.\r\n\r\n       ANDY\r\n       Well, I've never been more embarrassed in my entire life.\r\n\r\n       KAREN\r\n       I don't get it. I mean, Billy's a pro. She'd know the\r\n       difference between a real murder and a gag.\r\n\r\n       ANDY\r\n       Please, has she even seen a real murder ?\r\n\r\n       KAREN\r\n       That's my point. If what she saw tonight was real, then she\r\n       has seen the difference, right ?\r\n\r\n       ANDY\r\n       Oh, come on, honey. We all bought the guy cutting me up\r\n       tonight. Even I believed it.\r\n\r\n       KAREN\r\n       Because you're a wuss.\r\n\r\nShe laughs.\r\n       ANDY\r\n       I'm gonna let that slide.\r\n\r\nKaren looks at Billy.\r\n\r\n       ANDY\r\n       No offense, Billy, but I'd like to re-shoot the stuff today\r\n       using that guy's knife.\r\n\r\n       KAREN\r\n       It was her knife. God !\r\n\r\nA very short flash-back sequence of the murder of the actress.\r\n\r\n       ANDY\r\n       Whatever. It looked good.\r\n\r\nAnother very short flash-back. We understand those short flash-\r\nbacks come from Billy's mind reliving what she saw a couple of\r\nhours before.\r\n\r\nKaren, looking at Billy, seems to understand what's going on\r\ninside her sister's head, because she says to Andy :\r\n\r\n       KAREN\r\n       Shut up.\r\n\r\nMore short flash-backs of the murder, and a close-up shot on\r\nBilly's face. She seems very disturbed.\r\n\r\nCINEMA STUDIO - BASEMENT - INTERIOR NIGHT\r\n\r\nThe janitor is patrolling the basement with his dog. He is\r\ncarrying an electric torch.\r\n\r\nHe checks a heavy metal door, which is closed.\r\n\r\nWhile he is checking the door, the dog runs away.\r\n\r\nThe janitor looks around him.\r\n\r\n       JANITOR\r\n       Buka !\r\n\r\nHe is apparently calling his dog, but he gets no answer. He starts\r\nlooking around.\r\n\r\nHe reaches the door of the incinerator. We hear the noise of the\r\nincinerator, and we see its light on the janitor's face. The\r\njanitor seems surprises that the incinerator is working so late in\r\nthe night. We hear the dog whining.\r\n\r\n       JANITOR\r\n       Buka ?\r\n\r\nThe janitor enters the incinerator room. He walks slowly around\r\nuntil he reaches the incinerator. The incinerator door is slightly\r\nopen. He looks inside.\r\n\r\nClose shot of the inside of the incinerator. Among the flames, a\r\nhuman skull is burning.\r\n\r\nThe janitor walks backward with a terrified look on his face. He\r\ntrips on something and falls down.\r\n\r\nClose shot on the fallen flashlight rolling around. In the light,\r\nwe see a pair of boots, belonging to a still unknown man, standing\r\non the floor.\r\n\r\nStill lying on the floor, the janitor discovers his dog lying next\r\nto him, and starts patting it. The dog's fur is covered with\r\nblood.\r\n\r\n       JANITOR\r\n       Buka.\r\n\r\nArkadi walks toward the janitor.\r\n\r\n       JANITOR\r\n       Buka. Buka.\r\n\r\nArkadi raises something we don't clearly see (a knife ?) above his\r\nhead and hit the janitor, still lying on the floor.\r\n\r\nA RESTAURANT - INTERIOR NIGHT\r\n\r\nClose up shot of a knife hitting a beefsteak. The directors's idea\r\nwas, of course, to give us the impression that it was Arkadi's\r\nknife hitting the poor janitor !\r\n\r\nLarger shot of the steak being cut into the plate. We hear some\r\nsoft music.\r\n\r\nKaren and Andy are seated, side by side, at a table in a\r\nrestaurant, with Billy sitting on the other side of the table.\r\nAndy, with his shirt still covered with fake blood, is eating with\r\nan evident good appetite. Billy doesn't seem to be very hungry.\r\nAndy gives his plate to Billy.\r\n\r\n       ANDY\r\n       Please, Billy, take some of mine. You'll feel better.\r\n\r\nBilly explain silently that she is not hungry. Andy takes his\r\nplate back.\r\n\r\n       ANDY\r\n       Okay.\r\n\r\nAndy pours a lot of ketchup on his steak.\r\n\r\nBilly says something in sign language. Karen looks at her, while\r\nAndy drinks his wine. Billy keeps on «talking».\r\n\r\n       ANDY\r\n       Could you pass me the salt, please ?\r\n\r\nKaren gives the salt to Andy.\r\n\r\n       KAREN\r\n       You could at least make the effort.\r\nAndy stops eating, looks at Billy drinking water and then at\r\nKaren.\r\n\r\n       ANDY\r\n       Listen... I'm sorry. All I can think about now is the\r\n       movie, but as soon as we get back, I promise, I'll learn.\r\n\r\nHe starts eating his steak again.\r\n\r\n       KAREN\r\n       How often have I heard that ?\r\n\r\n       ANDY\r\n       Come on. I can understand some of what she's saying.\r\n\r\n       KAREN\r\n       What ?\r\n\r\nAndy puts his fork and knife down.\r\n\r\n       ANDY\r\n       Okay, how about this ?\r\n\r\nAndy makes a sign.\r\n\r\n       ANDY\r\n       Means «makeup», right ?\r\n\r\nBilly smiles and nods her head «No».\r\n\r\n       KAREN\r\n       Wrong. It means somebody's look, the expression on their\r\n       face.\r\n\r\n       ANDY\r\n       That was close.\r\n\r\n       KAREN\r\n       What Billy said she'll never forget the look on the girl's\r\n       face tonight from the moment she knew she was gonna die.\r\n       She said the pain and the terror was real. You can't act\r\n       that.\r\n\r\nBilly looks at Andy and Karen with a worried face. Andy seems\r\nsuddenly a bit worried too.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nThe chimney of the studio seen from the parking lot in a low-angle\r\nshot. A lot of black smoke is coming out of it, certainly from the\r\nincinerator.\r\n\r\nLyosha is smoking on the ramp leading to the basement, and he,\r\nlike the chimney, exhales a lot of smoke, but white one !\r\n\r\nThe door of the basement opens and Arkadi walks out. There seems\r\nto be a lot of smoke in the basement too. He coughs. Lyosha throws\r\nhim a pack of cigarettes, which he catches. He spits, takes a\r\ncigarette out of the pack and lights it.\r\nTwo cars are coming toward them. The fist one is a large black\r\nlimousine.\r\n\r\nLyosha picks up a small plastic bag.\r\n\r\nThe cars stop near the ramp. Arkadi and Lyosha walk toward them. A\r\nman gets out of the front passenger door of the second car. He is\r\nWartschuk, the Big Boss' first assistant. He closes the door and\r\nwalks toward Lyosha and Arkadi. Lyosha gives him the plastic bag.\r\nThe man says a few words in Russian and nods toward the limousine.\r\nHe walks away, but Lyosha doesn't move.\r\n\r\nA man is sitting in the back of the limousine, his face hidden in\r\nthe dark. He is called «The Reaper» and he is the famous «Big\r\nBoss» of the whole criminal organization, and consequently of\r\nArkadi and Lyosha.\r\n\r\n       THE REAPER\r\n       Come closer, Mr. Hausmann. I won't bite.\r\n\r\nLyosha starts walking slowly toward the car.\r\n       THE REAPER (voice over)\r\n       Did it go smoothly ?\r\n\r\n       LYOSHA\r\n       About the money...\r\n\r\n       THE REAPER\r\n       Did it go smoothly ?\r\n\r\n       LYOSHA\r\n       Yes, of course. No problem.\r\n\r\nThe Reaper bends slightly, so his face appears in the light.\r\n\r\n       THE REAPER\r\n       Did it go smoothly, Mr. Hausmann ?\r\n\r\n       LYOSHA\r\n       We did our job. The condition was...\r\n\r\n       THE REAPER\r\n       The condition was that everything would go smoothly.\r\n\r\n       LYOSHA\r\n       Yes. Yes, and we have your diskette.\r\n\r\n       THE REAPER\r\n       And who informed the police ?\r\n\r\n       LYOSHA\r\n       American girl say something, but nobody believe her.\r\n\r\n       THE REAPER\r\n       As long as there are witnesses, there's no money.\r\n\r\n       LYOSHA\r\n       You mean ?...\r\n       THE REAPER\r\n       I think we understand each other, Mr. Hausmann.\r\n\r\nThe Reaper winds his car window up. Then he sits back in his seat.\r\n\r\nLyosha and Arkadi look at the two cars driving away.\r\n\r\nLyosha gives a folded paper to Arkadi, who unfolds it.\r\n\r\nClose up shot on the paper. It shows Billy's address and telephone\r\nnumber.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nLow-angle shot on the buildings around the street. Then the camera\r\ntilts down to street level. Andy's car drives toward us and stops.\r\nBilly opens the back door and walks out of the car. Karen opens\r\nthe driver's door and walks out. Both sisters close their doors.\r\nBilly starts walking toward her building and Karen follows her.\r\n\r\n       KAREN\r\n       No, honestly, you can come back to our place, and we'll set\r\n       up the couch if you want.\r\n\r\nAndy has remained in the car.\r\n\r\nBilly answers her sister in sign language.\r\n\r\n       KAREN\r\n       You're not on one of your «I'll show her how independent I\r\n       am» kicks, are you ?\r\n\r\nAndy has got out of the car and is watching the two sister,\r\nleaning on the roof of the car.\r\n\r\n       ANDY\r\n       Honey, you coming or what ?\r\n\r\nBilly waves to Andy and enters her building. Karen looks at her\r\nsister and then turns toward Andy.\r\n\r\n       KAREN\r\n       Andy, don't you care about her ?\r\n\r\nAndy looks offended by Karen's words.\r\n\r\n       ANDY\r\n       I don't care ? I don't care ? Fine, fine. I'm calling the\r\n       American Embassy tonight, okay ?\r\n\r\nBilly has stopped near her building door and is looking at Karen\r\nand Andy's verbal fight.\r\n\r\n       KAREN\r\n       It's the weekend. They're closed.\r\n\r\n       ANDY\r\n       Not for us. My dad gave me the duty officer's direct number\r\n       before we left, just in case. So say goodbye.\r\nHe waves to Billy, who waves back to him. She blows a kiss to her\r\nsister, who blows one back, and enters her building.\r\n\r\nPOLICE HEADQUARTERS - CORRIDOR - INTERIOR NIGHT\r\n\r\nA long corridor. In the foreground, the two uniformed policemen,\r\nwho took care of Billy's case, are sitting on a wooden bench. The\r\nsecond policeman is asleep. The first policeman stands up when he\r\nsees a group of three people, a woman in white coat (like a nurse)\r\nand two men in suit and tie, coming toward them. The first\r\npoliceman wakes up the second policeman, who stands up.\r\n\r\nOne of the men is Mr. Larsen, a high-rank police officer, the\r\nother one is Mr Lovett, the US ambassador's secretary.\r\n\r\nThe woman in white shows the two policemen to Larsen, then walks\r\naway. Larsen takes his hat off.\r\n\r\n       LARSEN\r\n       Mr. Lovett, these are the two officers who answered the\r\n       complaint.\r\nHe shakes hands with the two policemen.\r\n\r\n       LOVETT\r\n       Good evening, gentlemen.\r\n\r\nLovett shakes hands with the two policemen.\r\n\r\n       FIRST POLICEMAN\r\n       Good evening.\r\n\r\n       LARSEN\r\n       Please speak English to the ambassador's secretary. My\r\n       chief asked me to meet Mr. Lovett here. If this witness is\r\n       correct about what she saw tonight, she may help my own\r\n       investigation.\r\n\r\n       LOVETT\r\n       Your English is quite good, Mr. Larsen.\r\n\r\n       LARSEN\r\n       Thank you. My mother was a translator.\r\n\r\n       LOVETT\r\n       In the university ?\r\n\r\n       LARSEN\r\n       No. KGB.\r\n\r\nAfter Larsen's answer, there is a slight embarrassed silence\r\nbetween the two men. Fortunately for them, a door opens and a man\r\nin white coat walks out of a room, carrying a film box under his\r\narm. He talks to Larsen in Russian, and shows him the room where\r\nthey have to go. Larsen shows the room to Lovett.\r\n\r\n       LARSEN\r\n       Please.\r\nThey all follow the technician.\r\n\r\nPOLICE HEADQUARTERS - PROJECTION ROOM - INTERIOR NIGHT\r\n\r\nThe door of the projection room opens and Lovett enters, followed\r\nby Larsen.\r\n\r\n       LARSEN\r\n       We've been tracking gangsters in Moscow running an\r\n       international pornography and prostitution racket.\r\n\r\nThe two policemen enters behind them. Larsen shows a seat to\r\nLovett. The projection room looks like a small cinema theatre,\r\nwith rows of red seats.\r\n\r\n       LARSEN\r\n       Sit down, please. We have information they have made snuff\r\n       films here and sold them all over the world.\r\n\r\nLovett sits down. Larsen takes his coat off and sits down next to\r\nLovett. The two policemen sit on the row behind the two men.\r\n       LOVETT\r\n       Snuff film... Is that what I think it is ?\r\n\r\n       LARSEN\r\n       Victims believe they are making a sex film, but they are\r\n       murdered in front of the camera.\r\n\r\nLarsen turn toward the two policemen.\r\n\r\n       LARSEN\r\n       What is the name of the witness ? What is it ?\r\n\r\nHe snaps his fingers.\r\n\r\n       FIRST POLICEMAN\r\n       Billy Hughes, sir.\r\n\r\n       LARSEN\r\n       Billy Hughes. Yes. She claims to have seen one being made.\r\n\r\nPOLICE HEADQUARTERS - PROJECTION CABIN - INTERIOR NIGHT\r\n\r\nThe technician is setting the film reel on the projector. We can\r\nhear the voices from the room coming through the loudspeaker of\r\nthe cabin.\r\n\r\n       LARSEN (voice over from the loudspeaker)\r\n       The victims are illegal immigrants exploited as prostitutes\r\n       by a gang headed by one man.\r\n\r\nThe technician is feeding the film into the projector.\r\n\r\nPOLICE HEADQUARTERS - PROJECTION ROOM - INTERIOR NIGHT\r\n\r\n       LARSEN\r\n       He is brutal, ruthless. They call him The Reaper.\r\n\r\nLarsen is making nervous movements with his hands.\r\n       LARSEN\r\n       I'm surprised his men gave up the film so easily. If it is\r\n       what I think it is, our witness, Billy Hughes, is in great\r\n       danger.\r\n\r\nThe sequence ends with a close shot on Larsen's worried face.\r\n\r\nBILLY'S APARTMENT - BATHROOM - INTERIOR NIGHT\r\n\r\nClose up shot on the gas flames of the water heater.\r\n\r\nBilly is getting ready to take a bath. She is just wearing a bath\r\ntowel wrapped around her body. With her hand, she tests the\r\ntemperature of the bath water. She pours some bubble-bath from a\r\nbig bottle into the water. We hear the telephone ringing. Billy\r\nturns her head toward the living-room\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nThe apartment is a bit ancient-looking. It doesn't «look like»\r\nBilly. One can tell it is only a rented apartment for a short\r\nperiod. Various clothes are scattered around the room.\r\n\r\nBilly walks from the bathroom along the corridor to the living-\r\nroom. The telephone keeps on ringing.\r\n\r\nThe telephone and the special answering machine are set on a small\r\ntable. Billy picks up the telephone handset and puts it on the\r\nmachine. Then she sits down on a chair and puts a pair of earphone\r\non her ears. Finally, she presses a button on the machine.\r\n\r\nClose up shot on the screen of the machine. It looks a bit like a\r\ncomputer screen. The machine offers the choice between different\r\nsentences :\r\n     «Hello»\r\n     «Hello this is Billy Hughes speaking»\r\n     «I am using a digital voice computer»\r\n     «Please have patience and I will answer»\r\n     «My address is apartment 923 - 126 Kievsky Prospekt»\r\n     «My telephone number is 9205910»\r\n     etc.\r\nBilly chooses the second choice, using a ball-mat. Then she brings\r\nthe arrow on an icon to start the machine.\r\n\r\n       DIGITAL VOICE\r\n       Hello, this is Billy Hughes speaking.\r\n\r\nMomentarily, the scene is seen through a binocular, which makes us\r\nrealize that Billy is been spied by someone.\r\n\r\nBilly, apparently getting no answer but a deep breathing noise,\r\nchooses the first choice.\r\n\r\n       DIGITAL VOICE\r\n       Hello.\r\n\r\nA shot on the large bay window makes us guess where the spy is\r\nhiding : somewhere across the street.\r\n       DIGITAL VOICE\r\n       Hello, this is Billy Hughes speaking.\r\n\r\nBilly keeps on trying to get an answer.\r\n\r\n       DIGITAL VOICE\r\n       Hello.\r\n\r\nBut she gets only a disconnection tone. She takes the earphone out\r\nof her ears, and puts them on the table. She looks at the window.\r\n\r\nShot on the window, with a zoom on another window across the\r\nstreet. Behind that window, we see the figure of a man looking at\r\nBilly with binoculars.\r\n\r\nBilly seen through the «neighbor's» binoculars. She walks to the\r\nwindow and pull the drapes to hide the window.\r\n\r\nThe «spy» sees the drapes being pulled through his binoculars.\r\n\r\nPOLICE HEADQUARTERS - PROJECTION ROOM - INTERIOR NIGHT\r\nThe same men are still in the projection room. The first policeman\r\nhas taken his cap off. And Larsen is now seated in a seat behind\r\nLovett.\r\n\r\n       FIRST POLICEMAN\r\n       Have you seen a... how do you say... snuff film before ?\r\n\r\n       LARSEN\r\n       I saw a woman tied to a tree   kept alive while her arms and\r\n       legs were cut off. It's hard   to talk about it, or even\r\n       think about it. And it makes   you sick to watch it. You\r\n       never forget the look in the   victim's eyes. The sheer panic\r\n       and horror when they realize   they're about to die.\r\n\r\nLovett looks very disturbed by what Larsen just told him. The\r\ntechnician knocks on the window between his cabin and the room.\r\nLarsen and Lovett turn around, and Larsen makes a sign to tell the\r\ntechnician to start the film. Then he takes a cigarette from the\r\npack he left on his former seat. The room becomes dark and the\r\nprojection starts. The four men watch the film which has no sound.\r\n\r\nOn the screen of the projection room, we see the sequence when the\r\nyoung actress, pretending she is dying very slowly, breaks the\r\nwhole set.\r\n\r\nLovett and Larsen turn their head toward the cabin.\r\n\r\nPOLICE HEADQUARTERS - PROJECTION CABIN - INTERIOR NIGHT\r\n\r\nThe technician is also watching the film through the window\r\nbetween the two rooms. When he sees Larsen looking at him, he\r\nshrugs to tell him that he is not responsible for what is shown on\r\nthe screen.\r\n\r\nPOLICE HEADQUARTERS - PROJECTION ROOM - INTERIOR NIGHT\r\n\r\nLarsen and Lovett turn back to watch the screen.\r\nOn the screen, the sequence when the young actress is pulling the\r\ntablecloth away from the table, and also everything that was on\r\nthe table.\r\n\r\nThe two policemen are smiling because they find what they see on\r\nthe screen quite funny.\r\n\r\nLovett and Larsen do not smile, because they are disappointed.\r\n\r\nNow, on the screen, the actress is pulling the drapes down from\r\nthe windows.\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\nKaren, wearing her night-gown, is seated on the edge of the bed.\r\nWe hear Andy talking into the telephone.\r\n\r\n       ANDY (voice over)\r\n       Yes, sir... No, sir.\r\n\r\nAndy is walking up and down in the next room, carrying the\r\ntelephone set in his hand and with the handset on his ear.\r\n       ANDY\r\n       Right... Right... Right, sir. Right, sir. Thank you, Mr.\r\n       Ambassador. So, I really appreciate the call. I'll give Dad\r\n       your best. Right.\r\n\r\nHe puts the phone down back on its hook.\r\n\r\nKaren has a worried look on her face.\r\n\r\n       KAREN\r\n       Well ?\r\n\r\n       ANDY\r\n       I told you. There's nothing to worry about. He says the\r\n       film's the biggest piece of shit he's ever seen.\r\n\r\nAndy is smiling, but Karen still has a worried look on her face.\r\n\r\nBILLY'S APARTMENT - BATHROOM - INTERIOR NIGHT\r\n\r\nHigh-angle shot of the room, seen from the ceiling. Billy is lying\r\nin her bathtub, surrounded by foam and bubbles. Her eyes are\r\nclosed. She slowly puts her head underwater, and leaves just her\r\nface above water.\r\n\r\nOne of the faucet is leaking and water is dropping from it.\r\n\r\nOne of the glass panes is broken and fixed with adhesive tape and\r\nnewspaper.\r\n\r\nHe eyes closed, Billy has her daydreams flashbacks again. She sees\r\nthe actress' blood spurting on the wall of the scenery. She sees\r\nher being stabbed. She sees herself running away from Lyosha in\r\nthe long dark corridor.\r\n\r\nSuddenly, she feels drops of blood on her face. And, opening her\r\neyes, she sees the bloody actress behind the broken glass pane.\r\nShe quickly sits up in her bath. She looks at the window, which is\r\nempty. She hears the phone ringing. She stands up in her bath and\r\ntakes her bath towel to dry herself.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly opens the bathroom door and walks out and along the\r\ncorridor, while drying her hair. She has put a bathrobe on.\r\n\r\nShe puts the telephone handset on the answering machine. She puts\r\nher earphones on and select an answer.\r\n\r\n       DIGITAL VOICE\r\n       Hello, this is Billy Hughes speaking.\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\nKaren is sitting on the bed, with the telephone handset to her\r\near. Andy is lying next to her, asleep.\r\n\r\n       KAREN\r\n       Hi, Billy. It's Karen. I hope you weren't sleeping. I just\r\n       wanted to check and see if you're okay.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly smiles, hearing her sister's voice. She start typing on the\r\nkeyboard of the answering machine. The she sends the text to the\r\ndigital voice translating system.\r\n\r\n       DIGITAL VOICE\r\n       I am fine. No need to worry. Did you call earlier ?\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\nKaren is still seated on her bed.\r\n\r\n       KAREN\r\n       No, I got straight through. You sure you're okay ?\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly starts typing again.\r\n\r\nClose up shot on the machine screen. We can read what she is\r\ntyping.\r\n\r\n       DIGITAL VOICE\r\n       Sure. Had bath. All fine. Now I go to bed. You too.\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\n       KAREN\r\n       I just wanted to tell you : they saw the film, and it's not\r\n       the real thing.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly is listening to her sister.\r\n       KAREN (voice over from the telephone)\r\n       That's good. Right ?\r\n\r\nThe doorbell rings. Billy turns her head toward the door.\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\n       KAREN\r\n       Did I hear something there ?\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly starts typing her answer.\r\n\r\n       DIGITAL VOICE\r\n       Doorbell. Wait. I'll see who.\r\n\r\nShe puts her earphones down, and stands up. We can still hear\r\nfaintly Karen's voice coming from the earphones.\r\n\r\n       KAREN (voice over from the telephone)\r\n       What ? Ah ! It's almost one o'clock. I wouldn't get that,\r\n       Billy...\r\n       (louder)\r\n       Billy ?\r\n\r\nBilly is looking through the peephole on the door.\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\nKaren is looking worried.\r\n\r\n       KAREN\r\n       Billy ? You be careful, now. Check who it is first.\r\n\r\nKaren's louder voice has awaken Andy, who sits up.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly is still looking through the peephole.\r\n\r\nBILLY'S APARTMENT - LANDING OUTSIDE THE FRONT DOOR - INTERIOR\r\nNIGHT\r\n\r\nThe landing, just outside Billy's apartment front door, is dark\r\nand empty.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly, still looking in the peephole, moves her head from right to\r\nleft, trying to see further on the landing. She slowly moves away\r\nfrom the door to a small table by the door.\r\n\r\nClose up shot on the table, and a business card lying on it. It is\r\nthe first policeman's card. It says : «Police Inspector Vladimir\r\nPekar - Precinct 22» and underneath an address and a telephone\r\nnumber.\r\n\r\nBilly is still standing near the door. She puts the safety chain\r\non. And then she slowly opens the door. Arkadi appears behind the\r\ndoor. Billy tries to shut the door, but he puts his foot between\r\nthe door and the wall.\r\n\r\n       ARKADI\r\n       Please. I want to talk.\r\n\r\nDesperately, Billy tries to push the door shut.\r\n\r\nClose up on the earphones on the machine keyboard.\r\n\r\n       KAREN (voice over from the telephone)\r\n       Billy ?\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\nKaren seems very excited.\r\n\r\n       KAREN\r\n       Billy, are you still there ?\r\n\r\n       ANDY\r\n       Would you leave her alone ?\r\n\r\nHe lies back in the bed.\r\n\r\n       KAREN\r\n       I heard a noise, Andy. Something's happened. I swear.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly is trying to push the door shut. Arkadi has a big wire-\r\ncutter in his hand. He brings the cutter near the chain. Billy\r\ntakes an umbrella from the stand near the door, and, with it,\r\ntries to prevent Arkadi from cutting the chain. Arkadi cuts the\r\ntip of the umbrella off. With her slippered foot, Billy kicks\r\nArkadi's foot still jamming the door, but it doesn't move it off.\r\nThen she takes the heavy metal umbrella stand and hits Arkadi's\r\nfoot with it. Arkadi removes his foot from the door. Billy can -\r\nat last - slam the door shut. She leans on it, panting.\r\n\r\nKAREN AND ANDY'S APARTMENT - BEDROOM - INTERIOR NIGHT\r\n\r\nKaren is now very frightened. She yells in the phone.\r\n\r\n       KAREN\r\n       Billy !\r\n\r\nShe puts the phone down and stands up from the bed.\r\n\r\n       KAREN\r\n       Okay, that's it. I'm going there.\r\n\r\nAndy sits up on the bed.\r\n\r\n       ANDY\r\n       What ?\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\nBilly is still leaning on the door, panting. We hear the noise of\r\nan electric machine. Billy's eyes widen with horror. She rushes to\r\nthe telephone, and starts typing frenetically.\r\n\r\n       DIGITAL VOICE\r\n       Karen, help. Call police. Emergency.\r\n\r\nClose up shot on the door lock. We can guess that Arkadi is trying\r\nto open the door with a power tool.\r\n\r\nBilly puts her earphone on. She hears the disconnection tone. She\r\npresses the disconnection switch on her own telephone.\r\n\r\nClose up shot on the door lock. One of the screws holding the lock\r\npops off and falls on the floor.\r\n\r\nBilly is listening to a Russian-speaking female voice in her\r\nearphones. She types on her keyboard.\r\n\r\n       THE VOICE ON THE PHONE\r\n       Hello ?... Hello ?\r\nShe sends her message.\r\n\r\n       DIGITAL VOICE\r\n       Police, emergency.\r\n\r\nA few word in Russian and then, more distinctly :\r\n\r\n       THE VOICE ON THE PHONE\r\n       Police ?\r\n\r\nBilly types «Yes».\r\n\r\n       DIGITAL VOICE\r\n       Yes.\r\n\r\nGetting a Russian answer, she types «Da»\r\n\r\n       DIGITAL VOICE\r\n       Da.\r\n\r\nBilly chooses a pre-recorded message, and sends it.\r\n\r\n       DIGITAL VOICE\r\n       Hello, my name is Billy Hughes. My address is apartment\r\n       923...\r\n\r\nClose up on the lock : another screw just pops off. The telephone\r\noperator keeps on speaking in Russian, apparently not listening to\r\nBilly's message. We hear the power tool working again on the lock.\r\n\r\n       DIGITAL VOICE\r\n       ... 126 Kievsky prospekt...\r\n\r\nBilly takes her earphones off and rushes out of the room.\r\n\r\n       DIGITAL VOICE\r\n       Telephone 9-2-0-9-5-9-1-0...\r\nBILLY'S APARTMENT - KITCHEN - INTERIOR NIGHT\r\n\r\nBilly enters her dark kitchen. She takes a big knife from the\r\ntable, and rushes out of the kitchen.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly rushes in the room, with the knife in her hand. The\r\nanswering machine keeps on speaking.\r\n\r\n       DIGITAL VOICE\r\n       Billy Hughes speaking.\r\n\r\nClose up shot on the lower screws of the lock. They're vibrating\r\nunder Arkadi's tool.\r\n\r\n       DIGITAL VOICE\r\n       This is a digital voice computer.\r\n\r\nClose up on the answering machine screen. Billy select another\r\nmessage. She puts her earphones on.\r\n       DIGITAL VOICE\r\n       Please have patience and I will answer.\r\n\r\nApparently, the telephone company found an English-speaking\r\noperator.\r\n\r\n       TELEPHONE OPERATOR\r\n       Hello ? You English ?\r\n\r\nBilly works frenetically on her answering machine.\r\n\r\n       DIGITAL VOICE\r\n       My name is Billy Hughes.\r\n\r\n       TELEPHONE OPERATOR\r\n       Yes ? What do you want, please ?\r\n\r\nClose up on the screen. Billy is typing a message.\r\n\r\n       TELEPHONE OPERATOR\r\n       Hello ?\r\n\r\n       DIGITAL VOICE\r\n       Help. Intruder.\r\n\r\nBut apparently, the operator doesn't speak such a good English\r\n\r\n       TELEPHONE OPERATOR\r\n       I no understand. Sorry.\r\n\r\nThe operator speaks in Russian, certainly to another operator.\r\nBilly types another message.\r\n\r\n       DIGITAL VOICE\r\n       Bad man want to kill me.\r\n\r\n       TELEPHONE OPERATOR\r\n       Bad man ? I get man who speak English, yes ?\r\nClose up on the lock : another screw pops off.\r\n\r\nBilly takes her earphones off and rushes to the light switch. She\r\nputs all the lights of the room at their maximum lighting\r\ncapacity.\r\n\r\nBILLY'S APARTMENT - LIVING ROOM WINDOW - EXTERIOR NIGHT\r\n\r\nWe see Billy's living room window from the outside. Billy is\r\npulling the drapes wide open. Then she starts waving her arms to\r\nattract the attention of the peeping-Tom and his binoculars.\r\n\r\nReverse angle shot on the window where the peeping-Tom was\r\nstanding when he was watching Billy. There is light coming through\r\nthe window and someone is moving in the room behind the curtains,\r\nbut the peeping-Tom doesn't seem interested by Billy at the\r\nmoment.\r\n\r\nBack to Billy's window. She unties her bathrobe and shows her\r\nbreasts.\r\nThe peeping-Tom is still moving in the room behind the curtains,\r\nbut he doesn't come to the window.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly is standing in front of the window, with her bathrobe wide\r\nopen, revealing her naked body to whomever wants to watch it !\r\n\r\nClose up on the lock. Another screw is vibrating and pops off. We\r\nsee the drill bit coming through the hole it just made.\r\n\r\nBilly hears a male voice coming from her earphones.\r\n\r\n       MALE TELEPHONE OPERATOR\r\n       Hello ? Hello ?\r\n\r\nBilly picks up the earphones and put them on her ears.\r\n\r\n       TELEPHONE OPERATOR\r\n       I speak English.\r\n\r\nThe door burst open and Arkadi walks into the room. Billy picks up\r\nher big kitchen knife and points it to Arkadi.\r\n\r\n       MALE TELEPHONE OPERATOR\r\n       Are you okay ?\r\n\r\nArkadi presses the light switch to dim the lights in the room.\r\n\r\nClose up shot on the earphones.\r\n\r\n       MALE TELEPHONE OPERATOR\r\n       If you just give your address, we send somebody\r\n       immediately.\r\n\r\nArkadi is walking slowly inside the room. Billy is walking\r\nbackward away from him, but still pointing her knife at him.\r\n       MALE TELEPHONE OPERATOR\r\n       Hello ?\r\n\r\nArkadi tears the telephone cord off the telephone handset. He\r\ntries to get near Billy, but she is still pointing her knife at\r\nhim. He pulls the drapes back on the window.\r\n\r\nWalking backward, Billy has reached the wall, in which she bumps.\r\nShe takes a white statuette on a chest of drawers and throws it at\r\nArkadi.\r\n\r\nArkadi bends down and avoid the statuette, which crashes on the\r\nwall behind him. He takes his own knife out of his pocket, a\r\nswitchblade knife.\r\n\r\nBilly pushes the chest of drawers toward Arkadi. It crashes on the\r\nfloor, but Arkadi avoids it. Billy is still pointing her knife at\r\nArkadi, when we hears some bumping noise.\r\n\r\nAPARTMENT BELOW BILLY'S - BEDROOM - INTERIOR NIGHT\r\n\r\nIn the bedroom just underneath Billy's apartment, a Russian couple\r\nis trying to get some sleep, which, with all the noise in Billy's\r\napartment, is not very easy.\r\n\r\nThe woman is still in the bed, but the man is standing up on the\r\nfloor, holding a broom with both hands, and hitting the ceiling\r\nwith the handle of the broom. Both members of the couple swear in\r\nRussian.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly, who has understood the situation very well, is hitting the\r\nfloor with a stick.\r\n\r\nAPARTMENT BELOW BILLY'S - BEDROOM - INTERIOR NIGHT\r\n\r\nThe man hears the noise made by Billy, and answer by hitting the\r\nceiling with his broom.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nBilly is waving her knife around her, to prevent Arakadi from\r\ncoming closer to her. She throws the knife at him. Arkadi bends\r\nhis head and the knife hits the piano.\r\n\r\nClose up of the piano keyboard, with the knife stuck between two\r\nkeys.\r\n\r\nBilly rushes out of the room, closing the door behind her.\r\n\r\nBILLY'S APARTMENT - KITCHEN - INTERIOR NIGHT\r\n\r\nBilly rushes into the kitchen. She takes various knives hanging\r\nfrom the wall and throws them at Arkadi, as he tries to enter the\r\nkitchen. One knife gets stuck into a painting on the other side of\r\nthe corridor. Arkadi almost catches Billy, but she jumps through a\r\nsort of window set between the kitchen and the living-room.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\nBilly stands up after her jump through the window, and she slams\r\nthe door of the corridor in Arkadi's face. This door being a sort\r\nof French window, with plenty of small glass panes on it, Arkadi\r\ncrashes through the door, scattering pieces of glass all over the\r\nfloor. He falls on the floor. Billy slips on a piece of glass and\r\nalso falls on the floor. Arkadi tries to catch her by the ankles.\r\nShe kicks him in the face. He grabs her ankles back. Billy grabs a\r\nbig white vase from the floor, she sits up and crashes the vase on\r\nArkadi's head. Arkadi lets her go, and she rushes to the front\r\ndoor, but, as she reaches the door, Lyosha comes in. She rushes to\r\nthe corridor. Arkadi, still a bit groggy, looks at Lyosha with\r\nblinking eyes.\r\n\r\nBILLY'S APARTMENT - BATHROOM - INTERIOR NIGHT\r\n\r\nSame high-angle shot, as before, of the bathroom seen from the\r\nceiling.\r\n\r\nBilly enters the bathroom, and locks the door behind her.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\nArkadi stands up slowly and walks into the corridor.\r\n\r\nBILLY'S APARTMENT - BATHROOM - INTERIOR NIGHT\r\n\r\nArkadi tries to crash the door open. Billy looks around for a\r\npossible escape.\r\n\r\nShe opens the door of the small cabinet above the sink, and takes\r\neverything out of it\r\n\r\nBILLY'S APARTMENT - CORRIDOR - INTERIOR NIGHT\r\n\r\nClose up shot on the bathroom door. Arkadi has put his knife\r\ninside the lock of the bathroom door to open it.\r\n\r\nBILLY'S APARTMENT - BATHROOM - INTERIOR NIGHT\r\n\r\nClose up shot on the door. We see the handle of the lock spinning\r\nslowly.\r\n\r\nBilly, still looking in the cabinet, sees the handle spinning. She\r\nrushes to the door and spins the handle back into the lock\r\nposition. A knife blade comes through the door a few inches from\r\nBilly's face. Billy goes back to the cabinet and starts searching\r\nit again. Eventually she seems to have found what she was looking\r\nfor : a small disposable razor.\r\n\r\nThe door is shaking under Arkadi's blows. Eventually his hand\r\nbreaks through the door and tries to find the handle of the door.\r\nBilly picks up the toilet brush (the handle of which is a Donald\r\nDuck), and hits Arkadi's hand with it. But the door starts falling\r\ndown under Arkadi's blows. Billy looks through the hole Arkadi has\r\nmade in the door with his hand.\r\n\r\nThrough the hole, we can see Arkadi going to the end of the\r\ncorridor, and running back full speed to smash the door.\r\nAt the last moment, when Arkadi is going to hit the door, Billy\r\nopens it. Arkadi can't stop himself, he crosses the bathroom and\r\nfalls into the full bathtub. Billy hits him on the head with the\r\nDonald Duck toilet brush. Then Billy takes the hair-drier, switch\r\nit on, and throws it in the bathtub. Arkadi is instantly covered\r\nwith blue sparks. Then he falls back into the bathtub where he\r\nremains motionless. Billy grabs a bunch of clothes and rushes out\r\nof the bathroom.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nLyosha is looking through Billy's documents scattered on the desk.\r\nWhen Billy comes rushing through the room, he grabs her. She tries\r\nto fight him but he locks both of her arms behind her back. He\r\nbrings her to the desk, and slams her face on the desk. He puts a\r\nknife very close to her face.\r\n\r\n       LYOSHA\r\n       Where's the diskette ?\r\n\r\nHe puts a piece of paper and a pen in front of her face. He frees\r\nher right hand for her to be able to write.\r\n       LYOSHA\r\n       Where is the diskette ?\r\n\r\nBilly takes the pen and starts writing.\r\n\r\nClose up shot on the paper. Billy writes : «What diskette ?»\r\n\r\n       LYOSHA\r\n       I know you have !\r\n\r\nLyosha raises Billy's bathrobe above her waist, revealing Billy\r\nnaked bottom underneath.\r\n\r\nBilly looks very frightened, afraid of what Lyosha can do to a\r\ndefenseless naked girl. She takes the pen very firmly in her hand\r\nand brings it violently to Lyosha's leg.\r\n\r\nClose up shot of the pen hitting Lyosha's leg.\r\n\r\nLyosha screams. He raises his knife to bring it down on Billy.\r\nBilly is waiting for the worse to happen. She hears the noise of\r\nsomething - or someone - falling violently on the floor. And\r\nsuddenly, she realizes she is free. She raises from the table and\r\nsees Larsen holding Arkadi's big wire-cutter in his hands. He just\r\nhit Lyosha with it. Larsen throws the wire-cutter on the floor and\r\nbends on Billy.\r\n\r\n       LARSEN\r\n       My name is Alexander Larsen. I'm a policeman. Take your\r\n       clothes. We must get out of here.\r\n\r\nLarsen goes to the window and peeks through the drapes.\r\n\r\n       LARSEN\r\n       You must hurry.\r\n\r\nBilly rushes to her clothes she had dropped on the floor when\r\nLyosha grabbed her. She sits down on the floor and starts putting\r\nher socks on.\r\n\r\n       LARSEN\r\n       I explain everything in the car.\r\n\r\nHe is still peeking through the drapes.\r\n\r\n       LARSEN\r\n       In the car. No time now.\r\n\r\nHe gathers the rest of Billy's clothes, takes her hand to makes\r\nher stand up, and drags her outside the apartment.\r\n\r\nBILLY'S LANDING - INTERIOR NIGHT\r\n\r\nThey come out of the apartment and start running along the\r\ncorridor on Billy's landing. They reach the staircase. Billy drops\r\na piece of clothing and picks it up. Larsen opens the door of the\r\nelevator, and pushes Billy inside. He closes the door.\r\n\r\nBILLY'S BUILDING - ELEVATOR - INTERIOR NIGHT\r\nLarsen is ready to press the number «1» on the control panel, but\r\nthe button number «1» lights up by itself before Larsen presses\r\nit.\r\n\r\n       LARSEN\r\n       They are coming.\r\n\r\nBilly starts putting her panties on.\r\n\r\n       LARSEN\r\n       We are in great danger.\r\n\r\nHe looks down at Billy, who is still putting her panties on. He\r\ntakes the rest of Billy's clothes in his hands, and presses the\r\nbutton number «3».\r\n\r\nTHIRD FLOOR LANDING - INTERIOR NIGHT\r\n\r\nThe elevator stops and Larsen opens the door. Billy walks out of\r\nthe elevator, and follows Larsen down the staircase.\r\n\r\nSECOND FLOOR LANDING - INTERIOR NIGHT\r\n\r\nLarsen and Billy are coming from the third floor and start going\r\ndownstairs toward the first landing. The elevator is going up with\r\ntwo people inside. They look very much like Andy and Karen.\r\n\r\nSTREET IN FRONT OF BILLY'S BUILDING - EXTERIOR NIGHT\r\n\r\nLarsen and Billy are coming out of the building.\r\n\r\n       LARSEN\r\n       Quick.\r\n\r\nLarsen's car is parked just in front of the building. Larsen opens\r\nthe passenger's door for Billy, who climbs inside the car. Then he\r\nwalks around the car, open the driver's door and climbs inside. He\r\nstarts the engine.\r\n\r\nA big black limousine, with two men inside, starts and follows\r\nLarsen's car, which has just started. The driver is Wartschuk,\r\nwhom we have seen before with The Reaper, and who is The Reaper's\r\nfirst assistant.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nLarsen gives a quick look in the rear-view mirror.\r\n\r\nWe see the headlights of the other car through the back window of\r\nthe car.\r\n\r\nBilly resumes her dressing. When she puts her white sweater on,\r\nwithout a bra, her breasts are showing. Larsen gives a quick\r\nglance toward her, and then turns his head away. Billy looks back\r\nat him, smiles and kisses him on the cheek.\r\n\r\n       LARSEN\r\n       It's not over yet.\r\nBilly puts her jacket on. Larsen looks in the back-view mirror.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nKaren and Andy enter the apartment and stop when they see the mess\r\naround them. We realize that it was really them and not some\r\ngangsters going up in the elevator.\r\n\r\n       KAREN\r\n       My...\r\n\r\n       ANDY\r\n       Oh, my God, it's trashed !\r\n\r\nKaren rushes through the room. Andy remains on the doorstep.\r\n\r\n       KAREN\r\n       Billy, where are you ?\r\n\r\n       ANDY\r\n       I'll call the police !\r\n\r\nBILLY'S APARTMENT - CORRIDOR - INTERIOR NIGHT\r\n\r\nKaren is running through the corridor.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nAndy picks up the telephone handset without noticing that the cord\r\nhas been cut.\r\n\r\nBILLY'S APARTMENT - CORRIDOR - INTERIOR NIGHT\r\n\r\nKaren is checking all the rooms to find her sister\r\n\r\n       KAREN\r\n       Billy ! Oh, Billy. Oh, my God !\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nAndy is still trying to get a dialing tone\r\n\r\n       ANDY\r\n       How do you work this thing ? Oh, there it is.\r\n\r\nBehind Andy, the front door is closing slowly, revealing Lyosha\r\nstanding behind it. He has the big wire-cutter in his hand, and is\r\nready to hit Andy with it. Andy looks at the cut cord, but doesn't\r\nrealize the telephone can't work with a cut cord.\r\n\r\nBILLY'S APARTMENT - CORRIDOR - INTERIOR NIGHT\r\n\r\nKaren enters the bathroom\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nWe hear Karen screaming. Andy puts the telephone down on the table\r\nand rushes across the room\r\n\r\nBILLY'S APARTMENT - CORRIDOR - INTERIOR NIGHT\r\nKaren is coming out of the bathroom, screaming.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nAndy walks toward the corridor, but Karen meets him at the door.\r\n\r\n       KAREN\r\n       Someone's dead in the ba...\r\n\r\nShe doesn't finish her sentence, because she has just seen Lyosha\r\nbehind Andy. She grabs Andy and moves him out of the way of\r\nLyosha's wire-cutter. The wire-cutter smashes what is left of the\r\ndoor of the corridor.\r\n\r\nBILLY'S APARTMENT - CORRIDOR - INTERIOR NIGHT\r\n\r\nAndy and Karen run and enter a room, presumably Billy's bedroom,\r\nand slam the door behind them.\r\n\r\n       KAREN\r\n       God ! Oh, my God !\r\n\r\nLyosha looks at the door, and doesn't even bother to smash it. He\r\nslowly walks back to the living room. We hear Karen and Andy's\r\nvoices in the room.\r\n\r\n       KAREN (voice over)\r\n       Get the door ! Get a chair ! Get the chair !\r\n\r\n       ANDY (voice over)\r\n       What chair ?\r\n\r\n       KAREN (voice over)\r\n       The chair ! Out of the way ! Move ! Put it over there!\r\n\r\n       ANDY (voice over)\r\n       Move! Get the wardrobe over !\r\nLyosha enters the living-room through what remains of the door.\r\n\r\n       KAREN (voice over)\r\n       Andy, quick ! Push it !\r\n\r\nAPARTMENT BELOW BILLY'S - BEDROOM - INTERIOR NIGHT\r\n\r\nThe man, seated on his bed, stares at the ceiling, through which\r\nwe can hear Andy and Karen yelling. His wife has put the sheet\r\nover her head to try not to hear the noise. The man stands up and\r\nthrows one of his slippers to the ceiling. Then he sits back,\r\nwhile his wife stares at him.\r\n\r\n       ANDY (voice over)\r\n       I'm pushing ! Get out of the way !\r\n\r\n       KAREN (voice over)\r\n       What are you doing ?\r\n\r\n       ANDY (voice over)\r\n       I can't. Oh, my God !\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nLyosha sits down in an armchair and takes a pack of cigarettes out\r\nof his pocket. But he doesn't take a cigarette. He gives a quick\r\nlook at the front door, and closes his eyes, ready to fall asleep.\r\n\r\nThe front door bursts open, and two uniformed policemen enters the\r\nroom, guns in hand. Lyosha looks at them without moving from his\r\nchair, with a sort of look of indifference in his eyes. He shows\r\nthem the corridor, where we can still hear Andy and Karen yelling\r\nin the bedroom. From Lyosha's attitude, we can guess that those\r\npolicemen are not real ones, but fake ones.\r\n\r\n       KAREN (voice over)\r\n       I can't. I can't ! You hold the door !\r\n\r\n       ANDY (voice over)\r\n       Get out of the way !\r\n\r\nThe two fake policemen cross the room.\r\n\r\n       KAREN (voice over)\r\n       Come here! Andy! Come here!\r\n\r\n       ANDY (voice over)\r\n       Don't yell at me! I'm trying to get the goddamn wardrobe\r\n       near the fucking door!\r\n\r\n       KAREN (voice over)\r\n       Oh, my God!\r\n\r\nLyosha doesn't even look at them. He just smiles. Before going\r\nthrough the smashed door into the corridor, one of the policeman\r\nnods to his «colleague», who takes his gun from his holster, aims,\r\nand sends a bullet through Lyosha's head, whose blood splatters\r\nthe wall. The gun is equipped with a silencer, and doesn't make\r\nmuch noise. Then the policeman goes through the smashed door to\r\njoin his colleague.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nWhile driving, Larsen talks to Billy.\r\n\r\n       LARSEN\r\n       The girl you saw murdered tonight...\r\n\r\nBilly nods in approval.\r\n\r\n       LARSEN\r\n       ...her boyfriend stole a diskette full of information.\r\n       Money, names, connections, everything. He blackmailed The\r\n       Reaper. Very dangerous. And now he thinks that you have the\r\n       diskette.\r\n\r\nBilly mouth a word we can easily understand.\r\n\r\n       BILLY\r\n       Me ?\r\n       LARSEN\r\n       You have it ?... Huh ?\r\n\r\nBilly is trying to think about the lost diskette.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nAndy and Karen are kneeling on the floor, with their hands joined\r\nbehind their heads. One of the fake policeman is searching the\r\nroom, throwing everything off the shelves on the floor, while the\r\nother one is aiming his gun at Andy and Karen. He is leaning on\r\nthe piano, and he throws all the objects, which are on top of the\r\npiano, on the floor. He raises briefly the piano lid, and then\r\nstarts looking behind the picture hanging on the wall.\r\n\r\n       ANDY\r\n       We don't have any diskettes.\r\n\r\nThe policeman picks up a diskette he had thrown on the floor and\r\nlooks at it.\r\n\r\n       ANDY\r\n       Not that one. That's my script.\r\n\r\nKaren hits Andy with her elbow. The policeman puts the diskette\r\ninto a small white plastic bag he is carrying around. He puts\r\nanother diskette in the bag. The other policeman is speaking in\r\nRussian in a walkie-talkie.\r\n\r\nTHE CAR FOLLOWING LARSEN'S CAR - INTERIOR NIGHT\r\n\r\nWartschuk is answering the fake policeman on his own walkie-\r\ntalkie. Next to him, his passenger is screwing a silencer on his\r\ngun.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nThe street is empty at this time of the night, but for the two\r\ncars following each other.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\n       LARSEN\r\n       The girl had it when she went into the studio. Then she was\r\n       murdered, and it was gone. Where is it ? Think. You were\r\n       the only person there.\r\n\r\nClose up shot on Billy's face trying to think about the mysterious\r\ndiskette. She has a short flashback of Arkadi taking the knife to\r\nmurder the actress. Then another one of the naked actress lying on\r\nthe bed. Then another one of the blood splattering the wall. Then\r\nanother one of Arkadi stabbing the girl.\r\n\r\n       LARSEN\r\n       Think.\r\n\r\nAnother short flashback of Billy going away from the   set. Then\r\nanother one of Billy bumping into the hatstand. Then   another one\r\nof the girl's purse contents scattered on the floor.   Then another\r\none of the diskette skidding on the floor and hiding   under the\r\nlarge wooden wardrobe.\r\n\r\nBilly grabs Larsen's shoulder.\r\n\r\n       LARSEN\r\n       Write. Write it.\r\n\r\nBilly takes a notepad and starts writing on it. But she is\r\ninterrupted by a Russian voice coming from somewhere in the car.\r\nLarsen opens the glove compartment and takes a walkie-talkie out\r\nof it. He talks in Russian in the talkie.\r\n\r\nBilly looks at the pair of handcuffs in the glove compartment.\r\n\r\nLarsen puts the talkie back in the compartment.\r\n\r\n       LARSEN\r\n       Write it.\r\n\r\nThey drive along a police station, but Larsen doesn't stop. Billy\r\nlooks a bit worried all of sudden.\r\n\r\n       LARSEN\r\n       Quick, write.\r\n\r\nBilly shows the police station to Larsen. Then she writes «Police»\r\non the notepad.\r\n\r\n       LARSEN\r\n       Police ? Yes. Yes, but only with the diskette.\r\n\r\nShe writes «Why ?» on the notepad.\r\n\r\n       LARSEN\r\n       You know, I work undercover. The Reaper thinks I work for\r\n       him. Trust me. Trust me.\r\n\r\nShe grabs the steering-wheel to force Larsen to park the car.\r\nTHE CAR FOLLOWING LARSEN'S CAR - INTERIOR NIGHT\r\n\r\nThrough the car windshield, we see Larsen's car zigzagging on the\r\nstreet. The two passenger talks in Russian\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nBilly is trying to force Larsen to stop the car.\r\n\r\n       LARSEN\r\n       Crazy !\r\n\r\nTHE CAR FOLLOWING LARSEN'S CAR - INTERIOR NIGHT\r\n\r\nThrough the windshield, we see Larsen's car stopping near the\r\nsidewalk. The two men talk nervously in Russian.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nBilly hits Larsen violently on his private parts. Larsen moans.\r\nBilly takes the handcuffs out of the glove compartment and ties\r\nLarsen's hand on the steering-wheel.\r\n\r\nTHE CAR FOLLOWING LARSEN'S CAR - INTERIOR NIGHT\r\n\r\nThe two men look at Larsen's parked car. They see the passenger\r\ndoor being opened.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nBilly opens the door and gets out of the car.\r\n\r\n       LARSEN\r\n       They'll kill you !\r\n\r\nBilly shows him the handcuffs key. Then she slams the door. Larsen\r\nmoves his hand nervously, but, of course, can't get it out of the\r\nhandcuff.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nBilly is running away from Larsen's car toward the other car.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nLarsen looks into the glove compartment and takes the talkie out\r\nof it. He speaks in Russian into the talkie.\r\n\r\nTHE CAR FOLLOWING LARSEN'S CAR - INTERIOR NIGHT\r\n\r\nWartschuk answers Larsen in Russian.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nLarsen is yelling in the talkie, very excited.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nBilly is walking in the street and she suddenly stops. She sees a\r\nray of light on the sidewalk.\r\n\r\nTHE CAR FOLLOWING LARSEN'S CAR - INTERIOR NIGHT\r\n\r\nThrough the windshield, we see Billy who has stopped on the\r\nsidewalk. She starts crossing the street, and the camera moves to\r\na nook between two building, near the car, and where a man is\r\nhiding. Actually, he is Wartschuk's passenger.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nLarsen puts his gearshift into reverse and starts driving\r\nbackward.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nBilly is walking in the middle of the street, and Larsen's car is\r\ncoming toward her. Billy starts running. Larsen's car turns around\r\nto face Billy and starts again, driving forward.\r\n\r\nThe man, who was hiding between the two buildings, comes out of\r\nhis hiding nook and runs toward Larsen's car. Larsen stops and\r\nstarts driving backward again.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nLarsen is driving, looking in the rear windshield. He stops\r\nsuddenly.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nThe man walks in front of Larsen's car.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nClose up shot on Larsen's feet. He steps on the accelerator.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nThe man falls on the hood of Larsen's car, where he remains lying\r\non his stomach.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nThe man lying on the hood seen through the windshield of the car.\r\nHe yells at Larsen.\r\n\r\nClose up on Larsen's feet. He steps on the brake.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nThe man falls from the hood and rolls on the street.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nClose up on the gear shift. Larsen changes gear and looks through\r\nthe rear windshield.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\nThe man stands up and starts running after Larsen's car, driving\r\nbackward again. The car reaches Billy, standing on the sidewalk.\r\n\r\nThe big black car, which was following Larsen, starts and turns\r\naround.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nLarsen looks at Billy.\r\n\r\n       LARSEN\r\n       Get in !\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nThe man is running toward Larsen's car.\r\n\r\nBilly looks at him, and hesitates on her next move. But she\r\ndecides to climb in Larsen's car.\r\n\r\nThe big black car is coming toward them.\r\n       LARSEN\r\n       Get in!\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nBilly climbs into the back of the car and closes the door.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nThe man reaches Larsen's car just as it drives away. The man\r\nremains on the sidewalk with a mean look on his face. The black\r\nlimousine stops near him and he climbs inside.\r\n\r\nLARSEN'S CAR - INTERIOR NIGHT\r\n\r\nBilly looks through the rear windshield at the car following them.\r\nLarsen has a hard time driving with his hand tied on the steering\r\nwheel.\r\n\r\n       LARSEN\r\n       Please, give me the keys.\r\n\r\nBilly nods her head «No». Larsen gives her the notepad.\r\n\r\n       LARSEN\r\n       Write. Where is the diskette ?\r\n\r\nBilly looks at the following car.\r\n\r\n       LARSEN\r\n       We cannot escape in this car. Write. Write.\r\n\r\nBilly starts writing. Then she shows the note pad to Larsen, who\r\nreads it.\r\n\r\n       LARSEN\r\n       Studio. Where in the studio ?\r\nBilly makes a «No» with her finger.\r\n\r\nA STREET IN MOSCOW - EXTERIOR NIGHT\r\n\r\nLarsen's car makes a left turn into another street.\r\n\r\nTHE CAR FOLLOWING LARSEN'S CAR - INTERIOR NIGHT\r\n\r\nThrough the windshield, we see Larsen's car turning into the\r\nadjacent street. Wartschuk speaks in his talkie.\r\n\r\n       WARTSCHUK\r\n       Delta three.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\n\r\nOne of the fake policeman picks up his talkie from the table\r\n\r\n       WARTSCHUK (voice over from the talkie)\r\n       Delta three.\r\n\r\nThe policeman answers «Da», then listen to Wartschuk speaking in\r\nRussian. He says «Da» again and a few more words. Karen and Andy\r\nlook at him, with a worried look on their face. Wartschuk answers\r\nhim. Apparently, Andy understood a few words, because he says :\r\n\r\n       ANDY\r\n       What ?\r\n\r\nThe policeman drops the talkie on the table and talks to his\r\ncolleague.\r\n\r\n       ANDY\r\n       What ?\r\n\r\nThe other policeman walks near Andy and Karen, raising his gun.\r\n\r\n       ANDY\r\n       This is all a big misunderstanding and... Excuse me, but\r\n       this is...\r\n\r\nThe first policeman takes Andy's hands and cuffs them behind his\r\nback.\r\n\r\n       ANDY\r\n       You don't have to arrest us. Why is he arresting me ? This\r\n       is ridiculous. I'm an American citizen. Do you understand\r\n       what I'm saying ? Now, I'm a director.\r\n\r\nKaren turns her head and looks at the dead Lyosha.\r\n\r\n       ANDY\r\n       You know, I'm directing a movie here in Moscow. I'm\r\n       bringing a lot of money in this place.\r\n\r\nThe policemen don't seem to take any notice of what Andy is\r\nsaying. One is still cuffing his hands while the other one is\r\nholding his gun.\r\n\r\n       ANDY\r\n       And my father, okay, he knows a lot of big people, and...\r\n       Listen.\r\n\r\nThe policeman raises Andy to his feet and moves him away from\r\nKaren.\r\n\r\n       ANDY\r\n       You want money ? Is that what you want ?\r\n\r\nThe policeman has seated Andy on an armchair. He bends him down\r\nand puts the barrel of his gun on Andy's neck.\r\n\r\n       ANDY\r\n       I don't understand what is going on here. We don't have a\r\n       diskette !\r\n\r\n       FAKE POLICEMAN # 1\r\n       You have one more chance to tell me where is diskette.\r\n\r\nSince the policemen are not looking at her, Karen moves slowly on\r\nthe floor.\r\n       ANDY\r\n       The diskette. You know, I mean, this is ridiculous. We\r\n       don't have a diskette. That's what I'm saying.\r\n\r\nThe policeman clicks his gun in a «ready to shoot» position.\r\n\r\nKaren grabs the carpet with both hands and pulls it violently.\r\n\r\nThe small telephone table falls on the floor, but also the\r\npoliceman who was ready to kill Andy. In his fall, he pulls the\r\ntrigger of his gun, which shoot a bullet at the other policeman,\r\nwho falls dead on the floor.\r\n\r\nAndy tries to get off the armchair, but just falls down with it.\r\n\r\nKaren picks up the telephone handset, with its cut cord hanging\r\nfrom it. She rushes to the first policeman, and starts hitting him\r\non the head with the handset. Andy stands up.\r\n\r\n       ANDY\r\n       Karen, get the key ! Get the key ! Unlock me !\r\n\r\nAPARTMENT BELOW BILLY'S - BEDROOM - INTERIOR NIGHT\r\n\r\nThe couple was eventually asleep, but with what is happening now\r\nin Billy's apartment, they wake up. The man switches the light on.\r\nWe hear Andy yelling.\r\n\r\n       ANDY (voice over)\r\n       Find the key !\r\n\r\nThe man swears in Russian and puts his night robe on.\r\n\r\n       ANDY (voice over)\r\n       He's not gonna move, is he ? Okay, okay.\r\n\r\nBILLY'S APARTMENT - LIVING-ROOM - INTERIOR NIGHT\r\nKaren is unlocking Andy's handcuffs. When it's done, Andy massages\r\nhis hands and puts his jacket back on. Karen drops the handcuffs\r\non a table.\r\n\r\n       ANDY\r\n       Right. Let's get out of here.\r\n\r\nClose shot on the talkie lying on the floor.\r\n\r\n       WARTSCHUK (voice over from the talkie)\r\n       Delta three. Delta three.\r\n\r\nAndy and Karen look at the talkie.\r\n\r\n       KAREN\r\n       Answer it.\r\n\r\n       ANDY\r\n       Why ?\r\n\r\n       KAREN\r\n       They may say something about Billy.\r\n       WARTSCHUK (voice over from the talkie)\r\n       Delta three.\r\n\r\nKaren picks up the talkie and gives it to Andy.\r\n\r\n       ANDY (with an exaggerated deep voice)\r\n       Da.\r\n\r\nOf course, he gets an answer in Russian.\r\n\r\n       ANDY\r\n       Da.\r\n\r\nHe gets another Russian answer, but the word «studio» is clearly\r\nunderstandable.\r\n\r\n       ANDY\r\n       Da.\r\n\r\nKaren takes the talkie out of his hands and throws it.\r\n\r\n       KAREN\r\n       I got something about studio. Come on.\r\n\r\nThe policeman, who had been knocked out by Karen, is slowly waking\r\nup. Karen sees him and yells.\r\n\r\n       KAREN\r\n       Look out !\r\n\r\nKaren picks up a gun and points it at the policeman. Andy grabs a\r\nwooden armchair and crashes it on the policeman's back. The\r\narmchairs breaks apart. The policeman falls down, unconscious.\r\n\r\nThe door opens and the next floor neighbor walks in. He yells\r\nsomething in Russian. Karen turns toward him, with the gun still\r\npointed in front of her. The man look at the mess, the dead\r\nbodies... and the gun. He raises his arms above his head. Andy\r\nthrows away the pieces of armchair he still had in his hands.\r\nKaren puts the gun behind her back.\r\n\r\n       ANDY\r\n       Mmm... It's not what you think. What do you say ?... How do\r\n       you ?... In Russian, what ?...\r\n\r\nKaren says a couple of words in Russian. Andy turns toward her.\r\n\r\n       ANDY\r\n       What ? What does that mean ?\r\n\r\n       KAREN\r\n       Hel...\r\n\r\n       ANDY\r\n       Hello ? We need help !\r\n\r\nThe man starts talking rapidly in Russian.\r\n\r\n       ANDY\r\n       I'm a director, and I'm making a movie here. This is not a\r\n       movie.\r\n\r\nThe man hasn't stopped talking. Actually, he and Andy have been\r\ntalking together. Now he yells something in Russian. Andy turns\r\ntoward Karen.\r\n\r\n       ANDY\r\n       Put the gun away. You look like a hit man. He thinks we're\r\n       gonna kill him !\r\n\r\nAndy took the gun from Karen and now he is waving it at the man.\r\n\r\n       KAREN\r\n       We're not gonna kill you !\r\n\r\n       ANDY\r\n       This is not even ours !\r\n\r\n       KAREN\r\n       The policemen wanted to kill us !\r\n\r\nThe man turns around and runs out of the apartment, yelling in\r\nRussian.\r\n\r\n       KAREN\r\n       We gotta get out of here.\r\n\r\n       ANDY\r\n       Well, I think we should call the cops.\r\n\r\n       KAREN\r\n       Are you crazy ?\r\n\r\n       ANDY\r\n       Well, we can explain this.\r\n\r\n       KAREN\r\n       Explain ? You are crazy. Come on. Here.\r\n\r\nShe has a gun in her hand and she gives him another gun. She runs\r\nout of the apartment. Andy takes the handcuffs from the table.\r\n\r\n       ANDY\r\n       I'll take these too.\r\n\r\nHe follows Karen out of the apartment.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nClose shot on the entrance of the studio, where a plate says\r\nsomething in Russian and underneath : «Central Film Studio».\r\n\r\nLarsen's car enters the studio. It stops near the building.\r\n\r\nWe see Billy and Larsen through the windshield. Larsen shows his\r\nhandcuff to Billy.\r\n\r\n       LARSEN\r\n       And now ?\r\nBilly tries to get out of the car, but she can't open the back\r\ndoor.\r\n\r\n       LARSEN\r\n       Child locks.\r\n\r\nBilly gets the key out of her pocket and gives it to Larsen, who\r\nunlocks the handcuff.\r\n\r\nHe gets out of the car and closes the door. He goes around the car\r\nto open Billy's door. As he is doing it, he sees car headlights\r\ncoming his way.\r\n\r\n       LARSEN\r\n       Don't look now, but our friends are still here.\r\n\r\nThey both runs toward the building. He opens a big metal door and\r\nthey enter the building.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nThis is the unused set, where Billy went, at the beginning of the\r\nstory, when she found herself locked in. It has metal doors\r\nopening directly on the parking lot.\r\n\r\nBilly pulls the big bolt that locks the door from the inside. Then\r\nLarsen puts a padlock on the bolt.\r\n\r\n       LARSEN\r\n       I will block the other entrances.\r\n\r\nThey both walk away.\r\n\r\nMOSCOW - A STREET NEAR RED SQUARE - EXTERIOR NIGHT\r\n\r\nKaren's car is driving full speed toward The Red Square. When she\r\ntakes a turn, the tires are screeching on the macadam and the car\r\nzigzags a little.\r\n\r\nKAREN'S CAR - INTERIOR NIGHT.\r\n\r\nThrough the windshield, we see a small roadblock with lights on\r\nit. It is not permitted to cross Red Square during the night.\r\n\r\n       ANDY\r\n       What... what are you doing ? That... that's Red Square.\r\n\r\nMOSCOW - RED SQUARE - EXTERIOR NIGHT\r\n\r\nThe car rushes toward the roadblock.\r\n\r\nKAREN'S CAR - INTERIOR NIGHT.\r\n\r\nWhen he sees the roadblock coming toward him, Andy slides down\r\nunder the dashboard.\r\n\r\n       ANDY\r\n       Oh, perfect.\r\nMOSCOW - RED SQUARE - EXTERIOR NIGHT\r\n\r\nWithout even slowing down, Karen's car smashes through the\r\nroadblock. The debris are flying around. And the car keeps on\r\ndriving full speed toward Red Square.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nWartschuk and his passenger are walking on the empty yard, guns in\r\nhand. Voices are coming from their walkie-talkie. Several cars are\r\nentering the parking lot behind them. The cars stop in front of\r\nthe building. Men carrying machine guns are coming out of the\r\ncars.\r\n\r\nWartschuk directs the whole operation with his walkie-talkie.\r\n\r\nA man tries to open the big metal door, but it's locked. He yells\r\nsomething in Russian to Wartschuk, who answers him and points at\r\nsomething. Apparently, he tells him to go around the building,\r\nbecause the man starts running away.\r\n\r\nJust outside the parking lot, Karen's car is coming to a stop near\r\nthe entrance. We hear the Russian voices in the parking lot. Karen\r\nand Andy get out of the car. Karen walks to the entrance of the\r\nparking lot and peeks inside. Andy joins her, trying to make his\r\ngun work.\r\n\r\n       ANDY\r\n       This damn gun, I can't work the safety.\r\n\r\nKaren shushes him down. They both peek inside, and they are\r\nsurprised to see such a number of big black cars.\r\n\r\n       ANDY\r\n       Holy shit !\r\n\r\nWartschuk is giving orders through his walkie-talkie. A man with a\r\nmachine-gun walks away from him.\r\nBack to Karen and Andy, still standing outside the entrance.\r\n\r\n       KAREN\r\n       Around the back.\r\n\r\nThey run across the entrance. The men, all looking toward the\r\nbuilding, don't see them.\r\n\r\nWartschuk is still giving orders. All the men with machine-guns\r\nare scattering around the building. Someone is calling Wartschuk\r\nthrough his talkie. Wartschuk smiles. He walks away from his men.\r\n\r\nOn the other side of the studio compound, Karen and Andy are\r\nentering the place by climbing over the wall. Karen is already in\r\nthe place and she is helping Andy to join her. For the moment, he\r\nis sitting on top of the wall and he throws the two guns to her.\r\nThen he goes down himself. Karen holds his legs.\r\n\r\n       KAREN\r\n       Okay. Jump, Andy. I got you.\r\n       ANDY\r\n       What ?\r\n\r\n       KAREN\r\n       I got you. I got you.\r\n\r\nAndy falls down heavily on the ground.\r\n\r\nOn a balcony on a near building, a man is watching the yard with a\r\nflashlight. This is the balcony which Billy fell from.\r\n\r\nAndy and Karen are crossing the yard, trying to be as discrete as\r\npossible.\r\n\r\nWartschuk is climbing rapidly up an emergency ladder to meet the\r\nman with the flashlight.\r\n\r\nKaren and Andy, lying low, are coming slowly toward the building.\r\n\r\nWartschuk has reached the balcony where the man is watching the\r\nyard. They whisper in Russian. Then Wartschuk goes inside,\r\nactually through that same emergency door through which Billy\r\ntried earlier to escape. The watcher closes the door behind him.\r\n\r\nAndy and Karen are still crawling slowly toward the building.\r\n\r\nOn the balcony, the man is smoking a cigarette.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nThis is the set where the poor actress was murdered.\r\n\r\nLarsen is trying to use a telephone on the wall.\r\n\r\n       LARSEN\r\n       It's no use. All lines are cut.\r\n\r\nBilly is watching Larsen. Behind her, we see Wartschuk peeking\r\nthrough the half-open door.\r\n\r\n       LARSEN\r\n       Where is it ?\r\n\r\nBilly shows him the ancient-looking wardrobe under which the\r\ndiskette is hidden. He bends down. Then he raises and takes a\r\npiece of wood from a rack. He slides the piece of wood under the\r\nwardrobe.\r\n\r\nWartschuk enters silently on the set.\r\n\r\nLarsen gets the diskette out of its hiding place. Billy picks it\r\nup. Behind her, Wartschuk has got his gun out. Billy stands up\r\nwith the diskette in her hand. She smiles. Wartschuk grabs her\r\nfrom the back. She throws the diskette. Larsen catches it.\r\n\r\n       LARSEN\r\n       You helped us a lot, Billy. Thank you.\r\n\r\nLarsen puts discreetly the diskette in Wartschuk's pocket.\r\n       WARTSCHUK\r\n       The Reaper wants to meet the woman who has kept him up all\r\n       night and witnessed a live snuff.\r\n\r\nHe gives his gun to Larsen.\r\n\r\n       WARTSCHUK\r\n       He wants you to do it.\r\n\r\n       LARSEN\r\n       You know why we call him The Reaper ? You see his face, you\r\n       die.\r\n\r\nBilly spits in Larsen's face. Then she yells silently, because\r\nWartschuk is squeezing her a little tighter. Larsen wipes the spit\r\nfrom his face. Larsen raises his gun, holding it by the barrel.\r\nBilly looks very frightened, because she knows that Larsen is\r\ngoing to knock her out. But the butt of the gun lands violently...\r\non Wartschuk's head, who screams and falls heavily on the floor.\r\nBilly looks from Larsen to the falling man, not understanding\r\nclearly what happened.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR\r\n\r\nAndy is hiding behind a trash can. He looks up at the watcher on\r\nthe balcony. He finally comes out of his hiding place, but bumps\r\ninto a beer can lying on the ground. The watcher says something in\r\nRussian and points his flashlight toward Andy.\r\n\r\n       ANDY\r\n       Nice night, isn't it ?\r\n\r\nKaren is slowly going around the pile of empty film boxes on which\r\nBilly fell earlier.\r\n\r\n       ANDY\r\n       I'm just taking a piss. Right, you know, just...\r\nThe watcher walks slowly down the ladder. Karen reaches the\r\nladder, climbs on something we don't see, and catches the\r\nwatcher's foot through the steps of the ladder. The man falls and\r\nrolls all the way down the ladder. He is unconscious and Andy ties\r\nhis wrist to the ladder with the handcuff. Karen joins him. Andy\r\nseems very happy about the successful operation.\r\n\r\nThe Reaper's black limousine is entering the parking lot.\r\n\r\nKaren, who has started to go up the steps of the ladder, looks at\r\nthe limousine.\r\n\r\n       KAREN\r\n       Who the hell is that ?\r\n\r\n       ANDY\r\n       Well, whoever it is, they're coming here.\r\n\r\nThey reach the balcony and enter the building.\r\n\r\nThe Reaper's car is driving toward the building, with all the men,\r\nequipped with machine guns, watching his arrival.\r\nCINEMA STUDIO - CORRIDOR - INTERIOR NIGHT\r\n\r\nKaren and Andy are running along the long corridor. Andy is still\r\ntrying to work out the safety of his gun.\r\n\r\n       ANDY\r\n       I can't work the safety.\r\n\r\n       KAREN\r\n       Andy, come on.\r\n\r\n       ANDY\r\n       Yeah, yeah, I'm coming.\r\n\r\nHe falls down, dropping all the bullets on the floor.\r\n\r\n       KAREN\r\n       Hurry !\r\n\r\nAndy picks up his bullets, stands up and runs after Karen.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nThe Reaper's car is still surrounded by all the guards in arms.\r\n\r\nWe see only the shadow of The Reaper inside his car.\r\n\r\n       THE REAPER\r\n       Where is she, Larsen ?\r\n\r\nWe guess he is talking into a walkie-talkie.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nThis is the unused film set, with large metal doors opening on the\r\nparking lot\r\nKaren enters the gallery above the room, followed by Andy. She\r\nbends down, and makes him bend down.\r\n\r\n       THE REAPER (voice over from the talkie)\r\n       Larsen, are you reading me ?\r\n\r\n       KAREN (whispering)\r\n       Somebody's coming.\r\n\r\n       ANDY (whispering)\r\n       I'm waiting.\r\n\r\nDown below, on the set itself, Billy is walking, with Larsen\r\nbehind her, pointing a gun in her back.\r\n\r\n       LARSEN (answering The Reaper)\r\n       I'm bringing her out now.\r\n\r\nOn the gallery, Andy is still trying to work his gun.\r\n\r\n       KAREN\r\n       Shoot him. Shoot him, Andy.\r\n       ANDY\r\n       Okay.\r\n\r\nAndy shoots, misses Larsen, and hits a statue.\r\n\r\nLarsen and Billy try to hide from the shooter.\r\n\r\nAndy shoots again and misses again.\r\n\r\n       KAREN\r\n       Be careful of Billy ! God.\r\n\r\nKaren runs along the gallery, while Andy shoots and misses again.\r\nAnd once again. Then he realizes that the gun is empty and he\r\ndrops it on the floor of the gallery. He runs after Karen.\r\n\r\nDown below, Larsen brings Billy near the big metal door opening on\r\nthe outside. He unlocks the padlock that he had put earlier on the\r\nbolt of the door.\r\n\r\nKaren rushes toward them.\r\n\r\n       KAREN (yelling)\r\n       Billy !\r\n\r\nLarsen pulls the bolt open. Billy is very surprised to see her\r\nsister. Larsen points his gun at her and yells something in\r\nRussian.\r\n\r\nKaren stops running, but Billy makes large signs to her, signs she\r\ndoesn't seem to understand. Karen hides, and then comes out.\r\n\r\n       LARSEN\r\n       Stay where you are !\r\n\r\nKaren throws a piece of metal at Larsen. The piece of metal hits\r\nhis hand and he drops his gun.\r\n       KAREN (yelling)\r\n       Run, Billy. Run ! Run !\r\n\r\nBilly opens the big metal door. Andy runs in to join Karen. Larsen\r\npicks up his gun, and points it at Billy.\r\n\r\n       LARSEN\r\n       Stand back !\r\n\r\nBut Billy is already out of the building.\r\n\r\n       KAREN (yelling)\r\n       Not out there !\r\n\r\nAndy grabs Karen and pulls her out of Larsen's gun.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nBilly runs out of the building. An army of men, armed with\r\nmachine-guns, is waiting for her. The cars' drivers all switched\r\ntheir headlights on high beams. With all that light in front of\r\nher, Billy doesn't see anymore where she is going and stops\r\nrunning.\r\n\r\nThe Reaper, still in his car, bends down to look at her. He takes\r\nhis walkie-talkie.\r\n\r\n       THE REAPER\r\n       Kill her, Larsen.\r\n\r\nLarsen walks out of the building, and we hear the end on The\r\nReaper's sentence coming from his own walkie-talkie.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nKaren and Andy rush to the window, to look at what is happening on\r\nthe parking lot.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nBilly looks at the men in front of her with a frightened face. She\r\nturns around to look at Larsen pointing his gun at her. Then she\r\nturns back to the men in front of her, and especially The Reaper,\r\nlooking at her from his car. Behind her, Larsen aims his gun at\r\nher.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nKaren and Andy are still looking through the window.\r\n\r\n       KAREN (yelling)\r\n       No !\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nLarsen closes one eye before shooting. He shoots seven times. We\r\nsee the bullets going through Billy's body from the back, and\r\ncoming out through the front, making red bloody spots on her white\r\nsweater. Billy falls down on her stomach, and remains motionless\r\non the ground with her arms spread apart.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nKaren, still standing behind the window, can't believe what she\r\njust saw.\r\n\r\nThrough the window, we see Billy's body lying on the ground, with\r\nall the big black cars surrounding her.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nThrough the half-open door, Larsen shows The Reaper the diskette\r\nhe has found on the set.\r\n\r\nThe Reaper smiles. The big metal door closes as Larsen goes back\r\ninside.\r\n\r\nAll the men go back inside their cars. The engines start. And the\r\ncars start driving out, The Reaper's car being the first one to\r\ngo.\r\nBilly is still lying motionless on the ground, her blood flowing\r\nslowly on the tarmac.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nKaren is in Andy's arms, crying.\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nThe last cars are leaving the parking lot.\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\n\r\nAndy, with Karen crying on his laps, looks at Larsen coming back\r\nin and closing the door.\r\n\r\n       LARSEN\r\n       Now please, let me explain. Please ?\r\n\r\n       KAREN (yelling)\r\n       Explain ?\r\n\r\nShe rushes out of Andy's arms and bumps violently into Larsen.\r\n\r\n       ANDY\r\n       Karen !\r\n\r\nThey both fall on the floor, and Larsen's gun flies away from his\r\nhand. Karen hits Larsen very hard with both her fists. Andy picks\r\nup the gun and points it at Larsen. Larsen pushes Karen away from\r\nhim. Karen takes the legs of a statue and hits Larsen with it.\r\nThen she grabs Larsen by the ears and throws him on the metal\r\ndoor. She turns toward Andy.\r\n\r\n       KAREN\r\n       Kill him.\r\n\r\nKaren opens the door and walks out.\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nBilly, still lying on the ground, opens one eye and smiles.\r\n\r\nKaren runs out of the building and rushes toward her sister, who\r\nstands up when she sees her. Karen stops and looks at her. Karen\r\nsits up and raises her sweatshirt.\r\n\r\nUnderneath, she is equipped with the special effect system she\r\nuses to pretend people are being shot. Little bags, full of fake\r\nblood, explode one by one, tearing the piece of clothing in front\r\nof them, and pouring the blood through the fabric. For the\r\nspectator, it does looks like bullet going through a body and\r\nblood spurting out.\r\n\r\nKaren rushes to Billy and hugs her.\r\n\r\n       KAREN\r\n       You genius !\r\n\r\nCINEMA STUDIO - FILM SET - INTERIOR NIGHT\r\nLarsen is still kneeling on the floor. Andy is pointing the gun at\r\nhim, trying to look mean, which is a bit hard for him.\r\n\r\n       ANDY\r\n       You thought we were tourists, huh ? Guess again, pal.\r\n\r\nLarsen is slowly getting up.\r\n\r\n       ANDY\r\n       Don't move. Don't move! I'm talking to you !\r\n\r\nHe shoots the gun to the ceiling.\r\n\r\n       ANDY\r\n       I'm warning you. Don't move or I'm gonna shoot you ! Okay !\r\n\r\nHe shoots at Larsen, who doesn't react and walks closer to him. He\r\nshoots twice more, walking backward. He bumps into a prop and\r\nfalls down on his back... next to Wartschuk, all tied up and with\r\na large piece of tape across his mouth. Wartschuk moans, Andy\r\nscreams and gets quickly up. He rushes out of the building while\r\nLarsen is trying to get over what just happened to him\r\n\r\nCINEMA STUDIO - PARKING LOT - EXTERIOR NIGHT\r\n\r\nAndy rushes out of the building and sees Karen cleaning Billy's\r\nface.\r\n\r\n       ANDY\r\n       Billy ! Billy ! Billy !\r\n\r\n       KAREN\r\n       She's okay. She's fine.\r\n\r\n       ANDY\r\n       She's fine ? She's okay ?\r\nBilly mouth the words «I'm fine» and shows him the special effect\r\ndevice on her stomach. Larsen comes behind her and takes her by\r\nthe shoulder, saying a few words in Russian. Billy says something\r\nin sign language to Karen.\r\n\r\n       KAREN\r\n       A cop ?\r\n\r\n       ANDY\r\n       A cop ?\r\n\r\n       KAREN\r\n       Oh, my God, I'm sorry.\r\n\r\n       ANDY\r\n       Sorry.\r\n\r\n       LARSEN\r\n       Forget it. Your sister was brilliant.\r\n\r\nKaren pats Larsen's shoulder.\r\n       KAREN\r\n       Next time, hit back.\r\n\r\nLarsen throws a remote control into Andy's hands.\r\n\r\n       ANDY\r\n       Oh !... this is the remote. I get it.\r\n\r\nThey all laugh. Larsen pats Andy's shoulder.\r\n\r\n       LARSEN\r\n       Big cowboy.\r\n\r\nBilly starts talking in sign language to Larsen. He turns toward\r\nKaren.\r\n\r\n       LARSEN\r\n       What ?\r\n\r\n       KAREN\r\n       That was an invitation to dinner sometime.\r\n\r\n       LARSEN\r\n       How you say ?... It would be a pleasure.\r\n\r\nBilly mouthes the word «Pleasure» and then makes the sign for it,\r\nwhich is rubbing you stomach. Larsen makes the same sign. Then he\r\nstops and seems to think about something.\r\n\r\n       LARSEN\r\n       I still don't understand.\r\n\r\n       KAREN\r\n       What ?\r\n\r\n       LARSEN\r\n       I don't understand why The Reaper didn't take the diskette\r\n       off me.\r\n       KAREN\r\n       Who ?\r\n\r\nThe sound of a shot, and a blood bag explodes under Billy's\r\nsweater. Karen screams. Since she was just in front of Billy, her\r\nface is covered with fake blood. Andy looks at them, the remote\r\ncontrol in his hand.\r\n\r\n       ANDY\r\n       Whoops !... Shit. I'm sorry.\r\n\r\nThey all look at him. Larsen smiles.\r\n\r\n       LARSEN\r\n       Big cowboy.\r\n\r\nA little later.\r\n\r\nAndy drives his car near the entrance of the building. Billy walks\r\ntoward the car, looking at Wartschuk, his mouth still gagged,\r\nbeing forced by Larsen to go inside his car. He moans\r\nincomprehensible words, and seems not to want to get inside the\r\ncar.\r\n\r\nAndy waves to Larsen.\r\n\r\n       ANDY\r\n       Ciao !...\r\n\r\nAndy opens the back door of his own car to let Billy inside. But\r\nshe doesn't climb in, still surprised by Wartschuk's attitude.\r\n\r\nFinally, Larsen succeeds in putting his prisoner in the back of\r\nhis car, where another prisoner, also gagged, is already waiting\r\n(certainly the man that Andy had handcuffed earlier on the\r\nemergency ladder).\r\n\r\nBefore climbing into the driver's seat, Larsen waves to Billy.\r\n\r\n       LARSEN\r\n       Billy, tomorrow !\r\n\r\nHe makes the «pleasure» sign. Billy waves back to him.\r\n\r\n       LARSEN\r\n       Tomorrow !\r\n\r\nBilly looks at Wartschuk inside the car. She seems worried.\r\n\r\n       ANDY\r\n       What's the matter ?\r\n\r\nBilly makes several signs. Andy doesn't understand, but he looks\r\nat Larsen. Larsen smiles back to him.\r\n\r\n       LARSEN\r\n       Big cowboy.\r\n\r\nKaren is already seated in the car, and doesn't understand the\r\nreason for the delay.\r\n\r\n       KAREN\r\n       Guys, could we get out of here, please ?\r\n\r\nClose shot on Wartschuk's face, who is trying to tell them\r\nsomething.\r\n\r\nAndy eventually understand what Billy is trying to tell him. It is\r\nthe word he learned earlier in the restaurant.\r\n\r\n       ANDY\r\n       The expression ?\r\n\r\nBilly nods «Yes». Larsen smiles to her and starts his car. Billy\r\nslams violently on the roof of Andy's car. She seems frightened by\r\nsomething. She yells silently.\r\n\r\n       ANDY\r\n       The car ?\r\n\r\nBilly keeps on yelling silently and moving her arms. Andy is\r\nbeginning to understand what she means.\r\n\r\n          ANDY\r\n          The car...\r\n\r\nWartschuk looks more and more frightened.\r\n\r\nAndy want to rush to Larsen's car, but Billy holds him back.\r\n\r\n          ANDY (yelling)\r\n          Get out of the car ! Get out of the car !\r\n\r\nWatching Billy and Andy, Larsen has suddenly a worried look on his\r\nface. He is beginning to understand that something is wrong. He\r\ngets out of his car, walks a few steps, and then his car explodes\r\nand he falls on the ground.\r\n\r\nAndy, Billy and Karen, who is now out of her car, they all look at\r\nthe car burning and at the motionless Larsen lying on the ground.\r\nBilly looks very sad.\r\n\r\nBut, slowly, Larsen begins to move. He sits up and looks at Billy.\r\n\r\nBilly is crying and smiling at the same time. We get to understand\r\nshe must be in love with Larsen.\r\n\r\nCREDITS\r\n\r\nWhite letters on a black screen.\r\n\n\n\n\nMute Witness\nWriters :   Anthony Waller\nGenres :   Horror  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Billy (Marina Zudina), an FX make up artist who does not have the physical ability to speak, is in Moscow working on a low budget slasher film directed by her sister's boyfriend Andy (Evan Richards). On one particular night Billy returns to the set to fetch a piece of equipment for the next day's shoot when she is accidentally locked in the studio. Being unable to speak but having the ability to communicate with her sister Karen (Fay Ripley), Billy makes several telephone calls but is interrupted when she discovers a small film crew working after hours to shoot a cheap porno film. Watching unseen, Billy is amused until the performed sex becomes sadistic. When a masked actor pulls out a knife and stabs the actress (Olga Tolstetskaya), Billy reacts and is discovered. She flees pursued by the homicidal film crew.\nBilly narrowly escapes and manages to tell her story to her sister and the police, but the snuff film crew manages to convince the authorities that the onscreen 'murder' was a cinematic special effect. However, the events bring forward Larsen (Oleg Yankovsky), an undercover detective who is tracking the activities of the covert film crew and their connection to a shadowy criminal mastermind called \"The Reaper\". The Reaper (Alec Guinness) is a financier of an international underground snuff ring. He tells the criminal film crew that Billy is a witness and must be eliminated, thus motivating the snuff film director, his thug assistant and a host of subsidiary criminals to retrieve a missing computer disc from her and dispatch it. As more and more factions get involved in killing and saving Billy the action becomes wild and fantastic and hard to discern what's real from movie magic."}