{"title": "Mystery Men", "full_text": "Mystery Men - Revised June 6,1997\n\n\n\n\nTHE MYSTERY MEN\n\nBy Neil Cuthbert\n\nBased on the Dark Horse comic created by Bob Burden\n\nRevised June 6, 1997\n\n\n\nTHEME AND CREDITS...\n\nFADE IN:\n\nEXT.  ERIE HOSPITAL FOR THE CRIMINALLY INSANE - DAY\n\nCAMERA MOVES THROUGH a tangled jungle of razor wire, finally COMING \nINTO VIEW of a foreboding, fortress-like old institution, surrounded by \ntowers and gun turrets.  Screaming and horrible laughter is heard from \nwithin...\n\nCLOSE ON a sign that reads \"Erie Hospital for the Criminally Insane\" \n... This is where the worst killers and psychos go.\n\nINT.  CONFERENCE ROOM - CONTINUOUS\n\nTHE CAMERA PANS THE EXPRESSIONLESS FACES of the REVIEW BOARD as \nCASANOVA FRANKENSTEIN sits across from them.  Dressed in an \nimmaculately tailored prison smock (with \"Casanova\" exquisitely \nembroidered above the pocket), he sits contritely as DOCTOR EMMET \nBIERCE, the hospital's fatherly Chief of Psychiatry, presents his case.\n\n\t\t\t\t\tBIERCE\n\t\tNo one can deny the horrendous nature of Mr. \n\t\tFrankenstein's crimes, but in the twenty years \n\t\the has been with us, I have never seen a \n\t\tpatient turn his energies to more productive \n\t\tuse.\n\nCASANOVA, the picture of remorse and repentance.\n\n\t\t\t\t\tBIERCE\n\t\tJust look at his accomplishments... three \n\t\tvolumes of poetry, two rock operas, a sculpture \n\t\tgarden, four romance novels... and who can \n\t\tforget his touching portrayal of Billy Bigelow \n\t\tin our all-psychotic production of \n\t\t\"Carousel\"...\n\nON SEVERAL OF THE BOARD getting misty eyed at the memory of that \nbrilliant performance...\n\n\t\t\t\t\tBIERCE\n\t\tDirected by our own Doctor Anabel Leek.\n\nON DOCTOR ANABEL LEEK, the hospital's icily beautiful, ultra cool, top \nshrink.\n\nA moment later Casanova addresses them... His manner is charming, \nsincere, his voice soft, filled with emotion.  He is a master of \nseduction.\n\n\t\t\t\t\tCASANOVA\n\t\tTwenty years ago I was a lost soul.  \n\t\tLoveless...\n\t\t(with a son-like glance at Doctor Bierce)\n\t\tFatherless...\n\t\t(chokes on the word)\n\t\tA... psycho!\n\t\t(breaks down sobbing)\n\t\tOh!  How could I have done it? The murder... \n\t\tthe mayhem... all of those lovely young girls!\n\t\t(weeping, a brilliant performance)\n\t\tI'm sorry!  I'm SO SO SORRY!\n\nDoctor Bierce wipes the tears from his eyes.  Reactions from the board, \nmoved, as Casanova weeps convulsively.  Doctor Leek shows no reaction.\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t(pulls himself together)\n\t\tBut my deeds have been done, and my youth is \n\t\tgone, and we can only go forward in this cruel \n\t\tworld... and if I have learned anything from my \n\t\twretched life it is that... When you walk \n\t\tthrough a storm, keep your head held high...\n\t\t\t\t\t(singing)\n\t\tAnd don't be afraid of the dark...\n\nTears plop dawn the cheeks of the review board as the FULLY \nORCHESTRATED STRAINS OF \"WHEN YOU WALK THROUGH A STORM\" SWELL...\n\nSERIES OF SHOTS - AS THE MUSIC CONTINUES\n\nA hand stamps Casanova's file \"CURED\"... Casanova shakes hands and \nembraces the tearful members of the review board, finishing with a \npaternal hug from Doctor Bierce.\n\nIn his cell a guard delivers Casanova his favorite old disco suit \n(that's been waiting far him for twenty years).\n\nCasanova, dressed in the suit, walks down the central aisle of the \nlock-up... A moment later he steps out of the massive gates of the \nhospital, and takes his first deep breath of freedom... while in an \noffice window high above Bierce and the members of the review board \nstand watching, very proud...\n\nBut suddenly THE MUSIC CHANGES TO SEVENTIES DISCO as a black Ferrari \ndrives up, and Doctor Leek, now dressed very sexily, gets out... As the \nreview board watches in stunned silence, Casanova and Anabel perform a \nnifty little disco twirl, finishing with a very lewd kiss...\n\nBierce, watching, realizes he's been duped... as Casanova, grinning up \nat him, puts a long gold chain (his favorite weapon) around his neck... \nBierce, horrified, picks up the telephone... as Casanova and Anabel get \nin the car.\n\nINT.   THE CAR - A MOMENT LATER\n\nCasanova and Anabel drive off.  The massive old hospital is seen \nthrough the rear window behind them, as Casanova calmly looks at his \nwatch...\n\nCLOSE ON HIS WATCH -\n\nas the second hand just swings toward the twelve.  It is exactly twelve \nnoon...\n\nBACK ON CASANOVA -\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t(almost wistfully)\n\t\tBoom.\n\nAnd the hospital EXPLODES in a HUGE FIREBALL that completely consumes \nit.\n\n\t\t\t\t\tCASANOVA\n\t\tThose gas leaks can be murder.\n\nEXT.  THE ROAD - DAY\n\nThe Ferrari drives past and the CAMERA HOLDS ON a sign that reads \n\"We1come to Champion City, home of Captain Amazing\". The city itself, a \ncrumbling rust belt metropolis (ala Detroit) can be seen stretched out \nalong the shore of Lake Champion off in the distance...\n\nINSIDE THE CAR - CONTINUOUS - ON CASANOVA\n\n\t\t\t\t\tCASANOVA\n\t\tI'm home.\n\nBACK ON THE ROAD  - CONTINUOUS\n\nThe Ferrari drives under a much larger billboard that looms over the \nroad, showing a picture of Captain Amazing himself, a square jawed \nclassic superhero, staring fiercely into the camera.  The caption reads \n\"Crime.  Don't even think about it.\"\n\nEXT.  TRAIN YARDS OF CHAMPION CITY - NIGHT\n\nLetters read \"Six months later\"...\n\nas the CAMERA EXPLORES the desolate muddy terrain of the train yards, \nCRUISING past piles of tires and abandoned train cars...\n\nCAMERA PICKS UP a battered van as it drives through the yard, then \npulls up beside an old boxcar.  The back of the van is thrown open, a \nramp is thrown down, and THE RED EYES, a gang of vicious small time \nthieves (all of whom wear sunglasses with red lenses) start unloading \ntheir night's haul... RED EYE 1 drives a golf cart, with clubs, down \nthe ramp.\n\n\t\t\t\t\tRED EYE 1\n\t\tGolf anyone?\n\nSeveral more Red Eyes emerge carrying a sawn off bike rack with bikes \nstill attached, a barber pole, a Virgin Mary lawn statue, and a top of \nthe line baby stroller... while their leader, BIG RED, stands in the \ndoor to the boxcar, watching approvingly.\n\n\t\t\t\t\tRED EYE 2\n\t\tNot a bad night's work.\n\n\t\t\t\t\tBIG RED\n\t\tWho said crime don't pay?\n\nThe Red Eyes laugh... as Red Eye 3 takes the cover off the baby \nstroller and sees... that there's a BABY still in it.\n\n\t\t\t\t\tRED EYE 3\n\t\tHey, Boss, we got a stowaway.\n\nThe crooks gather around the baby, a jolly little kid who just laughs \nat them.\n\n\t\t\t\t\tRED EYE 4\n\t\t\t\t(about to slug him)\n\t\tWho you laughin' at, punk?\n\n\t\t\t\t\tRED EYE 2\n\t\tHe's just a tyke.  Lighten up.\n\n\t\t\t\t\tRED EYE 5\n\t\tHe's kinda cute.\n\n\t\t\t\t\tRED EYE 3\n\t\tIf you like drool.\n\n\t\t\t\t\tRED EYE 2\n\t\tHey, why don't we sell him back to his parents?  \n\t\tFor a million bucks!\n\nThe others think that's a great idea, but Big Red doesn't.\n\n\t\t\t\t\tBIG RED\n\t\tAnd what if he rats on us?\n\nThe others hadn't thought of that.\n\n\t\t\t\t\tRED EYE 3\n\t\tSo what should we do with him?\n\n\t\t\t\t\tBIG RED\n\t\tStick a brick in his Pampers and dump him in \n\t\tthe lake.\n\nThe others think that's a good idea and look around for a brick.\n\n\t\t\t\t\tRED EYE 3\n\t\tCome on, kid, you're goin' for a swim.\n\nBut suddenly there is another presence... A man in a blue turban and \ncape with the initials \"BR\" on his chest has appeared... He is THE BLUE \nRAJA.\n\n\t\t\t\t\tRAJA\n\t\tNot so fast, gentlemen--and I use the term \n\t\tloosely... Unhand that youngster...\n\nAnother man steps into the light.  He wears a construction helmet and \nmask.  There is an \"S\" on his chest, and he carries an old shovel.  He \nis THE SHOVELER.\n\n\t\t\t\t\tSHOVELER\n\t\tOr you're mulch.\n\nHe brandishes his shovel for effect.  The Red Eyes look at these two, \nhighly amused.\n\n\t\t\t\t\tBIG RED\n\t\tWhat are you guys supposed to be... \n\t\tsuperheroes?\n\nA third man steps out.  His costume is less dramatic than the others.  \nHe wears only an old leather jacket and a faded, torn shirt with flames \non it, but the fierce look on his face and the atrociousness of his \nhaircut make it very clear that he is the craziest and most dangerous \nof the three.  He is MISTER FURIOUS.\n\n\t\t\t\t\tFURIOUS\n\t\tWe ARE superheroes!\n\n\t\t\t\t\tBIG RED\n\t\tReally?  Did you mother make those costumes?\n\nThe crooks howl with laughter.\n\n\t\t\t\t\tBIG RED\n\t\tThis is our territory.  Beat it.\n\n\t\t\t\t\tFURIOUS\n\t\tOver YOUR dead body.\n\nBig Red turns to the others and shakes with pretended fear.\n\n\t\t\t\t\tBIG RED\n\t\t0ooooo, he's scary.\n\nThe Red Eyes laugh, but suddenly, a small silver projectile whizzes \nthrough the air and implants itself in Big Red's backside.  He howls \nwith pain, pulls it out and examines it... It's a silver dessert fork.\n\n\t\t\t\t\tBIG RED\n\t\tA fork!\n\nThe Raja holds up his hands, each of which hold a spread of silver \nforks.\n\n\t\t\t\t\tRAJA\n\t\tAnd there's plenty more where that came from.\n\nBig Red gives a shrill whistle, and a dozen more Red Eyes step out of \nan old caboose... including MIKEY, a four hundred pound behemoth.  He \nis eating a container of Ben and Jerry's like it was an ice cream cone, \ntaking huge bites out of it, container and all.\n\nRAJA AND SHOVELER, reacting... Gulp.  This was more than they'd \nbargained for.  But Furious just growls; he's game.\n\n\t\t\t\t\tBIG RED\n\t\tGET 'EM!\n\nThe Red Eyes attack... Mister Furious goes into a furious face; his \nhair stands out straight and he rushes right into the oncoming \ncrooks...\n\nA Red Eye takes a swing at the Shoveler--but he simply puts up his \nshovel and lets the crook slug the shovel's pan.  The crook yelps with \npain and shakes his battered hand... as the Raja fends off crooks, \npoking them with salad forks... and the baby sits in his stroller, \nwatching and laughing, really enjoying the show.  (There's no real \nmartial artistry or teamwork here; this is a classic back alley \nbrouhaha.)\n\nBut there's too many of then... The Raja goes down under swinging \nfists... and so does the Shoveler...\n\nFurious holds his own, taking out crooks with powerful lefts and \nrights--until Mikey runs him down like a truck, falling right on top of \nhim and crushing him under his massive weight.\n\n\t\t\t\t\tRED EYES\n\t\tCrush him, Mikey!... Mash him!... Mush him!\n\n\t\t\t\t\tFURIOUS\n\t\t\t(barely audible under all that meat)\n\t\tIs that all you got?\n\n\t\t\t\t\tRED EYES\n\t\tHe wants more!... Squish him!... Finish him \n\t\toff!\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t\t(faintly)\n\t\tYour mother!\n\nMikey, sweating, bears down... but suddenly, a calm, very authoritative \nvoice is heard.\n\n\t\t\t\t\tVOICE (0.S.)\n\t\tIs there a problem?\n\nEverything suddenly stops, as the Red Eyes look up and see... CAPTAIN \nAMAZING standing on tap of the boxcar, hands on hips, framed in the \nlight at the moon, his biceps bulging, his state of the art physique \nsculpted body armor gleaming in the moonlight, his cape wafting \nheroically in the wind.  He is superhero perfection incarnate.\n\nON THE RED EYES as their viciousness turns instantly to panic...\n\n\t\t\t\t\tRED EYES\n\t\tIT'S CAPTAIN AMAZING!\n\nBig Red and a couple others try to run for it, but Amazing leaps ca-\nlike off the boxcar and is on them in a flash.  As the baby claps his \nhands in delight, and our three heroes watch in beat-up awe, Amazing \ndeftly takes out the crooks with expert punches and effortlessly \ndelivered elbows and kicks. He is the consumate superhero, and he \ndoesn't even break a sweat.\n\nThe remaining Red Eyes drop to their knees and throw up their hands in \nsurrender.\n\n\t\t\t\t\tRED EYES\n\t\tWe give!... We're sorry!... We had terrible \n\t\tchildhoods!  (Etc.)\n\nPolice cars and a TV truck come screeching into the train yard... and \nthe scene is suddenly flooded vith light and swarming with cops and \nreporters...\n\nOur three heroes try to approach Captain Amazing (who still looks fresh \nas a daisy).\n\n\t\t\t\t\tRAJA\n\t\tNice work, Captain.\n\nBut Amazing just walks past them, ignoring them completely, as if they \ndidn't even exist.  He goes to greet DAWN WONG (Champion City's answer \nto Connie Chung).\n\n\t\t\t\t\tAMAZING\n\t\t\t(turning on the old superhero charm)\n\t\tHi. Dawn.\n\n\t\t\t\t\tDAWN\n\t\t\t(putty in his hands, pudding in his bowl)\n\t\tLooks like you've done it again, Captain.\n\n\t\t\t\t\tAMAZING\n\t\tIt's what I do.\n\nOur heroes just watch, feeling ignored, humiliated.  Furious growls.  \nSuddenly, TWO COPS are accosting them.\n\n\t\t\t\t\tCOP 1\n\t\tOkay, show's over. Move it. On your way.\n\n\t\t\t\t\tRAJA\n\t\tWait a minute, Officers. You don't understand--\n\t\twe're superheroes, and we just busted up this \n\t\tgang.\n\n\t\t\t\t\tCOP 1\n\t\tReally?  Let me guess-you're Towel Head and \n\t\the's...\n\t\t\t\t(meaning the Shoveler)\n\t\tCaptain Pooper Scooper!\n\nThe cops crack up.  Furious growls at them.  The cops yank out their \nnightsticks.\n\n\t\t\t\t\tCOP 1\n\t\tHey!  Move it!\n\n\t\t\t\t\tCOP 2\n\t\tGet a life!\n\n\t\t\t\t\tCOP 1\n\t\tAnd leave crime fighting to the real thing!\n\nShoveler and Raja pull Furious away before he gets into real trouble... \nThe cops watch as our three heroes disappear into the night.\n\n\t\t\t\t\tCOP 1\n\t\tWannabes.\n\n\t\t\t\t\tCOP 2\n\t\tPathetic.\n\nEXT.  THE LAKESIDE DINER - NIGHT - ESTABLISHING\n\nAn inner city greasy spoon.\n\nINT.  THE DINER - CONTINUOUS - CLOSE ON A TV SCREEN\n\non which Captain Amazing, the laughing baby in his arms, is being \ninterviewed by Dawn Wong.  He's playing the cutsy photo op for all its \nworth, gootchy-gooing the kid, etc.  Dawn is creaming.\n\nOur three heroes sit at a booth in the back of the diner, watching the \ntube...\n\n\t\t\t\t\tRAJA\n\t\t\t\t(nursing a sore jaw)\n\t\tHe doesn't miss a trick, does he?\n\n\t\t\t\t\tFURIOUS\n\t\tWhat a jerk--and like nobody knows who he really is!\n\n\t\t\t\t\tSHOVELER\n\t\tOh don't start that again--\n\n\t\t\t\t\tFURIOUS\n\t\tLOOK!\n\nFurious picks up the newspaper on which there is a photo of a good \nlooking guy in a tux at a benefit... The headline reads \"Lance Hunt \nHosts Benefit.\"  He holds the picture up next to the television, so the \nfaces of Lance Hunt and Captain Amazing are side by side.  It is \nobviously the same guy.\n\n\t\t\t\t\tFURIOUS\n\t\tHe's Lance Hunt!  Just take off the glasses--\n\t\tand it's him!\n\n\t\t\t\t\tRAJA\n\t\tThere's a vague similarity.\n\n\t\t\t\t\tFURIOUS\n\t\tA vague similarity?  IT'S THE SAME GUY!\n\n\t\t\t\t\tSHOVELER\n\t\t\t\t(downing some aspirin)\n\t\t0h, who gives a damn who he is? I can't take \n\t\tthis anymore.  Night after night we're on the \n\t\tstreets, busting our humps--and for what?\n\n\t\t\t\t\tRAJA\n\t\tWe take the licks and he gets the chicks.\n\n\t\t\t\t\tSHOVELER\n\t\tHow long do you have to chase a dream before \n\t\tyou realize it's not gonna happen?\n\n\t\t\t\t\tFURIOUS\n\t\tWe need a break, that's all! Nobody'd ever \n\t\theard of him until he busted Casanova \n\t\tFrankenstein!\n\n\t\t\t\t\tRAJA\n\t\tBut look at him... and look at us.\n\n\t\t\t\t\tSHOVELER\n\t\tThe camera loves him.\n\nA depressed silence.  Furious turns his attention to the napkin \ndispenser.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t     (furious)\n\t\tWhy do they always fill stuff these things so \n\t\tfull you can't pull 'em out without ripping \n\t\t'em!\n\t\t\t\t   (rips one out)\n\n\t\t\t\t\tRAJA\n\t\tI lost another fork tonight.  She's getting \n\t\tsuspicious, I know it.\n\n\t\t\t\t\tFURIOUS\n\t\tSo why don't you just tell her!\n\n\t\t\t\t\tRAJA\n\t\tI can't.\n\n\t\t\t\t\tFURIOUS\n\t\tWhy not?\n\n\t\t\t\t\tRAJA\n\t\t\t\t     (upset)\n\t\tBecause I can't!  Okay?  She wouldn't \n\t\tunderstand!\n\n\t\t\t\t\tSHOVELER\n\t\tLeave him alone.  She's his mother, not yours.\n\n\t\t\t\t\tFURIOUS\n\t\tWe had an off night, that's all.\n\n\t\t\t\t\tSHOVELER\n\t\tSo when are we gonna have an on night?\n\nA WAITRESS is standing at the table.\n\n\t\t\t\t\tWAITRESS\n\t\tHi.\n\nThey look at her, taken aback.  She's very pretty.\n\n\t\t\t\t\tRAJA\n\t\tYou're... new.\n\n\t\t\t\t\tWAITRESS\n\t\tIt's my first night.  My name's Monica.\n\nCLOSE ON FURIOUS, smitten by her, but almost afraid to look at her.  \nUnder all that rage, he's in fact shy.\n\n\t\t\t\t\tMONICA\n\t\tYou guys going to a costume party?\n\n\t\t\t\t\tRAJA\n\t\tWe're superheroes.\n\n\t\t\t\t\tMONICA\n\t\tReally?  Like Captain Amazing?\n\nFurious growls.\n\n\t\t\t\t\tMONICA\n\t\tAre you famous?\n\n\t\t\t\t\tRAJA\n\t\tNot yet.\n\n\t\t\t\t\tMONICA\n\t\tSo you're like... struggling superheroes?\n\n\t\t\t\t\tRAJA\n\t\tWe prefer to think of ourselves as unsung... I \n\t\tam the Blue Raja, Master of Silverware...\n\t\t\t\t(does a very impressive\n\t\t\t\tlittle flipping thing with\n\t\t\t\this place setting)\n\n\t\t\t\t\tMONICA\n\t\tWow.\n\n\t\t\t\t\tRAJA\n\t\tAnd these are my associatiates, the Shoveler.\n\t\n\t\t\t\t\tSHOVELER\n\t\tHi.\n\n\t\t\t\t\tRAJA\n\t\tAnd Mister Furious... His anger is his power.\n\n\t\t\t\t\tMONICA\n\t\t\t\t(intrigued by Furious)\n\t\tReally?\n\n\t\t\t\t\tRAJA\n\t\tUsually a superpower is a magical endowment or \n\t\ta great skill.  In his case, it's entirely \n\t\temotional.\n\n\t\t\t\t\tMONICA\n\t\tSo what can I get you?\n\n\t\t\t\t\tRAJA\n\t\tBurgers all around.\n\t\t\t\t(meaning himself)\n\t\tMedium.\n\t\t\t\t(meaning the Shoveler)\n\t\tRare.\n\t\t\t\t(meaning Furious}\n\t\tRaw.\n\nA moment later as Monica walks away, Furious can't help but\nwatch her.  The Raja replaces the diner's dinnerware with the good \nstuff from his coat.\n\n\t\t\t\t\tRAJA\n\t\tShe likes you.\n\n\t\t\t\t\tSHOVELER\n\t\tDefinitely.\n\n\t\t\t\t\tRAJA\n\t\tAsk her out.\n\n\t\t\t\t\tFURIOUS\n\t\tNah.\n\n\t\t\t\t\tRAJA\n\t\tRoy, when was the last time you had an actual \n\t\tdate?\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(getting very pissed off)\n\t\tWhat does it matter?  Women just want to \n\t\tcontrol you--and talk about their feelings.  \n\t\tThey want to know why you're angry all the \n\t\ttime--and what can they can do to help--so you \n\t\ttell them there's nothing--nothing--just leave \n\t\tme alone--but they bug you and they bug you and \n\t\tthey bug you--until you just can't stand it \n\t\tanymore!--so you finally open up--you pop like \n\t\ta blister--and it all comes spewing out--all \n\t\tyour emotions--your feelings--your fears--all \n\t\tof it!\n\t\t\t\t\t(after a beat)\n\t\tAnd then they dump you.\n\n\t\t\t\t\tRAJA\n\t\tSo you're chicken?\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t     (fiercely)\n\t\tWho's chicken?\n\t\t\t\t\t(gets up)\n\nMonica stands at the counter placing her order.  Furious approaches \nher, leans against the counter.  For a moment he just stands there, \nfuming, unable to think of anything to say. She isn't sure what to make \nof this.\n\n\t\t\t\t\tFURIOUS\n\t\tDoesn't it piss you off the way the when you \n\t\treally want to talk to somebody you can't think \n\t\tof anything to say!\n\n\t\t\t\t\tMONICA\n\t\tI guess... Are you always so angry?\n\n\t\t\t\t\tFURIOUS\n\t\tOnly when I'm awake... You busy after work?\n\nShe shrugs.\n\n\t\t\t\t\tFURIOUS\n\t\tWant to go out and get drunk?\n\nShe's visibly turned off by that.\n\n\t\t\t\t\tFURIOUS\n\t\tOr talk?\n\n\t\t\t\t\tMONICA\n\t\tNot tonight.\n\t\t\t(picks up an order and walks away)\n\nEXT.  OUTSIDE THE DINER - LATER\n\nFurious, the Raja, and the Shoveler step out.\n\n\t\t\t\t\tRAJA\n\t\tMaybe you should try a more romantic approach.\n\n\t\t\t\t\tFURIOUS\n\t\t\t(gets on his old Harley)\n\t\tLike what?  Cutting off my own ear?\n\n\t\t\t\t\tRAJA\n\t\tOr flowers.\n\n\t\t\t\t\tFURIOUS\n\t\tSee ya tomorrow.\n\nFurious kicks his engine started and speeds off into the night as the \nShoveler opens the door of his battered Ford Esquire station wagon, and \nthe Raja gets into his ancient Datsun.\n\nEXT.  RESIDENTIAL STREET - NIGHT\n\nThe Shoveler pulls into the driveway of his very modest house. The \nfront yard looks like a battle zone.  Bikes and kids' junk are \neverywhere.\n\nLIVING ROOM - A MOMENT LATER\n\nas big a disaster area as the front yard. His kids, EDDIE JR. (15), \nLENORE (12), BUTCH (10), TRACY (7), and ROLAND (5) are all sprawled in \nfront of the television. The Shoveler enters, and his kids don't even \nbother to look up from the tube.\n\n\t\t\t\t\tSHOVELER\n\t\tHey, when are you guys gonna clean this place \n\t\tup?\n\n\t\t\t\t\tTRACY\n\t\tWhen you're on TV.\n\n\t\t\t\t\tEDDIE JR.\n\t\tRight--like that will ever happen.\n\n\t\t\t\t\tLENORE\n\t\tSave any babies lately?\n\nON THE SHOVELER, silent, hurt.\n\n\t\t\t\t\tTRACY\n\t\tFaster than a speeding turtle--\n\n\t\t\t\t\tBUTCH\n\t\tMore powerful than a deodorant--\n\n\t\t\t\t\tEDDIE JR.\n\t\tAble to eat twelve donuts in a single sitting--\n\n\t\t\t\t\tLENORE\n\t\tLook, snoring in his chair--\n\n\t\t\t\t\tEDDIE JR.\n\t\tSitting on the john--\n\n\t\t\t\t\tALL\n\t\tIt's... Supergut!\n\nThe kids all laugh (in that derisive way that kids do so well) as the \nShoveler dejectedly walks into the kitchen.\n\nINT.  KITCHEN - A MOMENT LATER\n\nThe Shoveler enters, dejected.  His wife, Lucille, is doing the dishes.  \nShe looks up, sees him.\n\n\t\t\t\t\tLUCILLE\n\t\t\t\t  (feels for him)\n\t\tRough night, Eddie?\n\nHe nods.\n\nEXT.  THE RAJA'S HOUSE - NIGHT - ESTABLISHING\n\nThe Raja's Datsun is parked in front of a neat as a pin little \nVictorian house.\n\nINT.  THE DINING ROOM - NIGHT\n\nThe room is dark.  Someone is sneaking around.  A drawer is quietly \nopened, and we hear the gentle clink of silver. Suddenly, the light \ngoes on and we see the Blue Raja, now dressed in a sport shirt and \nslacks, with his hand in the drawer.  His MOTHER, in her nightclothes, \nstands by the door where she has just switched on the light.\n\n\t\t\t\t\tMOTHER\n\t\tJeffrey!\n\n\t\t\t\t\tRAJA\n\t\tOh hi, Mom.\n\n\t\t\t\t\tMOTHER\n\t\tWhat are you doing in the silver drawer?\n\n\t\t\t\t\tRAJA\n\t\tLooking for... the TV Guide.\n\nShe just looks at him, very suspicious.\n\n\t\t\t\t\tMOTHER\n\t\tIt's on the television.\n\n\t\t\t\t\tRAJA\n\t\tOf course.  I'm such a fool... Thanks, Mummy.  \n\t\tGo to bed.\n\nHe kisses her and goes into the next room.  CAMERA HOLDS ON MOM; she \ndoesn't trust him.\n\nEXT.  HILLTOP - NIGHT - ANGLE ON\n\nA billboard overlooking the city.  Captain Amazing is posed wearing a \npair of bright blue Nikes.  The caption reads. \"It's a nice world.  \nSonebody's got to save it... The Nike Supershoe.  It's Amazing.\"\n\nFurious sits on his Harley, taking long hauls from a pint bottle of \ncheap bourbon and gazing up at the sign.\n\n\t\t\t\t\tFURIOUS\n\t\tAmazing?  What's so amazing about him?  I'd be \n\t\tamazing, too, if I'd inherited two hundred \n\t\tmillion bucks... or two bucks... or two \n\t\tcents...\n\t\t\t(hurls the empty bottle, smashing\n\t\t\t\tit against the sign)\n\t\tWho am I kidding?  Dreams don't come true.\n\nA moment of despondency, and then he hears a strange sound overhead and \nlooks up...\n\nHIS POV -\n\nas something suddenly flies across the star filled night sky above \nhim...\n\nIt is Captain Amazing, wearing a high tech rocket pack on his back...\n\n\n\t\t\t\t\tFURIOUS\n\t\tWhere's he going?\n\t\t\t(kicks his Harley started)\n\nSERIES OF SHOTS - WITH MUSIC\n\nas Furious, following Captain Amazing, rides roughshod down the steep \nhill, skidding onto a road and then speeding through a residential \narea...\n\nHe cuts onto some railroad tracks, hops his bike up on a rail, and \nrides smoothly along it, following Amazing... He turns off the tracks, \nrides roughly through some woods, then emerges from the trees and \nsees..\n\nA foreboding looking old mansion... Captain Amazing lands on the \nhighest part of its roof... Furious pulls up, gazes at the front gates \nof the mansion...\n\nHIS POV -\n\nLetters across the iron gates read... \"Frankenstein\".\n\nEXT.  ON THE ROOF - CONTINUOUS\n\nCaptain Amazing abandons his jet pack and moves across the old slate \nroof like Spiderman, leaping nimbly from gable to gable and walking \nalong a high ridge like a tight rope walker. Finally he approaches a \nskylight, looks down and sees...\n\nA huge old library with an iron catwalk running around it. Casanova \nFrankenstein sits in a club chair by a roaring tire. Anabel perches on \nthe arm of his chair.  In the other chair sits a once good looking, now \npaunchy guy, with a meticulously coiffed haircut.  He is TONY \nPOMPADOUR, head of the infamous Disco Boys.\n\n0N CAPTAIN AMAZING\n\n\t\t\t\t\tAMAZING\n\t\t\t\t(just as he suspected)\n\t\tUh-huh.\n\nHe sees that the skylight is open, and quietly lets himself in...\n\nINT.  THE LIBRARY - CONTINUOUS\n\nCasanova and Tony P savor glasses of brandy and puff on big cigars.\n\n\t\t\t\t\tCASANOVA\n\t\tI hope you enjoy these cigars.  I had to kill a \n\t\tdozen Cubans to get them.\n\n\t\t\t\t\tTONY P\n\t\tUmmm.\n\n\t\t\t\t\tCASANOVA\n\t\tHave you considered my offer?\n\n\t\t\t\t\tTONY P\n\t\tYou know, Mr. F, me and the boys always loved \n\t\tworkin' for you.  You had such style: the \n\t\tclothes, the dancin', the elegant way you'd \n\t\tsnuff a babe.  You were the King...\n\nCasanova accepts this graciously.\n\n\t\t\t\t\tTONY P\n\t\tBut times have changed, and you been in that \n\t\tbug house a long tine. I can see you still got \n\t\tthe style, but I dunno for sure you still got \n\t\tthe edge.\n\n\t\t\t\t\tCASANOVA\n\t\tI got it.\n\n\t\t\t\t\tTONY P\n\t\tWhat about Captain Amazing?\n\n\t\t\t\t\tAMAZING (O.S.)\n\t\tGood question.\n\nCasanova and Tony P look up and see Captain Amazing, posed noncalantly \non the iron catwalk, gazing down at them.  Tony P jumps out of his \nchair, scared.  But Casanova just smiles at his ancient rival, cool as \na cucumber.\n\n\t\t\t\t\tCASANOVA\n\t\tI knew you'd cone.  I left that skylight open \n\t\tfor you.\n\n\t\t\t\t\tAMAZING\n\t\tI know you did.\n\n\t\t\t\t\tCASANOVA\n\t\tI knew you'd know.\n\n\t\t\t\t\tAMAZING\n\t\tI know you knew I'd know.\n\n\t\t\t\t\tCASANOVA\n\t\tBut did you know I knew you'd know I'd know?\n\n\t\t\t\t\tAMAZING\n\t\tOf course.\n\nTony P makes a move for his pistol, but Captain Amazing instantly whips \nout his pistol, getting the drop on him.\n\n\t\t\t\t\tAMAZING\n\t\tI'd hate to waste a good bullet on a piece of \n\t\tscum like you, Tony.\n\nTony freezes.\n\n\t\t\t\t\tAMAZING\n\t\tThe jig is up, Casanova.  I've spent six months \n\t\twatching you, and know exactly what you're up \n\t\tto.\n\n\t\t\t\t\tCASANOVA\n\t\tReally?\n\n\t\t\t\t\tAMAZING\n\t\tI know that you're recruiting your old \n\t\thenchmen...\n\nNervous reaction from Tony P.\n\n\t\t\t\t\tAMAZING\n\t\tI know who your girlfriend really is...\n\nIcy reaction from Anabel.\n\n\t\t\t\t\tAMAZING\n\t\tAnd I know the terrible revenge that you plan \n\t\tto inflict on this city.\n\n\t\t\t\t\tCASANOVA\n\t\tI guess you know just about everything, don't \n\t\tyou, Lance?\n\n\t\t\t\t\tAMAZING\n\t\tUm-hmm.\n\n\t\t\t\t\tCASANOVA\n\t\tExcept for one little thing.\n\n\t\t\t\t\tAMAZING\n\t\t\t\t(supremely confident)\n\t\tAnd what's that?\n\n\t\t\t\t\tCASANOVA\n\t\tThat I've hot wired the city's entire power \n\t\tsupply through that catwalk.\n\n\t\t\t\t\tAMAZING\n\t\tWhat--?\n\nCasanova suddenly throws a secret breaker switch, and the ugly hum of a \nmillion volts instantly fills the room...\n\nEXT.  OUTSIDE THE HOUSE - CONTINUOUS - ON FURIOUS\n\nstill watching... as all the lights in the house go out, except for a \nfrightening orange glow in an upper room...\n\nOff in the distance Furious sees... the lights of the entire city \nflicker and then black out... A moment later the mansion, and the \ncity's lights return to normal... as Furious watches, not sure what to \nmake of this.\n\nEXT. STREET CONSTRUCTION SITE - DAY\n\nTraffic is snarled.  Horns are blasting.  Tempers are frayed.\n\nCLOSE ON A HAMMERING JACKHAMMER... CAMERA WIDENS TO REVEAL that it is \nbeing operated by the Shoveler, dressed in work clothes.  Wiped out \nfrom the night before, the vibrations of the hamer are lulling him off \nto sleep... He nods out... as his BOSS whacks him on the arm.\n\n\t\t\t\t\tBOSS\n\t\tYO! CAPTAIN SOMINEX!  Get your shut-eye at \n\t\thome, or you'll be a full time superhero!\n\nEXT.  THE RAJA'S HOUSE - DAY - ESTABLISHING\n\nINT.  THE RAJA'S ROOM - CONTINUOUS\n\nThe Raja lies sprawled on his bed, depressed, still in his pee jays, as \nhe watches... an ANTHONY ROBBINS infomercial ON THE TV.\n\n\t\t\t\t\tANTHONY\n\t\tIt's all within your power.  The only thing \n\t\tthat's in your way is YOU!\n\n\t\t\t\t\tRAJA\n\t\tEasy for you to say.\n\nEXT.  SALLY'S AUTO DEMOLITION - DAY - ESTABLISHING\n\nAn auto junkyard and demotion yard.\n\nEXT.  THE YARD - DAY\n\nA giant press mashes an old car... while nearby Mister Furious does the \njob by hand, demolishing an old Grand Prix with an iron bar.  He does \nit as easily as a normal guy would tear apart a corrugated box, ripping \noff the doors, then tearing off the bumpers and the hood and tossing \nthe pieces onto a big pile... His big boned, red faced boss SALLY is \ncalling out to him.\n\n\t\t\t\t\tSALLY\n\t\tHey, Roy!\n\nEXT.  THE BACK OF THE YARD - A MINUTE LATER\n\nIn a weedy overgrown far corner of the junkyard Sally and Furious stand \nlooking a big old hunk of a military vehicle. It is a Herkimer Battle \nJitney, a heavily armored, windowless, soundproof, personnel carrier \n(designed by the Pentagon in the fifties to take congressmen on \nbattlefield fact finding tours).  Overgrown with weeds, home to an \nextended family of pigeons, its fighting days (if it ever had any) are \nover.\n\n\t\t\t\t\tSALLY\n\t\tHow many times I gotta tell you about this?\n\n\t\t\t\t\tFURIOUS\n\t\tSally, that's a Herkimer Battle Jitney!  They \n\t\tdon't make 'em like that anymore.  It's a \n\t\tclassic!\n\n\t\t\t\t\tSALLY\n\t\tIt's a hunk of junk.  I want the iron.  Do it!\n\nShe walks away.  Furious growls.  He picks up his iron bar and is about \nto wedge it under the front bumper of the Herkimer...\n\nHIS POV -\n\nBut the big old headlights and the sad old grill seem to be looking at \nhint, imploring him for one last chance...\n\nAnd he just can't do it.  He throws away his iron bar and climbs inside \nthe cab of the Herkimer...\n\nIN THE CAB - CONTINUOUS\n\nFurious sits behind the wheel and tenderly touches its beat-up old \ndashboard, then turns on the radio, which, miraculously still works.  \nHe tunes in a local station, puts his feet up on the dash.\n\n\t\t\t\t\tRADIO ANNOUNCER\n\t\t...and continues to deny any knowledge of the \n\t\tincident... In local news, millionaire Lance \n\t\tHunt has apparently disappeared...\n\nON FURIOUS, taking immediate notice.\n\n\t\t\t\t\tRADIO ANNOUNCER\n\t\tMembers at his household told police that the \n\t\tplayboy philanthropist failed to return home \n\t\tlast night after \"going out for a walk\".  \n\t\tPolice say they have no reason yet to suspect \n\t\tfoul play, but a search is under way...\n\nINT.  THE DINER - NIGHT\n\nFurious, the Shoveler, and the Raja all sit at their booth.\n\n\t\t\t\t\tFURIOUS\n\t\tI saw him go in--and he didn't come out!\n\t\n\t\t\t\t\tRAJA\n\t\tBut we don't know for sure it's the same guy.\n\nFurious groans.\n\n\t\t\t\t\tSHOVELER\n\t\tHey, look.\n\nON THE TV -\n\nCasanova is being interviewed by DON STOUFFER, the local Mike Wallace.\n\n\t\t\t\t\tCASANOVA\n\t\tWell, Don, I've done some terrible things in my \n\t\tlife, but now I'm cured, and I just want to \n\t\tgive back something to my old home town... \n\t\tThat's why I'm using what's left of my fortune \n\t\tto build...\n\nCLOSE ON A MODEL of a huge concrete bunker-like institutional structure \n(i.e.  the Getty)\n\n\t\t\t\t\tCASANOVA (O.S.)\n\t\tThe Frankenstein Center for the Arts.\n\n\t\t\t\t\tDON\n\t\tYou've changed, haven't you?\n\n\t\tCASANOVA\n\t\tOh yes.\n\nBACK ON FURIOUS, RAJA, and SHOVELER - \n\n\t\t\t\t\tFURIOUS\n\t\tNo he hasn't.\n\nEXT.  FRANKENSTEIN MANSION - NIGHT - ANGLE ON\n\nthe wall of the estate... as our heroes' three heads rise up over  \nit... and survey the grounds.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(about to climb over)\n\t\tLet's go.\n\n\t\t\t\t\tRAJA\n\t\t\t(in a whisper, holding him back)\n\t\tWait!... Look!\n\nTHEIR POV -\n\nA group of men are hanging around the door to the house, smoking, \nchatting, and laughing.  A CLOSER ANGLE REVEALS that they are all \ndressed in the height (or depths) of seventies disco fashion.  One of \nthem is showing off some steps.\n\nOur heroes fall back behind the safety of the wall and confer.\n\n\n\t\t\t\t\tRAJA\n\t\tThis is bad.\n\n\t\t\t\t\tSHOVELER\n\t\tWho are they?\n\n\t\t\t\t\tRAJA\n\t\tThe Disco Boys.\n\n\n\t\t\t\t\tFURIOUS\n\t\tThe who?\n\n\t\t\t\t\tRAJA\n\t\tThe most vicious gang of thugs this city ever \n\t\tproduced.  Twenty years ago they were \n\t\tCasanova's personal bodyguard.  But after he \n\t\twas busted they crawled into the woodwork.\n\n\t\t\t\t\tFURIOUS\n\t\tWell they've crawled back out.\n\n\t\t\t\t\tSHOVELER\n\t\tWe may be getting in over our heads here.\n\n\t\t\t\t\tRAJA\n\t\tThis looks like a job for Superman--\n\n\t\t\t\t\tSHOVELER\n\t\tOr Batman--\n\n\t\t\t\t\tRAJA\n\t\tOr both.\n\n\t\t\t\t\tFURIOUS\n\t\tDon't you guys get it?  If Captain Amazing is \n\t\tstill in there, we can rescue him--and get on \n\t\tTV!\n\t\t\t   (goes right over the wall)\n\nThey share an exasperated look, then scramble over the wall after him.\n\nINT.  CASANOVA'S BEDROOM - CONTINUOUS\n\nCasanova and Dr. Anabel Leek are preparing for bed.  Anabel sits in \nfront of a huge mirror, brushing her long hair as Casanova moves up \nbehind her and puts his hands around her throat, massaging, squeezing, \njust barely resisting the temptation to strangle her.  (She loves it).\n\n\t\t\t\t\tCASANOVA\n\t\tEverything's going exactly as we planned.\n\n\t\t\t\t\tANABEL\n\t\t\t(puts the sharp point of her\n\t\t\tcomb handle under his chin)\n\t\tNot quite.  You haven't announced our \n\t\tengagement yet.\n\n\t\t\t\t\tCASANOVA\n\t\tIt must have slipped my mind.\n\n\t\t\t\t\tANABEL\n\t\tYour mind is so slippery.\n\n\t\t\t\t\tCASANOVA\n\t\tDon't worry, Pootchkie.  My womanizing days are \n\t\tover.  You're my Lady Macbeth, my Imelda... my \n\t\tNicole.\n\t\t\t\t(pulls her into his arms)\n\t\tWe're such an incredible team.  Who could \n\t\tpossibly stop us?\n\t\t(kisses her)\n\nCUT RIGHT TO:\n\nEXT.  THE LAWN - CONTINUOUS - ON OUR THREE HEROES\n\nas they crunch their way non too stealthily across the backyard.\n\n\t\t\t\t\tRAJA\n\t\tDon't crunch the leaves.\n\n\t\t\t\t\tSHOVELER\n\t\tSorry.\n\n\t\t\t\t\tRAJA\n\t\tBe a Mohican.\n\t    \t\t   (bumps into a lawn chair)\n\n\t\t\t\t\tFURIOUS\n\t\tWait.\n\t\t\t\t(They all stop.)\n\t\tI hear something.\n\nThey all listen; there is a low rushing sound... It is the sound of \nwater rushing through pipes.  Suddenly, the lawn sprinklers all pop \nup... and our heroes get drenched.  They duck off the lawn, behind the \ncover of a large tree.\n\n\t\t\t\t\tRAJA\n\t\tI'm soaked.\n\t\t\t\t    (sneezes)\n\t\tOh great.\n\n\t\t\t\t\tFURIOUS\n\t\tShhh.\n\n\t\t\t\t\tSHOVELER\n\t\tBe a Mohican. \n\n\t\t\t\t\tRAJA\n\t\tShut up.\n\nFurious sees a pair of French doors, off a small patio.  One of the \ndoors is slightiy open.\n\n\t\t\t\t\tFURIOUS\n\t\tCome on.\n\nThey start sneaking toward it, but as they cross the patio... they trip \nthe automatic security lighting, and suddenly find themselves bathed in \nlight.\n\n\t\t\t\t\tRAJA\n\t\tUh-oh.\n\nAs our heroes look around as a dozen Disco Boys, armed with pipes, \nchains, brass knuckles, step into the light and encircle them... The \nFrench doors open and Tony P steps out.\n\n\t\t\t\t\tRAJA\n\t\tOh I'm sorry.  We must have the wrong house.\n\n\t\t\t\t\tTONY P\n\t\tYou sure do.\n\nThe Disco Boys attack.  The Raja is instantly clubbed down. The \nShoveler deflects only a blow or two with his shovel before he goes \ndown, too... These guys are not the Red Eyes.\n\nOnly Furious holds his own.  He grabs a pipe away from one of them and \nswings fiercely, keeping the others off.  Suddenly, the Disco Boys pull \nback.  Furious doesn't know why, until he turns and sees...\n\nCasanova, standing right behind him, smiling.\n\n\t\t\t\t\tCASANOVA\n\t\tHi there.\n\nWith a cat-like move Casanova slashes his gold chain viciously--and \nrepeatedly--across Furious' face.  Furious, stunned with pain, lunges \nat Casanova, who neatly steps aside, then catches him with a fast \ncombination of spinning disco kicks.  Finally he lassos the chain \naround Furious' neck, and pulls it tight, strangling him.\n\nON THE DISCO BOYS, watching, snapping their fingers with admiration...\n\nCasanova releases Furious, who slumps to the ground.  Casanova steps \naway, and the Disco Boys gather around Furious and kick him \nviciously... as Casanova and Tony P watch, amused, chuckling.\n\n\t\t\t\t\tCASANOVA\n\t\tSuperheroes.\n\n\t\t\t\t\tTONY P\n\t\tShould I kill them?\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t(completely disdainful)\n\t\tWhy bother?\n\nEXT.  JUST OUTSIDE THE MANSION - A MOMENT LATER\n\nThe Disco Boys drag our heroes through the gate and throw them like \nbags of garbage into the street... where thay lie in a moaning, \nagonized, semi-conscious heap.\n\nINT.  THE DINER - LATER - CLOSE ON\n\nFurious, rubbing his neck; a thin red mark runs around it. The three of \nthem are sitting at their usual table, in very bad shape, moaning and \ngroaning... Monica approaches.  She's made them ice packs and cold \ncompresses.\n\n\t\t\t\t\tMONICA\n\t\tHere you go.\n\t\t\t(sits with them, applies a compress\n\t\t\t\tto the Raja's head)\n\n\t\t\t\t\tRAJA\n\t\tOw.\n\n\t\t\t\t\tMONICA\n\t\tMaybe you guys ought to forget this Superhero \n\t\tstuff and join Kiwanis or something.\n\nA FUSSY CUSTOMER is calling out from another table.\n\n\t\t\t\t\tFUSSY CUSTORER\n\t\tMiss!\n\nShe moves off.\n\n\t\t\t\t\tRAJA\n\t\tMaybe she's right.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(still furious)\n\t\tAre you serious? This is the break we've been \n\t\twaiting for!\n\n\t\t\t\t\tSHOVELER\n\t\tWhat are you talking about?\n\n\t\t\t\t\tFURIOUS\n\t\tWhat have the famous superheroes got that we \n\t\tdon't?\n\n\t\t\t\t\tRAJA\n\t\tAgents?\n\n\t\t\t\t\tFURIOUS\n\t\tArchenemies!  Casanova isn't just a criminal--\n\t\the's a supervillain. Stopping him could be our \n\t\tticket to fame, fortune--and babes!\n\n\t\t\t\t\tSHOVELER\n\t\tAnd it would be the right thing to do.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t   (dismissively)\n\t\tYeah yeah--and that, too.\n\n\t\t\t\t\tRAJA\n\t\tBut there's only three of us, and he's got the \n\t\tentire brotherhood of evil at his disposal.\n\n\t\t\t\t\tFURIOUS\n\t\tThen maybe it's time for us to form our own \n\t\tbrotherhood...\n\t\t\t\t\t(more)\n\t\n\t\t\t\t\tFURIOUS (Cont'd)\n\t\ta brotherhood of righteous, crime fighting, \n\t\tskull cracking, Disco Boy bashing, warriors of \n\t\tthe night!\n\n\t\t\t\t\tSHOVELER\n\t\tI'm liking this.\n\n\t\t\t\t\tFURIOUS\n\t\tI say we send out the word--and summon all of \n\t\tthe unsung superheroes we know!\n\n\t\t\t\t\tRAJA\n\t\t\t\t(after a moment)\n\t\tYeah, but... who do we know?\n\nThey take a long moment to ponder this.\n\n\t\t\t\t\tFURIOUS\n\t\tWell... there's the Spleen.\n\nShoveler and Raja make disgusted noises.\n\n\t\t\t\t\tRAJA\n\t\tDo we have to?\n\n\t\t\t\t\tSHOVELER\n\t\tI got this cousin.  He's a real doofus, but he \n\t\tclaims he can become invisible.\n\n\t\t\t\t\tFURIOUS\n\t\tHave you ever seen him?\n\n\t\t\t\t\tSHOVELER\n\t\tHow could I see him if he's invisible?\n\n\t\t\t\t\tFURIOUS \n\t\tGood point.\n\n\t\t\t\t\tRAJA\n\t\tAnd there's the Sphinx.\n\n\t\t\t\t\tSHOVELER\n\t\tThe who?\n\n\t\t\t\t\tRAJA\n\t\tHe's a legendary masked Mexican crime fighting \n\t\tsuperwrestler and master of the machete.\n\n\t\t\t\t\tFURIOUS\n\t\tSounds good.\n\n\t\t\t\t\tRAJA\n\t\tNo one's sure that he actually exists, but they \n\t\tsay he can be contacted by leaving a message on \n\t\ta crumpled up napkin at the Tacky Taco down by \n\t\tthe bus station.\n\n\t\t\t\t\tSHOVELER\n\t\tGet outta here.\n\nEXT.  TACKY TACO - DAY - ESTABLISHING\n\nA funky Mexican restaurant by the bus station.\n\nINT.  THE RESTAURANT - CONTINUOUS\n\nOur heroes, in normal clothing, have just finished a taco lunch.  \nFurious is writing a mssage on a napkin with a ballpoint pen.\n\n\t\t\t\t\tFURIOUS\n\t\tYou sure that's how you spell it?\n\n\t\t\t\t\tSHOVELER\n\t\tYeah.\n\nCLOSE ON THE NOTE -\n\nwhich reads \"Spinks, we need you.\"\n\nThey crumple up the napkin and leave the restaurant... A moment later a \nshy looking MEXICAN MAN busses their tray... but in A CLOSE ANGLE we \nsee him secretly pocket the napkin.\n\nEXT. HOUSE - DAY - ESTABLISHING\n\nA little brick house.\n\nINT.  INVISIBLE BOY'S ROOM - DAY\n\nA teenage boy's room, decorated to the max with models and posters of \nthe great superheroes: Batman, Spiderman, Captain Amazing, etc.  \nINVISIBLE BOY, about fifteen, is being interviewed by the Raja, Mister \nFurious, and the Shoveler.\n\n\t\t\t\t\tFURIOUS\n\t\tSo, let me get this straight.  You have the \n\t\tpower to become invisible.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tYes.\n\n\t\t\t\t\tRAJA\n\t\tBut... only when no one is looking.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tYes.\n\n\t\t\t\t\tFURIOUS\n\t\tIf someone looks at you, you immediately become \n\t\tvisible again.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tYes.\n\n\t\t\t\t\tRAJA\n\t\tSo you're only invisible... to yourself?\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tNo.\n\n\t\t\t\t\tOUR HEROES\n\t\t\t\t\t(hopefully)\n\t\tNo?\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tIf I look at myseif, I become visible.\n\n\t\t\t\t\tRAJA\n\t\tSo you're only invisible, when abuolutely no \n\t\tone is looking at you?\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tYes.\n\n\t\t\t\t\tFURIOUS\n\t\tSo how do you know that you've ever been \n\t\tinvisible?\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tI just know.\n\nOur heroes are less than impressed.\n\n\t\t\t\t\tFURIOUS\n\t\tLook, kid, we've got a lot of heroes to \n\t\tinterview--\n\n\t\t\t\t\tINVISIBLE BOY\n\t\t\t\t\t(desperate)\n\t\tI know I haven't got it entirely worked out \n\t\tyet, but I've always dreamed of becoming a \n\t\tsuperhero... Weren't you guys ever a kid? \n\t\tDidn't you ever need someone to just give you a \n\t\tchance?\n\nON OUR HEROES, looking around the room... and softening up.\n\nINT.  THE DINER - NIGHT\n\nOur heroes sit at their usual table along with Invisible Boy and a \nweird looking guy in a greasy, stained yellow superhero outfit.  Across \nhis chest in falling off stick on letters it reads \"THE SPLEEN\", and \nthat's exactly who he is.  Furious, the Raja, and Shoveler sit as far \naway from him as possible. He is a totally noxious, hyperactive \nperson... and he is thrilled to be there.\n\n\t\t\t\t\tSPLEEN\n\t\tBoy I can't tell you how thrilled I was when \n\t\tyou guys called--You gonna eat that pickle?\n\t\t\t\t   (sucks it in)\n\t\tI've always dreamed of being a member of the a \n\t\treal superhero team--and to have friends--real \n\t\tfriends--I mean guys I could live with--sleep \n\t\twith--die with--eat with...\n\nHe puts the mustard dispenser to his lips and squeezes it straight into \nhis mouth.\n\n\t\t\t\t\tSPLEEN\n\t\tI love mustard.\n\nFurious, Raja, and the Shoveler react; they can't believe they've \nactually invited this guy to join their group.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tSo what exactly is your superpower?\n\n\t\t\t\t\tSPLEEN\n\t\tWell, when I was a kid I grew up on Love Canal-\n\t\t-remember that?--and my brothers and I used to \n\t\tgo swimming in it--make Kool-Aid out of it--\n\t\tstuff like that.  Anyway my brothers all died, \n\t\tbut I lived, and I grew all these like weird \n\t\torgans that have never been seen in humans \n\t\tbefore.  So now I can do things like this!\n\nHe leans over the table and lets just a little tiny drop of spittle \ndribble onto the table...\n\nCLOSE ON THE TABLE -\n\nas the spittle burns a hole in the Formica.\n\n\t\t\t\t\tSPLEEN\n\t\tCool, huh?\n\nThe Spleen inadvertently gives the tiniest little burp, and our three \nheroes duck out of the way or under the table.\n\n\t\t\t\tFURIOUS, RAJA, & SHOVELER\n\t\tWatch it!... Look out!... Whoa!\n\nThe people in the next booth give a cry of revulsion, put their hands \nto their mouths, and immediately leave.\n\n\t\t\t\t\tSPLEEN\n\t\tSorry, sorry.\n\n\t\t\t\t\tSHOVELER\n\t\tHey, why don't you just put a cork in it?\n\n\t\t\t\t\tSPLEEN\n\t\tI tried that once.  The cork melted.\n\nTHE SAME - AFTER DINNER\n\nOur heroes mull their situation over coffee.  Monica freshens their \ncups.  The Spleen squirts mustard in his coffee.\n\n\t\t\t\t\tSHOVELER\n\t\tThere's just not enough of us.\n\n\t\t\t\t\tFURIOUS\n\t\tBut we know they're out there. Hundreds--maybe \n\t\tthousands of lonely, unknown superheroes, who \n\t\tdesperately need a cause...\n\n\t\t\t\t\tRAJA\n\t\tAnd a social life.\n\n\t\t\t\t\tSHOVELER\n\t\tYeah, but how do we get to them?\n\n\t\t\t\t\tSPLEEN\n\t\tObscene phone calls?\n\nThey ignore that suggestion.\n\n\t\t\t\t\tMONICA\n\t\tWhy don't you throw a barbecue?\n\t\t\t(moves off to another table)\n\nON OUR HEROES, realizing that's it.\n\nINT.  INVISIBLE BOY'S ROOM - NIGHT - WITH MUSIC\n\nInvisible Boy sits at the desk in his room, writing immaculate little \nnotes on small file cards.  (He's made a whole pile of them.)\n\nCLOSE ON THE NOTE -\n\nwhich reads \"Got superpowers?  Want to fight evil?  Then JOIN US and \nlet's PARTY HEARTY!  Beer!  Burgers!  Babes!\"\n\nSERIES OF SHOTS - MUSIC CONTINUES\n\nas our heroes post these notes all over the city, in places where \nlonely superheroes night find them...\n\nThe Raja posts a note on the door of a comic book store...\n\nThe Shoveler posts a note on the bulletin board at a bowling alley...\n\nMr. Furious tapes the note to the cracked glass of a vandalized phone \nbooth...\n\nAt an abandoned drive-in movie theater... Invisible Boy walks through \nthe empty lot, taping a note to each of the old speaker posts...\n\nA White Castle hamburger joint... Inside the pay toilet Spleen is \nscratching something on the wall with a nail. He stops and admires his \nhandiwork, and we see that he has engraved the entire message on the \nwall...\n\nEND MUSIC.\n\nEXT.  SHOVELER'S BACKYARD - DAY\n\nA small, typical working class backyard.  A round, aluminum above \nground pool.  A Weber grill with burgers on it. Unopened packages of \nhamburger rolls.  An old Vic Damon record plays on a boom box.  The \nSpleen floats around on a rubber raft in the pool.\n\n\t\t\t\t\tSPLEEN\n\t\tCome on in!  The water's great!\n\nIn fact, the water is turning a yellowish green... The rest of our \nheroes sit around on cheap folding chairs.  No superheroes have shown \nup.  The Shoveler, at the grill, serves burgers to his kids, who stand \nin line waiting for them.\n\n\t\t\t\t\tBUTCH\n\t\t\t\t(heavy on the sarcasm)\n\t\tGreat picnic, Dad.\n\n\t\t\t\t\tEDDIE JR.\n\t\tBig turnout.\n\n\t\t\t\t\tROLAND\n\t\tAre these guys real superheroes?\n\n\t\t\t\t\tLENORE\n\t\tThey think so.\n\nThe kids scoff...  A moment later they head back to the house with \ntheir burgers.\n\n\t\t\t\t\tROLAND\n\t\tBut where's Captain Amazing?\n\n\t\t\t\t\tEDDIE JR.\n\t\tHe wouldn't be caught dead here.\n\nThey go into the house.  No one says anything.  The Shoveler just \nstares at the burgers on the grill.  Vic Damon sings. Furious chugs his \nbeer; he's working himself into a really morose mood.\n\nON THE SPLEEN, munching on a chlorine tablet.\n\n\t\t\t\t\tSPLEEN\n\t\tHey, these pool mints are delicious!\n\nRaja looks at his watch.\n\n\t\t\t\t\tRAJA\n\t\tMaybe there was traffic.\n\n\t\t\t\t\tFURIOUS\n\t\tWho are we kidding?  No one's gonna show.  \n\t\tWe're living in a fantasy!\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tCome on, guys--we're fighting against evil.\n\n\t\t\t\t\tFURIOUS\n\t\tGood or evil, what's the difference?\n\n\t\t\t\t\tSHOVELER\n\t\tThere's a big difference.\n\n\t\t\t\t\tFURIOUS\n\t\tI used to believe that.  Now I'm not so sure.\n\n\t\t\t\t\tRAJA\n\t\tRoy, remember, it is all within your power.  \n\t\tThe only thing that's in your way... is you.\n\n\t\t\t\t\tFURIOUS\n\t\tOh shut up.\n\nSuddenly, there is a knock at the gate.  Everyone immediately perks up.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tThey're here!\n\nA moment later they open the gate and see... HALF A DOZEN BURLY GUYS \nwearing various superhero outfits.\n\n\t\t\t\t\tTHEIR LEADER\n\t\tHey, man, is this the superhero wingding?\n\n\t\t\t\t\tRAJA\n\t\tThis is it.  Come on in!\n\n\t\t\t\t\tSUPERHEROES\n\t\tAll right!  Party!  (Etc.)\n\nAt first glance these guys seem promising... but their outfits are \ndecidedly improvised: weird goggles and sunglasses, shower curtain \ncapes, baseball caps with beer cans on them.  Their leader holds a \nsqueegee with a long handle... Furious is suspicious.\n\n\t\t\t\t\tRAJA\n\t\tI am the Blue Raja, Master of Silverware.\n\n\t\t\t\t\tTHEIR LEADER\n\t\tI am Squeegee Man, and these are my compadres, \n\t\tthe Invincible Dudes!\n\nThe Invincible Dudes spot the keg.\n\n\t\t\t\t\tINVINCIBLE DUDES\n\t\tWhoa!  Brews!  Party!  (Etc.)\n\nThey go immediately to the keg and start filling beer cups and guzzling \nthem down.  The Raja tries to hand out some forms.\n\n\t\t\t\t\tRAJA\n\t\tWould you mind filling out these forms; names, \n\t\taddresses, description of superpowers, that \n\t\tsort of thing.\n\n\t\t\t\t\tINVINCIBLE DUDES\n\t\tSure, dude.  No problem.  (Etc.)\n\t\t\t(but they just toss the forms away)\n\nON FURIOUS, watching, starting to get pissed off.\n\n\t\t\t\t\tINVINCIBLE DUDE 1\n\t\tHey, man, like where are the babes?\n\n\t\t\t\t\tINVINCIBLE DUDE 2\n\t\tIt said on the card there'd be babes!\n\n\t\t\t\t\tRAJA\n\t\tActually we lied about the babes, but there's \n\t\tplenty of burgers.\n\n\t\t\t\t\tINVINCIBLE DUDES\n\t\tThat's false advertising!... We came all the \n\t\tway from South Champion, man!  We coulda gone \n\t\tplinking!... We coulda gone bunqee jumping!\n\n\t\t\t\t\tSQUEEGEE MAN\n\t\tNo babes.  No peace.\n\n\t\t\t\t\tINVISIBLE DUDES (chanting)\n\t\tNo babes--no peace!  No babes--no peace!  No \n\t\tbabes--no peace!\n\n\t\t\t\t\tSQUEEGEE MAN\n\t\tLet's trash the place!\n\n\t\t\t\t\tINVINCIBLE DUDES\n\t\tYeah!\n\nFurious, fed up, confronts Squeegee Man.\n\n\t\t\t\t\tFURIOUS\n\t\tIf you're a superhero, what's your power?\n\n\t\t\t\t\tSQUEEGEE MAN\n\t\tI am Squeegee Man.\n\t\t\t(holding it out threateningly)\n\t\tTouch my squeegee... and you die.\n\nThe Invincible Dudes are cracking up.\n\n\t\t\t\t\tFURIOUS\n\t\tCan you fly?\n\n\t\t\t\t\tSQUEEGEE MAN\n\t\tNo.\n\n\t\t\t\t\tFURIOUS\n\t\tWanna bet?\n\nEXT.  JUST OUTSIDE THE YARD - CONTINUOUS\n\nas Squeegee Man comes flying--and screaming--over the fence, landing \nnone too gracefully in the front yard.\n\nA beat and his squeegee come flying out after him.  Another beat and \nthe Invincible Dudes come running out the gate in a panic.\n\n\t\t\t\t\tINVINCIBLE DUDES\n\t\tLet's get out of here!... That dude's crazy!\n\nThey take off down the street, running right past a woman, carrying a \nbowling ball bag and dressed in a faded, threadbare old rayon superhero \ncostume with a decidedly fifties flavor. She is THE BOWLER.\n\nEXT.  SHOVELER'S BACKYARD - A MOMENT LATER\n\nOur heroes sit around the patio, dejected, miserable.\n\n\t\t\t\t\tBOWLER (O.S.)\n\t\tWho died?\n\nThey look up, see her standing there, and aren't quite sure what to \nmake of her.\n\n\t\t\t\t\tRAJA\n\t\tWho are you?\n\n\t\t\t\t\tBOWLER\n\t\tI'm the Bowler.\n\n\t\t\t\t\tSHOVELER\n\t\tThe Bowler?  I remember him from when I was a\n\t\tkid.  He was killed years ago.\n\n\t\t\t\t\tBOWLER\n\t\tI'm his daughter.\n\nOur heroes share a look.\n\n\t\t\t\t\tSHOVELER\n\t\tLook, honey, being a superhero... it's a\n\t\tguy thing.\n\n\t\t\t\t\tBOWLER\n\t\tReally?\n\nShe takes her bowling ball and spins it on the tip of her finger (like \na Harlem Globetrotter).  For a long moment she just looks at them, \nsmiling.\n\nON THE OTHERS watching, almost mesmerized by the spinning ball...\n\nSuddenly, she gives an ear splitting battle cry and starts swinging the \nball around her in wide ferocious arcs, like a cannibal with a war \nclub--or a twirler on meth, going so fast she almost becomes a blur...\n\nThen, just as suddenly, she stops, aims and rolls her ball... It shoots \nstraight through Invisible Boy's legs...\n\nON A NEATLY PLACED COLLECTION OF PLASTER LAWN DWARVES -\n\nas the ball smashes into then, pulverizing them... It goes into a \nreverse spin, passes through Invisible Boy's legs again, and returns to \nthe Bowler who is holding its bag open for it... The ball rolls in.\n\n\t\t\t\t\tBOWLER\n\t\tGood ball.\n\nON OUR HEROES, left absolutely speechless.\n\n\t\t\t\t\tBOWLER\n\t\tIf it could zip up its own bag, then you'd be \n\t\timpressed, right?\n\nShe turns and walks out.  Our heroes share an amazed look, then run \nafter her...\n\nJUST OUTSIDE THE GATE - ON THE BOWLER\n\nwalking away... as Furious catches up with her.\n\n\t\t\t\t\tFURIOUS\n\t\tHey... Can I buy you a beer?\n\n\t\t\t\t\tBOWLER\n\t\tI thought you'd never ask.\n\nShe takes his arm and they all start to walk back into the Shoveler's \nbackyard... but the CAMERA PANS ACROSS THE STREET to the dark place \nbetween two houses, where a MAN WEARING A STRANGE STEEL MASK with a \nfrightening, impassively powerful expression stands in the deep \nshadows, watching them in motionless, predatory silence.  We do not \nknow who he is, and we cannot tell if he is good or evil.\n\nBACK AT THE BARBECUE - A LITTLE LATER - CLOSE ON\n\nA FADED OLD SNAPSHOT of the original \"The Bowler\" holding a little girl \nin his arms.\n\n\t\t\t\t\tBOWLER (O.S.)\n\t\tHe was more than just a superhero...  He was my \n\t\tfather...\n\nThe others, touched by this, have gathered around the Bowler, who is \nholding the old snapshot in her hand.\n\n\t\t\t\t\tBOWLER\n\t\tAnd then one day, he didn't come home.  The \n\t\tpolice said it was an accident.  But cargo \n\t\tcontainers don't just fall on people.  He was \n\t\tmurdered... After that I fell apart.  I dropped \n\t\tout of school, became a mud wrestler, married \n\t\tand divorced a jerk.  When my mother died I hit \n\t\tbottom... but then, when I was cleaning out her \n\t\tattic, I found my father's old bowling bag and \n\t\tcostume, almost like he'd left them there for \n\t\tme... and I knew what I had to do.\n\n\t\t\t\t\tSHOVELER\n\t\tSo who killed him?\n\t\n\t\t\t\t\tBOWLER\n\t\tThe Disco Boys.\n\n\t\t\t\t\tFURIOUS\n\t\tYou know something? Those guys are really \n\t\tstarting TO PISS ME OFF!\n\n\t\t\t\t\tSHOVELER\n\t\tBut there's still only six of us.\n\n\t\t\t\t\tFURIOUS\n\t\tSO WHAT?\n\n\t\t\t\t\tBOWLER\n\t\tThat's two more than the Fantastic Four.\n\n\t\t\t\t\tFURIOUS\n\t\tHalf a Dirty Dozen!\n\n\t\t\t\t\tSPLEEN\n\t\tTwice the Three Stooges!\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tAnd only one short of the Magnificent Seven.\n\n\t\t\t\t\tRAJA\n\t\tAnd you can't count Horst Buckholtz anyway.\n\n\t\t\t\t\tBOWLER\n\t\tHe was cute though.\n\n\t\t\t\t\tRAJA\n\t\tBut they all had one thing we haven't got.\n\n\t\t\t\t\tSPLEEN\n\t\tGirlfriends?\n\n\t\t\t\t\tRAJA\n\t\tA name.  All the great superhero teams have got \n\t\ta fabulous name.\n\nThey all think about it for a moment.  You can almost smell their \nbrains overheating.\n\n\t\t\t\t\tBOWLER\n\t\tHow about... the Savage Six?\n\n\t\t\t\t\tRAJA\n\t\tThe Inscrutable Six?\n\n\t\t\t\t\tSPLEEN\n\t\tThe Six Pistols?\n\n\t\t\t\t\tSHOVELER\n\t\tThe Exterminators!\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tThe Obliterators!\n\n\t\t\t\t\tRAJA\n\t\tThe Eradicators!\n\n\t\t\t\t\tBOWLER\n\t\tThe Emasculators!\n\n\t\t\t\t\tSPLEEN\n\t\tWait--I got it!... The Spleen Team.\n\nHe gets beaned by a couple of empty soda cans.\n\n\t\t\t\t\tFURIOUS\n\t\tTo hell with a name.  Let's get to work.\n\nMUSIC UP as Furious stands and starts out.  The others stand and follow \nhim... as our heroes form up for their first HEROIC GROUP SHOT.\n\nEXT.  CITY STREET - NIGHT\n\nMUSIC CONTINUES as A LITTLE OLD LADY crosses the street, when suddenly \nshe looks up and sees a pair of headlights coming on fast.  An \nimmaculately maintained seventies limo is heading straight for her.\n\nINSIDE THE LIMO - CONTINUOUS\n\nDisco Boys sit in the front.  Casanova, Anabel, and Tony P sit in the \nback, dressed for a night on the town...\n\nThere is a thud as the limo hits the old lady, and everyone in the car \nexplodes into laughter.\n\n\t\t\t\t\tTONY P\n\t\tLittle old lady.  That's a hundred points!\n\nINSIDE/OUTSIDE THE LIMO - A FEW MINUTES LATER\n\nas the limo drives past a billboard with an ad for \"MILK\" with a milk \nmustached Captain Amazing looking at the camera...\n\n\t\t\t\t\tTONY P\n\t\tHe knows your every move.\n\nTony P imitates a massive electrical convulsion, and the villains crack \nup.\n\nBut as they pass the billboard, a pair of headlights illuminate in its \nshadows, and the Shoveler's Ford Esquire pulls out and follows.\n\nINSIDE THE ESQUIRE - CONTINUOUS\n\nThe Shoveler is driving.  Mister Furious sits in the front seat next to \nhim, and our other heroes are packed into the back.\n\n\t\t\t\t\tFURIOUS\n\t\tLet's say hello.\n\nINSIDE/OUTSIDE THE TWO CARS - CONTINUOUS\n\nAs the limo stops at a traffic light... and the Esquire pulls up \nalongside it.  For a moment good and evil stare each other down.\n\n\t\t\t\t\tTONY P\n\t\tNot these guys again!\n\nThe Disco Boys howl with laughter.\n\n\t\t\t\t\tCASANOVA\n\t\tNice car.\n\nThe D Boys laugh.  Furious stares at Casanova, and Casanova stares \nright back at him, as cool as a snake.\n\n\t\t\t\t\tFURIOUS\n\t\tWhat did you do with Captain Amazing?\n\n\t\t\t\t\tCASANOVA\n\t\tCaptain who?\n\n\t\t\t\t\tTONY P\n\t\t\t\t(spots the Bowler)\n\t\tHey, in the backseat, who are you supposed to \n\t\tbe, the Bowler?\n\n\t\t\t\t\tBOWLER\n\t\tI'm his daughter.\n\n\t\t\t\t\tTONY P\n\t\tHis daughter?  Well guess what, sweetheart?  \n\t\tI'm the one who squished your Daddy.  And he \n\t\tsquished real good!\n\nThe villains laugh, and Mister Furious EXPLODES INTO RAGE.  He swings \nopen his car door, mashing it into the limo and leaving a big dent.\n\n\t\t\t\t\tTONY P\n\t\tHEY!\n\n\t\t\t\t\tFURIOUS\n\t\t'SCUSE ME!\n\nHe starts punching the limo like it's a punching bag--putting big dents \nin it.\n\n\t\t\t\t\tTONY\n\t\tWaste him!\n\nTony and the boys all reach into their coats for their pistols--but as \nthey yank them out, the Spleen sticks his head out of the station \nwagon, puts his face right up to the open window of the limo and lets \nloose with a TREMENDOUS BELCH...\n\nAs the villains choke and gag in the noxious fumes, Mister Furious goes \non a DEMOLITION RAMPAGE, working his way around the limo, punching big \ndents with his fists, breaking the windows with his head, flattening \nthe tires by kicking them, knocking off the rear view mirror with the \nback of his hand...\n\nThen he leaps up on top of the limo...\n\nWhile inside the villains gasp for air as big dents are stomped into \nthe roof above them...\n\nANGLE THROUGH THE WINDSHEILD as Furious leaps down onto the hood, and \ngazes in at them.\n\n\t\t\t\t\tFURIOUS\n\t\tShall I check your oil?\n\nHe plunges his hand through the metal of the hood, pulls out the car's \ndip stick, and checks it.\n\n\t\t\t\t\tFURIOUS\n\t\tLooks fine.\n\nHe tosses the dip stick away, then leaps off JUST AS Tony P gets off a \nshot, EXPLODING the windshield of the limo.\n\nFurious lands safely on the hood of the station wagon.  As the Shoveler \nthrows the Esquire into gear, Furious shouts...\n\n\t\t\t\t\tFURIOUS\n\t\tNICE CAR!\n\nAnd our heroes streak off into the night... Casanova and the others \nstagger out of the demolished limo, sucking in the clean air.\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t(impressed by Furious)\n\t\tThat boy's got talent.\n\n\t\t\t\t\tTONY P\n\t\tAnd I'm gonna nip it in the bud.\n\nANGLE ON A DARKENED ALLEY -\n\nwhere the man in the strange steel mask can be seen... watching.\n\nEXT.  A BAR - LATER THAT NIGHT - ESTABLISHING\n\nA very typical, nondescript neighborhood place...\n\nINSIDE THE BAR - CONTINUOUS\n\nOur heroes stand at the bar, celebrating their first victory.\n\n\t\t\t\t\tSHOVELER\n\t\tTo us!\n\n\t\t\t\t\tRAJA\n\t\tWhatever our name is.\n\nThey toast and drink.\n\nTHE SAME - LATER\n\nThe Spleen is passed out at a table, snoring. Shoveler and Invisible \nBoy sit next to him.\n\n\t\t\t\t\tSHOVELER\n\t\tEven his snores smell bad.\n\nRaja and Bowler sit at the bar, deep in it.\n\n\t\t\t\t\tBOWLER\n\t\tBut she's your mother.  You gotta tell her.\n\n\t\t\t\t\tRAJA\n\t\tI can't.\n\nON SHOVELER AND INVISIBLE BOY\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tDad thinks all this superhero stuff is a stupid \n\t\twaste of time.\n\n\t\t\t\t\tSHOVELER\n\t\tBut he plays golf, right?\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tYeah.\n\nBACK ON RAJA AND BOWLER -\n\n\t\t\t\t\tRAJA\n\t\tI'm her only son, and she always had such high \n\t\thopes for me. Medicine.  Law.\n\n\t\t\t\t\tBOWLER\n\t\tBut you're a superhero.\n\n\t\t\t\t\tRAJA\n\t\tThe cape.  The turban.  She wouldn't \n\t\tunderstand.\n\n\t\t\t\t\tBOWLER\n\t\tI know... My girlfriends all dumped me after I \n\t\tput on the mask.  They thought I'd lost it.\n\n\t\t\t\t\tRAJA\n\t\tBut in fact... you'd found it.\n\nThey clink their glasses and drink.\n\nBACK ON SHOVELER AND INVISIBLE BOY -\n\n\t\t\t\t\tSHOVELER\n\t\tThis is your dream... and you can't ever give \n\t\tit up.\n\nThe Spleen makes weird noises in his sleep.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tI wonder what he dreams about?\n\n\t\t\t\t\tSHOVELER\n\t\tWe don't want to know.\n\nMr. Furious sits alone in the corner, brooding, lost in his own angry \nthoughts..\n\nOUTSIDE THE BAR - CONTINUOUS\n\nA black van drives slowly past the bar.\n\nINSIDE THE VAN - CONTINUOUS\n\nThe van is packed with Disco Boys.  Tony P sits in the front seat.\n\n\t\t\t\t\tTONY P\n\t\tThere.\n\nHIS POV -\n\nHe has spotted the Ford Esquire parked in the lot.\n\nBACK IN THE BAR - A LITTLE LATER\n\nON THE BOWLER AND RAJA -\n\n\t\t\t\t\tBOWLER\n\t\tIt's late.  I'm headin' home.\n\n\t\t\t\t\tRAJA\n\t\tMe, too.\n\n\t\t\t\t\tBOWLER\n\t\t\t\t(to Invisible Boy)\n\t\tCome on, Junior, it's a school night.\n\nJUST OUTSIDE - A MONENT LATER\n\nAs our heroes, carrying the Spleen, leave.\n\n\t\t\t\t\tFURIOUS\n\t\tAnybody up for a little White Castle?\n\nBut suddenly the world is a whirling sass of chains and clubs as they \nare bushwhacked by the Disco Boys...\n\nEXT.  AN ALLEY - A LITTLE LATER - CLOSE ON FURIOUS\n\nas he comes to with a qroan and sees... the Bowler and Invisible Boy \ntied up and gagged, with the Raja, Shoveler, and the Spleen trussed up \nright next to them.  Furious looks up, sees Tony P standing over him.\n\n\t\t\t\t\tTONY P\n\t\tHi, cutie.\n\nFurious struggles, but he has been secured with some very heavy tire \nchains.  Tony P takes out a large caliber revolver, flips it open to \nmake sure it's loaded.\n\n\t\t\t\t\tTONY P\n\t\tSix losers. Six bullets. Perfect... Got any \n\t\tlast words, Angry Boy?\n\n\t\t\t\t\tFURIOUS\n\t\tDisco sucks.\n\n\t\t\t\t\tTONY P\n\t\tDisco sucks.  Very good.  You know what I'm \n\t\tgonna do, Angry Boy, since you're so colorful?  \n\t\tI'm gonna save you for last.\n\nHe turns and points the pistol right at Invisible Boy's head. Furious \nstruggles against his chains--to no avail.\n\n\t\t\t\t\tTONY P\n\t\tSweet dreams, punk.\n\nInvisible Boy closes his eyes... Tony P cocks the pistol... But \nsuddenly, there is the ring of steel--a broad blade sweeps through the \nair, and Tony P's pistol is sliced neatly in half.\n\n\t\t\t\t\tTONY P\n\t\t\t\t(holding half a pistol)\n\t\tHOLY...\n\nThe man is the strange steel mask is standing there, the drawn machete \nstill in his hand.\n\n\t\t\t\t\tMAN IN MASK\n\t\tBuenos naches.\n\n\t\t\t\t\tTONY P\n\t\tGet him!\n\nThe Disco Boys rush the newcomer, but he slices through their baseball \nbats with his machete, and sends them reeling and crashing into each \nother with expert forearm blows, whacks with the flat of his blade, and \nhead butts with his mask.\n\nFurious struggles to break free and join the fight, but the chains are \ntoo strong... and the stranger doesn't need any help.\n\nTony P flicks open a big switchblade and lunges at the stranger, who \nsidesteps him like a matador and swings his machete at him.  Tony P \nturns, about to charge again.\n\n\t\t\t\t\tMAN IN MASK\n\t\t\t\t    (Mexican accent)\n\t\tWould you like me to trim the sides?\n\n\t\t\t\t\tTONY P\n\t\tWhat?\n\nTony P feels the top of his head, and realizes that the blow from the \nmachete has neatly sliced off the top his disco-do, leaving only \nstubble on the top of his head.\n\n\t\t\t\t\tTONY P\n\t\t\t     \t  (freaking out)\n\t\tLET'S GET OUTTA HERE!\n\nTony and the Disco Boys run for it...\n\nFurious and the others study their masked savior, who stands before \nthem, machete in hand.\n\n\t\t\t\t\tFURIOUS\n\t\tYou're the Sphinx.\n\n\t\t\t\t\tSPHINX\n\t\tAnd you are a fool.\n\nHe raises his machete above Furious' head... and then slices clean \nthrough the chains.\n\nEXT.\tAUTO DEMOLITION YARD - LATER THAT NIGHT\n\nOur heroes have gathered around a scrap wood fire in a steel drum. They \nsit on the ground and on old car seats, feeling like schmucks as the \nSphinx chews theu out, his mask looking very friqhtening and magical in \nthe flickering light.\n\n\t\t\t\t\tSPHINX\n\t\tYou call yourselves superheroes? A rooster \n\t\tfights more intelligently than you!  You have \n\t\tshown yourself to your enemy and revealed your \n\t\tpowers to him--and what have you accouplished \n\t\tfor this?  You have destroyed his car.  \n\t\tBrilliant!  If you want to survive you must \n\t\tfight like a wolf pack--not like a six pack!\n\nFurious sulks, but the others get the point.\n\n\t\t\t\t\tSPHINX\n\t\tThe wolf is cunning.  He knows that stealth is \n\t\this greatest weapon, and he always fights as a \n\t\tteam...\n\t\t\t\t\t(more)\n\n\t\t\t\tSPHINX (Cont'd)\n\t\t\t\t(at Furious)\n\t\tNot like some drunken Tejano on Saturday night.\n\nFurious grunts.\n\n\t\t\t\t\tSPHINX\n\t\tCasanova Frankenstein is a a master of evil.  \n\t\tYou will need more than shovels and dessert \n\t\tforks to stop him... What else have you got?\n\nThey are silent.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t     (angrily)\n\t\tSo what else has Superman got?\n\n\t\t\t\t\tSHOVELER\n\t\tHe's got the fact that he's Superman!\n\n\t\t\t\t\tBOWLER\n\t\tBullets bounce off him!\n\nFurious sulks again, feeling that the others are turning against him.\n\n\t\t\t\t\tRAJA\n\t\tFirepower costs money.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tAnybody got any?\n\nA silence.\n\n\t\t\t\t\tSHOVELER\n\t\tWe didn't think this through very well.\n\n\t\t\t\t\tBOWLER\n\t\t\t\t(after a moment)\n\t\tMy father had this friend... He was an inventor...\n\nEXT.  DOC HELLER'S FARMHOUSE - DAY\n\nOur heroes stand looking at an old farubouse.  The place is an absolute \nwreck.  It hasn't been painted in twenty-five years. Windows are \nboarded up.  Half the shingles are gone.  There's visible fire damage \naround the kitchen window.\n\n\t\t\t\t\tSHOVELER\n\t\tAre you sure he's still lives here?\n\n\t\t\t\t\tRAJA\n\t\tAre you sure he's still alive?\n\n\t\t\t\t\tBOWLER\n\t\tHe was the last time I saw him.\n\n\t\t\t\t\tSHOVELER\n\t\tWhen was that?\n\t\n\t\t\t\t\tBOWLER\n\t\tI was eight.\n\nShe is about to knock, but the door is suddenly yanked open, and an \neighty year old guy is standing there.  He's got a wild head of white \nhair (that looks like a living explosion), and he wears a stained old \nlab coat with stickum mtssages to himself stuck to it, non-matching \nslippers, and a pair of thick glasses with frames that have been \ncomposited of half a dozen different old pairs all taped and welded \ntogether into a fantastic concoction.  He is DOC HELLER.\n\n\t\t\t\t\tHELLER\n\t\tYes!\n\n\t\t\t\t\tBOWLER\n\t\tDoctor Heller?\n\n\t\t\t\t\tHELLER\n\t\t\t\t(doesn't recognize her)\n\t\tYes!\n\n\t\t\t\t\tBOWLER\n\t\tIt's me... Elizabeth.\n\n\t\t\t\t\tHELLER\n\t\tElizabeth!  Little Elizabeth!  Why you're so... \n\t\tmiddle aged!\n\n\t\t\t\t\tBOWLER\n\t\tThanks.\n\n\t\t\t\t\tHELLER\n\t\tHow's your dad?\n\n\t\t\t\t\tBOWLER\n\t\tHe's dead.\n\n\t\t\t\t\tHELLER\n\t\tOh that's right--they squished him...  Heck of \n\t\ta guy.\n\nFurious throws a look at the Shoveler and Raja.  This guy's out of it.  \nThey're wasting their time.\n\n\t\t\t\t\tBOWLER\n\t\tDoc, these are my friends.  We're superheroes, \n\t\tand we need your help.\n\n\t\t\t\t\tHELLER\n\t\tWell, I give to the United Way, and I feel that \n\t\tsort of covers--\n\n\t\t\t\t\tSPHINX\n\t\tDoctor, we need your weapons.\n\n\t\t\t\t\tHELLER\n\t\t\t\t    (ecstatic)\n\t\tMy weapons? You need my weapons?\n\nEXT.  BEHIND THE HOUSE - A MINUTE LATER - MOVING ANGLE\n\nas Doctor Heller leads them all briskly across his overgrown yard \ntoward... the barn.\n\n\t\t\t\t\tHELLER\n\t\tThe military establishment has never understood \n\t\tme.  They won't return my phone calls, much \n\t\tless field test anything.  But I knew that \n\t\tsomeday I'd get my chance, and now... here you \n\t\tare!\n\t\t\t   (pulls open the barn door)\n\nINT.  THE BARN - CONTINUOUS\n\nAs our heroes step into Heller's laboratory/arsenal.  A stack of small \naluminum cans lines one wall.  There are weird lookinq sprayers, tubes, \nand strange homemade toy-like devices... but there isn't a firearm in \nsight.\n\n\t\t\t\t\tRAJA\n\t\tBut, Doc... where's the machine guns?\n\n\t\t\t\t\tSHOVELER\n\t\tThe bazookas?\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tThe lasers?\n\n\t\t\t\t\tHELLER\n\t\tYou don't need that junk!  You see, for \n\t\tthousands of years mankind has been immolating, \n\t\tdisemboweling, and exploding itself.  Why?  \n\t\tBecause we have this built-in screwed up need \n\t\tto go to war!\n\t\t\t\t\t(more)\n\n\t\t\t\t\tHELLER (Cont'd)\n\t\tSo as a young man I thought, why nat have the \n\t\tfun and excitement of war, without all that \n\t\tunnecessary bloodshed.  That's why I have \n\t\tdevoted my life to developing an arsenal of \n\t\thighly sophisticated non-lethal military \n\t\tweapons.\n\t\t\t\t(points to a hand held tube)\n\t\tAir cannons... Blame throwers... Feet seeking \n\t\tmissiles... And perhaps my ultimate \n\t\tinvention...\n\t   \t\t   (picks up one of the small cans)\n\t\tThe canned tornado.\n\nFurious groans, and the others share a look.  This guy's really a nut.\n\n\t\t\t\t\tHELLER\n\t\tNow here's a beauty!\n\t\t\t(picks up a purple and orange sprayer\n\t\t\tthat looks like a suped up water gun)\n\t\tI call it the Shrinker!  I developed it after \n\t\tyears of studying the worst dry cleaners I \n\t\tcould find.  It instantly shrinks fabrics to \n\t\thalf their size.  Anyone caught in its spray is \n\t\timmediately immobilized by their own clothing!\n\n\t\t\t\t\tFURIOUS\n\t\tLet's get out of here.\n\nFurious turns and goes out, and the others start to follow. But the \nBowler picks up a canned tornado.\n\nOUTSIDE THE BARN - CONTINUOUS\n\nas Furious walks away, the Bowler steps out of the barn.\n\n\t\t\t\t\tBOWLER\n\t\tHey, Mister Bad Mood.\n\nFurious stops, turns back.\n\n\t\t\t\t\tBOWLER\n\t\t\t(pulls the ring on the can)\n\t\tCatch.\n\nShe tosses the can to him.  He catches it--just as a small angry \ntornado FUNNELS out of the can.  It catches Furious and lifts him high \nin the air... then dissipates to nothing...\n\nA beat later Furious lands on the ground with a painful thump.\n\nON THE OTHERS, amazed.\n\nFurious gets to his feet, unhurt, but really pissed off.  He starts \nback toward the barn, violently kicking the empty can. The others get \nout of his way, as, muttering angrily to himself, he goes back into the \nbarn...\n\nAnd emerges a moment later, toting the air cannon.\n\n\t\t\t\t\tHELLER\n\t\tHe's got the air cannon!\n\nThe others think he's going to use it on them and scatter for cover. \nbut Furious steps out into the yard, looking for a suitable target... \nHe sees an old abandoned outhouse, puts the air cannon to his shoulder, \naims, and fires...\n\nThere is a loud WHOOOOMPH of compressed air, and the huge recoil of the \ncannon instantly flings Furious back against the wall of the barn.  But \nthe big rush of air hits the shed dead center... and BLOWS IT TO \nPIECES, leaving only the old seat.\n\nFurious gets up, dusts himself off, and moves to Doc Heller.\n\n\t\t\t\t\tFURIOUS\n\t\tDoc, you're a genius!\n\t\t\t\t     (hugs him)\n\n\t\t\t\t\tHELLER\n\t\tI know.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(turns to the others)\n\t\tOkay! We got the firepower!  I say we throw it \n\t\tinto the car, drive over to Casanova's house, \n\t\tand kick some ass!\n\n\t\t\t\t\tSPHINX\n\t\tNo.\n\nThe others ignore Furious and listen to the Sphinx.\n\n\t\t\t\t\tSPHINX\n\t\tWe are not yet ready.  Now we must learn to \n\t\tfight together... as one thing.\n\nThe others nod in agreemnt... while Furious fumes.\n\nMONTAGE WITH MUSIC - TRAINING AT THE FARM\n\nCLOSE ON DOC HELLER aiming his air cannon... CAMERA PULLS BACK TO \nREVEAL our heroes (minus Furious) standing in a pack right behind him, \nholding him down. HE fires, and the recoil jolts them all violently, \nbut it doesn't knock them over...\n\nas half a dozen scarecrows are blown to pieces... Our heroes chieer and \nshake their fists... while Mr. Furious sits alone on the sidelines, \ndrinking bourbon, and feeling very alienated.\n\nVARIOUS SHOTS as our heroes learn to fight as a team... crawling across \nthe grass together....charginq in a line... hurling canned tornadoes... \nwhile Furious sits it out, brooding, drinking, and getting very jealous \nof the Sphinx.\n\nShoveler, Bowler, and the Sphinx stand shoulder to shoulder, as \nInvisible Boy, Spleen, Raja, and the Doc throw small stones at them... \nThey deflect the pebbles with shovel, bowling ball, and machete... \nTheyre having fun.  They're becoming a team...\n\nEXT.  OUTSIDE THE BARN - EVENING\n\nFurious drinks alone, while the rest of our heroes sit around an old \npicnic table, feasting on sodas and pizza (like a football team after a \ngreat practice.)  Raja explains the history of the situation to the \nSphinx.\n\n\t\t\t\t\tRAJA\n\t\tTwenty years ago all the major hoodlums of this \n\t\tcity were united into one great brotherhood of \n\t\tevil, and Casanova was their king.\n\n\t\t\t\t\tSHOVELER\n\t\tCrime was rampant.  It wasn't safe to stay in \n\t\tyour home.\n\n\t\t\t\t\tBOWLER\n\t\tMuch less go outside.\n\n\t\t\t\t\tSHOVELER\n\t\tThen Captain Amazing appeared.\n\n\t\t\t\t\tRAJA\n\t\tHe busted Casanova and sent the crooks packing.\n\n\t\t\t\t\tSHOVELER\n\t\tAnd this has been a pretty nice place to live \n\t\tever since.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t    (pissed off)\n\t\tBut now Casanova's back!  And we're gonna sit \n\t\taround here all night eating pizza and telling \n\t\tstories! Hey, lets toast some marshmellows!\n\n\t\t\t\t\tSPHINX\n\t\tThe wise snake coils before he strikes.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(lunges at the Sphinx)\n\t\tAnd a skunk stinks!\n\nFurious and the Sphinx square off, their faces only inches apart.\n\n\t\t\t\t\tSPHINX\n\t\tYou drink too much.\n\n\t\t\t\t\tFURIOUS\n\t\tWhen are you going to take off that mask?\n\n\t\t\t\t\tSPHINX\n\t\t\t\t    (pointedly)\n\t\tWhen I am sure I am among friends.\n\n\t\t\t\t\tRAJA\n\t\tRoy--\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(snapping at him)\n\t\tGo dance with your mother, Jeffrey!\n\nON THE RAJA, hurt.\n\n\t\t\t\t\tSPHINX\n\t\tYour rage is a very great power, but it blinds \n\t\tyou to your heart.\n\n\t\t\t\t\tFURIOUS\n\t\tMy heart died a long time ago.\n\n\t\t\t\t\tSPHINX\n\t\tIt is not dead.  It is hiding.\n\n\t\t\t\t\tFURIOUS\n\t\tBlow it out your bean hole, Pancho!... And to \n\t\thell with the rest of you!... Look at you.  \n\t\tBunch of rejects.  I didn't need you before--\n\t\tand I don't need you now!\n\t\t\t(jumps on to his motorcycle)\n\t\tThe great ones RIDE ALONE!\n\t\t\t(kicks the engine started)\n\t\tAdios, muchachos!\n\t\t\t(and he rides off across the field)\n\nON THE OTHERS, watching him...\n\n\t\t\t\t\tBOWLER\n\t\tHas he always been like this?\n\nEXT.  COUNTRY ROAD - CONTINUOUS - CLOSE ON FURIOUS\n\nthe wind whipping against his face, as he rides his Harley at about a \nhundred miles an hour... The languorous sound of an OLD DEAN MARTIN \nSONG is heard as we...\n\nFADE INTO:\n\nMENORY SEQUENCE - DAY - CLOSE ON FURIOUS\n\nas a little boy, sitting in the backseat of the family car. It is \nthirty years ago, and Mister Furious is a sweet, very shy, well \nbehaved, perfectly normal three year old.  His MOTHER and FATHER sit in \nthe front.  Dean Martin is playing on the car radio.  Little Furious \nlooks out the window and sees the Mohave Desert going by.  A sign reads \n\"Las Vegas, 120 miles\".\n\n\t\t\t\t\tMOTHER\n\t\t\t\t   (to husband)\n\t\tOh this place looks great.\n\nAn old sign reads \"BAR\" as the family car pulls into the parking lot of \na single adobe building out in the middle of nowhere.  They park.\n\n\t\t\t\t\tMOTHER\n\t\tNow honey, you just wait in the car.  Mommy and \n\t\tDaddy will be right beck.\n\nThey get out, lock the car and head for the bar, leaving the windows \nup.  Little Furious watches them go, never suspecting that his entire \nlife is about to change.  He sits quietly in the backseat and plays \nwith the little superhero figurines that he's brought with him.\n\n\t\t\t\t\tLITTLE FURIOUS\n\t\tPow!  Bang!  Wham!\n\nINSIDE THE BAR - CONTINUOUS\n\nas the parents enter.  A very Western motif.  An old Gene Autrey song \nis playing on the juke.  The air conditioning is on.\tThey're the only \ncustomers in the place.\n\n\t\t\t\t\tMOTHER\n\t\tIt's nice and cool in here.\n\n\t\t\t\t\tFATHER\n\t\t\t\t(as they sit at the bar)\n\t\tBarkeep, a couple of cold ones.\n\nCUT BACK AND FORTH BETWEEN CAR AND BAR -\n\nANGLE ON THE MIDDAY SON - blazing down on the car...\n\nas Little Furious still plays with his superheroes, but the interior is \nstarting to bake, and the sweat begins to pour ofr him.  He looks out \nat the bar. gettinq worried.  He tries the windows, but they're \nautomatic and won't open...\n\nBack in the bar his parents down shots of bourbon with their beers, as \nthe BARTENDER finishes telling them a joke.\n\n\t\t\t\t\tBARTENDER\n\t\tAnd here's a banana for your monkey.\n\nMom and Dad have a good laugh.\n\n\t\t\t\t\tBARTENDER\n\t\tCouple more?\n\n\t\t\t\t\tFATHER\n\t\tYou bet.\n\nANGLE FROM OUTSIDE TUE CAR as Little Furious, sweat and tears pouring \nout of him, his hair wet and sticking out (and starting to take on that \nfamiliar look), pounds on the window.\n\n\t\t\t\t\tLITTLE FURIOUS\n\t\tMommy!  Daddy!  Mommy!  Daddy!\n\nas back in the bar his parents, now very drunk, down more beers and \nchasers as they play a spirited game of pinball.\n\nANGLE ON THE MOHAVE SUN - beating down mercilessly\n\nbarely able to breath, Little Furious flops back onto the seat, his \nface a mask of heat and terror... But suddenly, a change begins to take \nplace in him, as some primordial defense mechanism kicks in... and his \nfear begins to give way to rage... His teeth bare.\n\nCLOSE ON HIS HANDS -\n\nas they CRUSH the superhero figurines in their grasp...\n\nWhile back in the bar his drunken parents dance a slow two step to Hank \nWilliams \"Your Cheatin' Heart\"...\n\nEXT.  TBE PARKING LOT - NIGHT - HANK WILLIAMS CONTINUES\n\nas the big desert moon shines down on the family car, still parked \nthere.\n\nINSIDE THE BAR - CONTINUOUS\n\nThe parents are asleep in a booth.  Furious' mother wakes up, looks \naround groggily, and in a moment of horror suddenly remembers...\n\n\t\t\t\t\tMOTHER\n\t\tOH MY GOD!\n\nTHE PARKING LOT - A BEAT LATER\n\nas she runs toward the car, hysterical.\n\n\t\t\t\t\tMOTHER\n\t\tOh my God!  Oh my God!  Oh my God!\n\nShe unlocks the door, throws it open, and sees something that makes her \npull back in horror... Little Furious sits in the backseat.  His hair \nsticks out wildly, his face has become that now familiar mask of \nprisordial rage.  Another OLD DEAN MARTIN SONG is heard as we...\n\nFADE INTO:\n\nINT.  THE DINER - NIGHT - CLOSE ON FURIOUS\n\nsitting alone in the booth, a look of profound pain and lonliness on \nhis face; he is still that little boy.  The Dean Martin song is playing \non the juke.\n\n\t\t\t\t\tMONICA (0.S.)\n\t\tHi.\n\nHe looks up and sees Monica.\n\n\t\t\t\t\tFURIOUS\n\t\tHi.\n\n\t\t\t\t\tMONICA\n\t\tAlone tonight?\n\n\t\t\t\t\tFURIOUS\n\t\tEvery night.\n\nShe smiles.\n\nEXT.  THE FRANKENSTEIN MANSION - CONTINUOUS\n\nArmed Disco Boys guard the front entrance...\n\nWhile on the hillside above Invisible Boy (looking through binoculars) \nand the Spleen lie together on their bellies in the weeds, keeping the \nmansion under surveillance.\n\n\t\t\t\t\tSPLEEN\n\t\t\t\t  (in a whisper)\n\t\tAdolescence was the worst--The other kids made \n\t\tfun of me, so I'd spit on them and they'd \n\t\tscatter--I've never had a girlfriend--unless \n\t\tyou count that night with my cousin--She \n\t\trecovered fully though--We exchange cards every \n\t\tChristmas--Well, I send her one, and she sends \n\t\tit back...\n\t\t\t(spritzes somathing into his mouth,\n\t\t\tthen offers it to Invisible Boy)\n\t\tBug repellent?\n\nSuddenly, the gates of the mansion open and several sedans... followed \nby a truck, drive out...\n\nPOV THROUGH BINOCULARS -\n\nCasanova and Anabel sit in the front of the truck.\n\n\t\t\t\t\tINVISIBLE BOY (0.S.)\n\t\tWhere are they going?\n\nInvisible Boy hesitates for just a momnt, then gets up and runs down \nthe hill.\n\n\t\t\t\t\tSPLEEN\n\t\t\t\t(runs after him)\n\t\tKid!\n\nAs the small convoy drives past, Invisible Boy slips out from behind \nsome trees, runs after the truck, jumps up and sits on its rear bumper.  \nThe Spleen comes running after him, and Invisible Boy reaches out, \ngrabs his hand and pulls him up alongside him.  Invisible Boy tries the \nrear gate.  It's open. The two of them pull it up just a foot, squirm \ninside, then pull it closed behind them.\n\nINSIDE THE TRUCK - CONTINUOUS\n\nInvisible Boy flashes the light of his key chain flashlight around the \ninside of the truck.  There is nothing in it, except for a large pile \nof packing blankets.\n\nEXT.  WATERFRONT AREA - NIGHT\n\nas the convoy drives through Champion City's seedy waterfront area and \nout onto a long pier.\n\nINT.  THE DINER - NIGHT - CLOSE ON THE TV\n\nDawn Wong and Don Stouffer report the night's news.\n\n\t\t\t\t\tDAWN\n\t\t...still no sign of millionaire Lance Hunt, and \n\t\tnow, in an unrelated story, another one of \n\t\tChampion City's leading citizens has apparently \n\t\tdisappeared. Captain Amazing has not been seen \n\t\tor heard from in a week. Authorities believe \n\t\tthat the hard working superhero may just be \n\t\ttaking a well deserved rest.\n\n\t\t\t\t\tDON\n\t\tCancun perhaps?\n\n\t\t\t\t\tDAWN\n\t\tSounds good to me, Don.\n\nMr. Furious sits in the booth drinking coffee as Monica serves him his \nburger and fries.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t   (floundering)\n\t\tMonica... I was wondering if--uh-maybe we--I \n\t\tmean you and I--could-uh--you know--get a--I \n\t\tmean have a...\n\n\t\t\t\t\tMONICA\n\t\tDate?\n\n\t\t\t\t\tFURIOUS\n\t\tYeah.\n\n\t\t\t\t\tMONICA\n\t\tI get off work in fifteen minutes. Walk me \n\t\thome?\n\n\t\t\t\t\tFURIOUS\n\t\tSure.\n\n\t\t\t\t\tMONICA\n\t\tThat was easy.\n\t\t\t\t(goes back to work)\n\nON FURIOUS, feeling a whole lot better.\n\nJUST OUTSIDE THE DINER - CONTINUOUS - UNKNOWN POV\n\nfrom across the street.  Furious' head is clearly visible in the \nbrightly illuminated window of the diner.\n\nA Disco Boy stands in the shadows, gazing at the diner; he recognizes \nFurious.\n\nEXT.  WATERFRONT - NIGHT\n\nThe convoy has pulled up alongside a rusty old freighter, docked at the \npier.\n\nCasanova's men throw the gate of the truck open, and the CAMERA MOVES \nIN.  No one is there, but we notice... two large lumps under the \npacking blankets.\n\nCasanova holds Anabel in his arms as they watch a large wooden crate \nbeing lowered from the deck of the freighter.\n\n\t\t\t\t\tCASANOVA\n\t\tHoney, our ship's come in.\n\nCasanova's cellular phone rings.\n\nOUTSIDE THE DINER - CONTINUOUS\n\nThe Disco Boy is on his phone.  His pistol is drawn, and he's got it \naimed right at Furious' head.\n\n\t\t\t\t\tDISCO BOY\n\t\tJust give me the word.\n\nBACK TO THE PIER - CONTINUOUS - ON CASANOVA\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t   (gets an idea)\n\t\tWait.  I'll be right there.\n\t\t\t\t(hangs up, starts off)\n\n\t\t\t\t\tANABEL\n\t\t\t\t     (peeved)\n\t\tWhere are you going?\n\n\t\t\t\t\tCASANOVA\n\t\tHead hunting.\n\nA minute later Casanova and two or three Disco Boys drive off in one of \nthe sedans... as the crate is loaded onto the truck, and the gate is \npulled closed... and locked.\n\nINSIDE THE TRUCK - A MOMENT LATER\n\nThe engine starts up, and the truck starts to move, as Invisible Soy \nand the Spleen poke their heads out from under the packing blankets... \nThey approach the crate and Invisible Boy shines his flashlight on it.  \nThe crate is secured with rivets and thick metal bands; there's no way \nthey're going to be able to get inside it, but in the light of the \nflashlight they see...\n\nFaded red lettering, in Russian, and the distinctive old hammer and \nsickle of the former Soviet Union.\n\nEXT.  DIMLY LIT STREET - NIGHT\n\nFurious walks Monica home.\n\n\t\t\t\t\tMONICA\n\t\tI admire you.\n\n\t\t\t\t\tFURIOUS\n\t\tWhy?\n\n\t\t\t\t\tMONICA\n\t\tBeing a superhero, wanting to save the world.  \n\t\tIt's so... unselfish.\n\n\t\t\t\t\tFURIOUS\n\t\tIt is?\n\n\t\t\t\t\tMONICA\n\t\tMost people just want to make money or be \n\t\tfamous or something.  But you risk everything, \n\t\tjust to help people.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(after a moment)\n\t\tI wouldn't mind being famous.\n\n\t\t\t\t\tMONICA\n\t\tWho wouldn't?\n\nIn the shadows behind them... Casanova follows, stalking them, as \nsilent as a vampire.\n\n\t\t\t\t\tMONICA\n\t\tI've never been able to figure out what to do \n\t\twith my life, which is why I guess I'm still a \n\t\twaitress.\n\n\t\t\t\t\tFURIOUS\n\t\tNothing wrong with being a waitress.\n\n\t\t\t\t\tMONICA\n\t\tWhat's your real name?\n\n\t\t\t\t\tFURIOUS\n\t\tRoy.\n\n\t\t\t\t\tMONICA\n\t\tHave you always lived here?\n\nHe nods.\n\n\t\t\t\t\tMONICA\n\t\tMe too... I love this stupid old town.  It's \n\t\tnoisy.  It's smelly. It's falling apart.\n\n\t\t\t\t\tFURIOUS\n\t\tIt's home.\n\n\t\t\t\t\tMONICA\n\t\tYeah.\n\nCASANOVA'S POV\n\nMonica, smiling, looking lovely.\n\nCLOSE 0N CASANOVA; he wants her...\n\nBACK ON FURIOUS AND MONICA -\n\n\t\t\t\t\tMONICA\n\t\tI've thought of leaving, going to Chicago or \n\t\tNew York, but...\n\n\t\t\t\t\tFURIOUS\n\t\tWhat have they got that we ain't got?\n\n\t\t\t\t\tMONICA\n\t\tChampion's going to bounce back, and I want to \n\t\tbe here when it does.\n\n\t\t\t\t\tFURIOUS\n\t\tMe, too.\n\n\t\t\t\t\tMONICA\n\t\tYou don't seem very angry right now.\n\nHe shrugs.  And they kiss, very tenderly.\n\n\t\t\t\t\tMONICA\n\t\tYou know what?  Underneath all that anger I \n\t\tthink there's just a little boy who wants \n\t\teveryone to love him.\n\n\t\t\t\t\tFURIOUS\n\t\tI just want to be a superhero.\n\n\t\t\t\t\tMONICA\n\t\tThat's what I mean... 'Night, Roy.\n\nShe turns and climbs the stairs of an old apartmnt building and goes \ninside, as Furious watches, feeling emotions hees not used to. He \nreally likes her.  He starts walking back down the street, past a man \nsitting on the stoop.  The man looks up.  It's Casanova Frankenstein.\n\n\t\t\t\tCASANOVA\n\t\tGoing my way?\n\nFurious is caught completely by surprise--he takes a stand, ready to \nfight.\n\n\t\t\t\tCASANOVA\n\t\tTake it easy--take it easy.  I just want to \n\t\thave a little chat... That was quite a number \n\t\tyou did on my car.  You've got a lot of \n\t\tviolence in you... and I like that in a guy.\n\nFurious, silent.\n\n\t\t\t\t\tCASANOVA\n\t\tYou know what the difference is between good \n\t\tand evil, Roy?\n\nFurious reacts to the fact that Casanova knows his real name.\n\n\t\t\t\t\tCASANOVA\n\t\tEvil is more fun.  When you want something, you \n\t\tjust take it, and if somebody gets in your way, \n\t\tyou kill them... You seem like a very \n\t\tfrustrated guy, Roy.  Unhappy. Unfulfilled.  \n\t\tWhat is it that you've always wanted, always \n\t\tdesired?  Because whatever it is, I can give it \n\t\tto you... Fame?\n\t\t\t\t(snaps his fingers)\n\t\tEasy.  Fortune?  Even easier. Women?\n\t\t\t\t\t(laughs)\n\t\tThe easiest of all.\n\nCLOSE ON FURIOUS as, out of the corner of his eye, he catches movement \nin the alley across the street... he knows what it is.\n\n\t\t\t\t\tCASANOVA\n\t\tI'll let you in on a little secret, Roy.  In \n\t\ttwo days this entire city will belong to me, \n\t\tand there's not a damn thing your little pals \n\t\tcan do about it.  It's the perfect time to \n\t\tswitch teams... So what do you say?\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t     (quietly)\n\t\tYou're nuts.\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t\t(flairs)\n\t\tThey always call the great ones nuts.\n\n\t\t\t\t\tFURIOUS\n\t\tAnd the nuts always call themselves great.\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t(his psychosis showing)\n\t\tAre you with me... or against me?\n\n\t\t\t\t\tFURIOUS\n\t\tAgainst.\n\n\t\t\t\t\tCASANOVA\n\t\tToo bad.  PLUG HIM!\n\nGunfire rings out from the alley as the Disco Bays step out, their \npistols blazing.  But Furious has anticipated them.  He leaps right at \nCasanova, pins his arms in a bear hug and holds him in the line of \nfire.\n\n\t\t\t\t\tCASANOVA\n\t\tWAIT!\n\nThe Disco BQys stop firing... Furious drags Casanova back into an empty \nlot, using him as a shield.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t   (to Casanova)\n\t\tThanks for reminding me which team I'm on.\n\n\t\t\t\t\tCASANOVA\n\t\tYou're dead.\n\n\t\t\t\t\tFURIOUS\n\t\tSo are you!\n\nFurious releases Casanova, then runs for it and leaps over the wooden \nwall at the end of the lot... as the Disco Boys open fire again, and \ntheir bullets punch holes through the wall...\n\nFurious runs down a back street and escapes into the night.\n\nEXT.  THE FRANKENSTEIN CENTER - CONTINUOUS\n\nThe convoy drives up the hill toward an ominous looking structure (that \nwe recognize from the model on the TV interview with Casanova earlier.)  \nA high central tower rises up out of the half completed bulwarks of \nfeatureless concrete. It looks both totally modern and completely \nancient, but a profound sense of evil connects both themes beautifully.\n\nANGLE ON a plaque that reads...  \"Frankenstein Center for the \nPerforming and Non-performing Arts\".\n\nThe gates of the center open, and the convoy passes through.\n\nINSIDE THE TRUCK - A NONENT LATER\n\nInvisible Boy and the Spleen stand listening, waiting, as they feel the \ntruck pull to a stop...\n\nA moment later the gate is pulled opened... Anabel is there with \nseveral thuggy looking SECURITY GUARDS.\n\n\t\t\t\t\tANABEL\n\t\tBe careful with my baby.\n\nThere are two lumps under the packing blankets again.\n\nEXT.  LOADING DOCK - A FEW MINUTES LATER\n\nThe crate is being carried away by a forklift... A beat, and then \nInvisible Boy and the Spleen slip out of the empty truck...\n\nAnd run down the road back toward the gates... which are still open.  \nThey're just about to pass safely through them, when a PAIR OF ARMED \nSECURITY GUARDS, step in their path, their guns pointed at thern.\n\n\t\t\t\t\tGUARD 1\n\t\tFreeze!\n\n\t\t\t\t\tGUARD 2\n\t\tHands up!\n\nThey freeze, their hands held high.\n\n\t\t\t\t\tGUARD 2\n\t\tWhat are you two doing here?\n\nOur heroes are mute.\n\n\t\t\t\t\tGUARD 1\n\t\tNot talking, eh?  That can be fixed.  Turn \n\t\taround, start walking up the hill--\n\n\t\t\t\t\tGUARD 2\n\t\tAnd no funny business.\n\nInvisible Boy and the Spleen turn, hands in the air, and start up the \nhill, the guards right behind them.\n\n\t\t\t\t\tSPLEEN\n\t\t\t(after a moment, to Invisible\n\t\t\t\tBoy, in a whisper)\n\t\tPinch 'em.\n\nInvisible Boy pinches his nostrils--and the Spleen lets out with a \nhorrendous fart.  The guards gag and choke violently in the fumes as \nour heroes turn and run for it... escaping out the gates.\n\nINT.  DOC KELLER'S LABORATORY/BARN - A LITTLE LATER\n\nInvisible Boy and Spleen report to the others.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tWhatever was in that crate... is from Russia.\n\nThe others consider this, then hear a familiar voice.\n\n\t\t\t\t\tFURIOUS (0.S.)\n\t\tIs there room in the pack for one more wolf?\n\nThey look up and see that Furious has just returned... The Sphinx moves \nto him.  For a moment they stand face to face...\n\n\t\t\t\t\tFURIOUS\n\t\tI was wrong... I need my friends.\n\nSphinx takes off his mask, revealing that he is the busboy from the \nTacky Taco.\n\n\t\t\t\t\tSPHINX\n\t\tAmigo.\n\nThey embrace.\n\nA few mimutes later.  The others are gathered around Furious, listening \nto his story.\n\n\t\t\t\t\tFURIOUS\n\t\tCasanova said that in two days the entire city \n\t\twould belong to him... and there wasn't a thing \n\t\tthat we could do about it.\n\n\t\t\t\t\tBOWLER\n\t\tWhat did he mean?\n\n\t\t\t\t\tFURIOUS\n\t\tI dunno.\n\nThrough the window the moon is seen rising over the hillside, the \nFrankenstein Center silhouetted ominously against it. Raja, Shoveler, \nand Furious gaze at it.\n\n\t\t\t\t\tSHOVELER\n\t\tMaybe it's time we checked that place out.\n\n\t\t\t\t\tRAJA\n\t\tBut how do we get in?\n\n\t\t\t\t\tFURIOUS\n\t\t(after a moment, sounding very Sphinx-like)\n\t\tWe just become like the wolf... who wears the \n\t\tsheep's clothing.\n\nMONTAGE WITH MUSIC - THE NEXT DAY\n\nCLASSIC DISCO (\"Stayin' Alive\" if we can get the rights)\n\nFurious, Raja, and Shoveler (in street clothes) walk down the street \ntogether and step into the doorway of... the Salvation Army Thrift \nShop...\n\nLater.  CLOSE ON three pairs of legs, wearing polyester pants and \nvintage shoes (ala the classic shot from \"Saturday Night Fever\")... \nCAMERA WIDENS TO REVEAL our three heroes, dressed in full blown \nseventies attire (with vintage sunglasses), doing their best Travolta \nstrut down the street...\n\nMUSIC CONTINUES as our heroes strut their way through the gates of the \nart center, right past the security guards...\n\nOUTSIDE THE CENTER - DAY\n\nThey climb the long stairs toward the center, which looms above them... \nthen pass through the big wooden doors and into...\n\nINT.  MAIN HALL - A MOMENT LATER\n\nEND MUSIC as our heroes move through a vast, but empty main hall... A \nsmall army of heavily armed security guards marches about.\n\n\t\t\t\t\tRAJA\n\t\tSo where's the art?\n\n\t\t\t\t\tFURIOUS\n\t\tHe hasn't stolen it yet.\n\n\t\t\t\t\tSHOVELER\n\t\tThis place is built like a fortress.\n\n\t\t\t\t\tFURIOUS\n\t\tBecause thats what it is.\n\nThey hear a WILD BURST OF DRUNKEN LAUGHTER echoing through the hall.\n\n\t\t\t\t\tRAJA\n\t\tWhat's that?\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t(following the sound)\n\t\tCome on.\n\nThey approach a doorway.  The noise is coming from within.\n\nINT.  BANQUET IIALL - A MOMENT LATER\n\nas our heroes step inside and see... A big luncheon is in progress.  \nCasanova, Anabel, and Tony P sit at the head table. The room is lined \nwith banquet tables, which are filled with VICIOUS LOOKING CHARACTERS, \ndrunk, eating, laughing, and giving the waitresses a very rough tim..\n\n\t\t\t\t\tRAJA\n\t\t\t\t    (stunned)\n\t\tOh my God... Every crook in the city is here.\n\nON A GROUP OF VICIOUS LOOKING BALD BIKER TYPES...\n\n\t\t\t\t\tRAJA (O.S.)\n\t\tThe Bone Heads from the South Side...\n\nON THREE INSIPIDLY EVIL LOOKING GUYS in hip suits...\n\n\t\t\t\t\tRAJA (O.S.)\n\t\tThe Bland Boys from Downtown...\n\nON A DARK HAIRED WHITE GUY dressed as a rapper...\n\n\t\t\t\t\tRAJA (O.S.)\n\t\tItalian Ice...\n\nON A GUY with a frightening assortment of metal things piercing his \nface...\n\n\t\t\t\t\tRAJA (O.S.)\n\t\tThe Stapler...\n\nON TWO THUGS DRESSED AS ELVIS...\n\n\t\t\t\t\tRAJA (0.S.)\n\t\tThe Elvis Brothers.\n\nA more degenerate group of criminals never sat down to lunch. Furious \nrecognizes one of the waitresses...   It's Monica.\n\nCasanova's got his eye on her, too, and he remembers her from the night \nbefore on the street with Furious.\n\nON ANABEL, noticing his interest.\n\nOur heroes see Monica walking straight toward them. They turn away, \nlean against a wail, trying to be totally inconspicuous...\n\nBut as she passes them, not noticing them... Casanova approaches her.\n\n\t\t\t\t\tCASANOVA\n\t\tExcuse me.\n\nShe stops, turns to him, while our heroes listen in, only a few feet \naway...\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t(reading her name tag)\n\t\tMonica... Beautiful name.  It suits you.\n\nCLOSE ON FURIOUS, getting jealous.\n\n\t\t\t\t\tCASANOVA\n\t\tI hope you won't take this the wrong way, but I \n\t\tcouldn't help but notice... that you're a dead \n\t\tringer for Veronica Lake in \"The Blue Dahlia\".\n\n\t\t\t\t\tMONICA\n\t\tReally?\n\nFurious growls.  Raja gives him an elbow.\n\n\t\t\t\t\tCASANOVA\n\t\tAre you an actress?\n\n\t\t\t\t\tMONICA\n\t\tJust a waitress.\n\n\t\t\t\t\tCASANOVA\n\t\tYou underestimate yourself.\n\nMister Furious is fuming.  The strands of his perfectly coiffed disco-\ndo start to stand straight up.\n\n\t\t\t\t\tCASANOVA\n\t\tYou know I'm writing a play--it's just a little \n\t\tBroadway thing, but thure's a part in it that I \n\t\tthink you'd be perfect for.\n\n\t\t\t\t\tMONICA\n\t\tReally?\n\n\t\t\t\t\tCASANOVA\n\t\tI'd love to hear you read it. Could you stick \n\t\taround after the luncheon?\n\n\t\t\t\t\tMONICA\n\t\tSure--I guess.\n\n\t\t\t\t\tCASANOVA\n\t\tTerrific.\n\nShe turns and walks into the kitchen.\n\nCLOSE ON CASANOVA, watching her; his intentions are sinister...  He \nturns and sees... our heroes, hanging by the wall.\n\n\t\t\t\t\tCASANOVA\n\t\tWhat are you three doing here? This is invited \n\t\tguests only.  Out.\n\nOur heroes skulk out.\n\nJUST OUTSIDE THE BANQUET HALL - CONTINUOUS\n\nas our heroes step out and breathe a sigh of relief.\n\n\t\t\t\t\tRAJA\n\t\tThat was too close.\n\n\t\t\t\t\tSHOVELER\n\t\tBut we gotta find out what's going on in there.\n\n\t\t\t\t\tFURIOUS\n\t\tHey.\n\nFurious has spotted... a large covered dessert table, waiting to be \nwheeled into the hall.\n\nBACK IN THE BANQUET HALL - A FEW MINUTES LATER\n\nas the dessert table is wheeled in... and in a CLOSER ANGLE, under the \ntable cloth, we see three pairs of disco shoes creeping along...\n\nA few minutes later, Monica steps up to the dessert table... Suddenly, \nshe is yanked under.\n\nUNDER THE TABLE - CONTINUOUS\n\nMonica struggles, tries to cry out, but a hand is clamped firmly over \nher mouth.\n\n\t\t\t\t\tFURIOUS\n\t\tIt's me.\n\nShe calms down, and he takes his hand off her mouth.\n\n\t\t\t\t\tMONICA\n\t\tWhat are you guys doing here?\n\n\t\t\t\t  RAJA & SHOVELER\n\t\tShhhh!\n\nThe waitresses leave; the big doors to the dining room are swung \nclosed, and the cigars are lit.  The meeting has begun. Casanova takes \nthe podium.\n\n\t\t\t\t\tCASANOVA\n\t\tThank you all for coming.  I hope you enjoy the \n\t\tcigars.  I had to kill a dozen Cubans to get \n\t\tthem.\n\nTony P chuckles loudly, but the joke goes over like a lead balloon with \nthe rest of the crowd.\n\n\t\t\t\t\tCASANOVA\n\t\tTwenty years ago, this town was yours!  AND I \n\t\tWAS YOUR KING!\n\nON THE HOODS, listening, bored, puffing on their cigars; this is a sad \nold story.\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t    (tragically)\n\t\tBut they called me a psycho, and they put me \n\t\taway.  For twenty years I rotted in my cell, \n\t\tpainting watercolors, writing haikus--just \n\t\twaiting for the day I could take my revenge.  \n\t\tWell, brothers, that day has come!\n\nON OUR HEROES under the table, listening.  Monica begins to realize \nwhat's going on.\n\nBACK TO CASANOVA -\n\n\t\t\t\t\tCASANOVA\n\t\tThey thought I was crazy? Well the joke's on \n\t\tthem--because tonight at precisely midnight--on \n\t\tthe twentieth anniversary of my tragic arrest--\n\t\tevery man, woman, and child in this city is \n\t\tgoing to turn into a RAVING PSYCSOTIC!  Mothers \n\t\twill murder their tots!  Old ladies will \n\t\tstrangle their cats!  Children will bump off \n\t\ttheir babysitters!\n\nThe guests think Casanova's completely lost it.  Italian Ice speaks up.\n\n\t\t\t\t\tITALIAN ICE\n\t\tYou're outta your mind!\n\n\t\t\t\t\tCASANOVA\n\t\tI beg your pardon?\n\n\t\t\t\t\tITALIAN ICE\n\t\tNobody could drive a whole city crazy.\n\n\t\t\t\t\tCASANOVA\n\t\tTell you what, Ice.  I'll mke you a friendly \n\t\tlittle wager.  It I can't do it... you can blow \n\t\tmy brains out.  If I can, I'll blow out yours.\n\nNow the hoods' interest has been perked.\n\n\t\t\t\t\tITALIAN ICE\n\t\tDone.\n\n\t\t\t\t\tCASANOVA\n\t\t\t(to Anabel, with a smile)\n\t\tHoney, give the boys a taste.\n\nAnabel puts on a pair of heavy duty sound deadening ear protectors, \nthen presses a button on a small remote control device.\n\nANGLE ON A SPEAKER, placed above the podium... as the air is suddenly \nfilled with a weird, stridulating, HORRIFIC NOISE (somewhere between \nthe sound of a fire siren and a hornet trapped in your ear) and \neveryone in the room (except Anabel) goes COMPLETELY BERSERK...\n\nCAMERA PANS the tables as the guests laugh dementedly, punching, \ngouging, strangling, and stabbing each other...\n\nUnder the serving table our heroes go crazy...\n\nCasanova, in a state of psychotic ecstasy, whips out his pistol and \nempties it into Italian Ice... who drops to the floor, dead.\n\nAnabel presses the button again; the sound winds down and stops, and \neverything returns to normal.  The entire event lasted only a few \nseconds, but the guests are dazzled.\n\n\t\t\t\t\tCROOKS\n\t\tThat was great!... What the hell was that?... \n\t\tHow did you do that?\n\nCasanova throws Anabel a kiss.\n\n\t\t\t\t\tCASANOVA\n\t\tTonight, at midnight, that sound will be \n\t\tamplified across this entire city.  Murder and \n\t\tmayhem will reign supreme!  And Champion City \n\t\twill be ours again!  This will be our castle!  \n\t\tAnd I will be our king!  And there's no one to \n\t\tstop us!\n\nSuddenly, a familiar voice is heard.\n\n\t\t\t\t\tAMAZING (O.S.)\n\t\tNot so fast, Casanova!\n\nA pair of curtains suddenly part... and Captain Amazing (looking a bit \nsinged) is standing there in classic superhero pose.\n\nCAMERA PANS the crooks, as their criminal ecstasy turns instantly to \nterror.  They yank out their pistols, dive for cover under the table, \nthrow up their hands in surrender, etc... But Casanova just grins.\n\n\t\t\t\t\tCASANOVA\n\t\tDon't worry, fellas...\n\t\t\t(moves to Captain Amazing, and\n\t\tputs his arm chummily around him)\n\t\tI killed him... and I've had him stuffed.\n\nCasaova reaches behind Captain Amazing's back and pulls a string (like \nthe ones they used to have on those old talking dolls).\n\n\t\t\t\t\tAMAZING\n\t\t\t\t(in a canned voice)\n\t\tIsn't my butt cute in these tights?\n\t\t\t\t   (pulls again)\n\t\tBlue is my color.\n\t\t\t\t   (pulls again)\n\t\tOh, my abs are killing me!\n\nThe crooks are beside themselves with laughter.\n\nON OUR HEROES, under the table, stunned.\n\nON THE ELVIS BROTHERS -\n\n\t\t\t\t\tELVIS BROTHER I\n\t\tThe King is back!\n\n\t\t\t\t\tELVIS BROTHER 2\n\t\tLong live the King!\n\nThe crooks fire their pistols exuberantly into the air, as disco music \nfills the air and Casanova dances, basking in their adoration...\n\nAnd our heroes slip out from under the table and make good their \nescape...\n\nINT.  DOC HELLER'S BARN/LAB - LATER\n\nOur heroes and Monica pow-wow, sobered by what they have seen.\n\n\t\t\t\t\tMONICA\n\t\tWhat could have made such a horrible noise?\n\n\t\t\t\t\tHELLER\n\t\t\t  (after a moment, gravely)\n\t\tHe's got the Psychostridulator.\n\n\t\t\t\t\tALL\n\t\tThe what?\n\n\t\t\t\t\tHELLER\n\t\tTen years ago the Kremlin's top secret \n\t\tPsychiatric Warfare Division developed a \n\t\tprototype for a weapon that emitted a \n\t\tfluctuating alternative frequency noise that \n\t\tproduced a violent psychotic reaction in any \n\t\tmammal within hearing distance.  But when the \n\t\told Soviet Union fell the stridulator and its \n\t\tbrilliant inventor, Doctor Kopov, disappeared.\n\n\t\t\t\t\tSHOVELER\n\t\tThis Kopov, what happened to him?\n\n\t\t\t\t\tHELLER\n\t\tNot him... her.\n\nThey react to that piece of news, and then the Bowler opens up the \nnewspaper.\n\n\t\t\t\t\tBOWLER\n\t\tDid she look like that?\n\nCLOSE ON A PHOTO of Anabel and Casanova, announcing their wedding \nengagement.\n\n\t\t\t\t\tHELLER\n\t\tYes.\n\nSilence; this is bad.\n\n\t\t\t\t\tSPLEEN\n\t\t\t\t    (hopefully)\n\t\tMaybe it won't work.\n\n\t\t\t\t\tFURIOUS\n\t\tIt works.\n\n\t\t\t\t\tHELLER\n\t\tA village in Siberia was wiped out when a \n\t\tcleaning woman switched it on by mistake.\n\nAnother grim silence, as they realize how desperate the situation is.  \nFor the first time, they're really scared.\n\n\t\t\t\t\tMONICA\n\t\tWe've got to warn the city.\n\n\t\t\t\t\tSHOVELER\n\t\tHow?\n\n\t\t\t\t\tRAJA\n\t\tNo one will believe us.\n\n\t\t\t\t\tBOWLER\n\t\tThey'll think we're just a bunch of weirdoes.\n\nCAMERA CUTS BETWEEN THEM as they look at each other--their frightened \nfaces, their sad, faded costuznes.  Even the Sphinx looks scared.\n\n\t\t\t\t\tFURIOUS\n\t\t\t   (after a moment, grimly)\n\t\tWe know what we gotta do.\n\nThey look at him.\n\n\t\t\t\t\tRAJA\n\t\tWe're outnumbered twenty to one.\n\n\t\t\t\t\tSHOVELER\n\t\tIt's suicide.\n\n\t\t\t\t\tFURIOUS\n\t\tMaybe.  But this isn't about living or dying.  \n\t\tIt's about good versus evil, and we're good, \n\t\twhether we like it or not... Maybe we look a \n\t\tlittle funny...\n\nON THE SPLEEN...\n\n\t\t\t\t\tFURIOUS\n\t\tAnd smell a little funny.  We're not \n\t\tbulletproof and we can't fly. But we're \n\t\tsuperheroes--and that means doing what's right-\n\t\t-even when it's impossible... This is our city-\n\t\t-these are our friends, our famlies--and if we \n\t\tdon't save them, nobody will!  So I say we take \n\t\ta ride up that hill, blast our way in there, \n\t\tdestroy that Psycho-whatchamabob-- and teach \n\t\tthose deviants a lesson they'll never forget!\n\n\t\t\t\t\tSPHINX\n\t\tNow you're talking.\n\n\t\t\t\t\tBOWLER\n\t\tSounds good to me.\n\n\t\t\t\t\tRAJA\n\t\tLet's do it.\n\n\t\t\t\t\tSHOVELER\n\t\tAnd we'll take a bunch of 'em with us!\n\nThey're all with him.  Monica steps forward.\n\n\t\t\t\t\tMONICA\n\t\tI just want you guys to know--I may not be a \n\t\tsuperhero, but I'm with you--and I want to \n\t\thelp!\n\n\t\t\t\t\tALL\n\t\tOh that's great... Thanks, Monica...  (Etc.)\n\n\t\t\t\t\tBOWLER\n\t\tWe could really use some coffee--\n\n\t\t\t\t\tSHOVELER\n\t\tAnd some sandwiches--\n\n\t\t\t\t\tSPLEEN\n\t\tWith mustard!\n\n\t\t\t\t\tMONICA\n\t\t\t(her feelings a little hurt)\n\t\tSure.\n\nA few minutes later, Monica serves sandwiches and coffee as our heroes \nplan...\n\n\t\t\t\t\tRAJA\n\t\tBut that place is huge and we don't know where \n\t\tthis psycho thing is--\n\n\t\t\t\t\tBOWLER\n\t\tOr even what it looks like.\n\n\t\t\t\t\tHELLER\n\t\tAnd he must have it well hidden.\n\n\t\t\t\t\tFURIOUS\n\t\tWe'll just have to get lucky.\n\nON MONICA as she gets an idea.  A moment later she slips a canned \ntornado into her purse... as the others put their arms around each \nother in a group huddle\\embrace.\n\n\t\t\t\t\tFURIOUS\n\t\tGo do what you gotta do.  We'll meet back here \n\t\tat sunset... Do or die.\n\n\t\t\t\t\tALL\n\t\tDo or die.\n\n\t\t\t\t\tSPHINX\n\t\tVictoria o morte.\n\nHEROIC MUSIC as...\n\nEXT.  AUTO DEMOLITION YARD - DAY - CLOSE ANGLE ON\n\nTHE FRONT GRILL of the Herkimer Battle Jitney... as Mister Furious \nhooks it up to the \"Sally's Auto Demolition\" tow truck... A moment \nlater he drives the tow truck, towing the off the lot, as Sally steps \nout of her office, pissed off...\n\n\t\t\t\t\tSALLY\n\t\tHEY!\n\nEXT.  HELLER'S FARM - DAY\n\nON THE SPHINX, standing as immobile and silent as a statue... as a \nfalling leaf slowly flutters down in front of him... In a flash, his \nmachete slices through the air, and the leaf continues fluttering down, \nbut in two pieces...\n\nINT.  LABORATORY/BARN - DAY\n\nDoc Heller fine tunes his Shrinker spray... as the Bowler sits quietly \nin the hayloft, studying the old dog eared photo of her father and \nherself as a little girl...\n\nINT.  INVISIBLE BOY'S ROOM - DAY\n\nInvisible Boy stands in front of his mirror, eyes closed, concentrating \nfor all he's worth, trying to become invisible...  He suddenly pops \nopens his eyes and looks at himuself in the mirror... but he's still \ncompletely visible. He flops onto his bed in frustration.\n\nINT.  THE DINER - DAY\n\nCLOSE ON A TABLE full of food... Eggplant Parmesan, broccoli, chili... \nCAKERA PULLS BACK TO REVEAL the Spleen sitting alone in the booth, \nstuffing his face, gassing up for battle.\n\nINT.  THE SHOVELER'S HOUSE - DAY\n\nThe Shoveler, standing in his bedroom, has just put on his freshly \nlaundered suit.  CAMERA OPENS WIDE TO REVEAL Lucille, his wife, \nstanding there, holding his just polished shovel. He takes it from her, \nthen takes her in his arms.\n\n\t\t\t\t\tSHOVELER\n\t\tBaby, if I don't make it... find yourself... a \n\t\tnormal guy.\n\n\t\t\t\t\tLUCILLE\n\t\tI don't want a normal guy.\n\nAnd they kiss.\n\nA few minutes later... In the living room the Shoveler's kids lie \nsprawled in front of the television.  The Shoveler, in battle array, \nsteps into the room.  Be wants to say something to them, but the kids \ndon't even take their eyes off the TV look at him... He turns and walks \nout in silence.\n\nEND MUSIC...\n\nINT.  THE RAJA'S DINING ROOM - DAY\n\nThe shades are drawn.  The Raja, in full costume, quietly loads \nsilverware into the secret pockets of his cape. Suddenly, the light \nswitches on... It's his mother.  She's caught him red handed.\n\n\t\t\t\t\tMOTHER\n\t\tJeffrey, YOU THIEF!\n\n\t\t\t\t\tRAJA\n\t\tMother... it's not what you think!\n\n\t\t\t\t\tMOTHER\n\t\tAnd why are you wearing that silly costume?\n\n\t\t\t\t\tRAJA\n\t\t\t\t   (painfully)\n\t\tBecause... I'M A SUPERHERO!\n\nON HIS MOTHER, shocked.\n\n\t\t\t\t\tRAJA\n\t\tOh, Mother, I'm sorry.  I know how much you \n\t\twanted me to be a doctor or a lawyer with a \n\t\tfamily--but it's just not who I am!\n\n\t\t\t\t\tMOTHER\n\t\tBut... the silverware?\n\n\t\t\t\t\tRAJA\n\t\tI use it... to fight evil.\n\n\t\t\t\t\tMOTHER\n\t\t\t\t(after a moment)\n\t\tJeffrey... this is wonderful.\n\n\t\t\t\t\tRAJA\n\t\t\t\t    (stunned)\n\t\tIt is?\n\n\t\t\t\t\tMOTHER\n\t\tI always knew that you were special.\n\n\t\t\t\t\tRAJA\n\t\tYou did?\n\n\t\t\t\t\tMOTHER\n\t\tEver since you were a little boy...\n\t\t\t(gets an idea, excited)\n\t\tCome with me.\n\nINT.  UPSTAIRS HALLWAY - A MOMENT LATER\n\nShe pulls down the stairway to the attic...\n\nINT.  THE ATTIC - A MOMENT LATER\n\nShe switches on the light and leads the Raja to a far corner...  where \nshe moves a couple of old hat boxes, REVEALING an ancient leather bound \nbox with the word \"Excalibur\" engraved in gold on the top.\n\n\t\t\t\t\tMOTHER\n\t\tThis is for you.\n\nThe Raja opens the box and registers astonisha~nt as he sees...\n\nA FABULOUS VICTORIAN SILVER SET packed with formidable looking servers, \ncake knives, ice cream forks.\n\n\t\t\t\t\tMOTHER\n\t\tYour Great Great Grandmother's wedding silver.\n\nThe Raja lifts up and handles a large heavily engraved pie server.\n\n\t\t\t\t\tRAJA\n\t\tBitchin'.\n\nEXT.  OUTSIDE HELLER'S BARN/LAB - EVENING - CLOSE ON\n\nMister Furious, wrench in hand, covered with grease and oil, cussing to \nhimself as he works under the hood of the Herkimer.\n\n\t\t\t\t\tFURIOUS\n\t\tTry it again!\n\nInvisible Boy, sitting behind the wheel, tries the ignition of the \nHerkimer, and the old engine grinds as it turns over, but doesn't \ncatch.\n\n\t\t\t\t\tFURIOUS\n\t\tCome on, baby... Come on, baby... I SAID COME \n\t\tON!\n\nMister Furious SLUGS the engine with his fist, and it sputters and \nbackfires into life... shaking, rattling, leaking, exploding, but \nrunning... Furious kisses the Herkimer... as the Bowler calls out to \nhim from the barn.\n\n\t\t\t\t\tBOWLER\n\t\tMon Capitan, it's for you.\n\t\t\t\t(tosses him the phone)\n\n\t\t\t\t\tFURIOUS\n\t\tHello?\n\nEXT.  UNKNOWN LOCATION - EVENING - CLOSE ON MONICA\n\n\t\t\t\t\tMONICA\n\t\t\t(on a phone, speaking very softly)\n\t\tIt's me.\n\nBACK TO FURIOUS - CONTINUOUS\n\n\t\t\t\t\tFURIOUS\n\t\tMonica, where are you?\n\nBACK TO MONICA - WIDER ANGLE\n\nREVEALING that she is on a pay phone just outside the art center.  \nShe's wearing make-up and a sexy little dress; she looks she's dressed \nfor a date.  Disco Boys and security guards go about their business all \naround her.\n\n\t\t\t\t\tMONICA\n\t\tAt the Frankenstein Center.\n\nCUT BACK AND FORTH BETWEEN THEM -\n\n\t\t\t\t\tFURIOUS\n\t\tAre you nuts?  Get out of there!\n\n\t\t\t\t\tMONICA\n\t\tI'm going inside.\n\n\t\t\t\t\tFURIOUS\n\t\tWhat are you talking about?\n\n\t\t\t\t\tMONICA\n\t\tListen, Casanova may be a supervillain, but \n\t\the's got a weakness, and I'm it.  Maybe--just \n\t\tmaybe--I can trick him into showing me the \n\t\tlocation of the whatchamathing.\n\n\t\t\t\t\tFURIOUS\n\t\tHe's a psycho!  He'll kill you!\n\n\t\t\t\t\tMONICA\n\t\tJust shut up and listen.  Hold off the attack \n\t\tas long as you can.  If I can discover the \n\t\tlocation I'll call you--\n\n\t\t\t\t\tFURIOUS\n\t\tAnd what if you get killed?\n\n\t\t\t\t\tMONICA\n\t\tThen at least I will have died trying, right?\n\nFurious silent, taken aback by her courage.\n\n\t\t\t\t\tMONICA\n\t\tRoy... We might never see each other again, so \n\t\tI'd better tell you now...  I think you're \n\t\twonderful.\n\n\t\t\t\t\tFURIOUS\n\t\t\t(caught completely off guard)\n\t\tWhat?\n\n\t\t\t\t\tMONICA\n\t\tBye.\n\t\t\t\t(and she hangs up)\n\n\t\t\t\t\tFURIOUS\n\t\tMonica!\n\nINT.  LOBBY OF THE FRANKENSTEIN CENTER - CONTINUOUS\n\nas Monica approaches a GUARD standing by the main door.\n\n\t\t\t\t\tMONICA\n\t\tCould you tell Mr. Frankenstein that Monica is \n\t\there?\n\n\t\t\t\t\tGUARD\n\t\tSure, doll.\n\nBACK TO THE BARN - CONTINUOUS\n\nFurious stands by the Herkimer, phone still in hand.  He seems \nspeechless, dazed.  Something inside him has changed.\n\n\t\t\t\t\tBOWLER\n\t\t\t\t(worried about him)\n\t\tHey... you okay?\n\n\t\t\t\t\tFURIOUS\n\t\tSure.\n\nBACK TO THE FRANKENSTEIN CENTER - A FEW MINUTES LATER\n\nCasanova steps out and sees... Monica, looking very sexy.\n\n\t\t\t\t\tMONICA\n\t\tHi.\n\n\t\t\t\t\tCASANOVA\n\t\tI thought you'd chickened out on me.\n\n\t\t\t\t\tMONICA\n\t\tJust wanted to... powder my nose.\n\nHis eyes roam all over her; he knows she's up to something, but she \nlooks yummy, and this is just the sort of cat and mouse game he loves.\n\n\t\t\t\t\tMONICA\n\t\tHow 'bout giving me \"the tour\"?\n\n\t\t\t\t\tCASANOVA\n\t\tWhy not?\n\nEXT.  COURTYARD - A FEW MINUTES LATER\n\nas Casanova leads Monica across an open courtyard toward... the sheer \nwalls of the imposing central tower.\n\n\t\t\t\t\tCASANOVA\n\t\tBig, isn't it?\n\nHe leads her to a massive archway, the only apparent entrance to the \ntower.  But just as she is about to pass through, Monica looks up and \nsees something that makes her pull back with fear...\n\nHER POV -\n\nA very sinister looking SECURITY EYE gazes down at her from the top of \nthe archway.\n\n\t\t\t\t\tCASANOVA\n\t\tDon't worry.  It's not activated.\n\nThey pass through and into...\n\nINT.  ROOM IN THE BASE OF TOWER - CONTINUOUS\n\nwhich is filled with IMMENSE BRONZE SCULPTURES of voluptuous, scantily \nclad females in various poses of bondage.  Monica reacts; these things \nare scary.\n\n\t\t\t\t\tMONICA\n\t\tWho's the artist?\n\n\t\t\t\t\tCASANOVA\n\t\tMe.\n\nEXT.  THE BARN/LAB - NIGHT\n\nThe Bowler, Spleen, Invisible Boy, and Doc Heller load up the Herkimer \nwith Heller's weaponry...\n\nas Mister Furious lies sprawled on the hillside... breathing in the \nnight air, contemplating a dandelion gone to seed, and listening to the \nsounds of the night.  The Raja, Shoveler, and Sphinx, stand nearby, \nwatching, trying to figure out what's wrong with him.  A whippoorwill \nis heard singing.\n\n\t\t\t\t\tFURIOUS\n\t\tListen.  He's lonely... and he doesn't care who \n\t\tknows it.\n\nRaja and Shoveler share a bewildered look.  The bird sings again.\n\n\t\t\t\t\tFURIOUS\n\t\tWe're all the same really.  Our songs, our \n\t\tdreams, our seeds are all just a brave attempt \n\t\tto live forever.\n\t\t\t(blows the dandelion seeds into the wind)\n\n\t\t\t\t\tSPHINX\n\t\tHe is in love.  His anger is gone.\n\n\t\t\t\t\tRAJA\n\t\tOh no.\n\n\t\t\t\t\tSHOVELER\n\t\tGreat timing!\n\t\n\t\t\t\t\tFURIOUS\n\t\tHas Monica called?\n\nINT.  TOP OF THE FRANKENSTEIN TOWER - CONTINUOUS\n\nCasanova leads Monica into... a palatial room, filled with priceless \nobjects d'art, all of which reflect Casanova's dark psyche.  A Munch \npainting.  Mayan idols.  Weird German furniture.  A huge glass \nchandelier hovers over the room.  A massive bronze sculpture of a wolf \n(done in the same style as the other sculptures) is perched in the \nbalcony.  It seems to be howling out over the city which is seen in a \nspectacular view, spread out alonq the lakeshore below.\n\n\t\t\t\t\tCASANOVA\n\t\tThis is where I come to... be alone.\n\nHe turns down the lights and quietly closes and locks the big door to \nthe room.\n\nCLOSE ON MONICA, sensing her danger.\n\n\t\t\t\t\tMONICA\n\t\tOh, look at that view.\n\nShe moves out onto the balcony... as Casanova slips the gold chain from \naround his neck and follows her.\n\nINT.  BARN/LAB - CONTINUOUS\n\nOur heroes have gathered around Furious, who sits in a chair, getting \nthe third degree.\n\n\t\t\t\t\tHELLER\n\t\tSnap out of it!\n\n\t\t\t\t\tBOWLER\n\t\tGet on to yourself!\n\n\t\t\t\t\tSHOVELER\n\t\t\t(shouting right in his face)\n\t\tGET MAD!\n\n\t\t\t\t\tFURIOUS\n\t\tBut I just don't feel it.\n\n\t\t\t\t\tRAJA\n\t\tHe's turned into a completely normal person!\n\n\t\t\t\t\tFURIOUS\n\t\tNormal.  What's normal?  Does normal exist?  \n\t\tAnd if it did, how would we know it?\n\nThe Shoveler slugs him, sending him sprawling.\n\n\t\t\t\t\tFURIOUS\n\t\tYou know, Eddie, that was really uncalled for.\n\nEXT.  BALCONY ON FRANKENSTEIN TOWER - ON MONICA\n\ngazing out onto the city, as she senses Casanova slinking up behind \nher.\n\n\t\t\t\t\tMONICA\n\t\tI'm chilly.\n\nShe turns, elegantly avoiding him, and moving back inside.\n\nBACK TO THE BARN/LAB - CONTINUOUS\n\nSpleen holds up Furious' favorite sunglasses.\n\n\t\t\t\t\tSPLEEN\n\t\tLook!  Your favorite sunglasses!\n\t\t\t\t(snaps them in two)\n\n\t\t\t\t\tBOWLER\n\t\tYour Roy Rogers coffee mug!\n\t\t\t(hurls it against the wall)\n\n\t\t\t\t\tSHOVELER\n\t\tYour Spiderman Pez dispenser!\n\t\t\t    (breaks the head off it)\n\n\t\t\t\t\tFURIOUS\n\t\tOkay, you win.  I'm pissed off. I'm seriously \n\t\tpeeved.\n\nThe others groan with frustration.\n\nBACK AT THE FRANKENSTEIN TOWER - CONTINUOUS\n\nMonica moves nervously around the room as Casanova sprawls languorously \non the bed, toying with his gold chain.\n\n\t\t\t\t\tCASANOVA\n\t\tCome here.\n\n\t\t\t\t\tMONICA\n\t\tI'm not that kind of girl.\n\n\t\t\t\t\tCASANOVA\n\t\tThen why are you here?\n\n\t\t\t\t\tMONICA\n\t\tCuriosity.\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t   (with a smile)\n\t\tRemember the cat.\n\nSuddenly, he hears high heels in the hall.  A key is put in the lock--\nCasanova leaps off the bed, grabs Monica and roughly shoves her into \nthe closet.  He leaps back onto the bed, just as the door opens, and \nAnabel, dressed in a lab coat (and wearing high heels) enters.  \nCasanova is completely relaxed, nonchalant.\n\n\t\t\t\t\tANABEL\n\t\tWhat are you doing all alone in the dark?\n\n\t\t\t\t\tCASANOVA\n\t\tFantasizing... about you.\n\nShe crosses the room to the wolf sculpture.\n\n\t\t\t\t\tCASANOVA\n\t\tI thought you were done?\n\n\t\t\t\t\tANABEL\n\t\tOne last tweak.\n\nShe opens a secret panel on its back, REVEALNG a FLASHING HIGH TECH \nINTERIOR... and Monica, watching from the closet, realizes that she has \nfound the Psychostridulator.\n\nBACK TO THE BARN/LAB - CONTINUOUS - CLOSE ON\n\na boom box... A CD jacket tells us that \"Kenny G.\" is playing...\n\n\t\t\t\t\tRAJA\n\t\tIf this doesn't do it, nothing will!\n\nON FURIOUS, a pair of headphones on his head.  The music is so loud \nthat we can hear it even though it's being played only through the \nheadphones.\n\nON THE OTHERS, gathered around him, waiting to see if this will work.  \nAnd then Furious begins to respond... as his face turns into a \ncontorted grimace.\n\n\t\t\t\t\tBOWLER\n\t\tIt's working!\n\nFurious groans and writhes... The others are thrilled; they've done it!\n\n\t\t\t\t\tFURIOUS\n\t\tThis music is just SO BEAUTIFUL!\n\nHe starts to weep.  The others give a collective groan of defeat.\n\nBACK AT THE FRANKENSTEIN TOWER - COHTINUOUS\n\nas Anabel works on the Psychostridulator, Monica looks at a clock... \nwhich reads almost eleven.  Time is running out.\n\nBACK TO THE BARN/LAB - CLOSE ON SHOVELER'S WRISTWATCH\n\nwhich also reads eleven.\n\n0N SHOVELER AND RAJA -\n\n\t\t\t\t\tSHOVELER\n\t\tIt's time.\n\n\t\t\t\t\tRAJA\n\t\tWith or without him, we gotta go!\n\nBACK TO THE FRANKENSTEIN TOWER -\n\nas Anabel closes up the wolf... and starts to leave.\n\n\t\t\t\t\tANABEL\n\t\tOur guests are waiting.\n\n\t\t\t\t\tCASANOVA\n\t\tI'll be down in a jiffy.\n\nShe goes out.  Casanova listens as the sound of high heels fades away, \nthen he goes to the closet and lets Monica out.\n\n\t\t\t\t\tMONICA\n\t\tI'd better go.\n\n\t\t\t\t\tCASANOVA\n\t\tYou're a spy.\n\n\t\t\t\t\tMONICA\n\t\t\t\t    (offguard)\n\t\tWhat?\n\n\t\t\t\t\tCASANOVA\n\t\tI saw him walk you home.\n\n\t\t\t\t\tMONICA\n\t\tWho?\n\n\t\t\t\t\tCASANOVA\n\t\tRoy.\n\nShe makes a sudden try for the door, but he blocks her way, a cold look \nin his eye that makes her step back in fear.\n\n\t\t\t\t\tCASANOVA\n\t\tDon't be afraid... I never hit a lady...\n\nHe lets the gold chain drop loose in his hand, then starts coming for \nher, a sadistic grin on his face.  This is the real Casanova.\n\nMonica pulls back, then reaches into her purse and takes out A CANNED \nTORNADO, which she holds out threateningly.\n\n\t\t\t\t\tMONICA\n\t\tStay away!\n\n\t\t\t\t\tCASANOVA\n\t\tOr you'll what?  CAN ME?\n\nHe laughs dementedly as Monica pops open the can and A SWIRLING FUNNEL \nOF AIR SHOOTS OUT OF IT and ENGULFS Casanova, throwing him across the \nroom... Monica grabs the handset of a cordless phone and runs out the \ndoor.\n\nON CASANOVA, pulling himself together.\n\n\t\t\t\t\tCASANOVA\n\t\tThat bitch!\n\nINT.  CORRIDOR JUST OUTSIDE - CONTINUOUS\n\nas Monica runs for it, dialing the phone on the fly...\n\nINT.  TEE BARN/LAB - CONTINUOUS - ON THE PUONE\n\nringing... but no one is there...\n\nEXT.  THE BARN/LAB - CONTINUOUS\n\nOur heroes are climbing into the Herkimar, whose noisy idling engine \nobliterates the ringing of the phone.\n\n\t\t\t\t\tFURIOUS\n\t\tBut she still might call!\n\n\t\t\t\t\tSHOVELER\n\t\tAre you coming or not?\n\n\t\t\t\t\tFURIOUS\n\t\tI'll drive.\n\n\t\t\t\t\tSHOVELER\n\t\tNot a chance!\n\nHe shoves him in the back, closing the heavy steel door behind him.\n\nBACK TO THE FRANKENSTEIN TOWER - CONTINUOUS - ON MONICA\n\nhiding behind a large planter... listening to the phone ringing on the \nother end.\n\n\t\t\t\t\tMONICA\n\t\tCome on, guys... Pick up... \n\nSuddenly, we hear Casanova's voice on the line.\n\n\t\t\t\tCASANOVA'S VOICE\n\t\tWhat's the matter...\n\nBACK IN THE TOWER ROOM - CONTINUOUS\n\nCasanova is listening in on another phone.\n\n\t\t\t\t\tCASANOVA\n\t\tNobody home?\n\nBACK TO M0NICA - CONTINUOUS\n\nas she moves quickly down the hall.\n\nINSIDE THE HERKIMER - CONTINUOUS\n\nThe Shoveler is at the wheel.  The Raja sits in the passenger seat.  \nThe others are in the back.\n\n\t\t\t\t\tSHOVELER\n\t\tHere we go!\n\nHe forces the stick into gear and the Herkimer lurches forward.\n\n\t\t\t\t\tSHOVELER\n\t\tWe've got lift off!\n\n\t\t\t\t\tRAJA\n\t\tMay the forks be with us!\n\nEXT.  DOC HELLER'S HOUSE - CONTINUOUS\n\nas the Herkimer--backfiring, smoking, clanging--rumbles down the \ndriveway into action.\n\nBACK IN THE HERKINER - CONTINUOUS\n\nShoveler tries to put the car in second gear, but it won't go. He yanks \nand pulls and struggles, until the stick comes off in his hand.\n\n\t\t\t\t\tRAJA\n\t\tFirst is good.\n\nINT.  CORRIDOR IN FRANKENSTEIN TOWER - CONTINUOUS\n\nCasanova instructs three security guards.\n\n\t\t\t\t\tCASANOVA\n\t\tI want her alive.\n\n\t\t\t\t\tGUARDS\n\t\tYes, Mr. Frankenstein.\n\nCAMERA PANS UP the top of a staircase... where Monica is crouched, \nlistening.\n\nEXT.  STREETS OF CHAMPION CITY - NIGHT\n\nVARIOUS SHOTS as the Herkimer rumbles and smokes down Champion's main \nstreet (in first gear) and the citizens step out of houses and bars to \nwatch this bizarre sight.\n\nON A LITTLE BOY AND HIS FATHER -\n\n\t\t\t\t\tLITTLE BOY\n\t\tDaddy, what is that thing?\n\n\t\t\t\t\tFATHER\n\t\tI don't know, son.\n\nA couple of GRIZZLED CHARACTERS stand in front of a bar.\n\n\t\t\t\t\tDRUNK\n\t\tA Herkimer?  Those yuppies will drive anything.\n\nINSIDE THE HERKIMER - CONTINUOUS\n\nON FURIOUS AND THE OTHERS in the back.\n\n\t\t\t\t\tSPHINX\n\t\tAmigo, we need you.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tJust GET MAD!\n\nFurious closes his eyes and tries, but it's hopeless.\n\nINT.  V.I.P. LOUNGE IN FRANKENSTEIN TOWER - CONTINUOUS\n\nA sumptuous, hotel-like lounge.  Anabel is holding court with all of \ntop crooks from the luncheon, charrning the pants off them... Casanova \nslithers up behind her.\n\n\t\t\t\t\tCASANOVA\n\t\tFellas, this is woman without whom I would have \n\t\tgone sane.\n\t\t\t\t(kisses her neck)\n\nEXT.  FRONT GATE OF THE FRANKENSTEIN CENTER - CONTINUOUS\n\nA pair of security guards (the same two who got gassed by the Spleen) \nare on duty, when they see... a strange looking vehicle chugging up the \nhill straight for them.\n\n\t\t\t\t\tGUARD 1\n\t\tWhat the hell is that?\n\n\t\t\t\t\tGUARD 2\n\t\tLooks like... a Ford Dumpster.\n\nThey have a good laugh at it, then hold up their hands for it to \nstop...  But the Herkimer just rolls past them, hitting the iron gates \nand snapping them open as if they were made of match sticks.\n\n\t\t\t\t\tGUARDS\n\t\tHEY!\n\nThey open fire.\n\nINSIDE THE HERKIMER - CONTINUOUS\n\nBullets are heard pinging off the Herk as THROUGH THE WINDSHIELD just \nahead we see the long stairway heading up to the front door of the art \ncenter.\n\n\t\t\t\t\tSHOVELER\n\t\tHang on!\n\nEXT.  ON THE STAIRS - CONTINUOUS\n\nSeveral more guards open fire, as the Herkimer hits the stairs and \nstarts bouncing up them...\n\nBACK AT THE LOUNGE - ON CASANOVA\n\nchecking his watch.\n\n\t\t\t\t\tCASANOVA\n\t\tIt's showtime.\n\nBut then they all hear... the sound of gunfire.\n\n\t\t\t\t\tTONY P\n\t\tWhat's that?\n\nBACK ON THE STAIRS - CONTINUOUS\n\nas the Herkimer chugs and bounces... toward the entrance of the center.\n\nINSIDE THE HERKIMER - CONTINUOUS\n\nOur heroes get bounced all over the place.\n\nINT.  JUST INSIDE THE CENTER - CONTINUOUS\n\nas guards close and bolt the big wooden doors to the art center.\n\nON A GUARD wearing a headset.\n\n\t\t\t\t\tGUARD\n\t\tMr. Frankenstein, we're being attacked.\n\nINT.  SECURITY DESK - CONTINUOUS\n\nCasanova sits at a security console.  Anabel, Tony P, and the top \ncrooks stand behind him, listening.\n\n\t\t\t\t\tCASANOVA\n\t\tBy whom?\n\n\t\t\t\t\tVOICE OF GUARD\n\t\tWe don't know!\n\nBACK ON THE STAIRS - CONTINUOUS\n\nas the Herkimer climbs to the top, then rams into the doors with a \nthud.  But the doors hold.\n\nBACK ON THE VILLAINS -\n\n\t\t\t\t\tTONY P\n\t\tThey'll never get through those doors.\n\nBACK AT THE FRONT DOOR - CONTINUOUS\n\nBut the plucky little Herkimer digs in its rear wheels and pushes \nagainst the doors like the Little Engine That Could...\n\nINSIDE THE HERKIMER - CONTINUOUS\n\nas our heroes encourage the Herk.\n\n\t\t\t\t\tSHOVELER\n\t\tCome on, baby!\n\n\t\t\t\t\tBOWLER\n\t\tDo it, big boy!\n\nON ITS WHEELS, grinding, chewing up the concrete... \n\nJUST INSIDE THE CENTER - CONTINUOUS\n\nas the Herkimer comes crunching through the big wooden doors of the \ncenter, scattering the guards.\n\nBACK INSIDE THE HERKIMER - CONTINUOUS\n\nour heroes cheer, pat the Herk.\n\n\t\t\t\t\tSHOVELER\n\t\tAtta, girl!\n\n\t\t\t\t\tBOWLER\n\t\tAtta, boy!\n\nBACK TO CASANOVA -\n\nwatching on a security monitor\n\n\t\t\t\t\tVOICE OF GUARD\n\t\tMr. Frankenstein, they're in!\n\n\t\t\t\t\tCASANOVA\n\t\tWell kill them.\n\nBACK IN THE HALL - CONTINUOUS\n\nThe Herkimer drives into the main hall of the center as a small army of \nsecurity guards swarms in, guns blazing.\n\nBACK AT THE SECURITY DESK - CONTINUOUS\n\nCasanova and the crooks watch the security monitor...\n\nINSIDE THE HERKIMER - CONTINUOUS\n\nThe bullets sound like hailstones bouncing off the armor of the Herk as \nour heroes grimly prepare themselves for battle...The Sphinxs puts on \nhis mask... the Bowler unzips her bag...Doc Heller cocks his air \ncannon... Spleen and Invisible Boy load a bag with canned tornadoes... \nWhile Mister Furious watches anxiously.\n\nThe Shoveler drives intently, bullets splattering like bugs on the \nwindshield.\n\n\t\t\t\t\tSHOVELER\n\t\tWhere am I going?\n\n\t\t\t\t\tRAJA\n\t\t\t(pointing to an archway on the\n\t\t\t\tother side of the hall)\n\t\tThrough there!\n\n\t\t\t\t\tSHOVELER\n\t\tRight.\n\nBut suddenly something under the hood blows up; the engine gives a long \ngroan, and the Herkimer rolls to a dead stop...\n\nINSIDE/OUTSIDE THE HERIKINER - CONTINUOUS\n\nRight in the middle, in the most exposed position of the main hall.  \nMore guards arrive and open fire... An armored golf cart with a fifty \ncaliber machine gun mounted on it comes speeding into the hall, \nblasting the Herk...\n\nInside, the sound of the big bullets is deafening as Shoveler tries to \nrestart the engine.\n\n\t\t\t\t\tSHOVELER\n\t\tNo good!  She's dead!\n\nON CASANOVA AND THE CROOKS, watching the monitor and laughing as \nbullets pulverize the Herk.\n\n\t\t\t\t\tTONY P\n\t\tSpam in a can!\n\nThe crooks laugh.\n\nButsuddenly, the Herkimer's door is thrown open, revealing our heroes--\nholding down Doc Heller, his air cannon at the ready. He fires--there \nis a WHOOMPH of air--and the mounted gun and a dozen guards are sent \ntumbling...\n\nSECURITY DESK - CONTINUOUS - ON CASANOVA AND THE OTHERS\n\nwatching, sobered.\n\nBACK IN THE MAIN HALL - CONTINUOUS\n\nas our heroes come charging out of the Herkimer, using their various \nskills to blow through the surprised guards.  Mr. Furious comes out \nlast, not quite sure what to do with himself.\n\nBut suddenly, a withering barrage of machine gun fire is being laid \ndown on them by three guards firing tommy guns from a balcony \noverlooking the floor.  Bullets splatter all around them--and several \nunlucky guards are hit--but our heroes dive for cover. The Raja tries \nto get off a fork, but the firing is too intense.  Our heroes are \npinned down.\n\nON MR. FURIOUS as he sees... the bag of canned tornadoes. He's got no \nsuperpowers, and he's scared to death, but he grabs a canned tornado.\n\n\t\t\t\t\tFURIOUS\n\t\tCover me!\n\n\t\t\t\t\tSHOVELER\n\t\tWith what?\n\nBullets dancing all around him, Furious runs a desperate (but \nimpressive) zig-zag pattern across the floor... He performs a wild \nsomersault, comes up on his feet, pops open the can, and executes a \nperfect jump shot, lobbing it right into the balcony.  The tornado \nfunnels out, and the guards are sent flying.\n\nON CASANOVA AND THE TOP CROOKS watching...\n\n\t\t\t\t\tELVIS BROTHER 1\n\t\tWho are those guys?\n\nCLOSE ON CASANOVA, who knows who they are.\n\nWHILE BACK IN THE HALL our heroes rally around a shaken Mr. Furious.\n\n\t\t\t\t\tRAJA\n\t\tNot bad for a normal guy!\n\n\t\t\t\t\tSPHINX\n\t\tAmigos!\n\n\t\t\t\t\tALL\n\t\tDo or die!\n\nEXT.  COURTYARD - A MOMENT LATER - ANGLE ON\n\nthe security eye watching...\n\nas the panicking security guards retreat under it into the main tower.\n\nBACK TO CASANOVA -\n\nas he types something into the security computer...\n\nON THE SCREEN a computerized image of the eye appears. Casanova \nhighlights the word \"Activate\" and then presses \"Enter\".\n\nBACK TO THE COURTYARD - ON THE EYE\n\nas it comes to glowing, sinister life...\n\nA hapless guard retreats under the arch--the Eye instantly focuses on \nhim, and he is hit by a dozen nasty looking laser beams... that SIZZLE \nHIM...\n\nA moment later our heroes arrive at the arch.  Furious is about to run \nthrough, but Doc Heller holds him back.\n\n\t\t\t\t\tHELLER\n\t\tWait!  Look!\n\nHe points to... a man shaped pile of charcoal, all that remains of the \nunfortunate guard.\n\n\t\t\t\t\tHELLER\n\t\tLaser eye... and it's a humdinger.\n\n\t\t\t\t\tRAJA\n\t\tNo problem.\n\nThe Raja takes out a butter knife, aims, and hurls it straight at the \neye, but laser beams intercept the knife and instantly melt it into... \na formless blob of silver.\n\nBACK TO CASANOVA AND THE TOP CROOKS -\n\n\t\t\t\t\tTONY P\n\t\tWe'll take care of these clowns.\n\n\t\t\t\t\tELVIS BROTHER 2\n\t\tPiece a cake.\n\n\t\t\t\t\tBONE HEAD LEADER\n\t\tNo sweat.\n\nCORRIDOR - A MOMENT LATER\n\nas Tony P, the top crooks, and the Disco Boys march en masse TOWARD THE \nCAMAERA... They are an ugly, formidable looking bunch.\n\nEXT.  COURTYARD - CONTINUOUS\n\nOur heroes are blocked by the eye.\n\n\t\t\t\t\tSHOVELER\n\t\tDoc, there's got to be a way.\n\nBut the Doc is stymied... Suddenly they hear a woman's voice calling \ndown to them.\n\n\t\t\t\t\tMONICA'S VOICE\n\t\tIt's up here!  It's up here!\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t     (looks up)\n\t\tMonica!\n\nEXT.  TOP OF THE FRANKENSTEIN TOWER - CONTINUOUS\n\nMonica leans over the edge of the balcony, the wolf sculpture looming \nover her, shouting down at them.\n\n\t\t\t\t\tMONICA\n\t\tROY!  THE PSYCHO THING IS--!\n\nBut strong hands suddenly grab her.  It's Casanova.\n\nBACK TO FURIOUS - CONTINUOUS\n\nas high above he hears Monica scream.\n\nBACK TO THE BALCONY - CONTINUOUS\n\nCasanova, hand held tightly across Monica's mouth, shouts down \ntauntingly to Furious.\n\n\t\t\t\t\tCASANOVA\n\t\tThanks, Roy!  She's just my type. You can have \n\t\ther back... when I'm done!\n\nBACK T0 FURIOUS - CONTINUOUS\n\nas he hears Casanova's evil laugh and Monica's scream.  He is desperate \nto find a way up, but the wall is completely sheer. He feels helpless-\nfrantic, near tears...\n\nFLASH TO the terrified little boy trapped in the back of his p8arents' \ncar, crying, pounding on the windows...\n\nAnd then... Mr. Furious' hands clench into fists--his hair stands up--\nand his face turns into a mask of primordial rage. His button has \nfinally been pressed.  Be's MAD!  He reaches up as high as he can...\n\nCLOSE ON HIS HAND -\n\nas his fingers literally dig into the concrete of the wall... and he \npulls himself up.\n\nBACK AT THE TOP 0F THE TOWER - CONTINUOUS\n\nCasanova throws Monica onto the bed, puts his hands on her throat and \nstrangles her as she thrashes helplessly against his immense strength.\n\nBACK TO FURIOUS -\n\nFifty feet up and climbing.  He pulls himself up, one hand, then \nanother, digging in his fingernails, catchng his toes on whatever tiny \ncracks he can find... as the others gaze up at him.\n\n\t\t\t\t\tHELLER\n\t\tHe'll never make it.\n\n\t\t\t\t\tBOWLER\n\t\tThink positive.\n\nMeanwhile, Invisible Boy stands staring at the security eye, a look of \nfierce determination on his face.  This is his moment.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\t\t\t\t(to himself)\n\t\tI can do it.\n\nHe takes a deep breath, closes his eyes, and concentrates...\n\nON FURIOUS as the fingers of one hand lose their grip and a toehold \ngives way... For a desperate moment, Furious is dangling off the wall \nby the tips of the fingers of one hand. Only his incredible rage keeps \nhis fingertips taut.\n\nSuddenly, there is a flash of silver, and a large cake fork embeds in \nthe concrete not far from his head.  Furious grabs hold of it, and \nthrows a grateful look down to the Raja...\n\nWho salaams up at him...\n\nAs Invisible Boy, eyes closed in concentration, walks very slowly, \nhands at his sides, in an almost Egyptian pose... toward the eye... \nwhich stares down mercilessly, waiting for its next victim...\n\nwe notice that Invisible Boy has become... just slightly transparent.\n\nAT THE TOP OF THE TOWER - CONTINUOUS - ON CASANOVA\n\na look of pleasure on his face as he strangles Monica.  Her resistance \nfades.  Her hands fall away.  She is pale, beautiful, almost gone, a \npicture of exquisite death.\n\n\t\t\t\t\tCASANOVA\n\t\t\t\t   (admiring her)\n\t\tSome girls just know how to die.\n\nSuddenly, we hear someone cursing Casanova in Russian. He turns and \nsees... Anabel standing there, pistol in hand.\n\n\t\t\t\t\tANABEL\n\t\tYou two timing psychotic bastard.\n\n\t\t\t\t\tCASANOVA\n\t\tDarling, you've got the wrong idea.\n\n\t\t\t\t\tANABEL\n\t\t\t\t(aiming at his heart)\n\t\tDo I?\n\n\t\t\t\t\tCASANOVA\n\t\tI was only strangling her... I've killed hundreds of women.  \n\t\tIt doesn't mean a thing.\n\t\t\t\t(moving toward her, turning on\n\t\t\t\tthat old Frankenstein Charm)\n\t\tPootchkie, you're over-reacting. This is our \n\t\tnight.  It's what we've lied for... cheated \n\t\tfor... murdered for.  She's just a plaything, a \n\t\ttrifle... You're the only woman who's ever \n\t\tmeant anything to me. I adore you.  I worship \n\t\tyou.  I want to make you my bride.\n\nShe succumbs to his charms, and he gently takes the pistol out of her \nhand.\n\n\t\t\t\t\tCASANOVA\n\t\tThere's just one thing...\n\t\t\t\t(with a psychotic smile)\n\t\tI don't need you anymore.\n\nA look of terror comes across her face as she sees the murder in his \neyes.\n\n\t\t\t\t\tCASANOVA\n\t\tDon't worry, Darling.  I never hit a lady.\n\nEXT.  ON THE WALL - A MOMENT LATER - ON FURIOUS\n\nstill climbing as he hears a scream, looks up... and sees Anabel go \nplummeting past him.\n\nON OUR HEROES down below.\n\n\t\t\t\t\tBOWLER\n\t\tHeads up!\n\nCAMERA HOLDS ON OUR HEROES, wincing as Anabel hits with an ugly thud.\n\nSuddenly they hear Invisible Boy calling to them.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tGuys, I did it! I did it!  I'm invisible!\n\nThey all turn and see... Invisible Boy, totally visible, but standing \non the other side of the arch.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tCan you see me?\n\n\t\t\t\t\tALL\n\t\tYes!\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tNuts.\n\n\t\t\t\t\tSHOVELER\n\t\tKid, turn that thing off!\n\nInvisible Boy turns and sees... a computer screen built into the wall \n(with the same image of the eye on it that was on Casanova's computer), \nbut he doesn't have a clue how to turn it off.  Suddenly, he hears \nrunning feet, turns and sees...\n\nThe top crooks and the Disco Boys rushing towards him through the giant \nsculptures.  He gets an idea... and stands right in front of the \ncomputer screen.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tHEY! CREEPS!\n\nHe makes a face at them--and a dozen guns are instantly fired at him.  \nHe jumps clear behind a pillar--as the bullets smash into the wall... \none of them demolishing the computer screen.\n\nCLOSE ON THE EYE -\n\nas it goes dead.\n\nON INVISIBLE BOY, hiding behind the pillar... realizing he's been shot \nin the shoulder.\n\nBACK ON OUR HEROES -\n\n\t\t\t\t\tSHOVELER\n\t\tThis is it!  DO OR DIE!\n\nThe villains form a line, bristling with pistols... as our heroes, led \nby Sphinx, Shoveler, and Bowler come running through the arch.  The \nthreesome go shoulder to shoulder (with our other heroes right behind \nthem) as the villains open fire, laying down a deadly fusillade...\n\nON SHOVELER, BOWLER, AND SPHINX, standing together, deflecting their \nbullets with shovel, bowling ball, and machete... (as they practiced \nwith pebbles at the farm)... with the Raja right behind them, hurling \nsilverware...\n\nON THE VILLAINS, rapid firing... but their own bullets ricochet back \ninto them, dropping them... They start to fall back.\n\nBACK TO THE TOP OF THE TOWER - CONTINUOUS\n\nCasanova is about to finish Monica.\n\n\t\t\t\t\tCASANOVA\n\t\tAnd the light goes out...\n\n\t\t\t\t\tFURIOUS (0.S.)\n\t\tFrankenstein!\n\nCasanova turns and sees... Furious, standing on the balcony.\n\n\t\t\t\t\tCASANOVA\n\t\tRoy... What took you so long?\n\nFurious starts at Casanova, who aims Anabel's pistol at him. Furious \nhesitates.\n\n\t\t\t\t\tCASANOVA\n\t\tLet me guess... Bullets don't hurt you.\n\n\t\t\t\t\tFURIOUS\n\t\tThey hurt... BUT THEY DON'T STOP ME!\n\nFurious lunges at Casanova--who gets off a shot before Furious grabs \nthe gun out of his hand.  Casanova ducks clear.  Furious tosses the \npistol away... then realizes he's bleeding from a shoulder wound.\n\n\t\t\t\t\tCASANOVA\n\t\tSmarts, doesn't it?... Shall we dance?\n\nHe turns on his stereo and the sound of DISCO MUSIC fills the air...\n\nINTERCUT BETWEEN THE TWO FIGHTS - CONTINUOUS\n\nDownstairs, the villains have regrouped.\n\n\t\t\t\t\tTONY P\n\t\tLet's rush 'em!\n\nThey charge en mass at our heroes... who are waiting for them... \npinching their noses closed, the Spleen bent over at their forefront...\n\nWhile Casanova dances around Furious like a cat... Furious, fighting \nthe pain of his bullet wound, lunges at him, and Casanova neatly \nsidesteps him...\n\nThe crooks and Disco Boys fall back, gasping, choking in the noxious \nfumes...\n\nAs Casanova attacks...\n\nAdvancing shoulder to shoulder, fighting as a team, our heroes wield \nmachete, fork, shovel, bowling ball, and canned tornado... forcing the \nvillains back...\n\nCasanova comes at Furious relentlessly, kicking and spinning...  and \nFurious gets the worst of it.\n\nSuddenly, a squad of Disco Boys comes charging at our heroes from the \nflank... but Doc Heller turns to face them, shrinker spray held Rambo-\nstyle on his hip.  He lets them have it, blasting them with a DENSE \nBLUE SPRAY...\n\nWhen the spray clears, the D Boys lie squirming on the floor, prisoners \nin their now child sized disco suits...\n\n\t\t\t\t\tDISCO BOYS\n\t\tHelp!... Get me out of this!\n\t\t\t\t        (Etc.)\n\nUpstairs, Casanova pummels Furious...\n\nWhile, downstairs, the Shoveler dispatches the Elvis Brothers with some \nnifty shovel work... But suddenly, the Bland Boys, pistols blazing, are \nadvancing on him, forcing him back against the base of a sculpture.  \nBut the Raja suddenly leaps up onto the sculpture.\n\n\t\t\t\t\tRAJA (0.S.)\n\t\tGentlemen!\n\nThe Bland Boys look up and see... the Raja, both hands filled with \nsilverware... which he HURLS...\n\nA beat later the Bland Boys, bristling with forks and grapefruit \nspoons, run screaming through the sculptures... as Tony P, pistol in \nhand, skulks out from behind a sculpture and spots... the Bowler.\n\nUpstairs, Furious goes flying against a wall...\n\n\t\t\t\t\tCASANOVA\n\t\tRoy, you're making this too easy.\n\nAs Tony P takes a careful bead on the Bowler.\n\n\t\t\t\t\tTONY P\n\t\tSay hello to Daddy for me!\n\nHe opens fire, but she goes instantly into her ball svinging frenzy... \nHe fires, missing--she's too fast to keep a bead on... Finally, his gun \nclicks empty.  She turns and faces him.\n\n\t\t\t\t\tBOWLER\n\t\t\t\t     (grimly)\n\t\tDaddy says hello.\n\nShe HURLS the ball at him--like a fiery softball pitch.\n\nBALL'S POV -\n\ngoing straight for Tony P's SCREAMING head...\n\nON THE BOWLER, watching--as Tony's scream is cut short by a gruesose \nthud.\n\nBack upstairs Casanova cornmes at Furious again... but Furious ducks \nthe kick, pops back up and smashes Casanova with his good arm... \nsending him flying across the room... Casanova recovers.\n\n\t\t\t\t\tCASANOVA\n\t\tLet's change the tune.\n\nHe reaches into his pocket and takes out the remote device (that Anabel \nused at the luncheon).  He presses a button...\n\nON THE WOLF SCULPTURE as the jaws open, its eyes glow red... and the \ndreadful sound of the Psychostridulator grinds up and FILLS THE NIGHT \nAIR LIKE A SIREN.\n\nDownstairs, the foul noise fills the room and our heroes and the \nvillains all go into a full blown psychotic episode... The villains \nstart shooting and stabbing each other.\n\nSERIES OF SHOTS - AROUND THE CITY - CONTINUOUS\n\nOn Main Street cars slam into each other.  Pedestrians start screaming \nand fightinq... A man and his dog snarl and snap at each other...\n\nThe Customers at the Lakeside Diner go insane, hurling plates and \nfood...\n\nAt the Shoveler's house the kids turn psycho in front of the \ntelevision...\n\nANGLE ON A TYPICAL SUBURBAN NEIGHBORHOOD -\n\nas the sounds of screaming and smashing dishes and furniture can be \nheard coming from all the houses...\n\nLONG ANGLE OF CHAMPION CITY -\n\nas a din of collective insanity rises up from the city...\n\nBACK TO THE TOP OF THE TOWER - CONTINUOUS - ON CASANOVA\n\nin full psychotic ecstasy...\n\n\t\t\t\t\tCASANOVA\n\t\tWHAT A RUSH!\n\t\t\t(tosses the remote off the balcony)\n\nON MONICA, still motionless on the bed...\n\nCasanova and Furious collide in the center of the room and grapple in a \ncontest of psychotically enhanced superhuman strength... Casanova gets \nhis hands around Furious's throat and crushes it... Furious drops to \nhis knees, and Casanova thinks he's got him.  But Furious, grimacing \nwith rage, looks him right in the eye.\n\n\t\t\t\t\tFURIOUS\n\t\t\t\t   (raspy voiced)\n\t\tIs... that... all you got?\n\nFurious grabs Casanova's wrists... and crushes them.  Casanova howls \nwith pain, loses his grip.  Furious slugs him, again and again... then \nhe grabs Casanova by the belt, swings him around, and HURLS him into \nthe air...\n\nCasanova CRASHES into the huge crystal chandelier--there is an \nexplosion of crystal and glass.  Furious averts his eyes as cut glass \nrains down all around him... then he looks up and sees...\n\nCasanova's gold chain has hooked onto a fixture of the chandelier.  \nCasanova kicks and flails... as he is hanged by the neck on his own \ngold chain...\n\nFurious moves to the wolf sculpture.  Be PLUNGES HIS HAND through its \nbronze casing, and RIPS OUT the heart of the Psychostridulator, a \nflashing football sized device that gives off an unamplifjed, but \nhigher pitched and more irritating sound...\n\nFurious HURLS the device hard against the floor, and it smashes into a \nthousand pieces...\n\nCLOSE ON ONE OF THE PIECES -\n\nIn insect sized device that gives off an even higher pitched, even more \ndisorienting sound.  This is the very nerve center of the \nPsychostridulator...\n\nFurious lifts his foot and crushes it hard under his heel...\n\nSILENCE...\n\nFurious drops to his knees, wounded, exhausted... He looks up... at \nCasanova, who dangles lifelessly off the chandelier...\n\n\t\t\t\t\tFURIOUS\n\t\tNice dancing with you.\n\nSERIES OF SHOTS - VARIOUS LOCATIONS - CONTINUOUS\n\nas our other heroes return to their senses amidst the vanquished \ncrooks... the traumatized reunants of whom run for it. Things also \nreturn to normal...\n\nOn the street...\n\nAt the Lakeside Diner...\n\nAnd at the Shoveler's house...\n\nBACK TO THE TOP OF THE TOWER - CONTINUOUS\n\nFurious moves to the bed, where Monica lies motionless and pale...\n\n\t\t\t\t\tFURIOUS\n\t\tMonica...\n\nHe touches her face, her eyes open, and she looks at him.\n\n\t\t\t\t\tMONICA\n\t\tYou're beautiful when you're angry.\n\nHe takes her tenderly in his arm... as the Raja, the Shoveler and the \nothers rush into the room and see... Furious and Monica embracing.\n\nEXT.  OUTSIDE THE FRANKENSTEIN CENTER - A LITTLE LATER\n\nPolice cars and news vans arrive... as our heroes, battered, wounded, \nbut victorious walk proudly down the long stairs...\n\nFurious and Monica hold each other up.  Wounded Invisible Boy has his \narm around the Spleen... while policemen and news people run up the \nstairs past them into the center, ignoring them as always...\n\nBut this time our heroes could care less.  They are superheroes, and \nthey don't give a damn who knows it.\n\nINT.  THE RAJA'S HOUSE - NIGHT\n\nas the Raja opens the door and enters...\n\n\t\t\t\t\tRAJA\n\t\tMama!\n\nShe is there, waiting up for him.\n\n\t\t\t\t\tRAJA\n\t\tI'm home.\n\nThey embrace.\n\nINT. SHOVELER'S DOUSE - NIGHT - CLOSE ON A TV SCREEN\n\nDon Stouffer is reporting.\n\n\t\t\t\t\tDON\n\t\tFew details have emerged...\n\nON THE SHOVELER'S KIDS, on the couch, still rattled by their psychotic \nepisode, glued to the TV -\n\n\t\t\t\t\tDON (0.S.)\n\t\t...but the Dawn Patrol got this exclusive \n\t\tinterview vith two of the suspects.\n\nON THE TV -\n\nDawn Wong interviews the battered, handcuffed Elvis Brothers as they \nare led away...\n\n\t\t\t\t\tELVIS BROTHER I\n\t\tI don't know who those guys were--but I never \n\t\twant to see 'em again.\n\n\t\t\t\t\tELVIS BROTHER 2\n\t\tEspecially that big dude with the shovel...\n\n\t\t\t\t\tELVIS BROTHER 1\n\t\t\t\t\t (near tears)\n\t\tHe was the worst!\n\nON THE KIDS' COLLECTIVE REACTION as they realize who it was... and then \nthey hear the front door open...\n\nIn the front hall the Shoveler enters wearily; his shoulder hurts, his \nback is killing him... as his kids come running to him.\n\n\t\t\t\t\tKIDS\n\t\tDad!... Dad!... You okay?... You hurt?\n\n\t\t\t\t\tSHOVELER\n\t\t\t   (shocked by this welcome)\n\t\tI'm okay--I'm all right.\n\n\t\t\t\t\tEDDIE JR.\n\t\tLean on me, Dad.\n\n\t\t\t\t\tLENORE\n\t\tI'll hold your shovel, Dad.\n\nThey lead him back into the living room, and give him the prime spot on \nthe couch.\n\n\t\t\t\t\tBUTCH\n\t\tYou want a soda, Dad?\n\n\t\t\t\t\tSHOVELER\n\t\t\t\t\t(stunned)\n\t\tOkay.\n\nHe runs to get it as Eddie Jr. slides a footstool under his feet and \nTracy puts a pillow behind his back.  Roland, the little one, cuddles \nup next to him, puts his arm around him.\n\n\t\t\t\t\tROLAND\n\t\tNice work. Dad.\n\n\t\t\t\t\tSHOVELER\n\t\tThanks, Roland.\n\n\t\t\t\t\tROLAND\n\t\tYou really are a superhero, aren't you?\n\nThe Shoveler nods.  A few minutes later... The Shoveler sits on the \ncouch, feet up, soda in hand. The television is off. His kids all \nhuddled around him, hanging on his every word.\n\n\t\t\t\t\tSHOVELER\n\t\tAnd that's when the engine blew up.\n\n\t\t\t\t\tKIDS\n\t\tWhoa...\n\n\t\t\t\t\tBUTCH\n\t\tWhat did you do?\n\n\t\t\t\t\tSHOVELER\n\t\tWell...\n\nON LUCILLE as she comes in and sees... her husband surrounded by his \nkids, a happy man at last.\n\nEXT.  LAKESIDE DINER - THE NEXT NIGHT - ESTABLISHING\n\nINT. THE DINER - CONTINUOUS - ON THE SPLEEN\n\nsitting between the Bowler and a bandaged Invisible Boy. The Bowler has \nher arm chummily around the Spleen's shoulder. The Spleen finally has \nreal friends. Doc Heller discusses the art of fork throwing with the \nRaja as the Shoveler listens in. The Sphinx sits at the end of the \ntable, silent.\n\n\t\t\t\t\tDOC HELLER\n\t\tSo you're never actually conscious of range or \n\t\ttrajectory?\n\n\t\t\t\t\tRAJA\n\t\tHeck no.  I just chuck 'em.\n\nMonica (in her waitress outfit) sits close to a bandaged Mister \nFurious.\n\nON THE TV -\n\nDawn Wong reports.\n\n\t\t\t\t\tDAWN\n\t\tIt's been twenty-four hours since the deadly \n\t\tpsycho-sonic attack and bloody shoot-out that \n\t\tleft Casanova Frankenstein and dozen of the \n\t\tcity's top hoodlums dead... But tonight the \n\t\tquestion remains... Who were these heroic \n\t\tmystery men who saved our city?...\n\nON OUR HEROES -\n\n\t\t\t\t\tBOWLER\n\t\tCould have been anybody.\n\nThey laugh.\n\n\t\t\t\t\tRAJA\n\t\tWait a minute... That's it.  That's our name.  \n\t\tWe're... the Mystery Men.\n\nThey all like it, except for the Bowler.\n\n\t\t\t\t\tBOWLER\n\t\tHey, do I look like a Man?\n\n\t\t\t\t\tSHOVELER\n\t\tWell we can't call ourselves the Mystery People.\n\n\t\t\t\t\tSPLEEN\n\t\t\t(singing, ala \"Macho Man\")\n\t\tMystery, Mystery Man... I want to be a Mystery \n\t\tMan...\n\n\t\t  \t\t  SHOVELER & RAJA\n\t\tShut up.\n\n\t\t\t\t\tBOWLER\n\t\tEat your mustard.\n\n\t\t\t\t\tFURIOUS\n\t\tIt doesn't matter what we call ourselves.  We \n\t\tknow who we are.\n\n\t\t\t\t\tRAJA\n\t\tYes, Obie-wan.\n\n\t\t\t\t\tINVISIBLE BOY\n\t\tHey... he's gone.\n\nThe others see... that the Sphinx's chair is empty.  Raja spots a \ncrumpled napkin on the table, opens it up, and reads.\n\n\t\t\t\t\tRAJA\n\t\t\"Until you need me again... Adios.\"\n\nA silence... Reactions from our heroes as they realize that the Sphinx \nis gone...\n\n\t\t\t\t\tSHOVELER\n\t\tI miss him already.\n\nSuddenly, somewhere in the night, a burst of gunfire and screams are \nheard.  THE FINAL MUSIC BEGINS...\n\n\t\t\t\t\tFURIOUS\n\t\tAmigos, duty calls.\n\nThe Mystery Men wolf their burgers, then stand and start for the \nstreet...\n\nAs Monica watches them leave, a PATRON asks her:\n\n\t\t\t\t\tPATRON\n\t\tMiss... who are those guys?\n\n\t\t\t\t\tMONICA\n\t\t\t\t(after a moment)\n\t\tI don't know.\n\nJUST OUTSIDE THE DINER - A MOMENT LATER\n\nHEROIC GROUP SHOT as the Mystery Men merch down the middle of street, \ntoward the sound of the gunfire... and into the night.\n\nTHEME AND CREDITS...\n\nTHE END\n\n\n\n\n\n\n\n\n\nMystery Men\nWriters :   Neil Cuthbert\nGenres :   Action  Comedy  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In the metropolis of Champion City, the would-be superhero team of Mr. Furious (Ben Stiller), The Shoveler (William H. Macy), and The Blue Raja (Hank Azaria) attempt to make a name for themselves, but their suspect skills make them ineffective, and they find themselves upstaged by the city's most successful superhero, Captain Amazing (Greg Kinnear). However, Amazing is finding that his effectiveness at fighting crime has practically made his job obsolete, and without any worthy adversaries remaining (some of them are either dead, in exile, or still in jail), his corporate sponsors are beginning to pull their funding. To create a need for himself, Amazing uses his alter ego, billionaire lawyer Lance Hunt, to argue for the release of insane supervillain Casanova Frankenstein (Geoffrey Rush). The plan backfires; once reunited with Tony P (Eddie Izzard) and his Disco Boys, Casanova Frankenstein blows up the insane asylum, captures Amazing, and prepares to unleash a doomsday device: the \"Psycho-frakulator\", which lethally bends reality. Mr. Furious, while spying on Casanova Frankenstein's mansion, discovers Amazing's capture and informs the others.\nAfter an unsuccessful rescue attempt, the three realize they need more allies, and through word-of-mouth and try-outs, they recruit Invisible Boy (Kel Mitchell), The Spleen (Paul Reubens), and The Bowler (Janeane Garofalo). The newly formed team \"assaults\" Casanova, which only succeeds in annoying him and damaging his car. While drunk from celebrating their victory, the team is nearly killed in retaliation by Tony P and the Disco Boys, but they are saved at the last minute by The Sphinx (Wes Studi). The Sphinx trains them, but his methods annoy Mr. Furious – he has them complete rote team-building exercises and speaks exclusively in platitudes. They also seek out mad scientist Doc Heller (Tom Waits), who specializes in non-lethal weaponry, to equip them for their battle.\nThe group breaks into Casanova's mansion during a gathering of several of the city's gangs; but, while attempting to free Captain Amazing, they inadvertently set off the Psycho-frakulator, killing him instead. Without Amazing, the team despairs of saving the city, but The Shoveler delivers a pep-talk that succeeds in uniting and inspiring them.\nWith new-found purpose, they assault the mansion and, by making effective use of their negligible superpowers and Heller's weapons, manage to subdue most of Casanova Frankenstein's henchmen. Unfortunately, as the heroes approach Casanova Frankenstein, he reveals that he is holding Mr. Furious' girlfriend Monica (Claire Forlani) hostage, and proceeds to activate the Psycho-frakulator, which begins to wreak havoc upon the city. While the team tries to stop the device, Mr. Furious takes on Casanova Frankenstein. After initially taking a beating, Mr. Furious unleashes his inner rage and manages to fight effectively for the first time. He defeats Casanova Frankenstein, who is thrown into the core of the Psycho-frakulator and killed by its reality-bending powers. The rest of the team helps The Bowler use her bowling ball to destroy the device and escape the mansion as it implodes, killing several villains still inside.\nThe team is interviewed by reporters, begging to know their team name. As they argue among themselves, one reporter states \"Well, whatever you may call them, Champion City will forever owe a debt of gratitude to these 'Mystery Men',\" but the others are too busy arguing to hear it."}