{"title": "Observe and Report", "full_text": "Observe and Report\nWriters :   Jody Hill\nGenres :   Comedy  Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "An anonymous flasher exposes himself to shoppers in the Forest Ridge Mall parking lot. The head of mall security, Ronald \"Ronnie\" Barnhardt, makes it his mission to apprehend the offender. He is assisted by Charles, Dennis, and the Yuen twins (John and Matthew Yuan), in his efforts.\nThe next day, Ronnie's dream girl, Brandi, who works a mall make-up counter, encounters the flasher and is distraught over the situation. Ronnie tries to comfort her until a police officer, Detective Harrison, arrives and takes over Ronnie's palliative role. Ronnie is upset that his boss allowed an outsider to infringe on his search for the offender.\nThe criminal activity at the mall continues, as a masked person is seen robbing a shoe store, causing property damage. Detective Harrison is once again called in to investigate, his efforts hindered by Ronnie, who thinks that Saddamn, an Arab shopkeeper in the mall is the thief, based on the fact that he is an Arab. Ronnie curses Saddamn out, and Harrison profanely excoriates Ronnie for this during a meeting with Ronnie's superior, and in response, Ronnie decides to take steps to become a police officer.\nAs part of his preparations, Ronnie decides to ride along with Detective Harrison. Harrison, fed up with Ronnie, tricks him into walking into the most dangerous part of town, and drives off. Ronnie then confronts and subsequently assaults several drug dealers, victoriously returning to the police station with a dealer's son and thanking the detective for the opportunity to prove himself. Emboldened, Ronnie arranges a date with Brandi. On their date, Brandi sees Ronnie taking a prescription clonazepam, and thinking that Ronnie takes them recreationally, she asks him for the bottle, from which she consumes multiple tablets herself with several alcoholic beverages. Ronnie takes her home and has sex with her while she is apparently semi-conscious, and at one point, when he stops mid-coitus, she says, \"Why are you stopping, motherfucker?\", compelling him to continue.\nRonnie fails the psychological examination for the police officer job. Nell, a friendly food court worker, explains to him that her boss, Roger and Trina, another female employee make fun of Nell for having her leg in a cast. Ronnie then beats up Roger and warns him and Trina not to harass Nell again. Depressed, he is persuaded by Dennis to spend the day doing a wide variety of drugs and assaulting skateboarding teenagers. At the end of the day, Ronnie finds out that Dennis was the shoe thief, and that he has been stealing from the mall for some time. Ronnie is stunned and, after a brief argument, is knocked unconscious by Dennis, who then flees to Mexico.\nRonnie decides to go undercover in order to catch the flasher. At night he sees Harrison having sex with Brandi, and he confronts her in front of onlookers at the mall the next day, blowing his cover and inadvertently destroying a display case. When the police are summoned, Ronnie fights them and Harrison. Ronnie loses the fight and is arrested.\nAfter a night in jail, Ronnie returns to the mall, fired from his job. Despondent, he sits at a food court table, where Nell, whose cast has been removed, and is sporting a more flattering hairdo, brings him a complimentary cup of coffee. As a vulnerable Ronnie expresses his sadness over his situation, Nell kisses him. Interrupting their romantic moment, the flasher exposes himself to Nell and Ronnie and runs off, exposing himself to many other mall patrons. Ronnie, pursuing the flasher in a slow-motion sequence that includes him punching Saddamn in the face, retrieves a gun and shoots the flasher in the shoulder as he charges toward Brandi. Refusing the flasher an ambulance, Ronnie brings the flasher to his feet to take him to the police station, and as he does so, his boss, Mark rehires him. Though Brandi compliments Ronnie on a job well done, Ronnie rejects her compliment and humiliates her publicly for betraying him. Ronnie drops the flasher off at the police station, and boasts to Harrison of his feat, saying that he does not need a badge or gun to know who he is. Ronnie is then interviewed by the local news with Nell and his fellow security guards by his side."}