{"title": "Panic Room", "full_text": "<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nPanic Room - by David Koepp\n\n\n\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t                          PANIC ROOM\n\t\n\t\n\t                              by\n\t\n\t                          David Koepp\n\t\n\t\n\t\n\t\n\t                                            February 23, 2000\n\t\n\t\n\t--------------------------------------------------------------------\n\t\n\t\n\t\n\t\n\t\n\t                     This film is short.\n\t\n\t                     This film is fast.\n\t\n\t\n\t\n\tFADE IN:\n\t\n\tEXT.  MANHATTAN - DAY\n\t\n\tThe whole island, from the south.  For a second.  Literally.\n\t\n\tEXT.  NEW YORK SKYLINE - DAY\n\t\n\tCloser, just the skyline.  For another second.\n\t\n\tEXT.  UPPER WEST SIDE - DAY\n\t\n\tCloser still, the Upper West Side.  For another second.  No\n\ttime to waste admiring the scenery.\n\t\n\tEXT.  WEST 83RD STREET - DAY\n\t\n\tRace across a field of PEDESTRIANS to pick up three women\n\thurrying down the sidewalk.  LYDIA LYNCH, a real estate\n\tbroker, vaults down the sidewalk, she's got a hell of a\n\tstride.  MEG ALTMAN, thirtyish, struggles to keep up with\n\ther, she's tall, wafer-thin, pale as a ghost.  SARAH, a nine\n\tyear old girl, flat out runs to keep up, dribbling a\n\tbasketball as she goes.  The kid's athletic, much tougher\n\tthan Meg, who she resembles.\n\t\n\tLydia reads from a sheet she carries in her bouncing hands.\n\t\n\t                     LYDIA\n\t          -- seventeen feet wide, fifty-five\n\t          feet deep, forty-two hundred square\n\t          feet, four floors with a rentable\n\t          basement apartment, so five\n\t          altogether, courtyard in back --\n\t\n\t                     MEG\n\t          Could you slow down a little?\n\t               (looking back over her\n\t                shoulder)\n\t          Or we could wait for the car...\n\t\n\t                     LYDIA\n\t          No cars.  Feet are faster.\n\t\n\t                     MEG\n\t          How many more do we have after this?\n\t\n\t                     LYDIA\n\t          None, there's nothing else, you know\n\t          how tight the market is.\n\t\n\t                     MEG\n\t          This is it?  I told you on the\n\t          phone, I have to be moved in in two\n\t          weeks.  Sarah, please don't bounce\n\t          that here.\n\t\n\t                     SARAH\n\t          Mom, it's the sidewalk.\n\t\n\t                     LYDIA\n\t          Oh, that miserable little prick is\n\t          already leaving.\n\t\n\tThey approach a row of brownstones, narrow four story\n\ttownhouses, nice looking buildings, a hundred years old or\n\tmore.  EVAN, a sour-looking man, has just locked the front\n\tdoor of number 26 and is coming down the steps.  He sees them\n\tcoming.\n\t\n\t                     EVAN\n\t          One day you will learn to respect\n\t          other people's time, Lydia, one day\n\t          you --\n\t\n\t                     LYDIA\n\t          Evan, I am so sorry, you were a\n\t          saint to wait for us!\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  TOWNHOUSE - FOYER - DAY\n\t\n\tEvan throws open the front door, revealing the airy foyer of\n\tthe townhouse.  The place is completely empty.  He talks\n\tfast, races through the tour.  The three of them come in,\n\tSarah still bouncing her basketball.\n\t\n\t                     EVAN\n\t          This is the middle of the house, the\n\t          entry floor, living room's over\n\t          there.  The kitchen floor's below us\n\t          and there's two bedroom floors\n\t          above.\n\t\n\tThe front door closes behind them, with a THUD so\n\tauthoritative it seems to say no one's ever getting out.  Meg\n\ttries to get her daughter's attention, to tell her to stop\n\tbouncing the ball in the house.\n\t\n\t                     EVAN\n\t          It's an enormous amount of space for\n\t          the money and I'll be perfectly\n\t          honest, the family is in no hurry\n\t          whatsoever.\n\t\n\tMeg whispers Sarah's name, but Sarah still ignores her, goes\n\ton bouncing the ball.\n\t\n\t                     EVAN\n\t          I don't have to tell you there is an\n\t          acute shortage of living space in\n\t          Manhattan right now and this is a\n\t          highly unique property.\n\t\n\t                     LYDIA\n\t          No ball, kid.\n\t\n\tSarah immediately stops bouncing.  She wanders into the\n\tliving room, peers through the big French doors, which look\n\tout over the courtyard area.  There's another row of\n\tbrownstones on the next block, and all the patios back up to\n\tone another.  It looks tranquil out there, oasis in the city.\n\t\n\tSarah leans up against the door, sighs, her breath fogs the\n\twindow.  There is a profound melancholy about her.  Meg\n\twatches her, tries to catch eyes with her in the reflection.\n\tCan't.\n\t\n\tEvan flings open the door of an old-fashioned cage-style\n\televator.\n\t\n\t                     EVAN\n\t          Working elevator.  Mr. Pearlstine,\n\t          the previous owner, was disabled the\n\t          last ten years of his life.  Highly\n\t          unusual, the elevator, you will not\n\t          find this in ninety percent of\n\t          brownstones.\n\t\n\t                     MEG\n\t          Will they take asking price?  I need\n\t          a two week escrow and I'm already\n\t          approved for the loan.\n\t\n\tLydia turns, gives Meg an \"are you insane?\" look.\n\t\n\t                     EVAN\n\t          What say we see the house before we\n\t          dicker, hmm?\n\t               (starting up the stairs)\n\t          I have to warn you, this is exactly\n\t          the response we expected to get.\n\t          It's a very emotional property.\n\t\n\tAs he disappears upstairs, Lydia turns to Meg, lowers her\n\tvoice.\n\t\n\t                     LYDIA\n\t          Who taught you to negotiate?\n\t\n\t                     SARAH\n\t          It's not like Saks', Mom, you don't\n\t          have to pay the price on the tag.\n\t\n\tShe gets in the elevator and RATTLES the door shut with a\n\tbang.  That kid's got an attitude.  Meg takes a deep breath,\n\tturns to Lydia.  She brushes her hair behind an ear, we\n\tnotice her thin hand is shaking.\n\t\n\t                     MEG\n\t          I'm sorry.  Apartments, and...\n\t          money, and... this is more my\n\t          husband's area.\n\t\n\tShe digs in her purse for a prescription pill bottle and some\n\twater.\n\t\n\t                     MEG\n\t          Was.  His area.  I'm not very good\n\t          at...\n\t\n\tLydia watches as she swallows a pill, waiting for Meg to\n\tfinish her sentence.  Not very good at what?\n\t\n\t                     MEG\n\t          Things, and if I can't prove to my\n\t          soon to-be ex-husband that I can\n\t          provide a suitable place for our\n\t          daughter to live in the next\n\t          fourteen days, it's going to get\n\t          ugly between us.  Uglier.\n\t\n\tLydia just looks at her, no idea what to say.  These two are\n\tfrom different places.\n\t\n\t                     EVAN (O.S.)\n\t               (from upstairs)\n\t          It would be so lovely if I could\n\t          shot the property before I leave!\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  TOP FLOOR BEDROOM - DAY\n\t\n\tEvan, Lydia, and Meg poke their heads in a series of rooms,\n\tone after the other, the tour flying by quickly.  First, an\n\tupstairs bedroom.  Nice, roomy, looks out on the courtyard.\n\t\n\t                     EVAN\n\t          Top floor.  Two bedrooms, one\n\t          bathroom.\n\t\n\tINT.  DEN - DAY\n\t\n\tAnother floor, another empty room.  The trio passes through.\n\t\n\t                     EVAN\n\t          Third floor, spare bedroom, den,\n\t          what have you.  Mr. Pearlstine used\n\t          it as an office.\n\t\n\t                     LYDIA\n\t               (low voice, to Meg)\n\t          He's talking about Bernard\n\t          Pearlstine.\n\t\n\tMeg shrugs, who's that?\n\t\n\t                     EVAN\n\t               (moving, through a\n\t                bathroom)\n\t          Master bath.\n\t\n\t                     LYDIA\n\t          The hotel guy?  It's been in the\n\t          papers lately.  His kids are all\n\t          suing each other over his estate.\n\t          He was a total recluse, paranoid,\n\t          rich as hell, he was worth thirty\n\t          million or something, now it turns\n\t          out they can't find half of it.\n\t               (singsong)\n\t          Somebody took something didn't\n\t          belong to them!\n\t\n\t                     EVAN\n\t          I hardly see how family gossip is\n\t          germane to showing the property.\n\t\n\t                     LYDIA\n\t               (low, to Meg)\n\t          Stop calling it the property, you\n\t          sound ridiculous.\n\t\n\t                     EVAN\n\t               (through a closet)\n\t          Master closet.\n\t\n\tFrom the hallway, there is a GROANING METALLIC sound, the\n\televator, and the happy laughter of the little girl as she\n\tputs it through its paces.  Evan winces, speaks as if his\n\tmouth hurts when he moves it.\n\t\n\t                     EVAN\n\t          Could the child please stop that?\n\t\n\t                     LYDIA\n\t          KID!  NO ELEVATOR!\n\t\n\tShe looks at Meg and winks.\n\t\n\tINT.  MASTER BEDROOM - DAY\n\t\n\t                     EVAN\n\t          And we emerge in the master bedroom.\n\t\n\tHe checks his watch.\n\t\n\tMeg looks around, studying the dimensions of the room.  She\n\tlooks at the far wall, the one that borders the house next\n\tdoor.  She looks at the wall that corners it, opposite the\n\twindow wall.  She takes two steps back from it.\n\t\n\t                     MEG\n\t          Something's weird.\n\t\n\t                     LYDIA\n\t          What?\n\t\n\t                     MEG\n\t          I don't know, doesn't that corner\n\t          seem funny to you?\n\t\n\tShe points to the far end of the wall, near the entrance to\n\tthe closet.  There is a mirrored door that leads to the\n\tcloset, and a mirror on the wall alongside it.  If you look\n\tclosely, you'll see that the mirrors are raked slightly\n\ttoward one another, which causes an optical illusion in which\n\tthe corner of the room appears much closer to the door than\n\tit is.\n\t\n\t                     EVAN\n\t          I was waiting to see if you'd\n\t          notice!  On caravan, no one from our\n\t          office had the slightest idea.\n\t\n\tHe pushes on the top of the mirror on the wall.  It makes a\n\tfaint CLICK, then glides open a few inches off the wall.  He\n\tpulls it toward him, opens it all the way, a hundred eighty\n\tdegrees, and it fastens magnetically to the back of the\n\tclosed door.  There is smooth wall behind it, but if you look\n\tclosely, there is a faint vertical crack in the wall.\n\t\n\tMeg looks at him -- what in the world?  Even pushes again,\n\ttwice this time, first at the top, then at the bottom, and\n\tthe smooth wall CLICKS ajar.  He pulls it wide open.  Meg and\n\tLydia step forward, fascinated.\n\t\n\tINT.  PANIC ROOM - DAY\n\t\n\tFrom the opposite end of a lone, narrow, windowless space, we\n\tsee the three of them standing in the open doorway,\n\tsilhouetted by the sunlight streaming through the bedroom\n\twindows behind them.\n\t\n\t                     EVAN\n\t          It's called a panic room.\n\t\n\tHe hits a switch and a row of bulbs flick on overhead.\n\t\n\t                     MEG\n\t          A what?\n\t\n\t                     EVAN\n\t          A safe room.  An inner sanctum.  A\n\t          castle keep, in medieval times.\n\t\n\t                     LYDIA\n\t          Oh, I've seen these...\n\t\n\t                     EVAN\n\t          It's quite in vogue in high end\n\t          construction right now.  One really\n\t          can't be too careful about home\n\t          invasion.\n\t\n\tThe other two walk inside, but Meg lingers near the door,\n\tlooking around, studying the neatly arrayed survival supplies\n\t-- water, food packs, batteries, flashlights, tools, rope,\n\tclothes, blankets -- you get the idea.\n\t\n\t                     LYDIA\n\t          Hey, this is perfect for you...\n\t               (Meg scoffs)\n\t          Absolutely!  You're a woman, you're\n\t          living alone now.  Your alarm goes\n\t          off, or you head glass break, or for\n\t          whatever reason you think someone's\n\t          broken into your home in the middle\n\t          of the night.  What are you going to\n\t          do?  Call the police and wait until\n\t          they get here on Tuesday?  Traipse\n\t          downstairs in your sexy little\n\t          underthings and check it out?  I\n\t          think not!\n\t\n\t                     EVAN\n\t          Reinforced steel core walls.  Buried\n\t          phone line, completely separate, not\n\t          connected to the house's main line\n\t          and never exposed throughout the\n\t          house's infrastructure or outside\n\t          the house -- you can call the\n\t          police; nobody can cut you off.\n\t          Your own ventilation system,\n\t          complete with oxygen scrubber, so\n\t          you've got plenty of fresh air for\n\t          as long as you like.  And a bank of\n\t          video monitors --\n\t\n\tHe hits a switch next to a dozen tiny video monitors,\n\trevealing a dozen different views of the house.\n\t\n\t                     EVAN\n\t          -- covering almost every corner of\n\t          the house.\n\t\n\tMeg nods, starting to sweat.\n\t\n\t                     MEG\n\t          Makes me nervous.\n\t\n\t                     LYDIA\n\t          Why?\n\t\n\t                     MEG\n\t          Ever read any Poe?\n\t\n\t                     LYDIA\n\t          I don't think so, but I love her\n\t          album.\n\t\n\t                     MEG\n\t          No, Edgar Allen.\n\t\n\t                     LYDIA\n\t               (thinks)\n\t          The furniture guy?\n\t\n\t                     MEG\n\t               (giving up)\n\t          What's to keep them from prying open\n\t          the door?\n\t\n\tEvan reaches past Meg and pushes a red button on the wall\n\tbehind her.  With a sudden WHANG of steel, a heavy metal door\n\tleaps out of a slot in the wall and SLAMS shut, like a\n\tsubmarine hatch.  A series of metal latches CLICK into place\n\tinside it, from top to bottom, securing it into place.\n\t\n\t                     EVAN\n\t          Steel, four inches thick.\n\t\n\tMeg takes a step back.  They're now enclosed in the room.\n\t\n\t                     EVAN\n\t          Everything's spring-loaded, even if\n\t          the power's out it's fully\n\t          functional.\n\t\n\t                     MEG\n\t          Open it.\n\t\n\t                     LYDIA\n\t          Old Bernie didn't miss a trick with\n\t          this room, did he?\n\t\n\t                     MEG\n\t          Open the door.\n\t\n\t                     LYDIA\n\t          And with kids like he's got, no\n\t          wonder he wanted a place to hide.\n\t\n\t                     EVAN\n\t          That's highly inappropriate.\n\t\n\t                     MEG\n\t          I said open the door.\n\t\n\tEvan hits a green button and the door GROANS slowly open,\n\trecoiling its massive spring, and revealing Sarah, the little\n\tgirl, standing in the entryway, grinning widely.\n\t\n\t                     SARAH\n\t          My room.  Definitely my room.\n\t\n\tShe bolts in, just as her mother bolts out.\n\t\n\tINT.  MASTER BEDROOM - DAY\n\t\n\tMeg stands just outside the door to the panic room, regaining\n\ther composure.  Not crazy about tight spaces.  Which we\n\talready knew.\n\t\n\t                     LYDIA\n\t          That door is a safely hazard.\n\t\n\t                     EVAN\n\t          Not at all.\n\t\n\tHe points.  There's a tiny red beam that shines across the\n\tdoorway, one at shoulder height --\n\t\n\t                     EVAN\n\t          Infrared.  Like the beam in an\n\t          elevator doorway.  Won't let the\n\t          door close if something's blocking\n\t          it.\n\t\n\t-- and one at shin height.  Even bend down, blocks the one at\n\tshin height with his hand.\n\t\n\t                     EVAN\n\t          Watch.\n\t\n\tHe reaches up, to push the close button, but with one hand\n\tanchored at the floor, he can't quite reach it.\n\t\n\t                     EVAN\n\t               (to Lydia)\n\t          Push that button for me, will you?\n\t\n\t                     MEG\n\t          Don't!\n\t\n\tLydia pushes the close button, nothing happens.  Evan pulls\n\this hand put of the beam, takes a step back.  Lydia pushes\n\tthe button again.\n\t\n\tWHANG!  The metal door rockets shut, the metallic slang\n\treverberating in the room.  Almost immediately, the fake\n\tpiece of wall HUMS shut, of its own accord, followed a moment\n\tlater by the mirror, which detaches itself from the back of\n\tthe closet door and HUMS silently back into place, closing\n\tover the hidden door, making the corner of the room look like\n\ta corner again.\n\t\n\tAs the mirrored door closes, it shows Meg her own reflection.\n\tShe looks at herself, still rattled.  She wipes a trickle of\n\tsweat from the side of her face.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  TOWNHOUSE - FOYER - DAY\n\t\n\tThe same house, two weeks later.  The entry floor is piled\n\thigh with moving boxes.  Sarah and Meg lie sprawled out in\n\tthe middle of the black and white tile, arms and legs splayed\n\twide, exhausted.\n\t\n\tThey stare up at the ceiling, beat.\n\t\n\t                     SARAH\n\t          Too many stairs.\n\t\n\t                     MEG\n\t          Got us in here, didn't I?\n\t\n\t                     SARAH\n\t          Shoulda got an apartment.\n\t\n\t                     MEG\n\t          Well, I know that now.\n\t\n\t                     SARAH\n\t          478-0150.\n\t\n\tMeg raises her hand to her face, she's got her cell phone in\n\ther palm.\n\t\n\t                     MEG\n\t          Battery's dead.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  KITCHEN - DAY\n\t\n\tMeg picks up the wall phone in the kitchen, gets a dial tone.\n\t\n\t                     MEG\n\t          The phone works.\n\t               (to Sarah)\n\t          Hey, I hooked up the phone.\n\t\n\t                     SARAH\n\t               (sarcastic)\n\t          The crowd goes wild.\n\t\n\t                     MEG\n\t               (ignoring the slight)\n\t          478...\n\t\n\t                     SARAH\n\t          0150.\n\t\n\tMeg finishes dialing.  It rings, someone answers.\n\t\n\t                     VOICE\n\t          Perry's Pizza, please hold.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\tNight has fallen.  Meg and Sarah sit at a small table in the\n\tmiddle of the kitchen, surrounded by packing boxes.  They eat\n\tpizza.  They chew, silently.  Sarah drinks a diet Dr.\n\tPepper.  Meg finishes a glass of wine.\n\t\n\tMeg's eyes are moist.  Sarah notices.  She notices her\n\tnoticing, shrugs.  I'm human, what do you want me to do, hide\n\tit?\n\t\n\tSarah looks away, goes back to chewing.  After a moment:\n\t\n\t                     SARAH\n\t          Fuck him.\n\t\n\t                     MEG\n\t          Don't.\n\t\n\t                     SARAH\n\t          Fuck her too.\n\t\n\tMeg looks at her, not sure how to confront the open defiance.\n\t\n\t                     MEG\n\t          I agree.  But don't.\n\t\n\tSarah stares at her for a moment, then goes back to eating.\n\t\n\tMeg picks up the bottle of wine.\n\t\n\tSarah's eyes flick over and watch as wine GLUGS into her\n\tmother's glass.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  SARAH'S BEDROOM - NIGHT\n\t\n\tSarah's bedroom is full of unpacked boxes, but her twin bed\n\thas been set up and Sarah is in it, hair wet, pajamas on.\n\tShe reads from a book (\"Tom Swift and His Repelatron Skyway\")\n\twhile Meg, drowsy, lies next to her, listening.\n\t\n\t                     SARAH\n\t          \"Tom's throat felt so dry and tight\n\t          that it was a moment before he could\n\t          make any sound come out.  \"Dad!\" He\n\t          croaked.  \"I'm - inside - the -\n\t          machine!\" \"Great Scott!\"  The elder\n\t          scientist gasped.  He dashed across\n\t          the laboratory and switched off the\n\t          repelatron's motor.  \"What happened,\n\t          son?\" \"The Durafoam hardened, Dad.\n\t          Get a solvent, quick -- you know the\n\t          formula!\"\n\t\n\tINT.  BATHROOM - NIGHT\n\t\n\tIn the master bathroom, Meg soaks in a bath.  She is\n\texhausted.  She reaches for her wine glass, finishes the last\n\tof it.\n\t\n\tShe stretches for the bottle, which is on the floor next to\n\ther.  She refills the glass.  Again.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tMeg, dressed in an old Knicks T-shirt and boxer shorts,\n\tstands next to the alarm panel in the master bedroom, reading\n\tfrom an instruction manual.  She's frustrated.  She mutters,\n\tslurring, a bit drunk.\n\t\n\t                     MEG\n\t          Bypass non-ready zones... shunt,\n\t          enter, zone number...\n\t\n\tShe tries it, pushing a few buttons, but the alarm panel\n\tBEEPS at her disapprovingly.  She's doing something wrong.\n\t\n\tShe sighs, sits on the floor, gets serious about figuring out\n\tthe instructions.\n\t\n\t                     MEG\n\t          Bypass non-ready zones... ah, shunt,\n\t          enter, shunt again, zone number...\n\t          wait...\n\t\n\tHER FINGERS\n\t\n\tdance over the alarm panel, some time later.  She seems to\n\thave figured it out, and a small light on the panel lights\n\tup.\n\t\n\tSYSTEM ARMED\n\t\n\tThe very moment the red light goes on, we cut sharply to --\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\t-- the darkened panic room, where the dozen small video\n\tscreens all suddenly wink to life, showing a dozen views of\n\tthe house.  Whatever she pushed turned these on too, probably\n\tnot what she meant to do, but at least she got the alarm on\n\tfor the night.\n\t\n\tThe door that leads from the panic room to the master bedroom\n\thangs open.  In the middle of the floor in here, somebody has\n\tmade a small tent of blankets and couch cushions.  Sarah must\n\thave been playing here before bed.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tMeg puts sheets on her bed in the master bedroom.\n\t\n\tShe fills a glass of water, puts it on a box she's using for\n\ta night table.\n\t\n\tShe plugs in a battery charger for her cell phone, places the\n\tphone in the cradle.  It BEEPS.  \"Charging.\"\n\t\n\tShe sets the digital clock, puts it next to the glass of\n\twater.  It's 12:26.\n\t\n\tShe gets in bed, her side, the left side.\n\t\n\tShe lies in the dark, half an acre of empty bed across from\n\ther.\n\t\n\tWe drift off her, see the clock again.  The time changes, the\n\tnumber one dissolves away, changing the time to --\n\t\n\t                                             DISSOLVE TO:\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\t-- 2:26.  Meg is in a hard, boozy sleep.  We drift out the\n\tdoor of the master bedroom, into the third floor hallway, and\n\tdown the open stairwell.  We glide through the entry floor,\n\tstill gently falling through the stairwell's airway, dropping\n\teven further, all the way down to the kitchen floor, the\n\tground floor.\n\t\n\tWe drift across the darkened kitchen, serpentine through the\n\tcanyon of moving boxes, approach the window that looks out on\n\tthe street.\n\t\n\tWe move right up against the window, peer through the glass\n\tjust as --\n\t\n\t-- a van pulls up across the street and stops.  Can't see\n\tthrough its windows.  No movement for a moment, then the\n\tdriver's door opens and a MAN climbs out.  He wears dark\n\tclothes.\n\t\n\tThe Man closes the door, looks both ways, and starts across\n\tthe street towards us.  He's carrying a bag of some kind.\n\t\n\tHe goes to the door, and we drift down toward the doorknob.\n\tWe hear a key slide into the door, rattle.\n\t\n\tBut the lock doesn't turn.  The key slides out, back in\n\tagain, jiggles.  Still won't open the door.\n\t\n\tThe Man steps away from the door, goes to the kitchen window,\n\twhich is heavily barred, and peers inside, right at us.\n\tCan't see anything, it's darker in here than it is out there.\n\t\n\tHe turns, looks both ways on the street again, then steps up,\n\tonto the window ledge.  Now we can only see his legs, can't\n\ttell what he's doing.  He's reaching up, stretching for\n\tsomething.  It drops into view with a metallic SCRAPE.\n\t\n\tThe fire escape.\n\t\n\tThe Man climbs, his feet disappearing from our field of\n\tvision.\n\t\n\tWe turn around, facing the other way in the kitchen.  We\n\tstart back the way we came, through the canyon of boxes in\n\tthe kitchen, toward the stairwell.\n\t\n\tINT.  STAIRWELL - NIGHT\n\t\n\tBack in the stairwell, the exact reverse of the shot we saw\n\tearlier.  We're drifting up, off the kitchen floor, through\n\tthe entry floor, and as we rise we notice something all the\n\tway up on the roof that we couldn't see before, when we were\n\tlooking down.\n\t\n\tA skylight.  We continue to rise, drawn toward it.  We move\n\tup, through the master bedroom floor, creeping up alongside\n\tthe stair banister, now reaching the top floor of the house,\n\tand just as we near the skylight --\n\t\n\t-- a figure appears, visible through it.  The Man in dark\n\tclothes, on the roof now.  He stops, peers down through the\n\tskylight, looking at us without seeing us again.\n\t\n\tHe steps across the skylight.  This is not the way he intends\n\tto enter.  We drift again, following his soft footsteps on\n\tthe roof, which we can hear faintly through the ceiling.\n\t\n\tHere in the hall, just outside Sarah's bedroom, a closet door\n\tis ajar.  We squeeze through the gap and into the closet.\n\t\n\tIN THE CLOSET,\n\t\n\tit's completely dark.  Can't see a thing.  But then a sliver\n\tof light appears, coming from above.  We look up.\n\t\n\tThere is a ladder that's bolted to the wall in this closet,\n\tit leads up to a square panel in the ceiling.\n\t\n\tRoof access.  And that roof access panel is moving, ever so\n\tslightly, moonlight spilling in as it twists in its setting.\n\tA shiny silver something slides through the crack along the\n\tedges of the portal.\n\t\n\tIt slithers along the edge of the hatchway, searching for\n\tsomething.  It finds a small round nub in the crack.  The\n\tsilver something stops.  It HUMS with electricity for a\n\tmoment, then there is a bright spark and a soft CRACK.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn the master bedroom, a message appears on the alarm panel:\n\t\n\tZONE 19 DISABLED\n\t\n\tINT.  CLOSET - NIGHT\n\t\n\tIn the closet, the silver something withdraws and the roof\n\taccess panel is removed.  A million stars are visible in the\n\tnight sky above.  But we're inside.\n\t\n\tAnd in a moment, so is this intruder.  The Man peers down,\n\tthrough the open hatchway, then slips through the opening and\n\tclimbs silently down the ladder.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn bed, Meg stirs.  An alcohol sleep is a restless one, and\n\tshe's suffering.\n\t\n\tShe sits up groggily, chugs a glass of water.  Lies down\n\tagain.\n\t\n\tINT.  FOURTH FLOOR HALLWAY - NIGHT\n\t\n\tOne floor up, the Man steps into the hallway and starts for\n\tthe stairs, moving quickly and confidently.  Knows where he's\n\tgoing, knows what he wants.  He starts down the stairs,\n\thappens to glance to the side as he does so.\n\t\n\tHe freezes.  He's looking in the open doorway of the top\n\tfloor bathroom, staring hard at something that clearly\n\tdisturbs him.\n\t\n\tA nightlight.  Plugged into an outlet in the baseboard in the\n\tbathroom.  (For the record, it's the Power Puff Girls.)  The\n\tMan climbs the stairs again, concerned, goes to the door of\n\tthe bathroom.  He looks from the nightlight to the\n\tcountertop.\n\t\n\tThere's a moving box on the countertop.  His eyes widen.\n\tThis is news to him, bad news.\n\t\n\tHe takes a step back and a breath.  He turns, looks to the\n\tend of the hall.  His eyes now adjusted to the darkness, he\n\tnotices something he didn't see before, something coming from\n\tunder the door to the fourth floor bedroom.\n\t\n\tLight.  From inside.  From another nightlight.\n\t\n\tINT.  SARAH'S BEDROOM - NIGHT\n\t\n\tIn the top floor bedroom, a nightlight burns in another\n\toutlet.  Nearby, Sarah is asleep in bed, the covers kicked\n\toff.\n\t\n\tThe door to Sarah's bedroom glides open, terribly slowly.\n\tThe Man stands in the doorway, staring, aghast, at the\n\tmountain of moving boxes piled in the room.  His gaze falls\n\ton Sarah in the bed.\n\t\n\tThe Man just stares, beside himself.  His lips mouth a word,\n\tsoundlessly.  Doesn't take a lip reader to guess it.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn the master bedroom, Meg flops over in bed, facing away\n\tfrom the doorway, really having a rough go of it.  She slept\n\ttoo hard before, now she's awake, her head is killing her,\n\tshe's really paying the price of four glasses of wine.\n\t\n\tShe lies still, on her side, facing us.\n\t\n\tBehind her, the bedroom door moves, silently.\n\t\n\tOpening.\n\t\n\tThe Man stands there, one finger still on the door he's just\n\tpushed open.  He stares at the sleeping form of Meg on the\n\tbed, whose back is to him.  He has no idea she's awake.\n\t\n\tMeg lies in bed, eyes wide open, no idea a Man is standing in\n\tthe doorway to her bedroom.\n\t\n\tNoiselessly, the Man moves away, down the hall.  The moment\n\this head disappears down the stairwell --\n\t\n\t-- Meg flops over again, facing the doorway.  She closes her\n\teyes, gives sleep another try.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\tThe Man walks across the kitchen, shaking his head in\n\texasperation at the packing boxes all around him.  He goes to\n\tthe front window, peers outside.  He reaches for a light\n\tswitch on his right.\n\t\n\tThrough the window, we can see the stoop light go on.  Then\n\toff, then on and off again.\n\t\n\tStill through the window, we see the side panel door of the\n\tvan slide open.\n\t\n\tTWO MORE MEN climb out.  They are also dressed in dark\n\tclothes.  They also carry satchels.\n\t\n\tThey walks calmly across the street, grow large in the window\n\tas they approach us.  The first intruder (who has a name,\n\tit's BURNHAM) steps over to the kitchen door, runs his\n\tsilvery strip through the gap.  Another HUM and spark.\n\t\n\tAN ALARM PANEL\n\t\n\tflashes again.\n\t\n\tZONE 1 DISABLED\n\t\n\tIN THE KITCHEN,\n\t\n\tBurnham opens the kitchen door, letting the two other guys\n\tslip inside.  RAOUL is a hulking figure whose back seems to\n\trise up over the top of his slouching head; when he walks it\n\tlooks like gravity does all the work, just pulling him\n\tforward.  JUNIOR is much smaller, very high-strung, dresses\n\tlike a homey, very street, but can't hide the fact that the\n\tstreet is Park Avenue.\n\t\n\tThey all freeze, staring at the moving boxes.\n\t\n\t                     JUNIOR\n\t          Fuck.\n\t\n\t                     BURNHAM\n\t          I know.\n\t\n\t                     RAOUL\n\t          What?\n\t\n\t                     BURNHAM\n\t          A woman and a little girl, both\n\t          asleep upstairs.\n\t\n\t                     JUNIOR\n\t          Fuck!\n\t\n\t                     BURNHAM\n\t          Keep your voice down.\n\t\n\t                     JUNIOR\n\t          They're not supposed to be here!\n\t\n\t                     BURNHAM\n\t          This was your department, Junior.\n\t\n\t                     JUNIOR\n\t          They're not supposed to be here!\n\t\n\t                     BURNHAM\n\t          That's why the key didn't work, they\n\t          changed the locks.\n\t\n\t                     JUNIOR\n\t          Fourteen day escrow, man, that's\n\t          almost three weeks!  They shouldn't\n\t          be here for another week!  They\n\t          don't own this house yet!\n\t\n\t                     BURNHAM\n\t               (pause)\n\t          Exactly how is fourteen days almost\n\t          three weeks?\n\t\n\t                     JUNIOR\n\t          Fourteen business days.  Escrow is\n\t          always business days.\n\t\n\tBurnham sighs.\n\t\n\t                     JUNIOR\n\t          I mean, right?  Isn't it?\n\t\n\t                     BURNHAM\n\t          You're an idiot.\n\t\n\tRaoul steps forward, shoves Burnham with both hands in the\n\tchest.\n\t\n\t                     RAOUL\n\t          Watch your mouth.\n\t\n\t                     JUNIOR\n\t          It's okay, Raoul.\n\t\n\t                     BURNHAM\n\t               (to Junior)\n\t          Who is this guy?\n\t\n\t                     JUNIOR\n\t          Raoul is cool.  That's all you need\n\t          to know.\n\t\n\t                     BURNHAM\n\t          This is insane.  I'm outta here.\n\t\n\tHe starts for the door.\n\t\n\t                     JUNIOR\n\t          Wait a minute, wait a minute.  We\n\t          can still handle this.\n\t               (to Raoul)\n\t          Can we still handle this?\n\t\n\t                     RAOUL\n\t          It's just the woman and the kid?\n\t\n\t                     BURNHAM\n\t          Unless Daddy comes back later.\n\t\n\t                     JUNIOR\n\t          Daddy's not coming back, she's in\n\t          the middle of a divorce, it's just\n\t          the two of them.  We're okay, here.\n\t               (to Raoul)\n\t          We can do this, right?\n\t\n\t                     RAOUL\n\t          You're fuckin' A we can do this.\n\t\n\t                     BURNHAM\n\t          Not with me.  Not with people.\n\t\n\t                     JUNIOR\n\t          Forty-five minutes.  That's all you\n\t          said you need.  That's like nothing.\n\t\n\t                     BURNHAM\n\t          She'll call the cops, they'll be\n\t          here before I get unpacked.\n\t\n\t                     JUNIOR\n\t          So we keep an eye on her.  Raoul can\n\t          totally administrate that part.\n\t\n\t                     RAOUL\n\t          No problem.\n\t\n\t                     BURNHAM\n\t          I don't want Raoul to administrate\n\t          that part.\n\t\n\t                     JUNIOR\n\t          They won't get hurt.\n\t\n\t                     BURNHAM\n\t          What about us?  What if she has a\n\t          gun?\n\t\n\t                     JUNIOR\n\t          Raoul, what in God's name do we do\n\t          if she has a gun?\n\t\n\tRaoul pulls up his sweatshirt, revealing a .38 tucked into\n\this belt.\n\t\n\t                     BURNHAM\n\t          Asshole.\n\t\n\t                     JUNIOR\n\t          A guy shows you a gun, Burnham, and\n\t          you insult him?  Hey, who's the\n\t          idiot?  Huh?\n\t\n\t                     BURNHAM\n\t          Where did you get this clown?\n\t\n\t                     JUNIOR\n\t          I met him at the tables, same as\n\t          you.  And frankly, I'm grateful we\n\t          have a little muscle right about\n\t          now.\n\t\n\t                     BURNHAM\n\t          What tables?  I've never seen him\n\t          before.\n\t\n\t                     JUNIOR\n\t          Different tables.\n\t\n\t                     BURNHAM\n\t               (to Raoul)\n\t          The fuck did you bring a gun for?\n\t\n\t                     RAOUL\n\t          You're welcome.\n\t\n\t                     BURNHAM\n\t          Peace out.\n\t\n\tHe moves for the door.  Junior, trying desperately to hold\n\tthis together, gets there first, blocks the door with his\n\tback.\n\t\n\t                     JUNIOR\n\t          We can't do it without you, Burnham.\n\t\n\tJunior starts at Burnham.  Raoul stares at Burnham.\n\t\n\t                     JUNIOR\n\t          It's still a good plan.  It's\n\t          just... got a twist.\n\t\n\t                     BURNHAM\n\t          Yeah.  Kidnapping.\n\t\n\t                     JUNIOR\n\t          Not if we keep 'em here.  You can't\n\t          kidnap somebody in their own house.\n\t          It's just breaking and entering,\n\t          unless we take 'em someplace.  Or\n\t          something like that, I'm pretty\n\t          sure.\n\t\n\t                     BURNHAM\n\t          Pure idiot.\n\t\n\t                     JUNIOR\n\t          I am.  I'm an idiot's son.  An\n\t          idiot's grandson.  I'm third-\n\t          generation idiot.  But for once in\n\t          my life I had a good idea, and I'm\n\t          not giving up so easy.  You are?\n\t          Are you actually telling me that for\n\t          the first time in your life you're\n\t          gonna throw your cards on the table\n\t          and go home early?  I can't believe\n\t          my eyes.\n\t               (Burnham hesitates)\n\t          Fourteen million dollars upstairs,\n\t          Burnham.  You'll be out of the hole.\n\t          Baby, you'll be so far out of the\n\t          hole you could draw bricks every\n\t          night for the next twenty years and\n\t          still shit green.\n\t               (Burnham sways)\n\t          Come on, Buddy.  One more hand.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tMeg sits up in bed.  She's bleary, her head feels like\n\tsomeone rested a manhole cover on it.  She gets up, in the\n\tdark, and staggers off toward the bathroom door, feeling her\n\tway with her arms, her eyes not adjusted to the dark.\n\t\n\tShe steps through the door.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tShe walks into the bathroom and feels around for a light\n\tswitch, but can't find it.  She blinks, squints, tries to get\n\ther bearings.  The only light is a harsh white glow that\n\tcomes from along one wall, from a bank of tiny video\n\tmonitors.\n\t\n\tShe finds the light switch, flicks it on, it nearly blinds\n\ther.  She's not in the bathroom.  She's wandered into the\n\tpanic room by mistake.\n\t\n\tShe turns around, walks out, leaving the lights on behind\n\ther.\n\t\n\tWe linger for a look at the video screens.  If only she'd\n\tdone the same, she'd see what we see.\n\t\n\tON THE MONITORS,\n\t\n\twe see the three men, still in the kitchen, huddled in a\n\tgroup, silently debating what to do.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tUsing the light that spills from the open door to the panic\n\troom, Meg comes back into the master bedroom and finds the\n\tproper door to the bathroom.\n\t\n\tINT.  BATHROOM - NIGHT\n\t\n\tMeg SNAPS the cap off a jug of Advil and dumps three into her\n\tpalm.  She pops them in her mouth, searches for a glass for\n\twater, finds none, bends to the spout for a gulp to wash them\n\tdown.\n\t\n\tShe turns to the toilet.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tOn the monitor, we see the three men leave the kitchen and\n\tstart up the stairs.\n\t\n\tINT.  BATHROOM - NIGHT\n\t\n\tMeg stands, flushes the toilet.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tOne floor down, Burnham, Raoul, and Junior freeze, just\n\tcoming up the stairs from the kitchen.  They look up, hearing\n\tthe water rushing through the pipes in the ceiling directly\n\tabove them.\n\t\n\tThey stare at the ceiling, following with their eyes as a\n\tpair of feet pad across the CREAKY floor.  Finally, they hear\n\ta SQUEAK of bedsprings as Meg climbs back into bed.\n\t\n\tThey hold a moment longer, a silence grows.  Raoul reaches\n\tinto his jacket pocket and pulls out a ski mask.  He pulls it\n\tover his head.  They look at him.\n\t\n\t                     RAOUL\n\t               (whispers)\n\t          No face.\n\t\n\tBurnham rolls his eyes.  Doesn't know this guy much, but\n\thates him so far.  They start across the foyer toward the\n\tstairs.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tMeg rolls over, to go back to sleep.  She sees she's left the\n\tlights on in the panic room.  She TSKS, gets out of bed, and\n\twalks across the floor toward it.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg steps into the panic room, raises her hand to the light\n\tswitch --\n\t\n\t-- and stops, her hand frozen in mid-air.  She cocks her\n\thead, looking at something she can't understand.\n\t\n\tShe blinks.  Takes a step, further into the room.  She stares\n\tat the video monitors -- at the three men in dark clothes,\n\tstealing silently across the foyer.\n\t\n\tThis can't be.  These are just pictures, they have no\n\trelation to reality.  She drops to her knees, her face inches\n\tfrom the screens, and reaches out to touch them, as if trying\n\tto make sure they're really there.\n\t\n\tINT.  STAIRWELL - NIGHT\n\t\n\tThey reach the base of the stairs, Junior in the lead.  As he\n\treaches a bend at the base of the stairs, he places one foot\n\tshort on an angled step and it slips off.  He trips, falls\n\tforward.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tWatching the video monitors, Meg stares in horror as the\n\timage of Junior slipping is verified by the SLAP of his hands\n\ton the stairs as he catches himself, audible through the open\n\tdoor to the panic room.\n\t\n\tShe GASPS.  It is real.\n\t\n\tINT.  STAIRWELL - NIGHT\n\t\n\tIn the living room, Burnham's eyes are wide as saucers,\n\tstaring at Junior as he turns and pulls himself to his feet.\n\t\n\tJunior points at Raoul, speaks in an urgent whisper.\n\t\n\t                     JUNIOR\n\t          Top floor, get the little girl and\n\t          keep her there.  I'll bring the\n\t          woman up.  Gimme.\n\t\n\tHe holds out his hand for the gun and Raoul gives it to him.\n\t\n\t                     JUNIOR\n\t               (points to Burnham)\n\t          Stay here.  Nobody gets past you.\n\t\n\tHe heads for the stairs.  Raoul follows close behind him.\n\tBurnham stays, reluctant -- what the fuck has he gotten\n\thimself into?\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg moves.  Leaps to her feet and dashes out of the room.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tMeg races across her bedroom, flies out the door, and bolts\n\tup the carpeted stairs, headed for the top floor.\n\t\n\tINT.  SARAH'S BEDROOM - NIGHT\n\t\n\tMeg races into Sarah's room, drops onto the bed, and grabs\n\tSarah by the shoulders, trying to rouse her.\n\t\n\t                     MEG\n\t          Wake up... wake up...\n\t\n\tBut she's in a profound child's sleep and won't wake up.\n\t\n\tINT.  THIRD FLOOR HALLWAY - NIGHT\n\t\n\tOne floor down, Junior and Raoul reach the third floor\n\tlanding.  Still moving stealthily, Junior heads down the hall\n\tfor the master bedroom, where he thinks Meg is sleeping.\n\tRaoul heads for the stairs that lead to the top floor.\n\t\n\tINT.  SARAH'S BEDROOM - NIGHT\n\t\n\tMeg is desperate, still can't wake Sarah.\n\t\n\t                     MEG\n\t          Wake up...come on, come on...\n\t\n\tShe sees a plastic cup on her night table/box, half filled\n\twith water.  She snatches it and tosses the water in her\n\tface.\n\t\n\tNow she's awake.  And pissed off.  She SPUTTERS, SHOUTS.\n\t\n\t                     SARAH\n\t          WHAT DID YOU DO THAT FOR?!\n\t\n\tINT.  THIRD FLOOR HALLWAY - NIGHT\n\t\n\tRaoul, at the base of the stairs that lead to the top floor,\n\thears the kid shouting.  He starts up the stairs, quickly.\n\t\n\tINT.  SARAH'S BEDROOM - NIGHT\n\t\n\tOn the top floor, Meg is already dragging Sarah out of the\n\troom and into the hallway.\n\t\n\tINT.  HALLWAY - NIGHT\n\t\n\tMeg and Sarah come out of Sarah's bedroom just as Raoul\n\treaches the top of the stairs at the other end.  They're cut\n\toff.\n\t\n\tMeg freezes, staring at the hulking ski-masked figure at the\n\tend of the hallway.  She thinks, no idea what to do for a\n\tsecond.  She looks frantically to her right -- the bathroom,\n\tdead end.\n\t\n\tShe looks to her left.\n\t\n\tThe elevator.\n\t\n\tShe yanks open the elevator door, throws aside the gate, and\n\traces inside with Sarah.\n\t\n\tRaoul takes off down the hall, lunging for the elevator.\n\t\n\tINT.  ELEVATOR - NIGHT\n\t\n\tMeg SLAMS the gate shut and PUNCHES the button for the first\n\tfloor.  The elevator GROANS to life and starts down --\n\tslowly.\n\t\n\tSarah looks up at her, terrified.\n\t\n\t                     SARAH\n\t          What's going on?!\n\t\n\t                     MEG\n\t          People.  In the house.\n\t\n\tAs the elevator descends, they see Raoul, through the window\n\tin the door, as he drops to his knees, to get a good look at\n\tthem.\n\t\n\tINT.  TOP FLOOR HALLWAY - NIGHT\n\t\n\tRaoul turns from the elevator, SHOUTS to the open stairwell.\n\t\n\t                     RAOUL\n\t          IN THE ELEVATOR!  BOTH OF 'EM HEADED\n\t          TOWARD YOU!\n\t\n\tINT.  THIRD FLOOR HALLWAY - NIGHT\n\t\n\tJunior turns from the open doorway of the master bedroom and\n\traces back down the hall, toward the elevator.  He reaches\n\tthe door, peers through the window.\n\t\n\tHe sees the bare feet of Meg and Sarah, dropping toward him.\n\tHe grabs the door handle, pulls as hard as he can, but it\n\tstays locked, with the elevator moving beyond.\n\t\n\tHe bangs on the button, hoping the elevator will stop.  As\n\tMeg and Sarah drop fully into view, he stands there, eye to\n\tmoving eye with her for a moment.  But the elevator doesn't\n\tstop, it keeps going down.\n\t\n\tINT.  ELEVATOR - NIGHT\n\t\n\tMeg stands frozen, terrified, staring at Junior as they move\n\tpast him.\n\t\n\tJunior has another go at the door, pulling as hard as he can,\n\tactually bending the door, but the elevator is still moving,\n\tthe catch holds fast and the door won't open.\n\t\n\tAs they pass, his face suddenly disappears, he takes off.\n\t\n\tINT.  STAIRWELL - NIGHT\n\t\n\tJunior flies down the stairs, to cut them off at the first\n\tfloor.\n\t\n\tINT.  ELEVATOR - NIGHT\n\t\n\t                     MEG\n\t          He's going down.\n\t\n\t                     SARAH\n\t          That room!\n\t\n\t                     MEG\n\t          What?!\n\t\n\t                     SARAH\n\t          PANIC ROOM!\n\t\n\tMeg thinks, then punches the button for three, to go back up.\n\t\n\tBut the elevator continues down.  She jabs at it, futilely.\n\t\n\t                     SARAH\n\t          No.  you gotta...\n\t\n\tShe reaches past her, pushes the STOP button.  The elevator\n\tjerks to a halt.  Then Sarah pushes three.  Now the elevator\n\tstarts to rise.\n\t\n\tMeg looks at her, impressed.  Love that kid.\n\t\n\tINT.  ENTRY FLOOR - NIGHT\n\t\n\tIn the foyer, Junior freezes, hearing the elevator stop and\n\tstart again.\n\t\n\t                     JUNIOR\n\t          SHE'S COMING BACK UP TOWARD YOU!!\n\t\n\tHe takes off up the stairs again.  Burnham can't take it\n\tanymore, he takes off after Junior, following him upstairs.\n\t\n\tINT.  FOURTH FLOOR HALLWAY - NIGHT\n\t\n\tRaoul, still on the top floor, heads for the stairs, fast.\n\t\n\tINT.  STAIRWELL - NIGHT\n\t\n\tJunior races back up the stairs.  They have her caught in the\n\tmiddle.\n\t\n\tINT.  THIRD FLOOR HALLWAY - NIGHT\n\t\n\tThe door to the elevator BANGS open on three, the gate\n\tRATTLES aside, and Meg and Sarah leap out.  They take off\n\tdown the hall, toward the doorway to the master bedroom.\n\t\n\tRaoul flies down the stairs, not twenty feet behind them.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tMeg and Sarah run through the master bedroom.  As she passes\n\tthe night table, Sarah swings an open hand to grab her cell\n\tphone from its cradle.  But in her haste she starts to pull\n\tit out at an angle and the prongs at the bottom stick in the\n\tcharger.  The phone slips from her fingers, bounces off the\n\tcorner of the table, caroms off her foot, and skitters under\n\tthe bed.\n\t\n\tSarah turns, looks to the head of the stairs just as Junior\n\tturns the corner and Raoul thunders down the steps from four.\n\t\n\tShe abandons the phone, grabs Sarah, and they lunge through\n\tthe open doorway to the panic room.\n\t\n\tJunior and Raoul burst through the doorway to the bedroom,\n\tjust a few steps away.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg and Sarah trip over each other coming through the\n\tdoorway, they tumble to the floor of the panic room, the door\n\twide open behind them.  Meg spins around, hurls herself at\n\tthe red button on the wall --\n\t\n\t-- Junior leaps, sailing through the air toward them --\n\t\n\t-- Meg SLAMS her open palm on the red button, the massive\n\tcoiled spring that holds the metal door open is released, the\n\tsteel barrier leaps forward out of the wall --\n\t\n\t-- and WHANGS shut in a split-second.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tJunior SLAMS into the closing metal door, banging his\n\tshoulder into it, and slithers to the ground, too late.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg rolls over and pulls Sarah into her arms, both of them\n\tbreathing hard, asking each other if they're okay, scared out\n\tof their minds.\n\t\n\tBut safe.\n\t\n\tShe spots the telephone, the one with the special buried\n\tphone line.  She lunges for it, snatches it from its cradle,\n\tlistens for a dial tone.\n\t\n\tNothing there either.\n\t\n\t                     MEG\n\t          Damn it!\n\t\n\t                     SARAH\n\t          It doesn't work?!\n\t\n\t                     MEG\n\t          Different phone line, I never hooked\n\t          it up!\n\t\n\tShe hurls it down, looks back at Sarah.  She seems a bit\n\tpale, scared.  She goes to her, holds her, reassures her.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tJunior is slumped at the base of the door, livid, in pain,\n\tpounding on it with his fists, screaming \"NO!\" over and over\n\tagain, crazy with rage.\n\t\n\tRaoul stands in the middle of the room, chest heaving, hands\n\ton his knees.\n\t\n\tBurnham finally walks into the room and stops in the doorway,\n\tlooks from Raoul to Junior to the door to the panic room,\n\tfigures out the situation.\n\t\n\t                     BURNHAM\n\t          Tell me... tell me they're not in\n\t          there...\n\t\n\tWe rise up, above them, above the room, looking down on them,\n\tthe rats-in-a-maze shot.\n\t\n\tWe rise up further still, above where the ceiling ought to\n\tbe, to look down on this room and the one beside it, the room\n\tbehind the four inches of reinforced steel, the panic room in\n\twhich Meg and Sarah kneel in the middle of the floor, holding\n\teach other tight.\n\t\n\tStandoff.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tVery close on the metal door, from inside the panic room.  An\n\tear moves slowly into frame, presses against the cold steel.\n\tListens.\n\t\n\tMeg pulls away from the door, shaking her head.\n\t\n\t                     MEG\n\t          Can't hear a thing.\n\t\n\t                     SARAH\n\t          What do they want?\n\t\n\t                     MEG\n\t          I don't know.  Rob us.  I don't\n\t          know.\n\t\n\tShe sits back against a wall, looks around, at the tiny room.\n\tShe's trying not to show how freaked out she is.\n\t\n\t                     SARAH\n\t          What do we do?\n\t\n\t                     MEG\n\t          Wait.\n\t\n\t                     SARAH\n\t          What if they get in here?\n\t\n\t                     MEG\n\t          They can't.  They can't get in here.\n\t          No.  They can't.\n\t\n\t                     SARAH\n\t          I heard you.\n\t\n\t                     MEG\n\t          Feel okay?\n\t\n\t                     SARAH\n\t          Yeah.\n\t\n\t                     MEG\n\t          Shaky?\n\t\n\t                     SARAH\n\t          Nope.\n\t\n\t                     MEG\n\t          Chills?\n\t\n\t                     SARAH\n\t          Huh uh.\n\t\n\tShe checks her wristwatch, for some reason.\n\t\n\t                     SARAH\n\t          Don't worry about me.\n\t\n\tThe implications being, worry about yourself.\n\t\n\tSarah crawls over to the bank of video monitors, studies\n\tthem.  Meg crawls over to join her.  They scan the screens.\n\t\n\tON THE MONITORS,\n\t\n\tthere are a dozen different views of the house.  Front stoop.\n\tKitchen.  Dining room.  Entry floor.  Living room.  Master\n\tbedroom.  Den.  Top floor bedrooms, both of them.  Top two\n\tfloor hallways.  Even one with a shot of the inside of the\n\televator.\n\t\n\tThe three intruders are gathered in the living room, standing\n\tin a tight circle, having a hell of an argument.  Lots of\n\tgesturing, fingers jabbing in chests, but we can't hear a\n\tword.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg furrows her brow, noticing something interesting to the\n\tright of the video monitors.  She slides over, studies a\n\tpanel there with sixteen different buttons and a small\n\tgrilled area.\n\t\n\t                     MEG\n\t          Hey...\n\t\n\tSarah joins her, looks at the buttons.  Each one is labeled\n\twith a different room name -- den, kitchen, master bedroom,\n\tetc.  Up in the corner there is a button that says \"ALL\n\tPAGE,\" down in the opposite corner there's a button marked\n\t\"TALK.\"\n\t\n\tMeg looks at Sarah.\n\t\n\t                     SARAH\n\t          Go ahead.\n\t\n\tMeg is reluctant, frightened.  Sarah is encouraging, for the\n\tfirst time.\n\t\n\t                     SARAH\n\t          You can do it.\n\t\n\tMeg leans forward, clears her throat.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tBurnham, Raoul, and Junior are standing in the half-darkened\n\tliving room, in the middle of their argument, when a VOICE\n\tbooms around them.\n\t\n\t                     MEG (O.S.)\n\t          Excuse me.\n\t\n\tThey practically jump out of their shoes, looking around for\n\tthe source of the voice.\n\t\n\t                     MEG (O.S.)\n\t          The police are on their way.\n\t\n\tOnly Burnham has remained relatively calm.  After he gets\n\tover the initial shock, he walks toward the tiny camera\n\tthat's hidden in an upper corner of the living room wall and\n\tstares up at it.  Raoul, who has taken off his ski mask, is\n\tcareful to move out of the camera's range, and turn his back\n\tto it.\n\t\n\t                     MEG\n\t          I suggest you leave.\n\t\n\tON THE MONITORS,\n\t\n\tBurnham looks up at the camera and shakes his head, wagging a\n\tfinger from side to side.  He raises a hand, makes a gesture\n\tlike a telephone, then wags his finger again.  The message is\n\tclear -- you don't have a phone.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg is puzzled.\n\t\n\t                     MEG\n\t          How'd he know that?\n\t\n\tShe presses the talk button again.\n\t\n\t                     MEG\n\t               (into speaker)\n\t          Take what you want and get out.\n\t\n\tThat sounded fairly tough.  She looks at the monitor again.\n\t\n\tON THE MONITORS,\n\t\n\tthe three of them have an urgent, whispered conference, then\n\tthey all start patting their pockets for some reason, turning\n\tin circles, looking for something.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg and Sarah watch them, confused.\n\t\n\tON THE MONITORS,\n\t\n\tBurnham holds up a finger to the camera -- wait a second --\n\twhile Raoul and Junior rush off screen, looking for\n\tsomething.  Junior returns a moment later holding something\n\tand the three of them hunch over a box, working on something.\n\t\n\tAfter a moment, they break apart and Junior steps up to the\n\tcamera holding a pad of paper.  He shows it to the camera.\n\tOn the top page, in big block letters, they've written.\n\t\n\tWHAT WE WANT\n\t\n\tAfter a suitable pause for reading, he turns to the second\n\tpage, where four more words are written.\n\t\n\tIS IN THAT ROOM.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah GASPS, Meg sits back.\n\t\n\t                     MEG\n\t          \"What we want is in that room.\"\n\t\n\t                     SARAH\n\t          They're coming in here, aren't they?\n\t\n\t                     MEG\n\t          No, I told you, they can't.  It's\n\t          not a possibility.\n\t\n\tAngry, she sits forward and jabs the talk button.\n\t\n\t                     MEG\n\t               (into speaker)\n\t          What do you know about this room?\n\t\n\tON THE MONITORS,\n\t\n\tthere is more frenzied writing, more arguing, and a first\n\tdraft of a response torn up.  Finally, Junior steps forward\n\twith another sign:\n\t\n\tMORE THAN YOU.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg's confidence is ebbing, but she doesn't want to show it.\n\tShe hits the talk button again.\n\t\n\t                     MEG\n\t               (into speaker)\n\t          We're not coming out.  We're not\n\t          letting you in.  Get out of my\n\t          house.\n\t               (clicks off)\n\t\n\t                     SARAH\n\t          Say fuck.\n\t\n\t                     MEG\n\t               (into speaker)\n\t          Fuck.\n\t\n\t                     SARAH\n\t          \"Get the fuck out of my house.\"\n\t\n\t                     MEG\n\t               (into speaker)\n\t          Get the fuck out of my house!\n\t\n\tShe clicks off again, looks to Sarah for approval, and gets\n\tit, sort of, in Sarah's half-smile.  But Sarah's eyes go back\n\tto the screen.\n\t\n\t                     SARAH\n\t          Answer.\n\t\n\tMeg follows Sarah's eyes back to the screen, where another\n\tmessage is being held up for them.\n\t\n\tON THE MONITORS,\n\t\n\tthe notepad says:\n\t\n\tWE WILL LET YOU GO.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg and Sarah speak at the same time.\n\t\n\t                     MEG\n\t          Oh, please.\n\t\n\t                     SARAH\n\t          Give me a break.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tIn the living room, her voice booms from the speaker.\n\t\n\t                     MEG (O.S.)\n\t          Conversation's over.\n\t\n\tWith an audible CLICK, she signs off.  Burnham, Raoul, and\n\tJunior stand arrayed beneath the camera, staring up at it,\n\tdumbfounded.\n\t\n\t                     BURNHAM\n\t          Got her right where you want her,\n\t          Junior.\n\t\n\t                     JUNIOR\n\t          Shut up.\n\t\n\t                     BURNHAM\n\t          When you said you'd let 'em go I\n\t          thought she'd come running right out\n\t          for sure.\n\t\n\t                     JUNIOR\n\t          Shut up and let me think.\n\t\n\tHe opens a pack of cigarettes, takes out a joint and lights\n\tit.\n\t\n\t                     BURNHAM\n\t          I'm afraid to let you think, Junior.\n\t          Things get worse when you think.\n\t               (sniffs)\n\t          Oh, that's gonna help.\n\t\n\t                     JUNIOR\n\t               (holding in a hit)\n\t          Okay, fuckball, you think.  What are\n\t          we gonna do?\n\t\n\t                     RAOUL\n\t          What if she called the cops?\n\t\n\t                     BURNHAM\n\t          She didn't.\n\t\n\t                     JUNIOR\n\t          She said she did.\n\t\n\t                     BURNHAM\n\t          She lied.  Cops woulda been here by\n\t          now if she called 'em.  Besides,\n\t          Junior cut the phones.\n\t\n\tBurnham goes to the window and stares outside.  He laughs,\n\tcovers his face.\n\t\n\t                     RAOUL\n\t          What the fuck is funny about this?\n\t\n\t                     BURNHAM\n\t          God.\n\t\n\t                     RAOUL\n\t          There is not one thing funny here.\n\t\n\t                     BURNHAM\n\t          Who else but God could think this\n\t          shit up?  I spend ten years building\n\t          those fucking rooms to keep people\n\t          out, now I gotta figure out how to\n\t          get in.  God, man, He just loves the\n\t          irony.\n\t\n\t                     JUNIOR\n\t          Yes.  Yes, it's all terrible ironic\n\t          and amusing.  You fuck.  Now how are\n\t          you gonna get us into that room?\n\t\n\t                     BURNHAM\n\t          Can't.  Whole point.  Can't get in\n\t          the room.\n\t\n\t                     RAOUL\n\t          So what the fuck are we supposed to\n\t          do?!\n\t\n\t                     BURNHAM\n\t          Make her come out.  And when she\n\t          does, that's when we gotta be\n\t          careful.  She can't get out of this\n\t          house.  She can't even think she can\n\t          get out of this house.  We just keep\n\t          them here and keep them quiet for\n\t          forty-five minutes.  And I don't\n\t          want\n\t               (Raoul)\n\t          Joe Pesci here standing over them\n\t          with his fat sweaty finger on the\n\t          trigger.  That's a sure way for us\n\t          to end up with two dead bodies and\n\t          little puffs of smoke burning out of\n\t          our heads up in Greenhaven.  So\n\t          we're gonna seal the place up.  They\n\t          wanna hole up in here?  Fine, we'll\n\t          help 'em.  Make it impossible for\n\t          them to leave.  Once they come out\n\t          of that room.\n\t\n\t                     JUNIOR\n\t          And why exactly would they want to\n\t          come out?\n\t\n\tAt the window, Burnham notices something sitting just outside\n\tthe French doors, on the balcony.  It's a large outdoor\n\tbarbecue grill.  He thinks, takes a step closer.\n\t\n\tHe sees a white five gallon tank of some kind underneath the\n\tgrill.\n\t\n\t                     BURNHAM\n\t          Workin' on it.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tIn the panic room, Meg is sitting cross-legged on the floor,\n\tleaning against a wall, but Sarah is in motion, sorting\n\tthrough shelves, opening drawers.  Every drawer has something\n\tin it, sealed under plastic.  She opens and closes, sorts and\n\tlifts finds the following:\n\t\n\tWaterproof matches and lighters.\n\t\n\tFlashlights.\n\t\n\tUnopened packages of batteries.\n\t\n\tSealed water bags stamped \"PURE FIVE YEARS FROM DATE.\"\n\t\n\tTinned food.\n\t\n\tFlares.\n\t\n\tPillows, fireproof blankets (we know because the bags are\n\tstamped FIREPROOF BLANKET).\n\t\n\tA complete tool kit.\n\t\n\tAs Sarah explores, she discovers something in the far wall at\n\tthe end of the room, down on the floor at eye level.\n\t\n\tIt's a small round portal, about eight inches across, with a\n\tfour-pronged cloverlike seal.  The portal is closed tight, as\n\tSarah pokes and scrapes at it idly with a finger or two, it\n\tresists her attempts to crank it open.\n\t\n\tMeg notices.\n\t\n\t                     MEG\n\t          Hey.  Relax, okay?\n\t\n\tBut Sarah keeps at it, feels along the edges of the portal,\n\tthen all along the wall, looking for some kind of hidden\n\tswitch that controls it.\n\t\n\t                     MEG\n\t          I mean it, lie down.  You get your\n\t          adrenaline up and you know what's\n\t          gonna happen.\n\t\n\tSarah stops, looks at her mother, who is pale and wan,\n\thuddled in the corner.\n\t\n\t                     SARAH\n\t          Are you freaking out?\n\t\n\t                     MEG\n\t          Little bit.  Yeah.\n\t\n\tSarah looks around the room.\n\t\n\t                     SARAH\n\t          Small space?\n\t\n\t                     MEG\n\t               (nods, fast)\n\t          Don't though.\n\t               (talk about it, that is)\n\t\n\tSarah looks at her, thinks.  It's not an unfamiliar\n\tsituation, her needing to comfort her mother.\n\t\n\t                     SARAH\n\t          Why did the chicken cross the road?\n\t\n\t                     MEG\n\t          What am I, a five year old?\n\t\n\t                     SARAH\n\t          Why did the chicken cross the road?\n\t\n\t                     MEG\n\t          I don't know, why?\n\t\n\t                     SARAH\n\t          To prove he wasn't chicken.\n\t\n\tMeg tries to push a smile across her face, but it's\n\timmediately dashes as she looks back at the video screens.\n\tHer eyes show alarm, staring at the kitchen.\n\t\n\t                     MEG\n\t          What the hell are they doing?\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\tThe contents of one of the satchels is dumped out over the\n\tkitchen counter, every kind of tool imaginable, many that are\n\tunfamiliar to us.  They sort through the pile, choosing\n\tthings.\n\t\n\tINT.  KITCHEN FLOOR - REAR DOORS - NIGHT\n\t\n\tAt the French doors that lead to the garden, Burnham has a\n\tcordless screwdriver and a pile of long screws in his hand.\n\tHe reaches up, drills a screw through the door, into the\n\tcorner of the door frame.  He does the same at the bottom of\n\tthe door.\n\t\n\tHe unlocks the doorknob, tries it.  The screws hold the door\n\tfast.  He moves on, to the next door.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tIn the panic room, Meg stares at the video screens, eyes\n\twide, terrified.  She watches them.  Can't take her eyes off\n\tthem.\n\t\n\t                     MEG\n\t               (barely audible)\n\t          ... locking us in...\n\t\n\tINT.  LIBRARY - NIGHT\n\t\n\tIn the library, in the front of the house, Raoul screws shut\n\ta window, driving the long screws into its frame.  He looks\n\tout at the street, at two CLUBGOERS walking home.\n\t\n\tHe pulls the drape.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg's hands are over her mouth, she's trembling, shaking her\n\thead from side to side.  This can't be happening.\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\tIn the kitchen, Junior goes to the wall phone Meg used to\n\tcall for pizza earlier.  He cuts the phone wire with a\n\tknife.\n\t\n\tHe stands there, staring at the phone, wiping the sweat from\n\this palms on his pants.  Not satisfied, he pulls the phone\n\titself out of the wall, cuts the cord for the handset too.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg pushes herself back into the corner of the panic room,\n\thorrified.  Sweat has broken out on her forehead, her whole\n\tbody seems to vibrate.  Sarah comes over, leans in front of\n\ther.\n\t\n\t                     SARAH\n\t          Mom?\n\t\n\tBut Sarah's voice is hollow, seems far away.\n\t\n\t                     SARAH\n\t          Are you okay?\n\t\n\tMeg looks at her.  As she watches, Sarah floats away from\n\ther.  In fact, the entire room is floating away from her,\n\telongating.\n\t\n\tAnd narrowing.  Meg looks to the sides, and the walls don't\n\tjust seem like they're pushing in on her, they are pushing in\n\ton her.\n\t\n\tMeg opens her mouth, screams, but no sound comes out.\n\t\n\tSarah stands up and bends over her, but now she's just a\n\tfigure far away, all the way at the end of a long, impossibly\n\tnarrow hall.\n\t\n\t                     SARAH\n\t               (barely heard)\n\t          MOM?!  MOM!!\n\t\n\tMeg crawls out, into the middle of that hallway, to get away\n\tfrom the wall, but they both continue moving in on her.\n\t\n\t                     MEG\n\t          Not here... not here... someplace\n\t          else... someplace else...\n\t\n\tHer eyes roll back into her head, we see just the whites, and\n\tshe loses her balance, falling over onto her back.\n\t\n\tWe fall with her, move in tight on her face, and the dark\n\thallway carpet beneath it turns to green, all green, grassy\n\tgreen.  She sits up, looks around, and we realize she is in\n\tfact somewhere else, she's --\n\t\n\tEXT.  GREAT LAWN - DAY\n\t\n\t-- in the middle of the Great Lawn, in Central Park.  She\n\tstands, turns in a circle, she's completely alone on the\n\tgreat green grassy plain in the middle of a beautiful spring\n\tday, tall buildings sparkling in the distance.\n\t\n\tMeg stretches her arms out, smiles, but far off in the\n\tdistance, she hears a voice calling to her, dimly:\n\t\n\t                     SARAH (O.S.)\n\t          Mom?!  Mom!!\n\t\n\tMeg ignores the voice, she's so happy to be out here, out in\n\tthe open, in the beautiful wide open, she could stay here\n\tforever, she spins around, throws her head back, but there's\n\tthat voice again, insistent:\n\t\n\t                     SARAH (O.S.)\n\t          Mom, please!!\n\t\n\tThere is the sharp sound of a SLAP, and Meg's face abruptly\n\tjerks to the side.  She touches her cheek, confused, as a hot\n\tred handprint rises up on it.\n\t\n\tWhat the hell was that?\n\t\n\tBAM!\n\t\n\tNow the perfect spring day is shattered suddenly by a\n\tdeafening CRUNCH.  The smile vanishes from Meg's face, she\n\tturns.  Where did that come from?\n\t\n\tBAM!  Another one, even louder.  Meg's whole body winces at\n\tthe sound.\n\t\n\tBAM!  A third one, and on this one Meg falls to her knees,\n\tcovering her ears, walls spring up around her, right there on\n\tthe Great Lawn, we rush in on her, the walls close in, and\n\tshe's right back --\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\t-- in the panic room, where she always was, and that pounding\n\tis real, it's right outside the door, it's like somebody's\n\ttrying to smash their way right through the wall.\n\t\n\tSarah is right over Meg, holding her by the arms, and that\n\thandprint on Meg's face is real, Sarah must have slapped her\n\tto try to bring her out of it.\n\t\n\t                     SARAH\n\t          THEY'RE COMING IN!  THEY'RE COMING\n\t          IN!\n\t\n\tMeg looks to the wall, watches it seem to vibrate as another\n\tdeafening BANG crunches into it from outside.\n\t\n\tBAM!  BAM!  BAM!  The sound is deafening.  Sarah throws both\n\thands over her ears.  Meg looks around, still disoriented.\n\t\n\t                     SARAH\n\t          YOU CAN'T DO THAT!  YOU CAN'T FREAK\n\t          OUT LIKE THAT!  YOU HAVE TO STAY\n\t          HERE WITH ME!\n\t\n\t                     MEG\n\t          I am.  I'm here.\n\t\n\t                     SARAH\n\t          YOU HAVE TO!\n\t\n\t                     MEG\n\t          I'm here.  I'm here.\n\t\n\tThey huddle there, terrified.  Meg blinks, wipes the sweat\n\tfrom her forehead, begins to come back around.  She turns her\n\thead, sneaks a look at the funny wristwatch Sarah wears,\n\ttries to look without her daughter knowing.  It's not an\n\tordinary watch, it only has one number, a tall, flashing\n\tdigital display:\n\t\n\t120\n\t\n\tMeg nods, as if reassuring herself.\n\t\n\t                     MEG\n\t          We're fine.  We're okay.\n\t\n\tShe turns, looks at the video monitors to see what the hell\n\tthey're doing out there.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tBAM!\n\t\n\tIn the master bedroom, a claw hammer CRUNCHES into the\n\tsheetrock on the outer wall of the panic room.\n\t\n\tThe intruders are in the master bedroom now, and Burnham is\n\tlike a man possessed, tearing at the sheetrock with the sharp\n\tend of the tool while Junior shines a flashlight into the\n\thole.\n\t\n\tAs the sheetrock tears away, we see the skeleton of the wall\n\tbehind it.  There's a latticework of two by four studs, and\n\tbeyond those the dull shine of the wall's metal core.\n\t\n\tBut that's not what he's after.  He continues tearing,\n\treveals an air duct running through the wall, feeding into\n\tthe panic room through a welded hole in the steel.  Burnham\n\ttears away with the hammer, exposing a short section of the\n\tduct.\n\t\n\tCLANG!  The claw hammer drops into an opened toolbox.\n\tBurnham drops to his knees, rips open another tool case.\n\tThis one has a sophisticated looking power drill in it, along\n\twith a couple dozen specialized bits.  He selects one, twists\n\tit into the drill.\n\t\n\tAt the wall, Burnham puts drill to metal and hits the switch.\n\tA horrendous METAL SCREECH fills the air and the drill bit\n\ttears into the duct, opening up a jagged hole about the size\n\tof a quarter.\n\t\n\tRaoul hurries through the doorway of the bedroom, carrying a\n\tcoiled garden hose.  Burnham snaps his fingers for it, Raoul\n\ttosses it to him, holding one end, and the hose uncoils in\n\tthe air as it snakes across the room.\n\t\n\tBurnham shoves the end of the garden hose into the hole he's\n\tjust drilled in the air duct.\n\t\n\tRIP!  He tears off a length of duct tape and seals the\n\tconnection, makes it airtight.\n\t\n\tSLIT!  Using a large hunting knife, Raoul hacks a ten foot\n\tsection of the garden hose off the coil.\n\tHe stretches it out, across the room, to the white five\n\tgallon tank we saw before, which is now sitting on the floor\n\tup here.  We move in close as Burnham snugs the cut end of\n\tthe garden hose over a spigot at the top of the tank.  Red\n\tblock letters are easy to read on the side of the tank.\n\t\n\tPROPANE\n\tCAUTION - FLAMMABLE\n\t\n\tAlong with a number of other dire warnings.\n\t\n\tBurnham raises his hand to the knob, hesitates, doesn't\n\treally want to do this, but doesn't stop himself either.\n\t\n\tHe spins it open.  Halfway.\n\t\n\t                     JUNIOR\n\t          Open it.\n\t\n\t                     BURNHAM\n\t          I did.\n\t\n\t                     RAOUL\n\t          He said open it.\n\t\n\t                     BURNHAM\n\t          Just sending a message.  She'll get\n\t          the point.\n\t\n\tGas HISSES through the spigot and into the hose.  We follow\n\talong the length of the hose, across the floor of the room,\n\tthrough the hole in the sheetrock, into the hole that's been\n\tdrilled in the air duct --\n\t\n\tINSIDE THE WALL\n\t\n\t-- through the wall itself, where we see the horizontal lines\n\tof an air vent up ahead.  We squeeze between two of the\n\thorizontal lines --\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\t-- and come out in the panic room.  Three red streamers, tied\n\tto the air vent, flap to life as the gas HISSES into the\n\tpanic room.\n\t\n\tDirectly underneath the vent, Meg is hunched up against the\n\twall, her arm around Sarah.\n\t\n\tShe sniffs.\n\t\n\tAgain.\n\t\n\tSarah sniffs.\n\t\n\tThey look at each other.\n\t\n\tShe looks up.  Sees the streamers floating above her.\n\t\n\tShe leaps to her feet, steps up onto a shelf, and stretches\n\ther nose toward the streamers.  Just as she does --\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tNear the tank, Raoul shoves Burnham out of the way.\n\t\n\t                     RAOUL\n\t          We ain't playin', here.\n\t\n\tHe cranks the valve handle of the grill open all the way.\n\tThe gas pours into the hose with an audible WHOOSH.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg, at the vent, falls back, two lungfuls of propane, and\n\tdrops to her knees on the floor.\n\t\n\t                     SARAH\n\t          What, what, what is it?!\n\t\n\t                     MEG\n\t          On the floor!  Get on the floor!\n\t\n\tNow Sarah coughs.  The gas is pouring into the room.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tRaoul is standing guard over the tank, to make sure no one\n\tmesses with the valve.\n\t\n\t                     BURNHAM\n\t          Look, don't be stupid...\n\t\n\tJunior has his head pressed against the door to the panic\n\troom, trying to hear any sounds from within.\n\t\n\t                     JUNIOR\n\t          Be quiet.\n\t\n\t                     BURNHAM\n\t          We're trying to scare them, not kill\n\t          them!\n\t\n\t                     JUNIOR\n\t          They're coughing.\n\t\n\t                     BURNHAM\n\t          They're gonna die in there!\n\t\n\t                     JUNIOR\n\t          Nobody is gonna die, man, will you\n\t          please have the balls to follow\n\t          through with a good idea?  Think\n\t          about it, what would you do if you\n\t          were them, stay in there and choke\n\t          to death, or come out?!  Huh?  We're\n\t          just getting them to come out for\n\t          forty-five minutes, forty-five\n\t          fucking minutes!  The worst that's\n\t          gonna happen is they pass out, we\n\t          drag 'em out here into the fresh\n\t          air, and they'll be fine.\n\t\n\t                     BURNHAM\n\t          Junior, you gigantic idiot, how are\n\t          we supposed to get into the room if\n\t          they pass out?\n\t\n\tPause.  Junior turns to Raoul.\n\t\n\t                     JUNIOR\n\t          Cut it back a little bit.\n\t\n\t                     RAOUL\n\t          No fucking way.\n\t\n\t                     JUNIOR\n\t          He's right, we can't get into the\n\t          room if they're dead!\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg and Sarah are down on the floor, rags covering their\n\tmouths, trying like crazy to filter the air, but it's not\n\tworking.  Sarah is crawling around the base of the wall, near\n\tto where she was before, clawing at the strange portal thing\n\tagain.\n\t\n\tFinally, she finds a small metal handle, folded back into the\n\tclover-leaf seal on the portal.  She unfolds it, twists it.\n\t\n\tThe portal cranks open, revealing it to be at the end of a\n\ttube, about a foot long, an emergency ventilation source\n\tdirectly through to the exterior of the house.  She bends\n\tdown and looks through it.  It's covered by a metal mesh at\n\tthe opposite end, but she can see and smell the outside\n\tthrough it.\n\t\n\tShe sits up, gestures to her mother to bend down next to her.\n\tShe does, and they both jam their mouths up near the end of\n\tthe tube, gulping fresh air greedily.\n\t\n\tMeg looks at Sarah, good job, and they both drop to the floor\n\tat the portal and suck air.  It's temporary, but it works.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn the master bedroom, the debate has turned physical.\n\tBurnham lunges across the room at Raoul, to get his hands on\n\tthe valve, to turn off the gas.  But Raoul catches him and\n\thurls him aside.\n\t\n\tBurnham SLAMS into the wall, bounces off and SCREAMS at\n\tRaoul, who SCREAMS right back.  Junior leaps into the middle,\n\ttrying to break it up, to get them to shut up, keep their\n\tvoices down.\n\t\n\tIt's bedlam.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tIn the panic room, Meg knows this can't go on forever.  She\n\tturns away from the portal, looks up at the vent, where the\n\tstreamers still stream.\n\t\n\tShe looks to the other side of the room, to where Sarah found\n\tthe waterproof matches and lighters.\n\t\n\tShe thinks.  Takes a deep lungful of fresh air from the tube\n\tand crawls over to the lighters.  She selects one, snatches\n\tup a screwdriver.\n\t\n\tSarah looks at her, has a vague idea of what she's thinking,\n\tbut can't believe it.  She shakes her head vehemently.\n\t\n\tIn response, Meg picks up two or three of the fireproof\n\tblankets and piles them over Sarah, right up to her\n\tdisbelieving eyes.  She bends down, takes another gulp of\n\tair.  but she's getting woozy.  This can't go on much longer.\n\t\n\tShe staggers across the room, hoists herself back up onto the\n\tshelf she stood on before, and gets right up next to the\n\tvent.  Holding her breath to avoid breathing the toxic gas,\n\tshe unscrews the vent cover.\n\t\n\tThe duct is wide enough to put your arm in.  She reaches in,\n\tpast a bundle of multicolored wires that run down through the\n\twall.  She reaches all the way in, lighter in hand.\n\t\n\tINSIDE THE DUCT,\n\t\n\twe see her hand crawl in, lighter clenched between her\n\tfingers.  She raises a thumb to the flint wheel, cranks it\n\tonce.\n\t\n\tToo slow.  Not even a spark.\n\t\n\tHer hand shakes.  She tries again.  Still no spark.  But with\n\tthe effort and the angle, when she thumbs the lighter it\n\tmakes her hand twitch, banging up against the sides of the\n\tduct with a hollow BOOM.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tBurnham turns abruptly.\n\t\n\tHe turns around.  They all freeze, listening.  He hears it\n\tagain.  The hollow BOOM, coming from inside the wall.  Now a\n\tthird time.\n\t\n\tHe walks forward, slowly, toward the wall.\n\t\n\tBOOM.\n\t\n\tHe moves closer, gets right up next to the wall.  He leans\n\tinto the wall, putting his ear right up next to the air duct.\n\tThis close, he hears the sound in more detail, realizes it's\n\ttwo sounds.\n\t\n\tSCRATCH.  BOOM.\n\t\n\tHe arches an eyebrow.\n\t\n\tINSIDE THE DUCT,\n\t\n\tMeg's hand is trembling, tiring.  She tries again, thumbs the\n\tflint wheel.  It SCRATCHES as it rolls, her hand twitches,\n\tBOOMS against the side of the duct.\n\t\n\tStill, the gas HISSES through.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg's face is turning color, she's running out of air.  Her\n\tfeet tremble on the shelf, she's about to lose her footing.\n\t\n\tINSIDE THE DUCT,\n\t\n\tshe tries again.  SCRATCH.  BOOM.\n\t\n\tIN THE BEDROOM,\n\t\n\tBurnham's eyes suddenly pop wide as he identifies the sound.\n\t\n\t                     BURNHAM\n\t          Oh.\n\t\n\tHe tears himself away from the wall --\n\t\n\tINSIDE THE DUCT,\n\t\n\t-- Meg's thumb tenses for one good hard turn --\n\t\n\tIN THE BEDROOM,\n\t\n\t-- Burnham leaps through the air, hurling himself toward the\n\tpropane tank --\n\t\n\tINSIDE THE DUCT,\n\t\n\t-- Meg cranks the wheel, a spark sparks, a flame flames, and\n\ta hot blue cloud shoots out in two directions, one toward the\n\tpanic room, the other toward the bedroom.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg jumps off the shelf, throwing herself as far away from\n\tthe vent as she can, her arm engulfed by licking blue flame.\n\tShe drops to the floor of the room, covering her daughter's\n\tbody just as the entire ceiling of the panic room turns into\n\ta lake of fire with a deafening WHOOMP.  The fluorescent\n\tlight tubes EXPLODE, showering glass everywhere.\n\t\n\tIN THE BEDROOM,\n\t\n\tthe blue flame shoots out of the wall, into the hose, through\n\tthe hose, backing up toward the tank.\n\t\n\tBurnham CRUNCHES to the floor next to the tank, knocking the\n\tother end of the hose away from the spigot just as the blue\n\tflame erupts from the end of the hose.\n\t\n\tThe flame engulfs his entire body, his hair starts on fire,\n\this chest, his arms.  Raoul lunges forward, Junior tears the\n\tblankets from the bed and throws them over him, Burnham HOWLS\n\tand rolls on the floor in pain.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tthe blue cloud on the ceiling suddenly evaporates with\n\tanother angry WHOOMP, leaving a few little pockets of flame\n\tthat Meg extinguishes by swatting with a blanket.  Only one\n\tof the fluorescent lights is left intact; it casts a\n\tflickering, uneven light on the room.\n\t\n\tShe stands in the middle of the still-smoky panic room,\n\tbreathing hard.  She shouts, SCREAMS incomprehensibly, making\n\tno sense whatsoever.\n\t\n\tShe stops, noticing the look Sarah is giving her.  Wide-eyed\n\tadmiring, frightened, you are an insane woman.\n\t\n\tMeg looks to herself.  Her arm is signed, the hair burned\n\toff.  The sleeve of her T-shirt is burned back to the\n\tshoulder.  Her face is sooty, blackened.\n\t\n\tMeg GRUNTS, half frightened by herself.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tOut in the bedroom, it's worse for Burnham, who has lost most\n\tof his hair and shirt.  But his skin isn't badly burned,\n\twhich is something, I guess.\n\t\n\tStill, he's in a rage.  He POUNDS the metal door of the panic\n\troom.\n\t\n\t                     BURNHAM\n\t          I'M COMING IN THERE, BITCH, I AM\n\t          COMING IN THERE!  I AM COMING IN\n\t          THERE!\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg whirls, goes to the door herself, SCREAMS right back.  We\n\tcan hardly make out a word she's saying, but it sounds\n\tthreatening.\n\t\n\tSuddenly, she stops, hearing something else.  Outside the\n\tdoor, Burnham continues to rant, but there's a second sound,\n\ta sound coming from the long wall of the panic room, the wall\n\tthat's shared with the brownstone next door.\n\t\n\tIt's a faint -- very faint -- POUNDING sound, along with a\n\thigh pitched, complaining voice, so faint it can hardly be\n\theard.  Sarah hears it too.\n\t\n\t                     SARAH\n\t          Neighbor!\n\t\n\tMeg and Sarah leap as one, facing the common wall, SHOUTING\n\tat the tops of their lungs -- get help, call the police,\n\tplease, call the police, that sort of thing.\n\t\n\tThey shout and shout, but the soft pounding continues, and if\n\ttheir voices are as soft on the other side as the COMPLAINING\n\tVOICE is on this side, they have no hope.\n\t\n\tTheir voices crack and they begin to cough, too irritated by\n\tthe gas to shout for very long.  Long after they stop, the\n\tsoft POUNDING from next door continues.\n\t\n\tTheir pleas are not heard.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tThe Intruders have stopped their racket too, and are\n\tlistening carefully at the common wall.  Eventually, the soft\n\tPOUNDING stops, the complaining voice complains no more.\n\t\n\tBurnham stands there, in pain.  Things are falling apart.\n\tRaoul stands in the doorway, silhouetted by the hallway\n\tlight.  He draws himself up to his full, bulky height.  He's\n\tbig.\n\t\n\t                     RAOUL\n\t               (to Junior)\n\t          We're gonna talk.  Downstairs.\n\t\n\tJunior nods and starts out.  Raoul lets him pass, but when\n\tBurnham tries to follow him, Raoul puts a big hand on his\n\tchest stopping him.\n\t\n\t                     RAOUL\n\t          You stay.  Make sure she don't come\n\t          out.\n\t\n\tBurnham swallows.  But stays.\n\t\n\tRaoul turns, follows Junior downstairs.  As he descends, he\n\tlooks up, making eye contact with Burnham.  And holding it.\n\tSomething on his mind, that's for sure.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tTHUNK.  Meg's head falls back against a wall; she sags to the\n\tfloor, legs folded in front of her, completely drained.\n\t\n\tBut Sarah's not drained, Sarah's full of nervous ingenuity,\n\trustling around through the stuff in the panic room, an idea\n\tforming in her head.  She finds a powerful-looking flashlight\n\tand loads it up with batteries.  She tries it, flashing\n\taround the room.\n\t\n\tHalogen bulb, very powerful, hurts her mother's eyes as she\n\tflashes it past.  Meg watches her.  What's she up to?\n\t\n\tSarah lays on the floor in front of the ventilation tube she\n\tdiscovered earlier.  She squints through it.\n\t\n\tTHROUGH THE TUBE,\n\t\n\tshe can see out of the house, into the courtyard behind the\n\tbrownstone.\n\t\n\tAbout thirty yards away she can see the backs of the\n\tbrownstones on the next block, and directly across (because\n\tthe tube doesn't leave much room for lateral vision) she can\n\tsee straight into somebody's bedroom.\n\t\n\tThere's a light on.  A SLEEPING MAN is in bed, an open book\n\ton his chest.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah sits back.\n\t\n\tShe grabs the flashlight, looks for a little button on the\n\ttop, the kind you can flick the flashlight on and off with.\n\tShining it on the wall of the panic room, she flashes it at a\n\twall, three times, on and off.  Satisfied, she turns back to\n\tthe tube.\n\t\n\tMeg, curious, crawls across the floor to join her.  Sarah\n\tshoves the flashlight all the way into the tube, leaving\n\tenough room on either side of it for them to see through.\n\tMeg lays down flat, squints into the tube, Sarah alongside\n\ther.  She looks at her daughter, curious -- your plan?\n\t\n\tSarah reaches into the tube, finds the little flash button on\n\tthe top of the flashlight.\n\t\n\tTHROUGH THE TUBE,\n\t\n\tthe piercing halogen beam begins to flash, across the\n\tcourtyard and into the bedroom of the Man in the bedroom.\n\tThe light flashes on the wall over his bed.\n\t\n\tThe flashes are in a rhythm.  Short.  Short.  Short.  Long.\n\tLong.  Long.  Short.  Short.  Short.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg turns to Sarah, impressed.\n\t\n\t                     MEG\n\t          Morse code?\n\t\n\t                     SARAH\n\t               (nods)\n\t          Dot dot dot, dash dash dash, dot dot\n\t          dot.\n\t\n\t                     MEG\n\t          Where'd you learn S.O.S.?\n\t\n\t                     SARAH\n\t          \"Titanic.\"\n\t\n\tTHROUGH THE TUBE,\n\t\n\tthe flashes continue -- dot dot dot, dash dash dash, dot dot\n\tdot.  But the Man continues to sleep, the light on the wall\n\tbehind him has no effect.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah is frustrated.  She adjusts the flashlight.\n\t\n\tTHROUGH THE TUBE,\n\t\n\tthe beam of light lowers jerkily from the wall until it is\n\tshining directly into the Sleeping Man's eyes.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah strains to keep the light in that perfect spot.  She's\n\tstarting to sweat.  Meg leans over, sneaks a peek at the\n\twatch Sarah wears on her left wrist.  The readout:\n\t\n\t114\n\t\n\tTHROUGH THE TUBE,\n\t\n\tthe Sleeping Man stirs.  Opens his eyes.  Winces from the\n\tlight, which is flashing directly in his eyes.\n\t\n\tIN THE PANIC ROOM,\n\t\n\t                     MEG\n\t          Got him!\n\t\n\t                     SARAH\n\t          Come on, come on...\n\t\n\tTHROUGH THE TUBE,\n\t\n\tthe Sleeping Man sits up.  Raises a hand, trying to block the\n\tlight, which keeps flashing on him.\n\t\n\tHe gets up, out of bed.  He comes to the window.\n\t\n\tIN THE PANIC ROOM,\n\t\n\t                     MEG\n\t          Yes, yes, yes, yes...\n\t\n\tSarah keeps it up, flashing faster.\n\t\n\tTHROUGH THE TUBE,\n\t\n\tthey see the Man come all the way to his window.  He leans\n\tagainst it, cups his hands so he can see better.  The flashes\n\tcontinue, right on top of him now.\n\t\n\tClearly, the Man is reading the flashes!  He takes a steps\n\tback from the window --\n\t\n\t-- gives them the finger --\n\t\n\t-- and angrily yanks shut his drapes.\n\t\n\tA moment later, the light goes out and the room is black.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg and Sarah drop their heads to the carpet, defeated.\n\t\n\tSarah rolls over, knocks the flashlight away, stares up at\n\tthe ceiling.\n\t\n\tMeg puts a hand in her hair.  It was a good idea.\n\t\n\t                     SARAH\n\t          We're never getting out of here.\n\t\n\t                     MEG\n\t          Shhh...\n\t\n\tShe looks at the wristwatch again.\n\t\n\t103\n\t\n\tShe's concerned.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tBurnham is concerned as well.  He's still in the master\n\tbedroom, but barely, he's standing in the doorway, straining\n\tlike hell to hear a conversation that Junior and Raoul are\n\thaving in the foyer, one floor one.\n\t\n\tThey're trying to keep their voices down, but stray words\n\tfloat up through the open stairwell -- words like \"him\" and\n\t\"warning\" and \"dangerous.\"\n\t\n\tBurnham chews a fingernail.  If only he could get closer.  He\n\tthrows a look back at the door to the panic room.  He looks\n\tback out the bedroom door.  Listening.\n\t\n\tINT.  FOYER - NIGHT\n\t\n\tJunior and Raoul are huddled together in the foyer.  They're\n\tkeeping their voices low, but their conversation is heated.\n\t\n\t                     JUNIOR\n\t          We're not gonna do anything about\n\t          him, he's fine.\n\t\n\t                     RAOUL\n\t          If you think I'm gonna let my half\n\t          of the fourteen million bucks slip\n\t          away because of --\n\t\n\t                     JUNIOR\n\t          \"Half?\"  What did you, take a nap in\n\t          math class?  Three people, three\n\t          shares, one third.  Four point six\n\t          six six repeating.\n\t\n\t                     RAOUL\n\t          I'm just saying, the man is a\n\t          problem.  And he's your problem.\n\t          Wasn't me idea to bring him along.\n\t\n\t                     JUNIOR\n\t          That's right, Raoul, it wasn't your\n\t          idea, none of this was your idea, it\n\t          was mine, it's my family we're\n\t          ripping off, it's my prick\n\t          grandfather who built that fucking\n\t          room, it was my idea to get the\n\t          plans, I found the floor safe, and\n\t          it was my idea to ask a guy who\n\t          builds these rooms to help break\n\t          into one!  Me, me, me, I, I, I, at\n\t          no point did I say \"you\" or Raoul,\"\n\t          got it?\n\t\n\t                     RAOUL\n\t          He puts his hands on me again I'll\n\t          bury a slug in his ear.\n\t\n\t                     JUNIOR\n\t          No, you will not, because without\n\t          Burnham there's no way in hell we're\n\t          gonna get into that safe, so as far\n\t          as I'm concerned he can paint your\n\t          ass blue and run it up a flagpole\n\t          and you won't lay a finger on him,\n\t          you understand me?\n\t\n\t                     RAOUL\n\t          Don't take no tone of voice with me,\n\t          Homes.\n\t\n\t                     JUNIOR\n\t          What is this shit you're talking all\n\t          of a sudden?  You're a bus driver,\n\t          \"Homes,\" you live in Flatbush, so\n\t          please don't start spouting some\n\t          Elmore Leonard shit you just heard\n\t          because I saw that movie too,\n\t\n\tON THE VIDEO MONITORS,\n\t\n\tJunior and Raoul are visible, still arguing in the foyer.\n\t\n\tOn the next monitor over, Burnham is visible, standing in the\n\tmaster bedroom doorway, listening.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg is watching the monitors, thinking.  She notices\n\tsomething, sits forward abruptly, looking at the monitor that\n\tcovers the master bedroom.  She squeezes right up close,\n\tstaring at the screen.\n\t\n\tON THE MONITOR,\n\t\n\twe peer closely at the box next to her bed, the one she was\n\tusing for a night table.  On top of the box, she sees the\n\tcharger for her cellular phone, sitting empty.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg sits back, eyes alive with an idea.  If only she could\n\tget to that phone, which must be still under the bed.  She\n\tlooks back at the monitors, at Burnham lingering in the\n\tdoorway to the room.\n\t\n\t                     MEG\n\t          Damn.\n\t\n\tShe turns away from the monitors, to check on Sarah, who's\n\tsettled into a corner of the room, looking pale.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn the bedroom, Burnham is desperate.  The argument\n\tdownstairs is entering round two, and he's got to hear what\n\tthey're saying.\n\t\n\tHe takes a few steps out of the bedroom --\n\t\n\tINT.  THIRD FLOOR HALLWAY - NIGHT\n\t\n\t-- and comes into the hallway.  He leans over the stairwell.\n\tWhere he's standing, he is directly under the camera that\n\tcovers the hallway --\n\t\n\tON THE MONITORS,\n\t\n\t-- and can't be seen on the monitor that covers the hallway.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg turns back from Sarah, to look at the monitors again.\n\tShe see Burnham is no longer in the bedroom.  And doesn't\n\tappear to be in the hallway, either.\n\t\n\t                     MEG\n\t          Oh yes, yes...\n\t\n\tShe looks at another monitor.\n\t\n\tON THE MONITOR,\n\t\n\tshe sees Junior and Raoul in the foyer.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg sits back.  That leaves Burnham unaccounted for.\n\t\n\t                     MEG\n\t          ... the hell is he?\n\t\n\tIN THE HALLWAY,\n\t\n\tBurnham is still lingering under the camera.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah has come forward to the monitors as well.\n\t\n\t                     SARAH\n\t          Do it.\n\t\n\t                     MEG\n\t          Yeah, but where's the third guy?\n\t\n\t                     SARAH\n\t          Not in the bedroom.  Do it!\n\t\n\tMeg goes to the door, raises a hand to the green \"open\"\n\tbutton.  Hesitates.\n\t\n\tIN THE MASTER BEDROOM,\n\t\n\twe see Burnham, lurking in the hallway, just about six feet\n\tfrom the door to the panic room.  Don't open that door!\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg wipes sweat from her palm.\n\t\n\t                     MEG\n\t          If it looks like I can't get back,\n\t          just close the door.\n\t\n\t                     SARAH\n\t          No.\n\t\n\t                     MEG\n\t          Close it!\n\t\n\tSarah nods, looks back to the button.\n\t\n\tIN THE HALLWAY,\n\t\n\ta shouted CURSE rises up from downstairs.  Burnham takes a\n\tstep toward the stairs.\n\t\n\tON THE MONITORS,\n\t\n\the suddenly appears, in the hallway.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah sees it.\n\t\n\t                     SARAH\n\t          WAIT!\n\t\n\tMeg freezes.  She looks at the monitor, wide-eyed.  Close\n\tone.\n\t\n\tIN THE HALLWAY,\n\t\n\tBurnham can't take it anymore.\n\t\n\t                     BURNHAM\n\t          Oh, hell...\n\t\n\tHe turns and takes off down the stairs.\n\t\n\tON THE MONITORS,\n\t\n\tBurnham flies down the stairs and appears in the foyer, next\n\tto Junior and Raoul.   \n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg and Sarah see all three men accounted for, downstairs.\n\t\n\t                     SARAH\n\t          GO GO GO!\n\t\n\tMeg leaps up, runs to the door, and punches the green button.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tThe door begins to crank open, Meg slips through the gap\n\tsideways before it's even all the way open.  She darts across\n\tthe room --\n\t\n\t-- slides to the floor next to the bed --\n\t\n\t-- and flattens herself, reaching underneath it to get the\n\tphone.  Damn, that phone slid far, it's right in the middle,\n\twouldn't you know it.\n\t\n\tIN THE FOYER,\n\t\n\tthe three men hear her footsteps, as one, they take off for\n\tthe stairs.\n\t\n\tIN THE MASTER BEDROOM,\n\t\n\tMeg continues to stretch, her fingers inches from the phone.\n\t\n\tON THE STAIRWELL,\n\t\n\tfeet race up toward her --\n\t\n\tIN THE MASTER BEDROOM,\n\t\n\tMeg's fingernails paw the phone, pull it closer to her.  She\n\tgrabs it, stands --\n\t\n\tIN THE HALLWAY,\n\t\n\tthe three men come off the stairs and race toward her, they\n\tsee her as she lunges across, toward the panic room, she\n\thurls herself through the door --\n\t\n\tIN THE PANIC ROOM,\n\t\n\t-- and Sarah SMACKS the red button.  The steel door closes\n\twith a deafening WHANG.\n\t\n\tSafe.\n\t\n\tIN THE ENTRYWAY,\n\t\n\tthe echo of the metallic WHANG reverberates through the\n\thouse.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tIn the panic room, Meg punches 9-1-1 on her cell phone with\n\ttrembling fingers.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tThe big empty charger cradle is in the foreground when the\n\tthree men burst into the room.  Burnham stops in the middle\n\tof the floor, turns in a frantic circle.\n\t\n\t                     BURNHAM\n\t          What'd she get, what'd she get,\n\t          what'd she get...\n\t\n\tHis eyes fall on the empty charger.\n\t\n\t                     BURNHAM\n\t          Cell phone.\n\t\n\t                     JUNIOR\n\t          Shit!\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg raises the cell phone to her ear --\n\t\n\t-- and gets a rapid busy signal.\n\t\n\t                     MEG\n\t          Oh, no.  No, no, no no no no no...\n\t\n\tShe looks at the phone.  It's showing just one signal bar,\n\tand even that one is flashing on and off.\n\t\n\t                     MEG\n\t          Oh come on, come on, come on...\n\t\n\tShe walks around the room, raises the phone high and low,\n\ttrying crazily to find a signal.\n\t\n\tBut can't.   \n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn the bedroom, Burnham stands just outside the door,\n\tfingertips lightly resting on it, the ghost of a smile on his\n\tface.\n\t\n\t                     BURNHAM\n\t               (softly)\n\t          I don't think we'll be talking on\n\t          our cell phone from in there...\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tInside the room, Meg doesn't seem upset.  Rather, she's\n\tstaring at the cell phone in her hand, thinking.  Remembering\n\tsomething.\n\t\n\t                     MEG\n\t          Wires...\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tAt the same moment, Burnham is having the same thought.  He's\n\tstill at the door, fingertips still resting there.\n\t\n\t                     BURNHAM\n\t          Phone...\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\t                     MEG\n\t          ... wires.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tBurnham looks down, at the baseboard below.  What is he\n\tlooking at?\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg steps up, onto the shelf she climbed earlier, and comes\n\tup next to the vent.\n\t\n\t                     SARAH\n\t          What are you doing?\n\t\n\t                     MEG\n\t          I saw something, I saw...\n\t\n\tIn the vent, alongside the duct, she sees the bundle of\n\tmulticolored wires she saw earlier.\n\t\n\t                     MEG\n\t          ... phone wires!\n\t\n\tShe jumps down off the shelf, goes to the tools, starts\n\tsearching for something.\n\t\n\t                     MEG\n\t          I may not have hooked up the phone\n\t          in here, but I hooked up the main\n\t          line, and there's a jack at the base\n\t          of this wall outside, I saw it!\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tYes, that is correct, there is in fact a jack in the base of\n\tthe wall outside the door to the panic room.\n\t\n\tBurnham bends down into frame, studying it, thinking the same\n\tthing she is.  He clears his throat.\n\t\n\t                     BURNHAM\n\t          Say, while we're on the subject of\n\t          phones...\n\t\n\tHe turns, looks up at Junior.\n\t\n\t                     BURNHAM\n\t          When I said cut the line, did you\n\t          cut the main line at the junction\n\t          box in the basement like I said, and\n\t          which I repeated, or did you just\n\t          cut the cord on the phone in the\n\t          kitchen?\n\t\n\tPause.  Swallow.\n\t\n\t                     JUNIOR\n\t          I, uh, I...\n\t\n\tShit.\n\t\n\t                     JUNIOR\n\t          ... hit a little snag finding the\n\t          one in the basement.\n\t\n\tShit.\n\t\n\tPause.  Then, as if a starting gun has been fired, Burnham\n\tleaps to his feet and races out of the bedroom.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tThat same starting gun has been fired in the panic room.\n\tWith a strong RIP, Meg pulls the whole bundle of multi\n\tcolored wires out of the wall and drops onto the floor with\n\tit.  She trusts it at Sarah, finds a wire cutter in the\n\tassorted tools, and gives her that too.\n\t\n\t                     MEG\n\t          Strip 'em, expose the ends, try blue\n\t          first, blue is phones!\n\t\n\t                     SARAH\n\t          Blue is phones?\n\t\n\t                     MEG\n\t          Yes, no, I don't know, do 'em all!\n\t\n\tWhile Sarah goes to work on the wires, Meg turns to the phone\n\titself, the one with the buried phone line that isn't working\n\tyet.  She rips the phone out of its housing, tears free the\n\twire on the end of it.\n\t\n\tINT.  ENTRY FLOOR - NIGHT\n\t\n\tBurnham flies down the stairs from the third floor, races\n\tacross the foyer, flies down the stairs to the kitchen floor.\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\tBurnham races across the kitchen floor, whips open a door and\n\theads down another, narrow, darkened stairway.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg and Sarah are like animals, clawing and tearing at the\n\tends of their respective phone cables, foregoing tools and\n\tstripping the wires with fingers and teeth, it's faster.\n\t\n\tWith the phone receiver cradled on her shoulder, Meg starts\n\ttwisting the ends of wires onto the exposed ends of the wires\n\tfrom the phone unit.  First wire -- nothing.  She tries a\n\tsecond wire.\n\t\n\tINT.  MECHANICAL ROOM - NIGHT\n\t\n\tBurnham SLAMS open the door to a dark room, pulls the string\n\ton a bare bulb.  Burned out.\n\t\n\t                     BURNHAM\n\t          God damn it!\n\t\n\tWithout light, he can't see a thing.  He SMACKS the bulb, it\n\tswings wildly, SMASHES on the cement wall.  He turns and\n\traces out of the room.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg tries another wire.  Still no dial tone.  Sarah shoves\n\tanother wire at her.  She tries again.  Nothing.  She moves\n\ton.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tBurnham slides to his knees, snatches a flashlight from his\n\tduffel, leaps up and takes off again.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tAnother wire.  Nothing.  Another wire.  DIAL TONE!\n\t\n\tMeg SHRIEKS and punches 911.\n\t\n\tINT.  STAIRWELL - NIGHT\n\t\n\tBurnham flies down the stairs, flashlight beam bouncing\n\tcrazily in front of him.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tThe phone is ringing.  An operator picks up.\n\t\n\t                     OPERATOR\n\t          911 emergency --\n\t\n\t                     MEG\n\t          I'm at 26 West --\n\t\n\t                     OPERATOR\n\t          -- please hold.\n\t\n\tIt's a mechanical voice, which gives over to MUZAK.\n\t\n\t                     MEG\n\t          NO!\n\t\n\tINT.  MECHANICAL ROOM - NIGHT\n\t\n\tBurnham BANGS through the door again, starts searching the\n\tdarkened mechanical room, shining harsh light around its\n\tdingy walls.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMUZAK continues to play.\n\t\n\t                     MEG\n\t          Damn it!\n\t\n\tNo more time to hold.  Meg hangs up the phone, dials another\n\tnumber, a seven digit one she knows by heart.\n\t\n\t                     SARAH\n\t          Call Dad!\n\t\n\t                     MEG\n\t          On it!\n\t\n\tINT.  MECHANICAL ROOM - NIGHT\n\t\n\tIn the mechanical room, the bouncing flashlight beam falls on\n\ta metal cabinet across the way.  Burnham runs to it, flings\n\tit open.  Circuit breakers.  SLAMS it shut.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg listens as a phone rings on the other end.  And rings.\n\tAnd rings again.\n\t\n\tThis is torture.\n\t\n\tINT.  MECHANICAL ROOM - NIGHT\n\t\n\tBurnham turns, sees another, smaller metal box, this one\n\tclearly labeled:\n\t\n\tPHONES\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tOn the other end of the phone, a husky MALE VOICE answers;\n\tclearly he's been awakened.\n\t\n\t                     VOICE\n\t          Hello?\n\t\n\t                     MEG\n\t          Listen to me!  There are three --\n\t\n\tINT.  MECHANICAL ROOM - NIGHT\n\t\n\tWith a subhuman ROAR of anger, Burnham rips the entire phone\n\tpanel off the wall with his bare hands.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tWith an abrupt SHRIEK, the line goes dead.  Meg pauses, can't\n\tbelieve it.\n\t\n\t                     MEG\n\t          Hello?  Don't... are...\n\t\n\tShe looks up, see Sarah looking at her, her eyebrows arches,\n\ther face all hope.  Meg keeps her cool, but it take a hell of\n\tan effort.\n\t\n\tSarah reads her face.  She turns away.\n\t\n\tShe hangs up the phone.\n\t\n\tSarah goes to a corner of the room, faces away from her.\n\t\n\tMeg doesn't know what to say.\n\t\n\t                     MEG\n\t          He'll do something.\n\t\n\t                     SARAH\n\t          Uh uh.\n\t\n\t                     MEG\n\t          He'll know we're in trouble.  He\n\t          heard me, I said \"There are\n\t          three...\"\n\t\n\t                     SARAH\n\t          He won't even know who it was.\n\t\n\t                     MEG\n\t          What would you think, in the middle\n\t          of the night?  I mean, three what,\n\t          three bears?  He'll call the police.\n\t\n\t                     SARAH\n\t          Stop it.\n\t\n\t                     MEG\n\t          He's just across the park, this is\n\t          why we got places so close to each\n\t          other, in case we needed each other,\n\t          we're still a family, he'll help\n\t          us...\n\t\n\t                     SARAH\n\t          He --\n\t\n\t                     MEG\n\t          He WILL.\n\t\n\tShe practically shouted.  Sarah drop her head into her arms.\n\t\n\t                     MEG\n\t          I'm sorry.\n\t\n\t                     SARAH\n\t          I'm sorry.\n\t\n\t                     MEG\n\t          Why?\n\t\n\t                     SARAH\n\t          I was trying not to tell you...\n\t\n\t                     MEG\n\t          What?\n\t\n\t                     SARAH\n\t          I'm dizzy and thirsty.\n\t\n\tMeg blanches.  This is very bad news.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tTired, Burnham drags himself back up the stairs and into the\n\tdoorway of the master bedroom.  Raoul and Junior stand there,\n\tstaring at him.\n\t\n\tLong pause.\n\t\n\t                     JUNIOR\n\t          She's never coming out.\n\t\n\t                     BURNHAM\n\t          Hey.\n\t\n\t                     JUNIOR\n\t          And we're never getting in.\n\t\n\t                     BURNHAM\n\t          Do me a favor and don't talk.\n\t\n\t                     JUNIOR\n\t          Jesus, what was I thinking?\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg has torn open one of the water packets and is trying to\n\tget Sarah to drink, but the little girl has gone completely\n\tpale and seems to have lost some of the strength in her neck,\n\tshe's having trouble holding her head up.  Most of the water\n\truns down her chin.\n\t\n\t                     MEG\n\t          Come on, come on... stay with me...\n\t          you gotta drink...\n\t\n\tShe takes Sarah's hand, checks her wristwatch thing.  The\n\treadout is now\n\t\n\t82\n\t\n\tShe swallows.  She grabs Sarah by the face.\n\t\n\t                     MEG\n\t          Okay, listen, honey, you went double\n\t          digit here, you must have been\n\t          shooting out adrenaline like crazy,\n\t          we gotta bring your blood sugar back\n\t          up, okay?  Can you hear me?\n\t\n\t                     SARAH\n\t          I'm dizzy, not deaf.\n\t\n\t                     MEG\n\t          Hey, she's still a smart ass,\n\t          excellent sign.  Did you see any\n\t          sugar in here?  Any candy bars,\n\t          anything sweet?\n\t\n\t                     SARAH\n\t          Huh uh.\n\t\n\t                     MEG\n\t          Okay, you just gotta calm yourself\n\t          down, that's all, just stay calm and\n\t          your adrenaline will go back to\n\t          normal and you'll be fine.\n\t\n\t                     SARAH\n\t          What if I keep dropping?\n\t\n\t                     MEG\n\t          Not an option.\n\t\n\t                     SARAH\n\t          What if I do?\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn the bedroom, Junior has had enough.\n\t\n\t                     JUNIOR\n\t          We're leaving.\n\t\n\t                     RAOUL\n\t          The hell we are.\n\t\n\t                     BURNHAM\n\t          Hey man, after all we went through I\n\t          am not walking out when we're this\n\t          close.\n\t\n\t                     JUNIOR\n\t          Close?  Are you insane?  We're\n\t          nowhere near close!  Fuck this, I'll\n\t          make an anonymous phone call on\n\t          Monday, they'll find the floor safe,\n\t          and I'll inherit the shit.  Little\n\t          piece of it, anyway, it's better\n\t          than nothing.\n\t\n\t                     BURNHAM\n\t          What about us?\n\t\n\tJunior thinks, then pulls out his wallet.  He thrusts a\n\tfistful of bills at them.\n\t\n\t                     JUNIOR\n\t          Here.  For your time.\n\t\n\tThey both just stare at him.\n\t\n\t                     JUNIOR\n\t          Five hundred bucks here.\n\t\n\tNeither one of them moves to take it.  Junior shurgs, drops\n\tit on the floor.\n\t\n\t                     JUNIOR\n\t          Suit yourself.\n\t\n\t                     RAOUL\n\t          Nobody leaves.\n\t\n\t                     JUNIOR\n\t          Observe.\n\t\n\tHe heads for the door, expecting Raoul to block him, but as\n\the draws close --\n\t\n\t-- Raoul just steps out of the way.  Junior passes through\n\tand heads for the stairs.\n\t\n\t                     BURNHAM\n\t          We're not leaving.  I'm getting in\n\t          that room, and I'm opening that\n\t          safe.\n\t\n\t                     JUNIOR\n\t          Lookin' doubtful there, Big Guy, but\n\t          ten out of ten for attitude.\n\t\n\tAnd he disappears, down the stairs, Burnham still pleading\n\twith him.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg rifles the foodstuffs that are stored in the room.\n\tSarah, in the corner, is starting to tremble.\n\t\n\t                     SARAH\n\t          What if I spazz out?\n\t\n\t                     MEG\n\t               (forced calm)\n\t          No biggie, we've been through it a\n\t          dozen times, I just jab you with the\n\t          Glucogen.\n\t\n\tPause.  She keeps looking.\n\t\n\t                     SARAH\n\t          Where is the Glucogen?\n\t\n\t                     MEG\n\t          Oh, you know, it's uh... it's in the\n\t          little fridge in your room.\n\t\n\t                     SARAH\n\t               (pause)\n\t          I'm sorry, Mom.\n\t\n\t                     MEG\n\t          Hey, quit apologizing, you're\n\t          starting to sound like Grandma.\n\t          You're not gonna have an attack.\n\t          Okay?\n\t\n\t                     SARAH\n\t          Okay.   \n\t\n\tShe lays back, oddly passive, her lips changing color.  She\n\tstares at the monitors.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tJunior strides into the living room, purposefully.  He tosses\n\tsome tools into his duffel bag and heads for the stairs down\n\tto the kitchen.  Burnham is behind him.\n\t\n\t                     BURNHAM\n\t          Would you wait?  Would you please\n\t          just wait a minute?\n\t\n\tBut Junior heads down.  Burnham follows.  Raoul is just\n\tcoming down from upstairs.\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\tJunior reaches the door of the kitchen, tries to open it,\n\trealizes it's screwed shut.  He takes out a screwdriver and\n\tstarts unscrewing the screws.  Burnham stops at the stairway.\n\t\n\t                     BURNHAM\n\t          You walk out that door and you lose\n\t          your share of the money.\n\t\n\t                     JUNIOR\n\t          Yeah, whatever.\n\t\n\t                     BURNHAM\n\t          I mean it!\n\t\n\t                     JUNIOR\n\t          Adios.\n\t\n\tHe gets the last screw out, throws open the door, and BLAST\n\tof wind gusts in, it's a blustery night out there, he takes a\n\tstep into the doorway --\n\t\n\t-- and with a quiet PFFFT from right behind Burnham, a bullet\n\twhizzes across the kitchen and hits Junior in the back of the\n\thead.  He crumples, right in the open kitchen doorway.\n\t\n\tBurnham SHOUTS incoherently and turns.  Raoul is standing\n\tthere, two steps up, a silencer twisted onto the barrel of\n\this gun.\n\t\n\t                     RAOUL\n\t          Nobody leaves.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tSarah is staring at the video monitors, eyes wide.  She\n\traises one trembling finger, points at the kitchen monitor,\n\ttries to mouth the words, can't.\n\t\n\tMeg looks up.\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\tBurnham is freaking out, but trying to stay calm.\n\t\n\t                     BURNHAM\n\t          Oh God... oh, my God...\n\t\n\tRaoul walks past him calmly, grabs Junior by the ankles, and\n\tdrags him back into the house.  He turns, looks at Burnham,\n\twhose jaw is dropped in horror.\n\t\n\t                     RAOUL\n\t          You should see the look on your\n\t          face.\n\t\n\t                     BURNHAM\n\t          The fuck did you do that for?!\n\t\n\t                     RAOUL\n\t          Fuckin' asshole, thinks he knows me.\n\t          Drives his German car up to 125th\n\t          Street a couple of times, buys a few\n\t          rounds, thinks he's a tough guy,\n\t          thinks he knows me.\n\t               (to the corpse)\n\t          You don't know one thing about me!\n\t\n\tWhile Burnham stares down at the body in shock and Raoul\n\tstares at Burnham, his back to the outside, a small, thin\n\tVOICE comes from the still-open doorway.\n\t\n\t                     VOICE\n\t          What the h --\n\t\n\tThey turn.  A man, fiftyish, stands there in hastily thrown\n\ton clothes, staring down at the dead body in mute shock.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg, watching the monitors with Sarah, GASPS as she sees the\n\tman, whose name is HARRIS.  While she and Sarah watch --\n\t\n\tON THE MONITORS,\n\t\n\t-- they see the silent image of Harris, set upon by Raoul,\n\twho grabs him roughly and drags him inside.  Burnham hurries\n\tto the door --\n\t\n\tINT.  KITCHEN - NIGHT\n\t\n\t-- and SLAMS it shut.  He puts his back to it, thinking,\n\tterrified, things are spinning out of control, fast.\n\t\n\tRaoul, in the middle of the kitchen floor, is venting some\n\tmore of his rage on Harris, whom he has hurled to the floor.\n\tHe lands a solid boot in the side of Harris's head, leaving\n\thim GROANING in pain, completely disoriented.\n\t\n\tHarris rolls groggily into the spreading pool of blood coming\n\tfrom underneath Junior.\n\t\n\t                     BURNHAM\n\t          Stop it!  Stop it!\n\t\n\t                     RAOUL\n\t               (turning on him)\n\t          Who's the clown now?  Huh?!  Who's\n\t          the fucking clown now?!\n\t\n\tHe pulls his gun, shoves it into Burnham's eye, hard, we can\n\thear the faint SIZZLE of skin burning.\n\t\n\t                     BURNHAM\n\t          Me.  I am.\n\t\n\t                     RAOUL\n\t          That's right.\n\t\n\t                     BURNHAM\n\t          Burning me.  It's burning my eye.\n\t\n\t                     RAOUL\n\t          I have the gun.\n\t\n\t                     BURNHAM\n\t          Yes.\n\t\n\t                     RAOUL\n\t          Remember that.\n\t\n\t                     BURNHAM\n\t          Please...\n\t\n\tRaoul pulls the gun back, just an inch.  The skin around\n\tBurnham's eye is an angry red.  His eyes dart, strain to look\n\tover at Harris, MOANING on the floor.  And at Junior, dead.\n\t\n\t                     BURNHAM\n\t          What?  What do you want me to do?\n\t\n\t                     RAOUL\n\t          What do you think?  Get us into that\n\t          room.\n\t\n\t                     BURNHAM\n\t          I can't.\n\t\n\tRaoul pushes the gun barrel back into Burnham's eye socket.\n\t\n\t                     RAOUL\n\t          You can.  You're full of ideas.  You\n\t          just need to squeeze one out.\n\t\n\t                     BURNHAM\n\t          I can't...\n\t\n\t                     RAOUL\n\t          You got till the count of three.\n\t          Then you end up like him.\n\t\n\tHe tilts his head over to Junior, whose brains are spreading\n\tout on the kitchen floor.\n\t\n\t                     RAOUL\n\t          One.  Squeeze.\n\t\n\t                     BURNHAM\n\t          This is ridiculous...\n\t\n\t                     RAOUL\n\t          Two.  Squeeze harder.\n\t\n\t                     BURNHAM\n\t          I can't just...\n\t\n\t                     RAOUL\n\t          Th --\n\t\n\t                     BURNHAM\n\t          Okay, okay!  Okay.\n\t\n\t                     RAOUL\n\t          You got an idea?\n\t\n\t                     BURNHAM\n\t          Yeah.  Yeah, I got an idea.  I gotta\n\t          check something.\n\t\n\tRaoul GRUNTS, satisfied.  Pulls the gun back.  Burnham slides\n\taway, shaking.  He bends down, to the floor.  He looks at\n\tHarris's left hand.  At his index finger.\n\t\n\tHe sees a white strip of skin, where Harris wore his wedding\n\tring, until recently.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tHarris, still semi-conscious, is hurled against the metal\n\tdoor of the panic room.  He collapses at its base.  Burnham,\n\tbends down next to him.\n\t\n\t                     BURNHAM\n\t          Okay, look.  I know you can hear me.\n\t          Your wife and kid are in there.\n\t          You're gonna get 'em to come out.\n\t          Or --\n\t\n\tHe looks up at Raoul, hulking overhead, gun in hand.\n\t\n\t                     BURNHAM\n\t          Or I can't stop what he's gonna do.\n\t          Do you understand?\n\t\n\tHarris, regaining some semblance of consciousness, nods\n\tfeebly.\n\t\n\t                     BURNHAM\n\t          Good.\n\t\n\tBurnham stands up, turns to the video camera, and SHOUTS.\n\t\n\t                     BURNHAM\n\t          OPEN THE GOD DAMN DOOR!\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tSarah and Meg see the horrifying sight on the video monitors.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tBurnham SHOUTS at the door to the room.\n\t\n\t                     BURNHAM\n\t          OPEN UP!\n\t\n\tON THE MONITORS,\n\t\n\tthey see Burnham, standing over Harris; they faintly hear him\n\tcall to them to open the door.\n\t\n\tAnd then they hear another VOICE, calling back to them.\n\tSarah sits up, recognizes her father's voice.\n\t\n\t                     SARAH (O.S.)\n\t          DADDY!\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tHarris is SHOUTING against the closed door.\n\t\n\t                     HARRIS\n\t          DON'T DO IT!  NO MATTER WHAT\n\t          HAPPENS, DON'T OPEN THE DOOR!\n\t          DON'T O --\n\t\n\tHe's silenced by a vicious kick to the ribs.  Raoul begins to\n\tbeat him.\n\t\n\tBurnham stands by, powerless, horrifies, watching as Raoul\n\tsavages Harris, who continues to call out, as long as he has\n\tstrength, telling Meg not to open the door, no matter what.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg and Sarah SHOUT in horror, she covers her daughter's\n\tface, turn her away from the screen, SCREAMS in incoherent\n\tanger of her own.\n\t\n\tBut she doesn't open the door.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tBurnham SHOUTS at Raoul, pleading.\n\t\n\t                     BURNHAM\n\t          STOP IT, MAN, STOP IT, THAT'S HIS\n\t          KID IN THERE, HIS KID IS WATCHING\n\t          THIS!!\n\t\n\tBut Raoul whips the gun up, into Burnham's throat, backing\n\thim off, shutting him up.\n\t\n\tHe resumes his pounding of Harris.\n\t\n\tBurnham turns, looks up at the camera in the corner of the\n\troom.\n\t\n\tHe can't stand it anymore.  He whips off his jacket, runs to\n\tthe camera, and covers the lens.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tWhile Meg watches, the monitor that cover the master bedroom\n\tabruptly goes black, mercifully sparing them the sight of\n\tHarris's beating.\n\t\n\tShe holds Sarah, who's sobbing, shaking.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tHarris finally lapses into unconsciousness.  Raoul stands\n\tover him, chest heaving.\n\t\n\tBurnham stand in the doorway, neither in nor out of the room,\n\ta silhouette, head hung.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tMeg tries desperately to see something on the bedroom\n\tmonitor, but it's hopeless, it's covered.  On the hallway\n\tmonitor, she can just see shadows, as two men in the bedroom\n\tlift a third off the floor and carry him across the room.\n\t\n\tA sudden BEEPING sound tears her attention away.  Still\n\tholding Sarah, she pulls her back, off her shoulder.  Her\n\tface is completely white, her lips blue, her eyes rolled back\n\tinto her head.  The BEEPING sound grows louder, she checks\n\tSarah's wristwatch, the reading is dire:\n\t\n\t57\n\t\n\tMeg GASPS, horrifies.\n\t\n\t                     MEG\n\t          Oh God, oh my God...\n\t\n\tSarah begins to convulse, she bucks right out of Meg's arms\n\tand falls back onto the floor of the panic room.  Meg clears\n\teverything away from her, tries to make room for her.\n\t\n\tThe convulsion worsens.  Meg searches through the piles of\n\tsupplies, comes up with a plastic-handled screwdriver.  She\n\topens Sarah's jaws, wedges the plastic handle between her\n\tteeth.\n\t\n\tShe helps Sarah ride out the convulsion.  Finally, her eyes\n\troll back into her head, she slowly re-orients herself.\n\tSarah reaches over, turns off her still-BEEPING\n\twristwatch/monitor herself.\n\t\n\tSarah sighs, a shuddering sigh of relief, but she is nowhere\n\tnear normal.\n\t\n\tHer skin has passed through white and is turning a sallow\n\tyellow color.  She moves her lips, Meg can't hear her, she\n\tbends down:\n\t\n\t                     SARAH\n\t          You gotta jab me, Mommy...\n\t\n\tMeg turns, looks back at the monitors.  What she sees is good\n\tnews --\n\t\n\tON THE MONITORS,\n\t\n\tthe jacket has been removed from the bedroom camera.  Burnham\n\tand Raoul are gone, the only person there is HARRIS, who lies\n\tslumped on the far side of the bed.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg looks quickly over at the monitor for the living room.\n\t\n\tON THAT MONITOR,\n\t\n\tshe sees Burnham and Raoul having an urgent conversation,\n\tBurnham sitting in a chair, Raoul pacing in front of him,\n\tranting.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tMeg's face lights up, she practically laughs, she's so\n\toverjoyed at this turn of events.\n\t\n\tShe turns, looks back at Sarah, who is starting to tremble\n\tagain.\n\t\n\tThat does it.  Meg leaps up, hits the button that controls\n\tthe steel door, and it starts to crank open, almost\n\timpossibly slowly.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tMeg steps out of the panic room, into the master bedroom.\n\tShe looks at Harris, on the bed.  With his back to her she\n\tcan't even tell if he's alive or dead, but first things must\n\tbe first, so she turns and races out of the room.\n\t\n\tINT.  HALLWAY - NIGHT\n\t\n\tMeg flies up the stairs, bare feet on padded carpet.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tIn the living room, Raoul looks up, hearing the pitter-pat of\n\ther feet on the stairs above.\n\t\n\tHe smiles and pulls his ski mask back on, to cover his face.\n\t\n\tComing around behind him, we see Burnham sitting in the\n\tchair.  Except it isn't Burnham at all, it's Harris,\n\tunconscious, wearing Burnham's shirt.\n\t\n\tAnd if Harris is the person in the chair, that means --\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\t-- the person on the bed in the bedroom is Burnham, wearing\n\tHarris's shirt.  His eyes pop open, he sits up, sees the wide\n\topen door to the panic room.\n\t\n\tINT.  SARAH'S BEDROOM - NIGHT\n\t\n\tMeg races into Sarah's bedroom and tears open the door of a\n\tmini-fridge.  Inside are dozens of little bottles of insulin\n\tand something called Glucogen.\n\t\n\tShe grabs a bottle of Glucogen and a black leather pouch and\n\ttakes off.\n\t\n\tINT.  HALLWAY - NIGHT\n\t\n\tAs Meg nears the bottom of the stairs, she sees a horrifying\n\tsight.  It's Raoul, ski mask over his face, standing in the\n\tdoorway of the master bedroom.\n\t\n\tShe SCREAMS, he SLAMS the door, she takes off down the hall,\n\treaches the end, throws the door open --\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\t-- and races into the master bedroom, where Raoul is\n\tmotoring, fast, headed for the panic room, where she can\n\talready see Burnham, standing in the middle of the open\n\tdoorway, in front of Sarah, wearing Harris's shirt and a grim\n\t\"tricked you\" expression.\n\t\n\tMeg hurls herself at Raoul, lands clinging to his back.  She\n\tclaws and wrestles with him, gets one hand on his ski mask,\n\ttears it from his head.  He reaches up to try to stop her\n\tfrom pulling it off --\n\t\n\t-- his gun slips from his fingers, falls to the floor --\n\t\n\t-- and caroms off his boot, spinning across the floor away\n\tfrom them.\n\t\n\tRaoul flips her off his back violently, she CRUNCHES to the\n\tfloor, clutching his mask and getting a good long look at his\n\tface.  He makes a move toward his gun, but she's faster,\n\tshe's already pawing herself frantically across the hardwood\n\ttoward it.\n\t\n\tRaoul measures the distance, knows he'll lose, and sprints\n\tfor the panic room instead.  Meg turns, looks down at the\n\tmedicine in her hands, then at the door to the panic room,\n\twhere Raoul is right now reaching up to push the button that\n\tcontrols the steel door.\n\t\n\tShe makes a fast decision and lunges, hurling the plastic\n\tbottle of Glucogen and the black leather pouch through the\n\tgap just before --\n\t\n\t-- the spring-loaded steel door SLAMS shut with tremendous\n\tferocity.\n\t\n\tAnd then it's silent.  Meg WAILS in agony, POUNDS on the\n\tdoor.\n\t\n\tShe stands back, chest heaving, sobbing.\n\t\n\tA looooong moment goes by.\n\t\n\tFinally, a VOICE comes over the house's intercom system.\n\t\n\t                     RAOUL (O.S.)\n\t               (calmly)\n\t          If you leave the house, we'll kill\n\t          her.\n\t\n\tMeg sobs.\n\t\n\t                     RAOUL (O.S.)\n\t          If I see a uniform in the house,\n\t          we'll kill her.\n\t\n\t                     MEG\n\t          Oh... oh...\n\t\n\t                     RAOUL (O.S.)\n\t          You understand?\n\t\n\tON THE MONITORS,\n\t\n\tMeg looks up at the camera in the master bedroom.  She nods,\n\tterrified.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tBurnham pushes past Raoul, at the speaker button, and leans\n\tforward.  He's approaching exhaustion.\n\t\n\t                     BURNHAM\n\t               (into speaker)\n\t          I just... I just need forty-five\n\t          minutes.\n\t\n\tRaoul stands behind him, muttering to himself.\n\t\n\t                     RAOUL\n\t          Saw my face, man.  Saw my face.\n\t\n\tON THE MONITORS,\n\t\n\twe see Meg's face, agonized, as she lunges toward the camera,\n\tSCREAMING something up at it, the same thing, over and over.\n\tBut in here her voice is nearly muted, what bleeds through\n\tthe walls isn't enough to be heard.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tRaoul looks at her image on the monitor, irritated.\n\t\n\t                     RAOUL\n\t          Shut up.\n\t\n\tIN THE MASTER BEDROOM,\n\t\n\twe abruptly hear her voice, full-throated.\n\t\n\t                     MEG\n\t               (shouting into the camera)\n\t          -- cine, she needs the MEDICINE!\n\t          GIVE HER THE --\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah shivers in a corner, knees pulled up to her chest,\n\tstaring at the intruders, scared out of her wits, and looking\n\tvery, very sick.\n\t\n\tBurnham looks at her, musters the most reassuring face he can\n\tcome up with under the circumstances.\n\t\n\t                     BURNHAM\n\t          It's gonna be cool, kid.  Be outta\n\t          here before you know it.\n\t\n\tNo response from Sarah.  Burnham cocks a head, really looking\n\tat her.\n\t\n\t                     BURNHAM\n\t          Are you okay?\n\t\n\t                     RAOUL\n\t          Hurry up, for Christ's sake!\n\t\n\tBurnham turns, grabs his satchel, and drops to his knees in\n\tthe middle of the floor.  Over his shoulder, we can see the\n\tface of Meg on one of the monitors, shouting into the camera,\n\tbegging them to give Sarah her medicine.\n\t\n\tUsing his hand, Burnham measures six lengths in from the\n\twall, then digs his fingernails into the weave of the carpet,\n\tlooking for a seam.\n\t\n\tHe finds one, gets hold of it on one edge, and runs his other\n\thand along the seam till he finds a place where it seems to\n\tturn a corner.  He stands, hovering over the carpet, and\n\tpulls back evenly with both hands.\n\t\n\tThe concealed carpet flap pulls back neatly, with the soft\n\tsound of tearing VELCRO.  Underneath the flap --\n\t\n\t-- is the smooth metal door of a floor safe.\n\t\n\tBurnham unsnaps his satchel and gives it a shove.  It rolls\n\tout and opens up onto the floor, revealing a neat array of\n\tsafecracking tools.\n\t\n\tHe begins his delicate work, but is suddenly jarred by a\n\tPOUNDING on the metal door.  He turns, annoyed.  Meg is still\n\tSCREAMING outside the door.\n\t\n\t                     BURNHAM\n\t          The hell does she want?\n\t\n\t                     RAOUL\n\t          I don't know, she keeps screamin'\n\t          the same thing over and over.\n\t\n\tBurnham turns, looks at the monitors.\n\t\n\tON THE MONITORS,\n\t\n\tMeg is staring up at the camera, miming the act of giving\n\therself an injection in the arm.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tRaoul laughs.\n\t\n\t                     RAOUL\n\t          Drugs.  She wants drugs.  What the\n\t          fuck?\n\t\n\tBut Burnham thinks.  His eyes fall on the bottle and the\n\tleather pouch she hurled through the door, then whip over to\n\tSarah, who sags over into a fetal position on the floor.  Her\n\tlips are moving.\n\t\n\t                     BURNHAM\n\t          Oh, man...\n\t\n\tHe crawls over to Sarah, puts his ear down next to Sarah's\n\tlips.\n\t\n\t                     BURNHAM\n\t          What is it?\n\t\n\tSarah tries to summon enough strength to speak, but her\n\tbreath comes hard.\n\t\n\t                     SARAH\n\t          I need...\n\t\n\t                     BURNHAM\n\t          Yeah?\n\t\n\t                     SARAH\n\t          ... 'jection...\n\t\n\t                     BURNHAM\n\t          An injection?\n\t\n\tSarah nods.  Burnham points to the pouch and the Glucogen, on\n\tthe floor nearby.\n\t\n\t                     BURNHAM\n\t          That stuff?\n\t\n\tSarah nods again.\n\t\n\t                     BURNHAM\n\t          Can you do it yourself?\n\t\n\tSarah shakes her head no.\n\t\n\t                     BURNHAM\n\t          Well, I don't know how.\n\t\n\tSarah looks at him, eyes pleading.  Raoul stands behind\n\tBurnham.\n\t\n\t                     RAOUL\n\t          I don't fucking believe this.\n\t               (to Sarah)\n\t          You gotta wait.\n\t\n\tSarah just looks at Burnham.  Please.\n\t\n\t                     BURNHAM\n\t          Yeah, just like a half hour, maybe a\n\t          little more, and your mom'll give it\n\t          to you.  You can wait a half hour,\n\t          can't you?\n\t\n\t                     RAOUL\n\t          Yeah.  She can.  She's fine, she's\n\t          just like, tired, she's gotta rest.\n\t          You rest, Kid.  Half an hour.\n\t\n\tSarah looks terrified, shaking her head no.\n\t\n\t                     RAOUL\n\t          Come on.\n\t\n\tHe starts to pull Burnham away, but Burnham shakes his hand\n\toff, violently.  He bends down very close to Sarah's lips.\n\t\n\t                     BURNHAM\n\t          Tell me the truth, okay?  What's\n\t          gonna happen if you don't get this?\n\t\n\tSarah swallows, licks her cracking lips.  When she speaks,\n\tit's breathy, almost inaudible.\n\t\n\tBut the words are clear.\n\t\n\t                     SARAH\n\t          Coma.  Die.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tSeen from overhead, Meg paces in the master bedroom, out of\n\ther mind with worry, no idea how to communicate to the people\n\tin the room the desperate situation.\n\t\n\tSuddenly, a VOICE comes over the intercom speaker.\n\t\n\t                     BURNHAM (O.S.)\n\t          I understand.  I'll give her the\n\t          shot.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tA HAND comes down into frame and picks up the Glucogen and\n\tthe leather pouch.  Burnham stands, looking down at them.\n\tRaoul grabs him, pulls him to the far end of the room.\n\t\n\t                     RAOUL\n\t          You're wasting your fucking time,\n\t          man, you're wasting my time.  You\n\t          don't know how to do this, and the\n\t          longer we stay in here, the more\n\t          likely she's gonna lose it and call\n\t          the cops!\n\t\n\t                     BURNHAM\n\t          Are you gonna open the safe?\n\t\n\tRaoul looks at him.\n\t\n\t                     BURNHAM\n\t          Then shut up and get out of my way.\n\t\n\tAs Burnham crosses the room, Raoul makes eye contact with\n\tSarah, who is staring at him.\n\t\n\t                     RAOUL\n\t          Don't look at me.\n\t\n\tACROSS THE ROOM,\n\t\n\tBurnham drops to his knees next to Sarah and unzips the\n\tpouch.\n\t\n\t                     BURNHAM\n\t          Okay, kid, all I know about this is\n\t          what I've seen on TV, you gotta talk\n\t          me through it.\n\t\n\tSarah tries to form words, but she's too weak.  Burnham\n\tswallows.\n\t\n\t                     BURNHAM\n\t          Okay.  No talking.  No problem.  TV\n\t          don't lie, right?\n\t\n\tHe reaches into the pouch, take out a syringe, a sterile pad,\n\tand a length of rubber tubing.  He takes Sarah's arm,\n\tstretches it out, exposing the underside of her forearm.\n\t\n\t                     BURNHAM\n\t          You seem like a good kid.  Your\n\t          mom... only saw her for a second,\n\t          but, woah.  Beautiful, huh?\n\t\n\tNo answer.  Burnham ties the rubber tubing around Sarah's\n\tarm, pulls it tight.\n\t\n\t                     BURNHAM\n\t          Hey, nod or something, show me\n\t          you're still alive, will ya?\n\t\n\tSarah nods.\n\t\n\t                     BURNHAM\n\t          Attagirl.  That too tight?\n\t\n\tSarah shakes her head no.  Burnham takes the syringe, starts\n\tto fill it from the Glucogen bottle.\n\t\n\t                     BURNHAM\n\t          You guys are pretty rich, huh?\n\t\n\tSarah shrugs.  While Burnham goes through the process of\n\tfinding an exposed vein and giving the injection itself, he\n\tgoes on, as much to comfort Sarah as to comfort himself:\n\t\n\t                     BURNHAM\n\t          Yeah, you don't think about that\n\t          stuff.  Good for you.\n\t\n\tHe looks at her, sees her looking at him.  Thinking about\n\thim.\n\t\n\t                     BURNHAM\n\t          I know, I know.  I really screwed\n\t          the pooch this time.  I never did\n\t          anything like this before.  Break\n\t          into somebody's house?  Not even\n\t          close.  Bad cards, Kid.  I swear to\n\t          God, I been on the wrong end of\n\t          maybe six straight years of bad\n\t          cards.  House.  Car.  Wife.\n\t               (snaps his fingers --\n\t                gone)\n\t          Those are some seriously bad cards.\n\t          And still, every time I pick up a\n\t          fresh hand I swear to God, the rush\n\t          comes so hot and prickly I feel it\n\t          right down to my toes because this\n\t          time, this one time, it might be\n\t          there, this time it might be that\n\t          hand, that perfect hand, that\n\t          monster hand.\n\t               (shakes his head)\n\t          And you thought you were sick.\n\t\n\tThe shot successfully given, he pulls Sarah's sleeve back\n\tdown.\n\t\n\t                     BURNHAM\n\t          Feel better?\n\t\n\tSarah nods, and she seems better already.  Burnham helps her\n\tto sit up, to lean against the wall.\n\t\n\t                     BURNHAM\n\t          Woulda been a hell of a dad.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tA VOICE comes over the intercom in the master bedroom.  It's\n\tRaoul.\n\t\n\t                     RAOUL (O.S.)\n\t          She's okay.  Now sit down and wait.\n\t\n\tHe CLICKS off.\n\t\n\tMeg is hugely relieved.  And extremely pissed off.  She goes\n\tto the corner of the room and picks up the gun, the one that\n\tRaoul dropped.\n\t\n\tShe heads downstairs.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tSparks fly as Burnham goes to work on the floor safe with a\n\tsmall, specialized drill.\n\t\n\tRaoul bends down next to him.\n\t\n\t                     RAOUL\n\t          Congratulations.  You saved her life\n\t          for ten minutes.\n\t\n\tBurnham looks up at him -- what?  But Raoul turns and walks\n\taway.\n\t\n\tBurnham goes back to work.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tMeg is in the living room, with Harris, who is still slouched\n\tin the chair.  He's in awful shape, barely conscious.\n\t\n\tOut of the silence, a sudden, deafening sound.\n\t\n\tThe DOORBELL.\n\t\n\tHer eyes go wide.  She darts a look over to the door (the one\n\tthat leads to the stoop, not the bloody kitchen door\n\tdownstairs), then back at Harris.\n\t\n\t                     HARRIS\n\t          Police.\n\t\n\t                     MEG\n\t               (gasps)\n\t          You called the police?\n\t\n\tHe nods.\n\t\n\t                     HARRIS\n\t          You... scared...\n\t\n\tShit.  This is exactly what she prayed for him to do, now\n\tit's the worst thing that could happen.\n\t\n\tShe stands, thinking, desperate.  She walks toward the door,\n\tstops, thinks some more.\n\t\n\tThe doorbell RINGS again.\n\t\n\tShe comes up with a plan.  She goes back to where Harris is\n\tin the chair, pulls the chair back a few feet, out of view of\n\tthe door.  She puts the gun in his lap, puts his hand over it\n\tto steady it.\n\t\n\tShe leans down, WHISPERS to him.\n\t\n\t                     MEG\n\t          Don't.  Say.  A word.\n\t\n\tHe nods.\n\t\n\tMeg takes a breath, walks across the foyer, tousling her hair\n\tas she goes.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tRaoul is staring at the monitors, aghast.\n\t\n\t                     RAOUL\n\t          Holy shit... holy shit...\n\t\n\tBurnham races over, looks over his shoulder.  One monitor\n\tcovers the front stoop, and on that monitor they can clearly\n\tsee TWO UNIFORMED COPS.\n\t\n\t                     RAOUL\n\t          She's fuckin' crazy, she killed the\n\t          kid!  She just killed her own kid!\n\t\n\t                     BURNHAM\n\t          It's not her fault, it's not her\n\t          fault, the guy must have called\n\t          them.  Look, look, look, she's\n\t          telling us.\n\t\n\tHe points to another monitor, the one in the foyer, where Meg\n\tis looking up at the camera, miming to them -- don't worry,\n\tI'll take care of this.\n\t\n\t                     BURNHAM\n\t          She's gonna handle it.\n\t\n\t                     RAOUL\n\t          She better.\n\t\n\tINT.  ENTRY FLOOR - NIGHT\n\t\n\tMeg's shaking hand rises up to the doorknob and pulls open\n\tthe big front door.  On the stoop, the two Cops turn to look\n\tat her.  She acts as if she's just been awakened.  She looks\n\tit, too, still in T-shirt and boxer shorts.  The wind is\n\tgusty and cold outside.\n\t\n\t                     MEG\n\t          Yeah?\n\t\n\t                     COP 1\n\t          Everything okay?\n\t\n\t                     MEG\n\t          Huh?\n\t\n\t                     COP 2\n\t          Are you all right?\n\t\n\t                     MEG\n\t          What are you guys -- what time is\n\t          it?\n\t\n\t                     COP 1\n\t          'Bout four o'clock.\n\t\n\t                     MEG\n\t          I don't get it.\n\t\n\t                     COP 2\n\t          We got a call...\n\t\n\tCop 1 looks at him.  Cop 2 stops talking.\n\t\n\t                     MEG\n\t          Somebody called you?\n\t\n\t                     COP 1\n\t          Can we come in?\n\t\n\t                     MEG\n\t          What do you want?\n\t\n\t                     COP 1\n\t          We'd like to come in.\n\t\n\t                     MEG\n\t          No, you can't come in.\n\t\n\t                     COP 2\n\t          Are you okay?\n\t\n\t                     MEG\n\t          I'm fine.\n\t\n\t                     COP 1\n\t          Can we come in?\n\t\n\t                     MEG\n\t          Stop asking me that.  I'm fine.  Who\n\t          called you?\n\t\n\t                     COP 1\n\t          You don't look so good.\n\t\n\t                     MEG\n\t          You wake me out of a sound sleep at\n\t          four in the morning and then tell me\n\t          I look like hell?  Of course I look\n\t          like hell, you don't look so hot\n\t          yourself, Jack.  I'm freezing here,\n\t          thank you for checking, can I go?\n\t\n\tCop 1 studies her, notices the burned sleeve of her T-shirt,\n\tthe black smudges still on her face.\n\t\n\t                     COP 1\n\t          Your husband says you said \"There\n\t          are three...\" right before you got\n\t          cut off.\n\t\n\t                     MEG\n\t          Oh, that phone call...\n\t\n\tCop 1 takes a step forward and lowers his voice to just above\n\ta whisper, unconsciously making her lean forward in order to\n\thear him.\n\t\n\t                     COP 1\n\t          Ma'am, if there's something you want\n\t          to say to us right now that maybe\n\t          you can't say to us right now, maybe\n\t          you just want to make a signal, by\n\t          blinking a few times, something like\n\t          that.\n\t\n\tShe just looks at him.  Wow, this guy's intuitive.  She is\n\tsorely tempted.  But she can't.\n\t\n\t                     COP 1\n\t          That's something you could do.\n\t          Safely.\n\t\n\tShe thinks, thinks --\n\t\n\t-- and burst out laughing.\n\t\n\t                     MEG\n\t          Man, you are good!  You mean, like,\n\t          if somebody was in the house or\n\t          something?  That's great, they\n\t          really train you guys these days,\n\t          don't they?\n\t\n\tCop 1 looks at her, not sure if he believes her or not.\n\t\n\t                     MEG\n\t          No.  I'm fine.  Cross my heart.\n\t\n\tCop 2 turns to go, but Cop 1 lingers.\n\t\n\t                     COP 1\n\t          May I ask what the rest of that\n\t          sentence was going to be?\n\t\n\t                     MEG\n\t               (stalling)\n\t          Huh?\n\t\n\t                     COP 1\n\t          The sentence that started \"There are\n\t          three.\"  What was the rest?\n\t\n\tPause.  She stares at him.\n\t\n\t                     MEG\n\t          Okay, look.  My husband and I just\n\t          broke up.  It's my first night in\n\t          the new house, and I was feeling a\n\t          little lonely and a little drunk.\n\t          The sentence, if you insist on\n\t          knowing, was going to be \"There are\n\t          three things I'll do for you if you\n\t          come over right now and get in bed\n\t          with me.\"\n\t\n\tCop 2 stifles a laugh.\n\t\n\t                     MEG\n\t          But thank God I came to my senses\n\t          before I said all that and hung up\n\t          instead, so nobody would ever know\n\t          what I was thinking, unless, of\n\t          course, two policemen showed up in\n\t          the middle of the night to\n\t          interrogate me about it.\n\t\n\tThat was good.  Cop 1 is embarrassed.  Cop 2 thinks it's\n\tfunny.\n\t\n\t                     COP 2\n\t          You want her to show you which three\n\t          things, Rick, or should we just go?\n\t\n\tCop 1 looks at Meg, a long look, he holds it for one last\n\tmoment, trying to read her mind.\n\t\n\tON THE MONITORS,\n\t\n\twe see the video image of the Cops as they turn and head away\n\tdown the front steps.  Meg closes the doors, looks up into a\n\tcamera, right at us.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tBurnham and Raoul breathe a sigh of relief.\n\t\n\tBurnham goes back to work on the safe.  He's making progress.\n\t\n\tRaoul looks at Sarah.  Stares actually.  He's thinking too.\n\t\n\tBad thoughts.  He moves over, crouches down next to Burnham.\n\t\n\t                     RAOUL\n\t          She saw my face.  The kid too.\n\t\n\tSarah overhears that.  She raises her head, alarmed.  Burnham\n\tturns, looks over at her, and she just gets her head back\n\tdown in time.  Burnham and Raoul close themselves off, for a\n\tprivate conversation.\n\t\n\tSarah edges closer.  She overhears a fragment.\n\t\n\t                     BURNHAM\n\t          That's your problem.\n\t\n\t                     RAOUL\n\t          That's their problem.\n\t\n\tSarah is terrified.  Doesn't know what to do.  She looks to\n\ther immediate left, sees the intercom panel.  She edges\n\tcloser.\n\t\n\t                     BURNHAM\n\t          Let me fucking finish this so we can\n\t          get out of here.\n\t\n\t                     RAOUL\n\t          You finish.  Then we finish.\n\t\n\tSarah sneaks up a hand and pushes a button -- \"ALL PAGE.\"\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tIn the living room, there is an audible CLICK as the speaker\n\tis activated.  Meg looks up, hears Burnham's voice, in the\n\tmiddle of a sentence.\n\t\n\t                     BURNHAM (O.S.)\n\t          -- posed to mean?\n\t\n\t                     RAOUL (O.S.)\n\t          You're here with me, you're already\n\t          on the hook for one.  Buy one, you\n\t          get the rest for the same price.\n\t          You know that.\n\t\n\t                     BURNHAM (O.S.)\n\t          Get the fuck away from me.\n\t\n\t                     RAOUL (O.S.)\n\t          The kid in here.  The other two when\n\t          we come out.\n\t\n\tMeg listens, horrified.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tSarah holds the intercom button down with a trembling finger.\n\t\n\t                     BURNHAM\n\t          Bullshit.\n\t\n\t                     RAOUL\n\t          You know how this gotta end.\n\t\n\tINT.  LIVING ROOM - NIGHT\n\t\n\tMeg stares, in shock, as Raoul's voice echoes in the empty\n\troom.\n\t\n\t                     RAOUL (O.S.)\n\t          They stay in the house.\n\t\n\tThere in an abrupt CLICK, and the speaker turns off.  Meg\n\tturns, goes to Harris, falls to her knees, no idea what to\n\tdo.  She holds him close, their foreheads touching.  She's\n\tterrified, exhausted, wants to collapse in his arms.\n\t\n\tInstead, she starts to pull the gun from his fingers.  He\n\ttightens his grip, what are you doing?  He tries to hold onto\n\tthe gun, but she pulls his fingers off it, takes it away from\n\thim.  He is too weak to resist.\n\t\n\t                                                  CUT TO:\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tIn the panic room, Sarah has her hands clamped over her ears,\n\ther mouth is wide open, and a hideous METAL SHRIEK seems to\n\tbe coming out of it.\n\t\n\tBut the SHRIEK is actually coming from the safe, where\n\tBurnham continues to work, another drill, a bigger bit.  The\n\tnoise is deafening.\n\t\n\tON THE MONITORS,\n\t\n\tSarah sees her mother approaching the monitor in the bedroom,\n\tcarrying a jacket.  Meg tosses the jacket, this time she\n\tdoesn't want them to see what she's doing.\n\t\n\tThe monitor goes black.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tIn the master bedroom, Meg pulls on a pair of jeans that are\n\thanging over a chair.\n\t\n\tShe steps into a pair of boots.\n\t\n\tShe shoves the gun into her belt.\n\t\n\tHere in the bedroom, she can hear the drill.  From the house\n\tnext door, she hears POUNDING again, more MUFFLED CURSES.\n\tApparently the neighbor can hear the drill too.\n\t\n\tMeg looks from the walls of the bedroom to the walls of the\n\tpanic room.  Her eyes light up with an idea.\n\t\n\tShe goes to the front wall of the bedroom, stands with her\n\tback against the exterior wall (street side), with her left\n\tshoulder against the common wall that's shared with the\n\tneighbor's brownstone.\n\t\n\tShe begins to step off the distance, heel to toe, measuring\n\twith her feet until she reaches the metal door that is the\n\tentrance to the panic room.\n\t\n\t                     MEG\n\t          Fourteen.\n\t\n\tShe hurries out of the bedroom.  What's she doing?\n\t\n\tINT.  LIBRARY - NIGHT\n\t\n\tMeg comes into a small room full of empty bookshelves, a\n\tlibrary.  There is a window that looks out over the sidewalk,\n\tone floor up, same level as the stoop.\n\t\n\tShe looks up, into the corners of the room.\n\t\n\t                     MEG\n\t          No camera, no camera, no camera...\n\t\n\tThey're bare, no video cameras.  Good.\n\t\n\tShe goes to the window, tries to open it.  Screwed shut, of\n\tcourse.\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\tThe safe is almost cracked.  Raoul is watching the monitors\n\tcarefully.\n\t\n\tON THE MONITORS,\n\t\n\twe see Meg as she searches through the tools in the living\n\troom, finds a screwdriver, a sledgehammer.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tRaoul furrows his brow.  Now what?\n\t\n\tINT.  LIBRARY - NIGHT\n\t\n\tMeg is back in the library, hurriedly unscrewing the window.\n\tShe gets the last screw out, shoves the window up.\n\t\n\tThe wind BLASTS in, it's a hell of a spooky night out there.\n\t\n\tShe leans out the window.  We lean with her.  The sidewalk is\n\tempty (we see it only from our vantage point inside the\n\thouse).  She's one floor up.  To her right is the house's\n\tfront stoop.\n\t\n\tShe tosses the sledgehammer over, onto the stoop.  Climbs up\n\tonto the window ledge, and slithers out herself.\n\t\n\tWe lean further, watch her as she edges along the ledge, hops\n\tdown onto the stoop, and freezes, staring in horror --\n\t\n\t-- at the video camera that covers the front stoop.\n\t\n\tON THE MONITORS,\n\t\n\twe see her staring straight up at the camera, clearly\n\tstanding on the front stoop, outside the house, where she was\n\tspecifically told not to go.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah sees the image of her on the stoop.  Raoul happens to\n\tbe looking away at the moment, at the safe, but he starts to\n\tturn around, to look at the monitors again --\n\t\n\t-- and Sarah kicks him, hard, in the ass.\n\t\n\t                     RAOUL\n\t          Hey!\n\t\n\tHe turns, away from the monitors.\n\t\n\t                     SARAH\n\t          Sorry.  Can't control it sometimes.\n\t\n\tRaoul scowls at her.  Behind him --\n\t\n\tON THE MONITORS,\n\t\n\tMeg darts down the front steps and disappears from view on\n\tthe monitor.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tSarah sees her mother go.\n\t\n\t                     SARAH\n\t               (to Raoul)\n\t          Won't happen again.\n\t\n\tINT.  LIBRARY - NIGHT\n\t\n\tStill leaning out the window, we can see Meg from here as she\n\treaches the sidewalk and runs up the front steps of the\n\tneighbor's house, which is contiguous.\n\t\n\tStraining to see (yet stay in the house), we see Meg all the\n\tway at the right edge of the frame, as she shifts the gun to\n\tthe back of her pants and knocks on the neighbor's door,\n\tsledgehammer held slightly behind her leg.\n\t\n\tAfter a long moment, we hear the neighbor's front door open.\n\tThe conversation begins.  The wind is gusting right in our\n\tfaces, we can't make out the details, but the gist is clear --\n\tlet me into your house, and don't as me a lot of questions.\n\t\n\tThe NEIGHBOR -- and by the tone of the voice it sounds like\n\tan old woman -- is slow to respond, grumpy.\n\t\n\tLosing patience, Meg just pulls the Neighbor out of the way\n\tand shoves into the house.  The Neighbor stumbles out onto\n\ther front stoop, and we were right, it's an old lady in a\n\tnightgown, but she's no shrinking violet.  In fact, she's\n\troyally pissed off and not at all intimidated.\n\t\n\t                     NEIGHBOR\n\t          What the hell do you think you're\n\t          doing, young lady?!\n\t\n\tShe storms back into her house, following Meg.  As both of\n\tthem disappear from the frame, we move out of the library,\n\tinto the foyer, and move along the common wall, the one\n\tshared with the neighbor's brownstone.\n\t\n\tFrom the other side of the wall, we can hear muffled voices,\n\targuing, Meg and the Neighbor shouting at each other.\n\t\n\tWe drift up, up the stairs, and hear the THUNDERING of\n\tfootsteps on the stairs next door.  We keep pace with them,\n\tfrom inside this house.  We pass right through the floor --\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\t-- and rise up out of the floor in the master bedroom, and\n\tnow we can hear the conversation on the other side of the\n\twall in here, the Neighbor's fearful, angry tones, Meg's\n\tfirm, urgent declarations.\n\t\n\tWe move with Meg, even though we can't see her, we know what\n\tshe's doing, she's stepping off the paces on the other side\n\tof the wall.  We drift down that wall, fourteen steps, until\n\twe reach the metal door to the panic room, then we pass\n\tthrough that door --\n\t\n\tINT.  PANIC ROOM - NIGHT\n\t\n\t-- and arrive inside the panic room, where Burnham is this\n\tclose to getting the safe open, when all of a sudden --\n\t\n\tWHOMP.\n\t\n\tCRUNCH.\n\t\n\tBurnham and Raoul freeze, alarmed.  It's coming from the long\n\twall, the shared wall.\n\t\n\tThey look at each other.\n\t\n\tWHOMP.\n\t\n\tCRUNCH.\n\t\n\tThey look at the wall.\n\t\n\tSomebody is on the other side, pounding like hell.\n\t\n\t                     RAOUL\n\t          The walls are steel, right?\n\t\n\t                     BURNHAM\n\t          Not that one.\n\t\n\t                     RAOUL\n\t          NOT THAT ONE?!\n\t\n\t                     BURNHAM\n\t          Hey man, it's the neighbor's house,\n\t          who breaks in through the neighbor's\n\t          house?!\n\t\n\tWHOMP!  CRUNCH!\n\t\n\tLouder.  Closer.  Burnham turns, SCREAMS at the wall.\n\t\n\t                     BURNHAM\n\t          WHO THE FUCK BREAKS IN THROUGH THE\n\t          NEIGHBOR'S HOUSE?!\n\t\n\t                     RAOUL\n\t          We've got the Kid!\n\t               (shouting at the wall)\n\t          WE'VE GOT YOUR KID!!  What the fuck\n\t          is she thinking?!\n\t\n\tWHOMP!  CRUNCH!\n\t\n\t                     BURNHAM\n\t          She's got your gun, that's what\n\t          she's thinking!  The FUCK you had to\n\t          bring a gun for?!\n\t\n\tBurnham throws himself back on the floor, goes back to work\n\ton the safe.  Fires up the drill again, it SCREAMS into the\n\tmetal.\n\t\n\t                     BURNHAM\n\t          Almost there...\n\t\n\tThe POUNDING keeps up from next door.  We hear sheetrock torn\n\taway on the far side.  Bricks, SCRAPING out of place.\n\t\n\tSarah, in the corner, is energized, excited.  While Burnham\n\tand Raoul are distracted, she grabs the leather pouch, palms\n\tthe three syringes that are left in there.\n\t\n\t                     BURNHAM\n\t          ALMOST THERE...\n\t\n\tFinally, the door to the safe CRUNCHES in on one side,\n\tyielding to the drilling --\n\t\n\t-- at the very moment that the head of a sledgehammer CRASHES\n\tthrough the wall of the panic room.  Raoul grabs hold of\n\tSarah, Burnham maintains his focus, throwing open the safe,\n\trevealing --\n\t\n\t-- nothing.\n\t\n\tCRUNCH!\n\t\n\tThe sledgehammer head strikes again, opening up a hole about\n\ta foot across.  Light spills through from the other side, as\n\twell as the voice of the hysterical Neighbor.\n\t\n\tRaoul hurls Sarah against the far wall, leaps over to the\n\tside of the hole, and waits, poised above it.\n\t\n\tAt the safe, Burnham doesn't lose his cool, just opens a\n\tfalse bottom in the safe, revealing a manila envelope.\n\t\n\tHe snatches it up, RIPS it open, and his eyes dance as he\n\tholds up fourteen individual one million dollar U,S, Treasury\n\tBearer Bonds.  He fans them out, eyes drinking from his\n\tGrail.\n\t\n\tBANG!\n\t\n\tA gunshot whizzes right through one of the bonds, setting it\n\taflame before it SLAMS into the far wall, sending up a little\n\tcloud of plaster dust.\n\t\n\t                     BURNHAM\n\t          JESUS!\n\t\n\tHe whirls, sees an arm poking through the hole in the wall,\n\tgun extended.\n\t\n\tBut Raoul is standing just above the hole, and already has\n\this boot raised, over the hand.  He brings it down, a\n\tCRUNCHING blow that stomps right on Meg's wrist.\n\t\n\tMeg SCREAMS, loses her grip on the gun, and it CLATTERS into\n\tthe space between the houses.\n\t\n\tBETWEEN THE WALLS,\n\t\n\tthe gun falls into oblivion, the space between the walls,\n\twhere no one can get to it.\n\t\n\tIN THE PANIC ROOM,\n\t\n\tBurnham shoves the loose bonds into his jacket.\n\t\n\t                     BURNHAM\n\t          I GOT THE MONEY, LET'S GO!!!\n\t\n\tRaoul grabs Sarah and turns, jabs the green button to open\n\tthe door.\n\t\n\tBehind them, Meg SCREAMS in anger and wriggles through the\n\topening.  Before she's even all the way through, she gets\n\thold of Raoul's leg and pulls herself into the panic room,\n\tscraping and bloodying herself on the edges of the too-small\n\thole.\n\t\n\t                     BURNHAM\n\t          GO, LET'S GO, OUTTA HERE!!\n\t\n\tBut Raoul is deep in a violent rage.  Still holding Sarah\n\twith one hand, he bends down, grabs Meg by the hair, and\n\tdrags her toward the doorway.\n\t\n\t                     RAOUL\n\t          YOU KNOW HOW THIS IS GONNA GO!\n\t\n\t                     BURNHAM\n\t          FUCK YOU, I'M GONE!\n\t\n\tHe bolts out of the room, through the metal door, which is\n\tjust finishing its slow crank open, its heavy spring coiling\n\tin the wall.\n\t\n\tRaoul drag Meg across the floor by the hair, right into the\n\ttrack of the open steel door.\n\t\n\tShe looks up, sees the infrared safety beam over her head,\n\tand  realizes with horror what his intention is.\n\t\n\tStill with one arm holding Sarah, who is kicking and\n\tstruggling viciously, Raoul holds Meg's head down on the\n\tfloor, below the safety beam that would prevent the door from\n\tclosing.  He reaches for the \"close\" button.\n\t\n\tSarah raises her arm, stuffed with three syringes, and jabs\n\tthem into Raoul's neck.  Raoul SCREAMS in pain.\n\t\n\tMeg manages to raise her head, breaking the beam.\n\t\n\tINT.  HALLWAY - NIGHT\n\t\n\tOn the stairwell, Burnham, stops, frozen, his face twitching\n\twith indecision.  He hears the murder taking place just above\n\thim.\n\t\n\tHe runs down three steps.\n\t\n\tStops again.\n\t\n\tRuns down the rest of the stairs.\n\t\n\tINT.  MASTER BEDROOM - NIGHT\n\t\n\tRaoul stretches to push the red \"close\" button for the door,\n\tbut he has to hold Meg's head down, out of the lower beam\n\twith one hand, all with Sarah savagely attacking him at the\n\tsame time, and three syringes hanging out of his neck.\n\t\n\tFinally, he gets Meg's head all the way down, onto the floor.\n\t\n\tLooking up, Meg sees the red beam become complete again.\n\t\n\tRaoul jabs the button --\n\t\n\t-- just as Sarah throws her hand into the upper beam, the one\n\tat shoulder level.  Sarah's hand turns red, the beam is\n\tbroken, the door will not close.\n\t\n\tRaoul ROARS in anger and twists violently, sending Sarah\n\tflying across the room.\n\t\n\tMeg strains, gets her head off the floor again, breaking the\n\tbeam.  Raoul starts jamming the close button, over and over\n\tagain, the beam completes, then breaks, completes, then\n\tbreaks, never the button and the beam at the same time.\n\t\n\tBut it can't go on forever.  Meg's tiring, she can't keep it\n\tup, her head trembles --\n\t\n\t-- and collapses onto the floor.\n\t\n\tThe beam completes --\n\t\n\t-- Raoul SMACKS the red button --\n\t\n\t-- and Burnham appears on the other side of the door.  He\n\treaches in, grabs hold of Raoul, to pull him off her, but\n\tRaoul loses his balance, falls forward --\n\t\n\t-- into the gap --\n\t\n\t-- and his head is crushed by the spring-loaded steel door\n\tthat SLAMS forward just as Meg draws herself back.\n\t\n\tMeg falls across the panic room, grabs Sarah, and holds on\n\ttight.\n\t\n\tThe door detects the obstruction and opens again, slowly.\n\tRaoul's body slumps to the floor, dead.\n\t\n\tBurnham stands there, looking down at Meg and Sarah.\n\t\n\tThey stare at each other, wordless, their first face to face\n\tcontact.  She sees the bonds protruding from his jacket.\n\t\n\tShe just looks at him.  There will be no understanding here.\n\t\n\tHe zips his jacket, turns, and hurries away.\n\t\n\tINT.  ENTRY FLOOR - NIGHT\n\t\n\tBurnham races down the steps, hurries to the entry door,\n\tthrows it open --\n\t\n\t-- and finds a gun barrel pointed directly into his nose.  He\n\tblinks, tries to focus on whoever's on the other end of that\n\tgun.\n\t\n\tIt's the Cop, the first Cop, the one who came to the door and\n\twas so suspicious of Meg.  The Cop looks down, sees blood\n\tsmeared all over Burnham's jacket, sees more than enough to\n\tknow his suspicions were correct.\n\t\n\t                     COP 1\n\t          Put your hands up.\n\t\n\tBurnham freezes, silhouetted in the doorway.  Wind and leaves\n\tblow into the house, a real gale outside.\n\t\n\tFrom behind Cop 1, MORE COPS SHOUT, all at once, must be a\n\thalf dozen of 'em there, but Burnham can't see anything in\n\tthe stinging light, and can't hear much either, over the\n\tROARING wind.\n\t\n\tBurnham moves suddenly, flinging the door shut right in the\n\tCop's face.  The door SLAMS hard, Burnham turns to run but\n\tdoesn't get more than a few paces before three sharp GUNSHOTS\n\tCRACK through the door behind him.\n\t\n\tBrilliant white light spills through the bulletholes in the\n\tdoor, but it's not the light that gets you, it's the chunks\n\tof lead.  They rip through Burnham's back and come out his\n\tchest, a triangle pattern.\n\t\n\tBurnham stops, sags to his knees.  He reaches into his\n\tjacket, pulls out the loose stack of bonds.\n\t\n\tHe fans them out, stares down at them, holds them like\n\tplaying cards.\n\t\n\t                     BURNHAM\n\t          Monster hand.\n\t\n\tBehind him, the front door CRACKS open, half a dozen COPS\n\tappear and start SHOUTING, all at once.  Burnham tosses the\n\tbonds to the floor, the same gesture as folding a hand of\n\tpoker.\n\t\n\tHe GROANS and collapses, slowly, falling through the bonds,\n\ttwisting as he goes down.  He SLAPS onto his back in the\n\tfoyer as the wind gusts through the open door, scoops the\n\tbonds up off the floor, and blows them back into the house,\n\tas if they were never meant to leave.\n\t\n\tBurnham lies there on the floor, eyes open, staring up at the\n\tceiling, looking at the bonds that swirl in the blast of air,\n\tsuspended there, twisting and bucking and diving just over\n\this head as he dies.\n\t\n\t                                             DISSOLVE TO:\n\t\n\tEXT.  CENTRAL PARK - GREAT LAWN - DAY\n\t\n\tThe swirling bonds melt into swirling leaves, blowing in the\n\tair over Central Park on a crisp fall day.  The leaves float\n\tdown, over the Great Lawn, that massive expanse of grass we\n\tsaw in Meg's hallucination.\n\t\n\tBut on a day like this the Great Lawn's full of people,\n\tthrowing frisbees, playing football, lying there doing\n\tnothing.\n\t\n\tThe leaves land on the grass next to Meg and Sarah, stretched\n\tout on a blanket, a newspaper spread in front of them, open\n\tto the ads.\n\t\n\tMeg is on her back, arms folded behind her head, staring up\n\tat the clouds.\n\t\n\tSarah is intent on the paper, circling the occasional ad.\n\t\n\t                     SARAH\n\t          I mean, uptown is close to Dad's\n\t          place, but somebody at school said\n\t          the Village is really cool, so... I\n\t          don't know, it's so great to be\n\t          close to the park and everything...\n\t          What do you think, I mean, give me a\n\t          clue, here, where are we gonna live?\n\t\n\tMeg rolls over, props herself up on one elbow.  She seems\n\tyears younger.  She looks at Sarah, reaches out, brushes her\n\tdaughter's hair behind one ear.\n\t\n\tShe smiles.  She is calm.\n\t\n\tBehind her, a flock of pigeons takes off, leaping into the\n\tclear autumn sky.\n\t\n\t                                                FADE OUT.\n\n\n\n\n\n\nPanic Room\nWriters :   David Koepp\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Recently divorced Meg Altman (Foster) and her 11-year-old daughter Sarah (Stewart) have just purchased a four-story brownstone on the Upper West Side of New York City. The house's previous owner, a reclusive millionaire, installed an isolated room used to protect the house's occupants from intruders. The \"panic room\" is protected by concrete and steel on all sides, a thick steel door, and an extensive security system with multiple surveillance cameras, a public announcement system, and a separate phone line. On the night the two move into the home, it is broken into by Junior (Leto), the previous owner's grandson; Burnham (Whitaker), an employee of the residence's security company; and Raoul (Yoakam), a ski mask-wearing gunman recruited by Junior. The three are after $3 million in bearer bonds, which are locked inside a floor safe in the panic room.\nAfter discovering that the Altmans have moved in earlier than expected, Junior convinces a reluctant Burnham, who assumed the house was unoccupied, to continue with their heist. As they begin the robbery, Meg wakes up and happens to see the intruders on the video monitors in the panic room. Before the three can reach them, Meg and Sarah run into the panic room and close the door behind them. They are unable to use the phone in the room which was a separate phone line that was never hooked up by Meg. Intending to force the two out of the room, Burnham introduces propane gas into the room's air vents. Raoul, in conflict with Burnham and Junior, dangerously increases the amount of gas. Unable to seal the vents, Meg ignites the gas while she and Sarah cover themselves with fireproof blankets, causing an explosion which vents into the room outside and causes a fire, injuring Junior.\nThe Altmans make several attempts to call for help, including signaling a neighbor with a flashlight through the opening of a ventilation pipe, but the neighbor ignores it. Meg then taps into the main telephone line and gets through to her ex-husband Stephen (Bauchau), before the burglars cut them off.\nWhen all attempts to get into the room fail, Junior lets slip that there is much more money in the safe than he let on, and gives up on the robbery. About to leave the house, he is shot by Raoul, who forces Burnham, at gunpoint, to finish the robbery. Stephen arrives at the home and is taken hostage by Burnham and Raoul—who severely beats him. To make matters worse, Sarah, who has diabetes, suffers a seizure. Her emergency glucagon syringe is in a refrigerator outside the panic room. After using an unconscious Stephen to trick Meg into momentarily leaving the panic room, Burnham enters it, finding Sarah motionless on the floor. After retrieving the syringe for Sarah, Meg struggles briefly with Raoul, who is thrown into the panic room, his gun knocked out of his hand. As Meg throws the syringe into the panic room, Burnham frantically locks himself, Raoul, and Sarah inside, crushing Raoul's hand in the sliding steel door. Meg, who now has the gun, begs the two intruders over the PA system to give Sarah the injection. After some time Burnham, who has shown no interest in hurting either Meg or Sarah throughout the film, gives Sarah the injection. While doing so, he tells Sarah he did not want this, and the only reason he agreed to participate was to give his own child a better life. After Burnham gives Sarah the injection, Sarah thanks him and he tells Meg that Sarah is now alright.\nHaving earlier received a call from Stephen, two policemen arrive, which prompts Raoul to threaten Sarah's life. Sensing the potential danger to her daughter, Meg lies to the officers and they leave. Meanwhile, Burnham opens the safe and removes the $22 million in bearer bonds inside. As the robbers attempt to leave, using Sarah as a hostage, Meg hits Raoul with a sledgehammer and Burnham flees. After a badly injured Stephen shoots at Raoul and misses, Raoul disables him and prepares to kill Meg with the sledgehammer, but Burnham, upon hearing Sarah's screams of pain, returns to the house and shoots Raoul dead, stating, \"You'll be okay now\", to Meg and her daughter before leaving. The police, alerted by Meg's suspicious behavior earlier, arrive in force and capture Burnham, who lets the bearer bonds go; they fly away with the wind.\nLater, Meg and Sarah, having recovered from their harrowing experience, begin searching the newspaper for a new home."}