{"title": "Perfect Creature", "full_text": "PERFECT CREATURE\r\n\r\n\r\n\r\n\r\n                          Written by\r\n\r\n                        Glenn Standring\r\n\r\n\r\n\r\n                        SHOOTING SCRIPT\r\n\r\n                         14 May 2004\r\n\r\n\r\n\r\n\r\n\r\n\r\n 1A EXT: PROLOGUE ON BLACK - NIGHT\r\n\r\n The screen is black, music evoking religion and danger begins.\r\n\r\n                                LILLY\r\n                    For three hundred years the great plagues have\r\n                    swept the earth. Diseases created from the\r\n                    experiments of the Alchemists.\r\n\r\n We see death tolls appear through this graphically.\r\n\r\n The plague - 5 million souls. Virulent Small Pox - 10 million.\r\n Mutated Influenza 30 Million Souls...\r\n\r\n                                Lilly\r\n                    Thinking they had discovered Gods secret code for\r\n                    life, the Alchemists experimented with genetic\r\n                    science. They had no idea what they had\r\n                    unleashed.\r\n\r\n  We begin to see a strange medallion sweeping through smoke, slowly\r\n  revealing itself.\r\n\r\n                                LILLY (CONT'D)\r\n                         (continuing)\r\n                    ...but there was also a miracle. One of these\r\n                    plagues helped nature create a new kind of being.\r\n                    At first they were called Nosferatu, or Vampire\r\n                    and were feared. But they were not supernatural\r\n                    monsters, just a better version of ourselves.\r\n                    They were the Brothers, and their religion and\r\n                    science helped sustain us against the plagues and\r\n                    influenzas that have ravaged Europe and the rest\r\n                    of the colonies. For 300 years our two races have\r\n                    lived in harmony. Until now...\r\n\r\n\r\n                                          FADE UP:\r\n\r\n2 INT: DOCTORS SURGERY - DAY                                2\r\n\r\n We are very close on a bespectacled eye. It stares at us and\r\n then looks down.\r\n\r\n                     GENETIC DOCTOR\r\n                  (off)\r\n           See here. This is what you need to\r\n           look for.\r\n\r\n Cut to the object in the Genetic Doctors hand; it is like an\r\n x-ray, yet the image looks remarkably like a DNA profile.\r\n\r\n                     GENETIC DOCTOR\r\n                  (continuing; off)\r\n           A genetic mutation, we all carry\r\n           it. But we now know a virus\r\n           activates it.\r\n                                                                3\r\n\r\nWe reveal the genetic Doctor, sitting at his desk, smoking a\r\ncigarette. The surgery and the clothes suggest the year, yet\r\nthere are small things that are different, not what you'd\r\nexpect to be around at this time. Standing next to him in the\r\ndusty haze of the room is a younger doctor; an apprentice who\r\nlooks attentive.\r\n\r\n                   GENETIC DOCTOR\r\n                (continuing)\r\n         This Virus plays some unknown role\r\n         in the birth the Brothers. Of\r\n         course the mutation occurs very\r\n         rarely these days. And only in\r\n         males.\r\n\r\nThe apprentice nods and then looks up. There is someone else\r\nin the room. A woman - who we now see is pregnant. There is\r\nsomething about her that suggests more a prisoner or\r\npsychiatric patient than a normal pregnant mother.\r\n\r\n                   GENETIC DOCTOR\r\n                (continuing)\r\n         Strange isn't?\r\n\r\n                    Apprentice   DOCTOR\r\n         Strange?\r\n\r\n                   GENETIC DOCTOR\r\n         That God would choose such humble\r\n         vehicle for a miracle. The mothers\r\n         invariably come from the slums, we\r\n         don't know why.\r\n                (to the woman)\r\n         This is your 7th isn't it?\r\n                                                                 4\r\n\r\n\r\n\r\n\r\nWe see the woman; she's like a hollow person, hardly aware of\r\nwhere she is. The Doctor shuffles papers. Finds what he wants.\r\n\r\n                   GENETIC DOCTOR\r\n                (continuing)\r\n         Yes, her first was successful, a\r\n         Brother was born. Thereafter\r\n         variously malformed offspring. We\r\n         can only hope this one will be\r\n         different.\r\n                (to woman)\r\n         You'll have to try harder this\r\n         time.\r\n\r\nThe woman now looks up. And tentatively speaks.\r\n\r\n                     WOMAN IN THE SURGURY\r\n         Please...\r\n\r\n                   GENETIC DOCTOR\r\n         What is it?\r\n\r\n                   WOMAN IN THE SURGURY\r\n         Please... I want to keep my baby.\r\n         They always take my babies away.\r\n\r\n                   GENETIC DOCTOR\r\n         Don't be stupid woman!\r\n\r\nThe woman drops her eyes. We see the Apprentice Doctor,\r\nalmost pitying the poor woman.\r\n\r\n                   Apprentice DOCTOR\r\n                (to woman)\r\n         You won't have to worry. The\r\n         Brotherhood will take him...\r\n\r\nWe are closer on the woman now. Tears begin to glisten in her\r\neyes as we drift closer to her.\r\n\r\n                   Apprentice DOCTOR\r\n                (continuing; off)\r\n         ...raise him in the church, teach\r\n         him. He's special. You should be\r\n         proud. It's a blessing really,\r\n         he'll want for nothing. Not like\r\n         the rest of us?\r\n\r\nWe track in closer, closer, to the woman, then continue,\r\nright into her eye, through the fluid, to see the room\r\nreflected upside down at the back of the retina. This\r\ndissolves to an upside view of...\r\n                                                                  5\r\n\r\n\r\n\r\n\r\n3 INT: HOSPITAL, OPERATION ROOM - DAY                         3\r\n\r\n POV, baby's view, in an operating theatre.\r\n\r\n Cut to\r\n\r\n The woman we saw earlier with the Genetic Doctor; she has\r\n just given birth. The baby is placed on linen blankets and\r\n cleaned by a nurse.\r\n\r\n A man now enters the operating theatre; we can tell the\r\n Doctor is uneasy. The man is dressed in a perfectly cut suit.\r\n He does not wear a surgical mask. His eyes are a piercingly\r\n clear light gray. He enters with two other men who look\r\n similar to him. By his side there is also a pristine boy;\r\n perhaps 8 years old, the same piercing eyes. They both\r\n approach the baby. The man stares serenely at the baby, all\r\n bloody, lying on blankets.\r\n\r\n                     AUGUSTUS\r\n           This is your brother Silus. You\r\n           will teach him.\r\n\r\n The little boy then shares a glance with the woman who has\r\n just given birth. She seems to recognize the boy.\r\n\r\n                     SILUS AS A BOY\r\n           Is that my mother?\r\n\r\n                     AUGUSTUS\r\n           No, not any more.\r\n\r\n Augustus then leans forward and gently opens the baby's mouth.\r\n\r\n We see the baby close. In the otherwise baby-like mouth we\r\n see something strange. There are two tiny fangs protruding\r\n from the otherwise smooth gums.\r\n\r\n We see Augustus smile. In his mouth too, we see two perfectly\r\n pointed teeth.\r\n\r\n                     AUGUSTUS\r\n                  (continuing)\r\n           Welcome to the world little\r\n           Brother.\r\n\r\n Cut to\r\n\r\n We end close on the baby; its piercing eyes.\r\n\r\n                                         DISSOLVE TO:\r\n                                                                   6\r\n\r\n\r\n4 PRODUCTION TITLE: ON BLACK.                                 4\r\n\r\n                         Perfect Creature\r\n\r\n  The title fades. Then another title appears.\r\n\r\n\r\n               Queen's Imperial Winter Residence,\r\n\r\n                        The Pacific Colony\r\n\r\n                        100 years later\r\n\r\n                                             DISSOLVE TO:\r\n\r\n\r\n4A EXT: CITYSCAPE - NIGHT                                     4A\r\n\r\n  We see a city, seething with smoke from coal fires, steam\r\n  from engines, alien distorted Victorian spires are\r\n  silhouetted against the moody, moonlit sky which is literally\r\n  filled with dirigibles and strange flying machines that seem\r\n  Victorian, of the industrial revolution, but that are also\r\n  strangely futuristic. It is 1969, but not our 1969.\r\n\r\n\r\n5 EXT: STREET - NIGHT                                         5\r\n\r\n  A street. The look - of the film and the night - is silver,\r\n  almost metallic moonlit skies. A hazy mist hangs in the air.\r\n  Wet, steel pools of water on the dark footpath where a man\r\n  stands. He stares up at a zeppelin passing overhead, its\r\n  shadow obscuring him briefly until it passes away. Then we\r\n  see him.\r\n\r\n  The man is handsome, in a perfectly cut long wool jacket;\r\n  dark gray. He wears perfectly shiny black shoes and we can\r\n  see the surrounding street reflected in them; Victorian,\r\n  Gothic buildings. This man is Silus. He surveys the street.\r\n  While the houses are beautiful, they're run down.\r\n\r\n  Silus - his eyes are the purest light gray you have ever\r\n  seen - takes a long long inhale through his nose, his eyes\r\n  closing briefly as if trying to sense/smell something. He\r\n  stops the breath and opens his eyes. They are clear, full of\r\n  purpose.\r\n\r\n  He bends down to the footpath, runs his hand along its\r\n  surface, almost caressing it. He closes his eyes. The camera\r\n  moves in, to end close on Silus' ear. As this happens the\r\n  soundtrack - all the noises in the night - become amplified.\r\n  We see Silus' face, see him concentrating intently. We hear\r\n  several individual noises. First a very quiet pitter patter.\r\n\r\n  Cut to\r\n\r\n  A cat, stealthily moving between some thorny rose bushes.\r\n\r\n  Cut to\r\n                                                                7\r\n\r\n\r\n\r\n\r\nSilus again; concentrating even more. Now the distant sound\r\nof trickling water.\r\n\r\nCut to\r\n\r\nA drain pipe, leaking.\r\n\r\nCut to\r\n\r\nSilus once more. This time we can hear \"plop, plop, plop.\"\r\n\r\nCut to\r\n\r\nA pool of water. Then \"plop\" as a drop hits it. The drop is\r\nnot water. The drop is a red liquid, thick, now dispersing in\r\nthe water. And another drop, \"plop.\" High speed CRANE UP from\r\n\r\nthis pool, up up the side of a building to end on a FACE in\r\nthe shadows. We can see reflective, gleaming eyes. And a\r\nmouth, with blood dripping from it.\r\n\r\nCut to\r\n\r\nSilus again. His eyes flicking open; we see the footpath\r\nreflected in those perfect light gray eyes.\r\n\r\nMusic - brooding, ancient - begins to hum as Silus slowly\r\nrises, as if his limbs have the power to make him float, so\r\nperfect and powerful are they. A small smile has appeared on\r\nhis lips; it is the smile of a man who knows that something\r\nvery dark, something very dangerous, is close by.\r\n\r\nSlowly his hand slips into his jacket. He holds it there,\r\nwatching, surveying the street immediately ahead of him for\r\nthe slightest movement. He sees it. On the wall of an old\r\nGeorgian Mansion across the road, a shape on the side of the\r\nwall, almost imperceptible, hidden in the shadows and\r\nbrickwork. A CREATURE on the side of the wall.\r\n\r\nSilus begins to move forward now, everything in perfect\r\nshining silver slow motion. As he moves forward he pulls a\r\ngun from his jacket - it is silver, organic and glass, art\r\nnouveaux styling - and points it ahead of him as he glides\r\nforward.\r\n\r\nThe creature on the wall senses the movement coming towards\r\nit, moves a little and then, like a spider, scrambles along\r\nthe side of the wall, heading away from us.\r\n\r\nSilus fires. A bullet of silver explodes from the gun, seems\r\nalmost to hang in the air for a moment, reflecting the moon\r\nabove, before hurtling at high speed towards its target.\r\n\r\nThe shell explodes the wall next to the creature, who stops\r\nsuddenly in the light so that we can see it.\r\n                                                                 8\r\n\r\n\r\n\r\n A man. With reflective animal eyes and blood on his purple\r\n lips. And teeth; the teeth of a vampire. This creature\r\n immediately dives from the wall to the ground, just avoiding\r\n another two bullets that crash into the wall.\r\n\r\n LA as the man falls directly towards the camera.\r\n\r\n Silus now rushes forward, holding his gun out in front of\r\n him; he moves forward gracefully. He can see the man\r\n skillfully climbing up an adjacent derelict building. Silus\r\n tries to follow but his way is blocked by wire and fencing.\r\n He raises his gun towards the man once more, but he is gone.\r\n\r\n Close on Silus' enigmatic face. Those eyes. And in his mouth,\r\n two perfectly pointed fangs.\r\n\r\n Cut to\r\n\r\n\r\n6 EXT: CAFE - NIGHT                                          6\r\n\r\n We are outside a cafe; the cafe is a warm glow against the\r\n cold night. We see past the fine falling rain - through the\r\n large glass window that has swirling silver art nouveaux\r\n designs lacing across it - to a table inside, by the window,\r\n where two pristinely dressed men sit.\r\n\r\n Cut to\r\n\r\n\r\n7 INT: CAFE - NIGHT                                          7\r\n\r\n We are inside. Closer on the two men. One is SILUS. The other\r\n man is AUGUSTUS; the man we saw in the operation theatre\r\n before. Augustus has hardly aged at all.\r\n\r\n                       AUGUSTUS\r\n           The girl?\r\n\r\n We see Silus. He remembers.\r\n\r\n Cut to\r\n\r\n\r\n8 INT: ROOM, FLASHBACK - NIGHT                               8\r\n\r\n Flashback from Silus' memory; a dead girl on a bed, blood\r\n splattered across her pillow.\r\n\r\n Cut to\r\n                                                                  9\r\n\r\n\r\n\r\n\r\n9 INT: CAFE - NIGHT                                           9\r\n\r\n Silus' face. Pull out to reveal we're back in the café.\r\n\r\n                      SILUS\r\n\r\n           It is taken care of.\r\n\r\n                     AUGUSTUS\r\n           This is good.\r\n\r\n                     SILUS\r\n           Augustus. We failed this girl. We\r\n           asked her to help us catch him,\r\n           and then we failed her.\r\n\r\n                     AUGUSTUS\r\n           Yes. But her death served a\r\n           greater good. Every trap needs\r\n           bait.\r\n\r\n Augustus lifts a beautifully designed glass and silver pipe\r\n from the onyx table at which they sit, then settles back into\r\n a fine hardwood chair. The chair's swirling, delicate back\r\n creeks as he takes a puff on the pipe.\r\n\r\n                     AUGUSTUS\r\n                  (continuing)\r\n           Are you sure you won't join me?\r\n\r\n Silus shakes his head, no. The opium in the pipe crackles.\r\n\r\n                     SILUS\r\n           Perhaps this is beyond us. Perhaps\r\n           we should inform the authorities.\r\n           The human beings.\r\n\r\n Augustus places the pipe down, blows a smoke ring as a\r\n Chinese woman, dressed in a sarong, brings over two finely\r\n cut crystal glasses and sets them before the men, then\r\n leaves. Silus now lifts the glass and we see what it\r\n contains. Blood; dark and red and viscous. Silus takes a sip,\r\n then looks over to the bar.\r\n\r\n There is a young woman there, sitting at the bar, being\r\n treated with great care by several of the elegantly dressed\r\n patrons; the young woman laughs, enjoying the attention.\r\n Tubes run from the young woman's arms. These tubes carry her\r\n blood into a conch shaped glass bowl. We see the Chinese\r\n waitress fill another glass from the bowl.\r\n\r\n Silus watches, blood slightly present on his ashen lips. And\r\n we see two perfectly pointed fangs hanging in his mouth.\r\n\r\n                     AUGUSTUS\r\n           For now the Brothers feel we\r\n           should deal with this ourselves.\r\n                                                                  10\r\n\r\n\r\n\r\n\r\n                      SILUS\r\n            If they find out we are covering\r\n            up these deaths...\r\n\r\n                      AUGUSTUS\r\n            Which is why you must find him.\r\n            Silus.\r\n\r\n  Silus now turns to Augustus, still looking unconvinced.\r\n\r\n                      AUGUSTUS\r\n                   (continuing)\r\n            For centuries we Brothers have\r\n            served mankind and them us. The\r\n            great union. But remember your\r\n            history. 300 years ago when our\r\n            kind were first born into this\r\n            world they burnt our children as\r\n            monsters. They had no notion of\r\n            evolution. In another world we\r\n            might all have been slaughtered,\r\n            only to be remembered in myth,\r\n            monsters to frighten the young or\r\n            a puzzle for anthropologists. We\r\n            must refuse to let one aberrant\r\n            individual destroy the balance\r\n            between the two races. The old\r\n            prejudices are still there. Human\r\n            beings are paranoid creatures by\r\n            nature.\r\n\r\n                      SILUS\r\n            Perhaps they have good reason.\r\n\r\n                      AUGUSTUS\r\n            Silus. Simply concern yourself\r\n            with finding Edgar. Find your\r\n            Brother so that we can help him.\r\n            Before he kills again.\r\n\r\n  Cut to\r\n\r\n\r\n10 EXT: JAMESTOWN SLUM, STREET - DAY                        10\r\n\r\n  Close up of a NEWSPAPER. On it we see a banner headline.\r\n  \"Influenza Vaccine Shortages lead to Black Market Trade.\" We\r\n  pull out to reveal the paper is lying on a foot path. Wind\r\n  blows the newspaper out of shot and we tilt up to the street.\r\n\r\n  The street is wet, glistening. The rain, rain rain rain. The\r\n  Edwardian and Victorian buildings of the street might seem\r\n  beautiful, but they are not. They are largely derelict. We\r\n  see a woman standing in a doorway out of the rain.\r\n                                                                    11\r\n\r\n\r\n\r\n\r\n  She is wrapped in a black plastic jacket that she pulls about\r\n  her. A man approaches her.\r\n\r\n                      JONES\r\n            Everyone's ready Lilly.\r\n\r\n                      LILLY\r\n            About time.\r\n\r\n  They both move to one of the tall buildings; a four story,\r\n  ancient tenement that looks empty, almost derelict.\r\n\r\n  They quietly move up the steps of the place and then pause.\r\n  There is the bleep from a strange looking valve powered\r\n  Walkie Talkie; hereafter called an RT.\r\n\r\n                      LILLY\r\n                   (continuing)\r\n            On three gents. One, two...\r\n\r\n\r\n11 INT: JAMESTOWN SLUM, TENEMENT, HALLWAY - DAY                11\r\n\r\n  CRASH CUT to the door of the building swinging open wildly,\r\n  a hand held camera on the shoulder of Lilly and Jones.\r\n\r\n  A large, grubby looking woman stands in a long, grim hallway,\r\n  mop in hand. At the far end of the hall another door\r\n  disconnects from its hinges and collapses inwards, two men\r\n  appearing out of the rain.\r\n\r\n                      JONES\r\n                   (to the woman)\r\n            Don't you move!\r\n\r\n  We see a gun in Jones' hand as he moves towards the woman,\r\n  who has her hands up and is getting down on her knees.\r\n\r\n  The camera then pans wildly, left and right. Then Lilly's\r\n  foot kicks in a door to our right, revealing a dank office\r\n  and a man, half naked, reaching for a gun. A woman is lying\r\n  on a cot and she's screaming. She is instantly recognizable\r\n  as a prostitute.\r\n\r\n                      LILLY\r\n                   (to the slum landlord)\r\n            Don't you dare.\r\n\r\n  From this POV we see Lilly's hand pointing a gun at the SLUM\r\n  LANDLORD, who is now slowly easing back into the scummy\r\n  office.\r\n\r\n                        LILLY\r\n                     (continuing)\r\n            Jones!\r\n                                                                   12\r\n\r\n\r\n\r\n\r\n  We now finally cut to see Lilly. She is around 25; an\r\n  intelligent, handsome 25. The man Jones appears at her\r\n  shoulder, leering. Jones is the type of guy you just know\r\n  will go to seed at 40. But that's still 10 years away. Jones\r\n  stares at the Slum Landlord who is trying to cover himself.\r\n\r\n                      JONES\r\n            God help us. What an appalling\r\n            sight.\r\n\r\n\r\n12 INT: JAMESTOWN SLUM, TENEMENT, HALLWAY - LATER             12\r\n\r\n  The hallway again. The other two men we saw entering at the\r\n  beginning are talking to the woman with the mop. One of the\r\n  men is taking notes.\r\n\r\n  We pan to the office, to see Lilly and Jones standing before\r\n  the Slum Landlord, who is now wrapped in a towel and sitting\r\n  in a chair.\r\n\r\n                      SLUM LANDLORD\r\n            I don't know nothing about it. I\r\n            give 'em out. Make sure everyone\r\n            gets 'em.\r\n\r\n                      JONES\r\n            That's a lie! We know you've been\r\n            trading influenza vaccine in the\r\n            workhouses!\r\n\r\n  Another man now approaches Lilly.\r\n\r\n                      FRANK\r\n            Lil'. I think you should see this.\r\n\r\n\r\n13 INT: JAMESTOWN SLUM, TENEMENT, HALLWAY - CONTINUING        13\r\n\r\n  Halfway down the hall there is a door, Frank opens it\r\n  displaying a set of stairs leading down.\r\n\r\n                      FRANK\r\n            I'd use the mask if I were you.\r\n\r\n  Lilly pulls a dark surgical-type mask over her face, then\r\n  slowly moves down the steps into the oblivion below.\r\n\r\n\r\n14 INT: JAMESTOWN SLUM, TENEMENT BASEMENT - CONTINUING        14\r\n\r\n  Cut between Lilly's POV and her face, her eyes glimmering in\r\n  the sub-light as she moves down the stairs very carefully.\r\n                                                                    13\r\n\r\n\r\n\r\n\r\n  And finally the horror is revealed. In this basement there\r\n  are 10 or 12 people, lying on the floor. Most of them are\r\n  silent, but a couple moan. One, a woman, pleads to Lilly.\r\n\r\n                      WOMAN IN THE BASEMENT\r\n            Help me. Please help.\r\n\r\n  The woman extends her arm. It is covered in sweat; grimy. The\r\n  glands at the side of the woman's neck are distended and\r\n  swollen, her eyes bloodshot.\r\n\r\n                      WOMAN IN THE BASEMENT\r\n                   (continuing)\r\n            Please. I'm sick. Please.\r\n\r\n  The room is a version of hell. Lilly's eyes glisten.\r\n\r\n  Cut to\r\n\r\n\r\n15 INT: JAMESTOWN SLUM, TENEMENT OFFICE - CONTINUING           15\r\n\r\n  Jones has the Slum Landlord by the throat.\r\n\r\n                      JONES\r\n            You're a fucking liar!\r\n\r\n                      SLUM LANDLORD\r\n            No, no, I swear it, I gave 'em\r\n            their boosters, both of 'em. I'm\r\n            a responsible landlord, I swear to\r\n            god. There must've been something\r\n            wrong with them vaccines.\r\n\r\n  Lilly stares at the Slum Landlord; shock in her face, and\r\n  anger.\r\n\r\n                      JONES\r\n            This is a civil health violation!\r\n            You're going to the hell house for\r\n            this. You can forget lovely Doris\r\n            here where you're going.\r\n\r\n  We see the woman who was screaming before, the prostitute;\r\n  she makes an obscene gesture at Jones. As this is going on\r\n  Frank and the other man we've seen are tearing the place\r\n  apart, looking for something. They don't find it and Frank's\r\n  look tells Lilly so.\r\n\r\n  Lilly's face is a mask. She is watching the Slum Landlord\r\n  very carefully. He keeps looking down; strangely, nervously.\r\n                                                                14\r\n\r\n\r\n\r\n\r\n                   SLUM LANDLORD\r\n         I don't know what you're on about.\r\n         I've done nothing, I swear to god,\r\n         I've done nothing.\r\n\r\nLilly lets her eyes drift down, all the way down to the chair\r\nlegs, which rock unevenly on the floor. Lilly is staring at\r\nthe scratched, worn floor boards which MOVE.\r\n\r\nCut to\r\n\r\nFrank, prizing back the floor boards. Jones restrains the\r\nSlum Landlord. Lilly watches. Frank pulls the floor boards\r\naway easily. We see that hidden in the floor cavity are\r\npackets of something. Frank pulls them out.\r\n\r\nRips one of the plastic bags open. In it are packets with the\r\nwords \"Jamestown Borough - Civilian Influenza Vaccination.\"\r\nFrank holds it up for Lilly to see.\r\n\r\nThe Slum Landlord is now looking three ways at once.\r\n\r\nLilly slowly begins to approach the Slum Landlord.\r\n\r\n                   LILLY\r\n         It is my pleasure to inform you\r\n         that you are under arrest for\r\n         trafficking influenza vaccine.\r\n\r\n                   SLUM LANDLORD\r\n         I want my lawyer.\r\n\r\n                   LILLY\r\n         This is a violation of the 12/10\r\n         health act, whereby you have\r\n         withheld borough sponsored\r\n         vaccines from your tenants.\r\n\r\n                   SLUM LANDLORD\r\n         I want a lawyer!\r\n\r\n                   LILLY\r\n         Anything you say will be held\r\n         against you as evidence and, by\r\n         endangering the public good, you\r\n         are not entitled to a lawyer.\r\n\r\nThe Slum Landlord just stares at her.\r\n\r\n                   SLUM LANDLORD\r\n         Fuck you then.\r\n\r\nLilly smiles grimly.\r\n                                                                    15\r\n\r\n\r\n\r\n\r\n                       LILLY\r\n             There's only one other thing.\r\n\r\n  Lilly gives the Slum Landlord one almighty slap across the\r\n  face that stuns him. Then Jones grabs the Slum Landlord and\r\n  drags him off, but we stay on Lilly. Her face. She stoops and\r\n  lifts something from the landlords desk. A public health\r\n  flier saying \"Fight Influenza. Ask your landlord for your\r\n  free vaccine now.\" Then from the corner of the room, the\r\n  prostitute pipes up, impatiently waving a cigarette at Lilly.\r\n\r\n                       PROSTITUTE\r\n             Oi! How about me? He promised me\r\n             some of that. I earned it.\r\n\r\n  Cut to\r\n\r\n\r\n16 OMITTED                                                     16\r\n\r\n\r\n17 INT: POLICE CAR - TWILIGHT                                  17\r\n\r\n  Jones is in front, Frank is driving. The car has come to a\r\n  lurching halt. Some kind of cart is blocking the road.\r\n\r\n                       FRANK\r\n                    (hitting the horn)\r\n             Come one!\r\n\r\n  Jones is eating some kind of pie that is an affront to\r\n  culinary art.\r\n\r\n                       JONES\r\n             Lil', you want some?\r\n\r\n  Ensconced in the back Lilly shakes her head, no.\r\n\r\n                       LILLY\r\n             Smells terrible.\r\n\r\n  She is watching the patterns of street lights that play and\r\n  flow over the wet windows of the car. Jones shrugs.\r\n\r\n                       JONES\r\n             I'm not letting that scum put me\r\n             off my food. That'd be like a\r\n             moral victory.\r\n\r\n                       LILLY\r\n             I'll get out here.\r\n\r\n                         FRANK\r\n             You sure?\r\n                                                                      16\r\n\r\n\r\n\r\n\r\n   We see Lilly get out. Frank and Jones share a look.\r\n\r\n                       FRANK\r\n                    (continuing)\r\n             What's up with her?\r\n\r\n   Jones watches Lilly move off; something like compassion\r\n   crosses his features.\r\n\r\n                       FRANK\r\n                    (continuing)\r\n             Jones? Is she alright?\r\n\r\n                       JONES\r\n             Yeah. Lilly's kid. It died of the\r\n             influenza, didn't it.\r\n\r\n                       FRANK\r\n             She's never said anything about a\r\n             kid.\r\n\r\n                       JONES\r\n             No. She never says anything.\r\n\r\n   Jones stares after Lilly, then starts chomping into his food.\r\n\r\n\r\n18 EXT: SUBWAY STATION - CONTINUING                             18\r\n\r\n   The police car pulls out leaving Lilly outside the subway\r\n   station. Lilly looks exhausted, breathes in deeply. Above,\r\n   power lines blow in the wind and rain and make a clacking\r\n   sound. She moves off and we crane up to see the seething\r\n   smoky city beyond.\r\n\r\n\r\n19 OMITTED                                                      19\r\n\r\n\r\n20 INT: LILLY'S APARTMENT - NIGHT                               20\r\n\r\n   Lilly enters her apartment. It's nice; not opulent, but a\r\n   haven of sorts.\r\n\r\n   She stands for a moment in the empty hallway. We see a hall,\r\n   several doors run off it.\r\n\r\n\r\n20A INT: LILLY'S APARTMENT, CHILDS BEDROOM - CONTINUING         20A\r\n\r\n   Lilly approaches a room and we see inside it. It is empty\r\n   apart from a stripped bed and some boxes.\r\n\r\n   Lilly flips the lid on one of the boxes. She picks up a toy;\r\n   a pink fairy princess with wings, the paint on its face worn.\r\n                                                                    17\r\n\r\n\r\n\r\n\r\n  Lilly winds a key and the wings of the doll flutter,\r\n  accompanied by the whining sound of the internal mechanics.\r\n\r\n  We see Lilly's face as she stares at the doll. Emotion fights\r\n  to claw its way out from under her skin, but she doesn't let\r\n  it.\r\n\r\n  Then in the distance we hear a child's cries. It almost\r\n  sounds like memories wafting through the air, but the\r\n  stamping of feet from the apartment above makes it plain that\r\n  the noises come from there; the sound of children playing.\r\n\r\n  Cut to\r\n\r\n\r\n21 INT: LILLY'S APARTMENT, BEDROOM - NIGHT                     21\r\n\r\n  Lilly enters her bedroom. The place is a mess. She sits on\r\n  the bed. She picks up a framed photo which sits on a\r\n  sideboard next to the bed. It shows Lilly, a man - Lilly's\r\n  age - and a child of 5 years who looks a lot like Lilly. She\r\n  stares at the child. We hear the sound of rain pounding\r\n  against the window of the bedroom.\r\n\r\n\r\n22 EXT: LILLY'S APARTMENT, BEDROOM - NIGHT                     22\r\n\r\n  Pull out to reveal the exterior window. We can see through\r\n  the window into Lilly's apartment again, see Lilly lying\r\n  down, hugging the photo. The rain has become a light mist.\r\n\r\n\r\n23 EXT: JAMESTOWN SLUM, STREET - NIGHT                         23\r\n\r\n  We are close on a poster. It shows a perfect face, serenely\r\n  beaming out; it could be Silus or Augustus, except this man\r\n  is dressed in religious regalia, like a priest. The poster\r\n  says \"The Brotherhood loves you. You are divine.\" We begin to\r\n  crane off the poster which is revealed to be stuck on a lamp\r\n  post. The street is seething, the slums of Jamestown.\r\n\r\n  A young boy, perhaps seven; spiked up hair, face\r\n  covered in grime, grime from dragging himself up in this\r\n  hellish place. He carries a bag filled with the detritus he's\r\n  picked from the rubbish bins of the rich. He wears a\r\n  distinctive red t-shirt that is several sizes too big. He\r\n  moves along the street, avoiding a disinterested passersby.\r\n  As he passes an alley he hears something. An animal-like\r\n  growl. He stops.\r\n\r\n  Down the alley he can see two figures. One is a male. He is\r\n  clutching another clothed figure; female.\r\n\r\n                      KID\r\n            Hey?! Hey!\r\n                                                                    18\r\n\r\n\r\n\r\n\r\n  At that instant the man turns to the boy. There, half seen in\r\n  the slick shadows, the most piercing eyes, a bloody mouth,\r\n  with fangs, hissing. The creature drops the woman and scales\r\n  the sheer wall of the alleyway; clutching various handholds,\r\n  up four flights, then gone.\r\n\r\n  The kid, frightened, now makes to run off but bangs into a\r\n  passerby. The man grabs the kid roughly.\r\n\r\n                      MAN IN THE STREET\r\n            Where are you going in such a\r\n            hurry my little ruffian? Pilfering\r\n            by the look of you?\r\n\r\n  The kid struggles and the Man now sees the shape of the woman\r\n  in the alleyway, slumped to the ground.\r\n\r\n                      MAN IN THE STREET\r\n                   (continuing)\r\n            What's going on here? What'd you\r\n            do to her?\r\n\r\n                      KID\r\n            Don't, I didn't do nothing. It was\r\n            a Brother. It was a Brother did it.\r\n\r\n  The man moves forward, dragging the kid. And he sees the\r\n  woman there, deathly white in the alley. Dead eyes staring.\r\n\r\n                      MAN IN THE STREET\r\n            Oh dear god...\r\n\r\n  Cut to\r\n\r\n\r\n24 INT: NATURAL HISTORY MUSEUM - DAY                           24\r\n\r\n  We track past a sign that says \"Museum of Spiritual Selection\r\n  and Alchemistry.\" In the distance we can see a group of\r\n  people in the hazy light.\r\n\r\n  Cut to\r\n\r\n  Augustus - the man we saw with Silus earlier - sitting on a\r\n  chair surrounded by various objects. At his feet are a gaggle\r\n  of school children, aged around ten; affluent looking, human.\r\n  Augustus points to a strange, ancient looking glass apparatus.\r\n\r\n                      AUGUSTUS\r\n            300 years ago, with these simple\r\n            instruments, the alchemist\r\n            Guiseppi De Angelo discovered what\r\n            we today call genetic science.\r\n                                                                 19\r\n\r\n\r\n\r\n\r\n                      AUGUSTUS\r\n                   (continuing)\r\n            He deciphered that the Brothers\r\n            were a new race of beings, sent by\r\n            god, to serve and protect you.\r\n\r\n  We see the faces of the children, rapt.\r\n\r\n                      AUGUSTUS\r\n                   (continuing)\r\n            De Angelo formed the church of the\r\n            Brotherhood. He was a great great\r\n            man, but there were others, bad\r\n            men, who took what De Angelo had\r\n            discovered and experimented\r\n            without concern for the results.\r\n            The science of genetics and all\r\n            its power has been banned ever\r\n            since. Who can tell me what came\r\n            from these bad experiments?\r\n\r\n  One child puts his hand up. Behind the child, in the\r\n  distance, Augustus now sees Silus approaching; Silus\r\n  obviously wants to talk to Augustus. Augustus points to the\r\n  child while looking at Silus.\r\n\r\n                      AUGUSTUS\r\n                   (continuing)\r\n            Yes.\r\n\r\n                      CHILD\r\n            All the bad things. Like bad germs\r\n            and flu.\r\n\r\n  Augustus nods, watching Silus' ominous expression.\r\n\r\n                      AUGUSTUS\r\n            Yes. That's right.\r\n\r\n  Augustus looks at the child and tries to smile.\r\n\r\n                      AUGUSTUS\r\n                   (continuing)\r\n            All the bad things.\r\n\r\n\r\n25 EXT: SLUM, STREET - DAY                                  25\r\n\r\n  The streets are wet. High above several large Zeppelins plod\r\n  across the sky. We crane down to street level to find a\r\n  police car pulling up through the steam. Lilly gets out,\r\n  Jones beside her, wolfing down another bun.\r\n                                                                    20\r\n\r\n\r\n\r\n\r\n  There are cops everywhere. An alleyway is cordoned off. The\r\n  dwellers of the slum have floated up and are baying like\r\n  wolves, hassling the cops; some yell obscenities, generally\r\n  along the lines of \"where's the police when you need them?\"\r\n  Jones stares at the people.\r\n\r\n                      JONES\r\n            Someone should flatten this\r\n            cesspool and start again.\r\n\r\n  Lilly and Jones move towards the police cordon. Immediately\r\n  a reporter accosts them.\r\n\r\n                      STREET REPORTER\r\n            Marm? The Tribune. Do you have any\r\n            comments on the death?\r\n\r\n                      LILLY\r\n            No.\r\n\r\n                      STREET REPORTER\r\n            They're saying it was a Brother,\r\n            is that true?\r\n\r\n  Lilly stares at the reporter, pauses for thought. She\r\n  whistles to one of the cops nearby, who then approaches.\r\n\r\n                      LILLY\r\n            Arrest her.\r\n\r\n  Jones and Lilly push past as the reporter protests at being\r\n  manhandled.\r\n\r\n                      LILLY\r\n                   (continuing; to Jones)\r\n            Find any witnesses and shut them\r\n            up.\r\n\r\n  Jones nods and moves over to a policeman guarding the alley.\r\n  Lilly ducks under the crime scene tape, moving into the alley.\r\n\r\n\r\n26 INT: JAMESTOWN SLUM, ALLEYWAY - DAY                         26\r\n\r\n  The alleyway is full of forensics personnel. Lilly moves\r\n  deeper into the alleyway. We see her POV moving forward,\r\n  finally revealing the body of the young woman who is\r\n  surrounded by various forensics staff. Lilly talks to one.\r\n\r\n                      LILLY\r\n            Can I step in?\r\n\r\n                      FORENSIC GUY\r\n            With the traffic. What's it matter.\r\n                                                               21\r\n\r\n\r\n\r\n\r\nLilly moves forward. She can now see the woman more clearly.\r\nThe woman is obviously dead; her pale white skin like wet\r\nshining alabaster in the dark alley. Flashes from\r\nphotographic machines light the scene, almost blinding Lilly\r\nand briefly revealing the true horror of the scene.\r\n\r\nLilly kneels and carefully begins to examine the body.\r\n\r\nAnother man now walks up and kneels next to Lilly; young,\r\ngood looking, obviously takes pride in himself.\r\n\r\n                     DOMINIC\r\n         Lil'.\r\n\r\n                   LILLY\r\n         Hello Dominic.\r\n\r\n                   DOMINIC\r\n         Have you seen it?\r\n\r\nDominic bends down and moves the dead woman's head,\r\ndisplaying the side of her neck. A bite has torn the skin on\r\nthe side of her neck. The wound extends down, the carotid\r\nartery sliced in two.\r\n\r\n                   DOMINIC\r\n                (continuing)\r\n         It's a bite. If you know what I\r\n         mean?\r\n\r\nLilly nods, then looks down at the woman's dead, cockeyed\r\nstare. Lilly closes the woman's eyes.\r\n\r\n                   LILLY\r\n         Any identification?\r\n\r\nShe is passed a bloody ID. Lilly stares at it.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         Tanya Garfield.\r\n\r\nJones now arrives.\r\n\r\n                   JONES\r\n                (to forensics team)\r\n         Where do you get a cup of tea\r\n         around here?\r\n\r\nNo one answers. Jones shrugs.\r\n\r\n                   JONES\r\n                (continuing)\r\n         There's a kid who saw it, down\r\n         there.\r\n                                                               22\r\n\r\n\r\n\r\n\r\nLilly sees the red shirted street urchin in the distance\r\nbeing talked to by two uniformed policemen.\r\n\r\n                   JONES\r\n                (continuing)\r\n         Says it was a Brother. And they've\r\n         got another fellow, that's all who\r\n         saw it.\r\n\r\nLilly nods.\r\n\r\n                   LILLY\r\n         Alright, we'll close this down\r\n         gents. None of you are to say a\r\n         word, not even to your old mother.\r\n\r\nAll the police officers stare at her; they know what she\r\nmeans alright.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         Jones. Make sure.\r\n\r\nJones shrugs and nods. Lilly gets up and moves towards the\r\nstreet kid who is being talked to by two burly, grumpy\r\npolicemen. The boy is shaking.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         He saw what happened?\r\n\r\n                   POLICEMAN 1\r\n         Now he wont talk. Didn't see\r\n         anything.\r\n\r\nLilly looks at the boy. So young.\r\n\r\n                   LILLY\r\n         What's your name?\r\n\r\nThe kid doesn't answer and gets a whack around the ears from\r\none of the policemen.\r\n\r\n                   LILLY\r\n                (continuing; to the\r\n                 policeman)\r\n         Stop that.\r\n\r\nLilly stares at the kid, as if the way he looks has keyed a\r\nmemory in her. She squats and looks him straight in the eye.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         What's your name then?\r\n                                                               23\r\n\r\n\r\n\r\n\r\n                   KID\r\n                (nervous)\r\n         Albert.\r\n\r\n                   LILLY\r\n         You live around here?\r\n\r\nThe kid looks nervous. Lilly moves some of the bedraggled\r\nhair out of the kid's eyes.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         I grew up 3 streets from here.\r\n         Matheson Lane. The Skrummers\r\n         Workhouse.\r\n\r\n                   KID\r\n                (surprised)\r\n         You did?\r\n\r\n                   LILLY\r\n         Or should I say, I crawled out of\r\n         here.\r\n\r\nThe kid smiles. Lilly focuses on him now.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         No one else will do anything about\r\n         this, you know? They just think\r\n         this is a slum. No one really\r\n         cares what happens to the people\r\n         here. Except for you. And me.\r\n\r\nThe kid stares at her; she's a magician and he's a believer.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         What did you see?\r\n\r\n                   KID\r\n         A man.\r\n\r\n                   LILLY\r\n         What kind of man?\r\n\r\n                   KID\r\n         A Brother.\r\n\r\n                   LILLY\r\n         You're sure it was a Brother?\r\n\r\n                   KID\r\n         He had teeth and everything.\r\n                                                                    24\r\n\r\n\r\n\r\n\r\n                      LILLY\r\n            Where did he go?\r\n\r\n  The kid turns and points to the shear wall of the alley.\r\n\r\n                      KID\r\n            He went straight up there.\r\n\r\n  Lilly stares at the wall.\r\n\r\n                      LILLY\r\n            Alright, you go with these men,\r\n            they'll look after you. I promise.\r\n\r\n  She rises.\r\n\r\n                      LILLY\r\n                   (continuing; to the\r\n                    Policemen)\r\n            Get him to describe it all. And\r\n            keep him away from everyone.\r\n\r\n  The Policemen grunt and begin to lead the kid off.\r\n\r\n                      LILLY\r\n                   (continuing; to the\r\n                    Policemen)\r\n            And get him some food.\r\n\r\n  Jones, now standing next to Lilly, moans.\r\n\r\n                      JONES\r\n            Now they'll all want feeding.\r\n\r\n  Lilly looks at Jones's callous face; she's not amused.\r\n\r\n  Cut to\r\n\r\n\r\n27 EXT: JAMESTOWN SLUM, BUILDING ABOVE ALLEYWAY - CONTINUING   27\r\n\r\n  High angle POV of Lilly and Jones moving off. Someone is\r\n  watching them from the roof above. The POV belongs to Silus,\r\n  who stares down at them. In particular he watches Lilly. We\r\n  see Lilly pause and then look up as if feeling she's watched.\r\n\r\n  We see Lilly's POV of the building above. There is no one\r\n  there.\r\n\r\n  HA of Lilly looking up.\r\n\r\n  Cut to\r\n                                                                   25\r\n\r\n\r\n\r\n\r\n28 INT: POLICE STATION, HOWARD ANDERSON'S OFFICE - LATER      28\r\n\r\n  A device flies toward the camera, sharp needles eject from it\r\n  slamming into skin.\r\n\r\n  Seated at the desk is a harassed, balding man (ANDERSON)of\r\n  about 55. He's just finished vaccinating himself, wincing at\r\n  the needle jabs on the soft skin of his arm. There are many\r\n  other needle marks on his skin.\r\n\r\n                        LILLY\r\n                     (off)\r\n              I've quarantined the neighborhood.\r\n\r\n  Lilly stands before the man's large desk, which is lit by\r\n  only a desk lamp.\r\n\r\n                        LILLY\r\n                     (continuing)\r\n              As far as anyone knows we have a\r\n              new influenza outbreak.\r\n\r\n                        ANDERSON\r\n              What about the telephonic\r\n              companies?\r\n\r\n                        LILLY\r\n              They're cooperating, closing all\r\n              phone lines in and out except\r\n              directly to us.\r\n\r\n  Anderson nods.\r\n\r\n                          ANDERSON\r\n              Sit, sit.\r\n\r\n  She does.\r\n\r\n                        ANDERSON\r\n                     (continuing)\r\n              You've done well Lilly. The\r\n              reporter is more of a problem. We\r\n              have 2 days by law before we have\r\n              to release her. Then it's out.\r\n\r\n  Anderson lays down the medi kit and stares at it as he\r\n  motions for her to sit. She does.\r\n\r\n                        ANDERSON\r\n                     (continuing)\r\n              I hate these things. I'm like a\r\n              pin cushion.\r\n\r\n                        LILLY\r\n              It's better than the alternative,\r\n              sir.\r\n                                                                  26\r\n\r\n\r\n\r\n\r\n  Anderson stares at her; a moment of tension.\r\n\r\n                      ANDERSON\r\n            I need you to stay with this,\r\n            Lilly. You know Jamestown better\r\n            than anyone, how to handle the\r\n            people.\r\n\r\n  Lilly acknowledges the compliment.\r\n\r\n                      ANDERSON\r\n                   (continuing)\r\n            The Brothers have requested to be\r\n            involved with the investigation.\r\n\r\n                      LILLY\r\n            That's nice for them.\r\n\r\n                      ANDERSON\r\n            You have a problem with it?\r\n\r\n                      LILLY\r\n            Not particularly.\r\n\r\n                      ANDERSON\r\n            Good. I think they can help. And\r\n            I don't want someone working on\r\n            this whose got something against\r\n            the Church.\r\n\r\n                      LILLY\r\n            How do you know I don't?\r\n\r\n                      ANDERSON\r\n            Lilly, you're the least prejudiced\r\n            person I know. In fact, you're the\r\n            only one I know. That's important.\r\n            The church is powerful, but more\r\n            than that, people's faith in the\r\n            Brotherhood is about all they've\r\n            got these days. And the government\r\n            knows it. Even the Queen herself\r\n            is involved. This is political.\r\n\r\n  Cut to\r\n\r\n\r\n29 INT: POLICE STATION, COMMUNAL OFFICE - DAY               29\r\n\r\n  Lilly enters, drinking a coffee. She begins to top it up from\r\n  the coffee stand when Jones comes up to her.\r\n\r\n                      JONES\r\n            Lil'. He's here.\r\n                                                                    27\r\n\r\n\r\n\r\n\r\n  Lilly's expression becomes taut. She peers towards her\r\n  office. She can clearly see an exceptionally well dressed man\r\n  in her office with his back to us. It is Silus. A young\r\n  female cop - Steph - is in there and we can see her kissing\r\n  a ring on Silus' hand and Silus placing his hand on her head\r\n  as if blessing her.\r\n\r\n  Steph then exits the office and approaches Lilly and Jones;\r\n  her face is flushed with excitement.\r\n\r\n                      STEPH\r\n            Do you know who he is? That's\r\n            Brother Silus. They say one day he\r\n            will lead the Brotherhood. He's a\r\n            great man.\r\n\r\n                      JONES\r\n            I think I hear choir music.\r\n\r\n  Steph flashes Jones a resentful look.\r\n\r\n                      STEPH\r\n            Do you respect anything?\r\n\r\n                      JONES\r\n            Hey. My old mum goes to church\r\n            four times a week and gives blood.\r\n            She's happy as a lark. Just don't\r\n            expect me to kiss him, that's all\r\n            I'm telling you.\r\n\r\n  Cut to\r\n\r\n\r\n30 INT: POLICE STATION, LILLY'S OFFICE - CONTINUOUS            30\r\n\r\n  Close on the enigmatic ring on Silus' finger.\r\n\r\n  We see Lilly is seated on one side of her desk, Silus on the\r\n  other. Lilly is staring at the ring, then she studies a\r\n  Photostat in front of her. There is a picture of a man, a\r\n  rather perfect looking man.\r\n\r\n                      LILLY\r\n            Senior Brother Edgar... How long\r\n            have you known about this?\r\n\r\n  Silus opposite Lilly, his perfect, serene appearance an\r\n  anathema in the grunge of the Jamestown police station. He\r\n  watches her very carefully, listens to the way her finger\r\n  taps the sheet in front of her, the sound of her chair\r\n  swiveling, all the sounds very acute to him; she has a\r\n  physical ease about her.\r\n                                                                28\r\n\r\n\r\n\r\n\r\n                   SILUS\r\n         A matter of weeks.\r\n\r\nLilly smiles.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         Is there something wrong?\r\n\r\nLilly stops smiling. For the first time she is still.\r\n\r\n                   LILLY\r\n         Yes. Withholding evidence.\r\n         Covering up two murders. And no\r\n         one's worried. If me or one of the\r\n         people in Jamestown did that\r\n         they'd be in the hell house with\r\n         the key thrown away. It seems the\r\n         church is able to do whatever it\r\n         wants.\r\n\r\nSilus nods.\r\n\r\n                   SILUS\r\n         You're right to not like it. It is\r\n         political.\r\n\r\nLilly becomes more interested at this; at the bald honesty of\r\nthe statement.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         We thought we could find Brother\r\n         Edgar ourselves. We were wrong.\r\n         But now any debate is pointless.\r\n\r\nLilly stares at him. There is already something between them\r\neven though they stand on opposite sides of a huge gulf. She\r\nnods, accepting his point.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         The greatest danger is if this\r\n         were to become public knowledge.\r\n\r\n                   LILLY\r\n         Wouldn't want anyone criticizing\r\n         the church I suppose.\r\n\r\n                   SILUS\r\n         It's more than that Captain. This\r\n         is about prejudice, or rather the\r\n         nature of it. As a female surely\r\n         you would understand.\r\n                                                                 29\r\n\r\n\r\n\r\n\r\n                      LILLY\r\n            Really.\r\n\r\n                      SILUS\r\n            How many other Captains in this\r\n            borough are female?\r\n\r\n                      LILLY\r\n            None?\r\n\r\n                      SILUS\r\n            How are your actions judged, the\r\n            same or differently from the men.\r\n\r\n  Lilly stares at Silus; he is an incredible being.\r\n\r\n                      LILLY\r\n            Differently.\r\n\r\n                      SILUS\r\n            Exactly. If a white man kills,\r\n            then he is just a killer. If a\r\n            black man kills, then all black\r\n            men are suspect. That is the\r\n            nature of prejudice. Those who are\r\n            different are grouped together. If\r\n            only one Brother does a bad thing\r\n            then all Brothers are suspect,\r\n            because we are different. And then\r\n            what would this world be like, if\r\n            there was no hope?\r\n\r\n  Lilly nods, acknowledging the truth of it.\r\n\r\n                      LILLY\r\n            Alright then. So what do you\r\n            suggest?\r\n\r\n                      SILUS\r\n            First, there is something you\r\n            should hear.\r\n\r\n  Cut to\r\n\r\n\r\n31 INT: POLICE STATION, BRIEFING ROOM - LATER               31\r\n\r\n  Scummy, large briefing room. There are seven cops in here,\r\n  perched on desks and chairs. Jones, Dominic, Frank plus four\r\n  others. Lilly is also there. So is Silus, sitting, perfectly\r\n  still, calm. Several of the cops look at him suspiciously.\r\n                                                                30\r\n\r\n\r\n\r\n\r\n                   LILLY\r\n         Ok, ok, quiet down.\r\n\r\nEveryone nods and shuts up as Lilly stands in front of the\r\nmen.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         Gentlemen, there's no other way to\r\n         put it. We have only 2 days to\r\n         find the suspect.\r\n\r\nThere are guffaws from most of the policemen.\r\n\r\n                   JONES\r\n         There's no chance. Not a hope in\r\n         hell.\r\n\r\n                   FRANK\r\n         He's right. We don't even know\r\n         where to begin.\r\n\r\n                   LILLY\r\n         Quiet!\r\n\r\nLilly is angry. There is silence in the room. Lilly seems\r\nmore angry than she should be.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         What you are about to hear will\r\n         not leave this room. Everyone\r\n         understand? Jones?\r\n\r\nJones shrugs.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         I would suggest anyone with a weak\r\n         stomach leave now.\r\n\r\nNo one moves. They all stare at Lilly.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         This is Brother Silus.\r\n\r\nShe motions to Silus, who rises, watching the glares from the\r\ncops who eye him like a suspect.\r\n\r\n                   SILUS\r\n         Thank you Captain. Could we have\r\n         the plate?\r\n                                                                31\r\n\r\n\r\n\r\n\r\nAn old slide projector heats up as the main lights are turned\r\noff. The projector sprays an image up on the wall. The face\r\nof a killer, before he became one, the serene gaze of a\r\nBrother.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         Senior Brother Edgar. Until 3\r\n         weeks ago, he was a trusted and\r\n         talented theologian and scientist.\r\n\r\n                   DOMINIC\r\n         What'd he do?\r\n\r\n                   SILUS\r\n         He was personally responsible for\r\n         developing the most recent\r\n         influenza antivirals. It is\r\n         because of him that most of you\r\n         are alive today. His behavior\r\n         appeared normal. Next.\r\n\r\n3 photos come up. The victims.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         The victims. John Anderson. Julie\r\n         Danes. Tanya Garfield. All in\r\n         their early 20's, but beyond that\r\n         no obvious connection. Next.\r\n\r\nA Map.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         There is no precedent for Brother\r\n         Edgar's behavior. No Brother has\r\n         ever taken a human life, not in\r\n         the 300 years since we began. Not\r\n         one. Our role has been to preserve\r\n         and maintain the human life. Not\r\n         take it.\r\n\r\n                   JONES\r\n         Next he'll be wanting an fucking\r\n         medal.\r\n\r\nSilus stares directly at Jones now. Their eyes lock. Silus\r\ncontinues, perfectly calm.\r\n\r\n                   SILUS\r\n         What I am saying to you is that\r\n         Brother Edgar's behavior is\r\n         aberrant. We\r\n                                                                32\r\n\r\n                        SILUS\r\n                        (cont)\r\n         don't understand it. And therefore\r\n         it's difficult to predict. The\r\n         only thing we know is where he\r\n         will strike next.\r\n\r\n                   DOMINIC\r\n         How do you know?\r\n\r\nSilus moves to the desk next to him. He passes something to\r\nanother cop who now sits at the desk. We see Lilly now. The\r\nlook on her face tells us that she knows what is coming and\r\nshe's not looking forward to it.\r\n\r\nWe see what Silus gave the cop. An audio tape. The cop places\r\nthe tape in a tape deck. He then switches it on. He then\r\nturns the volume knob on an amplifier which now directs\r\nstatic hiss to two big speakers.\r\n\r\nWe see the faces of the cops, all listening in the dim light\r\ncoming from the slide projector.\r\n\r\nAbove the level of the hissing tape there is another noise.\r\nIt is a wet sound. Like a cat would make if it were lapping\r\nup milk. An another sound. Like an animal, moaning with\r\npleasure.\r\n\r\nWe see the cops; some of them are beginning to twig. And\r\nthere is another noise. It is a man; moaning.\r\n\r\n                   MAN ON THE TAPE\r\n                (off)\r\n         Please. Please don't hurt me.\r\n\r\nWe see Jones and Dominic. Their glares say it all. And then\r\nanother voice.\r\n\r\n                     EDGAR\r\n                  (off, like to a lover)\r\n         Quiet.\r\n\r\n                   MAN ON THE TAPE\r\n                (off)\r\n         Please...\r\n\r\n                   EDGAR\r\n                (off)\r\n         I said shut up!\r\n\r\nThen we hear a punch and then noises which can only be\r\ndescribed as sounding like a dog killing something.\r\n\r\nJones springs out of his seat.\r\n                                                                33\r\n\r\n\r\n\r\n\r\n                   JONES\r\n         Fuck!\r\n\r\n                   LILLY\r\n         Jones, sit down.\r\n\r\n                   JONES\r\n         Why are we listening to this?!\r\n\r\n                   LILLY\r\n         Quiet!\r\n\r\nJones stands there enraged. Dominic pulls him down back into\r\nhis chair. All the cops are appalled by what they have heard.\r\nAnd then a voice.\r\n\r\n                   EDGAR\r\n                (off)\r\n         Good. Now you're quiet.\r\n\r\nWe can hear Edgar moving around.\r\n\r\n                   EDGAR\r\n                (continuing; off)\r\n         Did you hear that Silus? I hope so.\r\n\r\nWe see Silus, listening as intently as everyone else.\r\n\r\n                   EDGAR\r\n                (continuing; off)\r\n         The next one will be tomorrow.\r\n         There is a square, Bridge Square\r\n         it's called. I will take the next\r\n         one from there. You should try\r\n         harder this time. Please try\r\n         harder...\r\n\r\nMore moving around, then the sound on the tape cuts out. We\r\nare left with only tape hiss. Everyone stares at Silus.\r\n\r\n                   FRANK\r\n         He sent this to you. Specifically.\r\n\r\n                   SILUS\r\n         We share the same mother. There is\r\n         a bond.\r\n\r\nThe cops all stare at Silus' emotionless response.\r\n\r\n                   LILLY\r\n         There will be two teams. Frank, I\r\n         want you and Abernathy up in the\r\n         buildings around Bridge Square.\r\n\r\nFrank nods.\r\n                                                                   34\r\n\r\n\r\n\r\n\r\n                      LILLY\r\n                   (continuing)\r\n            I'll lead the other team with\r\n            Dominic, Jones and Queen's\r\n            Imperial Guard in support. No\r\n            guns, batons only.\r\n\r\n                        JONES\r\n            What?\r\n\r\n                      LILLY\r\n            You heard me. He's to be taken\r\n            alive.\r\n\r\n\r\n32 EXT: JAMESTOWN, BRIDGE SQUARE - NIGHT                      32\r\n\r\n  It has rained. The small square is dimly lit. At it's center\r\n  is a small park with distorted trees. And a rundown\r\n  playground. A rusty swing creaks. We see a figure there. It\r\n  is Lilly. She watches the rusty swing creak. Then she looks\r\n  up to the surrounding buildings.\r\n\r\n  We tilt up to one of the buildings which is perhaps eight\r\n  stories high; like the others around the square it is an\r\n  apartment building. There is movement at the very top.\r\n\r\n  Cut to\r\n\r\n\r\n33 EXT: JAMESTOWN, BRIDGE SQUARE, ROOF - NIGHT                33\r\n\r\n  POV from the top of the building, observing Lilly below enter\r\n  a black, unmarked van. Then there is buzz from an RT. We\r\n  reveal POV belongs to Silus.\r\n\r\n                        SILUS\r\n            Yes.\r\n\r\n\r\n34 INT: POLICE VAN - NIGHT                                    34\r\n\r\n  Lilly is in a police van. Jones and Dominic are there with\r\n  her; both of them trying to come to grips with the strange\r\n  stun weapons they've been given. And there are three huge,\r\n  dark eyed soldiers there, dressed in the ominous black\r\n  uniform of the Queen's Imperial Guard, cocking their electric\r\n  batons; which fizz in the half light.\r\n\r\n                        LILLY\r\n            Anything?\r\n\r\n  We cut between Lilly in the van and Silus on the roof.\r\n                                                                 35\r\n\r\n\r\n\r\n\r\n                      SILUS\r\n            No.\r\n\r\n  Silus surveys the scene. He can see an Imperial Guard sniper\r\n  over the square on the roof of a building. Below, in the\r\n  street, we can see the silhouettes of several Brothers;\r\n  unmoving, watchful sentinels.\r\n\r\n                      LILLY\r\n            It's getting late.\r\n\r\n                      SILUS\r\n            He will come.\r\n\r\n                      LILLY\r\n            Ok. We'll sit tight.\r\n\r\n  Lilly closes the com. Jones is staring at her.\r\n\r\n                      JONES\r\n            This is a dud.\r\n\r\n  Lilly ignores Jones and talks into the RT again.\r\n\r\n                      LILLY\r\n            Frank?\r\n\r\n  Cut to\r\n\r\n\r\n35 INT: APARTMENT BUILDING, BRIDGE SQUARE - NIGHT           35\r\n\r\n  Frank is inspecting a stairwell of the building. He has\r\n  Abernathy with him. He talks into his RT.\r\n\r\n                      FRANK\r\n            Yeah Lil'.\r\n\r\n                      LILLY\r\n                   (off)\r\n            Anything?\r\n\r\n                      FRANK\r\n            Not a thing.\r\n\r\n                      LILLY\r\n                   (off)\r\n            Check each floor again.\r\n\r\n  Frank motions to Abernathy, who is already sighing.\r\n                                                                    36\r\n\r\n\r\n\r\n\r\n                      FRANK\r\n            You heard her. Once more for the\r\n            empire.\r\n\r\n  Low Angle from the floor of the two men beginning to climb\r\n  the stairs, their guns out.\r\n\r\n  The shot stays where it is. We can see the stairs and the\r\n  wall. We pause. The soundtrack is almost dead quiet, apart\r\n  from the buzzing flouro above us. And then the CAMERA begins\r\n  to advance, like a POV, heading for the wall ahead. It\r\n  reaches the corner and then advances along cables running up\r\n  to the roof. As it climbs we can see a ventilation shaft in\r\n  the corner with no grill. The camera approaches it and moves\r\n  into the shaft, continuous.\r\n\r\n\r\n36 INT: APARTMENT BUILDING, VENTILATION SHAFT - CONTINUOUS     36\r\n\r\n  The shot continues to track through the man-sized shaft. As\r\n  we move through the shaft - turning corners, going up\r\n  floors - we pass grills. Some of them show light coming from\r\n  the apartments within. We can hear an argument in one room.\r\n  A crying child in the next. A TV blaring in another (playing\r\n  porno). But mostly the rooms are dark. And as we move up and\r\n  along, there is a scuttling NOISE, growing louder, as if we\r\n  are approaching it.\r\n\r\n  Then the NOISE stops.\r\n\r\n  The camera halts, stares down the long ventilation shaft.\r\n  Silence. Dead silence. The camera starts to move again and\r\n  then turns a corner to run into the leering face of Edgar,\r\n  the vampire, his teeth bared, his eyes reflecting in the half\r\n  light. Then he smiles.\r\n\r\n                      EDGAR\r\n            Shoo.\r\n\r\n  Cut to\r\n\r\n  A rat, staring back at Edgar. The rat turns and streaks off\r\n  back whence it came.\r\n\r\n  A slight smile appears on Edgar's face; a smile that can\r\n  chill the blood in your veins.\r\n\r\n  Then he begins to move forward. We hear his breathing; low,\r\n  but excited. He moves with the precision and strength of an\r\n  insect. His eyes glisten and reflect light like an animal's.\r\n  His skin is flesh white and milky in the metal shaft.\r\n\r\n  Cut to\r\n                                                                    37\r\n\r\n\r\n\r\n\r\n  His POV approaching a grill. A subdued light comes through\r\n  it. The POV approaches and sees into the apartment below.\r\n\r\n\r\n37 INT: ROOM, SAME BUILDING - NIGHT                            37\r\n\r\n  A woman, around 20, attractive, brushing her hair. She has\r\n  just had a shower. She sits.\r\n\r\n  Cut to\r\n\r\n  The shaft. We see Edgar's hand enter shot. His hand grips the\r\n  bottom of the grill and tries to open it. It doesn't budge.\r\n\r\n  Cut to\r\n\r\n  Inside the room, the woman turns and looks up at the grill.\r\n  She thinks she's heard something. She stares; waits. She gets\r\n  up and moves towards the grill high above on the wall. She\r\n  places a chair under it, then gets up on it, standing on tip\r\n  toes, trying to see if there's anything behind the grill. Her\r\n  hand reaches out and tries the grill, to see if it's secure.\r\n\r\n  Then she leans closer to it. Her face pressed right up\r\n  against it. Closer. Closer.\r\n\r\n  Cut to\r\n\r\n  Edgar's white face, lurching into shot. Staring, staring.\r\n\r\n  Cut to\r\n\r\n  His POV. He is now looking through a different grill. This\r\n  time there is a young man inside an apartment. Doing\r\n  exercises.\r\n\r\n  Edgar watches. And again that chilling smile.\r\n\r\n  We see the man again, who gets up and preens himself in front\r\n  of a mirror.\r\n\r\n  Close on Edgar's eyes, devouring the sight of this pumped up\r\n  flesh. The young man exits the room, going into a bathroom.\r\n\r\n  We see Edgar's hand trying to open the grill. It moves.\r\n\r\n  Cut to\r\n\r\n\r\n38 INT: APARTMENT BUILDING, HALL - NIGHT                       38\r\n\r\n  Frank and Abernathy are on fifth floor, finishing a sweep of\r\n  it. As they move they hear a CRASH. They stop. Then another\r\n  crash, coming from the floor up. Then a SCREAM.\r\n                                                                      38\r\n\r\n\r\n\r\n\r\n   They look at each other, then begin to run to the stairwell,\r\n   as Frank talks into his RT.\r\n\r\n                       FRANK\r\n             Lil'! Lil'!\r\n\r\n   Cut to\r\n\r\n\r\n38A INT: POLICE VAN - CONTINUING                                38A\r\n\r\n                         LILLY\r\n             Frank.\r\n\r\n                       FRANK\r\n                    (off)\r\n             He's on the sixth floor! He's on\r\n             the sixth floor!\r\n\r\n                         LILLY\r\n             Let's go.\r\n\r\n   Everyone fires into action and begins to exit the van.\r\n\r\n\r\n39 EXT: JAMESTOWN, BRIDGE SQUARE, ROOF - NIGHT                  39\r\n\r\n   Silus watches from his vantage point. He can see Lilly and\r\n   her team below rushing into the building adjacent to him. And\r\n   then he sees, through one of the windows on the sixth floor,\r\n   the flashes of gunfire.\r\n\r\n   Cut to\r\n\r\n\r\n40 INT: APARTMENT BUILDING, STAIR WELL - NIGHT                  40\r\n\r\n   Handheld camera with Lilly and her crew rushing up the\r\n   stairwell; up up.\r\n\r\n   Cut to\r\n\r\n\r\n41 OMITTED                                                      41\r\n\r\n\r\n42 INT: APARTMENT BUILDING, BRIDGE SQUARE, HALL - NIGHT         42\r\n\r\n   Lilly and her crew entering the hall. They are confronted\r\n   with a view of the long hall. Halfway down there is a door\r\n   with blood smeared on it. We can see Abernathy, lying in a\r\n   pool of blood outside the door.\r\n                                                                    39\r\n\r\n\r\n\r\n\r\n  The cops stop. A door opens close to them. A large greasy man\r\n  pokes his head out the door and gets the cops guns on him\r\n  immediately. Lilly motions with her hand.\r\n\r\n                      LILLY\r\n                   (whispering)\r\n            Police. Get back inside. Get back.\r\n\r\n  The man returns and closes the door. The Imperial Guards now\r\n  swing into action. They move forward towards the room, to the\r\n  closed door. Lilly and her crew follow. The Imperial Guards\r\n  get ready outside the door batons ready. One of them motions\r\n  for Lilly and her crew to wait. Jones is nearest them. He\r\n  goes down on one knee. Dominic moves past them and positions\r\n  himself on the other side.\r\n\r\n  Lilly kneels where she is.\r\n\r\n  Beat.\r\n\r\n  Then the Imperial Guards kick open the door and enter.\r\n\r\n  Lilly waits, watching. There's no sound. Dominic begins to\r\n  move forward, then enter the door to the apartment, his baton\r\n  raised. Jones now moves forward, keeping his eyes on the\r\n  door. There is no sound coming from the room.\r\n\r\n  Cut to\r\n\r\n  Lilly, kneeling in the hall. Also staring at the door. Too\r\n  late to realize the door next to her is opening. Before she\r\n  can react, she's staring into the face of Edgar; the eyes,\r\n  the bloody mouth. Edgar is on her in an instant, moving with\r\n  ferocious speed, whipping her like a rag doll into the room.\r\n\r\n  Meanwhile Jones is edging towards the room Dominic entered.\r\n\r\n  Cut to\r\n\r\n\r\n43 INT: APARTMENT BUILDING, BRIDGE SQUARE, ROOM - NIGHT        43\r\n\r\n  Lilly, trapped, held by Edgar, who stares at her. Then, in\r\n  one swift movement, he lurches down, tearing her neck with\r\n  his teeth. She cries out.\r\n\r\n\r\n44 INT: APARTMENT BUILDING, BRIDGE SQUARE, HALL - NIGHT        44\r\n\r\n  In the hall, Jones is looking into the room Dominic went\r\n  into. The lights come on. The room is empty. Just the cops\r\n  and Frank's bloody corpse on the floor.\r\n\r\n                      JONES\r\n            Lil'.\r\n                                                                   40\r\n\r\n\r\n\r\n\r\n  Jones turns to see Lilly, but she's not there. The hallway is\r\n  empty. He sees the door Lilly was pulled through. Then looks\r\n  down. Blood is seeping from under the door.\r\n\r\n                        JONES\r\n                     (continuing)\r\n            Fuck!\r\n\r\n  Cut to\r\n\r\n\r\n45 INT: APARTMENT BUILDING, BRIDGE SQUARE, ROOM - NIGHT       45\r\n\r\n  Lilly being embraced by Edgar, she can't do anything. Then a\r\n  loud crash on the door, as if someone is trying to break in.\r\n  Edgar stops feeding, stares at Lilly.\r\n\r\n  Beat.\r\n\r\n                      EDGAR\r\n            You're so strong.\r\n\r\n  Then another crash on the door. Edgar drops Lilly. He propels\r\n  himself towards a ventilation grill on the wall.\r\n\r\n  Cut to\r\n\r\n  Jones and the cops kicking the door in. It swings open to\r\n  show Lilly on the floor. Jones stoops down.\r\n\r\n                       JONES\r\n            Lilly!\r\n\r\n  Jones gets close to Lilly, starts squeezing the side of her\r\n  neck, trying to stop the arterial blood from squirting her\r\n  life away.\r\n\r\n                      JONES\r\n                   (continuing)\r\n            Oh shit shit.\r\n\r\n  Dominic enters and sees the scene. He yells into his RT.\r\n\r\n                      DOMINIC\r\n            Lilly's hurt. She's hurt!\r\n\r\n  The other cops are now scanning the room. Meanwhile Dominic\r\n  has found the ventilation shaft, blood smeared around the\r\n  opening.\r\n\r\n                      DOMINIC\r\n                   (continuing)\r\n            He's in the ventilation shaft!\r\n                                                                  41\r\n\r\n\r\n\r\n\r\nJones then stares down at Lilly pressing one hand against the\r\nwound. Close on Lilly, going into shock. She's shivering.\r\n\r\n                   JONES\r\n         She's dying! She's fucking dying!\r\n\r\nAt that moment SILUS appears at the door.\r\n\r\nSilus stares at Lilly, bleeding to death in Jones' arms.\r\nSilus immediately bends to her. With his free hand Jones\r\npulls out a vicious knife which he points at Silus.\r\n\r\n                   JONES\r\n                (continuing)\r\n         Get away from her!\r\n\r\nBut Silus ignores the knife and moves closer to Lilly.\r\n\r\n                   JONES\r\n                (continuing)\r\n         Get away or I'll stick you!\r\n\r\n                   SILUS\r\n         Do you want me to save her?\r\n\r\nJones wavers.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         She is dying.\r\n\r\nJones backs the knife away. Silus whips   his hand to the blade\r\nof the knife, slashing his wrist, blood   immediately issuing\r\nfrom the wound. He presses his bleeding   wrist to Lilly's\r\nmouth. At first resistant, Lilly begins   to suck at the wrist.\r\nJones is appalled.\r\n\r\nSilus then leans close to Lilly and whispers in her ear. All\r\nthe other noises in the soundtrack drop out.\r\n\r\n                   SILUS\r\n                (continuing)\r\n         Lilly. Stop fighting now. Fall\r\n         back, fall back...\r\n\r\nSlowly she does. Silus removes his wrist from Lilly's mouth.\r\nShe is silent, comatose.\r\n\r\nA medical team now scramble through the door, pushing past\r\nSilus and the bloody Jones and begin to work on Lilly. For a\r\nmoment Silus and Jones stare at each other. Then Silus turns\r\nto the ventilation shaft in the corner. He closes his eyes.\r\nListens.\r\n                      42\r\n\r\n\r\n\r\n\r\n          DOMINIC\r\nHe's getting away!!\r\n\r\n         SILUS\r\nQuiet.\r\n                                                                      43\r\n\r\n\r\n\r\n\r\n   The cops are silent. Stare at Silus who opens his eyes.\r\n\r\n                       SILUS\r\n                    (continuing)\r\n             He's going up.\r\n\r\n   We move in on Silus' ear. Closer, closer. Into his ear.\r\n\r\n                                            DISSOLVE TO:\r\n\r\n\r\n46 INT: APARTMENT BUILDING, VENTILATION SHAFT - NIGHT           46\r\n\r\n   The long shaft and in the distance Edgar approaching, his\r\n   eyes reflective, moving with the speed of an insect through\r\n   the shaft, his bloody mouth.\r\n\r\n   Cut to\r\n\r\n   Silus, now also in the shaft, his gun out, moving forward. He\r\n   turns a corner. The shaft is empty. He waits, watching,\r\n   listening. He hears a scuffling.\r\n\r\n   Cut to\r\n\r\n   Edgar, the same, turning a corner to see Silus approaching\r\n   him. Silus raises his gun. A puff emits from the end of his\r\n   gun. The projectile hurtles towards Edgar, who just ducks out\r\n   of the way in time.\r\n\r\n   Edgar turns. There is a grill next to him. He smashes it with\r\n   his foot.\r\n\r\n   Cut to\r\n\r\n   Silus approaching the junction, turning the corner, just in\r\n   time to see Edgar's legs pass through the hole.\r\n\r\n\r\n46A INT: APARTMENT BUILDING, HALL - CONTINUING                  46A\r\n\r\n   We see Jones move into the hall, looking at the roof,\r\n   searching. Then he looks at Lilly's blood which covers his\r\n   hands. He pockets his stun weapon and pulls out his own\r\n   dangerous looking gun.\r\n\r\n   Cut to\r\n\r\n\r\n47 INT: APARTMENT BUILDING, DIFFERENT FLOOR - NIGHT             47\r\n\r\n   A door bursts open. Edgar - in slow motion - crashes through\r\n   the door and into the hall. The sound track is a huge driving\r\n   slab of choral orchestral music.\r\n                                                                    44\r\n\r\n\r\n\r\n\r\n  The camera tracks back as he starts to mount the wall, his\r\n  momentum carrying him diving towards the camera.\r\n\r\n  Cut to\r\n\r\n  Silus enters the empty hall. No Edgar. Then he sees in the\r\n  roof, a manhole cover, slightly ajar.\r\n\r\n  Cut to\r\n\r\n\r\n48 INT: APARTMENT BUILDING, CEILING CAVITY - NIGHT             48\r\n\r\n  Silus' POV as he climbs into the crawl space, its ceiling\r\n  following the pitch of the roof. It is dark and extends for\r\n  a long way. Silus squats in the sub light like a beautifully\r\n  dressed animal.\r\n\r\n  What he can't see are two blinking eyes above him in the\r\n  rafters of the dark roof. It is Edgar. Edgar drops, Silus\r\n  turns too late as the weight of Edgar drives into him,\r\n  sending both of them through the floor of the ceiling cavity\r\n  and down...\r\n\r\n\r\n49 INT: APARTMENT BUILDING, ANOTHER HALL - NIGHT               49\r\n\r\n  ...to fall, a dead weight, crashing down onto the floor of\r\n  the hall in a hail of debris. Edgar is on top of Silus and\r\n  strangling him, and then he stops and turns.\r\n\r\n  He moves just in time to avoid a bullet from Jones' gun which\r\n  glances Edgar's cheek, sending off a wisp of burnt colored\r\n  smoke.\r\n\r\n  Cut to\r\n\r\n  Jones. Gun smoking, standing at the other end of the hall.\r\n\r\n  Edgar screams the scream of something from the animal\r\n  kingdom. Then turns and runs.\r\n\r\n  Cut to\r\n\r\n  Silus rising, pulling out his gun. Jones points his gun, but\r\n  Silus is obscuring his view.\r\n\r\n  Cut to\r\n\r\n  Edgar runs away down the hall.\r\n\r\n  Then on Silus. Very still, very silent. Close on his finger\r\n  pressing the trigger.\r\n                                                                45\r\n\r\n\r\n\r\n\r\nThe camera zooms right into the interior of the gun to see\r\nthe projectile entering the gun's chamber and the hammer\r\nigniting it.\r\n\r\nThe projectile explodes out the end of the gun.\r\n\r\nHigh Angle of the projectile flying towards its target, the\r\nceiling lights above streaking past on its reflective\r\nsurface, cruel mechanical claws suddenly slide out from the\r\nside of the capsule.\r\n\r\nThen Edgar, camera tracking back at high speed.\r\n\r\nSlow move in on Silus' cool gray eyes.\r\n\r\nThen whack! The projectile stabs into Edgar's back, the claws\r\nspringing forward to hook onto Edgar's flesh, we see the\r\nfluid within the transparent projectile flow into Edgar, see\r\nEdgar's eyes widen, see his POV of the approaching window\r\nthen...\r\n\r\nCrash. Edgar's head implants itself in the wall below the\r\nwindow, the dust and debris from the wall board drifting over\r\nEdgar's numb stare.\r\n\r\nIn the background Silus stands. Motionless.\r\n\r\nWe see Jones walking forward, gun still pointing, heading\r\ntowards Edgar. Silus turns and steps in front of him.\r\n\r\n                   JONES\r\n         Get out of my way.\r\n\r\n                   SILUS\r\n         No.\r\n\r\nJones stares at Silus and contemplates firing.\r\n\r\n                   JONES\r\n         He killed Lilly.\r\n\r\nSilus doesn't move. He stares calmly at Jones.\r\n\r\nJones points the gun in Silus' face.\r\n\r\nBeat.\r\n\r\n                    JONES\r\n                 (continuing)\r\n         Bang.\r\n                                                                     46\r\n\r\n\r\n\r\n\r\n   Jones lowers his gun. We end close on Silus' serene face.\r\n\r\n                                            SLOW DISSOLVE\r\n\r\n\r\n50 OMITTED                                                     50\r\n\r\n                                            FADE OUT:\r\n\r\n\r\n50A INT: SFX - CONTINUING                                      50A\r\n\r\n   Black. Voices in the dark, quiet at first, then growing more\r\n   frightening; then the hint of a face, in negative - Edgar -\r\n   then screams, like the screams of an animal on the hunt. And\r\n   another face, alternating with Edgar's. Silus.\r\n\r\n                                            CUT TO:\r\n\r\n\r\n51 INT: HOSPITAL, LILLY'S WARD - DAY                           51\r\n\r\n   High Angle of Lilly asleep, lying on a hospital bed. We drift\r\n   down. Again there is rain, pounding against the window. Her\r\n   body flinches; she is in a dream, a nightmare. As we drift\r\n   closer to her, her eyes open, staring straight up and then to\r\n   the left. Then grim recognition.\r\n\r\n   Cut to Low Angle on Silus standing above her, examining the\r\n   tube that runs a clear fluid into her in a slow drip.\r\n\r\n                       LILLY\r\n             Antibiotics. They say it's like an\r\n             animal bite.\r\n\r\n   Silus nods. He slowly sits on the bed.\r\n\r\n                       LILLY\r\n                    (continuing)\r\n             I want to thank you.\r\n\r\n                       SILUS\r\n             We all caught Edgar.\r\n\r\n                       LILLY\r\n             I don't mean that. The blood, they\r\n             say it saved my life. Is it true\r\n             that people who go to church are\r\n             given your blood?\r\n\r\n                       SILUS\r\n             Sometimes the rituals call for it.\r\n             Some say they have visions from\r\n             it. That it restores their health.\r\n                                                               47\r\n\r\n\r\n\r\n\r\nSilus regards her and she him. She reaches out and touches\r\nhis hand, almost retracts at the smooth texture of the skin.\r\n\r\n                   LILLY\r\n         So smooth.\r\n\r\nShe turns over his hand to reveal the wrist; the scars are\r\nalmost gone from where Silus cut himself.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         Healed already.\r\n\r\n                   SILUS\r\n         In some ways my body is like a\r\n         human embryo. The cells regenerate\r\n         quickly. It is why we live so\r\n         long. Will someone come for you?\r\n         Your family?\r\n\r\nShe releases his hand.\r\n\r\n                   LILLY\r\n         I don't have one. Not any more.\r\n\r\n                   SILUS\r\n         I see.\r\n\r\n                   LILLY\r\n         Influenza. My husband was quick.\r\n         But my daughter, Mary, her little\r\n         body fought it for a long time. So\r\n         I just waited. Hoped. But then you\r\n         realize how cruel hope is. And you\r\n         just want it to end. Not to stop\r\n         her suffering, but to stop my own.\r\n\r\n                   SILUS\r\n         I am sorry.\r\n\r\n                   LILLY\r\n         Do we seem pathetic to you?\r\n\r\n                   SILUS\r\n         No. Fragile. Worn down by nature.\r\n         But you fight back.\r\n                                                                      48\r\n\r\n\r\n\r\n\r\n                       LILLY\r\n             Yes. We're good at that.\r\n\r\n   Lilly stares up into Silus' serene face. Silus smiles. Then\r\n   stands.\r\n\r\n                       SILUS\r\n             I think yours will be a good life\r\n             to watch, Lilly. Goodbye.\r\n\r\n   Lilly tries to smile as Silus turns and walks off down the\r\n   ward.\r\n\r\n   Close on Lilly who looks grim. Then she turns to the window.\r\n   Rain again, blowing hard against the pane.\r\n\r\n\r\n52 INT: HOSPITAL,LILLY'S WARD - CONTINUOUS                      52\r\n\r\n   As Silus leaves the ward he passes Jones, who's been standing\r\n   there as if he's been watching them. A beat. Then Jones\r\n   shoves a newspaper into Silus' hands.\r\n\r\n                       JONES\r\n             Nicely done. You're more human\r\n             than I thought.\r\n\r\n   Jones unceremoniously pushes past Silus and moves into\r\n   Lilly's room. Silus reads the newspaper. The story tells of\r\n   the recent deaths in Jamestown, explaining that it was an\r\n   insane man who thought he was a Brother. The man's picture is\r\n   shown; it is actually one of the victims.\r\n\r\n   Through the window in the doorway Silus watches Jones\r\n   approach Lilly. We are close on his enigmatic face.\r\n\r\n                                              DISSOLVE TO:\r\n\r\n\r\n52A EXT: BROTHERHOOD BUILDING, FOYER - DAY- Establisher         52A\r\n\r\n   We tilt down a grand building.\r\n                                                                    49\r\n\r\n\r\n\r\n\r\n53 INT: BROTHERHOOD BUILDING, FOYER - DAY                      53\r\n\r\n  A huge foyer, shinning marble floors. All done in perfect\r\n  taste. We see Silus cross the foyer and enter an elevator.\r\n  The elevator doors close.\r\n\r\n\r\n54 INT: BROTHERHOOD BUILDING, SECURITY CONTROL ROOM - DAY      54\r\n\r\n  Silus enters the room. There are several technicians at work\r\n  at a console; again the organic nouveaux stylings of the\r\n  Brothers. Augustus is also there. Next to him, someone who is\r\n  obviously human. His lack of perfection stands out; the\r\n  balding hair, dark rings under his eyes. Silus joins them.\r\n\r\n                      AUGUSTUS\r\n            Silus. You know Professor Liepsky.\r\n\r\n  Silus shakes the Professor's hand. We see the hands touching,\r\n  then slide apart with a wisping sound that makes the\r\n  Professor wince a little.\r\n\r\n                      SILUS\r\n            How is he?\r\n\r\n                      PROFESSOR LIEPSKY\r\n            See for yourself.\r\n\r\n  He taps one of the men at the console on the shoulder. The\r\n  man hits a button and we see that in front of the console\r\n  there is a huge glass window and beyond it a room which is\r\n  now lit.\r\n\r\n  Edgar is in there. And Edgar is not pleased. Even from here\r\n  his glowering stare penetrates everyone in the room. From\r\n  this distance we can't make out much, beyond the fact that\r\n  Edgar is seated in a chair, in an otherwise plain white room.\r\n  Around his chair is a strange \"brace\" of sorts, that seems to\r\n  be holding Edgar in place.\r\n\r\n                      SILUS\r\n            Is the brace necessary?\r\n\r\n                      AUGUSTUS\r\n            He decapitated a guard as they\r\n            brought him in. Even though he was\r\n            sedated. He said he will drink us\r\n            all dry.\r\n\r\n                      SILUS\r\n            Insane then.\r\n                                                                    50\r\n\r\n\r\n\r\n\r\n                      PROFESSOR LIEPSKY\r\n            Not quite.\r\n\r\n  Silus now turns to the Professor.\r\n\r\n                      PROFESSOR LIEPSKY\r\n                   (continuing)\r\n            He's become infected.\r\n\r\n                      SILUS\r\n            With what?\r\n\r\n  The Professor looks to Augustus, as if worried he's said to\r\n  much.\r\n\r\n                      AUGUSTUS\r\n            Go on, Brother Silus will soon be\r\n            part of the inner circle of the\r\n            Brotherhood. He should know this.\r\n\r\n  Cut to\r\n\r\n\r\n55 INT: BROTHERHOOD BUILDING, LABS - CONTINUING                55\r\n\r\n  POV approaching a curved, glass and metal door. On the door\r\n  we see the words \"Biological Containment Area.\"\r\n\r\n                                           DISSOLVE TO:\r\n\r\n\r\n56 INT: BROTHERHOOD BUILDING, BIO CONTAINMENT WARD -           56\r\n   DAY- Establisher\r\n\r\n  POV continues. There are 3 beds in here. In them, strapped\r\n  down, 3 young woman. They are all insane, monstrous; the\r\n  whites of their eyes are blood red.\r\n\r\n  We see Silus observe them, but there is no horror in his\r\n  eyes, just compassion. He moves to one of the woman and\r\n  slowly grasps her hand. She lurches towards him.\r\n\r\n                      PROFESSOR LIEPSKY\r\n            If she wasn't restrained she would\r\n            try to kill you. Don't worry, it's\r\n            only transmissible through their\r\n            blood. We designed it that way.\r\n\r\n  Silus quietly turns to the Professor.\r\n\r\n                        SILUS\r\n            Designed?\r\n                                                              51\r\n\r\n\r\n\r\n\r\n                   PROFESSOR LIEPSKY\r\n         Genetically designed. Edgar was\r\n         experimenting with the virus that\r\n         created you. It was sanctioned by\r\n         the government.\r\n\r\n                   SILUS\r\n         Since when do they sanction such\r\n         things?\r\n\r\n                   PROFESSOR LIEPSKY\r\n         Since not one Brother has been\r\n         born in 70 years. And never a\r\n         female of your kind from which we\r\n         could breed. And we need to breed\r\n         more Brothers. You give the world\r\n         hope. To the people you're like\r\n         gods walking the earth.\r\n\r\n                   AUGUSTUS\r\n         This is what Edgar was doing\r\n         Silus. Trying to genetically\r\n         control the birth of Brothers.\r\n\r\nSilus is now turns back to the poor creature on the bed.\r\n\r\n                   PROFESSOR LIEPSKY\r\n         And Edgar was successful. Each of\r\n         these women carried a Brother, for\r\n         a time. But, the virus... changed.\r\n         Most of them have died and these\r\n         will die soon.\r\n\r\nSilus places his hand on the poor creature's head, blessing\r\nher.\r\n\r\n                   PROFESSOR LIEPSKY\r\n                (continuing)\r\n         And Edgar may be the first Brother\r\n         to ever die.\r\n                                                                    52\r\n\r\n\r\n\r\n\r\n                      PROFESSOR LIEPSKY\r\n                   (continuing)\r\n            Before that, his brain will wither\r\n            like these women. Containment will\r\n            be the issue.\r\n\r\n  Cut to\r\n\r\n\r\n57 INT: BROTHERHOOD BUILDING, CELL ANTEROOM - CONTINUING       57\r\n\r\n  A door slamming behind Silus, he is in a strangely, eerily\r\n  lit cubicle.\r\n\r\n                      SILUS\r\n                   (off)\r\n            The police officer. Lilly. Did he\r\n            infect her with this?\r\n\r\n                      PROFESSOR LIEPSKY\r\n                   (off)\r\n            No. She was lucky. But it is in\r\n            Edgar's blood. It always will be.\r\n\r\n  ...and another door in front of Silus clicks, then slides\r\n  open to reveal...\r\n\r\n\r\n58 INT: BROTHERHOOD BUILDING, CELL - CONTINUING                58\r\n\r\n  Edgar, sitting in the chair. He immediately turns to the\r\n  door, his eyes burrowing straight into Silus.\r\n\r\n  Silus moves forward. We track, Silus' POV, toward Edgar and\r\n  the reality of his predicament is revealed.\r\n\r\n  There are metal rods extending from the cage around him. Two\r\n  at the sides. Two from the front. They strategically pointed\r\n  at Edgar's chest and sides. If he was to try to get up, they\r\n  would pierce him.\r\n\r\n                      SILUS\r\n            Hello my Brother.\r\n\r\n  We can now see Edgar for the first time in something\r\n  approaching a normal state. He looks similar to Silus,\r\n  perhaps not quite so perfect. He radiates confident primeval\r\n  power; less a man captured than an animal waiting. Edgar is\r\n  smiles. He shifts a little, we see the rods piercing his\r\n  flesh.\r\n                                                             53\r\n\r\n\r\n\r\n\r\n                   EDGAR\r\n         Do you like what they've done for\r\n         me Silus?\r\n\r\nHe moves again, as if enjoying it.\r\n\r\n                   SILUS\r\n         You are sick. We will help you if\r\n         we can.\r\n\r\n                   EDGAR\r\n         Help me? I am being what I was\r\n         meant to be. How can you help me\r\n         from that? Or do you want to tame\r\n         me? Brainwash me? Animal or\r\n         vegetable, are those the two\r\n         choices, Silus?\r\n\r\nEdgar leans closer to Silus.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         I want to share the feeling with\r\n         you. To feel their blood flow\r\n         until every last drop is yours,\r\n         until that weak, pointless little\r\n         pump finally stops.\r\n\r\nThey are staring at each other very intently now. Edgar\r\nsmiles gently.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         The one I had, the police woman.\r\n         She was so strong. I found it hard\r\n         to leave her.\r\n\r\nEdgar moves.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         Is she dead?\r\n\r\n                   SILUS\r\n         She survived.\r\n\r\n                   EDGAR\r\n         Good. I will have her again.\r\n\r\nFor perhaps the first time, we see a real hint of anger on\r\nSilus' face.\r\n\r\n                   SILUS\r\n         You won't touch her.\r\n                                                                  54\r\n\r\n\r\n\r\n\r\n  Edgar looks at his brother for a moment. Edgar's features are\r\n  a paradox; almost sympathy for Silus followed by\r\n  understanding. Then he smiles.\r\n\r\n                       EDGAR\r\n             You've chosen to watch over her.\r\n             You want her don't you? I can see\r\n             it in your eyes. You are like me.\r\n\r\n  Silus' control has returned now.\r\n\r\n                       SILUS\r\n             I will pray for your cure, Brother.\r\n\r\n  Silus then turns and leaves.\r\n\r\n                       EDGAR\r\n             I wont be able to forgive you for\r\n             this you know? Not ever. In fact,\r\n             when I get out of here...\r\n\r\n  He moves violently, blood seeping from his wounds now.\r\n\r\n                       EDGAR\r\n                    (continuing)\r\n             I will make you see. I will show\r\n             you the way. I will see you drink\r\n             your little police woman right\r\n             through.\r\n\r\n  By now frightening music has hummed into existence. Silus has\r\n  paused at the door to the cell. Without looking back he\r\n  passes through the door, leaving Edgar to his prison.\r\n\r\n  Edgar, slowly turns back to the window in front of him. He\r\n  sees himself reflected in it. The Camera moves into Edgar's\r\n  eyes. The lights go out. All we are left with are his strange\r\n  reflective eyes. Waiting. Waiting.\r\n\r\n                                           FADE OUT:\r\n\r\n\r\n59 OMITTED                                                  59\r\n                                                                      55\r\n\r\n\r\n\r\n60 INT: BROTHERHOOD BUILDING, CELL - NIGHT                      60\r\n\r\n   A smooth, white walled cell. Flash edits of Edgar. Standing,\r\n   posing, balancing literally on his fingertips, doing\r\n   sensuous, slow gymnastic yoga. His hair has changed so we\r\n   know time has passed. Finally he stands there; poised tensile\r\n   steel. He slowly draws his finger nails against the shining\r\n   floor of the cell, it almost looks like he's sharpening them.\r\n   A tube comes from his arm for taking blood samples.\r\n\r\n   Then Edgar begins to run directly at the glass window of the\r\n   console room and then dives for it, smashing his head against\r\n   it; blood and saliva left smeared there. Behind the glass\r\n   window the console operators jump.\r\n\r\n\r\n60A INT: BROTHERHOOD BUILDING, SECURITY CONTROL ROOM - CONTINUI60A\r\n\r\n                       CONSOLE OPERATOR 1\r\n             I don't like it when he does that.\r\n\r\n                       CONSOLE OPERATOR 2\r\n                    (scolding Edgar; into\r\n                     microphone)\r\n             You stop that or we'll use the gas!\r\n\r\n\r\n60B INT: BROTHERHOOD BUILDING, CELL - CONTINUING                60B\r\n\r\n   We see Edgar, slowly pulling himself up, blood and bruising\r\n   apparent on his face. He smiles.\r\n\r\n   We zoom in close to the glass, see Edgar's infected blood run\r\n   down it until it congeals a little, caught in a tiny, almost\r\n   imperceptible, hairline fracture.\r\n\r\n\r\n61 EXT: JAMESTOWN CLUBLAND, STREET - NIGHT                      61\r\n\r\n   Rain on the streets. A man, covered in tattoos - an affluent\r\n   hood, is in a doorway snorting snuff\r\n\r\n   Dominic, Jones and several other cops emerge from hiding\r\n   places, pointing their guns at the man who puts his hands up.\r\n   Hand held cameras follow several other cops and Lilly as they\r\n   move into the building, again catching various hoods unaware.\r\n\r\n   Lilly moves forward quickly, down a hallway and finds what\r\n   she is looking for. In a room she discovers a harem of\r\n   prostitutes, none of them older than ten years old. She\r\n   stares at their doll-like faces, then lowers her gun.\r\n                                                                    56\r\n\r\n\r\n\r\n  We see Lilly, the scars from Edgar's attack now healed but\r\n  still apparent on her neck. Her hair is shorter; she seems\r\n  more worn down.\r\n\r\n  Jones appears on her shoulder.\r\n\r\n                       LILLY\r\n             Take them away from here.\r\n\r\n  Jones nods as Lilly walks off.\r\n\r\n                       JONES\r\n             You don't feel like a drink?\r\n\r\n  But Lilly doesn't respond, she just walks off. Jones watches\r\n  her leave. Then he stares at the round faces of the children\r\n  in front of him, something approaching compassion there.\r\n\r\n                       JONES\r\n                    (continuing)\r\n             Now my girls, anyone hungry?\r\n\r\n\r\n62 EXT: JAMESTOWN CLUBLAND, STREET - CONTINUING                62\r\n\r\n  Lilly exits the building into the rain, wrapping herself up\r\n  against it. Then she stops, feels she's being watched. She\r\n  looks up at the surrounding buildings. But there's nothing\r\n  there. She pulls out an amulet with the symbol of the\r\n  Brotherhood on it from under her jacket, and then after a\r\n  beat, kisses it, a little smile comes to warms her lips\r\n  against the cold. She leaves.\r\n\r\n  Cut to\r\n\r\n\r\n63 EXT: JAMESTOWN CLUBLAND, BUILDING ROOFTOP - CONTINUING      63\r\n\r\n  POV looking down on Lilly as she walks away. It's Silus,\r\n  watching her quietly from the shadows, his eyes reflective\r\n  orbs in the night.\r\n\r\n\r\n64 OMITTED                                                     64\r\n                                                                      57\r\n\r\n\r\n\r\n\r\n64A OMITTED                                                     64A\r\n\r\n\r\n64B INT: BROTHERHOOD BUILDING, CELL - CONTINUING                64B\r\n\r\n   Edgar's cell   is very dimly lit. Edgar is in front of the\r\n   glass window   to the console room. He is repeatedly banging is\r\n   head against   it. And his fingernails slide across the shiny\r\n   surface; has   he simply gone insane? A voice comes over the\r\n   Tannoy.\r\n\r\n                        CONSOLE OPERATOR\r\n                     (off)\r\n              If you don't stop that we'll use\r\n              the gas. You hear me?\r\n\r\n   Edgar just continues to bang his forehead against the glass,\r\n   it drums eerily.\r\n\r\n   Cut to\r\n\r\n\r\n65 INT: LILLY'S APARTMENT - DAY                                 65\r\n\r\n   We track through Lilly's apartment, silently. We enter the\r\n   lounge to see Lilly sitting on a couch watching a strange\r\n   looking valve powered globular Television-like device. We\r\n   track ominously up behind her. Then stop.\r\n                                                                58\r\n\r\n\r\n\r\n\r\n                   JONES\r\n                (off)\r\n         I knocked.\r\n\r\nLilly turns to Jones.\r\n\r\n                   LILLY\r\n         You nearly gave me a heart attack.\r\n\r\nSteph now emerges from the kitchen, dressed in a t-shirt and\r\nshorts and carrying some food. Jones looks at her coldly.\r\n\r\n                   JONES\r\n         What's this then?\r\n\r\nLilly and Steph smile at the inference Jones is beginning to\r\ndraw.\r\n\r\n                   STEPH\r\n         My apartment was condemned, keep\r\n         your hair on, what's left of it.\r\n\r\nMeanwhile Lilly shushes them and turns back to the murky gray\r\nimages emitting from the television.\r\n\r\n                   TV PRESENTER\r\n         ...the ascension through the ranks\r\n         of the Church has been fast for\r\n         Brother Silus. He will now be the\r\n         highest ranking cardinal outside\r\n         the ruling council of the\r\n         Brotherhood. This is largely seen\r\n         as a reward for his handling of\r\n         the last influenza pandemic.\r\n\r\nJones and Lilly watch as Silus is seen on the television in\r\nan interview. Steph stares at the screen with awe, she\r\ninvoluntarily kisses the symbol that hangs from a chain\r\naround her neck; it resembles a Brother's ring.\r\n\r\n                   STEPH\r\n         Isn't he amazing?\r\n\r\nJones sneers under his breath.\r\n\r\n                    JONES\r\n         A saint.\r\n\r\n                    LILLY\r\n         Quiet.\r\n\r\nWe move over their shoulders to track closer to the black and\r\nwhite TV screen.\r\n                                                                59\r\n\r\n\r\n\r\n\r\n                   TV PRESENTER\r\n         You have been an opponent of those\r\n         who want an easing in the ban on\r\n         genetic research.\r\n\r\n                     SILUS\r\n         Yes.\r\n\r\n                   TV PRESENTER\r\n         They would say you're denying\r\n         legitimate research into a science\r\n         that would change the world.\r\n\r\n                   SILUS\r\n         The church does not deny the\r\n         potential. Only the motivations of\r\n         those who want to exploit it. And\r\n         the fact that we understand so\r\n         little of its power.\r\n\r\n                   TV PRESENTER\r\n         With the elimination of influenza,\r\n         are we approaching a new era where\r\n         disease might be a thing of the\r\n         past?\r\n\r\nAs she is saying this we are now close on the TV's speaker.\r\nWe then begin tracking out. We reveal the speaker is not part\r\nof the TV, but the speaker in Edgar's cell. Edgar, smiling\r\ncoldly as he listens. As he listens he is gently gliding his\r\nfinger nails against a sharp edge of the chair; sharpening\r\nthem.\r\n\r\n                   SILUS\r\n         Disease is part of nature, it will\r\n         always be a part of our lives.\r\n\r\nClose on Edgar.\r\n\r\n                     EDGAR\r\n         How true.\r\n\r\n                   TV PRESENTER\r\n                (off)\r\n         Brother Silus' confirmation\r\n         ceremony will be held today in the\r\n         sacred Chapel of St. Augustine\r\n         where all the Brotherhood will\r\n         gather.\r\n\r\nEdgar listens, smiles.\r\n                                                                        60\r\n\r\n\r\n 66 INT: CEREMONIAL CHAPEL - DAY                                 66\r\n\r\n    An ornate door; ancient, with strange, beautiful dark symbols\r\n    carved into the old wood, like something out of a castle in\r\n    Prague. The doors open and we see a large chapel. And within\r\n    the large dark interior, lit by great long candles, the\r\n    Brotherhood have gathered. They all stare at the camera,\r\n    which we reveal is Silus' POV.\r\n\r\n    We see SILUS. Unchanged, still the perfect creature he has\r\n    always been. But for now the suit has gone and instead he\r\n    stands draped in fine ropes, robes that carry his life on\r\n    them; achievements, his rank, which is now high.\r\n\r\n    In the distance, at an alter, stands AUGUSTUS. He is also in\r\n    his gowns. A gong sounds and the Brothers, in unison with the\r\n    music, begin to chant; it is eerie, it sounds like Tibetan\r\n    monks.\r\n\r\n\r\n  67 OMITTED                                                     67\r\nTHRU                                                             THRU\r\n  69                                                             69\r\n\r\n\r\n 70 INT: BROTHERHOOD BUILDING, SECURITY CONTROL ROOM -           70\r\n    CONTINUING\r\n\r\n    Professor Liepsky, looking more aged, worn, enters the\r\n    control room. Alarms are sounding. At the console is a human\r\n    male who looks terrified.\r\n\r\n                         CONSOLE OPERATOR\r\n               I turned off the lights to try and\r\n               calm him...\r\n\r\n    Liepsky hits a button and it floods Edgar's cell with light.\r\n\r\n    Edgar is right there, staring at them, his hands plastered\r\n    over the glass window. He is covered in blood. In the\r\n    background a bloody corpse on the floor. Edgar bangs his head\r\n    against the glass, making Liepsky flinch. On Edgar's forehead\r\n    we see scars from this kind of repeated banging.\r\n\r\n                         CONSOLE OPERATOR\r\n                      (continuing)\r\n               We gassed him as usual. We waited\r\n               10 minutes. He must have held his\r\n               breath.\r\n\r\n    The look on Liepsky's face says it all. We see Edgar. We had\r\n    thought he was looking at the Professor. But he's not, his\r\n    gaze is focused past the Professor to the dimly seen back\r\n    wall of the control room.\r\n\r\n    On it is a schematic, showing this room, other rooms on the\r\n    level, the elevator shaft. Edgar is talking it all in.\r\n                                                                   61\r\n\r\n\r\n\r\n\r\n70A INT: CEREMONIAL CHAPEL - DAY                             70A\r\n\r\n   Silus, on one knee before Augustus. Augustus now places a\r\n   ceremonial sword at the back of Silus' neck, then draws it\r\n   gently across the skin. Below, a Brother holds out a bowl to\r\n   catch the drops of Silus' blood.\r\n\r\n                       AUGUSTUS\r\n             The blood flows, through them, to\r\n             us and we preserve them, preserve\r\n             the blood we are bound to protect.\r\n\r\n   Silus raises his head. We see his face. He takes the bowl,\r\n   drinks and then stands, holding it up to the other Brothers.\r\n\r\n                       SILUS\r\n             Let the blood be one and the two\r\n             races join, as the Perfect\r\n             Creature.\r\n\r\n   Cut to\r\n                                                                     62\r\n\r\n\r\n\r\n71 INT: BROTHERHOOD BUILDING, CELL - DAY                       71\r\n\r\n   Close on Edgar, smiling. Calm.\r\n\r\n                       EDGAR\r\n             Today my brother enters the\r\n             history books, Professor.\r\n\r\n                       PROFESSOR LIEPSKY\r\n                    (over the tannoy)\r\n             Move back!\r\n\r\n   After a moment, Edgar slowly walks backward in perfectly\r\n   smooth movements.\r\n\r\n                       EDGAR\r\n             Tonight all the Brothers will be\r\n             with him. A perfect day for me to\r\n             celebrate.\r\n\r\n   From the far wall Edgar begins to glide forward, first in\r\n   slow motion then ramping up to full speed, launching himself\r\n   at the glass window. He bounces off it, leaving blood and\r\n   saliva there.\r\n\r\n   The Professor and the console operator share an unsettled\r\n   glance.\r\n\r\n   Edgar slowly stands. He stares very intently at the glass\r\n   window in front of him. We zoom in on the glass. The small\r\n   hair line fracture we saw previously now begins to lengthen\r\n   before our eyes.\r\n\r\n   Edgar's face. A smile. Then he is forward at high velocity\r\n   before anything else can happen, smashing once more into the\r\n   glass window, this time shattering it into a thousand tiny\r\n   pieces.\r\n\r\n\r\n71A INT: BROTHERHOOD BUILDING, SECURITY CONTROL ROOM - CONTINUI71A\r\n\r\n   Horrified the console operator begins to make an escape. But\r\n   Edgar is on him before they're a few paces towards the door.\r\n   Edgar's long fingers sink into his neck like the flesh and\r\n   bone were clay. He screams.\r\n\r\n   The Professor makes it to the door, pulls himself through and\r\n   shuts it, but on Edgar's hand. Edgar doesn't flinch, but\r\n   kicks the door open.\r\n\r\n\r\n72 INT: BROTHERHOOD BUILDING, HALL - DAY                       72\r\n\r\n   The Professor is now scrambling, half falling in slow motion\r\n   as Edgar advances. As normal motion returns he kicks Liepsky\r\n   in the head; the sound of impact has a nasty fatality to it.\r\n                                                                     63\r\n\r\n\r\n\r\n   Cut to\r\n\r\n   Edgar. A door further down the hall is being unbolted. Edgar\r\n   immediately runs towards it, then launches himself at it, his\r\n   fingers extended like knives which enter the eyes of a guard\r\n   who's coming through the doorway. The guard falls back on\r\n   another two guards behind him.\r\n\r\n   A round from a shotgun goes off, taking a small chunk from\r\n   Edgar's side, but it's nothing more than a bee sting to him.\r\n   His speed and precision is that of a creature who knows he\r\n   only has one chance. He kicks the second guard under the\r\n   chin, instantly snapping his neck, while flicking the third\r\n   in the eyes with his sharpened fingernails. This guard falls,\r\n   his eyes leaking orbs.\r\n\r\n   Beat.\r\n\r\n   Edgar crouches like a dark god of destruction, a siren\r\n   sounding, the lights all going off, then flicking to red\r\n   emergency lights. Edgar's eyes reflect in the half-light.\r\n   Then he bares his teeth. At the end of the hallway he can\r\n   hear the elevator arriving on this floor. Edgar smiles.\r\n\r\n   Cut to\r\n\r\n\r\n 73 OMITTED                                                    73\r\nAND                                                            AND\r\n 74                                                            74\r\n\r\n\r\n75 INT: BROTHERHOOD BUILDING, FOYER - DAY                      75\r\n\r\n   The gleaming surfaces of the ground floor of the Brotherhood\r\n   building. We hear the elevator begin to arrive. We pan off\r\n   this to a desk where a receptionist sits.\r\n\r\n   Cut to\r\n\r\n   The Receptionist; she's trying desperately to place a call.\r\n   We see the shadow from a figure cast over her and she turns\r\n   and looks up, fear making her shake now.\r\n\r\n   Cut to\r\n\r\n   Edgar, staring down at her.\r\n\r\n                        EDGAR\r\n              You won't be taking any more calls\r\n              today.\r\n\r\n   Cut to\r\n                                                                   64\r\n\r\n\r\n\r\n\r\n76 INT: BROTHERHOOD BUILDING, HALL - LATER                    76\r\n\r\n  Slow steadicam along the underground halls. We see the bodies\r\n  of Edgar's victims being cleaned up by personnel. We stop. In\r\n  the distance we see the door to Edgar's cell open.\r\n\r\n  Cut to Silus, observing the scene. The lighting is\r\n  intermittent, flickering. Augustus is standing next to Silus,\r\n  the weird light of the hallway reflecting in his eyes.\r\n\r\n                      AUGUSTUS\r\n            Now he carries this thing out into\r\n            the world. Can you imagine what\r\n            will happen if he infects others?\r\n            Or if the experiments were known.\r\n\r\n  We are left with Silus' beautiful, reflective eyes.\r\n\r\n                      SILUS\r\n            The question becomes what will he\r\n            do next? He said he would kill us\r\n            all. But especially the police\r\n            officer. Lilly.\r\n\r\n  Cut to\r\n\r\n\r\n77 INT: JAMESTOWN SUBWAY - SUNSET                             77\r\n\r\n  Flashing lights of subway trains screaming through subway\r\n  tunnels, wheels screeching as metal grinds on metal.\r\n\r\n\r\n78 INT: JAMESTOWN SUBWAY EXIT - CONTINUING                    78\r\n\r\n  The streets are flooding like Bangkok in the monsoon; rain\r\n  pouring off awnings that hang out over the street. The\r\n  streets are full; prostitutes, drug peddlers, apothecary\r\n  shops, the industrial revolution low down and dirty. There is\r\n  a fight breaking out between two men who are dressed like\r\n  punk rockers.\r\n\r\n  Several people are alighting from a subway exit; the exit has\r\n  \"Jamestown/Brougham\" on a nouveaux styled sign that might\r\n  remind you of a Paris or Barcelona metro, only dirtier.\r\n\r\n  We see Lilly in the distance, in her dark jacket, emerge from\r\n  the subway. She begins the short walk to her apartment. The\r\n  streets are crowded and there are plenty of Maori people in\r\n  this area, so there's plenty of food stalls; the air is\r\n  filled with the sound of evening prayers. Lilly stops at one\r\n  of the food stalls and starts picking up vegetables. A Maori\r\n  man comes out and smiles and they start talking in the local\r\n  dialect. She buys a live eel.\r\n\r\n  Cut to\r\n                                                                    65\r\n\r\n\r\n\r\n\r\n  Across the street, in a doorway, we see a very weedy, sick\r\n  looking guy - this is Freddy. Standing next to him is a\r\n  Prostitute, swaying from the effects of laudanum.\r\n\r\n                      PROSTITUTE\r\n            Come on governor, you going to pay\r\n            me or not?\r\n\r\n                      FREDDY\r\n            Soon enough my cherub. I've not\r\n            finished with you yet.\r\n\r\n  He sucks on something that looks like a ventaline inhaler,\r\n  then pockets it, licks his lips and begins heading off down\r\n  the street, the drunk Prostitute dragged along.\r\n\r\n  Cut to\r\n\r\n  Again, Lilly from a distance, walking along the street which\r\n  is more deserted, now carrying a bag full of groceries. As\r\n  she walks we begin to hear voices; violent, arguing. Lilly\r\n  approaches an alleyway, the raised voices becoming louder.\r\n  She slowly places her bag on the ground and then pulls out a\r\n  revolver. She edges into the alleyway.\r\n\r\n\r\n79 EXT: JAMESTOWN SLUM, ALLEYWAY - CONTINUING                  79\r\n\r\n  Lilly's POV down the alleyway. It seems empty. The POV moves\r\n  in a little and there in an offshoot of the alleyway we can\r\n  see Freddy. He is standing over a woman who cowers; she's\r\n\r\n  plainly a prostitute. Freddy points a gun at her head.\r\n\r\n                      FREDDY\r\n            You've been ripping me off! I\r\n            should blow your dirty little\r\n            brains out!\r\n\r\n                      STEPH\r\n                   (off)\r\n            Police! Put the gun down now!\r\n\r\n  And now we see, it's not Lilly we've been watching, but\r\n  Steph. She points her gun at Freddy. Freddy turns to Steph.\r\n  He slowly raises his arms.\r\n\r\n                      FREDDY\r\n            It's ok. I'm complying officer,\r\n            see.\r\n\r\n                      STEPH\r\n            Put the gun on the ground and step\r\n            away!\r\n                                                                66\r\n\r\n\r\n\r\n\r\n                   FREDDY\r\n         I'm doing it.\r\n\r\nFreddy puts the gun down. The Prostitute on the ground now\r\nscrambles to her feet and heads towards Steph.\r\n\r\n                   PROSTITUTE\r\n         He's crazy! Fucking crazy!\r\n\r\nShe gives Freddy the finger then heads off.\r\n\r\n                    STEPH\r\n                 (to the prostitute)\r\n         Wait!\r\n                (to Freddy)\r\n         Down! Right now, down on the\r\n         ground!\r\n\r\nFreddy gets down.\r\n\r\n                   FREDDY\r\n         I'm getting wet now.\r\n\r\nLow Angle on Steph approaching. Behind her a FIGURE is\r\ndescending the wall behind him.\r\n\r\n                    STEPH\r\n         Shut up!\r\n\r\nSteph is over Freddy now. He's staring up at her. He can see\r\nthat a shape has appeared behind Steph. EDGAR, his eyes\r\ngleaming. Steph pulls out some handcuffs.\r\n\r\n                   STEPH\r\n                (continuing)\r\n         Put your hands behind your back.\r\n\r\n                   FREDDY\r\n         Sure. Anything you say.\r\n\r\nBut before Steph can move forward, Edgar has her gun hand in\r\na vice-like grip. She cries out in pain as her wrist\r\ndisintegrates. As a reflex she stamps on Edgar's foot and\r\nkicks him in the groin with her other.\r\n\r\nHe does not flinch. He smashes Steph into a down pipe on the\r\nwall of the alley so that wet grit is ground into her face.\r\nWe then see Edgar's face at her shoulder.\r\n\r\n                   EDGAR\r\n         Nice to meet you again.\r\n\r\nEdgar pulls back the jacket at Steph's neck to find no scars.\r\nHe pulls Steph's face towards him brutally, staring at her\r\nprofile.\r\n                                                                67\r\n\r\n\r\n\r\n\r\nHe then smashes her head against the pipe so that she falls\r\nunconscious to the ground.\r\n\r\n                   FREDDY\r\n         What's wrong?\r\n\r\n                   EDGAR\r\n         You brought me the wrong one.\r\n\r\n                   FREDDY\r\n         Does it matter, one's as good as\r\n         the next?\r\n\r\nEdgar's stare makes Freddy shut up and avert his eyes. Edgar\r\nthen turns on the tube on his arm so that blood drips into\r\nthe unconscious Steph's mouth; making her gag.\r\n\r\n                   FREDDY\r\n                (continuing)\r\n         You promised me some of that.\r\n\r\nFreddy's licking his lips.\r\n\r\nEdgar studies Freddy, then raises his arm. Freddy just\r\nstares. We see the tube on Edgar's arm that connects to his\r\nveins. And in a moment Freddy has latched onto it and is\r\nsucking like some kind of human leech.\r\n\r\n                   EDGAR\r\n         What do you see Freddy. Visions?\r\n         Can you see your future?\r\n\r\nFor a moment Edgar strokes Freddy's hair, then rips the tube\r\naway.\r\n\r\n                   FREDDY\r\n         Hey!\r\n\r\nFreddy moves forward, but is pushed back by Edgar.\r\n\r\n                   EDGAR\r\n         Don't be a greedy little pig\r\n         Freddy. You have to earn more.\r\n\r\nClose on Edgar, his repellent features under the hood. He\r\nlooks up. Far above, through the falling rain, past the high-\r\nrise slum around them; we see the moon hanging like a pearly\r\ncrescent in the sky. The moon is slowly obscured by clouds.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         We have more to do.\r\n\r\nCut to\r\n                                                                    68\r\n\r\n\r\n\r\n\r\n80 EXT: JAMESTOWN CLUBLAND, STREET - NIGHT                     80\r\n\r\n  We see a figure exiting the subway. This time it is Lilly,\r\n  following the same path that Steph took.\r\n                                                                 69\r\n\r\n\r\n\r\n\r\nMaking her way through the crowded street. The rain has given\r\nway to a fine mist.\r\n\r\nThen, as Lilly moves forward she senses something; that\r\nfeeling again, that she is being watched. She stands for a\r\nmoment as people push past, looks up at the gothic Victorian\r\nbuildings that loom out of the drifting mist. But there is\r\nnothing.\r\n\r\nLilly begins to make her way through the drifting mist,\r\ncasting glances at the odd passerby.\r\n\r\nThen, ahead of her, there is one pedestrian in particular,\r\ntaller than the rest, wearing a great hooded jacket, who\r\nstands out. He is immediately suspicious to Lilly. He is\r\nslowly moving through the crowd towards her. From under the\r\nhooded jacket we see the glint of the approaching figure's\r\neyes; an intense stare hidden in the shadows. The man now\r\nputs his hand in his pocket as if he's reaching for something.\r\n\r\nLilly now slowly slips her hand into her jacket, her gun a\r\ncold hard presence in her hand. She stares ahead at the\r\napproaching figure, who has now stopped, after bumping into\r\na pedestrian. Lilly continues forward, closer, closer. From\r\nunder the hooded jacket the glistening eyes of the man ahead\r\ncatches hers for a moment. The man now begins to approach\r\nher, his hand pulling something from his jacket, going for\r\nsomething. A gun.\r\n\r\nLilly immediately pulls her gun. The mist beads on the\r\nshining barrel of her gun. The man is raising his hand\r\ntowards her.\r\n\r\n                   LILLY\r\n         Police. Put your hands where I can\r\n         see them!\r\n\r\nThe man now lurches forward, his hand rising towards Lilly,\r\nher finger begins to caress the trigger of her gun, as the\r\nman looms closer. And then he is gone.\r\n\r\nCut to\r\n\r\nThe man slamming against the wet wall of a building, grasping\r\nat the hands that now threaten to throttle him.\r\n\r\nAnd we see Silus, his hands on the man's throat, and for only\r\nthe second time, we see anger in Silus' eyes.\r\n\r\nPeople in the street scatter as more Brothers emerge with\r\nguns pointed. And Lilly, shaking, pointing her gun at the man\r\nSilus is holding. On the ground, next to the man, she sees\r\nwhat he had in his hand. A pamphlet. Asking people to come to\r\nchurch service; a picture of a Brother priest serenely\r\nbeaming out from it.\r\n                                                                 70\r\n\r\n\r\n\r\n\r\nMeanwhile the man that Silus has is gagging on the ground,\r\nSilus' hand still on his throat. He's begging.\r\n\r\n                    PARISHONER\r\n          Holy brother, please...\r\n\r\nLilly grabs Silus' shoulder.\r\n\r\n                    LILLY\r\n          Let him go.\r\n\r\nShe shows Silus the pamphlet.\r\n\r\n                    LILLY\r\n                 (continuing)\r\n          He's harmless. Let him go.\r\n\r\nThe man now pulls back his hood. He is black, his large,\r\nwatery eyes stare up in awe at Silus. He grabs Silus' hand\r\nwhich now relaxes and draws Silus' ring to his lips, kissing\r\nit, in tears.\r\n\r\n                    PARISHONER\r\n          Forgive me. I've offended you...\r\n\r\nWe see Silus' dark stare.\r\n\r\nA beat.\r\n\r\nThen Silus reaches out and places his hand on the man's head.\r\n\r\n                    SILUS\r\n          No. You are divine. It is the\r\n          world that offends me.\r\n\r\nSilus rises, the Parishioner just lays there in awe. Silus now\r\nturns to Lilly who is on his shoulder. And now Lilly realizes\r\nfor the first time that it is Silus.\r\n\r\n                    LILLY\r\n          Brother Silus. What's going on?\r\n\r\nWe then hear a police siren and a car pulls up through the\r\nrain. The door opens and Jones emerges, taking in both Lilly\r\nand Silus. A grim smile of realization comes to Jones' face.\r\nHe pulls something from his jacket.\r\n\r\nCut to\r\n                                                                   71\r\n\r\n\r\n\r\n\r\n81 INT: LILLY'S APARTMENT, LOUNGE - NIGHT                     81\r\n\r\n  Steph's ID is tossed down on a table.\r\n\r\n                      JONES\r\n                   (off)\r\n            A shopkeeper heard yelling. Went\r\n            to see, found this. One witness.\r\n            A prostitute.\r\n\r\n  Jones tosses down a photo. It is Freddy, looking suitably\r\n  scummy in a police identikit photo.\r\n\r\n                      JONES\r\n                   (continuing)\r\n            She identified this lovely\r\n            citizen. We thought maybe he had\r\n            a grudge or was crazy. I guess we\r\n            were wrong.\r\n\r\n  Silus stands by the window; lights make patterns on his face.\r\n\r\n                      SILUS\r\n            It is Edgar.\r\n\r\n                      LILLY\r\n            And now he's got Steph. Why does\r\n            he want her?\r\n\r\n                      SILUS\r\n            She is not what he was after.\r\n\r\n  We see Lilly slowly getting it.\r\n\r\n                      LILLY\r\n            Steph was staying with me. She was\r\n            wearing my coat. It was me he was\r\n            after. Wasn't it?\r\n\r\n  Silus now turns, slowly moves towards her,   coming out of the\r\n  shadows. Lilly finds it hard to return his   gaze,\r\n  involuntarily touches her neck where it is   scarred from\r\n  Edgar's attack. Jones is watching all this   very carefully.\r\n\r\n                      SILUS\r\n            Yes. He will come for you Lilly.\r\n\r\n                      JONES\r\n            Right, then we put you somewhere\r\n            safe and set up this place.\r\n            Shooters on the roofs. And when he\r\n            comes we blow his fucking brains\r\n            out.\r\n\r\n                      SILUS\r\n            He will know. He will see and hear\r\n            it.\r\n                                                                  72\r\n\r\n\r\n\r\n\r\n  Lilly is staring at Steph's ID.\r\n\r\n                      LILLY\r\n            It has to be me. That's what he\r\n            wants. It's the only chance\r\n            Steph's got.\r\n\r\n                      JONES\r\n            What are you talking about, she's\r\n            probably dead already...\r\n\r\n                      LILLY\r\n            Jones! And we can't make it too\r\n            hard. He has to be able to get in.\r\n            He can't suspect anything.\r\n\r\n  Jones is shaking his head. Silus just stares at Lilly.\r\n\r\n                      LILLY\r\n                   (continuing)\r\n            That's the way it will be. I'm the\r\n            bait.\r\n\r\n  Close on Silus.\r\n\r\n\r\n82 INT: JAMESTOWN SLUM, HIDEOUT - SUNSET                    82\r\n\r\n  We are in a large, derelict warehouse; detritus and stacked\r\n  and smashed wooden crates. Music is playing somewhere in the\r\n  distance from a phonograph. We track through the space.\r\n  Daylight comes through cracks in the blacked out windows high\r\n  above, creating tiny shafts of laser light that flicker from\r\n  the dust.\r\n\r\n  We pass through the stacks of crates that are like a high\r\n  walled maze. Music emits from a stereo, loud. We continue to\r\n  move down a hall. Through the detritus, towards a door. A\r\n  hand opens the door.\r\n\r\n\r\n83 INT: JAMESTOWN SLUM, HIDEOUT, CELL - CONTINUING          83\r\n\r\n  In the corner of the room, huddled, chained to the floor, is\r\n  Steph. She does not look good. In fact she looks very sick.\r\n  There are tubes coming off her arm.\r\n\r\n  Freddy stoops down and begins to check the tubes running from\r\n  her arm. There are small taps on the tubes. He turns them on.\r\n  Blood begins to flow from her into a cup that is already\r\n  stained red. As he turns it off Steph shivers, her eyes open.\r\n  The whites of her eyes are blood red; she is sick. She\r\n  speaks, weakly.\r\n                                                                  73\r\n\r\n\r\n\r\n\r\n                      STEPH\r\n            Help me. Please, I'm sick. Help me.\r\n\r\n  She reaches for Freddy, but he pulls away. Freddy's not\r\n  looking too hot either.\r\n\r\n                      FREDDY\r\n            Don't fucking touch me.\r\n\r\n  He picks up the half filled cup and leaves. Steph stares\r\n  after him. Tears welling in her eyes, beginning to shake now,\r\n  moving against the chains that bind her. But they stay fast.\r\n\r\n\r\n84 INT: JAMESTOWN SLUM, HIDEOUT - CONTINUING                84\r\n\r\n  Freddy moves into the large warehouse space, the music still\r\n  echoing. Freddy looks around, searching for Edgar.\r\n\r\n                       FREDDY\r\n            Hey!\r\n\r\n  His voice echoes through the empty space.\r\n\r\n                      FREDDY\r\n                   (continuing)\r\n            Where've you gone now?\r\n\r\n\r\n85 EXT: LILLY'S APARTMENT - NIGHT                           85\r\n\r\n  A POV, wavering slightly, the hint of a whispering breath. We\r\n  see Lilly's apartment. The shot zooms in at high velocity,\r\n  searching the windows, zooming in here to check the lock on\r\n  this window, then on that. Then the shot wildly pans and\r\n  twists to the street below. Again it zooms in, to the\r\n  entrance of the building, to a couple walking past in the\r\n  night, as if searching for any sign of something out of the\r\n  ordinary. We can hear the couples voices, talking about inane\r\n  things.\r\n\r\n  Cut to Edgar's face in the shadows. His eyes reflective, his\r\n  whole being readied and concentrating. He closes his eyes. We\r\n  move around to end close on his ear, the soundtrack becoming\r\n  stark as the sounds of the night become eerily separated and\r\n  distinct. One sound in particular, a kind of metal sound,\r\n  scratching slightly, growing louder.\r\n\r\n  Edgar's eyes open.\r\n\r\n  Cut to\r\n\r\n  A zoom speeding towards Lilly's bedroom window, then swooping\r\n  at the last minute to end on an apartment one floor down.\r\n                                                                    74\r\n\r\n\r\n\r\n\r\n  And there, gently moving in the night air, a partially open\r\n  window, the latch grinding in the breeze.\r\n\r\n  Cut to\r\n\r\n\r\n86 INT: LILLY'S APARTMENT - CONTINUING                         86\r\n\r\n  A whiz pan POV, ending on the lounge of Lilly's apartment;\r\n  as if we just caught the last part of someone turning their\r\n  head, as if alerted. All the lights are out. We slowly begin\r\n  to move forward, dipping and gliding silently, into the\r\n  hallway. Slowly we approach a doorway and creep into...\r\n\r\n\r\n87 INT: LILLY'S APARTMENT, BEDROOM - CONTINUING                87\r\n\r\n  We can see Lilly lying on the bed, her skin alabaster in the\r\n  moonlight that comes through the window blinds. Closer closer\r\n  until we halt above her.\r\n\r\n  Cut closer to see Lilly asleep; her hand grips her service\r\n  revolver which protrudes from under her pillow.\r\n\r\n  We see Silus standing above her, his eyes glisten in the\r\n  sub light. As he watches, Lilly moves, as if she's having a\r\n  dream, her hand grips the gun beneath her pillow.\r\n\r\n  Silus slowly bends down, close to her. Watching. Then he\r\n  reaches out, as if to gently wake her, then stops as Lilly\r\n  stirs. She turns, curling up into the fetal position. Silus\r\n  is confronted with the old scars from Edgar's attack.\r\n\r\n  For a moment Silus stares at her. Stares. Then very quietly,\r\n  smoothly, he moves his head down, very close to her arm. He\r\n  sniffs it, as you would something very delicate, very\r\n  complex. Then he closes his eyes.\r\n\r\n  We see Lilly, her arm. Silus slowly enters frame, moves his\r\n  face close to Lilly, moves along her arm as if taking in her\r\n  scent. Slowly her arm raises, as his face moves up her body\r\n  to her neck, her hand now embracing Silus' head. Closer as\r\n  his face is near hers and still with eyes closed her face\r\n  turns towards him, his dark lips and hers are close.\r\n\r\n  Cut to\r\n\r\n  Silus, back where he was, smelling her arm. His eyes open and\r\n  he moves back a little, as if shocked by the daydream he has\r\n  just indulged in.\r\n\r\n  We see Lilly, as she was before, curled up in the fetal\r\n  position. Then a sound.\r\n                                                                    75\r\n\r\n\r\n\r\n\r\n  Silus immediately pivots, his gun immediately pointed at the\r\n  figure who stands silhouetted in the doorway. Jones.\r\n\r\n                      JONES\r\n            What are you doing?\r\n\r\n  The camera immediately drops, through the floor of Lilly's\r\n  apartment to the apartment below to find...\r\n\r\n\r\n88 INT: APARTMENT BELOW LILLY'S - CONTINUING                   88\r\n\r\n  ...Edgar, standing in the apartment below, immediately\r\n  freezing. We zoom into his ear as he listens.\r\n\r\n  Flash cuts of sound and image; a large man turning in his bed\r\n  and groaning, a tap drips in an apartment, a fluorescent\r\n  colored mosquito catcher vaporizing a mosquito with a zing,\r\n  then a woman's lips; whispering...\r\n\r\n                      LILLY\r\n            What is it? Jones?\r\n\r\n  Cut to\r\n\r\n\r\n89 INT: LILLY'S APARTMENT, BEDROOM - CONTINUING                89\r\n\r\n  Silus above Lilly, his hand up to silence her, Jones stock\r\n  still in the doorway. Waiting, waiting...\r\n\r\n  Bang, Silus rushes to the window of the apartment, ripping it\r\n  open, pointing his gun below. But there is no one there. Then\r\n  Silus spots it. On the floor below the window is open, a\r\n  curtain gently wafts out of the window in the breeze. Silus\r\n  turns to Jones and Lilly.\r\n\r\n                      SILUS\r\n            Stay here.\r\n\r\n  Silus immediately drops out of the window.\r\n\r\n  Cut to\r\n\r\n  Lilly rushes to the window and looks out expecting to see\r\n  Silus dead on the pavement below, but the street is empty.\r\n  And then she sees it; the window below her apartment is open.\r\n\r\n\r\n90 INT: LILLY'S APARTMENT, HALLWAY - CONTINUING                90\r\n\r\n  Lilly, gun extended, moving forward towards her apartment\r\n  door, Jones behind her, trying to grab her.\r\n                                                              76\r\n\r\n\r\n\r\n\r\n                   JONES\r\n         Get back here, Lilly!\r\n\r\nBut Lilly shoves him off, opens the door and moves into the\r\nhall and waits.\r\n                                                                    77\r\n\r\n\r\n\r\n  She hears more smashing from the other side of the building.\r\n  She turns to Jones.\r\n\r\n                        LILLY\r\n            Cover me.\r\n\r\n  And she's off, smashing the apartment door in front of her\r\n  with her foot and moving into the apartment, towards the\r\n  window beyond. Jones can only curse, lift his gun and move\r\n  after her.\r\n\r\n\r\n91 INT: APARTMENT ADJACENT TO LILLY'S - CONTINUING             91\r\n\r\n  Lilly's POV crashing through the apartment and reaching the\r\n  window, pulling it open to see...\r\n\r\n\r\n92 EXT: LILLY'S APARTMENT, REAR - CONTINUING                   92\r\n\r\n  ...Lilly's POV of the city below. We see her search with her\r\n  eyes, and then she sees it.\r\n\r\n  Cut to\r\n\r\n  Lilly's POV, closer, looking down on Edgar running over a\r\n  roof.\r\n\r\n  Cut to\r\n\r\n  Edgar running towards us as we track back, then he launches\r\n  himself...\r\n\r\n  Cut to\r\n\r\n  Low angle, Edgar jumping from above us, to land almost on the\r\n  camera, stopping himself by grabbing iron piping protruding\r\n  from the side of the building.\r\n\r\n  Edgar turns, smiles, thinking he's escaped; then shock comes\r\n  across his face.\r\n\r\n  Cut to\r\n\r\n  Edgar's POV as Silus flies through the air and crashes\r\n  straight into the camera. Silus' hands go straight for\r\n  Edgar's throat, stopping Edgar from falling. The two\r\n  Brothers eyes lock.\r\n\r\n                      EDGAR\r\n            You saved me...\r\n\r\n  Then Edgar's smile. He pushes off the wall with his legs,\r\n  sending both of them tumbling over the railing.\r\n                                                                78\r\n\r\n\r\n\r\n\r\nWe see them fall, Silus hitting a railing which sends him\r\nspinning out of control, whilst Edgar manages to clasp onto\r\nit.\r\n\r\nCut to\r\n\r\nSilus' POV, tumbling wildly out of control, heading for the\r\nground, finally coming to a jarring stop, the view of the\r\nalleyway upside down.\r\n\r\nWe now reveal Silus, only just conscious, caught in wire\r\nnetting, hanging upside down in the alleyway.\r\n\r\nAnd there, landing, is Edgar, poised, watching. Edgar slowly\r\napproaches so that he is near. He bends down to Silus.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         When will you admit it. You're\r\n         just like me.\r\n\r\nEdgar's nose is bleeding. He dabs some on his fingers, then\r\nraises his hand to Silus.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         Maybe you need some encouragement.\r\n\r\nHe brings the dripping blood closer to Silus, closer...\r\n\r\nThen an explosion; the sound of bullets whistling through the\r\nair. Then Edgar is gone.\r\n\r\nCut to\r\n\r\nLilly and Jones entering the alleyway to find Silus still\r\nhanging from the railing.\r\n\r\n                   LILLY\r\n                (to Jones)\r\n         Get him down.\r\n\r\nLilly then moves into the adjacent alleyway to search for\r\nEdgar.\r\n\r\n                   JONES\r\n         Lilly, wait! Damn you. Lilly!\r\n\r\nShe turns and gives him a final quick look.\r\n\r\n                   LILLY\r\n         If he escapes then Steph is dead.\r\n         Just follow me when you can, hurry!\r\n\r\nCut to\r\n                                                                79\r\n\r\n\r\n\r\n\r\nLilly moving through a slick wet alleyway; water plops and\r\ndribbles from leaking pipes. She swings her gun towards\r\nmovement; water crashing out of a pipe. Lilly's shaking,\r\nterrified, but she keeps on going. And then another sound and\r\nshe swings her gun to find Edgar, standing in the shadows,\r\nwaiting.\r\n\r\n                   EDGAR\r\n         The little policewoman.\r\n\r\n                   LILLY\r\n         Don't move!\r\n\r\nEdgar purposely raises his hand so that she fires; the bullet\r\ngoing through the flesh of Edgar's arm; his arm now smoking.\r\n\r\n                   LILLY\r\n                (continuing)\r\n         I said don't move. Where is she,\r\n         where's the girl?\r\n\r\nEdgar can only smile.\r\n\r\n                   EDGAR\r\n         Oh, I've killed her already.\r\n         Essentially.\r\n\r\nThen he moves, she fires, but he's too fast, spinning,\r\ndiving, in an instant he has the gun, twisting it and Lilly's\r\narm behind her back. She fires, once, twice, the bullets and\r\nsmoke rising up from Edgar's side. He twists harder, the gun\r\nthen falling to the ground. Edgar is now behind her. He moves\r\nhis face close to hers.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         Has he tasted you yet, little\r\n         policewoman?\r\n\r\nLilly tries to twist out of his grasp.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         He's just the same as me, you know\r\n         it, you can feel it too.\r\n\r\n                   LILLY\r\n         He's nothing like you.\r\n\r\nEdgar's face twists into a smile.\r\n\r\n                   EDGAR\r\n         We will see. You will be my tool.\r\n\r\n                                         JUMP CUT:\r\n                                                                  80\r\n\r\n\r\n\r\n\r\n  A cat, hissing, screeching.\r\n\r\n  Cut to Silus and Jones entering the alleyway, the cat tearing\r\n  away from them in fright. Jones moves forward and we tilt\r\n  down to see Lilly's gun lying on the wet cobblestones, smoke\r\n  wisping from the barrel. Jones stoops down and picks up the\r\n  gun, then turns to Silus. After a beat, Jones throws the gun\r\n  at Silus' head. Silus dodges it easily and it clacks onto the\r\n  cobblestones.\r\n\r\n                      JONES\r\n            You happy now?\r\n\r\n  Cut to\r\n\r\n\r\n93 INT: JAMESTOWN SLUM, HIDEOUT, TOILET - DAY               93\r\n\r\n  Close on Freddy's face, looking at himself in a mirror. He's\r\n  pulling back his eyelid; his eyes are bloodshot and he's\r\n  sweating. Freddy then pushes the mirror shut and we see\r\n  Edgar, silhouetted in the bathroom doorway.\r\n\r\n                      FREDDY\r\n            You scared the shit out of me.\r\n            Hey, the police woman. She's real\r\n            sick. To tell the truth I don't\r\n            feel so hot myself.\r\n\r\n  Edgar approaches, still silhouetted.\r\n\r\n                      EDGAR\r\n            I want you to take her and put her\r\n            where they'll find her.\r\n\r\n                      FREDDY\r\n            But I'm sick. She's given me\r\n            something...\r\n\r\n  Edgar moves incredibly fast, we can't quite see what he has\r\n  done but we suspect he has just buried his hand in Freddy's\r\n  chest. We see Freddy's face, stunned, deathly white.\r\n\r\n                      EDGAR\r\n            What have I said to you?\r\n\r\n  Freddy falls, leaving Edgar's hand in mid air; we can't see\r\n  clearly, but it likes frighteningly like he has one of\r\n  Freddy's internal organs in his hand.\r\n\r\n                      EDGAR\r\n                   (continuing)\r\n            I hate arguments.\r\n\r\n  Cut to\r\n                                                                    81\r\n\r\n\r\n\r\n94 EXT: JAMESTOWN SLUM, ALLEYWAY - DAY                         94\r\n\r\n  Close on a pendant; the symbol of the Brothers.\r\n\r\n  We pull out to reveal Steph, very sick now. Edgar is has her\r\n  wrapped in a sheet and is half carrying her along a decrepit\r\n  alley. Ahead of him is a street; we can see several passersby.\r\n\r\n  Edgar sits Steph up against the wall of the alley, propped\r\n  up. She really is sick. She coughs.\r\n\r\n  Edgar looks at her for a moment. Then after consideration,\r\n  takes her hands and crosses them, and places an envelope in\r\n  her limp hands. Happy with the composition he moves off.\r\n\r\n  Cut to\r\n\r\n  A close High Angle on Steph looking up, her bloodshot, dazed\r\n  eyes staring blankly. We drift up and away from her. Already\r\n  the rats are beginning to come out and sniff her.\r\n\r\n\r\n95 INT: HOSPITAL, HALLWAY - DAY                                95\r\n\r\n  There are several nurses running towards us, they turn and\r\n  move down a hallway. We reveal Jones and Dominic. They move\r\n  to the nurses station and Jones flashes his ID.\r\n\r\n                      JONES\r\n            Stephanie Richards, you just\r\n            brought her in.\r\n\r\n  And then a scream. Blood curdling; the sound of someone\r\n  insane, screaming their lungs out, hurling abuse. We see the\r\n  faces of the cops and the terrified nurse in front of them\r\n  who points down the hall where the noise is coming from. The\r\n  Cops move off. The nurse then sees someone else arrive. She\r\n  raises the pendant that hangs around her neck and kisses it.\r\n\r\n                      NURSE\r\n            Thank god you're here.\r\n\r\n  We see who has entered. It is Silus. Near him there are\r\n  several people sick. They look sick; like Steph and Freddy\r\n  looked.\r\n\r\n  Cut to\r\n\r\n\r\n96 INT: HOSPITAL, ISOLATION WARD - CONTINUING                  96\r\n\r\n  Jones and the Dominic move through an anteroom. Nursing staff\r\n  and doctors are madly running about. The screaming we heard\r\n  before punctuates the noisy clutter of medical procedures.\r\n\r\n  Jones approaches a door; it has the words \"level 4 isolation\r\n  unit\" on it. A large Guard blocks his way.\r\n                                                                   82\r\n\r\n\r\n\r\n  Jones shows his ID. A figure brushes past them and enters the\r\n  door; the figure is fully decked out in something like a\r\n  spacesuit.\r\n\r\n  Jones and Dominic are ushered sideways, to another room. This\r\n  room has a glass viewing window which looks into the adjacent\r\n  room. A middle aged Doctor stands there, his thumb nail in\r\n  his mouth, looking thoughtful. When he turns towards Jones,\r\n  we can see there is fear in his eyes. Jones shows his ID.\r\n  Screaming from within the adjacent room draws his attention\r\n  and that of Jones.\r\n\r\n\r\n97 INT: HOSPITAL, STEPH'S ROOM - CONTINUING                   97\r\n\r\n  In the adjacent room two nurses are trying to put in a line\r\n  to Steph's arms which are restrained by straps. Steph lies on\r\n  a bed. She looks truly sick; her hair matted, her skin\r\n  blotchy. Her eyes are also blood red, the tiny blood vessels\r\n  hemorrhaging. And she is screaming abuse at the nurses and\r\n  Doctors who work on her.\r\n\r\n  Close of Jones, staring at the scene.\r\n\r\n  Silus now enters the room. Almost immediately Steph stops\r\n  screaming. She is staring directly at Silus; even this\r\n  deranged, she is still in complete awe.\r\n\r\n                      JONES\r\n            Will she recover?\r\n\r\n  The Doctor turns to Jones; the Doctor looks puzzled.\r\n\r\n                      DOCTOR\r\n            No. Containment is the issue now.\r\n            She is... insane. And we've had\r\n            more cases, 10 in the last hour.\r\n\r\n  The Doctor leaves.\r\n\r\n  Jones turns to Silus.\r\n\r\n                      JONES\r\n            What is this? What is it?\r\n\r\n                      SILUS\r\n            It comes from Edgar. He has shared\r\n            his blood with them.\r\n\r\n                      JONES\r\n            You're telling me that he's out\r\n            there spreading this around?\r\n\r\n  Jones gets close to Silus, intimidating.\r\n                                                                        83\r\n\r\n\r\n\r\n\r\n                         JONES\r\n                      (continuing)\r\n               He'll give it to Lilly!\r\n\r\n    Dominic gets in between.\r\n\r\n                         DOMINIC\r\n               Jones! Back off.\r\n\r\n    Dominic pushes Jones back and then stares at Silus.\r\n\r\n                         DOMINIC\r\n                      (continuing)\r\n               This is spreading.\r\n\r\n    Silus doesn't speak, just stares at Steph.\r\n\r\n                         DOMINIC\r\n                      (continuing)\r\n               Brother Silus?\r\n\r\n                         JONES\r\n               That's it, Lilly's dead.\r\n\r\n                         SILUS\r\n               No. He will keep her alive.\r\n\r\n                        DOMINIC\r\n               Why?\r\n\r\n                         SILUS\r\n               So that I will come for him.\r\n               That's what he wants.\r\n\r\n    Dominic pulls an envelope from his jacket and passes it to\r\n    Silus, who opens it to discover a beautifully handwritten\r\n    letter.\r\n\r\n                         DOMINIC\r\n               It says, \"Everything flows from\r\n               me. My blood will change the\r\n               world.\" What does that mean?\r\n\r\n    Silus stares at the two men. Then turns to Steph, her eyes,\r\n    creepy, still locked on Silus.\r\n\r\n\r\n  98 OMITTED                                                     98\r\nTHRU                                                             THRU\r\n 103                                                             103\r\n                                                                        84\r\n\r\n\r\n\r\n103A EXT: JAMESTOWN SLUM BUILDING, ROOF - NIGHT                  103A\r\n\r\n    Jamestown, from above. We drift down so that we see the\r\n    buildings, see fires breaking out, hear screams echoing\r\n    through the night. We continue down towards the rooftop of\r\n    one building in particular. We see one of the infected\r\n    citizens of Jamestown standing on the roof, screaming out\r\n    into the night like some crazed animal.\r\n\r\n    We continue past the creature, then travel through a\r\n    ventilation shaft on the roof. We hurtle down this, down,\r\n    down to the depths of the building and out the shaft into a\r\n    subterranean basement. We drift through a doorway in the wet\r\n    stone wall, down a tunnel, to finally enter a room.\r\n\r\n    And we see Lilly. She is covered in grime, her hands bound\r\n    above her head with chains to an ancient, ornate pipes that\r\n    twist through the place. She looks up at us.\r\n\r\n    Cut to\r\n\r\n\r\n103B INT: JAMESTOWN SLUM, HIDEOUT, CELL - CONTINUING             103B\r\n\r\n    Edgar, now standing above Lilly. He bends down, checking the\r\n    chains that bind her. His face moves close to her so that he\r\n    can smell her. Hear her heart pounding. See the scars from\r\n    his previous attack. Then a noise, echoing through the\r\n    tunnels. The sound of the mad infected denizens of the\r\n    containment zone, screaming out into the night. Edgar smiles.\r\n\r\n                        EDGAR\r\n              It almost sounds like children\r\n              playing, don't you think?\r\n\r\n                        LILLY\r\n              No.\r\n\r\n                        EDGAR\r\n              I looked at your body. You have\r\n              borne a child.\r\n\r\n    Lilly's features tense.\r\n\r\n                        EDGAR\r\n                     (continuing)\r\n              Did you abandon it? Your kind are\r\n              good at that.\r\n\r\n    Even though her position is impossible, Lilly won't show\r\n    Edgar fear.\r\n\r\n                        LILLY\r\n              Why don't you just kill me?\r\n\r\n    Edgar just smiles. Lilly spits in his face and screams at him.\r\n                                                               85\r\n\r\n\r\n\r\n                   LILLY\r\n                (continuing)\r\n         Kill me!\r\n\r\nEdgar grabs her by the throat, for a moment anger boils out\r\nof Edgar, but he restrains himself.\r\n\r\n                   EDGAR\r\n         I can see why he likes you. But I\r\n         have a better use for you. To save\r\n         you, Silus will take my blood.\r\n         Join me.\r\n\r\n                   LILLY\r\n         You're insane.\r\n\r\n                   EDGAR\r\n         The world is insane. I am better\r\n         than you. But they force me to\r\n         serve you. Does that happen in a\r\n         sane world? Forced to watch you\r\n         waste the most precious thing you\r\n         have. Life.\r\n\r\nThen Edgar's face changes; he stares at her with pity, for a\r\nmoment we see a hint of the noble creature he used to be.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         Do you know what they do to us\r\n         when we are born? They take us\r\n         from our mothers. Force us into a\r\n         life of loneliness, and denial.\r\n         Can you imagine a life like that?\r\n\r\nLilly senses an opening.\r\n\r\n                   LILLY\r\n         You don't have to do this. You can\r\n         change things.\r\n\r\nEdgar places his head in his hands, he seems to be weeping.\r\n\r\n                   EDGAR\r\n         You have reminded me of something.\r\n\r\nWhen he looks back up at her, he is terrifying to behold.\r\n\r\n                   EDGAR\r\n                (continuing)\r\n         I must search out my mother, if\r\n         she still lives. And kill her for\r\n         what she did.\r\n                                                                      86\r\n\r\n\r\n\r\n\r\n   Edgar smiles quietly, rises and exits.\r\n\r\n   We are left with Lilly bound to the rusty pipes. She strains,\r\n   tries to pull her hands from the chains, but they won't move.\r\n   Above her on the pipe there is a old rusty bracket. Lilly\r\n   blinks through the sweat running into her eyes. She moves the\r\n\r\n   chains that bind her hands closer to the bracket and begins\r\n   rubbing the chains against the bracket in the vain hope that\r\n   she may be able to cut her way through the chains. She\r\n   strains harder and harder, fighting back the tears, the fear,\r\n   she just grinds at the chain repetitively.\r\n\r\n   Cut to\r\n\r\n\r\n104 INT: HOSPITAL, STEPH'S ROOM - DAY                           104\r\n\r\n   Steph, in the hospital bed, her eyes staring up, hollow. A\r\n   bed sheet is drawn over her dead face.\r\n\r\n   Cut to\r\n\r\n\r\n105 INT: HOSPITAL, VARIOUS - CONTINUING                         105\r\n\r\n   We see Silus. Staring through a window into an office. In\r\n   there we can see Jones. Jones is talking in a very animated\r\n   manner to someone who is obviously a reporter. The reporter\r\n   stares, like Jones, through the window towards Silus. Jones\r\n   turns away, looking guilty.\r\n\r\n   Cut to\r\n\r\n   Bedlam in the hospital corridors. People screaming, being\r\n   restrained. What is clear is that the virus Steph had has now\r\n   broken out into a plague of biblical proportions. We see a\r\n   DOCTOR standing in the middle of the hospital corridor, blood\r\n   over his smock, in a state of pure shock.\r\n\r\n   And we see Silus there. A perfect creature observing the\r\n   chaos. As he stands there he can see a small child; a girl,\r\n   maybe around five. Silus stares at the child. The girl is\r\n   holding her mother's hand. Her mother lies on a cot, strapped\r\n   down; there are many other cots filling the crowded hallway.\r\n   Her mother is dead. The girl's dirty face is stained with\r\n   tears. For a moment Silus wavers.\r\n\r\n   Then he moves over to the girl. She    stares up at him with her\r\n   tear stained grimy face. Silus goes    to place his hand on her\r\n   forehead as blessing, but the child    cringes, then jumps up\r\n   and escapes down the hallway. Silus    can only stare at the\r\n   horror of it all.\r\n\r\n   Cut to\r\n                                                                        87\r\n\r\n\r\n\r\n106 INT: ROOM - DAY                                              106\r\n\r\n    On a dirty, stained valve radio. We slowly track in on the\r\n    speaker, hearing an interview coming from it.\r\n\r\n                         REPORTER\r\n                      (off)\r\n               Some say this plague is the result\r\n               of genetic experimentation, by the\r\n               Brothers. Do you have a comment?\r\n\r\n    Cut to\r\n\r\n\r\n106A DELETED                                                     106A\r\n\r\n\r\n107 EXT: JAMESTOWN SLUM, QUARANTINE ZONE - NIGHT                 107\r\n\r\n    We move past road blocks.\r\n\r\n                         HEALTH OFFICIAL\r\n                      (off)\r\n               We're asking everyone to stay in\r\n               their homes in the sections of\r\n               Jamestown now under quarantine.\r\n\r\n    Armed, gas masked guards stand with their guns at the ready.\r\n    Beyond the blockade is Jamestown. Fires burn, bodies lie on\r\n    the streets.\r\n\r\n                         REPORTER\r\n                      (off)\r\n               There are reports of residents\r\n               being shot trying to escape the\r\n               quarantine zone. Is that true?\r\n               They say the Queen has left the\r\n               city... Is this martial law?\r\n\r\n    A figure is stumbling towards us. One of the guards fires and\r\n    the figure drops.\r\n\r\n    Cut to\r\n\r\n    Two soldiers, wearing crude Victorian containment suits,\r\n    surveying a map.\r\n                                                                     88\r\n\r\n\r\n\r\n                        SOLDIER\r\n              We've blocked off this section,\r\n              and here, containing the Jamestown\r\n              slums.\r\n\r\n   We see the soldier outlining the Quarantine zone, marked in\r\n   red.\r\n\r\n\r\n108 OMITTED                                                    108\r\nAND                                                            AND\r\n109                                                            109\r\n\r\n\r\n110 INT: BROTHERHOOD BUILDING, FOYER - DAY                     110\r\n\r\n   There is an angry mob, banging on the locked doors of the\r\n   brotherhood building. Their placards tell the tale. \"Brothers\r\n   have brought the plague.\" \"No to Genetic experimentation.\"\r\n\r\n                        EDGAR\r\n                     (off)\r\n              Do you like the world I am making\r\n              for us, Silus? I haven't had your\r\n              little policewoman yet. But I will\r\n              soon. You'll just have to find me.\r\n              You know where I am. Everything\r\n              flows from me. Remember that...\r\n\r\n   Human police stand ready with guns. It's a disaster. Silus is\r\n   there. He watches the faces of the mob, baying for blood. He\r\n   sees them burning the emblems of the brotherhood.\r\n\r\n                                             DISSOLVE TO:\r\n\r\n\r\n111 INT: BROTHERHOOD BUILDING, AUGUSTUS' OFFICE - CONTINUING   111\r\n\r\n   We are in a beautifully ornate office. It is like a private\r\n   chapel. We see Silus enter. He is grim. Augustus is kneeling\r\n   in prayer. He senses Silus.\r\n\r\n                        AUGUSTUS\r\n              The infection is spreading. Each\r\n              day he shares his blood with more\r\n              of them. Even though they are\r\n              locked in their homes.\r\n                                                                89\r\n\r\n\r\n\r\n\r\n                   SILUS\r\n         He is somewhere in the quarantine\r\n         zone. I will find him.\r\n\r\nAugustus turns to Silus. Augustus moves closer to him, stares\r\ninto Silus' strange, pale eyes.\r\n\r\n                   AUGUSTUS\r\n         Clear. So very clear your eyes.\r\n         The way they were when you were\r\n         born. There will be no search.\r\n\r\nAugustus moves off to his desk. Silus is shocked.\r\n\r\n                   SILUS\r\n         No search?\r\n\r\n                   AUGUSTUS\r\n         The Queen has instructed the\r\n         government to evacuate the city\r\n         around the quarantine zone. In\r\n         another day they will take action.\r\n\r\n                   SILUS\r\n         What kind of action?\r\n\r\n                   AUGUSTUS\r\n         Eradication. Of everything within\r\n         the area. They will burn it all.\r\n         Including Edgar.\r\n\r\n                   SILUS\r\n         And the innocents there, who are\r\n         not infected?\r\n\r\n                   AUGUSTUS\r\n         It is a necessary step. We cannot\r\n         let this escape.\r\n\r\n                   SILUS\r\n         No!\r\n\r\nAugustus looks up at Silus; this is perhaps the first time\r\nSilus has refused anything that Augustus has decreed.\r\n                                                                     90\r\n\r\n\r\n\r\n\r\n                       AUGUSTUS\r\n             Is it the policewoman? Is this\r\n             affecting your thinking? There is\r\n             no love for our kind Silus. Only\r\n             service.\r\n\r\n                       SILUS\r\n             We have done this. Released this\r\n             thing into the world. We have\r\n             betrayed their trust in us, more\r\n             than once. I won't do it again.\r\n\r\n                       AUGUSTUS\r\n             There is no debate. They will be\r\n             sacrificed, so the rest will be\r\n             pure.\r\n\r\n   Silus shakes his head.\r\n\r\n                       AUGUSTUS\r\n                    (continuing)\r\n             This policeman, Jones. He talked\r\n             to the press. Told them this came\r\n             from Edgar.\r\n\r\n   Silus watches Augustus very carefully.\r\n\r\n                       AUGUSTUS\r\n                    (continuing)\r\n             There are members of the inner\r\n             circle who question the way you\r\n             have handled this. Blame you for\r\n             this man's actions. I have made it\r\n             clear that you will fix this. That\r\n             you will silence him.\r\n\r\n   Augustus moves close to Silus now. Gently touches his face.\r\n\r\n                       AUGUSTUS\r\n                    (continuing)\r\n             These are hard things we do. But\r\n             you must think of the greater\r\n             good. And of your own future.\r\n\r\n   Cut to\r\n\r\n   A light bulb flickering.\r\n\r\n\r\n112 INT: JONES APARTMENT, HALL - NIGHT                         112\r\n\r\n   Jones exits an elevator. The light above him flickers and\r\n   dies. He stands in the dark.\r\n                                                                      91\r\n\r\n\r\n\r\n\r\n                       JONES\r\n             Great.\r\n\r\n   Jones begins to stomp down the hall, towards the part of the\r\n   hall that is lit. Then pop, that light goes out as well.\r\n\r\n   Jones stops. He pulls out his big gun from his armpit\r\n   holster. He checks over his shoulder, and then with the gun\r\n   extended he moves slowly forward. He approaches an area that\r\n   opens up a little. He pauses, then under his breath.\r\n\r\n                       JONES\r\n                    (continuing)\r\n             Come on then...\r\n\r\n   He launches himself around the corner and fires his gun. He's\r\n   lucky that his misses his target.\r\n\r\n   A small, dirty, cowering boy with his fingers on the bank of\r\n   light switches. The wall next to the boy's head has exploded;\r\n   dust and wall board now drift down like snow.\r\n\r\n   Jones can only stare at the quivering child whose dirty face\r\n   blank with fright.\r\n\r\n   Then Jones turns. He can make out a figure in the dark hall.\r\n   A patient, quiet sentinel.\r\n\r\n\r\n113 INT: JONES APARTMENT - NIGHT                                113\r\n\r\n   Jones opens the door to his apartment and enters. Silus\r\n   follows. The place is a dump. Lounge and kitchen all one\r\n   area, bedroom off to one side, dishes in the sink, clothes\r\n   everywhere. Jones heads into the kitchen and turns on a\r\n   coffee machine, then grabs a dirty glass, pours a drink.\r\n   Silus watches him.\r\n\r\n   Jones comes into the lounge. He still has his gun in his\r\n   hand. He stares at Silus, whose perfect outline makes Jones'\r\n   life seem even more abysmal.\r\n\r\n                       JONES\r\n             What do you want?\r\n\r\n                       SILUS\r\n             I want to help you. They know you\r\n             talked to the press.\r\n\r\n                       JONES\r\n             They can fuck off. For that\r\n             matter, so can you.\r\n\r\n   Jones takes a slurp on his drink.\r\n                                                                92\r\n\r\n\r\n\r\n                   JONES\r\n                (continuing)\r\n         You'd be the last person I'd trust.\r\n\r\n                   SILUS\r\n         Why?\r\n\r\n                   JONES\r\n         I saw you. Remember. Watching\r\n         Lilly, when she was asleep.\r\n\r\nSilus doesn't answer now. Jones moves forward.\r\n\r\n                   JONES\r\n                (continuing)\r\n         Maybe you're just like your\r\n         Brother. Maybe you're helping him.\r\n         Now there's a thought.\r\n\r\nJones prods Silus' shoulder with the gun.\r\n\r\n                   JONES\r\n                (continuing)\r\n         Do you know where she is?\r\n\r\nJones prods again and finds Silus' elegant steel fingers\r\naround his wrist. The two men face off.\r\n\r\n                   JONES\r\n                (continuing)\r\n         You've changed. Not the outside.\r\n         But inside. I know you. You know\r\n         what, I can see myself?\r\n\r\nJones tries to wrench his wrist free, but Silus holds it\r\ntight. Jones swings his free arm and smashes Silus on the\r\nside of the face.\r\n\r\nFor a moment Silus doesn't move, then his hand is around\r\nJones' throat. Squeezing. Squeezing. His other hand wrenching\r\nthe gun from Jones' hand. There is silence in the room, apart\r\nfrom Jones' choking gags. Then Silus pushes Jones back so\r\nthat he flies into a chair. Jones stares up at Silus now,\r\nfear in his eyes. Silus watches him. Then a sound attracts\r\nhis attention.\r\n\r\nCut to\r\n\r\nWater hisses from Jones' coffee machine in the kitchen.\r\n\r\n                   JONES\r\n                (continuing; sneering)\r\n         Coffee's ready.\r\n\r\nCut to\r\n                                                                   93\r\n\r\n\r\n\r\n\r\n   Silus, turning, listening, focusing on the water dripping\r\n   from the coffee machine. Silus is concentrating. Realization\r\n   comes into his eyes.\r\n\r\n   We zoom close to Silus' ear. The soundtrack becomes enhanced.\r\n\r\n   Cut to\r\n\r\n   The tap in Jones' festering sink, dripping; plop plop plop.\r\n   We see the water in the bottom of the sink reflecting the\r\n   room. We see Silus approaching; reflected there. His hand\r\n   enters frame and touches the water. And we hear Edgar's\r\n   voice, the words we heard him say in Augustus' office.\r\n\r\n                       EDGAR\r\n                    (off)\r\n             You know where I am. Everything\r\n             flows from me...\r\n\r\n   We see Silus staring at the water. We see a giant drop of\r\n   water hanging from the tap, hanging, hanging, then falling...\r\n\r\n   Cut to\r\n\r\n\r\n114 INT: JAMESTOWN SLUM, HIDEOUT - NIGHT                     114\r\n\r\n   We are under water, liquid drops down into the water; red\r\n   liquid, blood. We can see a figure distorted in the water;\r\n   the figure is bleeding himself into the water. It is Edgar.\r\n\r\n   Cut to\r\n\r\n   We see a subterranean water system. We see Edgar at the edge\r\n   of a pool, bleeding himself into the water supply. Edgar\r\n   looks up. His eyes reflect at us, blinking like an animal's.\r\n\r\n   Cut to\r\n\r\n   Lilly in her cell, still grinding away at the chains that\r\n   bind her hands. She stops, as if she's heard something,\r\n   expecting Edgar to walk through the doorway. He doesn't. She\r\n   begins desperately grinding away at the chains once more.\r\n\r\n   Cut to\r\n\r\n\r\n115 INT: JONES APARTMENT - CONTINUING                        115\r\n\r\n   Back on Silus who now turns to Jones.\r\n\r\n                       SILUS\r\n             Do you have a map?\r\n\r\n   Cut to\r\n                                                                   94\r\n\r\n\r\n\r\n   Jones laying out a map of the city on his kitchen table;\r\n   empty booze bottles roll out of the way. Jones has a pen and\r\n   he's marking off an area.\r\n\r\n                       JONES\r\n             There's the quarantine zone. It's\r\n             a pit. Slums.\r\n\r\n                       SILUS\r\n             The water supply. Where is it?\r\n\r\n   Jones searches and then pin points an area in the center of\r\n   the quarantine zone.\r\n\r\n                       JONES\r\n             There, all the old suburbs are\r\n             supplied by their own artesian\r\n             wells. Mineral springs. That's why\r\n             it hasn't broken out of Jamestown,\r\n             it's the water. Jamestown's water.\r\n\r\n   The two men stare at each other, both reaching the same\r\n   conclusion.\r\n\r\n                       SILUS\r\n             He is there, with Lilly.\r\n\r\n   We see the Map.\r\n\r\n\r\n116 EXT: JAMESTOWN SLUM, QUARANTINE ZONE - NIGHT             116\r\n\r\n   Cut to a crane down to reveal Silus and Jones observing the\r\n   guards at the blockade.\r\n\r\n                       JONES\r\n             You'll never get in, they've\r\n             circled the whole borough.\r\n\r\n   Silus turns to Jones.\r\n\r\n                       SILUS\r\n             I will get in. You must go to the\r\n             press. Tell them about the water.\r\n             Tell them what the government will\r\n             do.\r\n\r\n                       JONES\r\n             You're dead after this. You know\r\n             that? Whatever happens.\r\n\r\n   Silus smiles.\r\n\r\n                       SILUS\r\n             Watch for me, Officer Jones.\r\n                                                                     95\r\n\r\n\r\n\r\n\r\n    Silus exits. Jones watches him leave, then Jones leaves too.\r\n\r\n\r\n117 EXT: JAMESTOWN SLUM, QUARANTINE ZONE - CONTINUOUS         117\r\n\r\n    We see Silus, close. It's as if he is meditating. We pull out\r\n    to reveal he is kneeling on the roof of a building; he looks\r\n    as if he's preparing himself for something.\r\n\r\n    He then rises, all fluid concentration, and runs towards us\r\n    and then the camera is on his shoulder as he jumps off the\r\n    roof.\r\n\r\n    Cut to\r\n\r\n    Silus' POV falling down down, falling towards a window then\r\n    smashing through it.\r\n\r\n\r\n117A EXT: OMITTED - CONTINUING                                117A\r\n\r\n\r\n118 INT: APARTMENT BUILDING, QUARANTINE ZONE - CONTINUOUS     118\r\n\r\n    Silus exploding onto the floor of the apartment. For a moment\r\n    there is silence, just glass tinkling, Silus poised. Then\r\n    Silus turns and is gone.\r\n\r\n    Cut to\r\n\r\n\r\n119 EXT: JAMESTOWN SLUM, QUARANTINE ZONE - CONTINUOUS         119\r\n\r\n    The slums are wrapped in smoke and haze from fires that burn\r\n    there; an eerie dead zone, made all the stranger by the\r\n    gothic spires that climb out of the haze.\r\n\r\n    Then Silus hears something. It is the wailing of a new born\r\n    child. Silus moves towards the cries, then up ahead he sees\r\n    a figure, kneeling on the ground. As Silus moves through the\r\n    haze he sees what it is. It is a Brother Priest, kneeling\r\n    beside someone. The Brother is holding the hand of the person\r\n    on the ground who is in the last throws of death. When Silus\r\n    is next to him the Priest looks up at him. Tears wet his\r\n    cheeks. For a moment they just stare at each other.\r\n\r\n                        PRIEST 2\r\n              Who has done this, Brother?\r\n\r\n                        SILUS\r\n              We have. To our shame.\r\n                                                                        96\r\n\r\n\r\n\r\n\r\n    The Silus hears the babies cries again. Closer now. The\r\n    Priest stares at the dying creature on the ground in front of\r\n    him. Drops the limp hand he was holding. Then rises and turns\r\n    squarely to Silus.\r\n\r\n                        PRIEST 2\r\n              I have something to show you.\r\n\r\n    The Priest moves off towards a building and Silus follows.\r\n\r\n    Cut to\r\n\r\n\r\n119A INT: JAMESTOWN SLUM, QUARANTINE ZONE, HOVEL - CONTINUING    119A\r\n\r\n    We see Silus and the Priest enter. The Priest leads Silus\r\n    into the dark place. As he moves forward Silus can hear a\r\n    strange gurgling sound; not of the sick or dying, this is a\r\n    more innocent sound. The sounds of a newborn.\r\n\r\n    We See Silus approach a filthy, roughly made crib. In it is\r\n    a baby; it's eyes stare up at Silus with wisdom beyond their\r\n    years.\r\n\r\n                        PRIEST 2\r\n              It is a miracle my Brother. She is\r\n              a female, the first of our kind.\r\n\r\n    Silus watches the baby carefully.\r\n\r\n                        SILUS\r\n              She must be protected.\r\n\r\n    He then turns to the Priest.\r\n\r\n                        SILUS\r\n                     (continuing)\r\n              I would ask for your help Brother.\r\n              The Church can no longer be\r\n              trusted...\r\n\r\n\r\n119B EXT: JAMESTOWN SLUM, HIDEOUT - CONTINUING                   119B\r\n\r\n    Edgar, atop the roof of the building that sits above the\r\n    water treatment plant. He is watching his handiwork; the\r\n    screams in the night, the burning fires, the haze rising up,\r\n    cloaking the city. Then down below, he sees a figure\r\n    approaching. He knows who it is. Silus is coming to him.\r\n\r\n    Cut to\r\n                                                                   97\r\n\r\n\r\n\r\n\r\n120 INT: JAMESTOWN SLUM, HIDEOUT, CELL - CONTINUING          120\r\n\r\n   Lilly, in her cell. She is working the chains that bind her\r\n   hands against the pipe. She's rubbing them desperately,\r\n   harder, harder. Then she stops. She can hear someone\r\n   approaching.\r\n\r\n   Edgar appears in the doorway; still and poised. Then he\r\n   turns, listening. A creaking echoes through the tunnels as if\r\n   an iron door, somewhere above, has been opened.\r\n\r\n                       EDGAR\r\n             He's coming little one. He's\r\n             coming for you.\r\n\r\n   Edgar takes one more blinking look at Lilly and then leaves,\r\n   slamming the large iron door behind him.\r\n\r\n   Lilly pulls at the chains, hoping against hope that they'll\r\n   break. They don't.\r\n\r\n                       LILLY\r\n             No.\r\n\r\n   She now looks above. The pipe her chains are connected to\r\n   runs up towards the roof, then takes a bend to disappear into\r\n   the wall near the door. She bangs on the pipe. There is a\r\n   little movement where it goes into the wall. Just enough to\r\n   give her some hope.\r\n\r\n   Lilly struggles now to her feet. She slides the chains up. To\r\n   get the chains over the bend she'll have to jump. She does,\r\n   sliding the chain over the bend. Now she hangs from the pipe,\r\n   the chains cutting into her wrists viciously, making her\r\n   groan. She then gets her hands on the pipe and begins sliding\r\n   along the pipe until she is near the door. She then reaches\r\n   up with her feet and kicks at the wall, pushing, trying to\r\n   dislodge the pipe. It moves, water leaks from it. But it does\r\n   not give way.\r\n\r\n   A desperate beat. Then she reaches down to the door with her\r\n   foot. She tries to force down the door handle, her foot wet\r\n   and slippery. Finally she gets the handle down, opens the\r\n   door so that it clangs against the wall.\r\n\r\n                       LILLY\r\n                    (continuing)\r\n             Hello! I'm down here. Silus...\r\n\r\n   Her hands slip from the pipe and again the chains bite into\r\n   her wrist. She cries out in pain.\r\n\r\n   Cut to\r\n                                                                     98\r\n\r\n\r\n121 INT: JAMESTOWN SLUM, HIDEOUT - CONTINUING                 121\r\n\r\n    Above we see Silus, stopping. Lilly's cries echo through the\r\n    place. It is a wet maze of grease and rust, ornate twisting\r\n    pipes built long ago and now decrepit. Silus waits, listens.\r\n    Then something.\r\n\r\n    Cut to\r\n\r\n    Feet, moving fast, splashing in a pool of black water.\r\n\r\n    Silus turns, just catching a movement, a flash of someone\r\n    moving off through the distorted piping. He moves to where he\r\n    saw the figure, to catch sight of a person moving to an open\r\n    iron doorway.\r\n\r\n                        SILUS\r\n              Lilly?\r\n\r\n    But when the woman turns it is not Lilly. It is one of the\r\n    infected; the red eyes, mad and staring at him. And both he\r\n    and the creature hear it. Cries, of someone in pain. Lilly.\r\n\r\n    Cut to\r\n\r\n\r\n121A INT: JAMESTOWN SLUM, HIDEOUT, STAIRWELL - CONTINUING     121A\r\n\r\n    Lilly's cries echo up the stairwell, up towards the surface.\r\n\r\n    Cut to\r\n\r\n\r\n121B INT: JAMESTOWN SLUM, HIDEOUT, CELL - CONTINUING          121B\r\n\r\n    Lilly twisting on the chains that bind her to the pipe,\r\n    crying out in pain.\r\n\r\n    Cut to\r\n\r\n\r\n121C INT: JAMESTOWN SLUM, HIDEOUT                             121C\r\n\r\n    The creature moving through the doorway towards the sounds of\r\n    Lilly's cries. Silus now moves forward to get to the\r\n    creature, flying towards the doorway. We see him approaching\r\n    the doorway and then from nowhere Edgar slams into Silus,\r\n    sending them both careening over a railing.\r\n\r\n\r\n121D INT: JAMESTOWN SLUM, HIDEOUT, STAIRWELL - CONTINUING     121D\r\n\r\n    Low Angle looking directly up at the two Brothers fall,\r\n    bouncing and crashing off the rails on the way down.\r\n                                                                       99\r\n\r\n\r\n\r\n\r\n121E INT: JAMESTOWN SLUM, HIDEOUT, STEAMROOM - CONTINUING       121E\r\n\r\n    They both hit the wet stone floor. They are in the pipe room\r\n    where subterranean mineral springs rise up from deep in the\r\n    earth and where the boroughs water supply is sterilized.\r\n\r\n    Silus is stunned, rises, blood issuing from his mouth. Silus\r\n    pulls his gun from his coat, but Edgar's kick is too fast,\r\n    whipping the gun away so that the glass instrument smashes\r\n    against some dripping pipes. Edgar then squares off against\r\n    Silus.\r\n\r\n                        EDGAR\r\n              It is a maze down here. But given\r\n              time, that thing will find her. Do\r\n              things to her. I'll show you where\r\n              she is, if you take some.\r\n\r\n    Edgar stalks forward. He holds up his arm to Silus.\r\n\r\n    Silus stares at the tube coming from Edgar's arm. Edgar moves\r\n    towards Silus, twisting on the tube so that his infected\r\n    blood drips onto the ground.\r\n\r\n                        EDGAR\r\n                     (continuing)\r\n              You're almost there anyway.\r\n\r\n    And then Silus' face, intense, a dark smile, his hand now\r\n    gripping Edgar's hand; surprise in Edgar's eyes.\r\n\r\n    He pulls Edgar toward him with all his might, his hand\r\n    clamping onto Edgar's throat - the power of the entwined\r\n    bodies immense - then Edgar whipping his body, breaking\r\n    Silus' grip, smashing Silus on the side of the head, but then\r\n    only to get a kick from Silus directly in the stomach that\r\n    sends him smashing into several protruding pipes, ripping\r\n    into his back. Edgar screams.\r\n                                                                   100\r\n\r\n\r\n\r\n122 INT: JAMESTOWN SLUM, HIDEOUT, CELL - CONTINUING          122\r\n\r\n   Lilly. Half conscious now, hanging from the pipe above her,\r\n   twisting. The sound of Edgar's screams makes her groan,\r\n   awaken a little, dazed. Then there is a loud clang. She\r\n   cranes her head to see down the tunnel that leads to her\r\n   cell. She catches sight of a shadow, movement in the tunnel.\r\n\r\n                        LILLY\r\n             Silus...\r\n                                                                101\r\n\r\n\r\nThen the figure moves into the tunnel, shuffling, the legs\r\nnot completely following the brains instructions, but doing\r\nenough to propel the person forward, then a stumble. And in\r\na shaft of light Lilly can see a hand slapping at the wet\r\nwall. But it is less a hand than a claw. And the face that\r\nfollows the hand; the red, reflective eyes of one of the half\r\nmad, the infected. The thing catches sight of Lilly, then\r\npropels itself towards her.\r\n\r\nWe see it's POV, approaching faster, faster.\r\n\r\nAnd Lilly reaching out with her foot, to the door, struggling\r\nto hook it with her foot, trying to close it, almost catching\r\nthe door handle, but her foot is so slippery and the thing is\r\nalmost on her. Then she stretches out with her foot, just\r\ncatching the door and slams it in the face of the thing that\r\nis about to attack her.\r\n\r\nThe thing on the other side of the door is now screaming\r\nwildly and the door handle is jerking down as the creature\r\ntries to activate it and Lilly has her feet on it, trying\r\ndesperately to keep the door shut, but her feet keep\r\nslipping. And then she realizes that the pipe from which she\r\nhangs is beginning to wobble - water is now coursing from the\r\nhole in the wall, beginning to flow faster and faster. Her\r\nfeet slip more and more on the door.\r\n\r\nLilly tries to keep the door closed, but her feet are too\r\nslippery and the thing is pushing through the door. In the\r\ndark space only its eyes and slavering mouth are clear, hands\r\ngrasping for Lilly legs, scratching at them, Lilly twisting,\r\nthe creature's nails searching for purchase on her legs.\r\nLilly hauls herself up, wrapping her legs around the pipe\r\nshe's attached to. The thing below her is groaning\r\nincoherently, reaching up, its hands grabbing at her, Lilly\r\npulling herself just out of reach, then seeing the eyes below\r\nher, wanting her. Lilly tries to pull herself higher. And\r\nthen she feels it. The pipe she's attached to is shifting,\r\nwhere it joins the wall. Water is now flooding from it, the\r\npipe jerks down, some of the old wall giving way.\r\n\r\nThe creature's fingers are now able to grasp Lilly's t-shirt,\r\ndrag at it, pull at her, screaming, the pipe grinding, water\r\nflowing and then the whole thing comes down, the pipe\r\nbursting out of the wall.\r\n\r\nLilly and the pipe falls, right on top of the creature.\r\n\r\nFor a moment neither of them move, then the creature is\r\ngrabbing at Lilly's hair, pulling her head back. In a flash\r\nLilly pulls the pipe to which she is attached right into the\r\nface of the creature. This gives her time to stagger upright.\r\n\r\nShe's still chained around the pipe; she can see the end of\r\nthe pipe near the door.\r\n                                                                        102\r\n\r\n\r\n\r\n\r\n    She begins to slide the chains back as the creature begins to\r\n    rise and advance towards her. Lilly desperately slides the\r\n    chain along the pipe. It catches on a protrusion, while the\r\n    creature advances. Lilly frees it just in time, falling\r\n    backwards as the creature jumps at her, Lilly lifting the\r\n    chain up to hold the creature back. The creature strains to\r\n    get at Lilly. Lilly now has the chain at the creature's neck.\r\n    She begins to tighten it around the creature's neck, her only\r\n    hope now. The creature changes now, from frightening to\r\n    pitiful as it realizes it can't breath, it's fingers\r\n    desperately moving over Lilly's face, almost pleading. Tears\r\n    form in Lilly's eyes as she tightens the stranglehold; there\r\n    is no anger there, just desperation, and behind that, pity.\r\n\r\n    The creature breathes it's last breath then collapses onto\r\n    Lilly.\r\n\r\n\r\n123 OMITTED                                                      123\r\nAND                                                              AND\r\n124                                                              124\r\n\r\n\r\n124A INT: JAMESTOWN SLUM, HIDEOUT, STEAMROOM - CONTINUING        124A\r\n\r\n    Edgar and Silus stalk each other in the steam room. Edgar\r\n    launches himself towards Silus, but Silus is now too quick.\r\n    Silus slams Edgar sideways into a pipe, an imprint of Edgar's\r\n    face left on the pipe.\r\n                                                                103\r\n\r\n\r\n\r\n\r\nStunned Edgar releases his grip, stumbles back, Silus rising\r\nnow, he has him. Again, Silus slams Edgar's head into another\r\npipe. And now Silus has Edgar's throat in his fist and the\r\nlook on Silus' face tells Edgar he will not escape.\r\n\r\nWe see Edgar, beginning to lose consciousness now, dying.\r\nSteam now rises all around them from broken pipes. Then\r\nbehind Silus, Edgar can make something out. An old, corroded\r\ntank, steaming, with the words sterilizer on it. There are a\r\nseries of long shafts connected to the sterilizer via a tube\r\nand held in position by clamps; they look like they're for\r\nsterilizing bottles.\r\n\r\nWith a last effort Edgar propels Silus backwards onto one of\r\nthe shafts, making Silus grimace and clutch his back where\r\nhe's been pierced, then slide to the ground. The piercing has\r\noperated some lever so that steam now also drifts from the\r\nwound on Silus' back.\r\n\r\nCut to\r\n\r\nSilus looking up, clutching his back with the pain of it.\r\n\r\nAnd now Edgar above him. He removes one of the sterilizer\r\nshafts from the bracket that holds it. He clutches a lever on\r\nthe side which makes viciously hot steam pulse from the end\r\nof the shaft. Edgar moves slowly towards Silus.\r\n\r\nWe see Silus, unable to rise, crawling back, until bang, he's\r\nstopped by more pipes behind him. Nowhere to go.\r\n\r\nAnd Edgar ready to pounce. He does, driving the shaft towards\r\nSilus' head. Silus manages to raise one hand to Edgar's wrist\r\nto stop the shaft from piercing his skull. Now the shaft is\r\nright in Silus' face, the lightly steaming hole staring back\r\nat Silus. Edgar's finger moves to the lever on the side of\r\nthe shaft, ready to get some steam going.\r\n\r\n                   EDGAR\r\n         If I burn the skin from your face,\r\n         I wonder how that would be. If you\r\n         looked like a monster...\r\n\r\nCut to\r\n\r\nEdgar's finger moving over the steaming lever. The steaming\r\nend of the shaft right in Silus' face.\r\n\r\nThen Edgar's face as he watches his brothers face for the\r\nlast time.\r\n\r\nThe blasting sound of steam and a steaming blast from the\r\nshaft drifts into our frame.\r\n\r\nCut to Silus. His face is not scolded.\r\n                                                                     104\r\n\r\n\r\n\r\n\r\n   Cut back to Edgar, his expression getting tighter, his face\r\n   redder, the whites of his eyes becoming bloodshot. Then he\r\n   goes to speak, but now words come out, only a swirling puff\r\n   of steam.\r\n\r\n   And then he falls and we see behind him, standing there is\r\n   Lilly, one of the other sterilizing shafts in her hand; steam\r\n   still rising from the sharp end of it.\r\n\r\n   Cut to Edgar, prone, on the wet floor of the pipe room; steam\r\n   rises from both his mouth and the back of his head.\r\n\r\n                                             DISSOLVE TO:\r\n\r\n\r\n125 EXT: JAMESTOWN SLUM, QUARANTINE ZONE - NIGHT               125\r\n\r\n   POV steadicaming through the streets of the Quarantine zone.\r\n\r\n   The POV belongs to Lilly who moves down the street, half\r\n   carrying Silus who limps. Lilly takes in the devastation.\r\n   Then Silus pulls up.\r\n\r\n                       LILLY\r\n             What is it?\r\n\r\n                         SILUS\r\n             In there.\r\n\r\n   Silus is pointing to a fallen down building through the haze\r\n   and the rain.\r\n\r\n                       LILLY\r\n             Is there something wrong?\r\n\r\n                         SILUS\r\n             No.\r\n\r\n   He gently touches her mud smeared face.\r\n\r\n                       SILUS\r\n                    (continuing)\r\n             There is something very precious.\r\n             You must take it, keep it secret.\r\n             Don't let them touch it.\r\n\r\n                       LILLY\r\n             I don't understand.\r\n\r\n                         SILUS\r\n             You will.\r\n                                                                      105\r\n\r\n\r\n\r\n\r\n   And then they both hear it. A wail, distorted, echoing; it\r\n   sounds like a hurt animal. Lilly looks at Silus.\r\n\r\n                         SILUS\r\n                      (continuing)\r\n             Hurry.\r\n\r\n   Lilly turns towards the building. She slowly moves towards\r\n   it, into the doorway as Silus watches her go. Silus turns to\r\n   the sunrise, it reflects in his eyes.\r\n\r\n   Cut to\r\n\r\n\r\n126 INT: JAMESTOWN SLUM, QUARANTINE ZONE, BUILDING, NIGHT       126\r\n\r\n   Lilly moves through the derelict place, past fallen beams. It\r\n   seems empty. Then Lilly hears it again. A wail. This time she\r\n   knows what it is; we can tell from the way her eyes glisten.\r\n\r\n   She moves forward, closer to the sound. And finally she sees\r\n   the Brother Priest we saw before, who kneels in front of a\r\n   crate. He looks up at her as she approaches.\r\n\r\n   As Lilly moves forward she sees what lies with the crate.\r\n   Wrapped in dirty sacking, there is a baby.\r\n\r\n   In the corner Lilly can see a woman - the child's mother -\r\n   dead from the infection.\r\n\r\n   The baby cries and Lilly can see the tiny fangs of a Brother\r\n   in the baby's mouth.\r\n\r\n                       PRIEST 2\r\n             The first female of her kind. The\r\n             first daughter given to us.\r\n\r\n   Lilly moves forward. Emotional music rises in the soundtrack;\r\n   evoking memory, the circle completing. Lilly reaches out,\r\n   letting the baby girl grip her hand. Lilly reaches into the\r\n   crate, drawing the baby into her arms, staring down into the\r\n   baby's face; a face somehow already wise, already serene.\r\n   Broken tears run down Lilly's cheek as she presses the baby\r\n   to herself, all the pain of the past flooding over her, the\r\n   baby's tiny hands reaching out, clasping onto her.\r\n\r\n                       PRIEST 2\r\n                    (continuing)\r\n             Come. Before they find her.\r\n\r\n   Cut to\r\n                                                                      106\r\n\r\n\r\n\r\n\r\n127 EXT: JAMESTOWN SLUM, QUARANTINE ZONE - DAWN                 127\r\n\r\n   Lilly exits the building. She looks around for Silus, but he\r\n   has gone. She pauses. Through the mist and drifting smoke\r\n   from the fires we can see that in the distance a tarnished\r\n   sun is lighting the horizon.\r\n\r\n                       PRIEST 2\r\n             We must go.\r\n\r\n   After a final pause Lilly moves off with the Priest, carrying\r\n   the tiny bundle with her.\r\n\r\n                         LILLY\r\n                         (VO)\r\n              For me, everything has changed now.\r\n              Because of Silus I see the world\r\n              through new eyes.\r\n\r\n                                            FADE OUT:\r\n\r\n\r\n128 EXT: LILLY'S APARTMENT - NIGHT                              128\r\n\r\n   Silus, on a fire escape, in the shadows. Gone are the clothes\r\n   of the Brotherhood, rather he is dressed as someone who does\r\n   not want to be seen.\r\n\r\n   Cut to his POV. We see Lilly's building. We see through the\r\n   window, into her apartment; a beacon of warmth in the night.\r\n\r\n   In Lilly's bed we can see the baby, its hands happily making\r\n   patterns before its eyes.\r\n\r\n                        LILLY\r\n                        (VO)\r\n              Now I see hope, and I see a child,\r\n              the first female of her kind.\r\n\r\n\r\n\r\n   Silus scans the apartment.\r\n\r\n   He can see the lounge. Jones is there with Lilly. Lilly is\r\n   dressed to go out; to leave. Jones and Lilly hug. Then Jones\r\n   picks up two suitcases and moves towards the door.\r\n\r\n   Silus watches as Lilly moves into the bedroom and reaches\r\n   down for the tiny baby, its tiny arms clasping onto her as\r\n   she lifts it.\r\n\r\n                       LILLY\r\n                       (VO)\r\n              Perhaps Edgar got what he wanted\r\n              after all, because it time this\r\n              child will truly change our world.\r\n                                                                107\r\n\r\n\r\nWe see Silus, closer, watching.\r\n\r\nCut to\r\n\r\nLilly, pausing, moving to the window of her apartment,\r\nstaring out into the night, almost directly toward Silus. She\r\nraises her hand, as if in a gesture of goodbye and then she\r\nleaves.\r\n\r\nCut to\r\n\r\nSilus, close, nodding.\r\n\r\n\r\n\r\n\r\n                                THE END\r\n\r\n\n\n\n\nPerfect Creature\nWriters :   Glenn Standring\nGenres :   Action  Drama  Fantasy  Horror  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "The film opens as a pregnant woman (Danielle Cormack) gives birth to a vampire. A young Brother, Silus, aged 10–13 is told this child, Edgar and he are from the same mother. Throughout this introduction the mother is in visible emotional distress, reaching out across the room to Silus, trying to touch him.\nCaptioned \"100 Years Later.\" Jamestown slum has had a series of attacks on women, who are all found with their throats bitten. Lilly Squires (Saffron Burrows) is in charge of the human police investigating these cases. She states that she comes from a workhouse in this same slum, and we establish that she is one of the few cops who care what happens to these people at the bottom of the socioeconomic heap. Lilly finds a small boy who witnesses one attack, and tells her that a Brother was responsible. As the police don't want to panic the city, the string of murders is explained away as being the result of an outbreak of the rampant influenza virus.\nSilus (Dougray Scott) is detailed by the church cardinals to work with the human police, because the Brothers know that these attacks have been carried out by a Brother; Silus's brother Edgar (Leo Gregory). Edgar has sent Silus a recording of his last murder, challenging him to find and stop him before he kills again. Edgar provides the location of his next murder.\nWith Silus' help, Lilly puts together a task force to stake out the area Edgar has targeted. However Edgar distracts the cops and attacks Lilly, biting her in the neck. An officer interrupts the attack and Edgar flees. To save Lilly's life, Silus tells her to drink his blood, which she does. Silus then pursues Edgar, managing to shoot him with a tranquilizing dart. Silus later visits Lilly in hospital. We establish that she has no family as they died from influenza. Lilly is having visions from drinking Silus' blood. The newspapers have published a fake story of the death of the killer; a deranged human who believed he was a Brother.\nEdgar is being held in a \"brace\", a spiked body restraint in a cell in the church basement. Because Silus is soon to be made a member of the \"inner circle\" he is told the full details of what happened to Edgar. The cardinals are worried that not a single Brother has been born for 70 years, and that a female vampire has never been born. Although they have publicly banned genetic research, the church has been carrying it out in secret. Edgar has been developing a virus to inject into pregnant women, to force the baby to be born a vampire. Alas the virus has mutated, and it has turned the women into violent, insane, psychopaths. Ten of Edgar's research subjects are already dead, and the last one is dying. Edgar has also become infected, and is now insane, although the effect is slower due to his strong immune system.\nSilus visits Edgar, who vows to escape and finish off Lilly. Edgar accuses Silus of being in love with Lilly, despite Brothers being forbidden to love. The night Silus is at a ceremony in the church for his investiture as a cardinal Edgar escapes, killing the guards and receptionist, and disappears into Jamestown. He enlists the help of a local named Freddy to help him catch Lilly. Edgar has installed a tap and tube system into his forearm, so he can turn on a flow of his own infected blood at any time. He catches a policewoman and fills her mouth with his blood. Freddy insists on getting his own share as well, not knowing it is infected.\nSilus is guarding Lilly at her apartment with Lilly's colleague Jones. When she is sleeping Silus shows some affection for her by imagining kissing her. Later, Silus leaves to investigate a noise downstairs and Lilly and Jones patrol around. When Lilly approaches a window, Edgar bursts through from outside and grabs her. Silus and Edgar grapple, however Silus is knocked unconscious long enough for Edgar and Lilly to disappear.\nThe virus has spread throughout Jamestown. The government has instituted a quarantine, and soldiers shoot anybody who attempts to leave. Humans are rioting outside the churches, and throwing their rosaries back at the Brothers.\nSilus discovers Edgar's location is Jamestown's water source. Edgar is dripping his blood into the water supply, infecting all of Jamestown. However, each suburb has its own separate water supply. Silus is determined to go in and rescue Lilly, however another cardinal tells him that Jamestown will be burned to the ground to make sure that the virus dies, and Edgar with it. He warns Silus that his own career will be doomed if he ignores the \"greater good\" and breaches quarantine.\nSilus breaks through into Jamestown and heads to the aquifer, dodging the infected. Lilly is handcuffed to a water pipe in a locked basement. Edgar comes in and she tries to persuade him to stop but instead he challenges her about her dead child, saying that her race is good at abandoning children. Edgar finds Silus and they fight. Just as Silus is winning, Edgar throws him backwards onto the prongs of a steam injector. As Silus lies groaning, and possibly dying, on the ground, Edgar approaches with a portable steam injector. When Edgar depresses the trigger steam comes out. Edgar threatens to burn Silus's face off so that he will be more of a monster just like him. Lilly comes up behind Edgar and kills him by stabbing another steam injector into the back of his skull.\nSilus escorts Lilly from the water facility. He kisses Lilly and says she must do something. He gestures to a building then tells Lilly she must look after what she will find in there and keep it away from the Brotherhood. Lilly enters the building, and finds the other Brother, a dead woman, and a baby. The Brother tells Lilly the infant is the first female vampire ever born. The virus has created her and she is truly the first Perfect Creature.\nSilus is branded a heretic, and must stay in hiding. Meanwhile, Lilly is caring for the baby and Silus is watching over her. The movie ends with Silus saying that he is being hunted but he will always fight back, leaving scope for a second movie."}