{"title": "Pineapple Express", "full_text": "PINEAPPLE EXPRESS\n\n\n                             Written by\n          \n              Judd Apatow, Seth Rogen & Evan Goldberg\n          \n          \n          \n                                               November 28, 2006\n          \n          \n          EXT. FARMLAND - DAWN\n          \n          IN BLACK AND WHITE, A black 1930s Cadillac speeds down       \n          the only visible road amidst endless plains of farmland.\n          The road curves sharply ahead - the car accelerates.\n          Ignoring the turn, the Caddy drives directly off the road\n          and through a massive field of emptiness.\n          \n          The car abruptly stops in the middle of the vacant field.\n          GENERAL BRAT (58, a patch covers one of his eyes) and\n          AGENT BLACK SUIT (an agent in a black suit) step out of\n          the car.\n          \n          Although there is clearly nothing in sight for miles, the\n          General scans his surroundings with concern.\n          \n          TITLE CARD UP: THE PAST                                      \n          \n          Agent Black Suit crouches down and pulls open a METAL\n          HATCH in the ground. Both men walk down the hatch and\n          into the earth.\n          \n          \n          INT. UNDERGROUND FACILITY - MOMENTS LATER\n          \n          They descend a metal staircase and walk with great\n          urgency down a narrow corridor. The hallway spills into a\n          hauntingly huge metal room with a lone SCIENTIST standing\n          in the middle. The Scientist immediately begins leading\n          them across the room.\n          \n                                 GENERAL BRAT\n                    When did it start?\n          \n                                 SCIENTIST\n                    At 05:00. We're seven minutes in.\n          \n          \n          INT. OBSERVATION LAB - CONTINUOUS\n          \n          The three men enter a large room divided by a one-way\n          mirror.\n          \n          On their side, numerous SCIENTISTS, utilizing several\n          archaic devices, are busy at work monitoring the subject\n          on the other side of the mirror.\n          \n          The subject: PRIVATE MILLER (22, naive and dutiful) sits\n          at a small table with a microphone on it. Miller raises\n          his hand, REVEALING a smoldering JOINT.\n          \n                                                                    2\n          \n          \n          He takes a long and awkward hit from the joint and bursts\n          into a coughing fit.\n          \n          The scientists begin to scribble profusely as their\n          devices blink manically. General Brat and Agent Black\n          Suit exchange a concerned look. The General lights a\n          cigarette as the Scientist steps up to a small microphone\n          in the corner.\n          \n                                 SCIENTIST\n                           (into microphone)\n                    Private Miller, we are now going to ask\n                    you several questions. How do you feel?\n          \n          His voice booms through large speakers on Miller's side\n          of the room. Miller leans towards the microphone.\n          \n                                  PRIVATE MILLER\n                    Uh, I feel a little queer sir. But...\n                    It's good. Good queer.\n                           (beat)\n                    Sir. Good queer, Sir.\n          \n          The scientists scribble madly. One of them mumbles into\n          General Brat's ear.\n          \n                                 PRIVATE MILLER (CONT'D)\n                    But...uh...even though I feel queer, Sir,\n                    I should mention that I'm also feeling\n                    quite gay...so, a little queer, but\n                    mostly gay.\n          \n                                 SCIENTIST\n                    Private Miller. When you think of your\n                    superiors, what emotions do you feel?\n          \n                                 PRIVATE MILLER\n                           (holding out the joint)\n                    This went out...Sir.\n          \n                                 SCIENTIST\n                    We will send someone in. Now answer the\n                    question.\n          \n          A door opens beside Private Miller and an AGENT steps out\n          wearing an intricate uniform that resembles an old\n          fashioned diving suit, an air hose leading out the door\n          that he came from. He slowly walks toward the Private,\n          who looks at him in shock.\n          \n                                 SCIENTIST (CONT'D) (O.S)\n                           (through speakers)\n                    Private Miller? Answer the question.\n          \n                                                                     3\n          \n          \n          \n                                 PRIVATE MILLER\n                    Oh...um...what was the question again?\n          \n          The Agent in the strange suit reaches the private and\n          holds a lighter up to the joint.\n          \n                                 SCIENTIST (O.S.)\n                           (through speakers)\n                    What are your emotions towards your\n                    superiors?\n          \n          Miller pulls at the joint until it is lit again. The\n          Agent exits the room.\n          \n                                  PRIVATE MILLER\n                     COUGH   COUGH  Fucking shit.\n                           (beat)\n                    Well, now that I think of it, it's\n                    strange that they are called my\n                    `superiors'. Does that make me their\n                    `inferior'? I mean, that's pretty fucked\n                    up.\n          \n          General Brat scowls.\n          \n                                 GENERAL BRAT\n                           (curtly to the scientists)\n                    I've seen enough. Shut it down. Bury the\n                    hatch, sell the land, and dispose of him.\n                    This never happened.\n          \n          Instantly, the scientists start packing up their\n          equipment. Staring at Miller, General Brat grabs a RED\n          PHONE and dials. Two Agents in the scuba-like suits\n          emerge from behind Miller and start aggressively dragging\n          him away.\n          \n                                 PRIVATE MILLER\n                           (freaking out)\n                    Hey! What the...what are you guys doing!              \n                    Let go of me!\n                           (desperately looking at the\n                            mirror)\n                    Sir!!! Sir!!! Help me!!!\n          \n                                  GENERAL\n                           (into phone)\n                    This is General Brat. We've reached a\n                    final conclusion on Item 9.\n                           (beat)\n                    Illegal.\n          \n          He hangs up the phone.\n          \n                                                                     4\n          \n          \n          \n          CUT TO BLACK.\n          \n          TITLE CARD UP: THE PRESENT                                      \n          \n          \n          INT. DALE'S CAR - CONTINUOUS                                    \n          \n          DALE DENTON (late 20s, out of shape, slightly unkempt)\n          looks out of place in his black suit as he drives he sits       \n          in his cluttered and worn old lady car. He smokes a joint       \n          while listening to talk radio.                                  \n          \n                                 TALK RADIO DJ                            \n                    Well, let's look at the facts.                        \n                    Financially, coins are better because                 \n                    they're cheaper, and environmentally,                 \n                    forget-about-it, coins win hands down.                \n                    For those just joining us, we're with                 \n                    caller Dale Denton discussing if America              \n                    should lose the paper dollar bill.                    \n          \n          We see that Dale has a wireless ear piece in.                   \n          \n                                 DALE                                     \n                    Of course not! Who wants a pocket full of             \n                    coins? Seriously. Weighs down your pants,             \n                    clangs around. With all this unnecessary              \n                    new security everywhere, we'll be setting             \n                    off alarms left and right!                            \n          \n                                 TALK RADIO DJ                            \n                    We certainly do, Mr. Denton. Crude, but               \n                    to the point. Next caller!                            \n          \n          Dale puts away his phone and pulls up in front of a nice        \n          house.                                                          \n          \n          \n          EXT. FRONT DOOR - MOMENTS LATER                                 \n          \n          Dale, wearing a name tag that reads \"Garth\", holding a          \n          clip board and wearing a greenpeace hat, knocks                 \n          repeatedly on the door. A woman cautiously answers the          \n          door.                                                           \n          \n                                 WOMAN                                    \n                    Um, I didn't order a pizza.                           \n          \n          \n                                 DALE                                     \n                    Excuse me, miss? Are you Sandra Danby                 \n          \n                                                                     5\n          \n          \n          \n                                  WOMAN                                   \n                    Uh...yea-                                             \n          \n          Dale shoves an envelope into her hand.                          \n          \n                                 DALE                                     \n                    Sorry, miss, but you've failed to show up             \n                    to your divorce proceedings 4 times under             \n                    court order. You've been served.                      \n          \n                                 WOMAN                                    \n                    Oh great! Thanks a lot asshole! Real                  \n                    clever! Go fuck yourself!                             \n          \n          Dale dashes back to his car as the upset woman starts to        \n          open the envelope.                                              \n          \n          \n          INT. DALE'S CAR - SOON AFTER                                    \n          \n          Dale is driving and smoking a joint. He looks at his            \n          check list - it is a list of people he served that day.         \n          He's only got a few left. He listens to a different talk        \n          radio dj while playing music from a tiny iPod boom box          \n          that sits in his passenger seat.                                \n          \n                                 TALK RADIO DJ 2                          \n                    ...forget about Area 51, Roswell                      \n                    sightings, Atlantis and the Boogie Man,               \n                    let's talk about real threats, threats to             \n                    our home and security...                              \n          \n                                  DALE                                    \n                    Fuckin' eh.                                           \n          \n          His iPod starts playing HOT STEPPA by INI KAMOZE.               \n          \n                                 DALE (CONT'D)                            \n                    Nice! Hot Steppa!                                     \n          \n          Dale turns down the talk radio and puffs away at his            \n          joint; he enthusiastically dances in his car while              \n          singing along.                                                  \n          \n                                 DALE (CONT'D)                            \n                           (singing)\n                    You think you know, chico/I know what Bo,\n                    don't know/touch them up and go - uh oh!/\n                    Chi-chi-ching-chang!!!                                \n          \n                                                                     6\n          \n          \n          \n          \n          INT. OFFICE BUILDING - LATER                                    \n          \n          Dale, wearing a Zerox hat, walks into the building.             \n          \n                                 SECRETARY                                \n                    Can I help you?                                       \n          \n                                 DALE                                     \n                    Just here to check out some units.                    \n          \n          The secretary nods and goes back to her work. Dale              \n          casually waltzes down the office halls looking at the           \n          names on the doors. He glances down at his clipboard, it        \n          read: Walter Tandum.                                            \n          \n          He finds the office and knocks on the door.                     \n          \n                                    WALTER (O.S.)                         \n                    Come in.                                              \n          \n          Dale enters to see Walter, a 40 year old accountant,            \n          seated at his desk.                                             \n          \n                                 WALTER (CONT'D)                          \n                    Oh! Hey there. Are you here to fix the                \n                    fax machines?                                         \n          \n                                    DALE                                  \n                    Nope.                                                 \n          \n          Dale drops a blue envelope on Walter's desk.                    \n          \n                                 DALE (CONT'D)                            \n                    You owe American Express $4068 dollars.               \n                    Sorry, but you've been served.                        \n          \n          Dale turns and walks away. As he does, he notices a small       \n          kitchen. He enters and is delighted at the array of             \n          snacks and beverages. He helps himself.                         \n          \n          \n          INT. DALE'S CAR - LATER                                         \n          \n          Dale is parked at a look-out enjoying the food, smoking         \n          weed and has his ear piece in.                                  \n          \n                                 RADIO DJ 3                               \n                    What gives you the right to say that?                 \n          \n                                 DALE                                     \n                    Everything! They should be able to                    \n                    collect garbage TWICE a week. Why not?                \n                                 (MORE)\n          \n                                                                     7\n          \n                                 DALE (CONT'D)\n                    As a tax payer, can't I say that? Come                \n                    get my garbage a bit more! Is that so f-              \n                    ing crazy? I'm not asking for free beer               \n                    Tuesday's or anything. And the whole city             \n                    would be more aesthetically pleasing and              \n                    smell better. And don't pretend you can't             \n                    smell it. Ever been to New York? Great                \n                    place, smells like piss, though.                      \n                           (takes a hit and starts                        \n                            coughing)                                     \n                    Twice a week,  cough  might fix that.                 \n                           (starts coughing harder)                       \n                    Hold on one sec.                                      \n          \n          \n          EXT. HOSPITAL - LATER                                           \n          \n          Dale gets out of his car, followed by some plumes of            \n          smoke, and goes to his trunk. He chuckles as he takes out       \n          a lab coat and walks towards the hospital.                      \n          \n          \n          INT. HOSPITAL - SOON AFTER                                      \n          \n          Dale, looking very professional in his lab coat, rushes         \n          to reception.                                                   \n          \n                                 DALE                                     \n                    I need Dr. Terrence, immediately.                     \n          \n                                 RECEPTIONIST                             \n                    Of course. One moment.                                \n          \n          The receptionist immediately picks up the phone.                \n          \n          \n          INT. HOSPITAL - MOMENTS LATER                                   \n          \n          DR. TERRENCE runs towards reception, where Dale is still        \n          waiting.                                                        \n          \n                                 DR. TERRENCE                             \n                           (to Dale)                                      \n                    Hi there, I don't think we've met, I'm-               \n          \n                                 DALE                                     \n                    Dr. Edgar Terrence. You're the guy who                \n                    repeatedly refused to take care of the                \n                    monkey tree that spills onto your                     \n                    neighbors property. And now, because of               \n                    that, you've been served.                             \n          \n                                                                     8\n          \n          \n          \n          \n          INT. DALE'S CAR - LATER                                         \n          \n          Dale hits a pipe. It is clear he strongly disagrees with        \n          what the DJ is saying.                                          \n          \n                                 TALK RADIO DJ                            \n                    ...stay in your own country. Five simple              \n                    words. And stay the hell out of mine! I'm             \n                    not a racist, per se, but I'm not some                \n                    hippy tree humper.                                    \n          \n          We see his ear piece and hear that he is on hold.               \n          \n                                 DALE                                     \n                    Let me through, damnit.                               \n          \n          \n          EXT. HOTEL - VALET                                              \n          \n          Dale, wearing a chauffeur hat, stands by the main               \n          entrance holding a sign that reads: JOSH CORBER. A man          \n          walks out of the hotel and, seeing the sign, approaches         \n          Dale.\n          \n                                 CORBER                                   \n                    My name's Corber.                                     \n          \n                                 DALE\n                    You're Joshua Aaron Corber?                           \n          \n                                 CORBER                                   \n                           (overjoyed)\n                    Get out of town! Clarice did this, didn't\n                    she? I was just telling her before I left\n                    how I've never been in a limo. Can you\n                    believe it? 35 and I've never been in a\n                    limo. Man! It's not stretched, is it?\n          \n          Dale hands him a BLUE ENVELOPE.\n          \n                                 DALE\n                    Sorry, but you've been served.\n          \n          Dale walks away. CORBER opens the envelope and reads it.        \n          \n                                 CORBER                                   \n                    Ah fuck!\n                           (reads more)\n                    Fuck! You fucking asshole!!! FUCK!\n          \n                                                                      9\n          \n          \n          \n          Dale completely ignores Corber as he dumps the sign and          \n          walks out of the airport. Then, a huge smile comes across\n          his face. He has noticed a nearby Burger King.\n          \n                                 DALE\n                           (excited)\n                    Hey! Nice. New chicken fries.\n          \n          He happily walks toward the food.\n          \n          \n          INT - DALE'S CAR - DAY\n          \n          Dale sits in his car   outside a high school. An array of        \n          Burger King wrappers   surrounds him as he rolls a joint         \n          with the last of his   weed on top of a Batman comic. He         \n          lights the joint and   turns on the radio.                       \n          \n                                 RADIO DJ                                  \n                    ...3:09 in the PM and we-                              \n          \n          Dale turns off the radio, takes one last haul, and then          \n          snubs out the joint. He then pulls out a small leather           \n          kit and sifts through it's contents: handi-wipes, hand           \n          sanitizer, a little vial of cologne, Visine, mouthwash           \n          and breath mints.                                                \n          \n          Dale vigorously wipes his hands, face, and mouth with wet        \n          naps and then starts futilely attempting to put visine in        \n          his blazing red eyes. Frustrated, he squirts Visine all          \n          over his finger tips and simply rubs them into his eyes.         \n          He uses the mouthwash, chews up a mint, dabs on some             \n          cologne, and then gets out of the car.                           \n          \n          \n          EXT. HIGH SCHOOL - CONTINUOUS                                    \n          \n          Dale walks towards the school.                                   \n          \n                                   ANGIE                                   \n                    Dale!                                                  \n          \n          Dale turns to see his attractive 19 year old girlfriend,         \n          ANGIE ANDERSON, walking towards him with her group of            \n          friends. She kisses him.                                         \n          \n                                   ANGIE (CONT'D)                          \n                    Mmm. Minty.                                            \n          \n                                 ANGIE'S MALE FRIEND                       \n                    Yo Dale. `sup.                                         \n          \n                                                                 10\n          \n          \n          \n                                 DALE                                  \n                    Hey Kyle.                                          \n                           (to Angie)                                  \n                    So, should we head back to my place and            \n                    finish up the trilogy? Matrix:                     \n                    Revolution. Whose it gonna be, Angie? Man          \n                    or machine?                                        \n          \n                                 ANGIE                                 \n                    Of course. But can we just head to my              \n                    locker first? I left some stuff by                 \n                    mistake.                                           \n          \n                                 DALE                                  \n                    Sure.                                              \n          \n          \n          INT. HIGH SCHOOL - SOON AFTER                                \n          \n          Dale and Angie walk hand in hand towards the locker.         \n          \n                                 ANGIE                                 \n                    So, are you going to come over for dinner          \n                    tomorrow, `cause my parents are beginning          \n                    to think I made you up.                            \n          \n                                 DALE                                  \n                    Well, yeah, I really want to meet them.            \n                    Tomorrow, tomorrow, tomorrow...let me              \n                    think.                                             \n          \n                                 ANGIE                                 \n                    You don't have to feel weird about it.             \n                    They know how old you are and they're              \n                    fine with it. They just want to meet you           \n                    and see that you're a cool guy and that            \n                    I'm not dating you just because you're             \n                    older.                                             \n          \n                                 DALE                                  \n                    Of course. I know that. It's                       \n                    just...tomorrow's tight. I've got a whole          \n                    bunch of cases that I can finish                   \n                    tomorrow. It's probably going to take me           \n                    into the night.                                    \n          \n                                 ANGIE                                 \n                    Fuck. Well, then you have to just come             \n                    over sometime this week or something,              \n                    okay? `Cause it's getting weird for them.          \n          \n                                                                    11\n          \n          \n          \n                                 DALE                                     \n                    I will. I promise. I'm not trying to                  \n                    avoid this, for real, I've just been                  \n                    crazy busy.                                           \n          \n                                 TEACHER                                  \n                    Hello? Can I help you?                                \n          \n          Dale and Angie turn to see a TEACHER, a guy about the           \n          same age as Dale.                                               \n          \n                                 DALE                                     \n                    Pardon?                                               \n          \n                                 TEACHER                                  \n                    You can't just waltz in here and hit on               \n                    the students. Get out now before I-                   \n          \n                                 ANGIE                                    \n                    Mr. Edwards, he's my boyfriend.                       \n          \n          Mr. Edwards looks at Dale, then shoots Angie a confused         \n          look.                                                           \n          \n                                 MR. EDWARDS                              \n                    This is your boyfriend? How old are you,              \n                    30?                                                   \n          \n                                 DALE                                     \n                    24.                                                   \n          \n                                 MR. EDWARDS                              \n                    And you're dating an 18 year old?                     \n          \n                                 ANGIE                                    \n                    I'm 19. I moved here from Morocco.                    \n          \n          Dale doesn't know what to make of Mr. Edwards comments          \n          and looks.                                                      \n          \n                                 MR. EDWARDS                              \n                    Alright, well this school is for students             \n                    and faculty only. Friends can't just stop             \n                    by.                                                   \n          \n                                 DALE                                     \n                    Dude, you may be a teacher here, but                  \n                    we're about the same age, so don't get                \n                    all high and mighty. It's not that weird.             \n                    Frankly, it's natural.                                \n          \n                                                                    12\n          \n          \n          \n                                 MR. EDWARDS                              \n                    Well, in that case, get off school                    \n                    property or I'm calling the Police                    \n                    Liaison officer. Angie, no offense to                 \n                    you, but if this guy's dating someone                 \n                    your age, it's because nobody his age                 \n                    will date him.                                        \n          \n          Then, four HANDSOME AND FIT STUDENTS walk by.                   \n          \n                                 HANDSOME STUDENT                         \n                    Hey Angie. You were hilarious in drama                \n                    today.                                                \n          \n          Angie smiles at the guys. Dale doesn't like how all this        \n          is going down.                                                  \n          \n                                 DALE                                     \n                    I'll wait in the car.                                 \n          \n          \n          INT. DALE'S CAR - MOMENTS LATER                                 \n          \n          Dale and Angie sit in the parked car making out.                \n          \n                                 ANGIE                                    \n                    So, do you want to get some food?                     \n          \n                                 DALE                                     \n                    No...actually I can't. I have to go serve             \n                    a guy.                                                \n          \n                                 ANGIE                                    \n                    Now?                                                  \n          \n                                 DALE                                     \n                    Yeah. It sucks. I'm sorry. We can hang                \n                    out later though. You can come over.                  \n          \n                                 ANGIE                                    \n                    We'll see if Neo is truly the one.                    \n                                                                          \n          \n          They share a long kiss, and Angie gets out of the car.          \n          Dale watches her walk away, then whips out his cell phone       \n          and hits speed dial.\n          \n                                 SAUL (O.S.)\n                           (over phone)\n                    Yo?\n          \n                                                                 13\n          \n          \n          \n                                 DALE\n                    Yo. It's Dale. Mind if I come by and pick\n                    up some shit?\n          \n          \n          INT. SAUL'S APARTMENT - LATER\n          \n          SAUL SILVER is constructing a CROSS-SHAPED JOINT (two\n          joints that intersect one another). Pot and paraphernalia\n          are scattered all over the coffee table. A large\n          \"Scarface\" movie poster hangs on the wall. There is a\n          knock at the door and Dale enters.\n          \n                                 DALE\n                    What's up, Saul.\n          \n                                 SAUL\n                           (unpleasantly surprised)\n                    What the fuck?!?\n          \n                                 DALE\n                    What?\n          \n                                 SAUL\n                    I didn't buzz you in. How the monkey did\n                    you get in here?\n          \n                                 DALE\n                    Whoa...sorry, man. someone just let me\n                    in. I-\n          \n                                 SAUL\n                    That's fucked up, man! This building is\n                    filled with fuckin' assholes. What else\n                    is the buzzer for? Fuck.\n          \n                                 DALE\n                    I'll buzz next time, man. I'm real sorry.          \n                    I'm just not familiar with your,                   \n                    uh...protocol yet.                                 \n          \n                                 SAUL\n                    Hey, stuff your sorry's i n a sack, bro.           \n                    We're always cool. It's those fuckin'\n                    jaggoffs.\n          \n                                 DALE\n                    Um...sure.\n          \n          Dale awkwardly sits down on the other side of the couch.\n          \n                                                                    14\n          \n          \n          \n                                 SAUL\n                    Brass tacs. I've got this new bud.\n                    Unfortunately, it's a few more bones, but\n                    fortunately, it's hands down the dopest\n                    fuckin' shit I ever smoked. And I've\n                    smoked some dope fuckin' shit.\n          \n                                 DALE\n                    Better than that Blue Oyster weed?\n          \n                                 SAUL\n                    Dude. Seriously. It's like if that Blue\n                    Oyster shit and the Afghan Kush I got had\n                    a baby, and meanwhile, the craziest\n                    Northern Lights and that red-ass Espresso\n                    Snowflake had a baby, and then by some\n                    miracle those babies met, and fucked -\n                    then this would be the shit they'd birth.\n          \n          Saul pulls out a big bag of weed. He places it on the\n          coffee table as though it was his child. He pulls out a\n          large bud.\n          \n                                 SAUL (CONT'D)\n                    Smell it.\n          \n          Dale takes the weed and looks at it. It looks\n          spectacular. Bright red hairs and large crystals, huge\n          purple and blue leaves - just spectacular! Dale smells it\n          and is taken aback.\n          \n                                 DALE\n                    What is this? It's spectacular.\n          \n                                 SAUL\n                    It's called Pineapple Express. My guy Red\n                    told me it's when this Hawaiian flood\n                    takes special dirt to the weed or some\n                    shit. It's pretty scientific. And I'm the\n                    only guy in the whole city who has it.\n                    And, its only ten bones more for a\n                    quarter.\n          \n                                 DALE\n                    So...can I get a quarter?\n          \n                                 SAUL\n                    No doubt. Just let me grab my scale.\n          \n          Saul walks into another room. Dale looks around\n          anxiously; he clearly wants to go.                              \n          \n                                                                    15\n          \n          \n          \n          A moment later, Saul comes back into the room and sits\n          down. Dale notices that he didn't bring anything back\n          from the other room. Saul notices Dale looking at him\n          strangely.\n          \n                                 SAUL (CONT'D)\n                    What's with the look? What?\n          \n                                 DALE\n                    Where's the scale?\n          \n                                 SAUL\n                    Oh shit! The scale. Be right back.\n          \n          Saul hustles into the other room.\n          \n                                  SAUL (O.S.) (CONT'D)\n                           (from other room)\n                    You know what's weird? How sometimes,\n                    your brain just chooses to like, not keep\n                    things in it, you know?\n                           (beat)\n                    Fucking scale.\n                           (beat)\n                    Shit. Where is it?\n          \n          Dale checks his watch and then looks at the door;\n          suddenly, something catches his eye - it's the cross-\n          joint Saul was constructing.\n          \n                                 DALE\n                    Holy shit! What the fuck is this thing?\n          \n          Saul comes back in and puts a small electronic scale on\n          the coffee table.\n          \n                                 SAUL\n                            (nonchalantly)\n                    Ah, the cross-joint. You've never seen\n                    one of these? Not surprising. They are,\n                    like, the apex of the vortex of joint\n                    engineering. NASA built the first one in              \n                    the eighties.                                         \n          \n          Saul chuckles at his joke as he places some weed on the         \n          scale.\n          \n                                 DALE\n                    You can actually smoke that contraption?\n          \n          Saul puts Dale's weed in a baggie.\n          \n                                                                    16\n          \n          \n          \n                                 SAUL\n                    You light all three ends at the same\n                    time, then, you smoke it as it resonates\n                    the main section, creating a \"trifecta\"\n                    of smoking power. It's like, three times\n                    as powerful as a normal joint.\n          \n          Dale hands Saul some money and Saul gives him his weed.\n          Dale lingers for a moment.\n          \n                                 DALE\n                    Well, be careful with that thing.\n          \n          Dale gets up and heads to the door.\n          \n                                 SAUL\n                    Dude...you wanna smoke this thing with\n                    me?\n          \n          Dale turns around. He clearly wants to smoke it, but he\n          tries to play it cool.\n          \n                                 SAUL (CONT'D)\n                    I can't even light it on my own.\n          \n          Dale sits back down on the couch, giddy as a schoolgirl.\n          \n                                 DALE\n                           (excited)\n                    Wow. So like, uh...so like, so like what\n                    do I do?\n          \n          Saul gathers three lighters from the coffee table.\n          \n                                 SAUL\n                    Alright. Firstly you light these two\n                    ends. Then I will light the tip, making\n                    the trifecta complete. Are you ready?\n          \n          Dale nods and they light the joint. Saul tokes hard;\n          plumes of smoke fill the air as he bursts into a COUGHING\n          FIT.\n          \n                                 DALE\n                    Holy...\n          \n          Dale takes the joint and hits it, exploding into a\n          coughing fit.\n          \n                                 SAUL\n                    It's...uh, it's good to cough.  COUGH  It\n                    opens the  COUGH  capillaries...gets you\n                    twenty-five percent higher.\n                                 (MORE)\n          \n                                                                   17\n          \n                                 SAUL (CONT'D)\n                    And that, combined with the pineapple\n                    weed, and the cross-joint  COUGH  you're\n                    a good thirty to forty times higher. I\n                    don't know the exact math, but, pff,\n                    you're pretty fucking gong-showed. You\n                    know what I mean?\n          \n          Saul takes a toke. Dale coughs HARDER and HARDER. He\n          seems like he might throw up.\n          \n                                 SAUL (CONT'D)\n                    It's crazy. The better the weed, the more\n                    I wish I could think of how to explain\n                    what's so good about it, but the...uh,\n                    the better it is, the less shit I can\n                    think of in total, you know?                         \n          \n          Saul passes Dale the joint, obliviously dropping ash all\n          over his suit. Slightly agitated, Dale brushes it off.\n          \n                                  SAUL (CONT'D)                          \n                    Okay, so, like, you've been buying from\n                    me for, like, a few months now and I\n                    really gotta ask.\n                           (beat)\n                    What's with the suit?\n          \n                                 DALE\n                    I'm a process server.\n          \n                                 SAUL\n                    You`re a servant? Like, a butler.\n          \n                                 DALE\n                    No, process server.\n          \n          Saul looks confused.\n          \n                                 DALE (CONT'D)\n                    I'm hired to give people papers they                 \n                    don't want. It's pretty much the easiest\n                    job on earth.                                        \n          \n                                 SAUL\n                    Nice, man. Where'd you get that job?\n          \n          Dale takes a big hit from the joint.\n          \n                                 DALE\n                    Well...uh, I got a totally useless degree\n                    two years ago, then I did nothing for a\n                    year, then my dad got so fed up he hooked\n                    me up.                                               \n          \n                                                                 18\n          \n          \n          \n          They both revel in the thought.                              \n          \n                                 DALE (CONT'D)                         \n                    I got it pretty sweet, though. Today? I            \n                    smoked like five joints, gave out some             \n                    pieces of paper, and I ate some Burger             \n                    King-\n          \n                                 SAUL\n                    Hey man, did you get those new chicken\n                    fries?\n          \n          Dale passes the join to Saul.\n          \n                                 DALE\n                    Yeah man. I'd get on that shit. They're\n                    fucking mind blowing. So, then I hot-              \n                    boxed my car and then...got some action            \n                    from my girlfriend.                                \n          \n          Saul laughs at this.\n          \n                                 SAUL\n                    Does she smoke pot?\n          \n                                 DALE\n                    A little. She's in high school.                    \n          \n                                 SAUL\n                    That's fuckin' sweet! Ilegal love! You're          \n                    like Jerry Lee Lewis. I just read his              \n                    biography.                                         \n          \n                                 DALE                                  \n                    No, no. She's 19.                                  \n          \n                                 SAUL                                  \n                           (dissappointed)                             \n                    Oh. It's still cool I guess.                       \n          \n                                 DALE                                  \n                    Yeah, it's awesome, although I think               \n                    she's getting old enough where she's               \n                    realizing I don't do much. And these high          \n                    school guys these days. They're all                \n                    roided out and going to Harvard. Even on           \n                    my best days, I look like a fat, dumb              \n                    piece of shit next to them.                        \n          \n                                 SAUL                                  \n                    Whatever, man. It sounds like you got it           \n                    pretty good. I wish I had a job that               \n                    easy. Fuck.                                        \n          \n                                                                  19\n          \n          \n          \n                                 DALE                                   \n                    Dude...you've got, like, the actual                 \n                    easiest job in the world.                           \n          \n                                 SAUL                                   \n                    Hey! You're right, man. I never thought             \n                    of it like that.                                    \n          \n                                 DALE                                   \n                    You can actually do whatever the hell you           \n                    want. You get to sleep all day and people           \n                    come buy weed at night.                             \n          \n          Dale passes Saul the joint.                                   \n          \n                                 SAUL                                   \n                    That's totally true. Except tomorrow.               \n                    Thanks to that bitch daylight savings, I            \n                    gotta go change my grandma's clocks\n                    forward at 7am. Or 8am. I seriously can't\n                    figure it out.\n          \n                                 DALE\n                    Sorry to hear that.\n          \n          Saul passes Dale the joint.\n          \n                                 SAUL\n                    Yo, so, like, what have these people done\n                    that you go after?\n          \n                                 DALE\n                    Let's see...tonight I'm going after-\n          \n          Dale pulls a blue envelope out of his pocket.\n          \n                                 DALE (CONT'D)\n                    Ted Jones. He forgot to pay his-\n          \n                                 SAUL\n                    Dude! My guy, Red, gets his weed from a\n                    Ted Jones. He's, like, #1 supplier in\n                    town. Maybe it's him!\n          \n                                 DALE\n                    I doubt that, man. There's probably a lot\n                    of Ted Joneses's out there.                         \n          \n                                 SAUL\n                    Yeah, but not like this one, man! He's\n                    what I want to be one day. He's like the\n                    \"Jesus of Weed\". So...I guess he's like\n                    Jah. Or Scarface.\n          \n                                                                    20\n          \n          \n          \n          Saul points to his Scarface poster. The joint ends. After\n          a few moments it seems as though their ability to have a\n          conversation burnt out with the joint. They sit in\n          awkward silence. Dale gets up.                                  \n          \n                                 DALE\n                    Well Saul, that was crazy. Thanks.\n          \n                                 SAUL\n                    No worries dude, peace.\n          \n          They slap each other five and Dale exits. Saul turns on\n          the TV. Saved By the Bell is on. It makes Saul chuckle.\n          \n          \n          INT. DALE'S CAR - NIGHT\n          \n          Dale cruises down side streets and locates Ted's house.\n          It is a large well-to-do home. Having difficulties, Dale        \n          parks in between two cars across the street. He turns off\n          the engine and starts smoking a joint. SUDDENLY - FLASH!        \n          Two head lights appear up the street. Holy shit! It's a         \n          COP CAR!\n          \n          He sits still, holding the joint between his legs as the\n          cop car drives past and...parks a few cars down! The\n          FEMALE COP walks up the block - TOWARDS DALE'S CAR!\n          \n                                 DALE                                     \n                    Oh shit on me.                                        \n          \n          Fortunately,   the COP crosses the street and walks towards     \n          Ted's house.   Confused, Dale watches as she is let in.         \n          Dale waits a   moment and then re-lights the joint. He          \n          tries to see   into Ted's house as he takes a MASSIVE TOKE.\n          \n          BANG! A SILENCE SHATTERING BLAST comes from Ted's house.\n          Dale holds the toke in and tries to keep quiet as he\n          focuses on the large front window. SUDDENLY, the drapes\n          are torn down by an ASIAN MAN as he falls forwards and          \n          crashes through the front window!                               \n          \n          Dale watches in horror as a LARGE GREY-HAIRED MAN and the\n          Female Cop step forward and shoot the Asian man! BLAM!          \n          BLAM! Blood splatters!                                          \n          \n          Dale starts COUGHING UNCONTROLLABLY! He starts the car\n          and, in a panicked fit, tries to pull out. CRASH!!! He\n          smashes directly into the car in front of him! He flicks\n          the roach out onto the grass and slams the car in reverse\n          - CRUNCH!!! He backs into the car behind him! Still\n          hacking his lungs out, Dale drives away!                        \n          \n                                                                    21\n          \n          \n          \n          The Grey-Haired Man and the Female Cop sprint out of the\n          house in time to see Dale's distant tail lights vanish\n          into the darkness. Something catches the Grey-Haired\n          Man's eye - a trail of smoke rising from the grass. He\n          lowers his blood-stained hand and picks up...DALE'S\n          ROACH! He brings it to his nose and sniffs, then rips           \n          open the paper and examines the weed closely.\n          \n                                 TED\n                    Pineapple Express.\n          \n          \n          INT. SAUL'S APARTMENT - MOMENTS LATER\n          \n          Saul is laying on his couch watching Saved By the Bell,\n          laughing so hard that he's crying.\n          \n                                 SAUL\n                    Ha! Ha! Ha! Screech.                                  \n          \n          Suddenly, the BUZZER sounds repeatedly.\n          \n                                 SAUL (CONT'D)\n                           (mumbles)\n                    Fucking hell.\n          \n          He grudgingly walks to the intercom and presses talk.\n          \n                                 SAUL (CONT'D)\n                    Hello?\n          \n          He presses listen.\n          \n                                 DALE (O.C.)\n                           (through intercom)\n                    ...me in! Let me in! Let me in!    Let me\n                    in! It's Dale! Let m--\n          \n          Saul casually presses the talk button.\n          \n                                 SAUL\n                           (annoyingly casual)\n                    Denton? Dale Denton?\n          \n          He smiles to himself, then presses listen.\n          \n                                 DALE (O.C.)\n                           (through intercom)\n                    ...the love of shit, let me in! Pleeea-\n          \n          Annoyed, Saul buzzes him in and unlocks the door.\n          \n                                                                   22\n          \n          \n          \n                                 SAUL\n                           (to himself)\n                    ...fucking, don't smoke that shit if you\n                    can't handle it.\n          \n          A moment later, Dale, completely freaking out, BURSTS\n          through the door and SLAMS it shut.\n          \n                                 SAUL (CONT'D)\n                           (startled)\n                    Dude, whoa. What the fuck are-\n          \n                                 DALE\n                    He fucking killed him, man!\n          \n                                 SAUL\n                    Be quiet, man, I got neighbors-\n          \n                                 DALE\n                           (quietly)\n                    He killed him!\n          \n                                  SAUL\n                           (loud)\n                    Somebody killed somebody?!?\n          \n                                 DALE\n                    Yeah, man! I can't believe it. A cop! A\n                    lady, and a guy.\n          \n                                 SAUL\n                    Somebody killed a cop, a lady and a guy?\n          \n                                 DALE\n                    No! A guy!\n          \n                                 SAUL\n                    A cop killed a guy?\n          \n                                 DALE\n                    No! A cop and a guy killed   another guy!\n                    The lady and the guy...No,   a fucking\n                    woman, a police woman, and   an old guy,\n                    shot a guy, a younger guy,   in the fucking\n                    window at Ted's house!\n          \n                                 SAUL\n                    Was the guy Ted?\n          \n                                 DALE\n                    Which guy?\n          \n                                                                 23\n          \n          \n          \n                                 SAUL\n                    I don't know, the old guy who shot the\n                    guy?\n          \n                                 DALE\n                    I don't fucking know. He was this big,\n                    old, grey haired guy with a gun, and he\n                    fucking took him, and he shot him! Right\n                    there in the fucking window! BAM!\n          \n                                 SAUL\n                    I heard Ted's got grey hair!\n          \n                                 DALE\n                    And they saw me! They saw me see them\n                    shoot the guy!\n          \n          Saul jumps to his feet.\n          \n                                 SAUL\n                    What!?! They saw you?!? Why the fuck did\n                    you come here? Did they follow you?!?\n          \n          Saul dashes to the window and peeks out.\n          \n                                 SAUL (CONT'D)\n                    Did they follow you here!?!\n          \n                                 DALE\n                    No! I panicked. I was having a coughing\n                    fit, I crashed, I crashed into a car.\n                    Fuck, two cars. They must've heard at\n                    least. They knew someone was there.\n          \n                                 SAUL\n                    But they don't know it's you?\n          \n                                 DALE\n                    No. I don't think so. No.\n          \n                                 SAUL\n                    So...they're not coming here?\n          \n          Dale shakes his head, on the verge of tears. Saul shrugs,\n          sits back down, then picks up his joint and re-lites it.\n          \n                                 SAUL (CONT'D)\n                    Cool. So, what's your game-plan? You\n                    gonna call the cops? Cause if you do, I'd\n                    appreciate it if you left my shit out of\n                    this shit.\n          \n                                                                   24\n          \n          \n          \n                                 DALE\n                    I'm not calling the cops - one of them\n                    was a cop. They could all be cops!                   \n          \n                                 SAUL\n                    Did you see any blood? Was it sick?\n          \n                                 DALE\n                    Yeah. I saw some blood.\n          \n                                 SAUL\n                    I wonder who the guy he shot was?\n          \n                                 DALE\n                    I don't know, who do drug dealers kill?\n                    It was probably another drug dealer. He\n                    was Asian. Are there Asian drug dealers.\n          \n                                  SAUL\n                    Hell yeah, man. The Koreans teamed up\n                    with, like, the Vietnamese or some shit.\n                    They're crazy mother fuckers. Number two\n                    in town.\n                           (beat)\n                    Heh. Ted's cappin' the competition. Yo,\n                    you want some of this?\n          \n          Saul passes Dale the joint. Dale takes the joint and           \n          frantically smokes as he paces.                                \n          \n                                 SAUL (CONT'D)                           \n                    So, like, exactly what was the sequence\n                    of happenings?\n          \n                                 DALE                                    \n                    I'm sitting across from Ted's smoking a\n                    massive joint of that weed you sold me-\n          \n                                 SAUL\n                    Oh, the Pineapple Express. It's so rare\n                    it's almost a shame to smoke it, like\n                    killing a unicorn...with, like, a bomb.              \n          \n                                 DALE\n                    When I threw it...out...the window...                \n          \n          Dale stops pacing and stares at Saul. He then looks down       \n          at the joint of pineapple weed. Saul notices wheels\n          turning in Dale's head.\n          \n                                 SAUL\n                    What?\n          \n                                                                  25\n          \n          \n          \n          Dale continues staring at the joint.\n          \n                                 DALE\n                    This weed is actually that rare?\n          \n                                 SAUL\n                           (proudly)\n                    Yeah, it's like, \"the rarest\".\n          \n                                 DALE\n                    So, you are actually the only guy in town\n                    with this weed?\n          \n                                 SAUL\n                    Fuckin' rights, I am. Red told me he was\n                    giving me an \"exclusive sneak preview\".\n          \n                                 DALE\n                    And am I the only guy you gave it to?\n          \n                                 SAUL\n                    Yeah. So, we're the only guys.\n          \n                                 DALE\n                    But, like, another dealer, couldn't\n                    identify it, the pineapple weed? Like, if\n                    they found a roach of it, right?\n          \n          Saul thinks for a moment.\n          \n                                 SAUL\n                    I could. Why?\n          \n                                 DALE\n                           (panicking)\n                    We should go, we shouldn't be here! We\n                    should go!\n          \n                                 SAUL\n                    No...seriously, why?\n          \n                                 DALE\n                    I left a roach of this weed in front of\n                    Ted's house!\n          \n                                 SAUL\n                    So what? I leave roaches all over fucking\n                    town.\n          \n                                                                    26\n          \n          \n          \n                                 DALE\n                    No, listen - they could find the roach\n                    and say, \"This is pineapple weed, Saul's\n                    the only guy in town who has pineapple\n                    weed, therefore he must have witnessed\n                    the murder or know who did - let's go\n                    kill him.\"\n          \n          Finally, Saul understands.\n          \n                                 SAUL\n                    Mother of fuck!\n          \n          He SPRINGS to his feet and BOLTS for the door.\n          \n                                 SAUL (CONT'D)\n                    Let's go!\n          \n          Dale grabs Saul and stops him.\n          \n                                 DALE\n                    Wait!\n          \n                                 SAUL\n                    Why!?! Let go of me! Let's get the fuck\n                    out of here!\n          \n                                 DALE\n                    Saul, wait! Grab anything we might need,\n                    like your weed and money and stuff.                   \n          \n          Saul grabs his bag of weed and shoves it in his backpack.\n          They run for the door.\n          \n                                 DALE (CONT'D)\n                    Are you sure you're not forgetting\n                    anything?\n          \n                                 SAUL\n                    Yes! Come on!\n          \n          \n          INT. SAUL'S APARTMENT HALLWAY - MOMENTS LATER\n          \n          Saul and Dale run to the elevator and frantically press\n          the button, terrified for their lives.\n          \n                                 SAUL\n                    Fuck! I forgot something!\n          \n          Saul runs back to his apartment, leaving Dale alone and\n          frightened. Saul BURSTS back out of his apartment holding\n          his cell.\n          \n                                                                    27\n          \n          \n          \n                                 SAUL (CONT'D)\n                    Dude, I was so scared going back, I\n                    thought there was gonna be guys there,\n                    and then you'd be gone, and there was\n                    this music in my head-\n          \n                                 DALE\n                    We'll take the stairs, it'll be faster.\n          \n          They scramble towards the distant stairwell. Almost at\n          the door, they hear the DING of the elevator arriving.\n          \n                                 DALE (CONT'D)\n                    Go back! Go back!\n          \n          They DASH back to the elevator. Dale shoves his arm\n          between the doors and they hop in. Saul rapidly presses\n          the LOBBY button as the doors shut. They're both on the\n          verge of hyperventilating.\n          \n                                 DALE (CONT'D)\n                    Okay, man. We gotta try to relax.\n          \n                                 SAUL\n                    Why?!?\n          \n                                 DALE\n                    We don't want to draw attention.\n          \n                                 SAUL\n                           (freaking out)\n                    Whose attention!?! You think they could\n                    be down there? In the Lobby? Right now!?!\n          \n                                 DALE\n                    I don't know! Who knows? Just try to be\n                    cool.\n          \n           DING  The elevator SUDDENLY STOPS on the second floor.\n          \n                 DALE (CONT'D)                     SAUL\n          Oh my god!!!                  Ahhh!!!\n          \n          The doors OPEN! There's no one there. The doors close.\n          \n                                 SAUL\n                    What the fuck was that?\n          \n                                 DALE\n                    That was bad - Calm! Calm! Calm!\n          \n          The elevator stops at the lobby and the doors open, they\n          step out, bumping into two rough looking guys.                  \n          \n                                                                   28\n          \n          \n          \n                                  DALE (CONT'D)\n                    Oh. Pardon.\n          \n          Dale and Saul quickly leave as the bikers enter the\n          elevator.\n          \n          \n          INT. SAUL'S APARTMENT - MOMENTS LATER\n          \n          The rough looking guys, BUDLOFSKY and MATHESON, kick in        \n          Saul's door and dash into the room, guns drawn. Matheson       \n          spots a smoldering joint in the ashtray.\n          \n                                  MATHESON                               \n                    Look.\n          \n          Budlofsky whips out his cell and hits speed dial.              \n          \n                                 BUDLOFSKY                               \n                    Ted? He's gone, but he was just here. I              \n                    think he knew we were coming.                        \n          \n          \n          INT. DALE'S CAR - CONTINUOUS                                   \n          \n          Dale peels out of his spot and down the road.\n          \n                                 DALE\n                    Okay, what do you know about Ted?\n          \n                                 SAUL\n                    What? Ted? Nothing. For all I know he's\n                    tracking us with space satellites right\n                    now! He's got grey hair, that's all I\n                    knew.\n          \n          Saul checks behind them.\n          \n                                 SAUL (CONT'D)\n                    Let's go to your place.\n          \n                                 DALE\n                    No way! What if they did see my license\n                    plate!?!\n          \n                                 SAUL\n                    Okay, so let's got to a hotel, or a\n                    motel, or a Holiday Inn.\n          \n                                 DALE\n                    Well, how much money do we have?\n          \n                                                                   29\n          \n          \n          \n                                 SAUL\n                    All I've got is the seventy-five you gave\n                    me.\n          \n                                   DALE\n                    That's it!?!\n          \n                                 SAUL\n                    Well, how much money do you have?\n          \n          While Dale gets out his wallet, Saul opens Dale's change\n          tray. It's full of roaches.\n          \n                                 DALE\n                    Uh...nine bucks.\n          \n                                 SAUL\n                    Well, shut up then! I've got more than\n                    you!\n          \n                                 DALE\n                    Fine. Forget the hotel.\n          \n          A tense beat.\n          \n                                 SAUL\n                    I wish we could just go nowhere.\n          \n                                 DALE\n                    Okay...where's nowhere?\n          \n          \n          EXT. FOREST - CONTINUOUS\n          \n          The car is parked on a small dirt path in the moon-lit\n          woods. Dale paces back and forth as Saul walks over.\n          \n                                 DALE\n                    So what do we know? Nothing. We may or\n                    may not be followed because we don't even            \n                    know if he found the roach or not. And,\n                    we could just be completely crazy. But,\n                    the question is this: even if he found\n                    the roach, how could he know where you\n                    were?\n          \n                                 SAUL\n                           (thrilled)\n                    He couldn't. Cause I'm in the woods. It's\n                    impossible! Unless he's, like, hanging on\n                    the bottom of the car or some shit, but I            \n                    mean-\n          \n                                                                  30\n          \n          \n          \n                                 DALE\n                    No, what I mean is, if Ted found the\n                    roach and identified the weed, how could\n                    he connect it to you?\n          \n                                 SAUL\n                    There's no way. He could only find out\n                    from Red.\n          \n                                 DALE\n                    Who is this Red guy?                                \n          \n                                 SAUL\n                    Red's pretty much a middleman between Ted\n                    and guys like me. And we're mad fucking\n                    tight. One time he convinced some girl he\n                    knew to give me a hand-job within, like,\n                    five minutes of me meeting her.\n          \n                                 DALE\n                    But let's say someone calls asking who he\n                    sold this pineapple weed to, he'll say\n                    you, because...why wouldn't he?\n          \n                                 SAUL\n                    Fuck that. That's bullshit. He would have\n                    called me if that happened. A hand-job,\n                    Dale! Imagine if I'd gotten you a hand              \n                    job by now!                                         \n          \n                                 DALE                                   \n                    Yeah, but Saul, he's a fucking drug                 \n                    dealer.                                             \n          \n                                 SAUL                                   \n                    So? I'm a fuckin' drug dealer. What, you            \n                    don't trust me then?                                \n          \n          Saul stares at Dale, who doesn't know how to respond.         \n          \n                                 DALE                                   \n                    Um...I...call him. Yeah, sure, call him.            \n          \n                                 SAUL                                   \n                    Thank you!                                          \n          \n          Pleased, Saul pats Dale on the back.                          \n          \n                                 DALE\n                    You're right. You are. I'm just being               \n                    paranoid. Sorry, dude.                              \n          \n                                                                   31\n          \n          \n          \n          Saul takes his cell phone out and presses speed dial. We\n          hear someone pick up.\n          \n                                 RED (O.S.)\n                           (through phone)\n                    Ow! Hello?\n          \n                                 SAUL\n                    Yo, Red. You okay man?\n          \n                                 RED (O.S.)\n                    Saul! Oh. I, uh...stubbed my toe.\n          \n          Red sounds nervous.\n          \n                                 SAUL\n                    Dude, watch the toes. Wear shoes in the\n                    house. But Red, I gotta get straight to\n                    brass tacs, I need a favor.\n          \n                                 RED (O.S.)\n                    Sure man, anything. I'm Red.\n          \n                                 SAUL\n                    You sure as fuck are, buddy. So, you know\n                    how you gave me some of that pineapple\n                    express stuff? Don't tell anyone you gave\n                    it to me.\n          \n                                 RED (O.S.)\n                    Sure man, no problem. Red swears it,\n                    hombre.\n          \n                                 SAUL\n                    So, can I come on over now?\n          \n          Dale waves his hands in front of Saul's face.\n          \n                                 DALE\n                           (louldy whispering)\n                    No! We should do it tomorrow!\n          \n                                  SAUL\n                           (covering phone, talks to\n                            Dale)\n                    I'm in the middle of a convo, man. Let's\n                    just go and get this shit over with.\n          \n                                 DALE\n                    Come on, man. Tomorrow. I'm scared\n                    shitless. I want to think things through\n                    before I do anything. Let's go in the\n                    morning. Please.\n          \n                                                                    32\n          \n          \n          \n          Saul looks around the dark forest.\n          \n                                    SAUL\n                       Yeah...okay. Less scary shit happens in\n                       the day.\n          \n          Dale nods.\n          \n                                    SAUL (CONT'D)\n                              (into phone)\n                       Red?\n          \n                                    RED (O.S.)\n                              (talking to someone else)\n                       -I can hear him talking to someone, so-\n                       Yo! Saul? So, you're gonna come by in the\n                       morning?\n          \n                                    SAUL\n                       Yeah, right after I see my grandma.\n          \n                                    RED (O.S.)\n                       Sure, your Grandma's retirement home- Ow!\n                       Fuckin' stupid god-damn toe. I, uh, is\n                       that the one on Granville and 41st.\n          \n                                    SAUL\n                       Yeah man. I've only got one. So, we'll be\n                       chillin' by noon.\n          \n          Saul gives Dale the thumbs up.\n          \n                                    RED (O.S.)\n                       Well, cool brother. Noon it is.\n          \n                                    SAUL\n                       We should definitely hit up the casino\n                       again sometime.\n          \n                                    RED (O.S.)\n                       For sure. We should definitely hit up the\n                       casino.\n          \n          Saul hangs up the cell.\n          \n                                    SAUL\n                       Nice. Now let's do some fucking stone\n                       cold chilling. I'll role a jigga, on the           \n                       house.                                             \n          \n                                                                    33\n          \n          \n          \n          \n          INT. RED'S APARTMENT - MAIN ROOM - CONTINUOUS\n          \n          RED, 30, stalky and short, sits between the BUDLOFSKY and       \n          MATHESON                                                        \n          \n                                 BUDLOFSKY                                \n                    Why isn't he coming now? What did you\n                    say?\n          \n                                 RED\n                           (incredibly afraid)\n                    I didn't say shit, man! There was another\n                    guy there and he said tomorrow!\n          \n                                 MATHESON                                 \n                    Why did he mention the casino? The Asians\n                    run the casinos. Is Saul Asian?\n          \n                                    RED\n                    No, man!\n          \n          This worries the thugs.                                         \n          \n                                 MATHESON                                 \n                    This might be more than we thought.\n          \n                                 BUDLOFSKY                                \n                    Than you thought. I thought it would be               \n                    more than you did. I'll call Ted.                     \n          \n          \n          EXT. FOREST - CONTINUOUS                                        \n          \n                                 SAUL\n                    I always liked smoking weed in the                    \n                    forest.                                               \n          \n          Saul lights a joint and starts smoking. He passes it to         \n          Dale. Dale puffs. They look around at their expansive,          \n          dark surroundings and immediately become overwhelmed with       \n          paranoia. Saul notices a shooting star zip across the sky       \n          as Dale takes out his cell phone.                               \n          \n                                 DALE\n                    I'm going to go call Angie. Make up some\n                    bull shit.\n          \n          As Dale dials, Saul, paranoid from the pot, looks at his\n          cell phone. He takes another hit, and then looks up to\n          the sky again. He looks back at Dale's phone. Dale starts\n          to walk off.\n          \n                                                                    34\n          \n          \n          \n                                   SAUL\n                    Dale...wait!\n          \n          Saul snubs out the joint and runs over to Dale.\n          \n                                 SAUL (CONT'D)\n                    Yeah, the phone...I mean, I don't know\n                    how this shit works, but...can cops...\n                    you said they might be cops...could they\n                    triangulate our phones or trace `em or\n                    some shit like that? I don't know. I feel\n                    like I've seen that.\n          \n          Dale stares at Saul, then flips open his phone -  beep \n          \n                                 SAUL (CONT'D)\n                    I mean, shit Dale, maybe they can trace\n                    them when we're not even on them!\n          \n          Dale takes a hit as he looks up to the sky. Just then, a\n          loud rumbling noise is heard.\n          \n                                 DALE\n                    What the fuck is that?!\n          \n          The rumbling gets louder.\n          \n                                 DALE (CONT'D)\n                    Are we on fucking \"Lost\"?! What the hell\n                    is that?!\n          \n                                   SAUL\n                    It's them!!!\n          \n          The noise builds to a deafening crescendo as the guys\n          dive behind a tree stump. A moment later, a JUMBO JET\n          buzzes overhead, heading towards the nearby airport. Dale\n          and Saul pop up.\n          \n                                 SAUL (CONT'D)\n                    Holy fuck. That was close.\n          \n                                 DALE\n                           (clutching cell phone)\n                    You know what? You're right. We should\n                    just get rid of them. We should just\n                    smash `em.\n          \n          Dale looks at his phone, which is a new, expensive Razor.\n          \n                                 DALE (CONT'D)\n                    Fuck. I just bought this thing. Maybe I\n                    can just take the batteries out?\n          \n                                                                    35\n          \n          \n          \n                                 SAUL\n                    No! Smash it!\n          \n          Dale sighs, then SMASHES his phone on a rock. Saul looks\n          at Dale, then HURLS his phone into the woods as hard as\n          he can, sending it SAILING into the FOREST.\n          \n                                 SAUL (CONT'D)\n                    Shit!\n          \n                                 DALE\n                    What the fuck was that?!\n          \n          Dale tosses the joint aside.\n          \n                                 SAUL\n                    Fuck! I was trying to throw it at that\n                    tree!\n          \n                                 DALE\n                    What tree?\n          \n                                 SAUL\n                    That one.\n          \n          Saul points out a group of trees about 30 feet away.\n          \n                                 SAUL (CONT'D)\n                    It was a cheap piece of shit. Came free\n                    with the plan. It must've smashed when it\n                    landed.\n          \n                                 DALE\n                    Who the fuck knows?!? I don't know!! Why\n                    couldn't you have just smashed it on a\n                    rock like a normal person?\n          \n                                 SAUL\n                    I was trying to smash it! How often does\n                    a guy smash things? I'm rusty. Fuck.\n          \n                                 DALE\n                    Did you at least see where it landed?\n          \n                                 SAUL\n                    Over there, somewhere. Wait! We could\n                    call it!\n          \n                                 DALE\n                    With what? I just smashed my phone!\n          \n          They look into the scary dark depths of the woods. Both\n          of them are clearly terrified.\n          \n                                                                 36\n          \n          \n          \n                                 SAUL\n                    Man, it's not like they got McGuyver\n                    workin' on the case. I bet they can't\n                    even triangulate it.\n          \n                                 DALE\n                    Well, then you shouldn't have said\n                    anything, cause now you've convinced me\n                    that they can!\n          \n                                 SAUL\n                    Fine! Fine. Let's just find the stupid\n                    thing and get back to doing what we were\n                    doin'.\n          \n          Horrified, they cautiously inch into the forest.\n          \n                                 DALE\n                    Do you see it?\n          \n                                 SAUL\n                    Dude, this is the scariest place I've\n                    ever been in my life.\n          \n          They nervously walk on.\n          \n                                 SAUL (CONT'D)\n                    You ever see that movie where all the\n                    people are in the woods and they slowly\n                    get killed?\n          \n                                 DALE\n                    The \"Blair Witch Project.\"\n          \n                                 SAUL\n                    No...Shit. That one's way scarier than\n                    the one I was thinking of. Mine had\n                    Arnold Shwartzenegger in it. Now I'm\n                    thinking of the fucking Blair Witch.\n          \n          They inch forward, nervous.\n          \n                                  DALE\n                            (whispering)\n                    Stop!\n          \n          They both freeze.\n          \n                                  SAUL\n                            (whispering)\n                    What-\n          \n                                                                    37\n          \n          \n          \n                                  DALE\n                            (whispering)\n                    Sshh!\n          \n                                 SAUL\n                           (whispering)\n                    What is-\n          \n                                 DALE\n                           (whispering)\n                    Sshh! Can you hear that?\n          \n                                  SAUL\n                            (whispering)\n                    What?\n          \n                                 DALE\n                           (whispering)\n                    Just listen.\n          \n          Saul listens.\n          \n                                  SAUL\n                           (whispering)\n                    I literally hear nothing.\n                           (gasp)\n                    Wait...\n          \n          SUDDENLY, Saul SPRINTS off into the darkness!\n          \n                                    DALE\n                    SAUL!!!\n          \n          Dale looks in horror as Saul vanishes amongst the trees.\n          \n                                 SAUL(O.S.)\n                           (screaming in pain)\n                    ARGHHH!!!\n          \n          Dale hears a loud THUD.\n          \n          Scared for his life, he SPRINTS in the opposite\n          direction! He weaves in between the trees, avoids some\n          rocks and tree roots, stumbles on some loose dirt, then\n          SLAMS half his body against a tree and FALLS HARD.\n          \n          ANGLE ON: SAUL\n          \n          Saul gets up, covered in dirt. Panting, he looks around\n          the forest and sees no one. He thinks he hears something\n          and SPRINTS off! WHAM! He trips on a tree root and SLAMS\n          into the ground.\n          \n                                                                    38\n          \n          \n          \n          ANGLE ON: DALE\n          \n          Dale stumbles to his feet while futilely trying to wipe\n          the dirt off his suit.\n          \n                                 DALE\n                    Shit.\n          \n          Saul hears Dale and whips around, breaking a twig -\n           CRACK \n          \n          Dale looks towards the noise, then SPRINTS off.\n          \n          Saul hears someone and BOLTS in the opposite direction.\n          \n          Like chickens with their heads cut off, they both\n          scramble through the woods trying to evade their\n          imaginary enemies.\n          \n          Dale spots his car! He jumps in and SLAMS the door shut.\n          He's about to turn the ignition, but stops. Panting and\n          wheezing, he sinks into his seat.\n          \n          BAM! Something slams into the car.\n          \n                                 DALE (CONT'D)\n                    AAAAAHHHHHHH!!!\n          \n          Dale sees Saul BANGING against the passenger side door.\n          \n                                 SAUL\n                           (muffled through the window)\n                    Let me in! Let me in!\n          \n          Dale unlocks the car and Saul JUMPS in.\n          \n                                 SAUL (CONT'D)\n                    Let's go! Go!\n          \n                                 DALE\n                    Is there anyone even out there?!?\n          \n                                 SAUL\n                    I don't know!\n          \n                                 DALE\n                    If you don't know then why the hell did\n                    you run like that?!?\n          \n                                 SAUL\n                    I don't know! I'm freaking out, man!\n                    Let's just go!\n          \n                                                                    39\n          \n          \n          \n                                 DALE                                     \n                    No! We're not going anywhere!                         \n          \n                                 SAUL                                     \n                    But there could be something out there!               \n          \n                                 DALE                                     \n                    There's nothing out there, that's why                 \n                    we're here. God, man, you scared the                  \n                    fucking shit out of me.                               \n          \n                                 SAUL                                     \n                    Well, I'm not getting out of the car. I'm             \n                    staying in the car.                                   \n          \n          A moment of silence. They both look around. There is\n          clearly nothing out there. Dale turns on the car. Talk\n          radio comes on.\n          \n                                 RADIO DJ\n                    -white accent walls would go nice with a              \n                    dark colored room, say a burnt sienna,                \n                    but don't forget...                                   \n          \n                                 SAUL\n                    Talk radio? You fuckin' joshin' me? Why               \n                    don't we just shoot ourselves in the                  \n                    nuts?                                                 \n          \n                                 DALE\n                    Shut up, okay? It's my car.                           \n          \n                                 SAUL\n                    Fine. Well, I'm going to smoke a joint                \n                    before I go to sleep, and don't worry                 \n                    about it, even though you're being a                  \n                    dick, it's on the house.                              \n          \n                                 DALE                                     \n                    Don't do me any fucking favors. I got my              \n                    own.                                                  \n          \n                                 SAUL                                     \n                    Thanks to me!                                         \n          \n                                 DALE                                     \n                    Shut up.                                              \n          \n          Dale and Saul start rolling separate joints.                    \n          \n                                                                   40\n          \n          \n          \n          \n          INT. DALE'S CAR - THE NEXT DAY\n          \n          Dale slowly wakes up. He stretches, and then shakes Saul.\n          \n                                 DALE\n                    Saul. Saul. Get up. Wake up.\n          \n          Saul opens his eyes and realizes where he is.\n          \n                                 SAUL\n                    Fuck me.\n          \n                                 DALE\n                    What's the time?\n          \n                                 SAUL\n                           (groggy)\n                    It's too early.\n          \n          Saul brings his wrist up close to his eyes.\n          \n                                 SAUL (CONT'D)\n                    It's...\n          \n          Saul stares at his watch, confused.\n          \n                                 SAUL (CONT'D)\n                    This can't be right.\n          \n                                 DALE\n                    What does it say?\n          \n                                 SAUL\n                    It says, uh...\n          \n          Saul looks outside towards the sun.\n          \n                                 SAUL (CONT'D)\n                    It couldn't be three in the morning,\n                    could it?\n          \n                                 DALE\n                    It's three o'clock!?! We were supposed to\n                    be there at noon!\n          \n                                  SAUL\n                           (excited)\n                    Wait! My grandma's clocks! It's daylight\n                    savings!\n                           (beat)\n                    Fuck! No! They go forwards an hour!\n                    Dammit-\n          \n                                                                  41\n          \n          \n          \n                                 DALE\n                    It's four o'fucking clock?!\n          \n                                 SAUL\n                    -I didn't go to my Grandma's! Fuck! And\n                    we've gotta call Red.\n          \n                                  DALE\n                            (angry)\n                    How?\n          \n          Dale digs in his pockets for the keys.\n          \n                                 SAUL\n                    We'll find a pay pho...fuck! His number\n                    was in my phone!\n          \n          Dale notices the keys are in the ignition.\n          \n                                 DALE\n                    You remember where he lives, right?\n          \n                                 SAUL\n                    Yes, I remember. What the hell is that\n                    supposed to mean? Are you insinuating I'm\n                    forgetful? That's right, I know the word\n                    insinuating.\n          \n                                 DALE\n                    Let's just get out of here.\n          \n          He turns the keys. NOTHING. He tries again. NOTHING.\n          \n                                 DALE (CONT'D)\n                    What the fuck? Come on.\n          \n          He tries twice more, but nothing happens.\n          \n                                 DALE (CONT'D)\n                           (pissed off)\n                    I think the battery's dead.\n          \n                                 SAUL\n                    Are you fucking serious?\n          \n          He tries again.\n          \n                                  DALE\n                    It's dead.\n          \n                                  SAUL\n                    It's dead?                                          \n          \n                                                                  42\n          \n          \n          \n          Dale shoots Saul an angry look.                               \n          \n                                  SAUL (CONT'D)                         \n                     What the fuck happened? How did this\n                     happen?\n          \n                                  DALE\n                     How? We fell asleep!                               \n          \n                                  SAUL                                  \n                     Yeah. With your stupid talk radio. No              \n                     surprise, that stuffs, like, made to put           \n                     people to sleep.                                   \n          \n          Frustrated, Dale tries to gather his thoughts.\n          \n                                  DALE\n                     We gotta...let's just...we'll walk. We'll          \n                     walk to a road and hitchhike to Red's.\n          \n                                 SAUL\n                     For real?\n          \n          Dale opens his door and hops out.\n          \n                                  DALE\n                     Yeah, \"for real\". We'll be late, but               \n                     we'll get there. Then we can fix this\n                     insane situation.\n          \n          MONTAGE:                                                      \n          \n          - Dale and Saul walk down a seemingly unused forest road,     \n          each smoking their own joint.                                 \n          \n          - Saul points out a giant caterpillar crawling on a leaf.\n          Dale is grossed out. Saul pokes the caterpillar and then\n          blows weed smoke onto it.\n          \n                                  DALE (CONT'D)                         \n                     Stop fucking around, man. Come on. Leave           \n                     that thing alone.                                  \n          \n          - They emerge at the highway and try to hitch a ride.\n          \n          - Dale notices Saul has his thumb sticking out of his         \n          zipper.\n          \n                                  SAUL\n                     It's like, my thumb is my cock!\n          \n          Dale doesn't laugh.                                           \n          \n                                                                    43\n          \n          \n          \n          - Bored and tired, they wait.   Saul lights a joint. Dale       \n          notices. Saul shifts his body   away from Dale. Just then,      \n          an eighteen wheeler slows for   them. Saul snubs out the\n          freshly lit joint and puts it   in his pocket.\n          \n          \n          EXT. RED'S HOUSE - LATER                                        \n          \n          Dale and Saul get out of the eighteen wheeler.\n          \n                                 SAUL\n                           (to the driver)\n                    Thanks a fucking ton, Sharid.\n          \n          Saul shuts the door and he and Dale run towards Red's           \n          house - a small, dilapidated place in a rundown part of         \n          town. Exhausted, Dale and Saul reach Red's door. Saul           \n          knocks.\n          \n                                 DALE\n                    So, what's this guy like?\n          \n                                 SAUL\n                    I don't know. He's short...and stout. So\n                    he's like a tea pot. Hehe.\n          \n                                 DALE\n                    Well, do you think he'll be there?\n          \n                                  SAUL\n                    I don't know, I mean, we are only...eight\n                    hours late.\n                           (beat)                                         \n                    That's actually pretty late.                          \n          \n                                 RED (O.S.)\n                           (through door)\n                    Who is it?\n          \n                                 SAUL\n                    Red! It's Saul. Open up.\n          \n          Red opens the door. He has a SPLIT LIP and has clearly\n          been CRYING. He tries to act normal. Dale immediately\n          suspects something is up.\n          \n                                 RED\n                           (sniffling)\n                    Who's this guy?\n          \n                                 DALE\n                    Dale. Nice to meet you.\n          \n                                                                    44\n          \n          \n          \n          Red ushers them in and shuts the door.\n          \n                                   RED\n                    Dale who?\n          \n                                   DALE\n                    I think it's    better if you don't know my           \n                    last-                                                 \n          \n                                 SAUL\n                           (oblivious)\n                    Dale Denton. He's with me. No worries.                \n          \n          Red notices their dirty clothes.\n          \n                                 RED\n                           (to Saul)\n                    What happened to your clothes? Where'd\n                    you call me from, man?\n          \n          Dale notices Red quivering as he lights a cigarette and\n          becomes increasingly suspicious.\n          \n                                 SAUL\n                    We were in the forest laying low.\n                    Thinking.\n          \n                                 DALE\n                    Uh, Red...what...uh, is your lip okay?\n          \n          Saul finally notices Red's dishevelled appearance.\n          \n                                 SAUL\n                    Whoa! Dude, have you been crying?\n          \n                                 RED\n                    What? Oh, I uh...\n                           (feeling his split lip)\n                    ...I got a cold sore, I've never got one\n                    before. I started crying.\n          \n                                 SAUL\n                    A cold sore? Is that fucking herpes?\n          \n                                 RED\n                    ...uh, yeah, man.\n          \n                                 SAUL\n                    Ewwww! That's sick, man. Do you know how\n                    many joints we've shared? I told you,\n                    man. This is from that time you ate the               \n                    lollypop straight from the strippers sna-\n          \n                                                         45\n          \n          \n          \n                       DALE\n          Saul. Ask him.\n          \n                       SAUL\n                     (to Dale)\n          Okay, Captain Demando. Can you just chill\n          out, maybe? So, Red. I gotta ask-\n          \n                       RED\n          Okay, first of all, stop. What's this all\n          about? That's what I want to know.\n          \n                       SAUL\n          Alright. Well, Dale's a servant for\n          protest lawyers, and-                                \n          \n                       DALE\n          Whoa, whoa! Saul, I don't think...well,\n          Red, I don't mean to be rude but I don't\n          think we should tell you any more than\n          you need to know.\n          \n                       RED\n          Fuck that, Dale. This is my house, I\n          deserve to know.\n          \n                       SAUL\n          Dude! Let's just tell him. It is his\n          house.\n          \n                       DALE\n          Look. Red, I just don't want to pull you\n          into the shit we're in. It's just\n          trouble.\n          \n                       SAUL\n          Don't be weird about this. If he wants\n          trouble, it's his right to have it.\n          \n                       RED\n          Whoa! Whoa! I don't want trouble.\n          \n                       DALE\n          That's why we only need to clarify one\n          thing - nobody's called about Saul or the\n          pineapple express or anything like that?\n          \n                       RED\n          No one. Nada.\n          \n                                                                   46\n          \n          \n          \n                                 SAUL\n                    Awesome! Look at that! Everything's fine.\n                    We had a crazy night in the woods, which             \n                    I assume we can both put behind us like              \n                    grown ups, and now we can use Red's giant            \n                    bong to get super-duper high.                        \n          \n          Dale doesn't seem convinced. Saul picks up Red's huge          \n          bong and starts to pack a bit of Red's weed into it.           \n          \n                                 RED                                     \n                    Alright, well, wicked. Make yourselves at\n                    home. I'm just going to use the ol'\n                    telephone-o.                                         \n          \n          Saul sits down and picks up a lighter as Red walks             \n          towards the phone. Dale watches Red, suspicious of his         \n          odd behavior. Red begins to dial...\n          \n          SMACK! Dale knocks the phone out of Red's hand.\n          \n                                 RED (CONT'D)\n                    What the fuck!\n          \n          Saul jumps up. Dale SNATCHES the phone and backs up.\n          \n                                 DALE\n                    I'm sorry! I'm sorry!\n          \n                                  SAUL\n                    Dale!   What the fuck are you doing?\n          \n                                 DALE\n                           (to Saul)\n                    We can't let him call anyone! He's acting\n                    weird!\n          \n                                 RED\n                    Fuck you man - this is my house!                     \n          \n                                 DALE\n                    I'm sorry. I just, I don't think I can-\n          \n                                 SAUL\n                    Dale! You fucking nut. You're stoned and\n                    paranoid. Just chill the shit out, guy!\n                           (to Red)                                      \n                    I'm sorry, Red. I shouldn't have brought             \n                    this guy over here, he's a total lunatic.            \n          \n          Without warning, Red grabs a LARGE ASHTRAY filled with\n          cigarette butts and WHIPS it at Dale. BAM! It smashes him\n          in the head!!!\n          \n                                                                    47\n          \n          \n          \n                                 DALE\n                           (in pain)\n                    AAAHHH!\n          \n          Ash EXPLODES everywhere as Dale drops the phone and\n          clutches his head.\n          \n                                   SAUL\n                    Holy cock!\n          \n          Red approaches the cowering Dale. Saul intercedes.\n          \n                                 SAUL (CONT'D)\n                    Dude! He's sorry! Wait!\n          \n          Red PUNCHES Saul in the face! Saul SCREAMS and drops to\n          the ground.\n          \n                                   SAUL (CONT'D)\n                    WHY!?!?!\n          \n          Dale snatches the phone and scurries into the bathroom,\n          slamming the door behind him.\n          \n          \n          INT. RED'S BATHROOM - CONTINUOUS\n          \n          Disoriented, Dale scans the small bathroom. Saul and Red\n          can be heard fighting outside.\n          \n                                 SAUL (O.S.)\n                    Dude, we're friends, what the fuck is                 \n                    wrong with you? Ow! Dude! Are you fucked              \n                    off that shit again!?! Ow!                            \n          \n                                 RED (O.S.)\n                    I have to! They'll kill me!!! Please                  \n                    don't fight!                                          \n          \n          A loud CRASH is heard from the other room.\n          \n                                   SAUL                                   \n                    AAAHHHHHH!!!                                          \n          \n          Dale throws the phone in the toilet bowl and smacks down\n          the seat. He runs back to help Saul.\n          \n          \n          INT. RED'S APARTMENT - CONTINUOUS\n          \n          Red is BEATING the shit out of Saul.\n          \n                                                                    48\n          \n          \n          \n                                 SAUL                                     \n                    Why, man!?! Why!                                      \n          \n                                   RED                                    \n                    I'M SORRY!!!                                          \n          \n          Saul manages to stand up when Red boots him in the BALLS!\n          He SHRIEKS and stumbles backwards. Dale dashes into the\n          room and LEAPS onto Red's back. Red wobbles forward, then       \n          starts RUNNING BACKWARDS. He trips on his coffee table\n          and CRASHES Dale through it, landing on top of him. Red         \n          gets up, sprints into the bathroom and locks the door.\n          With great effort, Dale and Saul manage to get up.\n          \n                                 DALE                                     \n                    He's going for the phone! Bathroom!                   \n          \n          \n          INT. RED'S APARTMENT/BATHROOM - CONTINUOUS\n          \n          Frantically searching for the phone, Red flips the toilet\n          seat up and grabs it. He begins to dial as Dale and Saul\n          sprint down the hall.\n          \n          Just as Red is about to finish dialing, Dale and Saul\n          CRASH into the bathroom door! They knock it completely\n          off it's hinges, SLAMMING it directly into Red! The phone\n          flies into the bathtub.\n          \n                                 DALE\n                           (pointing at the phone)\n                    SAUL!!! Phone!!!\n          \n          Saul jumps into the bathtub and begins STOMPING the\n          phone. Dale continuously SLAMS his body against the door\n          in an attempt to keep Red pinned down.\n          \n                                 SAUL\n                    What the fuck Red!?! What the fuck is\n                    going on!?!\n          \n                                 RED\n                    I don't know!!! They're going to kill\n                    me!!!\n          \n                                 SAUL\n                    You didn't stub your toe, did you?\n          \n          Red stops struggling and tries to catch his breath. Dale\n          kneels on top of the door, keeping him pinned.\n          \n                                   DALE\n                    Now tell us-\n          \n                                                                   49\n          \n          \n          \n                                 RED\n                    They're gonna come back and kill me!!!\n          \n          In an impressive show of strength, Red shoves the door\n          off him, knocking Dale aside. He runs.\n          \n          \n          INT. RED'S APARTMENT - CONTINUOUS\n          \n          Saul chases Red and TACKLES him into a wall. Dale follows\n          seconds later, and notices Red's LARGE GLASS BONG. He\n          looks back to see Saul getting pummelled.\n          \n                                  SAUL                                   \n                    DALE! HELP!                                          \n          \n          Dale grabs the bong and swings around - CRASH!!! It\n          shatters on the back of Red's head.\n          \n          Red falls to the ground moaning, blood dripping from his\n          head. Dale and Saul stand over him, out of breath,\n          bruised and battered.\n          \n                                 SAUL (CONT'D)                           \n                    Red, you motherfucker.\n          \n          Dale, lost in thought, starts to seriously freak out.\n          \n                                 DALE\n                    It's happening! It's actually happening!\n                    He knows my name! Red knows my name!\n          \n                                 SAUL\n                    We should beat it out of his sellout\n                    brains. You're a shitty friend, Red! Fuck\n                    the Casino! Go alone!\n          \n                                 DALE\n                    This is fucked, what do we do now, he\n                    knows my name!?!\n          \n                                 SAUL\n                    He knows my name too!\n          \n                                 DALE\n                    Well what do we do? He's gonna tell them!\n          \n                                 SAUL\n                    We're not gonna have to kill him, are we?\n                    I don't think I could do that.\n          \n          Dale stares at the almost motionless Red.\n          \n                                                                  50\n          \n          \n          \n                                 SAUL (CONT'D)\n                    Maybe we could talk him into killing\n                    himself, or, like, make him promise not\n                    to tell.\n          \n                                 DALE\n                    Well, we have to find out what he knows.\n          \n                                 RED\n                           (in great pain)\n                    I don't know anything...you broke my\n                    bong...\n          \n          Dale, trying to act tough, grabs Red by the collar.\n          \n                                 DALE\n                    Tell us everything. Now!\n          \n          Red looks to Saul for sympathy.\n          \n                                 SAUL\n                    Don't look at me, you sellout bastard.\n                    Now start talking!\n          \n                                 RED\n                    I can't...I don't know anything.\n          \n          Dale pulls Saul aside.\n          \n                                 SAUL\n                    What do we do? He's not gonna talk.\n          \n                                 DALE\n                    I think we beat it out of him.\n          \n                                   SAUL\n                    For real?\n          \n                                 DALE\n                    Okay. Red. Here's the deal: if you don't\n                    tell us everything, we're going to beat\n                    you up.\n          \n                                 RED\n                    Don't beat me up! Saul, dude, I'm Red!\n          \n                                 SAUL                                   \n                    You were Red. Now you're no one to me.              \n          \n                                 DALE\n                    You've got five seconds, okay? Ready?\n                    Five, four-\n          \n                                                                 51\n          \n          \n          \n          Dale raises his fist.\n          \n                                 RED\n                    Please don't.\n          \n                                 DALE\n                    Three, two...one!\n          \n          Red cringes as Dale softly \"punches\" his gut. It doesn't\n          hurt him.\n          \n                                 RED\n                    That didn't hurt.\n          \n                                 SAUL\n                    You didn't even hurt him! Hit him hard,\n                    man. Like, fucking hit him!\n          \n          Dale takes a deep breathe and raises his fist.\n          \n                                 RED\n                    Wait! I...I...                                     \n          \n          Dale grabs a potted plant.                                   \n          \n                                  RED (CONT'D)                         \n                    No!                                                \n          \n          Dale swings the plant back to strike Red. The pot flies      \n          off the plant and Dale smashes the dirt covered roots of     \n          the plant against Red's face.                                \n          \n                                 RED (CONT'D)                          \n                    Ow! Fuck, man! Stop it.                            \n                    Listen...two...two guys came here,                 \n                    they...they were here when you called-\n          \n                                  SAUL\n                    Seriously?\n          \n                                 DALE\n                    Who were they?\n          \n          Dale raises his fist.\n          \n                                 RED\n                    They work for Ted. Budlofsky and                   \n                    Matheson. Fuckin' crazy weird guys. They           \n                    were here all day, but you guys didn't\n                    show. They said they'd kill me if I\n                    didn't bring you to them, they said I'd-\n          \n                                                                   52\n          \n          \n          \n                                 DALE\n                    How many cops does he have in his...uh,\n                    payroll, or whatever?\n          \n                                 RED\n                    I know there's this lady cop. He could\n                    have more, I don't know. He's got pretty\n                    crazy connections. He's also got a cool-             \n                    ass hideout. It's crazy man.                         \n          \n          Dale and Saul exchange very worried looks.\n          \n                                  RED (CONT'D)\n                    Listen, I-\n          \n          Dale swings the PLANT upwards, prepared to strike Red          \n          again.                                                         \n          \n                                 DALE\n                    Who's his competition?\n          \n                                  RED\n                    The Asians!\n          \n                                 DALE\n                    Asians? Which Asians? Indians are\n                    technically Asian.\n          \n                                 RED\n                    The...the Koreans, I think. Everyone just\n                    calls them the Asians.\n          \n          Dale and Saul exchange an even more worried look.\n          \n                                  SAUL\n                    What else?\n          \n                                 RED\n                    I swear to god that's all I know...I                 \n                    swear...\n          \n                                 DALE\n                    Alright. We should...tie him up and...and\n                    get the fuck out of here.\n          \n                                 SAUL\n                    I made a gravity bong here once. I know\n                    where his duct tape is.\n          \n          Saul runs off. Dale puts on Saul's backpack and looks at\n          the battered Red moaning on the floor.\n          \n                                                                    53\n          \n          \n          \n                                 SAUL (CONT'D)\n                    Come on, let's tape this piece of shit\n                    up.\n          \n          Dale pulls Red's hands behind his back. Saul is picking\n          at the tape.\n          \n                                 SAUL (CONT'D)\n                    I can't find the edge.\n          \n                                 DALE\n                    What?\n          \n                                 SAUL\n                    I can't find the, oh...wait...\n          \n          Saul rips open the DUCT TAPE. He quickly BINDS Red's            \n          hands and feet. SUDDENLY, there's a KNOCK at the door.          \n          They stop, silent. KNOCK. KNOCK. KNOCK. Red starts              \n          thrashing and trying to scream.\n          \n                                 SAUL (CONT'D)\n                           (whispering)                                   \n                    Shit. They're actually here to kill him.\n          \n                                 DALE\n                           (whispering)                                   \n                    What do we do?                                        \n          \n                                 SAUL\n                           (whispering)                                   \n                    I don't know.                                         \n          \n          KNOCK! KNOCK!                                                   \n          \n                                 DALE                                     \n                           (whispering)                                   \n                    Fuck. Oh, man.                                        \n          \n          Frozen in terror, they don't know what to do.                   \n          \n                                 RED                                      \n                           (whispering)                                   \n                    Guys, guys...listen to me-                            \n          \n          KNOCK! KNOCK! KNOCK!                                            \n          \n                                 RED (CONT'D)                             \n                           (whispering)                                   \n                    I'm fuckin' sorry. Okay? I fucked up. I'm             \n                    a son-of-a-bitch. I forgot bros before                \n                    hoes, even though these guys aren't hoes.             \n                    You know what I mean. But I can fix this.             \n                                 (MORE)\n          \n                                                                 54\n          \n                                 RED (CONT'D)\n                    I know these guys, it's cool. Just head            \n                    out the back, I'll stall `em. Won't tell           \n                    `em nothing. You can count on me!                  \n          \n                                    SAUL                               \n                    Thanks, Red.                                       \n          \n          Red frantically tries to wriggle out of his bonds while      \n          Saul leads Dale out the back door. SUDDENLY, the door is     \n          KICKED open! Budlofsky and Matheson enter, guns drawn.       \n          They see Red.                                                \n          \n                                 RED                                   \n                    Dale Denton! It was Saul and some dude             \n                    named Dale Denton! They just ran out the           \n                    back!                                              \n          \n          \n          EXT. ALLEY - CONTINUOUS                                      \n          \n          Dale and Saul run like hell. Saul spots a dumpster.          \n          \n                                    SAUL\n                    In here!\n          \n          Saul jumps into the dumpster.\n          \n                                 DALE\n                    No. I've got to get to a phone!\n          \n                                 SAUL\n                    We should hide!\n          \n                                 DALE\n                    But, if Red tells Ted's guys my name,\n                    then they'll go to my apartment and find\n                    out about Angie!\n          \n                                 SAUL\n                    I think we should stay!\n          \n                                    DALE\n                    Why?!\n          \n                                 SAUL\n                    Because I'm in the dumpster already!\n                    Shit! Fine!\n          \n          Saul hops out of the dumpster and follows Dale.\n          \n          \n          INT. RED'S APARTMENT - CONTINUOUS\n          \n          Budlofsky dashes back into the apartment.                    \n          \n                                                                   55\n          \n          \n          \n                                 BUDLOFSKY                               \n                    They're long gone.                                   \n          \n          Matheson stands over top of Red, talking to Ted on the         \n          phone.\n          \n                                 TED (O.S.)\n                    Find out what he knows.                              \n          \n                                 MATHESON                                \n                    Red, you gonna tell us anything helpful?             \n          \n                                 RED\n                    I just did, Matheson. Fuckin' Dale                   \n                    Denton's the other guys name. He was with            \n                    Saul, they kicked my ass. What more do               \n                    you want?                                            \n          \n                                 MATHESON                                \n                    You hear that?\n          \n                                 TED\n                    Ask if either of them were Asian.\n          \n                                 MATHESON                                \n                    Hey. What skin color were these guys?\n          \n                                 RED\n                    What? Um...white, they're both white. I\n                    think Denton might be a Jew, but I\n                    couldn't really tell.\n          \n                                 MATHESON                                \n                    You hear that, Ted?\n          \n                                 TED (O.S.)\n                    Dale Denton. Not Asian. Alright. Kill\n                    Red.\n          \n          Matheson pulls out a gun and shoots Red in the gut.            \n          \n                                 RED                                     \n                           (clutching his bleeding gut)                  \n                    Oh fuck...you shot me, you motherfucker!             \n                    Fuckin' Matheson...fuck you! You've eaten            \n                    dinner here, man! Tacos! And now I'm                 \n                    gonna fuckin' die from this, probably.               \n                    Get the fuck out of my house!                        \n          \n                                                                   56\n          \n          \n          \n          \n          INT. TED'S LIVING ROOM - CONTINUOUS\n          \n          TED (the big grey-haired guy) puts his portable phone\n          back in its charger.\n          \n                                    TED                                   \n                    Fuck.                                                 \n          \n          The living room windows are covered by black sheets.\n          Workers are busy scrubbing blood stains off the floor and       \n          walls. The dead Asian man lies on top of bubble-wrap in\n          the corner.\n          \n          Ted walks into the kitchen where CAROL BRAZIER (female\n          cop from the murder, in full uniform, mid-30s) is playing\n          with her gun.\n          \n                                 TED (CONT'D)                             \n                    Carol, there's another name to run. Dale\n                    Denton.\n          \n                                 CAROL\n                    Does he have something to do with our\n                    friend in there?\n          \n                                 TED\n                    If the Asians have the balls to send an\n                    assassin right into my home, we can't be\n                    too cautious. The boys say Denton and\n                    Saul are Caucasian. Maybe after their\n                    assassin failed, they hired this outside              \n                    guy Denton to finish the job.                         \n                           (pondering)\n                    Also, the boys said that Saul mentioned\n                    \"going to the casino.\"\n          \n                                 CAROL                                    \n                    \"Going to the casino\"? I don't like that.\n          \n          Carol holsters her gun.\n          \n                                                               CUT TO:\n          \n          \n          EXT. TED'S HOUSE - STREET - CONTINUOUS\n          \n          Inside an Escalade with tinted   windows sit two\n          frightening looking Asian men.   They have earphones on and\n          an eavesdropping tool aimed at   Ted's house. They hear\n          every word. One of them writes   down info in Korean.\n          \n                                                                   57\n          \n          \n          \n                                 CAROL (O.S.)\n                           (through one of the Asian\n                            mens ear piece)\n                    I'll be back in an hour with everything\n                    there is on Dale Denton. He'll be dead by\n                    the time we make our pick-up tomorrow.\n          \n          \n          EXT. STREET - DAY\n          \n          Dale and Saul are still running and are unbelievably           \n          exhausted.                                                     \n          \n                                 SAUL\n                           (gasping and   wheezing)                      \n                    But my parents live   in Canada. You don't\n                    think they're going   to go to Canada, do\n                    you? How would they   get a Canadian phone\n                    book even?                                           \n          \n                                 DALE\n                           (gasping and wheezing)                        \n                    All I know is Angie's new number is on my\n                    fridge and they could see that, so I have            \n                    to get to her.\n          \n                                 SAUL                                    \n                    My Grandma lives here. They wouldn't go\n                    after her, would they? She's got a\n                    different last name. Belogus.\n          \n          Dale hails a cab.\n          \n          \n          INT. DALE'S APARTMENT - CONTINUOUS                             \n          \n          Dale's apartment door BURSTS open. Budlofsky and Matheson      \n          enter, guns drawn. They start searching the apartment.         \n          Budlofsky presses a button on the ANSWERING MACHINE.           \n          \n                                 ANSWERING MACHINE                       \n                           (Dale's voice)                                \n                    \" cough  It's Dale. I'm probably at work,            \n                    maybe we'll talk later.  BEEP \"                      \n          \n          Matheson walks to the fridge and yanks off a NOTE.             \n          \n                                 MATHESON                                \n                    Budlofsky!                                           \n          \n          Budlofsky looks at the note:                                   \n          \n          \" - Memorize Angie's New Cell: 366-3666 - Go get weed - \"      \n          \n                                                                    58\n          \n          \n          \n          \n          EXT. OUTSIDE ANGIE'S HOUSE - SOON AFTER                         \n          \n          Dale and Saul get out of the cab in a pleasant                  \n          neighborhood. Saul begrudgingly pays the driver. They           \n          walk towards Angie's house.                                     \n          \n                                 DALE\n                    Dude, stay here. I'll be back in a\n                    minute.\n          \n                                 SAUL\n                    Hells no! I don't want to be alone! I\n                    want to go with you!\n          \n                                 DALE\n                    Saul, just watch my back. I'll literally              \n                    be five minutes. Please.                              \n          \n                                 SAUL\n                    Fine. But hurry.                                      \n          \n          Dale runs up to the front door and frantically knocks.          \n          Angie answers the door.                                         \n          \n          \n          INT. ANGIE'S HOUSE - CONTINUOUS                                 \n          \n          Dale dashes in.                                                 \n          \n                                 DALE\n                    Angie!                                                \n          \n          Angie opens the door with a smile, the phone in hand. Her\n          attention is towards the phone conversation she is\n          having. Dale enters her apartment.\n          \n          \n          INT. ANGIE'S APARTMENT - CONTINUOUS                             \n          \n                                 ANGIE                                    \n                    It's Dale! You came.                                  \n          \n          Dale freezes in horror: ANGIE'S PARENTS (SHANNON and            \n          ROBERT) are pleasantly eating at the dining room table.         \n          \n                                 SHANNON                                  \n                    Hi, Dale. Nice to meet you, sit down and              \n                    have some couscous. Can I get you a                   \n                    drink?                                                \n          \n          Robert sees that Dale is DIRTY, DISHEVELLED, BRUISED and        \n          BATTERED.                                                       \n          \n                                                                  59\n          \n          \n          \n                                 ROBERT                                 \n                    What the hell happened to you?                      \n          \n                                  ANGIE                                 \n                    Dale?   What happened to you?                       \n          \n          Robert and Shannon exchange worried looks.                    \n          \n                                 DALE                                   \n                    Nothing, I was in the woods and...                  \n                           (turns to Angie's parents)                   \n                    ...Hi, I'm Dale. Uh...it's nice to                  \n                    finally meet you both...I apologize for             \n                    my appearance. Robert, Charlotte-                   \n          \n                                 SHANNON                                \n                           (not amused)                                 \n                    Shannon.                                            \n          \n                                 DALE                                   \n                    Yes! Shannon. I've heard a lot about both           \n                    of you.                                             \n          \n          Dale walks to Robert and extends his DIRTY, BLOODY HAND.      \n          \n                                 DALE (CONT'D)                          \n                    Very nice things.                                   \n          \n          Robert smugly declines Dale's hand shake.                     \n          \n                                 ANGIE                                  \n                    You were in the woods?                              \n          \n                                 DALE                                   \n                           (at a loss for words)                        \n                    Alright, now, here's what's happened -              \n                    I've been thrust into a kind of,                    \n                    ah...situation. So, uh, if we could all             \n                    just start to evacuate...                           \n          \n          Dale starts gathering all their jackets and shoes.            \n          \n                                 DALE (CONT'D)                          \n                    ...that'd be really, really good right              \n                    now. I'll answer all your-                          \n          \n                                 ANGIE                                  \n                    Is this a joke?                                     \n          \n                                 ROBERT                                 \n                    What is this Angie?                                 \n          \n                                                                    60\n          \n          \n          \n                                 SHANNON                                  \n                    I think it is a joke.                                 \n          \n                                 DALE                                     \n                           (deep breath)                                  \n                    Listen. There are people after us and                 \n                    they could come here. I'll tell you                   \n                    anything you want, just please, let's go!             \n          \n                                 ROBERT                                   \n                    He's serious?                                         \n          \n                                 DALE                                     \n                    Yes, I'm serious. Super serious! We have              \n                    to get the \"F\" out of here!                           \n          \n          The Anderson's stare at him dumbfounded. Robert gets up         \n          and stands tall.                                                \n          \n                                 ROBERT                                   \n                    Get the hell out of my house.                         \n          \n                                 DALE                                     \n                    Okay, Mr. Anderson, look, here's the deal             \n                    - I saw a crooked cop kill a guy while I              \n                    was working...this morning. The cop shot              \n                    the guy then saw my car drive off, and I              \n                    think they might have seen my license                 \n                    plate and, so, I ditched my car...in the              \n                    woods, so...                                          \n          \n          They stare at Dale as though he were crazy.                     \n          \n          \n          EXT. ANGIE'S HOUSE - CONTINUOUS                                 \n          \n          Saul sees a car nearing. He sees Budlofsky and Matheson         \n          are in it.                                                      \n          \n                                 SAUL                                     \n                    No fucking way.                                       \n          \n          He runs like hell towards Angie's.                              \n          \n          \n          INT. ANGIE'S HOUSE - CONTINUOUS                                 \n          \n          Angie and her parents try to make sense of what Dale is         \n          saying.                                                         \n          \n                                 ANGIE\n                    Who are these people? Why are they-\n          \n                                                                   61\n          \n          \n          \n                                 DALE\n                    I think their drug dealers.\n          \n                                 ANGIE\n                           (on the verge of tears)\n                    Why?\n          \n                                 DALE\n                    Well, it's complicated. See,\n                    the...uh...it doesn't matter right now,\n                    we just have to get out of here.\n          \n                                 ANGIE\n                    Let's go to the police!\n          \n                                 DALE\n                    No, they are the police!                             \n          \n                                 ROBERT                                  \n                    I'm getting my gun.                                  \n          \n                                  SHANNON                                \n                    Robert! No!                                          \n          \n                                 ROBERT                                  \n                    We bought it for a reason!                           \n          \n          Robert runs up the stairs to his bedroom.                      \n          \n          Suddenly, Saul bursts through the front door in a              \n          panicked frenzy.                                               \n          \n                                 SAUL\n                           (completely out of breath)\n                    You... huff ...Angie? Dale! It's                     \n                    happening!                                           \n          \n                                  ANGIE\n                    EEEHHHH!!!\n          \n          Angie grabs a fork off the table and stabs it into Saul's      \n          shoulder.                                                      \n          \n                                  SAUL\n                    ARGGG!!!\n          \n                                 ANGIE\n                           (freaking out)\n                    Dale, it's one of the drug dealers!!!\n          \n                                 SAUL\n                    No! I'm Dale's dealer, I'm S-\n          \n                                                                 62\n          \n          \n          \n                                 DALE\n                    Angie! Stop! It's Saul!                            \n          \n                                 SHANNON                               \n                    What did you do, Angie?!                           \n          \n          Saul yanks the fork out and tosses it on the ground.         \n          \n                                 SAUL                                  \n                    Ow!! Fuck. Now I'm gonna need a tetanus            \n                    shot! They fuckin' kill. Fuck!                     \n          \n                                 ANGIE\n                    Saul? Dale, who is-\n          \n                                 SAUL\n                    Dale, they're coming!                              \n          \n          Then - Robert appears at the top of the stairs with his      \n          gun. He sees Saul bleeding and SCREAMS. BLAM! He fires at    \n          Saul!                                                        \n          \n          \n          EXT. ANGIE'S HOUSE - CONTINUOUS                              \n          \n          Budlofsky and Matheson are walking towards the front door    \n          when they hear the gunshot and dive behind some bushes.      \n          \n                                 BUDLOFSKY                             \n                    Fuck! What the hell?                               \n          \n                                 MATHESON                              \n                    Get out your fucking gun!                          \n          \n                                 BUDLOFSKY                             \n                    What the fuck is going on?                         \n          \n          BANG! Blasts through the front door and almost hits them!    \n          \n          \n          INT. ANGIE'S HOUSE - CONTINUOUS                              \n          \n          Everyone is in shock. Saul frantically pats himself down     \n          to see if he got hit.                                        \n          \n                                 DALE                                  \n                    Stop! Stop! He's with me!                          \n          \n                                 SAUL                                  \n                    Holy fuck! Holy fuck! Holy fuck! Holy              \n                    fuck!                                              \n          \n                                                                  63\n          \n          \n          \n                                 ANGIE                                  \n                    Dad, put the gun down!                              \n          \n                                 SHANNON                                \n                    Robert, what's going on?                            \n          \n                                 ROBERT                                 \n                    Just nobody move, okay? Except Shannon              \n                    and Angie. So, you two don't move!                  \n          \n                                 SHANNON                                \n                    Oh my god.                                          \n          \n                                 DALE                                   \n                    Sir, please, he's my friend, he's helping           \n                    me, he's-                                           \n          \n                                 SAUL                                   \n                    Stop shooting, man! I'm Dale's dealer               \n          \n          Dale looks at the pandemonium as everyone tries to be         \n          heard.                                                        \n          \n                                 DALE                                   \n                    Guys! Please! We have to get out of here.           \n                    Robert, Angie...Mrs. Anderson-                      \n          \n                                 SAUL                                   \n                           (whispers to Dale)                           \n                    It's Shannon.                                       \n          \n                                 DALE                                   \n                    I know! Look, we have to get out of here.           \n                    I'm sure everything is going to be fine             \n                    but better safe than...not.                         \n          \n                                 SHANNON                                \n                    Is this...for real-                                 \n          \n                                 DALE                                   \n                    Yes. Terribly real.                                 \n          \n          Dale and Saul lead Angie and her parents towards the back     \n          door.                                                         \n          \n          \n          EXT. ANGIE'S HOUSE - CONTINUOUS                               \n          \n          Budlofsky and Matheson are now at the front door. They've     \n          each got a gun drawn and are preparing to burst in.           \n          Budlofsky is loading his bullet cartridge.                    \n          \n                                                                    64\n          \n          \n          \n                                   MATHESON                               \n                    Ready?                                                \n          \n                                   BUDLOFSKY                              \n                    No. One sec.                                          \n          \n          Budlofsky puts in the last few bullets.                         \n          \n                                 MATHESON                                 \n                    Hurry the fuck up.                                    \n          \n                                 BUDLOFSKY                                \n                    Chill out, man. You're nagging isn't                  \n                    helping.                                              \n          \n          Budlofsky cocks his gun and nods at Matheson.                   \n          \n          \n          INT. ANGIE'S APARTMENT - CONTINUOUS\n          \n          BAM! They kick open the doors and run into her house. No        \n          one is there. Budlofsky cautiously walks over to the            \n          table and touches the food. It's still warm. Matheson           \n          bends down and picks up a bloody fork.                          \n          \n                                 MATHESON                                 \n                    Ew! It's a bloody fork! What are these                \n                    people doing?                                         \n          \n          \n          INT. GARAGE - CONTINUOUS                                        \n          \n          Dale, Angie, her parents, and Saul burst into the garage.       \n          Robert is fumbling with the keys. He manages to open the        \n          car. Saul pulls up his shirt to look at the stab wound.         \n          \n                                 SAUL                                     \n                    Fuck. Look at that. Fuckin' mashed                    \n                    potatoes in my wound.                                 \n          \n                                 ROBERT                                   \n                    Baby! Get in the car quick. Angie, in the             \n                    car!                                                  \n          \n          The Andersons get in the car.                                   \n          \n                                 ANGIE                                    \n                    Dale - get in the car!                                \n          \n                                 ROBERT                                   \n                           (to Dale)                                      \n                    You stay the fuck away from my family!                \n          \n                                                                   65\n          \n          \n          \n                                   ANGIE                                 \n                    Shut up dad!                                         \n          \n                                 DALE                                    \n                           (glances at Robert)                           \n                    I...I think it would be best if I didn't             \n                    go with you. I don't want to put you in              \n                    any more danger.                                     \n          \n                                 ANGIE                                   \n                    What are you going to do? What should we             \n                    do?                                                  \n          \n                                 ROBERT                                  \n                    Angie, get in the car!                               \n          \n                                 DALE                                    \n                    Alright, baby. Here's the plan - go to               \n                    the Holiday Inn downtown and use a fake              \n                    name. Something like...                              \n                           (looks around, focuses on                     \n                            Robert's car)                                \n                    Car...lyle.                                          \n          \n                                  ANGIE                                  \n                    Carlyle?                                             \n                           (beat)                                        \n                    I...I have so many questions. I                      \n                    just...how can this be happening?                    \n                    Where...where are you going?                         \n          \n                                  DALE                                   \n                    I have to stop this. I don't know how,               \n                    but don't worry. I'll keep you safe.                 \n                           (beat)                                        \n                    But still, watch your back. You never                \n                    know where they might be, whoever they               \n                    are.                                                 \n          \n          Angie gets in the car. Dale pecks her on the lips.             \n          \n                                   DALE (CONT'D)                         \n                    I love you.                                          \n          \n          Beat.                                                          \n          \n                                   ANGIE                                 \n                    Uh...thanks.                                         \n          \n          Angie gets in the car. Dale pecks her on the lips.             \n          \n                                                                  66\n          \n          \n          \n                                 DALE                                   \n                    Um...you're welcome. And nice to meet you           \n                    guys.                                               \n          \n          She shuts her door and the Anderson's pull out. Dale          \n          watches them depart with great concern.                       \n          \n                                 SAUL\n                    Why aren't we in that car?                          \n          \n                                 DALE\n                    Let's run, man! Run!                                \n          \n          They start to sprint.\n          \n                                 SAUL\n                     Huff   Huff  Where are we running?                 \n          \n                                 DALE\n                    Somewhere we can think.\n          \n          \n          INT. TED'S HOUSE - CONTINUOUS\n          \n          Ted and Carol are in mid-discussion, and rather\n          distraught at that. Behind them two henchmen take the\n          dead Asian man's body out the back door.\n          \n                                  CAROL\n                    A fork?                                             \n          \n                                 TED\n                    A bloody fork. In his girlfriends house.            \n                    And the blood was fresh.\n          \n                                 CAROL\n                    Maybe he killed her, to protect himself.\n          \n                                 TED\n                    Or maybe it's the Asians fucking with us.\n                    What the fuck is going on!\n                           (a frustrated beat)\n                    Any luck with the cell phones?\n          \n                                 CAROL\n                    They smashed one and left the other one             \n                    in the woods to distract us. Took us an             \n                    hour to find it. And we found Denton's              \n                    car, which was filled with all these                \n                    strange disguises. These guys are for               \n                    real.                                               \n          \n          Ted slams his fist on a table. He ponders.\n          \n                                                                   67\n          \n          \n          \n                                 TED\n                    I want to talk to the Asians. Get me\n                    Cheung's number. Now.\n          \n                                                       INTERCUT WITH:\n          \n          \n          INT. CHEUNG'S MANSION - MOMENTS LATER\n          \n          Cheung, the leader of the Asians, has a lavish mansion\n          which is covered in ornate decorations and expensive\n          merchandise. It is immaculately clean and organized.\n          Several armed men with earpieces stand in strategic\n          locations throughout the house. Cheung is reading a\n          Korean book alone in his study. The phone rings and he\n          picks it up.\n          \n                                   CHEUNG\n                             (in Korean)\n                    Hello?\n          \n                                 TED\n                    Cheung. It's Ted.\n          \n          Cheung sits up, shocked to have his opponent calling him.\n          He snaps his fingers and two guards run in. He covers the\n          phone.\n          \n                                 CHEUNG\n                           (in Korean)\n                    Record this conversation.\n          \n          He uncovers the receiver.\n          \n                                 CHEUNG (CONT'D)\n                           (perfect English)\n                    Ted. This is surprising. What would you\n                    like?\n          \n                                 TED\n                    Cheung, I want you to call off your man\n                    Denton. I don't know what he is, a scout,\n                    assassin, and frankly I don't care. I\n                    just want him gone. I want him dead. If\n                    you do this, I'll consider it a peace\n                    offering, otherwise, you're asking for\n                    war. And just in case you forgot, I'm\n                    number one, and there's a reason for\n                    that. You've got 24 hours to reply.\n          \n          We stay on Cheung. He hails another guard.\n          \n                                                                   68\n          \n          \n          \n                                 CHEUNG\n                    Ted Jones is slipping. Our assassin                  \n                    failed to kill him, but it did rattle his            \n                    confidence. It's earlier than planned,               \n                    but we should strike now, while he is                \n                    confused. Let it be known-                           \n          \n          He turns to a picture of the Asian Ted killed earlier.         \n          \n                                 CHEUNG (CONT'D)                         \n                    -Li-Youngs death will not be in vain.                \n          \n          \n          EXT. PARK - NIGHT\n          \n          Dale and Saul are sitting in the branches of a tree. Fast      \n          food wrappers lie scattered. Saul is rolling a joint.\n          \n                                 SAUL\n                    Victory joint complete. Here ya go.\n          \n          Saul passes it to Dale, who lights it. Dale takes another\n          puff and starts to seriously relax. A smile creeps across\n          his face as he passes the joint to Saul.\n          \n                                 DALE\n                    \"Tell us what you know!\" How fuckin'\n                    balls was that?\n          \n          Saul takes a puff.\n          \n                                 SAUL\n                    Like, really balls.\n          \n                                 DALE\n                    And I think I fought pretty well, don't\n                    you? You know, for my first time. We were\n                    like Tango and Cash, man.\n          \n                                   SAUL\n                    Or Scarface!\n          \n                                 DALE\n                    BOOM! Knocked the door right off it's\n                    hinges!\n          \n          Saul passes the joint to Dale.\n          \n                                 SAUL\n                    And you probably saved Angie, which is\n                    fucking pimp.\n          \n                                                                 69\n          \n          \n          \n                                 DALE\n                    I probably couldn't have done it without\n                    you. Thanks, man. It is fucking pimp.\n          \n                                 SAUL\n                    We're in this together, right? So, ya\n                    know.\n          \n          Saul passes the joint to Dale.\n          \n                                  DALE\n                    Thanks, man.\n                           (beat)\n                    You know, my last dealer was a total\n                    dick. You're by far the coolest dealer\n                    I've ever had.\n          \n                                 SAUL\n                           (sincerely)\n                    Wow. Thanks, man. I seriously appreciate\n                    that.\n          \n                                 DALE\n                    Yeah...like, the time before last time, I          \n                    totally had weed. I just kind of wanted            \n                    to chill with you.                                 \n          \n                                 SAUL\n                           (over-joyed)\n                    Really? That's awesome, man. That means a          \n                    lot to me, `cause, like, plenty of dudes           \n                    come in to buy and pretend to be all\n                    buddy-buddy with me, but in my head I'm\n                    always, like, \"you don't like me, you\n                    like my drugs, so fuck you, buddy!\" You\n                    know? And just so you know, I totally              \n                    could have lit that cross-joint on my\n                    own. I'd just have to use candles, but,\n                    like, I've never smoked one of those with\n                    anyone before.                                     \n          \n          Dale passes Saul the joint.                                  \n          \n                                 DALE\n                    So, do you think we should leave town? We          \n                    could just get on a bus and go, right?\n          \n                                 SAUL\n                    We only have, like, fifty bucks. I don't\n                    think that could even pay for one ticket.\n          \n          Saul rubs the roach out in the dirt.\n          \n                                                                 70\n          \n          \n          \n                                 DALE\n                    What about your sack?\n          \n          Saul rubs his balls again.\n          \n                                 SAUL\n                    Oh man. It's still fucking killing me.\n          \n                                 DALE\n                           (laughing)\n                    No dude, your sack of weed. Can't we sell\n                    some?\n          \n                                 SAUL\n                    Of course. That's my bread and butter. We\n                    just have to go to a highschool. It's the\n                    easiest market. Chester A. Arthur is               \n                    like, a block a way.                               \n          \n                                 DALE\n                    No way, man. I'm not going to sell to              \n                    kids.                                              \n          \n                                 SAUL                                  \n                    Why? They're gonna get it from somewhere.          \n                    I mean, we got it from guys like us.               \n          \n                                 DALE                                  \n                    Well, then not kids at that school.                \n                                                                       \n          \n                                 SAUL                                  \n                    Well, there's a bunch of private ones              \n                    nearby, but they're into way crazier shit          \n                    than weed-                                         \n          \n                                 DALE                                  \n                    I can't do it, man. I'm not going to a             \n                    high school is there anywhere else we              \n                    could go?                                          \n          \n                                 SAUL\n                           (thinks, then-)\n                    We could go to Crackhead Park.\n          \n                                   DALE\n                    What's that?\n          \n                                 SAUL\n                    It's a park. Really close, actually. Full          \n                    of crackheads. They smoke weed too,\n                    though.                                            \n          \n                                                                    71\n          \n          \n          \n          \n          EXT. CRACKHEAD PARK - NIGHT                                     \n          \n          There are several tarp-houses set up, garbage all over,         \n          and crazy/dangerous homeless people milling about the           \n          park. A deranged looking homeless man walks over to             \n          another one and starts pissing on his leg. They begin           \n          fist fighting. Suddenly, a half eaten hamburger hits Dale       \n          in the face and a bag lady comes up to Saul and starts          \n          poking him.                                                     \n          \n                                 SAUL                                     \n                    Hey, stop it. Stop it. You wanna buy some             \n                    weed, or, like, what?                                 \n          \n          The bag lady runs off.                                          \n          \n                                  SAUL (CONT'D)                           \n                    See, that's the problem around here.                  \n                    Target demographic has a real, uh, fickle             \n                    attention span. You gotta wow `em.                    \n                           (beat)                                         \n                    Hey! Who wants some weed!?!                           \n          \n                                 DALE                                     \n                    Fuck this place.                                      \n          \n                                                             CUT TO:      \n          \n          \n          EXT. HIGH SCHOOL - LUNCHTIME - THE NEXT DAY\n          \n          At the same high school Angie goes to, Dale and Saul walk       \n          up to four thirteen year old students. (DESMOND, WALT,\n          ACK and BLAKE)\n          \n                                 SAUL\n                    Yo. `sup. You guys want some chronic?                 \n          \n          \n          EXT. ALLEY BEHIND A CONVIENANCE STORE - MOMENTS LATER\n          \n          Dale and the four kids all laugh hysterically as Saul           \n          marches around pretending to be Godzilla, blasting weed\n          smoke out of his nose and mouth as though it was fire.\n          Saul passes Ack the joint. He takes a puff and starts\n          coughing.\n          \n                                 DALE\n                           (very stoned)\n                    Man, this is great.\n          \n                                                       72\n          \n          \n          \n                       ACK\n           Cough   Cough  What's it called again?\n          \n                       WALT\n          Pineapple express. They said it, like,\n          eight times, you fucking `tard.\n          \n                       ACK\n          Oh, so sorry if I-\n          \n                       BLAKE\n          Come on, man. Puff, puff, pass.\n          \n                       SAUL\n          You know, I went here for a year. Kicked           \n          me out for having a swiss army knife.\n          Everyone has a swiss army knife!\n          \n                       DALE\n          I got like, thirty for my Bar Mitzvah.\n          \n                       DESMOND\n          My Bar Mitzvah sucked.\n          \n                       ACK\n          I touched Jessica Lubell's tit at your\n          Bar Mitzvah.\n          \n                       DALE\n          You touched a tit when you were twelve?\n          \n                       WALT\n          Lubell? Are you joking? Those are the\n          finest tats in the grade!\n          \n                       ACK                                   \n          Fuck that, dude. Angie in 12th grade has,          \n          like, the sweetest tits ever.                      \n          \n                      DALE                                   \n          Hey!                                               \n          \n                       WALT                                  \n          What? You know her?                                \n          \n                       DALE                                  \n          Yeah. She's my girlfriend.                         \n          \n                       DESMOND                               \n          Whoa. You're that dude. You lucky fucker.          \n          \n                                                                   73\n          \n          \n          \n                                 DALE                                    \n                           (proud)                                       \n                    Yeah. She's pretty sweet.                            \n          \n                                 SAUL                                    \n                    And we're all high, that's hilarious.                \n          \n          Blake passes the joint to Dale.\n          \n                                 SAUL (CONT'D)                           \n                    Alright gentlemen, it's time for me to\n                    teach you some business. Brass tacs -\n                    this is the best weed you've ever smoked,\n                    agreed?\n          \n          The kids all nod in agreement.\n          \n                                 SAUL (CONT'D)\n                    So I'm gonna make this simple. How much\n                    did you get between you?\n          \n                                 BLAKE\n                    A hundred and seventy eight.\n          \n          Saul pulls out his impressive bag of weed. The kids GASP.\n          \n                                 SAUL\n                    Alright. You gimme all your money, you\n                    can each take two handfuls of weed. That\n                    treat ya right?\n          \n          The kids cheer as Desmond takes two BIG handfuls.\n          \n                                 DESMOND\n                    That's fucking awesome!\n          \n                                 SAUL\n                    I know. Keep it on the down low.\n          \n          They pay Dale and take their weed. Happy as hell, they\n          run off, stuffing HANDFULS OF WEED into their pockets.\n          \n                                 ACK\n                           (to Walt)\n                    Jason'll never believe this...until I\n                    show him all this weed!\n          \n          Dale holds the un-lit joint as Saul takes the pot and the\n          money.\n          \n                                 SAUL\n                    And we, my good man, are officially scott\n                    fuckin' free.\n          \n                                                                 74\n          \n          \n          \n                                 DALE\n                    There are still people trying to kill us.          \n          \n                                 SAUL\n                    But at least now we can afford to run.\n                    I'm gonna go buy some celebration snacks.\n                    Let's have us a little mardi-gras                  \n                    fiesta.\n          \n          Saul laughs as he puts on his backpack and walks around\n          the corner. Dale re-lights the remaining roach and           \n          casually smokes. He blows some smoke rings, coughs a bit,\n          stretches; for a few moments, looking completely relaxed,\n          but then-\n          \n          A COP CAR screeches to a halt right in front of Dale! A\n          female POLICE LIAISON OFFICER (who is not Carol) gets out\n          of the car. Dale freezes in horror.\n          \n                                  POLICE LIAISON\n                    Don't move!\n          \n          She walks towards Dale. He seems prepared to run, but she\n          places her hand on a can of pepper spray.\n          \n                                 POLICE LIAISON (CONT'D)\n                    Don't move! This stuff hurts. What's in\n                    your hand?\n          \n                                 DALE.\n                    I'm sorry, Ma'am. It's weed. I'll get rid\n                    of it right away, I was just smoking\n                    this. I...I thought it was\n                    decriminalized. Or something. For medical\n                    purposes. I have epilepsy.\n          \n                                 POLICE LIAISON\n                    Selling pot to my students isn't\n                    \"decriminalized.\" I'm the liaison officer\n                    for this school and I just caught four\n                    students showing off handfuls of\n                    marijuana to their friends. They told me\n                    they got it back here. Put your hands up.\n          \n          She cuffs Dale's hands behind him!\n          \n                                 DALE\n                    Wait! I wasn't selling anything! All I\n                    have is this little joint.\n          \n          \n          Police Liaison takes the large joint out of Dale's hand.\n          \n                                                                    75\n          \n          \n          \n                                 POLICE LIAISON\n                    You call this little?\n          \n          She throws it on the ground and smears it around with her\n          foot.\n          \n                                 DALE\n                    I don't even have any money! How did I\n                    sell weed if I don't have any money?!? I\n                    was just smoking it. I swear. Please.\n          \n          She pats him down, finding only his wallet. The Police\n          Liaison sees he only has nine dollars. She pulls out his\n          DRIVER'S LICENSE.\n          \n                                 POLICE LIAISON\n                    It's possible you're telling the truth.\n                    I'm going to run a check and if it turns\n                    out you don't have any priors and all\n                    you've got is this small amount of\n                    marijuana, I'll let you go with a fine.\n                    Take a seat.\n          \n          She walks towards her car as Dale sits on the ground.\n          \n          ANGLE ON: Saul\n          \n          Saul merrily turns into the alley holding TWO RED\n          SLURPEES, when he jumps back in terror! He sees the cop         \n          car up the alley. He ducks back behind the corner.\n          \n                                 SAUL\n                    They got Dale. Oh fuck, oh fuck, oh\n                    fuck...\n          \n          ANGLE ON: Dale and the Police Liaison\n          \n          She looks at her car computer. The screen reads:\n          \n          DALE DENTON: OUTSTANDING WARRANT - DOUBLE HIT AND RUN.\n          \n          She looks back at Dale and types into her computer.\n          \n          \n          INT. CAROL'S COP CAR - CONTINUOUS\n          \n          We see Carol (who is in fact Ted's evil accomplice)\n          speeding down the road. Her police computer beeps. She\n          looks at the screen.\n          \n                                 CAROL\n                           (smiling)\n                    Denton.\n          \n                                                                    76\n          \n          \n          \n          \n          EXT. ALLEY - CONTINUOUS\n          \n          The Police Liaison stuffs Dale in the back of her squad\n          car.\n          \n                                 DALE\n                    What is this for? What did that thing\n                    tell you? What did I do?\n          \n                                 POLICE LIAISON\n                    Hit and run, Mr. Denton. A double,\n                    actually. You hit two parked cars two\n                    nights ago.\n          \n          A look of crippling horror comes across Dale's face as\n          she throws him in the back seat and slams his door shut.\n          \n          ANGLE ON: Saul\n          \n          He peaks down the alley and sees Dale in the back of the\n          car and the FEMALE Police Liaison getting in the front.\n          \n                                 SAUL\n                    The lady cop. She's gonna kill him.\n          \n          The car slowly makes a three point turn.\n          \n          \n          INT. COP CAR - CONTINUOUS\n          \n                                 DALE\n                    You don't understand! You have to let me\n                    go! Dirty cops are gonna kill me! Please!\n          \n          The Police Liaison ignores Dale.\n          \n                                 DALE (CONT'D)\n                    This...this lady cop, and these guys                  \n                    Budlofsky and Matheson, they all work for             \n                    Ted Jones, and-\n          \n                                 POLICE LIAISON\n                           (suddenly interested)\n                    Ted Jones?\n          \n                                 DALE\n                    Yeah. With grey-hair. Tell me you know\n                    what I'm talking about. He lives near\n                    Evergreen Heights. He-\n          \n                                                                    77\n          \n          \n          \n                                 POLICE LIAISON\n                    Are you telling me you saw Ted Jones and\n                    a police office shoot someone?\n          \n                                 DALE\n                    Yeah. An Asian someone.\n          \n          The Police Liaison ponders as she finishes her three\n          point turn and drives toward the exit of the alley.\n          \n                                 POLICE LIAISON\n                    Stay calm, do as your told, I'll get you\n                    down to the station.\n          \n                                 DALE\n                           (ecstatic)\n                    Yes ma'am.\n          \n          \n          EXT. ALLEY - CONTINUOUS\n          \n          Saul peeks out and sees the approaching cop car. He looks\n          at the two red slurpees and thinks, then suddenly jumps\n          out and THROWS himself onto the hood of the cop car!\n          \n          The Police Liaison and Dale see a body SLAM against the\n          car and RED LIQUID SPLATTER everywhere, covering the\n          windshield. They SCREAM.\n          \n          WHAM! In the impact, we clearly see Saul's BALLS getting\n          ROCKED on the car! The Police Liaison slams on the\n          brakes, causing Dale to SMASH into the metal cage.\n          \n                                 POLICE LIAISON\n                    Oh my god! Is that blood? Oh my god!\n          \n          She puts the car in park. As the Police Liaison gets out\n          of her car, Saul can be seen crawling around the back of\n          the vehicle, clutching his testicles. The frightened\n          Police Liaison looks at the windshield.\n          \n          She notices the two slurpee cups on the ground and\n          quickly turns around. She sees Saul jumping into the\n          drivers seat.\n          \n          Saul sees a SHOTGUN beside the passenger seat. The Police\n          Liaison reaches for her GUN!\n          \n                                 DALE\n                    NO! What are you doing!?!\n          \n                                                                    78\n          \n          \n          \n                                 SAUL\n                    Saving you. Hold on, amigo. Tango and\n                    Cash!\n          \n                                 POLICE LIAISON\n                    Freeze mister! Don't even...\n          \n          Saul slams the car into reverse! He speeds backwards up\n          the alley as the Police Liaison runs after them - GUN\n          DRAWN!\n          \n                                 DALE\n                    No! She was going to help us!\n          \n                                 SAUL\n                           (in pain)\n                    Oh...my balls...I seriously think I\n                    popped one...\n          \n          Suddenly, Carol (the cop from Ted's house) whips her COP\n          CAR into the alley! WHAM!!! It smashes into the rear of\n          their car! Dale turns around and establishes eye contact\n          with the stunned Carol.\n          \n                                 DALE\n                           (horrified)\n                    IT'S HER! The lady cop!\n          \n          Saul slams down the gas! Through the slurpee covered\n          window Saul sees the Police Liaison rushing towards them.\n          \n                                 SAUL\n                           (motion at the Police\n                            Liaison)\n                    Then who's that?\n          \n          The Police Liaison raises her gun.\n          \n                 SAUL (CONT'D)                      DALE\n          NOOOO!!!                      AAAAH!!!\n          \n          BLAM! She fires and the bullet punches through the              \n          windshield! The Police Liaison dives to the side as they        \n          zoom past her! They burst out of the alley. A moment\n          later, Carol follows, in hot pursuit.\n          \n          \n          I/E. DALE AN SAUL'S STOLEN COP CAR - CONTINUOUS\n          \n          The car weaves through traffic.\n          \n                                 SAUL\n                    The slurpee! I can't see!\n          \n                                                                    79\n          \n          \n          \n                                 DALE\n                    Turn on the wipers!\n          \n          Saul mindlessly starts grasping at switches in the car.\n          He finally turns on the wipers, which wipe away the\n          slurpee and reveal that the window is so badly cracked he\n          still can't see through it. Carol's car emerges right           \n          behind them.\n          \n                                 SAUL\n                    Dude, I seriously can't see!\n          \n                                 DALE\n                    Kick out the window! Isn't that what they\n                    do?\n          \n                                 SAUL\n                    I don't know. Okay.\n          \n          Saul, with great effort, keeps one foot on the pedals\n          and, with all his might, kicks his other leg through the\n          front window. His leg PUNCHES straight through the glass,\n          but he can't pull it back in!\n          \n                                 SAUL (CONT'D)\n                    Oh fuck! Shit!\n          \n                                 DALE\n                    Get it out of there!\n          \n          Suddenly, their car gets jerked to the side.\n          \n                                 SAUL\n                    Ah! Ah! My leg!\n          \n          Carol is ramming them from behind.\n          \n                                 DALE\n                           (hysterical)\n                    She's following us! She's gaining on us!\n          \n                                 SAUL\n                    Her car's better!\n          \n          Saul yanks at his leg and manages to wriggle it out of\n          the hole. He begins to accelerate and realizes he can see\n          where he's going through the hole.\n          \n                                 SAUL (CONT'D)\n                    Ha! I can see! Through my leg hole!\n          \n          Saul bumps over the curb and cuts through a LARGE PARK.\n          Carol is right behind them.\n          \n                                                                    80\n          \n          \n          \n                                  DALE\n                     Do something!\n          \n          Saul thinks hard, then buckles his seat belt.\n          \n                                  SAUL\n                     Hold on. I've got an idea.\n          \n          Dale does what little he can to brace himself. Saul SLAMS\n          on the breaks. Carol sees Saul screeching to a halt and         \n          slams on her breaks. She grunts and whips out her GUN.          \n          Both cars come to a full stop beside one another.               \n          \n          She opens fire - BLAM! BLAM! BLAM! BLAM! BLAM! - Bullets\n          rip through the stolen cruiser. Shattered glass flies\n          everywhere. Dale and Saul desperately duck for cover.\n          \n          Saul hits the gas and the bullet riddled car takes off.\n          Carol follows.\n          \n                                  DALE\n                     WHAT THE FUCK WAS THAT?!?!?\n          \n          Saul pops back up and begins steering again.\n          \n                                  SAUL\n                     Oh shit, man! I'm sorry! I thought she'd\n                     keep going.\n          \n          The car bumps back on to a main road. Carol follows,\n          sirens blaring.\n          \n                                  DALE\n                     Turn on the sirens!\n          \n          Saul's hand flails around, grasping everything. He feels\n          the SHOTGUN and accidentally pulls the trigger-\n          \n          BOOM! The blast blows through the roof of the car and\n          hits an overhead TRAFFIC LIGHT - shredding it to pieces!\n          \n                      SAUL                          DALE\n          JESUS!!!                         SHIT!\n          \n          Carol flies into the intersection on a collision course\n          with Saul and Dale.\n          \n          CRUNCH! A car smashes into the side of the Carol's\n          cruiser.\n          \n          As Dale and Saul speed off, Carol emerges from the\n          smoking wreckage, a look of hate in her eyes.\n          \n                                                                    81\n          \n          \n          \n          \n          EXT. QUIET RESIDENTIAL STREET - MOMENTS LATER\n          \n          The stolen cruiser screeches to a halt and Saul hops out.\n          \n                                 SAUL\n                    Run!\n          \n          He starts running up the block at top speed.\n          \n          Dale, still handcuffed in the back of the cruiser, starts\n          thrashing and screaming.\n          \n                                 DALE\n                    Saul! Saul! I'm locked in!\n          \n          Dale continues to scream as Saul obliviously bolts to the\n          end of the block and just keeps going.\n          \n                                 DALE (CONT'D)\n                    You dumb fucking fuck!!! HELP ME!!!\n          \n          Dale sits in the car, helpless. He has a look of utter\n          disbelief on his face. After a moment of silence he\n          starts wildly kicking the door window. He soon gives up.\n          \n          Just then, Dale notices Saul, over a block away, running\n          back towards the stolen car. Saul soon arrives,\n          completely out of breath, and opens the door.\n          \n                                 SAUL\n                    So... huff ... huff ...fuckin'\n                    sorry... huff ...forgot...\n          \n          Dale flops out of the car and onto the grass. Saul tries\n          to help him to his feet, but Dale pulls away.\n          \n                                 DALE\n                    Don't touch me, you asshole!\n          \n          Dale wiggles to his feet runs for it. Saul follows.\n          \n          \n          INT. HARDWARE STORE - DAY                                       \n          \n          Dale and Saul enter the hardware store, walking very            \n          close together so that no one sees Dale is handcuffed.          \n          They receive a few odd looks as they search and locate          \n          what they are looking for: saws. Saul quickly finds a           \n          sturdy looking hack-saw.                                        \n          \n                                                                    82\n          \n          \n          \n                                 SAUL                                     \n                    Okay, only one way to do this, hard and               \n                    fast. Bend over.                                      \n          \n          Dale gets on his knees and bends over, pressing his face        \n          up against the wall. Saul begins to manically hack away         \n          at the cuffs.                                                   \n          \n                                 DALE                                     \n                    Ow! Ow! Hurry!                                        \n          \n                                  SAUL                                    \n                    I am!                                                 \n          \n          Suddenly, Saul sees a store clerk coming and shoves the         \n          saw underneath Dale's suit jacket.                              \n          \n                                 DALE                                     \n                    Which saw do you like most?                           \n          \n                                 SAUL                                     \n                    The brown ones nice, but the metallic                 \n                    ones seems more...                                    \n          \n          They watch the clerk walk off and immediately return to         \n          sawing the handcuffs.                                           \n          \n                                                              CUT TO:     \n          \n          \n          EXT. HARDWARE STORE - SOON AFTER                                \n          \n          Dale stretches his arms. The handcuffs are still on his         \n          hands, but no longer attached.                                  \n          \n                                 DALE                                     \n                           (relieved)\n                    Okay, I'm going to go call Angie. Be                  \n                    right back.\n          \n                                 SAUL\n                    A thank you would be nice!\n          \n          \n          EXT. PAY PHONE - MOMENTS LATER                                  \n          \n          Dale is on the phone.                                           \n          \n                                 DALE\n                    Could I have the, uh, Carlyle room,\n                    please?\n          \n          INTERCUT WITH:\n          \n                                                                  83\n          \n          \n          \n          \n          INT. HOTEL ROOM - CONTINUOUS\n          \n          Angie is watching TV alone in a hotel room. The phone\n          rings and she picks it up.\n          \n                                 ANGIE\n                    Dale?\n          \n                                 DALE\n                    Angie! Thank god you're okay!\n          \n                                 ANGIE\n                    I'm fine. How are you? Are you okay?\n          \n                                 DALE\n                    I'm great. I'm fine. I miss you. So,                \n                    here's the plan, babe. I'm going to leave           \n                    town and contact a government official or\n                    something. From somewhere safe. I know              \n                    this shit is all fucked up and I just               \n                    can't apologize enough.                             \n          \n                                 ANGIE\n                    Dale. I've realized some problems and-\n          \n                                 DALE\n                    I know there's a problem! That's the\n                    thing, that's why I-\n          \n                                 ANGIE\n                    Dale, shut up and listen. People are                \n                    trying to kill you, and me! Dale, drug              \n                    dealers are trying to kill me, because of           \n                    you! It's fucking over, man. Are you                \n                    kidding me? For gods sake...                        \n          \n                                 DALE                                   \n                    Angie, no! No! Don't you get it? I was              \n                    thrown into this situation, I had no                \n                    control, but I am dealing with it. This             \n                    kind of thing happens, you know-                    \n          \n                                  ANGIE                                 \n                    NO! IT DOESN\"T!                                     \n                           (beat)                                       \n                    You're immature, Dale! I'm six years                \n                    younger and I'm saying this! And the fact           \n                    that you think you're some kind of\n                    fucking genius just makes it a hundred\n                    times more infuriating!                             \n          \n                                                                 84\n          \n          \n          \n                                 DALE\n                    What? You're telling me you think I'm a\n                    dumb guy?\n          \n                                 ANGIE                                 \n                    You're not how you think you are Dale,\n                    and it's pathetic. Call me when I can go           \n                    home.                                              \n          \n          Angie hangs up.                                              \n          \n          \n          EXT. PAY PHONE - CONTINUOUS                                  \n          \n          As Dale walks out of his phone booth, we see that Saul is    \n          on the phone in the next booth and is also smoking from a    \n          pipe.                                                        \n          \n                                  SAUL                                 \n                    Alrghit, I'll see you soon. And I'm sorry          \n                    again about the clocks.                            \n                           (beat)                                      \n                    Ha! What a douche bag.                             \n                           (beat)                                      \n                    Yeah, love you too.                                \n          \n          Saul hangs up and exits the phone booth.                     \n          \n                                 SAUL (CONT'D)                         \n                    Yo, so before we go on the lamb I gotta            \n                    go see my grandma, okay? She was worried           \n                    `cause I didn't show up to help with the           \n                    locks. But before that I've got to smoke           \n                    another bowl.                                      \n          \n                                 DALE\n                    Are you joking? You're actually gonna\n                    smoke marijuana?\n          \n                                 SAUL\n                    Why not?                                           \n          \n                                 DALE\n                    How can you smoke marijuana after what we\n                    just went through? That clearly happened\n                    because we were smoking marijuana.\n          \n                                 SAUL\n                    No. It happened because those fucking\n                    kids didn't keep that shit on the down\n                    low. Which is weird, `cause they really            \n                    seemed like cool kids.                             \n          \n                                                                    85\n          \n          \n          \n                                 DALE\n                    If you haven't noticed, we're not very\n                    functional when we're stoned, Saul.\n          \n                                 SAUL\n                    When I saved you with those Slurpees I\n                    was stoned. What do you gotta say to\n                    that? Maybe the pot is what gave me the\n                    creative capacity to come up with such a\n                    great plan! The Beatles were high!                    \n          \n                                 DALE\n                    You didn't save me! She was going to\n                    protect us, and now we're wanted for all\n                    sorts of crazy shit!\n          \n          Saul lights his bowl.                                           \n          \n                                 DALE (CONT'D)\n                    Fine. Smoke marijuana. But you know how\n                    \"Scarface\" ends. Face down, dead, in your\n                    own fuckin' water fountain.\n          \n                                 SAUL\n                    For one thing, I'm done dealing pot.\n                    Mostly, because I don't know where I\n                    would get it now, but still. And \"b\",\n                    fuck you, man. You can't judge me. We're\n                    exactly the same, and this whole thing's\n                    your fucking fault. You're the one who\n                    dropped the roach!\n          \n                                 DALE\n                    It's not my fault!\n          \n          Dale points at Saul's bowl.                                     \n          \n                                 DALE (CONT'D)\n                    It's marijuana's fault!\n          \n                                 SAUL\n                    Stop calling it marijuana!\n          \n                                 DALE                                     \n                    Grow up, you fucking two year old.                    \n          \n                                 SAUL                                     \n                    See! This is why you're a douche bag,                 \n                    Denton. Because you think you're better               \n                    than others, but you're just a dumb                   \n                    pothead burnout, same as me.                          \n          \n                                                                    86\n          \n          \n          \n                                 DALE                                     \n                    Maybe I am a pothead burnout, but at                  \n                    least I'm not the dumbest most annoying               \n                    guy in the world. The only reason I ever              \n                    bought weed from you was because you're               \n                    shit is so good, not because you're cool.             \n          \n                                 SAUL                                     \n                    But you said you bought when you already              \n                    had a few times, just to hang out?                    \n          \n                                 DALE                                     \n                    Bullshit! I just like...liked having lots             \n                    of different kinds of weed at once.                   \n          \n          Saul takes out his wad of cash and throws half of it at\n          Dale.\n          \n                                 SAUL                                     \n                    Here. Buy yourself a good last meal.\n          \n          He throws fifty more cents at the shocked Dale.                 \n          \n                                 SAUL (CONT'D)\n                    Super size it, bitch.\n          \n          Saul walks off.                                                 \n          \n                                 DALE                                     \n                    Saul! I'm sorry, man! I didn't mean all               \n                    that! Saul!                                           \n          \n          A sad Dale starts picking up the money.                         \n          \n          \n          INT. TED'S HOUSE - CONTINUOUS\n          \n          Carol, who is a little bruised up from the car crash,\n          sits with Ted. They are both furious.\n          \n                                 CAROL\n                    Guy drove like a mother-fucker. It was                \n                    amazing.                                              \n          \n                                 TED\n                    This is not good. We should have this\n                    under control. We haven't heard shit from             \n                    the Asians. Got these lunatics after us.              \n                    Shit.                                                 \n          \n          Carol checks her watch.\n          \n                                                                  87\n          \n          \n          \n                                 CAROL\n                    We should probably get to the farm.                 \n          \n          MUSIC UP: THE END by THE DOORS\n          \n          - Saul gets on a bus and sits down, sad and deject.           \n          \n          - Dale sits against the phone booth, crying like a baby.      \n          He buries his hands in his pocket and pulls out his baggy     \n          of weed. He hurls it away. He gets up to retrieve it.         \n          \n          - Saul is in a really shitty fast food restaurant, nearly     \n          crying as he eats his burger and fries.                       \n          \n          - Dale stares at a joint in his hands, thinks for a           \n          moment, and then, crying profusely, lights it and starts\n          smoking.\n          \n          A solitary tear rolls down his cheek and drips directly\n          onto the tip of the joint, putting it out. Dale hears the\n          sizzle and looks at the joint. He continues crying. He        \n          puts the joint down, beside three large roaches.              \n          \n          - Walking down the street, Saul sees the Point Grey           \n          Retirement Home.                                              \n          \n          - Dale feverishly looks through the phone book. He finds      \n          what he's looking for: Belogus.                               \n          \n          - Saul, hiding behind a bush across the street, surveys       \n          the retirement home. Seeing the coast is clear, he walks\n          towards the entrance. As Saul enters the building,            \n          Budlofksy and Matheson pull up.                               \n          \n          \n          INT. RETIREMENT HOME - CONTINUOUS\n          \n          Saul casually walks into the lobby. The elderly residents\n          of the retirement home are milling around the massive\n          common room.\n          \n                                 ELDERLY WOMAN(O.S.)\n                    Solly?\n          \n          Saul turns and sees an ELDERLY WOMAN.\n          \n                                 SAUL\n                    Hey! Mrs. Mendelson!\n          \n          Saul peers over her shoulder and sees Budlofsky and           \n          Matheson walk in!                                             \n          \n                                                                    88\n          \n          \n          \n                                   SAUL (CONT'D)\n                    HOLY SHIT!!!\n          \n          Saul runs for it, and they chase after him. He maneuvers        \n          through the elderly like a pylon course, the thugs right        \n          on his ass. He bursts into another room.                        \n          \n          \n          INT. CAFFETERIA - CONTINUOUS                                    \n          \n          He tears through the room, filled with old people eating.       \n          Budlofsky and Matheson pursue him.                              \n          \n          \n          INT. HALLWAY - CONTINUOUS                                       \n          \n          As Saul runs through the hall, Budlofksy and Matheson           \n          appear.                                                         \n          \n                                   MATHESON                               \n                    Eat it!                                               \n          \n          Matheson whip out his gun and fires - BLAM! The bullet          \n          whizzes past Saul and two elderly men, who don't even           \n          flinch, and then shatters a distant window. Saul turns          \n          the corner and-                                                 \n          \n          BAM! He slams into someone, sending the person crashing         \n          to the ground.                                                  \n          \n                                 INJURED PERSON                           \n                    OW! Shit...ow, ow, ow!                                \n          \n          Saul looks, terrified he's hurt an old person, but sees         \n          it is a young male nurse. He runs for it and sees an open       \n          door with chatter coming from inside. He runs into-             \n          \n          \n          INT. TEA ROOM - CONTINUOUS\n          \n          A dead end! Several startled OLD WOMEN look up from their\n          Majong. One of them instantly recognizes Saul-\n          \n                                 MRS. CORBER\n                    Solly Silver?!?\n          \n                                 SAUL\n                    Mrs. Corber! You gotta hide me!\n          \n          The Budlofsky and Matheson bursts into the room. Saul           \n          looks around, sees a teapot and grabs it. He hurls it at        \n          Matheson and nails him in the face. The tea pot shatters        \n          and hot water pours all over his face and hand.                 \n          \n                                                                    89\n          \n          \n          \n                                 MATHESON                                 \n                    AHH!!! FUCK!!!                                        \n          \n          Budlofsky GRABS Saul and knees him in the balls.                \n          \n                                 SAUL                                     \n                           (wheezing)                                     \n                    NOOO!!!\n          \n                                   BUDLOFSKY                              \n                    Yeah!                                                 \n          \n\n          Budlofsky punches Saul in the face.                             \n          \n          CUT TO BLACK                                                    \n          \n          \n          EXT. POINT GREY RETIREMENT HOME - CONTINUOUS                    \n          \n          Dale hustles towards the entrance of the building when he       \n          sees several police cars parked outside, their lights           \n          flashing.                                                       \n          \n          He sees a bunch of old people gathered on the front lawn.       \n          Doing his best to avoid the cops, he joins the cluster of       \n          elderly.                                                        \n          \n                                 OLD WOMAN                                \n                    Oh, god this is terrible. Poor Faye.                  \n                    Poor, poor Faye.                                      \n          \n                                 DALE                                     \n                    Hey, uh, what's going on here?                        \n          \n                                 OLD MAN                                  \n                    It just happened.                                     \n          \n                                   DALE                                   \n                    What did?                                             \n          \n                                 OLD WOMAN                                \n                    Faye Belogus' grandson was kidnapped from             \n                    right inside the building. We all saw it.             \n                    They fought in the majong room and hurt               \n                    the new nurse, Stefan.                                \n          \n          Dale is terrified.                                              \n          \n                                   DALE                                   \n                    Uh...thanks.                                          \n          \n                                 OLD MAN                                  \n                    If I was there, I would've kicked an ass.             \n          \n                                                                 90\n          \n          \n          \n          Dale looks, circle of people comforting a crying old         \n          woman, clearly Faye Belogus. He walks over.                  \n          \n                                 DALE                                  \n                    Mrs. Belogus. I wouldn't worry, Saul's             \n                    going to be fine.                                  \n          \n          Dale walks off, determined.                                  \n          \n          \n          INT. THE BARN - SOON AFTER                                   \n          \n          Saul wakes up but can't see anything. From his POV we see    \n          tape get ripped off his eyes and mouth.                      \n          \n                                   SAUL                                \n                    ARRGGGHHH!!!                                       \n          \n          Saul sees a BUDLOFSKY wielding a knife. He struggles and     \n          realizes that his arms and legs are bound. Saul closes       \n          his eyes, assuming he's about to die.\n          \n                                 SAUL (CONT'D)                         \n                           (whispers to himself)\n                    Fuck. I regret everything.                         \n          \n          BUDLOFSKY cuts the tape away from Saul's legs.               \n          \n                                   BUDLOFSKY                           \n                    Get up.\n          \n          Saul gets up and hops out of the car. He looks around and    \n          see that he is in a LARGE BARN. Saul notices SIX THUGS       \n          talking as they move bricks of weed and cocaine into a       \n          van.                                                         \n          \n          Matheson appears and looks at Saul with smoldering           \n          hatred. Saul sees that his face and neck were burnt from     \n          the tea and the broken shards of pot cut his cheek.          \n          \n                                 SAUL                                  \n                    Oh fuck. That looks painful.                       \n          \n          Matheson walks over, lowers to one knee, and punches him     \n          straight in the balls.                                       \n          \n                                   SAUL (CONT'D)                       \n                    EEEHH!!!                                           \n          \n          Matheson whips out his gun and shoves it in Saul's mouth.    \n          Budlofsky taps Matheson on the shoulder.                     \n          \n                                                                    91\n          \n          \n          \n                                 BUDLOFSKY                                \n                    Don't. Ted wants him.                                 \n          \n                                 MATHESON                                 \n                    Fine.                                                 \n          \n          Matheson looks at the wheezing Saul, curled over by his         \n          feet, and punches him in the back of the head.                  \n          \n          Matheson pokes Saul in the back with his gun, ushering          \n          him towards the corner of the barn. They come to an old         \n          TRAP DOOR. Matheson opens the hatch and they descend.           \n          \n          \n          INT. UNDERGROUND FACILITY - CONTINUOUS\n          \n          Saul is led along a narrow tunnel. As they reach the end,       \n          Saul's eyes go wide. He enters the same massive metal           \n          room that the government used in the 30s (at the                \n          beginning of the movie)...only now it is rather worn\n          down, and filled with HUNDREDS OF HUGE MARIJUANA PLANTS.\n          \n                                 SAUL                                     \n                           (breath-taken)\n                    El Dorado.\n          \n          Matheson urges Saul through the dense forest of weed,           \n          passing several of Ted's thugs, the hum of the giant grow       \n          lights filling the air.                                         \n          \n                                 SAUL (CONT'D)                            \n                    Dude, look at all this weed.                          \n          \n                                 MATHESON                                 \n                    Shut the fuck up and keep moving.                     \n          \n          As Matheson ushers Saul through the foliage, Saul notices       \n          a strange suit that resembles an old fashioned scuba            \n          diving uniform (the one from the 1930s intro) hanging on        \n          a wall.                                                         \n          \n                                 SAUL                                     \n                    What the hell is that?                                \n          \n          They arrive at a door. Matheson opens it and shoves Saul        \n          in, causing him to almost trip.                                 \n          \n                                 SAUL (CONT'D)                            \n                    Ow.                                                   \n          \n          It is the same room Private Miller was in. Matheson shuts       \n          the door.                                                       \n          \n                                                                    92\n          \n          \n          \n          \n          INT. RED'S HOUSE - CONTINUOUS                                   \n          \n          BAM! Dale kicks open Red's door and dashes into Red's,          \n          ready for anything.                                             \n          \n                                 DALE                                     \n                    Hello? Anyone here? Red?                              \n          \n          Dale starts looking around. He hears music and then sees        \n          he's stepping in a pool of blood.                               \n          \n                                 DALE (CONT'D)                            \n                    Oh my god.                                            \n          \n          Dale follows the music into the bathroom.                       \n          \n          \n          INT. RED'S BATHROOM - CONTINUOUS                                \n          \n          Dale enters and is shocked to see Red lying on the floor,       \n          clenching his bloody gut with one hand and a joint and          \n          beer in the other. The music is coming from a small boom        \n          box.                                                            \n          \n                                 RED                                      \n                           (a little out of it)                           \n                    What? Who the fuck!                                   \n          \n          Red turns toward Dale and picks up a kitchen knife with         \n          his bloody hand.                                                \n          \n                                 RED (CONT'D)                             \n                    Stay the fuck back, Denton! I didn't do               \n                    shit! I'll gut ya if I have to, tooled ya             \n                    once, tool ya again!                                  \n          \n                                 DALE                                     \n                           (utterly shocked)                              \n                    I...what? I'm not here to fight, man, I-              \n          \n                                 RED                                      \n                    Good, man. I'm fuckin' tired.                         \n          \n          Red drops the knife and then takes a puff of his joint          \n          and a sip of his beer.                                          \n          \n                                 RED (CONT'D)                             \n                    I'm dyin', Denton. Fuckin' shot. Right                \n                    here-                                                 \n                           (he points at his wound)                       \n                                 (MORE)\n          \n                                                                    93\n          \n                                 RED (CONT'D)\n                    I'm having a little going away party and              \n                    I don't remember inviting you,                        \n                    cocksucker. So I'm gonna ask you to                   \n                    leave. In my dying moments, I don't want              \n                    some asshole I barely know around.                    \n          \n                                 DALE                                     \n                    Go to the hospital, man! Are you crazy.               \n                    You don't have to die.                                \n          \n                                 RED                                      \n                    Yes I do! What? I go to the hospital, I'm             \n                    gonna end up in But that doesn't matter               \n                    `cause once Ted finds out, which he will,             \n                    I'm dead wherever I am. I'm fucked                    \n                    through and through. Now if you'd be                  \n                    willing to give a dying man his wish,                 \n                    could ya run on into the other room and               \n                    pop in disc two of Tu Pacs \"All Eyez On               \n                    Me\". I want to listen to it while I die.              \n          \n                                 DALE                                     \n                    You don't have to die.                                \n          \n                                 RED                                      \n                    Will you stop saying that, I've excepted              \n                    it, man. I'm at peace.  cough                         \n          \n          Red takes a hit and coughs. It clearly brings terrible          \n          pain to his bullet wound.                                       \n          \n                                 DALE                                     \n                    Red, I need you to tell me where Ted's                \n                    base is. He took Saul, and I can't bail               \n                    on him. I'm going to get him back.                    \n          \n          Red stares intensely at Dale.                                   \n          \n                                 RED                                      \n                    Fuckin eh, amigo.                                     \n          \n          Red heroic-ish-ly rises from the floor. He hobbles over         \n          to the hall and opens a cabinet on the wall. Dale looks         \n          in and sees several hand guns inside.                           \n          \n                                 RED (CONT'D)                             \n                    Blaze of glory, motherfucker.                         \n          \n          \n          INT/EXT. RED'S CAR - NIGHT                                      \n          \n          Dale and Red are in Red's car, a FORD FIESTA, driving           \n          through the countryside. Dale stops the car 100 yards           \n          from the barn.                                                  \n          \n                                                                  94\n          \n          \n          \n                                 RED                                    \n                    This is awesome! We're so gonna show                \n                    those motherfuckers. Think they can kill            \n                    me? Fuck no, you can't! Not how I roll.             \n          \n          Red gets out and walks to the drivers side. Dale gets         \n          out, gun in hand. Red gets in the drivers seat.               \n          \n                                 DALE                                   \n                    What are you doing?                                 \n          \n                                 RED                                    \n                    So, this is the backside of the farm. If            \n                    you stay low in the grass you should be             \n                    fine. If someone is shooting at you with            \n                    an automatic weapon, zig zag. It makes              \n                    you harder to hit.                                  \n          \n                                 DALE                                   \n                    You're not coming to help?                          \n          \n                                 RED                                    \n                    Fuck no! I've been shot. By these guys. I           \n                    was in shock before, but the air on the             \n                    drive cleared my mind, I should get to              \n                    the hospital. You saw Reservoir Dogs,               \n                    right? I got shot in the best spot                  \n                    possible. I could have a long and                   \n                    fruitful life ahead of me. Full of                  \n                    possibilities. Go get `em, slugger.                 \n          \n                                 DALE                                   \n                    But how do I get out of here if I rescue            \n                    Saul?                                               \n          \n                                 RED                                    \n                    I've no idea. I'm sure it won't be that             \n                    hard. Kill some dude and take his car, or           \n                    just take it or whatever. Good luck,                \n                    amigo!                                              \n          \n          Red drives off. Dale takes a deep breath, clenches his        \n          gun, and starts cautiously moving towards the barn. He        \n          checks to make sure his safety is off and he's ready to       \n          fight. Dale sneaks up on the building and pears in            \n          between two boards. He sees Budlofsky supervising as the      \n          thugs load the van.                                           \n          \n                                                                    95\n          \n          \n          \n          \n          INT. BARN - CONTINUOUS                                          \n          \n          Budlofsky is about to light a cigarette, when SUDDENLY          \n          Dale does a jumping role into the burn and then quickly         \n          scampers to his feet and puts a gun to THUG 1's head.           \n          \n                                 DALE                                     \n                    I'll blow his fuckin' brains out if you               \n                    don't-                                                \n          \n          BLAM! Budlofsky shoots Thug 1 in the chest.                     \n          \n                                   DALE (CONT'D)                          \n                    Oh my god.                                            \n          \n          Dale drops his gun and puts his hands up.                       \n          \n                                 THUG 2                                   \n                    What the fuck was that, Budlofsky?                    \n          \n                                 BUDLOFSKY                                \n                    Haven't you seen \"Speed\"? \"Shoot the                  \n                    hostage\".                                             \n          \n                                 THUG 2                                   \n                    In the leg, you fucking moron!                        \n          \n          Budlofsky points his gun at Thug 2.                             \n          \n                                 BUDLOFSKY                                \n                    Still worked.                                         \n          \n          Two of the thugs grab Dale and punch him several times.         \n          \n                                 BUDLOFSKY (CONT'D)                       \n                    Throw him in with the other guy, and                  \n                    everyone stay alert. Jared, go watch                  \n                    outside. This is fucked up. Somethings                \n                    going down.                                           \n          \n          The thugs start bringing Dale towards the hatch. Suddenly       \n          one of them motions for the other to stop, feeling              \n          something on Dale's back.                                       \n          \n                                 THUG 3                                   \n                    I think he's got a gun.                               \n          \n                                   BUDLOFSKY                              \n                    What?                                                 \n          \n          Thug 3 lifts up Dale's shirt, revealing that he has taped       \n          a gun to his back.                                              \n          \n                                                                 96\n          \n          \n          \n                                 BUDLOFSKY (CONT'D)                    \n                    You're kidding me, right? Die Hard?                \n          \n                                 DALE                                  \n                    I had to try.                                      \n          \n          The thugs bring him down the trap door.                      \n          \n                                 THUG 3 (O.S.)                         \n                    Hey! He's got another one taped to his             \n                    stomach!                                           \n          \n                                   THUG 4 (O.S.)                       \n                    And his leg!                                       \n          \n          \n          INT. OBSERVATION LAB - CONTINUOUS\n          \n          Saul is sitting against the wall with his hands bound and    \n          a look of complete defeat. Suddenly, the door opens and      \n          Dale is tossed in by Budlofsky.                              \n          \n                                 SAUL\n                    Dale!?! What the fuck? Did you rat me\n                    out, you shitty bastard? That what\n                    happened?\n          \n                                 DALE\n                    No! I came here to save you!                       \n          \n                                 SAUL\n                    To save me? Ha! That's rich! You're                \n                    caught, too. And now I have to die with            \n                    some asshole.                                      \n          \n                                 DALE\n                    Saul, I deserved that, because I fucked            \n                    you. You're right, this whole things my            \n                    fault, and they only way I can make it up          \n                    to you is by rescuing you, and that's why          \n                    I'm here. To save my friend.                       \n          \n                                 SAUL\n                    Tell ya what, Dale. You actually save me           \n                    and I'll consider forgiving you for this           \n                    mad shit.                                          \n          \n                                 DALE                                  \n                    Good. `Cause I will.                               \n          \n                                                                    97\n          \n          \n          \n                                 SAUL\n                    Oh really? What, you forget to tell me\n                    you shoot lasers out of your eyes, or you\n                    got some kind of secret blowtorch\n                    strapped to your dick? We're not gonna\n                    escape, Dale, we're losers, and sinners,\n                    and after we die, we're gonna go to hell!\n          \n                                 DALE\n                    We're not losers! We did that car chase.\n                    That was all you, man! You got away from\n                    the cops. I've watched, like, nine\n                    billion hours of worlds wildest police\n                    chases and I've never seen a guy get\n                    away. Not once! But you did it. You did\n                    the impossible.\n          \n          Suddenly, they both hear someone coming. The door opens.\n          Matheson pokes his head, and gun, in.                           \n          \n                                 MATHESON                                 \n                    We can hear you out there, and it's\n                    annoying. Shut the fuck up.\n          \n          He looks Dale and Saul up and down, then shuts the door.\n          Dale sits down and thinks, but is disturbed by his belt\n          buckle, which is digging into his gut.\n          \n                                 DALE                                     \n                           (whispering)\n                    Perfect! Now rub your wrists against my\n                    belt! My belt buckle'll cut the tape. Do\n                    it! This is it!\n          \n          Saul is hesitant, but awkwardly gets in position anyway.\n          \n                                   DALE (CONT'D)\n                             (whispering)\n                    Hurry!\n          \n          In an unavoidably sexual-looking motion, Saul begins to\n          gyrate against Dale's belt buckle.\n          \n                                 DALE (CONT'D)\n                           (hushed)\n                    Yes! Yes! You know what this is called,               \n                    Saul? This is called saving you.                      \n          \n          \n          INT. BARN - CONTINUOUS\n          \n          The barn door slides open. Ted and Carol walk in.\n          \n                                                                    98\n          \n          \n          \n                                 TED\n                    You have them?\n          \n                                 BUDLOFSKY                                \n                    Got them downstairs.\n          \n                                 CAROL\n                    Where did you find them?\n          \n                                 BUDLOFSKY                                \n                    We found Saul at his grandmother's and                \n                    Dale Denton busted in here like a madman,             \n                    armed to the teeth, and-                              \n          \n          Budlofsky looks over at the man he shot.                        \n          \n                                 BUDLOFSKY (CONT'D)                       \n                    Yeah, he just plugged Frank and then I                \n                    disarmed him. We got `em both holed up                \n                    downstairs.                                           \n          \n                                 TED\n                    He shot Frank? Jesus. Fuckin' Frank.                  \n          \n                                 CAROL\n                    Who the fuck is this Dale Denton?                     \n          \n          \n          EXT. BARN - CONTINUOUS                                          \n          \n          Five Asian men lay on their stomachs in the tree line           \n          dressed in black and armed with machine guns. One of them       \n          stares through a pair of night-vision binoculars while          \n          utilizing a listening device. We see his view of Ted and        \n          hear what he hears.                                             \n          \n                                 TED                                      \n                    Well, we'll torture these two bastards                \n                    and find out everything they know. What               \n                    about the shipment? Ready to move out?                \n          \n                                 BUDLOFSKY                                \n                    We'll be good to in 10 minutes or so.                 \n          \n          The Asian leader nods and does some hand signals to his         \n          men. The acknowledge they understand. He holds up a             \n          flashlight and flashes three times. From the opposing           \n          side of the barn two other flashlights blink back. They         \n          all get up and start to slowly move towards the barn.           \n          \n                                                                    99\n          \n          \n          \n          \n          INT. OBSERVATION LAB - CONTINUOUS\n          \n          Dale and Saul are still \"humping\" away.\n          \n                                 DALE\n                    This isn't working. Turn around. I'm\n                    using my mouth.\n          \n          Dale drops to his knees and starts gnawing at the tape on\n          Saul's hands. Suddenly, they hear approaching footsteps.\n          \n                                 SAUL\n                           (whispering)\n                    Someone's coming!\n          \n                                 DALE\n                           (whispering)\n                    Yo - if I cough, I'm going to make a\n                    move, if I cough twice, you take the                  \n                    lead. Got it?\n          \n                                 SAUL\n                           (whispering)\n                    What? No! What if you actually cough?\n          \n          Dale stands up just as Matheson walks in, gun drawn. Dale       \n          looks at Saul and notices that he's managed to free his\n          hands.\n          \n          Dale COUGHS TWICE. Saul shoots him a worried look and\n          shakes his head. Matheson notices. Saul COUGHS TWICE.           \n          Dale shoots him a confused look. Saul motions at him and\n          COUGHS TWICE MORE.\n          \n                                 MATHESON                                 \n                    Hey man, whatever you're doing, I get it,\n                    okay? So just stop it, alright? Just cut\n                    it-\n          \n          DALE CHARGES DIRECTLY AT MATHESON!!!                            \n          \n          BLAM! Matheson shoots at Dale's head! Dale falls to the         \n          ground, specks of blood hitting Saul as he dives\n          forwards, TACKLING Matheson into the wall!                      \n          \n          The Matheson's gun slides across the room, hitting Dale's       \n          motionless body. Saul scrambles for the gun and grabs it.\n          Matheson gets to his feet. Saul turns and-                      \n          \n          BLAM! He shoots Matheson in the gut.                            \n          \n                                                                   100\n          \n          \n          \n                                   MATHESON (CONT'D)                      \n                    AAAHHHHH!!!\n          \n                                 SAUL\n                    Holy shit, man! I'm sorry!\n          \n          Matheson writhes in pain.                                       \n          \n                                 MATHESON                                 \n                    AAAHHHHH!!! ARGH!!! YOU SHOT ME! I'VE\n                    NEVER BEEN SHOT! HELP! HELP!\n                    AAAAAHHHHH!!!\n          \n          Saul turns to see Dale lying face down.\n          \n          \n          INT. BARN - CONTINUOUS\n          \n          Ted and Carol talk as Budlofsky and the thugs silently          \n          stands by. Ted is holding a large hunting knife.                \n          \n                                  TED\n                    Has anyone seen my bigger knife?                      \n                           (beat)                                         \n                    Do you guys hear that?                                \n          \n          SUDDENLY, there is an EXPLOSION and a hole is blown in          \n          the barn wall. Budlofsky is blasted back and badly torn         \n          up.                                                             \n          \n                                   BUDLOFSKY                              \n                    Arg...                                                \n          \n          Asian assassins start pouring into the barn. One of them        \n          sees the wounded Budlofsky and blasts him away with a           \n          machine gun.                                                    \n          \n                                   TED                                    \n                    BUDLOFSKY!!!                                          \n          \n                                 ASIAN ASSASSIN 1                         \n                           (subtitled in Korean)\n                    WAR IS UPON YOU!!!                                    \n          \n          RATA-TAT-TAT!!! Everyone opens fire!                            \n          \n          \n          INT. UNDERGROUND STORAGE ROOM - CONTINUOUS\n          \n          Matheson moans and groans behind Saul, who is staring at        \n          Dale's motionless body. Horrified, he flips Dale over...\n          \n          He's alive! The top of his left ear has been blown off!         \n          \n                                                                101\n          \n          \n          \n                                 SAUL\n                    Dale? You're alive!\n          \n                                 DALE\n                    What happened?\n          \n          Saul analyzes Dale's wound.\n          \n                                 SAUL\n                    They got your ear.\n          \n          Behind Saul, Matheson tries to stand up, but immediately     \n          falls back down.\n          \n                                 DALE\n                           (difficulty hearing)\n                    My what?\n          \n                                 SAUL\n                    Here. Get up.\n          \n          Saul helps Dale stand up, freeing his hands. Dale feels\n          his ear.\n          \n                                 DALE\n                           (in pain)\n                    AAHHHH!!! MY EAR!!!\n          \n          Dale turns to the injured Matheson.                          \n          \n                                 DALE (CONT'D)\n                    YOU KILLED MY EAR!!!\n          \n                                 MATHESON                              \n                           (to Saul)\n                    You shot me..                                      \n          \n                                 SAUL\n                           (to Matheson)                               \n                    Well, you kneed my balls!\n          \n                                 DALE\n                    You shot him?\n          \n          Dale notices Saul is holding a gun.\n          \n                                 DALE (CONT'D)\n                    Whoa.\n          \n          \n          Dale turns to Matheson, who has stopped moving.              \n          \n                                                                  102\n          \n          \n          \n                                   DALE (CONT'D)\n                      Uh...stay there.\n          \n          They walk out the door and cautiously enter the forest of\n          weed.\n          \n          \n          INT. BARN - CONTINUOUS\n          \n          The Asians riddle the barn with bullets as they scream at      \n          Ted and his men in Korean. The remaining thugs scamper         \n          about, returning fire to the Asians. Ted and Carol hide        \n          behind a vehicle.                                              \n          \n                                   CAROL\n                      On three.                                          \n          \n          Ted nods.                                                      \n          \n                                   CAROL (CONT'D)                        \n                      One, two, three!                                   \n          \n          Carol and Ted pop up and unload their guns, hitting            \n          several of their assailants. They watch in horror as           \n          several more creep in through the hole the Escalade made.      \n          \n                                   CAROL (CONT'D)                        \n                      You go down. I'll take care of this.               \n          \n          Ted nods as Carol steps out from behind her cover and          \n          nails several assassins.                                       \n          \n          RAT-A-TAT-TAT!!! Carol is shot several times in the            \n          chest! She lurches backwards, but does not fall. Her           \n          bullet proof vest has taken the bullets.                       \n          \n                                   CAROL (CONT'D)                        \n                      ARGGG!!!                                           \n          \n          Carol continues firing and kills another attacker as Ted       \n          runs for the trap door.                                        \n          \n          \n          INT. GIANT UNDERGROUND GROW ROOM - CONTINUOUS\n          \n          Dale and Saul slowly make their way through the dense\n          marijuana foliage.\n          \n                                   SAUL\n                      Look at all this fucking weed, man. Where\n                      the hell are we? Is this some underground\n                      weed city we don't know about?\n          \n                                                                   103\n          \n          \n          \n          Saul suddenly GRABS Dale and pulls him down.\n          \n                                 SAUL (CONT'D)\n                           (whispering)\n                    What's that noise?\n          \n                                 DALE\n                           (whispering)\n                    I don't know! That guy just blew half my\n                    fucking ear off!\n          \n                                 SAUL\n                           (pointing across the room)\n                    There's some dudes in here. I saw them                \n                    when I got dragged down. And there's some             \n                    kind of super-suit or something.                      \n          \n                                 DALE                                     \n                    Were they armed?                                      \n          \n                                 SAUL                                     \n                           (whispering)                                   \n                    I don't think so.                                     \n          \n          BLAM! BLAM! BLAM! Dale and Saul both scramble along a row       \n          of weed planets as bullets ricochet all around them. They       \n          continue running and then stop.                                 \n          \n                                 DALE                                     \n                    I can't hear them.                                    \n          \n          Saul spots an air vent in the middle of the room.               \n          \n                                 SAUL\n                    You could boost me up! We'll sneak out.               \n          \n          BLAM! BLAM! They are being shot at again.                       \n          \n                                  DALE                                    \n                    Shoot back!                                           \n          \n                                  SAUL                                    \n                    Really?                                               \n          \n                                  DALE                                    \n                    YES!                                                  \n          \n          Saul hesitantly takes aim and pulls the trigger. BLAM!          \n          BLAM! BLAM!                                                     \n          \n                                  DALE (CONT'D)                           \n                    Now run!                                              \n          \n                                                                   104\n          \n          \n          \n          They run and turn several corners when Saul suddenly            \n          trips over a dead thug.                                         \n          \n                     SAUL                             DALE                \n          AH!!!                         WHOA!!!                           \n          \n                                 DALE (CONT'D)                            \n                    Nice. You got him.                                    \n          \n          Dale picks up the thug's machine gun. Suddenly, a thug          \n          appears behind Saul.                                            \n          \n                                 THUG 7                                   \n                    Lance? Holy fuck! You sons-of-                        \n          \n          Dale shoots right over Saul's shoulder and nails the thug       \n          several times.                                                  \n          \n                                 DALE                                     \n                    Holy shit. I killed him.                              \n          \n                                 SAUL                                     \n                    About time you killed somebody. You're                \n                    the one whose supposed to be saving me,               \n                    and I`ve killed two bad guys already.                 \n          \n          Saul looks to the vent in the middle of the room. Dale          \n          looks at the pipe, sizes up Saul and himself, and takes a       \n          deep breath.                                                    \n          \n                                 DALE                                     \n                    You'll never be able to pull me up, but               \n                    I'll boost you up there and you just                  \n                    fucking run for it, man.                              \n          \n                                 SAUL                                     \n                    What? No fucking way, Dale. What about                \n                    you?                                                  \n          \n          Dale cocks his gun.                                             \n          \n                                 DALE                                     \n                    Don't worry about me.                                 \n          \n                                 SAUL                                     \n                    Whoa. That was awesome.                               \n          \n          Saul tucks the gun in his belt and awkwardly climbs atop        \n          Dale's shoulders and tears the vent off.                        \n          \n                                 SAUL (CONT'D)                            \n                    You're a good man, Dale Denton.                       \n          \n                                                                105\n          \n          \n          \n          Saul lifts himself in. SUDDENLY, Dale sees Ted enter the     \n          room and immediately go for his gun.                         \n          \n                                   DALE                                \n                    Hold on!\n          \n                                   SAUL\n                    Wha-\n          \n          Dale walks out from under Saul, raises his gun, and          \n          unloads - RATA-TAT-TAT!!! Ted ducks as the plants around     \n          him are torn asunder. Dale runs out of ammo.                 \n          \n          BLAM! BLAM! BLAM! Ted shoots at Saul, who narrowly avoids    \n          the gunfire as he pulls himself into the vent. Ted           \n          redirects his attention to Dale, who is running through\n          the bushes. Ted blasts off a few shots before Dale\n          vanishes into the foliage.\n          \n                                   TED\n                    Denton!!!                                          \n          \n          \n          INT. VENT - CONTINUOUS\n          \n          Saul wiggles his way through the vent. He turns a corner\n          and-\n          \n                                   SAUL\n                    AHHH!!!\n          \n          There is a skeleton wedged in the vent. A grate leading\n          out is directly above the corpse. Saul squeamishly crawls\n          over the skeleton.\n          \n                                 SAUL (CONT'D)\n                    Ew. Gross, man. A fuckin' dead guy.\n          \n          He spots dog tags around it's neck as he crawls by. They\n          read: Private Greg B. Miller.\n          \n          \n          EXT. OPEN FIELD - CONTINUOUS\n          \n          Thirty feet from the barn there is an air vent sticking\n          out of the ground. The top flies off and Saul emerges. He\n          flops onto the ground, then immediately scampers to his\n          and pulls out his gun. Saul looks to the open road to\n          freedom, then back at the barn.\n          \n                                   SAUL\n                    Fuck...\n          \n                                                                106\n          \n          \n          \n          \n          INT. GIANT UNDERGROUND GROW ROOM - CONTINUOUS\n          \n          Dale frantically runs through the rows of plants, when       \n          SUDDENLY he sees the strange scuba suit out of the corner    \n          of his eye and swings his gun at it, nearly opening fire.    \n          \n                                 DALE                                  \n                           (whispering)                                \n                    Oh god.                                            \n          \n          Dale slows down to catch his breath, staring at the          \n          strange scuba suit. Then, he gets an idea.                   \n          \n          ANGLE ON: Ted, quietly walking through the room              \n          \n          Ted raises his gun as he spins around a corner.              \n          \n                                 TED                                   \n                    Where are you, you son-of-a-bitch?                 \n          \n          Ted turns another corner and sees the strange scuba suit.    \n          He starts to walk past it, when he stops himself. He         \n          creeps back and looks at it, suspicious. He walks closer,    \n          breathing as quietly as he can, his gun clenched tightly.    \n          He slowly reaches his hand out to lift the face-hatch. He    \n          gently takes hold of the latch and is about to open it,      \n          when-                                                        \n          \n          Dale jumps out from behind him and swings a FIRE             \n          EXTINGUISHER at Ted's face - SLAM!!! Ted drops his gun as    \n          he falls to the floor.                                       \n          \n                                   DALE                                \n                    Ha!                                                \n          \n          Ted leaps upwards and uppercuts Dale hard!!!                 \n\n          \n          \n          EXT. BARN - CONTINUOUS\n          \n          Saul inches towards the barn, hearing a melee of gunfire     \n          and screams as he nears it. He cautiously peers in and       \n          watches as Carol shoots an assassin in the chest then        \n          spins around and shoots at another assassin who              \n          desperately runs with a METAL BRIEFCASE handcuffed to his    \n          wrist. Carol hits him several times; he lurches over and     \n          falls through the trap door. She smiles and drops her\n          empty gun.                                                   \n          \n          Saul watches Carol as she heads towards the trap door. He\n          takes a deep breath and CHARGES into the barn, unleashing    \n          a barrage of bullets at her! BLAM BLAM BLAM! CLICK.\n          \n                                                                   107\n          \n          \n          CLICK. CLICK. None of the bullets hit her. She turns and\n          sees Saul, who drops his empty gun.\n          \n                                 SAUL                                     \n                    Fuck tha po-lice.\n          \n          They both SCREAM in rage and CHARGE, fists flying as they\n          collide. Carol whips Saul around by his collar and hurls        \n          him to the ground. She runs up and kicks him in the gut,        \n          time and time again.                                            \n          \n                                 CAROL                                    \n                    I'm a fucking cop, you moron.                         \n          \n                                 SAUL                                     \n                    AAAAAAARRRRGGGGGHHH!!!                                \n          \n          Saul leaps to his feet and PUNCHES Carol in the face. He        \n          PUNCHES her again. She reaches for her mace, so Saul            \n          kicks her in the groin and grabs it for himself, then           \n          sprays her in the face.                                         \n          \n          SLAM! He punches her in the face.                               \n          \n          \n          INT. UNDERGROUND FACILITY - CONTINUOUS                          \n          \n          Ted and Dale are squared off. Both are bloody lipped and        \n          bruised. Dale continuously shucks and jives on the spot         \n          as they talk.                                                   \n          \n                                 DALE                                     \n                    You can't fucking take me. I'm young.                 \n                    Virile. Prime of my life. You're old. Old             \n                    and dying.                                            \n          \n                                 TED                                      \n                    I don't know who you are, Denton, or why              \n                    you're trying to ruin my life, but you're             \n                    fuckin' dead!                                         \n          \n          Ted rips off his shirt, revealing dozens of fearsome            \n          tattoos and scars. Dale quickly picks a grow light up off       \n          the ground. Ted does the same. The humming of the grow          \n          lights is heard as the two men walk in a circle, squared        \n          off.                                                            \n          \n          \n          \n                  TED (CONT'D)                      DALE                  \n          AAAAAAHHHHHH!!!!              AAAAAAHHHHHH!!!!                  \n          \n          They both swing and their grow lights collide, sending          \n          shards of glass everywhere.                                     \n          \n                                                                  108\n          \n          \n          Both receive several small cuts. The immediately charge        \n          at each other and are soon grappling on the ground.            \n          \n          \n          INT. BARN - CONTINUOUS                                         \n          \n          Carol writhes on the ground as Saul runs towards her with      \n          a plank of wood. SMASH! He shatters it over her head.          \n          Carol drops, unconscious.                                      \n          \n          Saul drops to his knees, exhausted.                            \n          \n                                 SAUL                                    \n                    Crazy  huff   huff , psycho bitch...                 \n          \n                                   MATHESON (O.S.)                       \n                    Hey Saul!                                            \n          \n          Saul turns around to see Matheson clutching his bleeding       \n          gut with one hand and a loaded gun with the other.             \n          \n                                 MATHESON (CONT'D)                       \n                    I owe you one. In the gut. Then the                  \n                    balls, and then the-                                 \n          \n          CRASH!!! Red's car SMASHES through the side of the barn        \n          and SLAMS into Matheson, PULVERIZING him!!!                    \n          \n          It lurches to a stop directly ON TOP OF THE HATCH leading      \n          underground. Red steps out of the car.                         \n          \n                                 RED                                     \n                           (to Matheson's corpse)                        \n                    You just got killed by a Ford Fiesta                 \n                    motherfucker!!! How you like me now!?!               \n          \n                                   SAUL                                  \n                    R...Red?                                             \n          \n                                 RED                                     \n                    Saul! `sup! Dude, me and that Dale guy               \n                    are rescuing you. And getting revenge on             \n                    those whose shot us in the gut.                      \n          \n          BLAM! Red gets shot in the gut and drops!                      \n          \n                                   SAUL                                  \n                    RED!!!                                               \n          \n          Saul spins around to see Carol standing behind him, a          \n          machine gun aimed.                                             \n          \n                                   SAUL (CONT'D)                         \n                    Oh no...                                             \n          \n                                                                  109\n          \n          \n          \n                                   CAROL                                 \n                    Oh yeah!                                             \n          \n          \n          INT. UNDERGROUND FACILITY - CONTINUOUS\n          \n          Ted and Dale grapple violently on the ground. His gut          \n          jiggles as he lunges forwards, punching Dale in the\n          throat! Dale falls to his knees, gasping for air. Ted\n          kicks him in the head and picks up his GUN.\n          \n          ANGLE ON: AN ASIAN ASSASSIN                                    \n          \n          Barely alive, the Asian Assassin with the briefcase drags      \n          himself down the corridor and enters the grow room. He         \n          opens the briefcase and we see that it is a bomb. The          \n          assassin inserts a key.                                        \n          \n          Ted stands over Dale, aims the gun to his head, and-\n          \n          KA-BOOM!!! THE BRIEFCASE EXPLODES!!!. Flames sweep over        \n          the room as Dale rolls for cover. Ted gets blasted back.\n          \n          \n          INT. BARN - CONTINUOUS\n          \n          Saul tries to be brave as Carol takes final aim.               \n          \n                                 CAROL                                   \n                    Now prepare to eat shit and die-                     \n          \n          KABOOM!!! The explosion BURSTS UP from the hatch with          \n          incredible force. Saul and Carol get blown back as Red's       \n          Ford Fiesta is sent flying up in the air. The flaming car      \n          lands DIRECTLY on Carol and explodes. The entire barn is       \n          now engulfed in flames.                                        \n          \n          \n          INT. UNDERGROUND FACILITY - CONTINUOUS\n          \n          The air thick with weed smoke, Dale slowly rises to his\n          feet. He sees Ted slumped against the wall, dead,\n          partially aflame. Dale walks over to Ted's body and takes      \n          the gun out of his hand.                                       \n          \n                                 DALE\n                    Sorry, Ted...                                        \n          \n          He pulls a small BLUE ENVELOPE out of his pocket and\n          drops it on Ted.\n          \n                                 DALE (CONT'D)\n                    ...but you've been served.\n          \n                                                                   110\n          \n          \n          \n          Dale turns to see the exit blocked by a wall of fire. The       \n          air is thick with smoke and he can barely breath. Dale          \n          looks around desperately. He spots the FIRE EXTINGUISHER.       \n          He looks at the flames. He takes a deep breath, picks up        \n          the fire extinguisher, hurls it with all his might at the       \n          fire, and then quickly whips out his gun and shoots at          \n          it!                                                             \n          \n          BLAM! BLAM! BLAM! He hits the extinguisher and it               \n          explodes, blasting out the fire in the hallway towards          \n          the barn. Dale runs like hell.                                  \n          \n          As he bolts down the hallway, the flames rush back in and       \n          chase after him.                                                \n          \n          \n          INT. BARN - CONTINUOUS\n          \n          The barn starts to buckle, when Dale suddenly leaps out         \n          of the trap door, flames licking his heels. Coughing\n          profusely, Dale stands in the barn, then realizes his           \n          pants are on fire.                                              \n          \n                                 DALE                                     \n                    Holy fuck! Holy fuck! Aaaahhhh!!!                     \n          \n          Dale wriggles out of his pants and kicks them away.             \n          \n                                 DALE (CONT'D)                            \n                    Ow. Ah. Ow. Okay... cough   cough                     \n          \n          He starts to walk out of the barn when he suddenly trips        \n          over someone.                                                   \n          \n                                   DALE (CONT'D)                          \n                    Saul!\n          \n          He grabs one of the unconscious Saul's feet and starts to       \n          drag him out of the barn. Just a they exit, the barn            \n          COLLAPSES in on itself, crumbling into a massive heap of        \n          burning wood. Dale pulls Saul onto the grass. Saul starts\n          coughing.\n          \n                                 DALE (CONT'D)\n                    Saul!  Cough   Cough  You're okay!\n          \n                                 SAUL\n                           (confused)\n                     Cough   Cough  What the fuck happened?\n          \n                                 DALE\n                    We... Cough ...we did it. We beat them.\n                    We won.\n          \n                                                                   111\n          \n          \n          \n                                 SAUL\n                    No fucking way. Seriously?\n                           (pointing at the fire)\n                    How did that happen?\n          \n                                 DALE\n                    I have absolutely no idea.\n          \n                                 SAUL\n                    They were fighting Asian dudes, man.                  \n          \n                                 DALE\n                    Asian dudes? So, okay...maybe this is                 \n                    revenge for that Asian dude I saw Ted                 \n                    kill.                                                 \n          \n                                 SAUL                                     \n                    So we're, like, in a drug war. That's                 \n                    cool.                                                 \n          \n                                 DALE                                     \n                    What's cool is that you came back for me              \n                    man. You did, right? You weren't just                 \n                    captured again, were you?                             \n          \n                                 SAUL                                     \n                    Hell no! I was scott-free. But how the                \n                    hell was I going to leave you there after             \n                    you came to save me? Fuck that.                       \n          \n          They take a few deep breathes and each cough a bunch.\n          Suddenly, they see something moving in the rubble. RED          \n          emerges, lightly crisped with his clothes on fire. He           \n          roles around in the dirt trying to put himself out.             \n          \n                                 RED                                      \n                    Motherfuckers. Motherfuckers. Light me on             \n                    fire? Kill my Fiesta? Fuckers.                        \n          \n                                 DALE                                     \n                    Red? You okay?                                        \n          \n          Red pats out the flames and stands up, all charred and          \n          covered in dirt.                                                \n          \n                                 RED                                      \n                    Fuck yeah, I'm fine. I'm Red. You're                  \n                    makin' me feel like a broken record. Now              \n                    can we get the fuck out of this shit                  \n                    hole.                                                 \n          \n          They all stand up. Red puts his arms around Dale and Saul       \n          for support. They start to hobble towards the forest.           \n          \n                                                      112\n          \n          \n          \n                       SAUL                                  \n          What should we do now? Can we go home?             \n          \n                       DALE\n          I've gotta get downtown, try and win\n          Angie back.\n          \n                        SAUL\n          Tell her you cut off your ear for her,\n          like that crazy artist.\n                 (beat)                                      \n          But, seriously dude, your joking right?            \n          She'll never take you back, ever. Just             \n          grow up and date a woman your own age.             \n          \n                       DALE\n          Do you think we should have looked for\n          the ear? They probably could've re-                \n          attached it, eh? I mean, this ear thing\n          kind of fucking sucks.\n          \n                       RED                                   \n          Oh my god, they blew your ear off, man!            \n          Fuck that's gross. Can you dudes switch            \n          sides? I don't want to look at it.                 \n          \n                       SAUL\n          Don't worry, man. Look at Evander\n          Holyfield, he looks totally normal. And\n          plus, I saw this thing on the Discovery\n          Channel, they can actually grow ears,\n          like, in a petri dish, or even on the\n          side of a mouse. And you only need half\n          of one. It'll be a fuckin' cinch.\n          \n                       DALE\n          I just realized I've 100% lost my job by\n          now. I haven't called in for days.\n          \n                       SAUL\n          Who fuckin' cares? I thought you wanted\n          to be a talk radio dude anyways? And,\n          like, I never said anything, but you do\n          have the voice. Like, when I didn't know\n          what you did, I kind of thought you might\n          have been doing cartoon voices, you know,\n          like that Shrek shit, and that's why you\n          wore a suit.\n          \n                       RED                                   \n          You do have a good talk radio voice. I             \n          love that shit, too. I...wait, say                 \n          something again?                                   \n          \n                                                                  113\n          \n          \n          \n                                 DALE                                    \n                    What? Why?                                           \n          \n                                 RED                                     \n                    You're that dude whose always calling                \n                    KSTAR about havin' two garbage days. I               \n                    totally agree with you, man. I work out              \n                    of my house, and it's, like, one of my               \n                    main concerns, garbage pile up.                      \n          \n                                 DALE                                    \n                    Saul, what're you going to do?                       \n          \n                                 SAUL                                    \n                    Work at a bong shop.                                 \n          \n                                 RED                                     \n                    I'm still selling weed. Fuck you guys.               \n          \n          They walk together in silence, delighted at their new\n          prospects. After a brief moment, Saul suddenly seems\n          afraid. He starts nervously looking back towards the\n          barn.\n          \n                                 SAUL\n                    Do you hear something?\n          \n          Dale motions at his wounded ear.\n          \n                                 DALE\n                    All I hear is ringing.\n          \n                                 SAUL\n                    Dude, I'm kind of freakin' out. Like...I\n                    don't know...like, there might be someone\n                    out there. I mean...how do we know we got\n                    them all?\n          \n                                 RED                                     \n                    What the fuck are you guys talkin' about?            \n                    I don't hear shit.                                   \n          \n          Dale starts getting nervous, but tries to hide it.\n          \n                                 DALE\n                    Well...the barn did collapse in a ball of\n                    fire, and we probably each inhaled about\n                    ten pounds of weed smoke, so...it's just,\n                    you know-\n          \n          Dale suddenly looks over his shoulder, but sees nothing.\n          \n                                                                     114\n          \n          \n          \n                                 DALE (CONT'D)\n                    ...a little paranoia.\n          \n          Saul grabs Dale.\n          \n                                   SAUL\n                             (whispering)\n                    Stop!\n          \n          They freeze.                                                      \n          \n                                 RED                                        \n                           (whispering)                                     \n                    Are you guys fuckin' with me?                           \n          \n                                   DALE\n                             (whispering)\n                    What-\n          \n                      SAUL                               RED                \n             (whispering)                      (whispering)                 \n                                                                            \n          Sshh!                             Sshh!                           \n          \n                                 DALE (CONT'D)                              \n                           (whispering)\n                    What is-\n          \n                                SAUL\n                          (whispering)\n                    Sshh! Can you hear that?\n          \n                                   DALE\n                             (whispering)\n                    What?\n          \n                                 RED                                        \n                           (whispering)                                     \n                    Oh fuck. I'm freakin' out.                              \n          \n                                 SAUL\n                           (whispering)\n                    Just listen.\n          \n          Dale listens intently.\n          \n                                 DALE\n                           (whispering)\n                    I literally only hear ringing.\n          \n          They stand in silence.\n          \n                                 RED                                        \n                    Fuck this noise!                                        \n                                                                  115\n          \n          \n          \n          Red pushes himself off Dale and Saul and run into the          \n          darkness.                                                      \n          \n                                 DALE                                    \n                    I'm following him.                                   \n          \n                                 SAUL\n                    Wait! Me too!                                        \n          \n          With the barn's flaming remains the only light in sight,       \n          Dale and Saul run off into the endless, dark country\n          side. And as enchanting music fills the air, we humbly...\n          \n                                                     FADE TO BLACK.\n          \n                                THE END\n          \n          \n \n\n\n\nPineapple Express\nWriters :   Judd Apatow  Seth Rogen  Evan Goldberg\nGenres :   Comedy  Crime  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Dale Denton (Seth Rogen) is a 25-year-old process server and habitual pot smoker. He makes a visit to the home of his drug dealer, Saul Silver (James Franco), to buy weed. Saul tells him that he may already know the identity of Dale's next service, Ted Jones (Gary Cole). Dale drives to Ted's house and witnesses Ted and a cop, Officer Carol Brazier (Rosie Perez), shoot a man to death. Dale panics and flees the area, but leaves his roach at the scene which contains a rare strain of marijuana called Pineapple Express. Ted is able to identify the strain and sends his two henchmen, Budlofsky and Matheson (Kevin Corrigan and Craig Robinson) to dealer Red (Danny McBride), who tells them that he has only sold the pot to Saul.\nDale flees to Saul's apartment and learns that Ted is a dangerous drug lord and could trace the roach back to Saul. Dale and Saul flee into the nearby woods while Ted's henchmen persuade Red to arrange a meeting with Saul. They accidentally fall asleep in Dale's car and wake up to find that they missed their meeting with Red. They leave the woods and arrive at Red's house, hoping to determine whether Ted has linked them with him. Red says Ted isn't after them but Dale realizes that he's lying, and starts a fight that results in Red getting knocked out. They wake Red and question him until he reveals that Ted has discovered who they are and is going to kill them. Dale and Saul decide that they must leave the city.\nIn order to leave town, Dale and Saul sell some Pineapple Express to raise bus fare. However, a police officer named Barber (Cleo King) witnesses Dale and arrests him for selling marijuana. In the back of the cruiser, Dale tries to convince Barber that Carol is corrupt and he had witnessed her with Ted murdering a man. Barber recognizes Brazier and promises him that they will investigate her soon. However, Saul leaps out in front of the police car and hijacks it thinking that Brazier is the one driving. Carol hears a police radio call of Dale's arrest and pursues Dale and Saul in a high-speed chase but they manage to evade her. After an argument with each other about the situation they are in, Dale and Saul go their separate ways. Saul visits his grandmother in an assisted living home but is kidnapped and held hostage in Ted's lair beneath a barn. Dale enlists Red to help him rescue Saul but Red unexpectedly backs out at the last minute and Dale is captured. While Dale and Saul are held hostage, they reconcile with each other and make plans to escape.\nSuddenly, a rival Asian drug gang attacks the barn to avenge a member's death at the hands of Ted and Officer Brazier, the same murder that Dale witnessed. Dale and Saul finally free themselves but are caught by Matheson. Matheson grazes Dale's ear with a gunshot but is disarmed and shot by Saul. Dale and Saul join the fight and a brawl ensues between Dale and Ted. One of the Asians activates a bomb, resulting in Ted's death, and setting fire to the barn. When Budlowski refuses to kill Saul, Matheson emerges from the lair and shoots him in the chest, killing him. He turns around to kill Saul but Red drives through the barn and saves Saul by hitting Matheson with his car. Red is then seemingly shot to death by Carol. When Red's car explodes, it flips over and lands on Carol, killing her. The explosion incapacitates Saul but Dale finds him and carries him out of the burning barn. Red, wounded but still alive, also escapes and reconciles with them. Afterwards they eat breakfast at a diner and talk about their adventure before Saul's grandmother picks them up and takes them to the hospital."}