{"title": "Platoon", "full_text": "Platoon\n\n\n\n\n   \n\nPLATOON\n\nFADE IN:\n\nA QUOTATION AGAINST A BLACK SCREEN:\n\n'REJOICE, O YOUNG MAN, IN THY YOUTH ...'\n\nThe sound now of a C-130 air cargo plane roaring over us and we \ncut sharply to:\n\nEXT.AIRSTRIP - BASE CAMP - VIETNAM - DAY\n\nAs the C-130 coasts to a stop, the hatch rotating down on a hot, \ndusty lifeless airstrip somewhere in Vietnam.  Nothing seems to \nlive or move in the midday sun.\n\nTITLES RUN\n\nA DOZEN NEW RECRUITS step off the plane, unloading their duffel \nbags, looking around like only the new can look around, their \nhair regulation-clipped, crisp, new green fatigues fitting them \nlike cardboard.\n\nCHRIS TAYLOR is just another one of them - as he turns into a \ntight closeup, to look at a motorized cart pulling up alongside \n... He's about 21.  Newmeat.  His face, unburned yet by the sun, \nis tense, bewildered, innocent, eyes searching for the truth.\n\nThey fall now on a heap of BODY BAGS in the back of the cart.  \nTwo soldiers begin loading them onto the plane.  Flies - hundreds \nof flies - buzz around them, the only cue to their contents.\n\n\t\t\tGARDNER\n\t\t(next to Chris, Southern accent)\n\tThat what I think it is?\n\n\t\t\tSOLDIER 1\n\t\t(a look)\n\tI guess so ...\n\nAn uncomfortable look between them.\n\n\t\t\tSERGENT\n\tOkay, let's go ...\n\nAs they move out, Chris' eyes moving with the body bags being \nloaded onto the plane.  Moving over now to a motley HALF DOZEN \nVETERANS bypassing them on their way to the plane.  They look \nhappy.  Very happy, chatting it up.\n\nThey pass the newboys - and they shake their heads, their eyes \nfull of an almost mocking pity.\n\n\t\t\tVETERANS\n\tWell I'll be dipped in shit - new meat!  Sorry bout \n\tthat boys - 'sin loi' buddy ... you gonna love the \n\tNam, man, for-fucking-ever.\n\nChris looking at them.  They pass, except for the last man who \nwalks slower than the rest, a slight limp.  His eyes fall on \nChris.\n\nThey're frightening eyes, starved, hollow, sunken deep in his \nface, black and dangerous.  The clammy pallor of malaria clings \nto him as he looks at Chris through decayed black teeth.  Then \nthe sun flares out on him and he's past.  And Chris looks back.  \nDisturbed.  It's as if the man was not real.  For a moment there.  \nAs if he were a ghost.\n\nChris walking, duffel bag on the shoulder, looks up at the \nlollipop sun burning a hole through the sky.  A rushing SOUND \nnow.  Of frightening intensity, an effect combining the blast of \nan airplane with the roar of a lion as we hardcut to:\n\nEXT. JUNGLE - SOMEWHERE IN VIETNAM - DAY\n\nThe sun matches the intensity of the previous shot as we move \ndown into thick green jungle.  We hear the sound of MEN coming, a \nlot of men.  The thwack of a machete.  Brush being bulled.  We \nwait.  They are getting close.\n\nThe CREDITS continue to run.\n\nSUBTITLE reads: December 1967 - Bravo Company, 25th Infantry \nDivision - Somewhere near the Cambodian Border.\n\nA sweating white face comes into view. CHRIS - cutting point.  \nMachete in one hand, whacking out a path for the platoon, M-16 in \nthe other, he looks like he's on the verge of heat exhaustion.  \nBreathing too hard, pacing himself all wrong, bumping into \nthings, tripping, not quite falling, he looks pathetic here in \nthe naturalness of the jungle.  An urban transplant, slightly \nneurotic and getting more so.\n\nHis rucksack is coming apart as well, about 70 badly packed \npounds banging noisily.\n\nBehind him BARNES now comes, the Platoon Sergeant.  Then the RTO, \nhis radio man, humming lightly.  Others are behind, the column \nsnaking back deep into the brush.\n\nWe cut around some FACES of the Platoon - all to be seen later.  \nYoung faces, hard and dirty after weeks in the field, exhausted \nyet alert, fatigues filthy, slept-in, torn, personalized, hair \nway past regulation length, medals, bandanas.  A jungle army.  \nBoys.\n\nChris glancing down at his raw bleeding blisters. Transfers the \nmachete to his other, slightly less blistered, hand.  The kid \ncuts on - struggling but trying, on his last reserves of \nstrength, smashing almost straight forward through brush, not \neven bothering to look ahead.  He smells something, looks around, \nslows his pace, eyes working ... around to the base of a tree.  \nHe moves past it.\n\nAnd as he does so, the camera from his POV comes around on a dead \ndecomposing 10-day-old GOOK - eyes starting from its sockets, \nworms and flies feasting.\n\nChris draws his breath in, terrified.  Barnes suddenly appears \nalongside, his hard humourless eyes looking annoyed from the gook \nto Chris.\n\n\t\t\tBARNES\n\tWhat are you waiting for?  He ain't gonna bite you.  \n\tMove out.\n\nChris looks at him with pent-up hatred and crashes on.\n\nEXT. PLATOON PC - DAY - MOVING\n\nAt the COMPANY PC, CAPTAIN HARRIS on the radio.\n\n\t\t\tHARRIS\n\tBravo Two, Six.  What's the delay up there, move it \n\tout on point.  We've got a link up at Phase Line \n\tWhiskey at One Eight Zero Zero, over.\n\nEXT. PLATOON PC - DAY - MOVING -- MORNING\n\nAt the PLATOON PC, LIEUTENANT WOLFE sweats heavily as he speaks \nin his radio.  He is also new to the field, a dark little feisty \nguy, about 24, very hairy, especially in the eyebrows, an intense \nget-ahead look.\n\n\t\t\tLIEUTENANT WOLFE\n\tTwo Bravo, Two move it out.  Six says we're jamming \n\t'em up back there.  Over.\n\nBarnes, upfront, turns to SAL, his radio man, under his breath.\n\n\t\t\tBARNES\n\tTell that dipshit to get fucked.  Get that other \n\tfreshmeat up here.  Gardner.\n\nAs Barnes picks up his pace, irritated now at this reprimand from \nthe CO - coming up on Chris, who is soaked now from head to foot \nin sweat, dizzy, feeling sick, about to vomit.\n\n\t\t\tBARNES (CONT'D)\n\tWhat the hell's the matter with you Taylor!  You a \n\tsorry ass motherfucker.  Fall back.\n\nHe grabs Chris's machete out of his hand and bulls his way into \nthe foliage, tearing it apart, setting a new pace.\n\nChris being bypassed by the column, their eyes on him.  He is \nswatting at the red ants that are all over his neck.\n\nGARDNER, another new recruit, fat, hustling up to replace him.\n\nA big and black medic - DOC - comes over, gentle eyes and manner; \nwith him is Sergeant ELIAS, concerned.\n\n\t\t\tDOC\n\tYou okay?\n\n\t\t\tCHRIS\n\tAnts.  I got ants on my neck ...\n\t\t(shaking them out)\n\n\t\t\tDOC\n\t\t(helping him)\n\tYeah, black ants are killers, you look sick man.  You \n\tneed a little salt.\n\t\t(reaching into his satchel)\n\nSergeant Elias, a handsome, graceful dark-haired Indian kid of \n23, the squad sergeant, is taking items out of Chris' pack - air \nmattress, extra unnecessary clothing, extra canteens, grenades, \ngas mask, books.\n\n\t\t\tELIAS\n\t\t(shaking his head, amused)\n\tYou're humping way too much, troop, don't need half \n\tthis shit.  I'll haul it for you but next time you \n\tcheck it out with me okay?\n\nChris nodding, grateful, panting.\n\nThe men passing, watching.  Chris sorry about this, trying to \nkeep up face.\n\nBUNNY, a young 18 year-old with an angel's face, is pissing in \nthe dead gook's face.\n\nKING passes, glances at him.\n\n\t\t\tKING\n\tYou're a sick mother Bunny.\n\nBunny laughing about it.\n\nChris standing there one moment, fighting for his breath, \nsuddenly passes out, going over with his 70 pound rucksack, \nhitting the ground with a loud bang.\n\n\t\t\tELIAS\n\t\t(concerned)\n\tHold it up.\n\nOn Chris - his eyes opening.  He seems all right.\n\n\t\t\tCHRIS\n\t\t(trying to get up)\n\tI'm okay ... I'm okay.\n\nChris crumples backwards.  Elias helps him.\n\nEXT. COMPANY PERIMETER #1 - DUSK\n\nThe COMPANY - about 100 men who seem insignificant amid the size \nof the surrounding jungle - is digging into a perimeter of some \n100-yard radius.  A RESUPPLY CHOPPER lifts off in a flurry of \nblowing leaves.  Bare-chested soldiers chop down trees, clear \nfields of fire, set out claymores, fill sandbags, chow down.  \nLittle fires snake up against the greying red horizon.\n\nEXT. COMPANY PERIMETER 31 - DOC'S POSITION - DUSK\n\nWe cut close on a pair of grungy feet - the staple of the \ninfantry - moving up to DOC, the Medic, bandaging them for FU \nSHENG, a Hawaiin kid.\n\nEXT. COMPANY PERIMETER #1 - RHAH'S POSITION - DUSK\n\nRhah sets his tripflare.  Crawford, with him, putting out a \nclaymore.\n\nEXT. COMPANY PERIMETER #1 - RODRIGUEZ - POSITION - DUSK\n\nBack in the perimeter RODRIGUEZ sets his M-60 in the newly dug \nfoxhole.  SAL, next to him, is shaving in his helmet.\n\nEXT. COMPANY PERIMETER #1 - KING'S POSITION - DUSK\n\nKING looks like a king.  A lion of a black man but with a sleepy, \ngentle face, not to be roused, is painfully trying to scrawl a \nletter home with the pencil held awkwardly, mouthing the words.  \nFRANCIS, a young baby-faced black with long lashes and soft eyes, \npeeks over his shoulder, shaking his head.\n\n\t\t\tFRANCIS\n\tShit, King, it ain't d-e-r-e man, it's d-e-a-r, and \n\tSara don't have no two r's in it, fool.  Shame on \n\tyou.\n\nKing shrugs, a sleepy stoned voice.\n\n\t\t\tKING\n\tDon't matter, she knows what it means ... an she \n\tdon't read too good nohow ...\n\nEXT. COMPANY PERIMETER #1 - COMPANY PC - DUSK\n\nSgt. Elias washes himself, attentive to his body, slender and \nwell-muscled, and extremely handsome youth.  Of Indian blood, \nwith long black hair, generous smile, wide facial bone structure, \ngypsy eyes, and the cleanest white teeth, he could be a young \nGreek god.  He is given somewhat to panache, a silver wristband \non his arm, a bandana of black parachute silk hanging from his \nneck, his fatigues tightened down at the ankle, he pulls his \npants down, checking for crotch rot, applying talcum powder to \nthe area, his buttocks facing us.\n\nLERNER, a white kid, 19, from Florida, stopping to admire the \nfrontal view.\n\n\t\t\tLERNER\n\tMumm, any time sweetheart.\n\n\t\t\tELIAS\n\tLerner, you'd choke to death on it.\n\nEXT. COMPANY PERIMETER #1 - COMPANY PC - DUSK\n\nAt the COMPANY COMMAND POST a beehive of activity with its four \nradios, personnel, some Vietnamese scouts milling around.  \nCAPTAIN HARRIS is running down a field map with his THREE \nLIEUTENANTS.  Harris, a broad-shouldered fine-looking military \nspecimen with the requisite Southern accent and football coach \nmannerism, is directing his remark to 2nd Platoon's LT.WOLFE, who \nlooks a little nervous.\n\n\t\t\tCAPTAIN HARRIS\n\tSky Six reports a fresh company of NVA moving across \n\tfrom Cambodia to this blue line.\n\t\t(points to position)\n\tWe got a good chance to light 'em up tonight.  All \n\tplatoons will set squad-size ambushes before full \n\tdark.  Lt. Wolfe\n\t\t(glances at him)\n\tYou 'bush in this area near that ol' Buddhist temple \n\twe passed on the hump in.  Lt. Hawkins, you take this \n\tarea in the rubber plantation...\n\n\t\t\tLIEUTENANT WOLFE\n\t\t(eager)\n\tNo problem sir ...\n\nEXT. PLATOON PERIMETER #1 - CHRIS' FOXHOLE - DUSK\n\nElsewhere, Chris scrapes out a foxhole, his shirt off, bandana \naround his head, the work hot and heavy.\n\nTEX is out there setting the claymore as BIG HAROLD and JUNIOR \nstart breaking down their C's.\n\n\t\t\tJUNIOR\n\t\t(a whining high voice)\n\tHey Big Harold, gimme your peaches for the fruitcake \n\tman.\n\n\t\t\tBIG HAROLD\n\t\t(laughes loudly)\n\tFuck you bitch.\n\n\t\t\tJUNIOR\n\tC'mon man, didn't I do you right that time I give you \n\tthe turkey loaf for the ham and lima beans shit.\n\n\t\t\tBIG HAROLD\n\tTricky bitch, reason you gimme dat turkey loaf is \n\tnobody else can eat that shit 'cept me so don't start \n\tyour game playing with me Junior.\n\nThey're both black, Junior with huge goggle eyes and a face of \npimples and pockmarks, his teeth yellowed and decayed, some of \nthem missing.  Harold is about twice his size, about 250 pounds, \na baby huey concentrating real hard on preparing his stove to eat \nwith.\n\n\t\t\tJUNIOR\n\tYouse a pig man.  I hope Manny get dat laundry gig \n\tfor' you do.\n\n\t\t\tBIG HAROLD\n\tDe fool think he's gonna get it but he ain't known \n\tfor his thinking.\n\n\t\t\tJUNIOR\n\tHe's a fool alright but you a bigger fool.  Hey, \n\twhiteboy, watcha waiting for - dat hole ain't gonna \n\tdig itself ...\n\nChris looks up, continues working, as Junior chuckles.\n\n\t\t\tJUNIOR (CONT'D)\n\tHey Taylor, you don't know it but I saved your ass \n\ttoday.  I killed a shit-eating dog.\n\t\t(laughing)\n\n\t\t\tBIG HAROLD\n\t\t(getting up)\n\tThat reminds me, I gotta take a shit.\n\n\t\t\tJUNIOR\n\tYou gonna wipe your ass dis time?\n\n\t\t\tBIG HAROLD\n\tYeah if you let me have your shirt.\n\n\t\t\tCHRIS\n\t\t(VOICE OVER, as he digs)\n\tSomebody once wrote Hell is the impossibility of \n\tReason.  That's what this place feels like.  I hate \n\tit already and it's only been a week.  Some goddamn \n\tweek, grandma ...\n\t\t(checking his raw blisters)\n\t... the hardest thing I think I've ever done is to go \n\ton point, 3 times this week - I don't even know what \n\tI'm doing.  A gook could be standing 3 feet in front \n\tof me and I wouldn't know it, I'm so tired.  We get \n\tup at 5 a.m., hump all day, camp around 4 or 5 p.m., \n\tdig foxhole, eat, then put out an all-night ambush or \n\ta 3-man listening post in the jungle.  It's scary \n\tcause nobody tells me how to do anything cause I'm \n\tnew and nobody cares about the new guys, they don't \n\teven want to know your name.  The unwritten rule is a \n\tnew guy's life isn't worth as much cause he hasn't \n\tput his time in yet - and they say if you're gonna \n\tget killed in the Nam it's better to get it in the \n\tfirst few weeks, the logic being: you don't suffer \n\tthat much.  I can believe that ... If you're lucky \n\tyou get to stay in the perimeter at night and then \n\tyou pull a 3-hour guard shift, so maybe you sleep 3-4 \n\thours a night, but you don't really sleep ... I don't \n\tthink I can keep this up for a year, grandma - I \n\tthink I've made a big mistake coming here ...\n\nAs he speaks, we cut around to various shots of the platoon \nmembers on the perimeter - shaving, eating, cooking, playing, etc \n...\n\nEXT. PLATOON PC - NIGHT\n\nTowards the end of this voice over, we cut to Sgt. BARNES moving \ntowards the PLATOON PC.  A powerful face, a quiet, angry fixed \nstare, a thick trimmed moustache that helps conceal a network of \nplastic surgery grafts and scars.  The distortion from the jaw up \nthe left side of his face to his forehead, punctuated by a severe \nindentation above the left eye where a bullet once penetrated his \nskull.\n\nWalking with him is Sgt. O'NEILL as they join WOLFE, Sgts. ELIAS \nand WARREN at the PLATOON PC where they're huddled over maps.  \nWarren is a black, thin, tall, paranoid man with untrusting eyes, \nsilent and bitter.\n\n\t\t\tBARNES\n\t\t(to all, almost pleased about it)\n\tWe got boo-coo movement.  3rd Battalion just got hit \n\t15 kliks north of here.\n\t\t(the MEN react with wary silence)\n\n\t\t\tO'NEILL\n\t\t(eager to elaborate)\n\tYeah, they had claymores strung up in the trees, blew \n\ta whole fucking platoon to pieces.  BAAD SHIT.\n\nBarnes inflects his next words at Wolfe, who is worried.\n\n\t\t\tBARNES\n\tYeah, they got two Lieutenants and a Captain.\n\n\t\t\tWOLFE\n\tJesus.\n\nElias quiet.  Barnes studying the map.\n\n\t\t\tWOLFE (CONT'D)\n\t\t(to Barnes)\n\tWho do you want on ambush, Sergeant?\n\nBarnes doesn't bother acknowledging the question, barely glancing \nat the Lieutenant, to him a necessary evil.  Everybody knows \nwho's really in charge of the Platoon.  Barnes flicks his gaze to \nElias.\n\n\t\t\tBARNES\n\tElias - you take your squad and I'll take Tex and \n\tFrancis from your squad.\n\t\t(to Warren)\n\tWe move out in two-zero mikes.\n\t\t(concluding)\n\n\t\t\tELIAS\n\tI thought it was O'Neill's turn tonight.\n\nThey all look at each other.  O'Neill spits in the dust, a \nfreckled, short red head with a hard worried face, a lifer, 30 \ngoing on 60.\n\n\t\t\tO'NEILL\n\tShit!  Morehouse and Sal are short.  Fu Sheng's going \n\ton R&R, you don't want to send their asses out on an \n\tambush.  You got the fresh meat Elias.\n\n\t\t\tELIAS\n\t\t(to Barnes)\n\tThey don't know shit Barnes, and chances are we gonna \n\trun into something.\n\n\t\t\tO'NEILL\n\tSo what am I going to do!  Get one of my guys zapped \n\tso some fuckface fresh from the World can get his \n\tbeauty fucking sleep!\n\n\t\t\tELIAS\n\tHey O'Neill why don't you cool it, you don't have to \n\tbe a prick everyday of your life, you know.\n\n\t\t\tO'NEILL\n\tFuck you Elias.\n\n\t\t\tBARNES\n\tYou get your men ready Elias ...\n\nConcluding the debate, no further argument, Barnes rises.  The \nmeeting's closed.  Lt. Wolfe hasn't said a word, looking as Elias \ndeparts, without a word.\n\n\t\t\tO'NEILL\n\t\t(watching him)\n\tFucking guy's got 3 years in and he thinks he's \n\tCochise or something ...\n\nHis resentment directed partly at the way in which Elias carries \nhimself, the natural sense of grace - and the dignity it bestows.\n\n\tCUT TO:\n\nEXT. PLATOON PERIMETER #1 - SQUAD ASSEMBLY POINT - DUSK\n\nLater.  On the very edge of the perimeter, darkness coming down \nfast, the men in the ambush patrol rustle into their packs, all \nof them bitching.\n\nTex, carrying the M-60, looks up at the glowering sky.\n\n\t\t\tTEX\n\tShit, looks like rain.  All night too.  Gonna grow \n\tmushrooms in your bad-ass crotch Junior.\n\n\t\t\tJUNIOR\n\t\t(under his breath)\n\tGoddamn ain't no justice round here, you break your \n\tass for de white man ... gonna get our act together, \n\tdo some rappin' wid de brothers, change things ...\n\n\t\t\tCRAWFORD\n\tWhat's O'Neill have a nose up the lieutenant's ass \n\talready, how come we always get ambush.\n\n\t\t\tFRANCIS\n\tPolitics, man, politics.  We always getting fucked \n\taround here.\n\nChris is scared, nervous with his last-minute equipment \nadjustments, his pack obviously overweight for a night mission as \nhe hauls it up.\n\nGardner, the other new boy, is jovial in contrast, his wallet \nextended towards Chris.\n\n\t\t\tGARDNER\n\tHey Chris, I show you a picture of Lucy Jean?\n\n\t\t\tCHRIS\n\t\t(not to be bothered)\n\tNo ...\n\nGardner shows him his girl.  She's real dog u-g-l-y, and what \nmakes it worse is Gardner's put the standard photo of Raquel \nWelch alongside it, tits and all.  But he misses the irony of it.\n\n\t\t\tGARDNER\n\t\t(admiring)\n\tYeah she's the one all right ... that's Lucy Jean.  \n\tShe's a-waiting for me.\n\n\t\t\tCHRIS\n\t\t(nodding)\n\tYeah she's real pretty, you're lucky ...\n\nGardner puts it away.  Elias appears alongside them, checking \ntheir packs out, takes out Chris's poncho liner and other items.  \nHe carries a modified M-16 with a short barrel and a collapsible \nstock.\n\n\t\t\tELIAS\n\t\t(to both boys)\n\tDon't need this or this ... you're doing okay.  Just \n\tstick close to Tex, do what he does.\n\t\t(calling out to Tex)\n\tTex you got Junior and Taylor here on your position.\n\nTex is a sour Texas Ranger type, chews tobacco, spits.\n\n\t\t\tTEX\n\tDamn, 'Lias this gun's boss.  Put Taylor someplace \n\telse.\n\nChris feels the words like lashes on him.\n\n\t\t\tELIAS\n\tYou got Taylor ...\n\t\t(to Gardner)\n\t... Gardner you go with me\n\t\t(to Chris and Gardner)\n\t 'Case somethin' happens to you, you get separated or \n\tlost don't yell out okay.  Sit tight.  We'll get to \n\tyou.\n\nHis eyes.  Chris watching them.  A smile in them.  Elias moves \noff, a quality to the man that Chris admires.  A natural sense of \nleadership.\n\n\t\t\tBARNES\n\tOkay, let's move out.\n\nAs he follows King, on point, out the perimeter.  A single file.\n\nEXT. THE AMBUSH NIGHT (RAIN)\n\nNight is coming down.  The tone of the jungle sounds has subtly \nshifted - mellower, more sinuous and certainly scarier.\n\nThe file stops.  King, an experienced point man, listens.\n\nChris - carrying Tex's linked ammo - looks around, tense.  Behind \nhim is Gardner, trying to smile, starts to whisper something \n('Hey Taylor ...') when he's abruptly shushed.\n\nThe file moves on.  Gardner's pack rattling a little too loud.  A \nweird rush of cold wind now rattles the trees and the MONSOON \ncomes.  A hard slanting rain, sudden, tropic.\n\nEXT. RUINS - JUNGLE - NIGHT (RAIN)\n\nA piece of an old Buddhist temple, under a sulky moonlight now in \na state of decay, the jungle surging to engulf it.\n\nThe Men are setting up quickly and relatively quietly in the \nruins - alongside a miniscule trail.  The rain is coming down \nharder than ever.\n\nChris and Tex setting out their claymore mines, raveling back \ntheir detonating cords to their position, drenched.  In the far \ndistance, an ILLUMINATION ROUND brightens the sky for a brief \nmoment.  Various ad lib curses and directions are lost in the \nsound of the rain.\n\nEXT. AMBUSH - BARNES' POSITION - NIGHT (RAIN)\n\nAt the Ambush CP, Ace whipsers into his radio.  A soft hissing \nsound.\n\nEXT. AMBUSH - CHRIS'S POSITION - NIGHT (RAIN)\n\nLater.  Close on Chris being shaken awake.\n\n\t\t\tTEX\n\tTaylor, you're on.\n\n\t\t\tCHRIS\n\t\t(groggy)\n\tUh hunh.\n\nThe rain continuing to pelt them.  Tex hands him an infrared \nscope.\n\n\t\t\tTEX\n\t\t(suspicious)\n\tYou sure you know how to work the claymore?\n\n\t\t\tCHRIS\n\t\t(offended)\n\tSure.\n\nTex curls up as best he can in his poncho to sleep.\n\n\t\t\tTEX\n\tOkay ... don't catch no zzz's on me buddy or I'll \n\tsling your motherfucking ass ... You hear me?\n\n\t\t\tCHRIS\n\t\t(grits his teeth)\n\tYeah.\n\t\t(looking at his watch)\n\tHey Tex - you're ten minutes fast.\n\n\t\t\tTEX\n\tSin Loi.\n\t\t('tough luck', closes his teeth)\n\nChris lets it go, scans the jungle and trail with the scope.  The \nPOV is greasy and blurred.  He puts it aside.\n\nSuddenly a series of resonant SNORES crack through the jungle.  \nChris starts, then sees it's from JUNIOR lying out there, \nspreadeagled in the rain.  Chris prods him.\n\n\t\t\tCHRIS\n\tJunior!\n\n\t\t\tJUNIOR\n\tUnh? ... Unh.\n\n\t\t\tCHRIS\n\tShaddup!  You're snoring ... Shhh.\n\nBending low into his eardrum.  Junior never wakes, rolls over \nwith a growl.  Silence.\n\n\tCUT TO:\n\nEXT. CHRIS' POSITION - NIGHT (RAIN)\n\nLater.  A pool of muddy water has formed, in which a pair of \nbuttocks sit.  Move up to Chris still on duty, looking at his \nwatch, drawn, drenched, pathetic, rainwater coursing down his \nface.\n\n\t\t\tCHRIS (V.O.)\n\t\t(continuing his letter)\n\t... 'Course Mom and Dad didn't want me to come, they \n\twanted me to be just like them - respectable, hard-\n\tworking, making $200 a week, a little house, a \n\tfamily.  They drove me crazy with their goddamn \n\tworld, grandma, you know Mom, I don't want to be a \n\twhite boy on Wall Street, I don't want my whole life \n\tto be predetermined by them.\n\nA large RIPPING SOUND as the wind blows down a big tree branch \nonto the jungle floor.  He starts, peering out.  Nothing.  He \nlooks at his watch again.\n\n\t\t\tCHRIS (V.O.) (CONT'D)\n\t... I guess I have always been sheltered and special, \n\tI just want to be anonymous.  Like everybody else.  \n\tDo my share for my country.  Live up to what Grandpa \n\tdid in the First War and Dad the Second.  I know this \n\tis going to be the war of my generation.  Well here I \n\tam - anonymous all right, with guys nobody really \n\tcares about - they come from the end of the line, \n\tmost of 'em, small towns you never heard of - \n\tPulaski, Tennessee, Brandon, Mississippi, Pork Bend, \n\tUtah, Wampum, Pennsylvania.  Two years' high school's \n\tabout it, maybe if they're lucky a job waiting for \n\t'em back in a factory, but most of 'em got nothing, \n\tthey're poor, they're the unwanted of our society, \n\tyet they're fighting for our society and our freedom \n\tand what we call America, they're the bottom of the \n\tbarrel - and they know it, maybe that's why they call \n\tthemselves 'grunts' cause a 'grunt' can take it, can \n\ttake anything.  They're the backbone of this country, \n\tgrandma, the best I've ever seen, the heart and soul \n\t- I've found it finally, way down here in the mud - \n\tmaybe from down here I can start up again and be \n\tsomething I can be proud of, without having to fake \n\tit, maybe ... I can see something I don't yet see, \n\tlearn something I don't yet know ... I miss you, I \n\tmiss you very much, tell Mom I miss her too - Chris.\n\nHe moves towards Junior, shakes him, but Junior seems to be out \nof this world.\n\n\t\t\tCHRIS (CONT'D)\n\tWake up!\n\nJunior opens one dead eye.\n\n\t\t\tCHRIS (CONT'D)\n\tIt's your shift, man ...\n\nJunior scowls, swears, looks around for his rifle in the mud.\n\nChris crawls back to his position, curling himself up in his \nsoaked poncho, teeth chattering from the cold, rain splattering \nover him.  A long beat.  He sighs, the sigh kicking off the next \nimage.\n\nEXT. CHRIS' POSITION - NIGHT\n\nChris jerks awake - very suddenly, very frightened.  THE RAIN HAS \nSTOPPED.  The jungle sounds are loud.  Cicadas, night animals, \nwater dripping hypnotically from leaf to leaf.  And the whirr of \na million mosquitoes out after the rains, chewing at Chris' face.  \nHe looks around, startled.\n\nTex is asleep.  Junior is asleep.  What happened?  He looks at \nhis watch.  The mosquitoes are eating him alive.  He buries his \nhead in his green towel which he wears around his neck, but he \ncan't see.  A beat.  He moves again, miserable from the bites.  \nAnother beat.  Then suddenly the sounds of the jungle shift - \nsome of the animals dropping out.  A different tone.  A piece of \nwood is stepped on, a rustle of bush ...\n\nChris sees something, lifts an edge of the towel to peek out.\n\nA shoadow of a figure is frozen there in front of him about 15 \nyards.  It looks like a man.  But it doesn't move.  At all.  It \nlistens.\n\nChris, his heart in his mouth, tries to peer through it.  It's a \nbush.  It has to be.  No human being could stand that still.  His \nheartbeats are up.  The moments take forever.  But deep down - \nsomewhere in his psyche - he knows who it is.\n\nThe figure now shifts, ever so slightly - and moves.  It IS a \nhuman being.  Oh my God!\n\nChris looks around.  Tex seems like a mile away.  Why doesn't \nanyone fire!  He casts a desperate look at his rifle, at his \ngrenades encrusted with mud, but in spite of all his training, he \nis frozen with indecision and fear at the sight of his enemy.\n\nThe figure seems to whisper something back, then turns and comes \ndown the trail.  Now a second and third figure appear behind him \n- all in helmets and packs.  All coming right past Chris' \nposition.  Ten yards.  Nine.\n\nChris is rigid with terror.  Stark eyes.  Pleading with Tex to \nwake up, but out of reach.  He is about to have an anxiety \nattack, his heartbeats so far up he is sure they will hear him.\n\nThe first figure is now directly in front of Chris on the trail, \nlooking left and right.  A rattle of his equipment, a creak of \nleather.  A smell.  The man's face now catches the moonlight and \nhis eyes come around on Chris.\n\nOriental eyes.  Looking right at him.  Startled.  Chris staring \nback, hypnotized.  It all happens very fast.  The figure murmurs \nsomething in Vietnamese.  A warning.  He swivels.\n\nA flash of muzzle fire.  A raking cough of automatic fire.  A \ngrenade explosion.\n\nChris is hurled to the ground, helmet bouncing off, scattered, \nconfused, jarred.  All hell breaks loose around him with NOISE \nand SHOUTS.\n\nTex, kissing the ground, is yelling at him.\n\n\t\t\tTEX\n\tTHE CLAYMORE!  GET THOSE FUCKERS!\n\nChris, not knowing what he's doing, is fumbling with the claymore \nhandles, presses them.  INSERT: They won't give.  He tries again \nand again to the squeeze the life out of them.  Tex is screaming \nat him.\n\n\t\t\tTEX (CONT'D)\n\tTHE SAFETY! TAKE THE SAFETY OFF YOU ...\n\nLunges over and grabs the handle from Chris.  Clicks the safeties \noff and blows them.\n\nThree EXPLOSIONS rip out into the night - and one of the ENEMY is \ncaught in a brief instant looking like an X-ray, his body lifted \nand swirling in the air, then enveloped in swirls of smoke.\n\nChris, trying to keep up, grabs his M-16, lays out a stream of \nfire.  The sound all around him is deafening.\n\nEXT. GARDNER'S POSITION - NIGHT\n\nGardner, freaking out, stands crouched, confused, tries to run, \ncollapses.\n\nEXT. O'NEILL'S POSITION - NIGHT\n\nO'Neill throws a grenade, wild.\n\nEXT. CHRIS' POSITION - NIGHT\n\nAn explosion.  Chris hits the deck.\n\nTex is now on the M-60 machine gun, yelling at Junior who is \ncringing on the ground.\n\n\t\t\tTEX\n\tFeed me!\n\nHe lays out red tracer bullets like laser beams, then suddenly \nreels back, whiplashed, screaming.  A grenade explosion rocks \nthem.\n\n\t\t\tTEX (CONT'D)\n\tAAAAAGHHH! MY ARM! MY ARM!\n\nHis hand and wrist are gone, his face in the dirt.  Junior is \nfumbling around, trying to stay down and help him at the same \ntime.\n\n\t\t\tJUNIOR\n\t\t(grabbing Tex's gun)\n\tDOC! GET UP HERE! TEX IS HIT!\n\nChris, looking out to his front, has no clue what's going on.  \nExcept the fire is slacking.  Relayed shouts of 'Medic! Medic!'  \nOther SHOUTS.\n\n\t\t\tSHOUTS\n\tHOLD IT UP! HOLD IT UP!\n\nThe firing has ceased.  A silence, punctuated by occasional \nshouts and fast moments, has enveloped once more the cemetery.  \nDoc crashes through the bush, kneels over Tex, who continues to \nhowl in deep pain.\n\n\t\t\tTEX\n\t\t(freaked out)\n\tMY ARM! JESUS FUCKING CHRIST!\n\n\t\t\tDOC\n\tEasy Tex easy boy!\n\nTrying to sound calm but his voice is on the edge, examinging the \nmutilation with a pen flashlight, he whips out his morphine in a \nbig hypodermic.\n\n\t\t\tVOICE\n\t\t(next position)\n\tDoc over here!  Gardner's hit.\n\n\t\t\tDOC\n\t'Right there.\n\nAs he slips the morphine into Tex's arm.\n\n\t\t\tTEX\n\t\t(muttering at Chris)\n\t... godamn!  Godamn!  DUMB FUCKER, DUMB FUCKER!\n\nChris watching, suddenly feels himself dizzy, instinctively runs \nhis hands over the back of his neck.  Feels the warm blood there.  \nA moan comes from his lips.  Junior looks at him.\n\n\t\t\tJUNIOR\n\tOh shit, Doc he's hit too.\n\n\t\t\tCHRIS\n\t\t(weakly)\n\tI'm hit ...\n\nBarnes and Big Harold come hustling up.\n\nDoc finishes tourniquetting Tex, cradles Chris onto the earth, \nhis flashlight probing the wound.  Tex in background continues to \nthrash and moan.\n\nChris waits, tensely for the verdict, his eyes big with fear on \nDoc, who takes out his morphine.\n\n\t\t\tJUNIOR\n\t\t(to Barnes, pointing at Chris)\n\tThat dumb fuck didn't blow his claymore!\n\nChris hearing this.  Barnes looks at him.\n\n\t\t\tDOC\n\t\t(to Chris)\n\t... it's a scratch, nothing to worry about.\n\n\t\t\tCHRIS\n\t\t(suspicious)\n\tDoc ... tell me the truth, don't lie to me.\n\nThe needle goes in.  Tex lets out this strange keening moan that \nsets everyone's teeth on edge.\n\n\t\t\tJUNIOR\n\t\t(to Barnes)\n\tHe let'em walk right up on us.  He was sleeping on \n\this shift.\n\n\t\t\tCHRIS\n\t\t(muttering weakly)\n\tI was not ... it was your ...\n\n\t\t\tDOC\n\t\t(leaving, to Harold and Junior)\n\tSelf-preservation's the first law of nature.  Gotta \n\tlearn how to work your shit Taylor.  Watch me, don't \n\tlet'em go into shock.\n\nTex's moans are maddening and scary.  Barnes suddenly clamps his \nhand over Tex's mouth shutting him up and from way down deep in \nhis throat, chokes out the words.\n\n\t\t\tBARNES\n\tShut up!  Shut up - and TAKE IT!  TAKE THE PAIN!\n\nTex's eyes roll wildly, uncomprehending.  Doc and Big Harold \nlooking at Barnes, wondering.  Tex is suddenly silent, shocked.  \nBarnes stands, an icy glare, goes.  Junior scrambles over to \nTex's side.  Doc runs off.\n\nBig Harold cradles Chris, his big black hands like a mother, \nreassuring him.\n\n\t\t\tBIG HAROLD\n\tYou gonna be okay Taylor, okay, don't you start \n\tworrying now.\n\nChris looking up at him, eyes blinking slowly, dazed already by \nthe morphine.  He's very scared.\n\n\t\t\tCHRIS\n\tDo you ... do you know you're gonna die ... Big \n\tHarold? ... do you feel like ... like ... \n\teverything's gonna be fine and then ...\n\n\t\t\tBIG HAROLD\n\tBullshit man, you gettin outta the field, man.  Three \n\thots a day, white sheets, dem pretty white nurses \n\tgive you blowjobs too you pay em enough, I heard tell \n\tbout dem white bitches.  Better save yo strength \n\tTaylor.\n\n\t\t\tJUNIOR\n\t\t(muttering darkly)\n\tDon babytalk him man.  Cocksucker fell asleep.  They \n\twalked right up on us, he don do shit.\n\n\t\t\tBIG HAROLD\n\tShaddup bitch.\n\nChris is gettin woozier, feeling he is dying but starting to \ngrin, not caring about it anymore.  Yet he is nowhere close to \ndying.\n\n\t\t\tCHRIS\n\tIt's not ... so bad ... dying.  How long .. it ...\n\nEXT. TRAIL - RUINS - POSITION #1 - NIGHT\n\nBarnes stands over a moaning, ripped up ENEMY SOLDIER.  FIRES his \nM-16 point blank into the head.  The Soldier bucks and dies, \nquivering.\n\nEXT. TRAIL - RUINS - POSITION #2 - NIGHT\n\nELIAS, checking out a blood trail some distance away, shifts on \nthe shot, looks back.\n\nEXT. TRAIL - RUINS - POSITION #3 - NIGHT\n\nFRANCES, MANNY, BUNNY and KING are huddled over another mangled \nenemy corpse.\n\n\t\t\tBUNNY\n\t\t(stripping the corpse)\n\tThat's no NVA man.  That's a chink - look at 'em, the \n\tcocksucker's six and a half feet tall.  Look at his \n\tgear - good as ours.\n\n\t\t\tFRANCIS\n\tShit I blew my claymore right in one dude's face and \n\tI seen him walking around afterwards.\n\n\t\t\tMANNY\n\tWhat we fighting here, vampires?\n\nEXT. TRAIL - RUINS - POSITION #1 - NIGHT\n\nElias comes up to Barnes swiftly, indicating the blood trail \nleading off into the bush.\n\n\t\t\tELIAS\n\tBlood trail just keeps going and going but no body.\n\n\t\t\tBARNES\n\tHow the hell did he get away?\n\n\t\t\tELIAS\n\tFuckers returned fire soon as we lit 'em up.  Hard \n\tcore fuckin' NVA.  They got their shit together.\n\n\t\t\tRING\n\t\t(coming up to Barnes)\n\tSarge - Doc wants you.  There's a problem with the \n\tnew man.\n\nElias and Barnes go with King.  Past Chris and Tex who are \nambulatory and bandaged, being helped along.  As Barnes passes, \nthe men look at him, everybody quickly senses something is wrong.\n\nEXT. GARDNER'S POSITION - NIGHT\n\nAt one of the positions Doc is working feverishly to knock the \nlife back into Gardner who lies there, his shirt stripped off on \nhis cottage cheese belly.  A huge sucking chest wound.  He's \ndying.  You know it because he knows it.  The eyes do the \ntalking, numb, terrorized yet strangely detached, accepting, not \nprotesting or concerned any longer.\n\nMost of the ambush has assembled and is watching, Chris moving in \nto see.  Doc is mumbling to him, low key.\n\n\t\t\tDOC\n\tChopper's on the way Gardner, hang in there, you \n\tgonna be okay ...\n\nBut Gardner seems unconcerned.  Things are going on in his head - \nwho knows what.  And in his eyes there are big tears rolling.  \nThen a morphine smile.  A sort of goofy Gardner smile, maybe \nthinking about Lucy Jean, who knows.  He's dead.\n\n\t\t\tBARNES\n\t\t(to all)\n\tTake a good look at this lump o'shit ...\n\t\t(motions to Gardner's body)\n\tRmember what it looks like, all of you.  You fuck up \n\tin a firefight and I guaran-goddamn-tee you, a trip \n\tout of the bush - IN A BODYBAG.  Out here, assholes, \n\tyou keep your shit wired tight at ALL times ...\n\t\t(glares directly at Chris)\n\tand that goes for you, shit for brains.  You don't \n\tSLEEP ON NO FUCKIN' AMBUSH.  Next sonofabitch I catch \n\tcoppin' z's in the bush I'm personally gonna take an \n\tinterest in seeing him suffer - I SHIT YOU NOT ...\n\nHe thumps Chris lightly but menacingly in his chestbone and moves \non.\n\n\t\t\tCHRIS\n\t\t(drowsy)\n\tI didn't fall asleep, Sergeant, Junior ...\n\n\t\t\tBUNNY\n\t\t(pissed, cuts in, shoves him hard)\n\tShut your face chicken shit!  You in big trouble boy!\n\n\t\t\tO'NEILL\n\tExcuses are like assholes, Taylor - everybody got \n\tone.\n\n\t\t\tELIAS\n\tKnock it off!  We got two men need attention here.  \n\tPolice up your extra ammo and frags, don't leave \n\tnothing for the dinks.  Hoyt, Junior, carry Gardner.\n\n\t\t\tJUNIOR\n\t\t(muttering)\n\tLet de white boy carry his ass, he this dude that got \n\thim fucked up.  Who'd be hauling his ass if that was \n\ta brother laying there?\n\nElias follows Barnes out of earshot of the others.\n\n\t\t\tELIAS\n\tMan'd be alive if he'd had a few more days to learn \n\tsomething.\n\nBarnes, registering it, just keeps on walking.\n\nEXT. BASE CAMP - DAY (WEEK LATER)\n\nChris is driven up in a jeep to his Company PC - marked 'Bravo \nPC' on a C-ration box.  It's midday on a hot lazy afternoon, few \npeople out in the 102 degree sun.\n\nChris' Company is on the outskirts of the base camp, their \nbarracks regulation wood, canvas, and fine mesh screening, red \ndust everywhere, bunkers down on the perimeter, reams of barbed \nwire and concertina, a sand-bagged MESS HALL and CHAPEL, 81 mm \nmortar pits, observation towers, recoiless rifles, 50-caliber \nmachine guns.\n\nChris gets out of the jeep, stiff-necked, a bandage around it, \nstill in some pain.  The first man he intersects is KING, \ncarrying crates of beer.\n\n\t\t\tKING\n\tHey Taylor, what's in the breeze?\n\nIn King's mild tone Chris tries to read his standing in the \nplatoon.\n\n\t\t\tCHRIS\n\tOkay - got light duty, three days.\n\n\t\t\tKING\n\tShit, too bad we in base camp anyway.\n\n\t\t\tCHRIS\n\tWhat you got there - beers?\n\n\t\t\tKING\n\tYeah, just stole me some from the Top's supply but \nhe's stealing it from us anyway.\n\t\t(sees somebody coming)\n\tChucks are coming.  You better 'didi' man.\n\nToo late.  Sgt. O'NEILL, the redhead lifer accompanied by Spec 4 \nSANDERSON, a big handsome blond kid, not too bright in the face, \nboth slightly drunk, come around a corner, beer cans in hand.  \nO'Neill sees Chris immediately.\n\n\t\t\tO'NEILL\n\tHey Taylor - you back?\n\n\t\t\tCHRIS\n\t\t(pause)\n\tUh, looks like it?\n\n\t\t\tSANDERSON\n\t\t(spotting King's beer)\n\tWhere'd you get that beer King?\n\n\t\t\tKING\n\t\t(a funny look)\n\tI found it ...\n\n\t\t\tSANDERSON\n\tYou found it? ... Bullshit!  You going on report.  \nGimmee that shit.\n\n\t\t\tO'NEILL\n\tAwright, come here both of you.  You too Taylor\n\t\t(wags his finger)\n\tGot a little special job for you.\n\nThey advance toward him reluctantly.\n\n\t\t\tCHRIS\n\tI got light duty, Sarge.  Doctor said to take it easy \ncouple days.\n\n\t\t\tO'NEILL\n\t\t(laughes)\n\t... ain't that tough shit now.\n\nEXT. THE OUTHOUSE - DAY\n\nA wooden cabin with some half-dozen seats built over half barrels \ncut from empty oil drums.  A guy is in there, pulling up his \npants.\n\nChris, King and Crawford, a California blond with a handsome \nhoneyed look, are sweeating heavily as they roll the barrels out \nfrom under the outhouse, the smell of human waste strong.  A hot \nmidday emptiness, nobody around except the flies.\n\n\t\t\tKING\n\t\t(pissed)\n\t... Motherfuckah, motherfuckah, I'm too short to be \n\tdealing with this shit!  They keep fucking with us \n\tman, no letup ...\n\n\t\t\tCRAWFORD\n\t\t(equally pissed)\n\tPolitics man, fuckin' politics.  That O'Neill man got \n\this nose so far up Top's ass he gotta be Pinocchio...\n\n\t\t\tKING\n\tForty-two days man and a wakeup and I'm a gone \n\tmotherfucker.  Back to de WORLD.\n\t\t(dreaming in his eyes)\n\n\t\t\tCRAWFORD\n\tBroke a 100.  Got 92 to go.  April 17.  DEROS man.  \n\tCalifornia this summer.  Waves are good they tell me, \n\tsurfin's gonna be good ...\n\n\t\t\tKING\n\tMarch man in Tennessee, sniff the pines ... sniff \n\tthat crossmounted pussy walkin' down by the river.  \n\tWhat you got Taylor?\n\t\t(a snicker)\n\tLet's see three hundred and WHAT?\n\n\t\t\tCHRIS\n\t... 32. 332 days.\n\n\t\t\tCRAWFORD\n\t\t(groans)\n\tOh man!  Sorry bout that.  I can't even remember when \n\tI was 332.  You gotta count backwards like you got 40 \n\tdays in - think positive.\n\n\t\t\tKING\n\t\t(to Chris)\n\tHow the fuck you get over here man, you look like you \n\teducated ...\n\n\t\t\tCHRIS\n\tI volunteered.\n\n\t\t\tKING\n\tYou WHAT?  Say 'gain.\n\n\t\t\tCHRIS\n\tYeah, I dropped out of college and told 'em I wanted \n\tinfantry, combat, and Nam ...\n\nHe grins, finding their reactions funny.  It's also the first \ntime we've seen Chris crack a smile.\n\n\t\t\tCRAWFORD\n\tYou volunteered for this shit man?\n\n\t\t\tKING\n\tYou a crazy fucker, givin' up college man.\n\nKing has long sleepy eyelids and cat's eyes, a large pink tongue \nand big white-edged cotton picker's nails - a lazy, gentle \nnature, content with the world.\n\n\t\t\tCHRIS\n\tDidn't make much sense.  Wasn't learning anything ...\n\t\t(hesitates)\n\tAnd why should just the poor kids go to the war - and \n\tthe college kids get away with it.\n\nKing and Crawford share a smile.\n\n\t\t\tKING\n\tWhat we got here a crusader?\n\n\t\t\tCRAWFORD\n\tSounds like it.\n\nThey pause, wipe the sweat off.  King lighting up a half-smoked \njoint, hitting a few puffs, eyes shooting around, making sure \nhe's not spotted, passing it to Crawford.\n\n\t\t\tKING\n\tSheeit, gotta be rich in the first place to think \n\tlike dat.  Everybody know the poor always being \n\tfucked by the rich.  Always have, always will.\n\nNoticing Chris is having trouble with his neck, picking at his \nbandage.\n\n\t\t\tKING (CONT'D)\n\tYou okay man?  Neck botherin' you?\n\n\t\t\tCHRIS\n\tNah ...\n\n\t\t\tKING\n\tHere have some of this.  Won't feel a thing.\n\nChris looking at the joint, a little apprehensive.  He's never \nsmoked.\n\n\t\t\tCHRIS\n\tNo, thanks ...\n\n\t\t\tKING\n\tGo on, whatcha gotta lose, yo' here now ...\n\n\t\t\tCRAWFORD\n\tKills the smell of shit anyway.\n\nThe joint proferred.  Chris waits a beat, shrugs, takes it, \nsmokes.\n\n\t\t\tKING\n\tSuck it in.  Hold it ... That's it.  Now let it out.\n\nChris blows it out.\n\n\t\t\tCHRIS\n\tDon't feel it.\n\nKing and Crawford chuckle, go on rolling the cans.\n\n\t\t\tKING\n\tDat's what they all say.\n\n\tCUT TO:\n\nEXT. OUTHOUSE - LATER - DAY\n\nKing, Crawford and Chris pour kerosene over the cans at a secure \ndistance from the outhouse.\n\nKing lights it.  The cans pop and start crackling.  A line of \nburning barrels.  Rings of dirty black smoke rise against a soft \nblue sky.\n\nThey watch, stoned.  Chris turns to both of them.\n\n\t\t\tCHRIS\n\t... you know that night we got hit ... I ...\n\t\t(ashamed)\n\n\t\t\tKING\n\tFuck it, don't mean nothing, no such thing here as a \n\tcoward, done your best man, next time y'do better.\n\n\t\t\tCRAWFORD\n\tHistory, man, history.\n\nChris surprised at their attitude.  The joint suddenly hits him, \na look in his face, eyes looking around different.  Over at King.\n\n\t\t\tCHRIS\n\t\t(deadpans)\n\tI think I'm starting to feel that stuff ...\n\nCrawford laughes.\n\n\t\t\tKING\n\t\t(laughes)\n\tYo getting there Taylor.  You be cool now and I'll \n\tintroduce you 'round to some of the 'heads'.\n\n\t\t\tCHRIS\n\tWhat are the heads?\n\n\t\t\tKING\n\t\t(laughes, walks away with Crawford)\n\tLater ...\n\nChris alone, breathes deep, feeling the full effect.\n\nEXT. BASE CAMP - NIGHT\n\nA relief against the long harsh, hot day.  We see lights on all \nover the camp, sounds of music, laughter from the barracks.\n\nINT. UNDERWORLD HUTCH - NIGHT\n\nKing leads Chris down to a specially constructed cellar-like \nhutch dug deep into the ground on an isolated edge of the \nbattalion perimeter.  Ammo casing and canvas are piled over it, \nand sandbags surround it.  From the outside very little sound can \nbe heard as they go down through a trap door made of ammo crates.  \nPast a lookout (Adams) pulling security, hitting a joint but \nalert.  King motions to him, it's cool.\n\nInside is another world.  Chris looking around amazed.  It's like \na private cabaret for the 'heads' who are there cooling out.  \nBoxes of food from the States, beers, whiskey bottles, crates \nfunctioning as tables, hammocks hanging from poles, electric \nfans, tape decks, paraphenalia.\n\nThe boys are all dressed up in their Saturday night rags.  The \nclothes are clean, the headbands, the medallions are out, \nanything distinctive and individualistic.  On the tapedeck, \nJefferson Airplane's 'Go Ask Alice'.\n\nTo Chris it is a new world.  And RHAH, the resident head, sitting \nthere in all his finery puffing a huge burning red bowl in a \nthree foot long Montagnard pipe, seems to be the lord of final \njudgement in this smoky underworld.\n\nAcross his naked chest, birds and snakes are tatooed.  Around his \nneck a black skull and white ivory cross side by side.  On his \nknuckles 'Love' and 'Hate' are tattooed.  In his eyes, a dancing \nSatanic fire.  A poor rural Southern white, in his grizzled late \n20's, he could be a Biker King.  Giving Chris the once-over.\n\n\t\t\tRHAH\n\tWhatcha doing in the underworld Taylor?\n\n\t\t\tKING\n\t\t(smiling)\n\tThis ain't Taylor.  Taylor been shot.  This man Chris \n\tbeen resurrected ...\n\nChris wondering what he's doing here.  His eyes roving over \nLERNER, CRAWFORD, MANNY, FLASH, FRANCIS, HOYT, TUBBS, DOC, other \nfrom the Platoon, about 9 or 10 of them.\n\nRhah eyes him back, hands him the bowl.\n\n\t\t\tRHAH\n\tYou lame Taylor?\n\n\t\t\tCHRIS\n\tWhat?\n\n\t\t\tRHAH\n\tYou lame or something?\n\n\t\t\tKING\n\t\t(smiling)\n\t... go ahead on, smoke it man.\n\nChris understands, takes the bowl.  Hesitates.  Then smokes it.  \nThe contact fumes are almost enough to knock him out.  He starts \ncoughing.  They're all laughing.\n\n\t\t\tRHAH\n\tYour shit's in the wind troop.  Baaaaah!\n\nLerner replies, his tongue hanging out in parody.\n\n\t\t\tLERNER\n\tAnd Baaaaaaa! back on you.\n\n\t\t\tRHAH\n\t\t(looking at Lerner with distaste)\n\tIf you're gonna do it man, 'least do it right.\n\nBuilding up to it, his eyes shaking with conviction at the whole \ninsanity of the world, he neighs with all the venom he can \nmuster.\n\n\t\t\tRHAH (CONT'D)\n\tBaaaaaaaaaaaaaaaa!!!\n\nThey all laugh and applaud.  King smoking from the pipe passing \nit back to Chris who takes another hit, doesn't cough this time, \nlooking around, wondering about these guys.\n\n\t\t\tLERNER\n\tI didn't like it.\n\n\t\t\tRHAH\n\tBah, you're a child, Lerner.  Rhah don't waste time \n\ton you.\n\nThey go on ad-libbing with each other, teasing Doc, who's fairly \nstraight, saying he wants to go to med school in the fall.  'Be \nwhat?''A gynecologist, man.''What dat?' Francis suggests, 'Dats a \npussy doctor, man - he's gonna be Doctor Feelgood, man!' They're \nall cracking up, finding every joke funny.  As Chris finishes his \nhit on the pipe, looks up across the smoke, already dazed, \nsurprised to see ELIAS suddenly there - leaning out of his sling \nin a far corner of the hooch.  A Monkey is draped around his neck \nwith silver bracelets, rings, a necklace - like a sensual little \nEgyptian whore, Elias playing with it, spaced out in a sleeveless \nvest, tiger pants.  Dancing eyes on Chris, he swings out the \nhammock, comes over with the monkey.\n\nMeanwhile Manny has broken into a high falsetto snatch of blues \ndirected at Chris, joined by Big Harold and Francis, all of them \nclicking their hands.\n\n\t\t\tMANNY & BIG HAROLD & DOC\n\tOooh Chris, you look like you is high oh yeah, he \n\tlooks like he is high Ooooh Chris, you know you gonna \n\tbe that way all night oh yeah I think that you are \n\t... Yeah! up now and up to par oh yeah.\n\nElias pulls out a Remington 870 shotgun, jacks it to the rear, \npoints it at Chris.\n\n\t\t\tELIAS\n\tPut your mouth on that.\n\nChris does so slowly, a little worried.  Elias takes a hit and \nblows it down the bore - 'shotgunning' it into Chris' lungs.  \nChris staggers back, coughing.  Everybody laughes 'hey dude - you \ndone had your ass blown away' etc ...\n\nElias smiles his big white-tooth smile.\n\n\t\t\tELIAS (CONT'D)\n\tFirst time?\n\n\t\t\tCHRIS\n\tYeah.\n\n\t\t\tELIAS\n\tThen the worm has definately turned for you man.\n\nChris puzzled by this expression.\n\n\t\t\tELIAS (CONT'D)\n\t\t(smiles)\n\tFeel good?\n\n\t\t\tCHRIS\n\t\t(a sense of euphoria now)\n\tYeah.  No pain in my neck now.  Feels good.\n\n\t\t\tELIAS\n\tFeelin' good's good enough.\n\nAs he sucks in a huge mass of smoke off the bowl.  His eyes \nperforming a funny little hop, skip and jump, as he holds it, his \nface turning red.\n\nThe monkey jabbers and jumps around on his neck, worried.  Elias \nthen blows the smoke out in its face, the monkey hating it.\n\nThe Group laughes.\n\n\t\t\tELIAS (CONT'D)\n\tHey Crutcher.  I hear you got a Dear John from your \n\tgal.  Told you she wasn't getting 'nuff from you.\n\nLerner looks up, stoned out of his mind, wearing a ring in his \near.\n\n\t\t\tLERNER\n\tShit.  Sold me out for some lame dude with a 4-F.\n\n\t\t\tELIAS\n\tWhat'd you say her name was again?\n\n\t\t\tLERNER\n\t\t(recalling her image)\n\tDaisy Mae.\n\n\t\t\tBIG HAROLD\n\tHey look at Charlotte!\n\nThe monkey is sitting quietly stoned, its eyes blinking.  \nLaughter off.\n\n\t\t\tELIAS\n\tDaisy Mae!  What Daisy Mae look like Crutcher?\n\n\t\t\tMANNY\n\tShe look huge and got freckles on her ass.\n\n\t\t\tLERNER\n\tShe look beautiful.\n\n\t\t\tFRANCIS\n\tHow much she weigh man?\n\n\t\t\tBIG HAROLD\n\tShe braid her hair under her armpits, Crutcher.\n\n\t\t\tFRANCIS\n\t\t(sarcastic)\n\tDaisy Mae what?\n\n\t\t\tKING\n\tDaisy Mae Highway, that's what.\n\t\t(laughing)\n\tWell whatcha want, Lerner, your dick been limp for a \n\tyear, 'cept when you're bopping your buddy Tony up \n\tthere.\n\n\t\t\tLERNER\n\tFuck that.\n\n\t\t\tELIAS\n\tI fucked this chick in Hawaii man.  Couple weeks ago \n\t... Oooooh!  Wow - outasight.  Gracie Slick man, she \n\tlooked like Gracie man, I shit you not.\n\t\t(remembering)\n\nThe look on his face ensnares all of them, except perhaps Rhah.\n\n\t\t\tMANNY\n\tWhat happened man.  What whorehouse you go to?\n\n\t\t\tELIAS\n\tNo whorehouse man.  On the beach.\n\n\t\t\tFRANCIS\n\tSure.\n\n\t\t\tELIAS\n\tYeah, sure.  She walked right by me.  Long black \n\thair, tits swinging.  Ass like French bread.  Legs \n\tdon't end right.\n\n\t\t\tLERNER\n\t\t(skeptical)\n\tYou can plant that shit in Tennessee man, but it \n\twon't come up in Texas.\n\n\t\t\tCRAWFORD\n\tSo what she got, hair on her tits.\n\n\t\t\tELIAS\n\tI just stopped man.  My heart's beating like a hardon \n\tright I got a hardon sticking through my pants, my \n\tbathing suit looks like a hutch ...\n\n\t\t\tBIG HAROLD\n\tI know dat feeling ...\n\n\t\t\tELIAS\n\tSo I'm thinking to myself - Elias you walk away from \n\tthis, you gonna regret this the rest of your natural \n\tlife.  So I go after her, follow her down the beach.  \n\tYou know find out if she is what she is.\n\nThey're all hooked into this now.\n\n\t\t\tKING\n\tAnd?\n\n\t\t\tELIAS\n\tWell she was picking up her kids.\n\n\t\t\tMANNY\n\tDat's dat.\n\n\t\t\tELIAS\n\tNo, dat ain't dat.\n\n\t\t\tFRANCIS\n\tGet outta here, she married ...\n\n\t\t\tELIAS\n\tLike two hogs in heat.  Boy.\n\nTheir throats knotting ...\n\n\t\t\tCHRIS\n\t\t(joining in)\n\t... But what'd she do?\n\n\t\t\tELIAS\n\tWhat didn't she do.  She fucked the living shit outta \n\tme, that's what she did!\n\n\t\t\tCRAWFORD\n\t\t(sucking in air)\n\tJesus!\n\n\t\t\tELIAS\n\tCouldn't get enuff ...\n\n\t\t\tCHRIS\n\tBut what'd she actually do?\n\n\t\t\tELIAS\n\tShe was a crossbreed, Chinese and Polish.\n\n\t\t\tBIG HAROLD\n\tWhat dat?\n\n\t\t\tRHAH\n\t\t(finally hooked in)\n\tAnd living in Hawaii man?\n\n\t\t\tELIAS\n\tYeah - and has blonde hair and almond-shaped eyes.\n\n\t\t\tFRANCIS\n\tHey man didn't you say she had black hair?\n\n\t\t\tELIAS\n\tShe had blonde hair man.  And long tan legs, in those \n\tleather sandals you know, with those thongs up to her \n\tknees, this musky oil on it ... mmmm smelled good \n\twhen they were wrapped around my face ...\n\nThey groan, dreaming of Hawaii.\n\n\t\t\tDOC\n\tYeah!\n\n\t\t\tCHRIS\n\tGod!\n\n\t\t\tBIG HAROLD\n\tPlease, somebody hold my dick!\n\n\t\t\tELIAS\n\t\t(in afterthought)\n\t... and a broken nose.\n\n\t\t\tDOC\n\tBroken man?\n\n\t\t\tELIAS\n\tYeah, otherwise she would've been too perfect, y'know \n\twhat I mean ... some woman.  Her name was ...\n\nHe forgets it.  A grass blackout.  Lerner urging him on.\n\n\t\t\tLERNER\n\tSusan?\n\n\t\t\tMANNY\n\tTamara?\n\n\t\t\tCHRIS\n\tElizabeth?\n\nElias shaking his head, trying to remember.\n\n\t\t\tKING\n\tMerle?\n\n\t\t\tRHAH\n\tMerle?  Jesus!  ... Patty?\n\n\t\t\tBIG HAROLD\n\tInga?\n\n\t\t\tCHRIS\n\tJennifer?\n\n\t\t\tHOYT\n\tConnie?\n\nElias snapping his fingers.\n\n\t\t\tELIAS\n\tDawn!  That was it!\n\n\t\t\tCHRIS\n\t\t(repeating it)\n\tDawn ...\n\nKing listening to the sound of it.\n\n\t\t\tKING\n\tDawn?\n\nThe others nodding, musing over it.\n\n\t\t\tBIG HAROLD\n\tYeah, Dawn ...\n\nINT. THE BARRACKS - NIGHT\n\nIn comparison to the darkness of the hooch, a highly lit \natmosphere, attracting bugs ... dusty gear lying around a \ndisordered hooch, loud and finger-snapping COUNTRY WESTERN MUSIC \nplaying from a tape deck, a well-known tune, circa 1967.\n\nBUNNY, the 18 year-old angel face, totters drunk with a Colt-45 \nbeer in hand, over to JUNIOR, the badass black kid with the zits, \nwho just lies there on his cot sweating, doing nothing.\n\n\t\t\tBUNNY\n\t\t(listening to the music)\n\tListen to that shit, that's good shit!\n\n\t\t\tJUNIOR\n\t\t(irritated as always)\n\tFuck that redneck noise, dude.  All dem chicks be \n\trappin' how dey losin' der' ho's and how dey ain't \n\tgot no bread for beer.  Fuck dat honky shit.  Got to \n\tget me some motown jams, dig it?\n\n\t\t\tBUNNY\n\t\t(doesn't understand a word of it)\n\tWhaddaya talking shit for man.  Hey Junior!  Y'ever \n\tsmoke any shit?\n\n\t\t\tJUNIOR\n\tDas right dude.  You be tryin' to string de black man \n\tout on dat shit and keep him DOWN.  Time's be coming, \n\tmy man, when de black man's gonna throw off that \n\tyoke.\n\n\t\t\tBUNNY\n\t\t(lonely in his way for company)\n\tSay I can dig it.  Smoke that shit everything kinda \n\tgets weird y'know?\n\t\t(hiccups, sits)\n\tY'hear that story the gooks is putting chemicals in \n\tthe grass so's we become 'pacifists' so's we don \n\tfight\n\t\t(to no one in particular)\n\tWhere the hell's everybody, they'se gettin high \n\tthat's what - bunch of hopheads, they think they \n\tspecial ...\n\n\t\t\tJUNIOR\n\t\t(turns away, bored)\n\tDon you worry Bunny, youse a killer anyway.\n\n\t\t\tBUNNY\n\tYeah but I still like a piece of pussy once in a \n\twhile - ain't nothing like a piece of pussy cept \n\tmaybe the Indie 500.\n\n\t\t\tJUNIOR\n\tYouse so fucked up man.\n\n\t\t\tBUNNY\n\tY'ever look at yoself in the mirror Junior, youse \n\tuglier than a dick on a dog man.\n\t\t(laughing)\n\n\t\t\tJUNIOR\n\tYeah, you had a piece of pussy on a plate in front of \n\tyou, you'd probably kill it.\n\n\t\t\tBUNNY\n\tShit, I bet I been laid more'n you have.\n\n\t\t\tJUNIOR\n\tSure, you probably stick it in tween her knees and \n\tthink youse there.\n\n\t\t\tBUNNY\n\tYeah?\n\n\t\t\tJUNIOR\n\tOnly way you'd get some pussy is your bitch dies and \n\twills it to you - and then maybe.\n\nLt. WOLFE wanders down the aisle, beer in hand, slightly lonely, \nbypassing FU SHENG, the Hawaiin and TONY, a mustached hairy-\nbrowed Italian kid from Boston, who are playing some kind of dice \ngame.  They hardly acknowledge the Lieutenant who stops by \nRODRIGUEZ, the Mexican-American kid who is on his cot in his \nneatly arranged area writing a letter home with a pencil, forming \nhis words with his mouth, as always minding his own business.  \nReligious objects comprise his few decorations.\n\n\t\t\tLIEUTENANT WOLFE\n\t\t(amiable)\n\tHow you doing Rodriguez?\n\n\t\t\tRODRIGUEZ\n\tGood sir.\n\n\t\t\tWOLFE\n\tNeed anything?\n\n\t\t\tRODRIGUEZ\n\tNo sir.\n\nWolfe winks at him, continues on to the POKER GAME going on in \nthe center of the barracks, the main action.  BARNES, \nSgts.O'NEILL and WARREN, the quiet sullen black, SANDERSON and \nSAL play as ACE, the tiny radio kid, and MOREHOUSE look on; all \nof them drinking beer and bourbon chasers from a bottle.\n\n\t\t\tWOLFE\n\t\t(to O'Neill)\n\tHow's it going Red?\n\t\t(using his nickname)\n\n\t\t\tO'NEILL\n\tShit, cocksucker's got all the cards tonight.\n\n\t\t\tWOLFE\n\t\t(to Barnes)\n\tLooks like you're doing all right Sergeant.\n\nBarnes, raking in the chips, is the big winner, a light bead of \nsweat on his forehead and a somewhat glassy look to the eye the \nonly indication he is drunk - his shirt peeled off revealing a \nmuscular, scarred body.\n\n\t\t\tBARNES\n\tYeah, and I ain't even cheating yet.\n\n\t\t\tSANDERSON\n\t\t(the big blond kid)\n\tHave some Kentucky windage Lieutenant.\n\t\t(passes him the bottle of bourbon)\n\nWolfe takes a nip.\n\n\t\t\tBARNES\n\tPlay Lieutenant?\n\n\t\t\tWOLFE\n\tNah, I wouldn't want to get raped by you guys ...\n\n\t\t\tO'NEILL\n\tWhat are you saving up to be Lieutenant - Jewish?\n\nLaughes.  Wolfe forces a smile, glad to move on.  There is a \ncontinual worried rodent air about him, an anxiety, a desire to \nfill the vacuum in his leadership with a false masculinity.\n\n\t\t\tWOLFE\n\tCatch you men later.  Enjoy yourselves.\n\nAs he goes, O'Neill shakes his head after him.\n\n\t\t\tO'NEILL\n\tSorry ass motherfucker ain't he.  You think he gonna \n\tmake it Barnes?\n\nBarnes plays a card, glances, a minute movement of his head.\n\n\t\t\tO'NEILL (CONT'D)\n\tYeah that's what I figger.  Some dudes you jes' look \n\tin their faces and you KNOW they just ain't gonna \n\tmake it.\n\nBarnes looks - with some irony - at O'Neill.  The Country Western \ntune has reached a crescendo whine which now mixes into:\n\nINT. UNDERWORLD HUTCH - NIGHT\n\nFrancis, the baby-faced black, and Manny, green shades covering \nhis skinny face, lead with a high blues falsetto.\n\n\t\t\tFRANCIS AND MANNY\n\t\t(singing)\n\t'People say I'm the life of the party cause I tell a \n\tjoke or two  Although I may be laughing loud and \n\thardy  Deep inside I'm blue ...\n\nThe Hutch looks now like a Turkish bath with minimum visibility, \nthe smoke fumes dense.  They are all up dancing on their feet - \nKing, Tubbs, Big Harold, Hoyt, Lerner, Crawford, Flash, Doc, \nElias - a few light gestures with their hands above shoulder \nlevel, passing around the grass pipes while they shuffle, fingers \nclicking.  The song - Smokey Robinson's \"Tracks of My Tears\" - \naccompanies them from a vintage tapedeck.\n\n\t\t\tALL\n\t'... Since you've left me, if you've seen me with \n\tanother girl seeming like I'm having fun although she \n\tmay be cute she's just a substitute because you're \n\tthe permanent one ...'\n\nKing and Big Harold wave Chris into the Circle and he starts \nswaying with them, feeling as if he's being accepted into a new \nfamily.\n\nRhah watches it all, puffing away on his magic dragon pipe, the \nshadows dancing on the walls.\n\nIt looks like a Saturday night dance party.  A yearning for \ntenderness, for feminity, for a moment of peace in this nightmare \nlife.  Their eyes closed, thinking of dance partners that can't \nbe here tonight.  Singing their souls out.\n\n\t\t\tALL (CONT'D)\n\t'... So take a good look at my face.  You'll see the \n\tsmile looks out of place.  Look a little bit closer.  \n\tIt's easy to trace.  The tracks of my tears...'\n\nEXT. JUNGLE - NVA BUNKER COMPLEX - DAY\n\nAn overwhelming 103 degree heat.  Chris is once more on point, a \nlittle better now but obviously struggling with a thick \nunyielding bamboo thicket that forces him forward in a caveman \ncrouch.  Napalm jelly is hanging from the trees in great canopies \nof spider webs, obliterating the sky.\n\n\t\t\tCHRIS (V.O.)\n\tNew Year's Day, 1968.  Just another day.  Staying \n\talive.  There's been a lot of movement neat the \n\tCambodian border, regiments of NVA moving across.  A \n\tlot of little firefights, ambushes, we drop a lot of \n\tbombs, then we walk through the napalm like ghosts in \n\ta landscape ...\n\nChris working his way over twisted, broken stumps, branches.  On \nthe back of his flak jacket he's written, 'If I die bury me \nupside down so the whole world can kiss my ass'.\n\n\t\t\tBARNES\n\tPssst!\n\nThe signal for silence.  Chris freezes.  Barnes edging up to him.\n\n\t\t\tBARNES (CONT'D)\n\t\t(whispers)\n\tBunker ...\n\n\t\t\tCHRIS\n\tWhere?\n\nDoesn't see it.  Following Barnes' imperceptible movement of his \nhead.\n\nThe bunker, dug into the ground and camouflaged with brush, is \nstaring right at him, not more than 20 feet away.  Chris is a \ndead man if ...\n\nBarnes, checking the terrain, signals radioman Hoyt.\n\nBarnes edging up to the bunker, eyes everywhere.  Chris \nfollowing.  The tension builds.  They come up to the edge of it, \npeer in.  Nothing.\n\nBarnes walks around it, slips in from back.  Chris covers him, \nother guys coming up now, making a small perimeter.\n\nChris now starts to see things he didn't see.  Right in front of \nhis nose - there is a trench from this bunker to another and \nanother.  There is now in his view a complex of bunkers and \nthatched hootches and lean-tos all blending into the forest.  A \nghost city ...\n\nElias and others fanning out now, careful ... whispered \nconversations in the wind.\n\nChris moves past a rope with freshly washed laundry stretching \nbetween two trees, clothes stirring in the wind.  He looks up as \nKing points out a treehouse, then looks down as Lerner whispers \nsomething and points - NVA rucksacks are laid out on the ground \nin an orderly platoon-sized pattern.\n\n\tCUT TO:\n\nINT. NVA BUNKER - TUNNEL POSITION - DAY\n\nElias goes down into a dangerous-looking TUNNEL, on a rope with a \n.45.  Barnes watching him.  We sense Elias loves the danger, \nsmiling.\n\nEXT. NVA BUNKER - COMPLEX - MAIN POSITION - DAY\n\nLt. Wolfe signals Manny and Chris out onto the two flanks.\n\nINT. NVA TREEHOUSE - DAY\n\nRhah and King explore a treehouse.  Rice stores.  Rhah, an \nexperienced soldier, seems tense, moves cautiously, expecting \nbooby traps.\n\nEXT. NVA BUNKER - WARREN'S POSITION - DAY\n\nSgt. Warren cautiously explores another bunker, probing a little \ntunnel in the bottom of it with a stick.  Bunny, having a small \nframe, goes down into it, fearless.\n\nEXT. NVA BUNKER - MANNY'S POSITION - DAY\n\nManny, the skinny black boy with the coloured beads, is out on \nflank - alone, smoking a cigarette, humming.\n\nEXT. NVA BUNKER - CHRIS' POSITION - DAY\n\nOn the other flank, Chris, also alone, waits, listening to the \nsounds of the jungle.  He too is smoking a cigarette.  The \neeriness is everywhere.  Rays of morning light peeking through \nthe cathedral dome of the jungle.  Bird calls.\n\nINT. NVA TUNNEL - DAY\n\nElias climbs deeper and deeper into the hole, a rope attached to \nhis waist leading out to the surface, his flashlight now coming \naround on a shaftway demarcating a TUNNEL that seems to stretch \nfor at least 100 yards.  The light revealing cobwebs all along \nit, but tall enough for a small man.\n\nEXT. CHRIS' POSITION - DAY\n\nIt's quiet, weird.  Chris takes his pants down, squats.  He \nthinks he hears something, tenses.\n\nThere is a soft rustling sound now.  And as he focuses on it he \nrealizes it is coming from very close to him.  Something light \nand sinuous moving over the leaves.  He looks down.\n\nA bright yellow and orange-ringed krait viper is crawling right \nbetween his two legs.  It stops, senses another life standing \nover it.\n\nChris frozen with dread.\n\nThe snake crawls on, pulling its long, long 15 foot body behind \nit.\n\nOn Chris, eyes dilated, slowly regaining his breath looking \naround everywhere now.\n\nINT. NVA TUNNEL - DAY\n\nElias moving down the tunnel, fearless.  We expect something any \nmoment to come out and nail him but nothing does.  He stops.  His \nflashlight revealing a kitchen and an NVA hospital set up.  A \nhammock swings as if someone just deserted it.  In another \nhammock is a dead man.  Elias advances cautiously.\n\nEXT. NVA BUNKER - COMPLEX - SANDERSON POSITION - DAY\n\nSpec 4 Sanderson, the big handsome blond kid, is moving through \nan abandoned bunker.  With him is Sal, a tough street kid with an \nintense face, all whiskered.  Sanderson noticing now a metal box \nof 50-caliber ammo, U.S. marking, half-buried in the ground.\n\n\t\t\tSANDERSON\n\tHey look at that.\n\nHe opens the case.  Official-looking documents are inside, they \nglance through them, lighting cigarettes, the search over, \nsuccessful, they relax.\n\n\t\t\tSAL\n\t\t(a worried type)\n\tLeave it willya - it's gook shit.\n\n\t\t\tSANDERSON\n\tNah this stuff's important.\n\nHe puts the documents back in the ammo case, lifts it.  It's the \nlast thing he ever does.\n\nEXT. NVA BUNKER - SANDERSON POSITION - DAY\n\nThe ensuing explosion shakes the ground, obliterating both boys, \nbrances, smoke and dust flying out.\n\nEXT. NVA BUNKER - CHRIS POSITION - DAY\n\nOut on flank, Chris hits the ground, hugs it.\n\nEXT. NVA BUNKER - COMPLEX - SANDERSON POSTION - DAY\n\nBarnes runs up.  Black smoke sweeping through the trees.  Sal \nsuddenly appears, stepping out of the smoke, stunned.  The front \nof his body is soaked in blood from a thousand shrapnel holes, \nhis clothes shredded, he stares at Barnes, dazed.  Both his arms \nare gone and blood is geysering out like a water fountain.  He \ncrumbles - dead or dying.\n\n\t\t\tBARNES\n\tCorpsman!\n\nHe runs over to Sal, gets a hold of his face in a vicelike grip, \nenraged, tries to yell some sense into him.\n\n\t\t\tBARNES (CONT'D)\n\t\t(directly to Sal)\n\tGoddamit!  Are you fucking kids ever gonna learn!  \n\tDon't you understand how easy it is to die!\n\nThe Doc running up - one look tells us all we need to know.\n\n\t\t\tDOC\n\tHoly Jesus!\n\nEXT. NVA BUNKER COMPLEX - MAIN POSITION - DAY\n\nLt. Wolfe, shaken, is on the radio with Cpt. Harris, words \ngarbled through the air, trying to describe a primal horror.\n\nEXT. NVA BUNKER COMPLEX - SANDERSON POSITION - DAY\n\nBarnes moving through the wreckage - sees severed limbs sticking \nin a sandbag.\n\nEXT. NVA BUNKER COMPLEX - MAIN POSITION - DAY\n\nRhah crouches over a piece of leg tied into a hipbone and a rib.\n\nEXT. NVA BUNKER COMPLEX - DAY\n\nElias coming out of the tunnel, filthied.\n\nEXT. NVA BUNKER - MAIN POSITION - DAY\n\nElias coming abreast of Wolfe.\n\n\t\t\tELIAS\n\tTell Six we need engineers here, this pos. is \n\tcrawling with traps.\n\n\t\t\tWOLFE\n\tThey're on their way ...\n\t\t(consulting his map)\n\tThere's a gook village half a klik downriver, \n\tBattalion wants us to move in and search it ASAP, \n\tsomething's going on ... where's Barnes?\n\nINT. NVA BUNKER - SANDERSON POSITION - DAY\n\nBarnes is still there in the wrecked bunker, squatting there \nstaring as if his mind has disconnected for a moment.  He reaches \nup, touches his scars.  The look on his face suggests he is \ndeeply wronged by this tragedy, that he is taking it very \npersonally.\n\nEXT. NVA BUNKER - MAIN POSITION - DAY\n\nChris watches him from outside the bunker, awed.\n\nBarnes notices Chris watching him, takes a breath, stands.\n\n\t\t\tBARNES\n\tYou gonna sit there and play with yourself Taylor or \n\tyou gonna be part of my war ... Awright, saddle up, \n\tlet's go - Tubbs you got point.\n\nThe men moving into jungle formation, silently.\n\nChris walking over into line, stops for a moment - noticing a \nfreshly-severed eyeball partially buried in dirt, staring up at \nhim.  He turns away, sickened.\n\nEXT. NVA BUNKER COMPLEX - MAIN POSITION - DAY\n\n\t\t\tO'NEILL\n\tWhere's Manny?\n\n\t\t\tWARREN\n\tManny! ... Hey Buchanan.\n\nThere is no answer.  The men in the platoon start to look at each \nother, sensing more trouble.\n\nElias heads into the bush after him.  Barnes watches him go.\n\nFrancis, his friend, and Tubbs and King follow.\n\n\t\t\tFRANCIS\n\tHey man whatcha doing ... where you at?  Get your \n\tblack ass back in here!\n\nEXT. NVA BUNKER COMPLEX - MANNY'S POSITION - DAY\n\nOut on the flank position, where he once stood, Elias walks out, \nlooks.  The jungle is silent once again.  Francis, Tubbs, King \nfollow.  The others - Barnes, Lt.Wolfe, Warren, Chris, Rhah ...\n\n\t\t\tFRANCIS AND OTHERS\n\t\t(whispering loudly)\n\tManny? ... Manny?\n\nTheir voices trailing off.  Bird cries come back.\n\nElias combing the ground for clues ... nothing.\n\nChris looking on, can't believe it, none of them can, a \ncollective chill running through the platoon.\n\nEXT. JUNGLE - DAY\n\nThe Platoon moving downslope in the Jungle, their faces grim, \nquiet, deadly.  King is on point.\n\n\t\t\tCHRIS (V.O.)\n\tWe had to get to the village before dark so we left \n\tElias with some men to keep looking and to wait for \n\tthe engineers ... But it was King who found him ... \n\tabout 1000 yards downriver, not far from the village \n\t- It was the end of the mystery.\n\nA moving shot approaching Manny.  He's trussed with rope, arms \nbehind his back.  Throat cut, eyes startled open, mouth shaped in \na scream of terror.\n\nBarnes, the other men looking ... Chris.  Barnes says it for \neveryone, 'The motherfuckers ...'\n\nEXT. VILLAGE - TRAIL - DAY\n\nThey come up out of the jungle onto the side of a CART TRAIL, \nwhere a tiny village overlooks the river.  The VILLAGE is poor, a \nseries of thatched hutches made of C-ration cardboard and \naluminum beer can sidings, faint whiffs of smoke coming from cook \nfires.  Pigs and dogs wander about.\n\nAn OLD VILLAGER watches them pass from his tillable plot, smoking \na cigarette, one leg wrapped around his hoe, resting, no \nexpression.\n\n\t\t\tCHRIS (V.O.)\n\t... the village, which had stood for maybe a thousand \n\tyears, didn't know we were coming that day.  If they \n\thad they would have run ... Barnes was at the eye of \n\tour rage - and through him, our Captain Ahab - we \n\twould set things right again.  That day we loved him \n\t...\n\nA pig loiters along the trail, rooting.\n\nBunny coming up on it with a smile.\n\n\t\t\tBUNNY\n\tHey pig, pig - come here, pig, pig.\n\nThe pig grunts.  Bunny leveling his shotgun, fires point blank.  \nA horrible squeal.\n\nChris, directly behind him, looks disgusted.\n\nEXT. VILLAGE - DAY\n\nTony suddenly points, excited, calls to Barnes.\n\n\t\t\tTONY\n\tThere goes one!\n\nTheir POV - a young VILLAGER fleeing down the slope.\n\nBarnes doesn't hesitate, nails him with a short volley of well-\nplaced shots.\n\n\t\t\tBARNES\n\t\t(to Tony)\n\tCheck him out.\n\nHe turns back into the village.\n\nEXT. VILLAGE - DAY\n\nTroops fanning out over the village, some TWO DOZEN VILLAGERS \nscattering to collect their children, dogs barking.\n\n\t\t\tSGTS.O'NEIL AND WARREN\n\tGet em out!  Get em out!\n\nEXT. VILLAGE TUNNEL - DAY\n\nIn another part of the village, Barnes hovers over a hole leading \ninto some kind of tunnel.\n\n\t\t\tBARNES\n\tGet out of there you fuckheads move!  Move!\n\nFires a warning shot.  Three VILLAGERS climbing out of the spider \nhole, arms raised, but not showing any emotion.  Barnes turning \nto his radioman Hoyt and Big Harold accompanying.\n\n\t\t\tBARNES (CONT'D)\n\t\t(to Harold)\n\tPut'em in the pig pen.\n\t\t(to Hoyt)\n\tThere's more down there.  Gimme your Willy Pete.\n\nHoyt, with reluctance in his eyes, hands over a specially shaped \ngrenade.\n\nBarnes stands over the hole, the grenade in hand.\n\nThe three VILLAGERS who just came out of the hole, yell from the \ndistance, to others still in the tunnel, pleading with them to \ncome out.\n\n\t\t\tBARNES (CONT'D)\n\tFIRE IN THE HOLE!\n\nBarnes throws the phosphorus in.  A muted EXPLOSION.  Then \nsizzling acidic fumes.  Frying sounds.  A hideous scream from \nsomewhere deep in the hole.\n\nHoyt, watching, is sickened.  Barnes businesslike.\n\nThe Villagers, in grief, howl and tear at their faces.\n\n\t\t\tFU SHENG\n\t\t(hustling up to Barnes)\n\tSarge, we found some shit!\n\nBarnes going with him.\n\nEXT. VILLAGE - OUTSIDE HUTCH - DAY\n\nThe sun is sittin there hot and high in the sky.\n\nChris, strangling in heat, a demented look on his face, staggers \ninto a hutch with Francis.\n\nINT. HUTCH - VILLAGE - DAY\n\nThreadbare, poor, a typical Buddhist shrine in the corner, motes \nof light crisscross through the poor matting and c-ration sides.\n\nChris edges over, pries up a floorboard, flips it over, scared.\n\nThere's a tunnel inside.  A long dark dangerous hole.\n\n\t\t\tCHRIS\n\tLa Dai! La Dai! GET THE FUCK OUTTA THERE!\n\n\t\t\tFRANCIS\n\tHey take it easy man.  They're scared.\n\n\t\t\tCHRIS\n\tThey're scared?  What about me!  I'm sick of this \n\tshit man, I\"m sick of this shit!  They don't want us \n\there!  Who do you think they're fighting for!  GET \n\tOUTTA THERE!\n\nFrancis doesn't recognize him in his rage.  Bunny now coming in, \nfollowed by O'Neill, drawn by the shouting.\n\nEXT. VILLAGE - WEAPONS CACHE - DAY\n\nBarnes stares down at a WEAPONS CACHE buried cleverly underneath \nthe ruce urns.  Ace, Fu Sheng, Sgt.Warren, Lt.Wolfe, others, are \ndigging it out.  It's in white plastic wrappings - a load of AK-\n47's, rockets, grenades, claymores, carbines, flares, NVA \nuniforms.  A real find.\n\n\t\t\tSGT. WARREN\n\t\t(to Barnes)\n\t... and over here there's enough rice to feed a whole \n\tfuckin' regiment ...\n\nBarnes walking with him over to an undercover rice silo being dug \nout by Tubbs and Junior.  Barnes looks it over.\n\n\t\t\tBARNES\n\t\t(to Warren)\n\t... bring the honcho over here.\n\t\t(to Tubb and Junior)\n\tBurn it.\n\nINT. HUTCH - VILLAGE - DAY\n\nAn Old Woman and her Son, a young man with one leg, throw up \ntheir hands, climbing out of the hole with stupid confused looks \nas Chris, shaking with his own sort of confusion and rage, cuffs \nthem, hustling them out.  The Young Man uses a pair of crutches \nfor his blown-off limb, hobbling like a mangy three-legged dog.\n\n\t\t\tBUNNY\n\tHey look at this! Ma and Pa Kettle here.  Look at \nthem - greasy gook motherfuckers!\n\n\t\t\tCHRIS\n\tGet up out of there! ... You see I didn't wanna hurt \n\tyou.  Why didn't you come out, when I said so hunh! \n\tWhy? WHY! WHY? DON'T YOU LISTEN ... WHAT ARE YOU \n\tSMILING AT HUNH! FUCKING ASSHOLES!\n\nThe couple, hands raised, muttering things in Vietnamese, don't \nunderstand a word, shaking their heads stupidly and smiling that \nimpassive Oriental smile which sends Chris into a rage only he \ncan understand.\n\nHis finger closes on the trigger of his 16.\n\nFrancis, the baby-faced black, looks nervously, sensing the \ndanger ...  Bunny amused, drawn in by Chris.  O'Neill watches \npassively from the lip of the hutch.\n\nThe Young Man continues to grin, not seeming to realize the \ndegree of danger he's in, which is what Chris wants - a token \nsign of acquiescence.  There is also the added element of showing \noff his manhood in front of an audience now.\n\n\t\t\tBUNNY\n\tDo 'em man, do 'em.\n\nChris.  The trigger.  He pulls.  But he can't quite bring himself \nto kill.  The bullets exploding in the dirt at the edges of the \nyoung man's foot.\n\n\t\t\tCHRIS\n\t\t(demonic)\n\tDANCE YOU ONE-LEGGED MOTHERFUCKER, DANCE!!!\n\nThe Young Man hops up and down in a reflex fear of the sounds of \nthe bullets as they thud into the dirt.  Yet his eyes remain \nfixed on Chris in wonderment.\n\nChris, firing out the magazine, seems to expend his bloodlust.  \nHe ceases, noticing - for the first time - the eyes of the Young \nMan.  They aren't stupid - nor fearful - but filled with \nresignation and despair - a despair that Chris, in disgust of \nhimself, recognizes.\n\nChris lowers the rifle, silent.\n\nThe Young Man's impassive face shines now with tears.  That sad \nyoung look - as if death itself would've been a release.  Chris \nturns his eyes away, an awkward sense of shame.\n\n\t\t\tFRANCIS\n\t\t(leaves)\n\tLet's get out of here man.\n\nBut Bunny takes up the slack, moves forward on the young man.\n\n\t\t\tBUNNY\n\t\t(to Chris)\n\tYou chickenshit man, they're laughing at you, look at \n\tthem faces.  That's the way a gook laughs.\n\nThe Young Man nodding affable to Bunny and mumbling ingratiating \nwords in Vietnamese.\n\n\t\t\tBUNNY (CONT'D)\n\tYeah sure you are, you're real sorry ain't you.  \n\tYou're just crying out your hearts about Sandy and \n\tSal and Manny - they're laughing at us!  Their family \n\tis out there in the fucking bush blowing us away and \n\tthey're laughing at us!\n\n\t\t\tO'NEILL\n\t\t(checking out the hutch)\n\tForget it will ya, let's go ...\n\nChris standing there, watching, sensing something awful is going \nto come and unable to do anything about it.  It comes - suddenly \nand without warning.  Bunny is looking at O'Neill, the Vietnamese \ncouple are muttering something.  In one fluid move, Bunny swivels \nand with unbelievable savagery clubs the young one-legged man in \nthe side of the head with the butt of his 16.\n\n\t\t\tO'NEILL (CONT'D)\n\t\t(stunned)\n\n\tHey what are you doing!\n\n\t\t\tBUNNY\n\tFucker!\n\nThe young man is groaning on the floor of the hutch.  Bunny \nsmashes him - again and again.\n\n\t\t\tBUNNY (CONT'D)\n\tThat's for Sandy!  And this is for Sal!  And this is \n\tfor fucking Manny!  This is for me!\n\nChris watches, horrified.  Never in his life has he seen \nsomething so horrifying as this.  And yet he does nothing.  He is \npart of it.\n\n\t\t\tBUNNY (CONT'D)\n\t\t(stepping back, examines what's left of the head, amazed)\n\tWow!  You see his fucking head come apart?  Look at \n\tthat ... I never seen brains like dat before.  Jesus \n\tfucking Christ ...\n\nThe Old Lady is shrieking, hovering over the body of her son.  \nBunny studying her.\n\n\t\t\tBUNNY (CONT'D)\n\tBetcha the old bitch runs the whole show.  Probably \n\thelped cut Manny's throat.  Probably cut my balls off \n\tif she could.\n\t\t(to Chris)\n\tCome on, man, let's do her.\n\nShe cowers from him.  Chris steps back, horrified.  As is \nO'Neill, more puzzled than horrified.\n\n\t\t\tBUNNY (CONT'D)\n\t\t(hitting her again)\n\tLet's zap all these motherfuckers!  Let's do the \n\twhole village!\n\nHe backs out of the hutch, scared.  Evidently Bunny is \ntemporarily insane.  But he spots O'Neill, yells at him.\n\n\t\t\tBUNNY (CONT'D)\n\tGET BACK HERE YOU FUCKING COWARD O'NEILL.  THIS IS \n\tFOR SANDY ... THIS IS FOR SANDY MAN! AND SAL! AND \n\tMANNY!\n\nAs he clubs her to death.\n\nOn Chris' face, blood and brain tissue flying up into it.\n\nEXT. CENTRAL AREA - VILLAGE - DAY\n\nA tiny knot of men are ringed around Barnes who is questioning a \nsturdy-looking man who is the VILLAGE CHIEF.  He has been \nstripped of his shirt, scars all over his body, scared.  He has \nhis ID papers out, trembling, showing them to Lerner who speaks \nsome pidgen Vietnamese.\n\n\t\t\tBARNES\n\tWhere'd he get these wounds?\n\nLerner translates, the man talking back.\n\n\t\t\tLERNER\n\tHe says he was hit in a bombing raid.\n\n\t\t\tTONY\n\tHe's a dink fosure.\n\n\t\t\tBARNES\n\tAsk him what the weapons are doing here?\n\n\t\t\tLERNER\n\tHe says they had no choice.  The NVA killed the old \n\thoncho when he said no.  He says the rice is theirs.\n\n\t\t\tBARNES\n\tBullshit ... who the hell was the dink we just nailed \n\ton the riverbank?\n\nChris and O'Neill come up, watch.  Others coming from different \nplaces - sensing the narrowing drama.  But half the platoon is \nstill at work in the village.  We hear shouts, grenade \nexplosions, occasionally gunfire.\n\n\t\t\tLERNER\n\t... He says he doesn't know, NVA haven't been around \n\tin a couple of months.  Maybe it was a scout or ...\n\nThe men around Barnes grumble.\n\n\t\t\tBARNES\n\tYeah sure it was.  What about all that fucking rice \n\tand the weapons ... who they for?\n\t\t(looking at the Village Chief)\n\tCocksucker knows what I'm saying ... don't you Pop?\n\t\t(a blank look)\n\n\t\t\tACE\n\tYou're goddamn right he does!\n\nLerner translating.  The Village Chief's WIFE is now on the \nscene, a middle-aged woman with angry features, yelling at Lerner \ntrying to answer for her husband, a high-pitched barrage of \nindignant words directed mostly at Barnes, and interspersed with \nthe spitting of her betel nuts on the ground.\n\nThe Village Chief trying to talk her down.  But things are \ndefinitely getting out of control.  And the heat from the sun is \nonly aggravating the situation, pounding down on the actors in \nthe drama, their fatigues soaked in sweat and anger.\n\n\t\t\tLERNER\n\t\t(finally)\n\tHe swears he doesn't know anything!  He hates the NVA \n\tbut they come when they want and ...\n\n\t\t\tJUNIOR\n\tHe's lying through his teeth!\n\n\t\t\tTONY\n\tWaste the fucker, then see who talks.\n\n\t\t\tBARNES\n\tWhat's the bitch saying?\n\n\t\t\tLERNER\n\t\t(overwhelmed)\n\tShe's going on, I don't know - why are we shooting \n\tthe pigs, they're farmers ... they got to make a \n\tliving, all that crap ...\n\nThe Woman is still ranting when Barnes turns to her, quite \ncasually levels his M-16, and puts a bullet in her head.  She \ngoes down as if pole-axed.\n\nA stunned pause.  The Chief looking at his wife.  The Villagers \nin background reacting.\n\nWolfe looking ... Chris looking, shocked.  Doc, possibly the \nstraightest of them all, very uncomfortable.  They are all \nshocked insome way, but do nothing against the power of Banres.  \nBarnes walks over to the pig pen with the other Villagers, very \ncasually, confronts them.\n\n\t\t\tBARNES\n\t\t(to Lerner)\n\tTell him he talks or I'm gonna waste more of 'em.\n\nLerner shaken up, muttering to the Village Chief who is in shock, \nkneeling next to the body of his wife, muttering in a high whine \nof pain.\n\n\t\t\tBARNES (CONT'D)\n\tGo ahead, Lerner, ask him.\n\nA group of Villagers huddle to one side.\n\nLerner, shaken, is yelling at all of them, demanding an answer.\n\n\t\t\tLERNER\n\tThey don't know Sarge, they don't know!\n\t\t(half believes it)\n\nBarnes turns his attention on the other villagers, his intentions \napparent.  Everybody feels them.  They're next.  Barnes is \nunperturbed, very much in command of the situation, no rage, no \nemotions expressed.\n\nChris has never seen such a thing in his life - but can't react.  \nCan't stop it, just watches it like he's not quite there.\n\nThe same goes for Lieutenant Wolfe, for all of them.  The very \noutrageousness of Barns' killing seems to quell all protest.\n\n\t\t\tACE\n\t\t(sensing the impending massacre)\n\tHey Sarge can we get in on this.\n\nTony advances, the hairy Italian kid from Boston.\n\n\t\t\tTONY\n\tLet's go all the way, let's go for it!  Let's do the \n\twhole fucking village.  Come on, Sarge.\n\nChris' eyes ... Rodriguez next to him, is neutral but willing.\n\nFrancis is hesitant.\n\nFu Sheng and Junior are ready to go for it.  Lt.Wolfe is \npowerless, frozen.\n\nSgt.Warren stepping up.  The massacre is just about to break.\n\nThe Villagers know it, kneel in prayer, mutter.\n\nBarnes suddenly grabs and drags a young 19 year-old Woman, the \nVillage Chief's daughter, across the pen, throws her down on her \nknees, in front of the stunned Village Chief.  She's screaming.\n\n\t\t\tBARNES\n\tThis his daughter, right?\n\nLerner nods.  Barnes pulls his .45, puts it alongside her head.\n\n\t\t\tBARNES (CONT'D)\n\t\t(to Village Chief)\n\tYou lie ... You Vee Cee ... I caca ado Vee Cee!\n\nHe chambers the .45, the Woman begging Barnes for her life, \ncradling his knees.  He sticks the gun down above her skull.\n\nChris wanting to cry out, to do something - but can't!\n\nA FIGURE suddenly flares out in the sun, advancing on them.  It \nis Elias.\n\n\t\t\tELIAS\n\tBARNES!!\n\nBarnes looks around.  They all look around.\n\nElias walks right up to him, followed by his men - King, Rhah, \nCrawford, others from the rear party.  He looks around.  The \ncorpse of the Wife ... the Young Daughter sobbing.\n\n\t\t\tELIAS (CONT'D)\n\tWHAT THE FUCK YOU DOING!\n\n\t\t\tBARNES\n\t\t(pissed)\n\tStay out of this Elias.  This ain't your show.\n\n\t\t\tELIAS\n\tYOU AIN'T A FIRING SQUAD, YOU PIECE OF SHIT!!\n\nThe stock of his rifle swings up fast and hard smacking Barnes \nfull in the face, breaking two teeth.\n\nBarnes staggers back, hurt, bleeding.  Elias is on him like a \nleopard.  Battering him with his fists.\n\nThey struggle in the dust, two titans, their faces equally \nconsumed with rage, clawing, spitting, punching, kicking, \npounding each other's skulls in the dirt.  A dust storm swirls \naround them, the men closing around like excited apes at a \nbloodfeast.\n\nMost of the men seem to be pulling for Barnes - Chris just \nwatching neutral.\n\n\t\t\tLIEUTENANT WOLFE\n\tBREAK IT UP!  ELIAS!  BARNES!\n\nBut they rool on, smashing each other's faces in.  Both quick, \nfast, agile, mean fighters.  Sgts.O'Neill and Warren drag them \napart.\n\n\t\t\tBARNES\n\tYou're dead, you're fucking dead Elias!\n\n\t\t\tELIAS\n\tYOU - you're going to fuckin' jail, buddy, you ain't \n\tgetting away with this one!!!!!\n\n\t\t\tWOLFE\n\tAll right!  All right!  All right!!!  NOW BREAK IT \n\tUP.  LET'S GO ...\n\nThey compose themselves, the Villagers looking on, grieving over \ntheir loss.\n\n\t\t\tWOLFE (CONT'D)\n\tAlright, Six says torch this place!  Blow the weapons \n\tin place.  Round up all suspected Vee Cees and shake \n\tit up!  We ain't got much light left.\n\n\t\t\tELIAS\n\t\t(to Wolfe)\n\tWhy the fuck didn't you do something Lieutenant!\n\n\t\t\tWOLFE\n\tWhat are you talking about!\n\t\t(turns away, goes about his business)\n\n\t\t\tELIAS\n\t\t(spins him around)\n\tYou know what I'm talking about!\n\n\t\t\tWOLFE\n\tNo I don't.  I don't know what the fuck you're \n\ttalking about, Elias!\n\t\t(goes)\n\nWho wants to be reminded?  A silence of shame.  The Men moving \naway, Warren, Ace, Tony, Rodriguez, Barnes looking back once, a \ncold glare.\n\nThe Village Chief is a broken-looking man, huddled over his \nwife's body.\n\nElias stands there, frustrated.\n\nChris glances at him, moves out.\n\nEXT. SMALL VILLAGE - DAY\n\nA zippo cigarette lighter with the engraved initials: 'From Mai \nlin to my Bunny Boy'.  It sparks a thick flare as Bunny lights \nthe dry straw on the roof of the Hutch where he killed the Old \nWoman and Young Boy.\n\nTheir legs sticking out at the threshold.  The hooch burning \nfast, aided by the strong sun.\n\nBunny watches with awe.\n\nEXT. SMALL VILLAGE - DAY\n\nSgt.Warren and Rodriguez lighting another hooch on fire.\n\nEXT. VILLAGE RICE STORE - DAY\n\nFu Sheng yelling 'FIRE IN THE HOLE!' throws white phosphorus into \nthe rice stores.\n\nEXT. VILLAGE - WEAPONS CACHE - DAY\n\nBarnes and Huffmeister, a big German kid from Texas, are laying \nthe cord to blow the weapons cache.\n\nEXT. SMALL VILLAGE - WELL - DAY\n\nAdams and Parker are poisoning the well with a white phosphorus \ngrenade: 'FIRE IN THE HOLE!'\n\nEXT. SMALL VILLAGE - DAY\n\nWolfe, Ace, Tubbs, Warren, Rogriguez rope the DOZEN SUSPECTED \nVILLAGERS together to take them back for questioning.\n\nElias watches the Villagers mourn their losses.  In the \nbackground, explosions, hooches popping with flames, the yells of \nthe violations of the Village winding down.\n\nEXT. SMALL VILLAGE - DAY\n\nChris wanders through this wreckage in the sun, like a dazed \nvisitor from another planet, not believing it.  He sees \nsomething, goes towards it - knows what it is.\n\nEXT. VILLAGE - EDGE OF WOODLINE - DAY\n\nHidden at the edge of the woodline, King hands back a bowl of \ngrass to Rhah, the chief head.  They're puffing away.\n\n\t\t\tKING\n\tWhew! - where that come from?\n\n\t\t\tRHAH\n\tFound it.  Growing in a garden.\n\n\t\t\tKING\n\t\t(smokes)\n\tSheeit, beats burning hutches anyway ...\n\nThey meditatively look out at the Village - burning hutches \nsending up spirals of smoke.  Shouts.  Shots.  Chaos.\n\n\t\t\tRHAH\n\tYeah - stoned's the way to be ...\n\nEXT. VILLAGE - DITCH - DAY\n\nIn a ditch running alongside the Village, partially concealed by \nfoliage and anthills, Tony, Morehouse, and the ubiquitous Bunny \nhave a 12-YEAR-OLD VIETNAMESE GIRL pinned to the ground, gagged \nand squirming, naked.  They are fucking her to death.  Junior \nlooks on, both curious and disgusted, but doesn't take part.\n\n\t\t\tTONY\n\tTake her up the ass ...\n\nAs they roll her over, like excited dogs in heat.\n\nChris, coming up, sees their heads dipping up and down on the \nother side of the anthill, knows what they're doing.  He makes a \nconscious decision to do something.  He runs over.\n\n\t\t\tCHRIS\n\tLET HER GO!  YOU HEAR ME!  YOU ASSHOLE!  LET HER GO!\n\nHe strides right into them, shoves them off hard.  The girl is in \ntears.\n\n\t\t\tTONY\n\tWhat the fuck you want - she's a dink.\n\n\t\t\tCHRIS\n\tNO - YOU STUPID FUCK ... DON'T ... DON'T ... YOU TOO \n\tBUNNY.  MOREHOUSE.  OFF!  NO!  DON'T ... DON'T!\n\nHe seems disconnected, dazed by the sun, like he's talking to \ndogs - loud, repetitive words coming out of an anger he can \nbarely control, trying to restore some sanity to a world gone \ntotally nuts today.  Don't they understand?  Don'tthey have any \nsense of a mind?  Any kind of decency?\n\nThe Men looking at him as if he's the one who's gone nuts, not \nthem.  Bunny looking at Morehouse looking at Tony looking at \nJunior.  The irony is lost on them, as Chris pushes through to \nhelp the poor girl put her scanty clothes back on.\n\n\t\t\tCHRIS (CONT'D)\n\t\t(to the girl)\n\tIt's okay ... it's okay ...\n\nElias appears behind Bunny and the others, sees what's happened.  \nHe signals them to move out.\n\n\t\t\tELIAS\n\tGet outta here.\n\nThe men grumble and slink off quietly.  Elias watching as...\n\nChris helps her to her feet, wounded in the intestines, she can \nbarely stand, blood saoking in her nether regions.  Chris slings \nher up as gently as he can and carries her.\n\n\t\t\tCHRIS\n\t\t(as if to himself)\n\tIt's okay, it's okay ...\n\nEXT. VILLAGE - PIG PEN - DAY\n\nNear the pig pen, a DOZEN SUSPECTS are being led away on ropes by \nTubbs, Warren, Rodriguez.  The others left behind look back at \ntheir village in ruins, homes burning, livestock dead or \nscattered, belongings thrown and broken in the dirt.  BABIES \nwail, the adults squat there on their heels watching with \nabsolutely no trace of outward emotion.\n\nPast this Bosch-like canvas, Chris - carrying the girl - walks \ndazed by the horrors of this long afternoon.\n\nEXT. VILLAGE TRAIL - DAY\n\nThe soldiers depart the village.  A huge EXPLOSION now rocks the \nearth and sends a spray of smoke into the blue sky as the weapons \ncache explodes in stages that sound like the end of the world.\n\nEXT. PERIMETER #2 - JUNGLE - LATE AFTERNOON DUSK\n\nThe Company is digging into another overnight perimeter on a \nridge with a view of the Valley where the Village was.  C-Ration \nfires all around the perimeter.\n\nEXT. COMPANY CP - DUSK -- MORNING\n\nAt the Company,l Elias, Captain Harris, Barnes, Lt.Wolfe are \nhuddled.  Close on Harris, looking from face to face, assuming a \njudicial attitude.\n\n\t\t\tCAPTAIN HARRIS\n\t... and you Lieutenant?\n\n\t\t\tLIEUTENANT WOLFE\n\tI didn't see anything sir.\n\n\t\t\tELIAS\n\tI did.\n\n\t\t\tLIEUTENANT WOLFE\n\tThat dink was reported to me as NVA sir by Sergeant \n\tBarnes.  Sergeant Barnes.\n\nSquirreling out of any responsibility.\n\n\t\t\tELIAS\n\tMy report sir, will include Lt.Wolfe as being witness \n\tto the shooting ...\n\n\t\t\tCAPTAIN HARRIS\n\tAll right, Elias.  Sergeant Barnes, I want a report \n\tfrom you ...\n\n\t\t\tBARNES\n\tYou got it sir - and I can throw in plenty of eye-\n\twitnesses if you want sir ...\n\n\t\t\tHARRIS\n\tNot now.  We'll get into this when we get back to \n\tbase camp.  Right now I need every man in the field, \n\tI want your guys to stick together ... Elias?  \n\tBarnes? ... You hear me?  This is no time for \n\tfighting with each other.\n\t\t(pause, they nod)\n\tTomorrow we're going back into that bunker complex - \n\tfrom the East.\n\t\t(continuing)\n\tFirst Platoon will lead ... Brigade thinks they might \n\tbe back there tomorrow.  That's all ... Get some \n\trest.\n\t\t(turns away)\n\nBarnes, Elias eye each other and move off.\n\nEXT. PERIMETER #2 - DUSK\n\nWolfe walks alongside Barnes.\n\n\t\t\tWOLFE\n\tDon't worry about it Sergeant, he won't be able to \n\tprove a thing, he's a troublemaker but ...\n\nBarnes is obviously worried, although he doesn't let on.\n\n\t\t\tBARNES\n\tElias' a waterwalker ... like them politicians in \n\tWashington.  Want to fight their war with one hand \n\ttied round their balls.  Ain't no time or need for a \n\tcourtroom out here ...\n\nWolfe leaves him as Barnes turns into his foxhole where Bunny and \nO'Neill await him anxiously.\n\n\t\t\tO'NEILL\n\tHow'd it go.\n\nBanres shrugs.\n\n\t\t\tBUNNY\n\tThataway Sarge, fuckin' Elias man, fuckin' squeal \n\tthat's what he is, gonna get everybody in the platoon \n\tin shit.  Somebody oughta fix his ass ...\n\nBarnes fixing his coffee.\n\n\t\t\tO'NEILL\n\t\t(worried)\n\tGonna be an investigation or something Bob?\n\nBarnes says nothing, a cryptic look.\n\nO'Neill worried, Bunny, taking his cue from Barnes, slaps him on \nthe back.\n\n\t\t\tBUNNY\n\tYa worry too much O'Neill ...\n\nEXT. PERIMETER #2 - CHRIS' POSITION - DUSK\n\nElsewhere on the perimeter, Chris is digging out a foxhole with \nRhah, as King and Lerner prepare the C's for dinner.\n\n\t\t\tRHAH\n\tI know Barnes six months and I'll tell ya something - \n\tthat man is MEAN, red in his soul like a dick on a \n\tdog.\n\n\t\t\tKING\n\tBarnes gets killed, his jaws'd go on clacking ...\n\n\t\t\tCHRIS\n\tWhere's he form?\n\n\t\t\tRHAH\n\tBarnes comes from Hell.\n\n\t\t\tLERNER\n\tTennessee someplace.  Hill country.\n\n\t\t\tRHAH\n\tBarnes took a bullet right there.  At Ia Drang Valley \n...\n\t\t(points to his forehead)\n\tAnd the cocksucker SURVIVED - that's BAAAD man.  \n\tThat's his high, baby.  High on WAR!\n\nHis eyes flare out dramamtically.  Chris, enthralled in spite of \nhimself.\n\n\t\t\tKING\n\tHe done a year in Japan in the hospital, then when he \n\tgets out, the first thing he done is re-up.  Four \n\tyears he been in the field ...\n\n\t\t\tRHAH\n\t... and you know how many times he done been shot?\n\t\t(Chris shakes his head)\n\tSeven times!\n\t\t(with his fingers)\n\tSeven.\n\n\t\t\tCHRIS\n\tAnd he still wanted to come back?\n\n\t\t\tLERNER\n\tDoes a pee wee wanna take a wee wee?\n\n\t\t\tRHAH\n\tThe Good Lord works his revenge in strange ways.\n\n\t\t\tKING\n\tYeah, you done said it.  Revenge on US.\n\n\t\t\tCHRIS\n\tDoes he have a metal plate in his head?\n\n\t\t\tRHAH\n\t\t(smiles)\n\tYou mean he's crazy?  No more crazy'n the rest of us \n\tbeen out in the bush too long.\n\n\t\t\tLERNER\n\tWell he ain't normal that's fosure.\n\n\t\t\tRHAH\n\tThat's what he is ... Baaaa!\n\nHis hand flashes forward in front of Chris.  'HATE' is written \nacross the left hand knuckles in a sloppy, purplish-black tatoo.  \nChris looking at it.\n\n\t\t\tRHAH (CONT'D)\n\t... and he's FILLED with it.  He's roaming these \n\tjungles looking for little yellow devils to kill.  \n\tRemember the Devil does God's work too.\n\t\t(pause)\n\t... and this here's Elias ... Baaaa!\n\nThe other knuckle is out - 'LOVE' tattooed across it.  Rhah \nsmiles his crazy smil.  Chris stares fascinated at the two \nknuckles side by side.  A moment on his face.\n\n\t\t\tKING\n\tLove, yeah!\n\n\t\t\tLERNER\n\t\t(makes a cuckoo sign)\n\tHere we go again with the crazy preacher stuff.  Rhah \n\tseen too many movies.\n\n\t\t\tRHAH\n\tBaaa, got no time to go to the movies.  Love and Hate \n\ttoo busy fighting for possession of my soul.\n\n\t\t\tCHRIS\n\tWhere's Elias come from?\n\n\t\t\tRHAH\n\t\t(interjecting)\n\t'Lias come naturally.\n\n\t\t\tLERNER\n\t... don't know.  Done some time.  Heard he worked the \n\toil wells in Oklahoma, made some bread and washed up \n\tin El Lay.\n\n\t\t\tKING\n\tYeah, get married to some crazy El Lay bitch, an \n\tactress or somethin', she blew all his bread - LSD, \n\tgurus, all that California shit, and then she turns \n\thim into the cops on a drug rap.\n\n\t\t\tRHAH\n\tNot the only man to meet his Jezebel either.\n\n\t\t\tKING\n\tSo he got a reduced and come over here.  Nam's his \n\tfreedom man, Nam's his pussy.  Three years he been \n\there.\n\n\t\t\tCHRIS\n\tThree years, Jesus, he's crazy as Barnes ...\n\n\t\t\tKING\n\tWell sometimes a man jes don' wanna go back.  How you \n\tgonna talk to civilians man?  People back in the \n\tworld just don't give a shit, y'know what I mean, to \n\tthem you're a fuckin' animal is all -\n\n\t\t\tLERNER\n\t\t(to Chris)\n\tI was home on leave y'know and everybody's just \n\tworried 'bout making money, everybody's out for \n\tthemselves, they don't even want to talk about it \n\tman, it's like the fucking Twilight Zone back there - \n\tyou wouldn't even KNOW there's a war on here.  My \n\tsister says to me why you have to go there like I \n\tstarted this ...\n\n\t\t\tRHAH\n\tBaaaa!  Fuck it, they sold us out - so what!  What'd \n\tyou'all expect?  Civilian life is phoney BULLSHIT \n\tman.  They're ROBOTS man - watchin' dopey television \n\tand drivin' dopey cars, and they fuck up, nobody \n\tdies.  That's all right, you keep fuckin' up, \n\tpoliticians keep lyin'.  Cause it don't really \n\tmatter.  Don't mean shit.  So what!  Whatcha want - a \n\tparade!  Fuck that too!  No war time no grunt never \n\tgot no respect.  Till he was dead - and even THEN!  \n\tYou're fighting for YOURSELF man!  You're fighting \n\tfor your SOUL, dat's all.  Remember dat.  And it's \n\tsome goddamn battle too - if you'se a man, wrestle \n\twith that angel ...\n\t\t(swings his entrenching tool in a rhythmic chain-gang style)\n\t... Love and Hate - the whole shitbang show, that's \n\tthe story then and now and it ain't hardly gonna \n\tchange ...\n\nEXT. PERIMETER #2 - JUNGLE - NIGHT\n\nThe stars are out in magnificent splendor.  A breeze rustling \nthrough the trees.\n\nEXT. PERIMETER #2 - CHRIS' POSITION - NIGHT\n\nChris is turning in his sleep, perturbed, writhing.  The \nwhispering is more and more urgent.  Death is all around.  He \nshoots up out of his poncho liner as if shot, stunned.  Scared.  \nLooks around.  All is quiet.  Men sleeping.\n\nElias is huddled in his poncho on guard next to his foxhole.  \nChris joins him, sitting, wiping the sleep from his eyes.\n\n\t\t\tCHRIS\n\t... I can't sleep, why don't you get some sack time.\n\n\t\t\tELIAS\n\t... don't feel like it either.\n\n\t\t\tCHRIS\n\t... beautiful night.\n\n\t\t\tELIAS\n\tYeah.  I love this place at night.  The stars ... \n\tthere's no right or wrong in them, they're just \n\tthere.\n\n\t\t\tCHRIS\n\tThat's a nice way of putting it.\n\nElias cuffs a joint, keeping its glow hidden in the dark.  A \npause, both of them meditative.\n\n\t\t\tCHRIS (CONT'D)\n\tBarnes got it in for you, don't he?\n\n\t\t\tELIAS\n\t\t(philosophically)\n\tBarnes believes in what he's doing.\n\n\t\t\tCHRIS\n\tAnd you, do you believe?\n\n\t\t\tELIAS\n\tIn '65 - yeah.  Now ...\n\t\t(pause)\n\tNo.  What happened today's just the beginning.  We're \n\tgonna lose this war ...\n\n\t\t\tCHRIS\n\t\t(surprised)\n\tYou really think so ... us?\n\nElias' eyes seem to go to some inner place, his passion surging.\n\n\t\t\tELIAS\n\t... we been kicking other people's asses so long I \n\tguess it's time we got our own kicked.  The only \n\tdecent thing I can see coming out of here are the \n\tsurvivors - hundreds of thousands of guys like you \n\tTaylor going back to every little town in the country \n\tknowing something about what it's like to take a life \n\tand what that can do to a person's soul - twist it \n\tlike Barnes and Bunny and make 'em sick inside and if \n\tyou got any brains you gonna fight it the rest of \n\tyour life cause it's cheap, killing is cheap, the \n\tcheapest thing I know and when some drunk like \n\tO'Neill starts glorifying it, you're gonna puke all \n\tover him and when the politicians start selling you a \n\tused war all over again, you and your generation \n\tgonna say go fuck yourself 'cause you know, you've \n\tseen it, and when you know it, deep down there ...\n\nHe plants his fist in Chris' gut, expelling his breath such is \nthe force of the blow - like a power passed between them.\n\n\t\t\tELIAS (CONT'D)\n\t... you know it till you die ... that's why the \n\tsurvivors remember.  'Cause the dead don't let em \n\tforget.\n\nHis eyes blazing, reliving the deaths in the village, licking the \nwounds for the platoon, mourning the failure of its heroism.  \nChris looking at him, a little awed by his intensity.  Elias \nlooks away, embarrassed that he has sermonized, looks back at the \nstars.\n\n\t\t\tELIAS (CONT'D)\n\tOh shit!  Sometimes there's things in my head ... \n\tman.  Grass does that to me, fucks me all up like a \n\tcrazy Indian ...\n\n\t\t\tCHRIS\n\tDo you believe that stuff about ... knowing you're \n\tgonna die?\n\n\t\t\tELIAS\n\tYeah, those are the guys that live.  I really don't \n\tthink Death gives a shit, it's like a giant garbage \n\tcan, I think it takes whatever it can get ... you \n\tnever know where it's gonna come from anyway ... so \n\twhy spin your wheels?\n\nHe shrugs, a certain bravado masking his own uncertainty.\n\n\t\t\tCHRIS\n\t... You ever think about reincarnation, all that \n\tstuff?\n\nA lightning quick movement follows.  Elias' hand passing over his \nface like a mime, a click of the fingers and he leans closer to \nChris.  A new expression on his face.  Devil's eyes, mocking \nchild, danger in his soul, excitement, sex - the Elias that Chris \nsaw in the smoking session in base camp.  Chris smiles, sucked \nin, almost laughs and then the face is gone again.\n\n\t\t\tELIAS\n\tSure, goes on all the time.  Maybe a piece of me's in \n\tyou now, who knows.  But when you die - really die - \n\tthat's a big return ticket.\n\t\t(soft)\n\tI like to think I'm gonna come back as ... as wind or \n\tfire - or a deer\n\t\t(likes the image)\n\t... yeah, a deer ...\n\nHe smiles at the thought.  Chris looks at him, looks away.  A \nshooting star falls suddenly and dryly through the cosmos.  Their \neyes.\n\nEXT. JUNGLE - STREAM - DAY (RAIN)\n\nThe Platoon moves along a shallow STREAM bordering the jungle.  A \nthick RAIN falls amid cracks of distant thunder.  Chris, Rhah, \nFrancis, Big Harold, others are at the rear of the platoon, their \nponchos pulled over them like big sad grey tents.  There's a \nholdup ahead and the Men rest on rocks or stand.  The rain makes \na pointilistic pattern, the men collages of grey, their rifles \nslung upside down to keep dry.\n\nBarnes is up ahead, out of the stream bank, on the radio.\n\nEXT. JUNGLE CHURCH - DAY (RAIN)\n\nLerner's on point, resting in the shadow of a decaying old French \nCatholic Church from the 19th Century.  The jungle has long ago \nwon the battle, vines creeping into the cracks, remnants of \narches layered around the church at the epicenter.  Behind Lerner \nis Sgt.Warren and his radioman.\n\nEXT. JUNGLE CLEARING - DAY (RAIN)\n\nElias, further back, is checking out the jungle alongside the \nclearing, noticing a number of old spider holes long since \nabandoned.  He goes over and checks them.\n\nEXT. JUNGLE - STREAM - DAY (RAIN)\n\nBack at the stream, Rhah, looking old and whiskered under his \nponcho hood, lights up a roach, puffs it.  Another crack of \nthunder.  Chris comes over, sits with him on his rock.  Rhah \npasses him the joint.  He smokes.\n\nBig Harold pulls a leech out of his open crotch area.\n\n\t\t\tHAROLD\n\tShit, lookit this little fucker trying to get up ma \n\tglory hole.\n\n\t\t\tFRANCIS\n\tHey Big Harold, put dat in your turkey loaf it won't \n\tcome out your back end.\n\n\t\t\tKING\n\t\t(ribbing)\n\tYeah, big boy, thought you had that laundry gig all \n\tlaid out?\n\n\t\t\tBIG HAROLD\n\t\t(pissed)\n\tShit, got to paint myself white get one of dem jobs.  \n\tGet ma request in for a circumcision.\n\n\t\t\tKING\n\tGonna be a rabbi man?\n\n\t\t\tFRANCIS\n\tGonna cut your pecker down to size hunh Big Harold?\n\n\t\t\tBIG HAROLD\n\tDat's okay wid me, better to have a small one den no \n\tone at all.\n\n\t\t\tKING\n\tYour girlfriends gonna look for new lovers, man.  \n\tBest thing a bro's got's his flap.\n\n\t\t\tHAROLD\n\tI'll drink to your flap in Chicago, King.  All I \n\tgotta do is stretch it out to 15 days and I'll be \n\tshort 15 and the Beast just wouldn't dare send me \n\tback to the bush.\n\n\t\t\tFRANCIS\n\tYou gonna get some for me back in the World, Harold?  \n\tWhatcha gonna do?\n\t\t(dreaming of it)\n\n\t\t\tHAROLD\n\tThe world's gonna be ma oyster man.  First's I gonna \n\tEAT - all the hamburger and french fries and steaks \n\tsoaked in onions and ketchup I can get.  Then I'se \n\tgonna FUCK and SUCK Sandy Bell till I sore all over \n\tand can't fuck no more, and den I'se gonna SLEEP for \n\tDAYS, for WEEKS!  Den I'se gonna think bout what \n\tcomes next ...\n\nThe words carry over Chris staring out at the rain, feeling a \nleaden fatigued high.  Passes the roach, down to a millimeter, \nback to Rhah who points to his face.\n\n\t\t\tRHAH\n\t... you got one right there.\n\nChris feels for, finds the leech on the edge of his lip, cursing \nunder his breath.\n\n\t\t\tLIEUTENANT WOLFE\n\t\t(in the stream, on radio)\n\tAll right move out.\n\nThe men start slogging on against the rain.\n\nJunior is drinking from the stream, as Fu Sheng passes.\n\n\t\t\tFU SHENG\n\tDon't drink that asshole.  You're gonna get malaria.\n\n\t\t\tJUNIOR\n\tShit I hope so!\n\nEXT. JUNGLE - CHURCH - DAY (RAIN)\n\nOn point, Lerner moves out through a remnant of an old arch, \nsomewhat casual in his approach to point.\n\n\t\t\tLERNER\n\tHey Sarge, you wanna tell me which way or do I get to \n\tfigger it out?\n\nSgt.Warren, picking up a quick azimuth on his lensatic compass, \npoints.  Lerner moves in the new direction.\n\nEXT. JUNGLE - DAY (RAIN)\n\nLerner moves away from the clearing, working up a slight incline \nwhen the MACHINE GUN FIRE erupts out of the jungle, spinning him \n- throwing him into the dirt like discarded garbage.\n\nThe men are down, yelling.\n\n\t\t\tSGT. WARREN\n\tAmbush!  Incoming!  Fucking incoming!\n\nSuddenly an RPG rocket breaks out of the bush, sounding like an \natom bomb as it devastates the front of the Platoon.  Radio Talk \nis continuous now, back and forth between the three platoon \nradios, through the ambush.\n\n\t\t\tO'NEILL\n\tDOC, UP HERE!  Lerner's hit! ...\n\nMore machine gun fire.\n\n\t\t\tFRANCIS\n\tDOC!  Over here - we got ... one ... two down.  \n\tWarren's hit.\n\nEXT. JUNGLE - CHURCH - DAY (RAIN)\n\nChris moving up with Rhah and the others out of the stream, they \nhit the ground next to Sgt.O'Neill, who looks pretty scared, \nobviously not about to move.\n\n\t\t\tCHRIS\n\tWhat's going on?\n\n\t\t\tO'NEILL\n\tShit they got RPG's on our ass.  Fucking ambush - \n\tthey was waiting for us to break trail!\n\n\t\t\tKING\n\tWATCH OUT!  ROCKET!\n\nAnother rocket whistling in.  A huge roar.  Trees shredded, dirt, \ndust rising.\n\n\n\t\t\tCHRIS\n\tWho's on point?\n\n\t\t\tO'NEILL\n\tLerner and Warren.\n\nChris uses his M-16 to lever himself up into a crouch and \nsuddenly dashes forward, passing Rhah.\n\n\t\t\tRHAH\n\tWhere you goin' man!\n\nChris tearing up.  Past Flash - the hip black head with the \ncolored beads.  He's dead, torn and shredded, his face and eyes \nstuff with dirt.  Next to him Doc is frantically tourniqueting \nTubbs, shot in the legs.  He's screaming.\n\nChris keeps moving to the front as if compelled.\n\nEXT. JUNGLE - BARNES' POSITION - DAY (RAIN)\n\nBarnes is laying out fire.\n\n\t\t\tBARNES\n\tGoddamit, you assholes get fucking' firepower out \n\tthere!\n\t\t(to Hoyt on radio)\n\tGet Two Bravo up here.  Get me a gun.\n\t\t(to others)\n\tSpread it out!  More to the flanks!  Look for a \n\tfuckin' target!\n\nAnother explosion.\n\nEXT. JUNGLE - FORWARD POINT - DAY (RAIN)\n\nChris comes alongside Francis near the point, throws himself \ndown.  Banging his head against his helmet as he falls.  The \nincoming rounds are tearing up the front of the platoon.\n\n\t\t\tCHRIS\n\t\t(to Francis)\n\tWhere's Lerner?\n\n\t\t\tFRANCIS\n\t\t(terrified)\n\tOut there man - behind the log.\n\nLooking.  A body - moaning, sort of moving, wriggling, as if \ntrying to escape the pain.\n\n\t\t\tCHRIS\n\tOh Jesus!\n\nHis eyes moving to Sgt.Warren lying alongside a tree - calmly \ntrying to stack his intestines back into his ruptured stomach.  \nAnother RPG comes in.\n\nChris makes a conscious decision, moves up - bit by bit, \nshielding himself with tree stumps, ant hills, laying out fire, \ntrying to get closer to Lerner.\n\nFrancis following his progress, bug-eyed.\n\nFu Sheng now comes up with his M-60 - Harold his loader, belts of \nammo flapping against their bodies.  He fires from the hip, \nproviding cover fire for Chris, then pops down.\n\nEXT. FORWARD POINT - JUNGLE - DAY (DRIZZLING RAIN)\n\nChris, firing out another magazine, crawls closer to Lerner, \ntrying to ascertain if he's still alive.\n\n\t\t\tCHRIS\n\tLerner!  Lerner, can you hear me man?\n\nLerner groans.  A fresh burst of AK fire rakes the area.  Lerner \njerks spasmodically with the impact of the rounds.\n\nChris spots the sniper.  In a hole in the ground.  Twenty-five \nmeters off.  Snapping the magazine out of his AK to reload.  A \nlive gook.\n\nChris tears off a volley at him but the gook disappears in the \nhole.  This is the moement, Chris realizes it, it's now or never \nif Chris intends to get the gook.  He's got to make a move before \nthe man has reloaded his weapon.\n\nHe pulls his grenade, pops the pin.  He lets the spoon fly off, \nactivating the grenade-timer, as he humps to his feet and runs \nfor the gook hole, concentrating, concentrating.  That head is \ngoing to pop up any second with a freshly-loaded weapon and tear \nhis head off.\n\nChris won't make it back to the hole.  The throw has to be \nperfect.  He won't get another chance.  He heaves the frag, drops \nand rolls away.  The throw is perfect, the golden arc of flight \nfrom the outfield nailing the baserunner.  It twists cleanly in \nthe hole.  The explosion muffled but deadly.\n\nChris scrambles to his feet, a look of almost total surprise on \nhis face.  He can't seem to believe he did it.  Pointing his M-16 \nbefore him, he advances on the hole, looking over the muzzle to \nsee the badly-mangled NVA man twisted at the bottom.\n\nChris hurries over to Lerner.  He's in bad shape, hit in several \nplaces, vaguely conscious.\n\n\t\t\tCHRIS (CONT'D)\n\tGator!  Gator!\n\t\t(Lerner groans)\n\tI'm gonna get you out man.  You're gonna be okay \n\tGator ... okay?\n\nFu Sheng laying out fire to protect them, Harold splitting off to \nget more ammo.\n\nChris getting Lerner to his feet, hauling him back with all his \nstrength, past Francis ...\n\nEXT. JUNGLE - WOLFE'S POSITION - DAY (RAIN)\n\nLt.Wolfe seems disorientated, struggling with the rain water \nwashing off his map, trying to read the coordinates for an arty \nfire mission.\n\n\t\t\tWOLFE\n\t\t(into the radio)\n\tRedleg, Redleg ... Ripper Bravo Two Actual.  Fire \n\tmission.  Grid six-four-niner ... four-zero-two.  \n\tDirection six-one-zero-zero.  Dinks dug in bunkers.  \n\tDanger close.  Adjust fire, over ...\n\n\t\t\tRADIO VOICE\n\tRog, Two Bravo.  Solid copy, stand by for shot, out.\n\n\t\t\tACE\n\tSir, Bravo Three is inbound from the Sierra Whiskey.  \n\tShould be here in two zero mikes if'n they don' hit \n\tany shit.\n\n\t\t\tWOLFE\n\tFuckin' A!\n\nElias runs up to him.  Fire all around, incoming and outgoing, \nmakes them yell to each other.\n\n\t\t\tELIAS\n\tLootenant, they're kickin our ass, they know we're \n\tgonna bring heavy shit on 'em pretty soon so they're \n\tgonna get in tight under the arty.  I spotted a cut \n\trunning around to the left.  Lemme take some men and \n\troll up that flank ..\n\t\t(pointing)\n\tI can work right up on 'em ...\n\nWolfe unsure, looks up for the artillery.\n\n\t\t\tWOLFE\n\t\t(to Ace)\n\tGet me Barnes ... I don't know 'Lias, we got four \n\tdown up there, if I split you off, we ...\n\nElias grabs a stick, urgent, starts drawing their position in the \ndirt for Wolfe.\n\n\t\t\tELIAS\n\tLook, Lootenant ...\n\nWolfe looks up, relieved as Barnes splashes into the CP group.  \nThunder peals.\n\n\t\t\tBARNES\n\t\t(yelling at Wolfe and Ace)\n\tWhere the fuck is red platoon!  Tell 'em to get their \n\tasses up here!  What the fuck you doin' back here \n\tElias?  Round up your assholes and move 'em up front, \n\twe're getting chopped to shit.\n\n\t\t\tELIAS\n\t\t(yelling back)\n\tBarnes, listen to me ... there's 5-6 spiderholes back \n\tthere\n\t\t(points)\n\tnext to the church.\n\t\t(draws it into the ground as he talks)\n\tThird Platoon's coming up the stream to reinforce us.  \n\tFlank's wide open, dinks get 3-4 snipers in these \n\tholes, when Third Platoon comes up, they'll get us in \n\ta crossfire with 'em.  We'll shoot each other to \n\tshit, then they'll hit us with everything they got.  \n\tIt'll be a massacre!\n\nBarnes looking at the drawing.\n\n\t\t\tWOLFE\n\tSounds pretty far out to me 'Lias.\n\n\t\t\tELIAS\n\tMaybe but I seen it happen at Ia Drang in '66, First \n\tCavalry and they cut us to fuckin' pieces!\n\t\t(back to Barnes)\n\tGive me three men, if I'm wrong, I can still roll up \n\tthat flank.\n\n\t\t\tBARNES\n\t\t(a look)\n\tTake off, but keep your radio here.\n\nElias goes, stops, looks at Barnes ...\n\n\t\t\tELIAS\n\t... You keep pouring out that suppressing fire, \n\tBarnes.  I don't wanna be caught out there with my \n\tass hanging out you hear me?\n\n\t\t\tBARNES\n\tDon't tell me how to fight this fucking war, 'Lias, \n\tyou go crying to fucking brigade on your time.  Out \n\there you belong to me.  Now move.\n\nA look.  Elias goes fast.  More thunder peals.  As the 155mm \nhowitzers - sounding like deep tom-toms some three miles distant \n- beat out their shells.  An ominous sound.  Closer.\n\n\t\t\tACE\n\tSir!  Shot out.  Arty's on the way!\n\n\t\t\tBARNES\n\t\t(hurrying back to the front)\n\tGet that asshole O'Neill up here willya!\n\nEXT. JUNGLE - FU SHENG'S POSITION - DAY\n\nFu Sheng is laying out fire when he senses something, looks up.  \nThe artillery shell sounds too close.  Getting bigger and bigger \non the horizon.  Too big, too loud.  A groan of fear on his face, \nthen knowledge.  Then ... a huge EXPLOSION engulfs him.\n\nEXT. JUNGLE - HAROLD'S POSITION - DAY (RAIN)\n\n\t\t\tBIG HAROLD\n\tShort round!  It's short, man!  They fuckin' got Fu \n\tSheng!  BARNES! OVER HERE!\n\nEXT. JUNGLE - DAY (RAIN)\n\nBarnes hearing it, starts forward.  Another huge shell starting \nto whistle in on them.\n\n\t\t\tBARNES\n\tThat fuckin' idiot!\n\nIt explodes.  This is about three times the intensity of the RPG.  \nThe jungle floor shakes, trees splinter.  Barnes is knocked to \nhis knees, rimaces in pain.  Hoyt, Barnes' radio operator, \nscreams out as a fist-sized chunk of hot shrapnel sticks in his \nback.  He's screeching, frantically trying to shuck the radio \nfrom his back, his fatigue shirt smoking.\n\nBarnes jerks the radio off Hoyt's back, knocks the man to his \nknees and unsheathes his bayonet.  Ripping off the back of his \nshirt, Barnes sets to digging out the shrapnel.\n\nEXT. MOREHOUSE'S POSITION - DAY (RAIN)\n\nMorehouse is decimated by a third explosion, chunks of shrapnel \nwhirring like battleaxes into the tree trunks.\n\nEXT. JUNGLE - HAROLD'S POSITION - DAY (RAIN)\n\nBig Harold is tearing blindly away from the front, helmet gone, \nrifle dragging in the mud when he stumbles, sprawling face down.  \nHe jumps up, looks back, sees now the wire over which he tripped.  \nIt takes a second to register.  He shares a look with Bunny who's \nalready on the ground.\n\n\t\t\tBUNNY\n\tSatchel charge!  GET DOWN!\n\nHarold goes for the ground the same instant the satchel explodes.\n\nEXT. JUNGLE - CHURCH - DAY (RAIN)\n\nChris, further back, dumps Lerner with Doc who's got more than he \ncan handle.\n\n\t\t\tCHRIS\n\tTake care of him Doc!  Please!\n\nDoc looking at him, a dark look of hopelessness.  Lerner is a \nmess, groaning, reaching for Chris' hand.\n\n\t\t\tLERNER\n\t... don't ... don't leave me man ...\n\nA look between them.  Rhah instersecting.\n\n\t\t\tRHAH\n\tTaylor - get your ass over here.  Move!\n\n\t\t\tCHRIS\n\tHang tough, Gator.  Hang in there, man, you're gonna \n\tbe OK ... just hang on.\n\nFeeling like a liar, peeling the man's hands off him, leaving him \nthere looking numb.  Chris is shaken, Lerner's blood all over \nhim.\n\nHe tears out after Rhah, linking up with Elias and Crawford.  \nElias motioning them to hurry.  Another huge artillery round \nexploding out to the front.\n\nEXT. JUNGLE - O'NEILL'S POSITION - DAY (RAIN)\n\nSgt.O'Neill, scared out of his mind, hugging the earth, tries to \ncrawl into a small cut in the ground but finds it occupied by a \ncringing Junior.\n\nEXT. JUNGLE - WOLFE'S POSITION - DAY (RAIN)\n\nBarnes rushes up out of the forest like Achilles, towering in his \nrage, at Lieutenant Wolfe, ripping his handset from him as the \nLieutenant reads off the coordinates off his map.\n\n\t\t\tBARNES\n\tYOU IGNORANT ASSHOLE! - What the fuck coordinates you \n\tgiving!  You killed a bunch of people with that \n\tfucked up fire mission!  You know that? ... ah shit!\n\nWolfe stares at him, open-mouthed.  Disgusted, Barnes hunkers \ndown to read the coordinates from his own map into the handset.\n\n\t\t\tBARNES (CONT'D)\n\tRedleg Romeo .. Ripper Bravo Two.  Check your fire, \n\tcheck fire, you're short on our pos!  I say again, \n\tcheck your fuckin' fire! ... From Registration point, \n\tadd one five zero, left five zero, fire for effect!\n\nNew incoming fire drowns out Barnes.\n\nEXT. JUNGLE - ELIAS' POSITION - DAY\n\nElias - a defiant look on his face - moves fast but cautiously \nback across the Church landmarks.  Chris following then Rhah and \nCrawford.  The RAIN has now settled into a mist hugging the \nground.\n\n\t\t\tELIAS\n\tMove it!  Move it!\n\nElias comes to a stop, looks.  Behind them we hear the sounds of \nbattle, gauging their distance from the main body.\n\nThe spider holes are still empty.  But he listens, senses \nsomething out there getting closer.\n\n\t\t\tELIAS (CONT'D)\n\tThey're coming ...\n\nChris looking at Rhah.  How does he know?\n\nElias points out an imaginary line across the breaking mist.\n\n\t\t\tELIAS (CONT'D)\n\tStagger yourselves across this line, shoot anything \n\tthat moves.  They'll be coming from here.\n\n\t\t\tRHAH\n\t\t(team leader)\n\tGotcha.\n\n\t\t\tELIAS\n\tOne of them gets through it's curtains.\n\n\t\t\tRHAH\n\tWhere you going?\n\n\t\t\tELIAS\n\tDown along the river 'bout 100 metres, 'case they try \n\tto flank us there.  Third Platoon's coming up on our \n\trear so watch for 'em.\n\n\t\t\tCHRIS\n\tI'll go with you.\n\n\t\t\tELIAS\n\tNo ... I move faster alone.\n\t\t(a grin)\n\nElias, his pack stripped, is gone, like a fleet leaf, vanishing \ninto the Jungle.\n\n\t\t\tRHAH\n\t\t(stringing them out)\n\tOkay Crawford - over here.  Taylor - down twenty \n\tyards behind that tree.\n\nEXT. JUNGLE - WOLFE'S POSITION - DAY (MIST)\n\nBarnes has finished correcting the fire mission, hurls the \nhandset back at Wolfe, a wild look in his eyes, studying the \nincoming fire.  Makes a decision.\n\n\t\t\tBARNES\n\tLet's move back, link up with Three.  Let the arty do \n\ta little work.\n\t\t(to Ace on radio, ignoring Wolfe)\n\tPush Two Alpha and Two Charlie.  Tell'em to haul ass \n\tand re-group at the church.  Tell'em NOT to fire.\n\t\t(Ace transmits)\n\n\t\t\tWOLFE\n\tWhat about Elias?  We pull back they'll be cut off.  \n\tHe needs cover fire.\n\n\t\t\tBARNES\n\t\t(looks at him like he's stupid)\n\tI'll get him.\n\t\t(with a threatening undertone)\n\tYou just haul ass too lootenant.\n\t\t(going, to Ace)\n\t... don't send Bravo Three up till I get back to the \n\tCP.  Now move out, all of you.\n\nAs he snaps his weapon onto full auto and runs off after Elias in \na crouch ... a man with a mission.\n\nEXT. JUNGLE - RHAH AND CHRIS' POSITION - DAY\n\nNext to the Church deployed in the jungle, Rhah looks on, silent.\n\nChris in his position, waits.  It is so silent in comparison to \nthe racket from the battle across the forest.  The Mist clings to \nthe trees, moist and lovely.  Then, a flicker of movement, sound.\n\nChris hears it, tightens.  His POV - at fifty yards.  An \nevanescence of beige and green uniforms moving towards him very \nfast, scurrying.  They look like headless ghosts.\n\nChris opens fire.\n\n\t\t\tCHRIS\n\tGET EM!!!!!\n\nRhah and Crawford open up.  A rachet of sound, one of the fiures \nseems to go down, then another but at this distance through \njungle it is difficult to say.  The firing just as suddenly \nbreaks off and the silence returns.\n\n\t\t\tCHRIS (CONT'D)\n\t\t(ecstatic)\n\tYeah!  I got two of them fuckers ...\n\n\t\t\tRHAH\n\tI got one ...\n\n\t\t\tCHRIS\n\t... See them go down?  Like fuckin' target practice \n\tman, fuck you Charlie!!  Ho Chi Minh sucks dead dick! \n\t... Crawford!\n\t\t(sees him, stunned)\n\nCrawford, the blond-locked California beach boy, lies on the \nearth, hit in a lung, having difficulty breathing, moaning in a \nsoft undercurrent.  Chris runs up on him.\n\n\t\t\tCHRIS (CONT'D)\n\tOh man!  ... man!\n\nAttending him.  Rhah runs up.\n\n\t\t\tRHAH\n\tLooks like a lung babe.  But you're gonna be all \n\tright, you only need one of them fuckers.\n\n\t\t\tCRAWFORD\n\tOh shit man I never thought I'd get hit, I was ...\n\t\t(gagging)\n\n\t\t\tRHAH\n\tStay cool.  We gonna carry you out.\n\nBarnes appears, running towards them, looking down at Crawford, \nat Rhah.\n\n\t\t\tRHAH (CONT'D)\n\tSarge, 'bout five gooks tried to ...\n\n\t\t\tBARNES\n\tWhere's Elias?\n\n\t\t\tRHAH\n\t... came through right over there.  We got three of \n\tthem, we ...\n\n\t\t\tBARNES\n\tDidn't you hear the arty shift?  We're pulling back.  \n\tGet your wounded man and get the fuck back to the \n\tchurch.  Get going.\n\n\t\t\tCHRIS\n\t\t(indicating jungle)\n\t... but 'Lias is still out there.\n\n\t\t\tBARNES\n\tI'll get him.  You get the man in, Taylor\n\t\t(indicating Crawford)\n\tNOW.  Or I'll Article 15 both your asses.  Move!\n\nChris and Rhah look at Barnes sullenly, then reluctantly start \nmoving Crawford onto a poncho liner they use as a litter.\n\n\t\t\tBARNES (CONT'D)\n\tMove it, MOVE IT!\n\nHe's in his blackest rage, the force of his words almost \nphysically pushing the men to move out with Crawford.  Barnes \nturns now to deal with Elias.\n\nEXT. ELIAS' JUNGLE - DAY\n\nElsewhere, Elias stands silently, listens to the forest.  In the \ndistance the firefight can hardly be heard.  His helmet gone, his \nhair hanging free, he is at his best now - alone.  He hears it.  \nSomebody running through the jungle, about 100 yards, boots on \nleaves, coming towards him.\n\nHe begins to move lateral to the sound.  His steps unheard, \nbetter at this than the enemy.\n\nTHREE ENEMY FIGURES now appear, crouched and moving very fast \nwith light equipment through the mist.\n\nElias swerves up in immediate foreground, his back to us, FIRING.  \nAll three Figures fall.\n\nA quick glimpse of Elias, not bothering to stop, moving to his \nnext position.\n\nEXT. BARNES' JUNGLE - DAY\n\nBarnes, moving through the jungle, reacts to the fire, resetting \nhis course.  Like a hunter stalking a deer.  Suddenly there's \nmore firing.  Then silence -\n\nEXT. ELIAS' JUNGLE - DAY\n\nTWO MORE ENEMY lie dead in the jungle.  A rustle of movement, \nthen a CRY - chilling, jubilant, a war cry.\n\nA pair of feet moving lightly over the jungle.  A glimpse of \nElias.  In his full glory.  Roaming the jungle, born to it.\n\nEXT. BARNES' JUNGLE - DAY\n\nBarnes fixing on him, moving.\n\nEXT. ELIAS' JUNGLE - DAY\n\nAn NVA SOLDIER, jungle-whiskered, dirty, smart, crouches, \nlistens, looks to his PARTNER.  What are they fighting here?  The \nFirst One mutter something sharp and they split fast in the \ndirection they've come.\n\nThey get about six steps when Elias suddenly rises up from the \nbush, not ten yards in front of them, his shots ripping into \nthem, driving the surprised life from them.  Elias is gone.\n\nEXT. NVA JUNGLE - DAY\n\nElsewhere, another three NVA stop, turn and flee back from where \nthey came.\n\nEXT. JUNGLE CHURCH - DAY\n\nChris and Rhah get Crawford back to the church grounds, lay him \ndown.  No activity around them.  Chris plunges back into the \njungle where they left Barnes.\n\n\t\t\tRHAH\n\tTaylor!\n\nEXT. ELIAS AND BARNES' JUNGLE - DAY\n\nBarnes moving, stops, listens.  Something is running towards him.  \nBut it's hidden by the bush.  He brings his rifle up smooth and \nquick, waits, then as the bush parts, Elias is standing there.  \nLooking at Barnes.\n\nBarnes sees him, starts to lower his rifle, but then stops.  He \nraises it back an inch, sights it.  Pause.  A cold searing look \nof hatred coming over his face.\n\nIn that moment, Elias understands.  Quick as a deer, he makes his \nmove, trying to plunge back into the bush.\n\nBarnes fires.  Once, twice, three times - the blast rocking the \njungle.\n\nElias jerking backwards into the bush, mortally wounded.  Bird \ncries.  A crime against nature.\n\nBarnes calmly lowers his rifle, and walks away from it.\n\nEXT. CHRIS' JUNGLE - DAY\n\nChris, cutting through the jungle, hears the shots.  He stops, \nlistens.  Someone is moving through bush towards him, leaves and \nfoliage shaking.\n\nChris tightens, raises his rifle.\n\nBarnes steps through into his sight - sees him.\n\nChris lowers his rifle.  Barnes walking past him as if he weren't \neven there.\n\n\t\t\tBARNES\n\tElias is dead.  Join up with the platoon.  Move it.\n\n\t\t\tCHRIS\n\t\t(shocked)\n\tHe's dead!  Where?  ... You saw him?\n\n\t\t\tBARNES\n\tYeah.  Back about 100 metres.  He's dead, now get \n\tgoing, the gooks are all over the fuckin' place.\n\nMoving on quickly.  Chris has no choice but to follow, looking \nback one more time.\n\nEXT. CHURCH GROUNDS - JUNGLE - DAY\n\nTWO CHOPPERS are coming into a LZ in front of the Church.  The \ntwo platoons, Second and Third, reinforcing, are being evacuated \nas quickly as possible, one load (6-8 men, depending on the \nwounded) after other.  The choppers are spraying dust all over \nthe place.  A scene of chaos, radio talk layering it.  Doc is out \nof supplies, making do with improvised bandages, etc.\n\n\t\t\tWOLFE\n\tMOVE IT MOVE IT MOVE IT.\n\nLerner goes by, horribly wounded on a makeshift litter, into the \nchopper, Doc attending, holding the IV.\n\nChris catching a glimpse of him, waiting to get on the chopper, \nturning to look as:\n\nHoyt and Sgt.Warren, both wounded, are hurried aboard on litters.  \nThe chopper lifting off.\n\nChris and others now running to the corpses of Flash, Morehouse, \nand Fu Sheng lying under dirty ponchos, their boots sticking out.  \nThe ponchos are blown away in a burst of wind off the chopper \nblades, revealing their faces - dirt stuffing their eyes and \nmouths, waxen figures.\n\nChris and the others lifting them and carrying them towards the \nnext chopper now coming in.\n\nThey throw the bodies on.  Tubbs and Crawford, both wounded, now \nmove past Chris, into the chopper.  Chris running back, with King \ncarrying a litter - their eyes falling on:\n\nBarnes talking with Wolfe and Ace, making signals under the \nroaring sounds of the chopper.  Shaking his head.  No.  No Elias.\n\nChris and King looking at each other, mute.  They numbly start \nloading Big Harold, minus his leg, onto the stretcher.\n\nThe Third Chopper is down now, waiting, roaring blades \nsilhouetting off the face of the cathedral.  A ROCKET BLAST \nsuddenly goes off not too far from the chopper, incoming fire.  \nThe DOOR GUNNER signaling for them to hurry, laying out fire.\n\nINT/EXT. CHOPPER - JUNGLE - DAY\n\nChris and King hustling Big Harold's 250 pounds into the chopper.  \nClimbing in with him.  Wolfe, Barnes, Ace running in with them.  \nThe perimeter is bare.\n\nChris' eyes flitting over Barnes as he jumps in.  The chopper \nlifting off as another explosion rocks the area.  The Door Gunner \nsees something, opens up.\n\nBig Harold, cursing, looks chalky but hog happy as he manages a \nglance down at the jungle.  His right leg is gone.  Tears are \nrolling out of his eyes.\n\n\t\t\tKING\n\tMan, you gonna be in Japan this time tomorrow, Big \n\tHarold.\n\n\t\t\tBIG HAROLD\n\tYeah, I'se lucky dis time, what's a leg to get the \n\tfuck outta here ...\n\t\t(at the NVA)\n\tEat ma shit, you motherfuckers!\n\nHe sinks back, sick.  Chris' eyes sudenly fix on something.  He \ncan't believe it.  He shoves King, points.  King sees it.  Both \nstunned.\n\nBarnes is looking.  So's Lt.Wolfe, so's Ace.  So's the Door \nGunner.\n\nElias is coming out of the jungle.  Staggering, blood disfiguring \nhis face and chest, hanging on with all his dimming strength, \nlooking up at them - trying to reach them.\n\nChris shakes Wolfe, his words drowned out by the roar.\n\nThe Chopper Captain looking down, dips.  His co-pilot pointing.\n\nThe NVA are coming out of the jungle, closing on the spot where \nElias is.\n\nIncoming rounds are hitting the chopper.  The Door Gunner \nmaniacally firing.\n\nBarnes looking down at the man, can't believe it.\n\nElias is on his last legs now, obviously being hit by the \nincoming fire of the NVA.  He falls to his knees, still \nstretching upwards for life.\n\nThe Chopper Captain shakes his head at Wolfe.\n\nThe Chopper dips one more time firing at the NVA, low and fierce \nover the jungle.\n\nChris looking back in horror.\n\nElias crucified.  The NVA coming out now by the dozens from the \ntreeline.\n\nElias crumbling to the ground.  Obviously dead or dying.\n\n\t\t\tHELICAPTAIN ON RADIO\n\t... we still got one on the deck.  Bring the gunships \n\tin.\n\nBarnes drawing in.\n\nChris looking at him in revulsion.  He knows.  Barnes sees his \nlook, ignores it, all of them sitting there silent, living with \nthat final horrifying image of Elias.\n\nEXT. UNDERGROUND HUTCH - BASE CAMP - NIGHT\n\nThe 'heads' are assembled - what's left of them.  Rhah, King, \nFrancis, Doc, Adam, a quiet black kid, and Chris, who is \nimpassioned tonight.\n\n\t\t\tCHRIS\n\tHe killed him.  I know he did.  I saw his eyes when \n\the came back in ...\n\n\t\t\tRADIO VOICE\n\t\t(puffing on his bowl)\n\tHow do you know the dinks didn't get him.  You got no \n\tproof man.\n\n\t\t\tCHRIS\n\tProof's in the eyes.  When you know you know.  You \n\twere there Rhah - I know what you were thinking.  I \n\tsay we frag the fucker.  Tonight.\n\nHe looks to King who puffs on a joint, his eyes red.\n\n\t\t\tKING\n\tI go with dat, an eye for an eye man.\n\n\t\t\tDOC\n\tRight on, nothing wrong with Barnes another shot in \n\tthe head wouldn't cure.\n\n\t\t\tRHAH\n\t\t(to Chris)\n\tShit boy you been out in the sun too long.  You try \n\tthat, he'll stick it right back up your ass with a \n\tcandle on it.\n\n\t\t\tCHRIS\n\tThen what do you suggest big shot?\n\n\t\t\tRHAH\n\t\t(to Chris)\n\tI suggest you watch your own asses cause Barnes gonna \n\tbe down on ALL OF 'EM.\n\n\t\t\tFRANCIS\n\tHow you figger that?\n\n\t\t\tRHAH\n\tShit man - Human nature.\n\nFlashes the old knuckle - 'HATE'.\n\n\t\t\tKING\n\tThen you jes gonna forget 'bout Elias and all the \n\tgood times we done had?  Right in here.\n\n\t\t\tRHAH\n\tHe dugged his own grave.\n\n\t\t\tDOC\n\t\t(correcting)\n\tHe dug it.\n\n\t\t\tRHAH\n\tHe DUGGED it too.\n\n\t\t\tCHRIS\n\tFuck this shit!\n\n\t\t\tRHAH\n\tYou guys trying to cure the headache by cutting off \n\tthe head.  'Lias didn't ask you to fight his battles \n\tand if there's a Heaven - and god, I hope so - I know \n\the's sitting up there drunk as a fuckin' monkey and \n\tsmokin' shit cause HIS PAINS HE DONE LEFT DOWN HERE.  \n\tBaaaaaaaaa!\n\t\t(a vehement movement of his head)\n\n\t\t\tCHRIS\n\tYou're wrong man!  Any way you cut it Rhah, Barnes is \n\ta murderer.\n\n\t\t\tKING\n\tRight on.\n\n\t\t\tRHAH\n\tI remember first time you came in here Taylor you \n\ttelling me how much you admired that bastard.\n\n\t\t\tCHRIS\n\tI was wrong.\n\n\t\t\tRHAH\n\t\t(snorts)\n\tWrong?  You ain't EVER been right - 'bout nothing.  \n\tAnd dig this you assholes and dig it good!  Barnes \n\tbeen shot 7 times and he ain't dead, that tell you \n\tsomething?  Barnes ain't meant to die.  Only thing \n\tcan get Barnes ... is Barnes!\n\nBarnes stands there, silhouetted in the trap door, looking down \nat the men who are stunned to see him here.\n\nHe steps down into the hutch, his face now lit by candle light.  \nA bottle of whiskey in his hand, drunk, ugly, sweating, but as \nalways, with dignity, possessive of his silence.  He feels their \nfear in the silence, enjoys it.\n\n\t\t\tBARNES\n\t\t(soft)\n\tTalking 'bout killing?\n\nHe totters slightly as he circles the outer edge of the hutch.  \nNo one talks.\n\n\t\t\tBARNES (CONT'D)\n\tY'all experts?  Y'all know about killing?\n\nHe takes the bowl from Adams, smokes it.\n\n\t\t\tBARNES (CONT'D)\n\tYou pussies gotta smoke this shit so's you can hide \n\tfrom reality? ...\n\t\t(smokes again)\n\tMe I don't need that shit.  I AM reality.\n\nConfronting Chris, he moves on, taunting them all.\n\n\t\t\tBARNES (CONT'D)\n\tThere's the way it oughta be and there's the way it \n\tis.  'Lias he was full of shit, 'Lias was a crusader \n\t- I got no fight with a man does what he's told but \n\twhen he don't, the machine breaks down, and when the \n\tmachine breaks down, WE break down ... and I ain't \n\tgonna allow that.  From none of you.  Not one ...\n\nWalks past Rhah, past King, throws the pot bowl into the dirt of \nthe floor.\n\n\t\t\tBARNES (CONT'D)\n\tY'all loved Elias, want to kick ass, I'se here - all \n\tby my lonesome, nobody gonna know.  Five you boys \n\t'gainst me?\n\t\t(pause, very soft)\n\tKill me.\n\nAlmost an appeal - naked, intense.  Rhah, Francis, Doc look away.\n\nKing, the biggest one there, is about to say something, but the \nmoment passes.\n\nChris waits, his anger on the rise.\n\nBarnes takes a swigger from the whiskey, then turns away \ncontemptuously.\n\n\t\t\tBARNES (CONT'D)\n\tI SHIT on all o' you.\n\n\t\t\tCHRIS\n\tKILL YOU MOTHERFUCKER!!!\n\nChris slams into Barnes, rushing him off his feet.  Pounding his \nface, solid blows.\n\n\t\t\tKING AND OTHERS\n\tGet that mother, babe, go ... Kick his ass, kill that \n\tcocksucker!!!\n\nBut Barnes is too quick and very strong and takes the blows, \ngetting outside Chris' arm, twisting and flipping him in a \nwrestler's grip - throwing him hard onto his back on the dirt \nfloor.\n\nThe expression of the Men watching slumps, their hopes dashed.\n\nBarnes springs around on Chris, straddles him, one hand pushing \nhis face back, hits him hard.  Once.  Twice.\n\nChris grimaces, groans, helpless now.  A flick of sound.\n\nA knife whipped out of Barnes' boot and pressing against Chris' \nthroat.  Chris bleeding from the nose and mouth.\n\nRhah suddenly spinning into action, fast now, realizing what \nBarnes intends to do.\n\n\t\t\tRHAH\n\tEASY BARNES, EASY MAN!!!\n\nBarnes is on the verge - about to kill again.\n\nChris waiting.\n\nRhah coaxing him, moving closer.\n\n\t\t\tRHAH (CONT'D)\n\tYou'll do dinky dau in Long Binh Barnes.  Ten years - \n\tkill an enlisted.  Ten years, Barnes, just climb the \n\twalls.  DON'T DO IT ...\n\nBarnes' eyes tremble in the candle light, his scars ugly, a spasm \nclenching and locking his facial muscles.  Then suddenly he is \ncalm again, very calm.  We sense a man of enormous self-control.\n\nSuddenly he flicks his knife across Chris, leaving a mark below \nhis left eye.\n\nChris gasps.  Looking up at Barnes rising off him.  The boots \nalongside his face.\n\nThe Men looking on, the tension lowering.\n\n\t\t\tBARNES\n\t\t(contemptuous)\n\tDeath?  What do you guys know about it?\n\nHe walks out.  Quietly.\n\nEXT. AIR SHOTS - JUNGLE, CHURCH - DAY\n\nChris sits at the very edge of a Huey Chopper, bandana around his \nforehead, long hair blowing in the wind, Barnes' mark below his \neyes, slicked out now like a jungle veteran, looking down at the \nVILLAGE where the massacre occurred.\n\nThe Village is still a smoking ruin, a few peasants and water \nbuffalo straggling like ants to reconstruct.\n\nBunny, next to Chris, pops his gum, indifferent.  Barnes, next to \nhim, shifts, reads a map.\n\nRodriguez is praying, his mouth moving without audible words, \ngetting ready for the drop.\n\nKing is making last minute adjustments in his pack.\n\nBunny now nudges Chris, points.  The Church in the Jungle where \nElias was killed is visible.  An outline of the Cemetery.  \nUncomfortable memories play over Chris' face.\n\n\t\t\tCHRIS (V.O.)\n\tThey sent us back into the valley the next day - \n\tabout 2,000 metres from Cambodia - into a battalion \n\tperimeter.  Alpha Company had been hit hard the day \n\tbefore by a sizeable force and Charlie Company had \n\tbeen probed that night.  There were other battalions \n\tin the valley, we weren't the only ones but we knew \n\twe were going to be the bait to lure them out.  And \n\tsomewhere out there was the entire 141st NVA \n\tRegiment.\n\nThe BATTALION PERIMETER now breaks in the clear ahead.  Smoke \ngrenades of various colors are being popped on the cleared LZ.  \nIt's not big, its radius 200 yards, heavily sandbagged, deeply \ndug, rolls of barbed wire protecting it, radio antennas sprouting \nfrom the CP - and surrounded on all four sides by jungle.\n\nThe First Chopper rocking down, whipping up dust clouds.  Chris \njumps out, moving out fast as the Second Chopper starts in.\n\nEXT. BATTALION CP - PERIMETER #3 - DUSK\n\nAt the Battalion CP, the Major confers with Captain Harris and \ntwo other Captains.  Two NVA PRISONERS are sitting on their \nknees, interrogated by Vietnamese Kit Carson scouts and a U.S. \nSergeant, their hands tied.\n\nThe Scout slaps the shit out of the NVA.\n\nEXT. PLATOON CP - PERIMETER #3 - DUSK\n\nAll this is watched from a distance by Ace and Doc and Lt.Wolfe \nat the Platoon CP.  Ace and Doc are digging the foxhole, the ace \nof spades in Ace's helmet band, sharing the information with Tony \nand Francis.\n\n\t\t\tACE\n\t... they caught 'em last night pulling some shit on \n\tCharlie Company.  They found maps on 'em, man - got a \n\tfriend at Battalion says they had every fuckin' \n\tfoxhole here fixed on it.  Distances, treelines, our \n\tclaymores, trip wires, everything?  I shit you not.\n\n\t\t\tDOC\n\tShit, so what the fuck are we doing here?  Why don't \n\twe move ...\n\t\t(no answer)\n\tBad vibes, man, I got bad vibes here.  Where are the \n\tnew guys they provided us anyway.\n\n\t\t\tTONY\n\tI heard we's in Cambodia right fuckin' NOW.\n\n\t\t\tFRANCIS\n\tYou kidding man ...\n\nRhah comes up, a walking stick in hand, huge pirate kerchief on \nhis head, semi-naked.\n\n\t\t\tRHAH\n\tYou wanted to see me sir?\n\n\t\t\tWOLFE\n\tJackson, looks like you got Elias' squad now.\n\n\t\t\tRHAH\n\tSquad?  I didn't know we was still referring to this \n\tplatoon in terms of squads sir.\n\t\t(with a snicker for Ace and Doc)\n\n\t\t\tWOLFE\n\t\t(indicating a rough drawing in the dirt)\n\tThese two holes are yours ...\n\n\t\t\tRHAH\n\tBegging your pardon Lieutenant but my holes are far \n\tenuff apart you could run a regiment through there \n\tand nobody'd see them - I got five live bodies left \n...\n\n\t\t\tWOLFE\n\tI don't want to hear your problems, Jackson.  You'll \n\tget new men any day.  Time being you make do like \n\teverybody else.\n\n\t\t\tRHAH\n\tHey Lieutenant I didn't ask for this job, I ...\n\n\t\t\tWOLFE\n\t\t(leaves)\n\tI don't want to hear about it Jackson.\n\n\t\t\tRHAH\n\t\t(amazed, looking off at him)\n\tYou don't want to hear about it?\n\n\t\t\tWOLFE\n\t\t(turns)\n\tThat's right.  I don't want to hear about it 'cause \n\tto tell you the truth, I don't give a shit okay ... I \n\tjust don't give a shit anymore.\n\n\t\t\tRHAH\n\t\t(shrugs, to himself)\n\tRight ...\n\n\t\t\tWOLFE\n\t\t(passing Ace digging the CP hole)\n\tThis is one time we could sure use Elias.\n\n\t\t\tACE\n\t\t(to Doc)\n\t'Some people say I'm wishy washy.  Maybe I am.  Maybe \n\tI ain't.'\n\nEXT. PERIMETER #3 - CHRIS' FOXHOLE - DUSK\n\nOn the edge of the perimeter, King puts out his claymore, \nunraveling it back towards his FOXHOLE, intersecting MEN form the \nThird Platoon, who file out on a night ambush, skirting the trip \nwires, demoralized, silent.  Eye exchanges, but no words.\n\nChris sits on the foxhole watching the ambush go out, smoking a \njoint by himself, depressed.  King comes in with the claymore \nwires, attaching them to their detonators.  Their foxhole - as \nare all of the Platoon's - is positioned just inside the treeline \nbordering the LZ, so that they are quite isolated from the center \nof the perimeter where they first landed.\n\n\t\t\tKING\n\tGlad I ain't going with 'em.  Somewhere out dere man \n\tis de Beast and he hungry tonight ... Man, what a \n\tbummer.  Ten days and a wakeup and I'm still dealing \n\twid this shit - fuckin' etcetera and ad infinitum man \n\t...\n\nThe LAST SOLDIER in the file recedes into the foliage.\n\n\t\t\tKING (CONT'D)\n\t\t(noticiing Chris' silence)\n\tWhat's the matter wid you? ... How come you ain't \n\twriting no more?  You was always writing something \n\thome.  Looks like youse half a bubble off, Taylor.\n\nHe doesn't answer, makes a futile gesture.\n\n\t\t\tKING (CONT'D)\n\tWhat about your folks?  That grandma you was telling \n\tme about? ...\n\nChris shakes his head.\n\n\t\t\tKING (CONT'D)\n\tGirl?\n\nChris' eyes answer negatively.\n\n\t\t\tKING (CONT'D)\n\tMust be somebody?\n\n\t\t\tCHRIS\n\t... there's nobody.\n\n\t\t\tKING\n\t\t(shifts, uncomfortable)\n\tYou been smoking too much shit babe.  Gotta control \n\tthat.  Takes a man down ... I remember when you first \n\tcome out to the bush, you was straight as a ...\n\n\t\t\tCHRIS\n\tWho gives a shit!\n\nHe shifts, annoyed, prepares his grenades along the sand bags.  \nKing shrugs, preparing his meal, sings himself a snatch of song, \na good natured man.\n\n\t\t\tKING\n\t\t(soft)\n\t'People say I'm the life of the party cause I tell a \n\tjoke or two although I may be laughing loud and hardy \n\tdeep inside I'm blue ...'\n\n\t\t\tCHRIS\n\tY'ever get caught in a mistake King and you just \n\tcan't get out of it?\n\n\t\t\tKING\n\tWay out of anything, man.  Just keep your pecker up, \n\tyour powder dry, the worm WILL turn.  How many days \n\tyou short?\n\n\t\t\tCHRIS\n\tNot just me ... it's the way the whole thing works.  \n\tPeople like Elias get wasted and people like Barnes \n\tjust go on making up rules any way they want and what \n\tdo we do, we just sit around in the middle and suck \n\ton it!  We just don't add up to dry shit.\n\n\t\t\tKING\n\tDoes a chicken have lips?  Whoever said we did, babe.  \n\tMake it outta here, it's all gravy, every day of the \n\trest of your life man - gravy.  Oh shit, superlifer!\n\nO'Neill comes up, jerks his thumb at King.\n\n\t\t\tO'NEILL\n\tGet your gear together, King, your orders just come \n\tthrough.\n\n\t\t\tKING\n\t\t(speechless)\n\tYou jokin' me man? ... shit, you ain't kidding!  \n\tCocksucker.  Oh wowww ... the lifers made a mistake, \n\tthey cuttin' me some slack, they cutting me some \n\tslack Taylor!\n\t\t(dances)\n\n\t\t\tO'NEILL\n\tCollect your shit and move out King.  You got 10 \n\tminutes make the last chopper.  Cee ess em oh or your \n\tass is mine.\n\t\t(to Taylor)\n\tFrancis is coming over.\n\t\t(hurries off)\n\nKing packing up, double time.  Chris comes over, helps him, \ntrying to share his happiness but not succeeding.\n\n\t\t\tCHRIS\n\tHey that's great King, that's great ... you take it \n\ton home for me, you tell 'em King ... got your \n\taddress right?  You know where you can reach men, \n\tman.  Anytime!\n\n\t\t\tKING\n\tI gotta didi man.  Don't wanna miss that chopper.  \n\tI'll send you a postcard.  After I get me some.  I'll \n\tsend you some tapes too man.  This new guy Jimi \n\tHendrix man, whew ... you okay Taylor?  Just 'member \n\ttake it easy now, don't think too much, don't be a \n\tfool, no such thing as a coward cause it don't mean \n\tnuthin.  Jes keep on keepin' on.  Okay my man ...\n\nChris, fighting his depression, slaps hands with King.  A brief \nmoment, they look at each other.  A friendship that was forever \nand is now over.  They both sort of know they'll never see each \nother again.\n\n\t\t\tCHRIS\n\tI'll walk you out ...\n\nFrancis coming up, hauling his pack.\n\nEXT.PERIMETER #3 - JUNIOR'S FOXHOLE - DUSK\n\nOn another foxhole, Rodriguez positions his M-60, brings up his \nammo belts (no loaders left).  Tony eating, nervous, watches him, \nshakes his head.\n\n\t\t\tTONY\n\tRumor goin' round is they got tanks.  Soviet shit, T-\n\t34's ...\n\t\t(pause)\n\tHey Rodriguez, don't you ever say nothing?\n\n\t\t\tRODRIGUEZ\n\t\t(a thick Mexican accent)\n\tWhat do you want me to say, it's all the same ol' \n\tshit.\n\nTony shrugs, back to his food.\n\nEXT. PERIMETER #3 - JUNIOR'S FOXHOLE - DUSK\n\nOn another foxhole, Barnes in full pack checks the soles of \nJunior's bare feet.  Bunny and O'Neill looking on.  Junior is \nmoaning as if he's dying, overdoing it by a mile.\n\n\t\t\tBARNES\n\tSo what's the problem?\n\n\t\t\tO'NEILL\n\tSays he can't walk.\n\n\t\t\tBARNES\n\tShit.  Get your boots on Martin, next time I catch \n\tyou putting mosquito repellant on your fuckin' feet \n\tI'm gonna courtmartial your nigger ass.\n\n\t\t\tJUNIOR\n\t\t(cracks)\n\tDEN COURTMARTIAL ME MOTHERFUCKAH, bust my ass, send \n\tme to fucking Long Binh, do your worst but I ain't \n\twalking no more.  De white man done got his last klik \n\toutta me.  Get some chuck dude to hump this shit.\n\n\t\t\tBARNES\n\t\t(suddenly soft)\n\tGet me that centipede, O'Neill.\n\nO'Neill is puzzled.  What centipede?\n\n\t\t\tO'NEILL\n\tSarge?\n\n\t\t\tBARNES\n\tYeah that long hairy orange and black bastard I found \n\tin the ammo crate.  I'm gonna put it in this \n\tasshole's crotch, see if he can walk.\n\nJunior's eyes bulge with suspiscion and sudden terror, his \ndemeanor totally alert now.\n\n\t\t\tO'NEILL\n\t\t(understanding)\n\tOh yeah, right away Sarge.\n\n\t\t\tJUNIOR\n\tNo!  Wait!  I'll walk, fuck you I'll walk, I don't \n\tneed this shit!  I don't need this shit!\n\n\t\t\tBUNNY\n\tFucking pussy, fuck it Sarge, I gotta have him on my \n\thole?\n\nBarnes going.  O'Neill catching up with him.\n\n\t\t\tO'NEILL\n\tUh ... Bob.  Like to speak to you.  Take a minute.\n\n\t\t\tBARNES\n\t\t(stops)\n\tYeah, what is it?\n\n\t\t\tO'NEILL\n\t\t(shuffles, reluctant)\n\tBob, I got Elias' R&R ... It's coming up in 3 days.  \n\tGoing to Hawaii.  See Patsy.\n\t\t(pause, no reaction from Barnes)\n\tI never asked you for a break, I was hoping you ... \n\tyou'd send me in on the chopper with King ... what do \n\tyou say Chief?\n\t\t(a friendly punch)\n\n\t\t\tBARNES\n\tI can't do that for you, Red ... We need every \n\tswinging dick in the field.  Sorry bout that ...\n\t\t(starts to go)\n\n\t\t\tO'NEILL\n\t\t(pleads)\n\tHey Bob, come on!  Talk to me hunh, it's your friend \n\tRed, I'm only asking you for three days chief ...\n\n\t\t\tBARNES\n\tI'm talking to you Red and I'm telling you no.  Get \n\tback to your position.\n\n\t\t\tO'NEILL\n\t\t(grabs him, desperate)\n\tBob, I gotta bad feeling about this, I ... I'm \n\ttelling you I got a bad feeling, man, I don't think \n\tI'm gonna make it .. y'know what I mean?\n\n\t\t\tBARNES\n\t\t(quietly)\n\t... everybody gotta die sometime Red ... Get back to \n\tyour foxhole.\n\nA look in his eyes.  Very remote, very cold, silencing O'Neill.  \nBarnes walks off.\n\nEXT. PERIMETER #3 - BATTALION LZ - DUSK\n\nAt the LZ, King runs out, gets on the last SUPPLY CHOPPER with \nsome other men.  It lifts off, swirling dust, the last rays of \ndaylight.\n\nChris watches from a Battalion CP area, waves back - the chopper \nsound receding in the horizon, the comparative silence of the \njungle now creeping up on the perimeter.  He turns and starts \nback to his foxhole.\n\nA man is watching him.  He's sitting on a sandbag, face in \nshadow.  It startles Chris, something about him.  Something \ndifferent.  A deep West Virginia drawl.\n\n\t\t\tSMOKING MAN\n\tGot a light?\n\n\t\t\tCHRIS\n\tUh sure ...\n\nGoes over reluctantly, flicks his lighter, cupping it from the \nwind.  The flame catches a sudden, uneasy expression in Chris' \nface as he sees the Smoking Man.\n\nWe come around and see what Chris sees in the light of the flame.  \nA face that smiles at him like a death's head, a large ugly \nblister on his mouth, whiskered, pale - but smiling.  A sick man \nwouldn't smile like this, but he is smiling too intimately, as if \nhe knows Chris from way back.  But he doesn't.  Or does he?  \nPerhaps it was the man Chris first saw at the airstrip when he \ncame in-country.  The same expression of evil, of a man who has \nseen too much and died, but still lives.\n\nChris feels an unnatural fear passing through him.\n\nThe Man stands, sucking on his cigarette, stretches.  He is thin \nand very tall, towering over Chris.\n\n\t\t\tSMOKING MAN\n\t... later.\n\nHe goes.  Chris watches him, wondering.  The man never looks \nback, a leisurely, confident stroll.  In that moment, there is an \nEXPLOSION from way out in the jungle, about a quarter of a mile.  \nThen another, then small arms fire.  Chris looks, knows.\n\nEXT. PERIMETER #3 - RHAH'S FOXHOLE - DUSK\n\nOn his foxhole, Junior listening to the distant firing.  Bunny is \nintrospective - talking to Junior as if he were his best friend, \nalthough they have nothing in common.\n\n\t\t\tBUNNY\n\t... y'know some of the things we done, I don't feel \n\tlike we done something wrong but sometimes y'know I \n\tget this bad feeling.  Not all that shit the \n\tChaplain's jamming up our ass 'bout the Good Lord ... \n\tjust a fucking bad feeling, y'know what I mean?  \n\tDon't know why.  I told the Chaplain the truth is I \n\treally like it here.  You do what you want, nobody \n\tfucks with you.  Only worry you got's dying and if \n\tdat happens you won't know about it anyway.  So what \n\tthe fuck ...\n\t\t(chuckles)\n\nJunior looks at him like he's really crazy.  Back to the distant \nfiring.\n\n\t\t\tJUNIOR\n\t\t(pissed now)\n\tFuck! I gotta be on this hole with YOU man.  I just \n\tknow I shouldna come!\n\nBunny finds it funny, laughs.\n\n\t\t\tBUNNY\n\tDon't you worry bout a thing Junior, you with Audie \n\tMurphy here, my man ...\n\nEXT. PERIMETER #3 - COMPANY CP - DUSK\n\nAt the Company CP, Captain Harris is talking urgently into the \nradio.\n\n\t\t\tHARRIS\n\tBravo Three Alpha!  Send me a grid.  Send me a grid, \n\tover!\n\nA young inexperienced VOICE screams back into the radio amid \nintense background FIRING filtered by radio and sounding \ndisembodied.\n\n\t\t\tRADIO VOICE\n\tWe're pinned down sir, they're in the fucking trees!  \n\tThe trees -\n\n\t\t\tHARRIS\n\tOK, Three Alpha, calm down now, son.  I'm gonna get \n\tyou a fire mission ASAP.  Smoke'll be first ...\n\n\t\t\tRADIO VOICE\n\t\t(panic)\n\tLieutenant's dead sir, radioman look dead sir, I \n\tdon't know where the map is Captain!  They're all \n\taround us sir.  They're moving!  Hundreds of em!  I \n\tcan hear em talking gook!!!  Jesus Christ!\n\n\t\t\tHARRIS\n\t\t(calming him)\n\t... Just spot the smoke son and tell me where to \n\tshift.  We'll get you out of there.  Just hang tough \n\tand tell me where the rounds hit, over.\n\nEXT. PERIMETER #3 - PLATOON CP - DUSK\n\nAt the Platoon CP, Barnes stands, legs akimbo, watching the \njungle, anticipating the coming fight as overhead we now hear the \n155 SHELLS whistle from a 10-mile distance - passing above them - \nthen pounding down into the jungle in the near distance.  Barnes \nturns, glances at Wolfe, smiles.\n\nEXT. PERIMETER #3 - COMPANY CP - DUSK\n\nAt the Company CP, Captain Harris is back on the radio.\n\n\t\t\tHARRIS\n\tBravo Three Alpha six.  How bout those rounds son?  \n\tCan you adjust fire?\n\t\t(waits)\n\tThree Alpha, if you can't talk, just key the handset \n\ttwice over.\n\t\t(waits)\n\nSilence, then a vague MURMURING - becoming clearer and clearer.  \nIt's in Vietnamese.  The radio is then bashed in, the sound like \nthunder in the Captain's ear.  He looks at his RTO, both of them \nshocked.\n\nEXT. NVA JUNGLE - NIGHT/DUSK\n\nIn the Jungle itself, the ENEMY is moving.  Flurries of movement \nand sound, blurred visuals.  Hands taping a piece of cloth to a \ntree, moving on - revealing a luminous arrow pointing left ... \nFigures moving past it.\n\nHands unraveling a thin wire waist-high, backwards.\n\nHands sliding along another wire.  We now see a moving helmet \nwith a luminous plaque on the back of it, leading a file up the \nwire.  To a Jump-off point about 50 yards outside the U.S. \nperimeter.  Figures crouch.  Whispers.  Movement.  A pen \nflashlight on a drawing of the foxhole positions.  The NVA moving \nout in several directions at once.\n\nEXT. PERIMETER #3 - CHRIS' FOXHOLE - NIGHT\n\nOn their foxhole, Chris and Francis wait anxiously.  Overhead the \nARTILLERY keeps pounding into the ambush area.  Now SMALL ARMS \nFIRE can be heard picking up at random spots along the perimeter.  \nThe battle, like a tide, is obviously moving closer to them.\n\n\t\t\tFRANCIS\n\tOh shit me I wish I was back in Memphis now, oooh \n\tbaby this is gonna be a motherfucker!\n\nChris says nothing.  Suddenly off to their right, about 80 yards, \na BLUE FIZZLE of light erupts.\n\n\t\t\tCHRIS\n\tTrip flares! ... Rodriguez's hole.\n\nRat-tat-tat-tat, rat-tat-tat.  Machine gun, outgoing, followed by \na sharp explosion.  A ROCKET!\n\n\t\t\tCHRIS (CONT'D)\n\tRPGs!  Shit!\n\n\t\t\tVOICE\n\t\t(crying)\n\tMEDIC!!  DOC!  DOC!\n\nA FIGURE thrashes up through the foliage behind them.\n\n\t\t\tRHAH\n\t\t(a fierce whisper)\n\tTaylor!  Francis!\n\n\t\t\tCHRIS\n\tOver here!\n\nRhah jumps into their hole with them, out of breath.\n\n\t\t\tCHRIS (CONT'D)\n\tRhah!  What's going on.  Rodriguez's hole just got \n\t...\n\n\t\t\tRHAH\n\t\t(gets his breath)\n\tOkay, here it is - one, we got gooks in the fuckin' \n\tperimeter.\n\n\t\t\tFRANCIS\n\tOh shit!  Dat's it, dat's it ...\n\n\t\t\tRHAH\n\tThey got through Alpha Company!  Anything behind you \n\tdon't identify itself, blow it away.  Two - air \n\tstrike's coming in.  They gonna lay snake and nape \n\tright on the perimeter so stay tight in your holes \n\tand don't leave 'em.\n\nFLARES now shoot up over the perimeter.  Reds, greens, yellows, \nsqueaking as they float doen on their parachute hinges throughout \nthe ensuing battle.  The perimeter is illuminated at spotty \nintervals - sometimes arctic bright, sometimes inexplainably dark \ntil new flares shoot up.\n\nChris, Francis, Rhah all look up at the light, and hug their \nholes even tighter, feeling naked in the light.  Flares cut both \nways.\n\n\t\t\tRHAH (CONT'D)\n\t... they're probing us, they gonna go up and down \n\tthis line all night trying to get through.  Stay cool \n\t... I'll be back ...\n\nRuns out of the foxhole.  Chris suddenly reacting to a noise out \nfront, gripping Francis and pointing to the sound.\n\nA BODY is thrashing towards them, about twenty-five yards, not \nyet visible but a little awkward and lungy in it's movement, as \nif desperate.\n\nFrancis, tense, is about to pop his grenade when Chris grabs him.\n\n\t\t\tCHRIS\n\tHold it!\n\t\t(loud whisper)\n\tWHO IS IT!\n\nBut the body keeps coming, lurching now, falling.\n\n\t\t\tFRANCIS\n\tCome on man!\n\n\t\t\tCHRIS\n\tNo!\n\nA POP! - then a fizzle of BLUE LIGHT as the Figure hits their \ntrip flare - revealing itself to be large, with no helmet, and \ngasping, terrified of the trip flare.\n\n\t\t\tTERRIFIED SOLDIER\n\tDON'T SHOOT!  DON'T SHOOT!\n\n\t\t\tCHRIS\n\tIt's the ambush!\n\t\t(calling out)\n\tIn here, man!  Hurry.\n\nThe SOLDIER now runs in like a fullback going down for the \ntackle, sprawling into the hole, knocking Chris and Francis down \nbeneath him.\n\nHe is sweating, terrified, a white boy with an unrecognizable, \nfilthy face, no rifle, no helmet, his fatigues torn all over.\n\n\t\t\tTERRIFIED SOLDIER\n\tWater!  Water!\n\nChris gives him his canteen, his shoulder and neck hurting from \nthe collision.  The Soldier sucks down the canteen.\n\n\t\t\tTERRIFIED SOLDIER (CONT'D)\n\t\t(between gulps)\n\tThey'se all over the place, hundreds of em moving \n\tthis way!  They wiped us out man, we didn't have a \n\tchance!  Where's the CP?\n\n\t\t\tFRANCIS\n\t\t(points)\n\tBack there.\n\nThe Soldier struggling out of the foxhole.\n\n\t\t\tTERRIFIED SOLDIER\n\tYou guys get outta here!  They're right on my ass and \n\tthey ain't stoppin' for shit!\n\nHe tears off, leaving Francis in a state of incipient panic.  He \nlooks at Chris.\n\n\t\t\tFRANCIS\n\tTaylor, let's di-di man!\n\nChris adjusting position, facing the front, anger in his voice.\n\n\t\t\tCHRIS\n\tYou go.\n\nFrancis hesitates, stays.\n\nINT. PERIMETER #3 - BATTALION CP - NIGHT\n\nAt the Battalion CP, the Major is inside his BUNKER, busy between \nhis radio nets.\n\n\t\t\tMAJOR\n\t\t(to RTO 1)\n\tGet me Bravo!\n\n\t\t\tRTO 2\n\tCharlie Company reports hand to hand on the perimeter \n\tsir.  Three holes are down.  They need help!\n\n\t\t\tMAJOR\n\t\t(looks at his watch, to his XO)\n\tOkay move two squads from Alpha down there.  Where's \n\tthat goddamn air strike, you bet your ass if we were \n\tthe First Cav they'd be here now.\n\n\t\t\tRTO 1\n\t\t(handing him the transmitter)\n\tBravo Six sir.\n\nEXT. PERIMETER #3 - BATTALION CP - NIGHT\n\nJust outside the Bunker, a MASTER SERGEANT spots something in the \nflarelight.  TWO FIGURES with helmets running towards him at an \nangle.\n\n\t\t\tMASTER SERGEANT\n\tHey you boys!  Which Company you ...\n\nA sudden burst of FIRE cuts the Sergeant down in his tracks and \nthe Figures fly by.\n\nSoldiers in the immediate area spot them.\n\n\t\t\tSOLDIER #3\n\tSAPPERS!\n\n\t\t\tSOLDIER #4\n\tTHE BUNKER!\n\nA burst of fire.  One of the RUNNING FIGURES goes down.  An \nExplosion engulfs him.\n\nINT. PERIMETER #3 - BATTALION CP - NIGHT\n\nBut the SECOND SAPPER runs right into the bunker in a kamikaze \ncharge, the light from inside momentarily revealing a bulky \nsatchel strapped on his person and the face of the astounded \nMajor.\n\n\t\t\tRTO 3\n\tSIR!!\n\nEXT. PERIMETER #3 BATTALION CP - NIGHT\n\nThe Bunker EXPLODES with a deafening roar.\n\nEXT. PERIMETER #3 - CHRIS' FOXHOLE - NIGHT\n\nIn their foxhole, Chris and Francis look at the curling ball of \nflame, stunned.\n\n\t\t\tCHRIS\n\tOh no!\n\nEXT. PERIMETER #3 COMPANY CP - NIGHT\n\nIn their foxhole, Chris points.\n\n\t\t\tCHRIS\n\tThere!\n\nSHAPES moving in the trees.  Chris blows his claymore handles.  \nOne explosion on top of the other out front.  Then return fire.  \nFlashes from a muzzle, rak-a-tak, rak-a-tak, rak-a-tak, the \nheavier sound of an AK-47.\n\nChris opening up with his 16.  Then being blown down by a grenade \nexplosion at the edge of the foxhole.  Then nothing.  A pause.  \nChris' ears ringing, slightly concussed.\n\nSuddenly from down the perimeter there is the sound of a faulty \nLOUDSPEAKER crackling out from the jungle.  A pidgen English, the \nwords mauled, then a snatch of patriotic North Vietnamese music, \nplayed from a scratchy old record.\n\nChris uneasy, looking at Francis who looks terrified.  The SOUND \nnow of a whistle.  Two hoots, then a sharp third.  Then yelling.\n\nChris grabbing Francis' arm, pointing.  There is a VOICE directly \nout to the front of them - muttering something in Vietnamese, no \nmore than 20 yards away but unseen.  It's like hearing a casual \nconversation from another room, then the sounds of several bodies \nmoving in separate directions - encompassing the foxhole.\n\n\t\t\tCHRIS (CONT'D)\n\t\t(to Francis, a whisper)\n\tOut of the hole!  Fast!\n\nChris crawls out, stops, looks back.  Francis won't leave, hugs \nthe shelter.\n\n\t\t\tCHRIS (CONT'D)\n\t\t(a fierce whisper)\n\tGoddamit Francis!  Move your fucking ass.  Now ... \n\tTHEY GONNA BLOW IT!\n\nReaches in and yanks him with all his strength half out of the \nhole.  Francis, finally sparked, now moves out.  Both of them \nbellying it into the brush behind the hole.\n\nNot a moment too soon.  An RPG ROCKET whistling in.\n\nThe FOXHOLE takes a direct hit, caving in, whirls of smoke \nspinning off it.\n\nChris and Francis look back covered with debris.  They hear \nmovement.\n\nSHADOWS are swarming towards the foxhole, firing into it to \nfinish them off.\n\nFrancis grabs Chris' leg, indicating they get out of there.  \nChris hesitates - a moment, a decision made now in angry passion \n- rises up and charges the NVA.\n\nSHADOWS scatter and tumble, caught by his surprise close-range \nfire.\n\nChris moving forward into them, blasting, agile, his instincts \nfinely tuned, and totally insane in this moment of time, \nindifferent to his life.  He YELLS insanities, pumping himself up \nwith the adrenaline of courage.\n\n\t\t\tCHRIS (CONT'D)\n\tDIE YOU MOTHERFUCKERS!!! YAAAAAAAAA!!!\n\nScreams from the dark shadows, they fall.\n\nChris smashing a wounded SHADOW with the butt of his gun down \ninto the foxhole.  He jumps back into it, reoccupying it.  \nBlasting the dead gook.\n\nOpening fire out to the front, driving the Shadows back.\n\nFrancis watching this, amazed.  After a moment of doubt, he too \ntears back out to join Chris in the foxhole, unbelieving, as he \njumps in with him.\n\n\t\t\tFRANCIS\n\t\t(joining in the frenzy)\n\tYAAAAAHHHH!!!!  KILLLLL!!!\n\nThen stunned again to see Chris suddenly rise up out of the \nfoxhole and charging forward into the jungle.  He is now over the \nedge.\n\n\t\t\tCHRIS\n\t\t(charging off into the jungle)\n\tDIE YOU MOTHERFUCKERS!!!\n\nEXT. PERIMETER #3 - BUNNY'S FOXHOLE - NIGHT\n\nIn his position, Bunny is experiencing the same 'high' as Chris, \nyells out at them.\n\n\t\t\tBUNNY\n\tCome on MOTHERFUCKERS, COME ON!!!\n\nJunior, huddled in the hole with him, speechless and terrified, \nlooks at him with huge eyes.  The guy is nuts.  An incoming \ngrenade explosion shakes the hole.\n\n\t\t\tBUNNY (CONT'D)\n\t\t(laying out more fire)\n\tCome on you can do better than that!\n\n\t\t\tJUNIOR\n\tFuck this shit!  I ain't dyin' in no white man's war!  \n\tIse didi-ing this motherfuckah!\n\nJunior freaks out, throws his rifle down and hobbles out of the \nhole on his damaged feet at an incredible speed.\n\n\t\t\tBUNNY\n\t\t(yelling after him)\n\tGet back here you gutless shit ...\n\nA SHAPE suddenly out of nowhere, looms up fast behind Bunny, \nrunning at him.\n\nJunior, insane now with fear, runs smack into a tree, knocked \nsenseless and reeling to the ground.\n\nBunny turning back too late.  The crazy drug-high Shape is \nyelling something like:\n\n\t\t\tNVA SOLDIER\n\tDiiiiikaaeeeeeee!\n\nAnd jumps right into the hole blasting Bunny point-blank in the \nchest.\n\nBunny struggling to consciousness at the bottom of the hole.  \nTHUCK!  A boot in the gaping hole where his chest was.  Bunny, \nhis eyes uncomprehending.  A muzzle is jammed into his mouth, \nbreaking his teeth with an ugly sound.  Another yell from the NVA \ntrooper.  A flash of orange red light.  Bunny's face blown to \nbits.\n\nJunior, dizzy from the blow to his head, looks up.\n\nA yellow flare somewhere out there and a SHADOW above him digging \na bayonet into his belly with a grunt.  A long oozing sigh of \nbelly gas.\n\nAn explosion.  The Shadow with the bayonet staggering blind \nwithout eyes, holding his brains with his hands.\n\nBarnes throws open the empty LAAW rocket casing he has just fired \noff and charges forward with a yell, cutting down another NVA in \nBunny's old foxhole.  Jumping into the hole, the bottom of which \nis a liquid pit of guts, blood, ooze.  Another Enemy running in \non him.  A short burst of fire.  Barnes hit.  Firing into each \nother.  Barnes draggin him down into the pit with him, grappling \nalongside the corpse of Bunny.  Barnes uses an entrenching tool \nto finish him off.\n\nEXT. PERIMETER #3 - PLATOON CP - NIGHT\n\nAt the Platoon CP, small arms fire is all over the place, the NVA \nclosing the ring.  Ace, in the foxhole, yells to Wolfe.\n\n\t\t\tACE\n\tNegative contact.  Can't raise Barnes, Two Bravo, Two \n\tCharlie, nothin'!\n\n\t\t\tWOLFE\n\tGet me Six!\n\nNervously aiming his rifle as a man comes running towards them, \nstaggering.\n\n\t\t\tACE\n\tIt's Doc!\n\nDoc plops down, out of breath, drained, bleeding all over his \nchest.\n\n\t\t\tDOC\n\tThey're coming through all over!  I can't ... I can't \n\tdo ...\n\n\t\t\tWOLFE\n\tWhere's Barnes!\n\n\t\t\tDOC\n\tI think he's dead ... it's awful, they're all dying.\n\nWolfe is stunned, Barnes his last crutch against the chaos.  Ace \nhanding him the handset.\n\n\t\t\tACE\n\tSix!\n\n\t\t\tCAPTAIN HARRIS' VOICE\n\tYeah!  Send traffic or clear this goddamn net!\n\n\t\t\tWOLFE\n\tWe've been overrun Captain, we're pulling back.  \n\tOver!\n\nEXT. PERIMETER #3 - COMPANY CP - NIGHT\n\nAt the Company CP, things are just as bad.  A Radioman is \nsprawled over a smashed radio.  Captain Harris is in a bunker \nworking the radios himself, as his Radiomen fire at yelling, \nrunning FIGURES scurrying all over the inner perimeter.\n\n\t\t\tHARRIS\n\t\t(furious voice)\n\tBravo Two, Six!  Goddamit where the hell you plannin' \n\tto pull back to!  They're all over the perimeter.  Be \n\tadvised Lieutenant, you WILL hold in place and you \n\twill FIGHT and that means YOU, Lieutenant.  Out!\n\nEXT. PERIMETER #3 - PLATOON CP - NIGHT\n\nAt the Platoon CP, Wolfe is astounded by the message.  Ace \nlooking at him straight in the eye.\n\n\t\t\tACE\n\tYou're an asshole Lieutenant, you know that.\n\nAs he abandons his radio, grabs up his 16 and moves to an \nadjacent position.  Doc, a quiet man up to now, is treating a \nwounded Parker who is now hit by bullets and thrashes wildly and \njerks to a stop.  He is obviously dead but Doc goes on trying to \nfinish the bandage.  Suddenly he goes beserk, grabs a 16, starts \nfiring and yelling.\n\nEXT. PERIMETER #3 - COMPANY CP - NIGHT\n\nAt the Company CP, Harris gets on the radio with the air strike.  \nOne of the RTOs on a separate radio calls over.\n\n\t\t\tRTO #5\n\tCaptain, Third Battalion Armoured's on its way with \n\ttracks 'bout 2 kliks west!\n\n\t\t\tHARRIS\n\t\t(ignores it, into radio)\n\tSnakebite leader, Ripper Bravo Six, we're gonna need \n\tyou soonest be advised I've got zips in the wire down \n\there, over!\n\n\t\t\tPILOT'S VOICE\n\t\t(distorted high frequency)\n\tRoger your last Bravo Six, Snakebite lead we can't \n\trun it any closer.  We're hot to trot and packing \n\tsnape and nape but we're bingo fuel.  It's your call, \n\tSix actual, Over.\n\nHarris looks around.  The decision made.\n\n\t\t\tHARRIS\n\tSnakebite leader, Bravo Six, for the record, it's my \n\tcall.  Dump everything you got left ON MY POS.  I say \n\tagain, I want all you're holding INSIDE the \n\tperimeter.  It's a lovely war.  Bravo Six Actual and \n\tOut.\n\nPilot's reaction.  Very calm.  A Farmboy twang.\n\n\t\t\tPILOT'S VOICE\n\tRoger your last Bravo Six.  We copy it's your call.  \n\tGet em in their holes down there.  Hang tough, Bravo \n\tSix we are coming cocked for treetops.  Whiskey to \n\tEcho ... Snakebite Two, this is lead.  Last pass on \n\tzero niner.  Watch my smoke to target, expend all \n\tremaining.  Follow my trace ...\n\nThe transmission drops out.  Harris now looking up into the \ndarkened skies.  The planes in no way evident - but they're \nthere.  And they're coming.\n\nEXT. PERIMETER #3 - PLATOON CP - NIGHT\n\nAt the Platoon CP, the NVA are sweeping fast, crouched, using \ncover, yelling.  Small fires are raging all over the perimeter.\n\nAce putting out fire, is hit.  The NVA are coming over his \nsandbags.  A burst of fire.  Ace goes down.\n\nDoc has cracked up, firing at anything, indifferent to his \nsafety.  One of the NVA goes down.  The Doc is hit in the side, \nwounded, struggles, is hit again, but keeps trying to fire.  He's \nhit a third time - in the jugular vein.  Nearby, Wolfe is firing \nmadly at the oncoming NVA.  One goes down.  A second is wounded, \nyelling in pain.  Wolfe reloading his 16, popping up, too late.  \nOne of them is coming over the sandbags.  He sees Wolfe.  Wolfe \nsees him.  In the same moment.\n\nWolfe hesitates, frozen up.  The gook unloads his AK-47, a \nmagazine worth, into Lieutenant Wolfe, who crashes down, sprawled \nunnaturally on the jungle floor.  A spasm shakes his body.  Then \nstops.  Dead.\n\nBoots run by.\n\nEXT. PERIMETER #3 - O'NEILL'S FOXHOLE - NIGHT\n\nAt his foxhole, O'Neill peeks up out of the hole.  Several NVA \nare darting through the jungle 20 yards away, coming towards him, \ntalking loudly to each other.  He quickly slips back down in the \nhole, entwining himself with the approaching NVA, clinking metal.\n\nThe NVA stop, glance in the hole.  Something is muttered.  They \nrun out.\n\nO'Neill opens his eyes, breathes.\n\nEXT. PERIMETER #3 - BARNES' FOXHOLE - NIGHT\n\nBARNES swings his mashed M-16 full into the FACE of an enemy \nSOLDIER who screams and goes down, Barnes chopping at him with \nhis club.  His helmet is gone, his shirt ripped to shreds, his \nshoulder bleeding, making his last stand against the hated Gooks.\n\nNearby HUFFMEISTER is hit in the shoulder by a running FIGURE and \ncollapses into the bottom of the foxhole, crying out in pain.\n\nThe running FIGURE runs past right into the full force of BARNES' \nswinging rifle.  SMACK!  He crumples.\n\nINTERCUT\n\nChris bellies into the area, see Barnes, recognizes him, amazed.\n\nAn ENEMY fires, taking Barnes high in the left thigh.  A patch of \nskin blowing off.  Barnes rigidly goes down on his left knee like \na wounded horse.  Holds there, staring into the Enemy, waiting \nfor the coup de grace.\n\nA series of SHOUTS and the Enemy staggers dead as:\n\nChris lays out a curtain of fire.  A GRENADE goes off near him, \nblowing off his helmet.  Dazed, Chris rushes forward firing from \nthe hip - sucked into Barnes' suicidal vacuum.  He cuts down an \nEnemy as:\n\nBarnes, given a new lease, limps angrily forward and tackles a \nwounded Enemy trying to crawl away, terrified at the sight of \nBarnes coming after him.  Barnes lets out a vivid scream.\n\nAnd beats the soldier mercilessly, half the stock of his M-16 \nflying apart broken.\n\nChris swivels alert on his knees.  A pause.  No more enemy.  \nTurns to Barnes, his back to Chris still beating at the dead \ncorpse.\n\n\t\t\tCHRIS\n\tBarnes!\n\nBarnes swivels instinctively off the corpse and for a petrifying \nmoment Chris sees:\n\nA maddened scar of a face, lips specked with foam.  The EYES - \nrefracted in a red-green flare overhead - the pupils distorted \ninto angry red points.\n\nFor Chris it is no doubt the most frightening single image he has \nseen in his life.  It will be in his nightmares forever.  The \nessence of evil: wrath, obsession, anger, fear, hatred, \npermanence - he is paralyzed.\n\nBarnes smashes him full across the face with the broken stock of \nhis M-16.  Not even conciously, for at this point, his mind has \ngone over the edge and the entire world is his enemy.  American \nor Vietnamese, it makes no difference as he strikes Chris harder \nand harder.\n\nChris struggles, moans, his teeth and nose cracked.  Barnes emits \nanother chilling yell an springs like a humpback up on his good \nright leg, the left bent - set to deliver the killing blow, the \nmangled rifle pulled to its highest arc.\n\n\t\t\tCHRIS (CONT'D)\n\tNooooooooo!\n\nThe PHANTOM FIGHTER JET comes now like a great white whale.  One \nbig beautiful monstrous beat of deafening sound.  Its silver and \nwhite belly hurtling low over the treeline in one giant leap of \nsound momentarily illuminated by a flare.  Then a monstrous ROAR \nof anger.\n\nThe bomb ripping Barnes off the body of Chris and spitting Chris \nacross the jungle floor - crashing into a tree some 30 yards \naway.\n\nFADE OUT\n\nEXT. PERIMETER #3 - CHRIS' JUNGLE - DAWN\n\nFADE BACK IN.  Vague sunlight.  Blurry. Chris fluttering his \neyes.  A sharp MOVEMENT in the bush.  His eyes fight their way \nopen.\n\nSOFT EYES are watching him from behind foliage.  A soft, furry \nhead, alert, rigidly still.\n\nChris fights his way up to his elbow, in pain, looking at the \neyes.  The head turns and in one fluid move, bolts.  Gone.  Like \nthe wind.  A deer.  A big brown deer.  Or was it?  Chris will \nnever be quite sure.  But whatever it was, it was surely a sign \nof grace - the grace of Elias.  This he knows as he feels himself \nfor the first time alive.\n\nAnd in pain.  His left hand torn and bleeding, shrapnel in his \nside, cuts on his face, dried blood caking him.  Looking around \nhis garden of eden.  A messy jungle floor.  Cordite fumes.  \nBurned bush and trees.  Torn sandbags.  Dead NVA.  Bird songs \nsomewhere in the distance.  It is the very crack of dawn, a pink-\nred sun casting long oblique light patterns through the trees.  A \nholy light.\n\nChris pushes himself to his feet, feels his weight and the pain.  \nHe walks.  In the near distance, towards the LZ area, there's the \nsound of Armored Personnel carriers grinding, men moving, calling \nout in Americanese.  But Chris is alone here.\n\nHe fishes up an AK-47 from a dead NVA.  Checks it, a weapon.  \nWalks on.\n\nEXT. PERIMETER #3 - BARNES' FOXHOLE - DAY\n\nPast scores of NVA bodies.  Past the Foxhole where Bunny lays \ndead in the bottom, faceless.  Looking over at Junior bayoneted \nto the ground, dead.  NVA everywhere around the hole, some of \nthem still moving, badly wounded.\n\nChris looking around, then noticing a movement a little further \nout in the Jungle.  Then he sees who.\n\nThe uniform is shredded, the figure obviously hurt in several \nplaces (thigh, back, neck, hand) but not mortally so, now \nstruggling to right itself, dragging its face up from a belly-\ndown position.  Streaked with dirt and blood, we see Barnes once \nagain re-emerging from the dead.\n\nChris steps over to him, a solemn look on his face.  Barnes looks \nup, begs.\n\n\t\t\tBARNES\n\tGet me a Medic will ya.  Go on ...\n\nChris doesn't move.  Barnes looks at him again, reading the \nintention that has crossed Chris' mind.  An expression of \nsurprise crosses his face, then amazement, almost shock.\n\n\t\t\tBARNES (CONT'D)\n\tFuck you in hell ...\n\nChris shoots him.  Once.  Twice.  Three times.  Silence ...\n\nBarnes is finally dead.\n\nChris looking at the corpse, numbed, no exultation in his \nexpression.  Just cold satisfaction and little feeling left.\n\nBehind him, the SOUND of a big machine moving.  He turns.\n\nA huge Nazi flag on an antenna looms up in the bush, followed by \nthe great belly of a turreted dragon crunching down a tree for \nits breakfast.\n\nA big tough GERMAN SHEPARD comes boudning at him sniffs, followed \nby a flak-jacketed MONSTER MAN - filthy and greasy, unshaven \nface, earring in his left ear, 'DEATH CORPS' scrawled on his \nshirtless flak jacket and a drawing of a death's head, he looks \nlike a cross between a pirate and a hell's angel.  Behind him, a \nSECOND MONSTER MAN and the ARMORED PERSONNEL CARRIER grinding its \nengine, a human skull hanging from its turret.\n\n\t\t\tMONSTER MAN\n\t\t(to Dog)\n\tBozo!  Get back here!\n\nHis eyes passing on Chris like so much meat.\n\n\t\t\tMONSTER MAN (CONT'D)\n\t\t(to Chris)\n\tCan you walk outta here?\n\nChris nods.  The Soldier pointing to the LZ behind him as a sign \nhe should go that way.  The other Soldier already stripping the \nNVA dead, as the APC grinds on into the jungle, reconnoitering.\n\nChris walks out of the jungle, head bowed, nauseated, mixed \nfeelings roiling him.\n\nEXT. PERIMETER #3 - FRANCIS' FOXHOLE - DAY\n\nIn another foxhole, Francis waits, the sounds of the approaching \nAPC cutting through.  He thinks about it a moment.  It must be \nfast.  It must be a hard cold decision.  Now!\n\nHe pulls out his K-bar and with one last anguished hesitation, \ndrives it into his thigh muscle.\n\nFrancis yells out and collapses in his hole.\n\nEXT. PERIMETER #3 - O'NEILL'S FOXHOLE - DAY\n\nIn another foxhole, O'Neill, unscratched but covered with dirt, \nwaits tentatively as SOLDIERS arrive at his hole.  They're a \nlittle awed by the sight of the tough-looking O'Neill emerging \nfrom his foxhole like Sgt.Rock, dozens of dead NVA littered \naround him.\n\n\t\t\tAPC SOLDIER #1\n\tYou alone Sarge?\n\n\t\t\tO'NEILL\n\tFuck yeah.  They all left me, bunch of fuckin' \nfaggots.\n\n\t\t\tAPC SOLDIER #2\n\tMan, you gonna get yoself a silver star.\n\n\t\t\tO'NEILL\n\tFuck the silver star.  You got any booze?\n\nEXT. PERIMETER #3 - RHAH'S FOXHOLE - DAY\n\nRhah, alive and well, is poking around the NVA corpses with a \nlong gnarled walking stick, looking like a crazy Johnny Appleseed \nwith his pants rolled up on his thin hairy ankles and wearing a \nred bandana tied in a four-knot around his head.\n\nAs one of the APC SOLDIERS carves an ear off a dead NVA, Rhah \nworks his way through the torn bloody pocket of an NVA Troop in \nfull rigor mortis, extracting what he thought was there - a \nwrapped cellophane of heroin.\n\nRhah's face glows with satisfaction as he tastes it, then snorts \nit.  With a certain satisfaction of triumph over the grim \ncircumstances.\n\n\t\t\tRHAH\n\t\t(to the powder)\n\tYeah, that's good shit ...\n\nEXT. PERIMETER #3 - LZ - DAY\n\nCHRIS is hauled out on a litter.  Morphined, his eyes watching it \nall from somewhere deep in his brain.  Passing:\n\nGroups of SOLDIERS looking like bowery bums and moving like rats \nthrough the smoke and garbage snooping for souvenirs with wheezy \ntired eyes and grunts of greed.\n\nPassing a bulldozed PIT with heaps of NVA BODIES in them.  a \nBULLDOZER pushing another set of bodies in, like photos of a Nazi \ndeath camp.\n\nNearby, two burly SOLDIERS lift a WOMAN NURSE and with a once-\nthrough build for momentum, toss the fresh body into the pit.\n\nChris, numb, goes by.\n\n\t\t\tRADIO OPERATOR\n\t\t(into radio, exhausted)\n\t- 37 U.S. KIA, 122 wounded and still counting.  \n\tEstimate 500 Victor Charlie KIA, 22 wounded and still \n\tcounting.  Over.\n\n\t\t\t2ND RADIO OPERATOR\n\tSir, a television crew's coming in with the General -\n\nCAPTAIN HARRIS doesn't respond; at this point he doesn't give a \nshit, standing apart from the radios looking numbly at the \nremnants of his boys filtering by on litters.\n\nChris intersects him now, Harris' eyes looking blankly, then \nnodding sickly trying to give him encouragement.  Just coming to \nthe edge of tears, choking it back, and turning back.  These are \nhis sons who are lost.  A good officer.\n\nRodriguez, wounded, is lifted up in his litter and moved out to \nthe waiting MEDIVAC CHOPPER, a huge red cross painted on a white \nsquare.\n\nDoc goes by on another litter, then Ace, Adams, Huffmeister, etc.\n\nThen Francis is littered by, bandages around his leg, a big smile \non his face.\n\n\t\t\tFRANCIS\n\tHey Taylor, you okay man?\n\n\t\t\tCHRIS\n\tYeah.  How 'bout you?\n\n\t\t\tFRANCIS\n\tJes' fine man, jes fine!  Ain't never felt better!  \n\tBoth of us two timers man, we're out.\n\t\t(gives him a slap as he goes by)\n\tSee you at the hospital man, we gonna get high-high \n\tyessir ...\n\t\t(goes off)\n\nThe Medic points to the chopper.\n\n\t\t\tMEDIC\n\t\t(to Chris)\n\tThat's your ride man, you ready?\n\n\t\t\tCHRIS\n\t\t(tries a smile)\n\tYou bet.\n\nChris starts towards it, the Medic assisting him.\n\nEXT. PERIMETER #3 - LZ - DAY\n\nSgt.O'Neill watches the loading process forlornly from the \ndistance.  Captain Harris intersects him.\n\n\t\t\tHARRIS\n\tYou got Second Platoon Sergeant.\n\n\t\t\tO'NEILL\n\t\t(reflexively)\n\tYes sir -\n\nAnd as Harris moves away, O'Neill is left thinking.  Finally \nthere is a certain frustration to his actions; he has taken such \ngreat pains to stay alive that the tuition he pays is precisely \nto stay in this Jungle.  Inevitably his time will come - one way \nor another.\n\nHis eyes now follow the MEDIVAC CHOPPER upwards, whatever is left \nof his shrunken soul yearning to go with it.\n\nEXT/INT: PERIMETER #3 LZ CHOPPER - DAY\n\nAs the Chopper rises off the battlefield, Chris, who is sitting \nat the edge so that he has a full view out the open door, waves \nback at Rhah.\n\nEXT. PERIMETER #3 - DAY\n\nRhah, at the edge of the treeline, vigorously shakes his walking \nstick at him, his other hand a fist, waving them, emitting his \ncry.\n\n\t\t\tRHAH\n\tBaaaaaaaaa!!!!!!\n\nDefiance.  Pride.  Dig me, I'm Rhah - and there isn't nobody like \nme in the world.\n\nEXT/INT: PERIMETER #3 - LZ CHOPPER - DAY\n\nThe chopper - with its huge red cross painted on - now rising to \nmeet God.  Smashed on morphine, Chris looking out at the waving \nants below.\n\nNow the trees, the skyline and the chopper is moving fast over \nthe devestation.  The jungle forever locked in his memory, Chris \nlooks back, copious, quiet tears flowing from his eyes.\n\n\t\t\tCHRIS (V.O.)\n\tI think now, looking back, we did not fight the \n\tenemy, we fought ourselves - and the enemy was in us \n\t... The war is over for me now, but it will always be \n\tthere - the rest of my days.  As I am sure Elias will \n\tbe - fighting with Barnes for what Rhah called \n\tpossession of my soul ... There are times since I \n\thave felt like the child born of those two fathers \n\t... but be that as it may, those of us who did make \n\tit have an obligation to build again, to teach to \n\tothers what we know and to try with what's left of \n\tour lives to find a goodness and meaning to this life \n\t...\n\nThe music surges now to its full strength as we replay bits of \nfilm with each actor's name listed - some with silly, clowning \nlooks, others sober, haunted.  Gardner, Tex, King, Rhah, Lerner, \nSanderson, Manny, Big Harold - all the boys ... and then Barnes \nstaring quietly into the camera, and lastly Elias - shirt off, \nbowl of grass in hand, his big, beautiful smile.\n\n\tFADE OUT:\n\n\n   \n\n\n\n\n\n\n\nPlatoon\nWriters :   Oliver Stone\nGenres :   Action  Drama  War\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In 1967, Chris Taylor has dropped out of college, enlisted in the U.S. Army and volunteered for combat duty in Vietnam. Assigned to a Bravo Company in the 25th Infantry Division near the Cambodian border, he is quickly worn down by the exhausting conditions, and his enthusiasm for the war wanes. One night his unit is set upon by a group of North Vietnamese Army (NVA) soldiers, who retreat after a brief confrontation. New recruit Gardner is killed while another soldier, Tex, is maimed by friendly fire. Taylor is reprimanded by the ruthless Staff Sergeant Barnes for falling asleep during watch, after being implicated by one of the veterans. Taylor eventually gains acceptance from a tight-knit group in his unit who socialize and use drugs in a bunker clubhouse at their base. He finds mentors in King and the loyal Sergeant Elias and becomes friends with other soldiers, including Lerner, Rhah, and Manny.\nDuring a patrol, Manny is found mutilated and tied to a post while two others, Sal, and Sandy, are killed by a booby trap in a bunker. As tension mounts, the platoon soon reaches a nearby village where a supply cache is discovered. Using Lerner as a translator, Barnes interrogates the village chief to determine if they have been aiding the NVA. Despite the villagers' adamant denials, Barnes impulsively shoots and kills the chief's wife. He then holds the chief's daughter at gunpoint, threatening to kill her as well if the villagers do not reveal what they know. Elias arrives and is furious with Barnes' behavior. A brawl between the duo ensues, which is ended by the timid platoon commander, Lieutenant Wolfe, who orders the men to leave with the villagers, destroy the enemy supplies and burn the village down. As they leave, Taylor stops a group of soldiers from gang raping two girls.\nUpon returning to base, Captain Harris warns that if he finds out that an illegal killing took place, a court-martial will be ordered, which concerns Barnes who anticipates that Elias will testify against him. On their next patrol, the platoon is ambushed and pinned down in a firefight, in which numerous soldiers, including Lerner and Big Harold, are wounded. Lerner is taken back to the helicopter landing area while Wolfe calls in a mortar strike on incorrect coordinates, resulting in many friendly fire casualties. Elias takes Taylor, Crawford, and Rhah to intercept flanking enemy troops. Barnes orders the rest of the platoon to retreat and goes back into the jungle to find Elias' group. Barnes finds Elias and shoots him, then returns to tell the others that Elias was killed by the enemy. While the platoon is extracting, they glimpse Elias, mortally wounded, emerging from the treeline and being chased by a group of North Vietnamese soldiers, who kill Elias. From Barnes' anxious manner, Taylor realizes that his account of what happened to Elias isn't true. At the base, Taylor is convinced that Barnes is responsible for Elias's death. He attempts to talk his group into fragging Barnes in retaliation when Barnes, intoxicated, enters the room and taunts them. Taylor assaults Barnes but is quickly overpowered. Barnes cuts Taylor near his eye with a push dagger before departing.\nThe platoon is sent back to the combat area to maintain defensive positions, where Taylor shares a foxhole with Francis. That night, a major NVA assault occurs, and the defensive lines are broken. Much of the platoon, Including Bunny, Junior, and Wolfe, are killed in the ensuing battle. During the attack, an NVA sapper armed with explosives rushes into battalion headquarters, self-detonating and killing everyone inside. Meanwhile, Captain Harris, the company commander, orders his air support to expend all remaining ordnance inside his perimeter. During the chaos, Taylor encounters Barnes, who is wounded and driven to insanity. Just as Barnes is about to kill Taylor, both men are knocked unconscious by an air strike. Taylor regains consciousness the following morning, picks up an enemy Type 56 rifle, and finds Barnes, who orders Taylor to call a medic. Seeing that Taylor will not help him, Barnes mockingly tells Taylor to pull the trigger. Taylor then shoots Barnes, killing him. He then sits until reinforcements arrive and find him. Francis, who survived the battle unharmed, deliberately stabs himself in the leg and reminds Taylor that because they have been twice wounded, they can return home. The helicopter flies away and Taylor, overwhelmed, weeps as he stares down at multiple craters full of corpses, friend and foe alike."}