{"title": "Public Enemies", "full_text": "PUBLIC ENEMIES\n\n\n                                  Written by\n\n                 Ronan Bennett, Michael Mann & Ann Eiderman\n\n\n\n\n\n                                                        November, 2007\n\n          \n\n          1\n\n          TITLE: SEPTEMBER 26, 1933.\n\n           EXT. PRICK STREETS OF MICHIGAN CITY, INDIANA - A BROWN\n\n\n          PONTIAC\n           is parked at the curb. It waits.\n\n          INT. PONTIAC - \"RED\" HAMILTON ( 34)\n\n           looks at his watch. With his meticulously parted red hair, he\n           might be a bank president. It's 6:55 a.m.\n\n          HAMILTON\n          Time.\n          Thirty year old JOHN HERBERT DILLINGER is in the backseat. He\n          nods. His arms are behind him. We don't know why. Red starts\n          the car and drives forward.\n\n          CUT TO:\n\n          INT. INDIANA STATE PRISON, MICHIGAN CITY, INDIANA - LINE OF\n\n\n          CONVICTS\n          Its cold.-Convicts' uniforms are broadly striped and frayed.\n          This is a line of hard men branded by prison: shorn hair,\n          broken nose, eyes with a cold ferocity. And their aggression\n          has a nihilistic edge; their spirits never surrender. There's\n          nothing beaten down about these men. Like Alcatraz,\n          Leavenworth, and Sing Sing, this is the end of the line.\n\n          PRISON GUARDS\n          in visored black caps, black shirts, black patent leather Sam\n          Browne belts with three-foot long billy clubs watch the line,\n          poised to unleash violence.\n\n          AMONG THE HARD MEN ARE...\n          HARRY \"PETE\" PIERPONT (32), 6 foot 1 with eerie blue eyes.\n           Brilliant, violent, he hates all authority.\n          CHARLES MAKLEY ( 44), squat with an anvil jaw, facial scars\n           and as calm as Pierpont is volatile.\n          HOMER VAN METER (27), tall, an incorrigible clown and an\n          unemotional killer. He has continued to ridicule guards even\n          when it cost him months in the hole.\n\n          THESE THREE\n          with an older man, WALTER DIETRICH, wait for the lam. work\n          call to the prison Shirt Factory...\n\n          \n\n          \n\n          \n\n          \n\n          2.\n\n          INT. INDIANA STATE PRISON, GATEHOUSE - TURNKEY\n\n          watches through a window as a Pontiac pulls into the parking\n          area in front of the prison across from the streetcar tracks.\n          Hamilton jerks a handcuffed Dillinger out of the backseat.\n          Dillinger is shoved forward. Hamilton's wearing a star.\n\n          TURNKEY\n          (opening up)\n          Afternoon.\n          Hamilton flashes the badge. He shoves Dillinger inside. In an\n          adjacent room FIVE GUARDS play poker. Next to them is a\n          barred entrance to the prison yard. As the cage door locks\n          behind him, this is the last place Dillinger wants to have\n          entered. Meanwhile...\n\n          INT. INDIANA STATE PRISON - THE SHIRT FACTORY: STACKS OF\n\n\n          BOXES\n          and bolts of fabric wait for the convicts. lam. A KLAXON\n          sounds. Door opens. Convicts enter. Walter Dietrich goes\n          right to the stacks and pulls a box with an \"X\" crayoned on\n          the side. Its labeled \"Thread.\"\n          (Dietrich was mentored by Herbert K. Lamm, an ex-Prussian\n          soldier who invented professional bank robbery by applying\n          military tactics and who rode with Butch & Sundanc4's Hole in\n          the Wall Gang in Utah in 1901. in prison Dietrich passed on\n          Lamm's techniques. His brightest student in 1933 is..'ohn\n          Herbert Dillinger.)\n\n          DIETRICH + \"THREAD\" BOX\n           arrive at a busy work station with Pierpont, Makley and Van\n          Meter. Under spools are four Colt 45 automatics with loaded\n          magazines.\n\n          GUARD DAINARD\n           is approached by Pierpont, who shoves the 45 in his face.\n\n           PIERPONT\n           Line up! Line up...\n           Dietrich and Van Meter control THREE OTHER GUARDS. ED SHOUSE,\n           JIM LESLIE and EARL ADAMS - three other Cons armed with\n           makeshift clubs and spivs -- join the escape. Meanwhile...\n\n          INT. GATEHOUSE - TURNKEY\n\n          examines Dillinger a second time...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          3\n\n          CONTINUED:\n\n          TURNKEY\n          Didn't you get paroled out of here a few\n          months ago?\n\n          DILLINGER\n          Yes, sir. Three months ago.\n\n          TURNKEY\n          . John... Johnnie Dillinger?\n\n          DILLINGER\n          That's right. But my friends call me\n          \"Johnnie\". You gotta address me as\n          \"Mister\" Dillinger.\n          Dillinger's insubordination puzzles Turnkey so he doesn't see\n          Hamilton bat a Thompson submachine gun across the back of his\n          head and swing it onto the Two Guards...\n\n          RED/DILLINGER\n          Against the wall! Hands up! Get up!\n          Dillinger's cuffs fell away. Now his Thompson covers the\n          stunned pokerÂ°players. Hamilton and Dillinger are as tight as\n          they come.- They share their food, money, liquor, ammunition\n          and women. ,.id right now...\n\n          YARD GATE\n          is keyed open by Dainard followed by Pierpont and Makley and\n          the others. Pierpont kicks over the poker table. Escapees\n          throw all the Guards against the wall.\n\n          MAKLEY/VAN METER\n          (to the Guards)\n          Undress. Get undressed!\n\n          DILLINGER\n          at the window checks the escape route to the Pontiac. Its\n          clear.\n          Hamilton conceals his weapon and starts out. Smooth. He\n          crosses the front lawn, the street car tracks. So far, so\n          good...\n\n          INT. GATE HOUSE - GUARDS\n\n          undress. One takes his time.\n\n          SHOUSE\n          Hurry up! C'mon!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          4\n\n          CONTINUED:\n          This Guard gives Shouse an insolent look. Shouse slams the\n          Guard's head with a length of steel pipe. Guard goes down.\n          Shouse goes wild and continues to hammer his skull again and\n          again, caving it in.\n\n          PIERPONT\n          Cut it out Shouse!\n\n          DILLINGER\n          (turns from open door)\n          Shouse!I\n          Dainard thinks that once the killing's begun, he will die...\n          So, he grabs for Homer Van Meter's .45.\n          Van Meter SHOOTS Dainard. Dainard's knocked to the floor.\n          Blood pools. A SIREN SCREAMS.\n\n          EXT. FRONT YARD - RED\n\n          caught in the open, turns. He scans the guard towers on the\n          East and West corners. He backs towards his Pontiac.\n          RED'S POV: TOWER GUARDS look into the prison interior where\n          the shots came from.\n\n          DILLINGER\n          arrives, takes Red's position. Red goes for the Pon,.c...\n\n          ESCAPEES\n          don't complete their disguises. Half-dressed in gua ds'\n          uniforms, they crash outside...\n\n          EXT. FRONT YARD - ESCAPEES\n\n          sprint for the street in all directions.\n\n          INT. WEST TOWER - TOWER GUARDS #1 + #2\n\n          CRACK CRACK CRACK! Jim Leslie falls, the top of his head\n          taken off.\n\n          EXT. FRONT YARD - DILLINGER\n\n          FIRES at the tower, forcing the Guards to cover. Hamilton's\n          in the Pontiac, starting it.\n\n          PIERPONT' S\n          running with the older Dietrich across the grass FIRING his\n\n          45.\n\n          \n\n          \n\n          \n\n          \n\n          INT. RED'S PONTIAC - MANLEY + SHOUSE\n\n           tumble in. Dillinger and Van Meter - outside - FIRE at the\n          West Tower.\n\n          PIERPONT + DIETRICH\n          arrive.\n\n          EXT. STREET - PONTIAC\n\n          takes off. Dillinger's on the running board. His Thompson\n          ROARS, covering Pierpont, who's hauling Dietrich into the\n          backseat.\n\n          BANG!\n          Dietrich is hit in the neck by rifle FIRE from the East\n          Tower.\n\n          DILLINGER\n          Walter!\n          Dillinger falls away. Dillinger and Pierpont grab Walter's\n          arms. He's-paralyzed now. They try to pull him onto the\n          running boafd, of the moving car.\n          Dietrich's\"hcpeful eyes look up at them. Then his eyes glaze\n          over. His feet drag down the street. He's dead and they know\n          it. They let go.\n\n          EXT. STREET - DIETRICH'S\n\n          body remains in the center of the street. The Pontiac picks\n          up speed.\n\n          INT. PONTIAC - HAMILTON\n\n          drives like he has no nerves. Totally focused. Hamilton is\n          the best getaway, or \"git\" driver in the country.\n\n          DILLIN GER' S\n          Thompson empty, he grabs Red's shotgun. He shoves it into\n          Shouse's chest in the backseat.\n\n          DILLINGER\n          Walter's dead 'cause you screwed it up,\n          you son of a bitch!\n\n          SHOUSE\n          The bastard wouldn't do what he was told,\n          Johnny. .Pete? Homer?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          6.\n\n          CONTINUED:\n\n          VAN METER\n          Let him have it.\n\n          PIERPONT\n          Dietrich was your pal, up to you.\n          Dillinger sees the abject fear in Shouse's eyes. And\n          Dillinger's mood swings. He lowers the shotgun... Then, he\n          snaps the butt across Shouse's face. Breaks Shouse's\n          cheekbone. Dillinger pulls back and slams the heavy butt dead\n          center, smashing Shouse's nose and orbital socket. Dillinger\n          opens the door and kicks Shouse out of the moving car.\n\n          EXT. FARM ROAD - SHOUSE\n\n          bounces and rolls across the road into a field. The Pontiac\n          races away into the distance.\n\n          CUT TO:\n\n          EXT. PERU, INDIANA - CROSSROADS - LATER\n\n          It's Dust Bowl America. 1933. Lunar landscape. CAMERA MOVES\n          ACROSS brown dunes that half cover farm machinery and a wind-\n          blasted house. And LANDS ON...\n          JOHN DILLINGER in shirt sleeves and, a vest watchingthe roads\n          for pursuit.\n\n          INT. FARM HOUSE -- PIERPONT, MAKLEY + VAN METER\n\n          change into double breasted suits and shovel down hot cereal\n          at a kitchen table. They're in a rush. There is no ;Â£yurniture.\n          A busted-out farmer, EDWIN NORRIS, hurriedly pours coffee\n          from a kettle into tin mugs and a thermos. A WOMAN at a stove\n          fries eggs.\n\n          PIERPONT\n          (ready to go)\n          okay...?\n\n          EXT. FARM -- A TODDLER\n\n          wearing a torn smock approaches the Pontiac and a second car,\n          a dust-covered Plymouth parked behind it.\n\n          HAMILTON\n          (from the house)\n          Johnny...? Ready.\n\n          \n\n          \n\n          \n\n          \n\n          7\n\n          THE WOMAN\n           brings out the dozen fried egg sandwiches wrapped in\n          newspaper. She looks 40 but is 20. Edwin Norris is at the\n          door.\n\n          DILLINGER\n          (takes two)\n          Thank you, ma'am.\n          Dillinger's lopsided smile is charming.\n\n          EDWIN NORRIS\n          Its Miss. She's my daughter, Viola.\n          That'll be eight dollars.\n          Viola retrieves her toddler brother who's crawled into the\n          Pontiac. Dellinger peels off a $20 bill.\n\n          EDWIN NORRIS (CONT'D)\n          Can't change that...\n\n           DILLINGER\n           Well, then you keep the change.\n          $12 is a lot'--'of money in 1933. Grateful, Norris goes inside,\n           Dillinger passes Viola and the struggling toddler on the way\n          to the Pontiac,\n\n          VIOLA\n\n          (LOW)\n          Take me with you, mister.\n          She puts a hand on his forearm.\n\n          DILLINGER\n          I'm sorry, honey.\n           Pierpont, Homer and Makley head towards the Plymouth.\n\n          INT. PONTIAC - DILLINGER,\n\n          as the Pontiac pulls away, looks back to see Viola wistfully\n          watching them leave. The toddler reaches for Viola's hand.\n          She pushes the child away. Dellinger hates seeing the kid\n          rejected.\n\n          HAMILTON\n          Kid didn't fool with anything, did he?\n          Dillinger, looking back at the boy, hasn't heard.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          8.\n\n          CONTINUED:\n\n          HAMILTON (CONT'D)\n          Johnnie? All there?\n          Dillinger lifts the coats on the backseat: their weapons are\n          as they were.\n\n          DILLINGER\n          Its all here.\n\n          (UPBEAT)\n          Let's go make some money.\n          The speeding cars throw up tails of dust as they drive west\n          to Chicago.\n\n          CUT TO:\n\n          EXT. THICK WOODS NEAR EAST LIVERPOOL, OHIO - A MAN - DAY\n\n          moves quickly through the woods. They run downhill. He wears\n          expensive hunting clothes. He carries an 8mm Mauser sports\n          rifle with a slim forestock and wrist and a turned-down bolt\n           handle. It's the best rifle made in 1933.\n\n          HE IS MELVIN PURVIS (30)\n          cleancut and handsome. A square jaw. Chester Gould modelled\n          Dick Tracy's profile after Purvis. Has not big, but he's\n          tenacious. He's an incarnation of the social elite of h.is\n          time: white, Southern patrician and a Christian gentleman.\n           With Purvis are Special Agents WARREN BARTON (31) and\n          Purvis's friend CARTER DAUM (29)\n          They have a harder time in the steep woods. They're chasing\n          someone. They are guided by East Liverpool police chief,\n\n          FULTZ.\n\n          BOTTOM OF THE HILL -- PRETTY BOY FLOYD ( 29)\n          is a big-boned country boy. His blue suit is mud-streaked\n          from his slide down the hill. He carries a Thompson\n          submachine-gun with a drum magazine, and he is running for\n          his life.\n\n          PURV I S , FULTZ, BAUM + BARTON\n          race after him.\n\n          MUDDY PATH - FLOYD\n          half runs, half slips in his dress shoes. Ahead is a cleared\n          orchard. Floyd leaps the fence...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          9.\n\n          CONTINUED:\n\n          WOODS -- PURVIS\n          jumping over fallen trees...\n\n          EXT. MIDDLE OF THE ORCHARD\n\n          of apple trees. Floyd's three hundred yards ahead. He zigzags\n          for a deeper forest at the far end. If he can reach it, he\n          has a chance.\n\n          PURVIS\n          breaks into the clear.\n\n          PURVIS\n          Floyd! Halt!\n          Purvis aims the Mauser. Perfect form. Floyd zigzags. Purvis\n          FIRES, misses. Floyd opens up with the Thompson -- wildly at\n          that range.\n           A few .45s splinter nearby branches. Fultz, Baum and Barton\n           seek cover: Purvis works the bolt and chambers another round.\n          Floyd is 10 yards from the forest.\n          Purvis kneels onto his right knee. On his upraised left knee\n          he braces hi left elbow. He inhales. Starts a smooth\n          squeeze. Ha Tway through the exhale he FIRES. Floyd's right\n          arm flies up. He's punched forward and crashes to the ground.\n\n          FLOYD\n          regains consciousness. Purvis is running in. Floyd`s left\n          hand pulls a 45.\n\n          BAUM\n          Look out, Melvin!\n          Purvis kicks the 45 out of his hand.\n\n          PURVIS\n          You are under arrest.\n          Floyd sits up to see the massive exit wound. His right lung\n          and liver are shot through. He falls back.\n\n          FLOYD\n\n          (RASPS)\n          I'm Floyd. Who are you?\n\n          PURVIS\n          Melvin Purvis - Department of\n          Investigation.\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          10.\n\n          CONTINUED:\n\n          PURVIS (CONT'D)\n\n          (BEAT)\n          Where's your friend Harry Campbell,\n          Floyd?\n\n          FLOYD\n          Ain't gonna tell you shit.\n          Floyd looks at the sky.\n\n           FLOYD (CONT'D)\n           And I believe you have killed me. So you\n           can go and rot in hell, you sonofabitch.\n           He lapses, goes cold and dies.\n\n           CUT TO:\n\n          INT. KITCHEN - CA-ROLE SLAYMAN - DAY (EAST CHICAGO, INDIANA)\n\n          CAROLE SLAYMAN is 33 with green eyes and peroxide blonde hair\n          and bounces down the stairs in a black robe. She crosses\n          through a white kitchen with TWO GIRLS in kimonos. A scarred,\n          African-American bouncer of 50 named SPORT enters...\n\n          SPORT\n          He jus' pulled in.\n\n          EXT. REAR YARD - CAROLE\n\n          sees Dillinger's Pontiac stop in the backyard. It's`-secluded\n          by a hedge from the street. Its followed by the Plymouth\n          with Pierpont and Van Meter in suits and prison haircuts.\n\n          CAROLE\n          Johnny!\n          Dillinger cradles the Thompson in his arm and crosses to her.\n\n          DILLINGER\n          (to Hamilton)\n          Hey, Red, call Oscar.\n\n          HAMILTON\n          Okay. And Berman? Wanna switch-out the\n          \"shorts\"?\n\n          DILLINGER\n\n          (ADDS)\n          Get a Chrysler and an Essex.\n          (to Carole)\n          Hey, doll...\n          He half picks her up with one arm around her waist.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          11.\n\n          CONTINUED:\n\n          DILLINGER (CONT'D)\n          (to Carole)\n          You get a hold of Zarkovich...?\n\n          CAROLE\n          I sure did...\n\n          (LAUGHING)\n          Put me down!\n\n          JAN METER\n          Where those gals?!\n          As Homer and Pierpont head inside...\n\n           INT. REAR GARAGE - OSCAR LIEBOLDT - LATER\n\n          OSCAR`s a 50\n          year old German gunsmith. Dillinger rapidly\n          field strips his Thompson.\n\n          DILLINGER\n          (re main spring)\n          Jammed twice, Oscar., .main spring's too\n          tight.\n\n          OSCAR\n          cut off one coil.\n\n          DILLINGER\n          And it rides up and to the right on full\n          auto.\n\n          OSCAR\n          (re Cutts compensator)\n          I widen port...\n\n          CAROLE APPEARS ON REAR PORCH ACROSS THE YARD. SHE SIGNALS TO\n\n          JOHNNY.\n          Dillinger rises as a 1933\n          Chrysler and an Essex Terraplane\n          drive in. Out of the Essex steps HARRY BERMAN, a Cicero,\n          Illinois auto dealer for the Syndicate. (Berman will switch-\n          out the Dillinger Gang's work cars or \"shorts.\")\n\n          PIERPONT\n          Hiya Harry...\n\n          PIERPONT\n          tosses Berman a rubber banded roll of bills while...\n\n          \n\n          \n\n          \n\n          \n\n          12.\n\n          INT. KITCHEN - DILLINGER\n\n           enters. MARTIN ZARKOVICH looks up. He wears a police badge\n          and a 38 in a shoulder holster. He is a corrupt detective in\n           the East Chicago, Indiana Police Department.\n\n           ZARKOVIOH\n           Johnny! How are ya?\n          With him is ANNA SAGE, a 40 year old well-dressed madam. She\n          kisses Johnny on the cheek.\n\n          DILLINGER\n          Good and so are you. Christmas is coming\n          early this year.\n          (fat envelope of cash)\n          Extra cake's in here for you and Anna.\n\n          (BEAT)\n          Still in Hammond, doll?\n\n          ANNA SAGE\n          I'm in Chicago on North Halstead now.\n          Come on by...\n\n          DILLINGER\n          Marty, tell me that me and my boys are\n          okay...\n\n          ZARKOVICH\n          Long as you stay in my town, you're in\n          safe haven.\n          Dillinger tosses Marty the envelope. This is Dillinger's\n          support and resupply network.\n\n          INT. CAROLE'S BEDROOM - DILLINGER'S - LATER\n\n          in a deep armchair with his shoes off and his feet on a\n          hassock. Paul Whiteman's Big Band is on the console radio.\n          Carole slides onto his lap and snuggles into his shoulder.\n          John glows with the affection.\n\n          CAROLE\n          Wanna go out later, sugar?\n\n          DILLINGER\n          I want to sit here with you and listen to\n          the radio, baby.\n\n          (BEAT)\n          I have missed you like nobody's\n          business...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          13.\n\n          CONTINUED:\n          John Dillinger seems like a romantic husband with his little\n          wife Betty. And it feels a little out of place...\n\n          CUT TO:\n\n          INT. CONGRESSIONAL HEARING ROOM - J. EDGAR HOOVER - DAY\n\n\n          MCKELLAR\n          (to Hoover)\n          Why do we need this?\n\n          HOOVER\n          Because of the new breed of mobile\n          outlaws who flee jurisdiction by crossing\n          state lines over highways and against\n          whom this government must wage a war on\n          crime.\n          J. EDGAR HOOVER is a physically short man but has a dynamic\n          presence. He is a dapper patrician who believes in elites. He\n          is completely free from self-doubt. He is youthful and 33\n          years old.\n          SUYDAM and TOLSON sit next to him.\n          MCKELLAR iï¿½'Chairman of the Senate Appropriations Sub-\n          Committee.-,He's an avuncular man of 62.\n\n          MCKELLAR\n          And so in the middle of a Great\n          Depression you're looking for a budget\n          increase to build up your Department? But\n          by my tally your Department of\n          Investigation spends more taxpayer's\n          dollars catching crooks than what the\n          crooks you catch stole in the first\n          place...\n\n          HOOVER\n          That's ridiculous. The Bureau's\n          apprehended kidnappers, bank robbers, who\n          have stolen up to...\n\n          MCKELLAR\n          (looking at document)\n          How many criminals you apprehended?\n\n          HOOVER\n          We've arrested and arraigned 213 wanted\n          felons...\n\n          MCKELLAR\n          No. I mean you. How many?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          14.\n\n          CONTINUED:\n\n          HOOVER\n          As Director I've administered...\n\n          MCKELLAR\n          No. How many have you arrested?\n          Personally.\n\n          HOOVER\n          I've never arrested anybody.\n\n          MCKELLAR\n\n          (INCREDULOUS)\n          You never arrested anybody?\n\n          HOOVER\n          I'm an administrator.\n\n          MCKELLAR\n          With no field experience.\n          For once Hoover is silent.\n\n          MCKELLAR (CONT'D)\n\n          (CONTINUING)\n          In fact you are shockingly unqualified,\n          aren't you, sir? You have never\n          personally conducted a criminal\n          investigation in the field in your life=\n          Others in the room stare at Hoover. McKellar leans'-back...\n\n          MCKELLAR (CONT Â° D )\n\n          (CONTINUING)\n          I think you are a front. I think your\n          prowess as a lawman is a myth created\n          from a hoopla of headlines by Mr. Suydam,\n          your publicist there. You are trying to\n          make a federal police force with you set\n          up as its Czar. That is runnin' wild in\n          my estimation...\n\n          HOOVER\n          Crime is what runs wild in this country,\n          Mr. Chairman. And...\n\n          MCKELLAR\n          And if the country required an expanded\n          Bureau, I question you are the person\n          most fit to run it while...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          15.\n\n          CONTINUED: (2)\n\n          HOOVER\n\n          (EXPLODES)\n          I won't be judged by a kangaroo court of\n          venal politicians...\n\n          MCKELLAR\n          (slams gavel!)\n          While outlaws like Dillinger, Clyde\n          Barrow, the Barkers, and Nelson flourish\n          unabated.\n\n          (SLAM)\n          Your appropriation request is denied.\n          The hearing's over.\n\n          TNT. U.S. CONGRESS, CORRIDOR - J. EDGAR HOOVER -DAY\n          walks fast through the corridor of congressmen. He talks over\n          his left shoulder to Suydam and Tolson. They struggle to hear\n          him...\n\n          HOOVER\n          (to Suydam)\n          Find out: was he soft on the Reds in\n          ,1919? Does he use prostitutes? Peppy\n          `tuf f like that. And feed this to Walter\n          =!riiâ\u0080\u009einchell: \"McKellar's a Neanderthal. He's\n          O7:a personal vendetta to destroy me.\"\n          Like that.\n\n          (BEAT)\n          We'll fight him on the front page. Not in\n          his damn committee room...\n          (to Tolson)\n          Where's Dillinger?\n\n          TOLSON\n          Spotted in Hammond, Indiana.\n\n          HOOVER\n          How long ago?\n\n          TOLSON\n          Yesterday. Another sighting has him on\n          the Lincoln Highway in Ohio heading\n          towards Cincinnati.\n\n          HOOVER\n\n          (DECIDES)\n          He's in Hammond. Heading to Chicago.\n\n          SUYDAM\n          How do you know?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          16\n\n          CONTINUED:\n\n          HOOVER\n          You can have fun in Chicago. What the\n          hell's there to do in Cincinnati?\n\n          INT. HOOVER'S PRIVATE OFFICE -- HOOVER\n\n          enters. Melvin Purvis has been waiting. He's gestured to\n          follow.\n\n          HOOVER\n          (suddenly brilliant)\n          Agent Purvis, congratulations.\n\n          PURVIS\n          Thank you sir. May I ask why?\n\n          HOOVER\n          Pretty Boy Floyd, for which you have my\n          commendation and personal gratitude.\n          Second, you are, as of this moment, the\n          Special Agent in Charge of the Chicago\n          field office. Your task will be to get\n          John Dillinger. Are you up to it?\n\n          PURVIS\n          Absolutely, sir.\n          Purvis is imbued. Henry Suydam enters.\n\n          SUYDAM\n          (to Hoover)\n          They're ready for him.\n\n          HOOVER\n\n          (PENSIVE)\n          This is Henry Suydam.. He is our expert in\n          congressional and press relations.\n          INT. BUREAU OF INVESTIGATION w HOOVER ESCORTS PURVIS THROUGH\n\n          THE OPEN PLAN OFFICE\n          Tolson + Suydam follow.\n          It's like the \"Corporate Office of the Future\" designed by\n          Albrecht Speer. Agents are at grey metal desks dressed\n          identically in dark suits, white shirts, dark ties. No\n          personal effects. The individual is reduced to a component in\n          a gleaming machine.\n\n          EXT. JUSTICE DEPARTMENT STEPS - HOOVER, PURVIS, SUYDAM +\n\n\n          TOLSON\n          hurry down the staircase.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          17.\n\n          CONTINUED:\n\n          HOOVER\n\n          (LOW)\n          Why are you sure you're up to this task,\n          Mr. Purvis?\n\n          PURVIS\n          We have two weapons that cannot be\n          defeated.\n\n          HOOVER\n          What are they?\n\n          PURVIS\n          The Bureau's modern techniques of\n          investigation and your visionary\n          leadership.\n\n          HOOVER\n          You let Mr. Tolson, here, know if you\n          need anything, Melvin, anything at all,\n\n          PURVIS\n          Thank you.\n\n          HOOVER\n          (brilliant smile)\n          Call me J.E.\n          They shake hands. There's a mob of photographers and newsmen\n          and microphones to interview him.\n\n          EXTREMELY CLOSE: MELVIN PURVIS\n          is awed. He's imbued with purpose. He's been anointed\n          Hoover's Crimebuster. He claimed he was up to the task.\n          \"Is he?\" he asks himself right now. And he didn't expect to\n          be overcome by doubt. He struggles with anxiety. Then, he\n          pushes that aside and forces himself to take the step forward\n          into the lights and flashbulbs.\n\n          SUYDAM\n          (quietly to Tolson)\n          Our own Clark Gable...\n\n          CUT TO:\n\n          INT. AMERICAN BANK AND TRUST COMPANY - JOHN DILLINGER\n\n          in a long overcoat and a hat with a Tommy gun crosses a bank\n          interior to a thin man behind a large desk, GROVER WEYLA_ND.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          18\n\n          CONTINUED:\n          Grover stands and flattens against the back wall, as if\n          trying to permeate the masonry and disappear into the back\n          alley.\n          Dillinger peels him off the wall and steers him towards the\n          vault.\n\n          DILLINGER\n          Let's play a game, Mr. President. Its\n          called spin the dial.\n          (starts stopwatch, shouts to\n\n          CREW)\n          Seven minutes!\n          Dillinger is the Vault Man. And alarm sounds.\n\n          WIDE: A BANK ROBBERY IN PROGRESS - PIERPONT\n          is the Lobby Man. His back is to the front door. He controls\n          the customers on the inside. Women are seated on the floor.\n          Men stand. It's well-ordered. Pete doesn't worry about his\n          back because...\n\n          EXT. BANK + STREET - HOMER VAN METER\n\n          is the Lookout. His back is to the front door. His,job is to\n          control the people outside the bank. His 351 Winchester\n          rifle is hidden by his coat. Crowds gather across th' street\n          because of the alarm. Homer's focused. He is rock steady.\n\n          MANLEY\n          is at the tellers' drawers. His job is to shovel cash into a\n          canvas bag. The Tellers stand aside.\n\n          DILLINGER`S\n          at the vault with Weyland. Weyland hesitates. Dillinger's\n          right hand with the Thompson covers Tellers so Makley can\n          work. His left hand draws one of the two 45s he keeps in\n          twin shoulder holsters and he cracks Grover Weyland across\n          the forehead. He aims the .45 between Weyland's eyes...\n\n          DILLINGER\n\n          (CALM)\n          You can be a dead hero or a live coward.\n           Grover Weyland OPENS THE VAULT. Dillinger checks his watch.\n\n          EXT. BANK - VAN METER\n\n          spots a police car racing up, TAPS the window with the barrel\n          of his rifle.\n\n          \n\n          \n\n          \n\n          \n\n          19.\n\n          INT. BANK - PIERPONT\n\n          glances outside.\n\n           PIERPONT\n\n          (CALMLY)\n          Company!\n          NO ONE inside stops working. They know Van Meter will do his\n          job.\n\n          EXT. BANK - OFFICER CHESTER BOYARD\n\n          is out of the car and into the bank door, passing right by ---\n\n          VAN METER\n          -- who let him go. Van Meter keeps his eye on the other THREE\n          COPS. Two get behind the cover of parked cars across the\n          street. ONE stays low and runs towards Homer.\n\n          INT. BANK - BOYARD\n\n          marches into the lobby, gun in hand.\n\n          BOYARD\n\n          (CONFIDENTLY)\n          Hold it! Hands up!\n          PIERPONT, behind him, slams the butt of the Thompson into the\n          back of his head, knocking him flat, and disarms him. He\n          rouses. Pete doesn't like authority. Pete hits him again.\n          Blood pools onto the floor.\n          A WOMAN faints, collapsing. Peters dead calm. He looks over\n          the half-painted windows. The growing crowd on the sidewalk\n          is getting too large...\n\n          HE FIRES\n          at the glass. People scramble for cover as it CRASHES onto\n          Main Street. Meanwhile...\n\n          EXT. BANK - REAR ALLEY: RED IN THE BUICK\n\n          engine idling, sees people running past. Taped to his dash\n          are two \"Â°gits\"\n          - step by step instructions to two getaway\n          routes. He checks his watch. The minute hand moves into\n          place. He drives evenly out of the alley.\n\n          EXT. BANK FRONT - VAN METER\n\n          is approached by the COP who thinks he's a pedestrian.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          20.\n\n          CONTINUED:\n\n          COP\n          (to Homer)\n          Hey, you. Move out of there!\n\n          VAN METER\n          Why should I? I wanna watch.\n          Angry Cop rushes him. Homer slams him in the gut with his\n          rifle, disarms him and uses him as a shield. He backs to the\n          front door. Pedestrians flee. Cops draw down. They cannot\n          shoot without Homer blowing off the Cop's head. Meanwhile...\n\n          INT. BANK -- DILLINGER\n\n          tosses the last bag to Pierpont at the front door. On. the way\n          out he passes a FARMER near a teller's cage, his hands in the\n          air. Cash on the counter.\n\n          DILLINGER\n          That your money there, mister?\n\n          FARMER\n          Yessir. It is.\n\n          DILLINGER\n          Well, go ahead and put it away. We're\n          here for the bank's money. Not your\n          money.\n          Customers appreciate Dillinger. Dillinger loves their-\n          appreciation...\n\n          PIERPONT\n          You three! Let's go!\n          .to three pretty TELLERS hiding under a desk.\n\n          DILLINGER\n          Folks, stay calm and stay low.\n          Pierpont grabs two; Dillinger takes one, creating a human\n          shield around them --\n\n          EXT. AMERICAN BANK AND TRUST --- VAN METER,\n\n          his gun against the side of the cop's head, moves to the\n          Buick. A large crowd is across the street.\n\n          CITY DETECTIVES\n          pull up in front of Wylie's Hat shop. Dillinger's crew is\n          crossing fast to Red's Buick, as...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          21\n\n          CONTINUED:\n\n          DILLINGER OPENS UP\n          and the Wylie Hat Shop windows blow out.\n          A DETECTIVE with a deer rifle aims.\n\n          VAN METER\n          FIRES past his hostage's head. Detective goes down. The\n          Hostage's eardrum is blown. His ear bleeds.\n\n          DILLINGER SHOOTS UP...\n          City Detectives' car, police car and a few others.\n\n          INT. BUICK - MAKLEY + PIERPONT\n\n          are in. Dillinger and hostages load onto the running board.\n          Pierpont grabs ANNA PATZKE's arm.\n\n          PIERPONT\n          C'mere, honey.\n          Buick's moving faster. Dillinger pulls her onto the running\n          board next--:o Boyard. The Buick roars away.\n\n          INT. BUICK:.- RED\n\n          drives with total concentration. Makley cooly reads the git.\n\n          MAKLEY\n          2 miles - turn left at the white barn.\n           Right there. Now. 6 miles to the new\n          bridge.\n          Pierpont breaks out the rear window. He throws two five\n          gallon milk jars full of roofing nails out into the road.\n          They scatter.\n\n          TWO POLICE CARS\n          hit the nails, their tires blow. ROUNDS from the Buick finish\n          dissuading them to pursue.\n\n          INT. BUICK - HAMILTON\n\n          approaches the bridge, slows.\n\n          DILLINGER\n          (to Boyard and two of the\n\n          HOSTAGES)\n          Okay. Beat it!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          22.\n\n          CONTINUED:\n          Three hostages jump off. Dillinger pulls Anna Patzke and\n          Weyland inside.\n\n          DILLINGER\n          sees Anna Patzke's shivering from shock and the cold. He puts\n          his coat on her. He plops his hat on her head, too.\n\n          DILLINGER (CONT'D)\n          Something to remember me by.\n          She laughs, nervously, and a little thrilled at being where\n          she is...\n\n          VAN METER\n\n          (OMINOUS)\n          Are we taking `em to the hideout?\n\n          DILLINGER\n          (going along with it\n          That depends.\n\n          VAN METER\n          How 'bout it, honey? Can you cook?\n\n          ANNA PATZKE\n          (not disinterested)\n          Uh. Sure... After a fashion.\n          They start to hoot and laugh. They think this is hÂ±l iiou.s.\n\n          ANNA PATZKE (CONT'D)\n          Well, its true!\n\n          VAN METER\n          When I'm not doing this, I'm a scout for\n          the movies.\n\n          ANNA PATZKE\n          Really?\n          This makes them laugh even harder.\n\n          EXT. THICK WOODS\n\n          Pierpont has brought the hostages to a big tree.\n\n          PIERPONT\n          Face each other. Join hands.\n          Pierpont binds them loosely to the tree.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          23\n\n          CONTINUED:\n\n          WEYLAND\n          We'll freeze.\n\n          DILLINGER\n          You'll worm your way out of that in about\n          ten minutes.\n          Anna looks over at Dellinger.\n\n          DILLINGER (CONT'D)\n          It's okay, doll. You're just gonna be a\n          little late for dinner.\n          Dillinger reaches over, snatches his hat off Anna Patzke's\n          head. He leaves her his coat.\n\n          THE BUICK WORK CAR\n          is abandoned.\n\n          TRACK RIGHT + SEE\n          Dillinger''b Essex and a Ford drive off past fields with snow\n          on both sides. New cars. Flush with cash. Clean.\n\n          CUT TO:\n          INT. CHICAGt7: BUREAU OF INVESTIGATION OFFICES - PURVIS - DAY\n\n          (BANKER' S BUILDING)\n          looks at the gathered agents. New faces. College men.\n\n          WARREN BARTON\n          holds up the coat Dillinger left on Anna Patzke.\n\n          BAUM\n          .manufactured by Freeman & Freeman in\n          St. Louis. We are identifying all stores\n          that sold this coat.\n          We note AGENTS COWLEY, RICE, CLEGG + RORER. DORIS ROGERS ( 23)\n          is Purvis' secretary. He brought her from his last post in\n          Alabama along with Barton and Baum. We've entered mid-scene.\n\n          PURVIS\n          Then we will cross-reference every\n          Dillinger family member and known\n          associate in each locale.\n\n          (BEAT)\n          He was there. It got cold. He bought a\n          coat. Therefore, he may have been\n          harbored or have a safe house nearby.\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          24.\n\n          CONTINUED:\n\n          PURVIS (CONT`D)\n          By such techniques we will get Dillinger.\n\n          (BEAT)\n          Doris...\n\n          (STOPS)\n          For those of you who haven't met her,\n          Miss Rogers is my secretary...\n          (to Doris)\n          Please contact the Chicago telephone\n          exchange supervisors. Request\n          appointments for Carter Baum or myself.\n\n          (BEAT)\n          We are going to be working long hours. It\n          will be dangerous. Those of you who\n          aren't prepared for that, can go. And if\n          you're going to go, go now.\n          (no one does)\n          Thank you, gentlemen.\n\n          CUT TO:\n\n          E/I. ARAGON BALLROOM, CHICAGO - ON DILLINGER - NIGHT\n          watching a sexy young woman on the dance floor. He loses\n          sight of her...\n          He's expecting someone. Then, Dillinger sees her again: jet\n          black hair in a bob, brown eyes, high cheekbones fom:her\n          Indian mother and a great smile. She lights up a ro om. She is\n\n          BILLIE FRECHETTE (27).\n          She feels the stare and looks over. She studies him, then\n          looks away.\n          Dillinger's with Pierpont, Makley and Hamilton at a table. It\n          is loaded with steaks, oysters, and frog legs.\n          ALVIN KARPIS and Homer Van Meter approach and Alvin sits next\n          to Johnnie... Dillinger adjusts his chair to watch for the\n          girl. He's shoulder to shoulder to Karpis.\n\n          DILLINGER\n          Hiya, Alvin. You hungry? How's Freddie\n          and Dock?\n          (note: Alvin Karpis is cunning and careful. He will outlive\n          everyone, including J. Edgar Hoover, and retire to\n          Torremolinos, Spain, where he will die of heart failure in\n\n          1979.\n          Freddie and Dock Barker are the sons of Ma Barker. After the\n          FBI gunned down the old woman, Hoover labeled her the \"crime\n          genius\" of the family. According to Volney Davis, she\n          couldn't organize breakfast.)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          25.\n\n          CONTINUED:\n\n          KARPIS\n          Everyone's good.\n          (leans in; they talk quietly)\n          We been looking to snatch two fellas.\n          One's a St. Paul banker, Ed Bremer. Need\n          a few more hands.\n\n          DILLINGER\n          Don't like kidnapping.\n\n          KARPIS\n          Robbing banks is getting tougher.\n\n          DILLINGER\n          The public don't like kidnappers.\n\n          KARPIS\n          Who gives a damn what the public likes?\n\n          DILLINGER\n          I do. I hide out among them.\n\n          KARPIS\n\n          (SHRUGS)\n          ,L -am strictly out to make cake.\n\n          DILLINGER\n          .: yeah, then you, Ma, Dock and Freddie\n          hole up like hermits on farms for six\n          months. I grew up on a goddamn farm. I\n          hate farms. I like big cities, crowds and\n          a good time...\n\n          K ARP IS\n\n          (SMILES)\n          Well, we got a mail train we been lookin'\n          at, too.\n\n          DILLINGER\n          Say, by the way, if someone got pinched\n          here, who can get'em out real fast?\n\n          KARPIS\n          Lawyer named Piquett. We all use him.\n          (writes a phone number)\n\n          DILLINGER\n          What about this train?..\n\n          KARPIS\n          Needs two, three more months to set up. I\n          need seven or eight real right guys to\n          take it down.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          26.\n\n          CONTINUED: (2)\n\n          DILLINGER\n\n          (SMILES)\n          Sounds like Jesse James.\n\n          KARPIS\n\n          (LOW)\n          A million seven, a million eight.\n          Dillinger looks at Karpis. In 2007, that would be $22\n          million.\n\n          KARPIS (CONT' D)\n          Federal Reserve shipment. It runs only\n          twice a month. This is the kind of score\n          you go away on after.\n\n          DILLINGER\n          Where you gonna go?\n\n          KARPIS\n          Brazil. Cuba, maybe. What about you?\n\n          DILLINGER\n          Were having too good a time today. We\n          ain't worryin' about tomorrow yet...\n\n          KARPIS\n          You ought to. What we're doin' here,\n          don't last forever.\n          They lock at each other: two pros at the top of their game.\n\n          DILLINGER\n          Keep me in mind on the train.\n          Karpis leaves. Dellinger can't see Billie anymore.\n\n          JA' METER\n\n          (AGITATED)\n          Let's snatch Bremer...\n\n          (LOUDER)\n          Know how much they made snatchin' that\n          Hamm Brewery guy? $250,000.\n          Dillinger looks at Pierpont.\n\n          P IERPONT\n          Shut your yap, Homer.\n\n          MAKLEY\n          Let's get our of here.\n          Pierpont, Homer and Makley leave.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          27.\n\n          CONTINUED: (3)\n\n          DILLINGER\n          Homer stayin' steady?\n\n          HAMILTON\n          (reading his mind)\n          He's okay.\n\n          DILLINGER\n          Three rules I learned from Walter\n          Dietrich. One: never work with people who\n          are desperate. Two: never work with\n          people who aren't the best. Three: never\n          work when you're not ready.\n          Billie reappears, dancing with a young man.\n\n          HAMILTON\n          Well, I got rule four: stay away from\n          women.\n\n          DILLINGER\n          Without women, I might as well have\n          `stayed in stir.\n          Anna Sage approaches with a young girl for Red.\n\n          HAMILTON\n          What's why they invented whores.\n          (getting up)\n          Hamilton leaves, arms around the women. Dillinger keeps his\n          eye on Billie. Music ends. Young man escorts her to her\n          table. He tries to join her. She turns him down.\n          Dillinger finishes his drink, approaches. He now sees how\n          beautiful Billie is. She's 5 foot 5. With a straight erect\n          build, she stands out in any crowd. She looks Dillinger\n          straight in the eye. Clear skin, dark eyes with humor playing\n          about the edges. He unexpectedly starts to feel nervous.\n          He gives her his best grin.\n\n          DILLINGER\n          I don't know what you said to your\n          friend, but I sure am glad you did.\n          Billie looks him over: a well-made man in a good suit with a\n          great smile. And, paradoxes: he easily talks to women but\n          he's not a hustler. He's young, but there's a world of\n          experience in his face. Open, but he's holding something\n          back.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          28.\n\n          CONTINUED: ( 4)\n\n           DILLINGER (CONT'D)\n          What's your name?\n\n          BILLIE\n          Billie Frechette.\n\n          DILLINGER\n          Buy you a drink?\n          Billie looks at her girlfriend, she nods, Billie rises...\n          As they cross to the bar.\n\n          DILLINGER (CONT'B)\n          Is that French?\n\n          BILLIE\n          On my father's side. There's an \"e\" at\n          the end. Do you have a name?\n\n          DILLINGER\n          Jack Harris.\n          Music changes to \"Bye Bye Blackbird.\"\n\n          BILLIE\n          Do you dance, Jack?\n\n          DILLINGER\n          I don't know how.\n          She smiles a pretty smile at him.\n\n          BILLIE\n          How come you don't know how to dance?\n          Its easy. Follow me. This is a two-step.\n          (he stares at her feet)\n          Don't look at my feet. Look at my\n          shoulders.\n          She stays an inch or two distant in his arms. Its slow and\n          languorous. He follows her with little difficulty. He can\n          smell the perfume in her black hair.\n\n          TORCH SINGER\n\n          (SINGS)\n          â\u0080\u009ePack-up all my cares and woe\n          Here I go, singing low\n          Bye, bye blackbird\"\n\n          DILLINGER\n          My, but you are pretty.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          29.\n\n          CONTINUED: ( 5)\n          They look into each other's eyes. He pulls her closer, wants\n          to kiss her long smooth neck. He almost can't resist...\n          Their lips are an inch apart. And then she rests her cheek on\n          his shoulder and the kiss that wasn't hangs in the air around\n          them. He whispers...\n\n          DILLINGER. (CONT'D)\n          Where you from, Billie?\n          She turns her right ear towards him. She's deaf in her left\n          ear.\n\n          BILLIE\n          Flandreau.\n\n          DILLINGER\n          Where's Flandreau.?\n\n          TORCH SINGER\n\n          (SINGS)\n          \"Where somebody waits for me\n          Sugar's sweet, so is she\n          Bye, bye blackbird...\"\n\n          BILLIE\n          outh Dakota.\n\n          DILLINGER\n          Father's French, what's on the other\n          side?\n\n          BILLIE\n          Italian.\n\n          DILLINGER\n          From South Dakota, Indian's likelier than\n          Italian.\n          She looks at him.\n\n          BILLIE\n          My momma's a Menominee Indian. But most\n          men don't like that...\n\n          DILLINGER\n          I'm not most men.\n\n          BILLIE\n          And I check coats at the Steuben Club.\n          What do you do, Jack?\n\n          DILLINGER\n          I'm catching up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          30.\n\n          CONTINUED: ( 6)\n\n          BILLIE\n          Catching up on what?\n\n          DILLINGER\n          On life, meeting someone like you.\n          (her hair)\n          Dark, beautiful, like the black bird in\n          that song...\n          She laughs at the flattery. Holds his eyes a beat with an\n          ironic look. A couple from another group looks at Dillinger.\n          He's cool. He returns the look. They look away.\n\n          DILLINGER (CONT`D)\n          Say, how'd you like some dinner?\n\n          BILLIE\n          Sure.\n          He nods courteously to her girlfriends, grabs her coat, puts\n          a hand around Billie's waist and steers her out...\n\n          TORCH SINGER\n\n          (SINGS)\n          \"So make my bed and light the light\n          Cause I'll be home late tonight\n          Bye, bye blackbird... .\"\n\n          EXT. ARAGON BALLROOM - DILLINGER + BILLIE - NIGHT\n\n          in their coats on the street. It's cold. Dillinger.pulls her\n          close.\n          Then he turns and he kisses her hard on the lips. She didn't\n          expect that. Her eyes are wide. He opens and wraps her in his\n          overcoat, their bodies close to each other.\n          She kisses him back, long and deep. And she didn't expect to\n          do that, either.\n          At last they separate.. .and look at each other for a beat.\n\n          INT. GOLD COAST RESTAURANT - MAITRE D' - NIGHT\n\n          Dillinger slips him bills. He and Billie are shown to a\n          table. The clientele is North Shore old money and\n          businessmen. Some of the women are in dazzling dresses even\n          though it's mid-Depression. A few stare at Billie. She's out\n          of her class.\n\n          DILLINGER\n          What are you gonna have?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          31.\n\n          CONTINUED:\n          Billie stares at him, ignoring her menu.\n\n          BILLIE\n          What is it, exactly, you do for a living?\n          Dillinger looks over the top of his menu.\n\n          DILLINGER\n          Well...I rob banks.\n          Then he leans back in his chair and regards her.\n\n          DILLINGER (CONT'D)\n          That's where all these people here put\n          their money.\n\n          BILLIE\n          Why'd you tell me that? You could have\n          made up a story...\n\n          DILLINGER\n          'Cause I can't lie to you.\n          she studies him carefully.\n\n          BILLIE\n          ;,;.at's a pretty serious thing to say to a\n          woman you just met.\n\n          DILLINGER\n          I feel like I know you.\n\n          BILLIE\n          Well, I haven't been any of the places\n          you've been. So I don't even know what I\n          don't know.\n\n          DILLINGER\n          Some of the places I been ain't so hot.\n          Where I'm going is a lot better. Wanna\n          come along?\n\n          BILLIE\n          Boy, you are in a hurry.\n\n          DILLINGER\n          If you were looking at what I am looking\n          at, honey, you'd be in a hurry too.\n          She laughs at his flattery, which she is also finding\n          persuasive.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          32.\n\n          CONTINUED: ( 2)\n\n          BILLIE\n          (leans in)\n          Well, its me they're looking at this\n          time.\n\n          DILLINGER\n          That's 'cause you're beautiful.\n          A blonde woman, elegant and ice cold, stares at Billie, a\n          Depression-era child in her dress.\n\n          BILLIE\n          That's nice. But they're looking at me\n          because they're not used to having a\n          Menominee Indian girl in their restaurant\n          in a three dollar dress.\n\n          DILLINGER\n          (takes her hand)\n          Listen, doll, that's 'cause they're all\n          about where people come from. Only thing\n          important is where somebody's going.\n\n          BILLIE\n          Where are you going?\n\n          DILLINGER\n          To the top.\n          He's irresistible.\n\n          DILLINGER (COIN' D)\n          Let's get out of here.\n          Beat. She nods. They get up, get their things.\n          On their way...a man intercepts Dillinger. He is GILBERT\n          CATENA (42), solid with big hands. He's smiling.\n\n          CATENA\n\n          (WHISPERED)\n          Hey Johnny...:\n          Dillinger reacts, changes down, says coldly...\n\n          DILLINGER\n          (to Billie)\n          Go wait outside. I'll be right there.\n          Billie turns and walks out of the restaurant.\n\n          DILLINGER (CONT'D)\n          How you been, Gil?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          33.\n\n          CONTINUED: (3)\n\n          CATENA\n          Real good. I work for Mr. Nitti now. Been\n          with him since I got out of Michigan...\n          Catena indicates FRANK NITTI (47) in a group at a table.\n          Sober and educated, Nitti glances in their direction but has\n          no interest.\n\n          DILLINGER\n          Looks like a barber.\n\n          CATENA\n          Don't go by looks.\n\n          (BEAT)\n          He's real smart. We're connected to\n          everybody all over the country now...\n          From Nitti's table a man gets up and walks straight towards\n          Dillinger. He is PHIL D'ANDREA. Two heavy duty bodyguards are\n          with him. Dillinger unbuttons his jacket. But...\n\n          D'ANDREA\n          (smiles, low)\n          Everytime I read about one of your jobs,\n          where you give people back their money,\n          'You crack me up...\n\n          (LAUGHS)\n          Ypu need anything, Gilbert knows how to\n          find me.\n          D'Andrea continues to the men's room.\n\n          DILLINGER\n          See you. Gilbert...\n\n          CATENA\n          Good luck Johnnie.\n\n          EXT. STREET OUTSIDE RESTAURANT - DILLINGER - NIGHT\n\n          comes out onto the sidewalk. Billie isn't there. He searches\n          the street. She's gone. The night, suddenly cold and lonely,\n          wraps around Johnny.\n\n          CUT TO:\n\n          INT. PHONE COMPANY EXCHANGE - PURVIS - DAY\n\n          An ENGINEER places headphones on Purvis' ears. Acetate disks\n          on turntables mounted within giant carrying cases record\n          phone calls. Cloth insulated wires are strung everywhere.\n          Stenographers sit with black bakelite headphones.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          34.\n\n          CONTINUED:\n\n          BAUM\n          That noise on the line? That's called\n          \"swing\". Nothing we can do about it. Some\n          words get dropped. Were listening in on\n          a car dealer. Harry Berman.\n          Rice plays back a recording.\n\n           VOICE (V.0.)\n          When you drop it, leave the keys on the\n          floorboard.\n          (muffled; then...)\n\n          B E RMAN (V.0.)\n          I got a DeSoto.\n\n          VOICE (V.0.)\n          okay.\n\n          BERMAN (V.0.)\n          The interior's no good.\n\n          VOICE (V.0.)\n          Don't matter. It's a work. car.\n\n          BAUM\n          We think that's Dillinger's voice.\n\n          PURVIS\n          How did we find Berman?\n\n          BAUM\n          Dillinger's coat was bought in Cicero,\n          Illinois, a few doors from Berman's\n          dealership. Berman supplies cars to the\n          syndicate. Since Capone. Dillinger must\n          have been at Berman's switching cars when\n          he bought that coat.\n\n          (BEAT)\n          Soon as they call to switch out the next\n          car, we will tail them. Right to\n          Dillinger.\n\n          EXT. NORTH DEARBORN STREET - JOHN DILLINGER - NIGHT\n\n          gets out of his Buick...\n\n          INT. STEUBEN CLUB - DILLINGER - NIGHT\n\n          enters, sees Billie talking with another hostess, MAY\n\n          MINCZELES.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          35\n\n          CONTINUED:\n          TWO MEN approach. Billie checks their hats and coats. To\n          Dillinger...\n\n          BILLIE\n          (without looking up)\n          May I check your coat, sir?\n\n          DILLINGER\n          No, honey. You go get your coat.\n          She looks up. So does May. May flashes Billie a look: if you\n          don't want him, I do.\n\n          MAY MINCZELES\n          Sounds good to me.\n          Dillinger has eyes only for Billie.\n\n          DILLINGER\n          You ran out on me.\n\n          BILLIE\n          `you left me standing alone on the\n          sidewalk.\n\n          DILLINGER\n          I 'you're going to be my girl, you have\n          swear you'll never do that again.\n\n          BILLIE\n          I'm not your girl!\n          A CUSTOMER comes up and puts his ticket on the counter.\n\n          CUSTOMER\n          Brown overcoat.\n\n          BILLIE\n          (ignoring customer)\n          I am not your girl and I'm not going to\n          say that.\n\n          DILLINGER\n          I'm waiting.\n\n          CUSTOMER\n          So am I.\n\n          DILLINGER.\n          (to Billie)\n          \"I am not ever going to run out on you\n          again.\" Say it.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          36.\n\n          CONTINUED: ( 2)\n\n          BILLIE\n          No.\n\n          DILLINGER\n          Well, I will never run out on you. And\n          that's a promise.\n\n          CUSTOMER\n          Well, I want to run out of here. So,\n          lady, will you get my coat...?\n          Dillinger lifts the man two feet off the floor and slams him\n          into the wall. Real jailhouse rage. The lethally cold eyes\n          tells the customer everything he needs to know. Dillinger\n          swings him to the counter, grabs the man's ticket, slams thru\n          the half door, finds the man's coat, tosses it at him...\n\n          DILLINGER\n          Keep the tip.\n          (to Billie)\n          You ain't getting other people's hats and\n          coats no more either.\n          He takes her coat and holds it for her. She doesn't move.\n\n          BILLIE\n          No one's ever done that for me before.\n\n          DILLINGER\n          You're with me now.\n\n          BILLIE\n          I don't know anything about you.\n\n          DILLINGER\n          I was raised on a farm in Mooresville,\n          Indiana. My ma died when I was three. My\n          daddy beat the hell out of me because he\n          didn't know no better way to raise me. I\n          used to do dumb things but I'm a lot\n          smarter now. I like baseball, movies,\n          good clothes, fast cars, and you. What\n          else do you need to know?\n          She gets into her coat. Dillinger opens the door for her.\n          They exit, watched by May.\n\n          TNT. DILLINGER'S APARTMENT, LIVING ROOM - BILLIE - NIGHT\n          enters. It's large, low-ceilinged, luxurious and modern ---\n          Billie is bowled over. He sits her down on a sofa.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          37.\n\n          CONTINUED:\n          He goes into a closet to get two Marshall Fields boxes and\n          two drinks.\n\n          BILLIE\n          You been living here long?\n\n          DILLINGER\n          Yeah. Since yesterday.\n          From a back bedroom (Red's) a phonograph is louder as a door\n          opens and Red enters the kitchen in a robe for a drink. He\n          returns. Laughter. Dillinger has the boxes and drinks.\n\n          DILLINGER (CONT'D)\n          I got something for you.\n\n          (BEAT)\n          What's wrong? Open it up.\n          Billie opens the boxes. She lifts out a sleeveless dress in\n          dusty pink. It is beautiful. She is very touched. The second\n          has a coat with a fur color. But still...\n\n          BILLIE\n          I'm drinking in a man's apartment who\n          .:W.ants to romance me. Okay. I'm no\n          \"Pollyanna, but there are things that you\n          Kati would bother a girl like me...\n\n          DILLINGER\n          We`rob banks `cause banks is where they\n          keep the money. I can make 500 dollars in\n          a year or I can make ten thousand dollars\n          in a morning. I'll take my chances on the\n          bank. No apologies. We don't go lookin'\n          to hurt anybody. But if somebody gets in\n          our way, that's gotta be their problem.\n          That what you want to know?\n\n          BILLIE\n          I'm trying to get to know you.\n\n          DILLINGER\n          You want to get to know me?\n\n          INT. APARTMENT, DILLINGER'S BEDROOM - NIGHT\n\n          Dillinger is an uninhibited and enthusiastic lover. They\n          pause.\n          He falls over onto his back and pulls her onto his chest and\n          they look up out the window through the upside down elm trees\n          to the Chicago moon in the cold sky.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          38.\n\n          CONTINUED:\n          She gets up and wanders around the room. He thinks she's the\n          most beautiful creature he's ever seen. She's looking at his\n          stuff.\n          She sees suitcases that are packed, ready to leave in a\n          heartbeat. Everything's so neat. She touches his folded\n          shirt...\n\n          BILLIE\n          .smooth\n\n          DILLINGER\n          Egyptian cotton. Since we been out I go\n          for the finest stuff. As much as I can\n          get, as fast we can get it.\n\n          BILLIE\n\n          (SUITCASES)\n          Where you goin'?\n\n          DILLINGER\n          Nowhere. What do you mean?\n\n          BILLIE\n          You're all packed.\n\n          DILLINGER\n          Always are. Ready to get up and go in a\n          heartbeat...\n          She stands next to him in the bed now. He pulls her down next\n          to him.. She turns her good ear towards him.\n\n           DILLINGER (CONT'D)\n          What's wrong with the other ear?\n\n          BILLIE\n          I was married once. He was too handy with\n          his fists.\n          She stares at Dillinger. Will this put him off.\n\n          DILLINGER\n          Where's he now?\n\n          BILLIE\n          In prison. I divorced him. Only mistake I\n          made was marrying him in the first place.\n          He got caught mugging a mailman...\n\n          DILLINGER\n          A criminal mastermind...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          39.\n\n          CONTINUED: (2)\n          She turns over and puts her mouth next to his ear. It gets\n          amorous through...\n\n          BILLIE\n          After my daddy died, we went to live on\n          the reservation in Flandreau. In\n          Flandreau nothin' ever happened.\n\n          (BEAT)\n          When I was 13, we went to live with my\n          Aunt Ines in Milwaukee where my cousin\n          Frances had a lot of Indian friends who\n          went around to churches and put on plays\n          like \"Little Fireface.\" And nothing\n          exciting ever happened to me there,\n          either. So I haven't been anywhere or\n          done anything in my whole life except\n          come to Chicago and try to make my way.\n\n          DILLINGER\n          Well baby-you're going to start a new\n          and exciting kind of life from right now.\n          And as they're pulled to each other and start making love\n          again, she stops...\n\n          BILLIE\n          heat do you want?\n\n          DILLINGER\n          To please you.\n          That's not what she meant, but gently, he rolls her over on\n          the bed.\n          A smile spreads slowly across her lips.\n\n           !NT. PHONE COMPANY - BAUM/INT. PURVIS' APARTMENT - PURVIS --\n\n\n          NIGHT -- INTERCUT\n          Baum in his shirtsleeves in front of the recorders is talking\n          to Purvis as he puts on his coat.\n\n          BAUM\n          Rorer tailed it. Berman dropped it in an\n          alley next to the Sherone Apartments 20\n          minutes ago. Rorer talked to a neighbor.\n          Men go in and out at night carrying heavy\n          suitcases. One looks like Dillinger.\n\n          PURVIS\n          Let's go. Right now.\n          They race out.\n\n          \n\n          \n\n          \n\n          \n\n          40.\n\n          INT. PURVIS'S PIERCE-ARROW - PURVIS + BAUM\n\n          Cowley and Barton join them as they pull to the curb down the\n          block from the Sherone Apartments. It's an upscale yellow-\n          brick apartment building with nice cars in front.\n\n          PURVI S\n          Where are your men?\n\n          COWLEY\n          My car's on Sheridan and Montrose and\n          Rice in the Ford is on Sheridan and\n          Wilson.\n\n          PURVIS\n          Blocking vehicles? End of this street?\n          Alley?\n          They aren't \"deployed.\" They're merely \"here\". Cowley gets\n          it. Purvis exchanges a look with Baum, checks his gun.\n\n          PURVIS (CONT'D)\n          Carter, take the back. Barton, you're\n          with me.\n\n          INT. HALLWAY ON THIRD FLOOR - PURVIS + BARTON - NIGHT\n\n          enter from the elevator. Soundlessly, they approach'-Apt. 302.\n          Two voices - a man and a woman's. Barton moves away,Irom the\n          door...\n          Purvis knocks. VI SCOTT (27) opens the door. From ier\n          reaction, she was expecting someone else. She's respectable\n          and pretty.\n\n          PURVIS\n          I'm Special Agent Melvin Purvis, Miss\n          Scott. Are you alone?\n\n          VI SCOTT\n          No - my fiance is here.\n\n          PURVIS\n          What's your fiance's name?\n\n          VI SCOTT\n          Leonard... McHenry.\n\n          PURVIS\n          May we come in?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          41\n\n          CONTINUED:\n\n          VI SCOTT\n          Sure. I'm perfectly safe... But come on\n          in.\n          She holds the door open.\n\n          INT. APARTMENT 302, LIVING ROOM/DINING ROOM - THEY ENTER\n\n          LEONARD is a thin short man at a table finishing dinner. He\n          is fresh-faced, maybe a junior clerk at an insurance company.\n          Not John Dillinger...\n\n          LEONARD\n          Something wrong?\n\n          PURVIS\n          You have identification?\n\n          LEONARD\n          Honey, would you get my driver's licence.\n          It's in my coat pocket.\n          Leonard sums reluctant to get up. With his right hand, he\n          takes a forkful of food. His left is under the table. Now, we\n          see that he:.'s holding...\n\n          A COLT 45_.-,AUTOMATIC\n          Who is this man?\n\n          LEONARD (CONTÂ°D)\n          You're that.. .Melvin Purvis. I've seen\n          your picture!\n\n          PURVIS\n          What do you do for a living, Leonard?\n\n          LEONARD\n          I travel in ladies shoes.\n          He smiles at his joke. Vi enters with his wallet. Barton sees\n          the driver's license.\n\n          LEONARD (CONT'D)\n          Show him, honey.\n          Vi Scott puts a foot forward - a red shoe with a bow.\n\n          PURVIS\n          Do you carry around samples?\n\n          LEONARD\n          Sure. Big suitcases.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          42.\n\n          CONTINUED:\n\n          PURVIS\n          (handing back the licence)\n          Enjoy the rest of your dinner, Mr.\n          McHenry.\n\n          LEONARD\n          Thanks.\n\n          INT. CARPETED HALLWAY ON THIRD FLOOR - PURVIS + BARTON\n\n          walk the length of the hall. Vi closed the door behind them.\n\n          PURVIS\n\n          (LOW)\n          Its all wrong. No one in or out. I'll\n          get the others.\n          (at door to stairs next to the\n          elevator door)\n          Stay here, watch that door from right\n          here.\n          Purvis leaves. Barton wants to do it right. Then, he hears\n          movement from Apt. 302. Objects being hurriedly shifted. He\n          starts back down the hallway. Halfway between it and the\n          elevator...\n\n          PING!\n          Behind him, the elevator doors open. Barton turns hi.,,back on\n          Apt. 302. He's caught between 302 and the elevator.-\".-\n\n          TOMMY CARROLL (38)\n          a flat-nosed ex-con enters. He looks curiously at Barton.\n\n          BARTON\n          Bureau of Investigation. What's your\n          name?\n          (flashes badge)\n\n          CARROLL\n          You wanna know my name?\n          Barton sees Carroll's eyes flicker, slight smile. He spins...\n\n          AN INDIFFERENT \"BABY FACE\" NELSON\n          FIRES his .45. BLAM! BLAM!\n          Barton's slammed forward. Nelson looks at Barton, prostrate,\n          convulsing. He FIRES a third round.\n\n          \n\n          \n\n          \n\n          \n\n          43\n\n          EXT. STREET - PURVIS\n\n\n          PURVIS\n          Pull the men from Sheridan and Wilson.\n\n          PURVIS\n          -reacting- grabs the Thompson from Madala and runs\n          back inside.\n\n          EXT. SHERONE APARTMENTS - BAUM\n\n          runs to the corner of the building where he has a visual on\n          the building front entrance and the DeSoto down the alley.\n\n          INT. THIRD FLOOR HALLWAY - PURVIS\n\n          enters, sees...\n\n          BARTON\n          in the final moments of his life. Barton looks up into\n          Purvis` eyes: Help me!\n          Purvis does not know what to do. Then Barton's eyes drift\n          away...\n          Purvis impels himself to action. He kicks in the door to Apt.\n\n          302. ï¿½._\n\n          INT. APT 30.2 VI SCOTT\n\n          screams.\n\n          PURVIS\n          Where is he?!\n\n          EXT. SHERONE APARTMENTS - BAUM\n\n          sees -\n\n          BABY FACE NELSON + TOMMY CARROLL\n          quickly cross the alley from the back stairs to the Desoto.\n          And Nelson immediately lays down rounds in careful short\n          BLASTS of full auto. Tommy Carroll calmly, smoothly starts\n          the DeSoto. Nelson's barrage punches into the wall, drives\n          Daum to cover.\n\n          INT. SHERONE APARTMENTS - PURVIS\n\n          slams open a window. The DeSoto accelerates out of the alley.\n          Purvis FIRES a few rounds. Baum FIRES his pistol. Both are\n          useless at that range. The DeSoto has turned left and is\n          gone.\n\n          \n\n          \n\n          \n\n          \n\n          44.\n\n          EXT. SHERONE APARTMENTS -- PURVIS\n\n          races in from the front door. Rice and Madala drive up in the\n          Bureau's armor-plated Ford V-8.\n\n          PURVIS\n          They headed north! The Sheridan Road car?\n\n          RICE\n          That's us. We heard gunfire. So we.\n          (gets it)\n          .came here.\n          They're fucked.\n\n          MADALA\n          Was it Dillinger?\n\n          BAUM\n          No. It was Lester Gillis.\n          Purvis sinks.\n\n          PURVIS\n          The man we let get away wasn't John\n          Dillinger.\n\n          (BEAT)\n          It was Baby Face Nelson.\n\n          CUT TO:\n\n          INT. CENTRAL NATIONAL BANK, GREENCASTLE, INDIANA -- 7ILLINGER,\n\n\n          PIERPONT + MAKLEY - DAY\n          wearing overcoats and hats with guns tucked inside, all walk\n          into the bank. Six CUSTOMERS.\n\n          TELLER\n\n          PIERPONT\n          Change a. twenty?\n           Teller looks up at Pierpont but is staring into the 45 cal.\n           barrel of a Tommy gun while...\n\n          DILLINGER\n           vaults the five foot divider railing and trains two 45s on\n          the TELLERS.\n\n          DILLINGER\n          Get over to the vault! Everybody! Go on!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          45.\n\n          CONTINUED:\n          He herds the tellers over. Pierpont makes customers sit in\n          chairs. The vault door is already open...\n\n          EXT. STREET - RED HAMILTON\n\n          in a black Studebaker is double-parked with the engine\n          running.\n\n          ECU: THE GIT,\n          the detailed map of their getaway route.\n\n          HOMER\n          on Lookout watches the street. Nothing. Dillinger and\n          Pierpont carrying canvas bags cross through the foreground\n          as...\n\n          INT. STUDEBAKER RED\n\n          throws it into gear and they drive away. Homer jumps on the\n          running board. Dillinger looks over his shoulder. Awestruck\n          pedestrian. From the other end of Main Street, no pursuit.\n\n          CUT TO:\n\n          INT. BUREAU OF INVESTIGATION, WASHINGTON - HOOVER - DAY\n\n\n          HOOVER\n          (into phone)\n          That was a miserable piece of work.\n\n          INT. BANKERS BUILDING - PURVIS - DAY (INTERCUT)\n\n\n          PURVIS\n          (into phone)\n          Yes, it was. I take full responsibility,\n          sir.\n          Hoover calms for a moment.\n\n          PURVIS (CONT'D)\n          And I'd like to request we hire part time\n          agents with \"special qualifications\"...\n          from outside the Bureau.\n\n          HOOVER\n          I thought you understood what I am\n          doing...build.ing a department of\n          professional investigators. Young college\n          men with law or accounting degrees from\n          good families. No, you may not go outside\n          the Bureau, Purvis.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          46.\n\n          CONTINUED:\n\n          PURVIS\n          The Bureau has used these men before.\n\n          HOOVER\n          They are not our \"type.\"\n\n          PURVIS\n          Our \"type\" cannot get the job done...\n\n          (BEAT)\n          Without qualified help I would have to\n          resign this appointment. Otherwise, I am\n          leading my men to slaughter.\n          Hoover is backed against the wall. He does not like it.\n\n          HOOVER\n          (dead cold)\n          Mr. Tolson will call you, Agent Purvis.\n\n          PURVIS\n          Thank you...\n\n          (CLICK)\n          Hoover hung up on him.\n\n          INT. UNION STATION (CHICAGO) - A TRAIN - DAY\n\n          has pulled into track 16. THREE MEN stand out among--,-\n          passengers. One's face is obscured by a wide brirmdd`hat.\n          They are --\n\n          CHARLES WINSTEAD, CLARENCE HURT + GERRY CAMPBELL\n          Stiff from the journey, they stretch, take in the crowd.\n          Winstead is in his mid 40s, 5 foot 8, body out of steel\n          cable. Hurt is in his late 30s. These men are ex-Texas\n          Rangers. Unlike flashier Texan lawmen of the period, they do\n          not wear Western wear unless they're on a horse. That's for\n          drugstore cowboys out to impress Easterners. They wear dark\n          suits and ties and hats. They have \"special qualifications.\"\n\n          WINSTEAD\n          What'd he say he looked like?\n\n          HURT\n          Didn't say.\n          Their suitcases have been set on the platform. A PORTER\n          approaches.\n\n          PORTER\n          Gentlemen need a hand?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          47.\n\n          CONTINUED:\n          Winstead gestures at their bags and one case. The PORTER goes\n          to lift the case. It is so heavy he can barely raise it.\n          Campbell picks up the other end. They toss it on the cartâ\u0080\u009e\n\n          PORTER (CONTÂ°D)\n          Hardware salesmen?\n\n          WINSTEAD\n          That's right.\n          His terse reply makes the garrulous porter stop talking.\n\n          INT. UNION STATION, GREAT HALL - DAY\n\n          The Neoclassical hall is enormous. Still no Purvis.\n\n          CAMPBELL\n          I'll call.\n\n          HURT\n          I'm going to the men's room.\n          Winstead spots a shoe-shine stand. Winstead sits, nods and\n          the SHOE SHINE MAN begins to polish his Western boots. He's\n          startled bi:the knife in a sheath built into the right boot.\n\n          WINSTEAD\n          Wcrk around it.\n          From under the brim of his hat, Winstead glances at big city\n          life in Union Station. He's an ominous presence.\n          HEAR the excited roar of a CROWD and we --\n\n          CUT TO:\n\n          EXT. THE KENNEL CLUB (MIAMI) -- MECHANICAL RABBIT -- DAY\n\n          zips along an inside railing under the flawless Miami sky...\n\n          SLEEK GREY HOUNDS\n          race in a pack after it under cumulous clouds and palm trees.\n          Streamline deco stands are almost filled.\n\n          FRANK NITTI\n          by the railing, watches the race with Phil D'An.drea. As they\n          begin to walk...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          48.\n\n          CONTINTJED\n\n          NITTI\n          (business as usual)\n          I want Johnny Patton out front on the\n          other four tracks. Tell Adonis. He can\n          have the parking concessions, and\n          maintenance.\n\n          PHIL D'ANDREA\n\n          (NODS)\n          Annenberg wants to sell you the remaining\n          equity in General News.\n\n          NITTI\n          How's he doing on the wire service?\n\n          PHIL D'ANDREA\n          Feeding to 300 bookies now. And he came\n          up with this gimmick called a scratch\n          sheet.\n          Another beat. Nitti stops for a beat\n\n          NITTI\n          Its hot out, right?\n\n          PHIL D'ANDREA\n          Yeah, Frank.\n\n          NITTI\n          Ever since those pricks shot me I can't\n          get warm.\n          (notices Phil's attention)\n          What?\n\n          PHIL D' ANDREA\n          Some friends from Chicago in the\n          stands...\n          D'Andrea nods. John Dillinger nods back. Nitti glances at\n          them; glances away.\n          Dillinger has on sunglasses. Billie is wearing a straw hat.\n          They are shouting to the greyhounds along with Pierpont,\n          Homer and Makley and some girls. They have tall drinks. This\n          is the good life for the privileged few in the middle of the\n          Depression.\n          A dog wins; not theirs. It calms down...\n\n          DILLINGER\n          (to Pierpont; business)\n          Well drive out separately.\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          49.\n\n          CONTINUED: ( 2)\n\n           DILLINGER (CONT'D)\n           Billie and I want to hit the Gulf Coast\n           on the way to Arizona.\n\n           PIERPONT\n           I want to take 66 and check banks in\n           Denver and Phoenix. We'll meet you in\n           Tucson on the 25th.\n\n          VAN METER\n          I think we wore out the Midwest for\n          awhile.\n\n          (BEAT)\n          I heard one today. Indiana paper.\n\n          (LOW)\n          \"Wanted. John Dillinger. Dead or...dead.\"\n          (they crack up)\n          Billie doesn't laugh. Dillinger pulls her close and she can't\n          resist his good spirits.\n          D'Andrea's approached...\n\n          PHIL D'ANDREA\n          How d'ya like the track? C'mon to the\n          Gc: -lonial for steaks tonight.\n          (writing on a card)\n          You be our guests...\n\n          DILLINGER\n          Well be there.\n\n          PHIL D'ANDREA\n          (to cocktail waitress)\n          Whatever these boys want, its on the\n          house.\n          He leaves. Pierpont, Makley and Homer go off to place new\n          bets. Billie looks at Dillinger. Looks away. Dillinger\n          catches her...\n\n          DILLINGER\n          What?\n          She is quiet for a moment.\n\n          BILLIE\n          Thank you, thank you for these last few\n          weeks. I never thought I'd see Florida.\n\n          DILLINGER\n          You going somewhere, doll, am I?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          50.\n\n          CONTINUED: (3)\n\n          BILLIE\n          It's been, three, four weeks. You'll look\n          for a change. Or you'll get tired of me.\n          And then I'll be sad and angry. So I\n          wanted to say thank you before then...\n          Dillinger is surprised that her expectations are so low. She\n          didn't think his interest in her to be more than passing.\n\n          DILLINGER\n          You want to leave?\n\n          BILLIE\n          No. But I'm no fool. I'll be back\n          checking coats at the Steuben Club.\n\n          DILLINGER\n          Well, I don't want you to leave. So it\n          won't be that way.\n\n          BILLIE\n          Then it will be another way that's worse.\n\n          (BEAT)\n          You rob banks and you run rings around\n          them, but you're likely to get killed or,\n          get shot and...\n\n          DILLINGER\n          Who the hell gave you a crystal ball?!\n\n          WILLIE\n          Well, goddamn it, you don't need a\n          crystal ball...! Ask Homer.\n\n          DILLINGER\n          Homer what...?\n\n          BILLIE\n          Homer and his damn joke... I don't want\n          to be around to see any of that. Okay?!\n          That's what it's about... Dillinger gets it.\n\n          DILLINGER\n          I am not going anywhere! I am going to\n          die in your arms as an old man when that\n          time comes. So what do you say about\n          that?\n\n          CLOSE ON BILLIE\n          Now is the first time she allows herself to have any prospect\n          about a future with him. It's a shock.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          51\n\n          CONTINUED: ( 4)\n          She hikes up her skirt and sits on his lap and smothers him\n          with a kiss. Her hat falls off. Patrons nearby glance and\n          look away. Dillinger doesn't give a damn.\n          A new pack of dogs are about to take flight.\n\n          EXT. PHILLIPS GAS STATION - BILLIE WITH A CAMERA -- DAY\n\n\n          (ARIZONA)\n          A fresh and tanned Dillinger and Billie are in a strikingly\n          modern gas station on Route 66. Billie helps out a family by\n          taking their picture with a Kodak Brownie in front of a\n          Saguaro cactus. Snow-capped Rincon mountains are behind them.\n          She leans down to play with the round baby. She looks over at\n          Johnnie and smiles. It breaks his heart.\n\n          INT. CONGRESS HOTEL, TUCSON, ARIZONA - ON THE CLERK - DAY\n\n          writing into a register. CLERK is a big man and Western\n          friendly.\n\n          CLERK\n          Mr. and Mrs. Frank Sullivan of Green Bay,\n          Wd cons in. How was your journey, sir?\n\n          DILLINGER\n          ., â\u0080¢ ng.\n\n          CLERK\n          I can send up some sandwiches and beer,\n          if you'd like.\n\n          DILLINGER\n          That would be swell. Some friends of mine\n          should be here already. J.C. Davies and\n          Mr. Long?\n\n          CLERK\n          Out shopping, I believe. I'll let them\n          know you're in when they come back.\n          Old BELLHOP takes Billie's bag to the elevator. Dillinger\n          carries his own case.\n\n          INT. ROOM 323 - DOOR OPENS\n\n          Dillinger tips the bellhop a dollar. Water runs. Dillinger\n          goes to the window - checks the street, checks for exits in\n          case of emergency.\n\n          DILLINGER\n          You want company?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          52.\n\n          CONTINUED:\n\n          BILLIE (O.S.)\n          After.\n\n          INT. BATHROOM - BILLIE\n\n          in the tub. Dillinger enters --\n\n          DILLINGER\n          First time you ever put me off. You\n          getting tired of me?\n\n          BILLIE\n          (his answer)\n          Get in here.\n          She stretches out and wets her hair. She sits up to reach for\n          the shampoo. Dillinger's got it and rubs it into her hair.\n          Dillinger hears something in the street. He goes to the\n          window and sees a car parked irregularly. TWO MEN get out.\n\n          DILLINGER\n          Get dressed. Right now.\n          He turns and runs into...\n\n          INT. ROOM 323\n\n          He's pulling a Tommy Gun out of his case when\n\n          CRASH!\n          THREE MEN burst in. One is the Clerk. He cracks Dillinger\n          across the head with the stock of his shotgun.\n          Dillinger falls to his knees. Clerk hits him twice more.\n          Billie rushes into the room.. She's naked. The two men from\n          the street haul Dillinger, bloody and semi-conscious, to his\n          feet and throw him against the wall and cuff him.\n\n          CLERK/EYMAN\n          Put clothes on, miss.\n\n          INT. JAIL -- DILLINGER\n\n          handcuffed is escorted through the outer cell block. He\n          reacts. In the opposite direction in shackles\n\n          PIERPONT + MAKLEY\n          escorted by six guards are being moved out of the jail.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          53.\n\n          CONTINUED:\n\n          DILLINGER\n          What happened?\n\n          PIERPONT\n          Fire in the hotel. Firemen found our\n          guns. Laid for us! Sorry, John.\n\n          DILLINGER\n          (shouts after them)\n          Where they taking you?\n\n          PIERPONT\n          (shouts back)\n          We're getting Shanghaied to Ohio!\n\n          DILLINGER\n          Where's Billie...?\n          Thenthey're gone. They now move Dillinger through.\n\n          COP EYMAN\n          Your girl's been put on a bus back to\n          Chicago. We ain't holding her.\n\n          INT. JAIL CELL - DILLINGER - NIGHT\n\n          is reading \"Startling Crime\" magazine. He HEARS holding cell\n          outer doors opened. He looks over.\n\n          MELVIN PURVIS\n          is there. Cowley and Baum are with him. Purvis is brought to\n          the cell. The COP who brought him goes back to his card game\n          with four or five Tucson Deputies. We SEE Winstead and Hurt\n          in their suits and ties are there, too. They lounge at ease.\n          A Tucson Deputy gives them coffee. Eye contact with\n          Dillinger.\n          But Dillinger reacts to Purvis.\n\n          DILLINGER\n\n          (BEAT)\n          Well, the man who killed Pretty Boy\n          Floyd. He might have been \"Pretty,\"\n          'cause he sure was not \"Whiz Kid Floyd.\"\n          Deputies stifle laughter. Dillinger comes up close to Purvis.\n          They are eyeball to eyeball. Only the bars separate them.\n\n          DILLINGER (CONT'B)\n          (loud, for the cop's benefit)\n          Now these Arizona boys, here?\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          54.\n\n          CONTINUED:\n\n          DILLINGER (CONT'D)\n\n          (BEAT)\n          They pulled on us right out. Didn't ask\n          Washington for permission. Didn't make\n          mistakes.\n          Arizona Deputies enjoy the flattery. Dillinger studies\n          Purvis...\n\n          DILLINGER (CONT'D)\n          Sorry about that fellow Barton.. .one who\n          got killed at the Sherone Apartments.\n          Is he getting to Purvis?\n\n          DILLINGER (CONT ' D)\n          Newspaper said you found him alive. It's\n          the eyes, ain't it? They look at you\n          right before they go. Then they drift\n          into nothing. Keep you up nights.\n\n          PURVIS\n          What keeps you up, nights, Mr. Dillinger?\n          Now Dillinger reads him like an X-ray.\n\n          DILLINGER\n          (doesn't answer)\n          You act like a confident man, Purvis. Bu _,\n          I don't see it. You know a few things.\n          You're probably okay when there's a groupÂ°\n          of you got the other guy outnumbered. But\n          death and mayhem up close? I am used to\n          that and you are not, are you? When it's\n          toe to toe, \"One of us will die right\n          here, right now,\" I don't think you got\n          the get up and go.\n          Purvis has nothing to say. He stares at Dillinger. Then he\n          turns to leave.\n\n          PURVIS\n          Goodbye, Mr. Dillinger.\n\n          DILLINGER\n          I'll see you down the road.\n          From ten feet away.\n\n          PURVIS\n\n          (QUIETLY)\n          No you wont. The only way you'll leave a\n          jail cell is when we take you out to\n          execute you.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          55.\n\n          CONTINUED: (2)\n\n          DILLINGER\n          Oh, yeah? We will see about that.\n\n          (BEAT)\n          Go get yourself another line of work,\n          Melvin.\n          Purvis gestures for the guards to let him out --\n          Dillinger lays back down on his cot. The Tucson Deputies\n          stare after Purvis, one laughs. After a moment...\n\n          DILLINGER (CONT'D)\n          (to Tucson Deputies)\n          I was joking about the \"we'll see about\n          that.\" I'll let you boys keep me in this\n          jail awhile.\n\n          COP EYMAN\n          We'd like that, Johnny, but don't get too\n          comfortable. They're moving you.\n\n          DILLINGER\n          `Where to?\n\n          COP EYMAN\n          'Indiana.\n\n          DILLINGER\n          why? I have absolutely nothing I want to\n          do in Indiana.\n\n          CUT TO:\n\n          EXT. SKY OVER CHICAGO - AERIAL: LOCKHEED LODESTAR LANDING\n\n\n          GEAR - NIGHT\n          descends. Its 6:10pm on a snowy Tuesday evening, January\n          30th. Below are dim jeweled street lights in the dark white\n          snow of the city.\n\n          EXT. MIDWAY AIRPORT RUNWAY - LOCKHEED\n\n          An assembly of photographers, 85 Chicago P.D. officers and a\n           crowd have come to greet the biggest celebrity in America.\n\n          AS DILLINGER DESCENDS THE AIRPLANE STAIRS\n          FLASHBULBS POP. Lake County, Indiana PROSECUTOR ROBERT ESTILL\n          puts Dillinger's jacket over him to guard against the cold.\n          Two huge Chicago cops put Dillinger into the back of a car.\n          With outrider motorcycles, the caravan takes off out of the\n          airport into the snowy night.\n\n          \n\n          \n\n          \n\n          \n\n          56.\n\n          EXT. CHICAGO STREETS - CROWDS - NIGHT\n\n           crane to see the Dillinger convoy as they hear approaching\n           sirens. It heads east towards the Indiana border and the town\n          of Crowne Point.\n\n          INT. LAKE COUNTY COURT HOUSE + JAIL -- (CROWN POINT, INDIANA)\n\n\n          - SHERIFF LILLIAN HOLLEY - NIGHT\n          at her desk when.\n\n          DEPUTY\n          He's here.\n          A diminutive woman, SHERIFF HOLLEY goes to greet the massive\n          cops who bring John Dillinger into her reception area and its\n          crowd of 30 reporters.\n\n          SHERIFF HOLLEY\n          (to reporters)\n          Back up over there.\n          Dellinger looks at the crowd. Per the \"Chicago Daily News\n          \"His diction was amazing - better in many instances than that\n          of his interviewers -- his poise no less so... There Was no\n          hint of hardness about him, no evidence save in the alert\n          presence of armed policemen that he had spent his formative\n          years in a penitentiary. He had none of the sneer of-the\n          criminal... Looking at him for the first time.,.heIates as\n          the most amazing specimen of his kind ever seen outside of\n          wildly imaginative moving picture.\"\n\n          SHERIFF HOLLEY (CONT'D)\n          You can take the manacles off of him now.\n\n          REPORTER\n          Johnny, are you glad to see Indiana\n          again?\n          Dillinger's slow charismatic smile...\n\n          DILLINGER\n          About as glad as Indiana is to see me.\n          Everybody laughs.\n\n          REPORTER #2\n          Did you smuggle the guns into Indiana\n          State Penitentiary for the big break of\n          September 26th?\n\n          REPORTER\n          How'd you get them in?\n\n          (CONTINUED )\n\n          \n\n          \n\n          \n\n          \n\n          57.\n\n          CONTINUED:\n\n          DILLINGER\n\n          (SMILES)\n          Right there, you're too inquistive...\n\n          PHOTOGRAPHER\n          Hey Bob...\n          (to Prosecutor Robert Estill)\n          Put your arm around Dellinger.\n          FLASHBULBS POP. They fluster Estill. Dillinger props his\n          elbow on the prosecutor's shoulder and cracks a broad grin.\n          The Prosecutor complies. They look like old pals.\n\n          REPORTER\n          When was the last time you were in\n          Mooresville?\n\n          DILLINGER\n          Ten years ago. I was a boy and foolish. I\n          held up a grocery store which I never\n          shoulda done cause Mr. Morgan was a good\n          man. And they sentenced me to 10 years in\n          the state penitentiary for a 50 dollar\n          theft. In prison, I met a lot of good\n          -t las. I helped fix up the break at\n          \"f chigan City. Why not? I stick to my\n          friends and they stick to me.\n\n          DILLINGER'S EYES\n          SEE him work the reporters. He knows that they are\n          sympathetic. He plays them like a champ. The New York Times\n          called this moment... \"a modern version of the return of the\n          prodigal son.\"\n\n          ANOTHER REPORTER\n          How long does it take you to go through a\n          bank?\n\n          DILLINGER\n          One minute and 40 seconds flat.\n          Dillinger nods and turns away. He - not the Sheriff - ends\n          the press conference.\n\n          TNT. FBI OFFICE - NEWSPAPER PICTURE: PROSECUTOR ESTILL\n          with his buddy, John Dillinger resting an arm on his\n          shoulder.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          58.\n\n          CONTINUED:\n\n          HOOVER (O.S.)\n          Why is this clown Estill fraternizing\n          with the man he is scheduled to\n          prosecute?!\n          REVEAL we are in Hoover's office.\n\n          INT. LAKE COUNTY CRIMINAL COURT BUILDING - LOUIS PIQUETT -\n\n\n          DAY\n          LOUIS PIQUETT - a former bartender and Chicago gangland's\n          melodramatic mouthpiece - is escorted to the cellblock by\n          jailor LEWIS BAKER.\n\n          INT. UNOCCUPIED OPEN CELL\n\n          Dillinger's waiting for him. Dillinger holds Piquett's\n          business card. They shake hands.\n\n          DILLINGER\n          You come highly recommended by Alvin\n          Karpis. What can you do for me?\n\n          PIQUETT\n          What's on your mind?\n\n          DILLINGER\n          The electric chair.\n          There's none of Dil linger's cocky joie de vivre. Thaw-'s for\n          reporters.\n\n          INT. LAKE COUNTY COURT - JUDGE MURRAY - DAY\n\n          is on the bench. Dillinger is shackled to his chair.\n          The courtroom is packed. Walls are lined with deputies\n          holding rifles. Reporters scribble. The gavel quiets the\n          crowd.\n\n          PIQUETT\n          (on his feet)\n          Your honor! Are we to have a hearing in\n          accord with the laws of this nation, or\n          is the State to be permitted to incite an\n          atmosphere of prejudice? The very air\n          reeks with the bloody rancor of\n          intolerant malice. The clanging of\n          shackles brings to our minds the dungeons\n          of the Czars, not the flag-bedecked\n          liberty of an American courtroom. I\n          request the court to direct that those\n          shackles be removed forthwith!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          59.\n\n          CONTINUED:\n\n          ROBERT ESTILL\n          This is a very dangerous man, your Honor.\n\n          DEPUTY HOLLEY\n          (Lillian Holley's nephew)\n          And I'm responsible for the safeguarding\n          of the prisoner.\n\n          P IQUETT\n          Who are you?! Are you a lawyer? What\n          right have you to address this court?\n\n          JUDGE MURRAY\n          Alright, remove the handcuffs from the\n          prisoner.\n\n          ROBERT ESTILL\n          Your honor, we'd like to relocate the\n          prisoner. Only Indiana State Prison in\n          Michigan city can guarantee Dillinger\n          will not escape.\n\n          JUDGE MURRAY\n          Sheriff Holley?\n\n          SHERIFF HOLLEY\n          I concur, your honor.\n\n          PIQUETT\n          Sheriff Holley, I think it's a very nice\n          jail you have right here. What makes you\n          think there's anything wrong with it?\n\n          SHERIFF HOLLEY\n          There isn't anything wrong with my jail!\n          It's the strongest jail in Indiana.\n\n          PIQUETT\n          That's what I thought. But of course, I\n          don't want to embarrass Mrs. Holley. I\n          appreciate that she's a woman and if\n          she's afraid of an escape...\n\n          SHERIFF HOLLEY\n          I'm not afraid of an escape. I can take\n          care of John Dillinger or any other\n          prisoner.\n\n          JUDGE MURRAY\n          Okay, Dillinger will stay here.\n          Dillinger's staying in crown Point. Dillinger's relieved.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          60.\n\n          CONTINUED: (2)\n\n          PIQUETT\n          Thank you, your Honor. The Defense will\n          need four months to prepare itself.\n\n          ROBERT ESTILL\n          It should take 10 days.\n\n           PIQUETT\n          To go on trial in 10 days would be a\n          legal lynching of this lad! There's a law\n          against lynching!\n\n          ROBERT ESTILL\n          There's a law against murder!\n\n          PIQUETT\n          Then observe the law part. Or just stand\n          Dillinger against the wall and shoot him.\n          Then, there's no need to throw away the\n          State's money on this mockery.\n\n          JUDGE MURRAY\n          (to both lawyers)\n          Calm down.\n\n          PIQUETT\n          I apologize to the court.\n          (indicating Estill)\n          Bob and I respect each other very much.\n\n          JUDGE MURRAY\n          (warns Estill)\n          Watch out or he'll be putting his arm\n          around you, too.\n          Laughter ripples.\n\n          JUDGE MURRAY (CONT'D)\n          The trial starts in one month on March\n          12th.\n          DILLINGER as he stands, handcuffs are reapplied. He leans to\n          Piquett, whispers.,.\n\n          DILLINGER\n          Atta boy, counsel.\n\n          E/I. LAKE COUNTY JAIL - MORNING\n          SAM CAHOON,, a 64-year-old janitor, trots through the rain and\n          into the jail. He shakes the rain from his coat, waves to a\n          GUARD and passes through to the\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          61.\n\n          CONTINUED:\n\n          CORRIDOR\n          It runs the length of the jail. At the far end is the barred\n          door to the criminal cell block.\n\n          INT. CRIMINAL CELL BLOCK\n\n          Cahoon gathers his mops.\n\n          CAHOON\n          Bryant!\n          GUARD BRYANT pulls a lever, opening the cells in the cell\n          block.\n          Dillinger and 14 PRISONERS step out of their cells, free to\n          roam the corridor behind the barred cell-block door. Cahoon\n          and TWO TRUSTEES, carrying boxes of toilet paper, soap and\n          Dutch cleanser, enter.\n          Dillinger jabs something in Cahoon's belly. Cahoon gets a\n          glimpse: it's a small black gun.\n\n          DILLINGER\n          -Cpme on, Sam, we're going places.\n          A hulking black prisoner, HERBERT YOUNGBLOOD, holding a\n          length of ipe, materializes next to Dellinger and ushers\n          Bryant and the Trustees into an empty cell. Youngblood pulls\n          the lever, locking the cells.\n\n          DILLINGER (CONT'D)\n          Boys, get in there.\n          Dillinger, Youngblood and Cahoon set off down the corridor.\n\n          INT. LAKE COUNTY JAIL, CORRIDOR - DILLINGER\n\n\n          DILLINGER\n          Call the warden.\n\n          CAHOON\n          Warden! Warden? Come on back!\n          Warden LEW BAKER emerges from the office. Dillinger raises\n          the gun.\n\n          WARDEN BAKER\n          That ain't real.\n\n          DILLINGER\n          Anything you say.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          62.\n\n          CONTINUED:\n          Dellinger grabs him by the shirt, spins him round and jams it\n          under his chin.\n\n          INT. LAKE COUNTY JAIL, WARDEN`S OFFICE - FOUR GUARDS\n\n          look up, startled.\n\n          DILLINGER\n          No one move or I'll plug the warden.\n          Dillinger grabs two Tommy guns. Youngblood starts tying up\n          their prisoners. Baker stares at Dillinger's pistol.\n\n          WARDEN BAKER\n          I was right, wasn't I? It's not real.\n\n          INT. GARAGE\n\n           at the rear of the jail. A mechanic named EDWARD SAAGER is\n          hunched over the engine of a 1927 Nash when he feels\n           something shoved into his back. He turns to see\n\n          DILLINGER\n          Alright, which of these here cars is the\n          fastest, and you're going with, so don't...\n          lie.\n\n          SAAGER\n          That would be the Ford in the corner.\n          It's got the new V-8.\n\n          DILLINGER\n          We're taking that.\n\n          SAAGER\n\n          (HESITATING)\n          That's Sheriff Lillian Holley's personal\n          car.\n          That even more highly recommends it. Dillinger starts ripping\n          ignition wires out of the other cars. Dillinger, Youngblood,\n          Deputy Sheriff Blunk, and Saager are herded into the\n          Sheriff's Ford V-8.\n\n          EXT. CROWN POINT MAIN STREET - FORD V-8 - DAY\n\n          with Dillinger driving. Youngblood's in the backseat covering\n          Saager + Deputy Sheriff Blunk. They cruise out of town.\n\n          INT. HOLLEY'S FORD V-8 - YOUNGBLOOD\n\n\n          YOUNGBLOOD\n          We got a car following.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          63\n\n          CONTINUED:\n          Youngblood shoves the Thompson out the window and fires some\n          rounds. Meanwhile, Dillinger floors it, The V-8 roars,\n          rockets them ahead.\n\n          DILLINGER\n          (re acceleration)\n          Wow. Mr. Youngblood, are we clear now?\n\n          YOUNGBLOOD\n          We are.\n\n          DILLINGER\n          okay, folks.\n          Dillinger checks his rearview mirror, then the speedometer.\n          He's impressed.\n\n          DILLINGER (CONT'D)\n          (addressing the two hostages)\n          I'm going to write to Henry Ford. \"Dear\n          Henry Ford, Your 1934 Ford is the best\n          damned getaway car in America. Yours\n          -truly, John Dillinger.\"\n          (eyes tense hostages)\n          Relax folks...\n          Dillinger ajoys the speed. He starts to hum. Then...\n\n          DILLINGER (CONYÂ°D)\n          Okay. Who knows The Last Round-up?\"\n\n          (SINGING)\n          \"Get along little doggie, get along..\"\n\n          INT. J. EDGAR'S OFFICE - RADIO\n\n          Only Tolson and J. Edgar Hoover are there.\n\n          REPORTER\n          How did he act?\n\n          DEPUTY SHERIFF SLUNK\n          Well...he sang part of the way.\n\n          REPORTER\n          What did he sing?\n\n          DEPUTY SHERIFF SLUNK\n          You know The Last Round-up.\"\n          (half-sings \"The Last Round-\n\n          UPS= )\n          \"Get along little doggie, get along...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          64.\n\n          CONTINUED:\n\n          NARRATOR\n          (Lowell Thomas voice)\n          As John Dillinger escaped from the Crown\n          Point jail ...or as folks now call it, the\n          \"Clown Point Jail\"...he appears immune to\n          the forces of law. And commenting in his\n          fireside address on March 5th, 1933...\n\n          FDR\n          The Federal government, you know, cannot\n          be held up to mockery in this way...\n          Hoover is rocked. It's as if FDR is saying Hoover is the man\n          responsible for the federal government being mocked...\n\n          NARRATOR\n          (pause; heraldic music)\n          Meanwhile, the Emperor Haile Selassie.\n\n          CUT TO:\n\n          INT. WALGREENS DRUG STORE, GARY, INDIANA - PHONEBOOTH:\n\n\n          DILLINGER\n          watches cars, people, then.\n\n          DILLINGER\n          (into the phone)\n          It's me, Baby.\n\n          INT. WILLIE'S FURNISHED APARTMENT - NIGHT\n\n          It's basic, the furniture is worn. Billie clutches the phone\n          to her ear.\n\n          DILLINGER (PHONE)\n          I can't talk long. Are you okay?\n\n          INT. TELEPHONE EXCHANGE\n\n          Baum is listening intently to John Dellinger. An acetate disc\n          turns. The stylus cuts. Agent Madala is calling Billie's\n          local exchange to see if the operator can trace the call.\n\n          INT. BILLIE'S APARTMENT - BILLIE\n\n\n          BILLIE\n          Don't come to Chicago.\n\n          INT. ROOM IN TELEPHONE EXCHANGE - BAUM\n\n\n          DILLINGER (O.S.)\n          I promised I'd look after you, didn't I?\n\n          \n\n          \n\n          \n\n          \n\n          65.\n\n          TNT. WALGREEN'S DRUG STORE - DILLINGER\n          Intercut Dillinger and Billie.\n\n          BILLIE\n          Yes.\n\n          DILLINGER\n          And you believe me, don't you? You know I\n          will look after you.\n\n          BILLIE\n          Yes.\n\n          DILLINGER\n          Say it. Say you know it.\n\n          BILLIE\n          Don't come to Chicago, Johnnie.\n\n          DILLINGER\n          Say it.\n\n          BILLIE\n          know you will look after me.\n\n          DILLINGER\n          love you, Baby.\n          Dillinger ends the call. Hamilton waits in a Hudson at the\n          curb.\n\n          INT. TELEPHONE EXCHANGE\n\n          Madala shakes his head - no trace.\n\n          I/E. PURVIS'S PIERCE-ARROW - ACROSS FROM BILLIE'S APARTMENT\n\n          BUILDING - ON PURVIS\n          With Baum.\n\n          PURVIS\n          She knows we're watching and he knows\n          we're listening.\n\n          CUT TO:\n\n          EXT. CAROLE SLAYMAN'S WHOREHOUSE, REAR YARD - DILLINGER\n\n          drives the '34 Ford. Next to him, now, is Red Hamilton. The\n          ' 34 Ford drives into the backyard. Johnny's out and\n          approaching the rear door, his jacket over his right arm\n          partially hiding the Thompson. He's glad to be back...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          66\n\n          CONTINUED:\n\n          DILLINGER\n          (big smile)\n          Hiya Sport.\n\n          SPORT\n          How're ya doin' Mr. Johnny? You gotta\n          hold it right there...\n          Where's the warm welcome...?\n\n          DILLINGER\n          Where's Carole?\n\n          SPORT\n          They got moved to Newport, Kentucky.\n\n          (BEAT)\n          Can't stay here no more, Mr. Johnny.\n          The smile falls off Dillinger's face.\n\n          DILLINGER\n          Says who?\n\n          INT. KITCHEN - MARTIN ZARKOVICH\n\n          makes himself visible in the doorway. Unseen are two big cops\n          with shotguns who stay hidden inside.\n\n          ZARKOVICH\n          (moves into doorway)\n          Sport's only following orders. So am I.\n          He demonstrates that his palms are empty. He's smart enough\n          not to be armed.\n\n          ZARKOVICH (CONT'D)\n          They thought you might come here.\n          Zarkovich is nervous. Dillinger reaches for his front pocket.\n\n          ZARKOVICH (CONT ` D )\n          Your money is no good.\n\n          DILLINGER\n          I don't get it.\n\n          ZARKOVICH\n          You go talk to your pal, Gilbert.\n\n          DILLINGER\n          About what?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          67.\n\n          CONTINUED:\n\n          ZARKOVICH\n          Talk to Gilbert Catena.\n          Dillinger, not taking his eyes off windows and doors, backs\n          away. He knows there are more men. Zarkovich is nervous and\n          frozen because...\n\n          RED HAMILTON'S\n          front sight rests on Zarkovich's heart which he would blow\n          out the back of his chest with the souped-up 351 Winchester.\n          Now, Dillinger pulls the '34 Ford out of the backyard with\n          Red still on the running board. Zarkovich almost faints in\n          relief.\n\n          CUT TO:\n\n          EXT. BRICK STREET IN KANKAKEE, ILLINOIS - THE '34 FORD - DAY\n\n          pulls to the curb. Weeds. Vestiges of prairie. An old house\n          sits at the back of a lot. A workshop is near the road. A\n          sign says 'ï¿½Lieboldt Repair.\"\n\n          FRONT DOOR;.:.:- DILLINGER\n          on the bel,:,\n          ,A worn-looking woman answers. She is HARRIET\n\n          LIEBOLDT.\n\n          DILLINGER\n          We're looking for Oscar...is he home?\n\n          MRS. LIEBOLDT\n          I'm Mrs. Lieboldt. And he ain't home.\n          He's dead.\n          Johnny glances at Red.\n\n          DILLINGER\n          I sure am sorry, ma'am. Was it an.\n          accident?\n\n          MRS. LIEBOLDT\n          He accidentally got in the way of a\n          shotgun when it was going off. What do\n          you want?\n\n          DILLINGER\n          Oscar had \"tools\" of mine, he was\n          repairing them.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          68.\n\n          CONTINUED:\n\n          MRS. LIEBOLDT\n          Everything that was here? Those people\n          took it all away. It ain't here no more.\n\n          CUT TO:\n\n          INT. KEDSIE AVENUE CIGAR STORE - GLASS DOOR\n\n          slams open. Dillinger and Red enter. Red throws two customers\n          outside, closes the door, flips the sign to CLOSED. Dillinger\n          confronts Gilbert Catena with a 45 pulled from one of two\n          shoulder holsters and dead centered on Gilbert's forehead.\n\n          DILLINGER\n          I went to East Chicago to lay low. The\n          welcome mat was not out. And I kept\n          hearing your name.\n\n          (BEAT)\n          Then at Oscar's, my gear is gone.\n          The deadly look in Dillinger's eyes leaves no mistake.\n\n          DILLINGER (CONTÂ°D)\n          I am going to ask you once.\n\n          (BEAT)\n          And I just did.\n\n          GILBERT\n          Let me make a telephone call.\n          Dillinger nods.\n\n          GILBERT (CONT'D)\n          (into phone)\n          Gimme Phil...\n\n          (BEAT)\n          He's downstairs.\n          He hangs up. He gestures to a doorway and stairs leading to\n          the second floor. Johnny and Red throw Gilbert up the stairs\n          first.\n\n          INT. SECOND FLOOR - GILBERT, DILLINGER + RED - DAY\n\n          enter. They see office remodeling in progress. FIVE\n          TECHNICIANS run wires, installing phones. EIGHT CLERKS with\n          shades on and ledgers man phones. Other men are looking over\n          blueprints. They look up. They are Jake Guzik and his\n          brother, Phil D'Andrea and seven or eight assorted Syndicate\n          soldiers.\n\n          FOUR HEAVYSET SOLDIERS\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          69.\n\n          CONTINUED:\n          come forward to frisk Johnny + Red. They gesture for them to\n          open their coats to allow the search.\n\n          D'ANDREA\n          (irritated; to Catena)\n          Anybody see him come in?\n\n          GILBERT\n          I don't think so.\n          SOLDIER ONE. Dillinger turns the man, slams a knee into his\n           kidney, pulls him back off balance, holds him up with one 45\n          under his jaw, as he draws the second 45 and sweeps the\n          group...\n\n          DILLINGER\n          Wanna know if we're armed? Were armed.\n          He dumps this guy on his ass, his heavy shoe an ounce from\n          crushing his larynx. Red's two Thompsons concealed on\n          shoulder straps are out from under his coat. Frozen time.\n          Phil D'Andrea sits on the corner of a table. Only he stays\n          relaxed.\n\n          D'ANDREA\n          k around, Johnny. What do you see?\n\n          1 1 DILLINGER\n          A`lot of telephones.\n\n          D'ANDREA\n          You see money. Before last month there\n          were independent wire services letting\n          bookies know who won the third race at\n          Sportman's Park. 300 of 'em. Now there's\n          only one. Ours. General News. Nationwide.\n          On October20, you robbed the bank in\n          Green Castle, Indiana. You got away with\n          $74,802. Split 5 ways, that's $14,960.40.\n          You probably thought that was a big\n          score.\n          Dillinger stares at him. Where's this going?\n\n          D'ANDREA (CONT'D)\n          (indicates the room)\n          This room makes that much every day. That\n          is how money gets made. And it keeps\n          getting made, day after day after day. It\n          is a river of money. Flowing right to us.\n          And it gets deeper and it gets wider.\n\n          (BEAT)\n          Unless the cops come through that door.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          70.\n\n          CONTINUED: (2)\n\n          DILLINGER\n          But they won't.\n\n          D'ANDREA\n          That's right. We pay them not to. Unless\n          they know you're here. Then they come\n          through the door, no matter what.\n\n          (BEAT)\n          What does that tell you?\n\n          DILLINGER\n          I'm popular.\n\n          D'ANDREA\n          You're bad for business.\n          What this is, is called obsolescence.\n\n          D'ANDREA (CONT'D)\n          So the Syndicate got a new policy,\n          Johnny.\n\n          (BEAT)\n          Guys like you? We ain't laundering your\n          money or bonds no more. You ain't holing\n          up in our whorehouses anymore. No\n          armorers. No doctors. No nothing.\n\n          (BEAT)\n          That's the way it is.\n          D'Andrea comes closer to him.\n\n          D'ANDREA (CONT'D)\n          And I am a messenger. This is business.\n\n          (QUIETLY)\n          Between us...\n          He reaches into a pocket for cash.\n\n          D'ANDREA (CONT'D)\n          You need something to tide you by in case\n          you're short?\n          Dillinger and Red's looks say it all. They start out.\n\n          D'ANDREA (CONT'D)\n          Okay-but can you do me a personal\n          favor?\n          Dillinger hesitates.\n\n          D'ANDREA (CONT'D)\n          For my son, Mark. You're his hero.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          71.\n\n          CONTINUED:( 3)\n          D'Andrea pulls out piece of paper and a pen. Dillinger looks\n          at him like he's crazy. Then he signs the autograph.\n\n           D'ANDREA. (CONT'D)\n           Good luck to you. You too, Red.\n\n          TNT. CIGAR STORE - DILLINGER + HAMILTON\n          cross through.\n\n          HAMILTON\n          Why'd you sign that asshole's paper?\n\n          DILLINGER\n          I don't know.\n\n          EXT. JUSTICE DEPT. BUILDING + STAIRCASE - PURVIS WAS KEPT\n\n\n          WAITING. HE NOW JOINS HOOVER + SUYDAM\n          who are briskly exiting the building. Hoover's angry. His\n          voice is clipped and rapid-fire.\n\n          HOOVER\n          ...they call Crown Point, \"Clown Point.\"\n          ,,.,The Bureau of Investigation cannot catch\n          \"\"Public Enemy No. 1, but Arizona cowboys\n          zï¿½. The President of the United States\n          -s'aid Dillinger is making a mockery of the\n          system of justice in this country. That\n          means I am allowing Dillinger to make a\n          mockery of the system of justice in this\n          country. It is a dark cloud. There is a\n          silver lining in that cloud. By escaping,\n          John Dillinger has given us a second\n          chance to get John Dillinger.\n\n          (BEAT)\n          Hamilton has a 17 year old sister in\n          Detroit. Arrest her. Dump her in the\n          tank. Pick up all known Dillinger\n          associates. Doctors. Question family\n          members. Pierpont's mother in\n          Indianapolis. Dillinger's family in\n          Mooresville. Foreigners. We suspect all\n          of them of harboring...\n\n          PURVIS\n          Hamilton's family hasn't had word from\n          him in years ...\n\n          HOOVER\n          That's the point. Motivate them to get\n          \"word.\" Create informants, Agent Purvis.\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          72.\n\n          CONTINUED:\n\n          HOOVER (CONT'D)\n          I want suspects interrogated\n          \"vigorously.\" \"Grilled.\" No misplaced\n          sentimentality. As they say in Italy and\n          elsewhere these days...\"take off the\n          white gloves.\"\n          By this point, they're down the Justice Department staircase.\n          Purvis is dismissed. Hoover steps in front of a...\n\n          MOVIETONE NEWS CREW\n          where 35 boys, aged 12-15 have been waiting in a line. High\n           voltage enthusiasm suddenly imbues Hoover.\n\n          HOOVER\n          What's your name, son?\n\n          HARRIS\n          Harris.\n          The cameras roll.\n\n          HOOVER\n          (turning to camera)\n          G-Men all over the country have picked up:\n          the gauntlet flung down by the outlaws\n          and wanton murderers. And these junior\n          crime fighters, these junior G-men...\n          COLOR DESATURATES into BLACK + WHITE. We don't kno Â°why.\n\n          HOOVER (CONT'D)\n\n          (CONTINUING)\n          .every one of them., stopped some crime\n          from occurring and forestalled an entry\n          into the black book of criminal deeds. I\n          am rewarding them with these medals\n          today. My friend, Harris here, is the\n          first...\n          Hoover pins the first medal on Harris.\n          And OVER that we HEAR OFFSCREEN...\n\n          DILLINGER (O.S.)\n\n          (LOW)\n          You can size up a score like nobody's\n          business, Tommy. You're a good egg, but I\n          don't like Nelson.\n\n          WHY IS JOHN DILLINGER'S VOICE HERE?\n\n          BLACK + WHITE OF HOOVER\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          73.\n\n          CONTINUED:\n          cuts to photograph of...\n\n          BLACK + WHITE PRETTY BOY FLOYD,\n          bullet-ridden on a slab in a morgue. And we HEAR..\n\n          MOVIE ANNOUNCER (V.O.)\n\n          (BOOMING)\n          Pretty Boy Floyd. He thought he could\n          lead a life of crime with impunity...\n          PULL BACK to reveal. .JOHN DILLINGER. We are in...\n\n          INT. MOVIE THEATER - DILLINGER'S\n\n          listening to Tommy Carroll. Next to Dillinger in the row is\n          Red.\n\n          TOMMY CARROLL\n\n          (WHISPERS)\n          You got Lester wrong. He thinks the world\n          of you. Whole country thinks you're a\n          hero.\n           Beyond their on the screen Pretty Boy Floyd`s face is replaced\n          by Harry P e rpont's mug shot.\n          Now, SHOUSE,enters and sits next to Tommy. We haven't seen\n          him since Johnny threw him out of the car in Indiana. He\n          holds out his hand...\n\n          SHOUSE\n\n          (WHISPERED)\n          Johnny, willing to let bygones by\n          bygones...\n          Nothing from Dillinger. On the screen now is Pierpont's\n          image.\n\n          MOVIE ANNOUNCER (V.O.)\n\n          (BOOMING)\n          Recently convicted of murder in Lima,\n          Ohio and sentenced to die in the electric\n          chair is John Pierpont...\n\n          CARROLL\n          John, we gotta all be friends or this\n          ain't gonna work.\n\n          DILLINGER\n          Red told you. After we take the bank, we\n          bust out Pierpont and Makley.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          74.\n\n          CONTINUED:\n\n          SHOUSE\n          They got the prison surrounded by\n          National Guard...\n\n          MOVIE ANNOUNCER (V.0.)\n          And Director J. Edgar Hoover would like\n          you in the audience to help us\n          apprehend... Public Enemy #1.\n\n          NOW ON THE SCREEN: JOHN DILLINGER\n          The men freeze.\n\n          MOVIE ANNOUNCER (V.O.) (CONT'D)\n          .Dillinger is thought to be in Indiana\n          or Illinois and has been known to travel\n          with this man. Look around you, ladies\n          and gentlemen...\n          Red Hamilton's photo. Shouse tries to rise. TOMMY slams him\n          back into his seat.\n\n          HAMILTON\n          Oh Jesus...\n          Now the LIGHTS come up!\n\n          MOVIE ANNOUNCER (V.0.)\n          They may be sitting right next to you!\n          Turn to your right and turn to your\n          left...\n          Audience turns right and left. Dillinger and Hamiltn and\n          Tommy turn their heads, too, searching for desperadoes.\n\n          JOHN DILLINGER\n          The exposure is so outrageous it makes Dillinger laugh out\n          loud. That makes the people all around talk and joke.\n\n          DILLINGER'S HAND\n          grips his45. Shouse is grey with fear. Houselights darken.\n          Finally, Looney Tunes starts. Daffy Duck.\n\n          CARROLL\n\n          (LOW)\n          After the bank we'll figure out if we can\n          bust out Pierpont and Makley...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          75.\n\n          CONTINUED: ( 2)\n\n          HAMILTON\n          Shouse, you step out of line one inch and\n          and I will kill you. Then I will kill\n          your parents for having had you. Then I\n          will kill their pet dog.\n\n          DILLINGER\n          Where's the bank?\n\n          CARROLL\n          Sioux Falls. Nelson says there's $800,000\n          in there. He got us a great place to hole-\n          up after 'til the heat blows over.\n\n          DILLINGER + RED\n          walk up the aisle to CAMERA. Cartoons continue behind them.\n\n          HAMILTON\n          \"Don't work with people you don't know\n          and don't work when you're desperate.\"\n          Walter Dietrich. Remember that?\n\n          DILLINGER\n          Walter forgot ...when you're desperate,\n          'f iat's when you got no choice.\n\n           INT. LOBBY` SECURITY NATIONAL BANK & TRUST COMPANY (SIOUX\n\n\n          FALLS, SOUTH DAKOTA) - NELSON - DAY\n          throws open his overcoat, draws his Tommy gun and FIRES a\n          burst into the ceiling, bringing down plaster and light\n          fittings. EMPLOYEES AND CUSTOMERS panic.\n\n          BABY FACE NELSON\n          Everyone on the floor! This is a hold-up.\n\n          DILLINGER\n          (passing Nelson)\n          You're turning it into a circus! What the\n          hell are you doing?\n          Meanwhile, a terrified CLERK presses a button and the alarm\n          rings loudly outside.\n\n          BABY FACE NELSON\n\n          (RANTS)\n          I'd like to know who set that alarm off.\n          Who the hell did it? Who?\n          Dillinger and Red get to the BANK PRESIDENT and shove him\n          towards the vault. Nelson is working himself into a frenzy.\n          He points his gun at one terrified Customer after another.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          76.\n\n          CONTINUED:\n\n          BABY FACE NELSON (CONT'D)\n          If you want to get killed, make a move.\n          What about you? How about you?\n\n          VAULT\n          Its a lot less than $800,000.\n\n          DILLINGER\n          Where in the hell's all the big money?\n\n          OUTSIDE THE BANK\n          A traffic cop, ROGER POWERS, runs up. Van Meter surprises and\n          disarms him in classical fashion, but...\n\n          LOBBY\n          Through the window Carroll sees a motorcycle cop, HALE KEITH,\n          arrive outside. Nelson scrambles onto a desk and FIRES a\n          burst through the plate glass.\n\n          BABY FACE NELSON\n          I got one, I got one! I got a cop!\n\n          VAULT - ON DILLINGER\n          can't believe this is fucking HAPPENING.\n\n          EXT. THE SECURITY NATIONAL BANK & TRUST COMPANY\n\n          Dillinger and Hamilton emerge with the Bank President, FOUR\n          TELLERS for a scrum of hostages. Carroll and Nelson,,:.,have a\n          ragtag bunch. They're almost at the car. Nelson turns to the\n          onlookers.\n\n          NELSON\n          What are you looking at?\n          Nelson FIRES over their heads. Hostages scream and try to\n          break loose. Nelson advances on the crowd...\n          Out of a JEWELRY STORE, HARRY BERG, emerges and fires at BABY\n          FACE NELSON, who is wearing a bullet-proof vest. Nelson\n          sprays the area. Berg dives back in his store, BYSTANDER,\n          JACOB SOLOMON, is hit in the stomach and crumples. Delay\n          allows...\n\n          EXT. ROOFTOPS ACROSS THE STREET -- DEPUTY\n\n          with a 44-40Winchester gets a bead on\n\n          DILLINGER\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          77.\n\n          CONTINUED:\n          He squeezes off a ROUND. The shot hits Dillinger in the back\n          of the left shoulder and exits his upper arm.\n\n          DILLINGER\n          Son of a bitch!\n\n          BANG!\n          The second shot hits Carroll in the head, knocking off his\n          hat. Dillinger fires up at the DEPUTY, tries to lift Carroll,\n          blood gushes from his head. He appears to be dead. Dillinger\n          leaves him.\n          Sixteen year old, JOE PAWLOWSKI -- fueled by adrenaline, runs\n          across the street and jumps onto Nelson's back. Nelson,\n          screaming with rage, throws him through a plate glass window,\n          FIRES two rounds and runs to join the others -- PURE CHAOS.\n          Dillinger throws Nelson in the car.\n\n          THE HUDSON\n          surges forward. The car proceeds to an intersection and\n          stops.\n\n           DILLINGER (CONT'D)\n          m.on!\n          Shouse cant find his place on the.git.\n\n          HAMILTON\n          Right! Goddamnit! Right!\n          As Shouse makes the turn...\n\n          INT. FORD, TRAVELLING - DILLINGER\n\n           grimaces with pain. Hamilton helps him off with his overcoat.\n\n          EXT. LITTLE BOHEMIA - FORD - TWILIGHT (LATER)\n\n          pulls in. Its a tourist lodge -a two-story log cabin with a\n          bar, kitchen and dance floor downstairs and bedrooms above.\n          EMIL WANATKA, comes out, trailed by his two collies and\n          Nelson's girlfriend, Vi Scott.\n\n          DILLINGER\n          How'd you find this place?\n          Dillinger looks at Wanetka. He's uneasy. He trusts nothing\n          about it.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          78.\n\n          CONTINUED:\n\n          NELSON\n          Couple of Chicago guys told Tommy. Don't\n          worry, nobody's gonna find us. He thinks\n          were salesmen.\n\n          INT. DILLINGER'S ROOM - MONEY - NIGHT\n\n          being counted.\n\n          DILLINGER\n          How much?\n          Nobody wants to answer. Hamilton meanwhile uses Atropine\n          sulphate to clean Dillinger's wound.\n\n          BABY FACE NELSON\n\n          $46,120.\n\n          DILLINGER\n          That would be less than $800,000, right?\n          Right!\n\n          VAN METER\n          Still more than $8,000 a man.\n\n          DILLINGER\n          Leave my money and get out.\n          Van Meter, Nelson and Shouse exit.\n\n          DILLINGER (CONT'D)\n          We gotta cut loose from Nelson.\n\n          HAMILTON\n          You need to rest up awhile.\n\n          DILLINGER\n          No. We don't get out of here in the\n          morning, we're going to wind up dead.\n\n          HAMILTON\n          We could head to Reno...\n          Dillinger lies back in bed, looks around the room, angry and\n          frustrated. Hamilton gets up to leave...\n\n          DILLINGER\n          I need two more guns, Red.\n          OVER we HEAR the SOUND OF SOMEONE SCREAMING and CALLING OUT --\n\n          \n\n          \n\n          \n\n          \n\n          79.\n\n          INT. SIOUX FALLS HOSPITAL - TOMMY CARROLL - NIGHT\n\n          in the bed, his head swathed in bandages. He lapses in and\n          out of consciousness, thrashes with pain, shouting out.\n\n          WERE ACUTELY AWARE OF PURVIS.\n          Uncomfortable, Purvis stands apart from the others. Agents\n          Rorer and Clegg are by the bedside.\n\n          CARROLL\n          Gimme the shot, Doc. Please. I'm begging\n          you.\n\n          RORER\n          Not until you tell us!\n          As the pressure inside his skull becomes unbearable --\n\n          CARROLL\n          Oh, Mother! Help me! Please, God!\n          He begins to scream. It is harrowing. A DOCTOR hurries into\n          the room, Purvis blocks him from the patient. He shoves him\n          back out the door and follows him...\n\n          DOCTOR\n          (spits it out, fury)\n          T h e bullet entered the back of his head.\n          It is resting over his right eye. His\n          brain is swelling. He will be dead soon.\n          He is suffering and I need to sedate him.\n\n          PURVIS\n          Not yet. If you interfere, I'll arrest\n          you.\n          From inside.\n\n          RORER\n          Where is he?!\n\n          CARROLL\n          Give me a shot!\n\n          RORER\n          Di.llinger! Then you get the shot! Where\n          is he?\n          The Doctor looks at Purvis. Purvis remains steadfast. But we\n          see Purvis struggling with this. Maybe his soul has just gone\n          to hell.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          80.\n\n          CONTINUED:\n          Rorer hovers over Tommy Carroll. He blocks our view but his\n          hands press down onto Carroll's skull. Screaming.\n          The Doctor walks away. He will not be a witness to torture.\n          More screaming.\n          CLOSE ON PURVIS: looks up to see Rorer looking at him. Rorer\n          is sweating. He nods. He has an answer.\n\n          INT. SIOUX FALLS AIRPORT - NIGHT\n\n          Urgent activity, Purvis, Baum and Winstead are racing. In the\n          background, Rorer is on the phone. Hurt is checking weapons\n          and ammo. A charter Ford Trimotor's engines rev.\n\n          RORER\n          (into phone)\n          .place is called Little Bohemia in\n          Manitowish, Wisconsin.\n\n          PURV I S\n          What's the nearest airport to Manitowish?\n\n          RORER\n          Rhinelander.\n\n          INT. BANKERS' BUILDING, OFFICE - COWLEY - NIGHT\n\n          listens. Agents are throwing on coats, grabbing greiades,\n          steel vests, Tommy guns.\n\n          PURVIS (O.S.)\n          Our group will fly down in the plane.\n          (to Cowley)\n          Sam, you drive up.\n\n          COWLEY\n\n          (RECITES)\n          Little Bohemia. Manitowish, Wisconsin.\n\n          INT. LITTLE BOHEMIA, DILLINGER'S ROOM - DILLINGER - NIGHT\n\n          looks at\n\n          THE COURTYARD\n          fifteen feet below, which is lit up. Dillinger positions a\n          Winchester..351 autoloader next to the window. Moves stiffly\n          across the room to the other window...\n\n          A DROP FIVE FEET ONTO A LOWER ROOF -\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          81.\n\n          CONTINUED:\n          Dillinger positions a Thompson on the window sill. Then he\n          turns on the radio and tries to sleep.\n\n          EXT. PINE WOODS - TWO BUREAU HIRE CARS - NIGHT\n\n          approach the lodge and stop 300 yards away. No lights.\n          Purvis, Baum., Winstead, Hurt and Agents Rice and Rorer get\n          out and whisper:\n\n          PURVIS\n          If you can get Dillinger alive, do it. If\n          not, then you put him down. Rice, Rorer -\n          take the back. Carter, you cut through\n          the woods and come up on the front from\n          the northwest. Get up close enough to see\n          if they're in the barroom.\n\n          WINSTEAD\n          If he is?\n\n          PURVIS\n          We know where he is. We go in.\n\n          WINSTEAD\n          If he isn't?\n\n          PURVIS\n          o in anyway.\n\n          WINSTEAD\n          Too much real estate out here. Too many\n          ways for'em to get out. And too few of us\n          to blockade 'em in.\n\n          (BEAT)\n          We need road-blocks. An assault plan.\n          This ain't how to do it. We gotta wait\n          for Cowley's group...\n          Purvis hesitates. Then.\n\n          PURVIS\n          I will not risk them escaping and\n          humiliating us. Take the southwest\n          corner. Cover that and the front.\n          (to Hurt)\n          Block the road we came up --\n          Winstead has to accept this. He is not happy.\n          Baum moves off through the woods. As Winstead and Hurt start\n          to move off...\n\n          \n\n          \n\n          \n\n          \n\n          82.\n\n          EXT. LITTLE BOHEMIA LODGE - THREE LOCAL MEN, CCC WORKERS\n\n          enter from the barroom. They seem relieved to be away from\n          the garrulous Nelson. They get into the Chevrolet and start\n          the engine. Turn on the radio. Loud. Collies begin to bark.\n\n          INT. BARROOM - NELSON\n\n          hears the dogs barking.\n\n          EXT. LITTLE BOHEMIA LODGE - CHEVROLET\n\n          engages first gear.\n\n          PURVIS\n          Stop that car! Federal Agents!\n\n          INT. CHEVROLET - NIGHT\n\n          The three men inside cannot hear them. They're loaded. Their\n          radio is BLARING.\n\n          EXT. LITTLE BOHEMIA LODGE - NELSON\n\n          appears in the front doorway, gun in hand.\n\n          CARTER BAUM\n          in the woods sees the armed man framed in the doorwa\n\n          BAUM\n          (shouts out)\n          Bureau of Investigation, nobody move!\n          Chevrolet slowly starts towards Purvis and the others --\n\n          PURVIS\n          Police! Stop!\n\n          (HEAT)\n          Fire!\n          Purvis and from the woods Baum open up. Agents Madala, and\n          Clegg FIRE as well.\n\n          CLOSE ON CHEVROLET\n          takes hits from the Agents' tommy guns. Glass shatters, tires\n          explode. It stops, dead. Meanwhile...\n\n          WINSTEAD + HURT\n          deeper in the woods, cover the side windows from where they\n          know gunfire will soon erupt. It DOES as...\n\n          \n\n          \n\n          \n\n          \n\n          83.\n\n          INT. BARROOM - NELSON\n\n           and the others inside are FIRING out windows, killing lights.\n\n          EXT. WOODS - WINSTEAD + HURT\n\n          FIRE only on windows from which they see muzzle flashes.\n\n          INT. DILLINGER'S ROOM - DILLINGER + HAMILTON\n\n          at Dillinger's window, exchange furious fire with Rice and\n          Rorer at the side of the lodge, forcing them back behind out\n          buildings. Splinters fly. Glass shatters. Gunsmoke is thick.\n\n          EXT. LITTLE BOHEMIA, BARROOM - NELSON, SHOUSE + VAN METER\n\n          fire back, forcing Purvis to cover.\n\n          PURVIS\n          Where the hell is Cowley?\n          Purvis - low - runs to the Chevrolet, opens the door. The\n          driver and one passenger are dead. A middle aged, unarmed man\n          steps out. Bullets zing around him. He promptly sits down on\n          the ground.,, dead drunk. These are not Public Enemies.\n\n          THE TEXANS\n          UNLOAD only on real targets. Bullets CUT through the trees.\n\n          SHADOWY FIGURE\n          darts from a side door and leaps over the porch FIRING a\n          Tommy gun. Bullets strike the trees around Purvis.\n\n          BAUM\n          Someone got out!\n\n          PURVIS\n          Is it Dillinger?\n\n          BAUM\n          I think so.\n\n          PURVIS\n          See if you can head him off. Go!\n          Purvis runs into the woods after the fleeing figure. Carter\n          Baum races off in a car.\n\n          \n\n          \n\n          \n\n          \n\n          84.\n\n          EXT. PINE WOODS - PURVIS\n\n          runs hard, glimpses the figure. He FIRES but misses, keeps\n          running, desperate...\n\n          INT. LITTLE BOHEMIA, SECOND STORY - ROOF - DARK NIGHT\n\n          Bullets TEAR into the wooden walls. Two Men jump out of a\n          back window, not clear who they are... Its chaos.\n\n          EXT. LITTLE BOHEMIA - THE TWO MEN\n\n          sprint down wooden steps to the beach, turn LEFT and run\n          along the lake behind the lodge, trading SHOTS with Rorer and\n          Rice. Rice is hit in the leg and cartwheels forward. Rorer\n          stays with him.\n\n          NOW WE SEE THIS IS DILLINGER\n          running but impeded by his shoulder wound. Hamilton helps\n          him. In the background, we SEE Van Meter and Shouse have also\n          bailed out of the house for the beach but disappear into\n          woods to the RIGHT.\n\n          DILLINGER + HAMILTON\n          run along the line of the lake, but in woods now.\n\n          WINSTEAD\n          runs through trees parallel to them but further away from the\n          water. He catches sight of two figures through the :trees\n          playing against the water from 100 yards away.\n\n          DILLINGER + HAMILTON\n          move fast. Not much brush to slow them. Dillinger senses,\n          reacts...\n\n          HARD CHARGING WINSTEAD,\n          from 50 yards FIRES his pump-action 10 gauge shotgun FOUR\n\n          TIMES.\n\n          DILLINGER + RED\n          in a burst of speed, cover behind heavier trees, which are\n          cratered by the heavy shot. And Dillinger, never stopping,\n          out the other side, is FIRING his Thompson at Winstead as.\n\n          WINSTEAD\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          85\n\n          CONTINUED:\n          rolls forward under the two 5-SHOT BURSTS from Dillinger\n          and...\n\n          SLO--MO. WINSTEAD'S HANDS,\n          while rolling, feed three 10-gauge rounds into the loading\n          port of his shotgun, .and he rolls right up onto one knee,\n          bringing the 10 gauge onto the FAST MOVING glimpses thru\n          trees and he's FIRING at...\n\n          GHOSTS\n          because Dillinger and Red are beneath the brow of the bank,\n          moving fast, now, and Dillinger reloads as...\n\n          WINSTEAD\n          signals above and behind him. to...\n\n          HURT\n          who crossed at a higher point on the contoured landscape,\n          giving the,,-Texans cross fire possibilities, and...\n\n          DILLINGER\n          FIRES -- whrthe bank's cut by a ravine - exactly where\n          Winstead should be...\n\n          DILLINGER'S POV: NOTHING\n          Winstead's gone. And Dillinger knows the level of play has\n          been raised by the addition of whoever these men are. As he\n          and Red race across the ravine for the high ground\n          advantage...\n\n          HURT FIRES\n          Hamilton's legs give way. Dillinger hauls him up, still on\n          run...\n\n          DILLINGER\n          You hit, Red?\n\n          HAMILTON\n          I don't think so.\n          Dillinger looks at Red's shirt. A blood stain blooms just\n          above his belt. It's bad.\n\n          DILLINGER\n          Come on, Red. We can make it.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          86.\n\n          CONTINUED: (2)\n          On the high ground, past rock outcroppings towards a house.\n          Meanwhile...\n\n          EXT. WOODS - PURVIS - NIGHT\n\n          runs desperately after the shadowy figure. Now we SEE it's...\n\n          BABY FACE NELSON\n          who turns and FIRES at Purvis, who drops behind a. felled\n          tree. Ahead, Nelson sees car lights through the trees and...\n\n          EXT. ROAD - NELSON\n\n          tumbles down the bank onto the road. Nelson flags it down an\n          approaching car. It screeches to a stop. Its a Bureau car.\n          Did they think Nelson's an agent?\n\n          INT. BUREAU CAR - CARTER BAUM\n\n          is at the wheel. He realizes its Nelson. Nelson, aiming his\n          Tommy gun...\n\n          NELSON\n          I know you bastards wear bulletproof\n          vests, so I'll give it to you high and\n          low...\n          Nelson OPENS UP. Baum, hit, manages to fall out of,-te\n          passenger door and run.\n\n          EXT. PINE WOODS - PURVIS\n\n          hears distant shooting. He races for the road.\n\n          EXT. ROAD -- BAUM\n\n          twists, turns, fires a handgun, misses. Nelson FIRES again.\n          Three slugs tear into Baum's neck.\n          Baum topples over a white fence, lands on his face. Nelson\n          shoots Baum again.\n\n          INT. CAR - NELSON'S\n\n          in, pulls out.\n          Purvis spills down through trees. He FIRES, ineffectually at\n          the disappearing car. He rushes to Baum. A sick gurgling\n          sound is coming from his throat.\n\n          PURVI S\n          Carter!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          87\n\n          CONTINUED:\n          Baum's eyes flicker.\n\n          PURVIS (CONT'D)\n          Who was it? Was it Dellinger?\n          Baum shakes his head a fraction.\n\n          BAUM\n          (barely audible whisper)\n          Nelson.\n          Baum's eyes roll back in his head.\n          Purvis runs after the car. He dives through the woods to cut\n          it off at a turn in the road.\n\n          EXT. HOUSE - A CAR\n\n          is outside. A man's on the porch, having reacted to gunshots.\n\n          DILLINGER\n          Gimme the keys to that car!\n          He tosses them. Dellinger already has Red inside, starts it\n          and blastsr,...away from the house.\n          Winstead cjim:bing out of the ravine SEES the car pulling\n          away. It's gone. He and Hurt run for the shoreline to get\n          back to...\n\n          EXT. LITTLE BOHEMIA LODGE - WIDE - NIGHT\n\n          Tear gas billows out the windows.\n\n          WINSTEAD\n\n          (ARRIVING)\n          Cease fire! Stop shooting!\n          The shooting stops. There is no return fire from the lodge.\n          Winstead puts a handkerchief over his nose and mouth and\n\n          ENTERS\n\n          E/I. LITTLE BOHEMIA LODGE - WANETHA + NAN\n          coughing their lungs out and cowering behind the furniture.\n          No one else is there. Meanwhile...\n\n          INT. STOLEN BUREAU CAR, MOVING - NELSON\n\n          speeding, sees Two Men step into the road, raised weapons. He\n          slams on the brakes. The two men run up, shouting \"Get out of\n          the car!\"\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          88.\n\n          CONTINUED:\n          Nelson bursts out laughing.\n\n          NELSON\n          You dumb bastards.\n\n          HOMER VAN METER + ED SHOUSE\n          streaked with mud jump in. Nelson takes off.\n\n          EXT. WOODS NEAR THE ROAD -- PURVIS\n\n          tumbles out of the woods onto the road just in time to see\n          Nelson in the stolen Bureau car disappear around the next\n          corner. He keeps running, desperately, futilely...\n\n          INT. PACKA.,.RD - COWLEY\n\n          drives. Madala is next to him, reading a map. Clegg and Smith\n          are in back. They see an oncoming car.\n\n          COWLEY\n          Who's that?\n          Cowley slows. The other car doesn't. Ahead Cowley slams on\n          the breaks.\n\n          MADALA\n          Somebody's on the road!\n\n          PURVIS\n          running towards them, jumps in the Packard.\n\n          PURVIS\n          Turn it around! .the car...\n\n          COWLEY\n          Who was in it?\n\n          PURVIS\n\n          (BREATHLESS)\n          Baby Face Nelson. He killed Carter.\n          Cowley u-turns and accelerates.\n\n          INT. STOLEN BUREAU CAR- NELSON\n\n          sees the Packard gaining on them.\n\n          NELSON\n          Who are these birds?\n          He pulls the wheel to the right.\n\n          \n\n          \n\n          \n\n          \n\n          89.\n\n          EXT. HIGHWAY\n\n          The Stolen Bureau Car is on the shoulder past a blind curve.\n\n          INT. PACKARD - COWLEY\n\n          blasts around the curve, tires screaming, passes the Stolen\n          Bureau Car. Now Nelson pulls out behind them!\n\n          COWLEY\n          Look out...!\n\n          INT. STOLEN BUREAU CAR - NELSON\n\n          accelerates, closing in on the Packard. He assaults the FBI.\n\n          NELSON\n          Let'em have it.\n\n          INT. PACKARD - PURVIS\n\n\n          PURVIS\n          `'aster, Sam!\n\n          EXT. ROAD ,SPLITS ...\n\n          becomes twbjanes of blacktop separated by a median with\n          trees. Trees are between them.\n\n          INT. PACKARD - PURVIS\n\n          sees Homer Van Meter steady his Thompson. Madala ducks.\n          Cowley hits the brakes, locks the wheels. Nelson's car surges\n          past, spoiling Van Meter's aim, Purvis FIRES. Madala FIRES.\n\n          INT. STOLEN BUREAU CAR - LOSING SPEED!\n\n          Packard's coming up on them. Nelson stomps on the gas.\n\n          NELSON\n          Hit the engine!\n          Nelson spins the wheel to veer off the highway onto a...\n\n          EXT. DIRT ROAD -- BUT NELSON'S CAR.\n\n          hits a berm, bounces high and rolls over.\n\n          INT. STOLEN BUREAU CAR - NELSON\n\n          struggles to free himself from under Shouse. Shouse's neck\n          has been broken. He is dead. Van Meter is clear and running.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          90.\n\n          CONTINUED:\n\n          NELSON\n          Come back here, help me, you son of a\n          bitch!\n          Homer doesn't. He's gone. The Packard hurtles towards him,\n          screeches, skids sideways, stops!\n\n          PURVIS, COWLEY + MADALA\n          are out. Purvis FIRES.\n\n          VAN METER\n          is cut down right away, hit 14 times. While...\n\n          NELSON\n          opens up with the Tommy gun, ripping\n\n          COWLEY\n          across the chest. As\n\n          MADALA ' S\n          12-gauge FIRES. Nelson, slammed in the chest, drops-to his\n          knees, fights on, as...\n\n          PURVIS'\n          Thompson and Madala's second round HIT at the same time. The\n          45s and double odd shot tear into Nelson's chest and slam\n          him back.\n          Purvis rushes to Cowley...\n\n          PURVIS\n          (moving towards him)\n          Rest quiet and you will be alright, Sam.\n\n          COWLEY\n          Call my wife and tell her.\n\n          INT. DILLINGER'S STOLEN CAR, PARKED IN A SMALL TOWN -\n\n\n          HAMILTON - DAY\n          is in agony. Dillinger gets in back beside him. He's bought\n          medical supplies from a drug store and whisky. He helps\n          Hamilton to a slug and. some pills.\n\n          HAMILTON\n          Not like you ain't seen a man die before.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          91.\n\n          CONTINUED:\n          He puts his bloody hand in Dillinger's.\n\n          HAMILTON (CONT'D)\n          (reading Dillinger's mind)\n          You gotta let...\n          (grimacing with pain)\n          You gotta let me go, John.\n\n          DILLINGER\n          Bullshit.\n\n          HAMILTON\n          And you gotta let Billie go too.\n          Flash of anger in Dillinger's eyes.\n\n          HAMILTON (CONT'D)\n          I know... you... never let no one down\n          you care about. But this... time... you\n          gotta let go...\n          Hamilton desperately searches Dillinger`s eyes for a\n          response.\n          Hamilton squeezes Dillinger's hand and grimaces in pain. He\n          lets out a'7-`gasp. His grip relaxes. Dillinger looks away...\n          A car pulls in next to his. As the DRIVER gets out, he\n          happens tc...giance at Dillinger's car.\n\n          DRIVER'S POV: TWO MEN\n          in the back of a car. One lying motionless, covered in blood,\n          the other looking dishevelled and distraught.\n           The Driver turns, restarts his car and pulls quickly away.\n\n          EXT. FIELD - NIGHT\n\n          Bleak and desolate. Dillinger is digging. Even a shallow\n          grave takes time.\n          He drags Hamilton's body to the grave. Streaks of dawn light\n          the sky.\n\n          DILLINGER\n          I'm sorry to do this to you, Red.\n          Dillinger empties boxes of lye bought from the pharmacy on\n          Red's face and starts shovelling earth on his friend's body.\n\n          \n\n          \n\n          \n\n          \n\n          92.\n\n          EXT. FIELD - DAWN\n\n          Dillinger sitting on a rock by the grave, whisky bottle in\n          hand, sweaty and cold at the same time. His stomach is empty\n          and his spirits are rock bottom.\n          He gets up, throws away the empty bottle, takes a last look\n          at the grave and walks to his car.\n\n          CUT TO:\n\n          INT. BLACK HUDSON, CHICAGO - JOHN DILLINGER ._ NIGHT\n\n          drives west on Troy. The neighborhood streets are cold and\n          empty. But ahead Dillinger sees...\n\n          1933 CHEVROLET 2-DOOR COUPE\n          parked at the curb. Two men are inside. Silhouettes against\n          steamed windows. They're waiting, watching.\n\n          EXTREMELY CLOSE: DILLINGER'S FACE\n          Impassive. He knows exactly who they are. He cruises past\n          without glancing and continues west...\n\n          INT. 1933 CHEVROLET SURVEILLANCE CAR - NIGHT\n\n          The men inside are Agents Reinecke and Rorer. Reinep wipes\n          the condensation from the windshield. Across the sty\" =et he\n          sees Billie through her second story window. He makes a\n          notation. Rorer is asleep.\n\n          TNT. ASHLAND AVE. FURNISHED APARTMENT - BILLIE - NIGHT\n          checks her watch., rises past her window to turn on the radio.\n          Paul Whiteman's band signs off followed by a Geritol\n          commercial telling Radiol.and to stay tuned for the Will\n          Rogers commentary.\n\n          INT. ASHLAND APARTMENT, FOYER - BILLIE + NEIGHBOR,\n\n          also a dark haired woman. Billie slips her $20. She made her\n          a sandwich. Neighbor takes Billies place in front of the\n          window by the radio. Meanwhile...\n\n          EXT. REAR ALLEY - SNOW FLURRIES: BILLIE\n\n          in a man's overcoat and hat, crosses the alley to the rear of\n          the buildings opposite.\n\n          \n\n          \n\n          \n\n          \n\n          93.\n\n          EXT. ALLEY - A SECOND FBI CAR + AGENTS\n\n          watch the rear of Billie's building. Agents ignore a man\n          crossing the alley in the cold night.\n\n          INT. REINECKE'S CAR\n\n\n          RORER\n          What's she doing?\n\n          REINECKE\n\n          (LOOKS)\n          Listening to the radio...\n\n          EXT. WABANSIA AVENUE - BILLIE\n\n          emerges from the passageway between buildings in men's\n          clothes, looks over her shoulder, and crosses into the\n          street. She just stands there. Nothing moves under the\n          skeletal elms in the white snow.\n\n          THEN: LIGHTS\n          come on. They stab at her. She can't see in the glare.\n\n          BLACK HUDSOWI;PULLS THROUGH -- JOHN DILLINGER\n          opens the door. She jumps in. He's already pulling away...\n\n          INT. AGENTS''OFFICE - DAY\n\n          Madala, Clegg and the other agents are waiting for a briefing\n          to begin. Purvis enters.\n\n          PURVIS\n          Agent Cowley died this morning at 5:17am.\n          Grim reactions among the men.. ,their lost colleagues and\n          friends...\n\n          PURVIS (CONT'D)\n          Right now all of Dillinger's friends are\n          dead. He's out there alone. There won't\n          be a better chance to run him down.\n\n          RORER\n          He could be anywhere - California,\n          Florida...\n\n          PURVIS\n          He could be anywhere - but he is not.\n          What he wants is right here. Billie\n          Frechette.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          94.\n\n          CONTINUED:\n          Purvis looks up and sees the open door. Reinecke stands\n          there...a desolate look of failure. Purvis knows what's\n          happened. They lost Billie.\n\n          CUT TO:\n\n          INT. NBC RADIO STUDIO (LOS ANGELES, CA)- WILL ROGERS - DAY\n\n          smokes a cigarette in front of a ribbon microphone. The smoke\n          curls into the air. His commentary is intimate and folksy.\n\n          WILL ROGERS\n          (into ribbon microphone)\n          Well, they said they were going to get\n          Public Enemy #1. And they had John\n          Dillinger surrounded... They was all\n          ready to shoot him as soon as he came\n          out. But a bunch of folks came out ahead,\n          so they shot all them instead.\n          (radio audience laughter)\n\n          INT. DILLINGER'S BLACK HUDSON - BILLIE + JOHNNY - NEW YEAR'S\n\n\n          EVE\n          drive carefully, south on Clark St. Sidewalks are filled with\n          revelers and crowds.\n\n          WILL ROGERS(O.S.)\n          They will get Dillinger someday. Probably\n          when he's with a group of innocent\n          bystanders they're shooting down, and\n          he'll get killed by accident...\n\n          (PAUSE)\n          Meanwhile, President Roosevelt got\n          Congress to pass a second crime Bill...\n\n           INT. FRANK NITTI'S LIVING ROOM (CICERO, ILLINOIS) -- FRANK\n\n\n          NITTI - EVENING\n          listening to Will Rogers. He's sober.\n\n          WILL ROGERS(O.S.)\n          .which the example of Public Enemy\n          Number One has helped push through\n          Congress. It will make all criminal\n          enterprise across state lines a federal\n          crime...\n          Nitti's hand picks up a telephone and dials. He puts the\n          earpiece next to his ear. And he blows up.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          95\n\n          CONTINUED:\n\n          NITTI\n          (to D'Andrea)\n          Okie inbred sonsabitches ... backwoods\n          cocksuckers. They did this.\n\n          D'ANDREA\n          Did what?\n\n          NITTI\n          Karpis. That syphilitic idiot Babyface\n          Nelson. Dillinger. All of them. Another\n          interstate crime bill?!\n\n          D'ANDREA\n          What do we care? We don't rob banks.\n\n          NITTI\n          Everything is interstate. Wake up. That's\n          the point of being nationwide. Fix it.\n\n          INT. FBI - HOOVER'S OFFICE -- HOOVER -- NIGHT\n\n          listens.\n\n           WILL ROGERS (O.S.)\n          -.-v -so after they missed all the Public\n          Enemies at Little Bohemia, the Bureau\n          =axrrested their girlfriends. The FBI may\n          \"bat get their man, but they always get\n          his woman.\n          (radio audience laughs)\n          J. Edgar Hoover does not.\n\n          INT. BLACK HUDSON - BILLIE + JOHNNY - NEW YEAR'S EVE\n\n          head south out of downtown on Michigan Blvd. A blast of horns\n          declares the death of 1933 and the birth of 1934.\n\n          INT. TELEPHONE COMPANY EXCHANGE- PURVIS - NEW YEAR'S EVE -\n\n          enters. They've got 15 recorders, now. It's a rat's nest of\n          cloth-insulated wiring. Most of the listening stations are\n          abandoned.\n\n          PURVIS SEES: AGENT MADALA\n          with headphones noting a conversation on a steno pad. Two\n          stenographers are still around. Each machine is labeled.\n          Madala listens to \"PROBASCO.\" Next to him is \"AUSTIN STATE\n\n          TAVERN.\" MOVE IN. WELL SEE THAT AGAIN...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          96.\n\n          CONTINUED\n\n          PURVIS\n          Agent Madala...\n          (can't hear)\n          Agent Madala!\n\n          MADALA\n          (headphones come off)\n\n          YESSIRL\n\n          PURVIS\n          Its New Year's Eve, Roger. Go home to\n          your family.\n\n          MADALA\n          Thank you sir.\n          Purvis leaves.\n\n          INT. PURVIS'S APARTMENT OFF MICHIGAN AVENUE - PURVIS - NIGHT\n\n          lets himself in. He's alone. \"Auld Lang Syne\" is heard in the\n          streets below. The apartment is dark. He stands for a moment,\n          letting the darkness wash over him. He allows himself one\n          shot of Bourbon. He moves to the large window overlooking the\n          city. He goes out onto the balcony in the cold air.- He sees\n          the sparkling lights, the traffic, the couples, the-revelers,\n          the relaxed celebration. Horns blow. Cheering can be heard\n          across the city. He is alone. It is 1934 in Chicago. He downs\n          the shot of bourbon.\n\n          EXT. ROAD THRU DUNES - DILLINGER + BILLIE - NIGHT\n\n          drive across the southern tip of Lake Michigan in te`Indiana\n          dunes. Dunes are lit by the silver moonlight. Her head is on\n          his shoulder. She loosely holds his arm. She drifted asleep.\n          Now she wakes. She realizes it is New Year's Day.\n\n          DILLINGER\n          Happy New Year, doll.\n\n          BILLIE\n          Happy New Year, baby.\n          He looks at her. Its a concerned look. She reads his mind.\n\n          BILLIE (CONT`D)\n          Johnny. I'd rather live on the run with\n          you, than live any other way.\n          That says it all. They are both quiet for a long beat.\n\n          DILLINGER\n          For how long?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          97.\n\n          CONTINUED:\n\n          BILLIE\n          However long.\n\n          DILLINGER\n          Next week? Next year? Alvin said this\n          wasn't gonna last. He was right. The\n          world has turned. Everything's different.\n\n          (BEAT)\n          And there's a sweet score. Enough money\n          to go away and stay away for a long time.\n\n          (BEAT)\n          So whattya say we lit out of here? Lit\n          out of here, altogether.\n\n          BILLIE\n          glows to the prospect. For the first time there's a tangible\n          future.\n\n          BILLIE\n          Cuba?\n\n          DILLINGER\n          Too close. How about we fly to Caracas\n          and then to Rio on Pan Am. Then an\n          oanliner to Manila or Singapore. We are\n          f6reign-looking to them. So they will\n          ,have no idea who the hell we are. We can\n          go out dancing all night and have a lotta\n          laughs anytime we want...\n\n          BILLIE\n          I think that's a great idea!\n           They drive on into the pre-dawn of the year 1934.\n\n          EXT. DILLINGER FARM (MOORESVILLE, INDIANA) - SOMEHOW JOHN\n\n\n          DILLINGER - DAY\n          sits in plain view on a chair. His Thompson rests against the\n          wall. His sister, Audrey, is giving him a haircut. His\n          father, John Wilson Dillinger, drinks coffee next to him. The\n          January sunlight is so direct, it's like Spring.\n\n          DILLINGER\n          Not too short on the sides.\n\n          BILLIE\n          comes out the door. Dillinger's niece comes up with a Kodak\n          Brownie.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          98.\n\n          CONTINUED:\n\n          NIECE\n          Can we take a picture?\n\n          DILLINGER\n          Of course.\n          (to nephew, approaching)\n          You got an eye on those federal boys?\n\n          NEPHEW\n          Yes sir. They're over having breakfast at\n          Myra's Diner. They've been hanging\n          around, here, doing nothing for so long,\n          they just know this is the last place\n          you're going to show...\n\n          CLOSER: BILLIE\n           watches Johnny. This is who he would be if he had not had the\n           troubles in this life, a charismatic young man.\n\n          EXT. FIELD - BILLIE + DILLINGER SR. - LATER\n\n          walk through winter wheat.\n\n          BILLIE\n          That how he was when he was a boy?\n          Carefree and laughing...?\n\n          JOHN SR.\n          Not right when his mother died. But afterâ\u0080\u009e-\n          awhile, yes.\n\n          BILLIE\n          You love him, don't you?\n          She touches his arm. He looks back at the house.\n\n          JOHN SR.\n          He grew up a motherless child... After he\n          was there he never had a woman's comfort.\n          So I loved him but didn't know how to\n          raise him. And that's the truth.\n\n          (PAUSE)\n          When he come out of that prison, he had\n          so many worries. Restless. Bitter. He had\n          a desire to get even.\n          A covey of quail flush out of the wheat.\n\n          JOHN SR. (CONT'D)\n          Well, now he has gotten even. And he has\n          seen the country. And he has you. So, he\n          is carefree.\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          99.\n\n          CONTINUED:\n\n          JOHN SR. (CONT'D)\n\n          (BEAT)\n          But what is next for you and Johnnie?\n\n          BILLIE\n          To try to live somewhere else.\n\n          JOHN SR.\n          (knows more)\n          Well, if it goes okay, good. Whatever\n          happens, he has been my boy. And I have\n          loved him in my heart, always. Right or\n          wrong, no matter what.\n          He is as straight and truthful as the land is flat. She takes\n          his hand and they walk through the fields.\n\n           EXT. CHICAGO'S CROWDED DOWNTOWN STREETS - DILLINGER +\n\n\n          BILLIE -- DAY\n          in the black Hudson. We've entered mid-scene.\n\n          DILLINGER\n          :Eartender's name is Larry Streng.\n\n          BILLIE\n          `--W re ' s the apartment?\n\n          DILLINGER\n          Oakley and Potomac. He'll give you the\n          keys.\n          They drive north over the Clark Street Bridge. Dillinger\n          gives her an envelope.\n\n           DILLINGER (CONT'D)\n          5,000 dollars. It buys us a month, but\n           we're not staying that long.\n\n          EXT. AUSTIN STATE TAVERN - 416 NORTH STATE STREET -\n\n\n          DI.LLINGER'S CAR - DAY\n          pulls to the curb on the east side of the street. Billie gets\n          out, walks through the crowds, down the sidewalk and crosses\n          the street to the bar. MOVE IN on the sign. This is the\n          location we saw being tapped at the Telephone Exchange.\n\n          OVER DILLINGER'S SHOULDER\n          watching the distant front of the tavern into which Billie\n          disappeared. Then...\n\n          FOUR BUREAU AGENTS, REINECKE + MADALA\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          100.\n\n          CONTINUED:\n          run right past Dillinger's Hudson. They join 12 more agents\n          flooding into the Austin State Tavern from the other side.\n\n          INT. CAR - DILLINGER\n\n          is shocked. Frozen. Inside...\n\n          INT. AUSTIN STATE TAVERN - REINECKE\n\n          roughly handcuffs Billie.\n\n          REINECKE\n\n          (SHOUTS)\n          Who brought you? How'd you get here?\n\n          BILLIE\n          .I took a taxi.\n\n          EXT. TAVERN - REINECKE + MADALA LEADING OUT BILLIE\n\n          There's20 of them, now. She's totally surrounded.\n\n           INT. HUDSON - DILLINGER\n\n           races around the block. Comes up on the same side of the\n           street as the tavern behind the Federal cars.\n\n           THE THOMPSON\n           in his lap. He checks his 45.\n\n           HE SEES.. .HER\n          There she is. Where's an opening? His eyes dart.\n\n          MORE CHICAGO POLICE\n          arrive. It's now a sea of blue.\n\n          CLOSER: DILLINGER\n          20-30 men surround her.\n\n          BILLIE\n          .hauled towards a Bureau car by Reinecke. He tips her off\n          balance. He bounces her off the door pillar on purpose.\n          Dillinger sees all this.\n\n          DILLINGER\n          can do nothing. Tears of frustrated rage stream down his\n          face. Later, he would say he \"cried like a baby.\"\n\n          \n\n          \n\n          \n\n          \n\n          101.\n\n          EXT. STATE STREET -- DILLINGER + THE HUDSON\n\n          are waved away, irritatedly, by uniformed Chicago police\n          trying to clear traffic. Dillinger's Hudson drives off into\n          the distance.\n\n          INT. BANKER'S BUILDING - BILLIE - NIGHT\n\n          under a bare lightbulb.\n\n          REINECKE\n          If you tell us all about him, maybe\n          you'll get a break. Maybe you end up\n          doing a couple of months on a work farm.,\n          like a girls' home or something.\n\n          ANOTHER AGENT\n          Where is he? Where were you meeting?\n          Where were you hiding out?\n\n          REINECKE\n          ...or we drop you in a black hole. And you\n          et to shit and piss on the floor and\n          then lie in it all night in the dark with\n          the bugs and the rats.\n          Billie's eve'lids fall. She drifts off. Reinecke kicks her\n          awake.\n\n          REINECKE (CONT'D)\n\n          (SHOUTS)\n          Where is he?!\n          Billie startles! CLOSER on her chair.\n\n          BILLIE\n          I have to...\n          He kicks the chair again. She's being denied a toilet. The\n          humiliation is part of the pressure. Billie's embarrassed.\n          Billie urinates on the chair now and the floor. Another Agent\n          makes a face...\n\n          OTHER AGENT\n          What was that movie, \"Squaw Girl\"...?\n          Reinecke has gone out to get water for himself.\n\n          INT. OUTER OFFICE - REINECKE\n\n           drinks from a water cooler. In the background are a dozen\n           agents with Tommy guns in every corner as if Public Enemy\n          Number 1 will assault at any moment.\n\n          \n\n          \n\n          \n\n          \n\n          102.\n\n          INT. INTERROGATION ROOM - REINECKE\n\n          re-enters.\n\n          REINECKE\n          Lady, you're stinking up my office. Where\n          were you supposed to meet him!\n          He slaps her. Billie's shoulders collapse.\n\n          REINECKE (CONT'D)\n          I can't hear you.\n\n          BILLIE\n          (nods, very low...)\n          We were supposed to meet...at our\n          apartment...\n\n          REINECKE\n          Where?\n\n          BILLIE\n           On Addison. 1148...\n\n           REINECKE\n           When?\n\n           BILLIE\n           Now.\n\n          INT. 1148 W. ADDISION, APARTMENT - WIDE ON DOOR - DAWN\n\n          Its shot off its hinges. A half-dozen AGENTS invac e.'One gun\n          goes off. Everybody is about to open up until they realize\n          its one of theirs.\n\n          REVERSE: THE APARTMENT INTERIOR\n          It is dead empty. Reinecke looks at the dust on the floor. No\n          one's been here for a month.\n\n          CUT TO:\n\n          INT. COOK COUNTY JAIL .- PURVIS\n\n          walks past holding cell with assorted informants, hookers,\n          family members. As he passes one we HOLD ON...\n\n          INT. CELL - PROBASCO\n\n          in a metal chair, hands at his side handcuffed to the floor.\n          He shouts. A large man slams him across the abdomen with a\n          lead-filled sap. Another agent waits indifferently.\n\n          \n\n          \n\n          \n\n          \n\n          103.\n\n          INT. WOMEN'S SECTION - DRUNK TANK - PURVIS\n\n          enters and crosses through...he can't help but SEE.\n\n          PURVIS POV: LIANE HAMILTON\n          Hamilton's sister, 17, stares vacantly from the corner.\n          Bruised, filthy, dress ripped, she's among a sordid group of\n          30 older women: tough hookers, drunks, a couple of tough\n          dykes in men's lace-up boots. Liane catches Purvis' eyes.\n          He walks on...\n\n          INT. B OF I OFFICE, INTERROGATION ROOM - REINECKE'S\n\n          furious. He walks up to Billie, handcuffed, and slaps her\n          across the face, two, three times. Hard. Her ear, her nose\n          bleeds. He almost knocks her out.\n\n          REINECKE\n          Where is he!\n\n          BILLIE\n          (low voice)\n          Well...\n          (rising strength)\n          he's way the hell away from here by\n          ,Tow, isn't he?\n          She looks up at him. And she drops the little girl act. She\n          sent them on a wild goose chase to give her man time to get\n          away.\n\n          BILLIE (CONT'D)\n\n          (CALM)\n          You wanted to know where he is, you dumb\n          flatfoot? You were too scared to look\n          around. You walked right past him on\n          State Street. He was at the curb in that\n          black Hudson.\n\n          (BEAT)\n          You asked me \"how I got there?\" I told\n          you I took a taxi. And you believed me?\n\n          (LAUGHS)\n          He dropped me off and was waiting for me.\n          And you walked right past him.\n          He's furious. Her Native American beauty doesn't soften\n          Reinecke. He visualizes smashing the bones in her face with\n          his fist.\n\n          \n\n          \n\n          \n\n          \n\n          104.\n\n          EXT. OUTER OFFICE - PURVIS + WINSTEAD\n\n          arrive. Dolores rushes up.\n\n          DOLORES\n          Mr. Purvis, you have to stop this. Those\n          men cannot abuse a woman in that way.\n          Purvis, with Winstead following, moves to the interrogation\n          room.\n\n          INT. INTERROGATION ROOM - BILLIE\n\n\n          BILLIE\n          (to Reinecke)\n          .and when my Johnny finds out how you\n          slapped around his girl? You know what\n          will happen to you, fatboy?\n          She looks Reinecke square in the eye. Reinecke swings...\n\n          WINSTEAD\n          grabs his wrist, turns him, Reinecke resists, Winstead nearly\n          breaks his wrist.\n\n          WINSTEAD\n          Bad idea.\n\n          PURVIS\n          Uncuff her.\n          Reinecke tries to pull away. He can't. The smaller man is\n          built of steel cable.\n          Rorer uncuffs Billie.\n\n          PURVIS (CONT'D)\n          Restroom's down the hall.\n          Billie tries to rise. Stumbles.\n\n          BILLIE\n          I can't stand utp.\n          Purvis doesn't hesitate. He picks her up in his arms and\n          carries her through the office to the restroom in the\n          corridor. She puts her hand over her eyes in embarrassment.\n\n          PURVIS\n          Miss Rogers...\n          Doris Rogers follows them.\n\n          \n\n          \n\n          \n\n          \n\n          105.\n\n          INT. JAMES PROBASCO'S HOUSE ( 2509 NORTH CRAWFORD) - PIQUETT -\n\n\n          DAY\n          in the kitchen, waits. He's agitated. So is PROBASCO. Rear\n          door opens. Probasco jumps. In comes Dillinger...\n          Dillinger throws him an envelope.\n\n          DILLINGER\n          $5,000. You run her down.\n\n          (BEAT)\n          Lake County jail or Cook County? I want\n          layouts, blueprints. You visit her. Tell\n          her I'm coming for her. I'll get her out.\n\n          PROBASCO\n          You need a car? A place to stay? Wanna\n          stay here?\n          Is Probasco is trying to lure Dillinger here?\n\n          DILLINGER\n          I'm fine. I got a place.\n\n          INT. BARREL OF FUN NIGHTCLUB - MARTY ZARKOVICH - NIGHT\n\n          walks in.\n\n          ANNA SAGE\n          in a woman's business suit, hat and sunglasses in the dark\n          bar, reacts. Zarkovich sits next to her.\n\n          ANNA SAGE\n          Immigration say they send me back to\n          Romania.\n           Zarkovich, the crooked cop, takes Anna's hand. The 40 year\n          old madam is the true love of his life.\n\n           ZARKOVICH\n          You know what to do.\n           He turns her chin so that her eyes look right into his.\n\n           ZARKOVICH (CONT'D)\n          Plus there's a $25,000 reward.\n\n           ANNA. SAGE\n          We split.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          106.\n\n          CONTINUED:\n\n          ZARKOVICH\n          O'Neill's got to be cut in, too. So it\n          splits three ways.\n\n          ANNA SAGE\n          Can they fix the deportation?\n\n          ZARKOVICH\n          These guys can fix anything.\n\n          CUT TO:\n\n          EXT. 707 WEST FULLERTON STREET - NIGHT\n\n          In car #1 is Marty Zarkovich and Melvin Purvis. In car #2 is\n          Cowley and O'Neill. They wait.\n\n          LOW THICK BRANCHES\n          cast a deep pool of dark shadow concealing Anna Sage.\n\n          ANNA SAGE\n          hesitates. Then she approaches and enters Purvis' car. It\n          pulls out.\n\n          EXT. LAKEFRONT - PURVIS' CAR - NIGHT\n\n          is parked by \"the rocks\" where the lakeshore's been,infilled.\n          Its totally deserted.\n\n          ANNA SAGE\n          I want guarantee.\n\n          PURVIS\n          If you aid us apprehending John\n          Dillinger, I will do everything I can to\n          influence Bureau of Immigration to let\n          you stay in America.\n\n          ANNA SAGE\n          No good.\n\n          PURVIS\n          That's all there is.\n\n          ANNA SAGE\n\n          (SUSPECTS)\n          I think you do this. I think you tell\n          Immigration. to pick me up and to send me\n          back to Romania.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          107\n\n          CONTINUED\n\n          PURVIS\n          How do you socialize with him?\n\n          ANNA SAGE\n          We go out. Maybe tomorrow night. Maybe\n          not. Maybe in a week. A month. Maybe\n          never.\n\n          PURVIS\n          I will not guarantee what Immigration\n          will do. What I can guarantee is what I\n          will do. If you do not cooperate, you\n          will be on a boat out of this country in\n          48 hours. Do not play games with me.\n          Anna hesitates, caves in to Purvis.\n\n          ANNA SAGE\n          Every Sunday night, we go out.\n\n          PURVIS\n          Who's \"we\"?\n\n          ANNA SAGE\n          e. Him. One of my girls, Polly Hamilton.\n\n          PURVIS\n          How will we know?\n\n          ANNA SAGE\n          I call you Sunday when I know.\n\n          INT. POOLHALL PAYPHONE - MARTY ZARKOVICH - NIGHT\n\n          enters. SEE his car at the curb with Anna, solemn in the\n          passenger seat. He drops a nickel and dials. Listens. Then.\n\n          ZARKOVICH\n          She's piayin` ball.\n\n          NITTI\n          Be there. Make sure.\n\n          !NT. NITTI`S OFFICE - FRANK NITTI\n          is the co-author of this betrayal. For a moment Nitti looks\n          regretful.\n\n          ZARKOVICH\n          They are plenty serious all on their own.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          108.\n\n          CONTINUED:\n\n          NITTI\n          They're serious when they make speeches.\n          Then they screw it up. You make sure.\n\n          ZARKOVICH\n          Yes sir.\n\n           EXT. BLUFF OVERLOOKING TRAIN STATION (STEVENS POINT,\n\n\n          WISCONSIN)- U.S. MAIL CAR - DAY\n          is attached three cars back from the locomotive.\n          PULLBACK: Dillinger and Karpis watch it. Dillinger's\n          appearance is different. He's grown a moustache.\n\n          KARPIS\n          The mail will carry the full whack this\n          Tuesday.\n\n          DILLINGER\n          Why Tuesday?\n\n          KARPIS\n          That's the day they ship two weeks of\n          payroll for seven large factories around.\n          Rockford.\n          (points to roads)\n          Route 14 and Route 11. Two ways in; two\n          ways out. Harry handles the door and the..::,\n          safe...\n          WIDEN to include: HARRY CAMPBELL - ruddy face, large bodied.\n          Also here is Freddie and Dock Barker and Jimmy Prohsco.\n\n          KARPIS (CONT'D)\n          Dock cuts the telephone lines five\n          minutes before we go. You and Harry and I\n          go in strong. Dock comes down the pole\n          and becomes the lookout. Jimmie and\n          Freddie drive.\n\n          DILLINGER\n          (studying layout)\n          What do you figure?\n\n          KARPIS\n          $1.5 to $1.7 million. About $300,000\n          each.\n           (that's $4.5 million each\n           adjusted for inflation)\n          Karpis is quiet. They are both feeling the ghosts of their\n          friends...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          109.\n\n          CONTINUED:\n\n          KARPIS (CONT'D)\n          Sorry about Red.\n\n          DILLINGER\n          Thanks.\n\n          KARPIS\n          Nelson was a hot-head. I liked him for\n          some reason.\n\n          DILLINGER\n          You were in a minority.\n\n          KARPIS\n          Had a talk with him once, at\n          Czernaky's...\n\n          DILLINGER\n          Yeah?\n          Louis Piquett arrives and Dillinger interrupts..\n\n          DILLINGER (CONT'D)\n          You see her? She okay?\n\n          PIQUETT\n          Yes.\n          He hands Diilinger a letter. Dillinger opens it.\n\n          BILLIE (V.0.)\n          Don't try and break me out. I am too well\n          guarded. Milan Prison is too tough. Two\n          years is not a long time, anyway. Go\n          away someplace where you're safe like\n          Mexico and wait for me. We will be\n          together again. Your true love in life,\n          Billie.\n          And the air goes out of him.\n\n          PIQUETT\n          She told me what was in it.\n          Dillinger's distracted ...Karpis continues.\n\n          KARPIS\n          I reminded him...\n\n          DILLINGER\n          Reminded who?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          110.\n\n          CONTINUED: (2)\n\n           KARPIS\n           Nelson. .that he told me if he ever got\n           $20,000 together, he'd up and quit\n          forever...\n\n          (BEAT)\n          After he hit the Janesville bank I said,\n          \"Yeah, so...?\"\n\n          (BEAT)\n          He said, \"After I started, I couldn't\n          stop.\"\n\n          DILLINGER\n          Well, I can. We do this Tuesday, I'm gone\n          on Wednesday.\n\n          KARPIS\n          I thought about heading to Varadero Beach\n          in Cuba, outside Havana. You been there?\n\n          DILLINGER\n          For me, it's maybe Mexico.\n          And that's the answer. Dillinger plans to score the train. Go\n          to Mexico. Wait for Billie.\n\n          INT. ANNA SAGE APARTMENT - ANNA SAGE - SUNDAY\n\n          She is nervous. She hears a key in the lock. Spins., Door\n          opens. John Dillinger walks in...\n\n          ANNA SAGE\n          Jimmy, you're back...\n          We understand that Dillinger's been harbored here all along.\n          And he goes under the name Jimmy Alexander.\n\n          DILLINGER\n          looks through the apartment like he always does. He goes to\n          the sink and starts running cold. water on his wrists to cool\n          down.\n\n          DILLINGER\n          Tell you what, doll. You and Polly and\n          me, we'll go out to a movie tonight and\n          get in the refrigeration.\n          POLLY HAMILTON enters from a bedroom down the hall, dressed\n          to go out.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          CONTINUED:\n\n          ANNA SAGE\n          Where you want to go?\n          (to Polly)\n          Jimmy take us to the picture show.\n\n          DILLINGER\n          (to Anna)\n          Marbro or the Biograph...\n          (to Polly)\n          Where you goin'?\n\n          POLLY\n          Take the street car downtown to get my\n          waitressing license.\n\n          DILLINGER\n          I'll take you. Its too hot in here.\n\n          ANNA SAGE\n          I get us some butter and make fried\n          chicken for dinner.\n           We SLIDE onto Dillinger with his wrists under the water. He\n           turns off the tap and starts out...\n\n          INT. PURVIS,' OFFICE - CLOCK: 3PM\n\n           PHONE RINGS. ,Purvis snatches it up.\n\n           ANNA SAGE (O.S.)\n          We go tonight. I don't know if to Marbro\n          or to Biograph.\n          (hangs up)\n\n          PURVIS\n          Miss Sage...\n          She hung up.\n\n          PURVIS (CONT'D)\n          It is tonight, Marbro. Or the Biograph...\n\n          AGENT MADALA\n          Biograph's on Lincoln north of\n          Fullerton...\n          They're split...\n\n          INT. AUBURN - DILLINGER. + POLLY - DAY\n\n          pull to the curb and stop. Surprised, Dillinger looks out the\n          window with an ironic expression...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          112.\n\n          CONTINUED:\n\n          POLLY\n          Be right back...\n          REVEAL he is parked right in front of the Chicago Police\n          station on 11th and State. Sunlight cuts through the gaps\n          between downtown's skyscrapers and illuminates Dillinger. He\n          smiles...\n\n          DILLINGER\n          I'll go in with you.\n\n          INT. 11TH AND STATE STREET STATION, LOBBY - DILLINGER\n\n          strolls into the police station like he owns the place. Polly\n          chatters away. He doesn't hear her, We SEE what Johnny\n          sees...\n\n          DILLINGER POV: REGISTRY\n           \"Licenses Examination\" is on the 8th Floor. \"Detective\n          Bureau\" is on the 6th.\n\n          CU: DILLINGER\n          Here, in the belly of the beast. The lopsided grin behind the\n          dark glasses over the moustache...\n\n          DILLINGER\n          How long will you be?\n\n          POLLY\n          It might take ten minutes.\n\n          DILLINGER\n          I'll meet you back here...\n          He waits as she boards an elevator. As her doors close,\n          Dillinger follows a group of police, bail bondsmen, and\n          civilian workers into a second elevator.\n\n          INT. SIXTH FLOOR, LOBBY - ON DILLINGER\n\n          entering the \"Detective Bureau\" and we MOVE with him past\n          desks and detectives in the open plan office. He walks with\n          cocky assurance.\n          Now he turns down an aisle between desks because he's spotted\n          on one of the glass dividers a sign that exerts a magnetic\n          pull on him. It designates the elite...\n\n          \"DILLINGER SQUAD\"\n\n          JOHN DILLINGER\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          113\n\n          CONTINUED:\n          heads right for it.\n\n          ECU DILLINGER'S HAND\n           brushes under his jacket his .45, checking..\n\n          WIDE - JOHNNY\n          enters this section of desks. Shafts of light illuminate\n          papers. A DETECTIVE we may have seen at Midway Airport right\n          past him...\n          Wall charts, crime photos from Crown Point, the American\n          Bank, other banks, Billie, mug shots of all his crew, are\n          posted on walls. Photos of Dillinger are on desks. It's as if\n          it was a shrine to him.\n\n          IN A CORNER SIX OR SEVEN DETECTIVES\n          listen to the ninth inning of a White Sox game. Three others\n          work through reports in shirt sleeves. One glances his way.\n          Johnny nods. Detective nods back.\n\n          JOHNNY\n          crosses thr4gh it all, strolls in the lion's den, walks in\n          the belly ;ofthe beast - among the hunters. His audacity\n          elevates h-,It is triumph. With all their resources, modern\n          technology\".`and organization, they cannot lay a glove on him.\n          He is better than they are.\n          His gratification is internal. He leaves behind, as he exits,\n          a wake of absurdity. He passed through and they didn't even\n          know. History was made. Like a ghost, has gone.\n\n          EXT. CHICAGO POLICE STATION - AUBURN - POLLY - DAY\n\n          enters from the station and jumps in. As Dellinger drives\n          off.\n\n           DILLINGER\n           You pass?\n\n           POLLY\n           I have to go back. They needed a blood\n           test.\n\n           INT. PURVIS OFFICE - WIDE: BRIEFING - SUNDAY LATE AFTERNOON\n\n           We SEE the East Chicago cops and the ex-Texas Rangers\n           Winstead, Campbell and Hurt. Twenty other agents are in the\n          small office. 110 degrees outside.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          114.\n\n          CONTINUED:\n\n          PURVIS\n          Is it the Marbro or the Biograph? We will\n          be deployed at both. Whichever one he\n          shows at, I will be outside that theater\n          when Dillinger exits. I will give the\n          signal to move in by lighting a cigar.\n\n          ZARKOVICH\n          Anna Sage will wear a white blouse over\n          an orange skirt. That's how we're gonna\n          know it's him.\n\n          WINSTEAD\n          What's playin'?\n\n          PURVIS\n          Excuse me?\n\n          WINSTEAD\n          What's playin' at the Marbro? What's\n          playin' at the Biograph?\n          It hadn't occurred to anybody to find that out.\n\n          MANDALA\n          (from newspaper)\n          Marbro...a Shirley Temple movie called\n          \"Moptop.\" Biograph is playing a gangster-,\n          picture starring Clark Gable. \"Manhattan:::\n          Melodrama.\"\n\n          WINSTEAD\n          John Dillinger ain't going to a Shirley\n          Temple movie.\n\n          PURVIS\n          Sergeant Zarkovich and Special Agent\n          Winstead will be at the Biograph.\n          As will I and Special Agent Madala.\n\n          (BEAT)\n          Virgil Peterson, coordinate the Marbro.\n          The rest of you will wait here until it's\n          determined which theater.\n          Looks between Zarkovich and Capt. O'Neill. They have to\n          INSURE Dillinger is killed, not captured.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          115.\n\n          INT. ANNA SAGE APARTMENT, BATHROOM - DILLINGER - EVENING\n\n          shaves. His watch is open in front of him. In the inside of\n          the case is a picture of Billie. He washes the soap from his\n          face. He looks at her...\n\n          INT. BEDROOM - A LOCKED CASE\n\n           Opens. From it Dillinger pockets a Colt 380 automatic and\n          loads $3,000 into a moneybelt from rubber-banded bundles and\n          puts it around his waist.\n\n          CUT TO:\n\n          EXT. MARBRO THEATER - SOPSIC - NIGHT\n\n          On a pay phone. Patrons buy tickets. He listens...\n\n          SOPSIC\n          Not yet.\n\n          EXT. BIOGRAPH - AGENT BROWN\n\n          puts down the pay phone. Mouths \"not yet\" to..\n\n          INT. CAR: VIS\n\n          down the street in a parked car.\n          In the driver's seat is Reinecke. He's tense, trying to stay\n          calm. On his upper lip sweat beads. Does he remember the\n          words of Billie about what Dillinger would do to him?\n\n          CU: PURVIS\n          watches the crowds thin as showtime nears. He gets out of the\n          car. Is Dillinger a no-show? Another failure? Another\n          eviscerating memo from Hoover?\n          THREE FIGURES BRUSH PAST HIM. A woman's orange skirt. Its\n          Anna Sage, Polly Hamilton, and John Dillinger. They sweep to\n          the ticket booth, pay, and join latecomers rushing inside so\n          that they don't miss the start of the movie.\n\n          PURVIS\n          is stunned. Dillinger passed three feet from him.\n\n          INT. THEATER\n\n          It's packed. Anna Sage had to sit separately on the aisle\n          some rows back.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          116\n\n          CONTINUED:\n          Johnny and Polly sit three rows from the screen.\"Manhattan\n          Melodrama,\" starring Clark Gable, William Powell, and Myrna\n          Loy begins.\n\n          EXT. BIOGRAPH - TICKETSELLER\n\n          is quizzed by Purvis.\n\n          TICKETSELLER LADY\n           The movie runs an hour and 34 minutes and\n          it started about 3 minutes ago so that\n          means it will all be over in an hour,\n\n          30...\n          Purvis turns away. Agent Brown whispers in his ear...\n\n          AGENT BROWN\n          They're on their way over here from the\n          Marbro.\n\n          INT. THEATER -- DILLINGER + POLLY\n\n          absorbed in the movie.\n          ON SCREEN: District Attorney (William Powell) listens to his\n           secretary. She is against her boss inviting gangster Blackie\n          Gallagher (Clark Gable), his childhood friend, to his\n          wedding...\n\n          SECRETARY\n          Remember what happened to that District\n          Attorney in the Midwest. Just for having\n          his picture taken with some gangster...?,\n          The movie is referring to John Di.llinger's Crown Point photo\n          session with his arm around Prosecutor Robert Estill.\n\n          DILLINGER\n          laughs out loud. The irony is that the gangster who inspired\n          this Hollywood moment is sitting right here watching this\n          movie.\n\n          EXT. BIOGRAPH - 19 BUREAU AGENTS + 5 EAST CHICAGO COPS\n\n          arrive and Purvis deploys them out. Except after Little\n          Bohemia, he doesn't tell Winstead what to do...\n\n          WINSTEAD\n\n          (LOW)\n          Clarence and I are going to be in that\n          doorway.\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          117.\n\n          CONTINUED:\n\n           WINSTEAD (CONT'D)\n          30 feet south of the theater entrance.\n          Gerry, you get in that car at the curb\n          about 75 feet north...\n\n          PURVIS\n          In case he walks north?\n\n          WINSTEAD\n          He ain't gonna head north. He's gonna\n          walk south and cut through that alley\n          back to her place. Gerry, when you spot\n          him through your rearview-you come up\n          on him from behind.\n          The \"cowboys\" are the only men not deployed by Purvis. They\n          call their own shots.\n\n          EXT. REAR ALLEY - THREE BUREAU AGENTS\n\n          take up positions near a rear exit. Another two go further\n          down.\n\n          CLOSER: A REAR DOOR\n          from the basfement opens. A trash can is put out by a JANITOR.\n          He sees the=two groups of men in the alley and quickly closes\n          the door.\n          INT. MANAGk'S OFFICE - JANITOR\n          enters.\n\n          JANITOR\n          They're comin' to stick us up again.\n          He's talking to CHARLIE SHAPIRO, the Essaness theater\n          manager.\n\n          CHARLIE\n          Where?\n\n          JANITOR\n          In the alley...\n\n          EXT. BIOGRAPH - CHARLIE SHAPIRO\n\n          approaches the ticket seller.\n\n          CHARLIE\n\n          (LOW)\n          Irene. Anything strange?\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          118.\n\n          CONTINUED:\n\n          IRENE\n\n          (WHISPERS)\n          There's a sweaty little man that keeps\n          asking when the movie's gonna end...\n          across the street, there's three, four\n          men and there's two more around the\n          corner-why are they wearing suitcoats\n          on such a hot night?\n\n          CHARLIE\n          Pretend like nothing's going on...\n          He leaves the booth, taking the cash receipts.\n\n          INT. MANAGER'S OFFICE - CHARLIE SHAPIRO\n\n          on the phone.\n\n           DESK SERGEANT'S VOICE (O.S.)\n          District 37, Sheffield Avenue...\n\n          CHARLIE\n          Get some detectives over here, this is\n          Charlie Shapiro at the Biograph. They're\n          gonna stick us up again...\n\n          DESK SERGEANT'S VOICE (O.S.)\n          How do you know, Charlie?\n\n          CHARLIE\n          I see them getting in position, like\n          they're waiting 'til the movie's over...\n\n          EXT. BIOGRAPH ALLEY - AGENT SURAN\n\n          The alley suddenly is illuminated by headlights from two\n          directions. A rear door opens and before the car stops, a\n          CHICAGO P.D. DETECTIVE has stepped off the running board with\n          his sawed-off shotgun in Agent Suran's face.\n\n          SURAN\n          Wait, wait...! Hold it! Federal Agent!\n\n          CHICAGO P.D. DRIVER/SGT.\n          Before you shoot him, get his I.D.\n\n          CHICAGO P.D. DETECTIVE\n          Who the hell are you?\n\n          SUB N\n          Department of Justice. Bureau of\n          Investigation!\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          119.\n\n          CONTINUED:\n\n          CHICAGO P.D. DETECTIVE\n          What do you think you're doing here?\n\n          SURAN\n          Were on a federal stakeout! Put that gun\n          down and back those cars out of the\n          alley. But stay close because we may need\n          you.\n\n          CHICAGO P.D. DETECTIVE\n          You may need us?\" Fuck you, college boy.\n          Let's see your goddamn badge!\n          Suran's looking down both barrels.\n\n          INT. BIOGRAPH - SCREEN: MYRNA LOY\n\n\n          MYRNA LOY\n          I love you more than anything, Blackie,\n          you know...?\n          She stops.\n\n          DILLINGER'S\n          mesmerized' her eyes and soft skin. We SEE in his hyper\n          reality thee satin tones on the screen. Myrna Loy's\n          insouciance,;like Billies, speaks to him. Meanwhile...\n\n           EXT. LINCOLN BOULEVARD - AGENT MCCARTHY + EAST CHICAGO COPS\n\n\n          SOPSIC + STRETCH\n          empty their pockets, trying to identify themselves to TWO\n          HUGE CHICAGO P.D. DETECTIVE who've drawn down on them.\n          Zarkovich starts arguing, not believing this is happening.\n          More Chicago PD arrive. Meanwhile...\n\n          INT. CAR - PURVIS\n\n          starts across the street to straighten out the Chicago P.D.\n          Sergeant. While...\n\n          CUT TO:\n\n          INT. BIOGRAPH - SCREEN: BLACKIE GALLAGHER (CLARK GABLE)\n\n           walks the long walk through the cell block...\n\n          JOHN DILLINGER\n          the actual Public Enemy #1 watches the celluloid gangster\n          walk to the electric chair...\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          120.\n\n          CONTINUED:\n\n          PRISONER\n          See ya, Blackie.\n\n          CLARK GABLE\n          stops at the cell.\n\n          CLARK GABLE\n          Die the way you lived. All of a sudden.\n\n          ECU: DILLINGER'S EYES\n          startle, Is this a message?\n\n          CLARK GABLE\n\n          CLARK GABLE (CONT'D)\n          Don't drag it out.\n\n          GRAIN STRUCTURE OF THE FACE OF GABLE\n          speaking these important words...\n\n          CLARK GABLE (CONT'D)\n          .that doesn't count for anything.\n          There's no more point to it.\n\n          CU: DILLINGER\n          He sees inwards. And he knows it won't happen. Them=E no\n          Mexico with Billie. There's no freighter to Manila.- He will\n          die. This day, this month, next month. He knows that in this\n          instant.\n\n          JOHN DILLINGER. LOOKING UP AT THE SCREEN.\n          In this Hollywood version of life, the power of cause and\n          effect operates on the end, as inescapably as gravity. It's a\n          core truth. This is the only end for Blackie Gallagher. And\n          its as true for john Dillinger in his life as it is for\n          Gallagher. Actions and historical forces have made his time\n          be up.\n          Dillinger SLOWS the flickering images. His concentration\n          slices time into component parts. Gable exchanges last good-\n          byes. He warns his D.A. friend, Ronald Coleman, not to\n          commute his sentence. The images play on Dillinger's face.\n          They take him over-alone in the packed theater while 25\n          Federal Agents and five East Chicago cops wait outside.\n\n          BLACKIE GALLAGHER\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          121.\n\n          CONTINUED: (2)\n           enters the execution chamber.\n\n           CUT TO:\n\n          EXT. BIOGRAPH - PURVIS\n\n          glances at his watch. He rips a match from the matchbook,\n          ready to light the cigar.\n          The lobby is empty. The dim music of the finale leaks out.\n\n          EXT. DOORWAY - WINSTEAD + CLARENCE HURT\n\n          wait. Winstead coolly watches Purvis.\n\n          INT. CAR - REINECKE'S\n\n          right hand shakes. He can't control it. He grips the steering\n          wheel to make it stop.\n\n          EXT. BAKERY STEPS - ZARKOVICH\n\n           ignores the Chicago detectives.\n\n           CUT TO:\n\n          INT. BIOGRZPH - ANNA SAGE\n\n          looks at the backs of heads in the rows in front of her. She\n          doesn't want to miss Dillinger if he leaves.\n          A celiblock. The cellblock lights dim, a convict says...\n\n          CONVICT (O.S.)\n          There he goes. They're giving it to him\n          now.\n\n          CU: JOHN DILLINGER\n          The grin. End title music. People stirring. The house lights\n          come up. Johnny doesn't move. He seems liberated. Released\n          somehow. People in front and behind him start to exit. He\n          sits there, holding onto his thoughts for a moment.\n\n          CUT TO:\n\n          EXT. BIOGRAPH - PURVIS\n\n          anxiously scans faces emerging from the theater.\n\n          EXT. ALLEY BEHIND BIOGRAPH - SPECIAL AGENTS\n\n          are alert in case Dillinger exits a rear door.\n\n          \n\n          \n\n          \n\n          \n\n          122.\n\n          EXT. BIOGRAPH LOBBY - POLLY, THEN DILLINGER + ANNA\n\n          file out. Polly takes his arm. Anna is behind him and off to\n          the side. They're in a loose knot of people.\n\n          PURVIS\n          sees him. He lights his cigar. It's the signal to move in.\n\n          ACROSS THE STREET: RICHMOND + ZARKOETICH\n          don't see the signal because the Chicago P.D. detective is\n          now shouting at Zarkovich.\n\n          PURVIS\n          lights a second match. And as he lights his cigar, he looks\n          up to see...\n\n          JOHN DILLINGER\n          look right at him. BUT Dillinger does not recognize Purvis.\n\n          INT. CAR - REINECKE\n\n          saw the signal. He's out of his car.\n\n          DILLINGER, POLLY + ANNA\n          turn left at the sidewalk heading south, like Winst\"ad said.\n          They pass doorways. Reinecke approaches from 20 feet behind.\n\n          ACROSS THE STREET: ZARKOVICH\n          looks up... sees Dillinger walking away. If Dillinger's taken\n          alive, he's dead. The Chicago cop puts a hand on Zarkovich`s\n          chest...\n\n          REAR SHOT: POLLY, DILLINGER + ANNA SAGE\n          down the sidewalk past shadowed doorways.\n\n          WINSTEAD + HURT\n\n          WINSTEAD\n\n          (COOL)\n          That's Dillinger. Straw hat. Glasses.\n          Hurt crosses the sidewalk in front of Dillinger and walks\n          north. He'll turn and position himself behind Dillinger on\n          the right. These guys are pros.\n\n          \n\n          \n\n          \n\n          \n\n          123.\n\n          E.X.T. BAKERY STEPS - ZARKOVICH\n           shoves the Chicago Sergeant out of his way and races across\n          the street...\n\n          EXT. SIDEWALK - REINECKE\n\n           approaches Dillinger from the rear. He's 15 steps behind\n          him. Purvis is ten steps behind Dillinger, on the left close\n          to the wall. Now Purvis reaches for his gun.\n\n          ECU: REINECKE\n          draws his weapon. He stares at the back of Dillinger's head.\n          Has getting closer. Sweat runs into Reinecke's eyes. This\n          isn't the firing range with a paper target. This isn't\n          theory. This is the beast. The beast is a gunfighter. The\n          beast is better than you. You beat-up his girl. Your shot\n          will miss...\n\n          DILLINGER IN LARGE PROFILE\n          now passerWinstead in the doorway. Purvis is raising his 9mm\n          Browning. Reinecke stalls. He doesn't want to be first.\n\n          WINSTEAD\n          steps out f, the doorway, now, and falls in up the center of\n          the sidewalk. Reinecke's eyes are riveted on Dillinger...\n\n          AND JOHN DILLINGER\n          senses something.\n\n          REAR SHOT: DILLINGER'S NECK + HEAD IN SLO-MOTION\n          Subconsciously his brain processes what his peripheral vision\n          took in that his intuitive defenses don't like about this\n          landscape. He turns...\n\n          DILLINGER SEES REINECKE\n          Reinecke's hand holding the gun is frozen in the air. He's\n          paralyzed. He lacks the power to pull the trigger.\n\n          DILLINGER'S EYES\n          There's the man who slammed Billie into that car. Dillinger's\n          lethal intent focuses on this one target. In milliseconds...\n\n          DILLINGER DRAWS\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          124.\n\n          CONTINUED:\n          turning towards Reinecke. Reinecke has hijacked his\n          attention. Dillinger hasn't picked up the others.\n\n          PURVIS\n          pulls the trigger. Nothing. He left the safety on. He fumbles\n          with it.\n\n          PURVIS\n          H--halt!\n\n          DILLINGER\n          sees all of them RIGHT NOW. He pushes the .380 in SLOWED TIME\n           towards Purvis.. .and bumps into a pedestrian named Ella\n          Natasky.\n\n          ELLA NATASKY\n          starts to fall. Dillinger turns his attention to her for a\n          millisecond. He's a gentleman. His impulse is to reach for\n          her to steady her...\n\n          CHARLES WINSTEAD\n          shoves aside the paralyzed Reinecke, pushes past Purvis,\n          leans forward and shoots John Dillinger in the back of the\n          head. The heavy 45 round punches through Dillinger's,brain\n          stem and exits underneath his right eye.\n          John Dillinger stumbles into the alley opening and starts to\n          fall. A second shot from Winstead and two more from Clarence\n          Hurt hit him now. They don't matter.\n\n          JOHN DILLINGER\n          falls through the air.\n\n          EXTREMELY CLOSE ACROSS THE COBBLESTONES: JOHN DILLINGER'S\n\n          FACE\n          crashes into the FRAME. One lens of his eyeglasses breaks.\n          The brim of his straw hat snaps. The hat falls away. He\n          struggles, but can't move. He breathes. He tries to speak..\n\n          WINSTEAD\n          stands over him. Purvis snatches the .380 automatic out of\n          Dillinger's hand.\n\n          .WINSTEAD\n          sees Dillinger's trying to say something.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          125.\n\n          CONTINUED:( 2)\n\n          JOHNNY'S LIPS\n          try to form speech and Winstead's ear is next to his mouth.\n          We and Winstead hear...\n\n          DILLINGER\n          .tell Billie...\n          Only Charles Winstead hears the rest.\n\n          PURVIS\n          unloads Dillinger's gun. His gun-handling of Dillinger's gun\n          is a lot better than his gun-handling of his own under\n          stress.\n\n          PURVIS\n          What did he say?\n\n          WINSTEAD\n          I couldn't hear him.\n\n          PURVIS\n          You look after this. I need to call\n          Washington.\n          Zarkovich`houlders through the gathering crowd of\n\n          PEDESTRIAN\n          s=and newsmen, sees the head wound, the glazing\n          over of Diflinger's eyes. He knows he's safe.\n\n          JOHN DILLINGER'S EYES\n          get dreamy, then they seem to focus far away. Then they seem\n          to focus not at all.\n\n          PURVIS (CONT'D)\n          Cover his face and keep the damn\n          photographers away.\n\n          AERIAL: LINCOLN AVENUE\n          Purvis starts away and we SEE the Biograph marquee, the\n          trolley tracks in the cobblestone street, the alley, and the\n          hundreds of people moving towards the locus of the dead John\n          Dillinger.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          126.\n\n          INT. CANAL STREET DRY CLEANERS (NEW ORLEANS) - HOOVER -\n\n\n          ANOTHER DAY\n          watches Tolson who is at the window. Tolson gets a sign.\n          Hoover straightens his collar. He brushes lint off his pants\n          leg. Tolson waits. Hoover waits.\n\n          EXT. CANAL STREET HOTEL - DOOR\n\n          opens. Alvin Karpis comes out. In the hot, humid New Orleans\n          air, his suit coat is off...he carries it under his arm. He\n          crosses the street towards his Lincoln Coupe. His eyes land\n          on a man on a bench across the street looking at him over a\n          newspaper. And while crossing the street, Alvin slows down.\n\n          THE MAN IS CHARLES WINSTEAD\n          The newspaper hides a sawn-off, 10 gauge Winchester lever\n          action shotgun.\n\n          ALVIN LOOKS TO HIS LEFT: CLARENCE HURT\n          leans on a lamp post. His body hides a 351 Winchester rifle.\n\n          NOW ALVIN KARPIS\n          freezes. He doesn't hesitate. He opens his hands to\n          demonstrate he is holding nothing and lets his jacket; fall to\n          the ground. He knows instantly who they are and that.,,they\n          intend to kill him. Karpis' eyes dart to the roofto isÂ°.\n          Snipers on both. In this instant, Karpis knows he is done.\n          One objective races into his mind: stay alive.\n\n          KARPIS'\n          stretches out his arms, wide. Winstead has dropped the\n          newspaper. The sawed-off 10 gauge is aimed squarely at\n          Alvin's chest. Karpis is displaying he is unarmed. Winstead\n          approaches warily step-by-step. His weapon would cut Alvin in\n          half. Clarence, the rifle at his shoulder, inches forward.\n          The ex-Texas Ranger gunfighters with real trigger-time have\n          taken Alvin Karpis.\n\n          ALVIN KARPIS\n          I am unarmed.\n\n          WINSTEAD\n          Don't even breathe sudden.\n\n          WINSTEAD Â± CAMPBELL + HURT\n          are 10 feet from him. Clarence pats him down. Karpis is\n          clean.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          127.\n\n          CONTINUED:\n          The Texans cover Alvin and move him to the sidewalk near his\n          car.\n\n          HURT\n          Put your hands on the roof of that\n          Lincoln.\n          (he does)\n          Other agents come running in. Someone's yelling: We got him!\n          We got him. Bring him in.\" While they wait...\n\n          WINSTEAD\n          Where you from?\n\n          ALVIN KARPIS\n          Canada, but mostly Chicago.\n          (to both)\n          You?\n\n          WINSTEAD\n          Fort Worth, thereabouts. Clarence is from\n          Tyler.\n\n          (PAUSE)\n          Well, Alvin. You're a sly old dog. If\n          ,you'd a even had that jacket on...\n          A ring ofc tints with their revolvers out, now converge\n          around Karpis.\n\n          HURT\n          (to Agent)\n          Any handcuffs around here?\n          They don't have any. They had not planned on needing them.\n          One agent is excited. His gun pointed at Karpis shakes.\n\n          AL V I N KARP I S\n          Mind asking that man to...\n\n          HURT\n          (to Agent)\n          Put that down.\n          The agent drops his gun.\n\n          EXT. STREET - HOOVER\n\n           in his white suit and Tolson rush in from the dry cleaners\n           where they were stashed. The agents part. They suddenly stand\n          in front of Alvin Karpis. Hoover's 38 Chief Special is at\n          his side.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          128\n\n          CONTINUED:\n\n          TOLSON\n\n          (PROMPTING)\n          \"You are under...\n\n          HOOVER\n          You are under arrest for the...Wahpeton,\n          South Dakota bank robbery.\n          Tolson waves to an agent across the street.\n\n          WIDE ON THE CORNER: REPORTERS + PHOTOGRAPHERS\n          are now released and rush towards us.\n\n          HOOVER\n          regains his composure.\n\n          HOOVER (CONT'D)\n          I heard of your fishing prowess. i\n          myself, always wanted, to catch a\n          marlin...\n\n          ALVIN KARPIS\n          You're thinking of my partner, Harry\n          Campbell.\n\n          HOOVER\n          Are you relieved its over? I'm sure you\n          are.\n\n          (PAUSE)\n          You know you will feel much better once\n          you get everything off your chest.\n\n          (PAUSE)\n          Why don't you tell me where Harry\n          Campbell is?\n          After a moment..\n\n          ALVIN KARPIS\n          Who do you think you're talking to?\n          Hoover is silent.\n\n          SPECIAL AGENT\n          (to Winstead)\n          There's no handcuffs.\n\n          WINSTEAD\n          Give me your tie.\n\n          REPORTERS + PHOTOGRAPHERS\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          129.\n\n          CONTINUED: ( 2)\n          Hoover separates from Karpis.\n\n          NEWSMEN\n          Mr. Hoover! Director!\n\n          HOOVER\n          Karpis said he'd never be taken alive,\n          but I took him without firing a shot.\n\n          (BEAT)\n          That marks him as a yellow rat. He was\n          scared to death when I arrested him.\n\n          (BEAT)\n          That's all I got to say.\n          Suydam and the special publicist, COURTNEY COOPER address the\n          reporters.\n\n          SUYDAM\n          I'll answer any questions.\n\n          REPORTER #1\n          Mr. Hoover captured Karpis?\n\n          SUYDAM\n          Mr. Hoover personally placed Alvin Karpis\n          = eier arrest today. Karpis reached for a\n          rzf le, but the Director was too fast.\n\n          CUT TO:\n\n          INT. CLYDE TOLSON'S OUTER OFFICE - MELVIN PURVIS - DAY\n\n          waits. It looks like he's been waiting for awhile. People who\n          pass act as if he is invisible. They look right through him.\n\n          TOLSON\n          The Director will see you now.\n\n          INT. HOOVER'S OFFICE - HOOVER - DAY\n\n          Purvis stands in front of the desk. On the right of the desk\n          is a plaster death mask of John Dillinger.\n\n          HOOVER\n          (without looking up)\n          Agent Purvis.\n\n          PURVIS\n          Yes sir.\n\n          HOOVER\n          (sees Purvis stare at death\n\n          MASK)\n\n          (MORE)\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          130.\n\n          CONTINUED:\n\n          HOOVER (CONT'D)\n          A medical student in the morgue made that\n          cast of Dillinger's face. It's a reminder\n          of the war we continue to wage against\n          the punks and hoodlums...\n          Purvis looks at Hoover. This was the golden boy who Hoover\n          came to despise.\n\n          PURVIS\n          One thing I learned was that John\n          Dillinger was an outlaw and my Adversary.\n          But he was no punk. And he was no\n          hoodlum.\n\n          (BEAT)\n          Another is that I have no future in your\n          Bureau. And I don't desire one. I quit.\n          Purvis tosses his badge on Hoover's desk and walks out.\n          Hoover couldn't care less.\n\n          INT. MILAN WOMEN'S PRISON - GRANITE WALL - DAY\n\n          PAN LEFT and fall EXTREMELY CLOSELY onto the face of Charles\n          Winstead. He waits.\n\n          WIDER - WINSTEA.D\n          is in an interview cell.\n\n          INT. CELL BLOCK - TRACKING A WOMAN'S FEET\n\n          in prison issue shoes down the cellblock corridor. ARM UP. It\n          is Billie Frechette. She walks with two guards behind her.\n\n          INT. INTERVIEW CELL - DOOR OPENS\n\n          Billie enters. She's surprised to see Winstead.\n\n          WINSTEAD\n          How are you doing, Billie?\n\n          BILLIE\n\n          (SITS)\n          If you come here to ask me more damned\n          questions. \"Where's this one or that one?\n          Did I know Vern Miller? Who did what...?\"\n          Winstead shakes his head no.\n\n          (CONTINUED)\n\n          \n\n          \n\n          \n\n          \n\n          131.\n\n          CONTINUED:\n\n          WINSTEAD\n          I didn't come here for you to tell me\n          something. I came here to tell you\n          something.\n\n          CLOSER: BILLIE\n          She sees in Winstead's face, the look of people she grew up\n          with. Billie senses none of the cunning of the lawyer/special\n          agents she's been dealing with. She leans forward, indicates\n          a cigarette out of Winstead's pocket.\n          He hands her one and lights it.\n\n          BILLIE\n          Okay, Mr. Winstead. What do you got to\n          tell me?\n          Winstead leans forward.\n\n          BILLIE (CONT'D)\n\n          (CONTINUOUS)\n          They say you're the man who shot him?\n\n          WINSTEAD\n          'M'at's right. One of them.\n\n          BILLIE\n          6 why are you coming here to see me? To\n          see the damage you done?\n\n          WINSTEAD\n          Because he asked me to.\n          This gets Billie's attention and she looks more closely at\n          Winstead.\n\n          WINSTEAD (CONT'D)\n          When he went down, he said something. And\n          I put my ear next to his mouth and what I\n          think he said was this. He said...\n\n          (BEAT)\n          \" .tell Billie for me...Bye Bye\n          Blackbird...\"\n          Billie has to rise and turn away from Winstead so that he\n          doesn't see her overcome with emotion. Winstead knows this.\n          It is the measure of this man that he respected the privacy\n          of John Dillinger's message and only told her.\n\n\n\n                               THE END\n\n\n\n\n\n          \n\n          \n\n          \n\n          \n\n          \n \n\n\n\n\n\nPublic Enemies\nWriters :   Ronan Bennett  Michael Mann  Ann Eiderman\nGenres :   Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": ""}