{"title": "Shallow Grave", "full_text": "SHALLOW GRAVE\n\n\n                                       Written by\n\n                                       John Hodge\n\n\n\n                                                             FINAL DRAFT\n\n\n\n          INT. DAY\n          \n          A blurred image forms on a white screen. A horizontal strip of \n          face, eyes motionless and unblinking. \n          \n          DAVID\n          (VOICE-OVER) \n          Take trust, for instance, or friendship: these are the important \n          things in life, the things that matter, that help you on your \n          way. If you can't trust your friends, well, what then?\n          \n          EXT. DAWN \n          \n          A series of fast-cut static scenes of empty streets. \n          \n          DAVID\n          (VOICE-OVER)\n          This could have been any city: they're all the same.\n          \n          A rapid, swerving track along deserted streets and down narrow \n          lanes and passageways. Accompanied by soundtrack and credits.\n          \n          The track ends outside a solid, fashionable Edinburgh tenement.\n          \n          INT. STAIRWELL. DAY\n          \n          At the door of a flat on the third floor of the tenement. The \n          door is dark, heavy wood and on it is a plastic card embossed \n          with the names of three tenants. They are Alex Law, David \n          Stevens, and Juliet Miller.\n          \n          A man climbs the stairs and reaches the door. He is Cameron \n          Clarke, thin and in his late twenties with a blue anorak and \n          lank, greasy hair. He is carrying an awkwardly bulky plastic bag. \n          Cameron gives the doorbell an ineffectual ring and then stands \n          back, shifting nervously from foot to foot until the door is \n          answered.\n          \n          CAMERON\n          Hello, I've come about the room.\n          \n          Cameron enters and the door closes.\n          \n          INT. LIVING ROOM. DAY\n          \n          David, Alex, and Juliet sit in a line on the sofa directly \n          opposite Cameron, who shifts uneasily in his armchair. Alex \n          checks some items on a clipboard before speaking.\n          \n          ALEX\n          What's his name?\n          \n          DAVID\n          I don't know -- Campbell or something?\n          \n          JULIET\n          Cameron.\n          \n          ALEX\n          Cameron?\n          \n          JULIET\n          Yes.\n          \n          ALEX\n          (to Juliet)\n          Really?\n          \n          CAMERON\n          That's right.\n          \n          ALEX\n          (to Cameron)\n          What?\n          \n          Cameron is not sure what to say.\n          \n          ALEX\n          (CONTINUED)\n          Well, Cameron, are you comfortable?\n          \n          CAMERON\n          Yes, thanks.\n          \n          ALEX\n          Good. Well, you've seen the flat?\n          \n          CAMERON\n          Yes.\n          \n          ALEX\n          And you like it?\n          \n          CAMERON\n          Oh, yes, it's great.\n          \n          ALEX\n          Yes. It is, isn't it? We alllike it. And the room's nice too, \n          don't you think?\n          \n          CAMERON\n          Yes.\n          \n          ALEX\n          Spacious, quiet, bright, well appointed, all that sort of stuff, \n          all that crap.\n          \n          CAMERON\n          Well, yes.\n          \n          ALEX\n          So tell me, Cameron, what on earth -- just tell me, because I \n          want to know -- what on earth could make you think that we would \n          want to share a flat like this with someone like you?\n          \n          INT. STAIRWELL. DAY\n          \n          As Cameron plods slowly down the stairs, his shoes striking out \n          against the stone steps, Alex's criticisms continue.\n          \n          ALEX\n          (VOICE-OVER)\n          \n          I mean, my first impression, and they're rarely wrong, is that \n          you have none of the qualities that we would normally seek in a \n          prospective flatmate. I'm talking here about things like \n          presence, charisma, style and charm, and I don't think we're \n          being unreasonable. Take David here, for instance: a chartered \n          accountant he may be, but at least he tries hard. The point is, I \n          don't think you're even trying.\n          \n          Cameron has reached the bottom of the stairs. He opens the main \n          door.\n          \n          ALEX\n          (CONTINUED)\n          And, Cameron -- I mean this -- good luck!\n          \n          Cameron leaves and the main door closes behind him.\n          \n          ALEX\n          (CONTINUED)\n          Do you think he was upset?\n          \n          INT. STAIRWELL. DAY\n          \n          Inside the hall of the flat, David approaches the door toopen it. \n          Freeze-frame.\n          \n          ALEX\n          (VOICE-OVER)\n          David likes to keep spareshoelaces in sorted pairs in a box \n          marked, not just shoelaces', but spare shoelaces'.\n          \n          David opens the door to the Woman.\n          \n          WOMAN\n          I've come to see about the room.\n          \n          INT. STAIRWELL. DAY\n          \n          Outside the door of the flat a young Goth girl, aged about \n          twenty, rings the doorbell.\n          \n          INT. HALL. DAY\n          \n          Inside the hall of the flat Alex approaches the door to open it. \n          Freeze-frame.\n          \n          JULIET\n          (VOICE-OVER)\n          Alex is a vegetarian. Do you know why? Because he feels it \n          provides an interesting counterpoint to his otherwise callous \n          personality. It doesn't. He thinks he's the man for me. He isn't, \n          though there was a time when, well, there was a time when...\n          \n          Alex opens the door to the Goth.\n          \n          GOTH\n          I've come about the room.\n          \n          INT. STAIRWELL. DAY\n          \n          At the door of the flat a Man aged about thrity-five rings the \n          bell.\n          \n          INT. HALL. DAY\n          \n          Inside the hall of the flat Juliet approaches the door to open \n          it. Freeze-frame.\n          \n          DAVID\n          (VOICE-OVER)\n          Like one of those stupid posters -- you know, a gorilla cuddling \n          a hedgehog, caption love hurts --- that's what I think when I \n          think of Juliet.\n          \n          Juliet opens the door to the Man.\n          \n          MAN\n          I've come about the room.\n          \n          INT. LIVING ROOM. DAY\n          \n          In the living room each of the candidates is interviewed \n          individually with the same seating arrangements as before (i.e. \n          the trio on the sofa and the applicant on the chair). What we see \n          are briskly intercut excerpts from each of these interviews. We \n          do not get the responses to the questions, although we may see \n          some facial reaction.\n          \n          All of David's questions are to the Woman.\n          \n          All of Alex's questions are to the Goth.\n          \n          All of Juliet's questions are to the Man.\n          \n          DAVID\n          All right, just a few questions.\n          \n          ALEX\n          I'd like to ask you about your hobbies.\n          \n          JULIET\n          Why do you want a room here?\n          \n          DAVID\n          Do you smoke?\n          \n          ALEX\n          When you slaughter a goat and wrench its heart out with your bare \n          hands, do you then summon hellfire?\n          \n          JULIET\n          I mean, what are you actually doing here? What is the hidden \n          agenda?\n          \n          DAVID\n          Do a little freebasemaybe, from time to time?\n          \n          ALEX\n          Or maybe just phone out for a pizza?\n          \n          JULIET\n          Look, it's a fairly straightforward question. You're either \n          divorced or you're not.\n          \n          DAVID\n          OK, I'm going to play you just a few seconds of this tape -- I'd \n          like you to name the song, the lead singer and the three hit \n          singles subsequently recorded by him with another band.\n          \n          ALEX\n          When you get up in the morning, how do you decide what shade of \n          black to wear?\n          \n          JULIET\n          Now, let me get this straight. This affair that you're not \n          having, is it not with a man or not with a woman?\n          \n          DAVID\n          Turning very briefly to the subject of corporate finance -- no, \n          this is important. Leveraged buy-outs -- a good thing or a bad \n          thing?\n          \n          ALEX\n          With which of the following figures do you most closely identify: \n          Joan of Arc, Eva Braun or Marilyn Monroe?\n          \n          JULIET\n          It's just that you strike me as a man trapped in a crisis of \n          emotional direction, afflicted by a realization that the partner \n          of your dreams is, quite simply, just that.\n          \n          DAVID\n          Did you ever kill a man?\n          \n          ALEX\n          And when did anyone last say to you these exact words: You are \n          the sunshine of my life'?\n          \n          JULIET\n          OK, so A has left you, B is ambivalent, you're still seeing C but \n          D is the one you yearn for. What are we to make of this? If I \n          were you, I'd ditch the lot. There's a lot more letters in the \n          alphabet of love.\n          \n          DAVID\n          And what if I told you that I was the antichrist?\n          \n          INT. SQUASH COURT. EVENING\n          \n          In a sports centre Juliet sits outside a glass-walled squash \n          court. She is ready to play, but at present is watching Alex and \n          David, who are inside the court.\n          \n          INT. SQUASH COURT. EVENING\n          \n          Inside the squash court, Alex is about to serve.\n          \n          ALEX\n          Squash is often used as a metaphor to represent a struggle for \n          personal domination.\n          \n          DAVID\n          Serve.\n          \n          ALEX\n          I was trying to educate you.\n          \n          DAVID\n          Just serve.\n          \n          ALEX\n          In the same fashion as chess.\n          \n          DAVID\n          What?\n          \n          ALEX\n          Chess. Chess is often used as well.\n          \n          DAVID\n          Will you shut up and play.\n          \n          ALEX\n          You're a bad loser.\n          \n          DAVID\n          I haven't lost yet.\n          \n          Alex serves.\n          \n          INT. SQUASH COURT. EVENING\n          \n          The squash-court door opens and David walks out past Juliet as \n          Alex stands behind, jabbing his finger at him.\n          \n          ALEX\n          Defeat, defeat, defeat-- sporting,personal, financial, \n          professional, sexual, everything. Next.\n          \n          Juliet walks in and closes the door.\n          \n          INT. SQUASH COURT. EVENING\n          \n          Inside the squash court Alex is about to serve.\n          \n          ALEX\n          Did you know --\n          \n          JULIET\n          Just serve.\n          \n          Alex serves.\n          \n          INT. JULIET'S CAR (A MINI). NIGHT\n          \n          Alex sits in the back, drinking.\n          \n          Juliet is driving. David sits beside her.\n          \n          ALEX\n          I wasn't trying to win.\n          \n          There is no response from Juliet.\n          \n          ALEX\n          (CONTINUED)\n          I don't want to devalue your victory, but I just want you to \n          know: I wasn't trying to win.\n          \n          DAVID\n          Victory is the same as defeat. It's giving in to destructive \n          competitive urges.\n          \n          ALEX\n          You learn that in your psychotherapy group?\n          \n          DAVID\n          Discussion group, Alex, discussion.\n          \n          JULIET\n          I thought you stopped going.\n          \n          ALEX\n          Yeah, he had one too many of thise urges. You of all people \n          should know that.\n          \n          Alex leans close to Juliet. Juliet brakes abruptly and, as Alex \n          flies forward, elbows him in the chest.\n          \n          ALEX\n          (CONTINUED)\n          God, you two are sensitive. All I'm doing is implying some sort \n          of sordid, ugly, sexual liason. Why, I'd be proud of that sort of \n          thing.\n          \n          JULIET\n          Maybe you should go, Alex.You'll meet someone wonderful.\n          \n          ALEX\n          For my life? At a discussion group? I think not.\n          \n          JULIET\n          For the flat.\n          \n          ALEX\n          No. Be someone else like him. One is enough. And what happened to \n          that girl, that friend of yours, the one that came round. I liked \n          her. I really felt we had something. She could have moved in. We \n          had chemistry.\n          \n          JULIET\n          She hated you --\n          \n          ALEX\n          Well, she had problems --\n          \n          JULIET\n          -- more than anyone she has ever met. In her whole life.\n          \n          ALEX\n          -- I'd be the first topoint that out. In all kindness I would. \n          But, like they say, you know, she's got to want to change, hasn't \n          she?\n          \n          INT. STAIRWELL. DAY\n          \n          Outside the door of the flat Hugo rings the bell and waits. \n          Juliet opens the door. Hugo is in his early thirties, tall, dark \n          and bohemian in appearance.\n          \n          JULIET\n          You must be Hugo.\n          \n          HUGO\n          You must be Juliet.\n          \n          JULIET\n          Would you like to come in?\n          \n          HUGO\n          I'd be delighted.\n          \n          Hugo walks in and Juliet closes the door quite deliberately \n          behind him.\n          \n          INT. VACANT ROOM. DAY\n          \n          Hugo looks around, pleased at what he sees, while Juliet watches \n          him. He sits on the edge of the bed.\n          \n          HUGO\n          It's nice.\n          \n          JULIET\n          Would you like to see the rest?\n          \n          INT. LIVING ROOM. DAY\n          \n          Hugo is seated on the sofa, Juliet sits opposite on an armchair.\n          \n          JULIET\n          What do you do?\n          \n          HUGO\n          Well, I've been away for a bit, travelling, that sort of thing, \n          and now I'm trying to write a novel.\n          \n          JULIET\n          What's it about?\n          \n          HUGO\n          A priest who dies.\n          \n          JULIET\n          I see.\n          \n          HUGO\n          Yeah. Well, maybe I'll change it.\n          \n          JULIET\n          No.\n          \n          HUGO\n          Yes, I mean, who wants to read about another dead priest? It's \n          about some other guy, some guy who's not a priest, who doesn't \n          die. You see, it's better already.\n          \n          JULIET\n          Writing seems easy.\n          \n          HUGO\n          It's a breeze.\n          \n          The telephone begins to ring out in the hall. Juliet does not \n          move and at first says nothing. Hugo looks at her and towards the \n          door leading to the hall. After several rings, Juliet speaks. \n          \n          JULIET\n          Do you think you could answer that?\n          \n          HUGO\n          The telephone? \n          It continues to ring.\n          \n          JULIET\n          Yes, the telephone, but if it's for me, I'm not in. \n          HUGO\n          You're not in.\n          \n          JULIET\n          No.\n          \n          HUGO\n          All right.\n          \n          Hugo stands up. The ringing continues.\n          \n          INT. HALL. DAY\n          \n          Hugo lifts the phone. He turns to face Juliet and looks her in \n          the eye as he lies on her behalf.\n          \n          HUGO\n          Hello. Yes. Who's calling please? Well, I'm sorry, but she's not \n          in right now. I don't know. Would you like to leave a message?\n          \n          Hugo replaces the receiver.\n          \n          HUGO\n          (CONTINUED)\n          It was some guy called Brian.\n          \n          JULIET\n          Did he sound upset?\n          \n          HUGO\n          A little bit. Is that good or bad?\n          \n          JULIET\n          It's an improvement.\n          \n          The telephone begins to ring again.\n          \n          HUGO\n          Shall I answer it?\n          \n          JULIET\n          No, just leave it. He knows I must be at home. I'm working nights \n          this week.\n          \n          The telephone continues to ring.\n          \n          HUGO\n          Working nights?\n          \n          JULIET\n          I'm a doctor.\n          \n          HUGO\n          And he's a patient of yours?\n          \n          JULIET\n          No. But he needs treatment.\n          \n          HUGO\n          For what?\n          \n          JULIET\n          A certain weakness.\n          \n          HUGO\n          The human condition.\n          \n          JULIET\n          You know about it?\n          \n          HUGO\n          I write about it?\n          \n          JULIET\n          And that's not the same thing?\n          \n          HUGO\n          No, but like all novelists, I'm in search of the self.\n          \n          INT. KITCHEN. MORNING\n          \n          Juliet, dressed and fatigued, sits at the table sipping a coffee. \n          Alex is also seated at the table, but wearing an old dressing-\n          gown and munching at cornflakes while he reads a newspaper and \n          talks at the same time. An array of other papers is spread over \n          the table.\n          \n          ALEX\n          Has he tried down the back of the fridge? I mean, that's where I \n          normally find things.\n          \n          JULIET\n          He seemed like a nice guy, Alex.\n          \n          Juliet gets up and leaves the kitchen. The soundof a bath running \n          is heard.\n          \n          ALEX\n          I'm not saying he didn't seem like a nice guy. All I'm saying is, \n          it's a bit strange, and this search for the self, and what he's \n          on about, you know.\n          \n          Alex hears the mail falling through the door and stands up to \n          leave the kitchen and get it.\n          \n          JULIET\n          (calling from outside)\n          He didn't seem strange, Alex.He seemed, you know --\n          \n          INT. BATHROOM.MORNING.\n          \n          Juliet watches the bath fill.\n          \n          JULIET\n          ...interesting.\n          \n          INT. KITCHEN. MORNING\n          \n          Alex considers her reply.\n          \n          ALEX\n          Interesting. Interesting.\n          \n          INT. HALL. MORNING\n          \n          Alex is walking through the hall to the door,muttering \n          interesting' to himself. As he passes the phone starts to ring. \n          He stops and lifts it.\n          \n          ALEX\n          Hello. No, she's not in. No. No. No. No ideas.\n          \n          Alex replaces the reciever and walks on to the door.\n          \n          JULIET\n          (from the bathroom)\n          Who was it?\n          \n          ALEX\n          I don't know. He sounded Swedish. Do you know any Swedish men? \n          Maybe it was just the emotion.\n          \n          Alex picks up the mail and looks through it. As he does so,David \n          emerges from his room, dressed for work.\n          \n          ALEX\n          (CONTINUED)\n          What do you think?\n          \n          DAVID\n          About what?\n          \n          ALEX\n          About this guy, this Hugo person.\n          \n          DAVID\n          I don't have time.\n          \n          ALEX\n          I'm only asking what you think.\n          \n          DAVID\n          I don't have time to discuss it now. I don't care so long as he's \n          not a freak.\n          \n          David opens the door. Alex hands him an envelope.\n          \n          ALEX\n          This is for you. It's your mother's handwriting, so I didn't open \n          it. I don't like reading about your father's constipation.\n          \n          David snatches the letter and leaves, closing the door.\n          \n          Alex walks back across the hall, opening one of the letters and \n          reading it quickly.\n          \n          JULIET\n          (calling from the bathroom)\n          So we'll meet him, then?\n          \n          ALEX\n          What? Oh, yeah, sure, if you want. I tell you, every letter this \n          guy writes to you is the same: they all begin like pure love and \n          descend into open pornography. I dream of your thighs, the soft \n          touch of your white skin leading me in desire, while I, aroused \n          and inflamed --'\n          \n          Juliet's hand and arm appear around the bathroom door. She \n          attempts to grab the letter. Alex plays at holding the letter \n          just beyond her reach.\n          \n          ALEX\n          (CONTINUED)\n          Aroused and inflamed.\n          \n          JULIET\n          Alex.\n          \n          ALEX\n          He even signs them, in his own name, can you believe it? I'd sign \n          someone else's name. I'd sign his name. If I wrote them, that is. \n          Which I don't.\n          \n          INT. LIVING ROOM. EVENING\n          \n          Alex, David, Juliet and Hugo sit round a table towards the end of \n          a meal. Alcohol has been consumed. Bowls containing the last of \n          the food sit on the table, being picked at occassionally. Alex \n          dispenses wine mainly into his own glass, alternating with \n          Macallan malt whisky, of which he pours generous amounts.\n          \n          ALEX\n          Interesting.\n          \n          HUGO\n          I see.\n          \n          ALEX\n          Yeah, well, that's what she said. Interesting. That's why you're \n          here, you see.\n          \n          DAVID\n          Normally I don't meet people, unless I know them already.\n          \n          HUGO\n          I see.\n          \n          DAVID\n          People can be so cruel.\n          \n          ALEX\n          So, uh...\n          \n          HUGO\n          What?\n          \n          ALEX\n          What?\n          \n          HUGO\n          You were going to say something.\n          \n          ALEX\n          What was I trying to say? Oh, yes, I think, we think, or at least \n          I suppose we think -- am I right?\n          \n          JULIET\n          Just get on with it, Alex.\n          \n          DAVID\n          Keep it going, Alex. You're unstoppable now.\n          \n          ALEX\n          We think it's fine.\n          \n          Alex starts eating again. The others watch him expectantly. David \n          coughs.\n          \n          ALEX\n          (CONTINUED)\n          It's OK. There's no problem.\n          \n          HUGO\n          You mean I can have the room?\n          \n          ALEX\n          Well, that's what I said, isn't it?\n          \n          DAVID\n          He made it clear.\n          \n          ALEX\n          Why, thank you, David.\n          \n          JULIET\n          Yes, you can have the room.\n          \n          Alex pours yet more alcohol.\n          \n          ALEX\n          I'm not usually drunk.\n          \n          JULIET\n          Not usually this drunk.\n          \n          DAVID\n          Only on expenses.\n          \n          ALEX\n          It's true. A newspaper is paying for all this. A newspaper...\n          \n          With exaggerated scorn, Alex knocks over a glass of wine.\n          \n          JULIET\n          In a moment he's going to tell he could have been someone --\n          \n          ALEX\n          It was you, Juliet, it was you --\n          \n          JULIET\n          -- instead of what he is --\n          \n          ALEX\n          What I am.\n          \n          JULIET\n          -- which is --\n          \n          ALEX\n          -- which is a hack.\n          \n          JULIET\n          The man we know and love.\n          \n          ALEX\n          A miserable, burnt-out, empty shell of a -- \n          Alex pauses, looks at his drink, then at Juliet.\n          \n          ALEX\n          (CONTINUED)\n          Know and love?\n          \n          JULIET\n          Yeah.\n          \n          ALEX\n          I think you're lying.\n          \n          JULIET\n          You're right.\n          \n          ALEX\n          You see, they don't really know me.\n          \n          JULIET\n          No, Alex, we don't really love you.\n          \n          Alex smiles at Juliet and drinks again.\n          \n          ALEX\n          Can you afford this place?\n          \n          HUGO\n          Yeah.\n          \n          Hugo reaches into his pocket and pulls out a thick bundle of \n          notes, which he places in front of Alex. Alex leans over and \n          sniffs the notes.\n          \n          DAVID\n          Can I ask you a question?\n          \n          HUGO\n          Certainly.\n          \n          DAVID\n          Have you ever killed a man? \n          HUGO\n          No.\n          \n          DAVID\n          Well, that's fair enough, then.\n          \n          Alex raises his head.\n          \n          ALEX\n          Certainly smells like the real thing.\n          \n          EXT. A STREET. NIGHT\n          \n          At a cash dispenser a man in his thrities is taking out some \n          money.\n          \n          A younger man, Andy, stands besdie him, looking around in a \n          mildly agitated fashion.\n          \n          As the money emerges, Andy assaults and robs the man. He starts \n          by smashinf the victim's face repeatedly against the cash \n          dispenser until the Perspex is smeared with blood. When he has \n          final finished and the man lies on the ground, Andy takes the \n          money and the card from the slots, then gets into a car which has \n          pulled up alongside, driven by Tim.\n          \n          INT. STAIRWELL. DAY\n          \n          Hugo climbs the stairs, carrying two suitcases. He stops at the \n          door of the flat and looks at a bunch of keys before selecting \n          one, which he inserts in the door.\n          \n          INT. HALL. DAY\n          \n          Inside the flat. The door opens and Hugolifts his cases in, \n          kicking the door closed behind him.\n          \n          INT. JULIET'S ROOM. DAY\n          \n          Juliet sleeps, undisturbed by the closing of the door.\n          \n          INT. HALL. DAY\n          \n          Hugo walks across the halland disappears into his room.\n          \n          INT. HUGO'S ROOM. DAY\n          \n          Hugo unpackshis bags. Included in his things are a few syringes \n          and needles. All these he puts into the drawer beside his bed. He \n          checks inside a second bag.\n          \n          INT. HALL. DAY\n          \n          Hugo dails a number on the telephone and awaits a reply.\n          \n          INT. JULIET'S ROOM. EVENING\n          \n          Juliet is woken by her alarm clock. The time is five p.m.\n          \n          INT. LIVING ROOM. NIGHT\n          \n          Alex sits watching television, constantly changing channels. \n          Juliet walks in, wearing a dressing gown. She watches Alex for a \n          few moments.\n          \n          JULIET\n          Have you seen Hugo?\n          \n          ALEX\n          No. Any idea which channel he's on?\n          \n          INT. HALL. MORNING\n          \n          The telephone is ringing. Alex lifts up the reciever. Again he is \n          wearing his dressing gown and is on his way to pick up the mail.\n          \n          ALEX\n          No, she's not in. \n          Without waiting for any more, he replaces the reciever and walks \n          to the door, where he picks up the mail. On his way back from the \n          door, David emerges, ready to go to work.\n          \n          ALEX\n          (CONTINUED)\n          Have you seen him?\n          \n          DAVID\n          Alex, I don't have the time --\n          \n          ALEX\n          Yes or no, yes or no, yes or --\n          \n          DAVID\n          No.\n          \n          David leaves, slamming the door.\n          \n          INT. KITCHEN. MORNING\n          \n          Alex returns to the kitchen, pausing only to knock at Hugo's \n          door, which elicits no response. In the kitchen Juliet sits \n          dressed for work, having just returned. He casually opens an \n          envelope and glances at both sides of the letter before handing \n          it to her.\n          \n          ALEX\n          David hasn't seen him either.\n          \n          JULIET\n          So I gathered.\n          \n          ALEX\n          Maybe he didn't like us.\n          \n          JULIET\n          David?\n          \n          ALEX\n          Hugo.\n          \n          JULIET\n          His car's still there.\n          \n          ALEX\n          He's got a car?\n          \n          JULIET\n          So what's wrong with that?\n          \n          ALEX\n          What sort of car?\n          \n          JULIET\n          Alex, how shouldI know? I'm just a girl.\n          \n          ALEX\n          I will ask you once more, what sort of car -- \n          \n          JULIET\n          A blue one, OK. And it's still there.\n          \n          INT. HALL. NIGHT\n          \n          We see the door to Hugo's room, then Alex rapping sharply against \n          it. David and Juliet stand behind him.\n          \n          ALEX\n          Hugo. Hugo. Sorry about this, but can you open the door? It's us, \n          Hugo, your flatmates and companions. Your new-found friends. He's \n          not in. He's left and we'll probably never see him again.\n          \n          JULIET\n          Alex, the key is in the keyhole on the other side.\n          \n          ALEX\n          So?\n          \n          JULIET\n          Open it.\n          \n          ALEX\n          You want me to kick it open?\n          \n          JULIET\n          Yes.\n          \n          ALEX\n          Now?\n          \n          JULIET\n          Yes.\n          \n          ALEX\n          All right. No problem.\n          \n          After several ineffective kicks at the door, Alex turns to David.\n          \n          ALEX\n          (CONTINUED)\n          You want a go?\n          \n          INT. HUGO'S ROOM. NIGHT\n          \n          Inside Hugo's room we see the door as David, outside, throws \n          himself against it. At the third attempt the lock gives way and \n          the door bursts open.\n          \n          In the foreground at one side is the bed with a naked foot lying \n          still and exposed.\n          \n          When the door is open, David is first in, followed by the other \n          two. There is a period of silent shock as they contemplate Hugo's \n          naked corpse. Alex opens a window.\n          \n          DAVID\n          Is this what they always look like?\n          \n          JULIET\n          Yes.\n          \n          Juliet drapes a sheet over the body, covering it completely.\n          \n          ALEX\n          I wonder how he did it?\n          \n          JULIET\n          Did what?\n          \n          ALEX\n          I wonder how he killed himself. I presume that that's what \n          happened. What do you think?\n          \n          Quite casually, Alex begins to open drawers and cupboards, \n          emptying the contents on to the floor.\n          \n          JULIET\n          Alex.\n          \n          ALEX\n          What? What's wrong?\n          \n          JULIET\n          What are you doing?\n          \n          ALEX\n          I'm just looking.\n          \n          JULIET\n          Don't.\n          \n          ALEX\n          Don't look?\n          \n          JULIET\n          No.\n          \n          ALEX\n          Why not? What's wrong, Juliet? Aren't you curious? Don't you \n          wonder what he died from?\n          \n          JULIET\n          No.The guy's dead.What more do you need?\n          \n          ALEX\n          It's not every day I find a story in my own flat.\n          \n          JULIET\n          Thats not a story, Alex. It's a corpse.\n          \n          ALEX\n          Old newspaper proverb says dead human being is living story. Be \n          rational, please, and failing that be quiet.\n          \n          In a drawer in a bedside cabinet, Alex finds needles, syringes \n          and a small bag of powder. Without comment, he holds it up and \n          throws it on the bed.\n          \n          He reaches under the bed and pulls out a case, which he opens. It \n          is empty and he pushes it back under.\n          \n          DAVID\n          I've never seen a dead body before.\n          \n          JULIET\n          Alex, I think it's time for you to stop.\n          \n          Alex continues to search. Juliet walks out.\n          \n          INT. HALL. NIGHT\n          \n          Juliet stands alone.\n          \n          INT. HUGO'S ROOM. NIGHT\n          \n          Alex continues his brisk search through Hugo's posesseions while \n          David looks on, appalled but speechless.\n          \n          INT. HALL. NIGHT\n          \n          Juliet listens to the sounds from the bedroom, then picks up the \n          telephone. She dials 999 and waits for a reply. It rings and \n          rings.\n          \n          INT. HUGO'S ROOM. NIGHT\n          \n          Alex has found and opened a large Gladstone bag. Neither David \n          norwe can see into it.\n          \n          DAVID\n          I saw my grandmother, of course, but I don't suppose that counts. \n          I mean, she was alive at the time.\n          \n          ALEX\n          Can I show you something?\n          \n          INT. HALL. NIGHT\n          \n          Juliet awaits an answer.\n          \n          Alex approaches Juliet with the open bag. She turns around and \n          looks into it, then, seeing the contents, she replaces the \n          receiver. As she does so, the Operator's voice is audible for a \n          second.\n          \n          OPERATOR\n          Hello, emergency services.\n          \n          The telephone hits the cradle.\n          \n          INT. KITCHEN. NIGHT\n          \n          David, Alex and Juliet are seated in silence around the tabel. \n          The bag, stacked with money, lies open on the table.\n          \n          DAVID\n          No.\n          \n          ALEX\n          Think about it.\n          \n          DAVID\n          No.\n          \n          ALEX\n          Come on, David.\n          \n          DAVID\n          No.\n          \n          ALEX\n          Juliet?\n          \n          JULIET\n          No, Alex. It's, it's --\n          \n          ALEX\n          What?\n          \n          JULIET\n          Unfeasible.\n          \n          ALEX\n          Is that all?\n          \n          DAVID\n          You mean immoral.\n          \n          ALEX\n          I'm only asking you both to think about it.\n          \n          DAVID\n          It's asick idea, Alex. It's sick.\n          \n          ALEX\n          But don't tell me that you're not tempted by it. Don't tell me \n          that you're not interested. I know you well enough.\n          \n          DAVID\n          You think so?\n          \n          ALEX\n          (AMUSED)\n          All right, then, go ahead, telephone. Telephone the police. Try \n          again. No one's going to stand in your way. Go ahead. Tell them \n          there's a suitcase of money and you don't want it.\n          \n          INT. HALL. MORNING\n          \n          The flat is silent. Footsteps are heard outside the door and mail \n          falls through the letter box.\n          \n          INT. LIVING ROOM. DAY\n          \n          The living room, empty.\n          \n          INT. KITCHEN. DAY\n          \n          The kitchen, empty. The bag of money still sits on the table.\n          \n          INT. HUGO'S BEDROOM. DAY\n          \n          His corpse lies on the bed, covered as before, incompletely, by a \n          sheet, with parts of his body still showing (a foot, a hand, part \n          of his face or abdomen).\n          \n          INT. NEWSPAPER OFFICE. DAY\n          \n          The open-plan office of a busy newspaper. Alex sits at his desk. \n          He is talking on a telephone jammed against his shoulder and \n          while he does so he is casually acknowledging and waving at \n          colleagues.\n          \n          ALEX\n          Now, was there a pet in the house? Yes, a pet, like a dog or a \n          budgie or a gerbil. You see, what I need is PC Plod rescues Harry \n          the Hamster from House of Horror'. All right... well, that's a \n          pity, you see, no pets, no human angle.\n          \n          Alex hangs up.\n          \n          INT. HUGO'S ROOM. DAY\n          \n          Another view of the body: for example, from above.\n          \n          INT. HOSPITAL. DAY\n          \n          In the accident and emeregency department of a busy hospital, \n          Juliet sifts through a setof casenotes. Another Doctor approaches \n          her.\n          \n          DOCTOR\n          Hi, there.\n          \n          Juliet does not look up.\n          \n          JULIET\n          Hello.\n          \n          DOCTOR\n          What happened to that guy?\n          \n          JULIET\n          What guy?\n          \n          DOCTOR\n          That guy, the one that died.\n          \n          Juliet looks up.\n          \n          JULIET\n          What guy that died?\n          \n          DOCTOR\n          That one, last week.\n          \n          JULIET\n          Here?.\n          \n          DOCTOR\n          Yeah, here, I mean, where else?\n          \n          JULIET\n          Oh, him. Well, he died.\n          \n          DOCTOR\n          (SATISFIED)\n          That's what I thought.\n          \n          INT. HUGO'S ROOM. DAY\n          \n          The body, stillpresent, exposed and motionless. The curtain \n          flutters by the open window.\n          \n          INT. LUMSDEN'S OFFICE. DAY\n          \n          Lumsden, a middle-aged chartered accountant, isseated in a \n          largechair behind a desk. He is talking to David,who appears \n          distracted.\n          \n          LUMSDEN\n          What do we do here, David?\n          \n          DAVID\n          Sorry?\n          \n          LUMSDEN\n          Here.\n          \n          DAVID\n          Right here?\n          \n          LUMSDEN\n          In this firm.\n          \n          DAVID\n          Well, it's a wide range of, eh --\n          \n          LUMSDEN\n          Accounting, David, chartered accounting --\n          \n          DAVID\n          Exactly what I was --\n          \n          LUMSDEN\n          -- is often sneered at. Are you aware of that?\n          \n          DAVID\n          Not any real sneering as such, no.\n          \n          LUMSDEN\n          There's a whole wide world out there, and it all needs to be \n          accounted for, doesn't it?\n          \n          DAVID\n          Eh --\n          \n          LUMSDEN\n          But they sneer, don't they?\n          \n          DAVID\n          I'm not sure --\n          \n          LUMSDEN\n          Oh, it's unfashionable, I know, but, yes, we're methodical, yes, \n          we're dilligent, yes, we're serious, and where's the crime in \n          that, and why not shout it from the rooftops, yes, maybe \n          sometimes we are a little bit boring, but by God, we get the job \n          done.\n          \n          DAVID\n          Yes, sir.\n          \n          LUMSDEN\n          And that's why I think you fit in here.\n          \n          DAVID\n          I'm boring?\n          \n          LUMSDEN\n          You get the job done.\n          \n          DAVID\n          Oh, I see, I thought you meant --\n          \n          LUMSDEN\n          Which is why I'm trusting you with this account.\n          \n          Lumsden throws a heavy folder into David's lap.\n          \n          INT. HUGO'S ROOM. EVENING\n          \n          It is almost dark.Only the familiar contour is visible through \n          the gloom.\n          \n          INT. STAIRWELL. EVENING\n          \n          David ascends the stairs to the flat.\n          \n          INT. LIVING ROOM. EVENING\n          \n          Alex sits in an armchair facing out of the window. Juliet stands \n          facing into the room. David, the last home, appears in the \n          doorway.\n          \n          DAVID\n          He's still here.\n          \n          ALEX\n          He couldn't get his car started.\n          \n          DAVID\n          When are you going to let the police know?\n          \n          ALEX\n          You call them if you want.\n          \n          DAVID\n          (to Juliet)\n          And what about you?\n          \n          JULIET\n          Well, I'm getting used to having him around.\n          \n          INT. HUGO'S ROOM. DAY\n          \n          The corpse as before.\n          \n          INT. ACCOUNTANT'S OFFICE. DAY\n          \n          David sits at his desk, looking across the office.\n          \n          Crouched over a large array of other desks, young men and women \n          in suits are pouring over folders and columned books. No one is \n          speaking except in muted tones on the telephones.\n          \n          David watches them. He looks to his left and to his right: on \n          either side young men like him are toiling over accounts. He \n          turns and looks behind him, where another array of accountants \n          sit.\n          \n          He turns back to his desk and opens the file he was previously \n          given. He looks at the columns of records of profit, with a large \n          total at the bottom.\n          \n          When David looks up he sees Juliet seated beside his desk. She \n          smiles and directs his gaze, with her own, to the surrounding \n          scene.\n          \n          INT. HUGO'S ROOM. EVENING\n          \n          The body in silhouette.\n          \n          DAVID\n          (VOICE-OVER)\n          OK. Let's do it.\n          \n          INT. DIY STORE. DAY\n          \n          Inside a large, brightly lit DIY store with Muzak playing in the \n          background. We start with a tracking shot along an aisle stacked \n          with potentially vicious tools.\n          \n          ALEX\n          (VOICE-OVER)\n          All right, now listen. We have to dispose of the body in such a \n          way as to make it unidentifiable, so that even if it is found, \n          then it's never anything more than an unknown corpse. Burning, \n          dumping at sea, and straightforward burial are all flawed either \n          by fingerprints, or, more commonly, by dental records. This I \n          have learned. Now, what I suggest is that we bury him out in the \n          forest, but first of all we remove his hands and his feet, which \n          we incinerate. And his teeth, which we just remove. It's as \n          simple as that.\n          \n          As the tracking shot ends, we see David's head and shoulders as \n          he looks at something off picture. Suddenly a spring-loaded \n          screwdriver appears and is fired' so that the tip stops a few \n          millimeters from his face. David winces as we see that Alex is \n          holding it.\n          \n          ALEX\n          (CONTINUED)\n          I always wondered what these were for.\n          \n          Alex places the screwdriver down on the shelf and walks across \n          the aisle to pick up a saw and a hammer.\n          \n          ALEX\n          (CONTINUED)\n          Now this is what we need. And this. \n          \n          Alex hands the tools to David, who looks at them with disgust. \n          Alex walks on.\n          \n          ALEX\n          (CONTINUED)\n          Now what else? \n          DAVID\n          I don't know.\n          \n          ALEX\n          A spade, we need a spade -- I wish you would concentrate -- we \n          need a spade if we're going to dig a pit.\n          \n          DAVID\n          So who's going to do it?\n          \n          ALEX\n          Dig the pit, I don't know.\n          \n          DAVID\n          No, not that.\n          \n          ALEX\n          Then what? Who's going to do what?\n          \n          DAVID\n          You know what I'm talking about.\n          \n          ALEX\n          Do I? What? What? What are you talking about?\n          \n          DAVID\n          You know what. Who's going to do it.\n          \n          ALEX\n          We all are, David, we're all going to do it. Each of us, you, me \n          and Juliet, will do his or her bit. Is that fair enough?\n          \n          DAVID\n          I can't do it.\n          \n          ALEX\n          I don't hear this.\n          \n          DAVID\n          I won't be able to.\n          \n          ALEX\n          You're telling me you want out? Already? You're telling me you \n          don't want the money? Hugo is going off. He smells. The flat \n          smells. We can't wait any longer.\n          \n          DAVID\n          I'm just telling you I can't cut him up.\n          \n          Alex turns away in disgust.\n          \n          EXT. LANE. NIGHT\n          \n          Late at night, in a quiet lane at the back of the flat, a hired \n          Ford Transit is parked.\n          \n          INT. VAN. NIGHT\n          \n          Inside the dimly lit van, Alex and Juliet are laying down plastic \n          on the floor.\n          \n          JULIET\n          Who's going to do it?\n          \n          ALEX\n          I thought we all were.\n          \n          JULIET\n          I don't thinkI can.\n          \n          ALEX\n          But you're a doctor. You kill people every day.\n          \n          JULIET\n          I don't want to. It's different.\n          \n          ALEX\n          And now you tell me.\n          \n          INT. UNDER WATER/BATHROOM. NIGHT\n          \n          A Man's face is being held under water. Bubbles escape from his \n          mouth and his eys bulge.\n          \n          Tim hauls the Man's head out of the bath. His legs and arms are \n          bound with cord. Andy sits on a chair, watching.\n          \n          Tim ducks the Man's head under the water again.\n          \n          The Man's face as before.\n          \n          INT. HUGO'S ROOM. NIGHT\n          \n          We see Hugo's face just before Alex, David and Juliet wrap him in \n          a sheet and thick, black plastic. They wear masks over their \n          noses. The smell is making them uncomfortable and irritable.\n          \n          DAVID\n          There's something I want to ask.\n          \n          INT. BATHROOM. NIGHT\n          \n          The Man's head has just been lifted from the water.\n          \n          MAN\n          I don't know. I swear to God, I don't know.\n          \n          Tim ducks the Man's head back under the water.\n          \n          INT. HUGO'S ROOM. NIGHT\n          \n          ALEX\n          (angry through his mask)\n          Family? Family? Friends? Drugged-up wandering suicidal search of \n          the self fuck-ups don't have families, David.\n          \n          DAVID\n          I just thought we should discuss it.\n          \n          ALEX\n          Take his legs.\n          \n          INT. STAIRWELL. NIGHT\n          \n          In the stairwell of the flat, grunts of effort are heard as Alex, \n          David and Juliet struggle with the heavy corpse, carrying it down \n          the stairs wrapped in plastic sheeting. They come into view and \n          go down the stairs. They are all very tense and freeze with panic \n          after accidentally banging against another flat's door. They \n          swear at one another and continue theri descent.\n          \n          INT. BATHROOM. NIGHT\n          \n          Tim is ducking the Man again. He writhes and struggles but is \n          powerless to stop it.\n          \n          EXT. BEHIND THE FLAT. NIGHT\n          \n          The back yard and back door of the flats. The door opens and \n          Alex, David and Juliet emerge, carrying the corpse out towards \n          the van.\n          \n          INT. LANDING OUTSIDE THE BATHROOM. NIGHT\n          \n          From the landing we can see along the floor into the bathroom. \n          The Man's legs extend away from the bath. They are completely \n          still. Andy and Tim stand beside them, looking down.\n          \n          ANDY\n          You stupid bastard.\n          \n          INT. VAN. NIGHT\n          \n          Inside the back of the empty van. The door is opened and the body \n          is half slid and half thrown inside. The door is closed and in \n          the dark interior, the outline of the plastic lump is just \n          visible, thanks to a streetlight. One of the doors opens again \n          and David throws a bag of tools in. He then closes and locks the \n          door.\n          \n          INT. VAN. NIGHT\n          \n          In front of the van, David is climbing into the passenger side. \n          Juliet and Alex are already in, with the latter at the wheel. \n          Alex turns to the other two.\n          \n          ALEX\n          Why don't we just draw lots for it?\n          \n          The other two remain silent.\n          \n          ALEX\n          (CONTINUED)\n          Whoever draws the short straw does it all. That way, you either \n          do it or you don't. All or nothing.\n          \n          JULIET\n          OK.\n          \n          ALEX\n          David?\n          \n          DAVID\n          I don't know.\n          \n          ALEX\n          Look, if I draw the short straw, then I'll do it, but I'm not \n          going to do it just because you won't.\n          \n          Alex starts the engine of the van.\n          \n          EXT. FOREST. NIGHT\n          \n          Through the darkness we hear an engine, then the headlights of \n          the van come into view.\n          \n          It pulls off the track onto a patch of grass. The engine is \n          switched off but the light remains on. The trio descend from the \n          van.\n          \n          In fron of the van, Alex, illuminated by its lights, Alex, David \n          and Juliet stand together. Alex is showing them two long stems of \n          grass and one short one. He encloses them in his fist and holds \n          them out.\n          \n          ALEX\n          All right, then, here we are and this is it. Do you want to play \n          or not?\n          \n          Alex holds his hand out towards Juliet, who takes the tip of one \n          of the stems. It is one of the larger ones.\n          \n          Alex and Juliet turn to David. Alex holds out the stems. David \n          reaches out and takes one of the tips. It is the short straw.\n          \n          DAVID\n          I can't do it.\n          \n          EXT. FOREST. NIGHT\n          \n          Deeper in the forest, with the headlamps still casting a little \n          light throught the trees, we see David's head and shoulders. His \n          right arm is moving briskly back and forth accompanied by a \n          vicious sawing noise. The sawing stops as he evidently finished \n          with one extremity. He shuffles back and starts sawing at \n          another.\n          \n          Alex leans against the spade in a shallow pit that he has dug. He \n          observes David impassively. The sawing stops again.\n          \n          DAVID\n          Finished.\n          \n          ALEX\n          But not quite.\n          \n          DAVID\n          Is that going to be deep enough?\n          \n          Alex bends down to pick up the hammer, which he holds out towards \n          David.\n          \n          ALEX\n          Don't you worry about that.\n          \n          DAVID\n          Is this necessary?\n          \n          ALEX\n          Yes. Now come on, all or nothing.\n          \n          Most reluctantly, David takes the hammer and looks at Alex, who \n          gestures as if to say, \"On you go.' With revulsion on his face, \n          he raises the hammer above his head.\n          \n          INT. DAVID'S ROOM. DAY\n          \n          David's face is visible against the plain white backdrop of his \n          pillow.\n          \n          He lies fully clothed on his bed, looking up at the ceiling. \n          There is a knock at the door, then Juliet walks in.\n          \n          JULIET\n          Are you all right?\n          \n          DAVID\n          (without looking at Juliet)\n          Oh, yes, I'm fine, thanks, just fine.\n          \n          JULIET\n          Would you like to talk about it?\n          \n          DAVID\n          No.\n          \n          INT. LIVING ROOM. DAY\n          \n          Alex sits with his feet up watching a noisy game show, while \n          eating a snack and drinking from a can of beer. Newspapers lie \n          scattered at his feet.\n          \n          INT. LOFT. DAY\n          \n          The loft above the flat in darkness, but the trapdoor is opened, \n          letting in a pool of light.\n          \n          INT. HALL. DAY\n          \n          David is pulling himself through the trapdoor up into the loft. \n          Beneath him is a stepladder. Juliet stands half-way up the \n          ladder, while Alex stands on the floor beside it. As David enters \n          the loft, Alex hands up the bag of money to Juliet, who passes it \n          on up to David.\n          \n          JULIET\n          Be careful.\n          \n          ALEX\n          Yeah, we don't want another stiff on our hands. Don't fall \n          through the ceiling. OK? Is he listening to me?\n          \n          JULIET\n          Stop nagging.\n          \n          ALEX\n          (to himself)\n          I don't know why we couldn't stuff it in a mattress or put it \n          under the floor like any normal human being. We could have hid it \n          in the fridge.\n          \n          INT. LOFT. DAY\n          \n          David moves on into the dark cavernous loft, edging his way \n          across beams and pipes. There are no skylights.\n          \n          He stops and leans against some structure (the water tank). He \n          strains to see in the darkness.\n          \n          Suddenly there is a loud sucking and flowing noise as water \n          empties from the water tank. David is startled and steps forward, \n          tripping. He reaches out as he falls, striking a light switch. \n          Briefly the loft is illuminated: David blinking as he lies across \n          some beams, the large cavernous area, the pipes, the water tank, \n          the bag of money lying between two rafters, and then the old \n          brass switches beginning to spark and the light goes out.\n          \n          David scrambles towards the trapdoor.\n          \n          INT. HUGO'S ROOM. DAY\n          \n          Now clean and empty, with no trace of recent habitation.\n          \n          INT. HOSPITAL. DAY\n          \n          In a basement corridor in the hospital, pipes run along the \n          ceiling. Above a fenced-off area is a sign saying For \n          Incineration Only -- No Aerosols'. On the floor of this area are \n          yellow plastic sacks. Juliet appears around a corner carrying one \n          of these. Quite casually the clumps it on the pile and continues \n          past.\n          \n          EXT. QUARRY. EVENING\n          \n          Alex pushes a blue car into a quary.\n          \n          INT. SUBURBAN LOCK-UP GARAGE. NIGHT\n          \n          In the garage there is a car, gardening equipment, several sacks \n          of fertilizer and a trunk-style deep freeze, on the lid of which \n          sit Andy and Tim. Tim takes out a cigarette and offers one to \n          Andy, who declines.\n          \n          They slide off the deep freeze and open it.\n          \n          Inside the freezer there is a man, naked and bound with cord. \n          They lift him up. He is very cold and weak.\n          \n          The Man begins to whisper inaudibly. Andy moves his head so that \n          he can hear the whisper. He listens, then nods approvingly.\n          \n          They push him down again and close the lid. Andy holds the lid \n          while Tim dumps the sacks of fertilizer on top.\n          \n          INT. CHARITY BALL. NIGHT\n          \n          Alex, David and Juliet are attending a charity ball. Everyone is \n          dressed very smartly, in ball gowns and black ties with the \n          addition of a significant number of kilts.\n          \n          Neither Alex nor David wears a kilt. The trio seem to know a \n          number of people there but do not seem especially keen to speak \n          to them.\n          \n          A middle-aged, podgy, mustachioed Master of Ceremonies is \n          standing on a platform in front of the band, making a speech to \n          the diners who are still sat at their tables.\n          \n          MC\n          Ladies and gentlemen, may I have your attention please. First of \n          all, may I thank you all for coming along tonight and supporting \n          our appeal to raise funds for the sick children's unit.\n          \n          There is a quick drum roll and applause breaks out. We move to \n          the table where Alex, David and Juliet are seated. Alex leans \n          across to Juliet.\n          \n          ALEX\n          You didn't tell me that this was for children. I hate children. \n          I'd raise money to have the little fuckers put down.\n          \n          Some other guests around the table cast critical glances at Alex.\n          \n          JULIET\n          Sshh.\n          \n          ALEX\n          I want my money back. Excuse me.\n          \n          Alex signals to the waiter by lifting his hand and snapping his \n          fingers, then indicates another bottle of champagne that already \n          ists in front of him.\n          \n          MC\n          For all too often there's a complacency: out of sight, out of \n          mind, let someone else bother about these things.\n          \n          Alex cheers once and starts to applaud on his own. Juliet nudges \n          him viciously.\n          \n          MC\n          (CONTINUED)\n          But just before the dancing, I'd like to say a special thank-you \n          to a few of the people who've worked so very hard to make this \n          occassion happen.\n          \n          The MC's drone continues in the background while conversation \n          continues back at the table.\n          \n          DAVID\n          Do you know many of these people?\n          \n          JULIET\n          Yes. They're my friends.\n          \n          ALEX\n          I see, so if they want to talk to you, we say you're not in.\n          \n          MC\n          And now, ladies and gentlemen, and those of you who are neither \n          or both --\n          \n          Drum roll.\n          \n          MC\n          (CONTINUED)\n          -- would you make your way to the floor for Strip the Willow.\n          \n          JULIET\n          Are we going to dance?\n          \n          ALEX\n          Well, it's physical contact, isn't it?\n          \n          INT. DANCE FLOOR. NIGHT\n          \n          The dance floor a few minutes later. It is packed and rather \n          chaotic. Sweaty, dishevelled dancers sling one another around, \n          with the thud of flesh against flesh. Toes are stood on and \n          jackets discarded.\n          \n          Juliet dances with Alex, who plunges in with the maximum of \n          violence, eventually tripping up and tumbling forcefully among \n          the other dancers.\n          \n          He starts to get up, then rests his head back against the floor.\n          \n          David has not been dancing. Instead he remains at their table and \n          at the bar, drinking steadily and watching the other two.\n          \n          INT. TABLE. NIGHT\n          \n          Back at the table, while most people are still on the dnace \n          floor, the trio sit drinking and Alex smokes a cigar.\n          \n          ALEX\n          That was good.\n          \n          DAVID\n          Can we talk about something?\n          \n          ALEX\n          Not now. I have an idea.\n          \n          Alex pours champagne on to a stack of glasses.\n          \n          DAVID\n          Listen, it's important. We need to talk about what we're going to \n          do --\n          \n          ALEX\n          Just stop worrying.\n          \n          Alex stands and raises his glass.\n          \n          ALEX\n          (CONTINUED)\n          Love and happiness for ever.\n          \n          JULIET\n          For ever and ever.\n          \n          Alex drinks, then puts his glass down. Juliet drinks but does not \n          drain her glass. David sits still.\n          \n          ALEX\n          What's the problem?\n          \n          DAVID\n          I want to talk now.\n          \n          ALEX\n          After you drink to love and happiness forever.\n          \n          DAVID\n          Now.\n          \n          ALEX\n          After.\n          \n          JULIET\n          David, I promise we will. Keep him happy.\n          \n          ALEX\n          It's not for me. It's for love and happiness forever.\n          \n          David reaches out to take his glass. Suddenly, Alex flings an arm \n          out to point, knocking over David's glass and completely losing \n          interest.\n          \n          ALEX\n          (CONTINUED)\n          Look over there. It's Cameron.\n          \n          JULIET\n          Who?\n          \n          ALEX\n          Cameron. You remember Cameron.\n          \n          JULIET\n          No, I don't.\n          \n          ALEX\n          What's he doing here?\n          \n          JULIET\n          That's not him.\n          \n          ALEX\n          Yes, it is. It's him. Cameron, Cameron, come on over.Yo!\n          \n          From some distance away, Cameron becomes aware of Alex and \n          cautiously makes his way across until he stands a few feet from \n          the table.\n          \n          CAMERON\n          What?\n          \n          ALEX\n          Nothing. We thought you were someone else.\n          \n          Alex falls forward, laughing, and the other two also laugh as \n          Cameron walks away, humiliated again.\n          \n          ALEX\n          (CONTINUED)\n          Good luck. I love that guy, but why does he have to follow us \n          around?\n          \n          DAVID\n          Anyway, what I was wanting to say was this --\n          \n          BRIAN\n          (UNSEEN)\n          The divine Juliet. Long time no see.\n          \n          Brian approaches and is standing behind their table.\n          \n          JULIET\n          Brian.\n          \n          BRIAN\n          Would you care to dance?\n          \n          DAVID\n          Hold on there. Who do you think you are?\n          \n          BRIAN\n          What?\n          \n          DAVID\n          Who do you think you are? You interrupted us.\n          \n          BRIAN\n          I'm Brian McKinley, and who are you?\n          \n          DAVID\n          Well, Brian McKinley, if you want to talk to my girlfriend, you \n          talk to me first. If you want to dance with her, then you apply \n          in writing three weeks in advance or you're gonna end up insode a \n          fucking bin-bag. You didn't apply, so you don't dance.\n          \n          Shocked and frightened, Brian backs away, then turns around to \n          complete his departure. Juliet restrains David with a touch as \n          they watch him go.\n          \n          JULIET\n          Do you think you could be a little more forceful next time?\n          \n          DAVID\n          I'm sorry.\n          \n          JULIET\n          It's alright. I think he got the message anyway.\n          \n          DAVID\n          That was stressful. I found that stressful.\n          \n          ALEX\n          Yeah, but you were good, you were really good. Fucking bin-bag', \n          I liked that. You were good. You explored your maleness to the \n          full there.\n          \n          DAVID\n          You think so?\n          \n          JULIET\n          Well, you certainly had a good look around.\n          \n          ALEX\n          You were magnificent.\n          \n          INT. TOILETS. NIGHT\n          \n          The gents' toilet. Brightly-lit and white-tiled. Alex walk in and \n          goes into a cubicle and closes the door. We hear him whistling \n          and laughing as he passes urine. He keeps muttering bin-bag' to \n          himself. Then he flushes the toilet and opens the door. As he \n          does so a look of surprise appears on his face as he sees someone \n          waiting for him.\n          \n          ALEX\n          Cameron! What a surprise.\n          \n          As Alex is speaking Cameron's fist flies forward, hitting him in \n          the face and sending him flying backwards. Cameron enters the \n          cubicle and closes the door behind him.\n          \n          INT. HALL. MORNING\n          \n          Mail falls through the letter box.\n          \n          INT. KITCHEN. MORNING.\n          \n          Alex does not stir.\n          \n          INT. HALL. MORNING\n          \n          David emerges from his room, ready for his work. He looks towards \n          the kitchen, then walks to the door and opens it.\n          \n          INT. KITCHEN. MORNING\n          \n          We hear the main door closing as David leaves. Alex jolts with \n          energy with every sound. The telephone begins to ring. Juliet \n          looks at Alex expectantly, but he does not move. Eventually she \n          gets up and answers it.\n          \n          JULIET\n          Hello. Hello.\n          \n          ALEX\n          Who was it?\n          \n          JULIET\n          Don't know. No one said anything.\n          ALEX\n          Rendered speechless with desire. I recall that feeling, from the \n          days when I had such a thing.\n          \n          JULIET\n          Are you all right?\n          \n          ALEX\n          No.\n          \n          JULIET\n          Then let's spend some money.\n          \n          INT. FLAT. DAY\n          \n          There follows a video depicting the results of Alex's and \n          Juliet's spending spree. It opens with Alex seated at the kitchen \n          table talking to the camera, absolutely deadpan.\n          \n          ALEX\n          Hello. It's been a struggle, but now the days of worry are over, \n          the light at the end of the tunnel has expanded into a golden \n          sunrise and at last, at long last, nothing will ever be the same \n          again.\n          \n          Alex leans out and the camera foloows him as he presses the play \n          button on a tape recorder. The music begins.\n          \n          Fast cuts follow, occasionally interrupted by out-of-focus shots \n          of the floor or ceiling as the camera swivels round and is \n          switched on and off.\n          \n          Alex wearing several different suits, outfits and silk pyjamas.\n          \n          Juliet wearing several different outfits.\n          \n          Both of them posing with small objets d'art.\n          \n          The expensive watch on Alex's wrist.\n          \n          Juliet's jewellery.\n          \n          Expensive toys.\n          \n          Juliet takes a picture of Alex with a Polaroid camera.\n          \n          Alex holds the camcorder out at arm's length in order to film \n          himself and turns to the camera and adjusts his tie.\n          \n          ALEX\n          (CONTINUED)\n          This is Alex Law reporting from the scene of his own life, and \n          you know, I'm so happy I could die.\n          \n          Darkness. TV. Turned off.\n          \n          INT. LIVING ROOM. DAY\n          \n          The music has stopped.\n          \n          David presses the eject button and lifts the video from the \n          player.\n          \n          Alex and Juliet are seated on the sofa, surrounded by their \n          acquisitions, and are evidently a little embarrassed. Juliet is \n          holding the Polaroid of Alex.\n          \n          DAVID\n          I think we ought to scrub this, don't you?\n          \n          David reinserts the tape and presses record.\n          \n          ALEX\n          Will you calm down.\n          \n          JULIET\n          Yeah, you're making us all nervous.\n          \n          David picks up the Polaroid of Alex and throws it down, then \n          picks up a vase.\n          \n          DAVID\n          How much did you pay?\n          \n          ALEX\n          I don't know.\n          \n          DAVID\n          How much did you pay?\n          \n          ALEX\n          I don't know.\n          \n          DAVID\n          How much?\n          \n          ALEX\n          I don't know.\n          \n          JULIET\n          Two hundred.\n          \n          DAVID\n          Two hundred pounds?\n          \n          JULIET\n          Two hundred pounds.\n          \n          DAVID\n          You paid two hundred pounds for this?\n          \n          JULIET\n          That's what it cost, David.\n          \n          DAVID\n          No, no, no. That's what you paid for it. Two hundred pounds is \n          what you paid for it. We don't know what it cost us yet, for you \n          two to have a good time, we don't know the cost of that yet.\n          \n          From out in the hall, the phone starts to ring. Nobody moves.\n          \n          INT. DAVID'S ROOM. NIGHT\n          \n          David lies awake in his bed.\n          \n          INT. A FLAT HALLWAY. NIGHT\n          \n          Hearing the noise, David sits up in bed, then gets out, reaching \n          for his clothes.\n          \n          INT. STAIRWELL. NIGHT\n          \n          David looks down the stairwell. Other neighbours, in nightclothes \n          or hurriedly dressed, are standing at the open door of the flat \n          below. David descends the the stairs and looks into the hall of \n          the other flat where the occupant, an Elderly Woman, lies \n          groaning on the floor.\n          \n          A hand on David's shoulder pushes him out of the way and two \n          uniformed policemen walk past, followed by an ambulance man \n          carrying a stretcher.\n          \n          DAVID\n          Did they take anything? Did they take anything?\n          \n          No one acknowledges his question or answers it.\n          \n          The ambulance men emerge carrying the woman, her face bruised and \n          cut. Everyone else begins to melt away.\n          \n          INT. STAIRWELL. NIGHT\n          \n          David stands alone on the darkened stairwell.\n          \n          INT. DAVID'S ROOM. NIGHT\n          \n          David lies awake in his bed.\n          \n          INT. DOOR OF THE FLAT. DAY\n          \n          Someone attempts to open the door but cannot because there are \n          two new security chains on the inside. The door is forced against \n          the chains with no success and Alex calls from the other side.\n          \n          ALEX\n          What is this? What is going on? David!\n          \n          David approaches the door.\n          \n          DAVID\n          I'll let you in.\n          \n          David closes the door and looks through a new spyhole to see Alex \n          grinning at him while he releases the chains and then opens the \n          door again. Alex walks in.\n          \n          ALEX\n          What is this?\n          \n          DAVID\n          Security.\n          \n          DAVID\n          From what? Jehovah's Witnesses?\n          \n          DAVID\n          There was a break-in.\n          \n          ALEX\n          Downstairs, I know. Pensioner's terror ordeal: page six.\n          \n          Alex hands David a rolled-up newspaper.\n          \n          DAVID\n          Doesn't it worry you?\n          \n          ALEX\n          No, it doesn't. I tried to let it worry me but it won't. I've \n          worked on that paper for three years. There is a pensioner's \n          terror ordeal on page six every day. Every day. Maybe when I'm a \n          pensioner it'll worry me.\n          \n          Alex notices some more tools and the stepladder leading up to the \n          trapdoor.\n          \n          ALEX\n          (CONTINUED)\n          What's all this for, more security?\n          \n          DAVID\n          I fitted a lock up there. On the inside.\n          \n          ALEX\n          Oh, that'll come in useful.\n          \n          INT. KITCHEN. NIGHT\n          \n          Alex is serving on plates from a large bowl of pasta.\n          \n          David and Juliet sit at the tabel.\n          \n          JULIET\n          Is this the same stuff you made last week?\n          \n          ALEX\n          No, no, it's different.\n          \n          JULIET\n          I hope it tastes better than the other stuff.\n          \n          ALEX\n          It tastes different.\n          \n          JULIET\n          I don't want it to taste different. I don't know why I bother. Is \n          that enough for you? Hey!\n          \n          DAVID\n          What? Yes, that's fine.\n          \n          ALEX\n          You're sure? There's lots more.\n          \n          DAVID\n          No, I'm sure, that'll be enough.\n          \n          ALEX\n          What's wrong?\n          \n          DAVID\n          Nothing.\n          \n          ALEX\n          You're not eating.\n          \n          DAVID\n          Not eating what?\n          \n          ALEX\n          Not eating like you used to, that's what.\n          \n          DAVID\n          If you give me the plate, I'll eat.\n          \n          Alex hands him the plate and he starts to eat. Alex watches him \n          chew a mouthful.\n          \n          ALEX\n          Now swallow.\n          \n          David does so.\n          \n          ALEX\n          (CONTINUED)\n          You know, you should spend some of that money instead of worrying \n          about it. That's my advice.\n          \n          JULIET\n          He's right. You'd feel much better about it.\n          \n          David has stopped eating.\n          \n          ALEX\n          Once it's spent you won't have to worry about it.\n          \n          JULIET\n          Be like a weight off your shoulders.\n          \n          ALEX\n          You know we're right.\n          \n          JULIET\n          Don't you?\n          \n          DAVID\n          I want to secure it.\n          \n          ALEX\n          Secure it? What do you mean -- you're gong to take it to a bank? \n          You're not going to take it to a bank? You're not going to take \n          it to a bank Or what, you want to bury it? Is that it?\n          \n          JULIET\n          I don't see the point in that.\n          \n          ALEX\n          Because that's no good. Remember, we did what we did, we took the \n          money. It was a material calculation. But what's the use if it's \n          underground, or in some funny bank in some funny place? If you \n          can't spend it, if you can't have it, what use is it? None. It's \n          nothing, all for nothing, if you do that. I didn't get into this \n          for nothing, so that I could have nothing --\n          \n          DAVID\n          Yeah, and you didn't saw his feet off.\n          \n          There is silence. David resumes eating.\n          \n          DAVID\n          (CONTINUED)\n          It tastes different.\n          \n          INT. HALL. NIGHT\n          \n          Alex stands at the sink doing some washing up. He hears footsteps \n          from the loft above. He stops what he is doing and walks slowly \n          out ot the hall.\n          \n          INT. LOFT. NIGHT\n          \n          In the darkness we can just make out David's eyes as he sits in \n          darkness.\n          \n          ALEX\n          (calling from below)\n          David, David, what are you doing up there?\n          \n          The torch goes on. David lifts the bag of money from between the \n          rafters. He puts it inside another thick yellow plastic bag, \n          which he ties tightly with string.\n          \n          David opens the water tank.\n          \n          Alex's voice can be heard throughout.\n          \n          ALEX\n          (continued; calling from below)\n          Will you come down now. It's not safe up there. Are you listening \n          to me. Security and insanity are not the same thing.\n          \n          INT. HALL. NIGHT\n          \n          ALEX\n          Shit.\n          \n          INT. KITCHEN. NIGHT\n          \n          Juliet sits drinking coffee, while Alex sands in the doorway \n          looking up towards the trapdoor.\n          \n          JULIET\n          Leave him alone.\n          \n          ALEX\n          He can't stay up there.\n          \n          JULIET\n          He'll come down. Leave him alone.\n          \n          ALEX\n          Yeah, he's got to go to work, hasn't he? You think he'll come \n          down for that?\n          \n          JULIET\n          No, but he's looking after the money, so what's the problem?\n          \n          ALEX\n          Looking after it -- he's probably fucking well eating it.\n          \n          INT. HOSPITAL. DAY\n          \n          Juliet looks through the door from a small office out into the \n          main waiting area in the casualty departmet. It is busy and there \n          are rooms of people nursing injuries waiting to be seen. More \n          file past the door while she watches with no enthusiasm.\n          \n          INT. HALL. DAY\n          \n          The trapdoor opens. David's head appears. He looks around and \n          listens carfeully.\n          \n          INT. LUMSDEN'S OFFICE. DAY\n          \n          Lumsden answers his telephone.\n          \n          INT. HALL. DAY\n          \n          David speaks on the telephone.\n          \n          DAVID\n          It's my mother, sir, she's very ill and I think I need to be with \n          her just now. I don't know. The doctors aren't sure. It could go \n          either way. Yes, sir, I'll certainly stay in touch.\n          \n          INT. BATHROOM. DAY\n          \n          David shaves carefully with a safety razor.\n          \n          INT. KITCHEN. DAY\n          \n          Bacon and eggs fry in a pan. David attends to them while drinking \n          from a large tumbler of orange juice.\n          \n          INT. HOSPITAL. DAY\n          \n          A Sister hands Juliet a casualty case sheet. Juliet reads it.\n          \n          JULIET\n          Painful groin? What does that mean?\n          \n          SISTER\n          I don't know. He wouldn't show me.\n          \n          Juliet draws back the curtain of a cubicle. Alex is sitting on a \n          trolly. \n          ALEX\n          Boy, am I glad to see you.\n          \n          JULIET\n          What are you doing here?\n          \n          ALEX\n          We have to talk.\n          \n          JULIET\n          Your painful groin?\n          \n          She turns and walks away. Alex chases after her.\n          \n          ALEX\n          Later. But first -- him.\n          \n          JULIET\n          David?\n          \n          ALEX\n          Exactly. Now I've been thinking --\n          \n          JULIET\n          Oh, good.\n          \n          ALEX\n          He won't do anything for me, but for you --\n          \n          JULIET\n          Forget it.\n          \n          ALEX\n          He isn't safe up there. If you really cared about him, you'd use \n          your influence to get him down, then he'd be safe.\n          \n          JULIET\n          And the money?\n          \n          ALEX\n          We could put it somewhere.\n          \n          JULIET\n          Where he can't get it?\n          \n          ALEX\n          Now you thought of that, not me.\n          \n          JULIET\n          Forget it -- he'll come down.\n          \n          Juliet walks away.\n          \n          INT. HALL. DAY\n          \n          The hall is empty and the flat is silent. We see the trapdoor.\n          \n          INT. LOFT. EVENING\n          \n          David sits in the darkness. A crack of light penetrates beside \n          the trapdoor.\n          \n          INT. KITCHEN. NIGHT\n          \n          Alex and Juliet sit at the table, eating in silence.\n          \n          The doorbell rings. Alex and Juliet look at one another.\n          \n          ALEX\n          Expecting anyone?\n          \n          JULIET\n          No.\n          \n          ALEX\n          Oh.\n          \n          Alex resumes eating.\n          \n          JULIET\n          Aren't you going to answer it?\n          \n          ALEX\n          Well, I'm not expecting anyone either.\n          \n          Juliet glares at him.\n          \n          INT. HALL. NIGHT\n          \n          Alex approaches the door and is about to open it. At the last \n          moment he checks himself and looks through the spyhole.\n          \n          INT. THROUGH THE SPYHOLE. NIGHT\n          \n          Tim and Andy stand outside the door.\n          \n          INT. HALL. NIGHT\n          \n          Alex, slightly puzzled, fixes the security chains before opening \n          the door. As soon as he opens it, the door is kicked wide open as \n          the security chains break off. Tim and Andy enter the flat.\n          \n          In a whirlwind of force they drag and shove Alex and Juliet into \n          the living room and bind them up with cord. There are no words \n          apart from slightly muffled cries.\n          \n          At the end of this Andy stands in front of Alex holding a \n          crowbar. Swiftly and without warning, he cracks it across Alex's \n          shins. Then Andy slowly puts one one end of the crowbar into \n          Alex's mouth. For a moment he does nothing, then just as slowly \n          again, he takes the crowbar out.\n          \n          ALEX\n          It's in the loft.\n          \n          INT. HALL. NIGHT\n          \n          The trapdoor is closed but the sound of it being unlocked can \n          just be heard (although not by anyone in the flat.\n          \n          INT. HALL. NIGHT\n          \n          Tim pulls the ladder across to the trapdoor.\n          \n          INT. LOFT. NIGHT\n          \n          It is completely dark in the loft, but as the trapdoor opens a \n          shaft of light strikes upwards and illuminates a small pool \n          around the opening.\n          \n          INT. LOFT. NIGHT\n          \n          Away from the trapdoor there appears to be a wall of uniform \n          darkness, but then we see a pair of eyes in the darkness. It is \n          David. He stands perfectly still.\n          \n          There is a hammer in his right hand.\n          \n          INT. LOFT. NIGHT\n          \n          Tim's head appears through the trapdoor. Cautiously he lifts \n          himself through and balances on the beams.\n          \n          INT. HALL. NIGHT\n          \n          The hall is empty, but we can see the open trapdoor. Suddenly \n          there is a single thud, as might be caused by a body landing \n          heavily on and across some beams in the loft.\n          \n          INT. LOFT. NIGHT\n          \n          David stands motionless in the dark, exactly as before.\n          \n          INT. LIVING ROOM. NIGHT\n          \n          Andy has heard the single thud. He strains to hear anything else \n          but does not. Slowly he backs away to the door of the living \n          room, keeping the crowbar trained on Alex as he does so. He looks \n          back and up towards the trapdoor.\n          \n          INT. LOFT. NIGHT\n          \n          Once again a small pool of light emanates from the open trapdoor. \n          Andy emerges into the front of this, crowbar in hand, peering \n          into the darkness. Carefully he stands up and moves out of the \n          light and steps across the beams. His foot strikes something and \n          he looks down. Tim's body lies spread-eagled beneath him. He \n          looks up. To one side of him is the brass light switch. Andy \n          lifts his arm, reaches towards it and switches it on. Sparks pour \n          out for a moment and then the light comes on for a fraction of a \n          second, long enough for Andy to see David's face is only \n          centimetres from his own.\n          \n          INT. HALL. NIGHT\n          \n          Alex and Juliet are bound together as before. There is a loud \n          thud from the ceiling, following by a few heavy steps. Then \n          Andy's body falls headfirst through the trapdoor, straight down \n          to the floor below, landing awkwardly and coming to rest with his \n          head hanging back, looking towards Alex and Juliet. Andy takes \n          one agonal breath and dies. Blood trickles from the side of his \n          mouth.\n          \n          Tim's body lands on Andy.\n          \n          David drops himself from the hatch to the floor.\n          \n          David takes a large knife from a wooden block.\n          \n          Back in the hall he kneels, holding the knife, beside Tim. \n          Noticing something at the top of tim's neck, he uses the knife to \n          lift away Tim's T-shirt. A tattoo covers Tim's neck. David looks \n          at it, then stands up.\n          \n          He walks through to the living room, where Alex and Juliet, still \n          bound, watch him approach. He looks at them for a moment, then \n          extends the knife and cuts the cord in one place.\n          \n          EXT. FOREST. NIGHT\n          \n          In a scene similar to the dismemberment of Hugo, we see David's \n          shoulders as he saws back and forth at something unseen. He stops \n          and reaches out for the hammer, picks it up and raises it above \n          his head.\n          \n          EXT. ROAD. DAWN\n          \n          The van is silhouetted against a rising sun.\n          \n          INT. BACK OF THE VAN. DAWN\n          \n          The tools and the yellow sack slide about in the back of the van.\n          \n          INT. VAN. DAWN\n          \n          David is driving. Alex and Juliet are huddled silently away from \n          him. David seems quite at ease.\n          \n          A thick bunch of keys dangles from the ignition. Juliet observes \n          them.\n          \n          INT. LOFT. DAY\n          \n          David sits still in the darkness.\n          \n          INT. NEWSPAPER OFFICE. DAY\n          \n          Alex sits at his desk fidgeting, about to write something but \n          unable to start. On the screen of his word processor is a page \n          mock-up with the headline CATS EAT PENSIONER'. As the telephone \n          on his desk rings, he is startled, then reaches out, slowly lifts \n          it fractionally and replaces it.\n          \n          INT. TRAVEL AGENT'S. DAY\n          \n          Hunched over a VDU, the Salesman is offering Juliet a range of \n          flights.\n          \n          SALESMAN\n          October 15th, direct flight, London Heathrow to Rio de Janeiro, \n          British Airways, you are looking at seven hundred and sixty-five \n          pounds. Seven six five.\n          \n          JULIET\n          That sounds fine.\n          \n          SALESMAN\n          Air Portugal, on the other hand, via Lisbon, same day, five \n          hundred and sixty-five. Five six five. It's up to you. Catering \n          important?\n          \n          JULIET\n          What?\n          \n          SALESMAN\n          Air France. Glasgow. Direct, but then you're looking at the wrong \n          end of nine hundred and twelve pounds. That's nine one two. It's \n          up to you.\n          \n          JULIET\n          Yes, the first one's fine. Heathrow direct.\n          \n          SALESMAN\n          It's up to you. Air Patagonia. New outfit: via Caracas and Bogot \n          . No catering. Four hundred and eleven pounds. Four one one. Good \n          value, but refueling at Bogot is variable.\n          \n          JULIET\n          The first one was fine.\n          \n          SALESMAN\n          Well, it's up to you. Seven six five. How will you be paying?\n          \n          INT. HALL. NIGHT\n          \n          The hall is empty but we can hear David's footsteps on the beams \n          above.\n          \n          INT. LIVING ROOM. NIGHT\n          \n          Alex sits watching The Wicker Man on televison. He can hear the \n          footsteps above. He turns the sound up on the television so that \n          he cannot hear them, but he keeps looking up at the ceiling, as \n          though he expects to hear them or see somwthing.\n          \n          Eventually he turns the sound back down and, after a moment's \n          silence, the footsteps start again, back and forth, then stop.\n          \n          Alex looks up.\n          \n          Without warning there is the sound of an electric drill.\n          \n          The blade of the drill appears through the ceiling and is then \n          withdrawn. Alex is shocked. Other drill holes appear.\n          \n          INT. VARIOUS CEILINGS. NIGHT\n          \n          Holes are drilled in the ceilings.\n          \n          INT. LOFT. NIGHT\n          \n          Rods of light penetrate up from the holes, interrupting but not \n          obliterating the darknes. David sits back, pleased with his work.\n          \n          INT. JULIET'S ROOM. NIGHT\n          \n          Juliet sits at her desk. Alex stands in the doorway. He is about \n          to speak. Juliet raises a finger to her lips. They both look at \n          the ceiling.\n          \n          EXT. GARDEN AT FRONT OF THE FLAT. NIGHT\n          \n          Establishing shot of Alex and Juliet in garden.\n          \n          INT. HALL. NIGHT\n          \n          The trapdoor is open.\n          \n          INT. ALEX'S ROOM. NIGHT\n          \n          David is searching through Alex's desk, looking through letters \n          and folders, then shoving them back into drawers.\n          \n          EXT. GARDEN AT THE FRONT OF THE FLAT. NIGHT\n          \n          ALEX\n          No, definitely not. And that's that. I refuse to discuss it \n          further.\n          \n          JULIET\n          It's the only way.\n          \n          ALEX\n          I refuse.\n          \n          JULIET\n          You're frightened.\n          \n          ALEX\n          No, I'm not frightened. A little terrified maybe. Did you see \n          what happened to the last two who tried that? They went up alive \n          and they came down dead -- the difference, I mean, alive dead \n          dead alive, that sort of thing. It wasn't difficult to spot. He \n          killed them both: he cut them up.\n          \n          INT. JULIET'S ROOM. NIGHT\n          \n          David is now searching through Juliet's desk. He picks up a large \n          brown envelope and looks into it. Beneath it is the airline \n          ticket envelope.\n          \n          The doorbell rings.\n          \n          INT. THROUGH THE SPYHOLE. NIGHT\n          \n          McCall and Mitchell stand outside the door.\n          \n          INT. HALL. NIGHT\n          \n          David opens the door. McCall smiles.\n          \n          MCCALL\n          Good evening. I'm Detective Inspector McCall and this is DC \n          Mitchell. I wonder if we could ask you some questions.\n          \n          DAVID\n          What about?\n          \n          MCCALL\n          It's about the burglary.\n          \n          DAVID\n          Burglary?\n          \n          MCCALL\n          Downstairs.\n          \n          DAVID\n          Of course.\n          \n          MCCALL\n          Can we come in?\n          \n          INT. LIVING ROOM. NIGHT\n          \n          David sits on the sofa while the two policemen sit on armchairs \n          several feet apart.\n          \n          DAVID\n          So I just heard her cries for help and all that, and when I went \n          downstairs there were already those other people there, so I just \n          stood around really, waiting -- you know how people do -- and \n          then when your colleagues arrived I came back upstairs. And \n          that's about all, I think. I didn't actually see anything useful, \n          I don't think.\n          \n          MCCALL\n          did you hear anything before he cries?\n          \n          DAVID\n          No, not that I recall, I was asleep.\n          \n          MCCALL\n          Have you seen anything or anyone suspicious around here in the \n          last few days?\n          \n          DAVID\n          No, nothing, sorry.\n          \n          MCCALL\n          Well, if you do, you'll let us know?\n          \n          DAVID\n          Of course.\n          \n          MCCALL\n          And the other three people on the flat, did they hear anything?\n          \n          DAVID\n          There are only two other people in the flat. \n          \n          McCall consults a notebook.\n          \n          MCCALL\n          Two?\n          \n          DAVID\n          Who said there were four?\n          \n          MCCALL\n          We understood there were four people living here. Not always, of \n          course, but now, four.\n          \n          DAVID\n          No, three. Who said there were four?\n          \n          MCCALL\n          How strange. And how unsatisfactory to have misleading \n          information. Only three people here. You're sure?\n          \n          DAVID\n          Yes, absolutely.\n          \n          MCCALL\n          Take a note of that, Mitchell. Only three, rather than four. \n          Write it down. You can use numbers or words, I have no \n          preference. Which are you using?\n          \n          MITCHELL\n          Both, sir.\n          \n          MCCALL\n          Excellent. DC Mitchell is a rising star, Mr. Stevens. Under my \n          tutelage he will undoubtedly make the grade.\n          \n          DAVID\n          I see.\n          \n          MCCALL\n          I doubt it. And these two other people, did they hear anything?\n          \n          DAVID\n          No, they were asleep. They didn't even wake up.\n          \n          MCCALL\n          Yes. Why do you think you woke and they didn't?\n          \n          DAVID\n          I don't know. Maybe I'm a light sleeper.\n          \n          Uncomfortably, David realizes that Mitchell has noted down even \n          this last, trivial remark in a painful longhand and has \n          underlined a short segment of it.\n          \n          INT. HALL. NIGHT\n          \n          In the hallway of the flat Mitchell stands at the open main door, \n          waiting to leave. McCall is kneeling at the door to Hugo's room, \n          tracing his finger down the broken lintel and lock. David looks \n          on.\n          \n          MCCALL\n          Loks like you had a break-in up here as well.\n          \n          DAVID\n          Someone lost the key.\n          \n          McCall gently pushes the door open and the light from the hall \n          illuminates Hugo's room.\n          \n          MCCALL\n          Is this where no one stays?\n          \n          DAVID\n          Yeah, that's right, that's it.\n          \n          David notices that Mitchell is writing this down.\n          \n          INT. GARDEN AT FRONT OF THE FLAT. NIGHT\n          \n          ALEX\n          You'll wait in the hall?\n          \n          JULIET\n          I'll wait there.\n          \n          ALEX\n          And if it sounds like I'm being killed, you'll phone the police, \n          you'll tell them everything?\n          \n          JULIET\n          Everything.\n          \n          ALEX\n          Everything. Except maybe that it was his idea and not mine in the \n          first place. OK? That's important to me. I need to die \n          misunderstood. \n          \n          JULIET\n          Alex.\n          \n          ALEX\n          What?\n          \n          JULIET\n          As smart as you are, you'll need a little help.\n          \n          She hands Alex a Yale key. Alex stares at it.\n          \n          INT. LOFT. NIGHT\n          \n          In the darkness, the sound of the lock being turned is heard.\n          \n          INT. HALL. NIGHT\n          \n          Alex tsands at the top of the ladder, holding the key in the \n          trapdoor lock.\n          \n          ALEX\n          All right, David, what I'm going to do is, I'm going to open this \n          lock and I'm going to come up, and what's important is that you \n          remain calm.\n          \n          There is one light on. Juliet stands at the bottom of the ladder. \n          Having opened the trapdoor, Alex stops and listens, but there is \n          no sound above his own breathing. Juliet throws up a torch, which \n          he catches. He switches it on. It shines, then goes out, and he \n          knocks it against the ladder, making it work again. Slowly he \n          pushes the trapdoor open.\n          \n          INT. LOFT. NIGHT\n          \n          The trapdoor opens. Below it, Alex crouches on the ladder, \n          expecting attack at any moment. He looks back down to Juliet, who \n          returns his gaze, then he slowly raises himself into the loft.\n          \n          He turns around quickly, darting the torchlight around into \n          corners and squinting in the darkness, but he sees nothing.\n          \n          The torch goes out. Cursing, he knocks it against a beam and it \n          shines again.\n          \n          Slowly he moves further from the trapdoor into the centre of the \n          loft, still turning around and worried about what might be behind \n          him.\n          \n          INT. HALL. NIGHT\n          \n          Juliet stands waiting, braced for sounds of conflict.\n          \n          INT. LOFT. NIGHT\n          \n          Alex is still looking but has relaxed a little, feeling les in \n          danger. In one corner he notices David's pile of left-possessions \n          and the mat on which he has been sleeping. He moves towards it.\n          \n          INT. HALL. NIGHT\n          \n          Juliet stands, still waiting.\n          \n          INT. LOFT. NIGHT\n          \n          Alex stands in David's corner. With another sweep of the torch he \n          can still see nothing. He calls to Juliet.\n          \n          ALEX\n          He isn't up here.\n          \n          INT. HALL. NIGHT\n          \n          A close-up of Juliet's face, just as David's hand slams across \n          her mouth, gripping her tightly while his other hand clamps on \n          the back of her head. David's mouth is right up against her ear \n          as he spits a warning into it.\n          \n          DAVID\n          Tell him to look for the money.\n          \n          Slowly, David relaxes his grip on Juliet.\n          \n          JULIET\n          Look for the money.\n          \n          INT. LOFT. NIGHT\n          \n          Alex, cheerful now, is looking in the rafters.\n          \n          ALEX\n          Don't worry, that's what I'm doing.\n          \n          INT. HALL. NIGHT\n          \n          David holds Juliet across her face again. She is terrified and \n          does not struggle.\n          \n          DAVID\n          Expecting anyone?\n          \n          JULIET\n          What?\n          \n          DAVID\n          Were you expecting anyone? Tonight?\n          \n          JULIET\n          No.\n          \n          DAVID\n          Visitors? Some friends maybe? Someone you talked to?\n          \n          JULIET\n          No one. I promise.\n          \n          DAVID\n          Who have you talked to?\n          \n          JULIET\n          No one.\n          \n          DAVID\n          If I think you're lying --\n          \n          INT. LOFT. NIGHT\n          \n          Alex stands gazing around the loft.\n          \n          ALEX\n          (from the loft)\n          Well, it's not up here.\n          \n          INT. HALL. NIGHT\n          \n          David pulls Juliet to one side.\n          \n          INT. LOFT. NIGHT\n          \n          Alex is about to descend when he notices the water tank. He walks \n          over and lifts the lid. His face breaks into a smile as he \n          realizes what it holds. He dips an arm into the tank, raises the \n          yellow bag, then quickly lowers it again. Alex steps back from \n          the water tank.\n          \n          INT. HALL. NIGHT\n          \n          Alex appears at the top of the ladder. Without looking, he slides \n          down as quickly as he can, calling out as he does so.\n          \n          ALEX\n          Juliet, I have --\n          \n          Alex reaches the base of the ladder. He turns around to find \n          himself facing the blade of the battery-operated drill, held by \n          David. Juliet stands off to one side.\n          \n          ALEX\n          (CONTINUED)\n          -- a problem.\n          \n          David holds the drill even closer until it is almost touching the \n          centre of Alex's forehead and presses the trigger' to turn the \n          blade slowly as he speaks.\n          \n          Alex does not move at all.\n          \n          DAVID\n          You looking for me?\n          \n          ALEX\n          Looking for you? Yes.\n          \n          DAVID\n          What for? What did you want? The money? Was that it?\n          \n          ALEX\n          We just wanted to speak to you.\n          \n          Alex's hands and sleeves are wet. A few drops of water fall from \n          his fingertips. Unnoticed by the other two, he slowly wipes his \n          hands on the back of his jeans.\n          \n          DAVID\n          Who else have you wanted to speak to? Maybe you thought they'd \n          already got me.\n          \n          The blade os the drill scrapes Alex's skin.\n          \n          ALEX\n          Who?\n          \n          DAVID\n          Your friends.\n          \n          ALEX\n          I don't know what you're talking about.\n          \n          JULIET\n          He doesn't know David.\n          \n          David holds the drill back slightly while he thinks. It could go \n          either way.\n          \n          DAVID\n          Well, maybe you don't --\n          \n          David lowers the drill and smiles.\n          \n          DAVID\n          (CONTINUED)\n          I'm talking about the police.\n          \n          INT. ALEX'S ROOM. DAY\n          \n          Alex has just woken up. He rubs his forehead. There is a nick in \n          it, where the drill has scratched. He rubs at it and examines the \n          drop of blood on the end of his finger.\n          \n          INT. DAVID'S POINT OF VIEW. ALEX'S ROOM. DAY\n          \n          Looking down from a hole in the ceiling, we see into Alex's room, \n          where he is getting dressed.\n          \n          INT. HALL. DAY\n          \n          Alex leaves his room and enters the hall.\n          \n          INT. LOFT. DAY\n          \n          Looking down from a hole in the ceiling, we see into Alex's room, \n          where he is getting dressed.\n          \n          INT. LOFT/HALL. DAY\n          \n          Looking down on Alex as he leaves the flat and closes the door.\n          \n          INT. LOFT. DAY\n          \n          David scurries back across the beams to look down through another \n          hole. He looks for several seconds.\n          \n          NOTE In the following sequence, Juliet's face is not seen until \n          her comment on it. \n          INT. JULIET'S ROOM. DAY\n          \n          Juliet lies on her bed. She throws the covers back.\n          \n          INT. LOFT. DAY\n          \n          David is still looking down through the hole.\n          \n          INT. JULIET'S ROOM. DAY\n          \n          Juliet moves about her room. She is wearing a large, baggy T-\n          shirt.\n          \n          INT. LOFT. DAY\n          \n          David still watching.\n          \n          INT. JULIET'S ROOM. DAY\n          \n          Juliet's legs are seen as the T-shirt lands on the floor beside \n          them.\n          \n          INT. LOFT. DAY\n          \n          David sits back suddenly, recoiling from the activity. He \n          scrambles back across to his mat, where he sits back down and \n          closes his eyes. Then he opens them and scrambles back to look \n          down again.\n          \n          INT. JULIET'S ROOM. DAY\n          \n          The room is empty.\n          \n          The sound of the flat door closing is heard.\n          \n          From David's point of view we see:\n          \n          INT. LOFT/HALL (EMPTY). DAY\n          \n          INT. LOFT/LIVING ROOM (EMPTY). DAY\n          \n          INT. LOFT/KITCHEN (EMPTY). DAY\n          \n          INT. HALL. DAY\n          \n          David's head appears beneath the trapdoor. He hangs from the \n          hatch and drops down to the floor.\n          \n          INT. BATHROOM. DAY\n          \n          David showers.\n          \n          INT. HALL. DAY\n          \n          David emerges from the bathroom and walks towards the kitchen. We \n          follow him in.\n          \n          INT. KITCHEN. DAY\n          \n          David takes orange juice out of the fridge and pours himself a \n          glass. He sits at the table and looks briefly into a corner that \n          we cannot see. The expression oh his face does not change and his \n          voice is impassive.\n          \n          DAVID\n          I thought you'd gone to work.\n          \n          JULIET\n          (UNSEEN)\n          With a face like this?\n          \n          INT. KITCHEN. DAY\n          \n          Juliet's face. There are bruises across it where she was gripped \n          by David.\n          \n          INT. MONITOR SCREEN/NEWSPAPER OFFICE. DAY\n          \n          In close-up we track along the following half-sentence: In the \n          event of my death I want the following facts to be known:' --\n          \n          The remainder of the screen is blank.\n          \n          Alex sits at his desk, deciding what to type next on the screen \n          seen before. A young Office Boy approaches his desk.\n          \n          OFFICE BOY\n          The editor wants to see you.\n          \n          INT. KITCHEN. MORNING\n          \n          David sits while Juliet talks. She is now seated behind him.\n          \n          JULIET\n          I remember how things used to be here, and I see how they are \n          now, and I don't know why it is. I don't know how we let you \n          become like this. We were your friends and we should have looked \n          after you.\n          \n          INT. EDITOR'S OFFICE. DAY\n          \n          Alex sits nervously while the Editor sits on the side of his \n          desk.\n          \n          EDITOR\n          Out in the woods. Three bodies. Decomposed. Mutilated. Beyond \n          recognition.\n          \n          ALEX\n          I don't know anything about it.\n          \n          EDITOR\n          Of course you don't know anything about it. If you knew anything \n          about it, I wouldn't have to send you over there to cover it.\n          \n          ALEX\n          Cover it?\n          \n          EDITOR\n          Well?\n          \n          ALEX\n          But there's no --\n          \n          EDITOR\n          Animals involved? I know, but you need a change. And besides, \n          we're short.\n          \n          ALEX\n          I don't know.\n          \n          EDITOR\n          Don't know what?\n          \n          ALEX\n          Well, I've got this story, it's really good, I'm working on, that \n          is good, I feel it could be big, it this, eh, and it's, you know, \n          it's incredible. Am I right, did you say beyond recognition'?\n          \n          INT. KITCHEN. DAY\n          \n          David and Juliet are seated as before.\n          \n          DAVID\n          I'm sorry.\n          \n          JULIET\n          I should hope so.\n          \n          david turns towards her. He reaches out and softly touches her \n          face.\n          \n          DAVID\n          Maybe we can still sort everything out.\n          \n          Juliet takes his hand.\n          \n          JULIET\n          We can try.\n          \n          They look at one another.\n          \n          EXT. FOREST. DAY\n          \n          Several police and unmarked vehicles, including one mobile \n          incident room', stand on a rough track. Another car arrives at \n          the end and is parkeed to one side. Alex steps out.\n          \n          From where he stands, Alex can see towards the site of the \n          burials. There are a few policemen, uniformed and plain-clothes, \n          and a small knot of journalists, kept at bay by plastic tape \n          draped from tree to tree. Mounds of earth mark the site of the \n          exhumations.\n          \n          Alex walks past the other journalists into the woods. He looks \n          back towards the sight, then turns to look in the opposite \n          direction. He finds himself at the edge of a golf course. From \n          the green to the graves is hardly any distance.\n          \n          To one side, Alex sees McCall and Mitchell, hunched in earnest \n          discussion. Mitchell looks up briefly and ctaches Alex's eye.\n          \n          BINT. KITCHEN/HALL. DAY\n          \n          The kitchen is empty. We track through the kitchen and out into \n          the hall, stopping at the door to Juliet's room.\n          \n          INT. JULIET'S ROOM. DAY\n          \n          David and Juliet are seated on the bed. Among the junk on her \n          bedside table is the Polaroid photograph of Alex, propped up \n          against a tumbler. Juliet reaches out and turns it away before \n          pulling David towards her.\n          \n          INT. MOBILE INCIDENT ROOM. DAY\n          \n          Several journalists sit close together on plastic chairs. Alex \n          sits at the back, near the half-open door. At the other end, \n          three police officers face them. They are a medium-ranking \n          Uniformed Officer, and to one side of him Mitchell and then \n          McCall, both of whom sit in silence.\n          \n          UNIFORMED OFFICER\n          All right, ladies and gentlemen, the releasable and print-worthy \n          facts of the day so far are as follows. Late yesterdat afternoon, \n          forestry workers came across one set of human remains lying in a \n          grave which appeared to have been recently dug. Further \n          excavation on our part has revealed two similar, deeper graves, \n          again containing human remains.\n          \n          Alex turns his head and looks out of the door towards the burial \n          site, now enclosed in a plastic tent. He continues to stare at \n          it.\n          \n          While Alex is looking, the sound of laughter and Uniformed \n          Officer's subsequent comments become muted and we hear the memory \n          of a sound in Alex's head: it is the noise of the saw going back \n          and forth across the victim's limbs.\n          \n          UNIFORMED OFFICER\n          (CONTINUED)\n          As and when the corpses are removed, we will endeavour to \n          ascertain the mode of death and duration of burial, as well as \n          identification, which will of course be passed on to you after \n          informing, where possible, the next of kin.\n          \n          Alex discreetly stands up and slips out of the van.\n          \n          EXT. FOREST. DAY\n          \n          Alex walks away from the incident room towards his car. He breaks \n          into a run for a few paces.\n          \n          The noise of the sawing continues.\n          \n          As he reaches his car, Alex fumbles in his pockets for his keys. \n          He is sweating and trembling. He drops his keys. As he bends down \n          to pick them up, his foot slips on the wet grass. He falls to his \n          knees, his forehead banging against the car door. He kneels for a \n          moment, gripping the keys, his head resting against the door.\n          \n          The noise of the sawing stops.\n          \n          From behind, the arm of a Police Constable reaches out and his \n          hand rests on Alex's shoulder.\n\n\n          THE END\n\n\n\n\n\nShallow Grave\nWriters :   John Hodge\nGenres :   Comedy  Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "David Stephens (Christopher Eccleston), a chartered accountant, Juliet Miller (Kerry Fox), a physician, and Alex Law (Ewan McGregor), a journalist, share a flat in Edinburgh. Needing a new flatmate, they interview several applicants in a calculatedly cruel manner to amuse themselves at the applicants' distress before finally offering the room to the mysterious Hugo (Keith Allen). Shortly after Hugo moves in, the trio find him dead in his room, with a large suitcase full of money. They agree to keep Hugo's death a secret and keep the money for themselves. They agree to bury the body in the woods after removing the hands and feet to prevent identification should it be found. They draw lots and David is given the gruesome and traumatising task of dismembering the corpse, with Juliet disposing of the parts in her hospital's incinerator.\nUnknown to the three friends, Hugo is being sought by a pair of violent men who are torturing and murdering informants as they follow Hugo's trail. The flat below Alex, David, and Juliet's is broken into, causing them much apprehension and anxiety. The break-in also draws the attention of the police, who are surprised when the three deny that they ever had a fourth flatmate. While Juliet and Alex spend part of the money to 'feel better', David's fears explode into full-blown paranoia. He hides the suitcase of money in the attic, and begins living there, drilling holes in the attic floor to watch the living space below. The relationship between the three becomes increasingly strained and distrustful, with undertones of sexual tension and rivalry.\nThe men trailing Hugo break into the trio's flat and violently assault Alex and Juliet, until they reveal where the money is. As they each enter the dark attic, David, who has been lying there in wait, kills them with a hammer. David alone visits the same woods to dispose of the two bodies. Alex and Juliet become more worried than ever about David's mental state and David becomes worried that the two are conspiring against him. Meanwhile, the police are already circling, in the form of Detective Inspector McCall (Ken Stott) and Detective constable Mitchell (John Hodge). Juliet secretly buys a plane ticket to South America in anticipation of flight overseas, but also seduces David to get at the money. Matters come to a head after the bodies are discovered by chance—the grave having been too shallow—and Alex is sent by his newspaper to cover the story. He returns to find Juliet and David have reached an understanding about their shared plans that excludes him. That night, Alex, now fearing for his life, tries to secretly phone the police inspector in charge of the case, but he is interrupted by David and Juliet leaving. The doorstep altercation quickly escalates into a murderous triangular fight. David reveals he knows Juliet's secret plan to betray them and attacks her. In the scuffle, David stabs Alex in the chest but is killed by Juliet before he can finish Alex off.\nWith David dead, Juliet tells Alex he can't come with her. She then forces the knife even deeper into Alex's torso, pinning him to the floor, before fleeing to the airport with the suitcase of money. However, arriving at the airport, she discovers that she has been tricked: the suitcase is filled not with money but with hundreds of headline clippings about the triple grave taken from Alex's newspaper. Devastated, with no possessions except her plane ticket, and knowing that she will soon be wanted for murder, Juliet flees the country. The police arrive at the flat to find Alex bleeding heavily and pinned to the floor. The camera pans to under the floor to reveal Alex had hidden the missing bundles of cash under the floorboards."}