{"title": "Shrek", "full_text": "SHREK\n\n                                       Written by\n\n                                William Steig & Ted Elliott\n\n\n\n\n                                     SHREK\n                         Once upon a time there was a lovely \n                         princess. But she had an enchantment \n                         upon her of a fearful sort which could \n                         only be broken by love's first kiss. \n                         She was locked away in a castle guarded \n                         by a terrible fire-breathing dragon. \n                         Many brave knights had attempted to \n                         free her from this dreadful prison, \n                         but non prevailed. She waited in the \n                         dragon's keep in the highest room of \n                         the tallest tower for her true love \n                         and true love's first kiss. (laughs) \n                         Like that's ever gonna happen. What \n                         a load of - (toilet flush)\n \n               Allstar - by Smashmouth begins to play. Shrek goes about his \n               day. While in a nearby town, the villagers get together to go \n               after the ogre.\n \n               NIGHT - NEAR SHREK'S HOME\n\n                                     MAN1\n                         Think it's in there?\n\n                                     MAN2\n                         All right. Let's get it!\n\n                                     MAN1\n                         Whoa. Hold on. Do you know what that \n                         thing can do to you?\n \n                                     MAN3\n                         Yeah, it'll grind your bones for it's \n                         bread.\n \n               Shrek sneaks up behind them and laughs.\n\n                                     SHREK\n                         Yes, well, actually, that would be a \n                         giant. Now, ogres, oh they're much worse. \n                         They'll make a suit from your freshly \n                         peeled skin.\n \n                                     MEN\n                         No!\n\n                                     SHREK\n                         They'll shave your liver. Squeeze the \n                         jelly from your eyes! Actually, it's \n                         quite good on toast.\n \n                                     MAN1\n                         Back! Back, beast! Back! I warn ya! \n                         (waves the torch at Shrek.)\n \n               Shrek calmly licks his fingers and extinguishes the torch. The \n               men shrink back away from him. Shrek roars very loudly and long \n               and his breath extinguishes all the remaining torches until the \n               men are in the dark.\n \n                                     SHREK\n                         This is the part where you run away. \n                         (The men scramble to get away. He laughs.) \n                         And stay out! (looks down and picks \n                         up a piece of paper. Reads.) \"Wanted. \n                         Fairy tale creatures.\"(He sighs and \n                         throws the paper over his shoulder.)\n \n                         \n               THE NEXT DAY\n\n               There is a line of fairy tale creatures. The head of the guard \n               sits at a table paying people for bringing the fairy tale creatures \n               to him. There are cages all around. Some of the people in line \n               are Peter Pan, who is carrying Tinkerbell in a cage, Gipetto \n               who's carrying Pinocchio, and a farmer who is carrying the three \n               little pigs.\n \n                                     GUARD\n                         All right. This one's full. Take it \n                         away! Move it along. Come on! Get up!\n \n                         \n                                     HEAD GUARD\n                         Next!\n\n                                     GUARD\n                         (taking the witch's broom) Give me that! \n                         Your flying days are over. (breaks the \n                         broom in half)\n \n                                     HEAD GUARD\n                         That's 20 pieces of silver for the witch. \n                         Next!\n \n                                     GUARD\n                         Get up! Come on!\n\n                                     HEAD GUARD\n                         Twenty pieces.\n\n                                     LITTLE BEAR\n                         (crying) This cage is too small.\n\n                                     DONKEY\n                         Please, don't turn me in. I'll never \n                         be stubborn again. I can change. Please! \n                         Give me another chance!\n \n                                     OLD WOMAN\n                         Oh, shut up. (jerks his rope)\n\n                                     DONKEY\n                         Oh!\n\n                                     HEAD GUARD\n                         Next! What have you got?\n\n                                     GIPETTO\n                         This little wooden puppet.\n\n                                     PINOCCHIO\n                         I'm not a puppet. I'm a real boy. (his \n                         nose grows)\n \n                                     HEAD GUARD\n                         Five shillings for the possessed toy. \n                         Take it away.\n \n                                     PINOCCHIO\n                         Father, please! Don't let them do this! \n                         Help me!\n \n               Gipetto takes the money and walks off. The old woman steps up \n               to the table.\n \n                                     HEAD GUARD\n                         Next! What have you got?\n\n                                     OLD WOMAN\n                         Well, I've got a talking donkey.\n\n                                     HEAD GUARD\n                         Right. Well, that's good for ten shillings, \n                         if you can prove it.\n \n                                     OLD WOMAN\n                         Oh, go ahead, little fella.\n\n               Donkey just looks up at her.\n\n                                     HEAD GUARD\n                         Well?\n\n                                     OLD WOMAN\n                         Oh, oh, he's just...he's just a little \n                         nervous. He's really quite a chatterbox. \n                         Talk, you boneheaded dolt...\n \n                                     HEAD GUARD\n                         That's it. I've heard enough. Guards!\n \n                         \n                                     OLD WOMAN\n                         No, no, he talks! He does. (pretends \n                         to be Donkey) I can talk. I love to \n                         talk. I'm the talkingest damn thing \n                         you ever saw.\n \n                                     HEAD GUARD\n                         Get her out of my sight.\n\n                                     OLD WOMAN\n                         No, no! I swear! Oh! He can talk!\n\n               The guards grab the old woman and she struggles with them. One \n               of her legs flies out and kicks Tinkerbell out of Peter Pan's \n               hands, and her cage drops on Donkey's head. He gets sprinkled \n               with fairy dust and he's able to fly.\n \n                                     DONKEY\n                         Hey! I can fly!\n\n                                     PETER PAN\n                         He can fly!\n\n                                     3 LITTLE PIGS\n                         He can fly!\n\n                                     HEAD GUARD\n                         He can talk!\n\n                                     DONKEY\n                         Ha, ha! That's right, fool! Now I'm \n                         a flying, talking donkey. You might \n                         have seen a housefly, maybe even a superfly \n                         but I bet you ain't never seen a donkey \n                         fly. Ha, ha! (the pixie dust begins \n                         to wear off) Uh-oh. (he begins to sink \n                         to the ground.)\n \n               He hits the ground with a thud.\n\n                                     HEAD GUARD\n                         Seize him! (Donkey takes of running.) \n                         After him!\n \n                                     GUARDS\n                         He's getting away! Get him! This way! \n                         Turn!\n \n               Donkey keeps running and he eventually runs into Shrek. Literally. \n               Shrek turns around to see who bumped into him. Donkey looks scared \n               for a moment then he spots the guards coming up the path. He \n               quickly hides behind Shrek.\n \n                                     HEAD GUARD\n                         You there. Ogre!\n\n                                     SHREK\n                         Aye?\n\n                                     HEAD GUARD\n                         By the order of Lord Farquaad I am authorized \n                         to place you both under arrest and transport \n                         you to a designated resettlement facility.\n \n                         \n                                     SHREK\n                         Oh, really? You and what army?\n\n               He looks behind the guard and the guard turns to look as well \n               and we see that the other men have run off. The guard tucks tail \n               and runs off. Shrek laughs and goes back about his business and \n               begins walking back to his cottage.\n \n                                     DONKEY\n                         Can I say something to you? Listen, \n                         you was really, really, really somethin' \n                         back here. Incredible!\n \n                                     SHREK\n                         Are you talkin' to...(he turns around \n                         and Donkey is gone) me? (he turns back \n                         around and Donkey is right in front \n                         of him.) Whoa!\n \n                                     DONKEY\n                         Yes. I was talkin' to you. Can I tell \n                         you that you that you was great back \n                         here? Those guards! They thought they \n                         was all of that. Then you showed up, \n                         and bam! They was trippin' over themselves \n                         like babes in the woods. That really \n                         made me feel good to see that.\n \n                                     SHREK\n                         Oh, that's great. Really.\n\n                                     DONKEY\n                         Man, it's good to be free.\n\n                                     SHREK\n                         Now, why don't you go celebrate your \n                         freedom with your own friends? Hmm?\n \n                         \n                                     DONKEY\n                         But, uh, I don't have any friends. And \n                         I'm not goin' out there by myself. Hey, \n                         wait a minute! I got a great idea! I'll \n                         stick with you. You're mean, green, \n                         fightin' machine. Together we'll scare \n                         the spit out of anybody that crosses \n                         us.\n \n               Shrek turns and regards Donkey for a moment before roaring very \n               loudly.\n \n                                     DONKEY\n                         Oh, wow! That was really scary. If you \n                         don't mind me sayin', if that don't \n                         work, your breath certainly will get \n                         the job done, 'cause you definitely \n                         need some Tic Tacs or something, 'cause \n                         you breath stinks! You almost burned \n                         the hair outta my nose, just like the \n                         time...(Shrek covers his mouth but Donkey \n                         continues to talk, so Shrek removes \n                         his hand.) ...then I ate some rotten \n                         berries. I had strong gases leaking \n                         out of my butt that day.\n \n                                     SHREK\n                         Why are you following me?\n\n                                     DONKEY\n                         I'll tell you why. (singing) 'Cause \n                         I'm all alone, There's no one here beside \n                         me, My problems have all gone, There's \n                         no one to deride me, But you gotta have \n                         faith...\n \n                                     SHREK\n                         Stop singing! It's no wonder you don't \n                         have any friends.\n \n                                     DONKEY\n                         Wow. Only a true friend would be that \n                         cruelly honest.\n \n                                     SHREK\n                         Listen, little donkey. Take a look at \n                         me. What am I?\n \n                                     DONKEY\n                         (looks all the way up at Shrek) Uh ...really \n                         tall?\n \n                                     SHREK\n                         No! I'm an ogre! You know. \"Grab your \n                         torch and pitchforks.\" Doesn't that \n                         bother you?\n \n                                     DONKEY\n                         Nope.\n\n                                     SHREK\n                         Really?\n\n                                     DONKEY\n                         Really, really.\n\n                                     SHREK\n                         Oh.\n\n                                     DONKEY\n                         Man, I like you. What's you name?\n\n                                     SHREK\n                         Uh, Shrek.\n\n                                     DONKEY\n                         Shrek? Well, you know what I like about \n                         you, Shrek? You got that kind of I-don't-care-what-nobody-thinks-of-me \n                         thing. I like that. I respect that, \n                         Shrek. You all right. (They come over \n                         a hill and you can see Shrek's cottage.) \n                         Whoa! Look at that. Who'd want to live \n                         in place like that?\n \n                                     SHREK\n                         That would be my home.\n\n                                     DONKEY\n                         Oh! And it is lovely! Just beautiful. \n                         You know you are quite a decorator. \n                         It's amazing what you've done with such \n                         a modest budget. I like that boulder. \n                         That is a nice boulder. I guess you \n                         don't entertain much, do you?\n \n                                     SHREK\n                         I like my privacy.\n\n                                     DONKEY\n                         You know, I do too. That's another thing \n                         we have in common. Like I hate it when \n                         you got somebody in your face. You've \n                         trying to give them a hint, and they \n                         won't leave. There's that awkward silence. \n                         (awkward silence) Can I stay with you?\n \n                         \n                                     SHREK\n                         Uh, what?\n\n                                     DONKEY\n                         Can I stay with you, please?\n\n                                     SHREK\n                         (sarcastically) Of course!\n\n                                     DONKEY\n                         Really?\n\n                                     SHREK\n                         No.\n\n                                     DONKEY\n                         Please! I don't wanna go back there! \n                         You don't know what it's like to be \n                         considered a freak. (pause while he \n                         looks at Shrek) Well, maybe you do. \n                         But that's why we gotta stick together. \n                         You gotta let me stay! Please! Please!\n \n                         \n                                     SHREK\n                         Okay! Okay! But one night only.\n\n                                     DONKEY\n                         Ah! Thank you! (he runs inside the cottage)\n \n                         \n                                     SHREK\n                         What are you...? (Donkey hops up onto \n                         a chair.) No! No!\n \n                                     DONKEY\n                         This is gonna be fun! We can stay up \n                         late, swappin' manly stories, and in \n                         the mornin' I'm makin' waffles.\n \n                                     SHREK\n                         Oh!\n\n                                     DONKEY\n                         Where do, uh, I sleep?\n\n                                     SHREK\n                         (irritated) Outside!\n\n                                     DONKEY\n                         Oh, well, I guess that's cool. I mean, \n                         I don't know you, and you don't know \n                         me, so I guess outside is best, you \n                         know. Here I go. Good night. (Shrek \n                         slams the door.) (sigh) I mean, I do \n                         like the outdoors. I'm a donkey. I was \n                         born outside. I'll just be sitting by \n                         myself outside, I guess, you know. By \n                         myself, outside. I'm all alone...there's \n                         no one here beside me...\n \n               SHREK'S COTTAGE - NIGHT\n\n               Shrek is getting ready for dinner. He sits himself down and lights \n               a candle made out of earwax. He begins to eat when he hears a \n               noise. He stands up with a huff.\n \n                                     SHREK\n                         (to Donkey) I thought I told you to \n                         stay outside.\n \n                                     DONKEY\n                         (from the window) I am outside.\n\n               There is another noise and Shrek turns to find the person that \n               made the noise. He sees several shadows moving. He finally turns \n               and spots 3 blind mice on his table.\n \n                                     BLIND MOUSE1\n                         Well, gents, it's a far cry from the \n                         farm, but what choice do we have?\n \n                         \n                                     BLIND MOUSE2\n                         It's not home, but it'll do just fine.\n \n                         \n                                     GORDO\n                         (bouncing on a slug) What a lovely bed.\n \n                         \n                                     SHREK\n                         Got ya. (Grabs a mouse, but it escapes \n                         and lands on his shoulder.)\n \n                                     GORDO\n                         I found some cheese. (bites Shrek's \n                         ear)\n \n                                     SHREK\n                         Ow!\n\n                                     GORDO\n                         Blah! Awful stuff.\n\n                                     BLIND MOUSE1\n                         Is that you, Gordo?\n\n                                     GORDO\n                         How did you know?\n\n                                     SHREK\n                         Enough! (he grabs the 3 mice) What are \n                         you doing in my house? (He gets bumped \n                         from behind and he drops the mice.) \n                         Hey! (he turns and sees the Seven Dwarves \n                         with Snow White on the table.) Oh, no, \n                         no, no. Dead broad off the table.\n \n                         \n                                     DWARF\n                         Where are we supposed to put her? The \n                         bed's taken.\n \n                                     SHREK\n                         Huh?\n\n               Shrek marches over to the bedroom and throws back the curtain. \n               The Big Bad Wolf is sitting in the bed. The wolf just looks at \n               him.\n \n                                     BIG BAD WOLF\n                         What?\n\n               TIME LAPSE\n\n               Shrek now has the Big Bad Wolf by the collar and is dragging \n               him to the front door.\n \n                                     SHREK\n                         I live in a swamp. I put up signs. I'm \n                         a terrifying ogre! What do I have to \n                         do get a little privacy? (He opens the \n                         front door to throw the Wolf out and \n                         he sees that all the collected Fairy \n                         Tale Creatures are on his land.) Oh, \n                         no. No! No!\n \n               The 3 bears sit around the fire, the pied piper is playing his \n               pipe and the rats are all running to him, some elves are directing \n               flight traffic so that the fairies and witches can land...etc.\n \n               \n                                     SHREK\n                         What are you doing in my swamp? (this \n                         echoes and everyone falls silent.)\n \n                         \n               Gasps are heard all around. The 3 good fairies hide inside a \n               tent.\n \n                                     SHREK\n                         All right, get out of here. All of you, \n                         move it! Come on! Let's go! Hapaya! \n                         Hapaya! Hey! Quickly. Come on! (more \n                         dwarves run inside the house) No, no! \n                         No, no. Not there. Not there. (they \n                         shut the door on him) Oh! (turns to \n                         look at Donkey)\n \n                                     DONKEY\n                         Hey, don't look at me. I didn't invite \n                         them.\n \n                                     PINOCCHIO\n                         Oh, gosh, no one invited us.\n\n                                     SHREK\n                         What?\n\n                                     PINOCCHIO\n                         We were forced to come here.\n\n                                     SHREK\n                         (flabbergasted) By who?\n\n                                     LITTLE PIG\n                         Lord Farquaad. He huffed and he puffed \n                         and he...signed an eviction notice.\n \n                         \n                                     SHREK\n                         (heavy sigh) All right. Who knows where \n                         this Farquaad guy is?\n \n               Everyone looks around at each other but no one answers.\n\n                                     DONKEY\n                         Oh, I do. I know where he is.\n\n                                     SHREK\n                         Does anyone else know where to find \n                         him? Anyone at all?\n \n                                     DONKEY\n                         Me! Me!\n\n                                     SHREK\n                         Anyone?\n\n                                     DONKEY\n                         Oh! Oh, pick me! Oh, I know! I know! \n                         Me, me!\n \n                                     SHREK\n                         (sigh) Okay, fine. Attention, all fairy \n                         tale things. Do not get comfortable. \n                         Your welcome is officially worn out. \n                         In fact, I'm gonna see this guy Farquaad \n                         right now and get you all off my land \n                         and back where you came from! (Pause. \n                         Then the crowd goes wild.) Oh! (to Donkey) \n                         You! You're comin' with me.\n \n                                     DONKEY\n                         All right, that's what I like to hear, \n                         man. Shrek and Donkey, two stalwart \n                         friends, off on a whirlwind big-city \n                         adventure. I love it!\n \n                                     DONKEY\n                         (singing) On the road again. Sing it \n                         with me, Shrek. I can't wait to get \n                         on the road again.\n \n                                     SHREK\n                         What did I say about singing?\n\n                                     DONKEY\n                         Can I whistle?\n\n                                     SHREK\n                         No.\n\n                                     DONKEY\n                         Can I hum it?\n\n                                     SHREK\n                         All right, hum it.\n\n               Donkey begins to hum 'On the Road Again'.\n\n               DULOC - KITCHEN\n\n               A masked man is torturing the Gingerbread Man. He's continually \n               dunking him in a glass of milk. Lord Farquaad walks in.\n \n                                     FARQUAAD\n                         That's enough. He's ready to talk.\n \n                         \n               The Gingerbread Man is pulled out of the milk and slammed down \n               onto a cookie sheet. Farquaad laughs as he walks over to the \n               table. However when he reaches the table we see that it goes \n               up to his eyes. He clears his throat and the table is lowered.\n \n               \n                                     FARQUAAD\n                         (he picks up the Gingerbread Man's legs \n                         and plays with them) Run, run, run, \n                         as fast as you can. You can't catch \n                         me. I'm the gingerbread man.\n \n                                     GINGERBREAD MAN\n                         You are a monster.\n\n                                     FARQUAAD\n                         I'm not the monster here. You are. You \n                         and the rest of that fairy tale trash, \n                         poisoning my perfect world. Now, tell \n                         me! Where are the others?\n \n                                     GINGERBREAD MAN\n                         Eat me! (He spits milk into Farquaad's \n                         eye.)\n \n                                     FARQUAAD\n                         I've tried to be fair to you creatures. \n                         Now my patience has reached its end! \n                         Tell me or I'll...(he makes as if to \n                         pull off the Gingerbread Man's buttons)\n \n                         \n                                     GINGERBREAD MAN\n                         No, no, not the buttons. Not my gumdrop \n                         buttons.\n \n                                     FARQUAAD\n                         All right then. Who's hiding them?\n \n                         \n                                     GINGERBREAD MAN\n                         Okay, I'll tell you. Do you know the \n                         muffin man?\n \n                                     FARQUAAD\n                         The muffin man?\n\n                                     GINGERBREAD MAN\n                         The muffin man.\n\n                                     FARQUAAD\n                         Yes, I know the muffin man, who lives \n                         on Drury Lane?\n \n                                     GINGERBREAD MAN\n                         Well, she's married to the muffin man.\n \n                         \n                                     FARQUAAD\n                         The muffin man?\n\n                                     GINGERBREAD MAN\n                         The muffin man!\n\n                                     FARQUAAD\n                         She's married to the muffin man.\n\n               The door opens and the Head Guard walks in.\n\n                                     HEAD GUARD\n                         My lord! We found it.\n\n                                     FARQUAAD\n                         Then what are you waiting for? Bring \n                         it in.\n \n               More guards enter carrying something that is covered by a sheet. \n               They hang up whatever it is and remove the sheet. It is the Magic \n               Mirror.\n \n                                     GINGERBREAD MAN\n                         (in awe) Ohhhh...\n\n                                     FARQUAAD\n                         Magic mirror...\n\n                                     GINGERBREAD MAN\n                         Don't tell him anything! (Farquaad picks \n                         him up and dumps him into a trash can \n                         with a lid.) No!\n \n                                     FARQUAAD\n                         Evening. Mirror, mirror on the wall. \n                         Is this not the most perfect kingdom \n                         of them all?\n \n                                     MIRROR\n                         Well, technically you're not a king.\n \n                         \n                                     FARQUAAD\n                         Uh, Thelonius. (Thelonius holds up a \n                         hand mirror and smashes it with his \n                         fist.) You were saying?\n \n                                     MIRROR\n                         What I mean is you're not a king yet. \n                         But you can become one. All you have \n                         to do is marry a princess.\n \n                                     FARQUAAD\n                         Go on.\n\n                                     MIRROR\n                         (chuckles nervously) So, just sit back \n                         and relax, my lord, because it's time \n                         for you to meet today's eligible bachelorettes. \n                         And here they are! Bachelorette number \n                         one is a mentally abused shut-in from \n                         a kingdom far, far away. She likes sushi \n                         and hot tubbing anytime. Her hobbies \n                         include cooking and cleaning for her \n                         two evil sisters. Please welcome Cinderella. \n                         (shows picture of Cinderella) Bachelorette \n                         number two is a cape-wearing girl from \n                         the land of fancy. Although she lives \n                         with seven other men, she's not easy. \n                         Just kiss her dead, frozen lips and \n                         find out what a live wire she is. Come \n                         on. Give it up for Snow White! (shows \n                         picture of Snow White) And last, but \n                         certainly not last, bachelorette number \n                         three is a fiery redhead from a dragon-guarded \n                         castle surrounded by hot boiling lava! \n                         But don't let that cool you off. She's \n                         a loaded pistol who likes pina colads \n                         and getting caught in the rain. Yours \n                         for the rescuing, Princess Fiona! (Shows \n                         picture of Princess Fiona) So will it \n                         be bachelorette number one, bachelorette \n                         number two or bachelorette number three?\n \n                         \n                                     GUARDS\n                         Two! Two! Three! Three! Two! Two! Three!\n \n                         \n                                     FARQUAAD\n                         Three? One? Three?\n\n                                     THELONIUS\n                         Three! (holds up 2 fingers) Pick number \n                         three, my lord!\n \n                                     FARQUAAD\n                         Okay, okay, uh, number three!\n\n                                     MIRROR\n                         Lord Farquaad, you've chosen Princess \n                         Fiona.\n \n                                     FARQUAAD\n                         Princess Fiona. She's perfect. All I \n                         have to do is just find someone who \n                         can go...\n \n                                     MIRROR\n                         But I probably should mention the little \n                         thing that happens at night.\n \n                                     FARQUAAD\n                         I'll do it.\n\n                                     MIRROR\n                         Yes, but after sunset...\n\n                                     FARQUAAD\n                         Silence! I will make this Princess Fiona \n                         my queen, and DuLoc will finally have \n                         the perfect king! Captain, assemble \n                         your finest men. We're going to have \n                         a tournament. (smiles evilly)\n \n               DuLoc Parking Lot - Lancelot Section\n\n               Shrek and Donkey come out of the field that is right by the parking \n               lot. The castle itself is about 40 stories high.\n \n                                     DONKEY\n                         But that's it. That's it right there. \n                         That's DuLoc. I told ya I'd find it.\n \n                         \n                                     SHREK\n                         So, that must be Lord Farquaad's castle.\n \n                         \n                                     DONKEY\n                         Uh-huh. That's the place.\n\n                                     SHREK\n                         Do you think maybe he's compensating \n                         for something? (He laughs, but then \n                         groans as Donkey doesn't get the joke. \n                         He continues walking through the parking \n                         lot.)\n \n                                     DONKEY\n                         Hey, wait. Wait up, Shrek.\n\n                                     MAN\n                         Hurry, darling. We're late. Hurry.\n \n                         \n                                     SHREK\n                         Hey, you! (The attendant, who is wearing \n                         a giant head that looks like Lord Farquaad, \n                         screams and begins running through the \n                         rows of rope to get to the front gate \n                         to get away from Shrek.) Wait a second. \n                         Look, I'm not gonna eat you. I just \n                         - - I just - - (He sighs and then begins \n                         walking straight through the rows. The \n                         attendant runs into a wall and falls \n                         down. Shrek and Donkey look at him then \n                         continue on into DuLoc.)\n \n               DULOC\n\n               They look around but all is quiet.\n\n                                     SHREK\n                         It's quiet. Too quiet. Where is everybody?\n \n                         \n                                     DONKEY\n                         Hey, look at this!\n\n               Donkey runs over and pulls a lever that is attached to a box \n               marked 'Information'. The music winds up and then the box doors \n               open up. There are little wooden people inside and they begin \n               to sing.\n \n                                     WOODEN PEOPLE\n                         Welcome to DuLoc such a perfect town\n \n                         \n               Here we have some rules\n\n               Let us lay them down\n\n               Don't make waves, stay in line\n\n               And we'll get along fine\n\n               DuLoc is perfect place\n\n               Please keep off of the grass\n\n               Shine your shoes, wipe your... face\n\n               DuLoc is, DuLoc is\n\n               DuLoc is perfect place.\n\n               Suddenly a camera takes Donkey and Shrek's picture.\n\n                                     DONKEY\n                         Wow! Let's do that again! (makes ready \n                         to run over and pull the lever again)\n \n                         \n                                     SHREK\n                         (grabs Donkey's tail and holds him still) \n                         No. No. No, no, no! No.\n \n               They hear a trumpet fanfare and head over to the arena.\n\n                                     FARQUAAD\n                         Brave knights. You are the best and \n                         brightest in all the land. Today one \n                         of you shall prove himself...\n \n               As Shrek and Donkey walk down the tunnel to get into the arena \n               Donkey is humming the DuLoc theme song.\n \n                                     SHREK\n                         All right. You're going the right way \n                         for a smacked bottom.\n \n                                     DONKEY\n                         Sorry about that.\n\n                                     FARQUAAD\n                         That champion shall have the honor - \n                         - no, no - - the privilege to go forth \n                         and rescue the lovely Princess Fiona \n                         from the fiery keep of the dragon. If \n                         for any reason the winner is unsuccessful, \n                         the first runner-up will take his place \n                         and so on and so forth. Some of you \n                         may die, but it's a sacrifice I am willing \n                         to make. (cheers) Let the tournament \n                         begin! (He notices Shrek) Oh! What is \n                         that? It's hideous!\n \n                                     SHREK\n                         (turns to look at Donkey and then back \n                         at Farquaad) Ah, that's not very nice. \n                         It's just a donkey.\n \n                                     FARQUAAD\n                         Indeed. Knights, new plan! The one who \n                         kills the ogre will be named champion! \n                         Have it him!\n \n                                     MEN\n                         Get him!\n\n                                     SHREK\n                         Oh, hey! Now come on! Hang on now. (bumps \n                         into a table where there are mugs of \n                         beer)\n \n                                     CROWD\n                         Go ahead! Get him!\n\n                                     SHREK\n                         (holds up a mug of beer) Can't we just \n                         settle this over a pint?\n \n                                     CROWD\n                         Kill the beast!\n\n                                     SHREK\n                         No? All right then. (drinks the beer) \n                         Come on!\n \n               He takes the mug and smashes the spigot off the large barrel \n               of beer behind him. The beer comes rushing out drenching the \n               other men and wetting the ground. It's like mud now. Shrek slides \n               past the men and picks up a spear that one of the men dropped. \n               As Shrek begins to fight Donkey hops up onto one of the larger \n               beer barrels. It breaks free of it's ropes and begins to roll. \n               Donkey manages to squish two men into the mud. There is so much \n               fighting going on here I'm not going to go into detail. Suffice \n               to say that Shrek kicks butt.\n \n                                     DONKEY\n                         Hey, Shrek, tag me! Tag me!\n\n               Shrek comes over and bangs a man's head up against Donkeys. Shrek \n               gets up on the ropes and interacts with the crowd.\n \n                                     SHREK\n                         Yeah!\n\n               A man tries to sneak up behind Shrek, but Shrek turns in time \n               and sees him.\n \n                                     WOMAN\n                         The chair! Give him the chair!\n\n               Shrek smashes a chair over the guys back. Finally all the men \n               are down. Donkey kicks one of them in the helmet, and the ding \n               sounds the end of the match. The audience goes wild.\n \n                                     SHREK\n                         Oh, yeah! Ah! Ah! Thank you! Thank you \n                         very much! I'm here till Thursday. Try \n                         the veal! Ha, ha! (laughs)\n \n               The laughter stops as all of the guards turn their weapons on \n               Shrek.\n \n                                     HEAD GUARD\n                         Shall I give the order, sir?\n\n                                     FARQUAAD\n                         No, I have a better idea. People of \n                         DuLoc, I give you our champion!\n \n                                     SHREK\n                         What?\n\n                                     FARQUAAD\n                         Congratulations, ogre. You're won the \n                         honor of embarking on a great and noble \n                         quest.\n \n                                     SHREK\n                         Quest? I'm already in a quest, a quest \n                         to get my swamp back.\n \n                                     FARQUAAD\n                         Your swamp?\n\n                                     SHREK\n                         Yeah, my swamp! Where you dumped those \n                         fairy tale creatures!\n \n                                     FARQUAAD\n                         Indeed. All right, ogre. I'll make you \n                         a deal. Go on this quest for me, and \n                         I'll give you your swamp back.\n \n                                     SHREK\n                         Exactly the way it was?\n\n                                     FARQUAAD\n                         Down to the last slime-covered toadstool.\n \n                         \n                                     SHREK\n                         And the squatters?\n\n                                     FARQUAAD\n                         As good as gone.\n\n                                     SHREK\n                         What kind of quest?\n\n               Time Lapse - Donkey and Shrek are now walking through the field \n               heading away from DuLoc. Shrek is munching on an onion.\n \n                                     DONKEY\n                         Let me get this straight. You're gonna \n                         go fight a dragon and rescue a princess \n                         just so Farquaad will give you back \n                         a swamp which you only don't have because \n                         he filled it full of freaks in the first \n                         place. Is that about right?\n \n                                     SHREK\n                         You know, maybe there's a good reason \n                         donkeys shouldn't talk.\n \n                                     DONKEY\n                         I don't get it. Why don't you just pull \n                         some of that ogre stuff on him? Throttle \n                         him, lay siege to his fortress, grinds \n                         his bones to make your bread, the whole \n                         ogre trip.\n \n                                     SHREK\n                         Oh, I know what. Maybe I could have \n                         decapitated an entire village and put \n                         their heads on a pike, gotten a knife, \n                         cut open their spleen and drink their \n                         fluids. Does that sound good to you?\n \n                         \n                                     DONKEY\n                         Uh, no, not really, no.\n\n                                     SHREK\n                         For your information, there's a lot \n                         more to ogres than people think.\n \n                                     DONKEY\n                         Example?\n\n                                     SHREK\n                         Example? Okay, um, ogres are like onions. \n                         (he holds out his onion)\n \n                                     DONKEY\n                         (sniffs the onion) They stink?\n\n                                     SHREK\n                         Yes - - No!\n\n                                     DONKEY\n                         They make you cry?\n\n                                     SHREK\n                         No!\n\n                                     DONKEY\n                         You leave them in the sun, they get \n                         all brown, start sproutin' little white \n                         hairs.\n \n                                     SHREK\n                         No! Layers! Onions have layers. Ogres \n                         have layers! Onions have layers. You \n                         get it? We both have layers. (he heaves \n                         a sigh and then walks off)\n \n                                     DONKEY\n                         (trailing after Shrek) Oh, you both \n                         have layers. Oh. {Sniffs} You know, \n                         not everybody likes onions. Cake! Everybody \n                         loves cakes! Cakes have layers.\n \n                                     SHREK\n                         I don't care... what everyone likes. \n                         Ogres are not like cakes.\n \n                                     DONKEY\n                         You know what else everybody likes? \n                         Parfaits. Have you ever met a person, \n                         you say, \"Let's get some parfait,\" they \n                         say, \"Hell no, I don't like no parfait\"? \n                         Parfaits are delicious.\n \n                                     SHREK\n                         No! You dense, irritating, miniature \n                         beast of burden! Ogres are like onions! \n                         And of story. Bye-bye. See ya later.\n \n                         \n                                     DONKEY\n                         Parfaits may be the most delicious thing \n                         on the whole damn planet.\n \n                                     SHREK\n                         You know, I think I preferred your humming.\n \n                         \n                                     DONKEY\n                         Do you have a tissue or something? I'm \n                         making a mess. Just the word parfait \n                         make me start slobbering.\n \n               They head off. There is a montage of their journey. Walking through \n               a field at sunset. Sleeping beneath a bright moon. Shrek trying \n               to put the campfire out the next day and having a bit of a problem, \n               so Donkey pees on the fire to put it out.\n \n               DRAGON'S KEEP\n\n               Shrek and Donkey are walking up to the keep that's supposed to \n               house Princess Fiona. It appears to look like a giant volcano.\n \n               \n                                     DONKEY\n                         (sniffs) Ohh! Shrek! Did you do that? \n                         You gotta warn somebody before you just \n                         crack one off. My mouth was open and \n                         everything.\n \n                                     SHREK\n                         Believe me, Donkey, if it was me, you'd \n                         be dead. (sniffs) It's brimstone. We \n                         must be getting close.\n \n                                     DONKEY\n                         Yeah, right, brimstone. Don't be talking \n                         about it's the brimstone. I know what \n                         I smell. It wasn't no brimstone. It \n                         didn't come off no stone neither.\n \n                         \n               They climb up the side of the volcano/keep and look down. There \n               is a small piece of rock right in the center and that is where \n               the castle is. It is surrounded by boiling lava. It looks very \n               foreboding.\n \n                                     SHREK\n                         Sure, it's big enough, but look at the \n                         location. (laughs...then the laugh turns \n                         into a groan)\n \n                                     DONKEY\n                         Uh, Shrek? Uh, remember when you said \n                         ogres have layers?\n \n                                     SHREK\n                         Oh, aye.\n\n                                     DONKEY\n                         Well, I have a bit of a confession to \n                         make. Donkeys don't have layers. We \n                         wear our fear right out there on our \n                         sleeves.\n \n                                     SHREK\n                         Wait a second. Donkeys don't have sleeves.\n \n                         \n                                     DONKEY\n                         You know what I mean.\n\n                                     SHREK\n                         You can't tell me you're afraid of heights.\n \n                         \n                                     DONKEY\n                         No, I'm just a little uncomfortable \n                         about being on a rickety bridge over \n                         a boiling like of lava!\n \n                                     SHREK\n                         Come on, Donkey. I'm right here beside \n                         ya, okay? For emotional support., we'll \n                         just tackle this thing together one \n                         little baby step at a time.\n \n                                     DONKEY\n                         Really?\n\n                                     SHREK\n                         Really, really.\n\n                                     DONKEY\n                         Okay, that makes me feel so much better.\n \n                         \n                                     SHREK\n                         Just keep moving. And don't look down.\n \n                         \n                                     DONKEY\n                         Okay, don't look down. Don't look down. \n                         Don't look down. Keep on moving. Don't \n                         look down. (he steps through a rotting \n                         board and ends up looking straight down \n                         into the lava) Shrek! I'm lookin' down! \n                         Oh, God, I can't do this! Just let me \n                         off, please!\n \n                                     SHREK\n                         But you're already halfway.\n\n                                     DONKEY\n                         But I know that half is safe!\n\n                                     SHREK\n                         Okay, fine. I don't have time for this. \n                         You go back.\n \n                                     DONKEY\n                         Shrek, no! Wait!\n\n                                     SHREK\n                         Just, Donkey - - Let's have a dance \n                         then, shall me? (bounces and sways the \n                         bridge)\n \n                                     DONKEY\n                         Don't do that!\n\n                                     SHREK\n                         Oh, I'm sorry. Do what? Oh, this? (bounces \n                         the bridge again)\n \n                                     DONKEY\n                         Yes, that!\n\n                                     SHREK\n                         Yes? Yes, do it. Okay. (continues to \n                         bounce and sway as he backs Donkey across \n                         the bridge)\n \n                                     DONKEY\n                         No, Shrek! No! Stop it!\n\n                                     SHREK\n                         You said do it! I'm doin' it.\n\n                                     DONKEY\n                         I'm gonna die. I'm gonna die. Shrek, \n                         I'm gonna die. (steps onto solid ground) \n                         Oh!\n \n                                     SHREK\n                         That'll do, Donkey. That'll do. (walks \n                         towards the castle)\n \n                                     DONKEY\n                         Cool. So where is this fire-breathing \n                         pain-in-the-neck anyway?\n \n                                     SHREK\n                         Inside, waiting for us to rescue her. \n                         (chuckles)\n \n                                     DONKEY\n                         I was talkin' about the dragon, Shrek.\n \n                         \n               INSIDE THE CASTLE\n\n                                     DONKEY\n                         You afraid?\n\n                                     SHREK\n                         No.\n\n                                     DONKEY\n                         But...\n\n                                     SHREK\n                         Shh.\n\n                                     DONKEY\n                         Oh, good. Me neither. (sees a skeleton \n                         and gasps) 'Cause there's nothin' wrong \n                         with bein' afraid. Fear's a sensible \n                         response to an unfamiliar situation. \n                         Unfamiliar dangerous situation, I might \n                         add. With a dragon that breathes fire \n                         and eats knights and breathes fire, \n                         it sure doesn't mean you're a coward \n                         if you're a little scared. I sure as \n                         heck ain't no coward. I know that.\n \n                         \n                                     SHREK\n                         Donkey, two things, okay? Shut ... up. \n                         Now go over there and see if you can \n                         find any stairs.\n \n                                     DONKEY\n                         Stairs? I thought we was lookin' for \n                         the princess.\n \n                                     SHREK\n                         (putting on a helmet) The princess will \n                         be up the stairs in the highest room \n                         in the tallest tower.\n \n                                     DONKEY\n                         What makes you think she'll be there?\n \n                         \n                                     SHREK\n                         I read it in a book once. (walks off)\n \n                         \n                                     DONKEY\n                         Cool. You handle the dragon. I'll handle \n                         the stairs. I'll find those stairs. \n                         I'll whip their butt too. Those stairs \n                         won't know which way they're goin'. \n                         (walks off)\n \n               EMPTY ROOM\n\n               Donkey is still talking to himself as he looks around the room.\n \n               \n                                     DONKEY\n                         I'm gonna take drastic steps. Kick it \n                         to the curb. Don't mess with me. I'm \n                         the stair master. I've mastered the \n                         stairs. I wish I had a step right here. \n                         I'd step all over it.\n \n               ELSEWHERE\n\n               Shrek spots a light in the tallest tower window.\n\n                                     SHREK\n                         Well, at least we know where the princess \n                         is, but where's the...\n \n                                     DONKEY\n                         (os) Dragon!\n\n               Donkey gasps and takes off running as the dragon roars again. \n               Shrek manages to grab Donkey out of the way just as the dragon \n               breathes fire.\n \n                                     SHREK\n                         Donkey, look out! (he manages to get \n                         a hold of the dragons tail and holds \n                         on) Got ya!\n \n               The dragon gets irritated at this and flicks it's tail and Shrek \n               goes flying through the air and crashes through the roof of the \n               tallest tower. Fiona wakes up with a jerk and looks at him lying \n               on the floor.\n \n                                     DONKEY\n                         Oh! Aah! Aah!\n\n               Donkey get cornered as the Dragon knocks away all but a small \n               part of the bridge he's on.\n \n                                     DONKEY\n                         No. Oh, no, No! (the dragon roars) Oh, \n                         what large teeth you have. (the dragon \n                         growls) I mean white, sparkling teeth. \n                         I know you probably hear this all time \n                         from your food, but you must bleach, \n                         'cause that is one dazzling smile you \n                         got there. Do I detect a hint of minty \n                         freshness? And you know what else? You're \n                         - - You're a girl dragon! Oh, sure! \n                         I mean, of course you're a girl dragon. \n                         You're just reeking of feminine beauty. \n                         (the dragon begins fluttering her eyes \n                         at him) What's the matter with you? \n                         You got something in your eye? Ohh. \n                         Oh. Oh. Man, I'd really love to stay, \n                         but you know, I'm, uh...(the dragon \n                         blows a smoke ring in the shape of a \n                         heart right at him, and he coughs) I'm \n                         an asthmatic, and I don't know if it'd \n                         work out if you're gonna blow smoke \n                         rings. Shrek! (the dragon picks him \n                         up with her teeth and carries him off) \n                         No! Shrek! Shrek! Shrek!\n \n               FIONA'S ROOM\n\n               Shrek groans as he gets up off the floor. His back is to Fiona \n               so she straightens her dress and lays back down on the bed. She \n               then quickly reaches over and gets the bouquet of flowers off \n               the side table. She then lays back down and appears to be asleep. \n               Shrek turns and goes over to her. He looks down at Fiona for \n               a moment and she puckers her lips. Shrek takes her by the shoulders \n               and shakes her away.\n \n                                     FIONA\n                         Oh! Oh!\n\n                                     SHREK\n                         Wake up!\n\n                                     FIONA\n                         What?\n\n                                     SHREK\n                         Are you Princess Fiona?\n\n                                     FIONA\n                         I am, awaiting a knight so bold as to \n                         rescue me.\n \n                                     SHREK\n                         Oh, that's nice. Now let's go!\n\n                                     FIONA\n                         But wait, Sir Knight. This be-ith our \n                         first meeting. Should it not be a wonderful, \n                         romantic moment?\n \n                                     SHREK\n                         Yeah, sorry, lady. There's no time.\n \n                         \n                                     FIONA\n                         Hey, wait. What are you doing? You should \n                         sweep me off my feet out yonder window \n                         and down a rope onto your valiant steed.\n \n                         \n                                     SHREK\n                         You've had a lot of time to plan this, \n                         haven't you?\n \n                                     FIONA\n                         (smiles) Mm-hmm.\n\n               Shrek breaks the lock on her door and pulls her out and down \n               the hallway.\n \n                                     FIONA\n                         But we have to savor this moment! You \n                         could recite an epic poem for me. A \n                         ballad? A sonnet! A limerick? Or something!\n \n                         \n                                     SHREK\n                         I don't think so.\n\n                                     FIONA\n                         Can I at least know the name of my champion?\n \n                         \n                                     SHREK\n                         Uh, Shrek.\n\n                                     FIONA\n                         Sir Shrek. (clears throat and holds \n                         out a handkerchief) I pray that you \n                         take this favor as a token of my gratitude.\n \n                         \n                                     SHREK\n                         Thanks!\n\n               Suddenly they hear the dragon roar.\n\n                                     FIONA\n                         (surprised)You didn't slay the dragon?\n \n                         \n                                     SHREK\n                         It's on my to-do list. Now come on! \n                         (takes off running and drags Fiona behind \n                         him.)\n \n                                     FIONA\n                         But this isn't right! You were meant \n                         to charge in, sword drawn, banner flying. \n                         That's what all the other knights did.\n \n                         \n                                     SHREK\n                         Yeah, right before they burst into flame.\n \n                         \n                                     FIONA\n                         That's not the point. (Shrek suddenly \n                         stops and she runs into him.) Oh! (Shrek \n                         ignores her and heads for a wooden door \n                         off to the side.) Wait. Where are you \n                         going? The exit's over there.\n \n                                     SHREK\n                         Well, I have to save my ass.\n\n                                     FIONA\n                         What kind of knight are you?\n\n                                     SHREK\n                         One of a kind. (opens the door into \n                         the throne room)\n \n                                     DONKEY\n                         (os) Slow down. Slow down, baby, please. \n                         I believe it's healthy to get to know \n                         someone over a long period of time. \n                         Just call me old-fashioned. (laughs \n                         worriedly) (we see him up close and \n                         from a distance as Shrek sneaks into \n                         the room) I don't want to rush into \n                         a physical relationship. I'm not emotionally \n                         ready for a commitment of, uh, this \n                         - - Magnitude really is the word I'm \n                         looking for. Magnitude- - Hey, that \n                         is unwanted physical contact. Hey, what \n                         are you doing? Okay, okay. Let's just \n                         back up a little and take this one step \n                         at a time. We really should get to know \n                         each other first as friends or pen pals. \n                         I'm on the road a lot, but I just love \n                         receiving cards - - I'd really love \n                         to stay, but - - Don't do that! That's \n                         my tail! That's my personal tail. You're \n                         gonna tear it off. I don't give permission \n                         - - What are you gonna do with that? \n                         Hey, now. No way. No! No! No, no! No. \n                         No, no, no. No! Oh!\n \n               Shrek grabs a chain that's connected to the chandelier and swings \n               toward the dragon. He misses and he swings back again. He looks \n               up and spots that the chandelier is right above the dragons head. \n               He pulls on the chain and it releases and he falls down and bumps \n               Donkey out of the way right as the dragon is about to kiss him. \n               Instead the dragon kisses Shreks' butt. She opens her eyes and \n               roars. Shrek lets go of the chain and the chandelier falls onto \n               her head, but it's too big and it goes over her head and forms \n               a sort of collar for her. She roars again and Shrek and Donkey \n               take off running. Very 'Matrix' style. Shrek grabs Donkey and \n               then grabs Princess Fiona as he runs past her.\n \n                                     DONKEY\n                         Hi, Princess!\n\n                                     FIONA\n                         It talks!\n\n                                     SHREK\n                         Yeah, it's getting him to shut up that's \n                         the trick.\n \n               They all start screaming as the dragon gains on them. Shrek spots \n               a descending slide and jumps on. But unfortunately there is a \n               crack in the stone and it hits Shrek right in the groin. His \n               eyes cross and as he reaches the bottom of the slide he stumbles \n               off and walks lightly.\n \n                                     SHREK\n                         Oh!\n\n               Shrek gets them close to the exit and sets down Donkey and Fiona.\n \n               \n                                     SHREK\n                         Okay, you two, heard for the exit! I'll \n                         take care of the dragon.\n \n               Shrek grabs a sword and heads back toward the interior of the \n               castle. He throws the sword down in between several overlapping \n               chain links. The chain links are attached to the chandelier that \n               is still around the dragons neck.\n \n                                     SHREK\n                         (echoing) Run!\n\n               They all take off running for the exit with the dragon in hot \n               pursuit. They make it to the bridge and head across. The dragons \n               breathes fire and the bridge begins to burn. They all hang on \n               for dear life as the ropes holding the bridge up collapse. They \n               are swung to the other side. As they hang upside down they look \n               in horror as the dragon makes to fly over the boiling lava to \n               get them. But suddenly the chandelier with the chain jerk the \n               dragon back and she's unable to get to them. Our gang climbs \n               quickly to safety as the dragon looks angry and then gives a \n               sad whimper as she watches Donkey walk away.\n \n                                     FIONA\n                         (sliding down the 'volcano' hill) You \n                         did it! You rescued me! You're amazing. \n                         (behind her Donkey falls down the hill) \n                         You're - - You're wonderful. You're... \n                         (turns and sees Shrek fall down the \n                         hill and bump into Donkey) a little \n                         unorthodox I'll admit. But thy deed \n                         is great, and thy heart is pure. I am \n                         eternally in your debt. (Donkey clears \n                         his throat.) And where would a brave \n                         knight be without his noble steed?\n \n                         \n                                     DONKEY\n                         I hope you heard that. She called me \n                         a noble steed. She think I'm a steed.\n \n                         \n                                     FIONA\n                         The battle is won. You may remove your \n                         helmet, good Sir Knight.\n \n                                     SHREK\n                         Uh, no.\n\n                                     FIONA\n                         Why not?\n\n                                     SHREK\n                         I have helmet hair.\n\n                                     FIONA\n                         Please. I would'st look upon the face \n                         of my rescuer.\n \n                                     SHREK\n                         No, no, you wouldn't - - 'st.\n\n                                     FIONA\n                         But how will you kiss me?\n\n                                     SHREK\n                         What? (to Donkey) That wasn't in the \n                         job description.\n \n                                     DONKEY\n                         Maybe it's a perk.\n\n                                     FIONA\n                         No, it's destiny. Oh, you must know \n                         how it goes. A princess locked in a \n                         tower and beset by a dragon is rescued \n                         by a brave knight, and then they share \n                         true love's first kiss.\n \n                                     DONKEY\n                         Hmm? With Shrek? You think- - Wait. \n                         Wait. You think that Shrek is you true \n                         love?\n \n                                     FIONA\n                         Well, yes.\n\n               Both Donkey and Shrek burst out laughing.\n\n                                     DONKEY\n                         You think Shrek is your true love!\n \n                         \n                                     FIONA\n                         What is so funny?\n\n                                     SHREK\n                         Let's just say I'm not your type, okay?Fiona: \n                         Of course, you are. You're my rescuer. \n                         Now - - Now remove your helmet.\n \n                                     SHREK\n                         Look. I really don't think this is a \n                         good idea.\n \n                                     FIONA\n                         Just take off the helmet.\n\n                                     SHREK\n                         I'm not going to.\n\n                                     FIONA\n                         Take it off.\n\n                                     SHREK\n                         No!\n\n                                     FIONA\n                         Now!\n\n                                     SHREK\n                         Okay! Easy. As you command. Your Highness. \n                         (takes off his helmet)\n \n                                     FIONA\n                         You- - You're a- - an ogre.\n\n                                     SHREK\n                         Oh, you were expecting Prince Charming.\n \n                         \n                                     FIONA\n                         Well, yes, actually. Oh, no. This is \n                         all wrong. You're not supposed to be \n                         an ogre.\n \n                                     SHREK\n                         Princess, I was sent to rescue you by \n                         Lord Farquaad, okay? He is the one who \n                         wants to marry you.\n \n                                     FIONA\n                         Then why didn't he come rescue me?\n \n                         \n                                     SHREK\n                         Good question. You should ask him that \n                         when we get there.\n \n                                     FIONA\n                         But I have to be rescued by my true \n                         love, not by some ogre and his- - his \n                         pet.\n \n                                     DONKEY\n                         Well, so much for noble steed.\n\n                                     SHREK\n                         You're not making my job any easier.\n \n                         \n                                     FIONA\n                         I'm sorry, but your job is not my problem. \n                         You can tell Lord Farquaad that if he \n                         wants to rescue me properly, I'll be \n                         waiting for him right here.\n \n                                     SHREK\n                         Hey! I'm no one's messenger boy, all \n                         right? (ominous) I'm a delivery boy. \n                         (he swiftly picks her up and swings \n                         her over his shoulder like she was a \n                         sack of potatoes)\n \n                                     FIONA\n                         You wouldn't dare. Put me down!\n\n                                     SHREK\n                         Ya comin', Donkey?\n\n                                     DONKEY\n                         I'm right behind ya.\n\n                                     FIONA\n                         Put me down, or you will suffer the \n                         consequences! This is not dignified! \n                         Put me down!\n \n               WOODS\n\n               A little time has passed and Fiona has calmed down. She just \n               hangs there limply while Shrek carries her.\n \n                                     DONKEY\n                         Okay, so here's another question. Say \n                         there's a woman that digs you, right, \n                         but you don't really like her that way. \n                         How do you let her down real easy so \n                         her feelings aren't hurt, but you don't \n                         get burned to a crisp and eaten?\n \n                                     FIONA\n                         You just tell her she's not your true \n                         love. Everyone knows what happens when \n                         you find your...(Shrek drops her on \n                         the ground) Hey! The sooner we get to \n                         DuLoc the better.\n \n                                     DONKEY\n                         You're gonna love it there, Princess. \n                         It's beautiful!\n \n                                     FIONA\n                         And what of my groom-to-be? Lord Farquaad? \n                         What's he like?\n \n                                     SHREK\n                         Let me put it this way, Princess. Men \n                         of Farquaad's stature are in short supply. \n                         (he and Donkey laugh)\n \n               Shrek then proceeds to splash water onto his face to wash off \n               the dust and grime.\n \n                                     DONKEY\n                         I don't know. There are those who think \n                         little of him. (they laugh again) Fiona: \n                         Stop it. Stop it, both of you. You're \n                         just jealous you can never measure up \n                         to a great ruler like Lord Farquaad.\n \n                         \n                                     SHREK\n                         Yeah, well, maybe you're right, Princess. \n                         But I'll let you do the \"measuring\" \n                         when you see him tomorrow.\n \n                                     FIONA\n                         (looks at the setting sun) Tomorrow? \n                         It'll take that long? Shouldn't we stop \n                         to make camp?\n \n                                     SHREK\n                         No, that'll take longer. We can keep \n                         going.\n \n                                     FIONA\n                         But there's robbers in the woods.\n\n                                     DONKEY\n                         Whoa! Time out, Shrek! Camp is starting \n                         to sound good.\n \n                                     SHREK\n                         Hey, come on. I'm scarier than anything \n                         we're going to see in this forest.\n \n                         \n                                     FIONA\n                         I need to find somewhere to camp now!\n \n                         \n               Both Donkey and Shrek's ears lower as they shrink away from her.\n \n               \n               MOUNTAIN CLIFF\n\n               Shrek has found a cave that appears to be in good order. He shoves \n               a stone boulder out of the way to reveal the cave.\n \n                                     SHREK\n                         Hey! Over here.\n\n                                     DONKEY\n                         Shrek, we can do better than that. I \n                         don't think this is fit for a princess.\n \n                         \n                                     FIONA\n                         No, no, it's perfect. It just needs \n                         a few homey touches.\n \n                                     SHREK\n                         Homey touches? Like what? (he hears \n                         a tearing noise and looks over at Fiona \n                         who has torn the bark off of a tree.)\n \n                         \n                                     FIONA\n                         A door? Well, gentlemen, I bid thee \n                         good night. (goes into the cave and \n                         puts the bark door up behind her)\n \n                         \n                                     DONKEY\n                         You want me to read you a bedtime story? \n                         I will.\n \n                                     FIONA\n                         (os) I said good night!\n\n               Shrek looks at Donkey for a second and then goes to move the \n               boulder back in front of the entrance to the cave with Fiona \n               still inside.\n \n                                     DONKEY\n                         Shrek, What are you doing?\n\n                                     SHREK\n                         (laughs) I just- - You know - - Oh, \n                         come on. I was just kidding.\n \n               LATER THAT NIGHT\n\n               Shrek and Donkey are sitting around a campfire. They are staring \n               up into the sky as Shrek points out certain star constellations \n               to Donkey.\n \n                                     SHREK\n                         And, uh, that one, that's Throwback, \n                         the only ogre to ever spit over three \n                         wheat fields.\n \n                                     DONKEY\n                         Right. Yeah. Hey, can you tell my future \n                         from these stars?\n \n                                     SHREK\n                         The stars don't tell the future, Donkey. \n                         They tell stories. Look, there's Bloodnut, \n                         the Flatulent. You can guess what he's \n                         famous for.\n \n                                     DONKEY\n                         I know you're making this up.\n\n                                     SHREK\n                         No, look. There he is, and there's the \n                         group of hunters running away from his \n                         stench.\n \n                                     DONKEY\n                         That ain't nothin' but a bunch of little \n                         dots.\n \n                                     SHREK\n                         You know, Donkey, sometimes things are \n                         more than they appear. Hmm? Forget it.\n \n                         \n                                     DONKEY\n                         (heaves a big sigh) Hey, Shrek, what \n                         we gonna do when we get our swamp anyway?\n \n                         \n                                     SHREK\n                         Our swamp?\n\n                                     DONKEY\n                         You know, when we're through rescuing \n                         the princess.\n \n                                     SHREK\n                         We? Donkey, there's no \"we\". There's \n                         no \"our\". There's just me and my swamp. \n                         The first thing I'm gonna do is build \n                         a ten-foot wall around my land.\n \n                                     DONKEY\n                         You cut me deep, Shrek. You cut me real \n                         deep just now. You know what I think? \n                         I think this whole wall thing is just \n                         a way to keep somebody out.\n \n                                     SHREK\n                         No, do ya think?\n\n                                     DONKEY\n                         Are you hidin' something?\n\n                                     SHREK\n                         Never mind, Donkey.\n\n                                     DONKEY\n                         Oh, this is another one of those onion \n                         things, isn't it?\n \n                                     SHREK\n                         No, this is one of those drop-it and \n                         leave-it alone things.\n \n                                     DONKEY\n                         Why don't you want to talk about it?\n \n                         \n                                     SHREK\n                         Why do you want to talk about it?\n\n                                     DONKEY\n                         Why are you blocking?\n\n                                     SHREK\n                         I'm not blocking.\n\n                                     DONKEY\n                         Oh, yes, you are.\n\n                                     SHREK\n                         Donkey, I'm warning you.\n\n                                     DONKEY\n                         Who you trying to keep out?\n\n                                     SHREK\n                         Everyone! Okay?\n\n                                     DONKEY\n                         (pause) Oh, now we're gettin' somewhere. \n                         (grins)\n \n               At this point Fiona pulls the 'door' away from the entrance to \n               the cave and peaks out. Neither of the guys see her.\n \n                                     SHREK\n                         Oh! For the love of Pete! (gets up and \n                         walks over to the edge of the cliff \n                         and sits down)\n \n                                     DONKEY\n                         What's your problem? What you got against \n                         the whole world anyway?\n \n                                     SHREK\n                         Look, I'm not the one with the problem, \n                         okay? It's the world that seems to have \n                         a problem with me. People take one look \n                         at me and go. \"Aah! Help! Run! A big, \n                         stupid, ugly ogre!\" They judge me before \n                         they even know me. That's why I'm better \n                         off alone.\n \n                                     DONKEY\n                         You know what? When we met, I didn't \n                         think you was just a big, stupid, ugly \n                         ogre.\n \n                                     SHREK\n                         Yeah, I know.\n\n                                     DONKEY\n                         So, uh, are there any donkeys up there?\n \n                         \n                                     SHREK\n                         Well, there's, um, Gabby, the Small \n                         and Annoying.\n \n                                     DONKEY\n                         Okay, okay, I see it now. The big shiny \n                         one, right there. That one there?\n \n                         \n               Fiona puts the door back.\n\n                                     SHREK\n                         That's the moon.\n\n                                     DONKEY\n                         Oh, okay.\n\n               DuLoc - Farquaad's Bedroom\n\n               The camera pans over a lot of wedding stuff. Soft music plays \n               in the background. Farquaad is in bed, watching as the Magic \n               Mirror shows him Princess Fiona.\n \n                                     FARQUAAD\n                         Again, show me again. Mirror, mirror, \n                         show her to me. Show me the princess.\n \n                         \n                                     MIRROR\n                         Hmph.\n\n               The Mirror rewinds and begins to play again from the beginning.\n \n               \n                                     FARQUAAD\n                         Ah. Perfect.\n\n               Farquaad looks down at his bare chest and pulls the sheet up \n               to cover himself as though Fiona could see him as he gazes sheepishly \n               at her image in the mirror.\n \n               MORNING\n\n               Fiona walks out of the cave. She glances at Shrek and Donkey \n               who are still sleeping. She wanders off into the woods and comes \n               across a blue bird. She begins to sing. The bird sings along \n               with her. She hits higher and higher notes and the bird struggles \n               to keep up with her. Suddenly the pressure of the note is too \n               big and the bird explodes. Fiona looks a little sheepish, but \n               she eyes the eggs that the bird left behind. Time lapse, Fiona \n               is now cooking the eggs for breakfast. Shrek and Donkey are still \n               sleeping. Shrek wakes up and looks at Fiona. Donkey's talking \n               in his sleep.\n \n                                     DONKEY\n                         (quietly) Mmm, yeah, you know I like \n                         it like that. Come on, baby. I said \n                         I like it.\n \n                                     SHREK\n                         Donkey, wake up. (shakes him)\n\n                                     DONKEY\n                         Huh? What?\n\n                                     SHREK\n                         Wake up.\n\n                                     DONKEY\n                         What? (stretches and yawns)\n\n                                     FIONA\n                         Good morning. Hm, how do you like your \n                         eggs?\n \n                                     DONKEY\n                         Oh, good morning, Princess!\n\n               Fiona gets up and sets the eggs down in front of them.\n\n                                     SHREK\n                         What's all this about?\n\n                                     FIONA\n                         You know, we kind of got off to a bad \n                         start yesterday. I wanted to make it \n                         up to you. I mean, after all, you did \n                         rescue me.\n \n                                     SHREK\n                         Uh, thanks.\n\n               Donkey sniffs the eggs and licks his lips.\n\n                                     FIONA\n                         Well, eat up. We've got a big day ahead \n                         of us. (walks off)\n \n               LATER\n\n               They are once again on their way. They are walking through the \n               forest. Shrek belches.\n \n                                     DONKEY\n                         Shrek!\n\n                                     SHREK\n                         What? It's a compliment. Better out \n                         than in, I always say. (laughs)\n \n                                     DONKEY\n                         Well, it's no way to behave in front \n                         of a princess.\n \n               Fiona belches\n\n                                     FIONA\n                         Thanks.\n\n                                     DONKEY\n                         She's as nasty as you are.\n\n                                     SHREK\n                         (chuckles) You know, you're not exactly \n                         what I expected.\n \n                                     FIONA\n                         Well, maybe you shouldn't judge people \n                         before you get to know them.\n \n               She smiles and then continues walking, singing softly. Suddenly \n               from out of nowhere, a man swings down and swoops Fiona up into \n               a tree.\n \n                                     ROBIN HOOD\n                         La liberte! Hey!\n\n                                     SHREK\n                         Princess!\n\n                                     FIONA\n                         (to Robin Hood) What are you doing?\n \n                         \n                                     ROBIN HOOD\n                         Be still, mon cherie, for I am you savior! \n                         And I am rescuing you from this green...(kisses \n                         up her arm while Fiona pulls back in \n                         disgust)...beast.\n \n                                     SHREK\n                         Hey! That's my princess! Go find you \n                         own!\n \n                                     ROBIN HOOD\n                         Please, monster! Can't you see I'm a \n                         little busy here?\n \n                                     FIONA\n                         (getting fed up) Look, pal, I don't \n                         know who you think you are!\n \n                                     ROBIN HOOD\n                         Oh! Of course! Oh, how rude. Please \n                         let me introduce myself. Oh, Merry Men. \n                         (laughs)\n \n               Suddenly an accordion begins to play and the Merry men pop out \n               from the bushes. They begin to sing Robin's theme song.\n \n                                     MERRY MEN\n                         Ta, dah, dah, dah, whoo.\n\n                                     ROBIN HOOD\n                         I steal from the rich and give to the \n                         needy.\n \n                                     MERRY MEN\n                         He takes a wee percentage,\n\n                                     ROBIN HOOD\n                         But I'm not greedy. I rescue pretty \n                         damsels, man, I'm good.\n \n                                     MERRY MEN\n                         What a guy, Monsieur Hood.\n\n                                     ROBIN HOOD\n                         Break it down. I like an honest fight \n                         and a saucy little maid...\n \n                                     MERRY MEN\n                         What he's basically saying is he likes \n                         to get...\n \n                                     ROBIN HOOD\n                         Paid. So...When an ogre in the bush \n                         grabs a lady by the tush. That's bad.\n \n                         \n                                     MERRY MEN\n                         That's bad.\n\n                                     ROBIN HOOD\n                         When a beauty's with a beast it makes \n                         me awfully mad.\n \n                                     MERRY MEN\n                         He's mad, he's really, really mad.\n \n                         \n                                     ROBIN HOOD\n                         I'll take my blade and ram it through \n                         your heart, keep your eyes on me, boys \n                         'cause I'm about to start...\n \n               There is a grunt as Fiona swings down from the tree limb and \n               knocks Robin Hood unconscious.\n \n                                     FIONA\n                         Man, that was annoying!\n\n               Shrek looks at her in admiration.\n\n                                     MERRY MAN\n                         Oh, you little- - (shoots an arrow at \n                         Fiona but she ducks out of the way)\n \n                         \n               The arrow flies toward Donkey who jumps into Shrek's arms to \n               get out of the way. The arrow proceeds to just bounce off a tree.\n \n               \n               Another fight sequence begins and Fiona gives a karate yell and \n               then proceeds to beat the crap out of the Merry Men. There is \n               a very interesting 'Matrix' moment here when Fiona pauses in \n               mid-air to fix her hair. Finally all of the Merry Men are down, \n               and Fiona begins walking away.\n \n                                     FIONA\n                         Uh, shall we?\n\n                                     SHREK\n                         Hold the phone. (drops Donkey and begins \n                         walking after Fiona) Oh! Whoa, whoa, \n                         whoa. Hold on now. Where did that come \n                         from?\n \n                                     FIONA\n                         What?\n\n                                     SHREK\n                         That! Back there. That was amazing! \n                         Where did you learn that?\n \n                                     FIONA\n                         Well...(laughs) when one lives alone, \n                         uh, one has to learn these things in \n                         case there's a...(gasps and points) \n                         there's an arrow in your butt!\n \n                                     SHREK\n                         What? (turns and looks) Oh, would you \n                         look at that? (he goes to pull it out \n                         but flinches because it's tender)\n \n                         \n                                     FIONA\n                         Oh, no. This is all my fault. I'm so \n                         sorry.\n \n                                     DONKEY\n                         (walking up) Why? What's wrong?\n\n                                     FIONA\n                         Shrek's hurt.\n\n                                     DONKEY\n                         Shrek's hurt. Shrek's hurt? Oh, no, \n                         Shrek's gonna die.\n \n                                     SHREK\n                         Donkey, I'm okay.\n\n                                     DONKEY\n                         You can't do this to me, Shrek. I'm \n                         too young for you to die. Keep you legs \n                         elevated. Turn your head and cough. \n                         Does anyone know the Heimlich?\n \n                                     FIONA\n                         Donkey! Calm down. If you want to help \n                         Shrek, run into the woods and find me \n                         a blue flower with red thorns.\n \n                                     DONKEY\n                         Blue flower, red thorns. Okay, I'm on \n                         it. Blue flower, red thorns. Don't die \n                         Shrek. If you see a long tunnel, stay \n                         away from the light!\n \n                                     SHREK & FIONA\n                         Donkey!\n\n                                     DONKEY\n                         Oh, yeah. Right. Blue flower, red thorns. \n                         (runs off)\n \n                                     SHREK\n                         What are the flowers for?\n\n                                     FIONA\n                         (like it's obvious) For getting rid \n                         of Donkey.\n \n                                     SHREK\n                         Ah.\n\n                                     FIONA\n                         Now you hold still, and I'll yank this \n                         thing out. (gives the arrow a little \n                         pull)\n \n                                     SHREK\n                         (jumps away) Ow! Hey! Easy with the \n                         yankin'.\n \n               As they continue to talk Fiona keeps going after the arrow and \n               Shrek keeps dodging her hands.\n \n                                     FIONA\n                         I'm sorry, but it has to come out.\n \n                         \n                                     SHREK\n                         No, it's tender.\n\n                                     FIONA\n                         Now, hold on.\n\n                                     SHREK\n                         What you're doing is the opposite of \n                         help.\n \n                                     FIONA\n                         Don't move.\n\n                                     SHREK\n                         Look, time out.\n\n                                     FIONA\n                         Would you...(grunts as Shrek puts his \n                         hand over her face to stop her from \n                         getting at the arrow) Okay. What do \n                         you propose we do?\n \n               ELSEWHERE\n\n               Donkey is still looking for the special flower.\n\n                                     DONKEY\n                         Blue flower, red thorns. Blue flower, \n                         red thorns. Blue flower, red thorns. \n                         This would be so much easier if I wasn't \n                         color-blind! Blue flower, red thorns.\n \n                         \n                                     SHREK\n                         (os) Ow!\n\n                                     DONKEY\n                         Hold on, Shrek! I'm comin'! (rips a \n                         flower off a nearby bush that just happens \n                         to be a blue flower with red thorns)\n \n                         \n               THE FOREST PATH\n\n                                     SHREK\n                         Ow! Not good.\n\n                                     FIONA\n                         Okay. Okay. I can nearly see the head. \n                         (Shrek grunts as she pulls) It's just \n                         about...\n \n                                     SHREK\n                         Ow! Ohh! (he jerks and manages to fall \n                         over with Fiona on top of him)\n \n                                     DONKEY\n                         Ahem.\n\n                                     SHREK\n                         (throwing Fiona off of him) Nothing \n                         happend. We were just, uh - -\n \n                                     DONKEY\n                         Look, if you wanted to be alone, all \n                         you had to do was ask. Okay?\n \n                                     SHREK\n                         Oh, come on! That's the last thing on \n                         my mind. The princess here was just- \n                         - (Fiona pulls the arrow out) Ugh! (he \n                         turns to look at Fiona who holds up \n                         the arrow with a smile) Ow!\n \n                                     DONKEY\n                         Hey, what's that? (nervous chuckle) \n                         That's...is that blood?\n \n               Donkey faints. Shrek walks over and picks him up as they continue \n               on their way.\n \n               There is a montage of scenes as the group heads back to DuLoc. \n               Shrek crawling up to the top of a tree to make it fall over a \n               small brook so that Fiona won't get wet. Shrek then gets up as \n               Donkey is just about to cross the tree and the tree swings back \n               into it's upright position and Donkey flies off. Shrek swatting \n               and a bunch of flies and mosquitoes. Fiona grabs a nearby spiderweb \n               that's on a tree branch and runs through the field swinging it \n               around to catch the bugs. She then hands it to Shrek who begins \n               eating like it's a treat. As he walks off she licks her fingers. \n               Shrek catching a toad and blowing it up like a balloon and presenting \n               it to Fiona. Fiona catching a snake, blowing it up, fashioning \n               it into a balloon animal and presenting it to Shrek. The group \n               arriving at a windmill that is near DuLoc.\n \n               WINDMILL\n\n                                     SHREK\n                         There it is, Princess. Your future awaits \n                         you.\n \n                                     FIONA\n                         That's DuLoc?\n\n                                     DONKEY\n                         Yeah, I know. You know, Shrek thinks \n                         Lord Farquaad's compensating for something, \n                         which I think means he has a really...(Shrek \n                         steps on his hoof) Ow!\n \n                                     SHREK\n                         Um, I, uh- - I guess we better move \n                         on.\n \n                                     FIONA\n                         Sure. But, Shrek? I'm - - I'm worried \n                         about Donkey.\n \n                                     SHREK\n                         What?\n\n                                     FIONA\n                         I mean, look at him. He doesn't look \n                         so good.\n \n                                     DONKEY\n                         What are you talking about? I'm fine.\n \n                         \n                                     FIONA\n                         (kneels to look him in the eyes) That's \n                         what they always say, and then next \n                         thing you know, you're on your back. \n                         (pause) Dead.\n \n                                     SHREK\n                         You know, she's right. You look awful. \n                         Do you want to sit down?\n \n                                     FIONA\n                         Uh, you know, I'll make you some tea.\n \n                         \n                                     DONKEY\n                         I didn't want to say nothin', but I \n                         got this twinge in my neck, and when \n                         I turn my head like this, look, (turns \n                         his neck in a very sharp way until his \n                         head is completely sideways) Ow! See?\n \n                         \n                                     SHREK\n                         Who's hungry? I'll find us some dinner.\n \n                         \n                                     FIONA\n                         I'll get the firewood.\n\n                                     DONKEY\n                         Hey, where you goin'? Oh, man, I can't \n                         feel my toes! (looks down and yelps) \n                         I don't have any toes! I think I need \n                         a hug.\n \n               SUNSET\n\n               Shrek has built a fire and is cooking the rest of dinner while \n               Fiona eats.\n \n                                     FIONA\n                         Mmm. This is good. This is really good. \n                         What is this?\n \n                                     SHREK\n                         Uh, weed rat. Rotisserie style.\n\n                                     FIONA\n                         No kidding. Well, this is delicious.\n \n                         \n                                     SHREK\n                         Well, they're also great in stews. Now, \n                         I don't mean to brag, but I make a mean \n                         weed rat stew. (chuckles)\n \n               Fiona looks at DuLoc and sighs.\n\n                                     FIONA\n                         I guess I'll be dining a little differently \n                         tomorrow night.\n \n                                     SHREK\n                         Maybe you can come visit me in the swamp \n                         sometime. I'll cook all kind of stuff \n                         for you. Swamp toad soup, fish eye tartare \n                         - - you name it.\n \n                                     FIONA\n                         (smiles) I'd like that.\n\n               They smiles at each other.\n\n                                     SHREK\n                         Um, Princess?\n\n                                     FIONA\n                         Yes, Shrek?\n\n                                     SHREK\n                         I, um, I was wondering...are you...(sighs) \n                         Are you gonna eat that?\n \n                                     DONKEY\n                         (chuckles) Man, isn't this romantic? \n                         Just look at that sunset.\n \n                                     FIONA\n                         (jumps up) Sunset? Oh, no! I mean, it's \n                         late. I-It's very late.\n \n                                     SHREK\n                         What?\n\n                                     DONKEY\n                         Wait a minute. I see what's goin' on \n                         here. You're afraid of the dark, aren't \n                         you?\n \n                                     FIONA\n                         Yes! Yes, that's it. I'm terrified. \n                         You know, I'd better go inside.\n \n                                     DONKEY\n                         Don't feel bad, Princess. I used to \n                         be afraid of the dark, too, until - \n                         - Hey, no, wait. I'm still afraid of \n                         the dark.\n \n               Shrek sighs\n\n                                     FIONA\n                         Good night.\n\n                                     SHREK\n                         Good night.\n\n               Fiona goes inside the windmill and closes the door. Donkey looks \n               at Shrek with a new eye.\n \n                                     DONKEY\n                         Ohh! Now I really see what's goin' on \n                         here.\n \n                                     SHREK\n                         Oh, what are you talkin' about?\n\n                                     DONKEY\n                         I don't even wanna hear it. Look, I'm \n                         an animal, and I got instincts. And \n                         I know you two were diggin' on each \n                         other. I could feel it.\n \n                                     SHREK\n                         You're crazy. I'm just bringing her \n                         back to Farquaad.\n \n                                     DONKEY\n                         Oh, come on, Shrek. Wake up and smell \n                         the pheromones. Just go on in and tell \n                         her how you feel.\n \n                                     SHREK\n                         I- - There's nothing to tell. Besides, \n                         even if I did tell her that, well, you \n                         know - - and I'm not sayin' I do 'cause \n                         I don't - - she's a princess, and I'm \n                         - -\n \n                                     DONKEY\n                         An ogre?\n\n                                     SHREK\n                         Yeah. An ogre.\n\n                                     DONKEY\n                         Hey, where you goin'?\n\n                                     SHREK\n                         To get... move firewood. (sighs)\n\n               Donkey looks over at the large pile of firewood there already \n               is.\n \n               TIME LAPSE\n\n               Donkey opens the door to the Windmill and walks in. Fiona is \n               nowhere to be seen.\n \n                                     DONKEY\n                         Princess? Princess Fiona? Princess, \n                         where are you? Princess?\n \n               Fiona looks at Donkey from the shadows, but we can't see her.\n \n               \n                                     DONKEY\n                         It's very spooky in here. I ain't playing \n                         no games.\n \n               Suddenly Fiona falls from the railing. She gets up only she doesn't \n               look like herself. She looks like an ogre and Donkey starts freaking \n               out.\n \n                                     DONKEY\n                         Aah!\n\n                                     FIONA\n                         Oh, no!\n\n                                     DONKEY\n                         No, help!\n\n                                     FIONA\n                         Shh!\n\n                                     DONKEY\n                         Shrek! Shrek! Shrek!\n\n                                     FIONA\n                         No, it's okay. It's okay.\n\n                                     DONKEY\n                         What did you do with the princess?\n \n                         \n                                     FIONA\n                         Donkey, I'm the princess.\n\n                                     DONKEY\n                         Aah!\n\n                                     FIONA\n                         It's me, in this body.\n\n                                     DONKEY\n                         Oh, my God! You ate the princess. (to \n                         her stomach) Can you hear me?\n \n                                     FIONA\n                         Donkey!\n\n                                     DONKEY\n                         (still aimed at her stomach) Listen, \n                         keep breathing! I'll get you out of \n                         there!\n \n                                     FIONA\n                         No!\n\n                                     DONKEY\n                         Shrek! Shrek! Shrek!\n\n                                     FIONA\n                         Shh.\n\n                                     DONKEY\n                         Shrek!\n\n                                     FIONA\n                         This is me.\n\n               Donkey looks into her eyes as she pets his muzzle, and he quiets \n               down.\n \n                                     DONKEY\n                         Princess? What happened to you? You're, \n                         uh, uh, uh, different.\n \n                                     FIONA\n                         I'm ugly, okay?\n\n                                     DONKEY\n                         Well, yeah! Was it something you ate? \n                         'Cause I told Shrek those rats was a \n                         bad idea. You are what you eat, I said. \n                         Now - -\n \n                                     FIONA\n                         No. I - - I've been this way as long \n                         as I can remember.\n \n                                     DONKEY\n                         What do you mean? Look, I ain't never \n                         seen you like this before.\n \n                                     FIONA\n                         It only happens when sun goes down. \n                         \"By night one way, by day another. This \n                         shall be the norm... until you find \n                         true love's first kiss... and then take \n                         love's true form.\"\n \n                                     DONKEY\n                         Ah, that's beautiful. I didn't know \n                         you wrote poetry.\n \n                                     FIONA\n                         It's a spell. (sigh) When I was a little \n                         girl, a witch cast a spell on me. Every \n                         night I become this. This horrible, \n                         ugly beast! I was placed in a tower \n                         to await the day my true love would \n                         rescue me. That's why I have to marry \n                         Lord Farquaad tomorrow before the sun \n                         sets and he sees me like this. (begins \n                         to cry)\n \n                                     DONKEY\n                         All right, all right. Calm down. Look, \n                         it's not that bad. You're not that ugly. \n                         Well, I ain't gonna lie. You are ugly. \n                         But you only look like this at night. \n                         Shrek's ugly 24-7.\n \n                                     FIONA\n                         But Donkey, I'm a princess, and this \n                         is not how a princess is meant to look.\n \n                         \n                                     DONKEY\n                         Princess, how 'bout if you don't marry \n                         Farquaad?\n \n                                     FIONA\n                         I have to. Only my true love's kiss \n                         can break the spell.\n \n                                     DONKEY\n                         But, you know, um, you're kind of an \n                         orge, and Shrek - - well, you got a \n                         lot in common.\n \n                                     FIONA\n                         Shrek?\n\n               OUTSIDE\n\n               Shrek is walking towards the windmill with a sunflower in his \n               hand.\n \n                                     SHREK\n                         (to himself) Princess, I - - Uh, how's \n                         it going, first of all? Good? Um, good \n                         for me too. I'm okay. I saw this flower \n                         and thought of you because it's pretty \n                         and - - well, I don't really like it, \n                         but I thought you might like it 'cause \n                         you're pretty. But I like you anyway. \n                         I'd - - uh, uh...(sighs) I'm in trouble. \n                         Okay, here we go.\n \n               He walks up to the door and pauses outside when he hears Donkey \n               and Fiona talking.\n \n                                     FIONA\n                         (os) I can't just marry whoever I want. \n                         Take a good look at me, Donkey. I mean, \n                         really, who can ever love a beast so \n                         hideous and ugly? \"Princess\" and \"ugly\" \n                         don't go together. That's why I can't \n                         stay here with Shrek.\n \n               Shrek steps back in shock.\n\n                                     FIONA\n                         (os) My only chance to live happily \n                         ever after is to marry my true love.\n \n                         \n               Shrek heaves a deep sigh. He throws the flower down and walks \n               away.\n \n               INSIDE\n\n                                     FIONA\n                         Don't you see, Donkey? That's just how \n                         it has to be. It's the only way to break \n                         the spell.\n \n                                     DONKEY\n                         You at least gotta tell Shrek the truth.\n \n                         \n                                     FIONA\n                         No! You can't breathe a word. No one \n                         must ever know.\n \n                                     DONKEY\n                         What's the point of being able to talk \n                         if you gotta keep secrets?\n \n                                     FIONA\n                         Promise you won't tell. Promise!\n\n                                     DONKEY\n                         All right, all right. I won't tell him. \n                         But you should. (goes outside) I just \n                         know before this is over, I'm gonna \n                         need a whole lot of serious therapy. \n                         Look at my eye twitchin'.\n \n               Fiona comes out the door and watches him walk away. She looks \n               down and spots the sunflower. She picks it up before going back \n               inside the windmill.\n \n               MORNING\n\n               Donkey is asleep. Shrek is nowhere to be seen. Fiona is still \n               awake. She is plucking petals from the sunflower.\n \n                                     FIONA\n                         I tell him, I tell him not. I tell him, \n                         I tell him not. I tell him. (she quickly \n                         runs to the door and goes outside) Shrek! \n                         Shrek, there's something I want...(she \n                         looks and sees the rising sun, and as \n                         the sun crests the sky she turns back \n                         into a human.)\n \n               Just as she looks back at the sun she sees Shrek stomping towards \n               her.\n \n                                     FIONA\n                         Shrek. Are you all right?\n\n                                     SHREK\n                         Perfect! Never been better.\n\n                                     FIONA\n                         I - - I don't - - There's something \n                         I have to tell you.\n \n                                     SHREK\n                         You don't have to tell me anything, \n                         Princess. I heard enough last night.\n \n                         \n                                     FIONA\n                         You heard what I said?\n\n                                     SHREK\n                         Every word.\n\n                                     FIONA\n                         I thought you'd understand.\n\n                                     SHREK\n                         Oh, I understand. Like you said, \"Who \n                         could love a hideous, ugly beast?\"\n \n                         \n                                     FIONA\n                         But I thought that wouldn't matter to \n                         you.\n \n                                     SHREK\n                         Yeah? Well, it does. (Fiona looks at \n                         him in shock. He looks past her and \n                         spots a group approaching.) Ah, right \n                         on time. Princess, I've brought you \n                         a little something.\n \n               Farquaad has arrived with a group of his men. He looks very regal \n               sitting up on his horse. You would never guess that he's only \n               like 3 feet tall. Donkey wakes up with a yawn as the soldiers \n               march by.\n \n                                     DONKEY\n                         What'd I miss? What'd I miss? (spots \n                         the soldiers) (muffled) Who said that? \n                         Couldn't have been the donkey.\n \n                                     FARQUAAD\n                         Princess Fiona.\n\n                                     SHREK\n                         As promised. Now hand it over.\n\n                                     FARQUAAD\n                         Very well, ogre. (holds out a piece \n                         of paper) The deed to your swamp, cleared \n                         out, as agreed. Take it and go before \n                         I change my mind. (Shrek takes the paper) \n                         Forgive me, Princess, for startling \n                         you, but you startled me, for I have \n                         never seen such a radiant beauty before. \n                         I'm Lord Farquaad.\n \n                                     FIONA\n                         Lord Farquaad? Oh, no, no. (Farquaad \n                         snaps his fingers) Forgive me, my lord, \n                         for I was just saying a short... (Watches \n                         as Farquaad is lifted off his horse \n                         and set down in front of her. He comes \n                         to her waist.) farewell.\n \n                                     FARQUAAD\n                         Oh, that is so sweet. You don't have \n                         to waste good manners on the ogre. It's \n                         not like it has feelings.\n \n                                     FIONA\n                         No, you're right. It doesn't.\n\n               Donkey watches this exchange with a curious look on his face.\n \n               \n                                     FARQUAAD\n                         Princess Fiona, beautiful, fair, flawless \n                         Fiona. I ask your hand in marriage. \n                         Will you be the perfect bride for the \n                         perfect groom?\n \n                                     FIONA\n                         Lord Farquaad, I accept. Nothing would \n                         make - -\n \n                                     FARQUAAD\n                         (interrupting) Excellent! I'll start \n                         the plans, for tomorrow we wed!\n \n                                     FIONA\n                         No! I mean, uh, why wait? Let's get \n                         married today before the sun sets.\n \n                         \n                                     FARQUAAD\n                         Oh, anxious, are you? You're right. \n                         The sooner, the better. There's so much \n                         to do! There's the caterer, the cake, \n                         the band, the guest list. Captain, round \n                         up some guests! (a guard puts Fiona \n                         on the back of his horse)\n \n                                     FIONA\n                         Fare-thee-well, ogre.\n\n               Farquaad's whole party begins to head back to DuLoc. Donkey watches \n               them go.\n \n                                     DONKEY\n                         Shrek, what are you doing? You're letting \n                         her get away.\n \n                                     SHREK\n                         Yeah? So what?\n\n                                     DONKEY\n                         Shrek, there's something about her you \n                         don't know. Look, I talked to her last \n                         night, She's - -\n \n                                     SHREK\n                         I know you talked to her last night. \n                         You're great pals, aren't ya? Now, if \n                         you two are such good friends, why don't \n                         you follow her home?\n \n                                     DONKEY\n                         Shrek, I - - I wanna go with you.\n\n                                     SHREK\n                         I told you, didn't I? You're not coming \n                         home with me. I live alone! My swamp! \n                         Me! Nobody else! Understand? Nobody! \n                         Especially useless, pathetic, annoying, \n                         talking donkeys!\n \n                                     DONKEY\n                         But I thought - -\n\n                                     SHREK\n                         Yeah. You know what? You thought wrong! \n                         (stomps off)\n \n                                     DONKEY\n                         Shrek.\n\n               Montage of different scenes. Shrek arriving back home. Fiona \n               being fitted for the wedding dress. Donkey at a stream running \n               into the dragon. Shrek cleaning up his house. Fiona eating dinner \n               alone. Shrek eating dinner alone.\n \n               SHREK'S HOME\n\n               Shrek is eating dinner when he hears a sound outside. He goes \n               outside to investigate.\n \n                                     SHREK\n                         Donkey? (Donkey ignores him and continues \n                         with what he's doing.) What are you \n                         doing?\n \n                                     DONKEY\n                         I would think, of all people, you would \n                         recognize a wall when you see one.\n \n                         \n                                     SHREK\n                         Well, yeah. But the wall's supposed \n                         to go around my swamp, not through it.\n \n                         \n                                     DONKEY\n                         It is around your half. See that's your \n                         half, and this is my half.\n \n                                     SHREK\n                         Oh! Your half. Hmm.\n\n                                     DONKEY\n                         Yes, my half. I helped rescue the princess. \n                         I did half the work. I get half the \n                         booty. Now hand me that big old rock, \n                         the one that looks like your head.\n \n                         \n                                     SHREK\n                         Back off!\n\n                                     DONKEY\n                         No, you back off.\n\n                                     SHREK\n                         This is my swamp!\n\n                                     DONKEY\n                         Our swamp.\n\n                                     SHREK\n                         (grabs the tree branch Donkey is working \n                         with) Let go, Donkey!\n \n                                     DONKEY\n                         You let go.\n\n                                     SHREK\n                         Stubborn jackass!\n\n                                     DONKEY\n                         Smelly ogre.\n\n                                     SHREK\n                         Fine! (drops the tree branch and walks \n                         away)\n \n                                     DONKEY\n                         Hey, hey, come back here. I'm not through \n                         with you yet.\n \n                                     SHREK\n                         Well, I'm through with you.\n\n                                     DONKEY\n                         Uh-uh. You know, with you it's always, \n                         \"Me, me, me!\" Well, guess what! Now \n                         it's my turn! So you just shut up and \n                         pay attention! You are mean to me. You \n                         insult me and you don't appreciate anything \n                         that I do! You're always pushing me \n                         around or pushing me away.\n \n                                     SHREK\n                         Oh, yeah? Well, if I treated you so \n                         bad, how come you came back?\n \n                                     DONKEY\n                         Because that's what friends do! They \n                         forgive each other!\n \n                                     SHREK\n                         Oh, yeah. You're right, Donkey. I forgive \n                         you... for stabbin' me in the back! \n                         (goes into the outhouse and slams the \n                         door)\n \n                                     DONKEY\n                         Ohh! You're so wrapped up in layers, \n                         onion boy, you're afraid of your own \n                         feelings.\n \n                                     SHREK\n                         (os) Go away!\n\n                                     DONKEY\n                         There you are , doing it again just \n                         like you did to Fiona. All she ever \n                         do was like you, maybe even love you.\n \n                         \n                                     SHREK\n                         (os) Love me? She said I was ugly, a \n                         hideous creature. I heard the two of \n                         you talking.\n \n                                     DONKEY\n                         She wasn't talkin' about you. She was \n                         talkin' about, uh, somebody else.\n \n                         \n                                     SHREK\n                         (opens the door and comes out) She wasn't \n                         talking about me? Well, then who was \n                         she talking about?\n \n                                     DONKEY\n                         Uh-uh, no way. I ain't saying anything. \n                         You don't wanna listen to me. Right? \n                         Right?\n \n                                     SHREK\n                         Donkey!\n\n                                     DONKEY\n                         No!\n\n                                     SHREK\n                         Okay, look. I'm sorry, all right? (sigh) \n                         I'm sorry. I guess I am just a big, \n                         stupid, ugly ogre. Can you forgive me?\n \n                         \n                                     DONKEY\n                         Hey, that's what friends are for, right?\n \n                         \n                                     SHREK\n                         Right. Friends?\n\n                                     DONKEY\n                         Friends.\n\n                                     SHREK\n                         So, um, what did Fiona say about me?\n \n                         \n                                     DONKEY\n                         What are you asking me for? Why don't \n                         you just go ask her?\n \n                                     SHREK\n                         The wedding! We'll never make it in \n                         time.\n \n                                     DONKEY\n                         Ha-ha-ha! Never fear, for where, there's \n                         a will, there's a way and I have a way. \n                         (whistles)\n \n               Suddenly the dragon arrives overhead and flies low enough so \n               they can climb on.\n \n                                     SHREK\n                         Donkey?\n\n                                     DONKEY\n                         I guess it's just my animal magnetism.\n \n                         \n               They both laugh.\n\n                                     SHREK\n                         Aw, come here, you. (gives Donkey a \n                         noogie)\n \n                                     DONKEY\n                         All right, all right. Don't get all \n                         slobbery. No one likes a kiss ass. All \n                         right, hop on and hold on tight. I haven't \n                         had a chance to install the seat belts \n                         yet.\n \n               They climb aboard the dragon and she takes off for DuLoc.\n\n               DULOC - CHURCH\n\n               Fiona and Farquaad are getting married. The whole town is there. \n               The prompter card guy holds up a card that says 'Revered Silence'.\n \n               \n                                     PRIEST\n                         People of DuLoc, we gather here today \n                         to bear witness to the union....\n \n                                     FIONA\n                         (eyeing the setting sun) Um-\n\n                                     PRIEST\n                         ...of our new king...\n\n                                     FIONA\n                         Excuse me. Could we just skip ahead \n                         to the \"I do's\"?\n \n                                     FARQUAAD\n                         (chuckles and then motions to the priest \n                         to indulge Fiona) Go on.\n \n               COURTYARD\n\n               Some guards are milling around. Suddenly the dragon lands with \n               a boom. The guards all take off running.\n \n                                     DONKEY\n                         (to Dragon) Go ahead, HAVE SOME FUN. \n                         If we need you, I'll whistle. How about \n                         that? (she nods and goes after the guards) \n                         Shrek, wait, wait! Wait a minute! You \n                         wanna do this right, don't you?\n \n                                     SHREK\n                         (at the Church door) What are you talking \n                         about?\n \n                                     DONKEY\n                         There's a line you gotta wait for. The \n                         preacher's gonna say, \"Speak now or \n                         forever hold your peace.\" That's when \n                         you say, \"I object!\"\n \n                                     SHREK\n                         I don't have time for this!\n\n                                     DONKEY\n                         Hey, wait. What are you doing? Listen \n                         to me! Look, you love this woman, don't \n                         you?\n \n                                     SHREK\n                         Yes.\n\n                                     DONKEY\n                         You wanna hold her?\n\n                                     SHREK\n                         Yes.\n\n                                     DONKEY\n                         Please her?\n\n                                     SHREK\n                         Yes!\n\n                                     DONKEY\n                         (singing James Brown style) Then you \n                         got to, got to try a little tenderness. \n                         (normal) The chicks love that romantic \n                         crap!\n \n                                     SHREK\n                         All right! Cut it out. When does this \n                         guy say the line?\n \n                                     DONKEY\n                         We gotta check it out.\n\n               INSIDE CHURCH\n\n               As the priest talks we see Donkey's shadow through one of the \n               windows Shrek tosses him up so he can see.\n \n                                     PRIEST\n                         And so, by the power vested in me...\n \n                         \n               Outside\n\n                                     SHREK\n                         What do you see?\n\n                                     DONKEY\n                         The whole town's in there.\n\n               Inside\n\n                                     PRIEST\n                         I now pronounce you husband and wife...\n \n                         \n               Outside\n\n                                     DONKEY\n                         They're at the altar.\n\n               Inside\n\n                                     PRIEST\n                         ...king and queen.\n\n               Outside\n\n                                     DONKEY\n                         Mother Fletcher! He already said it.\n \n                         \n                                     SHREK\n                         Oh, for the love of Pete!\n\n               He runs inside without catching Donkey, who hits the ground hard.\n \n               \n               INSIDE CHURCH\n\n                                     SHREK\n                         (running toward the alter) I object!\n \n                         \n                                     FIONA\n                         Shrek?\n\n               The whole congregation gasps as they see Shrek.\n\n                                     FARQUAAD\n                         Oh, now what does he want?\n\n                                     SHREK\n                         (to congregation as he reaches the front \n                         of the Church) Hi, everyone. Havin' \n                         a good time, are ya? I love DuLoc, first \n                         of all. Very clean.\n \n                                     FIONA\n                         What are you doing here?\n\n                                     SHREK\n                         Really, it's rude enough being alive \n                         when no one wants you, but showing up \n                         uninvited to a wedding...\n \n                                     SHREK\n                         Fiona! I need to talk to you.\n\n                                     FIONA\n                         Oh, now you wanna talk? It's a little \n                         late for that, so if you'll excuse me \n                         - -\n \n                                     SHREK\n                         But you can't marry him.\n\n                                     FIONA\n                         And why not?\n\n                                     SHREK\n                         Because- - Because he's just marring \n                         you so he can be king.\n \n                                     FARQUAAD\n                         Outrageous! Fiona, don't listen to him.\n \n                         \n                                     SHREK\n                         He's not your true love.\n\n                                     FIONA\n                         And what do you know about true love?\n \n                         \n                                     SHREK\n                         Well, I - - Uh - - I mean - -\n\n                                     FARQUAAD\n                         Oh, this is precious. The ogee has fallen \n                         in love with the princess! Oh, good \n                         Lord. (laughs)\n \n               The prompter card guy holds up a card that says 'Laugh'. The \n               whole congregation laughs.\n \n                                     FARQUAAD\n                         An ogre and a princess!\n\n                                     FIONA\n                         Shrek, is this true?\n\n                                     FARQUAAD\n                         Who cares? It's preposterous! Fiona, \n                         my love, we're but a kiss away from \n                         our \"happily ever after.\" Now kiss me! \n                         (puckers his lips and leans toward her, \n                         but she pulls back.)\n \n                                     FIONA\n                         (looking at the setting sun) \"By night \n                         one way, by day another.\" (to Shrek) \n                         I wanted to show you before.\n \n               She backs up and as the sun sets she changes into her ogre self. \n               She gives Shrek a sheepish smile.\n \n                                     SHREK\n                         Well, uh, that explains a lot. (Fiona \n                         smiles)\n \n                                     FARQUAAD\n                         Ugh! It's disgusting! Guards! Guards! \n                         I order you to get that out of my sight \n                         now! Get them! Get them both!\n \n               The guards run in and separate Fiona and Shrek. Shrek fights \n               them.\n \n                                     SHREK\n                         No, no!\n\n                                     FIONA\n                         Shrek!\n\n                                     FARQUAAD\n                         This hocus-pocus alters nothing. This \n                         marriage is binding, and that makes \n                         me king! See? See?\n \n                                     FIONA\n                         No, let go of me! Shrek!\n\n                                     SHREK\n                         No!\n\n                                     FARQUAAD\n                         Don't just stand there, you morons.\n \n                         \n                                     SHREK\n                         Get out of my way! Fiona! Arrgh!\n\n                                     FARQUAAD\n                         I'll make you regret the day we met. \n                         I'll see you drawn and quartered! You'll \n                         beg for death to save you!\n \n                                     FIONA\n                         No, Shrek!\n\n                                     FARQUAAD\n                         (hold a dagger to Fiona's throat) And \n                         as for you, my wife...\n \n                                     SHREK\n                         Fiona!\n\n                                     FARQUAAD\n                         I'll have you locked back in that tower \n                         for the rest of your days! I'm king!\n \n                         \n               Shrek manages to get a hand free and he whistles.\n\n                                     FARQUAAD\n                         I will have order! I will have perfection! \n                         I will have - - (Donkey and the dragon \n                         show up and the dragon leans down and \n                         eats Farquaad) Aaaah! Aah!\n \n                                     DONKEY\n                         All right. Nobody move. I got a dragon \n                         here, and I'm not afraid to use it. \n                         (The dragon roars.) I'm a donkey on \n                         the edge!\n \n               The dragon belches and Farquaad's crown flies out of her mouth \n               and falls to the ground.\n \n                                     DONKEY\n                         Celebrity marriages. They never last, \n                         do they?\n \n               The congregation cheers.\n\n                                     DONKEY\n                         Go ahead, Shrek.\n\n                                     SHREK\n                         Uh, Fiona?\n\n                                     FIONA\n                         Yes, Shrek?\n\n                                     SHREK\n                         I - - I love you.\n\n                                     FIONA\n                         Really?\n\n                                     SHREK\n                         Really, really.\n\n                                     FIONA\n                         (smiles) I love you too.\n\n               Shrek and Fiona kiss. Thelonius takes one of the cards and writes \n               'Awwww' on the back and then shows it to the congregation.\n \n               \n                                     CONGREGATION\n                         Aawww!\n\n               Suddenly the magic of the spell pulls Fiona away. She's lifted \n               up into the air and she hovers there while the magic works around \n               her.\n \n                                     WHISPERS\n                         \"Until you find true love's first kiss \n                         and then take love's true form. Take \n                         love's true form. Take love's true form.\"\n \n                         \n               Suddenly Fiona's eyes open wide. She's consumed by the spell \n               and then is slowly lowered to the ground.\n \n                                     SHREK\n                         (going over to her) Fiona? Fiona. Are \n                         you all right?\n \n                                     FIONA\n                         (standing up, she's still an ogre) Well, \n                         yes. But I don't understand. I'm supposed \n                         to be beautiful.\n \n                                     SHREK\n                         But you ARE beautiful.\n\n               They smile at each other.\n\n                                     DONKEY\n                         (chuckles) I was hoping this would be \n                         a happy ending.\n \n               Shrek and Fiona kiss...and the kiss fades into...\n\n               THE SWAMP\n\n               ...their wedding kiss. Shrek and Fiona are now married. 'I'm \n               a Believer' by Smashmouth is played in the background. Shrek \n               and Fiona break apart and run through the crowd to their awaiting \n               carriage. Which is made of a giant onion. Fiona tosses her bouquet \n               which both Cinderella and Snow White try to catch. But they end \n               up getting into a cat fight and so the dragon catches the bouquet \n               instead. The Gingerbread man has been mended somewhat and now \n               has one leg and walks with a candy cane cane. Shrek and Fiona \n               walk off as the rest of the guests party and Donkey takes over \n               singing the song.\n \n                                     GINGERBREAD MAN\n                         God bless us, every one.\n\n                                     DONKEY\n                         (as he's done singing and we fade to \n                         black) Oh, that's funny. Oh. Oh. I can't \n                         breathe. I can't breathe.\n \n               THE END\n\n\n\n\nShrek\nWriters :   William Steig  Ted Elliott\nGenres :   Animation  Adventure  Comedy  Family  Fantasy  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Shrek, a green ogre who loves the solitude in his swamp, finds his life interrupted when many fairytale characters are exiled there by order of the fairytale-hating Lord Farquaad. Shrek tells them that he will go ask Farquaad to send them back. He brings along a talking Donkey who is the only fairytale creature who knows the way to Duloc.\nMeanwhile, Farquaad tortures the Gingerbread Man into giving the location of the remaining fairytale creatures until his guards rush in with something he has been searching for: the Magic Mirror. He asks The Mirror if his kingdom is the fairest of them all but is told that he is not even a king. To be a king he must marry a princess and is given three options, from which he chooses Princess Fiona, who is locked in a castle tower guarded by lava and a dragon. The Mirror tries to mention \"the little thing that happens at night\" but is unsuccessful.\nShrek and Donkey arrive at Farquaad's palace in Duloc, where they end up in a tournament. The winner gets the \"privilege\" of rescuing Fiona so that Farquaad may marry her. Shrek and Donkey easily defeat the other knights in wrestling-match fashion, and Farquaad accepts his offer to move the fairytale creatures from his swamp if Shrek rescues Fiona.\nShrek and Donkey travel to the castle and split up to find Fiona. Donkey encounters the dragon and sweet-talks the beast before learning that it is female. Dragon takes a liking to him and carries him to her chambers. Shrek finds Fiona, who is appalled at his lack of romanticism. As they leave, Shrek saves Donkey, caught in Dragon's tender clutches, and forces her to chase them out of the castle. At first, Fiona is thrilled to be rescued but is quickly disappointed when Shrek reveals he is an ogre.\nAs the three journey to Duloc, Fiona urges the two to camp out for the night while she sleeps in a cave. Shrek and Donkey stargaze while Shrek tells stories about great ogres and says that he will build a wall around his swamp when he returns. When Donkey persistently asks why, he says that everyone judges him before knowing him; therefore, he feels he is better off alone, despite Donkey's admission that he did not immediately judge him when they met.\nAlong the way, Shrek and Fiona find they have more in common and fall in love. The trio is almost at Duloc, and that night Fiona shelters in a windmill. When Donkey hears strange noises coming from it, he finds Fiona turned into an ogre. She explains her childhood curse and transforms each night, which is why she was locked away, and that only her true love's kiss will return her to her \"love's true form\". Shrek, about to confess his feelings for Fiona with a sunflower, partly overhears them, and is heartbroken as he mistakes her disgust with her transformation to an \"ugly beast\" as disgust with him. Fiona makes Donkey promise not to tell Shrek, vowing to do it herself. The next morning, Shrek has brought Lord Farquaad to Fiona. The couple return to Duloc, while a hurt Shrek angrily leaves his friendship with Donkey and returns to his now-vacated swamp, remembering what Fiona \"said\" about him.\nDespite his privacy, Shrek is devastated and misses Fiona. Furious at Shrek, Donkey comes to the swamp where Shrek says he overheard Donkey and Fiona's conversation. Donkey keeps his promise to Fiona and tells Shrek that she was talking about someone else. He accepts Shrek's apology and tells him that Fiona will be getting married soon, urging Shrek into action to gain Fiona's love. They travel to Duloc quickly, thanks to Dragon, who had escaped her confines and followed Donkey.\nShrek interrupts the wedding before Farquaad can kiss Fiona. He tells her that Farquaad is not her true love and only marrying her to become king. The sun sets, which turns Fiona into an ogre in front of everyone in the church, causing a surprised Shrek to fully understand what he overheard. Outraged by Fiona, Farquaad orders Shrek killed and Fiona detained. Shrek whistles for Dragon who bursts in along with Donkey and devours Farquaad. Shrek and Fiona profess their love and share a kiss; Fiona is bathed in light as her curse is broken but is surprised that she is still an ogre, as she thought she would become beautiful, to which Shrek replies that she is beautiful. They marry in the swamp and leave on their honeymoon while the rest celebrate by singing \"I'm a Believer\"."}