{"title": "Slumdog Millionaire", "full_text": "SLUMDOG MILLIONAIRE\n\n\n\n                          Written by\n\n                         Simon Beaufoy\n\n\n\n                                             November 4th, 2007\n\n\n\n\n© SLUMDOG FILMS LIMITED\n39 LONG ACRE\nLONDON WC2E 9LG\n\n1   INT. JAVED'S SAFE-HOUSE. BATHROOM. NIGHT.                 1\n\n    An expensive bathroom suite. Excess of marble and gold\n    taps. Into the bath, a hand is scattering rupee notes.\n    Hundreds and hundreds of notes, worth hundreds of\n    thousands of rupees. The sound of a fist thumping on\n    the bathroom door, furious shouting from the other\n    side.\n\n                               JAVED O/S\n              Salim! Salim!\n\n\n2   INT. STUDIO. BACKSTAGE. DAY.                              2\n\n    Darkness. Then, glimpses of faces. In the half-light,\n    shadowy figures move with purpose. An implacable voice\n    announces.\n\n                            TALKBACK V/O\n              Ten to white-out, nine, eight,\n              seven...\n\n                               PREM\n              Are you ready?\n\n    Silence. A hand shakes a shoulder a little too roughly.\n\n                            PREM (CONT'D)\n              I said are you ready?\n\n                               JAMAL\n              Yes.\n\n\n3   INT. JAVED'S SAFE-HOUSE. BATHROOM. NIGHT.                 3\n\n    The thumping at the door continues. The sound of\n    mumbled Indian prayer. Dull gleam of a pistol. A hand\n    cracks the chamber open. Loads a single bullet into the\n    chamber, snaps the chamber shut.\n\n                            TALKBACK V/O\n              ...three, two, one, zero. Cue\n              Prem, cue applause...\n\n    Suddenly, the door splinters as it is smashed through.\n    A burst of gun-fire and white light as suddenly...\n\n\n4   INT. STUDIO. NIGHT.                                       4\n\n    ...we are back in the studio, the gun-fire morphing\n    into rapturous applause.\n\n\n                                                  (CONTINUED)\n\n                                                                2.\n4   CONTINUED:                                                       4\n\n                                  TALKBACK V/O\n                 Go, Prem.\n\n    A wall of light and noise as the two walk on stage.\n    Cheering, music, banks of searing studio lights. On\n    stage, Jamal, an eighteen year-old Indian boy-man\n    stares, petrified. He would surely turn and run but for\n    the iron grip on his shoulder of the smiling host, Prem\n    Kumar.\n\n                               PREM\n                 Welcome to Who Wants To Be A\n                 Millionaire!\n\n    More applause.\n\n                               PREM (CONT'D)\n                 Please give a warm welcome to\n                 our first contestant of the\n                 night- a local from our very own\n                 Mumbai!\n\n    Under cover of the wild applause, Prem ushers Jamal\n    towards the guest's chair, leaning in and hissing.\n\n                                  PREM (CONT'D)\n                 Smile, dammit.\n\n    The lights seem to bore into him but Jamal manages a\n    tentative smile. Out of nowhere, a hand slaps him\n    ferociously across the face. Then again and again.\n    Blood trickles from his mouth.\n\n\n5   INT. POLICE INTERVIEW ROOM. NIGHT.                               5\n\n    The studio lights have seamlessly transformed into the\n    harsh bulb of an interrogation light. Jamal is strung\n    from the ceiling by his arms.\n\n                               CONSTABLE SRINIVAS\n                 Your name, bhen chod.\n\n    Constable Srinivas's hand pulls back Jamal's head by\n    the hair, forcing him to stare directly into the\n    lights.\n\n                                  CONSTABLE SRINIVAS (CONT'D)\n                 Your name!\n\n                                  JAMAL\n                 Jamal Malik.\n\n    And seamlessly we are back....\n\n                                                           3.\n\n\n6   INT. STUDIO. NIGHT.                                         6\n\n    ...on the set of Who Wants to be a Millionaire. Prem\n    leans back in his chair, a man at home in his\n    surroundings. Jamal sits opposite, frozen.\n\n                            PREM\n              So, Jamal, tell us a bit about\n              yourself.\n\n    Close on Jamal's face. Without warning, it is shoved\n    under water.\n\n\n7   INT. BUCKET. NIGHT.                                         7\n\n    We look up from the bottom of the bucket at the\n    screaming face of a drowning man. His head shakes\n    desperately, pointlessly. Then Jamal's face is dragged\n    up again, roaring for breath. Close on his eyes.\n\n                            JAMAL V/O\n              I work in a call centre. In\n              Juhu.\n\n\n8   INT. STUDIO. NIGHT.                                         8\n\n                            PREM\n              A Phone-basher! And what type of\n              call centre would this be?\n\n                            JAMAL\n              XL 5. Mobile phones.\n\n                            PREM\n              Aha! So, you're the man who\n              rings me up every single day of\n              my life with Special Offers,\n              huh?\n\n                            JAMAL\n              No, actually, I'm an assistant.\n\n                            PREM\n              An Assistant Phone-basher?\n\n    A raised eye-brow at the audience. Amusement ruffles\n    through them.\n\n                            PREM (CONT'D)\n              And what does an Assistant Phone-\n              basher do, exactly?\n\n                            JAMAL\n              I- I get tea for people and-\n\n\n\n                                                  (CONTINUED)\n\n                                                          4.\n8    CONTINUED:                                                8\n\n                                PREM\n                  - a chi-wallah! Why didn't you\n                  say?\n\n     Laughter in the audience.\n\n                                PREM (CONT'D)\n                  So, ladies and gentlemen, Jamal\n                  Malik from Mumbai, let's play\n                  Who Wants To Be A\n                  Millionaire...!\n\n\n9    OMITTED                                                   9\n\n\n10   INT. POLICE INTERVIEW ROOM. DAY.                          10\n\n     Jamal's body dangles motionless from the ceiling. His\n     head is bowed and he is moaning to himself. The ceiling\n     fan thumps round slowly. In the corner, Constable\n     Srinivas mops his brow and lights a cigarette. Hot\n     work. The door opens and the Inspector of Police walks\n     in. A rumpled man in his late forties who has seen\n     pretty much everything. He eyes Jamal, surprised.\n\n                                INSPECTOR\n                  Has he confessed, yet?\n\n                                CONSTABLE SRINIVAS\n                  Apart from his name, I can't get\n                  a word out of the runt.\n\n                                INSPECTOR\n                  You've been here all bloody\n                  night, Srinivas. What have you\n                  been doing?\n\n     Srinivas shrugs.\n\n                                CONSTABLE SRINIVAS\n                  Tough guy.\n\n                                INSPECTOR\n                  A little electricity will loosen\n                  his tongue.\n\n     Constable Srinivas brings a box and a tangle of wires\n     out of a cupboard and proceeds to put crocodile clips\n     on Jamal's fingers. The Inspector stares, deep in\n     thought. Sweat trickles down his face. He wipes it away\n     with a handkerchief, seems to be talking to himself.\n\n                                INSPECTOR (CONT'D)\n                  Every night I get home, \"why\n                  can't we have a/c like Bajan\n                  Chacha?\n                                (MORE)\n\n                                                     (CONTINUED)\n\n                                                           5.\n10   CONTINUED:                                                 10\n                                INSPECTOR (CONT'D)\n                  Why don't you care about your\n                  poor family, dying in this\n                  heat.\" Twenty-four years a\n                  policeman and I can't afford\n                  bloody a/c.\n\n     Turns on Jamal.\n\n                                INSPECTOR (CONT'D)\n                  But you. You've got ten million\n                  rupees ek dum guaranteed, yaar?\n                  And who knows how much further?\n                  Fancy the twenty million, do\n                  you?\n\n     Jamal just stares.\n\n                                INSPECTOR (CONT'D)\n                  I think you probably do.\n\n     The Inspector nods absently to Constable Srinivas who\n     turns a handle. Jamal's body pulsates and jerks. He\n     screams. His body goes limp again. The Inspector goes\n     over to Jamal.\n\n                                INSPECTOR (CONT'D)\n                  So. Were you wired up? A mobile\n                  or a pager, correct? Some little\n                  hidden gadget? No? A coughing\n                  accomplice in the audience?\n                  Microchip under the skin, huh?\n\n     Constable Srinivas hadn't thought of that. Grabs\n     Jamal's arms and starts squeezing them all over until\n     the Inspector has had enough.\n\n                                INSPECTOR (CONT'D)\n                  Srinivas! Look, it's hot, my\n                  wife is giving me hell, I've got\n                  a desk full of murderers,\n                  rapists, extortionists, assorted\n                  bum-bandits...and you. Why don't\n                  you save us both a lot of time?\n                  Hmm?\n\n     Jamal doesn't answer. The Inspector sighs and sits\n     down. Looks at his watch, nods at Constable Srinivas\n     again. Jamal's body jerks with electric current. When\n     the shudders and screams have subsided, the Inspector\n     goes over to Jamal's collapsed form. Clicks his fingers\n     in front of Jamal's face to check for a response.\n\n                                INSPECTOR OF POLICE\n                  He's unconscious, chutiya. What\n                  good is that? How many times\n                  have I told you-?\n\n                                CONSTABLE SRINIVAS\n                  Sorry, Sir.\n                                                      (CONTINUED)\n\n                                                           6.\n10   CONTINUED: (2)                                             10\n\n     An excited Young Police Constable sticks his head\n     around the door.\n\n                             YOUNG CONSTABLE\n               He's coming! Sir.\n\n                             INSPECTOR\n               Aré wa, Srinivas, we'll have\n               Amnesty International in here\n               next, peeing their pants about\n               human rights. Get him down, tidy\n               him up, for God's sake.\n\n     Constable Srinivas goes over to Jamal and starts to\n     undo the crocodile clips.\n\n                             CONSTABLE SRINIVAS\n               Maybe he did know the answers.\n\n                              INSPECTOR\n               Have you gone soft, Srinivas?\n               Professors, lawyers, doctors,\n               General Knowledge Wallahs never\n               get beyond sixteen thousand\n               rupees. And he's on ten million?\n               What the hell can a slum dog\n               possibly know?\n\n     Jamal lifts his head.\n\n                              JAMAL\n               The answers.\n\n     He lifts his head, spits blood out of his mouth and\n     says again, straight into the Inspector's face.\n\n                             JAMAL (CONT'D)\n               I know the answers.\n\n     Titles. Slum Dog Millionaire.\n\n\n11   EXT. CRICKET GROUND. DAY.                                  11\n\n     Bright sunlight filtered through the ever-present\n     Mumbai dust. A group of children are playing cricket on\n     a tarmac cricket ground. They are bare-foot, dressed in\n     little more than rags, wiry-skinny and fast on their\n     feet. Salim, a nine-year old, polishes the ball on his\n     almost non-existent shorts, comes in with surprising\n     speed and bowls. The batsman hooks it high in the air.\n     The bowler screams at a boy in the outfield.\n\n                             SALIM\n               Jamal! Catch it! Catch it!\n\n     The seven-year old Jamal stares up at the ball, jinks\n     around trying to get into position.\n\n                                                   (CONTINUED)\n\n                                                            7.\n11   CONTINUED:                                                  11\n\n     He pays no heed to the rest of the children who are\n     scattering fast to the edges of the tarmac. The ball\n     seems suspended in the blue sky. Shouts from the other\n     children seem very far away. He doesn't notice that\n     they are screaming for him to get out of the way. Jamal\n     adjusts his feet for the perfect catch. Then out of\n     nowhere, a light aircraft almost takes his head off as\n     it comes in to land on the tarmac runway. Jamal is\n     knocked to his feet by the down-draft of the plane. The\n     ball bounces away. Also flattened, Salim gets to his\n     feet.\n\n                                SALIM (CONT'D)\n                  How could you drop that? It was\n                  a sitter.\n\n     Then Salim's face turns to one of alarm.\n\n\n12   EXT. AIRPORT PERIMETER. DAY.                                12\n\n     At the back of a pack of children, carrying a piece of\n     wood crudely fashioned into a sword, Jamal is running\n     for his life, pursued by an ancient but surprisingly\n     nimble Security Guard from the airport who is screaming\n     abuse and wielding a long stick. The kids dash across a\n     rubbish dump and disappear down dozens of tiny lanes\n     that run in between the shacks of the slum.\n\n                                SECURITY GUARD\n                  Private-ka land! Private-ka\n                  land! The planes won't kill you,\n                  mader chod, I will!\n\n     Jamal and Salim- also with a wooden sword- break off,\n     head down a separate lane. The Guard pursues them.\n\n\n13   INT. JUHU SLUM. DAY.                                        13\n\n     The lanes in between the corrugated iron shacks are\n     three feet wide, with an open drain running down the\n     middle. Many of the precarious upper floors of the\n     shacks have been built right over the paths, turning\n     them into black tunnels. Tunnels shot through with\n     slivers of light. If you didn't live here, you would be\n     lost and frightened in minutes.\n\n     But these children are natives and with the practice of\n     many years, Jamal and Salim zig-zag down the warren of\n     lanes.\n\n     They dodge past people cooking in the doorways,\n     sleeping, washing clothes or in the case of Vinod, a\n     naked four year-old, pissing into the drain. Salim\n     shouts a warning.\n\n\n\n                                                     (CONTINUED)\n\n                                                          8.\n13   CONTINUED:                                                13\n\n                                SALIM\n                  Vinod! Musketeers coming\n                  through!\n\n     Without breaking step, they both jump expertly over the\n     stream of piss. Not so the Security Guard who gets it\n     all over his trousers, but doesn't stop the pursuit.\n\n     The two children charge past a shack filled to the roof\n     with chickens in cages who all start squawking. They\n     break out into the sunlight of the `main road' of the\n     slum lined with shops. It is packed: with people,\n     stalls, bicycles and cows. All modern India is here,\n     drinking tea, shouting at each other, selling food,\n     playing carom, video games. Leaving a trail of shouting\n     and wreckage behind them, the pair approach a brand new\n     Mercedes almost blocking the lane. Beside it stands\n     Javed, an impressive man in a beautiful suit and his\n     two Minders. Jamal and Salim skid to a stop, put their\n     hands together in respectful greeting and edge ever so\n     carefully past the immaculate paintwork of the car.\n\n     Still in pursuit, the Security Guard also slides\n     carefully past the car with deprecating bows and\n     smiles. On past the chi stall where a crowd has\n     gathered to watch a hindi film blaring from the tv\n     rigged up overhead. The irate Security Guard gets\n     tangled up in a bicycle. Jamal and Salim stop to give\n     him a taunting, hip-gyrating parody of the dance on the\n     tv before scooting down another tunnel. They break out\n     into sunlight again.\n\n                                WOMAN'S VOICE\n                  Jamal!\n\n     Jamal skids to a halt, bumping into Salim who is\n     already frozen.\n\n                                JAMAL\n                  Shit. Mummy-ji.\n\n                                JAMAL'S MOTHER\n                  Don't you move a muscle.\n\n     The Security Guard arrives and he too skids to a halt\n     at the sight of Jamal's mother.\n\n                                JAMAL'S MOTHER (CONT'D)\n                  Thank you, Mister Gupta. I will\n                  deal with these two.\n\n     The Guard puts his hands together in grudging respect\n     as Jamal's Mother lifts each skinny kid off the floor\n     by their t-shirt and marches them down the road.\n\n                                                            9.\n\n\n14   INT. SCHOOL. DAY.                                           14\n\n     The two renegades are dumped by Jamal's Mother into\n     their desks as Mister Nandha hands out ancient school\n     books.\n\n                             MISTER NANDHA\n               So, the musketeers return. We\n               are honoured. Salim. Or Porthos,\n               isn't it?\n\n     He crashes the heavy book down on his head. Salim opens\n     the book. Jamal glances over and turns the book the\n     right way round for Salim.\n\n                             SALIM\n               I know!\n\n     Mister Nandha hovers over Jamal's head. He winces in\n     anticipation.\n\n                             MISTER NANDHA\n               And Athos.\n\n     The book comes down like thunder. Jamal blinks from the\n     impact and suddenly we are back....\n\n\n15   INT. INSPECTOR'S OFFICE. DAY.                               15\n\n     ... in the Inspector's office. Jamal watches Srinivas\n     fiddling with the video recorder, trying to get a\n     picture. Through the pebbled glass, Jamal sees shapes\n     moving along the corridor.\n\n\n16   INT. CORRIDOR. POLICE STATION. DAY.                         16\n\n     The Commissioner of Police is fawning along beside Prem\n     as they walk. The Young Constable hurries behind.\n\n                             COMMISSIONER OF POLICE\n               It is so kind of you to visit\n               our station, Sir. A great\n               honour.\n\n                             PREM\n               Not at all, not at all. I hope\n               you will visit us, Commissioner.\n\n     Out of his jacket pocket comes a couple of tickets.\n\n                             PREM (CONT'D)\n               Bring the family. It's a lot of\n               fun.\n\n                             COMMISSIONER OF POLICE\n               Oh! A thousand thanks, Sir.\n               Missus Janda will be overcome.\n                                                      (CONTINUED)\n\n                                                             10.\n16   CONTINUED:                                                    16\n\n     He turns to the Young Constable.\n\n                                COMMISSIONER OF POLICE\n                                (CONT'D)\n                  chi, you lazy chutiyé, chi!\n\n     The Inspector joins them in the corridor.\n\n                                COMMISSIONER OF POLICE\n                                (CONT'D)\n                  Ah, Inspector! Cracked it?\n\n     The Inspector moves his head. Maybe yes, maybe no.\n\n                                  INSPECTOR\n                  Nearly, Sir.\n\n     The Commissioner is just able to contain his apoplexy.\n\n                                COMMISSIONER OF POLICE\n                  Nearly? Nearly? When Prem Kumar\n                  himself has-\n\n     Prem holds up a tolerant hand to the Commissioner who\n     falls silent. Turns his laser-like charm onto the\n     Inspector.\n\n                                PREM\n                  Inspector. How good to meet you.\n                  Clearly the kid cheated.\n\n                                  INSPECTOR\n                  Clearly, Sir.\n\n                                PREM\n                  So, it is just a question of\n                  how, no?\n\n                                INSPECTOR\n                  Indeed, Sir. The proof. That is\n                  all we need.\n\n                                PREM\n                  We are lucky to have a man of\n                  your obvious experience on the\n                  case. This kid might run rings\n                  around us filmi types, but he\n                  won't make fools out of the\n                  Mumbai Police Force, I can see\n                  that.\n\n     Forced laughter from the Commissioner.\n\n                                PREM (CONT'D)\n                  In front of sixty million\n                  people.\n\n     More laughter. And fear.\n\n                                                         (CONTINUED)\n\n                                                           11.\n16   CONTINUED: (2)                                              16\n\n                             PREM (CONT'D)\n               Which is what will happen if we\n               don't get a result, Gentlemen.\n               He goes back on the show to rob\n               us all with the whole of India\n               watching. But. I can rely on\n               you.\n\n     Prem walks away down the corridor. Stops and turns,\n     apparently casual.\n\n                             PREM (CONT'D)\n               Has he- has he made any\n               allegations?\n\n                                INSPECTOR\n               Allegations?\n\n                             PREM\n               He's a cunning one. A convincing\n               liar. Don't be taken in,\n               Inspector, don't be taken in.\n\n     Walks off. The Inspector stares after him. Goes back\n     into his office.\n\n\n17   INT. INSPECTOR'S OFFICE.                                    17\n\n     Srinivas has finally got the recorder to work. We get\n     snatches of filmi dancing- heroines singing on\n     mountainsides surrounded by implausible numbers of\n     flags- cricket and finally after some shouting by the\n     Inspector, Who Wants to Be A Millionaire?.\n\n                             INSPECTOR\n               So, Mister Malik, the man who\n               knows the answers. Talk.\n\n     We close in on the tv screen where Prem is smiling his\n     crocodile smile and find ourselves....\n\n\n18   INT. STUDIO. NIGHT.                                         18\n\n     ...as Prem asks the first question.\n\n                             PREM\n               So, are you ready for your first\n               question for one thousand\n               rupees?\n\n                                JAMAL\n               Yes.\n\n                             PREM\n               Not bad money to sit in a chair\n               and answer a question. Better\n               than making the tea, no?\n                                                   (CONTINUED)\n\n                                                           12.\n18   CONTINUED:                                                  18\n\n                                  JAMAL\n                  No. Yes. No.\n\n                                PREM\n                  No. Yes. No. Apka final answer?\n\n     Laughter from the audience. Jamal looks confused. Prem\n     waves it away, switches on his serious face.\n\n                                PREM (CONT'D)\n                  Remember, you have three\n                  lifelines if you're not sure of\n                  your answer- Ask the Audience,\n                  50/50 and Phone a Friend. So,\n                  the question:\n\n     The lights go down, the portentous music rolls.\n\n                                PREM (CONT'D)\n                  Who was the star of the 1973 hit\n                  film Zanjeer. Was it A-\n\n     Close on Jamal's eyes.\n\n\n19   INT. SHACK. NIGHT.                                          19\n\n     A tiny shack. A garland of dirty plastic flowers\n     surrounds a torn flyer for one of Amitabh Bacchan's\n     films.\n\n\n20   EXT. JUHU SLUM. RUBBISH DUMP. NIGHT.                        20\n\n     Salim is sitting on a chair at the end of a rickety\n     wooden pier, though it is not water, but a sea of\n     rubbish and sewage that lies below them. There are\n     dozens of these piers protruding from the slum onto\n     airport land, each with a toilet shack perched right at\n     the end. Another man hurries up the pier and hands\n     Salim a coin.\n\n                                SALIM\n                  Immediately, sir.\n\n     Turns to the toilet door.\n\n                                SALIM (CONT'D)\n                  Bhai, get out of there. Prakash\n                  wants a shit.\n\n                                  JAMAL O.S.\n                  Not finished.\n\n                                PRAKASH\n                  Stop your time-pass. This is\n                  urgent.\n\n\n                                                     (CONTINUED)\n\n                                                          13.\n20   CONTINUED:                                                 20\n\n                                JAMAL O.S.\n                  It's a shy one. Since when was\n                  there a time limit on a crap?\n\n                                SALIM\n                  Since there was a customer\n                  waiting, that's when.\n\n     He flashes another placatory smile at Prakash.\n\n                                JAMAL O.S.\n                       (singing/ grunting)\n                  Come on out, you beauty, unveil\n                  yourself, my darling-warling....\n\n                                PRAKASH\n                  Look, kid, I got a bad stomach.\n                  It's borderline....\n\n     A disturbing combination of heaving and snake-charmer\n     noises come from the toilet shack. Finally Prakash can\n     stand it no longer.\n\n                                PRAKASH (CONT'D)\n                  I'm off to Devi's bog. Give me\n                  that.\n\n     He snatches the coin back from Salim and hurries off.\n     Salim bangs on the toilet door.\n\n                                SALIM\n                  You just lost me good money, you\n                  stupid idiot-\n\n     Salim stops. In the distance, there is the faint sound\n     of shouting, a crowd coming closer. Then the crowd\n     bursts through the outer shacks of the slum, pour onto\n     the rubbish dump and make for the airfield.\n\n                                MAN\n                  It's Amitabh! That's his\n                  helicopter!\n\n                                JAMAL O.S.\n                  Amitabh? Amitabh Bacchan?\n\n\n21   INT/EXT. TOILET. NIGHT.                                    21\n\n     Jamal peers through one of the many cracks in the\n     shack. He sees crowds surging around the pier, charging\n     towards a landing helicopter. Salim shoves the chair\n     under the door handle- effectively locking it- and runs\n     down the pier to join the chase. Jamal pulls up his\n     shorts.\n\n                                JAMAL\n                  No! Wait! Salim, sala! Salim!\n\n                                                      (CONTINUED)\n\n                                                           14.\n21   CONTINUED:                                                  21\n\n     Rattles the locked door. Pulls a torn flyer from his\n     pocket advertising an Amitabh movie.\n\n                                JAMAL (CONT'D)\n                  Wait! Amitabh....\n\n     He looks down the toilet hole at the sewage beneath\n     him, the landing helicopter, the disappearing crowd. A\n     final rattle of the door. There is only one way out. He\n     jumps down the hole, sprawling headlong into a year's\n     worth of human waste, managing to keep the flyer out\n     the mire. He runs for the helicopter.\n\n                                JAMAL (CONT'D)\n                  Amitabh-ji! Amitabh-ji!\n\n     Salim is at the back of the crowd, trying to force a\n     way through, but the adults shove him back. Not so for\n     Jamal. The down-draft from the helicopter flicks bits\n     of sewage from his clothes. Disgusted fans curse him\n     and get out of his way. Suddenly, the red sea parts and\n     there is nobody between Jamal and Amitabh Bacchan\n     getting out of the helicopter.\n\n                                JAMAL (CONT'D)\n                  Please. Amitabh-ji.\n\n     Jamal holds out his flyer. Used to signing autographs,\n     the movie star barely looks at Jamal. He takes the\n     flyer and scribbles his autograph on it.\n\n                                JAMAL (CONT'D)\n                  A thousand thanks, Amitabh-ji.\n\n     He hands the flyer back to Jamal as his bodyguards\n     surround him and hustle him into a car. Jamal chases\n     the flyer across the tarmac, grabs it. Kisses it.\n\n\n22   EXT. JUHU SLUM. NIGHT.                                      22\n\n     From high up, the rickety tin roof-tops of the slum\n     seem to stretch to the horizon. There is a distant\n     shout, a figure waving an arm.\n\n                                 MAN\n                  It's coming!\n\n     Then another shout and another, a chain of voices\n     coming closer. People come out of their doorways with\n     pails and buckets. The shouts come closer until we see\n     a naked figure entirely encased in bubbles dancing and\n     singing in the lane. Jamal is the happiest boy in the\n     slum.\n\n                                JAMAL\n                       (singing)\n                  Amitabh, Amitabh, oh Amitabh!\n                                (MORE)\n                                                   (CONTINUED)\n\n                                                         15.\n22   CONTINUED:                                                22\n                                JAMAL (CONT'D)\n                  I have your autograph, oh, holy\n                  Amitabh!\n\n                                   MOTHER\n                  Here it comes!\n\n     Water comes bubbling through a hose and Jamal's mother\n     hoses down her ecstatic son.\n\n\n23   EXT. JUHU SLUM. NIGHT.                                    23\n\n     Not far away, Salim wanders to Mister Chi's stall. He\n     glances around to make sure everybody is glued to the\n     hindi film on Mister Chi's tv and surreptitiously slips\n     Mister Chi the signed flyer. Mister Chi takes a look\n     and gives Salim a small wad of rupees. He sticks the\n     money in his pocket, slinks away.\n\n\n24   EXT. JUHU SLUM. NIGHT.                                    24\n\n     A tear-stained Jamal is furiously trying to batter\n     Salim, but Salim's extra strength and height means that\n     he can keep Jamal at bay with one hand, Jamal's\n     flailing fists punching thin air.\n\n                                   JAMAL\n                  Sala! Sala!\n\n     Salim's laughter only makes Jamal cry harder.\n\n\n25   INT. INSPECTOR'S OFFICE. NIGHT.                           25\n\n     Close on the tv screen in the Inspector's office. Prem\n     ponders Jamal's choice. Presses a button on his\n     computer.\n\n                                PREM V/O\n                  You chose A- Amitabh Bacchan.\n                  Guess what? You just won one\n                  thousand rupees!\n\n     Applause on screen. The Inspector looks at Jamal. Jamal\n     shrugs.\n\n                                JAMAL\n                  You don't have to be a genius.\n\n                                CONSTABLE SRINIVAS\n                  I knew it was Amitabh.\n\n                                   JAMAL\n                  Like I said.\n\n     Constable Srinivas twists Jamal's arm behind his back,\n     evincing a squeal of pain from Jamal.\n\n                                                     (CONTINUED)\n\n                                                           16.\n25   CONTINUED:                                                  25\n\n                                JAMAL (CONT'D)\n                       (squealing)\n                  He's the most famous man in\n                  India...!\n\n     The Inspector stares at Jamal, turns back to the tv\n     where Prem is asking the next question.\n\n                                PREM O/S\n                  For four thousand rupees....the\n                  national emblem of India is a\n                  picture of three lions. What is\n                  written underneath? Is it...\n\n\n26   INT. STUDIO. NIGHT.                                         26\n\n                                PREM\n                  ...A) The truth alone triumphs.\n                  B) Lies alone triumph. C)\n                  Fashion alone triumphs. D) Money\n                  alone triumphs.\n\n     Prem shoots a mock puzzled look out to the audience\n     eliciting giggles from them.\n\n                                PREM (CONT'D)\n                  What do we think, Jamal? The\n                  most famous phrase in our\n                  country's history. Maybe you\n                  want to phone a friend?\n\n     Laughter from the audience. The studio lights bear down\n     on Jamal. a drop of sweat trickles down his forehead.\n     Prem is loving his discomfort.\n\n                                PREM (CONT'D)\n                  Or Ask the Audience? I have a\n                  hunch they might just know the\n                  answer. What do we think?\n\n     He gestures expansively at his audience. Oh, they love\n     him.\n\n                                 JAMAL\n                  Yes.\n\n                                  PREM\n                         (startled)\n                  Yes?\n\n                                JAMAL\n                  Ask the audience.\n\n     Prem whistles. Raises his eyes at the audience.\n\n                                PREM\n                  Well, you're the contestant,\n                  Jamal.\n                                (MORE)\n                                                     (CONTINUED)\n\n                                                         17.\n26   CONTINUED:                                                26\n                                PREM (CONT'D)\n                  Put the poor man out of his\n                  misery, Ladies and Gentlemen.\n                  Press your key-pad now.\n\n     The lights dim. Portentous music.\n\n\n27   INT. INSPECTOR'S OFFICE. DAY.                             27\n\n     The Inspector presses pause. Sighs.\n\n                                INSPECTOR\n                  So, Jamal. My five-year-old\n                  daughter knows the answer to\n                  that, but you don't. Strange for\n                  a millionaire genius. What\n                  happened? Your accomplice nip\n                  out for a piss, did he? Or did\n                  he just not cough loud enough?\n\n     Silence. Constable Srinivas kicks Jamal's chair.\n\n                                CONSTABLE SRINIVAS\n                  The Inspector asked you a\n                  question.\n\n                                JAMAL\n                  How much is bhelpuri at Jeevan's\n                  stall on Chowpatty Beach?\n\n                                INSPECTOR\n                  What?\n\n                                JAMAL\n                  One bhelpuri. How much?\n\n                                CONSTABLE SRINIVAS\n                       (can't help\n                        himself)\n                  Ten rupees.\n\n                                JAMAL\n                  Wrong. Fifteen since Divali. Who\n                  stole Constable Varma's bicycle\n                  outside Dadar Station last\n                  Thursday?\n\n                                INSPECTOR\n                       (amused)\n                  You know who that was?\n\n                                JAMAL\n                  Everyone in Juhu knows that.\n                  Even five year-olds.\n\n     Despite himself, the Inspector laughs. Then leans in.\n\n\n\n                                                     (CONTINUED)\n\n                                                         18.\n27   CONTINUED:                                                27\n\n                                INSPECTOR\n                  I'll give you five hundred\n                  rupees if you just admit it. You\n                  go home, I go home. Everybody\n                  happy.\n\n     Jamal just stares back.\n\n                                INSPECTOR (CONT'D)\n                  No, you want to go back on the\n                  programme and win twenty million\n                  rupees, don't you?\n\n                                  JAMAL\n                  Wouldn't you?\n\n\n28   INT. STUDIO. NIGHT.                                       28\n\n                                PREM\n                  The audience has chosen. And,\n                  whaddya know? Ninety-nine\n                  percent of them think the answer\n                  is A). The truth alone triumphs.\n                  What do we think, Jamal? A\n                  hundred percent would have made\n                  me a little more reassured,\n                  maybe....\n\n     Prem shrugs, makes a show of examining his computer.\n     Suddenly fixes him with his eyes.\n\n                                PREM (CONT'D)\n                  Are you married, Jamal?\n\n                                  JAMAL\n                  No.\n\n                                PREM\n                  Well, don't despair, there's\n                  someone out there who thinks our\n                  national motto is \"Fashion alone\n                  triumphs\". You two could be very\n                  well matched.\n\n     Audience laughter.\n\n\n29   INT. GALLERY. NIGHT.                                      29\n\n     The Director is shaking his head.\n\n                                DIRECTOR\n                  What the bloody hell is he\n                  playing at? He's way off\n                  script...\n\n                                VISION MIXER\n                  Split up with his girl-friend.\n                                                     (CONTINUED)\n\n                                                           19.\n29   CONTINUED:                                                  29\n\n                                DIRECTOR\n                  Which one?\n\n                                VISION MIXER\n                  All three, I heard. Nita as\n                  well. Back with the wife. She's\n                  pregnant again.\n\n                                DIRECTOR\n                  Oh, God, that's all we need....\n\n                                VISION MIXER\n                  Oh, for Sharukh Khan...Stand by\n                  white out.\n\n\n30   INT. STUDIO. NIGHT.                                         30\n\n                                PREM\n                  ...won four thousand rupees!\n\n     Music, lights, applause.\n\n                                PREM (CONT'D)\n                  One more question before the\n                  commercial break. What will our\n                  Call Centre Assistant do next?\n\n     The lights dim. Prem presses his computer.\n\n                                PREM (CONT'D)\n                  Religion! Interesting. For\n                  sixteen thousand rupees,\n                  in depictions of the God Ram, he\n                  is famously holding what in his\n                  right hand? Is it A) a flower.\n                  B) a scimitar. C) a child or D)\n                  a bow and arrow?\n\n\n31   EXT. DHOBI. JUHU SLUM. DAY.                                 31\n\n     Right next to the railway lines is a pond of dirty\n     water surrounded by shacks in which dozens of women are\n     washing clothes. Trains flash past only feet away from\n     them. Down the other end of the pond, nine-year old\n     Jamal and Salim are splashing noisily with some other\n     children. Jamal's mother pauses in her scrubbing, wipes\n     sweat from her forehead and gazes up at the leaden sky.\n\n                                JAMAL AND SALIM'S MOTHER\n                  It's going to come. Today. I can\n                  feel it.\n\n     The woman next to her nods.\n\n                                WOMAN\n                  Hope so. My head is exploding.\n\n                                                      (CONTINUED)\n\n                                                          20.\n31   CONTINUED:                                                 31\n\n                                MOTHER\n                  Yes. We need rain.\n\n     Jamal is trying to intercept the ball that Salim and\n     Krishna are throwing to each other. He's not having\n     much success. The ball flies overhead again from Salim\n     to Krishna. Jamal dives for it, misses and goes\n     underwater. When he comes up for air, he shakes his\n     head, clearing his ears of water. Then he stops,\n     listens. Shakes his head again. Definitely something\n     strange. Thunder? Salim and Krishna are trading\n     catches, unaware that anything has changed. But Jamal's\n     mother has heard it too. The faintest sound of\n     shouting, roaring. The wave of noise is still faint but\n     getting louder. A frozen moment broken by:\n\n                                MOTHER (CONT'D)\n                  Run! Jamal, Salim, run!\n\n     Everybody stares at her. A train speeds through as she\n     continues to shout, her words lost beneath the\n     thundering train.\n\n                                MOTHER (CONT'D)\n                  Go! Run!\n\n     The train goes through, the last carriage flying past\n     suddenly opening up the sight of a wall of rioting men\n     wielding clubs, scythes, metal bars. They come\n     screaming across the railway tracks.\n\n                                SALIM\n                  Krishna, quick!\n\n     Salim holds out his hand to Krishna who is wading with\n     difficulty through the water.\n\n                                KRISHNA\n                  No way! You're a bloody Muslim.\n                  Get away from me!\n\n     The rioters leap the tracks and are upon them.\n\n                                KRISHNA (CONT'D)\n                  They're Muslims! Him and him!\n\n                                MOTHER\n                  Go!\n\n     Salim and Jamal scramble out and retreat into the\n     lanes. Salim turns to see his Mother felled by a\n     rioter. She is surrounded by screaming, chanting men\n     who rain blows down on her. Jamal runs back and drags\n     Salim down an alley. As they head down the alley, they\n     get glimpses of burning houses, fleeing women, a three-\n     year old boy in a doorway, painted entirely in garish\n     blue. He stares at them. In his hand, he is carrying a\n     bow and arrow. An eleven-year old girl dressed only in\n     a pair of pants runs after them.\n                                                      (CONTINUED)\n\n                                                         21.\n31   CONTINUED: (2)                                            31\n\n     She has two bleeding red gashes on her back. They turn\n     a corner and head towards some vans full of police.\n     Jamal sees Mister Nandha, the school teacher, stops.\n\n                                JAMAL\n               Salim!\n\n     Then Mister Nandha starts walking towards him. An oasis\n     of calm in the chaos. Jamal looks at him with relief.\n\n                                JAMAL (CONT'D)\n               Mister Nandha.\n\n     Mister Nandha smiles, walks towards them.\n\n                             MISTER NANDHA\n               Ram nam satya hai, Babri Masjid\n               dhvasth hai.\n\n                                JAMAL\n               Mister Nandha?\n\n                             MISTER NANDHA\n               We have destroyed your mosque.\n               Now, the followers of Ram will\n               drive you dogs out of our city.\n\n     From behind his back he produces a knife and runs\n     towards Jamal, screaming.\n\n                             MISTER NANDHA (CONT'D)\n               Ram has returned to his temple!\n               Ram has returned!\n\n     They flee, but Jamal turns, sees the girl, frozen. He\n     chases back a few steps, hauls her arm. The spell\n     broken, and they are off.\n\n\n32   INT. STREET. EVENING.                                     32\n\n     They reach the safety of the police vans. But inside\n     the vans, the police are smoking, laughing, playing\n     cards. Down the street, a man comes whirling out of a\n     doorway, his hair on fire. He falls into the middle of\n     the street and is engulfed by rioters. Unperturbed, the\n     police continue to chat. Salim and Jamal look on,\n     horrified. Then one of the police men turns, looks at\n     them. Is interested. Motions to a colleague. Puts out\n     his cigarette with purpose.\n\n                             JAMAL\n               Let's go, bhai.\n\n     Salim and Jamal run. The girl follows.\n\n                                                        22.\n\n\n33   EXT. MUMBAI. EVENING.                                     33\n\n     Salim and Jamal stand on a hill overlooking the city.\n     Black smoke billows from a large area that is clearly\n     the Juhu slum. Standing a little way off is the girl.\n\n                              JAMAL\n                We should go back.\n\n     Silence.\n\n                              JAMAL (CONT'D)\n                See if Ama-\n\n     Salim shakes his head fiercely, silencing Jamal for a\n     moment. But only a moment.\n\n                              JAMAL (CONT'D)\n                What about Jeevan Chacha?\n\n     Salim shakes his head.\n\n                              JAMAL (CONT'D)\n                Maybe he-\n\n     Salim shakes his head again.\n\n                              SALIM\n                - I saw him. He was with them.\n\n                              JAMAL\n                But he wouldn't hurt-\n\n                              SALIM\n                - he was with them!\n\n                              JAMAL\n                But-\n\n                              SALIM\n                - shut up, Jamal, can't you?\n                Just shut up!\n\n     Salim turns away and sees the girl. Picks up a rock and\n     hurls it at her. She dodges, takes a couple of steps\n     back but makes no real attempt to get away. He finds\n     another rock and hurls this in her direction too.\n\n                              SALIM (CONT'D)\n                Ja!\n\n     Then a flash of lightning and thunder rumbles across\n     the city. Rain begins to come down.\n\n                              JAMAL\n                What shall we do?\n\n\n\n                                                   (CONTINUED)\n\n                                                           23.\n33   CONTINUED:                                                  33\n\n     No answer. Jamal sits down. Salim sits down. At a\n     distance, the girl sits down. Rain pours down their\n     faces.\n\n\n34   INT. BUILDER'S YARD. NIGHT.                                 34\n\n     Rain as you've never seen. A pile of huge water pipes\n     in a sprawling builder's yard. Jamal is in one pipe,\n     Salim above him in another. They are both soaked,\n     shivering, but have found some plastic sheet to wrap\n     themselves in. Outside, thirty feet away, stands the\n     girl. Staring. Salim hisses angrily at the girl.\n\n                                SALIM\n                  Go away. Ja, ja!\n\n     The girl might not even have heard.\n\n                                SALIM (CONT'D)\n                  She'll have the Security Guard\n                  onto us, standing there.\n\n                                JAMAL\n                  Not if we let her in.\n\n                                SALIM\n                  No.\n\n                                JAMAL\n                  She could be the third\n                  musketeer.\n\n                                SALIM\n                  I am the head of this family,\n                  now. And I say no. Piss off,\n                  you.\n\n     Salim huddles down in the pipe. After a while, Jamal\n     follows suit.\n\n                                SALIM (CONT'D)\n                  We don't even know what the\n                  third musketeer's called.\n\n\n35   EXT. JUHU SLUM. DAY                                         35\n\n     A flash of Jamal's mother being clubbed to the ground.\n     Her scream.\n\n\n36   INT. BUILDER'S YARD. LATER.                                 36\n\n     Jamal wakes with a jolt and a scream half-swallowed in\n     his mouth. He shuts his eyes tight, trying to force the\n     image out. His breathing slows and he sees the girl\n     staring at him. Salim, too, is staring into nothing.\n     The rain is still falling.\n                                                   (CONTINUED)\n\n                                                           24.\n36   CONTINUED:                                                  36\n\n     The girl goes back to drawing shapes in the mud with\n     her finger. Jamal climbs out of the pipe. Looks at\n     Salim for permission or refusal, but he just continues\n     to stare. So, Jamal walks across to her. She looks up,\n     wary.\n\n                                JAMAL\n                  Where's your Mother?\n\n     Silence.\n\n                                  JAMAL (CONT'D)\n                  Father?\n\n     The girl shakes her head slightly. Jamal takes the\n     plastic sheet from around his shoulders. Gives it to\n     her.\n\n                                JAMAL (CONT'D)\n                  I'm Jamal. He's Salim.\n\n                                  LATIKA\n                  Latika.\n\n     Jamal goes back to his water pipe, climbs in. Watches\n     her huddled under the sheet. Sighs, motions for her to\n     join him. She darts across, jumps into the water pipe\n     and huddles up next to Jamal.\n\n\n37   INT. INSPECTOR'S OFFICE. DAY.                               37\n\n     Jamal looks at the Inspector.\n\n                                JAMAL\n                  I wake up every morning wishing\n                  I didn't know the answer to that\n                  question? If it wasn't for Ram\n                  and Allah, I would still have a\n                  Mother.\n\n\n38   INT. STUDIO. NIGHT                                          38\n\n                                JAMAL\n                  D) A bow and arrow.\n\n                                  PREM\n                  Final answer?\n\n                                  JAMAL\n                  Final answer.\n\n     Prem stares at him for dramatic effect. Presses his\n     computer.\n\n                                PREM\n                  Computer-ji, D lock kiya-jaye.\n\n                                                     (CONTINUED)\n\n                                                           25.\n38   CONTINUED:                                                  38\n\n     The lights dim, the music swells.\n\n                                PREM (CONT'D)\n                  Jamal Malik, you answered D? Ram\n                  is depicted with a bow and arrow\n                  in his hand. And guess what?\n                  You've just won sixteen thousand\n                  rupees! Well done, my friend.\n                  Time for a commercial break-\n                  don't go away, now.\n\n     Music, applause. Prem switches off his professional\n     smile. Gets up.\n\n                                PREM (CONT'D)\n                  Got lucky, huh? I'd take the\n                  money. You'll never get the next\n                  one.\n\n                                JAMAL\n                  You're from the Juhu slum,\n                  aren't you?\n\n                                PREM\n                  Hmm? Sure. Know where I live\n                  now, kid? Pali Hill. Twelve\n                  bedrooms, a/c in every room, two\n                  kitchens, a gym and a screening\n                  room. Steel balls is what it\n                  takes, my friend, steel balls.\n\n     The Floor Manager comes over and gives his head-phones\n     set to Prem. Prem listens.\n\n                                DIRECTOR V/O\n                  Prem? Tone it down, for goodness\n                  sake. You're making him a\n                  laughing stock.\n\n     Prem glances up at the gallery with contempt.\n\n                                PREM\n                  We're having fun here. They love\n                  it...Where the hell do you get\n                  them from?\n\n     He makes no attempt to hide the conversation from\n     Jamal.\n\n                                DIRECTOR V/O\n                  It's supposed to be a quiz show,\n                  not a blood sport.\n\n                                 FLOOR MANAGER\n                  Two minutes.\n\n\n\n\n                                                     (CONTINUED)\n\n                                                          26.\n38   CONTINUED: (2)                                             38\n\n                             PREM\n               Stop wetting your pants. I'll be\n               a good little boy with the next\n               one. Promise.\n\n     He chucks the head-phones back at the Floor Manager.\n     Glances in the wings. Sees Nita, the make-up woman.\n     Gets up and goes over.\n\n\n39   INT. STUDIO. BACKSTAGE. NIGHT.                             39\n\n     In the half-light, backstage, Nita dabs his face with\n     powder.\n\n                             PREM\n               Meet me after the show. Please.\n\n                             NITA\n               No.\n\n                             PREM\n               Nita, I can explain.\n\n                             NITA\n               No need. I read it in bloody\n               Stardust. Didn't even have the\n               balls to tell me. \"Prem's\n               happiness with another baby on\n               the way\". After everything you\n               said...\n\n                             PREM\n               Baby, it all happened before I\n               met you. I swear to you.\n\n                             NITA\n               She's got the gestation period\n               of an elephant, then.\n\n     Prem is about to object. But instead, he laughs.\n\n                             PREM\n               You see? Amidst all this misery,\n               only you can make me laugh.\n\n     Scornful but hints of melting.\n\n                             NITA\n               All this misery...\n\n                             PREM\n               Her and I- nothing. You have to\n               believe me, baby...\n\n     Nita turns away. The Floor Manager comes over.\n\n                             FLOOR MANAGER\n               One minute.\n                                                      (CONTINUED)\n\n                                                        27.\n39   CONTINUED:                                                39\n\n     Prem slings himself in a chair.\n\n                                PREM\n                  No. I'm not going on.\n\n                                 NITA\n                  Prem...\n\n                                PREM\n                  I can't. Without you, it's all\n                  pointless.\n\n     Clicks his fingers at the Floor Manager.\n\n                               PREM (CONT'D)\n                  You. Tell the Director.\n\n     Nita shakes her head at the Floor Manager who by now is\n     looking very worried.\n\n                                FLOOR MANAGER\n                  Thirty seconds.\n\n     Prem shrugs and folds his arms. Sees her weaken.\n\n                                 NITA\n                  Prem...\n\n                                PREM\n                  Calypso Bar, private room, just\n                  you and me?\n\n                                 FLOOR MANAGER\n                  Fifteen.\n\n                                NITA\n                       (furious)\n                  Alright.\n\n     He grins, jumps up, blows her a kiss, and stalks back\n     on stage.\n\n\n40   INT. STUDIO. NIGHT.                                       40\n\n     He sits back down, says almost to himself.\n\n                                 PREM\n                  Steel balls.\n\n     Turns to Jamal.\n\n                                PREM (CONT'D)\n                  Okay, Juhu boy, you've had a\n                  good run. Take your Mother to\n                  Khandala and eat some chiki.\n\n                                JAMAL\n                  My Mother's dead.\n                                                    (CONTINUED)\n\n                                                         28.\n40   CONTINUED:                                                40\n\n                                PREM\n                  Well, your girlfriend then. Even\n                  better.\n\n                                JAMAL\n                  I don't have a girl-friend.\n\n                                PREM\n                  Live wire like you? You surprise\n                  me.\n\n                                  FLOOR MANAGER\n                  Five, four...\n\n     The warm-up man starts the applause.\n\n                                TALKBACK V/O\n                  ....three, two, one...\n\n     Cheering and music. Prem switches on his charm.\n\n                                PREM\n                  Welcome back to Who Wants to be\n                  a Millionaire! Our contestant,\n                  Jamal Malik, Call Centre\n                  Assistant- from Mumbai, is on\n                  sixteen thousand rupees and has\n                  already used one lifeline: Ask\n                  the Audience. So, my friend: are\n                  you ready for the next question?\n\n                                  JAMAL\n                  Yes.\n\n                                PREM\n                  Then, let's play.\n\n     Portentous music. The lights dim.\n\n                                PREM (CONT'D)\n                  For sixty-four thousand rupees.\n                  The British architect Frederick\n                  Stevens designed which famous\n                  building in India? Is it: A) The\n                  Taj Mahal. B) Chhatrapati\n                  Shivaji Terminus. C) India Gate.\n                  D) Howrah Bridge. What do you\n                  think, Jamal? Are you one of\n                  those tea-boys with a penchant\n                  for architecture?\n\n\n41   INT. CHHATRAPATI SHIVAJI TERMINUS. DAY.                   41\n\n     Known to everyone as VT station, this monument to\n     Victorian railway architecture is a dangerous place to\n     be at rush hour.\n\n\n                                                     (CONTINUED)\n\n                                                           29.\n41   CONTINUED:                                                  41\n\n     Even before the train has stopped, men are jumping from\n     the open doors, or vaulting out of the windows or from\n     the roof of the train to join the tens of thousands of\n     Mumbaites streaming to and from work. A seventeen-year\n     old Jamal squeezes himself out of a train and shoves\n     through the crowds. He checks the time. The digital\n     numerals flick to five O'clock. Looks around the tide\n     of humanity.\n\n\n42   INT. STUDIO. NIGHT.                                         42\n\n                                PREM\n                  So, what's it to be? Walk away\n                  and this cheque for sixteen\n                  thousand rupees is yours. Look,\n                  it's even got your name on it.\n\n     He produces a cheque and waves it at Jamal.\n\n                                JAMAL\n                  I don't have a bank account.\n\n     Laughter from the audience. Prem is momentarily wrong-\n     footed.\n\n                                JAMAL (CONT'D)\n                  But I'll take cash.\n\n     More laughter, this time with Jamal, rather than at\n     him. Prem gets up and starts rummaging theatrically\n     through his jacket pockets and trousers.\n\n                                PREM\n                  Nope. Looks like the Producer's\n                  stolen my wallet again-\n\n                                 JAMAL\n                  - I'll play.\n\n     Nobody was expecting this. Least of all Prem who has to\n     rearrange his features into one of surprised delight.\n     He sits down.\n\n                                 PREM\n                  You'll play?\n\n                                 JAMAL\n                  Why not?\n\n                                PREM\n                  Well, well, well. We've got a\n                  wild one, here.\n\n     Prem tears up the cheque with theatrical slowness.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                        30.\n42   CONTINUED:                                                42\n\n                                PREM (CONT'D)\n                  For sixty-four thousand rupees,\n                  Ladies and Gentlemen, the\n                  question once again....\n\n\n43   INT. CHHATRAPATI SHIVAJI TERMINUS. DAY.                   43\n\n     The digital clocks show five fifteen. Shoving the\n     descending river of people out of his way, the eighteen\n     year-old Jamal is forging a path up steps that cross\n     the platforms. He pushes to the middle of the\n     footbridge and leans out on the side railings. He scans\n     the sea of people, desperately. Then he sees her: the\n     eighteen year-old Latika, heart-stoppingly beautiful,\n     over the other side of the station. A world away. She\n     is scanning the crowd, as wired as he is.\n\n                                JAMAL\n                  Latika! Latika!\n\n     But though he is screaming her name, his voice is\n     swallowed by the noise around him. Then he sees two\n     thuggish-looking men also fighting a way towards her.\n\n                                JAMAL (CONT'D)\n                  Latika!\n\n     Frightened now, he fights his way down the steps, one\n     figure against an army of white-robed people.\n\n                                JAMAL (CONT'D)\n                  Latika!\n\n                                JAMAL V/O\n                  Chhatrapati Shivaji Terminus.\n\n                                PREM V/O\n                  Chhatrapati Shivaji Terminus.\n                  Sure?\n\n                                JAMAL V/O\n                  I think so.\n\n                                PREM V/O\n                  You think so. A brave man,\n                  Ladies and Gentlemen, a brave\n                  man.\n\n\n44   INT. CHHATRAPATI SHIVAJI TERMINUS. DAY.                   44\n\n     The commuters have mostly gone. Jamal is pacing the\n     platform desperately. He stops, stares blankly at the\n     statue in front of him- a proud, rather pompous figure\n     in a Victorian frock coat. The plaque reads: Frederick\n     Stevens.\n\n                                                        31.\n\n\n45   INT. INSPECTOR'S OFFICE. NIGHT.                           45\n\n     The Inspector, Srinivas and Jamal are staring at the\n     video recorder.\n\n                             JAMAL\n               Yes. Final answer. Chhatrapati\n               Shivaji Terminus.\n\n                             PREM\n               Is the right answer! Sixty-four\n               thousand rupees to you, Sir!\n\n     Applause and music. The Inspector presses pause. Stares\n     at Jamal.\n\n                             INSPECTOR\n               And did she come back?\n\n     Jamal smiles sadly.\n\n                             JAMAL\n               I wouldn't be here if she had.\n\n                             INSPECTOR\n               Pretty was she?\n\n     Jamal stares down at his feet.\n\n                             INSPECTOR (CONT'D)\n               Guess not.\n\n     Right in the eyes.\n\n                             JAMAL\n               The most beautiful woman in the\n               world.\n\n     Constable Srinivas snorts. Suddenly, Jamal is out of\n     his chair and at Srinivas' throat. The combined force\n     of the Inspector and Srinivas force him roughly back\n     down. He is again handcuffed to the chair.\n\n                             INSPECTOR OF POLICE\n               Well, well. The slum dog barks.\n               Money or women. The reason for\n               most mistakes in life. Looks\n               like you got mixed up with both.\n               Srinivas, you need the exercise:\n               a trip to VT Station to check on\n               the statue. And lock your bloody\n               bike up.\n\n     Constable Srinivas swears under his breath but bumbles\n     out.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                         32.\n45   CONTINUED:                                                45\n\n                                INSPECTOR\n                  That's the chutiyé out the way.\n                  Now, man to man. How did you\n                  know all the answers?\n\n                                JAMAL\n                  If I knew, I'd tell you.\n\n\n46   OMITTED                                                   46\n\n\n47   OMITTED                                                   47\n\n\n48   INT. STUDIO. NIGHT.                                       48\n\n                                PREM\n                  Now we're into the serious\n                  money. For two hundred and fifty\n                  thousand rupees, ladies and\n                  gentlemen, a quarter of a\n                  million rupees...the song Chalo\n                  Ri Murali was written by which\n                  famous Indian poet. Was it A)\n                  Surdas. B) Tulsidas. C) Mira\n                  Bai. D) Kabir. Remember you\n                  still have two lifelines- fifty-\n                  fifty and Phone A Friend.\n                  Tempted to use one?\n\n                                JAMAL\n                  No.\n\n                                PREM\n                  No?\n\n                                JAMAL\n                  I know this one.\n\n                                PREM\n                  Oh. I see. An expert on the\n                  poets, huh?\n\n     The lights dim, the music swells and Prem presses his\n     computer.\n\n\n49   EXT. MUMBAI STREET. NIGHT.                                49\n\n     Jamal is studying a piece of paper and reading out\n     numbers from it. There is something not quite right\n     about Jamal- perhaps the fact that there are two feet\n     by his ears. Salim is standing on his shoulders and\n     spraying the numbers on a wall with an aerosol and a\n     certain lack of confidence.\n\n\n\n                                                     (CONTINUED)\n\n                                                          33.\n49   CONTINUED:                                                 49\n\n                                JAMAL\n                  Four, nine, zero, nine- the one\n                  with the stick going down, Salim-\n                  six- stick going up-\n\n     Latika's head appears from around the corner.\n\n                                 LATIKA\n                        (whispered)\n                  Oi!\n\n     But they don't hear. Then she is running for her life\n     past the pair of them.\n\n\n                                JAMAL\n                  Six, one, shit, let's go-\n\n     Salim collapses off Jamal's shoulders and all three run\n     off down an alley past a dozen of the gang's sprayed-on\n     adverts all reading: \"Beanbags- 989 4909661\". A fat\n     Security Guard with a long stick huffs round the\n     corner. Chases them up an alley. Nowhere to go except\n     through an imposing gate that clearly leads to a\n     private house.\n\n                                SECURITY GUARD\n                  Got you now, little shits.\n\n\n50   EXT. GARDEN. NIGHT.                                        50\n\n     They charge across the lawn, down one side of the house\n     where all the washing is hanging. The Guard gets caught\n     up in drying sheets, towels. He fights his way through\n     to see Salim, Latika and Jamal leaping over the wall to\n     safety. But Jamal turns, jumps back and grabs a girl's\n     dress from the line.\n\n                                SECURITY GUARD\n                  Aha! Little thief!\n\n     The Security Guard lands a couple of blows on Jamal's\n     back as he dodges around him and back across the lawn,\n     dress in hand. The Security Guard gives up.\n\n                                SECURITY GUARD (CONT'D)\n                  Pervert!\n\n\n51   INT. ALLEY. NIGHT.                                         51\n\n     Jamal is examing the bruises on his legs.\n\n                                SALIM\n                  Useless bloody look-out. What\n                  good is she, huh?\n\n\n                                                      (CONTINUED)\n\n                                                        34.\n51   CONTINUED:                                                51\n\n                                LATIKA\n                       (infuriated)\n                  I tried to warn you.\n\n                                JAMAL\n                  It's okay, Salim.\n\n     Latika slips on the dress. Spins. Both of them look up.\n     Stare. She pulls her hair back, smiles, is transformed\n     into a beautiful girl.\n\n\n52   EXT. GORAI BEACH DUMPING GROUND. DAY.                     52\n\n     Blazing sun. Diggers and trucks are shifting mounds of\n     rubble on a rubbish dump that seems to stretch for\n     ever. Oblivious to the dust kicked up by the trucks,\n     Latika is picking up old plastic bags, examining each\n     one and putting the less worn in a big sack. The dress\n     is recognisable but dusty and torn. She stoops to dig\n     another bag out of the dirt, but stops and stares.\n     Shimmering in the heat, a rickety pick-up truck comes\n     through the rubbish dump gates. Toots at the Guard who\n     waves, pulls up in the dump. \"Hope Orphanage is written\n     on the side of the van. A man gets out. Looks around.\n\n\n53   INT. `TENT'. DAY.                                         53\n\n     Under sheets of plastic propped up on sticks, Jamal and\n     Salim are sleeping out the hottest part of the day.\n     Jamal wakes to see a figure standing over him- a\n     silhouette with a halo of sun behind him. Out of his\n     bag, the man produces a bottle of Thumbs Up. He uncaps\n     it with an alluring hiss. It is almost an advert for\n     thirst-quenching affluence. Almost instinctively, Salim\n     and Jamal stir.\n\n                                MAN\n                  Hello.\n\n     He hands the bottle to Salim, gets another from his bag\n     and waves it questioningly at Jamal.\n\n                                MAN (CONT'D)\n                  Hot, huh? My name is Maman.\n\n\n54   EXT. ORPHANAGE. EVENING.                                  54\n\n     The hills on the edge of Bombay. Greenery and space,\n     for the first time in the film. The pick-up truck pulls\n     up outside a building with Jamal, Salim and Latika\n     sitting on a bench in the back. Maman gets out. Drops\n     the gate on the back of the pick-up.\n\n                                MAMAN\n                  Anyone hungry? Come on in.\n\n                                                          35.\n\n\n55   INT. ORPHANAGE COURTYARD. EVENING.                         55\n\n     Twenty children are eating at long benches in a\n     ramshackle courtyard. Maman, ushers Jamal, Salim and\n     Latika in and sits them down at one of the benches. He\n     waves a hand and a giant man, Punnoose, comes over with\n     a big bowl of food. The three tear into it. Cleaning\n     every last morsel of rice from his plate, Jamal looks\n     up and notices a table peopled entirely with blind or\n     crippled children. Some of the legless are eating on\n     the floor next to the table. Jamal leans over to Salim.\n\n                             JAMAL\n               He must be a very good man to\n               look after these people.\n\n                             SALIM\n                    (glancing at them)\n               A saint.\n\n     Arvind, a boy smaller than either Jamal or Salim\n     overhears.\n\n                             ARVIND\n               We're not allowed to talk to\n               them.\n\n                                LATIKA\n               Why not?\n\n     Arvind shrugs. Latika licks her plate, glances at Maman\n     who is looking right at them.\n\n                             LATIKA (CONT'D)\n               Well, if there are seconds,\n               Maman is definitely a Saint.\n\n     As if telepathic, Maman signals to Punnoose and he\n     brings a large bowl of rice and dhal over to them.\n     Latika looks at Jamal and Salim. They burst out\n     laughing.\n\n                             LATIKA (CONT'D)\n               I tell you, Lord Siva is with\n               us.\n\n\n56   INT. ORPHANAGE. EVENING.                                   56\n\n     Salim, Latika, Jamal and a group of children are\n     standing in a line singing a doha- ancient lyrics set\n     to music. Maman is leading the singing, walking up and\n     down the line listening to each one individually. He\n     stops at one small boy, Arvind, and listens. Nods his\n     head, pleased, and continues down the line until he\n     stops in front of Jamal. Holds up his hand.\n\n                             MAMAN\n               Stop! You. Again.\n                                                   (CONTINUED)\n\n                                                          36.\n56   CONTINUED:                                                 56\n\n     Jamal starts singing again. He has the sweetest of\n     voices. Untrained but pure. Maman smiles, ruffles\n     Jamal's hair, impressed.\n\n                                  MAMAN (CONT'D)\n                  Everyone.\n\n     They all join in. Maman continues down the line. He\n     stops at Salim whose octave-slipping singing is lusty\n     and appallingly out of tune. Maman winces and moves on.\n     Standing next to Salim, Latika giggles. Immediately,\n     Salim is on her. Before a fight breaks out, Punnoose\n     pulls Salim off Latika and hurls him across the room.\n     Salim gets up and charges at Punnoose. For a second,\n     Punnoose is back-footed, but then pins Salim's arms to\n     his side. Maman laughs. Approaches Salim.\n\n                                MAMAN (CONT'D)\n                  You sing like one, and you fight\n                  like one. I think you've found\n                  your dog, Punnoose.\n\n\n57   EXT. CENTRAL MUMBAI TRAFFIC. DAY.                          57\n\n     A group of children are sitting in the jumble of\n     concrete under a motorway flyover. Cars surround them,\n     bumper to bumper. Latika and Jamal are playing an\n     improvised hopscotch on concrete slabs. They are\n     giggling, bumping into each other, tickling, laughing.\n     Salim and Punnoose are sitting together, smoking. Salim\n     is staring hard at Jamal and Latika until Punnoose\n     grunts, a sign for Salim to clap his hands.\n\n                                SALIM\n                  Okay, let's go, let's go! It's\n                  not a bloody holiday!\n\n     The children get to their feet. Latika sighs, puts a\n     patch over her eye and grabs a pair of crutches.\n     Suddenly, the lame beggar. Salim goes over to one of\n     the girls, who is carrying a sleeping baby. Puts out\n     his hand.\n\n                                  SALIM (CONT'D)\n                  Give me that.\n\n     The girl shakes her head. Salim grabs her by the hair\n     in one hand and takes the baby with the other. He\n     shoves her to the ground. The other children stare.\n\n                                  JAMAL\n                  Hey, Salim!\n\n     He challenges Jamal.\n\n                                SALIM\n                  What, choté bhai? You got a\n                  problem?\n                                                     (CONTINUED)\n\n                                                        37.\n57   CONTINUED:                                                57\n\n     He laughs and walks over to Latika.\n\n                                   SALIM (CONT'D)\n                  Here. For you.\n\n                                LATIKA\n                  I don't want it.\n\n                                SALIM\n                  You'll earn double. I'm doing\n                  you a favour, Latika.\n\n                                JAMAL\n                  She doesn't want it.\n\n                                   SALIM\n                  Chup, Jamal.\n\n     Latika turns away and begins to walk towards the cars.\n\n                                   SALIM (CONT'D)\n                  I'll drop it.\n\n     He holds the baby up. Latika grabs the baby with a cry\n     just as Salim releases it from his hands. Salim pinches\n     the baby.\n\n                                SALIM (CONT'D)\n                  Triple if it's crying.\n\n     Latika snatches it away. Salim laughs, goes back to\n     sitting with Punnoose. The children scatter to the cars\n     trapped at the lights, tapping plaintively on the\n     windows and making the universal begging gesture.\n\n\n58   INT. ORPHANAGE. KITCHEN. NIGHT.                           58\n\n     Surrounded by beer bottles, Punnoose is slumped asleep\n     by the kitchen door. Latika edges past, avoids the cook\n     sleeping under the table and goes to a shelf laden with\n     vegetables. She pulls down a bunch of chillies still on\n     the vine, strips a few off and tip-toes out with them.\n\n\n59   INT. ORPHANAGE. DORMITORY. NIGHT.                         59\n\n     Sleeping children, three or four to a mattress on the\n     floor. Latika tip-toes around the mattresses. She\n     pauses over one in particular where we see Salim,\n     asleep. She carefully pulls up the sheet, delves\n     underneath. Pleasant dreams cross Salim's sleeping face\n     for a second. Then suddenly, he is bolt upright and\n     screaming. He charges around the room clutching his\n     genitals in agony.\n\n                                SALIM\n                  Madher chod...!\n\n                                                    (CONTINUED)\n\n                                                           38.\n59   CONTINUED:                                                  59\n\n     He sprints out of the room, wailing.\n\n\n60   INT. ORPHANAGE. SHOWERS. NIGHT.                             60\n\n     The lights are on and two dozen children are screaming\n     with laughter as Salim stands under the make-shift\n     shower directing the water down his pants to his\n     burning genitals, his face a picture of agony. Latika\n     wipes crushed chillies from her hands.\n\n                                SALIM\n                  You're dead, sala.\n\n     She smiles and walks past Jamal with a shrug. Then\n     Punnoose comes stalking in and the children scatter\n     away.\n\n                                PUNNOOSE\n                  Get back to bed, dogs! What the\n                  hell...\n\n                                JAMAL V/O\n                  They taught me every song in the\n                  history of Indian music.\n\n                                INSPECTOR V/O\n                  And why would they do that, I\n                  wonder?\n\n\n61   INT. SHACK. NIGHT.                                          61\n\n     In a shack, Arvind is singing one of Surdas' bhajans in\n     front of Maman and an old man who by his ragged\n     appearance must be a villager. Punnoose and Salim sit\n     behind Arvind.\n\n                                MAMAN\n                  Very good, very good. I am\n                  pleased, Arvind. He is ready.\n\n                                ARVIND\n                  Ready?\n\n     Maman nods to Punnoose. Before Arvind can turn round,\n     Punnoose has covered his mouth with a cloth and after\n     the briefest of struggles, Arvind's body goes limp. The\n     villager puts an old tin box on the table. Taking the\n     lid from the tin, he brings out a cloth and unwraps it.\n     Inside is a spoon. He checks the edge with his thumb.\n     Sharp. Douses it with a clear liquid from a bottle and\n     passes it over a candle flame. The spoon whooshes with\n     a high flame for a moment. The villager wipes it with\n     the cloth nods to Punnoose.\n\n                                PUNNOOSE\n                  Salim!\n\n                                                     (CONTINUED)\n\n                                                           39.\n61   CONTINUED:                                                  61\n\n     Utterly bemused, Salim nevertheless helps Punnoose lay\n     Arvind on the table. The villager takes hold of\n     Arvind's eyelid and pulls it open. He brings the spoon\n     close. Suddenly, Salim is being sick in the corner of\n     the shack. By the time he has turned back, the villager\n     is wiping the spoon on a blood-soaked rag.\n\n                                MAMAN\n                  Okay. Take him out the back.\n\n     Punnoose picks up Arvind and carries him out.\n\n                                MAMAN (CONT'D)\n                  Now the other one. Salim, go get\n                  Jamal.\n\n     A frozen moment.\n\n                                SALIM\n                  What?\n\n                                MAMAN\n                  Gunfighter Number One, isn't\n                  that right, Salim? The money,\n                  the women, the cars...you want\n                  them bad, huh? And why not?\n\n     Maman gets out of his chair. Approaches Salim.\n\n                                MAMAN (CONT'D)\n                  The time has come to choose,\n                  yaar. The life of a slum dog or\n                  the life of a man. A real man. A\n                  gunfighter, Salim.\n\n     Maman holds Salim's head in his hands.\n\n                                MAMAN (CONT'D)\n                  Your destiny is in your hands,\n                  bhai. You can be me. Or nobody.\n                  Understand?\n\n                                SALIM\n                  Yes, Maman.\n\n     Maman nods.\n\n                                MAMAN\n                  So, brother, go get Jamal.\n\n     Salim is frozen for another few seconds, then turns and\n     walks out of the door. Punnoose appears at the door.\n     Maman nods to him and he slips off after Salim.\n\n\n62   INT. DORMITORY, ORPHANAGE. NIGHT.                           62\n\n     All the children are asleep apart from Jamal who is\n     crouched underneath a couple of wash-basins.\n                                                      (CONTINUED)\n\n                                                          40.\n62   CONTINUED:                                                 62\n\n     He is talking through a plate-sized hole in the\n     crumbling masonry. Latika's eyes can be seen.\n\n                                JAMAL\n                  ...weddings, government things,\n                  big parties. If Maman says my\n                  voice is ready. Big money.\n\n                                LATIKA\n                  Enough for a room?\n\n                                JAMAL\n                  Easily. Maybe an apartment.\n\n                                  LATIKA\n                  Really?\n\n                                JAMAL\n                  That's what Arvind said. On\n                  Harbour Road. You, me and Salim.\n                  The three musketeers.\n\n                                LATIKA\n                  Harbour Road! We can have ice\n                  cream from Babanji's.\n\n                                JAMAL\n                  Every day if we want.\n\n     Salim appears at the door. Nods his head at Jamal.\n\n                                  JAMAL (CONT'D)\n                  It's my turn.\n\n                                LATIKA\n                  Good luck, Jamal.\n\n     Latika's hand comes through the gap. Jamal takes it for\n     a moment. Salim hisses at Jamal. He lets go of the hand\n     and heads out.\n\n\n63   EXT. PATH. NIGHT.                                          63\n\n     Salim and Jamal walk along the path, Jamal humming\n     happily. Salim checks behind him, sees Punnoose\n     following.\n\n                                JAMAL\n                  So, this is it, hey, bhai? The\n                  good life, here we come....\n\n                                SALIM\n                       (conversationally)\n                  Athos.\n\n     Jamal is suddenly alert. Slows\n\n\n                                                     (CONTINUED)\n\n                                                        41.\n63   CONTINUED:                                                63\n\n                                  JAMAL\n                  Porthos?\n\n     Salim nods. Big smile. Puts a hand on Jamal's shoulder.\n\n                                  SALIM\n                  When I say.\n\n\n64   INT. SHACK. NIGHT.                                        64\n\n     Salim guides Jamal into the shack where Maman and the\n     Villager are waiting. Maman smiles. Punnoose slips in\n     behind Salim.\n\n                                MAMAN\n                  Jamal, hello. You have done\n                  well. It's time for you to- turn\n                  professional.\n\n                                  JAMAL\n                  Really?\n\n                                MAMAN\n                  Sing me a song, yaar. How about\n                  Chalo Ri Murali, huh? My\n                  favourite.\n\n     Jamal opens his mouth, then closes it again. Holds out\n     his hand.\n\n                                  JAMAL\n                  Fifty rupees.\n\n                                  MAMAN\n                  What?\n\n                                JAMAL\n                       (shrugs)\n                  I've turned professional. What\n                  can I do?\n\n     Maman laughs.\n\n                                  MAMAN\n                  Sala...!\n\n     He throws some notes at him.\n\n\n65   EXT. SHACK. NIGHT.                                        65\n\n     Outside, a giggle. Latika is peering through a gap in\n     the wall.\n\n                                                          42.\n\n\n66    INT. SHACK. NIGHT.                                        66\n\n      Jamal begins to sing. Maman waits a while, then nods to\n      Punnoose. Behind Jamal, Punnoose hands Salim the bottle\n      of chloroform and the rag. Salim approaches the back of\n      Jamal. Salim waits until he has finished the song.\n      Raises his hand with the rag in it. Maman smiles, nods.\n      Salim flings the contents of the bottle in Punnoose's\n      face. Punnoose screams and stumbles back clutching his\n      eyes, knocking over the table.\n\n                                SALIM\n                Go!\n\n      Salim and Jamal scramble for the door. The knocked-over\n      candle catches the spilled chloroform and a curtain\n      which whooshes up in flame.\n\n                                LATIKA\n                Jamal!\n\n                                JAMAL\n                Run!\n\n\n66A   EXT. SHACK. NIGHT.                                        66A\n\n      They charge past the prone Arvind- a flash of bloodied\n      bandages covering his eyes.\n\n\n67    EXT. HILLSIDE. NIGHT.                                     67\n\n      Heavy, desperate breathing. Feet stumble on roots. Fall\n      into holes. The three children are running. Branches\n      smack into their faces. But they are so scared, nothing\n      will stop them. Behind them, torches scour the\n      undergrowth. Men shouting. They break out of the woods\n      and are confronted with a train goods yard.\n\n\n68    EXT. GOODS YARD. NIGHT.                                   68\n\n      They run over the tracks, between the trains, but the\n      shouts are getting louder, the torches closer. A diesel\n      engine is moving out of the station. Jamal, Latika and\n      Salim sprint for the Guard's Van at the very back of\n      the moving train. Punnoose is closest to them. Salim is\n      fastest and first to jump the train. He holds out his\n      hand. Jamal grabs it and is hauled in. Jamal holds his\n      hand out to Latika.\n\n                              JAMAL\n                Come on! Faster!\n\n      She reaches out to him. Their hands almost touch.\n\n\n\n                                                    (CONTINUED)\n\n                                                             43.\n68   CONTINUED:                                                    68\n\n                                JAMAL (CONT'D)\n                  Take it! Take it! I can't\n                  reach...\n\n     Salim barges Jamal out of the way. Jamal      stumbles back\n     as Salim reaches his hand out to Latika,      so he doesn't\n     see Latika's hand grasp Salim's, nor see      their eyes\n     lock onto each other, nor see Salim very      deliberately\n     let go of her hand. Latika stumbles.\n\n                                LATIKA\n                  Jamal!\n\n     Jamal scrambles to the rail. The train gains more\n     speed. Jamal climbs on to the top rung, makes to jump,\n     but Salim flings him backward. Jamal tries to scramble\n     to his feet again, but Salim restrains him.\n\n                                JAMAL\n                  Got to go back. We've got to go\n                  back.\n\n                                SALIM\n                  He'll kill us if we go back.\n                  Jamal! He was going to take your\n                  eyes out- with a bloody spoon!\n\n     The train is speeding along. Jamal breaks free and\n     stares back at Latika.\n\n                                SALIM (CONT'D)\n                  She'll be alright. She always\n                  is.\n\n     Latika stumbles again and stops running. They watch as\n     Punnoose catches up with her and stops running. He\n     smashes Latika to the ground.\n\n\n69   INT. STUDIO. NIGHT.                                           69\n\n                                PREM\n                  The question was, for two\n                  hundred and fifty thousand\n                  rupees: who wrote the famous\n                  song Chalo Ri Murali. I should\n                  warn you, Jamal: from this\n                  question on, if you get the\n                  answer wrong you lose\n                  everything. So. Are you sure?\n                  The life-lines are there....\n\n                                JAMAL\n                  Surdas.\n\n\n                                PREM\n                  Surdas. Apka final jawab?\n\n                                                        (CONTINUED)\n\n                                                         44.\n69   CONTINUED:                                                69\n\n                                  JAMAL\n                  Yes.\n\n                                PREM\n                  Computer-ji, A lock kiya-jaye.\n\n     The lights dim, the music swells. Prem presses a button\n     on his computer: looks him straight in the eyes for an\n     age.\n\n                                PREM (CONT'D)\n                       (simply)\n                  Guess what? You're right.\n\n     Applause, music, lights.\n\n\n70   INT. INSPECTOR'S OFFICE. DAY.                             70\n\n     The Inspector is eying Jamal, weighing it all up.\n\n                                JAMAL\n                       (shrugging)\n                  Blind singers earn double. You\n                  know that.\n\n                                INSPECTOR\n                  And what happened to the girl?\n                  They blinded her too?\n\n                                JAMAL\n                       (shakes his head)\n                  They had other plans. Though it\n                  took me a long, long time to\n                  find out.\n\n\n71   EXT. TRAIN. MORNING.                                      71\n\n     Salim and Jamal are sitting on top of the train. Jamal\n     is staring blankly down the track.\n\n                                  SALIM\n                  Aré, Jamal...\n\n     Salim puts an arm around Jamal's shoulder. Jamal wipes\n     the tears from his eyes, shakes his head furiously.\n\n\n     Salim gets up. Holds out his hand.\n\n                                  SALIM (CONT'D)\n                  Come.\n\n                                JAMAL\n                  Where you going?\n\n                                SALIM\n                  First class, bhai. Where else?\n\n                                                        45.\n\n\n72   INT/ EXT. FIRST CLASS CARRIAGE. MORNING.                  72\n\n     The ancient train is huffing slowly up an incline. A\n     middle class Indian couple with their three children\n     are sitting at a table, their breakfast spread before\n     them. Into this domestic scene, unseen by them comes\n     Jamal. Upside down and still outside the train, he is\n     clearly being dangled by his ankles from the train\n     roof. He gives a few, silent directional signs to Salim\n     who manoeuvres him across, dips his hand into the open\n     window, snatches a chapatti and signals franticly to be\n     hoisted up. The family continue to eat, unperturbed.\n\n     Then Jamal appears again. This time one of the children\n     spots him. Despite Jamal giving her a friendly wave,\n     she yelps. The father of the group grabs Jamal's hand\n     which has just snatched a samosa. There is a tussle,\n     Salim holding onto Jamal's legs, the father holding\n     onto Jamal's arms and Jamal in the middle, shouting.\n     Salim is losing the battle and his footing. He stumbles\n     and the pair of them fall from the train, rolling and\n     tumbling down an embankment in slow-motion.\n     Interspersed with the seemingly endless tumble are\n     images of Jamal and Salim on top of different trains-\n\n     - huddled together against the freezing rain...\n\n     - surfing the wind at the front of the train...\n\n     - admiring the distant Himalaya....\n\n                             JAMAL V/O\n               We criss-crossed the country\n               from Rajasthan to Calcutta.\n               Every time we were thrown off we\n               got back on again. This was our\n               home for years. A home with\n               wheels and a whistle.\n\n     The final tumble as they crash onto flat ground.\n\n\n73   EXT. RAILWAY EMBANKMENT. DAY.                             73\n\n     Groggily, Jamal sits up and groans. Somehow in the\n     tumble, he has been transformed into a twelve year-old.\n     And Salim a strong fourteen year-old. Through the haze\n     of pain and dust, Jamal sees something glinting in the\n     distance- something impossibly beautiful.\n\n                             JAMAL\n               Salim? Is this heaven?\n\n                             SALIM\n               You're not dead, Jamal.\n\n     Jamal clears his head. Sees Salim picking himself up\n     from the ground. But the apparition is still there.\n\n                                                   (CONTINUED)\n\n                                                         46.\n73   CONTINUED:                                                73\n\n                                JAMAL\n                  So what's that?\n\n                                SALIM\n                  Wow.\n\n     They stare at the apparition. The unmistakable outline\n     of the Taj Mahal rises from the horizon, pink in the\n     morning sun. Nothing could be more beautiful.\n\n                                JAMAL\n                  Some hotel, huh?\n\n\n74   EXT. TAJ MAHAL. DAY.                                      74\n\n     Jamal and Salim wander under the great dome of the Taj\n     Mahal. Two tiny slum kids dwarfed by this massive\n     monument to love. It is a moment of genuine wonderment\n     for them. Then a tour guide bustles nearby, tourists\n     flowing behind him.\n\n                                GUIDE\n                  ...there are five main elements\n                  to the Taj. The Darwaza, the\n                  main gateway, the Bageecha or\n                  garden, the Masjid or mosque,\n                  the Naqqar Khana, the rest house\n                  and the Rauza or mausoleum. If\n                  you would like to follow me, I\n                  will show you the ninety-nine\n                  names of Allah on Mumtaz's tomb.\n                  As before, please remove your\n                  shoes.\n\n     Jamal follows the Guide and his entourage into the\n     mausoleum. Salim meanwhile is studying the line of\n     shoes. Tries a smart pair of women's court shoes,\n     before slipping a foot into a nice, white sneaker. A\n     smile crosses his face. His other foot quickly follows\n     and he saunters away, all mock-innocence.\n\n\n75   EXT. TAJ MAHAL. DAY                                       75\n\n     Jamal comes out of the mausoleum into the bright\n     sunlight and looks around for Salim. No sign of him.\n     Suddenly, a German couple approach.\n\n                                ADA\n                  Please, what time is the next\n                  tour?\n\n                                JAMAL\n                  Err-\n\n                                PETER\n                  - so much waiting around in this\n                  damned country.\n                                                     (CONTINUED)\n\n                                                          47.\n75   CONTINUED:                                                 75\n\n     Jamal notices that he is standing next to a sign\n     advertising guided tours of the Taj.\n\n                                JAMAL\n                  No, I-\n\n                                ADA\n                  - we're on a very tight\n                  schedule, you see, young man.\n                  Have to see the Red Fort this\n                  afternoon. Would it be possible\n                  to show us around now? Obviously\n                  we understand it would cost more\n                  for just the two of us...\n\n     Peter waves a couple of thousand rupee notes at Jamal.\n     His eyes widen.\n\n                                JAMAL\n                  But of course, Madam. Please\n                  follow me.\n\n     Jamal stalks off. The Germans follow. Jamal stops\n     before the monument. Points a confident arm at it.\n\n                                JAMAL (CONT'D)\n                  This is....the Taj Mahal.\n\n     A terrible pause as Peter and Ada stare at him. Clearly\n     more is expected. He moves off at a pace.\n\n                                 JAMAL (CONT'D)\n                  The Taj Mahal was built by the\n                  Emperor Khurram for his wife\n                  Mumtaz who was maximum beautiful\n                  woman in the whole world. When\n                  she died, the Emperor decided to\n                  build this five star hotel for\n                  everyone who wanted to visit her\n                  tomb...but he died in- in\n                  fifteen eighty-seven, before any\n                  of the rooms were built. Or the\n                  lifts. The swimming pool,\n                  however, as you can see was\n                  completed on schedule in top\n                  class fashion.\n\n     He waves confidently in the direction of the fountains.\n\n                                ADA\n                  It says nothing of this in the\n                  guide book.\n\n                                JAMAL\n                  With respect, Madam, the guide\n                  book is written by a bunch of\n                  lazy, good-for-nothing, Indian\n                  beggars.\n\n                                                     (CONTINUED)\n\n                                                         48.\n75   CONTINUED: (2)                                            75\n\n                             ADA\n               Oh.\n\n                             JAMAL\n               And this, Lady and Gentleman, is\n               burial place of Mumtaz.\n\n                             ADA\n               How did she die?\n\n                             JAMAL\n               A road traffic accident.\n\n                             ADA\n               Really?\n\n                             JAMAL\n               Maximum pile-up.\n\n                             PETER\n                    (suspicious)\n               I thought she died in child-\n               birth.\n\n                             JAMAL\n                    (nodding sagely)\n               Exactly, Sir. She was on the way\n               to the hospital when it\n               happened.\n\n     Jamal moves on. Ada and Peter exchange a glance.\n\n                              ADA\n                    (shrugging)\n               You've seen the way they drive\n               around here...\n\n\n76   EXT. TAJ MAHAL. DAY.                                      76\n\n     Montage of Jamal authoritatively showing tourists\n     around the Taj Mahal.\n\n                             JAMAL V/O\n               It was the best-paid job I've\n               ever had.\n\n                             JAMAL\n               This is the Princess Diana seat,\n               Madam. Allow me.\n\n     Jamal shows the tourist a battered postcard of Princess\n     Diana, staring doe-eyed into the distance with the Taj\n     behind. The tourist sits. Jamal adjusts her legs so\n     that they match the postcard. Takes the photo....\n\n                             SALIM O/S\n               Tourist police!\n\n                                                   (CONTINUED)\n\n                                                         49.\n76   CONTINUED:                                                76\n\n     ...and abandons the woman with a polite bow, charging\n     for safety as two Police Officers race towards him.\n\n                                                      CUT TO:\n\n\n77   EXT. TAJ MAHAL. DAY.                                       77\n\n     Jamal stands a Tourist on a wall and positions his\n     hands to create the optical illusion that he is\n     dangling the Taj from his fingers. Takes a photo for\n     the Tourist. Behind the Tourist, Salim and a boy called\n     Shankar pick up the Tourist's shoes and saunter\n     casually across the grass.\n\n                                                      CUT TO:\n\n\n78   EXT. ROADSIDE MARKET. AGRA. DAY.                           78\n\n     By the side of a busy market street Salim stands next\n     to a row of stolen shoes. Sneakers, court shoes,\n     sandals, high heels...he is busy bartering with a man\n     over a pair whilst Jamal tries to shout up business.\n\n                                JAMAL\n                  Top-class fashion, bottom-class\n                  prices! Shoes for all! Shoes for\n                  all!\n\n\n79   EXT. BOYS CAMP, YAMUNA RIVER. DAY.                         79\n\n     Hectares of drying clothes by the side of the river.\n     Spectacular squares of red, saffron, white. Not far\n     away from the dhobi ghat, there is a makeshift slum-\n     camp where Salim and a gang of children are sitting,\n     smoking. Jamal joins them, hands over a wad of rupees\n     to Salim. Salim counts the cash, hands half to Shankar\n     and slaps Jamal so hard on the back that he nearly\n     falls over.\n\n                                JAMAL V/O\n                  And life was good.\n\n\n80   EXT. SLUM. DAY.                                            80\n\n     Jamal gets out of a new Mercedes driven by an Indian\n     Man. A middle-aged American couple also get out. Jamal\n     points them down a lane which opens out on India's\n     largest dhobi where hundreds of women are beating\n     clothes on stone slabs.\n\n                                JAMAL\n                  This is the biggest dhobi ghat\n                  in the whole of India, Mister\n                  David.\n                                (MORE)\n                                                     (CONTINUED)\n\n                                                          50.\n80   CONTINUED:                                                 80\n                                JAMAL (CONT'D)\n                  They say that every man in Uttar\n                  Pradesh is wearing a kurta that\n                  has been washed here at least\n                  one time.\n\n                                CLARK\n                  Is that so? That's amazing.\n                  Let's get a look at this, Adele.\n\n     He gets out his video camera and wanders towards the\n     dhobi ghat. Behind them a motor rickshaw pulls up.\n     Salim, Shankar and a couple of the street kids from the\n     Taj leap out. Within seconds, the Mercedes is up on\n     bricks and the wheels are being removed. Salim takes a\n     hacksaw to the Mercedes badge on the bonnet, whilst\n     urging the others on.\n\n                                SALIM\n                  Aré, sala! Formula One, Formula\n                  One! Pit-stop ka speed,\n                  Schumacher ka ishtyle\n\n     The crowds in the lane barely notice as the car is\n     stripped of all its parts.\n\n                                SALIM (CONT'D)\n                  Go, go!\n\n     A shout from the top of the lane and the boys scatter,\n     bouncing the four wheels at speed down the lane. Jamal,\n     the Indian driver and the two Americans return. They\n     stop in front of the denuded car.\n\n                                CLARK\n                  Woah. What happened here?\n\n     Suddenly the Indian driver is slapping Jamal\n     ferociously around the head with one of his shoes.\n\n                                DRIVER\n                  I give you two tight slaps,\n                  mader chod!\n\n                                JAMAL\n                  I don't know! I didn't do it,\n                  did I...? Nothing to do with\n                  me...get off!\n\n     But the beating continues, the driver kicking Jamal\n     down onto the floor. The two Americans stare, uncertain\n     what to do.\n\n                                ADELE\n                  Do something, Clark.\n\n                                CLARK\n                  Well, I- I dunno, I-\n\n     Finally Clark intervenes, pulling the driver off Jamal.\n                                                     (CONTINUED)\n\n                                                            51.\n80   CONTINUED: (2)                                                80\n\n                             CLARK (CONT'D)\n               Okay, okay, just cool it. You're\n               insured, aren't you? Jesus\n               Christ...\n\n     Jamal sits up. He is bleeding from his nose and mouth.\n\n                                  CLARK (CONT'D)\n               You okay?\n\n                             JAMAL\n               You wanted to see the `real\n               India', Mister David. Here it\n               is.\n\n                             ADELE\n               Well, here's a bit of the real\n               America, too, son.\n\n     Adele pulls out his wallet and rummages for dollars.\n\n\n81   EXT. YAMUNA RIVER. NIGHT.                                     81\n\n     A battered Jamal limps along the river bank towards the\n     Taj. He stops, bathes his swollen face in the river.\n     Then looks up. Strange lights appear to emanate from\n     the base of the monument. And then strange sounds.\n\n\n82   EXT. TAJ MAHAL. NIGHT.                                        82\n\n     Jamal climbs   a crumbling   wall and is confronted with an\n     opera taking   place right   under the dome. Gluck's Orfeo\n     ed Euridice.   Hundreds of   India's smartest professionals\n     are watching   from banked   seating on a scaffolding\n     frame.\n\n\n83   EXT. STANDS. NIGHT.                                           83\n\n     Jamal and a couple of street kids slip under the\n     scaffolding supporting the banked seats. The street\n     kids are trying to reach the hand-bags of the women\n     above them.\n\n                             BOY\n                    (hissing)\n               Oi, Jamal! There's a woman with\n               no panties on over here.\n\n     Jamal reaches up and easily lifts a wallet from a man's\n     trouser pocket. On stage, the actors start singing.\n     Jamal seems to have forgotten the wallet and stares,\n     mesmerised, at the stage.\n\n                             WOMAN\n               Why don't you put it back and\n               listen to the music?\n                                                       (CONTINUED)\n\n                                                           52.\n83   CONTINUED:                                                  83\n\n     Jamal starts, makes to run, but the woman who spoke\n     holds out a cigarette. A Canadian back-packer is\n     sitting, staring at the singers.\n\n                                WOMAN (CONT'D)\n                  It's called Orfeo. Orpheus and\n                  Eurydice. Orpheus- that one\n                  there- is looking for his lover,\n                  Eurydice. She died, but he can't\n                  live without her.\n\n     She hands him a cigarette. He puts the wallet back. She\n     smiles at him and they both turn to the stage.\n\n                                WOMAN (CONT'D)\n                  The pain is so bad that he goes\n                  to the underworld- the place we\n                  go when we die- to try to get\n                  her back.\n\n                                JAMAL\n                  You can't do that. Can you?\n\n                                WOMAN\n                       (shrugging)\n                  You can in opera.\n\n                                JAMAL\n                  Does he find her?\n\n                                   WOMAN\n                  Watch and see.\n\n     Jamal watches as Orpheus sings one of the most\n     beautiful pieces of music a human is likely to hear.\n     Tears are running down Jamal's cheeks.\n\n\n84   EXT. YAMUNA RIVER. NIGHT.                                   84\n\n     Salim, Shankar, Jamal and the Taj Gang are gathered\n     around a campfire. All of them wear extraordinary foot-\n     wear of one form or another, from elaborate high heels\n     to walking boots five sizes too large. A home-made\n     hooka pipe is being passed around the fire. The eyes of\n     the children have long since stopped focussing. Salim\n     is sporting a Mercedes Benz badge on a chain around his\n     neck. Behind him, Jamal appears, his face swollen. He\n     takes off his fake Guide's Badge and throws it in the\n     fire.\n\n                                SALIM\n                  Woah! What are you- Jamal?\n\n                                JAMAL\n                  We have to go, Salim.\n\n                                   SALIM\n                  Go? Go where?\n                                                     (CONTINUED)\n\n                                                           53.\n84   CONTINUED:                                                  84\n\n                                   JAMAL\n                  Bombay.\n\n                                SALIM\n                  Don't be stupid. We're making\n                  good money here.\n\n                                JAMAL\n                  We should have gone a long time\n                  ago.\n\n     Salim turns to Shankar with sudden understanding.\n\n                                SALIM\n                  Oh, God. Baby brother's in love.\n                  With a flat-chested hijra.\n\n                                JAMAL\n                  Latika was one of us. A\n                  musketeer.\n\n                                SALIM\n                  A musketeer...Grow up, Jamal.\n                  Look, how was I to know they'd\n                  beat you up. Here, you can have\n                  some of the cash. Come on...\n\n                                   JAMAL\n                  I've got cash.\n\n     He rips out a wad of dollar bills from his pocket.\n\n                                   JAMAL (CONT'D)\n                  Dollars.\n\n                                   SALIM\n                  How much?\n\n                                JAMAL\n                  Enough. I'm getting my stuff.\n\n     He walks off.\n\n                                SALIM\n                  Wait! Jamal! Ah, shit!\n\n     He gets up, kicks the fire in rage and stomps after\n     Jamal.\n\n\n85   INT. STUDIO. NIGHT.                                         85\n\n     Prem leans back in his chair.\n\n                                PREM\n                  So, my friend: ready for another\n                  question.\n\n\n                                                     (CONTINUED)\n\n                                                         54.\n85   CONTINUED:                                                85\n\n                                JAMAL\n                  Yes.\n\n     Prem presses his computer. The lights dim again, the\n     music comes up.\n\n                                PREM\n                  For a straight one million\n                  rupees, Ladies and\n                  Gentlemen...On an American One\n                  Hundred Dollar Bill there is a\n                  portrait of which American\n                  statesman? Is it A), George\n                  Washington, B) Franklin\n                  Roosevelt, C) Benjamin Franklin,\n                  D) Abraham Lincoln?\n\n     Silence from Jamal.\n\n                                PREM (CONT'D)\n                  Pay or play, Jamal? All you have\n                  to do is stop now and you walk\n                  away with a cool quarter of a\n                  million rupees. Decide to play,\n                  get the answer wrong and you\n                  walk away with absolutely\n                  nothing. But, get the answer\n                  right and you win a million\n                  rupees. So. You decide. Pay or\n                  play?\n\n     A long pause.\n\n\n86   INT. GALLERY. NIGHT.                                      86\n\n                                DIRECTOR\n                  Okay, he hasn't got a clue. This\n                  is going to be a walk-away.\n                  Stand by.\n\n                                VISION MIXER\n                  No, he's going to play with him,\n                  first.\n\n\n87   INT. STUDIO. NIGHT.                                       87\n\n                                PREM\n                  Get a lot of hundred dollar\n                  bills in your line of work,\n                  Jamal?\n\n                                JAMAL\n                  The minimum tip for my services.\n\n     Laughter from the audience.\n\n\n                                                     (CONTINUED)\n\n                                                           55.\n87   CONTINUED:                                                  87\n\n                                PREM\n                  Now I know why my cell phone\n                  bill is so high...they pay the\n                  chi-wallah in hundred dollar\n                  bills!\n\n                                JAMAL\n                  It's C. Benjamin Franklin.\n\n     A gasp from the audience. Prem is caught off-guard.\n\n                                PREM\n                  Woah! We haven't locked the\n                  computer, man. You're going to\n                  play?\n\n                                JAMAL\n                  I think I just have. Haven't I?\n\n                                PREM\n                  You certainly have. C. Right?\n\n                                JAMAL\n                  Right. C.\n\n                                PREM\n                  Not confusing your Franklins?\n                  Benjamin for Roosevelt?\n\n                                JAMAL\n                  I've never heard of Roosevelt\n                  Franklin.\n\n                                PREM\n                  There's a million rupees at\n                  stake and he's never heard of\n                  Roosevelt Franklin...I can't\n                  bear to look.\n\n     He gives this one to the audience who titter on cue.\n     Jamal looks confused.\n\n                                PREM (CONT'D)\n                  No, no. Don't you worry, Jamal.\n                  You were asked which statesman\n                  is depicted on a hundred dollar\n                  bill. You said C. Benjamin\n                  Franklin. Ladies and\n                  Gentlemen...\n\n     He presses the computer, pretends to ruminate for a\n     while with his finger pressed to his lips.\n\n                                PREM (CONT'D)\n                  Jamal Malik- you chose to play\n                  not pay. I'm afraid you no\n                  longer have two hundred and\n                  fifty thousand rupees....\n\n                                                    (CONTINUED)\n\n                                                           56.\n87   CONTINUED: (2)                                              87\n\n     Prem leans over and tears up the cheque. There is a\n     sigh of disappointment from the audience, a look of\n     confusion on Jamal's face.\n\n                             PREM (CONT'D)\n               ...you in fact have one million\n               rupees!\n\n     Wild applause from the audience. Jamal allows himself a\n     genuine smile.\n\n\n88   INT. INSPECTOR'S OFFICE. DAY.                               88\n\n     The Inspector pulls out a note from his wallet. Glances\n     at it.\n\n                             INSPECTOR\n               Who's on the thousand rupee\n               note?\n\n                               JAMAL\n               I don't know.\n\n     He waves the note at him.\n\n                               INSPECTOR\n               It's Gandhi!\n\n                             JAMAL\n               I've heard of him.\n\n     The Inspector kicks his chair.\n\n                             INSPECTOR\n               Don't get clever or I'll get the\n               electricity out again.\n\n                             JAMAL\n               They didn't ask me that\n               question. I don't know why. Ask\n               them.\n\n     The Inspector stares hard at Jamal.\n\n                             INSPECTOR\n               Funny, you don't seem that\n               interested in money.\n\n     Then, Constable Srinivas stomps back into the office,\n     sweat pouring from him.\n\n                             CONSTABLE SRINIVAS\n               Platform Seventeen-\n\n     Has to consult his notebook.\n\n\n\n                                                   (CONTINUED)\n\n                                                           57.\n88   CONTINUED:                                                  88\n\n                                CONSTABLE SRINIVAS (CONT'D)\n                  A statue of Frederick Stevens,\n                  architect and builder of\n                  Victoria Terminus in -\n\n                                INSPECTOR OF POLICE\n                  - yes, yes, Srinivas. The\n                  hundred dollar bill.\n\n\n89   EXT. BOMBAY. DAY.                                           89\n\n     From a thousand feet in the sky, looking down on the\n     limitless megatropolis of Mumbai. Half-built sky-\n     scrapers, slums, factories, roads, trains.\n\n                                JAMAL V/O\n                  Bombay had turned into Mumbai.\n\n     We descend, down until the lines of ants become people.\n\n                                JAMAL V/O (CONT'D)\n                  The orphanage had gone, the slum\n                  had gone, the people.... all\n                  gone. And everywhere was\n                  building, building, building.\n\n     Descending even further, we pick out a construction\n     site and then Jamal....\n\n\n90   EXT. CONSTRUCTION SITE. DAY.                                90\n\n     ..who is staring through a wire fence at the\n     construction site.\n\n                                JAMAL V/O\n                  But I knew she was here.\n                  Somewhere she was here.\n\n     He turns away, then something catches his eye.\n     Underneath all the scraps of flyers and posters on a\n     broken wall is a corner of something that Jamal\n     recognises. He tears back a poster. Underneath, faded\n     but recognisable is one of their beanbag graffiti\n     advertisements.\n\n\n91   EXT. SLUM. NIGHT.                                           91\n\n     Jamal asks a group of stall-holders on the slum main\n     street. They shrug, aren't interested. The camera pulls\n     up and up until Jamal is nothing but a dot wandering\n     the maze of lanes, railways and highways, one among\n     endless millions of people.\n\n                                JAMAL V/O\n                  Evenings, I searched. Days, I\n                  worked.\n\n                                                           58.\n\n\n92   EXT. HOTEL. DAY.                                            92\n\n     Jamal wanders up to the rickshaw drivers parked outside\n     the hotel. He stops and asks a question. The drivers\n     shake their heads. Jamal continues up the steps towards\n     a door, exhausted face and grubby clothes walking\n     straight towards camera. He goes through the door and\n     immediately....\n\n\n93   INT. HOTEL. FOYER. DAY.                                     93\n\n     ....is, without breaking step in a slightly grubby\n     white uniform. He walks across the echoing, marble\n     floor of a struggling four-star hotel, goes through\n     double doors....\n\n\n94   INT. HOTEL CORRIDOR. DAY.                                   94\n\n     ...into a corridor that is devoid of carpet, paint-\n     anything except a phone on the bare wall and a stool.\n     The phone is ringing. Jamal sits on the stool and\n     answers the phone.\n\n                             JAMAL\n               Room service, good afternoon?...\n               Yes, sir. Two chicken burgers,\n               two fries, one cocoa-cola and\n               one mango lassi and a large\n               bottle of mineral\n               water...Bisleri or Himalayan\n               Spring, Sir?...Certainly, Sir.\n               That will be with you in fifteen\n               minutes, Sir. Thank you. Have a\n               nice day.\n\n     He hangs up and goes through another set of doors...\n\n\n95   INT. HOTEL KITCHENS. DAY.                                   95\n\n     ...to a cramped kitchen with definite hygiene problems.\n     The cooks are playing carom on the table while under it\n     Salim is dozing.\n\n                             JAMAL\n               Two chicken burgers, coke, mango\n               lassi and a bottle of Bisleri.\n\n     Dozily, Salim gets up and takes a look behind one of\n     the fridges. He chases out a chicken with a desultory\n     kick and sorts through some empty mineral water bottles\n     until he finds a Bisleri bottle. Salim fills the bottle\n     of mineral water from the tap and begins delicately re-\n     sealing the tamper-proof lid with super-glue. Jamal\n     collects cutlery and starts laying out a tray.\n\n\n                                                   (CONTINUED)\n\n                                                         59.\n95   CONTINUED:                                                95\n\n                                JAMAL (CONT'D)\n                  I'm going to Chowpatti again,\n                  okay? Want to come?\n\n                                SALIM\n                  For God's sake. You got some\n                  disease? You force me back to\n                  this shit-hole, we leave our\n                  friends, a good life, loads of\n                  money- for this. Isn't that\n                  enough?\n\n                                JAMAL\n                  We came back to find her.\n\n                                SALIM\n                  No, you did, Jamal, not me. Me,\n                  I don't give a shit about her.\n                  Plenty of pussy in Bombay for\n                  Salim. Oh, yes, sir! You should\n                  come down the Cages on Saturday\n                  night instead of searching for\n                  your lost love.\n\n                                JAMAL\n                  I'm going to Chowpatti.\n\n                                 SALIM\n                       (impersonating Ram)\n                  \"I'm going to Chowpatti\". There\n                  are nineteen million people in\n                  this city, Jamal. Forget her.\n                  She's history.\n\n                                JAMAL V/O\n                  But she wasn't.\n\n\n96   EXT. BANDRA BANDSTAND. DAY.                               96\n\n     Jamal is dodging the traffic at a busy junction. He\n     moves around the beggars who are working the cars. Then\n     he hears singing. He looks around, suddenly panicked.\n     It is a siren song drawing him across the road, not\n     even noticing that he is narrowly run down by a couple\n     of cars, to a traffic island underneath a flyover. He\n     turns a corner and there is the singer, leaning up\n     against one of the struts of the flyover. Arvind. Older\n     now, just like Jamal, a fourteen year-old boy. But eye-\n     less. Jamal freezes. He approaches Arvind and waits\n     until he has finished singing. Despite his eyeless\n     sockets, Arvind appears to know somebody is there. He\n     turns and bows low, putting his hands together.\n\n                                ARVIND\n                  Namaste, Sahib. Any kindness you\n                  give will be repaid in heaven\n                  many times.\n\n                                                     (CONTINUED)\n\n                                                           60.\n96   CONTINUED:                                                  96\n\n     Jamal gets a couple of notes out of his pocket and puts\n     them into Arvind's outstretched hand. He feels the\n     notes with his fingers.\n\n                                ARVIND (CONT'D)\n                  A fifty. And a hundred!\n                  Blessings upon you, Sahib.\n\n                                JAMAL\n                  How do you know?\n\n                                ARVIND\n                  There are many ways of seeing.\n\n     Arvind puts his hands together and bows deep again.\n     Then, Jamal takes his shoe off and gets out a hundred\n     dollar bill.\n\n                                 JAMAL\n                  Here.\n\n     Jamal crouches down and puts the bill into Arvind's\n     hand. His fingers feel it. He sniffs it.\n\n                                ARVIND\n                  Dollars. But how many?\n\n                                 JAMAL\n                  One hundred.\n\n                                ARVIND\n                  Now you are playing with me,\n                  Sahib.\n\n                                 JAMAL\n                  No. I swear.\n\n                                ARVIND\n                  What is on it? The pictures.\n                  Tell me.\n\n                                JAMAL\n                  A building. With a clock on it.\n                  Trees behind it.\n\n                                ARVIND\n                  The other side. Turn it over.\n\n                                JAMAL\n                  A man- it doesn't say his name.\n                  He is sort of bald, but has long\n                  hair on the sides.\n\n                                ARVIND\n                       (smiling)\n                  Benjamin Franklin. My God, my\n                  God. Thank you, Sahib. You were\n                  generous the first time. But\n                  this...\n                                                     (CONTINUED)\n\n                                                       61.\n96   CONTINUED: (2)                                          96\n\n     He stops. Suspects.\n\n                             ARVIND (CONT'D)\n               And without even a song?\n\n     A long pause. Arvind keeps hold of Jamal's arm.\n\n                             ARVIND (CONT'D)\n               So you are rich, now, are you,\n               Jamal? I am happy for you.\n\n                             JAMAL\n               I am so sorry, Arvind.\n\n                             ARVIND\n               You got away. I didn't. That is\n               all. No, no tears. Tears mock me\n               all the more.\n\n                             JAMAL\n               Arvind, I am looking for-\n\n                             ARVIND\n               - how's your voice, Jamal?\n\n                             JAMAL\n               I don't know. I haven't sung\n               since- since then. Arvind, I-\n\n                             ARVIND\n               - and your eyes?\n\n                             JAMAL\n                    (surprised)\n               My eyes? My eyes are fine.\n\n                             ARVIND\n               Then stay away, chutiyé, and\n               count your blessings every\n               morning you open them and see\n               the sun rising. You owe Maman.\n               He doesn't forget.\n\n                               JAMAL\n               I owe Latika.\n\n     Arvind shakes his head angrily.\n\n                             JAMAL (CONT'D)\n               Please. Is she alive? Arvind, is\n               she alive?\n\n                             ARVIND\n               Alive? Oh, she's alive alright.\n               It's your life, Jamal. Pila\n               Street. They call her Cherry,\n               now.\n\n\n                                                   (CONTINUED)\n\n                                                           62.\n96   CONTINUED: (3)                                              96\n\n                                JAMAL\n               Thank you.\n\n     Jamal heads off through the traffic. Arvind shouts\n     after him.\n\n                             ARVIND\n               I will sing at your funeral,\n               yaar.\n\n\n97   EXT. PILA STREET. NIGHT.                                    97\n\n     Dark, crowded streets. Gangs of women stand outside the\n     doorways or lean out of upstairs windows. They are\n     garishly-dressed prostitutes varying in age from 13 to\n     60. Men wander past, eying the possibilities,\n     exchanging lewd comments with them. Among the hordes on\n     the pavement are Jamal and Salim. They pass doorway\n     after doorway of narrow rooms where prostitutes wait\n     for customers. Jamal and Salim stop at each group of\n     women, Salim taking the lead, clearly asking them\n     something, as the women either shrug or offer them\n     something lewd- judging by the laughter that follows.\n     But one woman in a narrow doorway points down the\n     street. Jamal has to drag a reluctant Salim away from\n     the group.\n\n\n98   INT. BROTHEL. NIGHT.                                        98\n\n     They go into one of the tiny houses. Loud Filmi music\n     comes from upstairs. They are confronted by a woman in\n     her fifties watching tv. She is less than interested.\n\n                             SALIM\n               I'm looking for Cherry.\n\n                             WOMAN\n               No, kid. Not available. Plenty\n               of others. Take a look.\n\n     She indicates curtained cubicles behind him.\n\n                             SALIM\n               I'm Latika's brother.\n\n     The Woman looks at him properly for the first time.\n\n                             WOMAN\n               She's still not on the menu.\n               Choose someone else or piss off.\n\n     Then, Jamal pulls out some rupee notes.\n\n                             JAMAL\n               Just two minutes to talk to her.\n\n     She takes the money, counts it.\n                                                    (CONTINUED)\n\n                                                              63.\n98    CONTINUED:                                                    98\n\n                                  WOMAN\n                   Two minutes.\n\n      She nods upwards. Salim and Jamal head up the dark,\n      tiny staircase. The Woman picks up the phone on her\n      desk.\n\n\n99    INT. LANDING. NIGHT.                                          99\n\n      On the tiny landing, Salim and Jamal pull back a\n      curtain to reveal a humping couple. They move on, past\n      more women lying on their beds or blankly having sex,\n      not in the least perturbed to be interrupted. They\n      reach the end of the landing. From the other side of\n      the door comes the filmi music. Jamal puts his eye to\n      one of the gaps in the slatted door. Through it he can\n      see glimpses of a girl dancing to the music. Latika;\n      though not the rag-picker of before. Now fifteen, she\n      is a beautiful young woman and dressed in a revealing,\n      turquoise, silk sari.\n\n                                 SALIM\n                   Is it her or not?\n\n      He shoves Jamal out of the way and watches.\n\n                                 SALIM (CONT'D)\n                   Shit, she's sexy, man....\n\n      Then the music stops, an effeminate man steps into the\n      limited frame Salim can see and snaps a stick down hard\n      on Latika's hand.\n\n                                 DANCE TEACHER\n                   Smile! Flow, flow! You entice\n                   with the hands not make\n                   chapattis, you gawaar. Again.\n\n      The man starts the music again and Latika's hands flow\n      elegantly around her head.\n\n                                 DANCE TEACHER (CONT'D)\n                   Lift your feet, you lump. Stop,\n                   stop!\n\n      The stick is raised to hit her but Jamal opens the\n      door.\n\n\n100   INT. BROTHEL. NIGHT.                                          100\n\n      She can barely believe her eyes.\n\n                                  LATIKA\n                   Jamal?\n\n      The Dance Teacher turns.\n\n                                                          (CONTINUED)\n\n                                                          64.\n100   CONTINUED:                                             100\n\n                                 DANCE TEACHER\n                   What the hell do you want?\n\n      He switches off the music.\n\n                                   JAMAL\n                   Come. Quick.\n\n      But Latika remains fixed.\n\n                                 DANCE TEACHER\n                   You silly little boys. Get out\n                   now while you can.\n\n                                   JAMAL\n                   Come with us.\n\n      Latika runs to Jamal. But she freezes as she looks at\n      the doorway. Maman, Punnoose and the Woman from\n      downstairs stand there. The skin around Punnoose's eye\n      bears the blisters from the chloroform burn years ago.\n\n                                 MAMAN\n                   Look who we have here, Punnoose.\n                   Hello again, Jamal. Salim. Never\n                   forget a face. Especially one\n                   that I own.\n\n                                 PUNNOOSE\n                   Shall I take them to the\n                   marshes?\n\n                                 MAMAN\n                   Whatever you like. Have fun.\n                   Just make sure that you dispose\n                   of them properly afterwards. No\n                   traces, thank you.\n\n      He turns to Jamal.\n\n                                 MAMAN (CONT'D)\n                   You really thought you could\n                   just walk in and take my prize\n                   away? Have you any idea how much\n                   this little virgin is worth,\n                   bhen chod?\n\n      He fingers Latika's hair.\n\n                                 MAMAN (CONT'D)\n                   Get them out of here.\n\n      Punnoose and the Muscle walk towards Jamal. Maman turns\n      to the Dance Teacher as they grab his arms.\n\n                                 MAMAN (CONT'D)\n                   Please continue, Master-ji.\n\n      The Dance Teacher puts the music back on.\n                                                      (CONTINUED)\n\n                                                          65.\n100   CONTINUED: (2)                                         100\n\n                                SALIM\n                No.\n\n      Suddenly, Salim is holding a pistol.\n\n                              SALIM (CONT'D)\n                Leave him. Get over there.\n\n      Punnoose and the Muscle slowly release Jamal and join\n      Maman.\n\n                              MAMAN\n                Let's not be foolish, Salim.\n                Heavy, aren't they?\n\n      Salim straightens up his gun arm.\n\n                                SALIM\n                Money.\n\n                              MAMAN\n                You can have money. Here.\n\n      Maman gets out his wallet and throws all the money in\n      it on the floor.\n\n                              MAMAN (CONT'D)\n                Take it. Go. Disappear with your\n                friend and we'll forget all\n                about this. Okay?\n\n      Salim collects up the money.\n\n                              SALIM\n                Maman never forgets. Isn't that\n                right?\n\n                              MAMAN\n                Oh, Maman can make an exception.\n\n      Salim walks over to the music, turns it up. Picks up a\n      cushion from the bed and walks right up to Maman.\n\n                              SALIM\n                Can't take that risk, Maman.\n                Sorry.\n\n      He wraps the cushion around the gun and pulls the\n      trigger. Or tries to. Nothing happens. There is a\n      frozen moment as they watch him fail to shoot.\n      Everybody watches with surreal interest as Salim\n      fumbles with the pistol. Eventually he looks up,\n      giggles stupidly.\n\n                                SALIM (CONT'D)\n                Safety catch.\n\n      Shrugs apologetically and shoots. Nobody is more\n      surprised than Maman who crumples onto the floor.\n                                                    (CONTINUED)\n\n                                                         66.\n100   CONTINUED: (3)                                        100\n\n      Latika starts desperately gathering up the notes on the\n      floor, grabs Maman's wallet. Jamal just stands.\n\n                               SALIM (CONT'D)\n                 Come on.\n\n      They run out of the room and down the stairs as Maman\n      dies on the floor in front of his frozen colleagues.\n\n\n101   EXT. CHOWPATTY BEACH. DUSK.                             101\n\n      Children are splashing in the sea, flying kites,\n      digging sand, laughing. Salim, Latika and Jamal are\n      crouched on the shore watching the sun sink into the\n      sea. Latika is going through Maman's wallet, Salim is\n      fingering the pistol, admiringly. Jamal is staring out\n      to sea. Each in their own world, yet sharing swigs from\n      a bottle of Johnny Walker.\n\n                               LATIKA\n                 Shit, there's thousands here.\n\n                               SALIM\n                 We should be celebrating.\n\n                               JAMAL\n                 You just killed somebody.\n\n                               SALIM\n                 He was going to kill us.\n\n                               JAMAL\n                 Where did you get the gun?\n\n                               SALIM\n                 Bought it. Now, I'm going to\n                 have to throw this beauty in the\n                 sea.\n\n                               LATIKA\n                 You didn't need to kill him.\n\n                                SALIM\n                 What? Typical. I save your life\n                 and you're on at me. All you\n                 ever do is mess us up. Whenever\n                 you're around-\n\n                               JAMAL\n                 - shut up, can't you? Just shut\n                 up.\n\n      Silence.\n\n                               SALIM\n                 Why can't you just be happy,\n                 huh?\n\n                                                    (CONTINUED)\n\n                                                          67.\n101    CONTINUED:                                            101\n\n                                    JAMAL\n                    Happy?\n\n                                  SALIM\n                    You got what you wanted, didn't\n                    you? So, let's celebrate.\n\n                                  LATIKA\n                    Yeah. Let's celebrate.\n\n       She takes a long swig from the bottle.\n\n                                    LATIKA (CONT'D)\n                    While we can.\n\n       She nudges Jamal and holds the bottle out to him.\n       Smiles at him. He smiles back, shakes the black dog\n       from his head and takes a long, long drink. Latika and\n       Salim cheer.\n\n\n101A   EXT. TULIP STAR. NIGHT.                              101A\n\n       Latika, Salim and Jamal bend back a bit of the wire\n       mesh fence that protects the deserted hotel. Crawl in.\n\n\n102    INT. TULIP STAR. LOBBY. NIGHT.                           102\n\n       A very wobbly Latika, Salim and Jamal walk up the\n       frozen escalators of the empty hotel, lit only by\n       security lights. Kick through the odd pile of rubbish\n       and stacked-up chairs. Go to the dusty reception desk.\n\n                                    JAMAL\n                    Service!\n\n                                    SALIM\n                    Reception!\n\n                                  JAMAL\n                    We want a room, boy. Executive\n                    Class with smoking. Third floor\n                    with balcony.\n\n                                  LATIKA\n                    Sea-facing, yaar.\n\n                                  SALIM\n                    Have the bags brought up.\n\n       And they scoot off, giggling into the dark.\n\n\n102A   INT. TULIP STAR. KITCHENS. NIGHT.                    102A\n\n       Jamal and Latika wander the vast, empty kitchens. Jamal\n       searches the empty chillers and cabinets. Then,\n       realises that he is alone.\n                                                      (CONTINUED)\n\n                                                             68.\n102A   CONTINUED:                                              102A\n\n                                     JAMAL\n                    Latika? Salim?\n\n       Where are they? Suddenly,\n\n                                     LATIKA\n                    Room service!\n\n       She comes shooting out of the darkness across the\n       kitchen floor riding a trolley with Salim pushing her\n       at top speed. Jamal has to skid out of the way. He\n       grabs another trolley and glides off in pursuit.\n\n\n102B   INT. TULIP STAR. CORRIDOR. NIGHT.                       102B\n\n       The three stand by a mirror and play with their\n       reflections.\n\n\n102C   INT. TULIP STAR. HOTEL LOBBY. LATER.                    102C\n\n       On top of the metal preparation counters, Salim and\n       Jamal are fencing: Jamal with a fish slice and Salim\n       with a large spoon.\n\n\n103    INT. HOTEL ROOM. NIGHT.                                  103\n\n       An empty, dusty hotel suite. Jamal is on the phone.\n\n                                  JAMAL\n                    307 here. I want a bottle of\n                    Johnny Walker Red Label, beer,\n                    wine-\n\n                                     LATIKA\n                    - chicken.\n\n                                  JAMAL\n                    Ah! Chicken....\n\n       Jamal closes his eyes at the wonderful thought.\n\n                                  JAMAL (CONT'D)\n                    What kind of chicken?\n\n                                  LATIKA\n                         (also dreaming)\n                    Tikka Masala. With roti-\n\n                                  SALIM\n                    Naan, chutney, dal-\n\n                                  LATIKA\n                    - aloo gobi, rice-\n\n       She stops. Change of mind.\n\n                                                     (CONTINUED)\n\n                                                           69.\n103   CONTINUED:                                              103\n\n                                    LATIKA (CONT'D)\n                   Pop Tarts!\n\n                                 JAMAL\n                   Hold the line, chutiye.\n                   Pop Tarts?\n\n                                 LATIKA\n                   On the tv. The commercial.\n                   Everybody's happy when they have\n                   Pop Tarts.\n\n                                 JAMAL\n                   Exactly! A bucket of Pop Tarts,\n                   chutiye.\n\n      Jamal slams down the phone.\n\n\n104   INT. HOTEL ROOM. LATER.                                  104\n\n      Latika is clearly in the shower. Jamal wanders in\n      carrying an old pair of lunghi. Shouts through the\n      door.\n\n                                 JAMAL\n                   Found some lunghi!\n\n                                 LATIKA V/O\n                   Stay there. Look away.\n\n      The shower stops.\n\n                                    JAMAL\n                   Atcha, atcha.\n\n                                 LATIKA V/O\n                   I'll know if you're looking....\n\n                                    JAMAL\n                   I'm not!\n\n      With a towel around her, Latika comes to the doorway\n      where Jamal is holding out a the lunghi with his eyes\n      tight shut.\n\n                                    JAMAL (CONT'D)\n                   Where's Salim?\n\n                                    LATIKA\n                   Dunno.\n\n      She watches this innocent a second with true fondness.\n\n                                 LATIKA (CONT'D)\n                   You're a sweet boy, Jamal.\n\n\n\n                                                      (CONTINUED)\n\n                                                         70.\n104   CONTINUED:                                            104\n\n      She takes the lunghi from his outstretched hand and\n      disappears into the bathroom, slamming the door with a\n      giggle.\n\n\n105   EXT. MUMBAI SLUM STREET. NIGHT.                          105\n\n      Salim wanders the crowded streets of a slum. He stops\n      uncertainly at a doorway where a group of men are\n      lolling, smoking. Plucks up his courage.\n\n                                 SALIM\n                   I'm looking for Javed-bhai.\n\n                                 MAN\n                   Ja, mada chod. He's not looking\n                   for you. Ja!\n\n                                 SALIM\n                   I need to see him.\n\n      The group of men stir, irritated now. Salim begins to\n      back away, then stops. Pulls the gun from behind his\n      back.\n\n                                 SALIM (CONT'D)\n                   I killed Maman. I'll kill you\n                   too. Easy.\n\n      The group are frozen.\n\n                                 JAVED\n                   You killed him?\n\n      Javed is standing in the doorway.\n\n                                 JAVED (CONT'D)\n                   My enemy's enemy is my friend,\n                   no? So, come in, friend.\n\n\n106   INT. HOTEL ROOM. LATER.                                  106\n\n      Jamal and Latika lie on the bed, drunk, though still\n      coherent. Latika is dressed in the Bell-Boy's jacket\n      and the old lunghi.\n\n                                 LATIKA\n                   Maman's gang will hunt us. You\n                   know that?\n\n                                   JAMAL\n                   I don't care.\n\n                                   LATIKA\n                   Me neither.\n\n      They burst into stupid laughter. The laughter subsides.\n\n                                                     (CONTINUED)\n\n                                                           71.\n106   CONTINUED:                                              106\n\n                                 JAMAL\n                   That dance you were doing. In\n                   Pila Street. Show me.\n\n      Latika rolls over and switches off the light. Rolls\n      back. In the half light, her hands begin to move for\n      Jamal, the elegant, alluring hand movements of the bar-\n      girl dancers. Jamal stares, mesmerised.\n\n                                 LATIKA\n                   You came back for me.\n\n                                   JAMAL\n                   Of course.\n\n                                 LATIKA\n                   I thought you'd forgotten.\n\n                                 AMIR\n                   I never forgot. Not for one day.\n                   I knew I'd find you in the end.\n                   It's our destiny.\n\n                                   LATIKA\n                   Destiny. Yes.\n\n      Latika stops her hands. They stare at each other, their\n      faces inches away from each other. Latika strokes\n      Jamal's face.\n\n                                   LATIKA (CONT'D)\n                   Thank you.\n\n      And face to face, they slowly fall asleep.\n\n\n107   INT. HOTEL ROOM. LATER.                                 107\n\n                                   SALIM\n                   Hey.\n\n      Jamal opens his eyes. Salim is standing over them,\n      swaying with alcohol.\n\n                                   JAMAL\n                   Salim?\n\n      He puts his hand out to Latika.\n\n                                   SALIM\n                   Come.\n\n                                 JAMAL\n                   No. Salim....Bhai, you've had a\n                   lot to drink...\n\n      Jamal tries to get up, but Salim's hand is round his\n      throat and pushes him down on the bed.\n\n                                                      (CONTINUED)\n\n                                                          72.\n107   CONTINUED:                                             107\n\n                                 SALIM\n                   I am the elder. And I am the\n                   boss. For once, you do as I say.\n\n                                    JAMAL\n                   No.\n\n      Salim pulls Latika to her feet.\n\n                                 SALIM\n                   I saved your bloody life, didn't\n                   I?\n\n                                    LATIKA\n                   Salim, please-\n\n                                    SALIM\n                   - chup, sali.\n\n      As he turns, pulling a protesting Latika, Jamal leaps\n      on him. The two brothers go down fighting, but of\n      course it is Salim who comes up on top. Latika launches\n      herself at Salim, but he smashes her away, almost\n      delighted that she has joined in. He drags Jamal to the\n      door, laughing.\n\n\n108   INT. HOTEL CORRIDOR. NIGHT.                            108\n\n      Salim throws him out into the corridor, slams the door.\n\n                                 SALIM\n                   I am Number One now!\n\n                                 JAMAL\n                   Salim, no, no....!\n\n                                 SALIM\n                   Get yourself a room, bhai.\n\n      Salim slams the door. Jamal gets up, bangs on the door,\n      keeps on banging until the door opens and Salim stands\n      there with the pistol pointing straight at Jamal's\n      head.\n\n                                 SALIM (CONT'D)\n                   The man with the Colt 45 says\n                   chup.\n\n      He shoves Jamal hard down the corridor, the gun pointed\n      at him all the while.\n\n                                    JAMAL\n                   Salim...\n\n      Salim nods towards the fire escape door.\n\n\n\n                                                      (CONTINUED)\n\n                                                            73.\n108   CONTINUED:                                               108\n\n                                 SALIM\n                   Now go. Or Gunmaster G-9 will\n                   shoot you right between the\n                   eyes. Boom. Don't think he\n                   won't. You have five seconds.\n                   One, two, three, four-\n\n      Salim cocks the pistol. Jamal screws up his eyes for\n      the inevitable. But Salim shoves him out with a roar\n      and slams the door. Jamal bangs on the door.\n\n                                 JAMAL O/S\n                   Salim...\n\n      Salim walks slowly back down the corridor as Jamal\n      bangs and bangs on the door. Down the hall, Salim's\n      door shuts.\n\n\n109   INT. INSPECTOR'S OFFICE. DAY.                            109\n\n      The Inspector is staring hard at Jamal. Srinivas is\n      desperately trying to get his attention.\n\n                                 CONSTABLE SRINIVAS\n                   Sir, sir!\n\n                                 INSPECTOR\n                        (eventually)\n                   Enlighten us Constable.\n\n                                 CONSTABLE SRINIVAS\n                   Accessory to murder, Sir.\n\n      The Inspector puts his hands in the air, palms up.\n      Simple.\n\n                                 INSPECTOR\n                   Only the finest minds in the\n                   Mumbai Police Force.\n\n      Untroubled by irony, Srinivas looks extremely pleased.\n\n                                 INSPECTOR (CONT'D)\n                   Go check the files, Constable.\n\n      Srinivas goes out.\n\n                                 INSPECTOR (CONT'D)\n                   You puzzle me, Slumdog.\n                   Admitting murder to avoid a\n                   charge of fraud is not exactly\n                   clever thinking. Now, why would\n                   you do that?\n\n      Jamal shrugs.\n\n\n\n                                                      (CONTINUED)\n\n                                                         74.\n109   CONTINUED:                                            109\n\n                                 JAMAL\n                   When somebody asks me a\n                   question, I tell them the\n                   answer.\n\n\n110   EXT. TULIP STAR. MORNING.                                110\n\n      At the gate, a Security Guard is sitting in his chair.\n\n                                 JAMAL\n                   Where are they?\n\n      The Guard grunts.\n\n                                 JAMAL (CONT'D)\n                   Where did they go?\n\n      A more impatient grunt from the Guard. He stands up,\n      walks towards Jamal.\n\n                                 JAMAL (CONT'D)\n                   Please, Sir. Which way?\n\n                                 SECURITY GUARD\n                   I don't know and I don't care.\n\n      The Guard raises his stick and gives him a roar. Jamal\n      backs away onto the street. The Guard slams the gate\n      shut. Jamal looks despairingly up and down the street\n      at the teeming traffic, the crowds.\n\n                                 PREM V/O\n                   Ready for another question.\n\n                                 JAMAL V/O\n                   Yes. I'm ready.\n\n\n111   OMITTED                                                  111\n\n\n112   INT. STUDIO. NIGHT.                                      112\n\n      We are back in the Studio.\n\n                                 PREM\n                   For two and a half million\n                   rupees. Ladies and Gentlemen.\n                   Cambridge Circus is in which UK\n                   City. Is it A) Oxford, B) Leeds,\n                   C) Cambridge, D) London.\n\n      Jamal smiles.\n\n                                 PREM (CONT'D)\n                   He's smiling. Why does that\n                   worry me?\n\n                                                         75.\n\n\n113   EXT. MUMBAI. DAY.                                        113\n\n      Leaden skies. Torrential rain is hammering on the tin\n      roofs of the slum.\n\n\n114   INT. SHACK. DAY.                                         114\n\n      Eighteen year-old Jamal's eyes open. Now with the\n      beginnings of a beard and moustache, Jamal wakes in a\n      tiny shack just big enough for a mattress on the floor.\n      He pulls on a shirt, lifts the mattress and takes out\n      his trousers which have been pressing there all night,\n      puts them over his shoulder, picks up his shoes and\n      goes down a ladder.\n\n\n115   INT. SHACK. DAY.                                         115\n\n      He descends into a room and two feet of water that is\n      eddying around the ground floor of the shack. Wades out\n      of the door into the narrow lane of the slum.\n\n\n116   EXT. SLUM. DAY.                                          116\n\n      Jamal nods hello to a number of neighbours, also bare-\n      legged, also with their shoes in hand. Together, they\n      wade to higher ground, put on their trousers and shoes\n      and trudge up to the main road.\n\n\n117   INT. CALL CENTRE. NIGHT.                                 117\n\n      Ultra-modern, glass-windowed office. The words Cultural\n      Studies are written on the white board. Jamal walks in\n      with a tray of glasses of chi. He puts a glass down on\n      the young, hip, Teacher's desk and heads out again.\n\n                              TEACHER\n                Okay, guys, it's been a big week\n                in UK. Kat is back.\n\n      He holds up a copy of Radio Times showing Kat from East\n      Enders smiling at them. A collective groan from the\n      Trainees.\n\n                              BARDI\n                She's already back.\n\n                                 TEACHER\n                Bardi...Jamal?\n\n                              JAMAL\n                Oh. Well. She did come back,\n                then she went away when Alfie\n                split up with her and now she's\n                back again.\n                              (MORE)\n                                                    (CONTINUED)\n\n                                                          76.\n117   CONTINUED:                                             117\n                                 JAMAL (CONT'D)\n                   But it looks as if Alfie still\n                   fancies Mo after all, so-\n\n                                 TEACHER\n                   - thank you, Jamal. Keep up,\n                   Bardi. The chi-wallah knows more\n                   than you.\n\n      Bardi glares at Jamal. Jamal shrugs apologetically and\n      goes out.\n\n                                 TEACHER (CONT'D)\n                   Okay, it's been super-duper hot\n                   for UK this week, so there'll be\n                   a lot of chat about that- they\n                   love their weather- and there's\n                   the festival in Edinburgh-\n                   Edinburgh?\n\n      He points at a young woman Trainee.\n\n                                 NASREEN\n                   Scotland. Kilts, castles, err,\n                   haggis? Porridge, the Highlands,\n                   mountains. Ben- Ben Nevis?\n\n      The Teacher points at another Trainee.\n\n                                 TRAINEE 2\n                   Detective Taggart. Whisky, Sean\n                   Connery!\n\n                                 TEACHER\n                   And lochs. Their word for lakes.\n                   Good. It's also double bonus\n                   time for an upgrade to the\n                   `friends and family' package\n                   this week, so remember to push\n                   for an upgrade...\n\n                                    EVERYONE\n                   ...Every Call!\n\n      Jamal walks out, turns a corner.\n\n\n118   INT. CALL CENTRE. UK FLOOR. NIGHT.                       118\n\n      We are confronted with a room you could swing a Boeing\n      in. Rows and rows of Operators in tiny booths stretch\n      into the distance. On the walls are pictures of London,\n      Tony Blair, red telephone boxes, the Yorkshire Dales,\n      the Highlands- a snapshot of tourist Britain. Huge\n      posters of soap stars and celebrities adorn the rest of\n      the walls. Slogans hang from the ceiling. \"When the sun\n      comes up, you'd better be running\", \"you snooze, you\n      lose\", \"Upgrade for a better, faster life.\" \"Every call\n      is a new opportunity\".\n\n                                                      (CONTINUED)\n\n                                                          77.\n118   CONTINUED:                                             118\n\n      Each section of the room has a banner with a British\n      city's name on it and various mock sign-posts for the\n      different aisles. A Manager under the banner\n      \"Bradford\", is standing over an Operator, listening in\n      on a call. The Manager leans over and presses a key.\n\n                                 MANAGER\n                   If they want an upgrade, a new\n                   tariff or we're stealing them\n                   from the other networks, you\n                   take the call. Anything else-\n\n      He mimes cutting his throat.\n\n                                 MANAGER (CONT'D)\n                   No time-wasters on Team\n                   Bradford, kid. Leave that to the\n                   homosexuals on Tunbridge Wells.\n\n      Jamal stops by him. The Manager takes a glass of tea\n      from Jamal.\n\n                                 MANAGER (CONT'D)\n                   Where've you been? Dave on\n                   Cornmarket's virtually lost his\n                   voice, there's two on Ilkley\n                   Moor who've had their hands up\n                   for hours. Come on, move it!\n\n      Jamal hurries down the aisle signposted \"Cornmarket\",\n      gets to a male trainee and hands him a tea. Dave\n      glances around to check nobody's looking and slips off\n      his head-set.\n\n                                 DAVE\n                   Two minutes, Jamal. I'm on\n                   \"Millionaire\" duty.\n\n                                  JAMAL\n                   Rajneesh...\n\n                                 DAVE\n                   It's my turn, Jamal. I've had my\n                   pee breaks. Please. If he comes\n                   just keep your head down and\n                   pretend you're doing an upgrade\n                   on the-\n\n                                 JAMAL\n                   - `friends and family'. I know.\n\n      Jamal still looks unwilling.\n\n                                  JAMAL (CONT'D)\n                   Two minutes.\n\n\n\n\n                                                      (CONTINUED)\n\n                                                         78.\n118   CONTINUED: (2)                                        118\n\n      Dave heads off towards a Rest and Recreation room,\n      where a big plasma screen on the wall is showing \"Who\n      Wants To Be A Millionaire.\"Jamal grabs the jacket from\n      the back of Dave's chair, puts the head-set on and\n      hunches over the booth, just another Operative at work.\n      We become aware that every operator down the Cornmarket\n      aisle- and quite a few other aisles besides- is staring\n      in the direction of the Rest and Recreation Room.\n\n\n119   INT. REST AND RECREATION ROOM. NIGHT.                 119\n\n      Dave is watching the screen.\n\n                              PREM\n                ...if you want a chance to be a\n                contestant on Who Wants To Be A\n                Millionaire, dial the number\n                now.\n\n      Dave dives for the doorway and waves.\n\n\n120   INT. CALL CENTRE. UK FLOOR. NIGHT.                    120\n\n      Suddenly all the operators are dialling. Almost\n      simultaneously, twenty or so voices say.\n\n                              OPERATORS\n                I'd like to be a contestant on\n                Who Wants to be a Millionaire.\n\n      Most of the Operators- including the man next to Jamal-\n      suddenly lose their tension.\n\n                              OPERATOR\n                Bloody bastard. I never get it.\n\n                              JAMAL\n                You have to dial when Prem says\n                \"if\". \"If you want the chance to\n                be a contestant on Who Wants To\n                Be A Millionaire...\" That's when\n                they open the lines.\n\n      The Operator looks at him. Jamal shrugs.\n\n                              JAMAL (CONT'D)\n                That's what Anjum in Technical\n                says. He put the system in.\n\n                              OPERATOR\n                So why don't you?\n\n                              WOMAN V/O\n                Hello? Hello? Have I been\n                transferred again, for God's\n                sake?\n\n                                                    (CONTINUED)\n\n                                                          79.\n120   CONTINUED:                                             120\n\n      Jamal freezes with fear. The head-set speaks again with\n      its broad Scottish accent.\n\n                                 WOMAN V/O (CONT'D)\n                   Hello? Jesus, God, will somebody\n                   talk to me?\n\n                                   JAMAL\n                   Hello, Mrs...\n\n      He stares at the computer.\n\n                                 JAMAL (CONT'D)\n                   ...Mackintosh from King Gussie.\n\n                                 WOMAN V/O\n                        (weary)\n                   It's Kingussie, love. Pronounced\n                   Kinoosie.\n\n                                   JAMAL\n                   Kinoosie?\n\n                                 WOMAN V/O\n                   So where are you from? Abroad, I\n                   bet. China or somewhere. What\n                   good is-\n\n                                 JAMAL\n                   - just down the road from your\n                   house, Mrs Mackintosh. Next to\n                   the loch.\n\n                                 WOMAN V/O\n                        (suspicious)\n                   Oh aye? Which loch?\n\n      Jamal searches desperately around, spots a picture of\n      Big Ben.\n\n                                 JAMAL\n                   Loch Big- Loch Ben. Next door to\n                   Detective Taggart's flat.\n\n                                 WOMAN V/O\n                   Loch Ben? Och, no, hen, that's\n                   one of the wee ones up in the\n                   Highlands. You're all the way up\n                   there? But I bet it rains, eh,\n                   hen?\n\n                                 JAMAL\n                   Indeed yes, Mrs Mackintosh. I\n                   have to wade through a metre of\n                   water every morning.\n\n                                   WOMAN V/O\n                   No!\n\n                                                      (CONTINUED)\n\n                                                         80.\n120   CONTINUED: (2)                                        120\n\n                              JAMAL\n                Yes, yes, Mrs Mackintosh. In my\n                kilt.\n\n                                WOMAN V/O\n                Och, no, hen.\n\n      Jamal puts his feet on the desk.\n\n                              JAMAL\n                It's alright once I've had my\n                porridge, my haggis and a few\n                Scotch whiskies- and the\n                monsoon's nearly over, so-\n\n                              WOMAN V/O\n                - and what monsoon would that\n                be? I'd like to speak to your\n                supervisor, son.\n\n                              JAMAL\n                I don't think that's a good\n                idea. He is a very important\n                man, Mrs Mackintosh-\n\n                              WOMAN V/O\n                - get me the supervisor on this\n                line now-\n\n                              JAMAL\n                - and he doesn't like bloody\n                time wasters.\n\n      Jamal panics, presses the button he saw the Manager\n      press earlier. The screen goes blank, then reboots\n      itself. Jamal looks around. Where the hell is Dave? On\n      the screen, Jamal is faced with the question: \"what\n      name do you require?\" He looks around again, and then\n      with one finger types in the word \"Latika\". He presses\n      enter. Hundred upon hundred of Latikas with their\n      surnames and phone numbers scroll down the page. He\n      erases her name and enters the name Salim K. Malik.\n      Presses enter. Fifteen numbers come up. He stares at\n      the numbers for a long time, then types it into his\n      computer and presses dial.\n\n                                MAN V/O\n                Yeah?\n\n                                JAMAL\n                Salim?\n\n                              MAN V/O\n                Who wants to know? Do you know\n                what bloody time it is?\n\n      Clearly not Jamal's brother. Jamal cuts the line. Dials\n      the next number.\n\n                                                    (CONTINUED)\n\n                                                          81.\n120   CONTINUED: (3)                                         120\n\n                                 MAN V/O (CONT'D)\n                 Huh. Hello?\n\n      Clearly not his Salim. He cuts the line. Dials again.\n\n                               SALIM V/O\n                 Hello? Hello? Who is this?\n\n      But Jamal can't speak.\n\n                               SALIM V/O (CONT'D)\n                 Hey. Is someone screwing with\n                 me?\n\n      Silence.\n\n                                 SALIM V/O (CONT'D)\n                 Who is this?\n\n                               JAMAL\n                 I am calling from XL 5\n                 Communications Sir. As a valued\n                 customer, we are offering you a\n                 free upgrade with our `friends\n                 and-\n\n      Jamal's voice peters out.\n\n                                 JAMAL (CONT'D)\n                 Family.\n\n                               SALIM V/O\n                 Jamal? Is that you? Brother?\n                 Where are you, man?...I thought\n                 you were dead or something...we\n                 had to go, Jamal. Maman's guys.\n                 They were searching the\n                 hotel...Jamal, say something.\n                 Please.\n\n      There is another long silence.\n\n                                 JAMAL\n                 Hello, Salim.\n\n\n121   INT. STUDIO. NIGHT.                                     121\n\n                               PREM\n                 Ever been to Cambridge?\n\n                                 JAMAL\n                 No.\n\n                               PREM\n                 Ever been to the circus?\n\n\n\n                                                      (CONTINUED)\n\n                                                            82.\n121   CONTINUED:                                               121\n\n                                 JAMAL\n                   No. And I've never been to UK\n                   before. But I'll still have a\n                   go.\n\n      Gasps and laughter from the audience. Jamal laughs and\n      shrugs.\n\n                                   JAMAL (CONT'D)\n                   Why not?\n\n      Prem grips his heart theatrically.\n\n                                 PREM\n                   Can someone call me an\n                   ambulance?\n\n\n122   INT. CALL CENTRE. NIGHT.                                 122\n\n      A flash of a sign post reading `Oxford Circus',\n      pointing down one of the aisles. The banner above that\n      section of the warehouse reads `London'.\n\n                                                      CUT TO:\n\n      Jamal hurrying down another `Kings Parade' carrying\n      glasses of tea. He glances up to see a large banner\n      that says `Cambridge'.\n\n                                                      CUT TO:\n\n      Jamal comes back up an aisle named `Broad Street'. An\n      Operator on the adjacent `The High' clicks his fingers\n      for another cup. Jamal hurries under the sign marked\n      `Oxford'.\n\n                                                      CUT TO:\n\n      The signposts of the aisles come faster and faster\n      `Pembroke Street', `Trafalgar Square', `East India\n      Dock' and finally `Cambridge Circus'.\n\n                                   PREM V/O\n                   So, Jamal....\n\n\n123   INT. STUDIO. NIGHT.                                      123\n\n      Jamal is sweating, his face scrunched up in thought.\n\n                                 JAMAL\n                   I can't remember.\n\n                                 PREM\n                   You can't remember. Does that\n                   mean you did know? Once?\n\n\n                                                    (CONTINUED)\n\n                                                           83.\n123   CONTINUED:                                              123\n\n                                 JAMAL\n                   I don't think it's Oxford.\n\n                                 PREM\n                   Based on your extensive\n                   travelling, right?\n\n                                 JAMAL\n                        (almost to himself)\n                   Well, Oxford has Broad Street,\n                   Saint Aldates, Turl Street,\n                   Queen Street, The High and\n                   Magdalene Bridge- which is\n                   pronounced Maudlin, so-\n\n      He stops as he hears the surprised laughter of the\n      audience.\n\n                                 PREM\n                   I thought you hadn't been to UK.\n\n                                 JAMAL\n                   Oh, I haven't. And it's not\n                   Leeds, because that's Elland\n                   Road, Kirkgate Market,\n                   Commercial Street, St Peter's-\n\n                                 PREM\n                        (icy)\n                   - what might it be then, Jamal?\n\n                                 JAMAL\n                   Well, I don't think it's\n                   Cambridge.\n\n                                 PREM\n                   Cambridge Circus is not in\n                   Cambridge? Dare I ask why?\n\n                                 JAMAL\n                   Too obvious. There's definitely\n                   an Oxford Circus in London, and\n                   there's a rowing race between\n                   Oxford and Cambridge so there's\n                   probably a Cambridge Circus too.\n                   I'll go for D) London.\n\n                                 PREM\n                   That's the logic that's got him\n                   this far, Ladies and Gentlemen.\n                   Who are we to argue? So. Jamal.\n                   D. Apka final jawab?\n\n                                 JAMAL\n                        (shrugs)\n                   If the Gods are with me...Final\n                   answer. D.\n\n\n                                                      (CONTINUED)\n\n                                                            84.\n123   CONTINUED: (2)                                           123\n\n      The lights dim, the music swells as Prem pushes the\n      button on his computer.\n\n                              PREM\n                Computer-ji, D lock kiya-jaye.\n\n      More portentous music.\n\n                              PREM (CONT'D)\n                It's been a rollercoaster ride\n                all the way, a pleasure to have\n                you on the show, my friend, but\n                I'm sorry to say that\n                you're....incredibly, absolutely\n                right!\n\n      Huge cheers and applause. Even Jamal laughs at this. He\n      cannot quite believe it himself.\n\n                              PREM (CONT'D)\n                Ladies and Gentlemen, Jamal\n                Malik, the man with two and a\n                half million rupees!\n\n      More applause. Prem hands him a cheque. Jamal looks at\n      it. Laughs again.\n\n                               PREM (CONT'D)\n                A few hours ago, you were\n                fetching tea for the phone-\n                wallahs. Now you are richer than\n                they ever will ever be. What a\n                player, Ladies and Gentleman!\n                What a player.\n\n      The lights dim, the music swells. Prem consults his\n      computer.\n\n                              PREM (CONT'D)\n                For five million rupees, my\n                friend: who invented the\n                revolver? Was it A) Samuel Colt,\n                B) Bruce Browning, C Dan Wesson\n                or D) James Revolver?\n\n      Dramatic pause.\n\n\n124   INT. HOTEL. NIGHT.                                       124\n\n      A flash of Salim shooting Maman. Another flash of Salim\n      in the doorway, holding the pistol up to Jamal's head.\n\n\n125   INT. STUDIO. NIGHT.                                      125\n\n                              JAMAL\n                     (suddenly)\n                A). Samuel Colt.\n                                                    (CONTINUED)\n\n                                                            85.\n125    CONTINUED:                                              125\n\n                                  PREM\n                    A). Samuel Colt. Are you sure?\n\n       Jamal nods.\n\n                                    PREM (CONT'D)\n                    Final answer?\n\n                                    JAMAL\n                    Final answer.\n\n       The music swells again. Prem presses his computer.\n\n                                  PREM\n                    You had two and a half million\n                    rupees. If I may-?\n\n       He holds out his hand. Jamal hands him back the cheque.\n       He tears the cheque in two.\n\n                                  PREM (CONT'D)\n                    Ladies and Gentlemen, the chi-\n                    wallah has done it again! D. Is\n                    right! Incredible!\n\n       Cheers and applause from the audience.\n\n\n125A   INT. INSPECTOR'S OFFICE. NIGHT.                        125A\n\n                                   INSPECTOR\n                    Not that incredible. You'd just\n                    murdered somebody with a Colt\n                    45, after all.\n\n                                  JAMAL\n                    It was self-defence.\n\n                                  INSPECTOR\n                    Let's call it manslaughter,\n                    then, shall we?\n\n\n126    INT. STUDIO. NIGHT.                                     126\n\n                                  PREM\n                    Getting hot in here, isn't it?\n\n                                  JAMAL\n                         (genuinely)\n                    Are you nervous?\n\n       The audience laugh. Prem is momentarily flustered.\n\n                                  PREM\n                    What? Am I nervous? You're the\n                    one who's in the hot seat, my\n                    friend.\n\n                                                      (CONTINUED)\n\n                                                          86.\n126   CONTINUED:                                             126\n\n                                 JAMAL\n                   Oh. Yes. Sorry.\n\n      More laughter.\n\n\n127   INT. GALLERY. NIGHT.                                     127\n\n                                 DIRECTOR\n                   Bloody hell. He's got Prem on\n                   the run...\n\n\n128   INT. STUDIO. NIGHT.                                      128\n\n      Music, lights. Prem presses his computer.\n\n                                 PREM\n                   What sports do you play?\n\n                                 JAMAL\n                   None.\n\n                                 PREM\n                   None. Oh, dear, oh dear, oh\n                   dear. Not to worry, there's only\n                   ten million rupees at stake...\n                   Which cricketer has scored the\n                   most first class centuries in\n                   history. Was it A) Sachin\n                   Tendulkar, B) Ricky Ponting, C)\n                   Michael Slater, D) Jack Hobbs.\n\n      Prem allows the question to sink in.\n\n                                 PREM (CONT'D)\n                   You've got a cheque for five\n                   million rupees in your hands.\n                   You've still got two life-lines,\n                   Phone A Friend and 50/50. For\n                   ten million rupees: pay, play,\n                   or bail out. It's still an\n                   option. Remember, if you get the\n                   answer wrong, you will lose\n                   everything like that.\n\n      He clicks his fingers.\n\n                                 PREM (CONT'D)\n                   Are you sure you want to do\n                   this?\n\n\n129   EXT. CRICKET GROUND. DAY.                                129\n\n      An Indian batsman hits a nicely-timed stroke, heads\n      down the wicket for a single. Turns. The other batsman\n      is taking a second run.\n\n                                                      (CONTINUED)\n\n                                                         87.\n129   CONTINUED:                                            129\n\n      The Indian tries to halt the other batsman with a\n      shout, then succumbs to the inevitable and charges down\n      the wicket. A fielder hurls the ball at the stumps. The\n      bails fly off.\n\n\n130   INT. STUDIO. NIGHT.                                     130\n\n                                 JAMAL\n                   I'll play.\n\n      Tense laughter from the audience. Prem holds up the\n      cheque. Jamal nods. Prem tears it up slowly. Allows the\n      pieces to fall to the floor.\n\n                                 PREM\n                   The dreams of so many. On the\n                   floor.\n\n\n131   EXT. TOWER BLOCK. DAY.                                  131\n\n      Jamal is riding the construction lift to the top of a\n      high building, still just a shell but buzzing with\n      carpenters, bricklayers, cable-layers. The lift stops\n      at the top. Jamal gets out. Looks around. He is miles\n      up. Alone.\n\n                                 SALIM\n                   Jamal!\n\n      Jamal looks around. There is Salim standing on the edge\n      of the building. He saunters over to Jamal, his arms\n      outstretched in theatrical greeting. He is groomed,\n      expensively dressed with the best mobile money can buy\n      dangling from a gold chain around his neck.\n\n                                 SALIM (CONT'D)\n                   God is good, bhai. God is good.\n\n      He tries to embrace Jamal. With as much force as he can\n      muster, Jamal punches him in the face. Salim takes it.\n      Stands there. Wipes blood from his lip. Gets another\n      punch. Then another and another, not even defending\n      himself, until he is being beaten back by a raging\n      Jamal towards the edge of the building. Finally, he\n      tries to reason with Jamal\n\n                                 SALIM (CONT'D)\n                   Maman's boys were after us. Had\n                   to skip.\n\n      Jamal keeps on beating him back.\n\n                                 JAMAL\n                   Liar.\n\n\n\n                                                     (CONTINUED)\n\n                                                           88.\n131    CONTINUED:                                             131\n\n                                  SALIM\n                    Left a message at reception.\n                    Waited weeks for you in Nagpur.\n\n                                  JAMAL\n                    There was no message at\n                    reception.\n\n                                  SALIM\n                    Bhai, I left a message.\n\n       Salim opens his arms, defenceless. It would take one,\n       small push to send him over the edge. There is a\n       moment, when Jamal might. He even has his hands on his\n       chest.\n\n                                  JAMAL\n                    I will never forgive you.\n\n                                  SALIM\n                    I know.\n\n       The fury in Jamal subsides minutely. Finally, he turns\n       away with a roar of frustration. Salim hangs his head.\n\n\n131A   EXT. TOWER BLOCK. LATER.                              131A\n\n       Jamal and Salim are sitting on the very edge of the\n       building. They can see for miles across the city. Salim\n       has rediscovered his attitude.\n\n                                  SALIM\n                    Can you believe it? This was our\n                    slum. We lived just there, huh?\n                    Now it is business, apartments,\n                    call centres...Fuck USA, fuck\n                    China. India is at the centre of\n                    the world, now, bhai. And I am\n                    at the centre of the centre,\n                    Jamal. This is all Javed-bhai's.\n\n                                  JAMAL\n                    Javed Mehta? The Gangster from\n                    our slum? You work for him?\n\n                                  SALIM\n                    Who else would protect us from\n                    Maman's gang, huh?\n\n                                  JAMAL\n                    What do you do for him?\n\n                                  SALIM\n                    Anything he asks.\n\n       Salim's mobile rings. Salim is immediately subservient\n       on the phone. Rings off.\n\n                                                       (CONTINUED)\n\n                                                             89.\n131A   CONTINUED:                                              131A\n\n                                  SALIM (CONT'D)\n                    He is coming. You must go. My\n                    card.\n\n       He hands Jamal a card.\n\n                                  JAMAL\n                    What for?\n\n                                  SALIM\n                    You think I am going to let you\n                    out of my sight again, little\n                    brother? You stay with me now.\n                    Ab phut!\n\n                                  JAMAL\n                    Salim, where's Latika?\n\n                                  SALIM\n                    Still? She's gone, Jamal. Long\n                    gone. Now go. Quick.\n\n       Jamal gets up, hurries away, hidden behind piles of\n       building materials just as Javed appears in his flash\n       suit and jewelry. Three of his young henchmen walk\n       alongside.\n\n\n\n132    INT. SALIM'S APARTMENT.    NIGHT.                        132\n\n       Jamal is asleep on a mattress on the floor of a smart\n       apartment. A mobile phone rings. The muffled sound of\n       Salim talking quietly next door. Then, Salim creeps\n       into the room, checks to see Jamal is asleep, unlocks a\n       desk drawer and brings out his pistol. He puts it in a\n       hold-all and goes out the front door. Jamal's eyes snap\n       open. He has seen it all.\n\n                                  JAMAL V/O\n                    Slum dogs never sleep, only nap.\n                    He would disappear for a couple\n                    of days and come back changed.\n                    Sometimes elated-\n\n\n133    INT. SALIM'S APARTMENT. NIGHT.                           133\n\n       The door bangs open and a giggling-drunk, half-naked\n       Bar Girl drags the sleeping Jamal up and into the\n       bathroom.\n\n                                  BAR GIRL\n                    He has flipped! I can't do\n                    anything with him....\n\n       Salim is in the bath, bathing, literally, in money.\n\n\n                                                       (CONTINUED)\n\n                                                           90.\n133   CONTINUED:                                              133\n\n                                 SALIM\n                   Look at it, bhai, look at it!\n\n\n134   INT. SALIM'S APARTMENT. DAWN.                            134\n\n                                 JAMAL V/O\n                   Sometimes the opposite.\n\n      Jamal creeps towards Salim's bedroom door. He pushes it\n      open a fraction to see Salim crouched on the floor in\n      prayer, sobbing quietly.\n\n                                 SALIM\n                        (whispering)\n                   Aé khuda mujhé baksh dé mainé\n                   bahut gunaah kiyé hain....\n\n                                 JAMAL V/O\n                   But younger brothers don't\n                   interfere. Mostly.\n\n\n135   EXT. SALIM'S APARTMENT. DAY.                             135\n\n      Salim comes out of his apartment block. Gets into his\n      jeep. Drives off. Doesn't notice Jamal in the motor\n      rickshaw that pulls out and follows him.\n\n\n136   EXT. JAVED'S BUNGALOW. DAY.                              136\n\n      Salim approaches a gate-house to a large bungalow. The\n      Door-Keeper nods to him, rings a bell. From the\n      rickshaw, Jamal watches a woman come to the door.\n      Latika. Eighteen, completely beautiful and rich. She\n      hands Salim a package and goes back inside. Salim gets\n      in his jeep and drives away.\n\n\n137   EXT. JAVED'S BUNGALOW. DAY.                              137\n\n      Jamal approaches the Door-Keeper's gate-house.\n\n                                 JAMAL\n                   Baba, I am the new cook from the\n                   agency. A thousand apologies, I\n                   am late for the Memsaab.\n\n      The Door-Keeper grunts and goes inside. After a brief\n      pause, he returns.\n\n                                 DOOR-KEEPER\n                   She doesn't know anything about\n                   any cook. There's supposed to be\n                   a dishwasher being delivered.\n                   Know anything about that?\n\n\n                                                       (CONTINUED)\n\n                                                            91.\n137   CONTINUED:                                               137\n\n                                 JAMAL\n                   Baba, I am your dishwasher!\n\n      The Door-keeper grunts at this attempt at humour.\n      Latika appears at the gate.\n\n                                 LATIKA\n                   Haven't I told you, don't\n                   interrupt when I'm watching-\n\n      She looks at Jamal. Is silenced briefly.\n\n                                 LATIKA (CONT'D)\n                   - come inside. I'll show you the\n                   kitchen.\n\n\n138   INT. KITCHEN. DAY.                                       138\n\n      Latika and Jamal go into the kitchen. Who Wants To Be A\n      Millionaire plays on the tv in the background. She\n      turns and hugs him tight. They laugh with happiness.\n\n                                 LATIKA\n                        (delighted)\n                   Jamal, Jamal, look at you...!\n\n      Their heads are close, they might kiss. Then Latika\n      turns away, stares out of the window.\n\n                                 LATIKA (CONT'D)\n                   Aré wa, Jamal....\n\n      Jamal smiles hopefully at her. But there is sadness in\n      her now. She takes her sunglasses off, rubs her eyes.\n      There is a bruise there.\n\n                                 JAMAL\n                   You've hurt your eye.\n\n                                 LATIKA\n                   Why are you here?\n\n                                 JAMAL\n                   To see you.\n\n                                 LATIKA\n                   Well. You see me.\n\n      She stands there, challenging. On the tv, somebody is\n      winning money.\n\n                                 JAMAL\n                   Why does everyone love this\n                   programme?\n\n\n\n\n                                                      (CONTINUED)\n\n                                                           92.\n138   CONTINUED:                                              138\n\n                                 LATIKA\n                   It's the chance to escape, isn't\n                   it? Walk into another life.\n                   Doesn't everyone want that?\n\n                                 JAMAL\n                   You have another life. A rich\n                   one.\n\n                                 LATIKA\n                   Who'd have thought it possible?\n                   A slum dog, with all this.\n\n                                    JAMAL\n                   Are you happy?\n\n                                 LATIKA\n                   I have five star food, five star\n                   clothes. I sleep in a bed, not\n                   on the street. From where we\n                   come from, Jamal, that is\n                   happiness.\n\n                                 JAMAL\n                   You don't look so happy with a\n                   black eye.\n\n                                 LATIKA\n                   You turn up here out of nowhere,\n                   telling me I'm not happy: how\n                   dare you?\n\n      Voices at the gate-house.\n\n                                 LATIKA (CONT'D)\n                   God, Javed will kill you. Here.\n\n                                 JAMAL\n                   Javed? You are with him?\n\n      She throws him an apron. He gets it on just in time for\n      Javed to walk in. Jamal turns away.\n\n                                  JAVED\n                   First you want a dishwasher, now\n                   a bloody cook-\n\n                                 LATIKA\n                   -I just thought-\n\n                                 JAVED\n                   - chup. The cricket's on.\n\n      Javed changes channel and dials on his mobile.\n\n                                 JAVED (CONT'D)\n                   Why do you always watch that\n                   shit? Huh? I'm already a\n                   millionaire.\n                                                       (CONTINUED)\n\n                                                         93.\n138   CONTINUED: (2)                                        138\n\n      He laughs at his own joke. Turns to Jamal.\n\n                              JAVED (CONT'D)\n                Well, come on then, Cook. I'm\n                hungry. Get me a sandwich.\n\n                              JAMAL\n                Immediately, Sir.\n\n      Javed stares at Jamal a moment, trying to place a face\n      he vaguely recognises. Then the Bookie comes on the\n      line and he turns back to the television.\n\n                              JAVED\n                Atcha...\n\n      Latika hurries around the kitchen getting out bread and\n      condiments, whispering while Javed talks on the phone.\n\n                              JAMAL\n                Come away with me.\n\n                              LATIKA\n                Chutiyé. Away where? And live on\n                what? What can you provide? What\n                have you got, Jamal?\n\n                              JAMAL\n                Love.\n\n                               JAVED\n                      (on the mobile)\n                ..yeah. He's on eighty-five. I\n                want four lakh on him making a\n                century. What are you\n                giving?...Okay, make it five\n                lakh.\n\n      Javed pours himself a glass of whisky, never taking his\n      eyes from the television.\n\n                              TV COMMENTATOR\n                We are watching history unfold\n                today at the Wankhedé Stadium as\n                Sachin Tendulkar carves his way\n                towards another magnificent\n                century and the record books.\n                His thirty-eighth century- the\n                most by any Indian cricketer\n                ever...\n\n                              LATIKA\n                Love. That will feed us, will\n                it?\n\n                              JAMAL\n                It won't buy you a new\n                dishwasher, but it might make\n                you happy.\n                                                    (CONTINUED)\n\n                                                          94.\n138   CONTINUED: (3)                                         138\n\n                              LATIKA\n                Where have you been? Get in the\n                real world, Jamal.\n\n                              JAMAL\n                You and me. That is the real\n                world. Come away with me.\n\n      Latika snatches the sandwich from him and gives it to\n      Javed. Goes back to Jamal, whispers under cover of\n      putting condiments away.\n\n                                LATIKA\n                You're crazy.\n\n                              JAMAL\n                Salim will help us.\n\n                               LATIKA\n                Salim? You still believe in\n                Salim? Jamal...I'll be gone\n                soon, anyway. Bombay's got too\n                dangerous for-\n\n      She indicates Javed.\n\n                                JAMAL\n                Where?\n\n                              LATIKA\n                You think he'd tell me?\n\n                              JAVED\n                Straight bat, straight bat,\n                dammit.\n\n      Then the batsman at the other end calls to take a\n      second run.\n\n                                JAVED (CONT'D)\n                No! A single!\n\n      Tendulkar seems to agree, tries to halt the other\n      batsman with a shout, then succumbs to the inevitable\n      and charges down the wicket. A fielder hurls the ball\n      at the stumps. The bails fly off.\n\n                              JAVED (CONT'D)\n                No, no, no! stupid ben chod\n                idiot...\n\n      He flings his glass of whisky at the television.\n      Suddenly tastes what he has been eating.\n\n                              JAVED (CONT'D)\n                And what is this shit supposed\n                to be, mader chod? Get out. Get\n                out!\n\n                                                    (CONTINUED)\n\n                                                            95.\n138   CONTINUED: (4)                                           138\n\n      Javed throws the sandwich at him and slams out of the\n      room. His footsteps can be heard stomping into another\n      room.\n\n                              LATIKA\n                Now go, before he kills us both.\n\n      She leads Jamal to the door.\n\n                              JAVED\n                Latika, where's my bloody shirt?\n                The Armani.\n\n      Latika shouts over her shoulder.\n\n                              LATIKA\n                Coming!\n\n      Back to Jamal.\n\n                              LATIKA (CONT'D)\n                     (whispered)\n                You want to do something for me?\n\n                              JAMAL\n                Anything.\n\n                              LATIKA\n                Then forget me.\n\n                              JAMAL\n                I'll wait at VT station. Five\n                o'clock every day until you\n                come.\n\n      She shakes her head.\n\n                              JAMAL (CONT'D)\n                I love you.\n\n                              LATIKA\n                So what, Jamal? So what?\n                (loudly)\n                Now, get out and tell your no-\n                good agency not to send anybody\n                else until they've learnt to\n                cook. You hear?\n\n      She slams the door. Hurries back into the kitchen,\n      throws Javed's plate into the sink. The Door-keeper\n      comes in.\n\n                              DOOR-KEEPER\n                Madam, your dishwasher has\n                arrived.\n\n      Leaning over the sink, Latika weeps silently.\n\n                                                         96.\n\n\n139   INT. SALIM'S APARTMENT. NIGHT.                           139\n\n      Salim has his hand around Jamal's throat.\n\n                              SALIM\n                Why can't you let it alone? You\n                want money, I'll give you money.\n                Girls? I can get you girls.\n\n                              JAMAL\n                You know what I want.\n\n                              SALIM\n                You're like some crazy man-\n                you're obsessed.\n\n                              JAMAL\n                She is my destiny, Salim.\n\n                              SALIM\n                Know what your destiny is, crazy\n                boy? A bullet between the eyes.\n                And after that, he'll kill her.\n                Is that what you want? Huh?\n\n                              JAMAL\n                Me, I don't care. Latika? She's\n                already half dead.\n\n      Salim takes his hand away from Jamal's neck.\n\n                              SALIM\n                Yes. About that, you are right.\n\n                                JAMAL\n                You sold her.\n\n                              SALIM\n                     (fierce)\n                I didn't sell her. Javed wanted\n                her. He gets what he wants.\n\n      He turns away bitterly.\n\n                              SALIM (CONT'D)\n                She's doing alright. Get it into\n                your thick head, Jamal. She's\n                not yours and she never will be.\n\n\n140   INT. STUDIO. NIGHT.                                      140\n\n                              PREM\n                Time for a commercial break,\n                Ladies and Gentlemen. I know, I\n                know, I can't stand the tension\n                either. Don't even think about\n                leaving your seat. We'll be\n                back.\n                                                     (CONTINUED)\n\n                                                          97.\n140   CONTINUED:                                             140\n\n      The lights flick back on. Prem slumps back in his\n      chair.\n\n                                 PREM (CONT'D)\n                   You've got the luck of the\n                   devil, yaar, I'll give you that.\n\n                                   JAMAL\n                   I- I need to-\n\n                                 PREM\n                   Oh, the toilet. Sure. Naveed,\n                   Jamal wants the bog.\n\n      The Floor Manager and a Security Guard usher Jamal off-\n      stage. Prem looks up at the gallery, raises his eyes at\n      the Director. Some show. Then he gathers himself and\n      heads off-stage.\n\n\n141   INT. CHHATRAPATI SHIVAJI TERMINUS. DAY.                 141\n\n      The clock reads five oh three. Jamal stands on the\n      footbridge. Humanity washes around him. His eyes dart\n      around, frightened to miss her. Checks the clock again.\n      Six. The platform is almost deserted. He wanders away.\n\n\n142   INT. CORRIDOR. NIGHT.                                   142\n\n      Prem wanders down the corridor followed by a Security\n      Guard. Another Security Guard is waiting at the\n      entrance to the toilet. Prem goes in, leaving the two\n      Guards in the corridor.\n\n\n143   INT. CHHATRAPATI SHIVAJI TERMINUS. DAY.                 143\n\n      Jamal stands on the footbridge gazing down at the\n      hordes of commuters. Five o'clock, five fifteen, five\n      thirty. Six. Jamal rests his head against the railings.\n\n\n144   INT. TOILET. NIGHT.                                     144\n\n      Jamal is in one of the cubicles. Prem goes to the\n      urinal. Unzips.\n\n                                 PREM\n                   A guy from the slums becomes a\n                   millionaire overnight. You know\n                   the only other person who's done\n                   that? Me. I know what it's like.\n                   I know what you've been through.\n\n                                 JAMAL O/S\n                   I'm not going to become a\n                   milionaire. I don't know the\n                   answer.\n                                                      (CONTINUED)\n\n                                                             98.\n144    CONTINUED:                                               144\n\n                                  PREM\n                         (laughs)\n                    You've said that before, yaar.\n\n       Prem finishes pissing. Goes over to the washbasins,\n       runs the taps and washes his hands.\n\n                                  JAMAL O/S\n                    No, I really don't.\n\n                                  PREM\n                    What? You can't take the money\n                    and run now. You're on the edge\n                    of history, kid!\n\n                                  JAMAL O/S\n                    I don't see what else I can do.\n\n                                  PREM\n                    Maybe it is written, my friend.\n                    You're going to win this. Trust\n                    me, you're going to win.\n\n       Prem leaves. Jamal flushes and comes out of the\n       cubicle. Goes to the washbasins. In the mist on the\n       mirror above the taps is written the letter \"B\". Jamal\n       stares at it. Gradually it fades, leaving only the\n       growing fury on his face staring back at him.\n\n\n145    INT. STUDIO. NIGHT.                                      145\n\n       Jamal stalks back onto the set. Sits down in his chair.\n       Stares at Prem who looks unconcernedly back.\n\n                                  TALKBACK V/O\n                    Twenty seconds.\n\n\n145A   INT. CHHATRAPATI SHIVAJI TERMINUS. DAY.                 145A\n\n       The digital clocks show five fifteen. Shoving the\n       descending river of people out of his way, the\n       seventeen year-old Jamal is forging a path up steps\n       that cross the platforms. He pushes to the middle of\n       the footbridge and leans out on the side railings. He\n       scans the sea of people, desperately. Then he sees her:\n       the eighteen year-old Latika, heart-stoppingly\n       beautiful, over the other side of the station. A world\n       away. She is scanning the crowd, as wired as he is.\n\n                                  JAMAL\n                    Latika! Latika!\n\n       But though he is screaming her name, his voice is\n       swallowed by the noise around him. Then he sees two\n       thuggish-looking men also fighting a way towards her.\n\n\n                                                      (CONTINUED)\n\n                                                          99.\n145A   CONTINUED:                                           145A\n\n                                   JAMAL (CONT'D)\n                    Latika!\n\n       Frightened now, he fights his way down the steps, one\n       figure against an army of white-robed people. He gets\n       to the bottom of the steps, is making progress against\n       the tide. But so are the two men. Jamal is now on the\n       same platform. Shouts her name again. She turns with a\n       smile. But the two Thugs leap through a train onto her\n       platform. She sees them, starts running, is lost in the\n       crowd. Jamal runs off along the platform after Latika.\n\n                                  JAMAL (CONT'D)\n                    Latika! Latika!\n\n\n       By the time Jamal has fought himself to where Latika\n       was- she is gone. He whirls around, mad with\n       frustration.\n\n                                  JAMAL (CONT'D)\n                    Latika! Latika!\n\n\n146    OMITTED                                                  146\n\n\n147    EXT. CHHATRAPATI SHIVAJI TERMINUS. DAY.                  147\n\n       Latika is jumping the tracks, crossing in front of\n       trains. But the Thugs are gaining on her. He brings her\n       down and drags her across to Javed's waiting Mercedes.\n       Salim is standing by the car. Jamal pushes through the\n       crowds just in time to see Salim bundling her into the\n       car.\n\n                                   JAMAL\n                    Salim!\n\n       Salim spits disgustedly on the ground. Gets in. Latika\n       twists her head to see Jamal as the car skids off.\n       Jamal screams with hopeless fury.\n\n\n148    INT. STUDIO. NIGHT.                                      148\n\n                                  TALKBACK V/O\n                    Fifteen seconds.\n\n       Jamal and Prem stare at each other. Prem smiles.\n\n                                  PREM\n                    Do the right thing and in\n                    approximately three minutes you\n                    will be as famous as me.\n\n                                   TALKBACK V/O\n                    Ten seconds.\n\n                                                      (CONTINUED)\n\n                                                         100.\n148   CONTINUED:                                             148\n\n                                 PREM\n                   And as rich as me.\n\n                                    TALKBACK V/O\n                   Five seconds.\n\n                                    PREM\n                   Almost.\n\n                                    TALKBACK V/O\n                   Four, three...\n\n                                 PREM\n                   From rags to Raja. It's your\n                   destiny.\n\n                                    TALKBACK V/O\n                   ...we're on.\n\n      Applause from the audience.\n\n                                 PREM\n                   Welcome back to Who Wants to Be\n                   A Millionaire? In the chair\n                   tonight is Jamal Malik- as if we\n                   don't know! In an amazing run,\n                   Jamal has already five million\n                   rupees but, not content with\n                   that, has chosen to gamble for\n                   one Crore- that's ten million\n                   million rupees. What a player!\n                   The question one more time:\n                   Which cricketer has scored the\n                   most first class centuries in\n                   history. Was it A) Sachin\n                   Tendulkar, B) Ricky Ponting, C)\n                   Michael Slater, D) Jack Hobbs.\n\n                                 JAMAL\n                   I know it isn't Sachin\n                   Tendulkar.\n\n                                 PREM\n                   That's a start. So, it could be\n                   Ricky Ponting, Jack Hobbs or\n                   Michael Slater.\n\n                                 JAMAL\n                   I'll use a life-line. Fifty-\n                   fifty.\n\n                                  PREM\n                   Okay. Computer, take away two\n                   wrong answers.\n\n      Music swells, lights dim.\n\n\n\n                                                      (CONTINUED)\n\n                                                        101.\n148   CONTINUED: (2)                                        148\n\n                              PREM (CONT'D)\n                Well, you were right about\n                Sachin Tendulkar. The computer\n                has taken away A) Sachin\n                Tendulkar and C) Michael Slater.\n                That leaves you a fifty-fifty\n                choice, Jamal. B) Ricky Ponting\n                or D) Jack Hobbs. What do you\n                think? Decision time. For half a\n                million rupees. Your answer: B)\n                Ricky Ponting or D) Jack Hobbs.\n\n      A hideous, never-ending pause while Jamal stares into\n      Prem's eyes.\n\n                                 JAMAL\n                D.\n\n      A barely perceptible jump from Prem.\n\n                              PREM\n                You sure? Not B) Ricky Ponting?\n                The Australian? Great cricketer.\n\n                                 JAMAL\n                D. Jack Hobbs.\n\n                                 PREM\n                Do you know?\n\n      Jamal shakes his head.\n\n                              PREM (CONT'D)\n                So it could be B, Ricky Ponting?\n\n                              JAMAL\n                Or D. Jack Hobbs.\n\n                                 PREM\n                Final Answer?\n\n                              JAMAL\n                Final Answer. D.\n\n      A just-perceptible narrowing of the eyes.\n\n                              PREM\n                Computer-ji D lock kiya-jaye.\n\n      Prem turns to the computer. Music. Lights.\n\n                              PREM (CONT'D)\n                With one hundred and ninety-\n                seven first class centuries, the\n                answer is...D. Jack Hobbs!\n\n      The audience go wild. Prem's smile is thin.\n\n\n                                                    (CONTINUED)\n\n                                                          102.\n148   CONTINUED: (3)                                          148\n\n                              PREM (CONT'D)\n                Jamal Malik, Crorepati!\n\n      The camera goes off Prem for a second. He mimes a\n      disgusted spit. Then he is back on.\n\n                              PREM (CONT'D)\n                I cannot believe what I am\n                seeing here, tonight, Ladies and\n                Gentlemen....So, are you ready\n                for the final question for two\n                Crore rupees- twenty million\n                rupees?\n\n                              JAMAL\n                Not really, but...maybe it is\n                written, no?\n\n                              PREM\n                Maybe, indeed. Okay, okay. For\n                twenty million rupees, the final\n                question on Who Wants to be a\n                Millionaire?\n\n      The lights dim again, the portentous music increases.\n      Suddenly a klaxon sounds. The audience burst into\n      nervous laughter and groans. Prem laughs.\n\n                              PREM (CONT'D)\n                Ohhhhh! Just when I thought I\n                would need a pacemaker fitted,\n                we're out of time! What a show,\n                Ladies and Gentlemen, what a\n                show. Join us tomorrow night to\n                see if Jamal Malik has made the\n                biggest mistake of his life or\n                has just won the biggest prize\n                in the history of Indian\n                television....Same place, same\n                time. You wouldn't dare miss it.\n                Goodnight!\n\n      Applause. The studio lights come up. Prem switches off\n      his smile as fast as the cameras switch off. Gets up\n      and pulls out his mobile.\n\n\n149   EXT. JAVED'S BUNGALOW. DAY.                              149\n\n      Waving a kitchen knife in on hand, a desperate Jamal\n      slams through the gates of Javed's bungalow, the\n      objecting Doorkeeper running along behind. He bangs\n      open the front door.\n\n                              JAMAL\n                Latika!\n\n                                                         103.\n\n\n150    INT. JAVED'S BUNGALOW. DAY.                              150\n\n       Stops dead. The place has been stripped of everything.\n       Not a single thing remains. Jamal runs into another\n       room. As empty as the first. He stops in his tracks.\n\n                               DOOR-KEEPER\n                 Told you.\n\n                               JAMAL\n                 Where? Where is she?\n\n                               DOOR-KEEPER\n                 Dunno.\n\n       He grabs the Door-keeper by the shirt-collar, slams him\n       up against the wall. Holds the knife against his\n       throat.\n\n                               JAMAL\n                 Where?\n\n                               DOOR-KEEPER\n                 I don't know! Wouldn't say,\n                 would they? They had to get out\n                 fast. The police. Honestly.\n\n       Jamal lets go of the Door-keeper. Goes hopelessly to\n       the window. On the window sill is a phone. He picks it\n       up. There is a dial tone. Jamal rummages in his trouser\n       pocket. Gets out the battered card with Salim's details\n       on. Dials. Salim picks up.\n\n                               JAMAL\n                 Where are you? Where is she?\n\n\n150A   INT. JAVED'S SAFE HOUSE. SALIM'S ROOM. DAY.             150A\n\n       Salim is stalking around his room in Javed's new house.\n       Hold-alls of clothes and possessions lie around the\n       room. A chest of drawers sits with its drawers open,\n       still empty.\n\n                               SALIM\n                 Where you'll never find her. Or\n                 me. You could have joined us,\n                 you bloody idiot, been one of\n                 us. You've lost everything now.\n                 Everything.\n\n       Cuts the call off and slings the phone in a drawer.\n       Takes the gun from his waist, and throws that in too.\n       Slams the drawer shut with as much force as he can.\n\n                                                          104.\n\n\n150B   INT. JAVED'S BUNGALOW. DAY.                           150B\n\n                                 JAMAL\n                 Salim...!\n\n       The line goes dead. Jamal slides to the floor...\n\n\n151    INT. SALIM'S APARTMENT. NIGHT.                            151\n\n       ...the camera pulls out from Jamal's face revealing\n       that Jamal is sitting on the floor of Salim's\n       apartment. In the background can be heard the sound of\n       the television. Jamal looks at the knife in his hand,\n       wonders what he might do with it. The sound of Prem's\n       voice on the tv.\n\n                               PREM O/S\n                 ...if you want a chance to play\n                 Who Wants to be a Millionaire,\n                 call now...!\n\n       Jamal looks up. Stares at the tv.\n\n\n152    INT. STUDIO. BACKSTAGE. NIGHT.                            152\n\n                                PREM\n                 This way, Jamal, this way. Great\n                 show, my friend. See you\n                 tomorrow, huh?\n\n       In the half-light, Prem guides him to a stage door.\n\n\n153    EXT. STUDIO. BACKSTAGE. NIGHT.                            153\n\n       Jamal steps outside the backstage door. Leans on the\n       rail and takes a huge breath. Immediately, a blanket is\n       thrown over his head and two police men bundle him into\n       the back of a police van. The Director joins Prem at\n       the back-stage door as the van pulls away, sirens\n       screaming.\n\n                               DIRECTOR\n                 What's going on?\n\n                                 PREM\n                 He's a cheat.\n\n                               DIRECTOR\n                 This was you? You called them?\n\n       Prem shrugs.\n\n                               DIRECTOR (CONT'D)\n                 How d'you know he's cheating?\n\n\n                                                     (CONTINUED)\n\n                                                         105.\n153   CONTINUED:                                             153\n\n                                 PREM\n                   Oh, come on! Of course he is.\n                   He's a bloody village boy. Even\n                   when I fed him the wrong answer\n                   the little shit got it right.\n\n      Director stares at him.\n\n                                 DIRECTOR\n                   You gave him an answer?\n\n                                 PREM\n                   Well, I didn't exactly-\n\n      The Director walks away shaking his head. In the\n      doorway, Nita is standing there, watching.\n\n                                 PREM (CONT'D)\n                   Nita?\n\n      But she too turns and walks away.\n\n\n154   INT. INSPECTOR'S OFFICE. DAY.                            154\n\n                                 INSPECTOR\n                   It is all bizarrely plausible.\n                   And yet...\n\n                                 JAMAL\n                   Because I am a slum dog, chi-\n                   wallah, I am a liar, right?\n\n                                 INSPECTOR\n                   Most of you are.\n\n      Srinivas comes hurrying in carrying a file, very\n      pleased with himself.\n\n                                 CONSTABLE SRINIVAS\n                   Shooting at Pila Street, October\n                   19th...Maman Hossani....Victim\n                   pronounced dead at scene.\n                   Suspects absconded: two males,\n                   early teens, one female, early\n                   teen.\n\n      The Inspector takes the file. Stares at it. Shakes his\n      head.\n\n                                 INSPECTOR\n                   But you: you're not a liar,\n                   Mister Malik, that is for sure.\n                   You are too truthful.\n\n      He turns to Srinivas.\n\n\n\n                                                      (CONTINUED)\n\n                                                              106.\n154    CONTINUED:                                                 154\n\n                                  INSPECTOR (CONT'D)\n                    Thank you, Constable. All that\n                    remains is to work out whether\n                    it was manslaughter or murder.\n                    Ten years, or life.\n\n       The Young Constable sticks his head around the door.\n\n                                  YOUNG CONSTABLE\n                    The Commissioner's here, Sir.\n\n       The Inspector sighs. Gets up. Accompanied by Srinivas,\n       he leaves the room. Jamal sits there. Lets his head\n       drop. The camera floats from the room, down the dingy\n       corridor and out through a window...\n\n\n155    EXT. POLICE STATION. DAY.                                  155\n\n       ....alighting on a crowd of hundreds of people jostling\n       to get a view of the building. News crews are setting\n       up around them. A tv Reporter is doing a piece to\n       camera.\n\n                                  TV REPORTER\n                    ....behind the walls of this\n                    police station lies the mystery\n                    all of India is talking about.\n                    Did Jamal Malik, an uneducated,\n                    eighteen year-old boy from the\n                    slums of Mumbai win one Crore\n                    rupees by fair means or foul?\n                    And in the crowds all around me\n                    there is an even bigger\n                    question. Will he be back on the\n                    show tonight to play for twenty\n                    million rupees...\n\n\n156    OMITTED                                                    156\n\n\n156A   INT. POLICE OFFICE. DAY.                                  156A\n\n       The Commissioner is waiting in the outer office.\n\n                                  COMMISSIONER OF POLICE\n                    So? Have you charged him yet?\n\n                                  INSPECTOR\n                    I- progress is being made sir.\n\n                                  COMMISSIONER OF POLICE\n                    Progress? Have you charged him?\n\n                                  INSPECTOR\n                    No, Sir.\n\n\n                                                           (CONTINUED)\n\n                                                              107.\n156A   CONTINUED:                                                156A\n\n       The Commissioner dumps a copy of the Times of India\n       down on the desk. Then the Hindustan Times, the Amar\n       Ujala and the Afternoon Dispatch thump down after them.\n       All have photos of Jamal on Who Wants to be a\n       Millionaire on the front page.\n\n                                  COMMISSIONER OF POLICE\n                    And if that isn't enough for\n                    you...\n\n       He motions the Inspector to come over to the window.\n\n       Lifts the blind. The Inspector hurries over. Looks\n       alarmed.\n\n                                   INSPECTOR\n                    That's-?\n\n                                  COMMISSIONER OF POLICE\n                    - yes, yes! The boy's a bloody\n                    hero with every beggar and thief\n                    in the city. We're in danger of\n                    looking very stupid, here,\n                    Inspector.\n\n                                  INSPECTOR\n                    Whilst I'm not convinced he\n                    actually cheated, I have got-\n\n       The Inspector brandishes the file.\n\n                                  COMMISSIONER OF POLICE\n                    - Prem Kumar himself- a man of\n                    great standing and integrity-\n                    said the kid was a liar and a\n                    cheat. What more do you need?\n\n       The Inspector pauses.\n\n                                   INSPECTOR\n                    A liar.\n\n       Then he puts the file behind his back. Srinivas frowns.\n\n                                   INSPECTOR (CONT'D)\n                    Indeed, sir.\n\n       Srinivas coughs pointedly. Gets a steely look from the\n       Inspector. The Commissioner has been staring out of the\n       window at the crowds. Turns back to them.\n\n                                  COMMISIONER OF POLICE\n                    He's in for fraud, so you charge\n                    him for fraud. Fast. Or you'll\n                    find yourself on traffic duty at\n                    the Gateway of India.\n                    Understand?\n\n\n                                                           (CONTINUED)\n\n                                                         108.\n156A   CONTINUED: (2)                                       156A\n\n                               INSPECTOR\n                 Yes, sir.\n\n       The Commissioner walks out.\n\n                               CONSTABLE SRINIVAS\n                 Sir-?\n\n\n                               INSPECTOR\n                 Not a word, Srinivas.\n\n\n157    INT. JAVED'S SAFE-HOUSE. SITTING ROOM. NIGHT.            157\n\n       A cheek scarred by disfiguring knife scars. Pulling\n       back we see it is Latika, staring frozen at Jamal on\n       the television news. A palatial living room. Dealing\n       cards to Salim, is Javed Khan. A couple of Bar Girls\n       giggle next to Javed and a couple of his Thugs. Pouring\n       drinks at a sideboard is Latika. Javed glances up at\n       the screen, clearly not recognising Jamal on a clip\n       from Who Wants to be a Millionaire. Salim, too is\n       staring, wide-eyed at the tv. Javed picks up the\n       remote, doesn't even notice and switches over to a\n       music channel. Latika hurries out.\n\n                               JAVED\n                 What about my bloody whisky,\n                 woman?\n\n       But she has already gone. He growls after her.\n\n                               JAVED (CONT'D)\n                 Hey, Salim.\n\n       He motions Salim to get him a drink. Javed's mobile\n       rings as Salim goes over to the sideboard. Shifts a\n       bottle to the back.\n\n                               SALIM\n                 We're out. I'll just get- Syed.\n\n       Salim smiles faintly at the image of Jamal and hurries\n       out.\n\n\n158    INT . JAVED'S SAFE-HOUSE. SALIM'S ROOM. NIGHT.           158\n\n       A drawer opens. Inside is Salim's pistol. And a phone-\n       the same one he threw in there months ago. Salim stares\n       at both for a long time. Finally, picks up the gun and\n       phone.\n\n                               SALIM\n                      (to himself)\n                 Final answer?\n\n       He finds this faintly amusing.\n\n                                                        109.\n\n\n159   INT. JAVED'S SAFE-HOUSE. KITCHEN. NIGHT.                 159\n\n      Latika sits in the kitchen, staring at the tv, tears\n      running down her cheeks. A reporter is talking in front\n      of an enlarged photograph of Jamal. Latika wipes away\n      the tears quickly as Salim comes in. He locks the door\n      behind him. Stares at the tv.\n\n                              SALIM\n                That boy. He will never give up.\n                Never.\n\n      He shakes his head.\n\n                                 SALIM (CONT'D)\n                Crazy chutiyé.\n\n      Salim approaches Latika. She flinches as he walks\n      towards her. He puts some car keys in front of her.\n\n                                 SALIM (CONT'D)\n                Ja. Go.\n\n                                 LATIKA\n                But-\n\n                              SALIM\n                - just drive. There won't be\n                another chance. Go.\n\n      Latika takes the keys. Hesitates.\n\n                              LATIKA\n                He'll kill you.\n\n      Salim smiles, shakes his head.\n\n                              SALIM\n                It is not written.\n\n                                 JAVED O/S\n                Salim!\n\n      Salim goes to the back door. Unlocks it. Opens it for\n      her.\n\n                              LATIKA\n                Salim, I....can't.\n\n      Salim points at the television.\n\n                              SALIM\n                You have to. It'll take you two\n                hours if you drive fast. Here.\n\n      He holds out his mobile phone.\n\n                              SALIM (CONT'D)\n                For God's sake, hold on to it.\n                                                    (CONTINUED)\n\n                                                        110.\n159   CONTINUED:                                            159\n\n      Latika takes it. Salim takes hold of both sides of her\n      head for a moment.\n\n                                 SALIM (CONT'D)\n                   For what I have done, please\n                   forgive me.\n\n      Salim releases her.\n\n                                 SALIM (CONT'D)\n                   Go. Have a good life.\n\n      Salim puts his hands together in blessing. She leaves.\n      Salim shuts the door, locks it. Smiles.\n\n\n160   INT. INSPECTOR'S OFFICE. NIGHT.                          160\n\n      Jamal is dozing in the chair. He wakes with a shout.\n      Srinivas has just thrown a bucket of water in his face.\n      He unlocks the handcuffs. Jamal looks up at him.\n      Srinivas shrugs.\n\n                                 CONSTABLE SRINIVAS\n                   You're back on the show.\n\n\n161   INT. BACKSTAGE. NIGHT.                                   161\n\n      The audience for Who Wants to be a Millionaire are\n      standing in line. They are being body-searched by\n      police. Mobiles are being confiscated and put in bags.\n\n\n162   INT. BACKSTAGE. NIGHT.                                   162\n\n      Gaffers make last-minute adjustments to the lights\n      shining on the empty chairs in the middle of the set.\n      Camera positions are checked by the Floor Manager.\n\n\n163   INT. POLICE OFFICE. NIGHT.                               163\n\n      Srinivas walks Jamal through the police office, past\n      the Inspector sitting at his desk, his arms behind his\n      head, pondering. He watches Jamal go and then asks:\n\n                                 INSPECTOR OF POLICE\n                   What happened? To the girl?\n                   Latika?\n\n      Jamal stops.\n\n                                 JAMAL\n                   Who knows?\n\n      Jamal walks on. The Inspector watches him all the way.\n\n                                                          111.\n\n\n164   INT. POLICE JEEP. NIGHT.                                   164\n\n      Jamal sits in the back of the police jeep. It pulls out\n      of the police station car park into a sea of people all\n      cheering and shouting at the jeep. Jamal looks\n      terrified.\n\n\n165   INT. CAR. NIGHT.                                           165\n\n      Latika drives through the slums of Mumbai. She hoots\n      her horn furiously at a cart-driver ambling across the\n      road.\n\n\n166   INT. POLICE JEEP. NIGHT.                                   166\n\n      The jeep stops at the lights and a beggar wanders up,\n      tapping on the windscreen. The beggar studies Jamal's\n      face for a second, then starts shouting and pointing at\n      him.\n\n                              BEGGAR\n                Crorepati! Crorepati!\n\n      Other beggars- just like the one Jamal used to be- join\n      him and start cheering and applauding. The jeep pulls\n      away.\n\n\n167   OMITTED                                                    167\n\n\n168   EXT. SLUM. NIGHT.                                          168\n\n      At the chi stall, everyone gathers around the tv,\n      watching.\n\n\n169   EXT. ROADSIDE CHI HOUSE. NIGHT.                            169\n\n      A rickshaw parks up next to a hundred others. The\n      Driver leaps out, abandoning the irate business man in\n      the back and runs to the tv in the café.\n\n\n170   INT. CALL CENTRE. NIGHT.                                   170\n\n      The Manager walks into the aircraft hanger of a\n      building. Stops. Where is everyone? Then he sees\n      everyone crowded around the tv in the Recreation Room.\n      Stalks over.\n\n                              MANAGER\n                Oi! Get back to work.\n\n      Then he sees Jamal's face on the tv.\n\n\n                                                    (CONTINUED)\n\n                                                        112.\n170   CONTINUED:                                            170\n\n                                 MANAGER (CONT'D)\n                   The chi-wallah?\n\n\n171   EXT. ROADSIDE SHACKS. NIGHT.                             171\n\n      All along the highway, one by one the televisions in a\n      hundred shacks flick on, silhouetting the family\n      huddled in front of it.\n\n\n172   INT. STUDIO. BACKSTAGE. NIGHT.                           172\n\n      In the half-light, Jamal is being powdered by Nita.\n\n                                    NITA\n                   Good luck.\n\n      Prem sneers.\n\n                                    TALKBACK V/O\n                   Two minutes.\n\n      She finishes powdering Jamal.\n\n                                 PREM\n                   Hey. Sweetheart. What about me?\n                   I'm sweating, here.\n\n                                    NITA\n                   You should be.\n\n      She dumps the powder compact in his hand.\n\n                                 PREM\n                   So. Tonight. The Calypso Bar.\n\n                                 NITA\n                   Not if you were the only man in\n                   the world.\n\n      She walks off.\n\n                                 PREM\n                        (genuinely puzzled)\n                   But I am the only man in the\n                   world.\n\n\n173   EXT. MUMBAI STREET. NIGHT.                               173\n\n      The traffic is gridlocked. Latika is pumping the horn.\n\n                                 LATIKA\n                   Come on, come on!\n\n      She glances out of the window, sees one of the roadside\n      shacks with the television on. Gets out of the car and\n      runs to it.\n\n                                                           113.\n\n\n173A   INT. COMMISSIONER'S OFFICE. NIGHT.                     173A\n\n       The Commissioner grabs his phone.\n\n                               COMMISSIONER OF POLICE\n                 Get me the Inspector on the\n                 phone now!\n\n\n173B   INT. INSPECTOR'S OFFICE. NIGHT.                        173B\n\n       The Inspector wanders into his office, still deep in\n       thought. Switches on the television just as the\n       Millionaire music starts. Sits. The phone rings.\n\n\n174    OMITTED                                                    174\n\n\n175    OMITTED                                                    175\n\n\n176    OMITTED                                                    176\n\n\n177    INT. STUDIO. NIGHT.                                        177\n\n       Prem and Jamal walk on-stage. Blinding light. They take\n       their seats to tumultuous applause.\n\n                                PREM\n                 Welcome back to Who Wants to be\n                 a Millionaire? I can safely say\n                 that tonight is the biggest\n                 night of both of our lives,\n                 Ladies and Gentlemen. Jamal\n                 Malik, the Call Centre worker\n                 from Mumbai has already won one\n                 Crore rupees, a cool ten\n                 million. Tonight, he can walk\n                 away with that in his pocket or\n                 make the biggest gamble in\n                 television history and go for\n                 the final question and a\n                 staggering twenty million\n                 rupees! Jamal, are you ready for\n                 that question?\n\n                               JAMAL\n                 Yes.\n\n       The lights dim, the music rumbles. Prem pushes the\n       button on his computer. Pauses. Gets conversational.\n\n                               PREM\n                 Big reader, are you Jamal? A\n                 lover of literature?\n\n       Nervous laughter from the audience. Jamal just shrugs.\n                                                        (CONTINUED)\n\n                                                         114.\n177   CONTINUED:                                             177\n\n                                 JAMAL\n                   I can read.\n\n      Even more nervous laughter.\n\n                                 PREM\n                   Lucky! In Alexandre Dumas' book,\n                   The Three Musketeers, two of the\n                   musketeers are called Athos and\n                   Porthos. What was the name of\n                   the third musketeer. Was it A)\n                   Aramis, B) Cardinal Richelieu,\n                   C) D'Artagnan, D) Planchet.\n\n      An involuntary laugh comes out of Jamal's mouth.\n\n\n178   INT. ROADSIDE SHACK. NIGHT.                              178\n\n      In the shack, sitting on an upturned oil drum,\n      surrounded by puzzled Indians in rags, a slow smile\n      comes to Latika's face.\n\n\n179   OMITTED                                                  179\n\n\n180   INT. STUDIO. NIGHT.                                      180\n\n      Camera on Prem.\n\n                                 PREM\n                   The final question, for twenty\n                   million rupees: and he's\n                   smiling. I guess you know the\n                   answer.\n\n                                 JAMAL\n                   Would you believe it? I don't.\n\n      Jamal laughs. There's nothing else to do. The audience\n      groan.\n\n                                 PREM\n                   You don't? So, you're going to\n                   take the ten million and walk?\n\n                                 JAMAL\n                   No.\n\n                                 PREM\n                   No?\n\n                                 JAMAL\n                   I'll play.\n\n      A gasp from the audience.\n\n\n                                                      (CONTINUED)\n\n                                                        115.\n180   CONTINUED:                                            180\n\n                                 PREM\n                   You just said you don't know the\n                   answer. I heard that, right? You\n                   do understand that if you get\n                   the answer wrong, you lose\n                   everything? Ten million rupees.\n                   A fortune, Jamal.\n\n      A terrible pause.\n\n                                 JAMAL\n                   I'd like to phone a friend.\n\n                                  PREM\n                   We're going to the wire, Ladies\n                   and Gentlemen, we are going to\n                   the wire. The final Life-line.\n                   Here we go....\n\n\n181   INT. STUDIO. NIGHT.                                      181\n\n      Prem presses his computer. Ominous rumble of drums. The\n      lights dim. A phone can be heard ringing, the amplified\n      sound echoing around the studio.\n\n                                   PREM\n                   It's ringing.\n\n      The phone continues to ring.\n\n\n182   INT. ROADSIDE SHACK. NIGHT.                              182\n\n      Latika is staring at the television. Then an electric\n      current seems to shoot through her and she is running,\n      dodging the static traffic, street vendors, the odd\n      cow, heading for her abandoned car. Hooting horns,\n      shouting drivers. The phone rings on...\n\n\n183   INT. STUDIO. NIGHT.                                      183\n\n      And on...\n\n                                 PREM\n                   Doesn't look as if your friend\n                   is in, Jamal. Who is it?\n\n                                 JAMAL\n                   My brother's number, but-\n\n                                 PREM\n                   - the sort of brother who'd go\n                   for a walk on the twenty million\n                   rupee question?\n\n                                 JAMAL\n                   It's the only number I know.\n\n                                                           116.\n\n\n184   INT. CAR. NIGHT.                                            184\n\n      On the passenger seat of Latika's car, Salim's phone\n      continues to ring...\n\n\n185   INT. STUDIO. NIGHT.                                         185\n\n      ...and ring.\n\n                              PREM\n                You're on your own, Jamal.\n\n      Prem looks up at the gallery. The Director shakes his\n      head, mimes cutting his throat.\n\n\n186   INT. CAR. NIGHT.                                            186\n\n      Latika wrestles the door open, grabs the phone.\n\n\n187   INT. STUDIO. NIGHT.                                         187\n\n      Prem opens his mouth to speak. Then, out of the\n      darkness of the studio,\n\n                                LATIKA V/O\n                Hello?\n\n      A gasp from the audience.\n\n                                LATIKA V/O (CONT'D)\n                Hello? Jamal?\n\n                              PREM\n                Wow! That's cutting it fine. I'm\n                guessing this isn't your\n                brother. This is-\n\n                              LATIKA V/O\n                My name is Latika.\n\n      The first real smile of Jamal's adult life.\n\n\n\n188   EXT. STUDIO. BACKSTAGE. NIGHT.                              188\n\n      A small smile spreads across the Inspector's face.\n\n                              INSPECTOR\n                That's why he's on the show.\n\n      He picks up his hat and hastens out of the room.\n\n                                                         117.\n\n\n189   INT. JAVED'S SAFE-HOUSE. NIGHT.                           189\n\n      Javed pulls the Bar Girl from him, stares open-mouthed\n      at the television.\n\n                               JAVED\n                 What the bloody-?\n\n      He pushes the girl off him. Gets to his feet.\n\n                                  JAVED (CONT'D)\n                 Latika! Salim!\n\n\n190   INT. STUDIO/ INT. ROADSIDE SHACK. NIGHT.                  190\n\n                               PREM\n                 Okay! So, Latika, you want to\n                 hear the question one more time?\n                 And let's be clear about this.\n                 Twenty million rupees ride on\n                 your answer. You have thirty\n                 seconds. Jamal, please read out\n                 the question to Latika.\n\n                               JAMAL\n                 Is that really you?\n\n                                  LATIKA V/O\n                 Yes.\n\n                               PREM\n                 The question, Jamal.\n\n                               JAMAL\n                 In Alexandre Dumas' book, The\n                 Three Musketeers, two of the\n                 musketeers are called Athos and\n                 Porthos. What was the name of\n                 the third musketeer. Was it A)\n                 Aramis, B) Cardinal Richelieu,\n                 C) D'Artagnan, D) Planchet.\n\n      Silence. The electronic clock ticks loudly.\n\n                               PREM\n                 Fifteen seconds.\n\n                                  JAMAL\n                 Where are you?\n\n                                  LATIKA V/O\n                 I'm- I'm safe.\n\n                               PREM\n                 Ten seconds. So, Latika, what do\n                 you think?\n\n      Silence.\n                                                      (CONTINUED)\n\n                                                           118.\n190   CONTINUED:                                               190\n\n                                 PREM (CONT'D)\n                   Five, four, three, two, one.\n                   Time's up! Your answer.\n\n                                   LATIKA V/O\n                   I don't know.\n\n      The audience groan.\n\n                                   PREM\n                   Oh...\n\n                                 LATIKA V/O\n                   I've never known.\n\n                                 PREM\n                   You really are on your own, now,\n                   Jamal. Your answer: for twenty\n                   million rupees.\n\n      Jamal shrugs.\n\n                                   JAMAL\n                   A.\n\n                                   PREM\n                   A. Because?\n\n                                 JAMAL\n                   Just...because.\n\n                                 PREM\n                   Apka final jawab?\n\n                                 JAMAL\n                   Yes. Final answer. A. Aramis.\n\n      The lights dim, the music crescendoes. A buzz runs\n      around the audience. Prem pushes the button on his\n      computer. Stares hard at Jamal.\n\n                                 PREM\n                   Computer-ji A lock kiya-jaye.\n                   Jamal Malik, Call Centre\n                   Assistant from Mumbai, for two\n                   Crore, twenty million rupees,\n                   you were asked who the Third\n                   Musketeer was in the novel by\n                   Alexandre Dumas. You used your\n                   final life-line to phone a\n                   friend. You answered A.\n                   Aramis.....which is...I have to\n                   tell you...the correct answer!\n\n      Wild applause. Prem jumps up and pulls a bemused Jamal\n      to his feet, raising his arm in the air. Jamal is\n      smiling, but disorientated.\n\n\n                                                      (CONTINUED)\n\n                                                          119.\n190   CONTINUED: (2)                                          190\n\n                              PREM (CONT'D)\n                Ladies and Gentlemen, Jamal\n                Malik, Crorepati! What a night!\n                We have all been present at the\n                making of history, Ladies and\n                Gentlemen! Jamal Malik,\n                millionaire!\n\n                              JAMAL\n                Latika? Latika?\n\n      To ever-increasing roars and applause from the\n      audience, Prem escorts Jamal off-stage.\n\n\n191   INT. ROADSIDE SHACK. NIGHT.                              191\n\n      The line goes dead in Latika's hand. She stares down at\n      the phone. The bemused family are still eying her like\n      an alien. She smiles at them and goes out. The traffic\n      on the road is still grid-locked. She starts walking,\n      faster and faster. Then she breaks into a run.\n\n\n192   INT. JAVED'S SAFE-HOUSE. BATHROOM. NIGHT.                192\n\n      A small tv in the bathroom. Salim smiles.\n\n                              JAVED O/S\n                Salim! Teri ma ki chute! Salim!\n\n      Javed is banging on the door. Salim gets up from where\n      he has been praying. He climbs into the bath which is\n      full of bank notes and lies down amongst the money. He\n      reaches across for the pistol and picks it up. Smiles\n      slightly as Javed smashes down the door, pulls the\n      trigger and shoots Javed. He falls onto the floor,\n      dead. But the Thug right behind him shoots Salim in the\n      chest. He lies back in the bath, the faintest trace of\n      a smile on his face as he stares at the pictures of\n      Jamal on the tv.\n\n                               SALIM\n                God is good.\n\n      Salim dies.\n\n\n193   INT. STUDIO. BACKSTAGE. NIGHT.                           193\n\n      Prem and Jamal are being posed by photographers. A\n      giant-sized cheque for twenty million rupees is\n      manhandled onto the floor by the Floor Manager and an\n      Assistant amidst much cheering and laughter. Jamal is\n      snapped next to a scowling Prem. The Inspector appears\n      next to them.\n\n                              INSPECTOR\n                Just one more thing left, Sir.\n                                                       (CONTINUED)\n\n                                                               120.\n193   CONTINUED:                                                   193\n\n      Prem smiles.\n\n                                   PREM\n                   Finally, huh?\n\n                                 INSPECTOR\n                   If you'd like to come with me.\n\n      He takes Jamal by the arm, leads him backstage.\n\n\n\n194   INT/EXT. POLICE JEEP. NIGHT.                                 194\n\n      Jamal sits silent in the back seat next to the\n      Inspector as he drives through the traffic. Then:\n\n                                 JAMAL\n                   Truth alone triumphs? I should\n                   have known better.\n\n      The Inspector stops the jeep. Unlocks the handcuffs.\n      Holds the back door open for Jamal.\n\n                                 INSPECTOR\n                   Thought you might need a lift,\n                   Sir.\n\n      He nods towards the outside world. Dazed, Jamal gets\n      out.\n\n\n195   EXT. CHHATRAPATI SHIVAJI TERMINUS. NIGHT.                    195\n\n      Jamal finds himself    gazing up     at VT station. Slowly, he\n      wanders inside. The    Inspector     takes the contents of the\n      file and tears them    slowly in     half. Lets the pieces\n      fall on the ground.    Gets back     in the jeep and drives\n      away.\n\n\n196   OMITTED                                                      196\n\n\n197   INT. CHHATRAPATI SHIVAJI TERMINUS. NIGHT.                    197\n\n      VT station is awash with the evening commute. Thousands\n      of people crowd the platforms, jostling the only still\n      figure who is sitting at the base of the statue of\n      Frederick Stevens. Jamal. Then there is a gap in the\n      wall of bodies that swirls around him. Jamal gets to\n      his feet.\n\n                                   JAMAL\n                   Latika?\n\n      Then she is gone in the melee again. Only to reappear.\n\n\n                                                           (CONTINUED)\n\n                                                        121.\n197   CONTINUED:                                            197\n\n                                 LATIKA\n                   Jamal?\n\n      Jamal forces himself through the people. Nothing will\n      stop him. Latika too is shoving them aside until they\n      are face-to-face. They stop, look at each other, hold\n      each other's hands tight. The whole station seems\n      frozen, the only movement from a thousand bodies being\n      Jamal and Latika.\n\n                                  LATIKA (CONT'D)\n                   I thought we would meet again\n                   only in death.\n\n      He shakes his head.\n\n                                 JAMAL\n                   I knew you'd be watching.\n\n      Jamal puts his hand on Latika's chin, turns her head\n      gently so that she is facing him. He sees the knife\n      scars on her cheek for the first time. She tries to\n      turn her head, but he won't let her. Runs his hand\n      slowly down the scar. Rests his hand there.\n\n                                 JAMAL (CONT'D)\n                   This is our destiny.\n\n      He gently kisses the scarred cheek.\n\n                                 JAMAL (CONT'D)\n                   This is our destiny.\n\n      The camera pulls back and back, rising above the\n      station. The music starts and the frozen station comes\n      alive, two thousand kurta-clad men and saree-clad women\n      dancing in and out and on top of the trains, an unbound\n      celebration of hope and humanity that has at its\n      centre, Jamal and Latika.\n\n\n\n                                                      THE END\n\n\n\n\n\nSlumdog Millionaire\nWriters :   Simon Beaufoy  Vikas Swarup\nGenres :   Crime  Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In 2006, eighteen-year-old Jamal Malik from the Juhu slum, is a contestant on the Indian version of Who Wants to Be a Millionaire? (see Kaun Banega Crorepati), and is one question away from the grand prize. However, before the ₹20 million (US$300,000) question, he is detained and tortured by the police, who suspect him of cheating because of the impossibility of a simple \"slumdog\" with very little education knowing all the answers. Jamal recounts, through flashbacks, the incidents in his life which provided him with each answer. These flashbacks tell the story of Jamal, his brother Salim and Latika. In each flashback Jamal has a point to remember one person, or song, or different things that lead to the right answer of one of the questions. The row of questions does not correspond chronologically to Jamal's life, so the story switches between different periods (childhood, adolescence) of Jamal. Some questions do not refer to points of his life (cricket champion), but by witness he comes to the right answer.\nJamal's flashbacks begin with his managing, at age five, to obtain the autograph of Bollywood star Amitabh Bachchan, which his brother then sells, followed immediately by the death of his mother during the Bombay Riots. As they flee the riot, they meet Latika, another child from their slum. Salim is reluctant to take her in, but Jamal suggests that she could be the third musketeer, a character from the Alexandre Dumas novel (which they had been studying — albeit not very diligently — in school), whose name they do not know. The three are found by Maman—a gangster who tricks and then trains street children into becoming beggars. Maman attempts to recruit Salim, but when Salim discovers Maman is blinding the children in order to make them more effective beggars, he flees with Jamal and Latika to a departing train. However, when Latika catches up to the train and takes Salim's hand, he purposely lets go, and she is recaptured by the gangsters. Over the next few years, Salim and Jamal make a living travelling on top of trains, selling goods, picking pockets, working as dish washers, and pretending to be tour guides at the Taj Mahal, where they steal people's shoes. At Jamal's insistence, they return to Mumbai to find Latika, discovering that she has been raised by Maman to become a prostitute and that as a virgin she is expected to fetch a high price. The brothers rescue her, and Salim kills Maman with a gun. Salim then manages to get a job with Javed —Maman's rival crime lord. Back at their room, Salim orders Jamal to leave him and Latika alone. When Jamal refuses, Salim draws a gun on him, and Latika persuades him to go away to protect him.\nYears later, now a tea-boy in an Indian call centre, Jamal searches the centre's database for Salim and Latika. He fails in finding Latika but succeeds in finding Salim, who is now a high-ranking lieutenant in Javed's organization, and they reunite. Jamal attacks Salim, who then pleads for forgiveness, and lets him stay in his luxurious apartment. Jamal then bluffs his way into Javed's residence and reunites with Latika. While Jamal professes his love for her, Latika asks him to forget about her. Jamal promises to wait for her every day at 5 o'clock at the VT station. Latika attempts to rendezvous with him, but she is recaptured by Javed's men, led by Salim. Jamal loses contact with Latika when Javed moves to another house, outside Mumbai. Jamal becomes a contestant on Who Wants to Be a Millionaire?, knowing that she watches the show regularly. He makes it to the final question, much to the consternation of the show's host, Prem Kumar and becomes a wonder across India. After using the 50/50 lifeline on the penultimate question, Kumar feeds Jamal an answer intending for Jamal to think it's the correct one and go with it to proceed to the final question, but when Jamal chooses the other answer instead, wanting to lose instead of winning dishonestly, Kumar turns him in to the police on suspicion of cheating after it turns out the answer Jamal chose was the correct one after all.\nIn the interrogation room, the police inspector after listening to Jamal's explanations on each answer, calls them \"bizarrely plausible\" and allows him to return to the show. At Javed's safehouse, Latika sees Jamal on the news and Salim, in an effort to make amends for his past behaviour, gives Latika his mobile phone and car keys, and asks her to forgive him and to go to Jamal. Latika is reluctant out of fear of Javed, but agrees and escapes. Salim fills a bathtub with money and sits in it, waiting for Javed and his men when they realise he let Latika go. Jamal's final question is, by coincidence, the name of the third musketeer in The Three Musketeers, which he never learned. Jamal uses his Phone-A-Friend lifeline to call Salim's cell, as it is the only phone number he knows. Latika answers the phone, and, while she does not know the answer, tells Jamal that she is safe. Relieved, Jamal randomly picks Aramis, the right answer, and wins the grand prize. Javed hears Latika on the show and realizes that Salim has betrayed him. He and his men break down the bathroom door but Salim kills Javed before he is shot, gasping, \"God is great.\" Jamal and Latika meet on the platform at the railway station; they kiss, and to the song \"Jai Ho\" they dance energetically."}