{"title": "Snatch", "full_text": "SNATCH\n\n\n\n                By Guy Ritchie\n\n\n\nDraft 4                    FOR EDUCATIONAL\nAugust/9/1999               PURPOSES ONLY\n\n\n\n\n1·    EXT. RUSSIA -- NIGHT\n\n\n\n\n      We open on a GUARD sitting in front of a sentry post. He is\n      wearing a heavy fur hat that covers his ears and a military-\n      jacket. Behind him is a list of instructions (in Russian).\n      He 'sucks in a cigarette as though he's a drowning man lookin\n      for oxygen. A CAR comes to a stop by the sentry post, the,\n      guard looks, asks a couple of questions and is given an\n     -envelope which he quickly examines, he then attempts to stick\n      his head in the car. A gun barrel is promptly stuck in his\n      face and a couple of angry words emanate from the back, the\n      guard jumps back and quickly raises the barrier.\n\n\n\n     This next section will be intercut with the credit sequence.\n\n                                      «·'\n\n\n2    INT. BACK OF RUSSIAN CAR -- NIGHT\n\n     On the back seat is FRANKY FOUR -FINGERS, (New York street\n     wise Jew) who is clutching a fancy looking briefcase which\n     is handcuffed to his wrist. He is flanked by TWO RUSSIAN\n     HOODS. This next section will be subtitled.\n\n                           FRANKY FOUR FINGERS\n\n               How much further do we have to go?\n     Just then the car comes to a standstill. The window is wound\n     down and a gun barrel is stuck through. The RUSSIAN DRIVER\n     looks dramatically calm.\n\n                           RUSSIAN\n\n               Pass him the money.\n     Franky hesitates for a second.\n\n                           RUSSIAN (CONT'D)\n\n               Franky you know you have no choice.\n               So please can we get on with it?\n      Franky knows discussion is futile. He flips the case open\n      and pulls out a transparent plastic bag full of American\n      dollars. The package is pulled out of the window, the driver\n      doesn't move, we dissolve for a passage of time, the anxiety\n      is more than obvious, but Four Fingers can do nothing. All\n      of a sudden a package comes through the window and the car\n      speeds off without waiting for an inspection of the delivery.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                             (CONTINUED)\n\n\n\n\n\n2   CONTINUED:\n\n    Franky opens the package and he reveals a stone the size of\n    a fist. He shines a torch onto it and puts a stone inspectin\n    monocle to his eye. He's satisfied.\n\n    CUT TO: MUSIC,A CLOSE UP OF THE DIAMOND. MIX TO: ANOTHER\n\n\n    DIAMOND BEING HELD BY AN OVERWEIGHT BLACK MAN. CUT TO: MONTAG\n\n\n    INVOLVING ALL THE CHARACTERS IN THE FILM. DEALING OR HAVING\n\n\n    SOMETHING TO DO WITH DIAMONDS OR THEFT. ONE SHOT AND SET UP\n\n\n    TAKES US SEAMLESSLY INTO ANOTHER SHOT AND SET UP. THIS GOES\n\n\n    ON FOR THE DURATION OF THE CREDITS. CUT BACK TO:\n\n\n\n\n    Franky Four Fingers opens a fancy case, presses a hidden\n    catch, this reveals a second wall within the case, he then\n    carefully places the stone within this secret compartment\n    and firmly closes the case. The Russian next to him is\n    playing with a revolver, he spins the chamber.\n\n                             RUSSIAN (CONT'D)\n\n                 If you need a man in London then\n                 call this number.\n    Franky takes the card looks at it and repeats the name.\n\n                           . FRANKY FOUR FINGERS\n\n                 Boris?\n\n                          RUSSIAN\n\n              Boris, Boris can get you anything\n              you need.\n\n                                 CUT TO:CU OF SPINNING GUN CHAMBER\n\n\n                                                                      :\n\n\n3   INT. LONDON - AMUSEMENT ARCADE -- DAY\n\n\n                                 C UT TO:CU OF SPINNING GUN CHAMBER\n\n\n\n\n    We are in the back room of an amusement arcade and can hear\n    fruit machines beeping in the distance. Meet BORIS THE BLADE\n    and TOMMY who is toying with a heavy-looking revolver.\n\n                             TOMMY\n\n                 It's a bit heavy isn't it Boris?\n\n                             BORIS\n\n                 Heavy is good. Heavy is reliable.\n                 If it doesn't work you can hit him\n                 with it.\n    Tommy practices a couple of gun slinging maneuvers. He's\n    impressed. At that moment the door opens and in walks a MAN\n    carrying two heavy sacks of coins. He's a rough looking\n    bastard, he's massive, and extremely ugly. Meet GORGEOUS\n\n    GEORGE.\n\n\n\n\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n3     CONTINUED:\n\n\n                            TOMMY\n\n                Yes Gorgeous?\n      George looks at the weapon and can see that he's interrupting.\n\n                            GORGEOUS GEORGE\n\n                Sorry Tommy, I hope that I am not\n                interrupting.\n\n                            TOMMY\n\n                Oh of course you're not interrupting\n                Gorgeous, I put the do not disturb\n                sign on the door because I wanted\n                you to join us.\n      George isn't too bright\n\n                            GORGEOUS GEORGE\n\n                What are you doing Tommy?\n\n                              TOMMY\n\n                I am baking a cake Gorgeous, not\n                that i t ' s any of your business. Put\n                the takings down, and be a good chap.\n    -. George puts down the coins. Tommy implies he should leave.\n       Gorgeous isn't too bright and continues to stand there looking\n       stupid. Tommy goes to turn around but can see that he hasn't\n       left, so he turns back,\n\n                            TOMMY (CONT'D)\n\n                Is there anything else Gorgeous, a\n                cup of tea perhaps? No? Well in\n                that could you kindly fuck off and\n                shut the door behind you?\n\n\n\n      Tommy turns round to Boris with a slight shake of his head.\n\n                            TOMMY (CONT'D)\n\n                Not too bright but he hits like a\n                train. OK I ' l l take it. You're a\n                gambling man Boris, so I'll toss you\n                for it. Heads it's mine, tails I'll\n                give you twice the price.\n      Boris chews this for a second.\n\n                                  BORIS\n\n                   I ' l l toss the coin.\n      He tosses the coin\n\n                                            CUT TO: CU OF SPINNING COIN\n\n\n\n\n\n4   INT. NEW YORK_OFFICE -- DAY\n\n\n\n\n\n                                        CUT TO :CU OF SPINNING COIN\n\n    Meet HANDS. On the phone. Cool young street wise NY diamond\n    dealer. He catches a coin.\n\n                          HANDS\n\n              Twenty carats?\n\n5   INT. HEATHROW AIRPORT -- DAY\n\n    Franky's on the phone.\n\n                          FRANKY FOUR FINGERS\n\n              Best stone I've seen in years.\n\n                          HANDS\n\n              Good man Franky, you done a good\n              job. What time you back?\n\n                          FRANK Y FOUR FINGERS\n\n              I gotta move the smaller stones here;\n              it shouldn't take me long. I ' l l be\n              a couple of days.\n\n                          HANDS\n\n              Speak to my cousin Doug.\n\n                          FRANKY FOUR FINGERS\n\n              Doug the Head?\n\n                           HANDS\n\n              Yeah, Doug the Head. But get some\n              security. I mean it, get it today,\n              speak to those Russians, they can\n              get you anything. And. . .\n\n\n\n    Dramatic pause\n\n                             FRANKY FOUR FINGERS\n\n              And what?\n\n                          HANDS\n\n              No fuckin around in any casinos, you\n              hear me? You've done a good job\n              Franky, don't go and fuck it up.\n\n                          FRANKY FOUR FINGERS\n\n              I hear ya Hands. I see ya Hands.\n    The phone goes down and Hands looks up at a COLLEAGUE.\n\n                             HANDS\n\n              He's got it.\n\n\n\n\n6   INT. BORIS1 HOUSE\n\n    On the phone subtitled\n\n                          RUSSIAN\n\n              Yes he's got it. He might call, he\n              might not, but if he does be ready.\n\n                            BORIS\n\n              I' l l see what I can do.\n\n                          RUSSIAN\n\n              He can't know that it's you Boris.\n              We do too much business together.\n              You're gonna have to get someone\n              else to hit him and there is no way\n              it can relate to us. You understand?\n\n                           BORIS\n\n              Yes I understand.\n\n                          RUSSIAN\n\n              One more thing, he loves to gamble.\n\n7   EX.T. BACK ALLEY MAKESHIFT BOXING RING -- DAY\n\n    BRICK TOP (aka MR MCLEAN) is a heavy looking fella. He is\n    observing a giant of a man, BOMBER HARRIS, boxing a sparring\n    partner.\n\n                          BRICK TOP\n\n              Two hundred and sixty pounds, that's\n              fucking pedigree pal.\n    He's talking to LIAM and GARY, a couple of employees.\n\n                          BRICK TOP (CONT'D)\n\n              He doesn't look bad does he?\n\n                          GARY\n\n              Oh no Mr Mclean, he looks great.\n\n                             LIAM\n\n              Yeah great.\n\n                          GARY\n\n              He'll kill him, he'll do you proud\n              governor.\n\n                          BRICK TOP\n\n              Do you reckon that's what people\n              should do for me, do you Gary, do me\n              proud?\n\n                          GARY\n\n              That's what you deserve Mr Mclean.\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n7   CONTINUED:\n\n\n                         BRICK TOP\n\n             Pull your tongue out of my arsehoie\n             Gary. Dogs do that, and you're not\n             a dog, are you Gary?\n    Taken aback by the change in tone.\n\n\n\n\n                         GARY\n\n             Err no, I am not.\n\n                         BRICK TOP\n\n             However, you do have all of the\n             characteristics of a dog Gary, all\n             except loyalty.\n    There is a definite change in temperature.\n\n                           BRICK TOP (CONT'D)\n\n             And people like dogs Gary, for the\n             principal reason that they're loyal.\n             So I don't quite know where that\n             leaves you my old son, other than\n             refuckinpugnant. . .\n    There is a problem\n\n                         BRICK TOP (CONT'D)\n\n             Which one was it that kept the four\n             grand from the Clapham job?\n    Pause\n\n                         BRICK TOP (CONT'D)\n\n             Don't let me ask again. I would\n             like answers, but I am not in the\n             mood for asking questions, get busy\n             lads, or it's feeding time, oink,\n             oink, know what I mean?\n    Liam takes a step to the side and moves his eyes in a sideways\n    action implying the guilt lies with Gary. Gary catches this\n    and opens his mouth to protest. One of Brick Tops's henchmen,\n    ERROL, sticks a belt in there as quick as it opens and smashes\n    a bar across Gary's legs, he buckles. The henchman man pulls\n    out a plastic bag and a roll of tape.\n\n                            BRICK TOP (CONT'D')\n\n                 You know what to do with that don't\n                 you Liam?\n\n    CUT TO FIGHTERS. SMALLER FIGHTER IS DISTRACTED.\n\n\n                             HARRIS\n\n                 Don't look for your sake.\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n7   CONTINUED:   (2)\n\n\n\n\n    POV of Smaller Fighter, we witness Liam putting the bag over\n    Gary's head and tying tape round his neck. Gary tries to\n    resist but it's futile and we vaguely witness the demise of\n    poor Gary.\n\n\n\n\n    CUT TO BRICK TOP\n\n\n                             BRICK TOP\n\n                 You're a ruthless cunt Liam, I' l l\n                 give you that.\n    Brick Top turns away at this point to admire his fighter.\n\n                             BRICK TOP (CONT'D)\n\n                 But I got no time for grasses.\n\n\n\n    We cut to see Liam's panic filled eyes. The bar comes down\n    again. Brick Top finds more interest in his fighter.\n\n                             BRICK TOP (CONT'D)\n\n                 Feed em to the pigs Errol.\n    With a short beat.\n\n                             BRICK TOP (CONT'D)\n\n                 He's looking good, Bomber, is he\n                 not? How's their man getting on?\n    We whip pan off Brick Top's boxing ring...\n\n8   EXT. ANOTHER BACK ALLEY MAKESHIFT BOXING RING - - DAY\n\n    ...And the whip pan shot takes us into this boxing ring.\n    Meet TURKISH, he is Tommy's partner. Turkish is older and\n    wiser than Tommy, they are both watching Gorgeous go through\n    his paces. Gorgeous George is head butting a heavy punch\n    bag. The sound that emanates is disturbing, and Tommy is\n    distracted.\n\n                             TOMMY\n\n                 Is he allowed to do that?\n    Turkish is drinking milk from a bottle\n\n                             TURKISH\n\n                 It's an unlicensed boxing match Tommy,\n                 not a tickling competition. These\n                 lads are out to hurt each other.\n\n                             GORGEOUS GEORGE\n\n                 Oi Turkish, can I have a drink?\n    Turkish looks over his shoulder and then points to himself\n                                                   v\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n8   CONTINUED:\n\n\n                          TURKISH\n\n              What do I look like to you George, a\n              fuckin water boy?\n    Turkish looks at the WATER BOY.\n\n                          TURKISH (CONT'D)\n\n              Oi son, look lively.\n\n\n\n    He turns .back to Tommy.\n\n                              TURKISH (CONT'D)\n\n              Look at it.\n\n\n\n    He turns to see the remnants of a caravan where they keep\n    the training gear and administration for the fights\n\n                          TURKISH (CONT'D)\n\n              How am I supposed to run this thing\n              from that? We gonna need a proper\n              office.\n    He looks at the caravan again and sighs, it is quite pitiful\n\n                          TURKISH (CONT'D)\n\n              I want a new one Tommy and you 're\n              going to buy it for me.\n\n                          TOMMY\n\n              What's wrong with this one?\n    Turning back to Tommy and ascending the steps in to his \"I\n    have seen better days\" caravan, TURKISH'S foot goes through\n    one of the stairs and the.door comes off at the hinges as he\n    tries to open it.\n\n                          TURKISH\n\n              Oh nothing Tommy, it's tip top, it's\n              just I am not sure about the colour.\n    He passes him a piece of paper\n\n                          TURKISH (CONT'D)\n\n              Here it's all arranged. You just\n              gotta pick it up. Here's an address.\n    Tommy looks at the address and frowns.\n\n                                TOMMY\n\n                 I t ' s that campsite.\n\n                             TURKISH\n\n                 That's right, you're buying a caravan,\n                 caravans live in campsites.\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\nCONTINUED:   (2).\n\n\n\n\n\n                          TOMMY\n\n             They aren't pikey are they?\n\n                         TURKISH\n\n             I don't know what they are, all I\n             know is they have a caravan, and we\n             want a Caravan.\n\n                         TOMMY\n\n             I hope they're not pikies.     I hate\n             fucking pikies.\n\n                          TURKISH\n\n             You're a sensitive boy, ain't you\n             Tommy? You got ten grand and I want\n             to see change.\nHe is distracted by the bulge in Tommy's trouser front.\n\n                         TURKISH (CONT'D)\n\n             Fuck me, hold tight, what's that?\n\n                         TOMMY\n\n             It's my Gucci belt, Turkish.\nPointing quite clearly at the gun.\n\n                         TURKISH\n\n             No Tommy, there's a gun in your\n             trousers. What is a gun doing in\n             your trousers?\n\n                          TOMMY\n\n             It's for protection.\n\n                         TURKISH\n\n             Protection from what, the Germans?\n             The war ended fifty years ago. Err\n             what's to stop it blowing your balls\n             off every time you sit down? Where\n             did you get it?\nLooking down onto his gun.\n\n                         TOMMY\n\n             Boris the Blade.\n\n                         TURKISH\n\n             You mean Boris the sneaky fucking\n             Russian.\nTurkish pulls the gun out of Tommy's front.\n\n\n\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n8   CONTINUED:   (3)\n\n\n\n\n\n                               TURKISH (CONT'D)\n\n                 I t ' s a bit heavy isn't it?\n\n\n\n    H e spins the chamber\n\n\n\n\n                                              CUT TO: CU OF GUN CHAMBER\n\n\n    INT. BORIS1 HOUSE -- DAY\n\n\n9\n\n\n\n\n\n                                              CUT TO: CU OF GUN CHAMBER\n\n\n                             BORIS\n\n                 The weight is a sign of reliability.\n                 I always go for reliability.\n    Boris is showing Franky a large pistol.\n\n                               FRANKY FOUR FINGERS\n\n                 I ' l l take it. How much do you want\n                 for -it?\n\n                             BORIS\n\n                 Nothing.\n    Pause\n\n                             FRANKY FOUR FINGERS\n\n                 Ok, so what do you want for it?\n\n                             BORIS\n\n                 I want you to do something for me .\n    Franky nods for him to go on .\n\n                             BORIS (CONT'D)\n\n                 There is a fight in a couple of days:\n\n                             FRANKY FOUR FINGERS\n\n                 What kind of a fight?\n\n                             BORIS\n\n                 Unlicensed boxing.\n    The camera tracks into Franky: he has a problem and it's\n    been exposed.\n\n                             BORIS (CONT'D)\n\n                 There is a bookies I know that will\n                 take bets. If you place one down\n                 for me we will call it quits.\n\n                             FRANKY FOUR FINGERS\n\n                 Why don't you put it down yourself?\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n9    CONTINUED:\n\n\n\n\n\n                              BORIS\n\n                  Well there isn't too many bookies\n                  that take those kind of bets, and I\n                  already have an outstanding debt\n                  with the house. I know something\n                  most don't. Why don't you put a few\n                  pounds down yourself?\n\n\n\n     Frankie shrugs and implies he wants to hear more.\n\n                               FRANKY FOUR FINGERS\n\n                  What do you mean?              ·\n\n10   INT. NEW YORK OFFICE --DAY\n\n     On the phone.\n\n                              HANDS\n\n                  Play the game Doug.\n\n11   INT. DOUG'S OFFICE\n\n\n\n\n     DOUG THE HEAD is an east London Jew, about forty five, almost\n     completely bald and proud of it, he sits with his two twin\n     daughters ALEX and SUSI - they look like Prada models but as\n     soon as they open their mouths, it's clear that they aren't,\n     they have extremely rough London accents. Doug is on the\n     phone to Hands.\n\n\n\n\n                                 DOUG\n\n                  I am playing the game Hands. That's\n                  what I ' l l give ya.\n     Hands shakes his head in disbelief.\n\n                              HANDS\n\n                  You gotta haggle fairly Doug,\n                  otherwise it'll make your hair fall\n                  out you'll see.                              .\n\n                              DOUG\n\n                  You know I won't buy poop.\n\n                              HANDS\n\n                  He isn't selling poop.\n\n                              DOUG\n\n                  Listen if the stones are kosher then\n                  I'll by em. Now I gotta business, to\n                  run.\n     He puts the phone down.\n\n\n\n\n\n\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n11   CONTINUED:\n\n\n\n\n\n                              DOUG (CONT'D)\n\n                  That was my cousin Hands, Have I\n                  told you about my cousin Hands?\n\n                              ALEX\n\n                  Yes Dad, you have.\n\n\n\n\n                              DOUG\n\n                  He's an important fella.\n\n                              SUSI,   .        .\n\n                  Yes Dad, you told us.\n\n                              ALE X\n\n                  Is that a prawn sandwich you're\n                  eating?\n     Doug looks mildly embarrassed\n\n                              DOUG\n\n                  Is it?\n\n                          ALEX\n\n              You're Jewish Dad.\n\n                             DOUG\n\n              Yes.     I was last time·I looked.\n\n                            ALEX\n\n              Well you can't eat shell fish, Dad,\n              i t ' s against your persuasion.\n\n                          DOUG\n\n              What persuasion myself or the prawns\n              belongs to is not the issue, the\n              issue is how a fuckin shrimp managed\n              to sneak in to' my sandwich.\n     Pause.\n\n                              DOUG (CONT'D)\n\n                  Sneaky bastards.\n\n\n\n     He throws the half eaten sandwich out the window.\n\n12   EXT. STREET OUTSIDE BOOKIES -- DAY\n\n\n\n\n     We cut to an enormous and frightening looking dog sniffing\n     the half eaten prawn sandwich, before he is yanked away by\n     his master. The dog is a lively young thing. We raise the\n     camera to see the man that is walking it. Meet VINNY. Vinny\n     is a very large black man - the size is due to dumplings not\n     dumbbells. He .stops outside a shop. We see it clearly.\n     I t ' s a pawnbrokers.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n12   CONTINUED:\n\n\n                                VINNY\n\n                  Move it, come on move\" i t .\n     Vinny enters the pawn shop.\n\n\n\n\n13   INT. PAWN BROKERS -- DAY\n\n\n\n\n     Meet SOL, who's behind the counter, Vinny's partner in the\n     pawn shop. He's concentrating on the deal at hand with BAD\n     BOY LINCOLN and has a stone-inspecting monocle to his eye.\n\n                              VINNY\n\n                  Alright Sol, Lincoln.\n     They are in deep discussion and only Lincoln responds.\n\n                                B AD BOY LINCOLN\n\n                  Vin.\n\n                              SOL\n\n                  It's a mosinite.\n\n                           BAD BOY LINCOLN\n\n               A whatinnite?\n\n                            SOL\n\n               No, a mosinite.\n\n                           BAD BOY LINCOLN\n\n               How much a night?\n\n                           SOL\n\n               No, a fuckin mosinite.            It's the\n               updated zirconia.\n\n                              BAD BOY LINCOLN\n\n                  Enough of bosinites and mosonias,\n                  talk English to me Sol?\n\n                              SOL\n\n                  Zirconias are artificial diamonds,\n                  they look pretty good to the novice\n                  like you Lincoln. But you could\n                  break them with a hammer, so they\n                  came up with mosinites.\n\n                              BAD BOY LINCOLN\n\n                  What are you saying?\n\n                              SOL\n\n                  I am saying it's worth fuck all.\n     Lincoln's face drops\n\n\n\n\n\n\n\n                                                       (CONTINUED)\n\n\n\n\n\n13   CONTINUED:\n\n\n\n\n\n                               BAD BOY LINCOLN\n\n                  Fuck what?\n\n                                .SOL\n\n                  I t ' s worth more than fuck what, but\n                  not a lot more.\n\n                              VINNY\n\n                  We have told you before Lincoln, you\n      ·           stick to being a gangster and leave\n                  this game to me and Sol.\n\n\n\n     Sol looks round properly at Vin and can see that he's\n     accompanied by a dog.        '\n\n                              SOL\n\n                  What's that Vince?\n\n                              VINNY\n\n                  Err, it's a dog Sol.\n\n                              SOL                                 '\n\n                  Where do you think you're going with\n                  that Vince?. You can't bring that\n                  thing in here.\n\n                              VINNY\n\n                  It's in here, what's the problem,\n                  it's only a dog.\n\n                          SOL\n\n              I know full fucking well what it is\n              Vin. Where did you get it?\n\n                          VINNY\n\n              Those gypsies, they threw it in with\n              a load of moody gold.\n     Sol considers this and decides it can't be all bad.\n\n                              SOL\n\n                  It better not be dangerous.\n\n                          VINNY\n\n              Does it look dangerous?\n\n                          SOL\n\n              Yes, it fucking does Vin.          If it so\n              much as farts it's out.\n\n                              VINNY\n\n                  If it farts we'll all be out.\n\n\n\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n13   CONTINUED:   (2)\n\n\n\n\n     Vin turns around and runs into Boris, who's entered the shop\n     without making a noise.\n\n                              VINNY (CONT'D)\n\n                  Jesus, where did you come from?\n\n                                 BORIS\n\n                  Uzbekistan.\n\n                              VINNY\n\n                  Oi Sol, Boris is here.\n\n                              SOL\n\n                  Boris, what's up?\n\n                              BORIS\n\n                  I have a job for you.\n\n                                 SOL\n\n                  Go on.\n\n                              BORIS\n\n                  I want you to hold up a bookies.\n\n                              SOL\n\n                  How high do you want us to hold it?\n                  Steady on George. We deal in\n                  jewellery Boris, we don't hold up\n                  bookies.\n     We can hear Vinny in the background\n\n                                 BORIS\n\n                  Hear me out.     This one is different.\n\n14   INT. TOMMY'S VAN -- DAY\n\n     Tommy is driving down a country lane with Gorgeous George in\n     the passenger seat.\n\n                               TOMMY\n\n                  Don't you worry Gorgeous, he's a big\n                  man granted but you gotta bigger\n                  punch than Judy.\n     Cut to a caravan camp site comes into view.        It's the PIKEY\n\n     ENCAMPMENT.\n\n\n                              GORGEOUS GEORGE\n\n                  Jesus what's that?\n\n                               TOMMY\n\n                  That's what we are looking for.\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n14   CONTINUED:\n\n\n                                GORGEOUS GEORGE\n\n                  I t ' s a camp site. It's a pikey\n                  campsite.\n\n                                TOMMY\n\n              Ten points.\n\n                          GORGEOUS GEORGE\n\n              What are we doing here?\n\n                          TOMMY\n\n              We are buying a caravan.\n\n                          GORGEOUS GEORGE\n\n              Off a pack of fucking pikies? What's\n              wrong with you? This'll get messy.\n\n                          TOMMY\n\n              Not if you're here.\n\n                          GORGE OUS GEORGE\n\n              Oh fuck off Tommy you never said\n              anything about pikies.\n\n                          TOMMY\n\n              Calm down, we are buying and then we\n              are off.\n\n                          GORGEOUS GEORGE\n\n              Oh you bastard, I hate fuckin pikies.\n     They arrive in the camp site and the car is immediately\n     surrounded by KIDS. The kids (most of whom are on bikes)\n     speak with a sort of Anglo-Irish mix that sounds as rough as\n     the kids look.         ,\n\n                          KID 1\n\n              That's a flash car Mister.\n\n                          TOMMY\n\n              Not as flash as your bike though is\n              it?\n\n                              KID 1\n\n                  Who you looking for?\n\n                                TOMMY\n\n                  Mr O'Neill.\n\n                              KID 1\n\n                  Do you want me to go and get him?\n\n                                TOMMY\n\n                  Good lad.\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n14   CONTINUED: (2_)                .\n\n\n\n\n     There is a pause, the boy doesn't move.\n\n                              TOMMY (CONT'D)\n\n                  Well are you going to go and get\n                  him?\n\n                                KID 1\n\n                  Yeah.\n     There is another pause.\n\n                              TOMMY\n\n                  Well what are you waiting for?\n\n\n\n\n                              KID 1\n\n                  The five quid you are going to pay\n                  me.\n     Chuckling.\n\n                              TOMMY\n\n                  Oh fuck off, I'll find him myself.\n\n                                KID 1\n\n                  Two fifty.\n\n                              TOMMY\n\n                  You can have a quid.\n\n                              KID 1\n\n                  Oh you're a tight fucker aren't ya?\n     A man shouts from the background. He's a young fella with a\n     hard but friendly face (when he smiles). He's covered in\n     grease and facial hair, and his trousers are done up with\n     string. But he's wearing a Cartier watch and Gucci shoes,\n     and a large gold identity bracelet. This is MICKY O'NEILL.\n\n                              MIC KY\n\n                  What are you doing Paul? Get out of\n                  the way boy. Are you Tommy, have\n                  you come about the caravan?\n\n                                TOMMY\n\n                  Mr O'Neill?\n\n                              MICKY\n\n                  Fuck man, call me Micky.\n     Micky comes up to the car, cleaning his grease covered hands\n     with a hand towel.\n\n                                TOMMY\n\n                  How are ya?\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n14   CONTINUED: ( 3 )\n\n\n\n\n\n                             MICKY\n\n                 I am well sir, well, quite well, the\n                 weather is being kind to us but the\n                 engines aren't.\n\n\n\n     Gorgeous George steps out of the car.      Micky takes a step\n     back.\n\n                             MICKY (CONT'D)\n\n                 Fuck me, would you look at the size\n                 of him, Jesus man how big are you?\n                 Hey kids how fucking big is he?\n\n                             KID 2\n\n                 He's a big man that's for sure.\n\n                             MICKY\n\n                 Would you look at the size of his\n                 muscles? And then look at the size\n                 of his fists. Hey Mum, come and\n                 look at the size of this fella.\n     The kids start to feel his arms. Gorgeous George plays the\n     game and raises the kids on his biceps. Micky's MUM comes\n     out to see.\n\n                             MICKY (CONT'D)\n\n                 Would you look at the strength of\n                 the man? I bet you can box a little\n                 can't you sir? You look like a boxer.\n\n                             MUM\n\n                 Get out of the way Micky and see if\n                 the fellas would like a drink.\n\n                             TOMMY\n\n                 I could murder one.\n\n                             MUM\n\n                 There won't be any murdering done\n                 around here, I don't mind telling\n                 ya.\n\n                             MICKY\n\n                 Would the big fella like a cup of\n                 tea?\n\n                             MUM\n\n                 Don't be silly Micky, a man didn't\n                 get that size from drinking cups of\n                 tea. Offer the man a Guiness boy.\n\n                             KID 2\n\n                 Lift me up would you Mister?\n\n                                                (CONTINUED)\n\n\n\n\n\n14   CONTINUED: ( 4 )\n\n\n\n\n\n                             KID 3\n\n                 I bet you can't lift us both at the\n                 same time.\n     Tommy and Gorgeous follow Micky who's walking past a kennel.\n     The dogs are in good condition, and are happy as you like to\n     see. Micky stops and gives one of them a stroke.\n\n                             MICKY\n\n                 Good dogs, do you like dogs?\n\n                             TOMMY\n\n                 Sure, yeah, I like dogs.   I like\n                 caravans more.\n\n15   INT. TYRONE'S CAR\n\n     We open on Vinny's dog, now sitting in a car, it's breathing\n     heavily and doesn't look well, and Sol doesn't see the funny\n     side of the dog sitting next to him. The man driving is\n     called TYRONE: he's a white guy who thinks he's black. Vin\n     is also in the car.\n\n                             TYRONE\n\n                 I don't want him dribbling on my             ,\n                 seats man.\n\n                             SOL\n\n                 Give him another of those biscuits.\n                 They shut him up.\n\n                             VINNY\n\n                 They give him wind.\n     Tyrone turns round to complain, and narrowly misses a car.\n\n                             VINNY (CONT'D)\n\n                 Hey watch the road! Fuck me, you\n                 want this man to drive us Sol? Can\n                 you drive mate?\n\n                             SOL\n\n                 No Vin, he can't tell the difference\n                 between a steering wheel and a man\n               . on the moon. That' s why I got him.\n     Sol gives the dog another biscuit.\n\n                             TYRONE\n\n                 Don't you worry about me, jus worry\n                 about the dog on my seats man!\n     Tyrone gets out of the car to put some petrol in.\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n15   CONTINUED:\n\n\n                           VINNY\n\n               Sol why's he talking like a black\n               man?\n\n                           SOL\n\n               I don't know Vin. Oi Tyrone, Vin\n               wants to know why you talk like a\n               black man?\n\n                           TYRONE\n\n               Roots and ting, seen?\n\n\n\n     Sol and Vin raise their eyebrows.\n\n                           VINNY\n\n               Roots and what?\n\n                           SOL\n\n               I don't know. You get that gun from\n               Boris?\n\n                           VINNY\n\n               Got it. It wasn't exactly what I\n               was expecting, mind. Mean looking\n               bastard though, that's for sure.\n     Sol unzips a bag.     Inside is a ridiculously powerful shotgun.\n\n                           SOL\n\n               What's that?\n\n                              VINNY\n\n                  It's a shotgun Sol.\n\n                             SOL\n\n               I t ' s a fuckin anti-aircraft gun Vin.\n               What are you planning on shooting,\n               the angels out of the clouds? That's\n               gonna raise more than pulses.\n\n                              VINNY\n\n                  It will raise hell my old son.\n\n                          SOL\n\n              I don't think I really want to see\n            · hell Vin. What's wrong with a normal\n              gun?\n\n                              VINNY\n\n                  The are psychological advantages to\n                  a gun that looks like it can perforate\n                  the moon.\n\n\n\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n15   CONTINUED: ( ? )\n\n\n\n\n     Tyrone gets into the car, starts it up again and puts some\n     money in the car wash machine.\n\n                             SOL\n\n                 Can you get this fuckin dog to stop\n                 dribbling on me?\n     Vin pulls the dog back.\n\n                              SOL (CONT'D)\n\n                 I worry about you Vin, Jesus, talk\n                 about overkill. One look at a crack\n                 desperate brother and you could wave\n                 a knife and fork around, and I am\n                 sure they would lick the salt of\n                 your scrotum.\n     The car wash starts.\n\n                             VINNY\n\n                 What the fuck are you doing?\n\n                             TYRONE\n\n                 I never do a job unless I have a\n                 clean car, I like to make my wheels\n                 look crisp.\n\n                             VINNY\n\n                 Are you serious,? You' re a getaway\n                 driver, you're not here to show your\n                 fuckin car off.               ··.\n     The machine starts. They do the windows up and that point\n     the dog lets out a fart. The water starts to hit the\n     windshield so they can't undo the windows. There is more an\n     atmosphere of disbelief than of concrete anger.\n\n16   EXT. CARAVAN CAMP SITE\n\n\n\n\n     Gorgeous George fastens the caravan to the back of their\n     Land Rover and pulls away. They wave at Micky and he\n     reciprocates.\n\n                             MICKY\n\n                 He's a good dog. He'll get a little\n                 homesick for a while but he'11 get\n                 over it.\n     Tommy has a dog that looks distressed about leaving Micky\n     sitting next to him.\n\n\n\n\n17   INT. CAR -- DAY\n\n\n                           TOMMY\n\n               I don't know what all your fuss was\n               about. They aren't bad fellas.\n     Just then the wheels of the caravan come straight off and\n     the caravan is dragged until the car comes to a sudden stop.\n     The dog jumps out the window and goes bounding back to the\n     campsite.\n\n18   EXT. CARAVAN -- DAY\n\n\n\n\n     They are looking at the damage.   Of course i t ' s completely\n     useless now.\n\n                          . GORGEOUS GEORGE\n\n               I don't think it's supposed to have\n               done that.\n\n19   EXT. CARAVAN CAMP SITE -- DAY\n\n\n\n\n     The dog is behind Micky's legs happy to be back.\n\n                           MICKY\n\n               The deal was you bought it how you\n               saw it.\n      Tommy goes to interrupt but he doesn't get a chance\n\n                           MICKY (CONT'D)\n\n               Look, I have helped ya as much as I\n               am gonna help ya. You still got a\n               car and I suggest you use it before\n               you're not welcome anymore.\n     There is a silence for a while. The atmosphere has gone\n     more than frosty and a few more gypsies are hanging around.\n\n                           GORGEOUS GEORGE\n\n               Hey...\n     Interrupted\n\n                           MICKY\n\n               It was only a question of time before\n               you got some attention. Nobody brings\n               a fella the size of you unless they\n               are trying to say something without\n               talking.\n\n                           TOMMY\n\n               Just give us my money and you can\n               keep your caravan.\n\n\n\n\n\n\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n19   CONTINUED:\n\n\n\n\n\n                               MICKY\n\n                  Why the fuck do I want a caravan\n                  that's got no fuckin wheels? I am\n                  not going to do that.\n\n\n\n     Gorgeous George steps forward.\n\n                              MICKY (CONT'D)\n\n                  Where the fuck do you think you're\n                  going? You want to settle this with\n                  a fight?\n\n                               MUM\n\n                  You'll do no such thing Michael.\n                  You'll...\n\n                              MICKY\n\n                  Alright Mum, we shan't, we'll settle\n                  it some other way, now don't get\n                  upset.\n\n                              MUM\n\n                  I won't have you fighting, Micky.\n     Micky's Mum is getting upset and it's consequently upsetting\n     Micky.\n\n                              MICKY\n\n                  Okay mum okay. You need to sit down.\n     Micky calls to one of the lads standing by.\n\n                              MICKY (CONT'D)\n\n                  Darren look after Mum. Get her\n                  sitting down.\n     We see Mum being led out by Darren; Micky looks genuinely\n     concerned for his mum. Pause as Micky waits for her to be\n     well gone.\n\n                                 MICKY (CONT'D)\n\n                  I ' l l fight you for it.\n\n\n\n     Tommy looks at Gorgeous George.        Gorgeous George raises his\n     eyebrows.\n\n20   INT. HORSE BOX, PIKEY CAMP -- DAY\n\n     The two fighters start pacing. It looks a bit ridiculous,\n     Micky is dwarfed by comparison. Gorgeous George takes a\n     swipe: it was an .impressive punch, but Micky is a quick littl\n     bastard and sidesteps. Micky does nothing to retaliate; his\n     hands are still by his,side.\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n20   CONTINUED:\n\n\n\n\n     Gorgeous George lunges out and grabs Micky by the throat and\n     groin, picks him up like a sack of spuds and throws him\n     against the car door. All eyes are on Micky for a second or\n     two, then he rises and appears little bothered by this, he\n     gets up brushes himself off and starts to pace again, hardly\n     even looking at the big man.\n\n                          GORGEOUS GEORGE\n\n              You want to stay down my friend, I\n              promise you, you want to stay down.\n     Micky ignores this and continues to pace, the big fella grabs\n     him and puts him in a headlock and charges him into the stable\n     door. There is a terrible noise.\n\n\n\n\n                          GORGEOUS GEORGE (CONT'D)\n\n              Now you fucking stay down boy or you\n              won't be coming up next time.\n     It appears as though this is going to get messy and any humour\n     that might have been around has now evaporated. Micky raises\n     his head there is still no damage to speak of. All of a\n     sudden he starts jumping up and down like he's warming up,\n     throwing a few shadow punches, taking off his shirt. This\n     reveals a heavily tattooed and scarred torso, and underneath\n     these embellishments is a physique that warrants some respect.\n\n                          GORGEOUS GEORGE (CONT'D)\n\n              This is sick. I am outta here.\n\n                          MICKY -\n\n              You're not going anywhere my friend.\n              You stay until the job is done.\n     Micky starts pacing, and throwing out a couple of shadow\n     punches with his back to Gorgeous George, he still hasn't\n     really acknowledged his opponent. Gorgeous George moves in\n     for the coup de grace, Micky spins on his feet and catches\n     the big man under the jaw.\n\n     CUT TO BLACK\n\n     FADE IN: We see Gorgeous George lying on the floor with a\n     head the size of a water melon. There is blood streaming\n     out of every orifice in his head - he's in.big trouble. We\n     are in slow motion;- there's a lot of activity going on around\n     the body on the floor, their mouths are open but we can't\n     hear what they are saying, all we can hear is the voice over\n     given by Tommy.\n\n\n\n\n                             TOMMY (V.O.)\n\n                  This isn't good, if George doesn't\n                  wake up in the next few minutes I\n\n                              (MORE)\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n20   CONTINUED: (2)\n\n\n\n\n\n                           TOMMY ( V . O . ) (CONT'D)\n\n               have a problem. I am scared, really\n               fuckin scared. There is something\n               coldblooded and practical about what\n               these people are thinking. They\n               will pop me like a hot sausage if\n               George doesn't wake up. Why do they\n               want to go to the trouble of\n               explaining why a man died in a\n               campsite? These people don't exist\n               in society, you can't find them,\n               they live under their own laws and\n               ignore everybody else's. I am scared,\n               I am really fuckin scared.\n\n\n\n\n21   INT. AMUSEMENT ARCADE 1 -- DAY\n\n     We see Turkish with a somewhat serious expression on his\n     face he has his customary pint of milk on one side, he takes\n     a sip and \"ohhhs\" and \"arrrs\" for a while.\n\n                          .TURKISH\n\n               So you're telling me he would have\n               run you through if Gorgeous hadn't\n               woken up?\n\n                           TOMMY\n\n               No, his Mum stopped it. If his Mum\n               hadn't turned up, well, I ' d be pikey\n               fuckin sausages.\n\n                           TURKISH\n\n               What were you thinking of? Why the\n               fuck did you put Gorgeous George\n               into a bare knuckle boxing match two\n               days before he had to fight the\n               Bomber?\n\n                           TOMMY\n\n               He was half his size.\n     He pantomimes a man that would reach his navel\n\n                           TOMMY (CONT'D)\n\n               I didn't expect him to get hurt.\n\n                           TURKISH\n\n               You put the man into a bare knuckle\n               boxing match.\n     He raises his voice\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                              (CONTINUED)\n\n\n\n\n\n21   CONTINUED:\n\n\n                           TURKISH (CONT'D)\n\n               What the fuck did you expect? A\n               grease down and a shiatsu?\n\n                           TOMMY\n\n               Who took the jam out of your donut?\n\n                          TURKISH\n\n              You took the fuckin jam out of my\n              donut Tommy, you did.\n\n                           TOMMY\n\n              You said get a good deal so...\n\n                          TURKISH\n\n              Tell me the correlation between a\n              hospitalized boxer and a good deal?\n     Pause there is no correlation as Tommy knows.\n\n                          TURKISH (CONT'D)\n\n              How are we going to explain to Brick\n              Top that his fight isn't going to              .\n              happen?\n\n                          TOMMY\n\n              We replace the fighter.\n\n                          TURKISH\n\n              Oh what, and hope he doesn't notice?\n              And who the fuck are we going to\n              replace him with?\n\n                          TOMMY\n\n              John \"The Gun?\" Or \"Mad Fist\" Willy?\n\n                          TURKISH\n\n              You're not exactly Mr Current Affairs,\n              are you Tommy? Mad Fist went mad,\n              and the \"Gun\" shot himself.\n\n                          TOMMY\n\n              What about Clam Hand Tony?\n\n                          TURKISH\n\n              Got his fingers caught in the till.\n              He's no good to anyone.\n\n                          TOMMY\n\n              Why not?\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n21   CONTINUED: (2)\n\n\n\n\n\n                             TURKISH\n\n                A bare .knuckle boxer isn't a lot of\n                good without any fuckin knuckles,\n                Tommy.\n     Pause for thought, then Turkish has the look of a man that\n     has come across a really bright idea.\n\n                             TURKISH (CONT'D)\n\n                Jesus!\n\n\n\n\n                             TOMMY\n\n                What?\n\n\n\n\n                            TURKISH\n\n                Let's use the fuckin pikey.\n\n22   INT. DOUG'S OFFICE -- DAY\n\n     Doug the Head and Franky Four Fingers are doing a deal.\n     Doug has a case open and is admiring a couple of stones.\n\n                            FRANKY FOUR FINGERS\n\n                From Russia with love. You\n                interested?                                .\n\n                            DOUG\n\n                I told you I was interested.\n     Pause.   Franky's in a rush.\n\n                           FRANKY FOUR FINGERS\n\n               I got stones to sell, fat to chew\n               and many different men to see about\n               many different dogs, so if I am not\n               rushing you, could you spit shine\n               the top of your smoothie and move a\n               little faster?\n\n                            DOUG\n\n                Hold tight Franky, when in Rome.\n\n                            FRANKY FOUR FINGERS\n\n                I am not in Rome Doug, I am in a\n                rush.\n     He looks at his watch\n\n                            FRANKY FOUR FINGERS (CONT'D)\n\n                I gotta make the bookies.\n\n\n\n\n                           DOUG\n\n                Bookies? What you betting on?\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n22   CONTINUED:\n\n\n\n\n\n                              FRANKY FOUR FINGERS\n\n                  Some guy called Bomber Harris.\n\n                              DOUG\n\n                  The unlicensed boxer? You know\n                  something I don't?\n\n                              FRANKY FOUR FINGERS\n\n                  Maybe.\n     Doug raises his eyebrows\n\n\n\n\n                              DOUG\n\n                  You get busy Franky. Put a couple\n                  of hundred down for me.\n\n23   INT. PIKEY ENCAMPMENT -- DAY\n\n\n\n\n\n                              TURKISH\n\n                  What do you say?\n\n                              MICKY\n\n                  How much you going to pay us?\n\n                              TOMMY\n\n                  Ten k.\n\n                              MICKY\n\n                  I lose more than that running for\n                  the bus. I ' l l do it for a caravan.\n\n                              TURKISH\n\n                  A what?\n\n                              MICKY\n\n                  No a caravan.\n\n                              TOMMY\n\n                  A what?\n\n                              M ICKY\n\n                  You are sitting in one if that makes\n                  things easier. I want a top caravan.\n\n                              TOMMY\n\n                  It was us that wanted a caravan.-\n                  Anyway what's wrong with this one?\n\n                              MICKY\n\n                  It's not for me, it ' s for me Mum.\n\n24   INT. DOUG'S OFFICE -- MORNING\n\n     Doug is on the phone to Hands.\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n24   CONTINUED:\n\n\n                           DOUG\n\n               I overpaid Hands, I want you to\n               recognize charity when i t ' s offered.\n\n                           HANDS\n\n               Do shut up, where is he now?\n\n                           DOUG\n\n               I don't know Hands, I ' m not his\n               mother. But I am seeing him later.\n\n                            HANDS\n\n               When?\n\n                          DOUG\n\n              He wants cash so he's coming back\n              after he has been to a fight.\n     There is a serious expression of alarm on Hands's face - the\n     camera crashes in.\n\n                          HANDS\n\n              What do you mean a fight, you mean a\n              boxing match? Is there gambling\n              involved?\n\n                             DOUG\n\n               I t ' s a boxing match Hands.\n     Hands isn't happy.\n\n                          HANDS\n\n              Did he have a case with him?\n\n                            DOUG\n\n              Yes.\n\n                          HANDS\n\n              And he's gone gambling? That's Franky\n              \"I have a problem with gambling\"\n              fuckin Four Fingers, you are talking\n              about Doug.\n\n                           DOUG\n\n               What am I, telepathic?\n\n                           HANDS\n\n               Franky is good at buying stones Doug\n               but he's a fuckin liability when it\n               comes to gambling. That has cost\n               me. So in turn rit' s cost him. He\n               gets distracted and chopping off a\n               digit seems to focus his attention.\n\n\n\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n24   CONTINUED: ( 2 )\n\n\n\n\n\n                             DOUG\n\n                 How much can he lose?\n     Hands pulls a face like \"what kind of a stupid question is\n     that?\" He them starts to shout\n\n                               HANDS\n\n                 I ' l l not forgive you Doug, I am coming\n                 over, get me that car.\n     The phone is slammed down.\n\n\n\n\n                                                                   CUT TO:\n\n\n25   EXT. AIRPLANE --\n\n\n\n\n     We see the undercarriage of Concorde taking off.\n\n26   INT. BRICK TOP'S PUB --\n\n\n\n\n     Tommy and Turkish walk into a pub and approach the BARMAN.\n     They reach the bar.    .            .\n\n                             TURKISH\n\n                 We are here to see Brick Top.\n     The barman looks them up and down a bit.      He's not doing\n     anything.\n\n                             BARMAN\n\n                 I am very busy at the moment.\n\n                             TURKISH                           ·\n\n                 I am not asking you to break sweat,\n               . I am asking you to call Brick Top.\n\n                              BARMAN\n\n                 Who?\n\n                              TURKISH\n\n                 Brick Top.\n\n                             BARMAN\n\n                 Never heard of him.\n\n                       . ... : TURKISH               :\n\n                 Well make a call and see if someone\n                 else has. Say it's Turkish.\n     The barman looks bothered by the fact he has to move but\n     wanders off. Turkish looks at the pool table.\n\n\n\n\n\n\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n26   CONTINUED:\n\n\n                              TURKISH (CONT'D)\n\n                  You know what he's done to people on\n                  that pool table?\n     They both give the table an eyeball.\n\n\n\n\n                              TOMMY\n\n                  What, potted more balls than any\n                  other player? What else can you do\n                  to people on a pool table?\n\n                              TURKISH\n\n                  Quite a fuckin lot if you nail 'em\n                  to it.\n\n\n\n     TWO HEAVY LOOKING FELLAS appear out of the woodwork.\n\n                              HEAVY FELLA\n\n                  You Turkish?\n\n                               TURKISH\n\n                  Yup.   -\n\n                               HEAVY FELLA\n\n                  Follow me.\n     The heavy fella opens up the bar and beckons Turkish and\n     Tommy through. They go through another door and the corridor\n     turns into a mass of dogs barking, snarling 'and whining in\n     cages. The mood is sinister..they reach another door, they\n     open up and we are introduced to a dog fight. A load of\n     HEAVY GEEZERS are commenting on the performance of the dogs,\n     one dog is being carried out by a single leg, it's covered\n     in blood. Another dog is left in the ring, it too is covered\n     in blood but it's survived.\n\n                               TURKISH\n\n                  They can charm the paint off walls\n                  these fellas.\n\n27   INT. BACK OF PUB - DOG FIGHT -- NIGHT\n\n     A circle of blunt faces are exchanging money with one another\n     A few faces turn round to examine Tommy and Turkish, they\n     frown slightly but carry on about their business once they\n     see they are accompanied by the muscle.\n     The heavy walks over to Brick Top. The heavy taps him on\n     the shoulder and whispers. He acknowledges, and gives his\n     drink to the heavy. He walks over. There is a cage next to\n     Brick Top which has a pit bull in, and Brick Top who is\n     carrying a cane pokes it through the cage doors. The dog\n     snarls back.\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n27   CONTINUED:\n\n\n                           BRICK TOP\n\n               Look mean now you hairy fucker won't\n               ya?\n     He looks at the appalled faces of Turkish and Tommy.\n\n                           BRICK TOP (CONT'D)\n\n               Shits itself when you put it in the\n               ring, but poke .it with a stick and\n               watch his bollocks grow. You like a\n               dog fight, Turkish?\n\n                           TURKISH\n\n               I like my dog to growl at the post\n               man.\n\n                           BRICK TOP\n\n               Gorgeous ready for tonight?\n\n                           TURKISH\n\n               We don'c have a Gorgeous anymore.\n     Brick Top turns round and indicates that he would like the\n     noise around him to drop. It does marginally.\n\n                           BRICK TOP\n\n               You're going to have to repeat that.\n\n                           TURKISH\n\n               We have lost Gorgeous George.\n     Brick Top turns round again at the already subdued crowd, he\n     doesn't raise his voice but the crowd reacts.\n\n                               BRICK TOP\n\n                  I said keep the noise down.. . .\n     A tangible silence between the men reflects Brick Top's\n     authority.\n\n                              BRICK TOP (CONT'D)\n\n                  Well, where did you lose him? He\n                  isn't a set of fuckin car keys is\n                  he? And it's not as though he is\n                  inconfuckinspicuous is it?\n\n                              TURKISH\n\n                  I am not backing out.\n\n                              BRICK TOP\n\n                  You can bet your bollocks to a barn\n                  dance you're not backing out.\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n27   CONTINUED: .(2)\n\n\n\n\n\n                            TOMMY\n\n                We are changing the fighter.\n     Brick Top wasn't expecting anything out of Tommy.\n\n\n\n\n                            BRICK TOP\n\n                Oh fuck me your lady friend has got\n                a voice. And who might you be\n                changing him to, sweetheart?\n\n                            TURKISH\n\n                You won't know him.\n     Pause: a look of you're kidding comes over his face.\n\n\n\n\n                            BRICK TOP\n\n                Are you taking the piss?\n\n                            TURKISH\n\n                No, there was an accident.\n\n                            BRICK TOP\n\n                I'll show you a fuckin accident.\n\n                            TURKISH\n\n                You've still got your fight.\n\n                            BRICK TOP\n\n                No, I lose all bets at the bookies.\n                You can't change fighters at the\n                last minute, so no, I don't have my\n                fight do I, you fuckin prat!\n\n                            TOMMY\n\n                You could take bets at the fight.\n\n                            BRICK TOP\n\n                Put a lead on her Turkish,     Before\n                she gets bitten.\n     Pause\n\n                            BRICK TOP (CONT'D)\n\n                Make sure your man goes down in the\n                fourth. You're on thin fuckin ice\n                my pedigree chums and I'll be there\n                if it breaks.\n\n28   EXT. BOOKIES\n\n     The black guys pull up in'Tyrone's car outside the bookies\n     Vin is playing with the dog in the back.\n\n\n\n\n\n\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n28   CONTINUED:\n\n\n                           SOL\n\n               I am not happy about that dog Vin,\n               you can't bring a dog on a job.\n\n                           VINNY\n\n               You can't leave him on his own, not\n               to begin with, he gets homesick.\n\n                           SOL\n\n               Homesick, for fucks sake.\n\n                           VINNY\n\n               He does. If he gets the chance he\n               runs back to the gypsies' campsite.\n\n                           SOL\n\n               Ohh shut up, how can he find it?\n\n                           VINNY\n\n               I don't know Sol, I am not a dog.\n               Ask him. It' s like he's got a fuckin\n               homing beacon. Give him the chance\n               and he's off.\n\n                           SOL\n\n               You're going soft Vin? Here pass me\n               a sandwich.\n     Vin throws a sandwich to Sol but the dog catches it whilst\n     i t ' s in flight and swallows it in one gulp.\n\n                           SOL (CONT'D)\n\n               Jessssus, he didn't even chew it.\n     The car has stopped.\n\n                           VINNY\n\n               What have you stopped here for?\n               What's wrong with that space?\n\n                              TYRONE\n\n                  It's too tight.\n\n                           VINNY\n\n               What are you talking about, tight?\n               You could land a jumbo fuckin jet in\n               there.\n\n                              SOL\n\n                  Leave him alone, he's a natural.\n     Tyrone gets a little over-excited with the accelerator and\n     reverses with a crashing sound into the rear of the van behin\n     them (ie it:s parked back to back with them).\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n28    CONTINUED: ( 2 )\n\n\n\n\n\n                              VINNY\n\n                  A natural fuckin idiot.    Tyrone,\n                  what have you done?\n\n                              TYRONE\n\n                  Look, you hassle me, see what happens.\n       Tyrone makes to move the van forward again.\n\n                              VINNY\n\n                  Well don't move it now, otherwise\n                  people will see the damage. What\n                  did you do that for?                        ^\n\n                              TYRONE\n\n                  I didn't see it there.\n\n                              VINNY\n\n                  Eh? It's a four ton truck. It' s\n                  not as though i t ' s a ferret fuckin a\n                  flea is it?\n\n                              TYRONE\n\n                  It was at a funny angle.\n      Vin is confused as to this last statement.\n\n                              VINNY\n\n                  Funny angle? It was behind you\n                  Tyrone, whenever you reverse things\n                  come from behind you. I am not happy\n                  Sol.\n     - The dog starts whining.\n\n                              VINNY (CONT'D)\n\n                  Give him something to shut him up.\n\n\n\n       Sol throws a plastic squeaky dog ball that was in the front.\n       The dog grabs in and swallows it in one gulp. The brothers\n       look on in shock.\n\n                              SOL\n\n                  He can't swallow a whole ball.\n\n                              TYRONE\n\n                  He swallowed it.\n       The dog looks up having completed the task. Vin who looks\n       quite alarmed holds the dog by the ribs and squeezes, there\n       is a squeak.\n\n\n\n\n29   EXT. AIRPORT. --\n\n     Doug and Alex are waiting to pick- up Hands.\n\n                           DOUG\n\n               Did you get Hands that car?\n\n                           ALEX\n\n               I got him one like it.\n     Doug is in shock.\n\n                           DOUG\n\n               What do you mean one like it?\n\n                           ALEX\n\n               I got him the Volante.\n\n                           DOUG\n\n               What did I say? What exactly did I\n               say?\n\n                           ALEX\n\n               You said get him the Vantage.\n\n                           DOUG\n\n               That's right, I clearly said get him\n               the Vantage. So why did you get the\n               Volante?                                      ;\n\n                           ALEX\n\n               Because they look the same.\n\n                           DOUG\n\n               The Septuagint scholars mistranslated\n               the Hebrew word for \"young woman\" in\n               to the Greek word for \"virgin\",\n               because they thought they looked the\n               same, coming up with the prophecy\n               \"behold a virgin shall conceive and\n               bear a son\". But there is a world\n               of difference between a virgin and a\n               young woman like there is between a\n               Volante and a fuckin Vantage.\n     '.Pause: she thinks about this.\n\n                           ALEX\n\n               Are you saying that the fact that\n               your cousin Hands is driving a Valiant\n               instead of a Vantage is a profound a\n               mistake as a whole religion?\n\n                           DOUG\n\n               Yes I fuckin am!\n\n                           (MORE)\n\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n29   CONTINUED ·\n\n\n\n\n\n                               DOUG (CONT'D)\n\n                   Cars are his religion. He can drive\n                   a Valiant in the States but I can't\n                   drive a Vantage because they won't\n                   tolerate the emissions. Well, it's\n                   too late now, that's Concorde.\n\n     SHOT OF CONCORDE'S WHEELS TOUCHING DOWN\n\n\n30   EXT. AIRPORT -- DAY\n\n\n\n\n     Hands and his sidekick Rosebud are coming out of the sliding\n     glass doors towards Doug who's now standing by the car with\n     his arms crossed. Hands is quite clearly looking for a car.\n\n                               DOUG\n\n                   How about a hug for your old cousin\n                   Doug?\n     He stops looking for his car and focuses on Doug.\n\n                              · HANDS\n\n                   Fuck off you fat bald bastard - and\n                   where's my car?\n\n31   EXT. BOOKIES\n\n     The black guys are sitting in the car still.         The occasional\n     squeak comes from the dog.\n\n                               VINNY\n\n                   How am I going to get it out?\n\n                               SOL\n\n                   He'll probably cough it up.\n\n                               VINNY\n\n                   Do you think he'll be alright?\n     Sol shrugs.\n\n                               SOL\n\n                   Hope not.\n\n                               TYRONE\n\n                   What are we waiting for?\n\n                               SOL\n\n                   We are waiting for a man carrying a\n                   case.\n\n                                                      (\n\n\n                               TYRONE\n\n                   Why?\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n31   CONTINUED:\n\n\n                              SOL\n\n                  Because the deal is that we give the\n                  Russian the case and we keep the\n                  money.\n     He rubs his fingers symbolically together\n\n\n\n\n                              TYRONE\n\n                  What's in the case?\n     Sol turns round to talk to Tyrone.\n\n                              SOL\n\n                  Fuckin 'ell Tyrone you ask a lot of\n                  questions. You concentrate on the\n                  driving okay?\n     He turns back just as a MAN is stepping into the bookies: he\n     is carrying a case.\n\n                              SOL (CONT'D)\n\n                  Shit, was that him?\n\n          .'               VINNY\n\n               Don't ask me, you're the one supposed\n               to keep an eye on it. How many\n               fingers did he have?\n\n                           SOL\n\n               Are you serious? I am sorry but I\n               couldn't get the binoculars out in\n               time.\n\n                           VINNY\n\n               Well let's not stand on ceremony,\n               let's start the show.\n     They get out of the van and go up to the bookies, leaving\n     Tyrone in the van. There's a double set of glass doors.\n     Sol pushes them open, and Vinny walks in first, while Sol\n     hangs back with the shotgun.\n\n32   INT. BOOKIES -- DAY\n\n     Inside is the MAN with the case, busy filling in a slip, and\n     TWO CLERKS behind the betting counter. Vinny doesn't mince\n     around and goes straight to the counter, where the HEAD CLERK\n     PAULINE, comes up to help.\n\n                              PAULINE\n\n                  Yes sir, how can I help?\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n32   CONTINUED:\n\n\n\n\n\n                          VINNY\n\n              You can start by giving me all your\n              money.\n\n\n\n\n                          PAULINE\n\n              Does Sir know who this bookies belongs\n              to?\n\n                               VINNY\n\n                  It. belongs to me now.\n     Vinny then leans over the counter to get menacing.              Pauline\n     looks more than a little concerned\n\n                              VINNY (CONT'D)\n\n                  If you know what's good for...\n     He is cut short, as Pauline triggers a button under the\n     counter and a security screen comes flying up at a very rapid\n     rate of knots protecting all the counters. This has the\n     unfortunate consequence of taking Vinny with it. Poor Vin\n     is shot straight to the ceiling, all we can see is half a\n     body and his desperately searching for ground legs. Needless\n     to say this leaves Sol in a bit of a bewildered state. He's\n     looking the wrong way at the critical moment and is left\n     wondering what happened, not having seen Vince impaled on\n     the ceiling. Sol extracts the enormous shotgun.\n\n\n\n\n                           SOL\n\n              Vi nce ? Vince??\n     He spins round looking for his colleague. A muffled noise\n     tells him to look up.     ,\n\n                          SOL (CONT'D)                           .\n\n              What are you doing Vince? And what\n              the fuck are you doing up there?\n     A few groans emanate from the other side of the counter.\n     Sol panics some more, and decides that emergency action is\n     called for.                               .\n\n                              SOL (CONT'D)\n\n                  I have got your man out here. If\n                  you don't put down the screen I'll\n                  blow his fucking head off! You hear\n                  me?\n\n                              PAULINE ( O . S . )\n\n                  I don't care, you can do what you\n                  like he's not related to me.\n\n                              SOL\n\n                  You think you can try me?\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n32   CONTINUED: (2.)\n\n\n\n\n     Sol raises the gun and fires into the side .of- the wall.\n     There's an enormous explosion and a clear hole is made in\n     the side of the wall. The powerful kick from the gun also\n     makes Sol momentarily airborne.\n\n\n\n\n33   EXT. BLACK GUYS' VAN -- DAY\n\n\n\n\n     We see Tyrone grimace at the sound of the shotgun.\n\n34   INT. BOOKIES -- DAY\n\n\n\n\n     Sol pulls himself together and marches up to the hole in the\n     wall that the shot created and pokes the gun through.\n\n                            SOL\n\n                Drop the screen now! You just seen\n                what it did to this wall so think\n                what it could do to you.\n     Pauline knows she has lost this one and looks genuinely\n     scared.\n\n                               PAULINE\n\n                     (to the other clerk)\n               . Do it. . . . I said do it.\n     The screen comes down with a thud. This means that Vince\n     comes down with just as serious a thud. He lets out another\n     groan.\n\n                            SOL\n\n                How you doing Vince?\n     A weakened voice retorts.\n\n                            VINNY\n\n                How do I look like I am doing you\n                fucking idiot? I would be doing a\n                lot better if you would stop using\n                my name.\n     Consoled that his colleague is not dead it's back to business\n     for Sol. He raises the gun and pulls his fiercest face.\n\n                                SOL\n\n                Now fill this bag. . . ' . - . -\n\n                            PAULINE\n\n                All bets are off.\n\n                            SOL\n\n                I am not here to make a fuckin bet.\n\n\n\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n34   CONTINUED:\n\n\n\n\n\n                            PAULINE\n\n               All bets are off.\n\n                           SOL\n\n               Are you fuckin stupid? I don't care\n               if the fuckin bets are off. I want...\n\n                           PAULINE\n\n               If all bets are off then there can't\n               be any money, can there?\n     There is a pause. Sol knows he's fucked. She points to a\n     black board that clearly states \"ALL BETS ARE OFF\"\n\n                            SOL\n\n               I ain't buying that.\n\n                           PAULINE\n\n               I ain't fuckin selling it, it's a\n               fact!                                         . ''.\n     Pause\n\n                            SOL\n\n               Well, what have you got?\n\n                            PAULINE\n\n               Nothing, I mean we got a few coins\n               but no notes.\n\n                           VINNY\n\n               Can we just get out of here please.\n               I am not feeling too funny.\n     Sol's temper does have a limit.\n\n                           SOL\n\n               Well I am not feeling too fucking\n               funny myself, let me tell you!\n     Sol points at the man on the floor who is carrying the case.\n\n                              SOL (CONT'D)\n\n                  Let me see your hands.\n     The man holds his hands up. He has got a perfect set of\n     five fingers on both hands. Sol puts his head in his hands.\n     Pauline and the other clerk put two bags full of coins on\n     the counter. Sol picks them up and frowns, he's not happy\n     with a bag full of change. He puts his gun down and starts\n     to rifle through the bag. Pauline can see Vinny's pistol on\n     the counter, dropped after his encounter with the screen.\n\n\n\n\n\n\n\n\n\n\n                                              (CONTINUED)\n\n\n\n\n\n34   CONTINUED: (2.)\n\n\n\n\n\n                            SOL (CONT.'D)\n\n                Copper coins?   What do you mean copper\n                fuckin coins?\n     Pauline sees her opportunity and grabs the pistol. Sol .goes\n     for it too, but he's beaten to it. Sol ducks, pulling Vince\n     with him, Pauline lets out a series of shots in their\n     direction, Sol counter blasts over the top of the counter.\n     The security screen comes flying back up.\n\n                            VINNY                             .\n\n                Get me out of here now Sol.\n     Vinny does sound convincingly desperate.\n\n                            SOL\n\n                We're going Vin.\n     He grabs the bag of copper coins, grabs Vince and marches\n     towards the double'doors. They open the first set and then\n     they try to open the second. They push the door nothing\n     happens. There is no going back. Sol starts to kick the\n     glass door, but it doesn't budge. With panic rising swiftly,\n     Sol doesn't fuck around he takes aim with the handgun and\n     fires, the bullet shatters the glass but it doesn't break\n     through, and the bullet now ricochets off both glass doors\n     shattering bullet-proof glass all around them. Vinny's panic\n     filled eyes attempt to follow its trajectory. Sol is unaware\n     of the ricochet and before Vin has time to warn him, Sol\n     fires another bullet. Now he observes the problem and waits\n     for the inevitable. The bullet tears through the bag of\n     coins, which then empties its contents at Vin's and Sol's\n     feet. Eventually the bullet hits poor Vince in the thigh.\n     Sol sinks to the floor, he has given up. Amongst the yells\n     emanating from Vince we can hear Sol's pathetic and desperate\n     whimpering.\n\n\n\n\n                            SOL (CONT'D)\n\n                No security, eh?\n     At that point Tyrone appears and pushes the door open. The\n     door was open the whole time - only Sol was pushing it the\n\n                                                    ,,   ·    '\n\n     wrong way.\n\n                            TYRONE\n\n                What the fuck are you two doing?\n     They stumble out into the street. Vinny is in big trouble.\n     They throw him into the van. Just as Sol gets into the back,\n     we hear kicking noises on metal from the van behind. Tyrone\n     pulls out. And the rear doors of the van behind them fly\n     open. Franky Four Fingers appears from the back of this ·\n     van. He was locked in due to the fact that the black guys'\n     van was blocking his exit.\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n34   CONTINUED:   (3.)\n\n\n\n\n\n                              SOL\n\n                  Tyrone get us outta here.\n     Tyrone takes an interest in the man from the van (ie Franky)\n     seeing that he's carrying a case and the case is connected\n     to his wrist.\n\n                              SOL (CONT'D)\n\n                  I said, get us outta here Tyrone!\n\n35   EXT. CAESARS PALACE STREATHAM\n\n\n\n\n     The Aston Martin comes to a screeching halt outside. Doug\n     is quite pale from the ride. Hands looks almost satisfied\n     with the car.\n\n                                HANDS\n\n          ...-.!         gotta say it's not bad.\n     He then looks at the sign of the rundown venue, his eyes\n     squint incredulously.\n\n                              HANDS (CONT'D)\n\n                  Caesar's Palace?\n\n36   INT. CAESARS PALACE STREATHAM\n\n     Doug approaches the entrance.\n\n                              DOORMAN\n\n                  Private night tonight chaps.\n     Doug passes him a ticket. The doorman steps to the side.\n     They continue to walk past several other doorman who all\n     inspect the ticket.\n\n                              HANDS\n\n                  Jesus are we ever going to get in\n                  there?\n\n                              DOUG\n\n                  You gotta understand that this isn't\n                  exactly Vegas and it's not exactly\n                  legal.\n\n                              HANDS\n\n                  I am not looking for Vegas, Doug, I\n                  am looking for Franky Four Fingers.\n\n                              DOUG\n\n                  Well he said he was going to be here.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n36   CONTINUED:     .\n\n\n                              HANDS\n\n                  If there's gambling involved, he'll\n                  be here.\n     They get nudged aside by an entourage of men coming through.\n\n                              HANDS (CONT'D)\n\n                  Hello, who's your man?\n     Hands points out Brick Top who is being crowded by minders.\n\n                              DOUG\n\n                  Horrible bastard, it's his fight,\n                  made all his money in.\n\n\n\n     He touches the side of his nose and inhales.\n\n                               HANDS\n\n                  Original.\n\n                              DOUG\n\n                  So he doesn't need to do this, but\n                  he's got dark taste for fights and\n                  blood, he wants to impress London's\n                  criminal royalty..\n     He points out JACK \"THE ALL SEEING EYE\" and SALT PETER:\n     they are surrounded by heavies.\n\n                               DOUG (CONT'D)\n\n                  ..with a tip on when who hits the\n                  floor. Any man with veins in his\n                  brains knows Brick Top knows the\n                  answer.\n     Cut back to Jack and Salt Pete.\n\n                               DOUG (CONT'D)\n\n                  Those boys make Brick top look like\n                  a skirt clinging thumb sucker. And\n                  i f y o u p l a y wi t h f i r e . . . ·\n     Cut to a few still shots of atrocities committed by the men\n     in question.                                              ,\n\n\n\n\n                                           .:   CUT TO: TURKISH & MICKY\n\n\n                              TURKISH\n\n                  So Michael, you got it clear? It's\n                  the fourth round. I'll tap you anyway\n                  to let you know when to go down.\n\n\n\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n36   CONTINUED: ( 2 )\n\n\n\n\n\n                               MICKY\n\n                   Just make sure the man doesn't kill\n                   me before the fuckin fourth.\n\n                                                CUT TO:BRICK TOP & ERROL\n\n\n               :\n\n\n\n\n\n\n\n\n                               BRICK TOP\n\n                   As long as we keep them happy.\n     Brick Top nods at Jack and Salt Peter, they nod back.\n\n                               BRICK TOP (CONT'D)\n\n                   Make sure they are kept sweet. The\n                   last thing I want is them fuckin\n                   moaning.\n\n37   INT. BOXING RING -- NIGHT\n\n\n                               REF           .'·\n\n                   In the blue corner I have the young\n                   and only unchallenged cutthroat of\n                   calamity, meaner than Beelzebub's\n                   conscience cleaner. Give it up for\n                   the bone crunching one punch machine\n                   gun -- Micky.\n     A murky sound of displeasure emanates round the arena.         The\n     audience don't know who he is and don't care either.\n\n                               R EF (CONT'D)\n\n                   And in the other corner a man that\n                   needs no introduction to destruction,\n                   the solo warrior of Walthamstow,\n                   sometimes known as Buckshot Peter,\n                   or sometimes known as the dictator .\n                   to the devastator, he put the ' e ' in\n                   eradicate, the ' o ' in obliterate and\n                   the ' a 1 in annihilate, you know this\n                   monster of a monster, the sinister\n                   prime minister.. . . \"Bomber the\n                   \"mad man\" Harris\"!\n     The audience goes mad. It's hard to tell whether it's out\n     of affectionate enthusiasm or just enthusiasm.\n\n                                R EF (CONT'D)\n\n                   Now I want a good dirty fight lads,\n                   So now it's that time again.. . .\n                   Let's. . . . Get ready to\n                   rrrrrrummmmmble.\n     The two come out to fight. Bomber Harris lifts his monster\n     hands to do damage. They pace each other for a second.\n     Then Micky lets one go.                                                                     ( CONTIN UED)\n\n\n\n\n\n37   CONTINUED:\n\n     It hits Bomber Harris square on the jaw this has the effect\n     of forcing blood out of his ears the man is positively out\n     cold. We crashtrack into various characters' reactions:\n     Brick Top, Turkish and Tommy etc. All are in shock. The\n     ref (who is obviously paid off as well) tries to resuscitate\n     Harris/ but it's not happening, he catches a look of\n     desperation from one of the villains and is eventually left\n     with little choice but to hold Micky's hand up. We cut to\n     the nasty looking characters that we saw before they have\n     approached with their heavies, and they are obviously not\n     satisfied.            .\n\n                              SALT PETER\n\n                  Tha-nks for the tip, Brick top.\n\n                              JACK THE ALL SEEING EYE\n\n                  I have just said goodbye to forty\n                  large because of you, what's the\n                  crack?\n\n                                                                    :\n\n\n38   EXT. STREET OUTSIDE BOOKIES -- DAY\n\n\n\n\n     (NB: the first half of this scene happens about midway scene\n     28 - as Tyrone parks the van )\n     We cut back to Frankie Four Fingers getting out of his van.\n     He takes a quick look around and enters the back of his van.\n     There he raises the spare tire and picks up his gun, he\n     examines it and places it in his trouser front. He then\n     turns to exit. At which point there is a loud smash and\n     Franky is knocked backwards (as Tyrone hits his van).\n\n     WE CUT TO BLACK.                  '\n\n\n     WE FADE UP\n\n     (Time-wise, we're now at the end of scene 34)\n     Frankie wakes up. He has a trickle of blood dripping down\n     the back of his neck, he looks at his watch and panics. He\n     kicks the doors a couple of times - nothing happens, but on\n     the third kick the doors spring open. Franky brushes himself\n     off and makes his way to the bookies.\n\n39   EXT. STREET OUTSIDE BOOKIES --DAY\n\n\n\n\n     We cut to Tyrone. Tyrone clocks the case attached to Franky'\n     wrist. Gets out and slams the end of the gun across Franky\n     Four Fingers' head. He falls to the ground. Tyrone tries\n     to take the case off him but i t ' s handcuffed to his wrist.\n     So he has little choice but to pick him up and throw him in\n     to the back of the car with the other two.\n\n\n\n\n40   INT. PAWN BROKERS -- DAY\n\n     We cut to the   black guys trying to open the case. They have\n     Franky's hand   up on a desk and are fiddling with the handcuff,\n     whatever they   are trying to break in with snaps off. Vinny\n     is frustrated   and illustrates his dissatisfaction.\n\n                            SOL\n\n               Where ' s the Russian?\n\n                           VINNY\n\n               He should be here in a minute.     Well\n               get him to open it.\n     Vinny turns to Franky who has tape over his eyes.\n\n                            VINNY (CONT'D)\n\n              Oi, you, Four Fingers, how are we\n              going to get into your case?\n\n                           FRANKY THREE FINGERS\n\n               If you take the tape off my eyes ·\n               I Ml tell you.\n\n                          SOL\n\n              What do you need the tape off your\n              eyes for? You talk out of them?\n\n                 ·        VINNY\n\n              Just tell us the combination.\n\n                          FRANKY THREE FINGERS\n\n              I can't remember the combination I\n              can only do it if I see it .\n     Pause\n\n                          VINNY\n\n              You look at us and it's good night.\n     Vinny takes it off. Franky blinks at the revelation of light.\n     And gets busy opening the case .\n\n                            SOL\n\n               Come on.\n     He opens it - and it's got about a grand inside.\n\n                            VINNY\n\n              And?\n\n                           FRANKY FOUR FINGERS\n\n               And here's the money.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n40   CONTINUED:    .\n\n\n\n\n\n                              VINNY\n\n                  I don't believe this.      Why are you\n                  carrying round a case with this little\n                  in it?      .                        .\n\n\n\n     Vin turns to Sol and Tyrone who is leaning on the big shotgun\n     At which point Franky pulls out the gun from the secret\n     compartment in the case.\n\n                              FRANKY FOUR FINGERS\n\n                  Now be a bunch of good fellas and\n                  lie down on the floor.\n\n\n\n     Tyrone goes for the big gun and Franky pulls the trigger.\n     Nothing happens other than a big click, there is silence for\n     a long second and the black guys open their tightly shut\n     eyes.                                                      :\n\n\n\n\n                              TYRONE\n\n                  Whoops.\n     Tyrone also looks into the case and sees the. open secret\n     compartment: this also reveals the stone.\n\n                              TYRONE (CONT'D)\n\n                  Hello what have we got here?\n\n41   EXT. PAWN BROKERS\n\n     Boris is admiring the outside of the shop.        He walks in.\n\n42   INT. PAWN BROKERS\n\n     Franky is tied up on a stool, in front of him is the case\n     and it's open. Boris waves the black guys to come into the\n     corridor so they can talk without being heard.\n\n                              BORIS\n\n                  What are you doing with him?\n\n                              SOL\n\n                  The case was attached to his body.\n\n                              BORIS\n\n                  So why didn't you chop it off?\n     Sol looks horrified by the thought.\n\n                              VINNY\n\n                  Err, because we didn't. Now Boris\n                  we have or rather you have a problem.\n\n                              BORIS\n\n                  What?\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n42   CONTINUED:\n\n\n                            . SOL\n\n                  There wasn't any money there.                   v\n\n\n\n     Boris pulls out a wad of notes\n\n                            BORIS\n\n               There's ten grand.\n\n                           VINNY\n\n               Keep it. We want this, or at least\n               half of this.\n\n                                                                \n\n                                                                ,\n\n     Vin holds up the stone: the atmosphere changes.\n\n                           BORIS\n\n               What was in the case was mine, what\n               was in the bookies was yours, ok\n               there wasn't much but, here's ten\n               large to help the situation.\n\n                           VINNY\n\n               I am afraid it's too late for that\n               Boris.                  -\n     He holds up the diamond. Boris1 eyes follow him as he walks\n     back into the room where Franky is and puts the diamond back\n     into the case while he's talking and changes the combination.\n\n                           VINNY (CONT'D)\n\n               We want half and that's because we\n               are being generous. We could by\n               rights keep the whole fuckin stone.\n     Boris grimaces and pulls out a gun from god knows where, and\n     within a second shoots poor Franky in the face. Franky's\n     body disappears off the stool that he was sitting on. The\n     black guys are stunned into silence.\n\n                           BORIS\n\n               You fuckin idiots. He couldn't know\n               who I am. Now open the case and\n               give me.the stone.\n     The black guys are left with their mouths open, everything\n     just changed gear and they weren't expecting that.\n\n                              BORIS (CONT'D)\n\n               Who's next? You have the ten grand\n               now give me the stone.\n     The pause continues. Boris lets a shot off that tears\n     worryingly close to Sol's head.\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n42   CONTINUED:   (2.)\n\n\n\n\n\n                              SOL\n\n                  The only man that knows the\n                  combination you just shot.\n     Boris appears little bothered by this and whips out a four\n     foot machete that he was concealing about his person. He\n     pulls the case towards him and brings the machete down with\n     full force. We can tell by the expression on Tyrone's face\n     that it must have been some part of Franky's anatomy.\n     Pointing to the ground:\n\n                              BORIS\n\n                  He's your problem now. You can keep\n                  the\" ten grand along with the body,\n                  but if I see you again...well look\n                  at him.\n     He points to Franky. While he is saying this he bends down\n     and picks up the case from the floor and wraps the severed\n     arm in newspaper. He then walks out of the shop casual as\n     you like.\n\n43   EXT. AMUSEMENT ARCADE LONDON -- MORNING\n\n\n\n\n     Turkish pulls up outside his arcade and has a look around:\n     all seems to be clear.\n\n                              TURKISH\n\n                  I ain't going in the front.\n\n                              TOMMY\n\n                  I don't think it's a good idea you\n                  going in at all.\n     The car surges off round the back.\n\n                              TURKISH\n\n                  Unless you are going to\n                  transcendentally extract the passports\n                  and cash from out of a steel safe, I\n                  can't see any other way of getting\n                  them. Keep your eyes peeled.\n     Turkish has another look around the back\n\n                              TURKISH (CONT'D)\n\n                  Well I can't see anyone. After I\n                  have got in go round the front and\n                  call me if you see anything.\n\n44   INT. AMUSEMENT ARCADE\n\n     Turkish lets himself in and walks through.        Everything seems\n     to be fine.     ·\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n44   CONTINUED:\n\n\n\n\n     He walks into his office, has a quick look around and makes\n     his way to the safe under the floor. He decides to put the\n     kettle on, does so, and his attention is caught by something,\n     he looks at the cups on the side and sees that one is waiting\n     to be made. He stands back and looks at the cupboards he\n     sees that they are all open. Then he sees that the kettle\n     is already boiled.\n\n\n\n\n                                ERROL\n\n                  Oink, oink.    Where do you keep the\n                  sugar?\n\n                              TURKISH\n\n                  Shit you scared the life outta me.\n\n                              JOHN\n\n                  You wait till you see what the pigs\n                  do to you.\n\n                          TURKISH\n\n              What brings you two here, run out of\n              pants to sniff?\n\n                              ERROL\n\n                  That's very good Turkish.\n\n                          JOHN\n\n              Very cool Turkish.\n\n                          TURKISH\n\n              Well what do you want?\n\n                          EROL\n\n              I want two sugars in my tea.       What\n              do you want John?\n\n                          JOHN\n\n              I want to see him lying cold and\n              still, but we aren't here for what\n              we want are we Errol?\n     Errol shakes his head slowly.       Turkish's phone rings.   They\n     let it ring for a while.\n\n                              ERROL\n\n                  Well aren't you going to answer it?\n     Turkish does.\n\n45   EXT. AMUSEMENT ARCADE LONDON -- MORNING\n\n     Tommy on the phone.\n\n\n\n\n\n\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n45   CONTINUED:\n\n\n                          TOMMY\n\n              Brick Top's just landed, he's walking\n              in the front, I would move it if I\n              were you Turkish...\n     Turkish puts down the phone\n\n                          ERROL\n\n              What's happening with the tea?\n\n                          TURKISH\n\n              Help yourself. You have to every\n              thing else.\n\n\n\n\n                          ERROL\n\n              That sounds like hostility, doesn't\n              it John?\n\n                          JOHN\n\n              Oh we don't like hostility do we\n              .Errol?\n\n                            EROL\n\n              No John we don't, but I am sure he\n              could be pacified, what do you think\n              John? Here you hold his arms, and\n              I ' l l hold his legs.\n     In walks Brick Top before the boys have had a chance to get\n     a grip.\n\n                                TURKISH\n\n                  Brick Top.\n\n                                 BR,ICK TOP\n\n                  Turkish.     Got the kettle on?\n     Turkish adapts to his new circumstances.\n\n                              TURKISH\n\n                  You want sugar?\n\n                              BRICK TOP\n\n                  No thank you Turkish, I am sweet\n                  enough.\n\n                              TURKISH\n\n                  If I turn my back am I going to get\n                  a hole through it?\n\n                               BRICK TOP\n\n                  Don't be silly Turkish, if I wanted\n                  you dead would I be talking?. . .\n\n                               (MORE)\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n45   CONTINUED: (2)\n\n\n\n\n\n                           BRICK TOP (CONT'D)\n\n               Carry on. You've provided me with a\n               problem, which you gonna have to\n               remedy. I gotta bare knuckle fight\n               in a couple of days. I want to use\n               the pikey.\n\n\n\n\n                             TURKISH\n\n               Of course.\n\n                             BRICK TOP\n\n               Of course fuckin of course, I wasn't\n               asking I was telling. But this time\n               I do want him to go down in the\n               fourth. And I do mean it this time.\n     Pause\n\n                           BRICK TOP (CONT'D)\n\n               Now I know you,came back. to. open\n               your safe, so now you can open it.                .\n     There is nothing Turkish can do.\n\n46   EXT. AMUSEMENT ARCADE\n\n     Brick Top exits with Errol and John and grimaces with.the\n     light. He's holding the contents of Turkish's safe.\n\n                           BRICK TOP\n\n               He's been a busy little bastard that\n               Turkish.\n\n                           ERROL\n\n               I think you have let him get away\n               with enough all ready gov.\n     Brick Top looks round with some concern.\n\n                             BRICK TOP\n\n               It can get you into a lot of trouble\n               thinking Errol, I shouldn't do so\n               much of it. ·\n     Pause as Errol wants the ground to swallow him up.\n\n\n\n\n                           BRICK TOP (CONT'D)\n\n               Well that takes care of one little\n               piggy, now find me the silly sods\n               that blagged the bookies. Find em\n               today.\n\n\n\n\n                                                              FADE OUT:\n\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n46   CONTINUED:\n\n\n\n\n\n     FADE TO BLACK:\n\n\n\n\n\n     FADE IN:\n\n\n\n\n\n47   EXT. PORTACABIN\n\n\n\n\n     The film stock is 1970s, and things seem more dated. This\n     is confirmed by the dress of our man TONY. Tony is standing\n     outside a scrap metal yard and he is kicking the door of a\n     portacabin.                                             ..\n\n                              TONY\n\n                  Open up Charlie.\n\n                             CHARLIE\n\n                  Fuck off. The only thing I'11 open\n                  up is you.\n\n                                TONY\n\n                  I t ' s lucky you .got me Charlie, it\n                  could have been one of the other\n                  lads, and then think how much trouble\n                  you' d be in.\n\n                              CHARLIE\n\n                  You come through that door and you'll\n                  be going out prostrate.\n\n                              TONY\n\n                  It doesn't belong to you Charlie.\n     He kicks open the door. CHARLIE is standing behind his desk\n     holding a pistol directly at Tony. On the table is a bag of\n     what we must believe is coke, it's open, and Charlie has it\n     all over his nose.                     .\n\n                              TONY (CONT'D)\n\n                  You silly fucker, you can't go running\n                  off with other people's gear. How\n                  much you put up your nose?\n     Charlie opens up, he fires four shots straight into Tony who\n     buckles and falls to the floor. Tony seems only shaken and\n     he holds his hands out to inspect them, he's bleeding.\n\n                              TONY (CONT'D)\n\n                  Oh you silly cunt.\n     Tony stands and walks towards Charlie. Charlie is\n     understandably shocked and fires another. It goes straight\n     through Tony and we see the blood hit the wall behind.\n\n                              CHARLIE\n\n                  Go down-boy, go down.\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n47   CONTINUED:\n\n     Tony keeps going for him. Charlie raises the gun and points\n     it at Tony's face and fires the last shot. The bullet goes\n     straight into his mouth but it went in at an angle and it\n     exits his cheek. Tony is standing there with six. bullet\n     holes in him and bleeding all over the carpet. As he talks\n     blood courses its way down his front and a strong lisp is\n     frustrating the words.\n\n                              TONY\n\n                  Ohh you'f in twouble nowf.\n\n\n\n     Tony slowly extracts a short sword from behind him. Fear\n     has set into Charlie's face and has rendered him useless.\n\n\n\n\n     FADE IN:\n\n\n48   INT. VANTAGE                              ·\n\n     The car comes to a halt again.\n\n                              HANDS\n\n                  They, have only made forty this year.\n                  You could find the maker of this\n                  engine's signature on the engine.\n                  But you can't find me Franky.\n\n                              DOUG\n\n                  No it's true. I can't find'him, but\n                  I know a man that can.\n     Cut to a shot of Hands encouraging him to continue.\n\n                              DOUG (CONT'D)\n\n                  Tony. Bullet Tooth Tony.     He'll\n                  find Franky for you.\n\n                              HANDS\n\n                  Who's he?\n     Susi interrupts.\n\n                              SUSI\n\n                  ·What is he?' Would be a more\n                  appropriate question.\n     Doug frowns at Susi, but continues.\n\n                              DOUG\n\n                  He's the best chance you have of\n                  finding Franky.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                             '                '               '\n\n\n                                                                              .\n\n\n48   CONTINUED:    .\n\n\n                              SUSI\n\n                  He has upset every bad boy in town,\n                  at some point, or another but nobody's\n                  got the nuts to knock him off because\n                  they aren't sure whether you can\n                  kill the bastard.\n\n                              HANDS\n\n                  You really think he can find him?\n\n                              SUSI\n\n                  He'll find you Moses and the burning\n                  bush if you pay him to.\n\n\n\n\n                              HANDS\n\n                  Ok so let's get hold of him.\n\n                              DOUG\n\n                  Firstly you gotta understand he's a\n                  little strange.                                       .\n\n                           HANDS\n\n              .He could swing from trees wearing\n               rubber dresses as far as I am\n               concerned, all as I care about is\n               whether he can find Franky.\n\n                                                                             4\n\n\n49   INT. CARAVAN CAMP SITE --DAY\n\n\n\n\n     Turkish and Tommy pull up outside the pikey camp.             Micky's\n     Mum is sitting in her chair surrounded by kids.\n\n                              MUM\n\n                  They're very nice Tommy.       Thank you.\n     Tommy has produced a bunch of flowers from somewhere.              Turkish\n     finds this a great surprise.\n\n                              TURKISH\n\n                  Where did they come from? You're a\n                  snake in the grass Tommy.\n\n                              MUM\n\n                  You looking for Micky?\n\n                              TURKISH\n\n                  'Do you know where I can find him?\n\n                              MUM\n\n                  Yes.\n     Pause                                                          ·\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n49   CONTINUED:\n\n\n\n\n\n                              TURKISH\n\n                  Well would you like to share that\n                  information with me Ms O'Neill?\n\n                              MUM\n\n                  I don't want you getting my boy in\n                  to any trouble you hear me? He's my\n                  only boy and he's a good boy.\n\n                               M UM (CONT'D)\n\n                  He's coursing, he's a couple of fields\n                  that way.\n     Pause\n\n                              TOMMY\n\n                  What's coursing?\n\n50   INT. CAR                                            ·\n\n\n\n\n\n                              TURKISH\n\n                  Hare coursing. The gypsies can't\n                  get enough of it.\n\n                              TOMMY\n\n                  What the fuck's a hare?\n\n                                 TURKISH\n\n                  I t ' s a big rabbit.\n\n                              TOMMY\n\n                  Why don't they call em big rabbits\n                  then?\n\n                              TURKISH\n\n                  Because they call em hares.\n     Tommy shrugs.\n\n\n\n\n                              TOMMY\n\n                  So what's coursing?\n\n                              TURKISH\n\n                  They set two lurchers, they are dogs\n                  before you ask, on a hare, that's\n                  the big rabbit. And the hare has to\n                  outrun the dogs.\n\n                              TOMMY\n\n                  What happens if he doesn't?\n\n                              TURKISH\n\n                  Well the big rabbit gets fucked\n                  doesn't it?\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n50   CONTINUED:\n\n     Tommy looks a taken aback by this statement.\n\n                              TOMMY\n\n                  Come on, what, proper fucked?\n\n                              TURKISH\n\n                  Yeah before the Germans get there\n                  Tommy. How can a dog fuck a\n                  rabbit?...eh? If eats the bastard.\n\n\n\n\n51   EXT. SEEDY STREET\n\n     Errol is curb crawling down a particularly seedy street in a\n     car with John. They come to a halt, at the feet of some\n     touter.\n\n                              ERROL\n\n                  Excuse me mate, d'ya know Mullet?\n     The man looks a little 'further down the street. Errol follow\n     his eyes, squints and seems to focus on something.\n\n                                ERROL (CONT'D)\n\n                  Cheers pal.\n     Errol puts on the gas a little-, the car surges forward and\n     slows at the feet of Mullet - seedy looking character with\n     big ears and a moody haircut, who smokes fat cheap cigars\n     and wears his top shirt button fastened.\n\n                              MULLET\n\n                  Errol, John. Alright chaps?     How's\n                  the gov'nor?\n\n                              ERROL\n\n                  Very well Mullet, I am sure he'll be\n                  flattered you inquired.\n\n                              MULLET\n\n                  Yeah let him know that I asked.\n\n                              JOHN\n\n                  We'll be sure to. Now come on Mullet\n                  what have you got for us about the\n                  gov'nor's bookies?\n\n                              MULLET\n\n                  I did find something out as it\n                  happens, I knew a driver who was\n                  grafting that day.\n\n                              ERROL\n\n                  Don't stop with the foreplay.\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n51   CONTINUED:\n\n\n\n\n\n                              MULLET\n\n                  White geezer, bit of a bounty.\n\n                               EROL\n\n                  Eh?\n\n                               MULLET\n\n                  Bounty, black on the outside, white\n                  on the inside.\n\n                              JOHN\n\n                  Go on.\n\n                              MULLET\n\n                  He was doing a job for a couple of\n                  brothers in Smith Street. I think\n                  it was a pawn shop.\n\n                               JOHN\n\n                  Porn as in filthy dirty?\n                        i\n\n                              MULLET\n\n                  Pawn as in I have run out of money\n                  and here's my wedding ring.\n\n                               ERROL\n\n                  Good boy Mullet.\n\n52   EXT. FIELD\n\n     Turkish and Tommy have found Micky who is in the middle of a\n     field and is betting on with various dodgy characters.\n\n                               TURKISH\n\n                  Well do you want to do it?\n\n                              MICKY\n\n                  That depends.\n\n                              TURKISH\n\n                  On what?\n\n                              MICKY\n\n                  On you buying this caravan.\n     He pulls out a catalogue on fancy caravans and points to the\n     picture of the Rolls Royce of caravans.\n\n                              TURKISH\n\n                  That's not the same caravan.\n\n                              MICKY\n\n                  This isn't the same fight.\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                    60.\n\n\n\n\n\n52   CONTINUED:    _                        -\n\n\n                                TURKISH\n\n                  I t ' s twice the fuckin size of the\n                  last one.\n\n                              MICKY\n\n                  The fight is twice the size. And my\n                  mum still needs a new caravan.\n\n\n\n\n                              TURKISH\n\n                  Micky you are lucky we aren't worm\n                  food after your performance, I think\n                  buying a tart's mobile palace is a\n                  little fuckin rich.\n\n\n\n     There is a pause while Micky frowns.       Turkish looks a little\n     sheepish.\n\n                              TURKISH (CONT'D)\n\n                  I didn't mean that your mum was a\n                  tart. I just meant...\n\n                           MICKY\n\n               Save your breath for cooling your\n               porridge. I'll bet you for it.\n\n                           TURKISH\n\n               What like Tommy did last time? Do\n               me a favour?\n\n                             MICKY\n\n               I ' l l do you a favour, you have first     ,\n               bet. If I win I get the caravan, if\n               I lose I'l l do the fight for free.\n     Turkish considers this, uneasily.       He looks at the dogs they\n     look keen and fit.\n\n                              TURKISH\n\n                  Okay, I reckon the hare gets caught.\n     But he's in. Gypsy Romany Music starts. Cut to slow motion,\n     CU of dogs' enthusiasm, CU of pikeys and their fingers\n     skillfully dealing in money, inhaling cigarettes, etc.\n\n53   INT. CAR --\n\n     Slow motion.      Errol and John are looking for Tyrone.\n\n54   EXT. FIELD\n\n     Slow motion.      Cut back to the dogs.    The chase starts.\n\n\n\n\n55   INT. CAR\n\n\n\n\n     Slow, motion.       They see Tyrone, Tyrone starts to run.\n\n56   EXT . FIE LD\n\n\n\n\n     Slow motion.       The hare sees the ,dogs and starts to run.\n\n57   EXT. STREET\n\n\n\n\n     Slow motion.       They bail Tyrone into the back of a car.\n\n58   EXT. FIELD\n\n\n\n\n     Slow motion.       The dogs move out in a pincer movement.\n\n59   INT. BOOT OF A CAR\n\n\n\n\n     Poor Tyrone is bleeding in the boot of a car.\n\n60   EXT. FIELD\n\n\n\n\n     The dogs move in.\n\n61   EXT. CAR\n\n\n\n\n     They bail Tyrone out of the car and into Brick Top's pub.\n     Brick Top is waiting there. Brick Top asks questions. We\n     can't hear what he's asking, but we can see that Tyrone isn't\n     playing the game.\n\n62   EXT. FIELD\n\n\n\n\n     The dogs are moving in.\n\n63   INT. DOG HOUSE\n\n\n\n\n     A door is opened and Tyrone is thrown in. A rabid Neapolitan\n     mastiff pitbull hybrid that is attached to the end of a long\n     pole with a lasso at the other end is brought in, it will\n     quite clearly savage anything in its way.\n\n64   EXT. FIELD\n\n\n\n\n     The hare gets caught and a pile of fur comes up\n\n65   INT. DOG HOUSE               ·\n\n\n\n\n     The dog bites Tyrone in the leg.\n\n\n\n     Tyrone shouts in panic, the music breaks, we come out of\n     slow motion and into real time.\n\n                                TYRONE\n\n                    Ok, I'll fuckin tell you.\n\n\n\n\n66   EXT. FIELD    .\n\n\n\n\n     The hare escapes the jaws of the dogs and is off.\n\n67   INT. CAR\n\n     Turkish is getting into his car.                           .    ..\n\n                              TOMMY\n\n                  You're are as mad as mars you are,\n                  why did you take that bet? What\n                  happens now?\n\n                              TURKISH\n\n                  We buy him a caravan Tommy.\n\n\n\n\n                              TOMMY\n\n                  There is something very wrong with\n                  this, it was us that wanted to buy a\n                  caravan off him.\n\n                              TURKISH\n\n                  Why didn't you \"bus a cap in his\n                  ass\" then Tommy? Mind you, you would\n                  do more damage if you threw it at\n                  him.\n\n                              TOMMY\n\n                  You saying I can't shoot?\n\n                              TURKISH\n\n                  Oh no Tommy I wasn't saying you can't\n                  shoot, I know you can't shoot. What\n                  I was saying is that six pound piece\n                  of shit stuck in your trousers there\n                  would do more damage if you fed it\n                  to em.\n\n                              TOMMY\n\n                  Are you saying it doesn't work?\n\n                              TURKISH\n\n                  You tried it?\n     Tommy frowns\n\n                              TURKISH-(CONT'D)\n\n      .=..        . That Russian saves the shooters that        \"'\n                  work for the faces, and I don't want\n                  to be the one that breaks it to you\n                  Tommy but you ain't a face. Go on\n                  try it.\n     Tommy sticks the gun out the window and pulls the trigger.\n     Nothing happens.\n\n\n\n\n\n\n\n                                                 (CONTINU ED)\n\n\n\n\n\n67   CONTINUED: .\n\n\n\n\n\n                                TURKISH (CONT'D)\n\n                 Whoops.\n\n\n\n\n                                TOMMY\n\n                 I want to see that sneaky fuckin\n                 Russian.\n\n68   INT. BACK ROOM PAWN BROKERS\n\n\n\n\n     Vin and Sol are trying to wrap Franky's body up.      Bad Boy\n     Lincoln has been called in to help.\n\n                             BAD BOY LINCOLN\n\n                 What happened to him?\n\n                              SOL\n\n                 He got shot in the face Lincoln, I\n                 would have thought that was obvious.\n\n                                BA D BOY LINCOLN\n\n                 Well what do you want me to do about\n                 it?\n\n                                SOL\n\n                 Sort it out.\n\n                                BAD BOY LINCOLN\n\n                 The only way to sort it out is to\n                 bring him back to life and I am not\n                 a fuckin witch doctor am I?\n\n                              SOL\n\n                 Villains are supposed to know how to\n                 get rid of bodies.\n\n                                BAD BOY LINCOLN\n\n                 Err, yes, but I have never actually\n                 got rid of one. Who is he?\n\n                             SOL\n\n                 He's a man with a hole in his face\n                 Lincoln. Who cares who he is?\n\n                             BAD BOY LINCOLN\n\n                 Err well, let's wrap him up.\n\n                              SOL\n\n                 What do you want to do that for?\n                , He's not a fuckin Christmas present.\n\n69   INT. CAR\n\n     Brick Top is on the phone and Errol and John sit opposite.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n69   CONTINUED:. .\n\n\n\n\n\n                          BRICK TOP\n\n              Like I said I wasn't giving you a\n              choice. I am telling you that fuckin\n              gypsy has got to fight.\n\n70   INT. AMUSEMENT ARCADE\n\n     Turkish is on the other end of the phone to Brick Top.         Tommy\n     is trying to listen in to what is being said.\n\n                          TURKISH\n\n              I am sorry, but he's a stubborn\n              bastard, he says he's had enough, he\n              says he's got to look after his old\n              mum.\n\n                             BRICK TOP\n\n              His what?                  ·.-·                     . ..\n\n                             TURKISH                          '\n\n              His mum.\n\n                          BRICK TOP\n\n              Are' you taking the piss again?\n\n                          TURKISH\n\n              That's what he said, she's a nice\n              old girl his mum.\n\n                          BRICK TOP\n\n              You're on thin ice Turkish, and I am\n              going to be there when it breaks.\n     He puts the phone down and inhales.\n\n                          BRICK TOP (CONT'D)\n\n              Anything for an easy life. That\n              fuckin pikey being difficult. Hello,\n              we here?\n\n71   EXT. PAWN BROKERS\n\n     We see Errol outside with a glass cutter. He puts it around\n     the door and creates a circle with the sharp side, pulls it\n     out and puts his hand through to kill the alarm. He's in.\n\n                         - ERROL\n\n               You coming John?\n\n                           JOHN\n\n               Is a trout's head water proof Errol?\n               I wouldn't miss it for the world.\n\n\n\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n71   CONTINUED:\n\n\n\n\n\n                              ERROL\n\n                  Get the governor John.\n     John goes back to the car which is parked down the street.\n     The window slides down.\n\n\n\n\n                              JOHN\n\n                  It looks like we are in gov.\n\n                              BRICK TOP\n\n                  Oh goodie gum drops. Get us a cup\n                  of tea would you Errol?\n\n72   INT. BACK ROOM PORN BROKERS\n\n     Vin, Lincoln and Sol are arguing\n\n                              SOL\n\n                  Hold him by his legs.\n\n                              BA D BOY LINCOLN\n\n                  What do you think I am holding him\n                  by, his fucking ears?\n     The interconnecting door opens slowly.\n\n                               BRICK TOP\n\n                  Hope it ' s not a bad moment.\n     Sol looks at Vin, Vin looks at Lincoln: they are\n     understandably surprised. Brick Top looks around the room\n     the silence continues. Brick Top helps himself to the most\n     comfortable seat.\n\n                              BRICK TOP (CONT'D)\n\n                  Do you know who I am?\n\n                                 BAD BOY LINCOLN\n\n                  Yeah I know.\n\n                               BRICK TOP\n\n                  Good.   That will save me some time\n                  then.\n\n                              VINNY\n\n                  Well I don't.\n\n                              BRICK TOP\n\n                  What you gonna do with your man there?\n                  You're always gonna have problems\n                  lifting a body in one piece.\n                  Apparently the best thing to do is\n                  cut the corpse up into six pieces\n                  and pile it all together.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n72   CONTINUED:\n\n\n                          SOL\n\n              Would someone mind telling me who\n              you are?\n\n                          BRICK TOP\n\n              After you got six pieces you gotta\n              get rid of 'em, of course you can't\n              just leave it in the deep freeze for\n              your mum to discover, can ya?\n     Pause while the black guys are still holding the body. The\n     door opens and in walks Errol. He passes Brick Top a cup of\n     tea in a take away container.\n\n                          VINNY\n\n              Lincoln, who is this man?\n\n                          BRICK TOP\n\n              And then I hear the best thing to do\n              is feed 'em to pigs. You gotta starve\n              the pigs for a few days, then the\n              sight of a chopped up body looks\n              like curry to a drunk. You gotta\n              shave the heads of your victims and\n              pull the teeth out, you could do\n              that after of course, but you don't\n              want to go sieving pig shit do you?\n              Ever seen the size of one of their\n              molars?                                        ·\n\n\n\n     He holds up his fist\n\n                           BRICK TOP (CONT'D)\n\n              They go through bone like i t ' s butter.\n              You gotta have a few pigs though you\n              need about sixteen they will go\n              through a body that weighs two hundred\n              pounds in about eight minutes that\n              means that a single pig can consume\n              two pounds of uncooked flesh every\n              minute,. . .\n     Pause\n\n                          BRICK TOP (CONT'D)\n\n              Hence the expression greedy as a\n              pig.\n     Pause\n\n                            VINNY\n\n               Well thank you, that's a large weight\n               off my mind.\n\n                            (MORE)\n\n\n\n\n\n                                              (CONTINUED)\n\n\n\n\n\n72   CONTINUED: (2)\n\n\n\n\n\n                           VINNY (CONT'D)\n\n               But would you mind very much telling\n               me who the' fuck you are? Other than\n               a man that feeds people to pigs of\n               course.\n     The door opens and we see John, who is wearing a pair of\n     extremely large plastic gloves, showing Brick Top the shotgu\n     that he has found.\n\n                           JOHN\n\n               Would you look at the size of this?\n\n\n\n\n                           BRICK TOP\n\n               Golly that is big isn't it Errol?\n     He looks back at the brothers\n\n                           BRICK TOP (CONT'D)\n\n               Do you know what Nemesis means?\n\n\n\n     There is a pause\n\n                            BRICK TOP (CONT'D)\n\n               A righteous infliction of retribution\n               ·by. an appropriate agent, personified\n               in this case by a horrible cunt.\n               Me.\n     Brick Top stands and opens the door. We can see that a coupl\n     of ropes have been slung over the rafters and a couple of\n     buckets are underneath them. SIX VERY LARGE MEN (including\n     Errol and John) are standing around wanting to get busy. -\n     Tyrone is with them, all trussed up.\n\n73   INT. DOUG'S OFFICE\n\n     ·BULLET TOOTH' TONY is in front of Hands, Rosebud and Doug.\n\n                           HANDS\n\n               Can I call you Tony?\n\n                           BTT\n\n               You can call me Susan if it makes\n               you happy.\n\n                           ROSE BUD\n\n               You got nice teeth Susan.\n     Tony demonstrates an interest in Rose Bud's.\n\n                           BTT\n\n               You don't, you should comb em some\n               time.\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n73   CONTINUED:\n\n     Hands interrupts\n\n                              HANDS -\n\n                  Tony, I want to know if you can find\n                  me a man.\n\n                              BTT\n\n                  Well then it depends on all the\n                  elements in the equation, how many\n,                 are there?\n\n                               HANDS\n\n                  About forty thousand.\n\n                              BTT\n\n                  Where was he last seen?\n\n                              DOUG\n\n                  At a bookies.\n\n                              BTT\n\n                  A bookies eh? Susi, pass us the\n                  blower.\n     Susi reaches for the phone.\n\n74   INT. PAWN BROKERS\n\n\n\n\n     The black guys are hanging upside down.        Errol and John are\n     now wearing industrial pinnies.\n\n                              ERROL\n\n                  Is this how you want him gov?\n\n                              BRICK TOP\n\n                  No spin him round, I want him sunny\n                  side up.\n\n                              SOL\n\n                  Mr Mclean I kid you not. Why do you\n                  think we have a dead man, missing an\n                  arm in our office? Give us four\n                  days and we'11 bring you a stone the\n                  size of a home.\n     Brick Top considers this, and has a look at Errol who is\n     more than enthusiastic to get on with the job at hand.\n\n                              BRICK TOP\n\n                  What do you think Errol?\n\n                              ERROL.\n\n                  I think we should drip dry em\n                  governor, while we have the chance.\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n74   CONTINUED:\n\n     Brick Top again frowns at Errol.\n\n                               BRICK TOP\n\n                  It was a rhetorical question Errol,\n                  what have I told you about thinking?\n     He turns back to the brothers.\n\n                              BRICK TOP (CONT'D)\n\n                  You got forty eight hours.\n     He looks at Lincoln.\n\n                              BRICK TOP (CONT'D)\n\n                  I am going to take your man here.\n     Pointing to Tyrone.\n\n                              BRICK TOP (CONT'D)\n\n                  You can keep this silly wanker.\n\n                              .LINCOLN\n\n                  Hold on..\n\n                               ERROL\n\n                  Shut it or I'll cut ya. . .\n\n                              BRICK TOP\n\n                  In forty eight hours I'11 set the\n                  dogs on him and then the pigs on the\n                  remains.\n     Brick Top nods at Errol who looks extremely disappointed.\n\n75   INT. CAR\n\n\n\n\n     BTT and Hands are driving along.      Rose Bud is in the back.\n\n                              BTT\n\n                  A bookies got blagged last night.\n\n                               HANDS\n\n                  Blagged?\n\n                              BTT\n\n                  Robbed. I gotta see a man who looks\n                  like he might know something, but it\n                  can't be done on the phone if you\n                  know what I mean.\n     He turns to Rose Bud.\n\n                              ROSE BUD\n\n                  I need a cun.\n\n\n\n\n                                                    (CONTI NUED)\n\n\n\n\n\n75   CONTINUED:\n\n\n                               BTT\n\n                  No you don't, Rose Bud my old son,\n                  you need me.\n\n76   INT. PAWN BROKERS\n\n\n\n\n     Tyrone looks desperate.                  .\n\n                               TYRONE\n\n                  He set the dogs on me.   Look.\n     He shows his wounds to Sol and Vin.\n\n                               VINNY\n\n                  No wonder that sneaky fuckin Russian\n                  didn't want to do it.\n\n                               SOL\n\n                  First things first, one of us, Tyrone,\n                  you get round to-the Russian's. The\n                  second you see him call us.\n\n                               TYRONE\n\n                  You better be round with something\n                  substantial, don't turn up with a\n                  frown and a wagging finger.\n\n                               SOL\n\n                  I am on it Tyrone^.\n\n77   EXT. SEEDY STREET\n\n     BTT is in the car with Hands and Rose Bud. The car is parked\n     at the feet of Mullet, who is in discussion with another\n     horrible character. Mullet is extremely nervous about seeing\n\n     BTT.\n\n\n                            BTT\n\n               Alright Mullet?\n\n                               MULLET\n\n                  Tony, alright mate? I thought.,\n                  well I thought you weren't about\n                  anymore.\n\n                                             .:·.····\n\n\n                          : : BTT\n\n                  Well what do you know? It's still\n                  warm the blood that courses through\n                  my veins. Unlike yours Mullet.\n     Bt.t has a quick look down the street.\n\n\n\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n    77   CONTINUED:\n\n\n\n\n\n                                  BTT (CONT'D)\n\n                      This job does have prospects after\n                      all, you travel to pretty places,\n                      meet interesting people.\n         Btt looks at who Mullet is talking to, the man has a try\n         hard mustache and interjects.\n\n                                  MAN\n\n                      Who the fuck gave you such a big\n                      mouth?\n\n                                  BTT\n\n                      Someone whom you might shortly meet.\n\n                                  MAN\n\n                      You threatening me?\n\n                                  BTT\n\n                      Only with wings and a halo.\n         Mullet gives the man a furtive kick and makes eyes to shut\n         up.                     ,\n\n                                  BTT (CONT'D)\n\n                      Clean the breakfast7off your top\n                      lip/ and make yourself busy sunshine.\n         The man moves off\n\n                                  BTT (CONT'D)\n\n                      I want to know who blagged Brick\n                      Top's bookies.\n\n                                  MULLET\n\n                      Oh do me a favour Tone?\n\n                                  BTT\n\n                      I will do you a favour Mullet, I'll\n                      not bash the living fuck out of you\n                      in front of all your girlfriends\n                      here.\n\n     ·                            MULLET\n\n                      I don't know anything about that\n\n                                                               ·\n\n\n                                                               ·\n\n                      Tony..    .\n\n                                  BTT\n\n                      If you play hard to get 'Mullet you'll\n                      wish you'd never been caught.\n         Mullet looks uncomfor'table about the fact that he's thinking.\nj                   '                   ·        ·      ·\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n77   CONTINUED: (.2)\n\n\n\n\n\n                            MULLET\n\n                Make it worth my while at least.\n                Jesus Tone you know how it is.\n     Btt turns to Hands.\n\n                            BTT\n\n                Give us your wallet Hands.\n     Hands makes eyes and digs into his back pocket and produces\n     his wallet. BTT takes out some notes and proffers them to\n     Mullet, Mullet nervously reaches forward. As quick as you\n     like Btt has Mullet by the collar and pulls Mullet into the\n     car. He then raises the electric window on Mullet's throat\n     until it has fastened Mullet to the roof of the vehicle.\n\n\n\n\n                             BTT (CONT'D)\n\n                Comfortable Mullet? ,\n\n\n\n     Mullet has already gone pink.\n\n                            BTT (CONT'D)\n\n                You can take as long as you like\n                Mullet.\n     Btt starts to pull away so Mullet has to keep walking with\n     him.\n\n                            MULLET\n\n                Fuckin hell what are you doing?\n\n                            BTT\n\n                I am driving down the street with\n                your head stuck in my window. What\n                do you think I am doing you penis?\n     He does the window up a bit tighter. And grabs him by the\n     nose. He pulls a face when he smells his breath.\n\n                            BTT (CONT'D)\n\n                You been using dog shit tooth paste\n                Mullet?\n     He speeds up even more.\n\n                  ..      MULLET . . - . - ·\n\n                Slow down.\n\n\n\n\n                            BTT                 .\n\n                Err no I don't think I'l l slow down\n                Mullet, I think I ' l l speed up. I\n                could play you some music if you\n                like.\n\n\n\n\n\n\n\n                                               .(CONTINUED)\n\n\n\n\n\n77   CONTINUED:   (3)\n\n\n\n\n     BTT turns on the radio.        A song comes on that he loves.\n\n                              BTT (CONT'D)\n\n                  Oh I love this track. Yes Mullet.\n\n                              MULLET\n\n                  It could be Tyrone Conway.\n\n                              BTT\n\n                  Tyrone Conway?\n\n\n\n\n                                MULLET\n\n                  White geezer, thinks he's black, did\n                  a job for a pair of brothers who\n                  have a pawn shop in Smith Street.\n\n                              BTT\n\n                  Tyrone Conway?\n\n                              MULLET\n\n                  Yes that's what I said.   I t ' s fuckin\n                  Tyrone Conway.\n\n                              BTT\n\n                  It may be fuckin him, but wait and\n                  see what I can do to you.\n     He puts his foot down and Mullet loses his footing, and is\n     dragged along.                                      '.\n\n                                HANDS\n\n                  What about?\n     He points to Mullet. BTT pulls an, 'oh yes I forgot about\n     him1 face. He doesn't even look at Mullet. He lowers the\n     window, and Mullet falls by the way, in god knows what\n     condition.\n\n78   INT. PAWN BROKERS\n\n     The music continues, and we have a montage of the black guys\n     dealing with Bullet Tooth Tony and Hands as they arrive at\n     the pawn shop. We see the corpse, we see Hands get irate\n     and it looks like it's going to be the end of the black fellas\n     again. The black guys try to whip out the big gun but Tony\n     disarms them and takes the gun off them. The music ends\n     along with the scene when Sol breaks.\n\n                              SOL\n\n                  It's the Russian, well to be technical\n                  an Uzbekistan.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n78   CONTINUED:\n\n\n                              HANDS\n\n                  Russian? The sneaky dogs. I been\n                  doing business with those sneaky\n                  dogs.\n\n                               SOL\n\n                  Boris.\n\n\n\n     BTT looks familiar with this name.\n\n                              BTT\n\n                  Dear oh dear, you do know some\n                  horrible people.\n\n\n\n\n79   INT. DOUG'S OFFICE\n\n\n                           HANDS\n\n               Russians, I didn't think it would be\n               the Russians.\n\n                           DOUG\n\n               Boris the Blade? I heard of him,\n               isn't he supposed to be a short little\n               fucker that's covered in scars?\n\n                           BTT\n\n               Sneaky little shit one of the Russian\n               dissidents, killed more men\n               than,...well he's-killed a lot of\n               men. Deals in arms, that he gets\n               off some of the old school.\n     We cut to the security monitor that observes the shop, it\n     sits on Doug's desk. The door opens and in walks Boris. As\n     bold as brass he walks up to the counter.\n\n                               DOUG\n\n                  Hold on.   What's going on here?\n     Doug picks up the phone to the downstairs shop.      Susi picks\n     up the receiver at the other end.\n\n                               SUSI\n\n                  Yes Dad?\n\n                   . ---   - DOUG\n\n                  What does that man want?\n\n                                SUSI\n\n                  I t ' s hard to say, he's got a thick\n                  Russian accent.\n\n\n\n\n80   INT. DOUG'S .OFFICE DOWNSTAIRS\n\n\n\n\n     They are obviously going to move in on the Russian.\n\n                           BTT\n\n               He's a bit sneaky this fella, so\n               watch out.\n\n                            ROSE BUD\n\n               I hate Russians. I'll sort him out.\n     Hands and BTT both look at Rose Bud and look relieved for\n     the offer.\n\n                            BTT\n\n               He's all yours Rose Bud.\n\n81   EXT. CARAVAN CAMP SITE\n\n     Micky is looking at his caravan; it's in flames, real proper\n     roaring flames. People are desperately trying to put the\n     flames out. Micky is covered in dirt from his futile efforts.\n     One of the other pikies who's involved in trying to extinguish\n     the fire turns round and sees Micky standing there motionless.\n     He can see he's upset.\n\n                           PATRICK\n\n               What's wrong with Micky?\n\n                           DAREN\n\n               His mam was in there Patrick.   They\n               burnt his mam.\n     All real sound recedes and we drift in to music. The camera\n     slowly tracks in on Micky. It's hard to read how devastated\n     he is. The camera reaches Micky's face, the reflections of\n     the flames can be seen in his water swollen eyes, but his\n     cheeks remain dry.         .\n\n82   INT. BTT CAR\n\n     BTT is driving, Hands in the passenger seat and Rose Bud in\n     the back. BTT's got a bleeding eye and his hand is wrapped\n     up in a bandage. Rose Bud is clutching his stomach.\n\n                           HANDS\n\n               Sneaky was a bit of a fuckin\n               understatement wasn't it?\n\n                           BTT\n\n               What do you want me to do? Your man\n               there thought he could take him. I\n               told you he was dangerous.\n\n                           HANDS\n\n               How you doing Rosey?\n\n\n\n\n                                               (CONTINUED)\n\n\n\n\n\n82   CONTINUED:    .\n\n     Hands looks at Rose Bud who's holding his midsection.\n\n                              ROSE BUD\n\n                  You're going to have to get me to a\n                  hospital, let's shoot that fucker.\n                  Then get me to a hospital.\n\n\n\n\n                              HANDS\n\n                  We gotta get this stone first Rosy\n                  and then we'll get you to a hospital.\n\n83   INT. BAD BOY LINCOLN'S\n\n\n\n\n     Vin and Sol are going through a selection of keys they have,\n     trying to open the front door.\n\n                              SOL\n\n                  Lincoln's got some tools here, when\n                  he has had a few drinks he gets em\n                  out and runs around the house holding\n                  a pistol in each hand, telling me\n                  about what a bad boy he is.\n\n                              VINNY\n\n                  Do you know where he keeps em?\n     They find the right key.\n\n                              SOL\n\n                  Well they ain't gonna be lying on\n                  the kitchen table Vince, we gotta\n                  have to look. Flick tlie switch.\n     I t ' s dark, they flick the switch. They look onto an\n     immaculate pad. Music fades up along with the lights.\n\n                               VINNY\n\n                  Jesus.   What's going on here?\n\n                              SOL\n\n                  He likes his drum does Bad Boy\n                  Lincoln.\n     The dog goes bounding in.\n\n                              SOL (CONT'D)\n\n                  Well let's get busy.\n\n     EXT. BORIS1 HOUSE\n\n\n84\n\n\n\n\n     BTT's car pulls up outside Boris1 house. BTT and Rosebud\n     pull Boris up in the boot. Tyrone who is hanging about nearb\n     keeping watch, witnesses this. Rosebud places a blade at\n     the Russian's neck.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                 77.\n\n\n\n\n\n84   CONTINUED:\n\n\n\n\n\n                              ROSE BUD\n\n                  I think you have got something to\n                  tell us.\n\n                              HANDS\n\n                  Take it easy Rosy, take it easy.\n\n\n\n     BTT looks at the blood that's already starting to pierce the\n     skin from where the blade is pressed against the Russian's\n     neck. BTT then looks at Hands with concern.\n\n                              BTT\n\n                  You want him to be able to talk or\n                  not?\n\n85   INT. BAD BOY LINCOLN'S\n\n     Sol and Vin have found the weapons and are tossing them from\n     hand to hand.\n\n                              SOL\n\n                  I didn't know did I? They always\n                  looked the shit to me.\n\n                           VINNY\n\n               What are we gonna do with em Sol?\n\n                           SOL\n\n               Shut your mouth Vince, this is all\n               we got, so this will have to do.\n     Sol's mobile rings.\n\n                              SOL (CONT'D)\n\n               Yes?\n\n\n\n\n86   EXT. BORIS' HOUSE\n\n\n                              TYRONE\n\n                  Boris is here.\n\n87   INT. BAD BOY LINCOLN'S\n\n\n                              SOL\n\n                  Now.\n\n                              TYRONE\n\n                  That's why I am calling you.\n\n                              SOL\n\n                  We're coming over.   Hold him there.\n     Sol puts the phone down before he has to hear what Tyrone\n     has to say.\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n87   CONTINUED:                 .                                     S7\n\n\n                              SOL (CONT'D)\n\n                  Leave that dog here Vince, we gotta                      *\n                  go.\n     They shut the dog in the main room and go out of Lincoln's\n     house.\n\n88   EXT. BORIS1 HOUSE                                                88\n\n\n                                TYRONE\n\n                        (continuing after                                  *\n                        Sol's put the phone                                *\n                       down)                                               *\n                  He's not on his own.\n\n\n\n\n89   INT. TYRONE'S CAR                                                89\n\n\n\n\n     We cut to Vinny and Sol tearing round to Boris's.. They're\n     driving Tyrone's car. As they arrive, Tyrone jumps out in\n     the middle of the road. They screech to a halt, narrowly\n     avoiding squashing Tyrone.\n\n                            SOL\n\n              Where is he?\n\n            ·             .\n\n\n                            TYRONE\n\n              I t ' s not just a he, there are three              .    *\n              of them in the house with him.\n\n                              SOL\n\n                  Why didn't you tell us Tyrone?\n     Tyrone pulls a \"I tried\" face.\n\n                              VINNY\n\n                  Do they look hard?\n\n                              TYRONE\n\n                  They look fucked up.\n\n                              SOL         .      \"                     *\n\n                  Well get in and let's load up.\n     Vin whips out a gun.\n\n                              VINNY                                    *\n\n                  Load them up with what?                              *\n\n                              TYRONE                                   *\n\n                  What's wrong with them?\n\n                          VINNY\n\n     .        They're replicas.\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n89   CONTINUED:\n\n\n\n\n\n                              TYRONE\n\n                  Hold tight rudy, are you fuckin mad?\n                  Do you know who these people are?\n\n                              SOL\n\n                  No I don't Tyrone, but I do know I\n                  don't want to be eaten by pulled\n                  apart by dogs and then eaten by fuckin\n                  pigs.\n\n\n\n\n90   EXT. PIKEY ENCAMPMENT\n\n\n\n\n     Tommy and Turkish are looking on to the burned out caravan. .\n     They are in shock. There is a whole gathering of dodgy,\n     angry looking pikies standing around, giving Turkish and\n     Tommy some bad looks.\n\n                              TURKISH\n\n                  Jesus I am sorry Micky. I am really\n                  sorry. He's a mad bastard.\n     Darren decides to interject.\n\n                              DAREN\n\n                  Who are these the boys Micky?\n     Darren's eyes are full of poison.         Tommy and Turkish suddenly\n     feel very uncomfortable.\n\n                              MICKY\n\n                  Back off Darren. What kind of cunt\n                  would turn up here if they knew what\n                  had happened? Leave my business to\n                  me boy.\n     Darren spins on his heel\n\n                              MICKY (CONT'D)\n\n                  I got a message that he wanted me to\n                  fuck you two off, that's why I wanted\n                  you back. I' l l do the fight before\n                  he causes any more carnage, but I ' l l\n                  only do it if you're there.\n\n                              TURKISH\n\n                  Why?\n\n                              MICKY\n\n                  Because I know he fuckin hates ya. .      ·\n\n91   INT. TURKISH'S CAR -- CONTINUOUS\n\n\n\n\n     Turkish and Tommy are driving. Turkish is drinking a pint\n     of\"milk (as usual). There is silence for a while.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n91     CONTINUED:\n\n\n\n\n\n                                TOMMY\n\n                    It's not warm the blood in his veins\n                    is it?\n\n                                TURKISH\n\n                  I gotta say .1 don't like this Tommy.\n                 This has got very fuckin messy.\n                 Jesus you know how he felt about his\n                 old girl. I think we should get you\n                 a new gun Tommy, but this time try\n     . . . '.    it.\n\n                                TOMMY\n\n                    How far is the Russian's?\n\n                                 TURKISH\n\n                    We'll be there in a minute.\n       He takes a sip of his milk.       There's a pause.\n\n                                TURKISH (CONT'D)\n\n                    It's not the same.\n\n                                TOMMY\n\n                    What?\n\n                                TURKISH\n\n                    Milk, in these cartons.\n                                           i\n\n                                TOMMY\n\n                    You shouldn't drink that stuff any\n                    way.\n\n                                 \\\n\n\n                                TURKISH\n\n                    Why, what's wrong with it?\n\n                                TOMMY\n\n                    It's not in synch with evolution.\n\n                                TURKISH\n\n                    Shut up!\n\n                                T OMMY\n\n                    Cows have only been domesticated in\n                    the last eight thousand years, before\n                    that they were running around mad as\n                    lorries. The human digestive system '\"'\n                    hasn't got used to any dairy products\n                    yet, it takes a lot longer than that.\n\n                                TURKISH\n\n                    Well fuck me Tommy, what have you\n                    been reading?\n\n                                (MORE)\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n       CONTINUED: (2)\n\n\n91\n\n\n\n\n\n                               TURKISH (CONT'D)\n\n                  Cows mad as lorries eh? You hear\n                  about the two cows having a chat in\n                  a field? One says to the other,\n                  \"what do you think about this mad\n                  cows' disease then? The other one\n                  looks back and says \"doesn't bother\n                  me, I'm a duck.\n       Turkish looks back at him blankly.\n\n                               TOMMY\n\n                  Here let me do you a favour.\n       He reaches over and grabs the carton from Turkish, and throws\n       it out the window. The milk obviously hits an on-coming car\n     . in the other direction. There is a terrible crashing noise.\n       Tommy and Turkish come to a standstill, and look back to see\n       a small pile up on the other side of the road.\n\n                             TOMMY (CONT'D)\n\n                 What was in that milk?\n\n92     INT. BORIS' HOUSE\n\n\n\n\n       BTT, Hands and Rose Bud are standing over a safe. They are\n       looking at a whole pile of money. The case is open and Hands\n       is holding the stone.\n\n                             HANDS\n\n                 He's a sneaky fucker that Russian.\n                 Well shall we go?\n\n                             BTT    ·\n\n                 What you want to do about the Russian?\n\n                               HANDS\n\n                  I want to bury him.\n\n       EXT. BORIS1 HOUSE\n\n\n93\n\n\n\n\n       Hands, Tony and Rosebud walk out.\n\n94     INT. TYRONE'S CAR\n\n\n\n\n       The black guys witness this. Tyrone's now in the front seat\n       driving.                   .\n\n                             VINNY\n\n                 Well come on let's have em.\n       Pause while they consider this.\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n94    CONTINUED:    -\n\n\n\n\n\n                               VINNY (CONT'D)\n\n                   Well come on.\n\n\n\n\n                               SOL\n\n                   Not so fast Vin we can't get em now\n                   we gonna have to follow them.\n      B TT's car moves off.    The black guys follow.\n\n\n\n\n                                  TYRONE\n\n                   I ' l l move in. It'll be ok.\n\n\n\n\n                                SOL\n\n                   OK is very close to KO, and KO is\n                   close to R.I fucking.P. You know\n                   what RIP stands for Tyrone?\n\n                                TYRONE\n\n                   It stands for.\n\n                                SOL\n\n                   It stands for .shut your fuckin mouth\n                   Tyrone and leave the talking to us.\n                   Let's get these ready.\n\n                               TYRONE\n\n                   Do they fire?\n      Pointing to the guns.\n\n                              ' SOL\n\n                   Of course they fuckin fire?\n\n                                VINNY\n\n                   How do you know? They're replicas,\n                   what do you know about replicas?\n      Sol looks at the gun and frowns, \"what does he know about\n      replicas\"? He pulls the trigger. He fires one shot. It is\n      very loud, the gun goes off near Tyrone's ear, he buckles in\n     . pain. The car does a massive swerve and everything nearly\n      ends in disaster, all the windows shatter including the\n      windshield (but the glass stays put). Tyrone regains some\n      control over the car.\n\n                                VINNY {CONT'D)\n\n                   What the fuck do you think you're\n                   doing Sol?\n\n                                SOL\n\n                   Jesus, I didn't know it was that\n                   loud.\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n94   CONTINUED: -\n\n\n\n\n                             VINNY\n\n                Well just how fuckin loud did you\n                think it was going to be? It's a-\n                fucking gun Sol, guns are renowned\n                for making a loud fucking noise\n                whenever you pull the trigger.\n\n                            SOL\n\n                You wanted to see if they worked.\n\n                             VINNY\n\n                I didn't mean try it in the fuckin\n                car Sol.\n\n                             SOL\n\n                Well they work, I reckon they are\n                really going to put the shits into\n                em.\n\n                           VINNY\n\n               Right now I am not concerned with\n               putting the shits into em Sol, I am\n         \" \" . concerned about taking the pain out\n               of my ringing fucking ears. Look\n               what you did to poor Tyrone. Tyrone\n               you alright?\n     He taps Tyrone on the shoulder.     Tyrone looks up.\n\n                            VINNY (CONT'D)\n\n                Are you alright?\n     Tyrone spins in his seat and answers a little too loudly.\n\n                            TYRONE\n\n                I am fuckin deaf! What have you\n                done to my car?\n     They crash into the car in front.     Boris the Blade comes\n     flying through the windshield.\n\n95   INT. BTT CAR -- NIGHT\n\n     (This scene runs concurrently with scene 91)\n\n                            HNS\n\n\n                             AD-   .......\n\n                How we going to get rid of him?\n\n                            BTT\n\n                You want to shoot him?\n\n                              HANDS\n\n                I t ' s a bit noisy isn't it?\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n95   CONTINUED:    -\n\n\n\n\n\n                              BTT\n\n                  Well you want to stab him?\n\n                             -HANDS\n\n                  That's a bit cold blooded isn't it?\n\n                              BTT\n\n                  You want to kill him or not?\n\n                                ROSE BUD\n\n                  I' 1 1 cut him.\n\n                              BTT\n\n                  That's the spirit.   There's a sword\n                  back there.\n     He points to behind a seat: there is a bloody great sword\n     concealed. Tony skillfully passes the sword to Rose Budd,\n     who attempts to pull it out of its scabbard. Tony turns\n     round to Hands.\n\n                              BTT (CONT'D)\n\n                  You, you want a knife?\n     He passes Hands a knife.\n\n                              HANDS\n\n                  I wouldn't know what to do with it.\n\n                              BTT\n\n                  It's not a fuckin rocket launcher.\n                  It's a knife for gods sake, what\n                  have you used for to keep your fork\n                  company for all these years? It's\n                  got a sharp side and a blunt side.\n                  You want a lesson?\n     There is a sudden bang on the windshield and BTT turns back\n     to the front only to see the windshield covered in milk.\n     Tony can't see where he is going and searches for the\n     windshield wipers. While this is happening the car swerves\n     to the side and hits a lamp post. They crash and the boot\n      (trunk) has flown open and Boris the Blade tries to lift\n     himself out. Rose Bud looks down at the sword he has been\n     extracting he can see he very nearly cut himself in two.\n     Tony pulls himself up from the steering wheel he has a trickle\n     of blood running down his face. There's a crash and a car\n     hits em from behind.\n\n96   INT. TYRONE'S CAR --NIGHT\n\n\n\n\n     They too are recovering from the accident. And Boris has\n     now come headfirst through the windshield.\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n96   CONTINUED:   -\n\n\n\n\n\n                              VINNY\n\n                  You idiot what have you done?\n\n                              SOL\n\n                  Is that Boris?\n\n\n\n\n97   INT. BTT'S CAR\n\n\n                              HANDS\n\n                  What happened?\n\n                              BTT\n\n                  We hit something and something hit\n                  us.\n     He turns and sees that Rose Bud has got a sword sticking\n     though him. It's gone through him and the seat that he is\n     sitting on.\n\n98   INT. BLACK GUY'S CAR\n\n\n\n\n\n                              SOL\n\n                  Let's hit em now.\n\n                              VINNY\n\n                  The is a dead Russian on my lap Sol\n                  I am not thinking about hitting\n                  anybody right now.\n\n                              SOL\n\n                  Well you better start thinking Vince\n                  because otherwise you'll be fuckin\n                  lucky if you end up looking like\n                  that.\n\n99   INT. BTT'S CAR    .\n\n\n\n\n\n                              BTT\n\n                  You alright?\n\n                              HANDS\n\n                  No I am about a rocket ride from\n                  right Tony.\n\n                              BTT\n\n                  I mean do you feel alright?\n\n                              HANDS\n\n                  Ohh yeah, I feel like I am lying on\n                  the naked lap of Aphrodite, cooled\n                  by the tumbling petals of spring\n                  roses, how the fuck do you think I\n                  feel?\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n99     CONTINUED:     -\n\n\n\n\n\n                                BTT\n\n                    Hold tight big man, and put your\n                    guns away. Let's get going.\n\n                                HANDS\n\n                    What about Rose Bud?\n\n                                BTT\n\n                    Well you can bring him with you if\n                    you want but which bit do you want\n                    to bring?\n\n\n\n\n100    INT. BLACK GUY'S CAR\n\n\n                                SOL\n\n                    They are getting out.\n\n                                VINNY\n\n                    Well get down, the last thing we\n                    want him to see is three brothers\n                    wearing ski masks.\n\n1.01   INT. CAFE\n\n       BTT and Hands, covered in blood, walk off the street into a\n       cafe.\n\n                                HANDS\n\n                    I gotta clean up.\n       He goes out the back while BTT goes to the pay phone to call\n       Doug.\n\n102    EXT. STREET\n\n       The black guys pile out of the car and follow BTT and Hands\n       at a safe distance.\n\n103    INT. CAFE\n\n       BTT is on the phone\n\n                                BTT\n\n                    Doug, we are in the shit, come and\n                    pick us up.\n\n104    EXT. BORIS1 HOUSE\n\n       Tommy and Turkish pull up outside Boris' house.\n\n                                TURKISH\n\n                    He's left the door open.\n\n\n\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n104   CONTINUED:    -\n\n\n                               TOMMY\n\n                   I shouldn't think that's a good idea.\n                   Shall we have a look?\n\n                               TURKISH\n\n                   I don't want to go in there, he's a\n                   dangerous bastard, taken too many\n                   disco biscuits in the heat of Russian\n                   disputations, he's got as many of\n                   these nuts as those nuts.\n\n\n\n      He grabs his groin and circles his finger and his temple\n\n                                 TOMMY\n\n                   I don't care if he's got fuckin hazel\n                   nuts, I want a gun that works.\n\n                                 TURKISH\n\n                   Well come on then before the Germans\n                   get here.\n\n105   EXT. CAFE              .                   .\n\n      The black guys have followed BTT and Hands and are waiting\n      outside, readying themselves for action.        .\n\n                            SOL                                    '   .\n\n              . Now Tyrone you go... Tyrone, oi\n                Tyrone.\n      Tyrone can't hear a thing.\n\n                               VINNY\n\n                   I'11 never forgive you Sol.\n      Sol taps Tyrone on the shoulder.\n\n                               SOL\n\n                   When we get in you wait by the door\n                   I am number one, Vin number two and\n                   you are number three.\n\n106   INT. CAFE\n\n      The black guys enter. BTT has just finished his phone call\n      and sat down.   .     -.\n\n                               SOL\n\n                   I don't want a fuss and I don't want\n                   to put a bullet in your face, but\n                   unless you give me exactly what I\n                   want there will be murders.\n      BTT shakes his head in amazement.\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n106   CONTINUED:    -\n\n\n                               SOL (CONT'D)\n\n                   Number three pull the blind down.\n\n\n\n      Tyrone can't hear this request.\n\n                               VINNY\n\n                   lo number three, he said pull the\n                   blind down.\n      He still can't hear him.       This is minorly embarrassing.\n\n                               VINNY (CONT'D)\n\n                   I'll sort it.   .\n\n\n\n\n                               SOL\n\n                   Stand up!\n\n                               BTT\n\n                   Excuse me, but who the fuck are you?\n\n                               SOL\n\n                   You hear what .1 said? Stand up,\n                   unless you're crippled.\n\n                               BTT\n\n                   Do I look crippled?                               ,\n\n                               SOL\n\n                   You'll look fucking dead, unless you\n                   stand up.\n      Sol cocks the gun and Tony pulls a sarcastic 'I am shocked'\n      face.\n\n                               BTT\n\n                   You got ballsl\n\n                               SOL\n\n                   You want to test em?\n\n                               BTT\n\n                   There are two types of balls, there\n                   are big brave balls and there are\n                   little mincy faggot balls.\n\n                                           '-- - * ' . - ·\n\n                          ·p- WNNY     .\n                   You're a dead man talking. These\n                   are your last words so make them a\n                   prayer.\n      Vinny takes aim.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n106   CONTINUED: (2)\n\n\n\n\n\n                            BTT .\n\n                So you're obviously the big dick,\n                and they on either side of you, must\n                be your balls.\n      Vin goes to hit him with the gun but it's caught by Tony,\n      Vin tries to pull the nose out of Tony's hand but he can't\n      move it. Sol steps forward and raises his gun.\n\n                            SOL\n\n                Let go of the gun.\n\n\n\n      Vinny cocks his gun.   There is a pause and eventually Tony\n      lets go of it.\n\n                            BTT\n\n                I am talking for your benefit. Now\n                dicks have drive, and clarity of\n                vision.\n      Tony starts to build himself a complicated looking weapon\n      under the table, unseen by the black guys. He takes bits\n      out of one sock and bits out of another sock.\n\n                             BTT (CONT'D)\n\n                But they're not clever, they smell\n                pussy, and they want a piece of the\n                action, and the dimmer the dick, the\n                less he cares about the consequences,\n                and you thought you smelt gooood ol\n                pussy, and have brought your little\n                mincy faggot balls along for a gooood\n                ol time, but you have got your parties\n                muddled up, there is no pussy here,\n                just a dose to make you wish you\n                were born a woman.. . .\n      We cut to the shell shocked brothers, and the almost\n      completely built weapon.\n\n                             BTT (CONT'D)\n\n                And just like a prick, you are having\n                second thoughts; you're shrinking,\n                and your little balls are shrinking\n                with you.\n      They stare on. The brothers have lost this one and they\n      know it. They start to reverse. BTT lets the odd chicken\n      cluck out the corner of his mouth, Vinny misses his step and\n      waves his gun about in a futile effort to look mean. They\n      back away into the corridor down to the back door of the\n      cf. . .\n       ae                                                     ·\n\n\n\n\n 107   INT. CORRIDOR -- CONTINUOUS\n\n       ...and just as they turn the corner they bump into Hands\n       still drying his hands, they can see that he's carrying a\n       case that they recognize. The brothers adapt to their new\n       scenario:\n\n                               VINNY\n\n                 Pass it me.\n       Hands hesitates.\n\n 108   INT. CAFE.-- CONTINUOUS\n\n\n\n\n       BTT can hear that the black guys and Hands have run into\n       each other and pulls out the complicated looking gun which\n       is now in one piece. BTT cocks the gun and aims it at the\n       wall which the brothers would be behind, he follows the wall\n       simulating the speed of their journey.\n\n 109   INT. .CORRIDOR -- CONTINUOUS\n\n\n\n\n\n.-.'-..                      VINNY\n\n                 I won't ask again\n       He raises his gun. A covey of bullets perforates the wall,\n       one hitting Vin in the hand. The brothers take the\n       opportunity to duck. Hands dives for cover too and drops\n       the bag. A continuation of bullets comes flying through the\n       wall. The black guys take the opportunity to pick the bag\n       up and leg it.\n\n 110   INT. CARAVAN\n\n\n\n\n\n       I AM AFRAID THAT THIS SCENE HAS TO WAIT UNTIL I HAVE BEEN TO\n\n\n       A IRISH TRAVELERS WAKE. I'LL BE ABOUT FOUR MINUTES LONG.\n\n\n       IF YOU HAVE ANY IRISH RELATIVES THAT HAVE DIED RECENTLY DON'T\n\n\n       HESITATE TO CALL.\n\n\n\n\n\n 111   INT. BRICK TOP'S PUB\n\n\n\n\n       The brothers are standing in front of Brick Top, they move\n       uneasily from foot to foot. Brick Top examines the stone.\n       He looks up.\n\n\n\n\n                             BRICK TOP\n\n                 Quite a lump. Alright you can go         '\n                 now .        '\n\n                             SOL\n\n                 Any chance of taking Lincoln with\n                 us?\n\n                             BRICK TOP\n\n                 That's where Errol's taking ya.\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\nIll   CONTINUED:\n      They turn and Errol is waiting for them.\n\n                             ERROL\n\n                Follow me.\n      They go out of one room into another, and Errol shuts the\n      door behind them. Vin looks uncomfortable. Another door is\n      opened and a man brings out Lincoln. Lincoln is in bad shape\n      and is relieved to see familiar faces, they are now shut in\n      a room .\n\n                             SOL\n\n                You alright Lincoln?\n\n                            ERROL\n\n                Do you know why the governor is the\n                governor?\n\n                             VINNY\n\n                Err. .\n\n                             ERROL\n\n                I t 's because people are scared of\n                him. You know why they are scared\n                of him?\n\n                             SOL\n\n                Err .\n\n                            ERROL\n\n                It's because of stories. I am sure\n                you've heard one or two of those\n                stories. For example, did you hear\n                about the three black fellas that\n                did a very bad thing, however they\n                made some effort to redeem that very\n                bad thing, so the governor saw fit\n                not to kill em. He thought it would\n                be a more advantageous concept to\n                let them kill each other and let the\n                survivor live to tell the tale.\n                That way everybody wins, well, all\n                except the two that died of course.\n      We look at the table where we see three large kitchen knives\n      sitting provocatively. Tyrone rushes for one of the blades\n      grabs it and runs at Vin, Vin sidesteps and Tyrone keeps\n      running straight into the arms of Errol who raises his gun\n      at the last moment. Tyrone slides the blade into Errol 's\n      ribs and Errol fires a shot straight at Tyrone. The bullet\n      passes through Tyrone and hits John in the throat . Vin,\n      Lincoln and Sol are left wondering what the fuck has just\n      happened .\n\n\n\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n111   CONTINUED:    (2)\n\n\n\n\n\n                                   BAD BOY LINCOLN      ,\n\n                    Grab it.\n\n\n\n\n                                   SOL\n\n                    What?\n\n\n\n\n                                VINNY\n\n                    The gun you prick.\n      Sol goes for one, and Vin goes for the other.\n\n112   INT. CARAVAN, PIKEY CAMPSITE\n\n\n\n\n      There is a wake in motion. We cut to Micky and Turkish. It\n      is obvious that a lot of hard core drinking has been going\n      on, and there is an Irish band playing. The is a coffin in\n      the middle of a caravan that is closed for obvious reasons\n      i t ' s surrounded by heavy looking lads. The is a man dancing\n      on one of the tables.\n\n      THIS SCENE I SHALL BE FILLING IN SHORTLY BUT I AM AFRAID YOU\n\n\n      HAVE TO WAIT TILL I HAVE BEEN TO A IRISH WAKE. ALL AS I\n\n\n      KNOW IS THAT RATHER IRONICALLY THEY ARE FUN. HOWEVER I LIKE\n\n\n      JUXTAPOSITIONS OF MICKY SINGING AND CRYING SIMULTANEOUSLY.\n\n\n113   INT. DOUG'S OFFICE            '\n\n      All three black guys are sitting in front of BTT and Hands\n      and Doug. There is silence as the white guys have just been\n      told something disturbing. BTT eventually breaks the silence\n\n                               BTT\n\n                   Well you gotta admire their balls.\n\n                                HANDS\n\n                   _ I don't want to admire balls that I\n                    want to chop off.\n\n                                SOL\n\n                    What choice did we have?\n\n                                VINNY\n\n                    I know sorry doesn't mean fuck all,\n                    but we are game on, what do you want\n                    us to do?\n\n                                ·HANDS\n\n                    Get us that stone back.\n\n                                BTT\n\n                    So Brick Top has now got the stone?\n\n                                   VINNY\n\n                    He's got it.\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n113   CONTINUED:\n\n\n                               HANDS\n\n                   You wouldn't be lying to us would\n                   you now?\n\n                                SOL\n\n                   Why should we? Could just have\n                   disappeared.\n      Cut to Hands who's thinking.\n\n                                HANDS\n\n                   Okay.\n\n114   INT. BRICK TOP'S PUB\n\n\n\n\n      BTT and Hands are at the bar.\n\n                            BARMAN\n\n                You got some front coming round here\n                ain't ya Tony?\n\n                            BTT\n\n                Never mind what I got , I am looking\n                for Brick Top?\n\n                           BARMAN\n\n               You mean Mr Mclean.\n\n                           BTT\n\n               You know who I mean you fucking fringe\n               now find him.\n      Pause: the barman looks truculent.\n\n                                BTT (CONT'D)\n\n               Chop chop.\n\n\n\n      The barman walks down the end of a bar and picks up the phone.\n\n                            HANDS\n\n                What was it you did exactly Tony?\n\n                            BTT\n\n                I had a little run in with a few of\n                the chaps.\n\n                                HANDS\n\n               How ' s that ?\n\n                            BTT\n\n               They're all brainless, they got white\n               powdered angels sitting on their\n               shoulders telling them what was what,\n               all too busy. . .\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n114   CONTINUED: -\n\n      He sticks his finger by the side of his nose and inhales.\n\n                              BTT (CONT'D)\n\n                If they weren't sniffing the dust\n                they where flicking the ash. And\n                never trust who puts anything other\n                than a finger up his nose.\n      KEN, another of Brick Top's men, appears from somewhere and\n      approaches Tony with another heavy, SEAN.\n\n                              KEN\n\n                Follow me.\n      They do and end up in a corridor. The door .shuts behind\n      them and the door in front hasn't yet opened. Ken turns\n      around and faces Tony.\n\n                              KEN (CONT'D)\n\n                Did you know that it was my cousin\n                Lorrie you stabbed?\n      There is a pause.    The situation is volatile.\n\n                             BTT\n\n                Yes I know I stabbed a man called\n                Lorrie, but no I didn't know he was\n                related to a tub a shit.\n      Ken knows it's on.\n\n                             KEN\n\n                Shut that door Sean.\n\n                             BTT\n\n                Lock that fuckin door Sean.\n      BTT takes a step forward and puts his hand, into the back of\n      his trousers. He starts to growl.\n\n                              BTT (CONT'D)\n\n                 You're a big man, but I don't care\n                 if you're ten foot fuckin tall, you\n                 still got eight pints of blood and\n                you'll bleed like any bastard. And\n              . when.I drop .ya, and I will fuckin\n                drop ya, I'll open you up like a\n                packet of crisps.\n\n\n\n      Pause to take in what has just been said then he continues.\n\n                              BTT (CONT'D)\n\n                You're a bully Ken, but remember, I\n                am a bigger bully.\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n114   CONTINUED: (2)\n\n\n\n\n      The door opens and they are interrupted by another HEAVY.\n\n                              HEAVY FELLA\n\n                Ha, Ken what' s going on? Bring em\n                through. The governor wants to see\n                em.\n      Ken is relieved by the interruption, and he leads the way\n      with a truculent \"you're lucky\" stare. They enter Brick\n      Top's office.\n\n                              BRICK TOP\n\n                I gotta say you have got some front\n                coming round here Tone, you know the\n                lads are picking straws. . .\n      Interrupted\n\n                             BTT\n\n                You gotta diamond and it doesn't\n                belong to you, it belongs to my\n                colleague here.\n\n                             BRICK TOP\n\n                That's what I love about you Tone,\n                no small talk.\n\n                            BTT\n\n                I said we should come round and raise\n                fuckin hell, you know shoot a few of\n                the boys and that, but he said he\n                thinks we would have more success if\n                we paid for it. So I am going to\n                have a drink and let you two discuss\n                what you have to discuss.\n      Btt walks to the bar.   Ken is sitting there with Sean.\n\n                              BTT (CONT'D)\n\n                Alright big man, I hope you aren't\n                bitter about your cousin Lorrie.\n      If you listen carefully, you will hear a slight zip of flies\n      being undone.\n\n                             KEN\n\n                You know you're alright when they're\n                are talking business, I ' d like to\n                see you gob off outta here.\n\n                            BTT ·\n\n                Ohh do me a favour Ken, you've always\n                been mouth and no trousers.\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n114   CONTINUED: (-3)\n\n\n\n\n      We cut back to Brick Top and Hands\n\n                             HANDS                        -\n\n                 I 'l l pay for it, I won't pay you the\n                 top fuckin whack but you'll never\n                 get that anyway. You got it?\n\n                             BRICK TOP\n\n                 I can't sell you something I haven't\n                 got now can I?\n      BTT returns to them - there is a scream from Ken\n\n                             KEN\n\n                 You're a dead fuckin man. You listen\n                 to me Tony you're a dead fuckin...\n      Brick top frowns at Ken, and Ken shuts up quickly.\n\n                             BRICK TOP\n\n                 What did you do to upset Ken, Tony?\n      Tony shrugs\n\n                             KEN\n\n                 He's pissed in my fuckin pocket,\n                 look!\n      Ken shows off a wet-sided jacket and a damp set of trousers.\n\n                             BRICK TOP\n\n                 Do shut up Ken.   That was a bit\n                 naughty Tony.\n      Tony shrugs. Brick Top puts his hands in to his pocket and\n      withdraws the stone. We cut to Hand's expression.\n\n                             HANDS\n\n                 Well come on, let's have a look.\n      Brick Top passes the stone to Hands. All goes quiet while\n      everybody focuses on the stone. Hands lifts it up to his\n      eye.\n\n                             HANDS (CONT'D)\n\n                 What are you playing at? -\n      He drops the stone: it smashes on the ground.\n\n                             HANDS (CONT'D)\n\n                 It's a zirconia.\n      We crash track in to Brick Top's expression of shock.\n\n\n\n\n115   INT. VAULT(DOUG'S OFFICE)\n\n\n\n\n      The four black guys are trying to pick the lock of the vault,\n      having been locked in it by Bullet Tooth, Hands and Doug.\n\n                               VINNY\n\n                   I changed the stone.\n\n                                SOL\n\n                   You what?\n\n                               VINNY\n\n                   I changed it. I know Brick Top knows\n                   nothing about stones.\n\n                               SOL\n\n                   Yes but Doug the fuckin head does!\n\n\n\n\n                               VINNY\n\n                   Yeah well I didn't expect them to\n                   lock us up in here did I?\n\n                               SOL\n\n                   Ohh your one clever bastard Vin, you\n                   really are. Where is it?\n\n                               VINNY\n\n                   It's at Lincoln's.\n\n                               BAD BOY LINCOLN\n\n                   What the fuck's it doing at my place?\n\n                               VINNY\n\n                   Waiting for us to pick it up.\n\n                               SOL\n\n                   What happen if they find that it's a\n                   fake stone Vince?\n\n                               VINNY\n\n                   Well we are going to get fucked Sol\n                   what do you think is going to happen?\n      The door opens.\n\n                               BTT\n\n                   Ohh yes you are going to get fucked\n                   Vince.                 -\n\n116   INT. DARK.\n\n\n\n\n      A distant voice is shouting\n\n                                TURKISH\n\n                   Oi Micky.   Oi Micky.\n\n\n\n\n117 ' INT. VAN -- NIGHT\n\n      We fade out of black to Micky's pov. Thisis shot in slow\n      motion. Micky opens his eyes, in the backof.a large van,\n      there is only one faint light that moodilyilluminates his\n      tired eyes.\n\n                            TURKISH\n\n                You feeling alright Micky?\n\n                            MICKY\n\n                I've felt better.\n\n                            TURKISH\n\n                We are nearly there. They are a\n                horrible bunch this lot Micky so pay\n                attention to what you are doing.\n      Micky just yawns.\n\n                             TURKISH (CONT'D)\n\n               Put up some kind of a show, he's a\n               hard bastard this \"good night\"\n               Anderson so don't get too clever, he\n               used to be a pro. Just keep moving\n               round the ring, and let the odd one\n               go when push has come to shove.\n\n                            MICKY\n\n                Let's get on with it, shall we?\n\n118   INT. WAREHOUSE                                -    '\n\n      A temporary ring has   been erected, four scaffolding posts\n      with welded on hoops   make the arena, the ropes that are\n      threaded through the   hoops are industrial nylon and free of\n      padding. Around the    ropes it's starting to fill. Brick Top\n      approaches Salt Pete   and Jack 'the all seeing eye'.\n\n                            SALT, PETER\n\n                I hope we gonna get a better show\n                this time.\n\n                            BRICK TOP\n\n                This will make up for it.     Micky's\n                going down in the fourth.     Terry\n                over there is in charge of   the bets.\n                Now you'll have to forgive   me.\n      Brick Top leaves with Ken.\n\n\n\n\n                            BRICK TOP (CONT'D)\n\n                Have we got the lads at the- camp\n                site?\n\n\n\n\n\n\n\n                                                (CONTINUED)\n\n\n\n\n\n118   CONTINUED:\n\n\n                               KEN\n\n                   Yeah they are there.\n      Cut to a shot of some of Brick Top's heavies waiting in a\n      car outside the campsite.\n\n                               BRICK TOP\n\n                   Where's that fuckin pikey?\n\n119   INT. BACK OF WAREHOUSE\n\n\n\n\n      Brick Top is standing in front of Micky whose eyes are still\n      semi open.\n\n                            BRICK TOP\n\n                What's wrong with you? You stoned?\n                Is he fuckin stoned?\n\n                            TURKISH            .   -\n\n                He's like that before a fight.\n      He turns his attention to Micky.\n\n                           BRICK TOP\n\n               Now you know when you're going down?\n\n                              TURKISH\n\n               Of course he knows when he's going\n               down.\n\n                           KEN\n\n               Hey fuck face, who's speaking to\n               you? He asked him didn't he?\n\n                           TURKISH\n\n               Fuck face? I like that, I ' l l have\n               to use that one next time -I want to\n               impress your mum Ken.\n\n                           MICKY\n\n               The fourth... or was it the fifth..\n\n                           BRICK TOP\n\n               There's a campsite full of pikies\n               that might not think you're so fuckin\n               funny when they 'are putting the flames\n               out on their children's backs.\n      Cut to a shot of Brick Top's boys lighting a cigarette in\n      the car outside the pikies.\n\n\n\n\n120   INT. WAREHOUSE\n\n      Micky appears from a small door at the back of the warehouse.\n      He approaches the ring accompanied with shouts of\n      encouragement and counter shouts. He's wearing a pair of\n      semi cut tracksuit bottoms and a t-shirt with grease marks\n      down the front. Turkish walks behind him, Micky still looks\n      bored. He climbs into the ring. Then from the same door as\n      the one through Micky came out walks a larger character with\n      a nose that appears to have seen countless rounds with a\n      frying pan: HORACE 'GOOD NIGHT1 ANDERSON.\n\n                            THE REFF\n\n                Alright lads no eye gouging no biting.\n                Do your worst. Back to your corners.\n\n\n\n      We drift again into Micky's pov, his world is becoming more\n      and more surreal. He can faintly hear Turkish whispering\n      words to him, but he's not really listening. A bell comes\n      from somewhere, and Micky instinctively walks to the center\n      of the ring. \"Good night\" is already there, they pace one\n      another for a second or two, Micky avoids a punch or two and\n      then he takes a hard one and he knows it, we flash to white,\n      Micky's in trouble: he lets one of his missiles go and BANG\n      it shakes \"good night\" to his core, all goes quiet. We go\n      to super slow motion: his knees buckle and \"good night\" is\n      in trouble. Micky maintains a frown as he watches his\n      opponent's knees threaten to betray him. The crowd tries to\n      digest what is happening. After a period of silence reality\n      dawns. Brick Top mouths the words in silence.\"Don1t go down\n      you fucker\". The crowd wants Micky to finish the job. But\n      common sense reins back the coup de grace. \"Good night\"\n      eventually regains control of his legs and stumbles forward,\n      after a few sleepy punches he starts to provide a serious\n      onslaught.\n\n\n\n\n                            TURKISH\n\n                I don't like the look of this Tommy,\n                bring the van up to the back door.\n      This goes on for two rounds (which is montage down to a few\n      seconds). We go in the mind of poor Micky. We break the\n      music just as it's starting to look dangerous... The bell\n      goes and Micky walks to the wrong corner. Turkish pulls him\n      back to his corner.\n\n                            TURKISH (CONT'D)\n\n               They are on ya. You got to hurt him\n               Micky. Otherwise we are\n               rumbled.... you hear me Micky? Do\n               -something, it looks like it' s rigged.\n      Micky goes out again his hands are low, BANG there is a flash\n      of white as Micky goes down in the dirt. Dust rises from\n      where he fell. He gets up quickly, his hands are still low,\n      BANG he goes down again, in no time he's up.\n\n\n\n\n                                              (CONTINUED)\n\n\n\n\n\n120   CONTINUED:    -\n\n      BANG: he hits the ground again and this time when he hits\n      the deck, he penetrates the dust covered floor, like i t ' s\n      made out of water. He falls through the water like he's\n      sinking; his eyes are open and he can't breathe, he continues\n      to fall, but he's unpanicked (he is now Micky 1). When Micky\n      1 looks up he can see himself in the corner of the ring takin\n      kidney punches from Good Night, he's winded and only semi-\n      conscious (this is Micky 2). Micky 1 makes the effort to\n      swim up and tries to penetrate the floor but he's stuck he\n      can't get through. Micky 2 takes more punishment in the\n      ring, as Micky 1 ' s hand continues to try to break the\n      underside of the floor but it stretches like rubber and forces\n      Micky 1 down again. Micky 1 looks up again and sees how\n      much trouble Micky 2 ' s in the ring. Micky 1 is panicking\n      now, he's running out of oxygen and Micky 2's being beaten,\n      Micky 1 starts -to sink again but now flames tickle the bottom\n      of his feet he looks up. and sees Micky 2 being smashed to\n      hell, his body eventually collapses and Micky 2 falls through\n      the floor. And as the latter falls through, Micky 1 manages\n      to rise from the depths and his punch manages to perforate\n      the surface. The punch continues its trajectory and has the\n      power to fell a red blooded rhino.... it catches \"Good Night\"\n      on the jaw and it's good night for \"Good Night\" it's unlikely\n      that he'll awake in the next hour. Dear oh dear everybody\n      is in trouble.\n\n\n\n      Again we cut to the reactions of the relevant parties.\n\n                               TURKISH (CONT'D)\n\n                   Tommy get the van.\n\n\n\n\n                               TOMMY\n\n                   I have it, it's waiting.\n      Turkish jumps into the ring and grabs Micky.\n\n                               TURKISH\n\n                   We are off Micky, hold tight, and\n                   move quickly. ,\n      Turkish pulls Micky away. It's not as hard as it might be\n      trying to get out, because the crowd seems to have found its\n      own disputes, chairs start to fly. Brick Top's boys are\n      frustrated in the mayhem. Brick Top calmly dials into his\n      mobile telephone. It rings.\n\n                                                                     1\n\n\n121   EXT. CARAVAN, PIKEY CAMPSITE\n\n      Darren picks up the phone.\n\n                                DAREN      .\n\n                   If you would you like to speak to\n                   your friends, you'll have to speak a\n                   little -louder.\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n121   CONTINUED:\n\n      We pull back to see four slumped heads in the car and blood\n      staining the windscreen. Brick Top calmly puts the phone\n      down.\n\n                               BRICK TOP\n\n                   Right lets get outta here.\n      Brick Top is looking every which way and trying to get out\n      of there, accompanied by Ken.\n\n                               BRICK TOP (CONT.'D)\n\n                   Where's the car Ken?\n\n\n\n\n                                  KEN\n\n                   I t ' s coming now.\n\n                               BRICK TOP\n\n                   We are outta here.\n      They come out of a side entrance, their car pulls round the\n      corner and screeches to a halt. Brick Top opens the door as\n      he is about to get in, he's eyes widen to the size of saucers\n      as FOUR MEN (who we recognize from the wake) are sitting in\n      the place of his driver. They both have sawed-off shotguns\n      and empty four barrels into the chest of Brick Top and Ken.\n      The car spins away, leaving their twitching bodies on the\n      dirt.\n\n                                                                       :\n\n\n122   INT. BAD BOY LINCOLN'S HOUSE                                 .\n\n\n\n\n      Hands, Doug and Bullet Tooth have Vin, Sol and Bad Boy Lincol\n      in tow. They look at the front room of Lincoln's house.\n\n                               HANDS\n\n                   Very nice Lincoln.\n\n                               BTT\n\n                   Veeeery nice Lincoln.\n\n                               BTT (CONT'D)\n\n                   Well where is it?\n\n                                VINNY\n\n                   Next door.\n      They open the door.\n\n123   INT. BAD BOY LINCOLN'S SITTING ROOM.\n\n\n\n\n      This room is a complete mess. All the colony leather has\n      been chewed up beyond recognition. They all grimace at the\n      smell. The dog comes running up\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n123   CONTINUED:    -\n\n\n\n\n\n                                    B AD BOY LINCOLN\n\n                   Look what your dog's done to my\n                   leather.\n\n                                BTT\n\n                   It's a bit funky in here.\n      BTT opens a window.       The dog looks extremely relieved to see\n      someone.\n\n                                    HANDS\n\n                   You keep a good house Lincoln.      So\n                   where's this stone?\n\n                                VINNY\n\n                   It was over there.\n      He points to a pile of chewed up cushions.\n\n                                    HANDS\n\n                   Where?\n\n                               VINNY\n\n                   We left it in a box over there...\n                   somewhere.\n      He walks over and finds the remains of the box.\n\n                                    VINNY (CONT'D)\n\n                   I t ' s empty.\n\n\n\n\n                                    HANDS\n\n                   Tony.\n\n                               BTT\n\n                   Dear oh dear.\n\n                               SOL\n\n                   He's not fuckin about, we left it\n                   there. It must be in the dog.\n      All eyes focus on the dog.\n\n                                HANDS\n\n                   Well let's have a look shall we?\n                   . . . . Tn .\n                           oy\n      All eyes focus on Tony.\n\n                                    BTT\n\n                   What?\n\n                             HANDS\n\n               Have a vlook in the dog.\n\n      .·\n\n\n\n\n\n                                                       (CONTINUED)\n\n\n\n\n\n123   CONTINUED: ( 2 )\n\n\n\n\n\n                               BT T\n\n                  What do you mean have a look in the\n                  dog?\n\n                               HANDS\n\n                  I mean open him up..\n      Tony is not sure about this.\n\n                               BTT\n\n                  I t ' s not a fuckin tin of baked beans,\n                  what do you mean open him up?\n\n                              HANDS\n\n                  I mean open him up.\n      Hands does a movement that represents a knife across the\n      throat.\n\n                             BTT\n\n                 That's a bit strong isn't it?\n\n                             HANDS\n\n                 You wouldn't have a problem if it\n                 was a person.\n\n                               BTT\n\n                 But it's not, it's a dog and I have\n                 never done a dog.\n\n                             HANDS\n\n                 My heart bleeds.\n      There is another pause\n\n                            ,BTT\n\n                 What dp I do?\n\n                              HANDS\n\n                  Let me take a wild and reckless guess.\n                  Stick a knife in his guts and see if\n                  it's got a diamond in there? I'll\n                  hold it still and'you open it up.\n      Tony looks positively unsure and rocks his head from side to\n      side.\n\n                              BTT\n\n                  Fuckin hell, alright then.\n\n                              VINNY\n\n                  You can't do that.\n\n\n\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n123   CONTINUED: (-3)\n\n\n\n\n\n                             HANDS\n\n                 Well do it to you as well if it makes\n                 you feel any better.\n      Cut to Tony having some problems trying to get hold of the\n      awkward dog. The dog starts to squeak. Tony passes the\n      blade to Hands.\n\n                                BTT\n\n                 I t ' s squeaking.\n\n                               HANDS\n\n                 What, you've never heard a dog squeak\n                 before?... Hold him still.\n      The dog isn't sure about this either.      Vin is in a panic and\n      suddenly.\n\n                            VINNY\n\n                 Stop! I can see it.   I can see the\n                 stone.\n      Hands at the point of entry stops. Vinny hops over to the\n      stone and picks it up. Tony lets the dog stand but keeps a\n      grip oh the collar. The dog is relieved to be semi-liberated.\n      Hands is still on his knees armed with an incredulous stare.\n\n                             HANDS\n\n                 Well let's see it.\n      Vinny holds it up. There's a sense of relief. He then throws\n      the stone, it cuts through the air. And the dog seeing\n      .another projectile runs to intercept it. There's a pause\n      while all now focus again on the dog. This is digested\n      literally and mentally. The dog recognizes all the attention\n      it's receiving. And goes through the motions of swallowing\n      it. Hands attempts an approach. The dog understandably\n      feels uncomfortable about the advancing vanguard and decides\n      emergency action is needed, and seeing the open window\n      launches itself out of it.\n\n      FADE TO BLACK\n\n\n      FADE UP\n\n\n124   EXT. CARAVAN CAMP SITE                                             ;\n\n      The pikies have moved overnight.\n\n                             SOL\n\n                 Well this is where they were.\n\n\n\n\n\n\n\n\n\n\n                                                 (CONTINUED)\n\n\n\n\n\n124   CONTINUED:    -\n\n\n                               HANDS\n\n                   Well they aren't fuckin here now are\n                   they? And I can't see a dog can\n                   you?\n\n                                VINNY\n\n                   They can't be far.\n\n125   INT. CAR\n\n      Hands, BTT and the black guys are back on the road.\n\n                               HANDS\n\n                   You gonna have to come up with\n                   something.\n      Just then they see some caravans in the distance.\n\n                               VINNY\n\n                   There they are.\n\n126   INT. NEW CARAVAN CAMP SITE\n\n      All the caravans are fastened to the back of cars. Vinny,\n      Sol, BTT and Hands are standing in front of Micky.\n\n                             MICKY\n\n                 Well he's didn't come back to us.\n\n                               VINNY\n\n                   But he always came back.\n\n                             MICKY\n\n                 Well you might have noticed that we\n                 have moved, you should have fed him\n                 more, a dog will never leave you if\n                 you feed it properly. It was a good\n                 dog, he had a little flatulence\n                 problem but was a good dog.\n\n                               HANDS\n\n                   Are you sure he's not here?\n\n                               MICKY\n\n                   I think I would have noticed if a\n                   fuckin dog was sitting in my caravan\n                   don't you? Tommy, Turkish, have you\n                   seen a dog sitting in me caravan?\n\n                               TURKISH\n\n                   I can't say I have Micky.\n\n                               MICKY\n\n                   See there you have it.\n\n                                                  (CONTINUED)\n\n\n\n\n\n126   CONTINUED:\n\n\n                               HANDS\n\n                   Do you mind if we have a look around?\n\n                               MICKY\n\n                   What the fuck's got into you lot?\n                   It's only a dog. I'l l give you\n                   another one, if it means that much\n                   to you.\n\n127   EXT. CARAVAN CAMP SITE\n\n      Vinny, Sol, BTT and Hands descend the steps, they look like\n      children with their toys taken away.\n\n                             HANDS\n\n                 You better find me that dog, skinny\n                 Vinny.\n\n\n\n      One of Micky's kids is on the bottom of the caravan steps as\n      the brothers walk by.\n\n                              . KID 1\n\n                   I looked after your car for ya.\n\n                               HANDS\n\n                 So?\n\n                             KID 1\n\n                 So aren't you gonna pay me?\n\n                             BTT\n\n                 Yeah bollocks.\n\n                             KID 1\n\n                 Bollocks to you, you tight git.\n\n                             VINNY\n\n                 Watch your mouth you cheeky shite.\n\n                             KID 1\n\n                 Yeah fuck ya.\n      The kid turns away and goes back to squeezing a toy.   All\n      four of the chaps stop in their tracks.\n      Cut to shot of squeaky toy. We have seen this toy before.\n      Cut to freeze frame of Sol, Vin, BTT and Hands stopped dead\n      in their .tracks. They haven't turned to look over their\n      shoulders yet, but their eyes are turning to look.\n\n\n\n\n\n\n\n      THE END.\n\n\n\n\n\n\n\n\n\n\nSnatch\nWriters :   Guy Ritchie\nGenres :   Comedy  Crime\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "After stealing an 86-carat (17.2 g) diamond in a heist in Antwerp, Franky \"Four-Fingers\" goes to London to deliver it to diamond dealer Doug \"The Head\" on behalf of New York jeweller \"Cousin Avi\". One of the other robbers advises Franky to obtain a gun from ex-KGB agent Boris \"The Blade\". Unbeknownst to Franky, Boris and the robber are brothers and plan to steal the diamond from him before he can turn it over to Doug.\nMeanwhile, boxing promoter and slot machine shop owner Turkish convinces gangster \"Brick Top\" to add the boxer \"Gorgeous George\" to the bets at Brick Top's bookies. However, when Turkish sends his partner Tommy and Gorgeous George to purchase a caravan from a group of Travellers, George gets into a fight with Mickey O'Neil, a bare-knuckle boxing champion who badly injures George. Turkish convinces Mickey to replace George in his upcoming match by agreeing to purchase a new caravan for Mickey's mother. Brick Top agrees to the change on the condition that Mickey throws the fight in the fourth round.\nBoris gives Franky a revolver in exchange for a favour: Franky is to place a bet on Boris' behalf at Brick Top's bookies. Avi, knowing Franky has a gambling problem, flies to London with his bodyguard \"Rosebud\" to claim the diamond personally. Boris hires Vinny and Sol, two small-time crooks, to rob Franky while he is at the bookies. The robbery goes awry and Sol, Vinny, and their driver Tyrone are caught on-camera, but manage to kidnap Franky.\nInstead of throwing the fight, Mickey knocks his opponent out with a single punch. Infuriated, Brick Top robs Turkish of his savings and demands that Mickey fight again, and lose this time. Meanwhile, Boris retrieves the diamond and murders Franky with a pistol. As Sol, Vinny, Tyrone, and their friend, Yardie \"Bad Boy\" Lincoln are trying to decide how to dispose of Franky's body, Brick Top arrives to kill them for robbing his bookies. Sol bargains for their lives by promising Brick Top the stolen diamond, and is given 48 hours to retrieve it.\nAvi and Doug hire \"Bullet-Tooth\" Tony to help them find Franky. When the trail leads to Boris, they kidnap him and retrieve the diamond, closely pursued by Sol, Vinny, and Tyrone. Coincidentally Turkish and Tommy are driving on the same stretch of road at the time. When Tommy throws Turkish's carton of milk out of their car window; it splashes over Tony's windscreen, causing him to crash and killing Rosebud in the process. Boris escapes from the wreck only to be hit by Tyrone's car. Tony and Avi are confronted by Sol, Vinny, and Tyrone at a pub where Tony realizes that the trio's pistols are replicas, which he contrasts with his real handgun and intimidates them into leaving. The wounded Boris arrives with an assault rifle with a grenade launcher looking for the diamond back but is shot and killed by Tony. Sol and Vinny escape with the diamond, which Vinny hides in his pants. When Tony catches up to them, they tell him that the diamond is back at their pawn shop. Once there, they produce the diamond, but it is promptly swallowed by a dog that Vinny got from the travelers. Avi fires at the fleeing dog and accidentally kills Tony. He gives up and returns to New York.\nMickey refuses to fight again unless Turkish buys a better caravan for his mother, but Turkish has no money left since Brick Top stole his savings. Furious, Brick Top has his men vandalize Turkish's gambling arcade and burn down Mickey's mother's caravan while she is asleep inside. Mickey agrees to fight to avoid more carnage, but gets so drunk after his mother's wake that Turkish fears he will not make it to the fourth round. If he fails to go down as agreed, Brick Top's men will execute Turkish, Tommy, Mickey, and the entire campsite of travelers. Mickey makes it to the fourth round, when he suddenly knocks out his opponent. Outside the arena, Brick Top and his men are killed by the travelers. Mickey has bet on himself to win, and waited until the fourth round to allow the travelers time to ambush and kill Brick Top's men at the campsite.\nThe next morning, Turkish and Tommy find the travelers campsite deserted. When confronted by the police, they cannot explain why they are there, until Vinny's dog suddenly arrives and they claim to be walking it. Sol and Vinny are arrested when the police find Franky and Tony's bodies in their car. Turkish and Tommy take the dog to a veterinarian to extract a squeaky toy that it had swallowed, and discover the diamond in its stomach, as well. They consult Doug about selling the diamond and he calls Avi, who returns to London."}