{"title": "Take Shelter", "full_text": "TAKE SHELTER\r\n\r\n\r\n                         \r\n\r\n                                  Written by\r\n\r\n                                 Jeff Nichols                        \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n          Grove Hill Productions Release Edit Draft\r\n\r\n\r\n\r\n\r\n          EXT. LAFORCHE HOME - DAY\r\n\r\n          Sun spikes through the jostling leaves of a maple tree. A\r\n          strong wind bends them back, showing their light green\r\n          bellies.\r\n\r\n          This is a modest house in a row of modest houses. Propane\r\n          tanks and farmland at their backs show this neighborhood to\r\n          be more rural than suburb.\r\n\r\n          CURTIS LAFORCHE(35) stands in his driveway. His eyes, locked\r\n          on the sky, narrow as he stares at...\r\n\r\n          A STORM CELL stretching out on the horizon in front of him.\r\n          It's a bruised sky filled with a vicious mixture of black and\r\n          gray clouds. They swirl in and out of one another sending\r\n          wispy tentacles toward the ground.\r\n\r\n          Curtis stands, awestruck.\r\n\r\n          The clouds move fast overhead. He looks up as they overtake\r\n          his position. A light rain begins.\r\n\r\n          The rain pats the ground. It makes soft indentions on his\r\n          cotton shirt. He watches it hit the concrete, falling harder\r\n          now. He notices something strange.\r\n\r\n          The rain makes dark spots on the sidewalk. He pulls his\r\n          shirt out and sees dark spots forming there. He holds his\r\n          palm out flat in front of him. The rain pools.\r\n\r\n          He rubs the water through his thumb and fingers. It's an\r\n          amber color, viscous, like fresh motor oil.\r\n\r\n          Curtis looks to the sky, the rain pelting his face now.\r\n          Jagged, angry clouds blanketing overhead. The wind bends\r\n          back the trunk of the maple tree.\r\n\r\n          Curtis stands alone at the base of the surging STORM CELL.\r\n\r\n          TITLE: TAKE SHELTER\r\n\r\n                         \r\n\r\n          INT. BATHROOM - DAY\r\n\r\n          Curtis holds his head under the running shower nozzle. Cool,\r\n          clean water rushes over his face.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - DAY\r\n\r\n          SAMANTHA(29) stands at the stovetop stirring eggs in a pan.\r\n          She's still dressed in her sleeping attire, an oversized T-\r\n          shirt and pajama bottoms with cartoon frogs on them.\r\n          HANNAH(5) sits at the kitchen table tearing up a piece of\r\n          toast and feeding it to the dog.\r\n\r\n           2.\r\n\r\n                         \r\n          Hannah is a blonde little girl with a large hearing aid\r\n          wrapped over her right ear. It clips into her hair near the\r\n          back of her head. The dog's name is Red, a Rhodesian\r\n          Ridgeback that appreciates the attention.\r\n          Curtis enters the kitchen and kisses Hannah on the head. In\r\n          the same motion, he takes the piece of toast from her hand\r\n          and sets it on her plate.\r\n\r\n                          CURTIS\r\n           (takes a seat)\r\n           No, no, no...Don't feed the dog\r\n           darlin'.\r\n          Hannah immediately picks the piece of toast back up and feeds\r\n          it to the dog. Samantha brings the pan over and spoons eggs\r\n          out on everyone's plates.\r\n\r\n                          CURTIS (CONT'D)\r\n           Thanks babe.\r\n\r\n                          SAMANTHA\r\n           You slept late.\r\n\r\n                          CURTIS\r\n           Yeah. I need to go. What you got\r\n           going today?\r\n\r\n                          SAMANTHA\r\n           I've got to finish up some curtains\r\n           for Saturday, and Nat and Cam are\r\n           coming over.\r\n\r\n                          CURTIS\r\n\r\n                          (MOUTH FULL)\r\n           With the kids?\r\n\r\n                          SAMANTHA\r\n           Yeah. Cammie said she just needed\r\n           to get out of the house.\r\n          Samantha takes her seat at the table.\r\n\r\n                          CURTIS\r\n           Tell Nat to take it easy on her.\r\n          Curtis gets up and goes to Hannah.\r\n\r\n                          SAMANTHA\r\n           Cam can hold her own. We need to\r\n           send in the deposit for the beach\r\n           condo.\r\n          He kneels beside his daughter's chair and waits for her to\r\n          make eye contact. She looks over at him. He speaks using\r\n          sign language. Three broad, slow gestures.\r\n\r\n           3.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n\r\n                          (SIGNING)\r\n           I love you.\r\n          Hannah puts her arms around his neck and he squeezes her. He\r\n          stands and grabs a sack lunch off the counter. On his way\r\n          out, he kisses Samantha on top of the head.\r\n\r\n                          CURTIS (CONT'D)\r\n           Just write the check, babe. Okay.\r\n\r\n                          SAMANTHA\r\n           Okay. Bye.\r\n          Samantha sips her coffee as Hannah feeds more toast to the\r\n          dog.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           (as she signs)\r\n           No more food. You, eat.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE HOME - DAY\r\n\r\n          Curtis shoulders his way out the front screen door. Keys in\r\n          his mouth and sack lunch in his hand, he makes his way down\r\n          the porch steps and onto the front walk.\r\n          He pops open the chain-link gate and heads for the PICK-UP\r\n          parked on the street. Clear blue sky overhead.\r\n\r\n                         \r\n\r\n          EXT. SOYBEAN FIELD - DAY\r\n\r\n          Small soybean plants slouch in the noonday sun. A slight\r\n          breeze picks up, jostling the leaves, but the sound is\r\n          drowned out by a loud, mechanical rumbling.\r\n          A spiral drill churns up dark soil as it digs deeper into the\r\n          ground. Curtis, wearing work goggles, grabs hold of the\r\n          drill's cabling system and yanks down.\r\n\r\n                          CURTIS\r\n           Yeah, let's keep going with that\r\n           bit! It'll go another 10 feet!\r\n          He yells to DEWART(36), a big guy sitting at the controls of\r\n          a diesel powered WELL-DRILLING RIG. The truck has a long\r\n          rusted bed with metal scaffolding raised HIGH on its back.\r\n\r\n                          DEWART\r\n           We won't get the gravel pack down\r\n           today!\r\n\r\n                          CURTIS\r\n           Why not?!\r\n\r\n           4.\r\n\r\n                         \r\n\r\n                          DEWART\r\n           Those clouds! We're gonna have to\r\n           call it!\r\n          Curtis looks back to a potential STORM. Gray clouds forming\r\n          across the horizon.\r\n\r\n                          CURTIS\r\n           Happy hour starts at five Dewart!\r\n\r\n                          DEWART\r\n\r\n                          (TO HIMSELF)\r\n           Not if it's rainin'...Ready?\r\n\r\n                          CURTIS\r\n           Oh, yeah.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME - DAY\r\n\r\n          Samantha sits at a table running a long piece of sheer fabric\r\n          through her sewing machine. She's making curtains.\r\n          NAT(37) sips a screwdriver from a clear plastic cup designed\r\n          not to sweat. She's a woman with rough edges.\r\n          CAMMIE(24) cradles a brown-haired BABY on top of her\r\n          pregnant, eight month belly.\r\n          As Nat speaks, she looks out a sliding glass door at her two\r\n          kids, DJ(7) and SUE(5), playing with Hannah.\r\n\r\n                          NAT\r\n           They were just drinkin' and\r\n           laughin' and oh, my god...it was\r\n           like I was bein' in a museum and I\r\n           saw the progress from apes to men.\r\n           I saw it. I saw the future.\r\n           Dewart, that was him...that was\r\n           going to be him in 20 years.\r\n\r\n                          SAMANTHA\r\n           Oh my god.\r\n          Cammie laughs.\r\n\r\n                          NAT\r\n           Let me tell you, you laugh. You\r\n           laugh. But this little one in your\r\n           arms is gonna be shufflin' in a bar\r\n           just like `em. Yep...\r\n\r\n                          (GLANCES OUTSIDE)\r\n           Hannah!\r\n          Samantha jumps up from her sewing to see outside. Hannah,\r\n          with her back to the house, bangs a 2 X 4 with a rusted nail\r\n          in the end into the ground. Samantha is out the door.\r\n\r\n           5.\r\n\r\n                         \r\n\r\n          EXT. BACKYARD - CONTINUOUS\r\n\r\n          Samantha walks briskly, talking to the other children.\r\n\r\n                          SAMANTHA\r\n           You guys okay?\r\n\r\n                          SUE\r\n           Yeah.\r\n          Samantha takes a wide line around Hannah, who continues\r\n          banging the two-by-four into the ground. As soon as the\r\n          child sees her mother, she stops.\r\n          Samantha crouches in front of Hannah, gently taking the board\r\n          away from her. Samantha signs with her hand and speaks at\r\n          the same time.\r\n\r\n                          SAMANTHA\r\n           No. Don't touch.\r\n          Hannah tilts her head, looking off to the side. Samantha\r\n          touches her chin bringing her eyes back around.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           (signing and speaking)\r\n           You understand?\r\n          Hannah nods once, \"yes\".\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Oksy. Come here.\r\n          Samantha stands and takes the board to a trash pile in the\r\n          back corner of the yard. A STORM SHELTER is buried in the\r\n          ground just behind the pile. It's a grass covered mound with\r\n          two rusted metal doors angled toward the sky.\r\n          She throws the board onto the heap and wipes her hands on her\r\n          pants. Staring at the pile, she lets out an irritated sigh.\r\n          Thunder rumbles low in the distance. She looks up at the\r\n          approaching clouds and calls to the children as she walks\r\n          back inside.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Hey, DJ. Bring the girls inside.\r\n\r\n                         \r\n\r\n          EXT. SOYBEAN FIELD - DAY\r\n\r\n\r\n          THUNDER STRIKE.\r\n          The drill bit spins as rain pelts the ground turning the dark\r\n          soil into black mud.\r\n\r\n           6.\r\n\r\n                         \r\n          Curtis holds a rain slicker over his head. He watches as the\r\n          hole they are drilling fills up with brown water. He lifts\r\n          his boot, which makes a sucking sound as it dislodges from\r\n          the mud.\r\n          Looking at the horizon, he sees no sign of the storm letting\r\n          up. He looks to Dewart, who smiles at him from behind the\r\n          controls of the rig.\r\n\r\n                          DEWART\r\n           What? It's not my fault! I told\r\n           you!\r\n\r\n                          CURTIS\r\n           Yeah. All right...All right! I'm\r\n           callin' it! Shut it down!\r\n          Dewart gladly eases back on the lever at his knee.\r\n\r\n                         \r\n\r\n          I/E. LAFORCHE HOME - LATE AFTERNOON\r\n          Samantha holds the front door open as Nat and Cammie leave\r\n          with their children packed up and in tow. It's raining\r\n          pretty hard outside.\r\n\r\n                          SAMANTHA\r\n           Bye guys. Thanks for coming over.\r\n\r\n                          NAT\r\n           I'll call next week about the Lions\r\n           Club supper.\r\n\r\n                          SAMANTHA\r\n           Okay. Love you.\r\n\r\n                          CAMMIE\r\n           Bye Sam.\r\n\r\n                          SAMANTHA\r\n           Bye Cam.\r\n          Running for her car holding a jacket covered car seat.\r\n          Samantha closes the door and listens to her quiet house. The\r\n          rain outside is the only noise. She heads to the kitchen.\r\n\r\n          IN THE KITCHEN,\r\n          Hannah is sitting Indian-style at the glass doors watching\r\n          the rain. Samantha walks over and kneels down behind her.\r\n          She wraps her arms around Hannah, who lifts a hand to the\r\n          glass.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Can you sign s-t-o-r-m?\r\n\r\n           7.\r\n\r\n                         \r\n          Samantha puts her hand onto the glass next to Hannah's and\r\n          signs \"s-t-o-r-m\". Hannah turns to see her mother's face,\r\n          and Samantha uses both hands to make the signed symbol.\r\n          Fingers, spread and bent, moved downward.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Storm.\r\n          Hannah looks back out the window. They watch the storm\r\n          together.\r\n\r\n                         \r\n\r\n          I/E. CURTIS' TRUCK/DEWART'S HOUSE - NIGHT\r\n          The blue top of a small cooler is knocked to the floorboard\r\n          as Dewart fishes the last Busch tallboy out of icy water. He\r\n          cracks it open and takes an extended sip.\r\n          Curtis, sitting behind the wheel of his truck, looks at his\r\n          drunk friend.\r\n\r\n                          CURTIS\r\n           I gotta get home.\r\n\r\n                          DEWART\r\n           Nat and me been lookin' into a\r\n           threesome. We've been chattin' with\r\n           a girl online from Canton. Yeah.\r\n           Big `ol girl.\r\n\r\n                          CURTIS\r\n           What's big?\r\n\r\n                          DEWART\r\n           She's about two fifty, two seventy\r\n           five. She can't be no taller than\r\n           5 foot.\r\n          Dewart starts laughing, which makes Curtis laugh.\r\n\r\n                          CURTIS\r\n           Shit man.\r\n          The laughing subsides.\r\n\r\n                          CURTIS (CONT'D)\r\n           I don't see me and Sam gettin' into\r\n           somethin' like that.\r\n\r\n                          DEWART\r\n           No. I don't guess you would.\r\n          Dewart is staring at Curtis.\r\n\r\n                          DEWART (CONT'D)\r\n           You got a good life Curtis.\r\n\r\n           8.\r\n\r\n                         \r\n          Curtis shrugs.\r\n\r\n                          DEWART (CONT'D)\r\n           I'm serious. I think that's the\r\n           best compliment you can give a man,\r\n           take a look at his life and say,\r\n           that's good. That guy's doin'\r\n           somethin' right.\r\n\r\n                          CURTIS\r\n           Well. It ain't always so easy.\r\n\r\n                          DEWART\r\n           Hell I know that.\r\n          Dewart sees something out his window.\r\n\r\n                          DEWART (CONT'D)\r\n           Ah shit. I gotta go...Manana.\r\n\r\n                          CURTIS\r\n           Good night.\r\n          Nat, in a house robe and slippers, weaves her way through the\r\n          maze of junk on their front lawn.\r\n          Dewart passes her without saying a word. Curtis watches as\r\n          she follows him inside the house, still talking. He shifts\r\n          into drive and pulls away.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME - NIGHT\r\n\r\n          The lights are out and the house is quiet. Curtis eases open\r\n          the front door and steps inside. Standing on the door mat,\r\n          he slips off his mud-caked boots and gently sets them aside.\r\n\r\n          AT HANNAH'S BEDROOM DOOR,\r\n          Curtis places his palm flat on the door and lets it open.\r\n          Hannah is curled up with the covers. He watches her sleep.\r\n          Samantha, barefoot and wearing a sleep shirt, walks up behind\r\n          Curtis. He turns his head when she approaches.\r\n\r\n                          CURTIS\r\n\r\n                          (SOFTLY)\r\n           Hey baby.\r\n          She wraps her arms around his waist and he lifts his elbow to\r\n          make room for her. They whisper.\r\n\r\n                          CURTIS (CONT'D)\r\n           She do all right today?\r\n\r\n           9.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           She was fine. She's still not\r\n           playin' with the others, though.\r\n           She can't connect. Honey, you\r\n           gotta clean up that trash pile in\r\n           the back. She fished out a board\r\n           that had nails on it.\r\n\r\n                          CURTIS\r\n           I'll get to it this weekend.\r\n          It's quiet for a moment.\r\n\r\n                          CURTIS (CONT'D)\r\n           I still take off my boots so I\r\n           won't wake her up.\r\n          She smiles up at her husband.\r\n\r\n                          SAMANTHA\r\n           I still whisper.\r\n          He pulls her tight. They stand together in the doorway. The\r\n          house is silent.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - DAY\r\n\r\n          Curtis loads pieces from the trash pile into a wheelbarrow.\r\n          He keeps an eye on Hannah as she jumps on a small, plastic\r\n          playscape in the middle of the backyard.\r\n          The dog, Red, paces by the back door. He's agitated, but his\r\n          movement is limited by the length of rope tied from his\r\n          collar to a nearby post. He barks.\r\n\r\n          THUNDER STRIKES.\r\n          Curtis flinches at the loud boom. He looks to the sky and\r\n          sees dark clouds twisting overhead. Hannah plays, unaffected\r\n          by the noise.\r\n          To get a better view, Curtis moves from beneath a tree in the\r\n          corner of the yard and surveys the large swath of farmland\r\n          that runs up to his property.\r\n          Chain-link fencing partitions the yard from a deep concrete\r\n          culvert that leads out to the open field.\r\n          A giant STORM CELL gathers force on the horizon there.\r\n          Red barks incessantly. He winces and strains against the\r\n          rope tied to his collar.\r\n          Curtis flinches again as A BOLT OF LIGHTNING streaks to the\r\n          ground in the distance. Sparks shoot into the air leaving a\r\n          circle of scorched crops. Another CRACK of thunder.\r\n\r\n           10.\r\n\r\n                         \r\n          A light rain begins. Red snaps his head around and bucks\r\n          into the air. He gnashes at the rope.\r\n          Curtis collects Hannah off the playscape and turns back to\r\n          the approaching STORM CELL. He holds up his hand and studies\r\n          the falling rain. It's the thick, amber colored liquid.\r\n          With Hannah in his arms, Curtis watches, awestruck, as wispy\r\n          tentacles drip to the ground forming a collection of THREE\r\n          TORNADOS out in the field.\r\n          Behind them, Red's teeth fray the rope at his collar. He\r\n          thrashes his head, the rope SNAPS, and the dog flies toward\r\n          Curtis and Hannah.\r\n          Curtis turns to see Red charging them. He barely has time to\r\n          set Hannah down before Red catches him by the forearm.\r\n          They crash to the ground, tangled together. Rain coming down\r\n          hard now.\r\n          Curtis yells and waves Hannah back. Red, snapping, buries\r\n          his teeth into the muscles in Curtis' arm. Blood streams\r\n          from the wound.\r\n          Curtis screams in pain.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - DAY\r\n\r\n          Curtis bolts up in bed grabbing his forearm. He grinds his\r\n          teeth and doubles over in pain. It takes a moment for him to\r\n          find his bearings.\r\n          His breathing slows. He gently rubs his hand over the skin\r\n          on his arm. Sweat has collected around his collar and\r\n          temples.\r\n          From the bed, sheets in a twisted mess, he looks around the\r\n          room unsure of what just happened to him.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - DAY\r\n\r\n          Eggs cool on a plate.\r\n          Curtis sits at the kitchen table dressed for work. He stares\r\n          vacantly at his breakfast.\r\n          He looks up at Hannah. She sits on the floor surrounded by\r\n          toy building blocks and plays with the dog. She rubs under\r\n          Red's chest and in turn he licks her face. She smiles and\r\n          gently pushes him away.\r\n          Samantha sits with her knees up drinking coffee.\r\n\r\n           11.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           Curtis?\r\n\r\n                          CURTIS\r\n           What?\r\n\r\n                          SAMANTHA\r\n           Did you hear me? You got to be\r\n           home, showered, ready to walk out\r\n           the door by six tonight.\r\n          Curtis stands up and goes over to Hannah. He grabs her off\r\n          the floor and she begins to protest with kicks and crying.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           What's wrong?\r\n\r\n                          CURTIS\r\n           Nothing. I just want her to eat her\r\n           breakfast and stop playin' with the\r\n           damn dog.\r\n\r\n                          SAMANTHA\r\n           She's fine down there. She had\r\n           toast already.\r\n          Curtis, against flailing, manages to get Hannah in her chair.\r\n          Curtis backs off, frustrated. Hannah climbs down from her\r\n          chair and goes back to the floor and the dog.\r\n\r\n                          CURTIS\r\n           Hannah. Come here. Hannah.\r\n\r\n                          SAMANTHA\r\n           Curtis?\r\n\r\n                          CURTIS\r\n           What?\r\n          He stops and checks his watch.\r\n\r\n                          CURTIS (CONT'D)\r\n           I'm late.\r\n\r\n                          SAMANTHA\r\n           You didn't eat anything?\r\n          Heading out.\r\n\r\n                          CURTIS\r\n           It's okay.\r\n          Curtis is gone. Samantha looks at Hannah on the floor with\r\n          the dog.\r\n\r\n           12.\r\n\r\n                         \r\n\r\n          INT. DELTA AGRI-PRO MAIN OFFICE - DAY\r\n\r\n          The main headquarters of Delta Agri-Pro is housed in a giant\r\n          metal building. A row of cheaply built, 70's style offices\r\n          with drop tile ceilings line the left of a large warehouse\r\n          that contains all manner of agricultural and construction\r\n          equipment. Tractors, backhoes, welding rigs, etc.\r\n          A GROUP OF MEN, many of which were represented at Gator's bar\r\n          yesterday, sit in folding chairs or stand in a semi-circle\r\n          around JIM THOMPSON(53). He speaks, clipboard in hand.\r\n\r\n                          JIM\r\n           I didn't say you had control over\r\n           the weather Russell, what I did say\r\n           was that the top shelf has to be\r\n           cleared by the 15th. That's non-\r\n           negotiable.\r\n          Dewart eats from a bag of Sunflower seeds. Curtis stares\r\n          down at his forearm. He rubs the skin there. Jim runs a\r\n          finger down his clipboard.\r\n\r\n                          JIM (CONT'D)\r\n           Umm, Curtis. Where we at on that\r\n           east 82nd site?\r\n          Curtis snaps his head up, takes a second.\r\n\r\n                          CURTIS\r\n           Yesterday slowed us down. We\r\n           couldn't get the second pilot hole\r\n           drilled.\r\n          Jim drops his head and the clipboard falls to his side. A\r\n          melodramatic move.\r\n\r\n                          JIM\r\n           It rained for two hours yesterday.\r\n           Two hours and our entire schedule\r\n           went in the toilet. We lose the\r\n           permit if you're not out of there\r\n           by end of day.\r\n\r\n                          CURTIS\r\n           Yes sir.\r\n\r\n                          JIM\r\n           End of day Curtis.\r\n          Curtis nods.\r\n\r\n                          JIM (CONT'D)\r\n           All right. Valerie tells me that\r\n           the father son pancake cook off...\r\n\r\n           13.\r\n\r\n                         \r\n\r\n          EXT. DELTA AGRI-PRO MAIN OFFICE - CONTINUOUS\r\n\r\n          Curtis and Dewart walk to Curtis' truck.\r\n\r\n                          CURTIS\r\n           Hey, I gotta make a stop before we\r\n           head out there.\r\n\r\n                          DEWART\r\n           Think we got time?\r\n\r\n                          CURTIS\r\n           Yeah. There's time.\r\n\r\n                         \r\n\r\n          INT. HOME DEPOT - DAY\r\n\r\n          Dewart stands by a flatbed cart with a prefab DOGHOUSE\r\n          sitting on it.\r\n          Curtis loads chain-link fencing materials onto the cart.\r\n\r\n                         \r\n\r\n          EXT. SOYBEAN FIELD - DAY\r\n\r\n          The wheels of the well-drilling rig are half sunk into the\r\n          muddy soil.\r\n          Curtis stands over the hole being drilled. The turning metal\r\n          pole suddenly seizes up and stops. Smoke begins to seep up\r\n          from the hole.\r\n\r\n                          CURTIS\r\n           Sonofabitch.\r\n          Dewart jumps down from the control panel to take a look.\r\n\r\n                          DEWART\r\n           We stripped that bit.\r\n\r\n                          CURTIS\r\n           Yeah. Well, bring it up. We gotta\r\n           re-set it.\r\n          Dewart walks back to his controls. Curtis heads to the cab\r\n          of the drilling rig and checks his watch.\r\n\r\n                          CURTIS (CONT'D)\r\n           Shit.\r\n          Something catches his eye in the distance. Clearing past the\r\n          rig, he walks out into the adjacent field.\r\n          He removes his goggles, eyes fixed on the acres of farmland\r\n          that stretch for miles in front of him.\r\n          In the sky overhead,\r\n\r\n           14.\r\n\r\n                         \r\n\r\n          AN ENORMOUS FLOCK OF BIRDS ROLL IN UNISON.\r\n          Hundreds of them make up a black swarm that twists and shifts\r\n          in the air. They dive bomb then ascend in intricate,\r\n          GEOMETRIC patterns.\r\n          Curtis watches, mesmerized.\r\n          Dewart strains a wrench against a bolt as the drill screeches\r\n          in reverse.\r\n\r\n                          DEWART\r\n           Curtis!\r\n          Curtis acknowledges Dewart but can't take his eyes off the\r\n          pattern of birds. They shrink and stretch from thick clumps\r\n          to long cylindrical tubes. A choreography.\r\n          Curtis reluctantly heads back to the rig, which is shrieking\r\n          with the SOUND of metal on metal.\r\n\r\n                          CURTIS\r\n           You ever see birds fly like that?!\r\n\r\n                          DEWART\r\n           (holding his hand to his\r\n\r\n                          EAR)\r\n           What?!\r\n          Curtis looks back, giving the birds a final review.\r\n\r\n                         \r\n\r\n          I/E. CURTIS' TRUCK/HOUSE - EVENING\r\n          The sun has just set adding a purple hue to the sky. Curtis\r\n          steers his truck up to the front curb of his house.\r\n\r\n          THROUGH HIS WINDSHIELD,\r\n          He sees Samantha standing by her car, the back door open.\r\n          She watches him pull up. Hannah is already packed into her\r\n          car seat.\r\n\r\n                          CURTIS\r\n\r\n                          (TO HIMSELF)\r\n           Shit.\r\n\r\n          PARKED,\r\n          Curtis climbs out and walks to the driveway.\r\n\r\n                          SAMANTHA\r\n           Come on we gotta go.\r\n\r\n                          CURTIS\r\n           Ah, Jesus. I could really use a\r\n           shower.\r\n\r\n           15.\r\n\r\n                         \r\n          Samantha isn't having it. She climbs in the passenger seat.\r\n          Curtis makes his way to her car.\r\n\r\n                         \r\n\r\n          INT. SPECIAL EDUCATION CLASSROOM - NIGHT\r\n\r\n          Curtis' work boots are encased in dry mud. Chunks have\r\n          broken off and pepper the thin blue industrial carpet. His\r\n          mud-stained fingers tap on the top of a desk. Dirt caked\r\n          under his nails.\r\n\r\n           TEACHER (O.S.)\r\n           So if you continue with the basic\r\n           vocabulary, this will allow you to\r\n           communicate with your children\r\n           better.\r\n          Curtis sits, filthy, at a school desk he doesn't quite fit\r\n          into. A TEACHER speaks to a ROOM FULL of PARENTS.\r\n\r\n                          TEACHER (CONT'D)\r\n           Between the ages of four and seven\r\n           the focus is more on the sign and\r\n           then later we'll begin adding the\r\n           alphabet as more of a support\r\n           syster. Now in ASL...\r\n          Curtis looks over at Samantha, who is sitting in the desk\r\n          next to him. She won't look at him.\r\n          He cranes his neck around to see toward the back of the room.\r\n          An ASSISTANT TEACHER sits on a large, colorful rug with a\r\n          GROUP of CHILDREN, all different ages, playing games that\r\n          teach hand signs. Hannah actively participates in the group.\r\n\r\n                          TEACHER (CONT'D)\r\n           ...the male sign is signed at the\r\n           forehead area. For example, father\r\n           is signed up here like\r\n           this...Father, very good.\r\n          Curtis turns back in his chair and makes the sign for \"dad\"\r\n          along with the other parents.\r\n\r\n                         \r\n\r\n          INT. SPECIAL EDUCATION CLASSROOM - NIGHT - LATER\r\n\r\n          Curtis, Samantha, and Hannah sit on the floor in a circle\r\n          atop the colored rug.\r\n          Samantha turns over large flashcards with illustrated scenes\r\n          on them. They take turns making the corresponding sign.\r\n          Curtis stares at Samantha, but she's still giving him the\r\n          cold shoulder. Finally, while holding up a card, she looks\r\n          at him. He signs, \"I'm sorry\". A fist moving in a circular\r\n          motion at his chest.\r\n\r\n           16.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           You're not sorry.\r\n\r\n                          CURTIS\r\n           I am sorry.\r\n          She looks to Hannah and signs, \"swim\".\r\n\r\n                          SAMANTHA\r\n           Well, you stink. You smell really\r\n           bad.\r\n          He smiles.\r\n\r\n                          CURTIS\r\n           I think I smell good.\r\n          She smiles, begrudgingly, and then signs to Hannah, \"Dad\" and\r\n          \"stink\". Curtis turns to some ladies behind him.\r\n\r\n                          CURTIS (CONT'D)\r\n           Do I smell good?\r\n          Samantha laughs and tries to cover his mouth with her hand.\r\n\r\n                          CURTIS (CONT'D)\r\n           See. Maybe I should marry her\r\n           instead.\r\n          They continue to laugh.\r\n\r\n                          SAMANTHA\r\n           Stop.\r\n\r\n                         \r\n\r\n          INT. CURTIS' TRUCK - DAY\r\n\r\n          Curtis slams the door to his truck, sealing him off from the\r\n          torrential rainfall outside.\r\n          He shakes water off, wipes his face. The windows are smeared\r\n          by thick, dark rain. It's hard to see out.\r\n          He looks over to Hannah sitting in her car seat. It looks\r\n          odd on the front bench of the truck. He signs to her.\r\n\r\n                          CURTIS\r\n           (signing and speaking)\r\n           You okay?\r\n          She nods. He cranks the truck and turns on the wipers. The\r\n          liquid on the windshield streaks into long smudges. Curtis\r\n          leans forward to get a better view of the street. He checks\r\n          his blind spot and pulls away.\r\n\r\n          MOVING FAST ON A MAIN ROAD,\r\n\r\n           17.\r\n\r\n                         \r\n          Stop lights blur into hazy red and green spheres.\r\n          Curtis checks the rearview, but the back window is covered by\r\n          the rain. He tries rolling down his window, but water blows\r\n          in. He rolls it back up and the smudging gets worse.\r\n          The truck shimmies from left to right, pushed by the wind. A\r\n          THUNDER STRIKE rattles.\r\n          Suddenly,\r\n\r\n          THE SHAPE OF A PERSON STANDING IN THE ROAD.\r\n\r\n                          CURTIS (CONT'D)\r\n\r\n           SHIT!\r\n          Curtis stomps on the brakes and turns the wheel. The truck\r\n          hydroplanes.\r\n          CRASH! Curtis' head busts against the steering column. The\r\n          front windshield cracks as the truck jerks to a stop.\r\n          The HISS of a broken radiator. Curtis winces from the blow\r\n          to his head. Hannah is crying. He reaches over to her.\r\n\r\n                          CURTIS (CONT'D)\r\n           Are you okay?\r\n          Hannah physically looks all right, but she continues crying.\r\n          Curtis reaches out and places a hand on her head. He's\r\n          dazed, mumbling.\r\n\r\n                          CURTIS (CONT'D)\r\n           You're okay.\r\n          The truck is angled up slightly like the front end has inched\r\n          up a pole. A cut on his forehead has begun to bleed.\r\n          He sees movement. A PERSON passes by the hazy side window.\r\n          A SHAPE moves past the driver's window.\r\n          The truck shifts as weight is added to the bed. The SOUND of\r\n          SOMEONE pulling things from the back of the truck. A moment.\r\n          WHACK! Curtis flinches as a 2X4 pounds the windshield.\r\n          The truck jostles from the weight of someone jumping on the\r\n          hood.\r\n          Bump. Bump.\r\n          The roof caves in with two FOOTSTEPS.\r\n          Curtis looks around frantically. He reaches over to Hannah\r\n          and begins to unstrap her from the car seat.\r\n\r\n           18.\r\n\r\n                         \r\n          SMASH! A BOARD breaks through the Passenger Window.\r\n          A WOMAN, pale and aggressive, stands in the rain storm\r\n          staring through the broken glass. She reaches for the lock.\r\n          Curtis pulls Hannah from the child seat and recoils against\r\n          his door but is jolted as another board CRASHES through the\r\n          driver's window.\r\n          A HAND yanks Curtis by his collar. He's pulled against the\r\n          door. A pasty forearm wraps around his neck, choking him.\r\n          He strains against the arm. Sucks air. Needing to breath.\r\n          The Woman at the passenger door grabs for Hannah. Curtis\r\n          kicks at her.\r\n          A MAN's boot KICKS OUT the back window. The Man in the bed\r\n          of the truck reaches for Curtis' face. He flails and kicks,\r\n          unable to break free from the forearm at his door.\r\n          The Woman gets hold of Hannah. The child is yanked from\r\n          Curtis' arms. He screams.\r\n\r\n                          CURTIS (CONT'D)\r\n           Hannah! Hannah!\r\n          Hands claw at Curtis' face. Scratching. Blood streaks. The\r\n          Woman has disappeared into the storm with Hannah.\r\n          Curtis screams. Fingers swoop into his open mouth, grabbing\r\n          hold of his cheek. They pull the cheek back. TEARING.\r\n          He yells in pain.\r\n\r\n                         \r\n\r\n          INT. HALLWAY/KITCHEN - DAY\r\n\r\n          Samantha walks down the hallway holding Hannah's shoes.\r\n          Hannah trails behind her.\r\n\r\n                          SAMANTHA\r\n           Here honey. Put on your shoes\r\n\r\n          IN THE KITCHEN,\r\n          Samantha walks in. Curtis is standing at the counter in his\r\n          undershirt and boxers pouring a cup of coffee.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Good, you're up.\r\n          Curtis doesn't turn to greet her. He just stirs a spoon in\r\n          the black coffee.\r\n          Samantha walks up to him and puts a hand on his back. She\r\n          notices that his shirt is soaked with sweat.\r\n\r\n           19.\r\n\r\n                         \r\n\r\n                          SAMANTHA (CONT'D)\r\n           Honey, you're soaked.\r\n          He turns, taking a sip from the mug. She feels his forehead.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Are you sick?\r\n\r\n                          CURTIS\r\n           I've felt better.\r\n\r\n                          SAMANTHA\r\n           I guess we could stay home if we\r\n           need to.\r\n\r\n                          CURTIS\r\n           Where you goin'?\r\n\r\n                          SAMANTHA\r\n           It's Saturday, I was going to take\r\n           Hannah to my booth.\r\n\r\n                          CURTIS\r\n           Oh. Yeah.\r\n          Curtis walks to the table and takes a seat.\r\n\r\n                          SAMANTHA\r\n           You look really sick honey.\r\n\r\n                          CURTIS\r\n           I'm all right. It's just a cold or\r\n           somethin'.\r\n\r\n                          SAMANTHA\r\n           Let me get you some Advil.\r\n          She heads for the hallway.\r\n\r\n                          CURTIS\r\n           No. Don't worry about it. Ya'll\r\n           just go. I'll be fine.\r\n\r\n                          SAMANTHA\r\n           You sure?\r\n\r\n                          CURTIS\r\n           Yeah.\r\n           (holds up the mug)\r\n           Better already.\r\n          Samantha walks to her purse on the counter and roots through\r\n          to find a set of keys.\r\n\r\n           20.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           Okay. I got my phone if you need\r\n           anything. Don't forget Sunday\r\n           lunch is here tomorrow.\r\n          This reminder makes Curtis rub his face with a grunt.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           If you're sick, we should cancel.\r\n\r\n                          CURTIS\r\n           I'll be all right.\r\n\r\n                          SAMANTHA\r\n           Okay, we'll talk later.\r\n          She heads for the door with Hannah.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Come on. Let's go.\r\n\r\n                          (TO CURTIS)\r\n           You sure?\r\n\r\n                          CURTIS\r\n           Honey, please.\r\n\r\n                          SAMANTHA\r\n           Okay.\r\n          Samantha scoops up her bag and takes Hannah by the hand. They\r\n          leave the room.\r\n          Curtis notices the dog, Red, sitting on his haunches looking\r\n          at him. Curtis stares back, sipping his coffee.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - DAY\r\n\r\n          The reverse lights shine as Curtis' pick-up rumbles backward.\r\n          Curtis eyes the side mirror as he maneuvers the truck into\r\n          his backyard. In the mirror, the trash pile comes into view.\r\n          Just behind it, the STORM SHELTER doors appear.\r\n          The truck shutters to a stop. Curtis studies the Shelter in\r\n          the side mirror for a moment. A grassy bulge with angled\r\n          metal doors peeking over the trash heap. He climbs out.\r\n          A blue tarp is pulled from the bed of the truck, floating\r\n          down to the yard.\r\n          Curtis slips on a pair of work gloves and continues to eye\r\n          the Storm Shelter. He yanks a bale of chain-link from the\r\n          bed of the truck and carries it to the back corner of the\r\n          yard. He steals another glance back toward the Shelter.\r\n\r\n           21.\r\n\r\n                         \r\n          Dropping the bale, he sizes up the space. He looks to the\r\n          sky. It's a beautiful day.\r\n          He begins counting off steps from the back fence line.\r\n\r\n                         \r\n\r\n          INT. FLEA MARKET - SERIES OF IMAGES - DAY\r\n\r\n          -A linen sheet floats down over a folding table.\r\n          -The hanging bag is placed on a portable clothes rod.\r\n          -Hands place an assortment of home sewn crafts like napkins\r\n          and embroidered pillows out onto the table.\r\n          -A tackle box is opened revealing a tray of small bills and\r\n          change. A calculator is removed.\r\n          Hannah kneels in front of a folding chair behind their BOOTH\r\n          at an open-air flea market. She uses the seat of the chair\r\n          as a table for a tiny porcelain tea set.\r\n          Samantha stands over her display table smiling and nodding at\r\n          perusing CUSTOMERS.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - SERIES OF IMAGES - DAY\r\n\r\n          -A mallet drives tall metal stakes into the ground.\r\n          -The cord holding together the bale of chain-link is snipped\r\n          and a boot rolls the fencing out flat.\r\n          -Chain-link is attached to the stakes with a number of metal\r\n          braids.\r\n          -The prefab DOGHOUSE is set down in the back corner.\r\n          Curtis stands in front of his newly created dog pen. It's\r\n          waist high and about 7' X 10', tucked in the back left corner\r\n          of the yard so that half of the pen is made up by the\r\n          existing fencing.\r\n\r\n                         \r\n\r\n          INT. FLEA MARKET - DAY\r\n\r\n          Samantha turns to see a large woman holding up an intricately\r\n          embroidered pillow.\r\n          You can tell by the look of her that she's a flea market pro,\r\n          a BARGAIN HUNTER(54).\r\n\r\n                          BARGAIN HUNTER\r\n           How much you asking for this\r\n           pillow?\r\n\r\n           22.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           This pillow's fifteen dollars.\r\n\r\n                          BARGAIN HUNTER\r\n           That's more than I want to spend.\r\n\r\n                          SAMANTHA\r\n           This is all hand stitched. It takes\r\n           a really long time. That's why I\r\n           charge that.\r\n\r\n                          BARGAIN HUNTER\r\n           I'll give you seven for it.\r\n          Samantha looks at the woman, who is almost daring her.\r\n\r\n                          SAMANTHA\r\n           I can't go that low.\r\n\r\n                          BARGAIN HUNTER\r\n           Well that's my offer.\r\n          The woman sets down the pillow and begins looking over other\r\n          items on the table. Samantha bites the inside of her cheek.\r\n          She doesn't like to haggle.\r\n\r\n                          SAMANTHA\r\n           How about 10?\r\n          The woman doesn't look up.\r\n\r\n                          BARGAIN HUNTER\r\n           I'll give you eight, but it's in\r\n           change.\r\n          Samantha forces a smile and motions to Hannah.\r\n\r\n                          SAMANTHA\r\n           That's fine.\r\n          The woman smiles and removes a Ziplock bag of assorted coins\r\n          from her purse. Hannah takes the bag.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Lucky for you she likes to count\r\n           change.\r\n          Hannah opens the bag and begins to turn it over.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - DAY - LATER\r\n\r\n          Curtis unlatches a piece of the braided wire holding a\r\n          separated section of fencing that acts like a gate.\r\n\r\n                          CURTIS\r\n           Red! Come on.\r\n\r\n           23.\r\n\r\n                         \r\n          He opens it and looks down at Red, who sits at his feet. He\r\n          speaks gently to the dog.\r\n\r\n                          CURTIS (CONT'D)\r\n           Get in.\r\n          Red walks into the pen.\r\n\r\n                          CURTIS (CONT'D)\r\n           Good boy.\r\n          Curtis closes the gate, kneels and places his hands on the\r\n          fence. Red approaches so that his nose is touching Curtis'\r\n          fingers. Curtis scratches him.\r\n\r\n                          CURTIS (CONT'D)\r\n           I'm sorry about this buddy. We\r\n           just gotta work it like this for\r\n           awhile okay?\r\n          Curtis stands, wiping his hands off on his jeans. He sees\r\n          the Storm Shelter poking up from behind the trash pile. He\r\n          looks down at Red.\r\n          Curtis walks to the Shelter. Clearing past the trash pile,\r\n          the shelter appears, the mound fully visible.\r\n          Curtis stops at the angled doors. He studies them. A rusted\r\n          padlock is snapped shut across the handles. He reaches out\r\n          and lifts up the padlock. He yanks on it, then lets it fall.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - DAY\r\n\r\n          Coins splash across the kitchen counter. Curtis sets an\r\n          empty coffee can back on the shelf in front of him and begins\r\n          sifting through the change.\r\n          Odd screws, buttons, then he gets to what he's looking for.\r\n          A small set of brass keys on a matching ring. He grabs the\r\n          keys from the pile and exits.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - CONTINUOUS\r\n\r\n          Curtis walks back out to the storm shelter, keys in hand,\r\n          long flashlight in his back pocket.\r\n          He pulls up the padlock that holds the two rusted doors\r\n          together. Popping off the rubber cover, he tries a key. The\r\n          lock pops up. He unhooks it from the doors and lets it fall\r\n          to the ground.\r\n          Curtis strains to pull the first door open. It's heavy and\r\n          sticks from lack of use. Finally, with a creak, the door\r\n          swings back.\r\n\r\n           24.\r\n\r\n                         \r\n          Curtis holds his head to the side, a musty odor coming from\r\n          inside. He forces the second door open.\r\n          Curtis stands in front of the shelter, a gaping black hole\r\n          angled up from the earth.\r\n          He takes the flashlight from his pocket and turns it on. It\r\n          illuminates concrete steps leading down.\r\n          The dog, nose at the fence, watches from his pen on the other\r\n          side of the yard.\r\n          Curtis enters the shelter.\r\n\r\n                         \r\n\r\n          INT. STORM SHELTER - CONTINUOUS\r\n\r\n          It's pitch black inside. Curtis makes his way down the steps\r\n          and holds out the flashlight. An assortment of trash on the\r\n          ground, empty cans and water bottles, some candy wrappers.\r\n          The whole shelter is only about 6' X 8'. His head fits fine,\r\n          but he still ducks like he might bump it.\r\n          He shines the light on the back wall. A rotted, wooden bench\r\n          is bolted into the concrete there. Curtis walks to it and\r\n          takes a seat.\r\n          He's looking back toward the steps now. A shaft of light\r\n          cuts a strict beam through the open doors, lighting only the\r\n          concrete entry.\r\n          Curtis takes in the quiet of the concrete box. He leans his\r\n          head back on the wall and closes his eyes.\r\n          He shuts off his flashlight. Left in the dark, he takes a\r\n          deep breath. Exhales slowly.\r\n\r\n                         \r\n\r\n          INT. DEN - NIGHT\r\n\r\n\r\n                          NEWS ANCHOR\r\n\r\n                          (ON TELEVISION)\r\n           While rescue workers made several\r\n           attempts to reach the family,\r\n           Walter Jacobs wife...\r\n          Curtis sits in his Lazyboy bent over a frozen dinner. He\r\n          watches the local news on TV. Samantha walks in with a glass\r\n          of milk and some Oreos, a magazine tucked under her arm.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - NIGHT\r\n\r\n          Samantha takes a TIN down from the top of the fridge. It has\r\n          designs of starfish and other ocean creatures on it.\r\n\r\n           25.\r\n\r\n                         \r\n          She sets the tin on the counter next to the tackle box she\r\n          uses as a cash register and yells to Curtis in the den.\r\n\r\n                          SAMANTHA\r\n           But that's what I don't understand.\r\n           If he didn't do anything why did\r\n           you put him out back?\r\n          Samantha counts out the money earned at the flea market. She\r\n          sets a portion aside and closes the tackle box. Curtis says\r\n          something, but it's inaudible.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           What?\r\n          She opens the tin and removes an envelope with the word\r\n          \"BEACH\" written on it in black sharpie. Samantha adds the\r\n          money to the envelope and puts up the jar. She opens the\r\n          fridge and takes out the milk.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          SAMANTHA (CONT'D)\r\n           You hear me? I said if he didn't\r\n           do anything why did you have to put\r\n           him outside?\r\n          Curtis' attention is on the TV. Samantha sits on the couch.\r\n\r\n                          CURTIS\r\n           I just wanted him to be outside for\r\n           awhile.\r\n\r\n                          SAMANTHA\r\n           He's your dog. He's always been an\r\n           inside dog.\r\n\r\n                          CURTIS\r\n           He's my dog, and that's why he's\r\n           outside. Right now with Hannah and\r\n           everything I just think it'd be\r\n           better.\r\n\r\n                          SAMANTHA\r\n           Hannah loves Red.\r\n\r\n                          CURTIS\r\n           Hold on.\r\n          Curtis stares at the television program. Samantha's eyes\r\n          narrow. Frustrated, she flips open her magazine.\r\n\r\n                          NEWS ANCHOR\r\n           ...the gas cloud spread across\r\n           their six acre property.\r\n\r\n                          (MORE)\r\n\r\n           26.\r\n\r\n                         \r\n\r\n           NEWS ANCHOR (CONT'D)\r\n           The only way off their land was\r\n           across the train tracks which were\r\n           blocked by wreckage.\r\n\r\n                          WALTER JACOBS\r\n           (from a hospital bed)\r\n           I tried using some wet rags and\r\n           towels to breathe through but that\r\n           just seemed to make it worse.\r\n\r\n                          NEWS ANCHOR\r\n           While rescue workers made several\r\n           attempts to reach the family,\r\n           Walter Jacobs' wife and brother-in-\r\n           law died in the home. Jacobs\r\n           survived despite enduring eleven\r\n           hours of exposure to the gas cloud\r\n           before finally being flown out by\r\n           helicopter.\r\n\r\n                          CURTIS\r\n           You hearin' this?\r\n          Her nose still in the magazine.\r\n\r\n                          SAMANTHA\r\n           It's awful.\r\n\r\n                          CURTIS\r\n           Eleven hours. No way out.\r\n          Samantha shakes her head. Curtis watches the footage of\r\n          Walter Jacobs. He watches his red rimmed eyes. The deep\r\n          lines in his face.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME - DAY\r\n\r\n          It's daytime, but the house feels dark from the storm blowing\r\n          outside. The SOUND of rain pelts the windows and roof.\r\n          Curtis, dressed for work, walks from his bedroom down the\r\n          hallway. He passes the den and stops at its entryway.\r\n\r\n          IN THE DEN,\r\n          Hannah sits on the couch with her back to him. She's on her\r\n          knees looking out one of the front windows.\r\n          A dull orange glow halos from the bank of windows. What\r\n          sunlight there is appears diffused by the dark, thick rain\r\n          smearing down the outside of the glass.\r\n\r\n          A THUNDER STRIKE.\r\n\r\n           27.\r\n\r\n                         \r\n          Curtis flinches. He shows concern as heavier rain begins\r\n          battering the house. The wind picks up making wood beams\r\n          creak on their foundation.\r\n\r\n                          CURTIS\r\n           Hannah.\r\n          Hannah doesn't move. She continues staring out the window.\r\n          The SOUND of the storm outside intensifies. Windows begin to\r\n          rattle in their frames.\r\n          Curtis walks over and reaches for Hannah but is startled by\r\n          the sight of a MAN'S FACE just outside the window. Hannah\r\n          and the Man have been staring at one another.\r\n          The Man, hollow eyed and pale, moves out of the window and\r\n          out of sight.\r\n\r\n                          CURTIS (CONT'D)\r\n           Hey!\r\n          Thunder CRACKS overhead. Curtis scoops Hannah into his arms\r\n          and heads out of the room.\r\n          BANG. The front door rattles. Curtis stops and turns back.\r\n          BANG. BANG. The SOUND of someone kicking at the front door.\r\n          The storm outside has grown to a deafening pitch.\r\n          The power goes out.\r\n          The entire house vibrates, like a freight train running\r\n          across the roof. The BANGING at the front door continues,\r\n          frame giving way, as the STORM reaches its apex.\r\n          Curtis, holding Hannah, kneels and braces himself in the\r\n          entryway to the den. He covers the back of Hannah's head\r\n          with his hands and squeezes her tight into his shoulder.\r\n          Then Silence. A stillness.\r\n          The rain stops. No more banging at the front door. The SUN\r\n          moves brightly though the front windows.\r\n\r\n          WOOSH.\r\n          The furniture in the den lifts off the ground. A couch,\r\n          Lazyboy, coffee table and lamp. It all hangs in the air,\r\n          floating for a moment. Quietly.\r\n          Curtis watches, eyes wide. A rumbling. Grows. The SUNLIGHT\r\n          vanishes.\r\n          SMASH! The sound of the storm is sucked back into the room as\r\n          the furniture crashes to the floor, breaking apart on impact.\r\n\r\n           28.\r\n\r\n                         \r\n          The windows BLOW OUT.\r\n          Curtis squeezes his eyes shut and pivots his body, trying to\r\n          protect Hannah. Shards of glass splinter across his face.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - DAY\r\n\r\n          Curtis gasps for air. It doesn't come.\r\n          Gasp. He's sucking for a breath. Hyperventilating.\r\n          He rises up in bed, gasping. His face flushed and head\r\n          soaked in sweat. His eyes dart around the room, frantically\r\n          searching his surroundings.\r\n          One more gasp, and air enters his lungs. He coughs. More\r\n          air. Long, deep breaths. He's calming down.\r\n          His breathing comes under control. His attention turns to\r\n          something else. Something under the sheets.\r\n          Curtis pulls back the bed sheets. The mattress is soaked in\r\n          YELLOW urine. This scares him.\r\n          His hand trembles as he reaches out to touch his wet boxers.\r\n          The toilet FLUSHES. Footsteps in heels.\r\n          Curtis quickly pulls the covers back up. Samantha enters the\r\n          bedroom. She pulls her hair into a tight ponytail and picks\r\n          earrings off a nearby dresser, her back to Curtis.\r\n\r\n                          CURTIS\r\n           Babe?\r\n\r\n                          SAMANTHA\r\n           Yeah?\r\n\r\n                          CURTIS\r\n           You got the number for Dr. Shannan?\r\n          She turns.\r\n\r\n                          SAMANTHA\r\n           You're still not feeling good?\r\n\r\n                          CURTIS\r\n           Yeah, but you got the number?\r\n\r\n                          SAMANTHA\r\n           Uh, yeah baby but he'll be closed\r\n           today.\r\n          She approaches the bed and he holds his hand out.\r\n\r\n           29.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           Right. Yeah. I'll call tomorrow.\r\n\r\n                          SAMANTHA\r\n           Honey if you're not feeling good we\r\n           take you in somewhere.\r\n          She walks closer to the bed.\r\n\r\n                          CURTIS\r\n           No. Stop!\r\n          She's taken aback.\r\n\r\n                          SAMANTHA\r\n           Okay. Do you want me to cancel\r\n           lunch today...\r\n\r\n                          CURTIS\r\n           Shit...\r\n\r\n                          SAMANTHA\r\n           What is that?\r\n\r\n                          CURTIS\r\n           I'm sorry. I'm sorry. It's just I\r\n           got a sore throat. I'm sorry I'm\r\n           taking it out on you.\r\n\r\n                          SAMANTHA\r\n           I was gonna leave Hannah with you\r\n           so I could go to church, but I'm\r\n           not going to with you like this.\r\n\r\n                          CURTIS\r\n           It's fine. I'll be fine.\r\n\r\n                          SAMANTHA\r\n           No. She needs breakfast.\r\n\r\n                          CURTIS\r\n\r\n                          (STERN)\r\n           I've got it.\r\n\r\n                          SAMANTHA\r\n           I'm sorry that you feel bad but you\r\n           need to drop the attitude.\r\n\r\n                          CURTIS\r\n           Come on. Just go.\r\n\r\n                          SAMANTHA\r\n           What's wrong with you?\r\n\r\n                          CURTIS\r\n           I'm sorry, I'm sorry. Just go.\r\n\r\n           30.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           Hannah's in the den. We have\r\n           cereal for her.\r\n          Samantha stomps out of the room. Curtis sighs. He halfway\r\n          lifts the sheet then lets it fall again.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - LATER\r\n\r\n          Curtis strips the sheets off the bed.\r\n\r\n                         \r\n\r\n          INT. HALLWAY - DAY\r\n\r\n          The laundry room is a stackable set squeezed into a closet\r\n          off the hallway.\r\n          Curtis loads the sheets into the washer and presses start.\r\n          Watching the clothes spin, a thought.\r\n\r\n                         \r\n\r\n          INT. DEN - DAY\r\n\r\n          Curtis pushes Hannah's shoe onto her foot. He stops with the\r\n          shoes to concentrate. He moves his index finger from one\r\n          shoulder to the other and speaks.\r\n\r\n                          CURTIS\r\n           We're going out.\r\n          Confused, she slices her finger down an open palm.\r\n\r\n                          CURTIS (CONT'D)\r\n           (with open palms)\r\n           We're going out. Okay? It's okay.\r\n\r\n                         \r\n\r\n          EXT. GRAFTON PUBLIC LIBRARY - DAY\r\n\r\n          Curtis leads Hannah up the front walk of the Grafton Public\r\n          Library. It's a one-story brick building with 1960's\r\n          architecture. The parking lot is nearly empty behind them.\r\n\r\n                         \r\n\r\n          INT. GRAFTON PUBLIC LIBRARY - CONTINUOUS\r\n\r\n          Curtis holds the glass front door open for Hannah. They stop\r\n          in the entryway and survey the LIBRARY.\r\n          There are only a few people, one of which is the LIBRARIAN\r\n          sitting behind a central desk. It is an open room with\r\n          cinder block walls painted in brightly colored shapes.\r\n\r\n           31.\r\n\r\n                         \r\n          Curtis finds the children's section to the left and leads\r\n          Hannah over. She takes a seat at a kid's size table as\r\n          Curtis grabs a Dinosaur book from a nearby display.\r\n          Kneeling in front of her, Curtis shows her the book and\r\n          motions with open hands to the ground.\r\n\r\n                          CURTIS\r\n           You stay put okay?\r\n          Hannah begins looking through the book. Curtis stands, he\r\n          sees a set of computers under a sign reading, \"CATALOGUE\".\r\n\r\n          AT THE COMPUTERS,\r\n          Curtis takes a seat in front of one of the two computers set\r\n          up on a folding table. He eyes the search screen. Title,\r\n          Author, Subject.\r\n          He clicks on \"Subject\" and types the word \"DREAMS\". He\r\n          scrolls through a list of titles and writes down a number.\r\n          He looks back for Hannah. She's still flipping through her\r\n          book. No one else is around.\r\n          He begins another search. He types \"MENTAL ILLNESS\".\r\n\r\n          AT THE BOOK SHELVES,\r\n          Curtis scans the spines looking for his title. He already\r\n          holds two books against his chest.\r\n          He pulls out a thick hard cover book. The title reads,\r\n          \"Understanding Mental Illness.\"\r\n\r\n                         \r\n\r\n          I/E. CURTIS' TRUCK/GRAFTON STREETS - MOVING - DAY\r\n          Hannah is once again strapped into her car seat. She holds a\r\n          big children's book in her hands.\r\n          They pass a Grocery Store. Curtis turns as it goes by.\r\n          The truck pulls a U-turn in the street and heads for the\r\n          store parking lot.\r\n\r\n                         \r\n\r\n          INT. GROCERY STORE - DAY\r\n\r\n          Curtis pushes a cart down the aisle. Hannah rides in the\r\n          fold down metal seat.\r\n          They stop at the bottled water section. Curtis loads several\r\n          plastic, gallon jugs of water into his cart.\r\n          The cart is filled with an assortment of supplies:\r\n          Batteries, canned food, first aid supplies, matches.\r\n\r\n           32.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME/DINING ROOM - DAY\r\n\r\n          Samantha sits in the dining room at a fully dressed table.\r\n          Steam rises off bowls of mashed potatoes and green beans.\r\n          Fried chicken piled on a platter.\r\n          MELVIN(58) taps his finger on the empty plate in front of him\r\n          and subtly checks his watch. JANINE(57) smooths out the\r\n          embroidered table cloth.\r\n          KATHRYN(37) and CHARLIE(39) tend to their child, REX(3). Rex\r\n          repeatedly jams a finger into the potatoes.\r\n\r\n                          SAMANTHA\r\n           Let's just start.\r\n\r\n                          MELVIN\r\n           Let's all join hands for the\r\n           blessing.\r\n          The SOUND of the front door opening. Samantha gets up and\r\n          leaves the room.\r\n\r\n          BY THE FRONT DOOR,\r\n          Curtis has Hannah in his arms. He closes the door. Samantha\r\n          appears behind them. She speaks in a hushed, angry voice.\r\n\r\n                          SAMANTHA\r\n           Where the hell have you been?\r\n\r\n                          CURTIS\r\n           I know. I'm sorry. I had to run an\r\n           errand.\r\n\r\n                          SAMANTHA\r\n           You're really late.\r\n\r\n                          CURTIS\r\n           I know.\r\n\r\n                          SAMANTHA\r\n           You didn't even bring your cell\r\n           phone.\r\n          Samantha heads back to the dining room. Curtis sucks his\r\n          teeth.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME/DINING ROOM - LATER\r\n\r\n          Potatoes dalloped, chicken passed, the table is active with\r\n          the family serving and eating. Curtis watches it all,\r\n          somehow separated from it. He's exhausted.\r\n\r\n           33.\r\n\r\n                         \r\n\r\n                          MELVIN\r\n           Missed you at church this mornin'\r\n           Curtis.\r\n\r\n                          SAMANTHA\r\n           Dad.\r\n\r\n                          MELVIN\r\n           He knows what to do if he wants me\r\n           to stop askin'.\r\n          Curtis looks at him.\r\n\r\n                          CURTIS\r\n           Was it a good service?\r\n\r\n                          MELVIN\r\n           It was. It was good work.\r\n          Curtis nods. The family in front of him eats the meal.\r\n\r\n                          CURTIS\r\n           I'm thinking about cleaning up that\r\n           storm shelter out back.\r\n          They look at him.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME/HALLWAY - EVENING\r\n\r\n          Light from the open closet door cuts a shape in the\r\n          relatively dark hallway.\r\n          Curtis roots through the back of the closet.\r\n\r\n                         \r\n\r\n          INT. STORM SHELTER - SERIES OF IMAGES - NIGHT\r\n\r\n          -Curtis sweeps the concrete floor of the storm shelter. A\r\n          Coleman camping lantern sits on the wooden bench attached to\r\n          the back wall. It casts an odd light up into the room.\r\n          -Curtis places cans of food onto metal shelves.\r\n          -Curtis flips through keys on his key ring. He adds the two\r\n          small padlock keys to the ring.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - NIGHT\r\n\r\n          Samantha sits on the bed in her pajamas applying lotion to\r\n          her legs. She wipes the remainder on her knuckles and looks\r\n          at the empty spot on Curtis' side of the bed.\r\n\r\n           34.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - CONTINUOUS\r\n\r\n          Samantha walks into the kitchen and turns off the overhead\r\n          light. She pauses, seeing something in the backyard.\r\n          She stops at the back door and stares out at the storm\r\n          shelter. The camp lantern's orange light glows through the\r\n          open metal doors.\r\n          She watches for a moment.\r\n\r\n                         \r\n\r\n          INT. STORM SHELTER - CONTINUOUS\r\n\r\n          The shelter has been cleaned up. The metal shelves hold\r\n          canned food, water jugs and first aid supplies. Blankets and\r\n          pillows are stacked on the other side of the room.\r\n          Curtis sits in the back corner of the shelter on the wooden\r\n          bench. He flips through one of the books from the library.\r\n          The cover reads, \"DREAM ANALYSIS AND INTERPRETATION\". The\r\n          book on mental illness sits by his feet.\r\n\r\n                         \r\n\r\n          INT. DOCTOR'S OFFICE/RECEPTION AREA - DAY\r\n\r\n          The Doctor's Office is a converted one-story residential\r\n          house. Curtis slouches in a faux leather chair grouped in\r\n          the small reception area. He has nodded off.\r\n          His head snaps up. He sucks air through his nose and sits up\r\n          in his chair. He sees a WOMAN(25) reading a children's book\r\n          aloud to her DAUGHTER(3) on a colorful rug in the corner.\r\n          A door opens and a NURSE with a clipboard steps out.\r\n\r\n                          NURSE\r\n           Curtis?\r\n          Curtis stands and follows the nurse out of the room.\r\n\r\n                         \r\n\r\n          INT. DOCTOR'S OFFICE/EXAM ROOM - DAY\r\n\r\n          Curtis sits, fully clothed, on the edge of a paper covered\r\n          bench in the exam room. DOCTOR SHANNAN, an older man with a\r\n          smoker's voice, enters smiling and gives a firm handshake.\r\n\r\n                          DOCTOR SHANNAN\r\n           Curtis, how you doin' bud?\r\n\r\n                          CURTIS\r\n           Hey Doc.\r\n\r\n                          DOCTOR SHANNAN\r\n           How's my girl?\r\n\r\n           35.\r\n\r\n                         \r\n          The Doctor turns to a small table in the corner and grabs a\r\n          wooden tongue depressor and an otoscope from a drawer.\r\n\r\n                          CURTIS\r\n           She's good.\r\n\r\n                          DOCTOR SHANNAN\r\n           That's good to hear. Tilt your\r\n           head back for me.\r\n          The Doctor shines the otoscope into his nostrils.\r\n\r\n                          CURTIS\r\n           I don't have a cold.\r\n          The Doctor pauses and turns to check a chart on the table.\r\n\r\n                          DOCTOR SHANNAN\r\n           Oh. Did she get that down wrong?\r\n\r\n                          CURTIS\r\n           No, I just told her that.\r\n\r\n                          DOCTOR SHANNAN\r\n           Oh. So what's the problem?\r\n\r\n                          CURTIS\r\n           I've been havin'...I've been having\r\n           some trouble sleepin'. I was\r\n           hopin' you could give me somethin'\r\n           for it.\r\n          Doctor Shannan takes a seat on a rolling stool and processes\r\n          the request.\r\n\r\n                          DOCTOR SHANNAN\r\n           How long's this been goin' on?\r\n\r\n                          CURTIS\r\n           `Bout four nights now.\r\n\r\n                          DOCTOR SHANNAN\r\n           You're not sleepin' at all?\r\n\r\n                          CURTIS\r\n           Well some, but real restless.\r\n\r\n                          DOCTOR SHANNAN\r\n           Well, I think four nights is a\r\n           little too soon to tell. My advice\r\n           would be to not eat or drink\r\n           anything after 8 o'clock at night.\r\n           Cut back on any alcoholic drinks,\r\n           tobacco, caffeine...get some daily\r\n           exercise.\r\n\r\n           36.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           Well, I think...\r\n          Curtis isn't sure how much he wants to say.\r\n\r\n                          CURTIS (CONT'D)\r\n           I think I may need to try some\r\n           medication.\r\n\r\n                          DOCTOR SHANNAN\r\n           Why do you say that?\r\n\r\n                          CURTIS\r\n\r\n                          (STILL RELUCTANT)\r\n           The reason I've been having trouble\r\n           sleeping is because of some dreams\r\n           I've been havin'. I didn't think\r\n           it was anything at first, but then\r\n           the other day I woke up and the bed\r\n           was wet.\r\n\r\n                          DOCTOR SHANNAN\r\n           You urinated in your bed?\r\n\r\n                          CURTIS\r\n           Yeah. Couple days before that I\r\n           had a dream that my dog attacked me\r\n           and it took all day for the pain in\r\n           my arm to go away.\r\n          Doctor Shannan leans his back against the table and thinks\r\n          about this.\r\n\r\n                          DOCTOR SHANNAN\r\n           You been to see your mother lately?\r\n          He swivels the stool around and writes on a prescription pad.\r\n\r\n                          CURTIS\r\n           It's been about a month.\r\n          He tears two sheets off and holds the first out to Curtis.\r\n\r\n                          DOCTOR SHANNAN\r\n           Okay. This is a prescription for a\r\n           pretty mild sedative. It's non-\r\n           habit forming, but I'm only giving\r\n           you enough for a few days anyway.\r\n           Take it and see if it helps. In\r\n           the meantime,\r\n           (holds up the other slip)\r\n           This is the number of a good friend\r\n           of mine in Columbus. He's a\r\n           psychiatrist. It's a drive, but\r\n           he's the best I know.\r\n\r\n           37.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           Okay.\r\n\r\n                          DOCTOR SHANNAN\r\n           I'll give him a call and let him\r\n           know you'll be down to see him.\r\n\r\n                          CURTIS\r\n           All right.\r\n\r\n                         \r\n\r\n          EXT. PUMP STATION CONSTRUCTION SITE/FARMLAND - DAY\r\n\r\n          The construction site sits in the middle of open farmland but\r\n          is considerably more involved than Curtis' last job site.\r\n          Dump trucks, backhoes and cement mixers roll and beep across\r\n          muddy ground. A 20 MAN CREW operates throughout.\r\n\r\n          NEAR THE WELL DRILLING RIG,\r\n          Dewart pushes down a lever that activates the hydraulic lift\r\n          for the drill. Curtis appears behind him.\r\n\r\n                          CURTIS\r\n           Hey Dewart!\r\n\r\n                          DEWART\r\n\r\n                          (HALF TURNING)\r\n           What you say Curtis?\r\n\r\n                          CURTIS\r\n           Not much.\r\n          Curtis kneels at the ground beside the rig. Sifts dirt\r\n          through his fingers.\r\n\r\n                          DEWART\r\n           They want us to get a pilot hole\r\n           drilled by lunch. I figure worse\r\n           comes to worse we can eat on the\r\n           rig.\r\n\r\n                          CURTIS\r\n           Yeah, we'll get it done. Weekend\r\n           all right?\r\n\r\n                          DEWART\r\n           Yeah. Same old shit.\r\n\r\n                         \r\n\r\n          EXT. PUMP STATION CONSTRUCTION SITE/FARMLAND - LATER\r\n\r\n          It's lunchtime. The men sit around in different groups\r\n          eating out of bagged lunches.\r\n          Curtis eats a sandwich and watches the men. Some bitching.\r\n          Others laughing.\r\n\r\n           38.\r\n\r\n                         \r\n          Wind blows through a wooded area nearby. He watches the\r\n          leaves move. He looks to the sky. It's a beautiful day.\r\n          Almost peaceful.\r\n\r\n                         \r\n\r\n          EXT. SHEPHERD INSURANCE OFFICE - DAY\r\n\r\n          The insurance office sits in a row of small downtown\r\n          buildings.\r\n\r\n           INSURANCE AGENT (O.S.)\r\n           No. I need the name of the\r\n           specialist whose diagnosis you'll\r\n           accept.\r\n\r\n                         \r\n\r\n          INT. SHEPHERD INSURANCE OFFICE - DAY\r\n\r\n          An INSURANCE AGENT(62) sits behind her desk with the phone to\r\n          her ear. She's an older woman wearing a pant suit.\r\n          Samantha sits by a fake plant and sips a Coke. She watches\r\n          Hannah play with building blocks from a plastic tub provided\r\n          by the office.\r\n\r\n                          INSURANCE AGENT\r\n           (into the phone)\r\n           No. Look it. I've told you this\r\n           twice. Please. Just get me the name\r\n           and or the approval code.\r\n\r\n                          (BEAT)\r\n           Okay.\r\n          The Agent writes something down.\r\n\r\n           INSURANCE AGENT (CONT'D)\r\n           (into the phone)\r\n           All right. And the phone. Well\r\n           great. Thank you very much.\r\n          The Agent hangs up the phone and rips a piece of paper from\r\n          the pad in front of her. She hands it to Samantha.\r\n\r\n           INSURANCE AGENT (CONT'D)\r\n           This is the name and number of the\r\n           specialist who the insurance\r\n           company approves of. Just call and\r\n           make an appointment. Now if this\r\n           doctor signs off , you should have\r\n           the implant procedure fully\r\n           covered. I'm sorry it took so\r\n           long.\r\n          Samantha looks at the paper, impressed.\r\n\r\n                          SAMANTHA\r\n           Can I give you a hug?\r\n\r\n           39.\r\n\r\n                         \r\n\r\n                          INSURANCE AGENT\r\n           It's fine. It's fine. You know\r\n           your husband's company actually has\r\n           very good insurance when it kicks\r\n           in. Not a lot of jobs offer\r\n           policies half as good. You're very\r\n           lucky.\r\n\r\n                         \r\n\r\n          INT. GROCERY STORE PHARMACY - DAY\r\n\r\n          Curtis stands in line at the pharmacy located in the back\r\n          corner of the grocery store. He approaches the counter and\r\n          hands over his prescription to a female PHARMACIST.\r\n          She disappears behind a divider as Curtis removes his wallet.\r\n          He takes out an insurance card and runs his thumb over the\r\n          bills.\r\n          The Pharmacist returns with a stapled white bag. Curtis\r\n          holds out the insurance card.\r\n\r\n                          PHARMACIST\r\n           That's okay. We have your\r\n           insurance on file. That'll be\r\n\r\n           $47.64.\r\n\r\n                          CURTIS\r\n           What's the co-pay?\r\n\r\n                          PHARMACIST\r\n           That is your co-pay.\r\n          Curtis studies the small paper sack and removes three, 20\r\n          dollar bills from his wallet.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME - EVENING\r\n\r\n          Curtis enters the front door, closing it behind him. He\r\n          turns and is met by Samantha, who wraps her arms around him.\r\n\r\n                          CURTIS\r\n           Hey.\r\n          She squeezes him. Then kisses him.\r\n\r\n                          SAMANTHA\r\n           I love you.\r\n\r\n                          CURTIS\r\n           I love you too.\r\n\r\n                          SAMANTHA\r\n           I have good news.\r\n\r\n           40.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - LATER\r\n\r\n          Curtis finishes off a dinner of roast and potatoes. Samantha\r\n          sets the piece of paper the Insurance Agent gave her in front\r\n          of him and begins clearing the table.\r\n          Hannah draws on a piece of construction paper at the other\r\n          end of the table. Samantha picks up a crayon and shows it to\r\n          Hannah.\r\n\r\n                          SAMANTHA\r\n           Green? How `bout a red?\r\n          She pretends to use the crayon as lipstick.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           It was like talking to a sane\r\n           person for once. She made one\r\n           phone call. That's it. I've been\r\n           trying that 800 number for weeks.\r\n\r\n                          CURTIS\r\n           It's great. It's great.\r\n\r\n                          (TO HANNAH)\r\n           Hey, Hannah.\r\n          Hannah doesn't look up. He stands and goes over to her.\r\n          Touches her shoulder and kneels beside her.\r\n\r\n                          CURTIS (CONT'D)\r\n           You excited? Huh? We're gonna get\r\n           you some help.\r\n          Curtis touches his finger to her chest then stops. He can't\r\n          think of the sign. He turns to Samantha.\r\n\r\n                          CURTIS (CONT'D)\r\n           How do you say...sign excited?\r\n\r\n                          SAMANTHA\r\n           Like this.\r\n          Samantha shows him the sign. Curtis mimics.\r\n\r\n                          CURTIS\r\n           Excited. Yeah?\r\n          Hannah nods. He kisses her on the forehead. He picks up a\r\n          crayon and holds it up to her lips like lipstick.\r\n\r\n                          CURTIS (CONT'D)\r\n           Now I got to do you.\r\n\r\n           41.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - NIGHT\r\n\r\n          Samantha lies under the covers looking at a real estate\r\n          magazine. Curtis takes off his clothes by the dresser. He\r\n          subtly removes a prescription bottle from his pants pocket\r\n          and cups it in his palm.\r\n\r\n                          SAMANTHA\r\n           Oh, honey. Look at this one. It's\r\n           a 2-1 and it sits directly on the\r\n           beach. Wouldn't that be great? We\r\n           wouldn't have to worry about Hannah\r\n           crossing traffic.\r\n          Curtis walks over and leans in to see the page. They are\r\n          rental photos of beach condos.\r\n\r\n                          CURTIS\r\n           What's the rent?\r\n\r\n                          SAMANTHA\r\n           Eight ninety nine a week.\r\n\r\n                          CURTIS\r\n           That sounds real nice.\r\n          Samantha keeps flipping through the magazine as Curtis heads\r\n          to the bathroom.\r\n\r\n                         \r\n\r\n          INT. BATHROOM - CONTINUOUS\r\n\r\n          Curtis turns the water on in the sink and shakes two pills\r\n          from the orange bottle. He stuffs them in his mouth and\r\n          chases it with water from the faucet.\r\n          Curtis looks at himself in the mirror for a moment before\r\n          cutting out the light.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - MORNING\r\n\r\n          A crack in the ceiling slowly comes into focus.\r\n          Curtis sits up in bed, rubbing his eyes. He looks around the\r\n          room. He hears Samantha in the kitchen.\r\n          He takes a deep breath, smelling the breakfast cooking.\r\n          Curtis smiles.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - MOMENTS LATER\r\n\r\n          Curtis sits at the kitchen table as Samantha dishes up some\r\n          eggs.\r\n\r\n           42.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           You sleep well?\r\n\r\n                          CURTIS\r\n           Yeah. I did.\r\n\r\n                          SAMANTHA\r\n           You look like you're feeling\r\n           better.\r\n          Curtis nods and eats his breakfast.\r\n\r\n                         \r\n\r\n          EXT. PUMP STATION CONSTRUCTION SITE/FARMLAND - DAY\r\n\r\n          Curtis and Dewart attach a drill bit to the rig.\r\n\r\n                          CURTIS\r\n           You want me to come there and do it\r\n           for you? Jesus.\r\n          Curtis steadies the large metal piece as Dewart ratchets it\r\n          down.\r\n\r\n                          CURTIS (CONT'D)\r\n           Hey, how much food do you think\r\n           you'd need to live on for a week?\r\n\r\n                          DEWART\r\n           What do you mean?\r\n\r\n                          CURTIS\r\n           I mean to stay alive. What do you\r\n           think you'd need?\r\n\r\n                          DEWART\r\n           Not a lot.\r\n\r\n                          CURTIS\r\n           You think?\r\n\r\n                          DEWART\r\n           I don't know. You hear about\r\n           people livin' for days all the time\r\n           offa bark and melted snow.\r\n\r\n                          CURTIS\r\n           I've never heard of that.\r\n\r\n                          DEWART\r\n           Shit I don't know. You asked the\r\n           question.\r\n\r\n                          CURTIS\r\n           It's on there. It's on. Come on.\r\n\r\n           43.\r\n\r\n                         \r\n          Curtis steps back from the arm of the drill. Dewart taps the\r\n          wrench on two bolts to make sure they are secure.\r\n\r\n          A LOUD BOOM RATTLES. THUNDER.\r\n          Curtis flinches at the sound.\r\n\r\n                          CURTIS (CONT'D)\r\n           Dammit.\r\n\r\n                          DEWART\r\n           What?\r\n          Curtis turns around and checks the sky. It's clear blue.\r\n          Not a cloud in sight.\r\n\r\n                          CURTIS\r\n           It sounds like thunder.\r\n\r\n                          DEWART\r\n           What sounds like thunder?\r\n\r\n          BOOM. ANOTHER THUNDER STRIKE.\r\n          Curtis doesn't move. He watches Dewart walk to the controls\r\n          of the drilling rig.\r\n\r\n          MORE THUNDER. ROLLING NOW.\r\n          Curtis steps back from the rig and checks the horizons.\r\n          Nothing. It's a beautiful day.\r\n          Dewart looks down at him. Curtis' face is pale, scared.\r\n          Curtis looks at him. Not sure what to say. Curtis turns and\r\n          walks to his truck.\r\n\r\n                          DEWART (CONT'D)\r\n           Where you goin'? Curtis. Where you\r\n           goin'?\r\n\r\n          BY CURTIS' TRUCK,\r\n          Curtis stops and rests his hands on the bed of the truck.\r\n          Another THUNDER STRIKE makes him flinch.\r\n          Curtis VOMITS next to the back tire.\r\n          He quickly stands, wiping his mouth. He checks over his\r\n          shoulders to see if anyone has seen him.\r\n\r\n                         \r\n\r\n          I/E. CURTIS' TRUCK/RURAL HIGHWAY - MOVING - DAY\r\n          Curtis studies his face in the rearview mirror as he sails\r\n          down the rural highway.\r\n\r\n           44.\r\n\r\n                         \r\n          He rubs his eyes with the back of his hand and looks in the\r\n          side mirror. The horizon is still clear.\r\n          Curtis begins to hyperventilate. Short breaths accompanied\r\n          by cold sweat. Sucking air. He can't breath. He panics.\r\n          The truck tires slide on the gravel shoulder as he abruptly\r\n          slams on the brakes and steers off the highway.\r\n          Dust settles outside as Curtis begins to get his breathing\r\n          under control. He rests his head on the steering wheel and\r\n          shuts his eyes tight.\r\n          Everything quiets down. His breathing. The road. No more\r\n          thunder.\r\n          Curtis looks out his passenger window.\r\n          His truck has stopped in front of a Tractor Trailer Depot. A\r\n          rusted shipping container with giant white letters painted on\r\n          it reads, \"CONTAINERS FOR SALE\".\r\n          Curtis stares at this. He climbs out of the truck.\r\n\r\n                         \r\n\r\n          EXT. TRAILER DEPOT - CONTINUOUS\r\n\r\n          Curtis walks around his truck to get a better look at the\r\n          depot. The dirt lot is piled high with containers.\r\n          He studies the \"FOR SALE\" sign, then a smaller sign next to\r\n          it that lists available sizes.\r\n          Curtis turns back to his truck and rubs his face, still\r\n          shaking things off. He looks up at the sky. Clear and blue.\r\n          A thought comes to him. He checks his watch.\r\n\r\n                         \r\n\r\n          I/E. CURTIS' TRUCK/INTERSTATE - DAY\r\n          Curtis drives down a divided four-lane interstate.\r\n\r\n                         \r\n\r\n          EXT. PLEASANT GROVE APARTMENTS - DAY\r\n\r\n          Curtis' truck pulls into the parking lot of the Pleasant\r\n          Grove Apartments. It's a well manicured, new construction\r\n          facility. The words \"AN ASSISTED LIVING COMMUNITY\" are\r\n          written under the apartment name on the sign out front.\r\n\r\n                         \r\n\r\n          INT. ASSISTED LIVING APARTMENT/HALLWAY - DAY\r\n\r\n          Curtis stands by the door for apartment 212 in an interior\r\n          carpeted hallway. He knocks.\r\n\r\n           45.\r\n\r\n                         \r\n          A passing ATTENDANT guides an elderly WOMAN down the hallway.\r\n          Curtis nods to them.\r\n          The door opens. SARAH(61), a plainly dressed woman much too\r\n          young to live in a nursing home, looks surprised.\r\n\r\n                          SARAH\r\n           Curtis.\r\n\r\n                          CURTIS\r\n           Hey Mom.\r\n          Her eyes light up and she wraps her arms around Curtis.\r\n\r\n                          SARAH\r\n           Come in.\r\n\r\n                          CURTIS\r\n           Sure.\r\n          She leads him inside.\r\n\r\n                         \r\n\r\n          INT. SARAH'S APARTMENT - CONTINUOUS\r\n\r\n          The apartment is small, but nicely kept. Not much furniture\r\n          or personal trappings. Framed family photos mostly.\r\n\r\n                          CURTIS\r\n           I'm going to get some water.\r\n          He fills his glass at the sink. Takes a sip.\r\n\r\n                          CURTIS (CONT'D)\r\n           You want some?\r\n\r\n                          SARAH\r\n           No.\r\n\r\n                         \r\n          Curtis enters the living area as Sarah stops in the\r\n          kitchenette.\r\n\r\n                         \r\n\r\n          INT. SARAH'S APARTMENT - MOMENTS LATER\r\n\r\n          Sarah runs her fingers around the bent edges of a small photo\r\n          of Hannah.\r\n\r\n                          SARAH\r\n           Isn't she lovely.\r\n          Curtis drops his head. He looks uncomfortable.\r\n\r\n                          CURTIS\r\n           Mom?\r\n\r\n           46.\r\n\r\n                         \r\n\r\n                          SARAH\r\n           Yes.\r\n\r\n                          CURTIS\r\n           I need to ask you somethin'.\r\n          She looks at him. Totally open.\r\n\r\n                          CURTIS (CONT'D)\r\n           Do you remember what year we\r\n           brought you up here? To the first\r\n           place.\r\n          She has to think about it.\r\n\r\n                          CURTIS (CONT'D)\r\n           It was `86.\r\n\r\n                          SARAH\r\n           Yes. Because Kyle was going to be a\r\n           senior.\r\n\r\n                          CURTIS\r\n           I was 10.\r\n\r\n                          SARAH\r\n           Yes.\r\n          Curtis nods.\r\n\r\n                          CURTIS\r\n           Can you remember what happened\r\n           before you got diagnosed?\r\n\r\n                          SARAH\r\n           What do you mean?\r\n\r\n                          CURTIS\r\n           I mean...I just want to know how it\r\n           all started. Before you had to\r\n           leave.\r\n          Sarah settles in her chair, understanding the question.\r\n\r\n                          SARAH\r\n           Oh, I don't know. I remember it\r\n           was a real stressful time. Your\r\n           father was gone a lot, and I\r\n           couldn't handle things on my own.\r\n\r\n                          CURTIS\r\n           Did you ever have any dreams? Like\r\n           bad dreams.\r\n\r\n                          SARAH\r\n           No. Nothing like that. There was\r\n           always...\r\n\r\n                          (MORE)\r\n\r\n           47.\r\n\r\n                         \r\n\r\n                          SARAH (CONT'D)\r\n           (searches for the words)\r\n           There was always a panic that took\r\n           hold of me. I thought people were\r\n           watching me or listening to me.\r\n\r\n           I...\r\n          Sarah is remembering. Her face draws tight, frustrated.\r\n\r\n                          CURTIS\r\n           It's all right. It's all right.\r\n           It's fine.\r\n          Sarah looks up and smiles. Her focus shifts back to her son.\r\n\r\n                          SARAH\r\n           Are you okay?\r\n\r\n                          CURTIS\r\n           Yeah. Yeah. I'm fine.\r\n          Sarah looks back down to Hannah's photo.\r\n\r\n                         \r\n\r\n          EXT. GAS STATION - LATE AFTERNOON\r\n\r\n          The relatively new gas station sits just off the interstate.\r\n          Curtis stands at the pump filling up his truck.\r\n          He watches the numbers next to the dollar sign roll higher.\r\n          He looks back at the busy freeway. Cars passing.\r\n          The pump stops. The final amount reads, \"$68.79\". He hangs\r\n          the hose back onto the pump and pulls a cell phone from his\r\n          pocket. He dials and waits.\r\n\r\n                          CURTIS\r\n           (into the phone)\r\n           May I have the number for Doctor\r\n           George Shannan?\r\n\r\n                          (WAITS)\r\n           Thanks.\r\n          Curtis, phone still at his ear, turns and watches the\r\n          horizon. The sun hangs low in the sky. A reddish haze.\r\n\r\n                          CURTIS (CONT'D)\r\n           (into the phone)\r\n           Hi, is Doctor Shannan there? May I\r\n           speak with him? This is Curtis\r\n           LaForche.\r\n\r\n                          (WAITS)\r\n           Hey Doc. Yeah, sorry...Sorry to\r\n           call you at home, I just don't\r\n           think I can make it to Columbus to\r\n           see that psychiatrist. Yeah, it's\r\n           just too far. Is there somewhere\r\n           local you can send me?\r\n\r\n           48.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - NIGHT\r\n\r\n          Curtis steps quietly into the bedroom. The lights are on,\r\n          but Samantha has fallen asleep on top of the made bed.\r\n          He empties his pockets on the dresser and Samantha wakes up.\r\n\r\n                          SAMANTHA\r\n           Hey.\r\n\r\n                          CURTIS\r\n           Oh, hey. Sorry I woke you up.\r\n\r\n                          SAMANTHA\r\n           It's okay. Where you been?\r\n\r\n                          CURTIS\r\n           I went to see mom.\r\n          Samantha sits up in the bed.\r\n\r\n                          SAMANTHA\r\n           Is she okay?\r\n\r\n                          CURTIS\r\n           Mmm hmm. I just wanted to check up\r\n           on her.\r\n\r\n                          SAMANTHA\r\n           You shoulda told me we would have\r\n           gone with you.\r\n\r\n                          CURTIS\r\n           That's okay.\r\n          Samantha lays back down, tucking herself under the covers.\r\n\r\n                          SAMANTHA\r\n           Come to bed.\r\n\r\n                          CURTIS\r\n           I will in a bit.\r\n          Curtis finishes emptying his pockets.\r\n\r\n                         \r\n\r\n          INT. HANNAH'S BEDROOM - NIGHT\r\n\r\n          Hannah sleeps soundly in her bed. Curtis stands at the door\r\n          watching her. He walks over and takes a seat on the edge of\r\n          the bed. He listens to her breath.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - NIGHT\r\n\r\n          The backyard is almost pitch black. Curtis stands in front\r\n          of the storm shelter doors holding out the Coleman Lantern.\r\n\r\n           49.\r\n\r\n                         \r\n          He surveys the backyard with it. The trash pile has been\r\n          removed leaving the yard more open.\r\n          Curtis begins to count steps out from the left edge of the\r\n          shelter doors. He counts to himself, three feet per stride.\r\n          He begins to outline a rectangle.\r\n\r\n                         \r\n\r\n          INT. DEN - NIGHT\r\n\r\n          The house is quiet and the den is lit by a single lamp.\r\n          Curtis sits alone on the couch, hunched over the coffee\r\n          table. He writes on a yellow legal pad. It's a list with\r\n          the heading, \"REMODEL\". It reads:\r\n          -Shipping Container, $1,800\r\n\r\n          -PVC, $475\r\n          -Plumbing and waste, $1,650\r\n          -Bobcat, $1,750\r\n          -Jackhammer with pneumatics, $800\r\n          -Sealant, $150\r\n          -Dirt, -$250\r\n          At the bottom of the list, Curtis writes the figure, \"$7,500\"\r\n          and circles it.\r\n          He studies the number, then begins drawing a rectangular\r\n          diagram below it.\r\n\r\n                         \r\n\r\n          INT. FIRST NATIONAL BANK OFFICE - DAY\r\n\r\n          Curtis blows into a Styrofoam cup and stares through the\r\n          blinds of an office window. Outside, a flag snaps at the top\r\n          of a pole next to the FIRST NATIONAL BANK sign.\r\n          He looks down at a NEWSPAPER laid out on an end table next to\r\n          him. He flips it over and studies the ads on the back. A\r\n          big one in the corner catches his eye.\r\n          It reads, \"CUYAHOGA GUN AND KNIFE SHOW!\" The ad lists items\r\n          for sell/trade: ...Tactical Gear, Gas Masks, Batons...\r\n          Curtis focuses in on the words \"Gas Masks\" and tears the ad\r\n          out. JOHN MYERS(34) enters with a set of papers in his hand.\r\n          Curtis quickly tucks the ad into his back pocket.\r\n          Myers takes a seat in one of two chairs in front of his desk\r\n          and looks over the papers. He takes a pen out of his pocket\r\n          as Curtis sits down next to him.\r\n\r\n                          MYERS\r\n           Well you've kept up with the\r\n           payments on the house.\r\n\r\n           50.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           We've been good about that.\r\n          Myers nods, but he carries a look of concern. He confides.\r\n\r\n                          MYERS\r\n           I gotta tell you Curtis, banks\r\n           aren't loaning money the way they\r\n           used to. We've got you a loan\r\n           today, but the interest rates are\r\n           variable and we have to tie it to\r\n           your house.\r\n\r\n                          CURTIS\r\n           That's fine.\r\n          Myers sits back, drawing the pen to his lips and tapping it.\r\n\r\n                          MYERS\r\n           Curtis, I've known you a long time.\r\n           We financed your house for you, two\r\n           vehicles. I'm telling you this is\r\n           a risky loan you're taking.\r\n\r\n                          CURTIS\r\n           I need the money John.\r\n          Myers nods, then leans forward and clicks the pen.\r\n\r\n                          MYERS\r\n           Okay.\r\n\r\n                         \r\n\r\n          EXT. FIRST NATIONAL BANK - DAY\r\n\r\n          Curtis opens the door to his truck which is parked in the\r\n          bank's lot. He unbuttons his starched white shirt and places\r\n          it on the truck seat.\r\n          He pulls out a dirty blue work shirt and begins buttoning it.\r\n\r\n                         \r\n\r\n          EXT. PUMP STATION CONSTRUCTION SITE/FARMLAND - DAY\r\n\r\n          Dewart sits at the controls of the drilling rig. He sees\r\n          Curtis approaching through the construction site. Curtis\r\n          waves two fingers at him. Dewart shuts down the drill.\r\n\r\n                          CURTIS\r\n           Hey.\r\n\r\n                          DEWART\r\n           Hey.\r\n\r\n                          CURTIS\r\n           Sorry I left you yesterday.\r\n\r\n           51.\r\n\r\n                         \r\n          Dewart hops down and the two approach the drill site. Dewart\r\n          seems sullen.\r\n\r\n                          DEWART\r\n           Jim came by. I covered for you.\r\n\r\n                          CURTIS\r\n           Thanks.\r\n\r\n                          DEWART\r\n           I need your help with the depth\r\n           charts.\r\n\r\n                          CURTIS\r\n           Sure.\r\n\r\n                         \r\n\r\n          EXT. PUMP STATION CONSTRUCTION SITE/FARMLAND - LATER\r\n\r\n          Curtis and Dewart sit on the drilling rig eating lunch.\r\n\r\n                          DEWART\r\n           Fuckin' Nat put me in charge of\r\n           frying oysters for that Lions Club\r\n           supper.\r\n\r\n                          CURTIS\r\n           You need another burner?\r\n\r\n                          DEWART\r\n           Yeah, if you still got yours I\r\n           could use it.\r\n\r\n                          CURTIS\r\n           You think you could help me with\r\n           somethin'?\r\n\r\n                          DEWART\r\n           Whatta you need?\r\n\r\n                          CURTIS\r\n           I'm gonna build out the tornado\r\n           shelter in my backyard. I could\r\n           use some help.\r\n\r\n                          DEWART\r\n           The hell you wanna do that for?\r\n\r\n                          CURTIS\r\n           Just needs to be done.\r\n          Dewart eyes him, unsure.\r\n\r\n                          DEWART\r\n           What do you need?\r\n\r\n           52.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           I figure I'll do it on Saturday,\r\n           borrow some equipment from work.\r\n\r\n                          DEWART\r\n           You sure about that?\r\n\r\n                          CURTIS\r\n           I just need a backhoe, a hauler.\r\n           I'll rent the rest.\r\n          Dewart stares off into the distance. He notices Curtis\r\n          looking at him, waiting for an answer.\r\n\r\n                          DEWART\r\n           Yeah. Whatever. I'll help.\r\n\r\n                          CURTIS\r\n           Thanks.\r\n\r\n                          DEWART\r\n           You all right man?\r\n\r\n                          CURTIS\r\n           What do you mean?\r\n\r\n                          DEWART\r\n           I just don't wanna see you fuck up.\r\n\r\n                          CURTIS\r\n           I'm not.\r\n\r\n                         \r\n\r\n          EXT. TRAILER DEPOT - LATE AFTERNOON\r\n\r\n          Curtis stands and talks with a MAN in the middle of the\r\n          Tractor Trailer Depot just off the highway. The Man points\r\n          to a row of shipping containers and uses his hands to mimic\r\n          how one would be lowered.\r\n          They shake hands and Curtis walks away.\r\n\r\n                         \r\n\r\n          EXT. COMMUNITY HEALTH CENTER - DAY\r\n\r\n          The Community Health Center is a one-level, aged brick\r\n          building.\r\n\r\n                         \r\n\r\n          INT. COMMUNITY HEALTH CENTER/LOBBY - CONTINUOUS\r\n\r\n          Curtis sits in the lobby filling out a clipboard full of\r\n          forms and questionnaires. Light traffic flows in and out.\r\n          He flips a page over. The section heading reads, \"Family\r\n          Medical History\". Curtis begins to write.\r\n\r\n           53.\r\n\r\n                         \r\n\r\n          INT. COMMUNITY HEALTH CENTER/HALLWAY - LATER\r\n\r\n          Curtis references a slip of paper as he looks for a room\r\n          number in a long, linoleum tiled hallway; a book and note pad\r\n          tucked under his arm.\r\n          He finds the correct door ajar and knocks.\r\n\r\n           KENDRA (O.S.)\r\n           Come in.\r\n\r\n                         \r\n\r\n          INT. KENDRA'S OFFICE - CONTINUOUS\r\n\r\n          KENDRA(42), a black woman with short hair, sits behind a\r\n          public issue desk in a public issue office. A poster about\r\n          flu shots hangs on the wall. There is no personal decor.\r\n\r\n                          KENDRA\r\n           Hi.\r\n\r\n                          CURTIS\r\n           Hello.\r\n          She half stands and offers a hand.\r\n\r\n                          KENDRA\r\n           Have a seat. I'm Kendra.\r\n\r\n                          CURTIS\r\n           Curtis.\r\n          Curtis shakes and they sit. Kendra opens a manila folder.\r\n\r\n                          KENDRA\r\n           I'm gonna start by askin' you some\r\n           questions.\r\n\r\n                          CURTIS\r\n           Okay. I already answered all the\r\n           questions on the forms.\r\n\r\n                          KENDRA\r\n           Yeah, I know. I looked at `em, but\r\n           I need to get a profile started on\r\n           you.\r\n\r\n                          CURTIS\r\n           Right. Well...\r\n          Curtis slides the yellow legal pad out of the book he\r\n          brought. It's the library book on Mental Illness.\r\n\r\n                          CURTIS (CONT'D)\r\n           Out of the five possible symptoms\r\n           needed to be diagnosed with\r\n\r\n                          SCHIZOPHRENIA:\r\n\r\n                          (MORE)\r\n\r\n           54.\r\n\r\n                         \r\n\r\n                          CURTIS (CONT'D)\r\n           (reads off the pad)\r\n           delusions, hallucinations,\r\n           disorganized speech, disorganized\r\n           behavior, and the negative\r\n           symptoms, I've had two. Delusions\r\n           and hallucinations. But they say\r\n           it has to continue for six months\r\n           to be diagnosed schizophrenia and\r\n           mine hasn't been goin' on anywhere\r\n           near that long. So, I took this\r\n           quiz in the back of the book and I\r\n           scored a five out of a possible\r\n           twenty. Schizophrenia starts at\r\n           twelve. So, they say it might be\r\n           a...\r\n           (reads off the pad)\r\n           brief psychotic disorder. Whatever\r\n           it is, I need to know what to do or\r\n           what to get on to get this thing\r\n           under control.\r\n          Kendra stares at him.\r\n\r\n                          KENDRA\r\n           Look. I'm a counselor. Certified,\r\n           but I'm not a psychiatrist. I\r\n           can't prescribe anything to you. I\r\n           can talk to you, I can recommend\r\n           where to send you, but that's it.\r\n          Curtis begins to gather his things.\r\n\r\n                          KENDRA (CONT'D)\r\n           Now that said, if you want to talk,\r\n           I'll listen. For a lot of people\r\n           that's a good start.\r\n          Curtis hesitates.\r\n\r\n                          KENDRA (CONT'D)\r\n           Now you said here that your mother\r\n           was diagnosed with paranoid\r\n           schizophrenia in her thirties. And\r\n           you're at 35. You wanna talk about\r\n           that?\r\n          Curtis settles in his seat. Sets his book on the floor.\r\n\r\n                          CURTIS\r\n           Yeah, I don't know my mother's\r\n           symptoms. I was just 10. My\r\n           brother was 17. And, uh...I don't\r\n           know. She just left me in the car\r\n           in the parking lot at the grocery\r\n           store one day. And she didn't come\r\n           back. And then they found her a\r\n           week later eatin' trash out of a\r\n           dumpster in northern Kentucky.\r\n\r\n                          (MORE)\r\n\r\n           55.\r\n\r\n                         \r\n\r\n                          CURTIS (CONT'D)\r\n           My dad had to put her in the state\r\n           hospital in Columbus. And she's\r\n           been in assisted living ever since.\r\n           Yep. My dad raised me. He died\r\n           last April.\r\n          Kendra nods, a pleasant look on her face.\r\n\r\n                          KENDRA\r\n           So tell me `bout these dreams.\r\n          Curtis studies her face, bites at the inside of his cheek.\r\n\r\n                         \r\n\r\n          INT. SPECIAL EDUCATION CLASSROOM - NIGHT\r\n\r\n          The class has finished. PARENTS and KIDS trickle out.\r\n          Samantha stands off to the side speaking with the Teacher.\r\n\r\n                          SAMANTHA\r\n           I don't know what our schedule will\r\n           be, but...\r\n\r\n                          TEACHER\r\n           That's all right. But I really do\r\n           think you should continue with the\r\n           sign language. And any additional\r\n           therapies that kids need for the\r\n           cochlear implant.\r\n\r\n                          SAMANTHA\r\n           Absolutely.\r\n\r\n                          TEACHER\r\n           Okay. Good night.\r\n\r\n                          SAMANTHA\r\n           Good night.\r\n          As Samantha talks to the Teacher, Curtis looks over\r\n          flashcards with Hannah. He signs \"SUNSHINE\", a circle in the\r\n          sky with the hand then coming down, fingers spread.\r\n\r\n                         \r\n\r\n          I/E. SAMANTHA'S CAR/INTERSTATE - NIGHT\r\n          Curtis drives while Samantha and Hannah sleep in the back.\r\n          Surrounding farmland drops quickly into darkness joining a\r\n          purple sky in the distance. Through the passenger window, a\r\n          streak of lightning breaks across the horizon. Then another.\r\n          Curtis, seeing this, repositions to get a better look through\r\n          the window. It's horizontal lightning that appears to leap\r\n          from cloud to cloud. Well defined bolts that strobe the\r\n          night sky silhouetting towering thunderheads.\r\n\r\n           56.\r\n\r\n                         \r\n          Curtis looks back to Samantha and Hannah, still asleep.\r\n          He pulls the car over to the shoulder of the interstate and\r\n          continues watching. He climbs out.\r\n\r\n          ON THE SHOULDER OF THE INTERSTATE,\r\n          Cars rush by as Curtis gently closes the car door. Keeping\r\n          his eyes on the lightning storm, he walks to the shoulder.\r\n          It's a fantastic display of light. Hurried and intense. A\r\n          BOLT of lightning reaches down to the ground. Sparks pop off\r\n          the earth in the distance. Another BOLT streaks down,\r\n          getting closer.\r\n          Curtis sees the traffic continuing to pass by at full speed.\r\n\r\n                          CURTIS\r\n\r\n                          (TO HIMSELF)\r\n           Is anyone seeing this?\r\n          Curtis walks to the back window of the car and sees Samantha\r\n          sleeping inside. He reaches out to knock but stops himself.\r\n          He turns back to the lightning and watches.\r\n\r\n                         \r\n\r\n          INT. DELTA AGRI-PRO MAIN OFFICE - DAY\r\n\r\n          The giant rolling door curls up in the Delta Agri-Pro\r\n          warehouse. Sunlight bounces off the finished concrete.\r\n          Curtis pulls the chain for the door as Dewart slams the tow\r\n          latch down on the back of a DUMP TRUCK.\r\n\r\n                         \r\n\r\n          I/E. FLEA MARKET/LAFORCHE HOME - SERIES OF IMAGES - DAY\r\n          -The Dump Truck and Tow Trailer sit parked on the street in\r\n          front of Curtis' house. Dewart stands at the back of the\r\n          trailer with his hand on the ramp lever as Curtis reverses a\r\n          BACKHOE onto the street.\r\n          -Samantha works her booth at the flea market. Hannah neatly\r\n          organizes a collection of colored beads on the floor.\r\n          -A 20 foot rectangle has been outlined in bright orange paint\r\n          next to the storm shelter in Curtis' backyard. Other colored\r\n          markings denote gas and water lines. The bucket on the\r\n          Backhoe digs into the center of the dotted rectangle.\r\n          -Dewart maneuvers the Backhoe's bucket and drops a load of\r\n          earth into the bed of the Dump Truck. Red, the dog, barks at\r\n          the loud machinery from his pen.\r\n\r\n           57.\r\n\r\n                         \r\n          -Curtis uses a smaller trench digging machine on the backside\r\n          of the yard, radiating out from the main dig site. He\r\n          notices a NEIGHBOR watching him from they yard next door.\r\n          -Samantha tallies cash from the tackle box she uses as a\r\n          register. Hannah counts out the change.\r\n          -Dewart assembles a series of PVC pipe next to the trenches\r\n          Curtis dug.\r\n          -Curtis, work goggles on, stands in a head deep hole holding\r\n          a pneumatic jack hammer up to the exposed exterior wall of\r\n          the storm shelter. He begins hammering.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE HOME - LATE AFTERNOON\r\n\r\n          Samantha's car pulls up and parks on the opposite side of the\r\n          street from their house. She gets out, puzzled by the\r\n          Backhoe and Trailer parked in front of her house.\r\n          Huge light brown tracks of dirt stripe the concrete driveway.\r\n          Leading Hannah by the hand, Samantha follows the tracks to\r\n          the backyard.\r\n\r\n          IN THE BACKYARD,\r\n          Samantha stops, mouth agape, stunned by what she sees.\r\n          A 20 foot by 8 foot wide hole that is 10 feet deep sits in\r\n          the middle of her yard. Smaller trenches lead out from it.\r\n          Dewart leans against the propane tank in the back corner of\r\n          the yard. He digs dirt from underneath his fingernails with\r\n          a pocket knife. Seeing Samantha, he waves a hand.\r\n          Curtis' head appears from the hole. He stops when he sees\r\n          Samantha. They stare at one another. He can see her\r\n          surprise. He continues up the ladder and walks over to her.\r\n          Dewart watches from the back of the yard.\r\n\r\n                          CURTIS\r\n           Hey. It's all right. Calm down.\r\n          Samantha takes Hannah into the house without saying a word.\r\n\r\n                          CURTIS (CONT'D)\r\n           Samantha.\r\n\r\n                          SAMANTHA\r\n           Are you out of your mind?\r\n          She continues into the house. Curtis turns, frustrated.\r\n          Dewart takes this in, then goes back to his nails.\r\n\r\n           58.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME - NIGHT\r\n\r\n          Hannah watches television in the den by herself.\r\n\r\n          IN THE BEDROOM,\r\n          Samantha sits on the edge of the bed. Curtis stands a few\r\n          paces back. His hands dug into the back of his dusty jeans.\r\n\r\n                          SAMANTHA\r\n           Not a word. You didn't say one\r\n           word about this to me. Don't you\r\n           think you owe me that? Don't you\r\n           think that you might respect me\r\n           enough to at least consider what I\r\n           had to say?\r\n\r\n                          CURTIS\r\n           I didn't want you worryin' about\r\n           it.\r\n\r\n                          SAMANTHA\r\n           Well I'm worried Curtis. How are\r\n           you paying for all that?\r\n\r\n                          CURTIS\r\n           I got a home improvement loan from\r\n           the bank.\r\n          Samantha is stunned. She stands and gets in his face.\r\n\r\n                          SAMANTHA\r\n           How could you do that without\r\n           talking to me? You know the\r\n           expenses we have comin' up. You\r\n           want to waste money on a stupid\r\n           tornado shelter?\r\n\r\n                          CURTIS\r\n           I'm doin' it...I'm doin' it for us.\r\n           I know you don't understand.\r\n\r\n                          SAMANTHA\r\n           You're right. I don't understand.\r\n           I don't understand half the stuff\r\n           you've been doin' lately. I don't\r\n           understand you puttin' Red out\r\n           back. I don't understand you\r\n           stayin' up all night in that stupid\r\n           tornado shelter. You don't come to\r\n           bed half the time. You leave and\r\n           don't tell me where you're goin'.\r\n           Explain that to me. Please. Tell\r\n           me something that helps me\r\n           understand why you're bein' like\r\n           this.\r\n\r\n           59.\r\n\r\n                         \r\n          Curtis can't look at her. He tries to find words but fails.\r\n\r\n                          CURTIS\r\n           There's nothin' to explain.\r\n          Samantha stares at his face, searching for an answer. She's\r\n          on the verge of tears.\r\n\r\n                          CURTIS (CONT'D)\r\n           I'm gonna go put Hannah to bed.\r\n          Curtis walks out of the room. Samantha can't hold back,\r\n          tears run down her face.\r\n\r\n                         \r\n\r\n          INT. BATHROOM - NIGHT\r\n\r\n          Curtis stares at himself in the mirror. He opens the bottle\r\n          of prescription pills and shakes out two. Looks at them.\r\n          Shakes out another three. He pops the pills in his mouth and\r\n          drinks from the faucet.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - NIGHT\r\n\r\n          It's dark and quiet in the house. Samantha sleeps on her\r\n          side, her back to Curtis.\r\n          Her head is jostled. More. The bed begins to vibrate. Her\r\n          eyes open. She turns over to see Curtis.\r\n          He's having a SEIZURE.\r\n          Samantha reaches for him. Eyes closed, his body convulses\r\n          violently. Samantha quickly turns on a bedside lamp.\r\n\r\n                          SAMANTHA\r\n           Curtis!\r\n          She touches his arms. A small amount of BLOOD begins to\r\n          trickle from both sides of his mouth.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Baby. Oh, my God. Baby...Oh, my\r\n           God. Baby.\r\n          Samantha jumps off the bed and grabs a cordless phone on the\r\n          dresser. She dials, watching her husband continue to shake.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           I need an ambulance! My husband's\r\n           having a seizure. 41800 Tindale\r\n           Road. Hurry up. He's bleeding!\r\n          Samantha goes over to him. Holding her hands out, cautious\r\n          to touch him.\r\n\r\n           60.\r\n\r\n                         \r\n\r\n                          SAMANTHA (CONT'D)\r\n           (into the phone)\r\n           Okay. Okay.\r\n          Samantha puts the phone receiver down on the nightstand. The\r\n          Operator's VOICE still coming through. She touches his arm.\r\n          Suddenly, the seizures stop. Curtis' body is still.\r\n          Samantha freezes.\r\n          His eyes open and he thrashes up in bed. Samantha jumps,\r\n          tripping and stumbling backward.\r\n          Curtis sucks short breaths into his lungs. His head darts\r\n          back and forth, eyes wild. He sees Samantha staring up at\r\n          him from the floor. He begins to calm down.\r\n          Curtis touches his mouth. Sees the blood there.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Honey?\r\n          Samantha stands up and goes over to him. She sits on the\r\n          edge of the bed and touches his arm. She's scared.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Honey? Are you okay?\r\n          Curtis slowly nods.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           You were having a seizure. I\r\n           called an ambulance.\r\n          Curtis sees the phone on the nightstand and grabs it.\r\n\r\n                          CURTIS\r\n           (into the phone)\r\n           No. It's fine. It's fine. Don't\r\n           send an ambulance. It's fine.\r\n          Curtis clicks off the phone.\r\n\r\n                          SAMANTHA\r\n           What are you doing?\r\n          Curtis wraps his arms around her. He holds her tight. The\r\n          SOUND of ambulance sirens approach from the distance.\r\n          Samantha speaks, her voice trembling.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Baby what's goin' on?\r\n\r\n           61.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE HOME - NIGHT\r\n\r\n          The ambulance lights splash across the house. Curtis escorts\r\n          TWO EMTs down the front walk. He favors his left leg,\r\n          walking with a slight limp.\r\n\r\n                          CURTIS\r\n           I'm sorry you fellows had to come\r\n           all the way out.\r\n\r\n                          EMT\r\n           It's what we do. Now we can still\r\n           take you in if you want a doctor to\r\n           look at those cuts in your mouth.\r\n\r\n                          CURTIS\r\n           Yeah. That's all right.. I'll see\r\n           somebody on Monday.\r\n\r\n                          EMT\r\n           All right.\r\n\r\n                          CURTIS\r\n           Thanks.\r\n          Curtis shakes their hands. He turns to walk back in the\r\n          house and notices NEIGHBORS watching from their porches.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - NIGHT\r\n\r\n          Curtis turns up a bottle of peroxide and swishes it in his\r\n          mouth. It burns. He spits into the kitchen sink.\r\n          Samantha sits at the table watching him. Concerned, scared.\r\n          She holds a balled up tissue in her hand. Curtis takes a\r\n          seat across the table. She waits for him to say something.\r\n\r\n                          CURTIS\r\n           I haven't been honest with you.\r\n           I'm sorry.\r\n\r\n                          SAMANTHA\r\n           What's goin' on?\r\n\r\n                          CURTIS\r\n           I've been havin' these dreams. I\r\n           guess they're more like nightmares.\r\n           It's why I've been actin' like\r\n           this.\r\n          Samantha listens with a furrowed brow.\r\n\r\n                          CURTIS (CONT'D)\r\n           They always start with a kind of\r\n           storm. Like a real powerful storm.\r\n\r\n                          (MORE)\r\n\r\n           62.\r\n\r\n                         \r\n\r\n                          CURTIS (CONT'D)\r\n           And there's always this dark, thick\r\n           rain. Like fresh motor oil. And\r\n           then the things, people, it just\r\n           makes `em crazy. They attack me.\r\n           Sometimes they go after Hannah.\r\n           First one I had Red nearly chewed\r\n           through my arm.\r\n\r\n                          SAMANTHA\r\n           That's why you put him out back?\r\n\r\n                          CURTIS\r\n           Yeah.\r\n\r\n                          SAMANTHA\r\n           What was the dream? Tonight.\r\n\r\n                          CURTIS\r\n           It was Dewart. We were at the job\r\n           site. The storm started and\r\n           somethin' happened. His face. His\r\n           eyes were different. He came after\r\n           me with a pick ax. And we fought.\r\n           And he ran it through my leg.\r\n          Curtis zones out for a moment. Samantha says nothing.\r\n\r\n                          CURTIS (CONT'D)\r\n           It's hard to explain, because it's\r\n           not just a dream. It's a feeling.\r\n           I'm afraid something might be\r\n           comin'. Something that's...not\r\n           right. I can not describe it. I\r\n           just need you to believe me.\r\n          Samantha's eyes are red. Her nose. She nods slightly and\r\n          dabs the tissue at the corner of her eye.\r\n\r\n                          CURTIS (CONT'D)\r\n           I've been to a counselor. I've\r\n           seen her a few times.\r\n          This makes Samantha look up.\r\n\r\n                          CURTIS (CONT'D)\r\n           You know what I come from. And I\r\n           promised myself...I promised myself\r\n           I would never leave. And I am\r\n           doin' everything that I can to make\r\n           that true.\r\n          The room is quiet. Samantha watches her husband.\r\n\r\n           63.\r\n\r\n                         \r\n\r\n          INT. OTOLARYNGOLOGIST'S CLINIC/CT SCAN ROOM - DAY\r\n\r\n          Hannah lies flat as the sled moves her through the oval CT\r\n          scanner. A red, lighted crosshair passes over her face.\r\n\r\n                         \r\n\r\n          INT. OTOLARYNGOLOGIST'S CLINIC/OFFICE - DAY\r\n\r\n          Samantha has Hannah on her lap. She and Curtis listen\r\n          intently to an ATTENDANT who sits next to them with a file.\r\n\r\n                          ATTENDANT\r\n           Since the doctor's approved her for\r\n           surgery, We just need to get her\r\n           scheduled. The next possible\r\n           opening is...\r\n           (reviews a calendar)\r\n           The 21st of next month. That's six\r\n           weeks.\r\n\r\n                          CURTIS\r\n           Six weeks?\r\n\r\n                          ATTENDANT\r\n           Is that okay?\r\n\r\n                          SAMANTHA\r\n           It's wonderful.\r\n\r\n                         \r\n\r\n          EXT. PUMP STATION CONSTRUCTION SITE/FARMLAND - DAY\r\n\r\n          Curtis stands with Russell over the hood of a pick-up truck.\r\n          They look over a roll of ground water charts.\r\n          Russell talks and points to the map, but Curtis' attention is\r\n          focused elsewhere. He watches Dewart in the distance.\r\n\r\n                          RUSSELL\r\n           ...this point just to the west. I\r\n           don't think we'll have any problem.\r\n           We should be able to get twenty,\r\n           maybe thirty in this next week. But\r\n           we're looking to see how that's\r\n           gonna shape up, so...\r\n          Dewart smiles and makes broad gestures with his arms. He's\r\n          telling a story to Dave, who laughs hard.\r\n\r\n                          RUSSELL (CONT'D)\r\n           Curtis?\r\n          His attention snaps back.\r\n\r\n                          CURTIS\r\n           Yeah.\r\n\r\n           64.\r\n\r\n                         \r\n\r\n                          RUSSELL\r\n           What do you think?\r\n\r\n                          CURTIS\r\n           Yeah. That sounds good. We'll get\r\n           it done.\r\n          Russell rolls up the charts. They walk toward the work site,\r\n          toward Dewart.\r\n\r\n                         \r\n\r\n          INT. DELTA AGRI-PRO MAIN OFFICE/JIM'S OFFICE - DAY\r\n\r\n          Jim fills out paperwork at his desk. There is a KNOCK.\r\n\r\n                          JIM\r\n           Come in.\r\n          Curtis walks inside. He stands in front of the desk.\r\n\r\n                          JIM (CONT'D)\r\n           What you need Curtis?\r\n\r\n                          CURTIS\r\n           I need a favor Jim.\r\n\r\n                          JIM\r\n           What's that?\r\n\r\n                          CURTIS\r\n           Can you take Dewart off my crew?\r\n           Just reassign him someplace else.\r\n          Jim sets his pen down and leans back.\r\n\r\n                          JIM\r\n           What's the trouble? He not pullin'\r\n           his weight?\r\n\r\n                          CURTIS\r\n           No, nothin' like that. He's a good\r\n           worker. He's a good man. He's my\r\n           friend. I think it'd be easier not\r\n           being in charge of someone I'm so\r\n           close to.\r\n          Jim nods.\r\n\r\n                          JIM\r\n           You know, I understand. This is\r\n           part of what it means to manage\r\n           people Curtis. You're gonna have\r\n           to learn that.\r\n\r\n           65.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           Yes sir. I appreciate that but...\r\n           well it would just be very helpful\r\n           in this case.\r\n\r\n                          JIM\r\n           Okay. Well, I can put him with\r\n           Russell. Anybody else you prefer?\r\n\r\n                          CURTIS\r\n           No. Whoever you think's right.\r\n\r\n                          JIM\r\n           Okay.\r\n\r\n                          CURTIS\r\n           Thank you.\r\n          Curtis turns to leave the office.\r\n\r\n                          JIM\r\n           You been missin' a lotta work\r\n           Curtis.\r\n\r\n                          CURTIS\r\n           I know. My daughter's had a lot of\r\n           doctor's visits. I haven't let\r\n           anything get behind.\r\n\r\n                          JIM\r\n           No. But don't. Okay.\r\n\r\n                          CURTIS\r\n           Yessir.\r\n          Curtis shows himself out.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - EVENING\r\n\r\n          The sun has just set and a purple hue hangs over everything.\r\n          Curtis stands in the very back of the yard and watches a MAN\r\n          guide a long, flatbed trailer up the driveway. An 18 foot\r\n          metal SHIPPING CONTAINER rides on the back.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - CONTINUOUS\r\n\r\n          Nat and Samantha sit at the kitchen table going over a list\r\n          of food in a note pad.\r\n\r\n                          SAMANTHA\r\n           I know they just usually do oysters\r\n           and fries but what if we did\r\n           something healthier on the side?\r\n\r\n           66.\r\n\r\n                         \r\n\r\n                          NAT\r\n           What like slaw?\r\n          Nat gets up to refill her drink. She looks out the back door\r\n          and surveys the construction zone. A FORKLIFT lowers the\r\n          Shipping Container into the giant hole in the backyard. Nat\r\n          shakes her head.\r\n\r\n                          SAMANTHA\r\n           I don't know. Maybe a vegetable or\r\n           salad.\r\n\r\n                          NAT\r\n           Dewart's been tellin' me how\r\n           strange Curtis has been actin'\r\n           lately. I am so sorry.\r\n          Nat brings her drink back to the table and sits. Samantha\r\n          doesn't look up from her pad.\r\n\r\n                          NAT (CONT'D)\r\n           It's not like you don't have enough\r\n           on your plate with Hannah.\r\n          Nat puts her hand on Samantha's. Samantha moves it.\r\n\r\n                          SAMANTHA\r\n           Things are fine. We're fine.\r\n          Nat smiles sympathetically.\r\n\r\n                         \r\n\r\n          INT. ARMY NAVY STORE - DAY\r\n\r\n          Curtis meanders inside. He sees police tactical and survival\r\n          gear behind the counter. Chief among them is a collection of\r\n          gas masks hanging on the rear partition.\r\n\r\n                          OWNER\r\n           Can I help you?\r\n\r\n                          CURTIS\r\n           Yeah. Can I look at one of these\r\n           gas masks?\r\n\r\n                          OWNER\r\n           Sure. Which one you want to look\r\n           at?\r\n\r\n                          CURTIS\r\n           The newest one.\r\n          The OWNER of the store removes a mask and hands it to him.\r\n          Curtis fiddles with the mask.\r\n\r\n           67.\r\n\r\n                         \r\n\r\n                          CURTIS (CONT'D)\r\n           How much?\r\n\r\n                          OWNER\r\n           One seventy eight.\r\n          Curtis frowns at the price.\r\n\r\n                          CURTIS\r\n           Anything cheaper?\r\n\r\n                          OWNER\r\n           No. That's the cheapest one I got\r\n           in the store. They go all the way\r\n           up to two ninety. I don't know what\r\n           you want to spend but a gas mask\r\n           ain't something you want to go\r\n           cheap on.\r\n\r\n                          CURTIS\r\n           You got any kids sizes?\r\n\r\n                          OWNER\r\n           No. Kids can't wear those. They got\r\n           a have a special thing, its like a\r\n           hood. I don't fool with those.\r\n          Curtis nods. The perusing Shopper listens in.\r\n\r\n                          CURTIS\r\n           Yeah. Ring me up a couple of `em.\r\n\r\n                         \r\n\r\n          EXT. ARMY NAVY PARKING LOT - DAY\r\n\r\n          Curtis stands at the driver's door of his pick-up. The box\r\n          sits on the seat in front of him. He opens it and removes\r\n          one of the gas masks.\r\n          He stares into its vacant plastic eyes. He drops the mask\r\n          back into the box and shakes his head. Sighs, frustrated\r\n          with it all.\r\n          He checks over his shoulder, scans the parking lot.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - LATER\r\n\r\n          Curtis stands on top of the shipping container that rests in\r\n          the hole roughly a foot below the yard. Wearing tinted\r\n          goggles, he cuts a circular hole in the top of the container\r\n          with a small blowtorch.\r\n          The sparks stop and Curtis raises the goggles to inspect his\r\n          work. He kicks at the weld with the heel of his boot and the\r\n          metal falls into the container.\r\n\r\n           68.\r\n\r\n                         \r\n          He sets down the torch and removes a roof turbine vent from a\r\n          cardboard box and holds it up next to the newly cut hole.\r\n\r\n           KYLE (O.S.)\r\n           What the hell are you doin'?\r\n          Curtis smiles to himself. He turns to find KYLE(42) standing\r\n          at the edge of the hole. His hands are tucked into the back\r\n          of his jeans and he's sizing up the work.\r\n          Curtis steps off the roof of the shipping container onto\r\n          ground level. He holds out a hand and Kyle shakes it, never\r\n          taking his eyes off the unfinished shelter.\r\n\r\n                          KYLE (CONT'D)\r\n           What you got goin' on here?\r\n\r\n                          CURTIS\r\n           Just addin' on to the storm\r\n           shelter.\r\n\r\n                          KYLE\r\n           Why?\r\n\r\n                          CURTIS\r\n           Just `cause.\r\n          Kyle notices the PVC piping running in the trenches.\r\n\r\n                          KYLE\r\n           You runnin' water to it?\r\n\r\n                          CURTIS\r\n           Oh, yeah. From our well. Runnin'\r\n           sewer out to the city line.\r\n\r\n                          KYLE\r\n           How much you spendin' on this\r\n           thing?\r\n\r\n                          CURTIS\r\n           It's not bad.\r\n\r\n                          KYLE\r\n           Doesn't look it.\r\n          Curtis shrugs. Kyle sees his reluctance.\r\n\r\n                          KYLE (CONT'D)\r\n           You take your eye off the ball one\r\n           minute in this economy and you're\r\n           screwed. You got the cash for\r\n           this?\r\n\r\n                          CURTIS\r\n           Yeah.\r\n\r\n           69.\r\n\r\n                         \r\n\r\n                          KYLE\r\n           Don't put nothin' on credit cards.\r\n           That shit'll eat you up.\r\n\r\n                          CURTIS\r\n           I'm not.\r\n          Kyle is staring him down. Curtis just looks at the shelter.\r\n          There's a long silence shared between them.\r\n\r\n                          KYLE\r\n           Samantha called me.\r\n\r\n                          CURTIS\r\n           I figured.\r\n          Curtis climbs back onto the shipping container and continues\r\n          installing the roof vent.\r\n\r\n                          CURTIS (CONT'D)\r\n           Called you to come tell me to quit?\r\n\r\n                          KYLE\r\n           She called `cause she's worried.\r\n           Says you've been stressed out.\r\n          Curtis doesn't answer.\r\n\r\n                          KYLE (CONT'D)\r\n           So?\r\n\r\n                          CURTIS\r\n           So what?\r\n\r\n                          KYLE\r\n           You stressed out?\r\n\r\n                          CURTIS\r\n           No. No more than anybody else.\r\n\r\n                          KYLE\r\n           Work all right?\r\n\r\n                          CURTIS\r\n           Uh, huh...Hey, look. You wanna come\r\n           by and have dinner sometime, Kyle.\r\n           That's fine. We'll have a beer and\r\n           talk about the old days, but you\r\n           got somethin' to say just say it.\r\n\r\n                          KYLE\r\n           You can stop that shit right now.\r\n           I'll come over there and remind you\r\n           what it feels like to get your ass\r\n           whipped.\r\n          Curtis keeps his head down, scolded. Kyle relents.\r\n\r\n           70.\r\n\r\n                         \r\n\r\n                          KYLE (CONT'D)\r\n           I'm just coming here to check on\r\n           you.\r\n\r\n                          CURTIS\r\n           Well I appreciate it Kyle.\r\n\r\n                          KYLE\r\n           You been to see Mom?\r\n\r\n                          CURTIS\r\n           Yeah. A few days ago.\r\n\r\n                          KYLE\r\n           She all right.\r\n\r\n                          CURTIS\r\n           You should see her. Take your\r\n           girls.\r\n\r\n                          KYLE\r\n           Yeah. I'll get around to it.\r\n          There's an awkward moment as Curtis works with his back to\r\n          Kyle.\r\n\r\n                          KYLE (CONT'D)\r\n           You need a hand?\r\n          Curtis turns and looks up at him. Shakes his head.\r\n\r\n                          CURTIS\r\n           No. I've got it.\r\n          Kyle nods.\r\n\r\n                          KYLE\r\n           Okay. Call me if you need me okay?\r\n\r\n                          CURTIS\r\n           I will.\r\n          Kyle looks at him for a moment. He turns and walks toward\r\n          the driveway.\r\n\r\n                          CURTIS (CONT'D)\r\n           Hey Kyle?\r\n          Kyle turns back. Curtis climbs onto the yard and walks over\r\n          to him.\r\n\r\n                          CURTIS (CONT'D)\r\n           Actually you could do me a favor.\r\n\r\n                          KYLE\r\n           What's that?\r\n\r\n           71.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           You still looking for a dog?\r\n\r\n                          KYLE\r\n           Sure.\r\n          Kyle looks at him.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE HOME/DRIVEWAY - DAY\r\n\r\n          Curtis slaps down the tailgate to Kyle's truck, which is\r\n          parked in the driveway. Red, tail wagging, hops up into the\r\n          bed. Curtis closes the tailgate and sets a leash and two\r\n          bowls into the back of the truck.\r\n          Curtis rubs Red behind the ears.\r\n\r\n                          CURTIS\r\n           They got a good spot for you, okay\r\n           bud.\r\n          Kyle stands at the passenger door to the truck.\r\n\r\n                          KYLE\r\n           You sure?\r\n\r\n                          CURTIS\r\n           Yeah.\r\n\r\n                          KYLE\r\n           I know it'll make my girls happy.\r\n           All right.\r\n          Kyle walks around the truck to the driver's side.\r\n\r\n                          CURTIS\r\n           Hey Kyle?\r\n\r\n                          KYLE\r\n           Yeah?\r\n          Kyle stops. Curtis walks up and hugs him. Kyle slaps him on\r\n          the back.\r\n\r\n                          CURTIS\r\n           Take care of yourself.\r\n\r\n                          KYLE\r\n           All right. All right. I will little\r\n           brother. You take care of your\r\n           family. Handle your business.\r\n           Okay?\r\n          Curtis nods. Kyle smiles, shaking his head.\r\n\r\n           72.\r\n\r\n                         \r\n\r\n                          KYLE (CONT'D)\r\n           All right.\r\n          Kyle climbs into the truck and cranks it. Curtis steps back\r\n          as he pulls away. Red looks back from the bed of the truck.\r\n\r\n                         \r\n\r\n          INT. BATHROOM - NIGHT\r\n\r\n          Hannah, fresh from the tub, stands to let Curtis rub her wet\r\n          head with a towel. He finishes and stands.\r\n\r\n                          CURTIS\r\n           All right. Bedtime.\r\n          Hannah looks up at him. Curtis signs his hand like a pillow\r\n          then touches his watch. They move out of the bathroom.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME/BEDROOM - MORNING\r\n\r\n          Curtis sits on the edge of his bed staring at the window in\r\n          their room. He's already dressed for work.\r\n          He watches as the thick, dark rain hits the window and\r\n          streaks. He has a curious look on his face.\r\n          MOVING, down the hall.\r\n          MOVING, past the den.\r\n          MOVING, into the kitchen.\r\n          Curtis stops at the entry to the kitchen. Samantha, wearing\r\n          a robe, stands with her back to him. She's cooking something\r\n          at the stove.\r\n          Curtis notices the back door standing open. HARD RAIN slants\r\n          down outside. He looks down at the tile floor.\r\n          WET FOOTPRINTS track inside.\r\n          They lead to where Samantha is standing. She turns to him.\r\n          She's pale with a vacant look on her face. Her hair is\r\n          soaking wet.\r\n          Curtis looks at her, concerned. She stares back,\r\n          emotionless. She slowly looks down at the counter next to\r\n          her. A kitchen knife rests there.\r\n          Curtis looks at the knife. They look at one another again.\r\n\r\n           73.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - MORNING\r\n\r\n          Curtis sits at the breakfast table across from Hannah. He\r\n          looks over at Samantha. She cooks, her back to him. Hannah\r\n          climbs out of her chair and goes to look out the back door.\r\n          Samantha turns and dishes eggs onto Curtis' plate.\r\n\r\n                          SAMANTHA\r\n           You okay?\r\n          She touches his hand. Curtis FLINCHES.\r\n          Their eyes meet. He wants to take it back, and she can see\r\n          that. It begins to sink in for her.\r\n          Hannah vocalizes something behind them.\r\n          Samantha looks at her husband, shakes her head in disbelief.\r\n          Hannah makes another sound, pounds on the back door.\r\n          Samantha turns and sees a MAN standing in their backyard.\r\n          She flinches.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Who's that?\r\n          Curtis stands to see out the back door.\r\n\r\n                          CURTIS\r\n           Ah shit.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - CONTINUOUS\r\n\r\n          Jim, Curtis' boss, stands with his hands on his hips looking\r\n          down at the planted shipping container. Curtis approaches.\r\n\r\n                          CURTIS\r\n           Hey Jim.\r\n\r\n                          JIM\r\n           Curtis. Dewart told me you took\r\n           equipment from work for a project\r\n           at your house. Said that's why you\r\n           wanted him off your crew. I came\r\n           out here to see it myself.\r\n\r\n                          CURTIS\r\n           Yeah. It was just a hauler and a\r\n           backhoe. It was Saturday. I had\r\n           `em back in less than 8 hours.\r\n\r\n                          JIM\r\n           You know that doesn't matter. I\r\n           can't even tell you how many rules\r\n           you broke.\r\n\r\n                          (MORE)\r\n\r\n           74.\r\n\r\n                         \r\n\r\n                          JIM (CONT'D)\r\n           What if you had an accident? Huh?\r\n           What if you ran somebody over on\r\n           your way out here? Lawsuit like\r\n           that could bankrupt me.\r\n\r\n                          CURTIS\r\n           Well, I'm sorry Jim. I hadn't\r\n           thought of that. Thank God nothin'\r\n           like that happened. You know? I'll\r\n           do whatever I can to make it right.\r\n\r\n                          JIM\r\n           You can pick up your last check on\r\n           Friday. You've got two weeks\r\n           benefits.\r\n          Curtis nods. Accepts it.\r\n\r\n                          CURTIS\r\n           Did you fire Dewart?\r\n\r\n                          JIM\r\n           He's on two weeks leave unpaid...\r\n           I'm sorry Curtis. You did this to\r\n           yourself.\r\n          Jim turns and walks out of the backyard.\r\n\r\n                         \r\n\r\n          INT. KITCHEN - CONTINUOUS\r\n\r\n          Samantha clears the table. Hannah sits, watching her father\r\n          walk in. Curtis stops just inside the door, closes it.\r\n\r\n                          CURTIS\r\n           I've been fired.\r\n          Samantha continues clearing the dishes to the sink. She\r\n          doesn't look up.\r\n\r\n                          SAMANTHA\r\n           What about the health insurance?\r\n\r\n                          CURTIS\r\n           We get two more weeks.\r\n          Samantha slams the plates into the sink. They break. She\r\n          holds her head back and stares at the ceiling.\r\n          She walks over to Curtis...\r\n\r\n                          CURTIS (CONT'D)\r\n           I'm sorry...\r\n          ...and SLAPS him across the face.\r\n          Hannah begins to cry.\r\n\r\n           75.\r\n\r\n                         \r\n          Samantha turns and collects Hannah from the table. She grabs\r\n          her things and walks out of the house.\r\n          Curtis stands alone in the kitchen.\r\n\r\n                         \r\n\r\n          INT. AR COUNTY COMMUNITY HEALTH CENTER/HALLWAY - DAY\r\n\r\n          Curtis walks down the hallway to Kendra's office. The door\r\n          ajar, he knocks and enters.\r\n\r\n                         \r\n\r\n          INT. KENDRA'S OFFICE - CONTINUOUS\r\n\r\n          Curtis finds ANDY(42), a man in khakis and a button up,\r\n          sitting behind the desk.\r\n\r\n                          CURTIS\r\n           Oh, `scuse me.\r\n          Andy rises from his chair.\r\n\r\n                          ANDY\r\n           Are you Curtis?\r\n\r\n                          CURTIS\r\n           Yeah.\r\n\r\n                          ANDY\r\n           Come in. Kendra transferred out.\r\n           I'll be meeting with you today.\r\n          Curtis looks at the man. He's kind of mincing.\r\n\r\n                          ANDY (CONT'D)\r\n           Please, sit down.\r\n          Curtis takes a seat.\r\n\r\n                          CURTIS\r\n           What happened to Kendra?\r\n\r\n                          ANDY\r\n           She got into a program at OSU so\r\n           she'll be transferring near there.\r\n           I've split her case load with\r\n           another counselor. It's been kind\r\n           of crazy around here lately.\r\n\r\n                          CURTIS\r\n           Huh.\r\n\r\n                          ANDY\r\n           So I've looked over your file. It\r\n           says your mother was diagnosed with\r\n           paranoid schizophrenia in her early\r\n           thirties. Let's start there.\r\n\r\n           76.\r\n\r\n                         \r\n          Curtis looks at the man for a moment, then stands and walks\r\n          out of the room.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE HOME/DRIVEWAY - DAY\r\n\r\n          Curtis' truck is parked in the driveway with the hood up and\r\n          the engine running.\r\n          Curtis stands over the vibrating engine, studying it. He\r\n          looks at the belts. He watches them move.\r\n\r\n                         \r\n\r\n          INT. STORM SHELTER - DAY\r\n\r\n          Curtis hefts a porcelain toilet down the steps of the\r\n          shelter. A dull light glows through the new entryway that's\r\n          been knocked out through the back left wall.\r\n          Curtis goes through it.\r\n\r\n          IN THE SHIPPING CONTAINER SECTION,\r\n          Curtis sets the toilet on the floor. He picks up the camping\r\n          lantern and holds it up to the space.\r\n          The lack of light makes it feel more cavernous than it is.\r\n          Two cots have been brought down as well as an assortment of\r\n          supplies. Canned food, a small gas burner.\r\n          Curtis hangs the lantern onto a hook on the wall and goes\r\n          about connecting the toilet to a pipe sticking out of the\r\n          back corner.\r\n\r\n                         \r\n\r\n          INT. LAFORCHE HOME - DAY\r\n\r\n          Samantha walks inside followed by Hannah and a WOMAN from the\r\n          flea market.\r\n\r\n                          SAMANTHA\r\n           I'm so sorry. I completely forgot.\r\n\r\n                          WOMAN\r\n           That's okay. Don't worry about it.\r\n\r\n                          SAMANTHA\r\n           Here. I hope you like them.\r\n          Samantha hands over the plastic bag.\r\n\r\n                          WOMAN\r\n           Thanks. I brought cash.\r\n\r\n                          SAMANTHA\r\n           That's terrific. It's fine.\r\n\r\n           77.\r\n\r\n                         \r\n          Samantha takes three twenties from her.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           Call me if they don't work and I'm\r\n           sorry again.\r\n\r\n                          WOMAN\r\n           Oh, it's okay. Thank you.\r\n          Samantha closes the door.\r\n\r\n          IN THE KITCHEN,\r\n          Samantha takes the tin decorated with ocean creatures down\r\n          from the fridge. She removes the envelope with the word\r\n          \"BEACH\" written on it and takes out a stack of bills.\r\n          She folds the bills over and stuffs them into her purse\r\n          before placing the empty envelope back in the tin.\r\n          She looks out back and sees Curtis sitting with Hannah.\r\n\r\n          OUTSIDE,\r\n          The shipping container has been covered over with dirt. Two\r\n          rotating vents spin at either end of the brown mound. Curtis\r\n          sits on the freshly packed dirt signing with Hannah.\r\n          He signs something that makes her laugh. Hannah smacks a\r\n          muddy clump between her hands. Curtis touches her nose,\r\n          leaving a dirt smudge. Hannah laughs. She touches his face,\r\n          smudging it.\r\n\r\n          IN THE KITCHEN,\r\n          Samantha watches through the back door.\r\n\r\n                         \r\n\r\n          INT. HANNAH'S BEDROOM - EVENING\r\n\r\n          Samantha tucks Hannah into bed. She kisses her on the head\r\n          and turns out the bedside lamp. Samantha leaves the room.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - EVENING\r\n\r\n          Samantha steps out of the house. She walks over to Curtis,\r\n          who is standing on a grassy section of the yard over an\r\n          assortment of auto parts. They don't speak for a moment.\r\n\r\n                          SAMANTHA\r\n           What's that?\r\n\r\n                          CURTIS\r\n           That's the alternator from the\r\n           truck.\r\n\r\n                          (MORE)\r\n\r\n           78.\r\n\r\n                         \r\n\r\n                          CURTIS (CONT'D)\r\n           I was just trying to figure out a\r\n           way to charge enough batteries to\r\n           run lights down there. Ah, what the\r\n           hell? Maybe I'll hook it up to your\r\n           old exercycle.\r\n          Samantha almost smiles. Curtis keeps his eyes on the parts.\r\n\r\n                          CURTIS (CONT'D)\r\n           You gonna leave me?\r\n          Samantha looks at his hands. They hang by his sides.\r\n\r\n                          SAMANTHA\r\n           You flinched when I touched your\r\n           hand this morning.\r\n\r\n                          CURTIS\r\n           I'm sorry.\r\n\r\n                          SAMANTHA\r\n           I was in one of your dreams?\r\n          Curtis nods.\r\n\r\n                          CURTIS\r\n           Yeah.\r\n\r\n                          SAMANTHA\r\n           Can you deal with that?\r\n          He holds open his hand to her. She takes it.\r\n\r\n                          CURTIS\r\n           Yeah.\r\n\r\n                          SAMANTHA\r\n           Okay. Then I made a decision. We\r\n           cancel the beach trip. We have\r\n           enough to cover bills for the next\r\n           two months with your last check.\r\n           I'm going to get a job. You're\r\n           gonna find another job. I'm going\r\n           to call to see if we can move\r\n           Hannah's surgery up. We'll need to\r\n           see what it costs to extend your\r\n           policy to the end of the year. I\r\n           want you to see a psychiatrist.\r\n           Not a counselor from the free\r\n           clinic. Someone good.\r\n\r\n                          CURTIS\r\n           Doctor Shannan gave me the number\r\n           of somebody. But, uh, I just don't\r\n           think we can afford it.\r\n\r\n           79.\r\n\r\n                         \r\n\r\n                          SAMANTHA\r\n           We'll find the money. Also, the\r\n           Lions Club supper's this weekend.\r\n           I want you to come with me.\r\n\r\n                          CURTIS\r\n           I don't want to see any of those\r\n           people.\r\n\r\n                          SAMANTHA\r\n           I want you to go. I need to do\r\n           something normal.\r\n\r\n                          CURTIS\r\n           All right.\r\n          Curtis nods. Samantha let's go of his hand and walks back to\r\n          the house. Curtis goes back to studying the auto parts.\r\n\r\n                         \r\n\r\n          INT. LIONS CLUB LODGE - NIGHT\r\n\r\n          The inside of the club is a musty banquet hall with wood\r\n          panelled walls and a drop tile ceiling. The place is packed.\r\n          Rows of folding tables fill the center of the room. A long\r\n          LINE has formed along the side wall that wraps to a serving\r\n          station at the back. Heated metal bins filled with fried\r\n          oysters and french fries.\r\n          Curtis gets in line with his family.\r\n\r\n          AT THE SERVING TABLE,\r\n          Curtis holds two paper plates.\r\n\r\n                          CURTIS\r\n           How many pieces does Hannah get?\r\n\r\n                          SAMANTHA\r\n           Just one.\r\n          Curtis uses tongs to grab pieces of fried oyster. Looking\r\n          up, he can see back through the kitchen to an open door\r\n          outside. Dewart stands there over a butane fired frying pot.\r\n          He wears an apron and stares at Curtis.\r\n          Curtis moves down the line.\r\n\r\n                         \r\n\r\n          INT. LIONS CLUB LODGE - LATER\r\n\r\n          Lewis sits with Cammie and their baby. He laughs and talks\r\n          with another man. From a different table, Russell leans over\r\n          to eye Curtis.\r\n\r\n           80.\r\n\r\n                         \r\n          Curtis sits at a table with his family. He loads Hannah's\r\n          plate up with ketchup.\r\n          A tap on his shoulder. Curtis turns to find Dewart standing\r\n          over him.\r\n\r\n                          DEWART\r\n           What're you doin' here?\r\n\r\n                          CURTIS\r\n           Not here man.\r\n          Dewart taps him on the shoulder again.\r\n\r\n                          DEWART\r\n           I said what are you doin' here.\r\n          Curtis stands and Dewart takes a step back. The general\r\n          noise of the place starts to quiet down as people take\r\n          notice. A few stand.\r\n\r\n                          SAMANTHA\r\n           Curtis.\r\n\r\n                          DEWART\r\n           I told people what you been doin'.\r\n\r\n                          CURTIS\r\n           I know.\r\n\r\n                          DEWART\r\n           You cut me loose. Everything we\r\n           been through.\r\n\r\n                          CURTIS\r\n           I know. I'm sorry.\r\n          Dewart shoves him in the chest.\r\n\r\n                          DEWART\r\n           You ain't fucking sorry. You sorry\r\n           you wouldn't cut me loose. We\r\n           fuckin' friends! This how you\r\n           treat friends?\r\n          Curtis places a hand on Dewart's chest.\r\n\r\n                          CURTIS\r\n           Come on.\r\n          Dewart punches Curtis in the face. It stings.\r\n\r\n                          CURTIS (CONT'D)\r\n           God dammit.\r\n\r\n           81.\r\n\r\n                         \r\n          Samantha gathers Hannah and moves back. Dewart shoves Curtis\r\n          across the table. Oysters and bottles go everywhere. The\r\n          entire room is on its feet watching.\r\n          Curtis slips getting up. Dewart walks around the table,\r\n          heading for him.\r\n\r\n                          SAMANTHA\r\n\r\n           STOP IT DEWART!\r\n          Curtis stands and kicks Dewart in the knee. It buckles back\r\n          and he's on the floor. He cries out and grabs the twisted\r\n          joint. He's done.\r\n          Curtis paces over him, covered in ketchup and soda. He\r\n          shouts down at him.\r\n\r\n                          CURTIS\r\n\r\n           I SAID NOT HERE! GOD DAMNIT!\r\n          He wipes at his face. Sees all of the people staring at him.\r\n          Addresses them.\r\n\r\n                          CURTIS (CONT'D)\r\n           You think I'm crazy?! Huh! Is that\r\n           what he told you!\r\n          Curtis TURNS OVER A TABLE. He points to the gawking crowd.\r\n\r\n                          CURTIS (CONT'D)\r\n           Well, listen up! There is a storm\r\n           comin' like nothing you have ever\r\n           seen. And not a one of you is\r\n           prepared for it.\r\n\r\n                          (PACING)\r\n           You think I'm crazy? I'M TALKIN'\r\n\r\n           TO YOU RUSSELL!\r\n\r\n                          (PACING)\r\n           LEWIS! You think I'm a thief?\r\n          Hannah watches. THE SOUND MUTED. She looks on as Curtis\r\n          paces, pointing and yelling, red faced at the crowd.\r\n          Curtis backs off.\r\n\r\n                          CURTIS (CONT'D)\r\n           Sleep well in your beds. Cause if\r\n           this thing comes true, there ain't\r\n           gonna be any more.\r\n          Curtis looks down at Dewart.\r\n          He turns to see Hannah. She's tucked under her Mother's leg\r\n          crying. This hits him hard. He stops. Looking at Samantha,\r\n          his eyes fill with tears.\r\n\r\n           82.\r\n\r\n                         \r\n          Samantha, leading Hannah by the hand, walks to Curtis. He\r\n          stares at her, on the verge of breaking down.\r\n          She takes her hand and gently pulls his head down to her\r\n          shoulder. Without another look toward the crowd, Samantha\r\n          leads her family out of the dining hall.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE HOME - DAY\r\n\r\n          Hannah stands on a toolbox and rests her elbows on the side\r\n          of Curtis' truck. The hood is open. She watches her father\r\n          fiddle with re-installing the alternator. His fingers\r\n          covered in grease.\r\n          Hannah steps down from the toolbox and walks into the front\r\n          yard. Curtis pauses, hearing a high-pitched, warbling SOUND\r\n          in the distance. He notices Hannah is gone.\r\n\r\n                          CURTIS\r\n           Hannah?\r\n          He pulls his head out from the hood and sees Hannah standing\r\n          on the curb. She looks down the street. He runs down his\r\n          driveway, wiping his hands on a rag and watching the horizon.\r\n\r\n                          CURTIS (CONT'D)\r\n           Hannah!\r\n          A FLOCK OF BIRDS, flying in intricate geometric patterns,\r\n          swarm above the house at the end of the street. They twist\r\n          and bend into speckled black shapes.\r\n          Hannah, watching, walks into the street. Curtis catches her\r\n          by the hand. He turns away from the birds to see a STORM\r\n          CELL building on the opposite horizon. He scoops Hannah into\r\n          his arms, stepping back from it.\r\n          The SOUND of the birds grows louder. Curtis pivots to find\r\n          the mass of birds barreling down the street toward him. He\r\n          turns away as the wall of birds crash past him. The force so\r\n          powerful it knocks him backward.\r\n          He covers Hannah's head, dodging the onslaught of wind and\r\n          wings. The Flock passes. Curtis stands, his face cut and\r\n          scraped. Hannah cries, clinging to his chest.\r\n\r\n          SMASH!\r\n          The windshield of a car parked next to him SHATTERS. Curtis\r\n          looks at the broken glass. A dead bird, it's neck broken,\r\n          rests crumpled on the hood.\r\n\r\n          SMACK!\r\n\r\n           83.\r\n\r\n                         \r\n          Another bird crashes into the asphalt just in front of him.\r\n          Then another. Curtis looks up. The Flock of birds are\r\n          circling overhead and diving down at him.\r\n          More birds crashing to the ground. Curtis covers his head.\r\n          The neighborhood's tornado SIRENS begin to sound.\r\n          Curtis rushes Hannah toward his front door as dozens of birds\r\n          plummet from the sky. The sirens BLARING.\r\n\r\n                         \r\n\r\n          INT. BEDROOM - NIGHT\r\n\r\n          Curtis wakes to Samantha shaking him by the shoulders. She's\r\n          nearly on top of him in the bed.\r\n\r\n                          SAMANTHA\r\n           Curtis! Wake up! Wake up!\r\n          TORNADO SIRENS continue to scream throughout the\r\n          neighborhood.\r\n          Curtis looks to the window. Rain and hail are battering the\r\n          house. He jumps to his feet and grabs Samantha by the arm.\r\n          They rush out of the room.\r\n\r\n                         \r\n\r\n          INT. HANNAH'S BEDROOM - NIGHT\r\n\r\n          Curtis bursts into the room. Hannah is standing at the\r\n          window looking out. Curtis scoops her up, scaring her. She\r\n          begins to cry as they run from the room.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - NIGHT\r\n\r\n          Wind blows fiercely as pellets of hail bounce off the ground.\r\n          Rain cuts at a sharp angle. The Tornado Sirens continue.\r\n          Curtis, Hannah in his arms and Samantha close behind, exits\r\n          the back of the house and heads to the storm shelter. He\r\n          passes Hannah to Samantha and fumbles with the padlock keys.\r\n          At the doors to the shelter, Samantha holds her robe up to\r\n          shield Hannah from the hail. Curtis gets the lock and opens\r\n          the door. They go inside.\r\n\r\n                         \r\n\r\n          INT. STORM SHELTER - CONTINUOUS\r\n\r\n          Curtis slams the doors behind them. It's pitch black until\r\n          he gets to the switch on the lantern. The room fills with\r\n          the orange glow as Curtis snaps the padlock through the door\r\n          handles.\r\n\r\n           84.\r\n\r\n                         \r\n\r\n                          CURTIS\r\n           Come on. It's okay.\r\n          Curtis leads them through the entry to the larger section of\r\n          the shelter. Samantha takes Hannah and sits with her on one\r\n          of the cots. She's signing to her, trying to calm her down.\r\n\r\n                          CURTIS (CONT'D)\r\n           It's okay. All right. Come on. Sit\r\n           down.\r\n          Curtis goes to a trunk in the corner and begins rooting\r\n          through it. He removes two gas masks and an oxygen mask\r\n          connected to a small tank.\r\n          He goes over and kneels in front of Hannah. He tries\r\n          slipping the oxygen mask over her face. Samantha grabs his\r\n          wrist.\r\n\r\n                          SAMANTHA\r\n           No. Don't do that.\r\n\r\n                          CURTIS\r\n           It's okay. It's oxygen. Here. Put\r\n           this on.\r\n          Curtis hands Samantha a gas mask.\r\n\r\n                          SAMANTHA\r\n           Are you kidding?\r\n\r\n                          CURTIS\r\n           Please just do it. Okay?\r\n          He looks to Hannah and places an oxygen mask over her face..\r\n\r\n                          CURTIS (CONT'D)\r\n           There we go. All right. Keep it out\r\n           of your eyes. Okay?\r\n          He signs to her.\r\n\r\n                          CURTIS (CONT'D)\r\n           Hey. I love you. It's okay.\r\n          Curtis eases on the knob at the top of the tank.\r\n          He climbs onto the cot and puts his arm around them. He\r\n          slips on his gas mask.\r\n          Samantha is hesitant. She looks at her husband in the mask\r\n          and leans back against the side of the container. Hannah\r\n          looks up at her. She touches her mother's mask.\r\n          Samantha slips on the gas mask.\r\n\r\n           85.\r\n\r\n                         \r\n          The camping lantern on the floor casts long shadows up. The\r\n          faint boom of thunder rolls softly outside.\r\n          The family sits huddled together on the cot, wearing their\r\n          masks.\r\n\r\n                         \r\n\r\n          INT. STORM SHELTER - LATER\r\n\r\n          A CRACK of thunder rattles the shelter. Curtis snaps awake,\r\n          still wearing his gas mask.\r\n          Samantha has climbed on the other cot and is asleep. Hannah\r\n          sleeps under Curtis' arm. He gently lays her down on the cot\r\n          and stands to stretch.\r\n          He walks into the original section of the shelter and grabs a\r\n          small flashlight off the metal shelving. He clicks it on and\r\n          moves over to the concrete steps.\r\n          He takes a seat and listens. He places his hand onto the\r\n          metal door. A BOOM of thunder.\r\n          He can hear the rain and wind blowing outside.\r\n\r\n                         \r\n\r\n          INT. STORM SHELTER - LATER\r\n\r\n          Samantha rubs Curtis' shoulder, gently waking him.\r\n\r\n                          SAMANTHA\r\n           Wake up babe.\r\n          Curtis' head moves. He sees that Samantha and Hannah have\r\n          removed their masks.\r\n\r\n                          CURTIS\r\n           Where's your mask?\r\n\r\n                          SAMANTHA\r\n           We took them off. It's fine. Take\r\n           it off.\r\n\r\n                          CURTIS\r\n           No.\r\n          Curtis hesitates.\r\n\r\n                          SAMANTHA\r\n           We're fine. Take it off.\r\n          Curtis slips the mask off his face. Worried, he takes a\r\n          breath.\r\n\r\n                          SAMANTHA (CONT'D)\r\n           You need to open the door now.\r\n\r\n           86.\r\n\r\n                         \r\n          Curtis doesn't move. He looks at them.\r\n\r\n                          CURTIS\r\n\r\n                          (MUMBLES)\r\n           What if it's...What if it's not\r\n           over?\r\n\r\n                          SAMANTHA\r\n           What?\r\n\r\n                          CURTIS\r\n           What if it's not over?\r\n\r\n                          SAMANTHA\r\n           It's over. Get the keys. Open the\r\n           door.\r\n          Curtis slowly gets to his feet. He sees the dark entryway to\r\n          the original section of the shelter. Taking the lantern, he\r\n          walks to it.\r\n          Samantha and Hannah follow.\r\n          Curtis stops just inside. He holds the lantern up,\r\n          illuminating the padlocked metal doors.\r\n          He looks back at his family, then climbs the steps. He\r\n          places his hand on the door. He flinches.\r\n\r\n                          CURTIS\r\n           It's still storming.\r\n\r\n                          SAMANTHA\r\n           No. It's not.\r\n\r\n                          CURTIS\r\n           I can hear it.\r\n          Samantha stares at him. The room is silent.\r\n\r\n                          SAMANTHA\r\n           I don't hear anything.\r\n\r\n                          CURTIS\r\n           Put your hand on the door. You can\r\n           feel it.\r\n          He takes Samantha's wrist and guides her to the doors. He\r\n          watches her face as she places a hand against the metal. She\r\n          looks at him, her eyes getting red, and shakes her head \"no\".\r\n          Curtis kneels in front of Hannah and mimics the signs from\r\n          earlier.\r\n\r\n                          CURTIS (CONT'D)\r\n           (signing and speaking)\r\n           Thunder? Do you feel it?\r\n\r\n           87.\r\n\r\n                         \r\n          He flinches again. Looks to the ceiling\r\n\r\n                          CURTIS (CONT'D)\r\n           (signing and speaking)\r\n           You feel it? You feel it?\r\n          Hannah walks to her mother. Samantha holds onto her.\r\n          Curtis steps back from them. They watch him, their backs to\r\n          the doors. He flinches and covers his mouth.\r\n\r\n                          CURTIS (CONT'D)\r\n           I'm sorry.\r\n\r\n                          SAMANTHA\r\n           Baby, there's no storm outside.\r\n\r\n                          CURTIS\r\n           I'm sorry.\r\n          Samantha walks over to him.\r\n\r\n                          SAMANTHA\r\n           Curtis. I wouldn't lie to you. We\r\n           love you very much. Please open\r\n           the door.\r\n          Curtis is on the verge of tears.\r\n          He slowly reaches into his jeans pocket. He removes the\r\n          keys. He holds them out to Samantha.\r\n\r\n                          CURTIS\r\n           I'm sorry. I can't.\r\n          Samantha looks at the keys, then at Curtis. Tears shake from\r\n          his trembling face.\r\n\r\n                          SAMANTHA\r\n           I love you, but if I open the door,\r\n           then nothin's gonna change. You'll\r\n           see that everything's fine, but\r\n           nothing will change. Please. This\r\n           is what it means to stay with us.\r\n           This is something you have to do.\r\n          He looks at Hannah, then Samantha. Curtis steadies himself,\r\n          trying to control his flinching. He wipes his face with the\r\n          back of his hands and takes a deep breath.\r\n          Curtis walks toward the doors. On the steps, he reaches up\r\n          to the padlock. The keys shake in his fingers. He turns to\r\n          Samantha.\r\n\r\n                          CURTIS\r\n           Could you move Hannah back?\r\n\r\n           88.\r\n\r\n                         \r\n          Samantha picks Hannah up in her arms and Curtis watches them\r\n          retreat to the rear wall.\r\n          He goes back to the lock. He inserts the key. The padlock\r\n          pops open. Curtis removes it. He looks back at Samantha,\r\n          then flings open the doors.\r\n\r\n          SUNLIGHT.\r\n          It's blinding. Curtis holds his hand up to cover his eyes.\r\n          He stares up at a crystal blue sky. Samantha watches as\r\n          Curtis steps out of the shelter.\r\n\r\n                         \r\n\r\n          EXT. LAFORCHE BACKYARD - CONTINUOUS\r\n\r\n          Curtis rises through the storm shelter's entryway. Out of\r\n          the corner of his eye he catches,\r\n\r\n          A MAN PASSING BY.\r\n          Curtis is startled. He turns to see a CREW of MEN from the\r\n          power company hoisting a ladder onto the pole at the corner\r\n          of the house. A power line dangles overhead.\r\n          He turns to see NEIGHBORS in their yards clearing debris.\r\n          Leaves and branches clutter the ground. The aftermath of a\r\n          storm.\r\n          Samantha steps out of the shelter holding Hannah. She\r\n          surveys the damage.\r\n\r\n                          CURTIS\r\n           It's fine.\r\n          She walks over to Curtis and hugs him. He kisses Samantha on\r\n          the head. Curtis looks up at the sky.\r\n\r\n                         \r\n\r\n          INT. PSYCHIATRIST OFFICE - DAY\r\n\r\n          Curtis sits with Samantha in the plush office of a\r\n          PSYCHIATRIST(56). Curtis rubs his hand over the soft leather\r\n          upholstery on the couch.\r\n\r\n                          PSYCHIATRIST\r\n           Do you have any vacation time that\r\n           you could use?\r\n\r\n                          CURTIS\r\n           I don't have a job right now.\r\n\r\n                          PSYCHIATRIST\r\n           Well, I know that times are hard,\r\n           but I think it's really important\r\n           for you to separate yourself from\r\n           that storm shelter.\r\n\r\n                          (MORE)\r\n\r\n           89.\r\n\r\n                         \r\n\r\n                          PSYCHIATRIST (CONT'D)\r\n           I think you need to break away from\r\n           it for awhile. We can start you on\r\n           some medication that I think will\r\n           help, but that action alone would\r\n           mean a lot.\r\n\r\n                          SAMANTHA\r\n           We usually go on a trip to Myrtle\r\n           Beach every summer. We were gonns\r\n           go this month.\r\n\r\n                          PSYCHIATRIST\r\n           I think that would be okay if we\r\n           start the medication now. It would\r\n           give you all some time to prepare\r\n           as a family, but I want to be\r\n           clear, when Curtis gets back he'll\r\n           need to take more time than that.\r\n\r\n                          SAMANTHA\r\n           What does that mean?\r\n\r\n                          PSYCHIATRIST\r\n           I mean that he'll need hands on\r\n           therapy at a real facility.\r\n          Curtis looks up for the first time.\r\n\r\n                          CURTIS\r\n           You mean I have to leave my family.\r\n\r\n                          PSYCHIATRIST\r\n           I think you need to seriously\r\n           commit to some treatment.\r\n          Curtis processes this. Samantha takes his hand.\r\n\r\n                         \r\n\r\n          EXT. BEACH/CONDO - DAY\r\n\r\n          Curtis scoops handfuls of sand out of a foot deep hole on the\r\n          beach. He slops the wet mixture into a castle shaped bucket,\r\n          his back to the shoreline of gentle, breaking waves.\r\n\r\n                          CURTIS\r\n           (signing and speaking)\r\n           Hey. Good, huh?\r\n          Hannah sits on her knees in front of Curtis sprinkling dry\r\n          sand over castle shaped mounds already formed.\r\n\r\n                         \r\n\r\n          INT. CONDO - DAY\r\n\r\n          Samantha drops four hotdogs into a boiling pot of water and\r\n          stirs a bubbling pot of canned chili.\r\n\r\n           90.\r\n\r\n                         \r\n          The beach condo is small, but brightly furnished.\r\n\r\n                         \r\n\r\n          EXT. CONDO/BEACH - DAY\r\n\r\n          The wooden deck hangs off the back of the beach condo. A\r\n          picnic table is set with plastic place mats and forks. WIND\r\n          lifts the corner of a stack of napkins. The wind blows\r\n          harder, fanning the napkins off the table.\r\n\r\n          ON THE BEACH,\r\n          Curtis, still working in the sand, puts a top on the sand\r\n          castle.\r\n\r\n                          CURTIS\r\n           Good. We put a top on it.\r\n          Curtis smooths out the sand in the castle shaped bucket and\r\n          turns it over to top off their sand mound. He hands the\r\n          bucket over for Hannah to refill.\r\n          The SOUND of the waves behind them has STOPPED. They don't\r\n          notice.\r\n          Curtis takes two fingers and digs a small trench around the\r\n          sand castle.\r\n\r\n                         \r\n          Curtis looks up ready to sign the letters but sees Hannah\r\n          staring at the water. She looks at him and signs something\r\n          with her hands.\r\n\r\n                          CURTIS (CONT'D)\r\n           What is it honey?\r\n          Curtis misses it. He shakes his head, \"no\", and Hannah signs\r\n          again, slowly: \"S-T-O-R-M\".\r\n\r\n                          CURTIS (CONT'D)\r\n           What?\r\n          Curtis turns to the shoreline, getting to his feet.\r\n          He looks down at Hannah, who watches, mesmerized. Scared,\r\n          she looks to her father. He grabs her under the arms and\r\n          rests her on his hip. She buries her head into his chest.\r\n\r\n          AT THE CONDO,\r\n          A gust of wind greets Samantha as she walks out onto the deck\r\n          holding a plate of hotdogs and a bowl of chili. She stops,\r\n          seeing the horizon. Her mouth falls open.\r\n          She slowly sets the plate and bowl down on the table, her\r\n          mind racing. She looks down at Curtis in disbelief.\r\n\r\n           91.\r\n\r\n                         \r\n          Curtis looks up to the Condo and makes eye contact. He\r\n          studies her face.\r\n          Samantha looks at her husband, trying to process it all. She\r\n          looks out at the horizon then back down to Curtis. Concern\r\n          on her face, she nods to him.\r\n          Curtis sees her nod.\r\n          Samantha's eyes, still locked on Curtis, soften, as if to\r\n          apologize. After a moment, she mouths to him, \"I love you.\"\r\n          Curtis nods back to her.\r\n          She looks back up to the shoreline.\r\n\r\n          ON THE BEACH,\r\n          Curtis' feet kick up sand as he rushes back toward the condo.\r\n\r\n          AT THE CONDO,\r\n          Samantha hasn't moved from the porch. A light rain begins to\r\n          fall. Her hands grip the railing. She turns her left palm\r\n          up. Dark rain collects there.\r\n\r\n          ON THE HORIZON IN FRONT OF HER,\r\n\r\n          THE WATER HAS RECEDED INTO THE GULF SOME 100 YARDS. THE DARK\r\n\r\n          SANDY BOTTOM LOOKS ODD STRETCHED OUT SO FAR. A STORM CELL\r\n\r\n          SITS MASSED ON THE HORIZON. CHURNING BLACK CLOUDS FILLED\r\n\r\n          WITH LAYERS OF HORIZONTAL LIGHTNING.\r\n          Behind Samantha, Curtis appears in the open sliding door\r\n          clutching Hannah. The Storm Cell is reflected in the glass\r\n          next to him.\r\n\r\n                          CURTIS (CONT'D)\r\n           Sam.\r\n          Samantha looks down at her palm. She rubs the thick, viscous\r\n          rain in her fingers. She looks back up at the storm.\r\n          On Samantha's face,\r\n\r\n                          SAMANTHA\r\n           Okay.\r\n\r\n           THE END.\r\n\r\n                          \r\n\r\n\n\n\n\nTake Shelter\nWriters :   Jeff Nichols\nGenres :   Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "After the death of her husband, Dr. Cara Harding's (Julianne Moore) faith in God has been shaken, but not her belief in science. In an attempt to get her more open to accepting unexplainable psychiatric theories, her father (Jeffrey DeMunn) introduces her to Adam (Jonathan Rhys Meyers), a patient with multiple personalities who also takes on some of the physical characteristics of his other personalities. Cara quickly discovers that his other personalities were murder victims; and the more she finds out about Adam and his past, the closer she and her loved ones are to becoming victims themselves."}