{"title": "TMNT", "full_text": "TMNT\nWriters :   Kevin Munroe\nGenres :   Animation  Action  Adventure  Comedy  Drama  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Three thousand years ago, an Aztec warlord named Yaotl and his four generals discover a portal opening into a parallel universe which is said to have great power. Yaotl becomes immortal but at a high price, as his four generals were turned to stone. The portal releases thirteen immortal monsters that destroy his army as well as his enemies. In the present, the Teenage Mutant Ninja Turtles have grown apart. After defeating the Shredder, Master Splinter has sent Leonardo to Central America for training. Donatello works as an IT specialist, Michelangelo works as a birthday party entertainer called Cowabunga Carl and Raphael works at night as a vigilante nicknamed Nightwatcher. April O'Neil operates a company that locates and acquires relics for collectors with the help of her boyfriend, Casey Jones.\nDuring a business trip to Central America, April runs into Leonardo and tells him that the turtles have drifted apart. She returns to New York with four statues for her client, Max Winters, the richest man in the city. Upon arrival she calls Casey and tells him that she spoke to Leo and tells him that Leo's not coming back. However a little later Leo does return, and April and Casey deliver the statues to Winters. Winters hires Karai and the Foot Clan to search the city for the thirteen beasts before the portal opens again. Raphael encounters Casey, who reveals his knowledge of Raphael's double identity and joins him in hunting criminals.\nWinters, who is actually the still-immortal Yaotl, reanimates his generals with his company's advanced technology, but they remain made of stone. Leo returns to the sewer, meeting Splinter. Splinter forbids the Turtles from fighting until they can act as a team again. While training, the Turtles encounter one of the thirteen beasts, Bigfoot, battling the Foot Clan. The Turtles engage Bigfoot, going against Leo and Splinter's orders.\nEventually, the Generals and the Foot Clan captured Bigfoot. When Raphael visits Casey, they encounter the Vampire Succubor and witness her capture by the Foot Clan and the Stone Generals, who spot them and knock Raphael unconscious. Casey takes him back to the apartment while April calls the Turtles for help and reveals the identities of Yaotl and his Generals. After being revived, Raphael suggests they pursue Yaotl, but Leo forbids him to go until Splinter gives out the order and so Raphael goes out to investigate alone as Nightwatcher.\nLeo, Donny and Mikey return to their sewer home to plan their next move, where Donny discovers the reopening of the portal will be directly over Winters' skyscraper headquarters. Splinter informs Leo that his team is incomplete, and that he knows what he must do. After eleven monsters have been captured, General Aguila questions Yaotl's actions. The Generals conspire against Yaotl, wanting to remain immortal.\nRaphael encounters one of the remaining monsters, the Jersey Devil, at a diner, but drives him off. Leo has been following him, wanting to put an end to the Nightwatcher's vigilante acts, but when Raph is revealed, they battle. Raph breaks Leo's twin swords and seems as though he is about to kill him but runs off instead. Immediately after Raph flees, the Generals ambush Leo, who is shot with a poison dart and too weak to fight them. Raph hears him scream in the distance as he's taken hostage and doubles back in pursuit, but he fails to get there in time. He takes Leo's broken sabers back to Splinter and explains what happened.\nThe Generals intend to substitute Leo for the thirteenth missing beast and Raphael decides to make amends for his reckless mistakes by rescuing Leo. As the portal opens, Yaotl discovers his Generals' treachery, while Splinter and the Turtles, accompanied by Casey and April, fight their way through the Foot Clan cordon and breach the tower. Yaotl reveals the truth to the heroes: He wants to be free of his curse of immortality. The Generals reveal that they wish to preserve their immortality, but also to use the portal to bring in more monsters to conquer Earth under their command.\nHaving refused to betray Yaotl in exchange for serving the Generals, April, Casey and the Foot Clan work together, searching for the final monster while the Turtles fight the Generals. Splinter and Yaotl fight off winged portal monsters emerging from the portal. April, Casey and Karai arrive at the tower with the Sea Monster. The Sea Monster crashes into the Generals, dragging them into the portal before it closes for another three thousand years. Karai then warns the gang to enjoy their victory while it lasts, claiming they will soon contend with a familiar face from their past. She and the rest of the Foot Clan depart via smoke bombs. Yaotl, now mortal, honors the Turtles and Splinter, thanking them with his dying breath for fulfilling his lifelong wish. Splinter places Winter's helmet among his collection of various keepsakes (items seen in the previous three films such as the time scepter and the ooze canister), as well as Raphael's Nightwatcher helmet and Michelangelo's turtle costume. The movie ends with Raphael narrating that the Turtles will always be brothers as the four of them jump across the rooftops of New York."}