{"title": "TRON", "full_text": "TRON\nWriters :   Steven Lisberger  Bonnie MacBird  Charlie Haas\nGenres :   Action  Adventure  Fantasy  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Kevin Flynn (Jeff Bridges) is a software engineer, formerly employed by the computer corporation ENCOM, who now runs an arcade bar called Flynn's. He wrote several video games, but another ENCOM engineer, Ed Dillinger (David Warner), stole them and passed them off as his own, earning himself a series of promotions until reaching Senior Executive VP. Having left the company, Flynn attempts to obtain evidence of Dillinger's actions by hacking the ENCOM mainframe, but is repeatedly stopped by the Master Control Program (MCP), an artificial intelligence written by Dillinger. However, since its inception the MCP has become power-hungry, illegally appropriating business and even government programs and absorbing them to increase its own capacities; it informs Dillinger of its plans to subjugate The Pentagon and the Kremlin, and expresses interest in China with its request for Chinese-translation programs, blackmailing Dillinger into compliance with records of his theft of the games.\nFlynn's ex-girlfriend, Lora Baines (Cindy Morgan), and fellow ENCOM engineer, Alan Bradley (Bruce Boxleitner), warn Flynn that Dillinger knows about his hacking attempts and has tightened security. Flynn persuades them to sneak him inside ENCOM, where he forges a higher security clearance for Alan's recently developed security program called \"Tron\". In response, the MCP uses an experimental laser to digitize Flynn into the ENCOM mainframe cyberspace (called the Grid), where programs are living entities appearing in the likeness of the human \"users\" who created them.\nFlynn quickly learns that the MCP and its second-in-command, Sark (Warner), rule over programs and coerce them to renounce their belief in the Users. Those who resist the MCP's tyrannical power over the Grid are forced to play in martial games in which the losers are destroyed. Flynn is forced to fight other programs and meets Tron (Boxleitner) and Ram (Dan Shor) between matches. The three escape into the mainframe during a Light Cycle match, but shortly afterwards Flynn and Ram are separated from Tron by an MCP pursuit party. While Ram is mortally wounded and dies, Flynn learns that, as a User, he can manipulate the reality of the digital world.\nTron reunites with his love, Yori (Morgan), and at an input/output junction communicates with Alan and receives instructions about how to destroy the MCP. Tron, Flynn and Yori board a \"solar sailer simulation\" to reach the MCP's core, but Sark's command ship destroys the sailer, capturing Flynn and Yori. Sark leaves the command ship and orders its destruction, but Flynn keeps it intact while Sark reaches the MCP's core on a shuttle carrying captured programs.\nWhile the MCP attempts to consume the captive programs, Tron confronts Sark and critically damages him, prompting the MCP to transfer all of its powers to him, turning him into a giant. Tron attempts to break through the shield protecting the MCP's core, while Flynn leaps into the MCP, distracting it long enough to reveal a gap in its shield. Tron throws his disc through the gap and destroys the MCP and Sark, ending the MCP's tyrannical rule.\nAs programs all over the system begin to communicate with their users, Flynn is sent back to the real world, quickly reconstructed at his terminal. A nearby printer produces the evidence that Dillinger had plagiarized his creations. The next morning, Dillinger enters his office and finds the MCP deactivated and the proof of his theft publicized. Later, Flynn takes his rightful place as ENCOM's new CEO and is greeted by Alan and Lora on his first day."}