{"title": "Tropic Thunder", "full_text": "TROPIC THUNDER\n\n\n                                   Written by\n\n                    Ethan Cohen, Ben Stiller & Justin Theroux\n\n          \n\n          \n\n          ON THE MOVIE SCREEN\n          BLACK. The movie has not started yet. After the last real\n          trailer plays in the theater, we see THE UNIVERSAL LOGO.\n          The globe stops rotating, and STARTS TO BROWN AND CRACK.\n\n          VOLCANOES ERUPT ON IT...\n\n          ACTION TRAILER ANNOUNCER\n          In a world where only one man made a\n          difference... \"n 1a%\n\n          AND WE ZOOM ALL THE WAY IN TO,..\n          A POST APOCALYPTIC FIERY TUNDRA... AND ONE MAN...who\n          walks across it, looking cool, shirtless, pumped, with\n          shades on, holding a BABY in one arm and a FLAMETHROWER\n          in the other. . .this is international superstar CHRIS\n          MICHAEL SPEEDMAN... there is a GIANT explosion behind\n          him... he doesn't even flinch...\n\n          ACTION TRAILER ANNOUNCER\n          The one man who made a difference... is\n          about to make a difference... Again...\n          BLACK... then Speedman, again shirtless, is on an ICEBERG\n          and an AVALANCHE is thundering behind him. This time he\n          has a SET OF TWINS AND A FLAMETHROWER.\n\n          ACTION TRAILER ANNOUNCER\n          Chris Michael Speedman...IS Deke\n          Cogan...\n\n          A TITLE BURNS ACROSS THE SCREEN..\n\n          ACTION TRAILER ANNOUNCER\n\n          SCORCHER 3: GLOBAL MELTDOWN\n\n          TITLE FLIES AWAY FOLLOWED BY: SUMMER 2008\n          BLACK, then... \"\n          The NEW LINE LOGO over the stately POMP AND\n\n          CIRCUMSTANCE...\n\n          COMEDY TRAILER ANNOUNCER\n          This summer, the halls of academia are\n          about to get a lesson in...\n\n          INT. BOARDING SCHOOL\n\n          TRACK ACROSS a bunch of CUTE TEN YEAR OLD SCHOOLBOYS\n           sitting at a dining hall table until we get to .JEFF\n\n          PORTNOY, 35, GROSS OUT COMEDY STAR.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 2.\n          He has red hair, cut in a page-boy style and is dressed\n          in a school boy uniform which is way too small.\n\n          COMEDY TRAILER ANNOUNCER\n          .Comedy! From America's favorite fat\n          guy... uhh...fat KID...\n\n          HE RIPS A GIANT FART. THE MUSIC NIPEDLE SCRATCHES TO\n\n          \"LOUIE LOUIE\"...\n          An ANGRY HEADMASTER SCOWLS. THE BOYS CRACK UP.\n\n          16,\n\n          COMEDY TRAILER ANNOUNCER\n          Jeff Portnoy is having...\n\n          PORTNOY\n\n          (YELLING ON THE TABLE)\n\n          DOODYFOR DINNER!!!\n\n          A GIANT FOOD FIGHT ENSUES AS THE TITLE \"DOODY.FOR\n\n          DINNER\" FLIES ON..\n\n          COMEDY TRAILER ANNOUNCER\n          This summer, lunch is on him!\n\n          A PLATE OF SPAGHETTI IS DUMPED ON HIS.HEAD..\n\n          BLACK\n          The FOX SEARCHLIGHT LOGO comes up. AN EXTREMELY BEAUTIFUL\n          JAMES HORNER TYPE,SCORE PLAYS... i\n\n          EXT. A BEAUTIFUL 400 YEAR.OLD IRISH VICARAGE\n\n          It is an Oscar winning shot at dawn of a brooding\n          handsome priest in a monk's robe walking towards the\n          church. This is KIRK LAZARUS, who has the intensity of a\n          Daniel Day Lewis and the seriousness of a Sean Penn...\n\n          OSCAR WINNING MOVIE\n\n          TRAILER ANNOUNCER\n          In a time where to be different was to be\n          condemned... and to be condemned was to\n          die...\n\n          INT. CHURCH\n\n          Lazarus is. lighting the rosary candles... he glances over\n          at another YOUNG PRIEST, who gives him a smoldering\n          look. . .Lazarus turns away, tortured...\n\n          \n\n          \n\n          \n\n          \n          , Tropic Thunder 3.\n\n          OSCAR WINNING MOVIE\n\n          TRAILER ANNOUNCER\n          .one man chose to question his God...\n          Lazarus screams angrily at crucifix on the wall:\n\n          LAZARUS\n          (Irish brogue)\n          You made me! Why can't you... UNMAKE ME!'\n\n          THESE TITLES COME UP ON THE SCREEN AS THE ANNOUNCER\n\n          SPEAKS:\n\n          OSCAR WINNING MOVIE\n\n          TRAILER ANNOUNCER\n          Winner of the Palm D'or, The Golden Bear,\n          The Laughing Monkey and over 350 film\n          critics' '10 BEST' picture lists, and\n          hailed by Roger Ebert as \"A MASTERPIECE\n\n          THAT WILL MAKE YOU FEEL EMOTIONS YOU\n          NEVER KNEW YOU HAD\"... Three time Oscar\n          Winner Kirk Lazarus, in two time Oscar\n          winning director Clint Eastwood's\n          boldest film... \"SATAN'S ALLEY\".\n          THE TITLE HOLDS... then BLACK.\n          Now, finally, the movie starts. We see The DREAMWORKS\n          LOGO... Which has no music under it... only the low\n          pitched SWOOSHING OF A CHOPPER BLADE...\n\n          BLACK\n          The thumping blade gets LOUDER AND LOUDER, the BASS LINE\n          of \"BREAK ON THROUGH TO THE OTHER SIDE\" rising with it\n          until finally...\n\n          SMASH CUT TO:\n\n          EXT. VIETNAM -- DAY\n\n          A HUEY COBRA in slow motion, crests an impossibly\n          beautiful jungle ridge, flying low and straight at us.\n\n          INSIDE THE COBRA\n          A GUNNER sprays fire down at unseen anti-aircraft. All\n          that can be see on the ground are whizzing TRACERS flying\n          up at the chopper.\n\n          \n\n          \n\n          \n\n          \n          \"Tropic Thunder 4.\n          The chopper skims the treetops heading toward a hot LZ...\n\n          EXT.,, HOT LZ -- DAY\n\n          As the Cobra comes in hard, about TWENTY INFANTRYMEN are\n          emerging from the tree-line, in a chaotic fire fight with\n          twice as many VC SOLDIERS.\n          As the. chopper tries to land, the gunner tosses a couple\n          of grenades behind the Americans, sending about ten VC\n          flying. But the bulk of the platoon is getting GUNNED\n          DOWN by the enemy.\n          A. heavy set grunt, FATS, looking like he is in great\n          pain, is'running full speed for the chopper, taking fire\n          from all over.\n          Fats looks a 'lot like JEFF PORTNOY, star of .\"Doody For\n          Dinner\".\n          BROOKLYN, an.18 year-old cherry from Brooklyn, is also on\n          the move, towards the.chopper...Clutching his thick black\n          glasses, and a. map, and triangulating coordinates, he' is\n          frantically trying to call in an air strike on his radio\n          backpack. A GRENADE EXPLODES ten feet away knocking him\n          on his ass.\n          He gets up, shaken, just in time to be BAYONETED. through\n          the stomach by a VC SOLDIER...\n          The VC soldier turns around just in time to be machine-\n          gunned down-5y MOTOWN who has all sorts of stomizd\n          shit\" on his fatigues, an ace of spades in his helmet,\n          along with some graffiti scrawl that reads \"and God\n          spoke\" including cut-off sleeves that reveal his\n          impressive pipes. He, is a 'bad muthaf.ucka.\n\n          MOTOWN\n          That's for Brooklyn, Muthafucka!\n          Underneath the hovering chopper, OSIRIS,a black, buffed\n          out Rambo-looking Sergeant, is letting loose his M-16\n          with abandon, yelling at the pilot to get the bird lower.\n          It does.\n          Fats grabs. the mortally wounded Brooklyn and slings him\n          over his shoulder, Brooklyn's shirt is blown open\n          revealing his entrails...in shock, he clutches his liver\n          in his right hand, and is trying futilely to put it back\n          in his body...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 5.\n          FATS heaves Brooklyn onto the floor of the still-airborne\n          chopper just as it gets low enough, and returns to\n          firing. He unleashes a hailstorm of lead at the\n          approaching VC...\n\n          OSIRIS\n\n          FATS! GET YOUR ASS ON THIS CHOPPER NOW!\n\n          LET'S MOVE!\n\n          4 41\n          FATS ignores him and continueb firing. MOTOWN comes\n          running up to the chopper...\n\n          OSIRIS (CONT'D)\n\n          YOU TOO, MOTOWNI\n\n          MOTOWN\n          (to Osiris)\n          SIR! Requesting permission to disobey\n          Sergeant's orders, SIR! FOUR LEAF IS\n\n          STILL OUTSIDE THE PERIMETER AND\n\n          UNACCOUNTED FOR!\n\n          OSIRIS\n\n          MOTOWN! GET YOUR DETROIT JUKE BOX JHERI\n\n          CURL IN THIS CHICKENSHIT CHOPPER ASAP.\n\n          THAT GOES FOR YOUR FAT ASS TOO, FATS!\n\n          MOTOWN\n\n          SIR! FUCK YOU SIR! WE DON'T LEAVE WITHOUT\n\n          FOUR LEAF, SIR!\n\n          OSIRIS\n\n          THAT'S JUST HOW BOOKS GOT HIS JEW ASS\n\n          KILLED AND MEATBALL'S WOP ASS BOUGHT THE\n\n          SIX BY THREE FARM! YOU GET ON THIS BIRD,\n\n          PRIVATE!\n\n          CHOPPER PILOT\n          Sir! We gotta DIDI NOW! Air strike\n          confirmed! This place is gonna be toast\n          in about thirty seconds!\n          Osiris turns on Motown, pulling his .45 in the midst of\n           the mayhem. He pushes it up into Motown's neck.\n\n          OSIRIS\n\n          FOUR LEAF IS DEAD MEAT, SOLDIER! AND YOU\n\n          GOT ZERO 0' HUNDRED HOURS TO GET YOUR ASS\n\n          ON THIS CHOPPER BEFORE YOU JOIN HIM!\n          Osiris, standing on the skid, motions for the chopper\n          pilot to take off.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 6.\n          Motown looks to Fats,:then reluctantly jumps on the\n          chopper...It begins to hover...\n\n          OSIRIS(CONT'D)\n\n          FATS! YOU GET ON THIS BIRD NOW! YOU HEAR\n\n          ME YOU MUTANT MOTHER--\n\n          BROOKLYN\n           A 1, I qft\n          (a soft whisper) I Id\n          Sarge...\n          .We PUSH IN ON BROOKLYN dramatically as he raises his\n          head. Looking off to the tree line, he points a crooked\n          finger...\n\n          BROOKLYN\n          It's him. It's Four Leaf...\n          Everyone turns to-see...\n          FOUR LEAF, who looks a lot like CHRIS MICHAEL SPEEDMAN\n          from the \"Scorcher\" trailer, . burst through the treeline,\n          half limping, half crawling heroically through the\n          massive firefight in SLOW MOTION.\n          He is being chased.by about-FIFTY _VIET...CONG SOLDIERS...\n          Everyone on board seems mesmerized. Osiris sees it, and\n          can't believe his eyes... nevertheless, he screams to the\n          pilot. I\n\n          OSIRIS\n\n          GO! GO!\n          Fats, still on the ground, in defiance of Osiris, grabs\n          the chopper's runner, and in a superhuman show of\n          strength, OR IS IT WEIGHT, holds it with-all-his might,\n          preventing it from flying away.\n          The pilot struggles with the controls, as Fats continues\n          his barrage of bullets with his machine gun arm,\n          providing weak cover for Four Leaf.\n          The chopper is now gaining momentum, and pulls Fats about\n          ten feet-off-the ground. He is, about to lose his battle\n          with the helicopter.\n          Four Leaf, riddled with bullets, and delirious, is\n          fighting a losing battle to gain ground... He doesn't\n          even have a gun...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 7.\n          Osiris looks at the dejected faces of his men, then at\n          Fats... a flash of anger and compassion comes over his\n          face.. .\n          FOUR\"LEAF, Christ-like and arms extended, sinks to his\n          knees, his body now absorbing unbelievable amounts of\n          lead...\n\n          OSIRIS\n\n          I HOPE YOU FAGGOTS LIKE HAMBURGER BECAUSE\n\n          THAT IS EXACTLY WHAT I'M GONNA BE\n\n          BRINGING BACK TO THIS BIRD.. .COVER ME!\n          Weak smiles flicker across the face of the men as they do\n          just that... unleashing lead all around Osiris as he jumps\n          out of the chopper like an Apache warrior.\n          Fats drops off the runner of the chopper, shooting his\n          machine gun in cool SLO MO.\n          Screaming a war cry, Osiris makes a beeline for Four\n          Leaf. Dancing between the raindrops, he dodges tracer\n          fire ...\n          Osiris finally makes it and kneels beside Four Leaf,\n          cradling his head. Four Leaf's eyes are glassy, and his\n          body and arms are ripped open all over like a rag doll.\n\n          FOUR LEAF\n          Get outta here. I'm worm food, man, you\n          dig?\n\n          OSIRIS\n          (beginning to cry)\n          What, and give up all that California\n          pussy you been talking about? Shiiit.\n          Someone's gotta show me around L.A...\n\n          FOUR LEAF\n          (cracking a bloody smile)\n          Shit. . .the only way you're gonna get a\n          piece of LA pussy if is you go out to the\n          graveyard and dig some up...\n          Osiris looks down at Four Leaf's now missing arms...\n\n          OSIRIS\n          Well ...y...you better come along and\n          bring the shovel...\n          He starts to choke up.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 8.\n\n          FOUR LEAF\n          I'm scared,. Sarge. 'Scared I ain't never\n          gonna see another sunset.\n          (long philosophical beat)\n          Why does a man want to pick up sticks\n          against another man... 'Stead of usin'\n          them sticks. to prop a man up?\n          Osiris nods, now crying like a baby... ï¿½4Id Iu I. Igft\n\n          OSIRIS'\n\n          DON'T YOU DIE ON ME FOUR LEAF... .THAT'S AN\n\n          ORDER!!!\n\n          FOUR LEAF\n          (beginning to fade)\n          Hold my hands... 'cause I got somethin'\n          to say...\n          Osiris looks down.at Four. Leaf's bloody, stringy stumps.\n          There's nothing to hold...\n\n          FOUR LEAF\n          Are, you holding them?\n\n          OSIRIS_\n\n          (WEEPING)\n          Oh, I'm holding them..\n\n          FOUR LEAF\n          I ain't never been worth a. nothin' in\n          this life, and it's kinda late to start\n          b e i' a somethin' now. But you... you\n          are my... b-b-brother.\n          Four Leaf screws.up.his .face and begins to cry--except\n          that he can't. He tries again... and can't.. Hescrews\n          up his face grotesquely...\n\n          FOUR LEAF\n          You are my...\n          WE NOW PULL BACK TO REVEAL we are actually on location\n          shooting this war scene with about 50 CREW MEMBERS\n          watching, surrounded by millions of dollars worth of film\n          equipment.\n          Four Leaf, actually the superstar. playing him, Speedman,\n          is getting increasingly self-conscious, becoming more and.\n          more aware of the-crew waiting for him to cry.\n          The actor playing Osiris, KIRK LAZARUS, is also getting\n          uncomfortable holding Speedman's not-crying head.\n\n          \n\n          \n\n          \n\n          \n          ,, Tropic Thunder 9.\n\n          (YES, LAZARUS WAS WHITE AND IRISH IN THE SATAN'S ALLEY\n          TRAILER, now he is AFRICAN AMERICAN and speaks with an\n          American accent-- IT WILL BE EXPLAINED SOON!)\n          The person perhaps most upset about it all is the skinny'\n          young British director, DAMIEN DORFMAN. Coiled at the\n          monitor and covered in bug bites and sunblock, wet towels\n          around his neck, and clearly not made for jungle\n          life.. .he' mouths the words \"you are my brothers..'.\" as\n          if trying to will the tears from Speedman's dry eyes.\n\n          SPEEDMAN\n          (breaking character)\n          I'm sorry, can we cut, Damien?\n          Damien grips his headphones in confusion, looking around\n          to his cadre of assistants and ADs...\n          The chopper continues to hover, soldiers continue to\n          fight, except a few are starting to wonder what's going\n          on.\n\n          SPEEDMAN\n          CUT! We gotta cut, Dorf!\n\n          DAMIEN\n\n          (CONFUSED)\n          What? What did he say?\n          (to 1st AD)\n          Play it through! Still rolling!\n          Now the extras have stopped fighting -- except for a few\n          way far back.\n\n          1ST AD\n          Play it through! Still rolling!\n\n          SPEEDMAN\n          No! Not still rolling! Cut!\n          Damien runs towards Speedman.\n          Fats, who is young fat comedy gross-out star JEFF\n          PORTNOY, gets up from the ground, rubbing his butt.\n\n          PORTNOY\n          OW, SHIT! I fell right on my ass bone!\n          Other \"dead\" extras begin to hold their heads up and look\n          around. Some are amputee stuntmen.\n\n          \n\n          \n\n          \n\n          \n\n          11\n          Tropic Thunder 10.\n\n          1ST AD\n          (into megaphone)\n          Damien? Are we cutting?\n          1st AD jumps off the scaffold, running towards the\n          director. Tekkies scurry around, lots of confusion. Are\n          they cut, or what?\n          Brooklyn,'.played by the not-famous KEVIN SANDUSKY,Ihold s\n          his bloody \"liver\" up to hand off to someone.\n\n          SANDUSKY:\n          Mr. Dorfman? Are we cutting sir? Cause .I\n          think they put w ay too much blood in my\n          liver again.\n\n          DAMIEN\n          STILL ROLLING! Get down Kevin, you're\n          dead!\n          Sandusky immediately complies, he seems to be the only\n          actor listening to the director.\n\n          SPEEDMAN\n          I'm sorry.. I can't do it, Dorff.\n          Damien runs up to Speedman. They are the center of\n          attention -- the whole crew watching them.\n\n          DAMIEN\n          It's good, keep going. This is a big shot\n          so keep going, let it come. No arms,\n          you're hanging on, it's-al-1-coming out...\n          It's real, death, life, brotherhood and\n          we just... let's keep it going now...\n          He starts to back out, turning his finger in the \"still\n          rolling\" motion. He gives a thumbs up to the AD.\n\n          SPECIAL EFFECTS PYRO CONTROL TOWER\n          CODY, the GRIZZLED LOOKING PYROTECHNIC EFFECTS.GUY, paces\n          in an elaborate tower rigged with EFX detonation\n          equipment.\n          He is surrounded by a throng of local ASIAN TECHNICIANS\n          who all hold various types of buttons, and detonators.\n          He punches buttons, and surveys the chaos, trying to\n          figure out what's going on.\n\n          CODY\n          Is that the signal?\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 11.\n          The assistant doesn't appear to,understand English. He\n          shrugs. Frustrated, Cody rips out an earpiece.\n\n          CODY\n\n          DAMIEN! IS THAT THE SIGNAL?\n\n          BACK ON THE ACTORS\n          'IYd \"'\n          Damien has his hands full with Speedman.\n\n          SPEEDMAN\n          (above the din of the\n\n          CHOPPER)\n          Dorf! Seriously, I think we should cut.\n          I mean, Should Osiris be crying too?\n          Maybe he shouldn't cry if I'm crying...\n          Lazarus abruptly drops Speedman from his arms and gets\n          up, shaking his head.\n\n          LAZARUS\n          I'm sorry, so, just keep crying or are'we\n          cutting??\n\n          DAMIEN\n          No, no, it's good.\n          Portnoy is walking around massaging his butt.\n\n          PORTNOY\n          Damien, I think I broke my ass. Is it\n          possible to break your ass?\n\n          DAMIEN\n          Get back in character Portnoy! Still\n          rolling everyone!\n          (to Lazarus)\n          Great crying Kirk -- stay with that.\n          Chris Michael, don't worry about where\n          Kirk is at, just be Four Leaf crying\n          right here and now and still\n          rolling... and GO!\n\n          SPECIAL EFFECTS PYRO COMMAND AREA\n          Cody's crew buzzes around him in a countdown to\n          Armageddon...\n\n          CODY\n          Did he say \"go\"?\n          (loud into walkie)\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 12.\n          CODY,(cont,'d)\n\n          DAMIEN, ARE WE GO FOR EXPLOSION? BECAUSE\n\n          WE GOT ABOUT THIRTY MORE SECONDS TO\n\n          DECIDE IF--\n\n          BACK ON'THE ACTORS\n          The 1st A.D. tries to.get Damien to pay attention to\n          Cody, but he is too focused on getting Speedman to cry.\n          I III I. 11h.\"\n\n          '111\n          Lazarus gets back in position. He effortlessly turns.the\n          waterworks back on, sobbing like .,a broken man. Speedman\n          .starts to get back into position and then :--\n\n          SPEEDMAN\n          Wait, hey, y'know, maybe- is it the\n          line? \"You are my brothers\"? I don't\n          think I would.say that. Four Leaf\n          wouldn't say that.\n\n          DAMIEN\n          Yes, well-you see, Four Leaf was there\n          and he did say that. So...\n          Right. So let's just go...\n\n          SPEEDMAN\n          Is he here, or is he-'at the.hotel?\n          Because I would love to run it by him.\n\n          1ST AD\n          Damien! The chopper! I got to let them\n          go! We,need to pull the plug on the\n          treeline burst if you're cutting!\n\n          LAZARUS\n          You know what, this is nuts. You got my\n          take. I'm done.\n          (to Speedman)\n          Movie star. We'll be here till Chinese\n          New Year waitin.' for my man to. cry.\n\n          DAMIEN\n          Kirk! Wait!\n          Lazarus keeps walking.\n\n          DAMIEN\n          Kirk!\n\n          LAZARUS\n          .You got my take.\n\n          \n\n          \n\n          \n\n          \n\n          ,I\n           Tropic Thunder 13.\n\n          Â\u0096º\" )\n          A CELL PHONE RINGS -- A HIP HOP RING TONE. MOTOWN, who is\n          played by rap superstar and budding media mogul\n          REDYKULOUS, pulls the phone out and checks his text\n          message.\n\n          REDYKULOUS\n          Hey, can we get this going? I got peeps\n          coming to my room to rub me down at 4.\n          Bitches, too.\n          His phone rings again.\n\n          REDYKULOUS\n          (into phone)\n          Hey! What's up! Naw, nothing -- same\n          soup, just re-heated, you know?\n          Redykulous wanders off in another direction. The AD is\n          now yelling into Damien's ear.\n\n          DAMIEN\n          (losing it)\n          EVERYONE! Please! The chopper only has so\n          much gas!\n          PORTNOY, trying to lighten the mood, rips a huge FART.\n\n          PORTNOY\n          Plenty of gas right here, D-man!\n          (then feeling the pain in his\n\n          BUTT)\n\n          OWW1\n\n          REDYKULOUS\n          Hey, yo! I am trying to have a\n          conversation here!\n\n          DAMIEN\n          Okay, fine! Fuck me! What the fuck do I\n          know? I'm just the fucking...\n          (inarticulate snarl)\n          Godfuckit!\n          Damien throws his headphones off in frustration... and\n          throws up his hands.\n\n          SPECIAL EFFECTS TOWER\n          Cody, sees Damien throw up his hands.\n\n          \n\n          \n\n          \n\n          \n\n          11\n          Tropic Thunder 14.\n\n          CODY\n          There's the signal! GO! GO! GO! Let's\n          light this puppy up! Let's go freaking\n          11 TET here!! i\n          Cody and his assistants push plungers, buttons, pull\n          levers, and drag metal wands over long lines of wired\n          nails, they spark and fizz...\n\n          WIDE SHOT'\n          Damien is-still throwing his fit when...\n\n          AN EXPLOSION TURNS THE ENTIRE TREE LINE INTO ACURTAIN OF\n\n          FLAMES.\n\n          ON CODY\n          climaxing with joy as he barks commands and pushes ever\n          more buttons..\n\n          THE BLAST\n          blows the helicopter backwards into a bank of lights,'\n          causing them to tip.and-begin a GIGANTIC CHAIN REACTION\n          that takes down most of the equipment, then finally THE\n\n          TOWER WITH CODY AND HIS ASSISTANTS!\n          Men jump like fleas. Cody lands on his back, in pain,\n          .which he seems to like.\n\n          CODY\n\n          (1 T)\n          That was good for me.\n          Damien's mouth hangs open in shock. There is a strange\n          quiet on the set.\n\n          DAMIEN\n\n          (WHISPERING)\n          .Did we get that on film?\n          The cameraman turns to the AD and then back to Damien,\n          looking a bit scared.\n\n          CAMERAMAN\n          Sorry, Damien.'Chris Michael was saying\n          to cut, so we cut--\n          The AD comes up to the lost looking Damien.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 15.\n\n          1ST AD\n          (to Damien)\n          I'm gonna have to call it, Damien.\n          Damien is silent, stunned.\n\n          1ST AD\n          (into megaphone)\n          Okay, that's a wrap for'today. If you are !IN\n          injured, please find the set medic.\n          Speedman, looking as if he had nothing to do with what\n          just happened, walks toward Damien.\n\n          SPEEDMAN\n          I think I got another in me if you want\n          to go again, Damien.\n          Damien looks at the scorched treeline behind them.\n          Speedman looks too, then looks back at Damien.\n\n          SPEEDMAN\n          Your call.\n          In the background, Cody is casually putting out a fire on\n          his lap. He gives an 'I'm O.K.' gesture to no one in\n          particular.\n\n          CUT TO:\n          El TELEVISION OPENING GRAPHICS\n          After a flashy montage, JULIE MORAN, the cute El News\n          Daily reporter, walks through the Tropic Thunder set in a\n          halter top, talking to camera:\n\n          JULIE\n          Well, it might look like 1969 here in the\n          tiny Southeast Asian country of Bien Den\n          Phu, but it is 2007, and they are making\n          history. We are here with an E!\n          exclusive, the first look behind the\n          scenes at what Hollywood insiders are\n          calling the most expensive war movie ever\n          produced. It's called \"Tropic Thunder\",\n          and first time Director Damien Dorfman\n          has assembled an all-star cast to play\n          the forgotten grunts who perished near\n          here more than 35 years ago.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 16.\n          JULIE (cont'd)\n          Heading up the ensemble, the highest\n          grossing action star of all time, Chris\n          Michael Speedman...\n          d I\n\n          VARIOUS SHOTS OF SPEEDMAN AT PREMIERES, PRESS CONFERENCES\n\n          JULIE .\n          But the last few films have-not \"blown\n          up\" for Speedntan as he's struggled to\n          broaden his range as an.-actor.. First, an\n          attempt to change gears with a comedy...\n\n          INT. BANK - SCENE FROM \"CHITLIN AND THE DUDE\"\n\n          Speedman'and Martin Lawrence, both with guns, are holding\n          up a bank -- Speedman in drag. They yell at each other\n          in that uptight-white-guy/loose-cannon-black-guy action\n          comedy style.\n\n          JULIE (V:O.)\n          The disappointing \"CHITLIN AND THE DUDE\",\n          was followed.with last year's failed\n          venture into serious dramatic\n          territory...\n\n          EXT. PONY FARM - SCENE FROM \"SIMPLE JACK\" - DAY\n\n          :Speedman,..innoveralls and with a bad haircut, dressed as\n          a farm hand. He holds a pony_by the reins as he \"talks\"\n          to it by rubbing his nose on the pony's neck.\n\n          JULIE (V.0.)\n          .\"Simple Jack\", the story-of a mentally\n          impaired farm hand who can \"talk\" to\n          animals was a box office disaster that\n          many critics called one of the worst\n          movies of all time.\n\n          SPEEDMAN\n          (as Simple Jack)\n          You mu-mu-muhhh make me'ha-aaaapy.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 17.\n\n          EXT. TROPIC THUNDER SET -- DAY\n\n\n          JULIE\n          (to camera)\n          But now, the question is can Speedman \"mu-\n          mu-make\" audiences happy in the true life\n          story of war hero Four Leaf Tayback in\n          \"Tropic Thunder\". And,' possibly a shot â\u0080\u009e 1. -4416\n          at that elusive gold statuette?\n\n          EXT. TROPIC THUNDER SET -- DAY\n\n          Julie sits with Speedman. With them is the real FOUR\n          LEAF, a stoic, grizzled man of few words.\n\n          SPEEDMAN\n          (very serious)\n          All I want is to make the real Four Leaf\n          here proud. It's his story, he lived it\n          and wrote it in his book. That's why\n          we're here. But really, I mean, how cah\n          we begin to understand what he-- what you\n          --went through?\n          Four Leaf fixes his stoic, steely gaze on the horizon for\n          a beat. He lifts his hands up, and we see he has only\n          two HOOKS.\n          Speedman studies him closely, aping his gestures, trying\n          to \"get inside\" him as much as possible.\n\n          FOUR LEAF\n\n          (MYSTICAL)\n          When I lost these...\n          (holds his hooks up)\n          It was as if I saw through these for the\n          first time..'.\n          (indicates his eyes)\n          And it was only then that I really began\n          to use these...\n          (indicates his ears)\n\n          SPEEDMAN\n          That's great. He's like a... Buddha or\n          something. Maybe I should rub his belly\n          for luck!\n          He laughs, but quickly realizes Four Leaf doesn't find it\n          funny.\n\n          \n\n          \n\n          \n\n          \n          ,Tropic Thunder 18.\n\n          JULIE\n          (to Speedman)\n          Like for a lucky Oscar nod this time?\n          Maybe you should rub Kirk Lazarus's\n          belly! He already has three!\n          Speedman laughs uncomfortably, trying to seem\n          unperturbed. i\n           \"I' 0, nM y\n\n          L\n\n          CUT TO:\n\n          A SERIES OF SHOTS OF KIRK LAZARUS\n          In his normal.look, CAUCASIAN and IRISH, much like he was\n          in the \"Satan's Alley\" trailer...\n\n          - JULIE (V.0.)\n          Three time Oscar winner Kirk Lazarus,\n          reclusive, brilliant Irishman, considered\n          by many.'the best actor of his generation,\n          and also a known bad boy...\n          Stills of a DRUNKEN LAZARUS outside a New York Bar,\n          punching a paparazzo...\n\n          JULIE\n          . is famous for his total immersion\n          into whatever role he plays. To.transform\n          into the role of the African American\n          Sergeant who saved_Four Leaf's life...\n\n          INT. DOCTOR'S OFFICE\n\n          Lazarus is examined by a doctor.\n\n          AJULIE (V.0.)\n          Lazarus-went - to shocking, and\n          controversial lengths...\n\n          INT. HOSPITAL ROOM - A FEW WEEKS LATER\n\n          Lazarus lies in a hospital bed,, covered in bandages.\n\n          JULIE\n          After undergoing experimental\n          pigmentation alteration procedures in a\n          Singapore clinic, this was the startling\n          result.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 19.\n          A doctor dversees as nurses carefully peel the bandages\n          off Lazarus's head. Lazarus is now Black.\n\n          INT.''TROPIC THUNDER PRE-SHOOT PRESS CONFERENCE\n\n          In the hotel, with THE ENTIRE CAST sitting in front of a\n          banner touting the movie's title.\n          Lazarus speaks in his \"Osiris\" character voice we heard\n          at the beginning of the film -- one that he will NEVER\n\n          DROP.\n\n          LAZARUS\n\n          (OSIRIS VOICE)\n          There are all these young brothers who\n          got no role models but a bunch of pimp-\n          acting rappers, who glamorize a life of\n          gangsterism and womanizing. I'm just\n          grateful to have this opportunity to be\n          able to represent.\n          Redykulous hears this, looks pissed.\n\n          SERIES OF SHOTS OF DAMIEN DORFMAN\n          Getting awards, shooting documentary footage in SIERRA\n          LEONE of warring tribesmen.\n\n          JULIE (V.0.)\n          British documentary director Damien\n          Dorfman has never made a theatrical movie\n          before, but his mission, he says, is to\n          bring a reality to the film that he feels\n          is missing from most Hollywood epics.\n\n          INT. TROPIC THUNDER PRE-SHOOT PRESS CONFERENCE\n\n\n          DAMIEN\n          My goal, quite simply, is for an audience\n          member to walk out of the cinema, feeling\n          as if they were IN Vietnam for two hours.\n          Quite literally.\n\n          REPORTER\n          Are you intimidated about working with\n          actors for the first time?\n\n          DAMIEN\n          Intimidated?\n\n          (CHALLENGING)\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          1\n          Tropic Thunder 20.\n          DAMIEN (cont'd)\n          Not really, mate. I tell you what's\n          intimidating. Filming a seven-foot Hutu\n          warrior who is readylto shove his machete\n          up your ass if you look at him cockeyed.\n\n          (BEAT)\n          That's intimidating. I think I ban handle\n          actors of the unarmed variety.\n\n          CUT TO:\n\n          JULIE (V.0.,)\n          Well, he'll certainly have his hands full\n          with king of comedy Jeff Portnoy.\n\n          INT. COURTROOM - VIDEO\n\n          A fuckedlup looking PORTNOY being taken away by a\n          .bailiff.\n\n          JULIE (V.0.)\n          After being arrested for heroin, cocaine\n          and crack possession, Portnoy is out to\n          prove he can. stay clean and get audiences\n          addicted to seeing him in a movie without\n          any potty. humor...\n\n          HIP HOP VIDEO -- MIAMI -- DAY\n          REDYKULOUS struts out and does a ridiculously lewd dance\n          with about FIVE HIP HOP ASSES. surrounding his face.\n\n          JULIE\n          And from the world of hip-hop, multi.--\n          platinum selling rapper, producer, and\n          clothing designer Redykulous, and star of\n          his own hi't reality show \"Utterly\n          Redykulous\".\n\n          INT. TROPIC THUNDER PRE-SHOOT PRESS CONFERENCE\n\n          Redykulous is in his \"REDYKWEAR\" sweats.\n\n          REDYKULOUS\n          As far as Redykulous is concerned, you\n          .know, I 'always believed you've got to\n          exploit every opportunity.\n          He holds up a can of \"PYMP SWEAT\".\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 21.\n\n          REDYKULOUS\n          That's why my new sports drink Pymp Sweat\n          is the official beverage on the set of\n          Tropic Thunder, as well as my new energy\n          bar, the \"Bust-A-Nut\", with all proceeds\n          going to clean up land mines in this\n          previously war ravaged area.\n\n          EXT. HOTEL POOL -- DAY\n\n\n          JULIE\n          At a reported budget north of $200\n          million, Tropic Thunder could end up\n          costing almost as much as the real war!\n          But the good news for Damien Dorfman and\n          his troops -- the Oscar buzz is already\n          starting! So for El News I'm Julie--\n          All of a sudden Portnoy, wearing a Tropic Thunder cap all\n          askew and surfer shorts with no shirt, bursts out of the\n          bushes. He screams wildly and GRABS Julie, who cracks up\n          laughing at his \"stunt\". '\n\n          PORTNOY\n          (silly voice)\n          Me so horny!! Me so horny!!\n          He jumps into the pool with her! What a crack up!\n\n          CUT TO:\n\n          EXT. RUN DOWN \"RESORT\" HOTEL -- DAY\n\n          It is the one hotel in the area, and it looks like it has\n          been through a war, which it probably has. It has been\n          taken over as the Tropic Thunder production headquarters.\n          We see a mix of PRODUCTION PEOPLE and HOTEL WORKERS.\n\n          VOICE OF TODD\n          We're shutting you down, Dorf.\n\n          INT. PRODUCTION OFFICE -- DAY\n\n          Damien sits behind his desk, looking scared. Vietnam\n          photos, maps, and sketches cover the walls. Standing in\n          the office are ASSORTED CREW, including Cody and Four\n          Leaf, who whittles a stick with his hooks, never looking\n          up.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 22.\n          They are all staring at a speaker phone.\n\n          DAMIEN\n          You can't do that Todd.\n\n          VOICE OF TODD I\n          Yes we can.. The dailies are not good.\n\n          DAMIEN\n          Dailies are always bad! Bad dailies, good\n          movie! Isn't that what they say?\n\n          VOICE OF TODD\n          I never heard that saying. Look, Damien.\n          Fact: You're. three weeks behind and\n          you've been shooting for five days. Fact:\n          we greenlit this project at a very\n          specific number, a number Walter and I\n          could get in bed. with, and fact--.\n\n          DAMIEN ,. _.\n          (starting to lose it)\n          Todd, it really isn't necessary for you\n          to,keep saying \"fact\" before everything.\n          It's kind of implied, that if you are\n          saying.it--\n\n          VOICE OF TODD\n          Alright.. I'm just.trying to keep the\n          emotion out of it, so I thought I would\n          say.\"fact\" before each fact, so it would\n          be less-upsetting -- I\n\n          VOICE OF WALTER\n          Ok, Damien, this is Walter, I'm just\n          gonna jump in.and bad-cop.it here for a\n          second. Dude, I mean, 46,000 dollars for\n          Chris Michael Speedman's masseuse's\n          miscellaneous living expenses? It sounds\n          like the inmates are running the asylum.\n\n          DAMIEN\n          Well, yes, that's exactly-it,.Walter if-\n          you actually came out here you would see\n          that .these actors are--\n\n          VOICE OF TODD\n          (loud out of'nowhere)\n          The actors didn't blow up the rainforest\n          and forget to turn on the camera Damien!\n          I have a lot of tolerance, but when. Lt\n          comes to nature I lose it!\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 23.\n\n          R\n\n          IN\n          â\u0096º VOICE OF TODD (cont'd)\n          I will not be called an eco-terrorist, do\n          you understand that?\n          Damien looks a bit bewildered by that. His hot young\n          assistant comes in with a cell phone.\n\n          11\n\n          HOT YOUNG ASSISTANT\n          Sorry.\n          (whispering to Damien)\n          It's Chris Michael, he says it's\n          important.\n          Damien, shaking now, steps out on to the balcony and\n          slides the glass door shut.\n\n          EXT. RUNDOWN BALCONY -- DAY\n\n          Though the hotel is a shambles, the view out on to the\n          bay is spectacular.\n\n          DAMIEN\n          (trying to seem calm)\n          Yes, Chris!?\n\n          EXT. SPEEDMAN'S PALATIAL BEACHFRONT ESTATE\n\n          In stark contrast to the hotel where everyone else is\n          living, Speedman is in what looks like an Asian\n          presidential palace overlooking the ocean.\n          SPEEDMAN is standing on the deck, trying hard to hold the,\n          phone with his hook hands. \"Simple Jack\" plays on a flat\n          screen inside.\n\n          SPEEDMAN\n          Hey, Dorf. Just wanted to call and throw\n          a little pep talk your way. I know today\n          was rough, and you're probably mad at\n          yourself for not getting the shots, but\n          that's the way these movies go. We all\n          boot it from time to time, and today was\n          just one of those days. Happens.\n\n          DAMIEN\n          (sickly sweet)\n          Yes it does. It does. Though I do think\n          you have to realize Chris, that you are\n          somewhat responsi--\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 24.\n\n          SPEEDMAN\n          Oh, also needed to let you know, and I.\n          .know you're like wrapped up with the\n          movie, but I really need that new chef\n          like we talked about, you know to really 4\n          get that super-ripped thing happening.\n          This guy is great but all he makes are\n          dumplings. And they stiill haven't worked\n          out the TiVo thing. III I. I I 4I\n\n          DAMIEN'\n          Right. well those things... those. 4,\n\n          4,\n          things ...I'm dealing with bigger issues\n          right now Chris --\n\n          SPEEDMAN\n          Yeah, of course, I just know we talked\n          about getting super-super-ripped for that\n          starvation sequence\n          Speedman's other line goes. He sees the caller I.D.\n\n          SPEEDMAN\n          Oh,, shit-- can you hang on a sec, D?\n          He switches over,, but it takes a few seconds with the\n          hooks.\n\n          SPEEDMAN\n          Rick?.\n\n          CUT TO:\n\n          INT. AGENCY OFFICE -- L.A. - DAY\n\n          RICK PECK, head of the Peck Agency, sits in his office,\n          overlooking. Los Angeles. He has a headset on.\n\n          PECK.\n          Guess what I'm staring at right now?\n\n          WE INTERCUT BETWEEN SPEEDMAN AND PECK\n\n          SPEEDMAN\n          What?\n\n          PECK\n          I'm looking at your ugly mug on the back\n          of Vanity Fair magazine in beautiful\n          living color with the two cute cuddly\n          pandas from cuteville. It's insane.\n\n          \n\n          \n\n          \n\n          \n\n          I\n          Tropic Thunder 25.\n          We see Pedk is holding a Vanity Fair with an ad on the\n          back: it is a picture of Speedman looking earnest,\n          holding two baby PANDAS. The caption reads:\n\n          \"PANDAS...THEIR SURVIVAL IS NOT SO BLACK AND WHITE\"\n\n          PECK\n          The credibility factor that the pandas\n          give you is priceless, and strangely, if'\n          you see this picture, what really strikes\n          me is the credibility that you give them.\n          I've been getting psychotic feedback all\n          day. Hey did you get the basket I sent?\n          WE SEE: A survival-themed gift basket in a camouflage\n          backpack, There's a satellite phone, camouflage\n          sunblock, etc.\n\n          SPEEDMAN\n          Yeah. Thanks.\n\n          PECK\n          You sad? What's wrong?\n\n          SPEEDMAN\n          No I'm fine. I've just been having a\n          tough time over here. They still havn't\n          got the TiVo hooked up and... I don't\n          know... Lazarus is getting all this Oscar\n          buzz already --\n\n          PECK\n          Is that what this is about? Crazy Kirk\n          Lazarus goes and places his entire body\n          in some experimental Malaysian dipping\n          sauce so he can actually be black, of\n          course he's gonna get buzz. Listen to\n          what I am telling you. He is clinically\n          mentally not right.\n\n          SPEEDMAN\n          Yeah but the way they talk about him. I\n          mean, he played a retarded guy and won an\n          Oscar, I play a retarded guy and don't\n          even get a nomination. I don't know, I\n          mean you said \"Simple Jack\" would be my\n          \"Elf\" but with Oscars. Those were your\n          exact words.\n\n          \n\n          \n\n          \n\n          \n\n          1\n          Tropic Thunder 26.\n\n          PECK\n          I don't believe those were my exact words\n          but let's get beyond that to the root of\n          this. Remember the moment you chose to do,\n          this', and I wanted you to do the ESP\n          robot thing with Wolfgang Petersen? And I\n          said stay home be happy and you said \"no,\n          Rick I need to play a real human being\"\n          and I said \"okay\" and then I said \"are\n          you sure?\" and you said that you needed\n          this-for your soul?\n\n          SPEEDMAN\n          Yes but --\n\n          PECK\n          Which I totally respected and now you're\n          doing the crazy surfer three..sixty move\n          on me,..which I love by the-way-- but-you\n          said fuck it, I gotta do it for my soul\n          And-that's why I hate you.. Because you\n          were RIGHT. And you're in. the Phuc Long\n          fucking Delta,. in the real mud, with-\n          leeches in your hair, 20,000 mil\n          es from\n          Fatburger.being an actor-And, I would\n          wager, forcing everyone around you to\n          rise to your level. Am I right? I mean\n          you are over there forcing a bunch of\n          PUSSY actors to gel, straighten up and.\n          become a platoon. And it hurts. Am I\n          right?\n          Speedman actually seems tohave bought-this\n\n          SPEEDMAN\n          Yeah. You are right.\n\n          PECK\n          Alright, that's what.I thought. Now get\n          to work genius soldier. I'll handle the\n          .TiVo.\n          Peck hangs up abruptly.\n\n          ON SPEEDMAN\n          Speedman punches the button on his cordless and puts. it\n          down. He ponders Rick's words as he gets caught up\n          watching the end scene of \"SIMPLE JACK\" on his TV.\n          He has forgotten Damien is on the other line.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 27.\n\n          EXT. RUNDOWN BALCONY -- DAY\n\n          Damien stands holding the phone, still on hold. Through\n          the glass, we see the entire crew waiting silently behind\n          him.\n\n          SPEEDMAN ON TV (O.S.)\n          (as Simple Jack)'\n          Shu-sure is a puh-puh-purty\n          sssssssunrise, uh-uh-uh-uh-ain't it?\n\n          DAMIEN\n          Chris? You there? Hello?\n          Finally, after a few moments of listening to this, Damien\n          explodes. He throws the phone on the ground and jumps up\n          and down on it. He notices the crew staring at him. He\n          tries to look as if that just didn't happen.\n          He opens the sliding glass, and heads straight to the\n          door. He continues walking through his office, out into\n          the main offices. He motions for his assistant to join\n          him.\n\n          VOICE OF TODD\n          Damien? This is not going to go away! I'm\n          going to be on my cell all day -- I'm\n          going to a funeral but I'm keeping it on.\n          That's Where we're at with this!\n\n          OUTSIDE OF DAMIEN'S OFFICE\n          He walks with purpose, followed by his assistant.\n\n          DAMIEN\n          Get everyone together! We are having a\n          cast meeting\" tonight! No choice! Everyone\n          must attend. I am putting my foot down!\n\n          HOT YOUNG ASSISTANT\n          Oh... I don't think I can do that,\n          Damien. Chris is having that \"End of\n          First Week\" party at his place tonight.\n          Everybody's going.\n          Damien's eyes twitch oddly.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 28.\n\n          EXT. SPEEDMAN'S PALATIAL BEACHFRONT ESTATE -- NIGHT\n\n          It is an APOCALYPSE NOW theme party. Vegas style. Tiki\n          torches,, buffets. PLAYBOY PLAYMATE DANCERS circa 1967 are\n          dancing on a deck in front of a banner that reads \"ONE\n          WEEK DOWN!\". The crew and cast are partying their asses\n          off.\n          i n ï¿½ï¿½ i nMï¿½'al\n          WAITERS, dressed like bald Marlon Brandos in full face\n          camo, serve hors d'oeuvres.\n          PORTNOY, not looking very sober, jumps up on the stage\n          with the dancers and starts doing a striptease.\n\n          ENTRANCE TO THE DECK\n          Damien walks in, watching this scene from Caligula going\n          down. He looks in a deep funk.\n          Portnoy STAGE DIVES straight onto the lawn, landing with\n          a thud in front of Damien.\n\n          DAMIEN,\n          Jeff. Jeff are you alright?.We.need to\n          talk -- as.a cast, as a platoon, right\n          now.\n\n          PORTNOY\n          (sick and drunk)\n          Dorfie-- did you happenito see that grip\n          withthe bandana?-The big guy?-I was\n          supposed to meet him here. He has a-\n          package of mine.\n          Kevin Sandusky (\"Brooklyn\" from the movie) comes up to\n          them, looking fresh faced and eager.\n\n          SANDUSKY.\n          Hey Mr. Dorfman. Jeff. You O.K? That was\n          some hit you took today.\n\n          PORTNOY\n\n          (BEAT)\n          Who are you?\n\n          SANDUSKY\n          I'm Kevin. Are you serious? Kevin\n          Sandusky? I'm playing Brooklyn?\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 29.\n\n          PORTNOY\n          Oh yeah. Right. Hey, have you seen that\n          grip with the bandana?\n\n          SANDUSKY\n          Uh, no. I think--\n          But Portnoy is off already looking for his drug\n          connection. They both watch him go.\n\n          SANDUSKY\n          Hey, Mr. Dorfman, I was hoping to find\n          you. I know this is a party, but this\n          afternoon after work I was breaking down\n          my M-16, and I have to say, in the night\n          watch scene, a minute and a half is a\n          pretty short amount of time to assemble\n          it.\n\n          DAMIEN\n\n          (TOUCHED)\n          You actually care, don't you?\n\n          SANDUSKY\n          Oh, yeah. Of course. This is a huge\n          opportunity. To be working with all these\n          great actors, and you.\n\n          DAMIEN\n          You're the only one who auditioned.\n          You're the only one who did the two week\n          boot camp, Sandusky.\n\n          SANDUSKY\n          Yeah, I know. It was kind of weird.\n          Wasn't the point that we were all\n          supposed to bond?\n\n          DAMIEN\n\n          (BITTERLY)\n          Yes, that was the point.\n          Damien, grabs a drink from a passing tray, and downs it.\n          We follow A WAITER as he passes Speedman with a tray of\n          food.\n          Speedman, ungracefully and with his hook hands, grabs a\n          spring roll off the tray. He resumes talking to LAZARUS\n          who is deeply uninterested.\n\n          \n\n          \n\n          \n\n          \n\n           I\n\n           I\n          r Tropic Thunder 30.\n\n          SPEEDMAN\n          I guess I just watched some retarded\n          people. I mean, I spent a lot. of time.\n          with them... watching them.. Watching all\n          the retarded stuff they did.\n\n          LAZARUS\n          Huh, I always found mere observation a\n          little rudimentary. Gotta dig deeper to\n          mine the true emotional,paydirt. Diagram\n          the source of the pain. Then live it.\n\n          SPEEDMAN\n          (trying. to keep up)\n          Exactly! With Jack. I was, for the\n          first time in-my life..\n          (searches for the word)\n          Retarded. I was retarded.in.the trailer,\n          retarded at home., Brushing my. teeth\n          retarded. In a `weird way I had to\n          unlearn what it was to be... .NOT\n          retarded.\n\n          LAZARUS\n          Yeah... but Simple Jack thought he was\n          smart. Or, rather, didn't think he was\n          retarded. So you can afford to play\n          retarded', being a smart actor. Tricky\n          tricky stuff. Hats off for going. there.\n          Especially.knowing how the Academy is\n          about that shit.\n          Speedman is lost:\n\n          SPEEDMAN\n          About what?\n\n          LAZARUS\n          (with 'a chuckle)\n          Are you serious? Everyone knows you\n          don't ever go fully retarded!\n\n          SPEEDMAN\n          How do you mean?\n          Lazarus sets his. drink down. School's in session.\n\n          LAZARUS\n          Check it out. Dustin Hoffman, Rain Man.\n          Looked retarded. Acted retarded. NOT\n          retarded. He could count toothpicks,\n          cheat at cards. Autistic. Sure. NOT\n          retarded. HANKS'. Forest Gump. Slow? Yes.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 31.\n          LAZARUS (cont'd)\n          Retarded? Maybe. Had braces on his legs,\n          he charmed the pants bff Nixon, and won a\n          ping-pong competition. Peter Sellers,\n          \"Being There\", infantile? Yes.\n          Retarded? No.\n          He claps a hand on Speedman's shoulder.\n\n          LAZARUS\n          You went full retard, man. You never go 14\n          full retard. Don't believe me? Ask Sean\n          Penn, 2001, I am Sam. Went full retard.\n          Went home empty handed.\n          Speedman sees this for the truth it is. How could he be\n          so stupid?\n\n          LAZARUS\n          (cruelly, driving it home)\n          But hey, man! Who knows? Four Leaf could\n          be your ticket to Oscar gold. I'd lose\n          the hook hands though... cripples don't\n          give the Academy wood either.\n\n          SPEEDMAN\n\n          (DAZED)\n          Oh.\n          Lazarus laughs and excuses himself by rattling his glass\n          and heading for the bar. Speedman stands hurt, delicately\n          holding the spring,roll in his hook.\n\n          ON THE OTHER SIDE,OF THE ROOM\n          Damien paces the party. He looks more miserable and high\n          strung than ever. He discovers Redykulous, surrounded by\n          his posse and a CAMERA CREW.\n\n          DAMIEN\n          Redykulous... I need to talk to you.\n\n          REDYKULOUS\n          What up, money.\n\n          DAMIEN\n          (in a hushed tone, aware of\n          the cameras)\n          We're having a cast meeting, right now\n          We need to come together as a unit --\n          The camera crew moves in for the close-up. . .making Damien\n          uncomfortable ... Redykulous takes it in stride. Throughout\n          the scene he is TEXT MESSAGING someone.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 32.\n\n          REDYKULOUS\n          Uh-huh...\n          Damien is made uncomfortable by the cameraman who has i\n          started manually zooming in and out on him in a dutch\n          style camera move...\n          DAMIEN i\n          Do you mind if we step away for a moment?\n\n          REDYKULOUS\n          From what?\n          Damien tries to indicate the crew.\n\n          DAMIEN\n          (whispering even lower now)\n          From the...uh...you know... .this area..\n\n          REDYKUL:OUS\n          Oh, I see...sure\n          They take a few steps away from the bar... The entire\n          camera crew follows.\n\n          DAMIEN\n          Oh. Hah! No, I mean away from the\n          cameras.\n           you understand?. Away from\n          (indicating the crew)\n          them...\n\n          REDYKULOUS\n          No.\n\n          DAMIEN\n          What?\n\n          REDYKULOUS\n          No. I can't do that. If Redykulous\n          steps away from the cameras then my\n          .people don't get to see the real\n          Redykulous. The show is called \"Utterly\n          Redykulous\".\n\n          DAMIEN\n          Well this is about work ...my show so to.\n          .speak. Do you understand?\n\n          REDYKULOUS\n          I guess. But not really. Your show and\n          my show are the same thing. This is gonna\n          help your show, trust me.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 33.\n          REDYKULOUS (cont'd)\n          My show AND the soundtrack drops the same\n          time \"Tropic Thunder opens. So you get\n          that crossover audience everybody wants\n          on your opening weekend, which will\n          dictate your revenue streams all the way\n          through DVD release, pay per view,\n          etcetera.\n          Damien thinks this over for a second. It does sort of\n           make sense. He then notices the chmera crew pushing in k I , 1 '144%\n          for a close up He awkwardly tries to get away from\n          them...\n\n          DAMIEN\n          Excuse me, everyone! If I could have\n          your attention!\n          Nothing. No one notices except Speedman. Damien grabs a\n          couple bottles off the bar and BANGS them together.\n\n          DAMIEN\n          Sorry to break up the party, but I just\n          wanted to call your attention to a cast\n          meeting tonight! Big meeting! Future of\n          the film depends on it!\n\n          (UNRAVELING)\n          Not to mention my entire bloody life!\n          Damien in a final cry of frustration, SMASHES a bottle on\n          the bar. He succeeds only in cutting his hand.\n\n          DAMIEN\n\n          GODFUCKITI SHIT!\n          Speedman comes up, placing a calming hook on Damien's\n          shoulder. He steps to the fore.\n\n          SPEEDMAN\n          (slowly, deliberately)\n          \"When... we.'.. put... aside... our...\n          differences... we see we're kind of the\n          same.\"\n          Within moments, the place settles completely.\n\n          SPEEDMAN\n          (Long beat...-then almost\n          quietly.)\n          \"When we put aside our differences, we\n          see we're kind of the same. Let's be\n          friends, I know we will do great things\n          together.\"\n          (beat, then more upbeat)\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 34.\n          SPEEDMAN (,cont'd)\n          That's a quote from my children's book,\n          \"The Boy Everybody-Was Jealous Of.\" I\n          know it's just a book for. kids, but I\n          think it applies to.making a movie as\n          well. 'Course... I know a lot of the\n          reason things are maybe messed up is ME.\n          The guys look at each other -- maybe he's not so bad.\n\n          SPEEDMAN\n          I was looking-at it all backwards. You\n          guys are lost. You heed.me to.lead you,\n          to help you gel, and straighten.up --\n          like a PLATOON!\n          A long beat.\n\n          PORTNOY\n          (drunk out of his mind)\n          Hey,. Speedman! That bullshit pep'talk\n          made me.H-h-h-h-h-happy!\n          The entire party cuts.up.in loud hysterics. Speedman\n          looks hurt. The DJ puts on-a Redykulous track really\n          loud, and the, place gets even crazier.\n\n          EXT. BEACH - LATER\n\n          Damien, drunk, walks along, illuminated by the light of\n          the moon. He holds' a bottle of wine, which.he chugs..In\n          the distance, the party rages.\n\n          FOUR LEAF-CO .. S . )\n          When a herd loses its way, the shepherd\n          must kill the bull that leads them\n          astray..\n          Damien turns around., startled. FOUR LEAF is standing\n          eerily in the bushes by the sand.\n\n          FOUR LEAF\n          You don't know which way is up, do you\n          private`? You couldn't find a dixie\n          coonskin with an Ohio hooker holding your\n          prick. and showin' you the way...\n          Damien doesn't know what the fuck that meant.\n          Four Leaf moves to him, staring deep into his eyes.\n          Damien's eyes widen in fear.\n\n          \n\n          \n\n          \n\n          \n\n          ,I\n\n          I\n          â\u0080\u009eTropic Thunder 35.\n\n          FOUR LEAF\n          A raindrop cannot carve a valley. An ant\n          cannot defeat a buffalo. But a tempest\n          can cleave that mountain to make the\n          valley, and an army of ants can fell the\n          mighty buffalo.\n\n          DAMIEN\n          (seeing the wisdom of this)\n          Yes...\n\n          FOUR LEAF\n          If the lion, although king of the jungle,\n          is thrown into the sea, he will\n          drown... but...if...\n\n          (PAUSE)\n          He...lives in the...water, for many\n          years, he will.. .grow gills ... . do you\n          understand?\n          (long pause)\n\n          DO YOU!?\n          He lunges at Damien and grabs him by the collar with both\n          hooks. '\n\n          DAMIEN\n          (near tears now)\n          I want to!!! But not really!!\n\n          (BEAT)\n          Someone's an ANT? Or something???\n\n          FOUR LEAF\n          I put my story in your limp Brit hands\n          and you will not fail me!!\n          (long pause)\n          My boys were worse pussies than these\n          guys. But the shit is what made us a\n          unit. A whole. You must put them in the\n\n          SHIT.\n          He releases Damien and takes a large draw on his\n          cigarette...\n\n          FOUR LEAF\n          There's a place. About a hundred clicks\n          from here, as the crow flies. Deep in the\n          jungle. No trailers, no port-a-potties.\n          Nothing but triple canopy jungle and\n          cockroaches the size of melons.\n          Damien seems intrigued yet a little freaked out by his\n          weirdness.\n\n          \n\n          \n\n          \n\n          \n\n          1\n          Tropic Thunder 36.\n\n          DAMIEN\n          And...?\n\n          FOUR LEAF\n          Rig up your documentary cameras'in that\n          jungle, give me and Cody a few of those\n          smoke bombs and some charges and we could\n          light up the jungle so those lily-dick\n          actors would think they were in the\n          middle of. Hamburger Hill. You.get them\n          thinking they're getting shot at, and\n          you'll have your movie.\n          Suddenly, Four Leaf slaps his neck with his hook as\n          though he has been bitten. He holds out a small squished\n          mosquito' between the claws of his prosthesis.\n\n          FOUR LEAF\n          You must put them.under your thumb the\n          way this. bug is under mine... .under YOUR\n          control.\n\n          DAMIEN\n          I see ...yes ...They would 'be under my\n          total control... finally. I could shoot\n          the whole movie there. Gritty. Dirty.\n          Away from their pampered pussy posses and\n          helpers...\n\n          FOUR LEAF\n          Yes... yes...\n\n          DAMIEN\n          Put them in the real shit. Film them\n          with real fear in their eyes. REAL FEAR!\n\n          .REAL EMOTION! YES! YES, FOUR LEAF, FUCK\n\n          YES!!\n          Damien and Four Leaf share a crazed look. COOL MUSIC UP\n          as WE PUSH IN and...\n\n          CUT TO:\n\n          EXT. JUNGLE - NIGHT\n\n          A CHOPPER skimming the treetops, illuminated by a lonely\n          moon...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 37.\n\n          IN THE CHOPPER\n          Cody is piloting. Damien and Four Leaf are in the back\n          sitting, across from Speedman, Portnoy, Redyk and Lazarus\n          and Sandusky.\n          We move across the faces of the actors, all in\n          brainbuckets, who all look confusted and unhappy, except\n          for Sandusky who seems excited.\n          Speedman clutches the camouflaged gift bag from his agent\n          Rick Peck.\n\n          PORTNOY\n\n          (FINALLY)\n          So, uh, any idea how long we'll be gone?\n          Because I left most of my... vitamins\n          back at the hotel.\n          The other actors chime in with similar concerns,\n          regarding sleeping arrangements, make up facilities,\n          etc... '\n\n          FOUR LEAF\n          Save your breath, maggots!\n          They all shrink back. Four Leaf's fierce posture is\n          undercut as the helicopter lurches, sending Damien\n          sprawling onto hire.\n\n          DAMIEN\n          That'sâ\u0080¢right. Maggots.\n\n          EXT. JUNGLE - DAWN\n\n          The chopper lands in a small clearing as the sun rises\n          behind a mountain.\n\n          IN THE CHOPPER\n          Damien and Four Leaf, in DI mode, hustle the \"grunts\" off\n          the chopper.\n\n          DAMIEN\n\n          GO!!!\n          Apparently they are not moving fast enough -- Four Leaf\n          and Damien shove the guys out of the chopper onto the\n          ground.\n\n          \n\n          \n\n          \n\n          \n          .Tropic Thunder 38.\n\n          FOUR LEAF\n\n          MOVE! MOVE! MOVE!\n          The group, scared shitless, start falling out of the\n          doors of the chopper, more like a bunch of oysters than a\n          crack platoon.\n          Four leaf jumps on the skid of thy chopper and motions to\n          Cody, who lifts off. It kicksï¿½up a violent backwash, 0, Iq y\n          forcing the guys to duck. and cover.\n\n          FOUR LEAF\n          See you in hell!\n          As the noise of the helicopter fades, the group starts.\n          trying to orient itself in their new surroundings.' The\n          Jungle. Black, dense, unforgiving.\n          All around them can be seen the remnants of a war that\n          has been over for thirty years. A grave marker,. half of\n          an old rusted outâ\u0080¢'downed chopper.\n          All are absorbing the spookiness, except Portnoy who\n          seems very upset.\n\n          PORTNOY\n          This is bullshit!\n          Damien marches over to him, and SLAPS HIM REPEATEDLY in\n          the face.\n\n          PORTNOY I\n          (clutching his cheeks)\n\n          OWW! FUCKIN' JESUS, DUDE!\n\n          DAMIEN\n\n          YOU'RE SITTING ON A NEST OF HOSTILE V.C.\n\n          ENEMY. CONGRATULATIONS FATS. YOU JUST GOT\n\n          US ALL KILLED! ANYBODY ELSE CARE TO GIVE\n\n          AWAY OUR POSITION TO CHARLIE!!\n          Silence.\n\n          DAMIEN\n\n          CELL PHONES!\n          Everyone hands over their phones.\n          Speedman, however, turns away from the group, getting his.\n          satellite phone out of the gift bag. He surreptitiously\n          stows it down the front of his pants.\n\n          \n\n          \n\n          \n\n          \n           ,. Tropic Thunder 39.\n\n          I\" â\u0096º\n          Damien dumps them in a pile and finds a large boulder. HE\n          smashes the phones with a draatic flair. The guys GROAN.\n          Damien turns on them with a crazy gleam in his eye.\n\n          DAMIEN\n          Okay, girls... now that I have your\n          attention, I will tell you fuckfaces what\n          we're doing here. You are no longer\n          actors in a movie. You,are grunts in a\n          war. These men around you are your\n          brothers.\n          The guys look at each other, unhappy.\n\n          DAMIEN\n          Congratulations. You've just landed in\n          \"the shit\". Your objective is to head\n          north and liberate the village at D'ang\n          Kwook Hill, at which point \"Four Leaf\"\n          gets himself captured, at which point you\n          rescue him, at which point we will\n          chopper you home. We will also be\n          rigging this entire valley of death with\n          hidden cameras so that every glorious\n          moment gets on film. And believe me it\n          WILL be glorious. If it looks real,\n          chances are good it probably is. You\n          wanted to be actors? You wanted to\n          occupy the skin of another human being?\n          Get ready to occupy the skin of a\n          terrified U.S. Infantry grunt, surrounded\n          by death, crawling up Satan's arsehole.\n          There's going to be enemy fire. Booby\n          traps. Your own personal little slice of\n          the 'Nam.\n          The group shares a look -- \"What's going on?\"\n          He pulls out a laminated packet.\n\n          DAMIEN\n          (to Spe?dman)\n          \"Four Leaf\", since you're the Captain\n          here, here's the scene list and the map.\n          (he throws them at him)\n          Think you can handle it? From now on,\n          Whatever we get on film is our movie,\n          period.\n          Damien pulls out a walkie-talkie.\n\n          \n\n          \n\n          \n\n          \n          .Tropic Thunder 40.\n\n          DAMIEN\n          THIS is your only link to, the real world.\n          It will be used only in an emergency or\n          to replenish our supplies if absolutely\n          necessary. This is NOT a cell phone.\n          This radio goes'to the chopper, and the\n          chopper ONLY. The chopper is GOD, and I\n          am Jesus Christ his SONI!! You will'\n          depend on and pray 'to US!! And nobody ï¿½iï¿½ï¿½ i n I' ï¿½IMdï¿½4\n          gets home until we get the shots!\n          (loud and confident)\n          Now... let's'put the greatest war movie\n          ever in the can!\n          With that, Damien marches toward the treeline and'steps\n          on a dormant LAND MINE left sleeping for decades., BLOWING'\n\n          HIM TO BITS.\n          The group stands absolutely stock still for several long\n          beats until...\n\n          SPEEDMAN\n          Whoa.\n\n          EXT. JUNGLE. -- A HALF MILE AWAY\n\n          A group of about SIX ASIAN GUERILLA FIGHTERS, well armed\n          and scary looking,,. notice the sound of the explosion.\n          They begin talking very seriously in a foreign language.\n          One of them grabs a radio:\n\n          GUERILLAS\n\n          (SUBTITLES)\n          \n\n          A UNKNOWN VOICE\n          (crackling over walkie\n          talkie),\n          .\n          They lock and load, heading towards the actors...\n\n          EXT. JUNGLE -- A.HILLTOP CLEARING\n\n          Four Leaf scans the horizon while. Cody sets up high-tech\n          equipment, including monitors and cameras and detonation\n          devices.\n\n          \n\n          \n\n          \n\n          \n\n          I\n          Tropic Thunder 41.\n\n          CODY\n          So, I'm thinkin' as soon as Damien gives\n          us the go ahead, we'ï¿½ust their cherry\n          with a few airbursts, then alpha-alpha\n          till they come running right at, us, then\n          a good of fashioned firefight,\n          maintaining our distance.\n          Four Leaf ignores him, instead looking around the jungle,\n          looking almost lost.\n\n          CODY\n          I been meaning to tell ya the whole\n          shoot. I'm probably one-a your biggest\n          fans. Your book was kinda my \"Catcher in\n          the Rye\". It inspired me to become a gyro\n          man.\n          Four Leaf gives Cody nothing -- except his usual stoic\n          stare.\n\n          CODY\n          I'm actually sort of a war nut. I mean I\n          never was in the service, but for me\n          blowing shit up in a war films is sort of\n          my way of paying tribute to the real\n          deal. And you sir, are the real deal.\n          Nothing.\n\n          CODY\n          Hey, I was wonderin' what kind of sidearm\n          you carry? Looks to me like a--\n\n          FOUR LEAF\n          (very scary)\n          I don't know what it's called. I just\n          know the sound it makes when it takes a\n          man's life.\n          Cody, a little spooked, picks up his radio.\n\n          CODY\n          Ok, we're ready to rock and roll.\n          (to walkie-talkie)\n          Damien, come in. Cameras are up,\n          ordinance are up. Ready to kick the tires\n          and light the fires on your say so.\n\n          \n\n          \n\n          \n\n          \n\n          11\n          Tropic Thunder 42.\n\n          EXT. JUNGLE - THE ACTORS\n\n          WE are close on the seemingly broken.walkie talkie,.which\n          has heard none of this. We PULL BACK to reveal the guys,\n          staring at Damien's corpse in total shock. All except\n          Speedman, who looks on with a smirk.\n\n          PORTNOY\n          I think he's like... dead.\n\n          SPEEDMAN:\n          (with a chuckle)\n          Nice, very nice, Dorf. . .Very nice,\n          wherever you're hiding!\n\n          REDYKULOUS\n          I don't think he's hiding.. I think he\n          just died!\n          Sandusky leans down towards the off screen corpse.\n          pulls a wrist into frame.\n\n          SANDUSKY\n          He doesn't. have a pulse ...or a head.\n          He then grabs a bent and rusty.piece of metal.\n\n          SANDUSKY\n          Must've been one of those Claymore mines.\n          This old Jungle must.be full of them.,\n\n          REDYKUZOUS\n          You bet your ass it is. That's why a\n          percentage of my Pymp Sweat Profits are\n          helpin' solve the problem!\n          Damien's corpse emits a disturbing death rattle.\n          Speedman busts up laughing. They turn to him -- what the\n          hell?\n          Speedman throws an-arm.around Sandusky, -like an indulgent\n          older brother.\n\n          SPEEDMAN\n          C'mon! Don't you get it? This is what\n          .Dorf was talking about -- our slice of\n          the Nam! He's trying to get in our\n          heads!\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 43.\n\n          GUERRILLAS P.O.V -- FROM THE SURROUNDING JUNGLE\n          They are right behind the treeline, watching the guys\n          from about thirty feet.\n\n          SPEEDMAN\n          That whole \"life and death\" speech in the\n          chopper? He's meshing 'with us! What do\n          you think all that \"playing God\" was\n          about?\n          The guys breathe a huge collective sigh of relief --\n          except Lazarus.\n\n          LAZARUS\n          Are you nuts, shithead? The dude is\n          dead!!\n          Sandusky looks unsure. He doesn't want to take sides.\n\n          SPEEDMAN\n          Kirk. I know you're the big fancy actor\n          here, but, no offense, I've done a lot\n          mote effects driven event films, and I\n          think I can spot a prop body.\n\n          ON THE GUERRILLAS\n          The LEAD guerilla signals for all his guys to hold their\n          fire and pick their targets...\n\n          ON THE ACTORS\n          Suddenly, The walkie-talkie lying on Damien's body\n          crackles to life:\n\n          CODY (ON WALKIE)\n          -- I repeat, we are now go for mission!\n\n          DAMIE--\n          The walkie crackles unintelligibly. Speedman picks it up,\n          showing it to the guys. See?\n\n          SPEEDMAN\n\n          (SMIRKING)\n          Alright, can we start the scene now? Or\n          do you need a formal invitation?!\n          (checking the list)\n          Scene 12A, ext. Jungle. Day. Ambush.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 44.\n          Speedman closes his eyes, taking a second to get into\n          character. He opens them, and grabs. his gun and creeps\n          towards the bushes, stealthily..\n\n          SPEEDMAN\n          (as Four Leaf)\n          I got a baaaad feeling on this one, Fats.\n          The group remains motionless., Speedman gives Portnoy a ,M in MAIM\n          \"c'mon!\" type look. Portnoy doesn't know what he means...\n\n          SPEEDMAN\n          I said, I got a baaad feeling on this\n          one, Brooklyn...\n          Oh! He's acting!\n          Sandusky hesitantly takes the cue, and starts walking.\n          stealthily around.with him, on high.alert.for Charlie.\n          Swinging his gun unpredictably.\n\n          ON THE GUERILLAS\n          They are a mere ten or fifteen feet from Sandusky on the\n          other side of the. trees... they back off as. he waves his\n          gun...\n\n          BACK ON THE ACTORS'\n\n          SANDUSKY\n          (-as Brooklyn)\n          Me too, cap'n.\n\n          (BEAT)\n          Hey, cap?: If.I told you something,\n          something kinda personal, you wouldn't\n          think I was crazy, right?\n\n          SPEEDMAN\n          Naw, man. I know you ain't crazy\n          Brooklyn...\n\n          SANDUSKY\n          Well,. if I told you that I, I never\n          actually, well, been with a girl...you\n          wouldn't, like, think I was, like, queer\n          .or nothin'... would you.?\n\n          SPEEDMAN\n          .Naw, man... I wouldn't think you was a\n          queer.\n\n          \n\n          \n\n          \n\n          \n\n          ,I\n           Tropic Thunder 45.\n\n          I\" â\u0096º\n          Redykulous shrugs and joins in, too:\n\n          REDYKULOUS\n          (acting really \"black guy\"\n\n          SCARED)\n          Sh...sh...shit ...When I get back to the\n          world, I'm gonna find me the finest piece\n          of Detroit nubian mugambo, and fuck it\n          till I broke its back.\n\n          PORTNOY\n          The last \"mugambo\" you ever tasted was in\n          your momma's soup bowl. I wouldn't mind\n          slurpin' on a little of that --\n\n          SPEEDMAN\n          That's enough outta you Fats. Don't you\n          worry, Brooklyn. You gotta lotta days a\n          fucking ahead of you and I for one ain't\n          gonna let Charlie...\n          Lazarus can't handle it anymore.\n\n          LAZARUS\n          What the FUCK is wrong with you people?!\n          Speedman shoots him a look then takes a few steps back.\n          He addresses the treeline.\n\n          SPEEDMAN\n          Sorry Damien! Back to one... action!\n          (he gets back in character)\n          Don't you worry, Brooklyn, You gotta\n\n          LOTTA--\n\n          LAZARUS\n          Yo, asshole! Mothafucka just DIED!\n          Speedman sighs, annoyed.\n\n          SPEEDMAN\n          How many more takes you wanna wreck? Some\n          of us are taking this seriously.\n          Lazarus looks likes he wants to explode. But instead he\n          becomes eerily calm. He begins an impressive\n          transformation -- Everything except for his skin color\n          returns to his real identity, a pompous Irish prick.\n\n          LAZARUS\n          (Heavy Irish)\n          Jaysus! There isn't going to be any\n          movie, ya gobshite!\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 46.\n          LAZARUS (cont'd)\n          Damien is dead, Speedman. Yes,_the show\n          must go on, but this is feckin' madness.\n\n          PORTNOY\n          (re: Lazarus transformation) i\n          Wow. That was really cool.\n\n          THE GUERILLAS\n          Are watching this, poised to attack.\n\n          BACK ON THE ACTORS\n          Speedman and Lazarus argue, more heated now.\n\n          SPEEDMAN\n          Excuse me Kirk, I think you dropped\n          something.\n          He mimes picking something , off, the ground.\n\n          SPEEDMAN\n          It's called your character. Don't worry,\n          I won't tell the Academy!\n          Suddenly: GUNFIRE FROM EVERYWHERE! The Guerrillas have\n          seized the moment.\n          The actors all immediately hit the dirt, except for\n          Speedman,.who just looks annoyed and blase as dirt and\n          debris kicks up all around him.\n\n          SPEEDMAN\n          You happy now? We're out of position for\n          the effect! Am I the only one who read\n          .the script?! This is the ambush!\n          A tree aboveSpeedman gets hit, explodes, sprays chunks\n          of wood and shrapnel everywhere.\n\n          SANDUSKY\n          I think they're really shooting at us!\n\n          SPEEDMAN\n          What are you guys worried about? These\n          guys are pros. The unions would tear\n          them a new ass-if any of us got hurt.\n          The actors stay down, looking scared.\n\n          SPEEDMAN\n          Come on, you guys! Let's use this!\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 47.\n          No one follows Speedman's lead., Fine, he'll go it alone.\n          Speedman begins shooting at the guerillas alone, and\n          doing a very good job of it, going through an assortment\n          of absurd action style maneuvers throughout.\n          Redykulous looks around, and then decides to get up and\n          join him. Sandusky and Portnoy look at each other -- what\n          the heck -- and follow. They all fire at the unseen\n          enemy, letting out very convincing WAR CRIES.\n\n          ON THE GUERRILLAS\n          Not knowing it's only blanks, and awed by the power of\n          the actors' automatic weapons, and the intensity of their\n          screams, they drop back...\n\n          GUERILLA LEADER\n          \n          The guerillas hastily go through their packs hooking up\n          RPGs...\n\n          EXT. JUNGLE - HILLTOP CLEARING\n\n          Four Leaf looks out into the jungle below, he can hear\n          the firefight, but, Cody can't.\n\n          FOUR LEAF\n          Hear that?\n          Cody is preoccupied with the radio and the explosives.\n\n          CODY\n          What? I still can't get Damien on the\n          radio. I bet he forgot how to use the\n          Walkie again. What do you say we get a\n          little... pro-active?\n          Cody, very excited, grabs a plunger.\n\n          BACK ON THE ACTORS\n          Still fighting, oblivious that the guerillas are about to\n          blow them to kingdom come with RPGs.\n          But before the guerillas have a chance--\n\n          \n\n          \n\n          \n\n          \n\n          I\n          t' Tropic Thunder 48.\n\n          ON CODY\n          He pushes down the plunger...\n\n          ON THE GUERILLAS\n\n          BOOM! BOOM! BOOM!!\n          Dirt flies, the guerillas don't know what the hell is\n          going on =- except that someone is suddenly bombing the\n          shit out of them. They beat a hasty retreat.\n\n          EXT. JUNGLE HILLTOP CLEARING\n\n          Cody and Four Leaf watch Cody's handiwork with\n          binoculars. A smoke cloud slowly rises from the jungle.\n\n          CODY\n          Right on!! I bet Damien heard that!.\n          Cody turns to Four Leaf, and finds himself staring\n          straight at 10 GUERILLA FIGHTERS with their submachine\n          guns pointed straight at them.\n\n          CODY\n          Oh shit.\n\n          FOUR LEAF\n          Oh yeah.\n          And with that Cody and Four Leaf are.RIFLE BUTTED out of\n          consciousness...\n\n          EXT. JUNGLE -- THE ACTORS\n\n          Speedman motions for everyone to \"cease fire\".\n\n          SPEEDMAN\n\n          (PUMPED)\n          Aaaaand... CUT! Jesus!. Alright! That's\n          the trailer 'right there!\n\n          REDYKULOUS\n          That was some sick shit! I wasn't even\n          thinking bout the camera!\n          The guys' adrenaline is flowing, they do high fives all\n          around. Lazarus is not happy. He looks off into the\n          jungle, sensing that someone was out there.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 49.\n\n          SANDUSKY'\n          So what do we do now?\n          Speedman pulls out the map, frowns at it.\n\n          SPEEDMAN\n          Damien said to head north. I'm guessing\n          they've got more of these \"battles\" and\n          Viet Congs rigged for uls on the way.\n          (into it)\n          Alright, let's hump-our shit to D'ang\n          Kwook! Let's didi double time! We got a\n          lot of clicks to cover!\n          Speedman heads off into a particularly dense section of\n          jungle. After a beat, he reappears, looking a little\n          lost.\n\n          SANDUSKY\n          Uh...Sir, isn't it that way?\n          Kevin points in the other direction. Speedman glances\n          down at the map, which he rotates around, right side up\n          now.\n\n          SPEEDMAN\n          Oh yeah. Thanks, uh...\n\n          SANDUSKY\n          (can't believe it)\n          Kevin. Kevin Sandusky.\n\n          SPEEDMAN\n          Right. Okay, To D'ang Kwook! Lets do-it-\n          to-it!\n          Everyone follows Speedman. Lazarus, very reluctantly,\n          brings up the rear, still looking off into the jungle. A\n\n          EXT. FLAMING DRAGON COMPOUND - ESTABLISHING\n\n          It is a large, secret heroin processing facility,\n          surrounded by barbed wire fencing. It is in a clearing\n          in the jungle, by a small river.\n          There's a GUARD TOWER overlooking a main gate, which\n          leads into a big open courtyard area. The main structure\n          is a low, concrete military-looking building.\n          It's all populated with tough-looking, well-armed\n          badasses.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 50.\n          CODY AND FOUR LEAF, both hog-tied and unconscious, are\n          marched through the courtyard, and into a building.\n\n          INT. FLAMING DRAGON COMPOUND - COMMAND CENTER\n\n          We are behind the back of the person who is in charge. In\n          front of him, we see workers busily manufacturing tar\n          heroin, in a sweatshop like atmosphere.\n          A cadre of guerilla fighters domes in, sweaty and tired.\n          The Lieutenant steps to the fore -- this is BYONG. He's\n          badly shaken.\n\n          BYONG\n          \n          The Unseen Leader shakes. his head.\n\n          UNSEEN LEADER\n          .\n\n          BYONG\n          \n\n          UNSEEN LEADER.\n          .\n\n          EXT. BAMBOO FOREST -- DAY\n\n          The actors are slogging along, through a tall thicket of\n          bamboo. They look exhausted -- except for Speedman, who\n          always manages to look like.a.movie star.\n\n          PORTNOY\n          So... we're just supposed to keep\n          walking?\n\n          SPEEDMAN\n          We'll see some action soon enough. And\n          try to stay in character. We're on\n          camera..\n\n          PORTNOY\n          What do you mean \"soon\"?\n\n          \n\n          \n\n          \n\n          \n\n          ,I\n          Tropic Thunder 51.\n\n          SPEEDMAN\n          Whenever Damien decides it's time, I\n          guess.\n\n          PORTNOY\n          When's that?\n\n          SPEEDMAN\n          I don't know. That's the whole point.\n          Damien wants us tired and confused.\n\n          REDYKULOUS\n          Yeah, well I'm definitely qualifying for\n          those objectives.\n          Everyone chimes in -- they all need a break. Lazarus\n          notices the mutinous vibe and smiles.\n\n          SPEEDMAN\n          Fine, fine. Okay, let's take a break,\n          but be on the lookout for anything.\n          Charlie doesn't care if you're on a break\n          or not.\n          Speedman plunks down and opens the map. He seems puzzled.\n          Lazarus eyes him suspiciously. Sandusky walks off to take\n          a leak. Lazarus then watches him go.\n          Off to the side, Sandusky starts to pee. He hears\n          something rustle next to him.\n\n          LAZARUS (O.S.)\n          Psst. Hey.\n          Sandusky turns to see Lazarus peeing uncomfortably close\n          to him.\n\n          LAZARUS\n          Speedman is watching. I don't have much\n          time. I don't really need to piss. I\n          need to talk to you. You went to the\n          boot camp Sandusky, right? You can read\n          that map?\n\n          SANDUSKY\n          Yeah...\n\n          LAZARUS\n          Good, good. Speedman is a tosser. That\n          hoor's melt really thinks this is a\n          movie. And he's got the lot of ya\n          convinced.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 52.\n\n          SANDUSKY\n          You saying you don'tithink they're\n          filming us?\n\n          I\n\n          LAZARUS\n          Of course not! It's only a matter of\n          time before he walks us into more mines\n          or more of whoever the hell was shootin',\n          at us. That muppet's going to get us all\n          killed. I need to convince everyone.to\n          turn around, but I .can't do it without\n          the map. You're the only one who can\n          read it. Can I count on you?\n\n          SANDUSKY\n          Well, yeah, I.guess. But\n\n          LAZARUS\n          Good man, Good man.\n          Lazarus makesa big show of pretending he's done peeing,\n          shaking, etc.., and heads back to the group.\n          Speedman eyes Lazarus. What is he up to?\n          Sandusky is just getting comfortable, begins to pee\n          again. He hears another rustle. He turns.to see\n          Speedman, right next to him.\n\n          SPEEDMAN\n          I'm gonna level with you, bro. I don't\n          need to pee. I need to talk to you.\n          Speedman surreptitiously takes out a can of Pymp Sweat\n          and sticks the tip of his Bowie knife into it, to create\n          a red pee.stream.\n\n          SPEEDMAN\n          Lazarus is insane. He's freaking out, and.\n          he's gonna.ruin the whole movie for all\n          of us. The men respect you, because you\n          went to boot camp and rehearsal.\n          (patting his shoulder)\n          And you're pretty handy with that map. I\n          need you on my side, Kyle.\n\n          SANDUSKY\n          Kevin.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 53.\n\n          SPEEDMAN-\n          If you stick with the program, I'm gonna\n          talk to some of the Dreamworks\n          brass... there'll probably be a Teen\n          Choice award in it for you. You have\n          that potential.\n\n          SANDUSKY\n          Well, I --\n\n          SPEEDMAN\n          Good man. Good man.\n          Speedman rejoins the group, gives Lazarus a cocky look.\n\n          EXT. JUNGLE - ELSEWHERE - LATER\n\n          The guys continue to trudge along a hugely overgrown\n          path. Speedman machetes through the overgrowth.\n\n          SPEEDMAN\n          If we stay on this trajectory we should\n          be reaching the village any minute now.\n          At the end of the line, we hear a few groans emanating\n          from Portnoy.\n\n          SPEEDMAN\n          Buck up,, Fats ...we got a long road ahead\n          of us...\n\n          PORTNOY\n\n          (SICK)\n          No... its just that I don't feel so hot...\n          I left my medication at the hotel.\n\n          REDYKULOUS\n          (to himself, snickering)\n          Yeah, I'd like to check out some of those\n          \"meds\" for my own self.\n          Lazarus moves up to Speedman.\n\n          LAZARUS\n          Look, ya eejit, I mean, if there was a\n          village don't you think we would have hit\n          it by now?\n\n          SPEEDMAN\n          Quit your carping, we're right where\n          we're supposed to be!\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 54.\n          WHUMP! All of a sudden Speedman disappears out of\n          frame...\n          We see he has fallen chest deep into the edge of a SLOW\n\n          MOVING RIVER.\n\n          LAZARUS\n          .(laughing)\n          Hey, Is there a feckin' river on that\n          map?\n          S.pee`dman refers to the'now sopping wet map.\n\n          SPEEDMAN\n          Yes! There is! Its just a little more'\n          down to the... lefty-down part from the:\n          village.\n          (checking the scene list)\n          Anyway,. this feels like the Sampan, Boat\n          Raid at the end of the second act.\n\n          LAZARUS\n          I don't see a \"Sampan\" boat!\n\n          SPEEDMAN\n          Any second now one should come by.\n          Alright men, into the water!\n          Everyone'except Lazarus reluctantly gets into the water.\n          They all hold their rifles above their heads.\n\n          LAZARUS I\n          - L-et-'-s-stop this-char-ade-,sha-l-l-we? We\n          need to quit faffin' about and turn.\n          around NOW! And...\n          Lazarus grabs Sandusky.\n\n          LAZARUS\n          Sandusky agrees. with me. Don't you,\n          Sandusky?\n          Kevin is caught, not sure what to d\n\n          SPEEDMAN\n          Wait! First of all...\n          Now Speedman grabs him.\n\n          SPEEDMAN\n          Kelvin believes in this movie. And,\n          second, need I remind you,. I am your\n          superior officer.\n\n          \n\n          \n\n          \n\n          \n          ,. Tropic Thunder 55.\n\n          PÂ\u0096º\n\n          LAZARUS\n          No, yer an actor. Arid if memory serves,\n          a pretty shite one.\n          The actors react -- Damn! Oh Snap! Shit! Speedman steels'\n          himself.\n\n          SPEEDMAN\n          THAT'S THE WAY OUT! That's our only\n          chance!\n\n          PORTNOY\n          Yeah, but maybe we should stay here until\n          they send help! Or maybe try to get back\n          to the hotel.\n\n          SPEEDMAN\n          Help from where! Need I remind you that\n          Damien's orders were to --\n          (right at Lazarus)\n          --stay in character.\n          (to the guys)\n          Now, I already have an international box\n          office presence, but for some of you, I'm\n          guessing you might not want to screw this\n          movie up!\n          This actually seems to affect the actors. Lazarus can't\n          believe it.\n\n          SPEEDMAN\n          .okay...C'mon, boys! This way. Let's go\n          get those Viet Congs!\n          Lazarus throws down his gun. He's had it.\n\n          LAZARUS\n          Jay-sus Fuck! It's Viet Cona! Not Viet\n          Congs! Viet Cong, you plunker! And, hey,\n          if you're so sure of yourself, why don't\n          you let Kelvin have a look at the map?!\n          Kevin doesn't know what to do -- he doesn't want to get\n          in the middle of this. Speedman continues to be the tough\n          guy.\n\n          SPEEDMAN\n          Be my guest.\n          Speedman hands over the soggy map. Kevin looks. After a\n          long beat...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 56.\n\n          SANDUSKY\n          We've been going the wrong way. 'We were\n          supposed to be doing this:\n          Sandusky traces his finger along the correct route -- a\n          clearly marked, northward arrow.\n\n          SANDUSKY\n          instead, we did this. i I ï¿½1d Iv I. 11M%\n          Sandusky draws a line due East --..into a. section of the.\n          map clearly marked with scary skull and cross-bone type 14 %\n          warnings.\n\n          PORTNOY\n          (holding his stomach)\n          Oh, man, this is not' cool, this is not\n          cool at all.\n          Speedman grabs the map back from Sandusky.\n\n          SPEEDMAN\n          I can't believe you people!. You're\n          pussing out on me? We are supposed to be\n          a unit!\n\n          LAZARUS\n          No one is \"pussing out.\" They just\n          prefer not. to die.out here. Sandusky, can\n          you get'us back to the landing zone\n          without the map?\n\n          SANDUSKY\n          It might be tricky, but maybe.\n\n          LAZARUS\n          Okay, which is it, gentlemen? Playin' war\n          with Mister Box Office? Or staying\n          alive? \n\n          SPEEDMAN\n          Unbelievable!. Are you guys really gonna\n          abandon this movie?\n          A long tense. beat -- finally, Sandusky walks towards\n          Lazarus. Everyone follows him.\n          Speedman looks stunned. After a moment, he shakes his\n          head and begins crossing the river, holding his rifle\n          with both hands over his head.\n\n          \n\n          \n\n          \n\n          \n          ,. Tropic Thunder 57.\n\n          SPEEDMAN\n          So that's the way it,,is, huh? Fine! I'll\n          finish the movie alone!\n          (turns to Lazarus, under his\n\n          BREATH)\n          And when I give my acceptance speech,\n          I'll be sure to thank you, Lazarus, for\n          staying out of that scene. And come Oscar\n          night, we'll see who feels a little \"full\n          retard\"!\n          He reaches the other side of the river.\n\n          SANDUSKY\n          Chris, You have no idea where you're\n          going!\n\n          SPEEDMAN\n          Yeah, I do!\n          (consulting the scene list)\n          I'm going to \"EX'S. JUNGLE. DUSK. FOUR\n          LEAF PINNED DOWN AND ALONE\". And, I can\n          shoot it alone.\n          They'watch him trudge into the foliage.\n          U2'S \"BULLET THE BLUE SKY\" comes up as the men watch\n          Speedman disappear...\n\n          EXT. MOUNTAINOUS JUNGLE -- SUPER WIDE -- DUSK\n\n          We slowly push in on a lone figure silhouetted against\n          the purple sky, trudging along the top of a trail to\n          nowhere.\n\n          CLOSER\n          Speedman walks through the scary jungle, exhausted. He is\n          tired, lonely and hungry. The jungle is making all sorts\n          of terrifying noises. Finally he stops and regards the\n          treeline.\n\n          SPEEDMAN\n          DORF!...CODY?!...What's the deal with a\n          meal break? Are they gonna chopper stuff\n          in later on? I don't wanna be a prima\n          donna or anything, but, we gotta eat,\n          right?\n\n          (PAUSE)\n          Damien?\n\n          \n\n          \n\n          \n\n          \n          P- 'Tropic Thunder 58.\n          Clearly no answer.\n          He trudges a bit further finally 'plunking down.by the\n          trunk of a huge tree. ,\n          He empties his pack, within which is the gift bag.from\n          his.agent. He 'surveys his wares: An i-pod. Nano, an In\n          Style magazine, a neck pillow, Cherry Chapstick, a,\n          tonight--show baseball hat, some packets of equal, and an\n          unopened \"MRS. HENDERSON PRESENTS' DVD.\n\n          EXT. JUNGLE -,DUSK\n\n          Our Guys, led by Lazarus, are humping through a dense\n          section of jungle. Portnoy is beginning to make all\n          sorts of pained and horrible noises.\n\n          PORTNOY\n          Uhhh... .UHHHHHHHH.\n\n          (PAUSE)\n          Ohhhhh-Maaaaaaannn...I'm cold. It's\n\n          FREEEZING..\n\n          REDYKULOUS\n\n          WOULD YOU PAH-LEEZE.SHUT THE FUCK UP!-\n\n          PORTNOY\n          (after a beat)\n          Ohhh GOD! Is'anybody BOILING!? It's like\n          a sweat lodge out here!\n\n          LAZARUS\n          Make a note gentlemen,. unwittingly,\n          Jeffrey Portnoy is joining the proud\n          ranks of those of us who have suffered\n          for art.\n          (to Portnoy)\n          A new frontier for you, Funny Man. When\n          this is all over, you might have more\n          than flatulence to offer an audience.\n          Portnoy looks a little hurt.\n\n          REDYKULOUS\n          You know what? I think I actually liked\n          you better when you were a nigga.\n\n          LAZARUS\n          You know, Redykulous', I respect what it\n          is you do, the rapping, the rhyme-talking\n          -- invented by the Irish I might add.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 59.\n          LAZARUS (cont'd)\n          Yet you ooze this hostility towards me.\n          Why do you think that-is?\n\n          REDYKULOUS\n          \"Why\"?! I dunno...maybe because they had\n          one good part for a black man in this\n          movie and they gave it to a white guy.\n\n          LAZARUS\n          Oh...I see...Put another way -- you're\n          mad because I can act \"black\" better than\n          you can.\n\n          SANDUSKY\n          Take it easy guys...\n\n          REDYKULOUS\n          (to Sandusky)\n          You better rein in 'black like me' over\n          here, before I put a foot in his white\n          ass...\n\n          LAZARUS\n          Niggaz always got to be niggaz.\n          This is truly over the line. Redykulous lunges at\n          Lazarus. They fight.\n          Redykulous throws a wide punch, that Lazarus deftly\n          avoids, that hooks Portnoy right in the jaw.\n          Sandusky jumps in and pries them apart.\n\n          SANDUSKY\n          Okay! That's enough! Jesus Christ! It's\n          not enough we have people shooting at us!\n          Now we have to kill each other?! Let's\n          pull it together! This place is full of\n          land mines! Or doesn't anyone's sense\n          memory recall our director being blown\n          up by onel?\n          That shut them up.\n\n          LAZARUS\n          Sandusky is right... we could all learn a\n          little from his common sense approach.\n          From now on we walk Indian style,\n          footstep upon footstep. Sandusky. . .you\n          take first position.\n          He breaks off a branch, and hands it to Sandusky, and\n          pushes him out front. Sandusky gives him a look.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 60.\n\n          LAZARUS\n          Your bravery shames us.\n          Sandusky reluctantly starts down the path, tapping for\n          land mines with the branch. The guys follow at a VERY\n          safe distance.\n          EXT. JUNGLE - NIGHT AM l u I, I nhy\n          CLOSE. ON Speedman's face. After a beat.a drop of water\n          hits him in the.forehead. Then another.\n          PULL BACK to reveal a pathetic shelter made. out of\n          headphone. wire, and the In Style magazine.' The drip-is\n          now becoming full on RAIN.\n          He clutches an Equal packet and. the Cherry Chapstick.\n          Gently, he puts the chapstick-to his face and takes a\n          tentative bite, as though he were eating human flesh. He\n          then tears open the Equal packet and empties its contents\n          into his hand,.and takes. a lick, savoring every granule.\n          He hears a rustling in the bushes across from him. A\n          rodent? Food? Excited, he pulls out his Bowie knife and\n          begins to stalk his prey.\n          Now another movement behind.the bush, and a flash of.\n          fur...\n          Stealthily, he moves towards it. With cat like quickness,\n          and knife drawn, he lunges onto the bush, A HUGE ROAR is\n          heard...\n\n          QUICK SHOTS OF: FANGS, BLOOD, AN EYEBALL, A HUGE PAW...\n          Speedman is slashed, SOMETHING has got him in a choke\n          hold...\n          He reels around screaming.and stabbing wildly, brutally\n          pummeling his attacker. He is. covered in blood, but\n          looks ecstatic.\n\n          SPEEDMAN\n          Die! Die, you son of a bitch! Die!\n          Speedman deals a death blow. And unleashes a primal\n          VICTORY SCREAM. Spent, he finally gets a good look at\n          his victim:\n          A.small, cute, cuddly PANDA...\n          Speedman looks horrified...\n\n          \n\n          \n\n          \n\n          \n          ,i\n           ,Tropic Thunder 61.\n\n          I\" 1\n          FLASH on a SERIES OF STILLS from SPEEDMAN'S PANDA PHOTO\n\n          SHOOT...\n          He stumbles back against a tree.\n          Suddenly we hear an odd VIBRATING SOUND. He jumps, and -\n          frantically jams his hands in his pants it is the\n          forgotten satellite phone he hid there way back when.\n\n          CLOSE ON PHONE -- CALLER ID SAYS \"RICK PECK\"\n          Speedman answers...\n\n          INT. AGENCY OFFICE -- L.A. --DAY\n\n          Rick is on a Pilates machine in is office with a HOT\n          PILATES INSTRUCTOR working him out.\n\n          RICK\n          I got the personal attache of Bien Den\n          Phu's ambassador to the United Nations of\n          America delivering a TiVo directly to\n          your bedroom. But the bad news is you\n          gotta sit down and have monkey brains\n          with him or some ceremonial shit for the\n          local paper.\n\n          WE INTERCUT BETWEEN THEM\n\n          SPEEDMAN\n\n          (FREAKED)\n          I killed one rick. The thing I love more\n          than anything in the world...\n\n          RICK\n          A hooker? You killed a hooker? Calm\n          down, it's fine. This is a no-brainer.\n          Thank GOD you're out of the country.\n\n          SPEEDMAN\n          No! A Panda! I killed a panda!\n\n          RICK\n          You WHAT? Uhy. Heavy shit National Park.\n          Oh jeesus...take a breath.. .did anybody\n          see you?\n\n          SPEEDMAN\n\n          YOU HAVE TO HELP ME RICK!\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 62.\n\n          RICK\n          Chill zone, buddy, 1im thinking. Did\n          anyone see you do this?\n\n          I\n\n          SPEEDMAN\n          I don't think so. I'm out in.the bush.\n          Alone.\n\n          RICK\n          Alright. Listen to me. I want.you to.get\n          your hands on some-bleach, some hydrogen\n          peroxide and some lime. Your gonna wanna\n          cut the body in quarters ... the femurs are\n          gonna be a bitch... that's normal...\n          Speedman'nods eagerly, absorbing it all, not noticing a\n\n          PIANO. WIRE BEING SLIPPED AROUND HIS NECK...\n          Suddenly, he'is being choked.-He drops the phone, gasping\n          for.air...\n\n          RICK (O.S.)\n          Chris? Breathe.! It's gonna be ok.. I'm\n          calling that publicist right now, the one\n          J Lo hired when she was'hammered and\n          killed that kid with her Jetski.\n          A guerilla shoots the phone. They quickly tie Speedman.up\n          and whisk him'off into the jungle.\n\n          EXT. FLAMING DRAGON COMPOUND -- DAWN\n\n          Speedman is being led through the courtyard in:shackles.\n          He looks up to the guard towers.\n          There are security cameras everywhere. In Speedman''s\n          mind, movie cameras. He nods, into it.\n\n          SPEEDMAN\n          (under his breath)\n          Alright. P.O.W camp. Scene 67..Bring it\n          on Dorf.\n\n          INT. CODY AND FOUR LEAF'S DETENTION HUT\n\n          Cody is just coming to. Four Leaf is already at the\n          slatted window, watching...\n\n          CODY\n          Where are we?\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 63.\n\n          FOUR LEAF\n          In a detention hut. And they got\n          Speedman...\n\n          FOUR LEAF'S P.O.V. --\n          A guard shoves Speedman hard with a rifle butt. Speedman\n          over \"acts\" the pain.\n\n          BACK ON CODY AND FOUR LEAF\n          Cody gets up, starting to freak out\n\n          CODY\n          What? Why? We gotta get outta here! Are\n          they gonna kill us?\n          Four Leaf turns on him, grabbing him with one of his\n          hooks.\n\n          FOUR LEAF\n          Pull it together private! Shut your trap\n          before you get us killed! You understand\n          me , lilydick? !\n          Cody backs off, still scared.\n\n          INT. INTERROGATION ROOM -- LATER\n\n          Speedman is in a windowless hut, his feet and hands tied\n          to a chair.\n          There are security cameras in the corners of the room,\n          which Speedman continually plays to.\n          Byong stands across from him, watching him calmly.\n\n          A\n\n          BYONG\n          What were you doing in our poppy fields?\n\n          SPEEDMAN\n\n          (CONFUSED)\n          Poppy fields?\n\n          BYONG\n          Who sent you here?\n\n          SPEEDMAN\n\n          (\"ACTING\")\n          Corporal Four Leaf Tayback...Serial\n          number 694529987.\n\n          \n\n          \n\n          \n\n          \n          'Tropic Thunder 64.\n\n          BYONG\n\n          (CALMLY)\n          Perhaps some hot tea will make conversing.\n          a little easier?\n\n          SPEEDMAN\n          You bastard.\n\n          BYONG\n          What? just thought you might like.\n          some...\n\n          SPEEDMAN\n          Corporal Four Leaf Tayback. And oh.\n          yeah. . .THIS is from my uncle... SAM!\n          He HEAD BUTTS Byong in the face,. sending him reeling into\n          the back wall.\n          Beat.\n\n          SPEEDMAN\n          (under his breath)\n          You.ok? You leaned into it, man.orry.\n\n          CUT TO:\n\n          EXT. BAMBOO CAGE --.DAY\n\n          A pissed off Byong and a couple of guards throw Speedman\n          into a small cage that is suspended by rope over the edge\n          of-a marsh.\n          He looks around, impressed with the production design. He\n          looks up,.sees another security camera observing him. He\n          turns it on.\n\n          SPEEDMAN\n          May God protect you from the mighty arm\n          of the 51st Tropic Thunder to the end! My\n          men will seek you out and mete. out a\n          cruel justice!-\n          Byong and the guards look at him, a bit confused.\n\n          CUT TO:\n\n          EXT. RICE PADDY -- DAY\n\n          Looking up we see a circle of faces. Our guys, looking\n          down on something awful.. . .that thing is:\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 65.\n          PORTNOY, delirious and groaningt\n\n          SANDUSKY\n          I think he's dead.\n          A wet fart seeps out of Portnoy.\n\n          REDYKULOUS\n          No. Just smells like hens dead. Smelled\n\n          44M\n          like that all night.\n\n          LAZARUS\n          What's wrong with him?\n\n          PORTNOY\n\n          (LYING)\n          Nothing! Probably just the beginning\n          stages of some ... . kinda...jungle fever.\n          More bad noises.\n\n          PORTNOY\n          If we can work out some rig to carry mï¿½? I\n          think it might subside in a little bit...\n          No one touches him.\n\n          LAZARUS\n          Alright. Sandusky?\n          Sandusky looks up at him. Is he serious?\n\n          SANDUSKY\n          What?\n\n          LAZARUS\n          You and Redykulous are gonna have to\n          carry Portnoy. God help you.\n          He marches off.\n\n          SANDUSKY\n          God help me?\n\n          REDYKULOUS\n          God help him that bitch ever find his\n          blackface minstrel show ass alone with me\n          in the real world.\n          Redykulous and Sandusky shake their heads and gather up\n          Portnoy on a make shift stretcher.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 66.\n\n          EXT. HILLTOP\n\n          Our guys are humping, with Fats in the makeshift\n          stretcher.\n          They look exhausted. As they crest. the ridge, Redykulous\n          spots something.\n          ''I , I n n4ï¿½N11\n\n          REDYKULOUS\n          Look!\n          From behind, Sandusky grabs him and forces him to the\n          ground.\n\n          SANDUSKY\n          SHH! Everybody down!\n          The guys hit the dirt. Lazarus crawls up to join them.\n          He pulls out his binoculars, and surveys the scene.\n\n          I\n\n          BINOCULAR POV\n          It is the Flaming Dragon compound...\n\n          ON THE GUYS\n\n          \" LAZARUS\n          Fook me! I knew it!\n\n          -SANDUSKY\n          Knew what?\n\n          LAZARUS\n          \"EXT. P.O.W. PRISON CAMP -- DAY\"! Oranges\n          and Lemons,,, the bells of St. Clements.\n          Speedman was right. We 'are shooting the\n          movie.\n          Sandusky grabs the binoculars and starts'looking...\n\n          LAZARUS\n          (to himself),\n          How could I be so stupid.\n\n          SANDUSKY\n          I don't think so... . looks to me like some\n          sort of heroin processing plant. Look at\n          the cooking vats, and the guards.\n          Sandusky continues looking through the binoculars.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 67.\n\n          LAZARUS\n          How do you know all,this?\n\n          SANDUSKY\n          It was a long trip. I read the in-flight\n          magazine. We're in the Golden Triangle,\n          the biggest drug producer in the world.\n          Uh-oh.\n\n          BINOCULAR POV\n          It is SPEEDMAN, who is being dipped in and out of the\n          water in his bamboo cage, while a bunch of guards stand\n          around and laugh. Whenever he comes up for air, he is\n\n          YELLING:\n\n          SPEEDMAN\n\n          CUT!1\n          (into the water, then out)\n\n          CUT1!\n\n          BACK TO 'SCENE\n\n          LAZARUS\n          What do you see?\n\n          SANDUSKY\n          It doesn't look good.\n          Lazarus grabs the binoculars.\n\n          LAZARUS\n          Sweet Mother of Jaysus.\n          Suddenly: GUNFIRE ERUPTS ALL AROUND!\n          A BAND OF GUERILLAS have spotted them and are running at\n          them, firing automatic weapons...\n          The guys scream, and start a frantic retreat down the\n          hill. Portnoy suddenly gets well enough to run out of his\n          stretcher for dear life...\n          In fact, he is actually beating them down the hill.. .when\n          suddenly WHUMP! He falls into a PIT!\n\n          PORTNOY\n\n          HELP! GUYS! WAIT!\n          REDYKULOUS stops and turns around and runs back to him,\n          heroically pulling him out. BUT...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 68.\n          There is more fire coming all around. He gives up,\n          reverses tactics, and starts KICKING PORTNOY IN THE\n          CHEST, trying to KICK HIM INTO THE HOLE !\n\n          11\n\n          PORTNOY\n          Ow! Fuck Dude! What the fuck?!\n          He screams in pain! Finally, WHUMP!! He disappears\n          into the'hole. REDYKULOUS whistles for the guys to join\n          him, and they all pile into the hole.\n\n          IN, THE HOLE\n          Totally black... . they huddle, trying to muffle their\n          heavy breathing...\n\n          ABOVE. THE HOLE\n          The guerillas all frantically look around for the guys.\n          No sign of them. One of them signals for them to keep\n          moving.\n\n          HOLE\n          Footsteps can be heard above leaving the area. Sandusky\n          lights a match. Portnoy is weeping in pain.\n\n          SANDUSKY\n          Must be one of those underground tunnels.\n          The-cou-ntr-y-is-l-itte-red-with them. Je-f-f\n          must have found one of the entrances,:.\n          Portnoy is on his side in pain, whimpering.\n\n          PORTNOY\n          My ass...I think I took one in the ass...\n\n          SANDUSKY\n          Lemme see...\n          Sandusky rolls him.over, and off camera, helps him remove\n          his pants... All the guys recoil in horror.\n\n          REDYKULOUS\n\n          AWW JEEESUS MAN!\n\n          SANDUSKY\n          How did it get infected so fast?\n          More ad libs of disgust...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 69.\n\n          SANDUSKY'\n          Okay Jeff...This is gonna hurt like hell,\n          but I have to take my finger and see how\n          deep the slug is, and if I can dig it\n          out. Take a breath. Redykulous, hold his\n          hand...\n          Beat... Sandusky puts his hand off camera.\n\n          I\n\n          PORTNOY\n          Hey Dude! What are you doing! Cut it\n          out! That's not the bullet hole. The\n          bullet hole is over here!\n          It dawns on the guys that they have NOT been looking at\n          the bullet hole. Ad-libs of even MORE disgust.\n\n          SANDUSKY\n          OH! my bad. You just got grazed. You're\n          gonna be fine.\n\n          EXT. BAMBOO CAGE -- DAY\n\n          Speedman is exhausted, slumped in his cage. He is covered\n          in a few leeches. Byong appears with his usual cadre of\n          guards. He nods, and they grab Speedman, and drag him\n          out of the cage.\n\n          EXT. FLAMING DRAGON HQ - COURTYARD\n\n          Byong leads Speedman to the center of the courtyard. A\n          HUSH falls over the soldiers.\n          They begin to part, as someone very important is\n          arriving.\n          Finally, the unseen leader emerges. He is a LITTLE BOY,\n          no older than 12 years old, but has the eyes of a killer.\n          He smokes a cigar. This is TRAN.\n          He stops in front of Speedman, staring him down. Then, in\n          a show of alpha male dominance, he tears his shirt off,\n          revealing an impressive set of gruesome tattoos -- a\n          flaming dragon raping a monkey, raping a skull, raping a\n          rat. He holds a stick.\n\n          SPEEDMAN\n\n          (WARILY)\n          Uhhh..I don't think I got the new\n          pages...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 70.\n\n          TRAN\n\n          YOU ARE A TRESPASSER IN MY POPPY FIELDS!\n\n          YOU ARE D.E.A. SCUM! WE HAVE SHOT DOWN\n\n          YOUR HELICOPTER, AND SOON WE WILL KILL\n\n          YOUR COMPATRIOTS!.\n          Tran points across the courtyard where...\n          A\"4 Iv I. InM y\n          CODY AND FOUR LEAF ARE MARCHED OUT. Cody looks scared out.\n          of his mind. Speedman takes this in.\n          Traci nods, and TWO GUARDS start to BEAT THE BEJEESUS out\n          of Cody and Four Leaf. Then Tran gets out his own stick\n          and starts to BEAT SPEEDMAN...\n\n          TRAN\n\n          DO YOU WANT THEM TO DIE? DO YOU WANT THEM\n\n          TO DIE!!\n\n          SPEEDMAN\n          No! Puh-Puh-pulease don't h-h-h-hurt\n          them... I\n          Tran cocks his head curiously. He stops beating him..He\n          signals.for the guards to stop beating the others. A long\n          beat.\n\n          TRAN\n          Say that. again.,\n\n          SPEEDMAN\n          Please don't hurt them?I\n\n          TRAN\n          No...like you did before!\n          Silence.\n\n          TRAN\n\n          SAY IT!\n          He threatens to hit him, Speedman recoils.\n\n          SPEEDMAN\n          Puh-puh-puhlease don't h-h-hurt them?\n          A hush falls over the crowd. Tran'seyes widen.\n\n          TRAN\n\n          NAYAM NOOK SNEP JAWK!\n          (louder, to the crowd)\n\n          NAYAM NOOK SNEP JAWK!!\n\n          \n\n          \n\n          \n\n          \n           Tropic Thunder 71.\n\n          IP 1\n\n          INT. TRAN'S QUARTERS -- DAY\n\n          Speedman is now seated in a comfortable, ornate chair,\n          though his feet and hands are still bound. Tran and\n          Byong and a few cohorts, stand across from him,\n          whispering.\n\n          TRAN'S ENTOURAGE\n          Nyam nook snep jawk...\n\n          SPEEDMAN\n          Please! Excuse me, What are you saying?\n\n          TRAN\n          Nyam nook snep Jawk!\n          (almost shyly)\n          You are Simple Jack?\n\n          SPEEDMAN\n          What? You.. You saw Simple Jack?\n\n          TRAN\n          We love the tale of this man, Simple\n          Jack.\n          Tran snaps his fingers, and an assistant shows Speedman a\n          battered VHS BOX OF SIMPLE JACK. Speedman looks lovingly\n          at it.\n\n          TRAN\n          We do not have many luxury here. Simple\n          Jack is the only movie we possess. We\n          have watched it many, many times. How is\n          the word? Genius?\n          Speedman smiles big. They smile back at him. It's a\n          small world after all.\n\n          BODYGUARD\n          (broken English)\n          You should have got Oscar.\n\n          SPEEDMAN\n          Thanks. I mean even just the\n          nomination...\n\n          TRAN\n          You were nominated?\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 72.\n\n          SPEEDMAN\n          No, I mean it is great to.be nominated,..\n          if you are, or that's what I hear.\n          Whatever. It's a popularity contest.\n          It's totally political, you have to lobby\n          for like a year for it...\n\n          TRAM\n          SHUT UP NOW. ilia i n nMd\n\n          (BEAT)\n          My apologies for almost.beating you to\n          death before.\n\n          SPEEDMAN\n          No problem. So are you going to let me\n          go?\n\n          TRAN\n          No. We will hold.you,for ransom.--.much\n          more money now..\n          He pulls out a cell phone.\n\n          TRAM\n          Is it possible to.have picture?\n\n          SPEEDMAN\n          Oh, sure, absolutely.\n          Speedman tries to throw an arm around Tran, a guard grabs\n          the arm., and twists it back. Speedman shrieks in pain.\n\n          TRAN\n          You mustn't touch me.\n          The guard snaps the picture.\n\n          ABODYGUARD\n          That came out really good.\n\n          EXT. FLAMING DRAGON COURTYARD -- NIGHT\n\n          The entire camp is assembled. Guards lead Speedman onto a\n          platform; behind Tran.\n\n          TRAM\n          \n          The people CHEER some more. Tran turns to Speedman.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 73.\n\n          TRAN\n          Now, do the movie.\n\n          SPEEDMAN\n          Excuse me?\n\n          TRAN\n          Do the movie.\n\n          SPEEDMAN\n          The whole movie?\n\n          TRAN\n          Yes. Begin.\n\n          SPEEDMAN\n          Hey, I know you're big fans and that's\n\n          GREAT--\n          Tran smacks Speedman in the, head with a rifle butt.\n          Speedman crumples to the ground. The crowd cheers.\n\n          SPEEDMAN\n\n          OW!!\n          Tran stands over him, screaming into his face:\n\n          TRAN\n\n          YOU WILL PERFORM, DO YOU UNDERSTAND??\n\n          YOU WILL PERFORM OR DIE11! MONKEY-\n\n          SWINE!1\n          Speedman gets up, begins a scared, unenthusiastic\n\n          PERFORMANCE:\n\n          SPEEDMAN\n          Aww, puh-puh-Pa! Whu-why you guh-got to\n          muh-muh-make ffffffun of me?\n\n          TRAN\n          More stupid!\n\n          SPEEDMAN\n          Awww, puh-puh-paaaa...\n          Tran turns to one of his men\n\n          TRAN\n          Get him some overalls! And give him the\n          Simple Jack haircut!\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 74.\n\n          EXT. HOLE -- DUSK\n\n          Sand}asky slowly lifts his head out, surveying the\n          territory. It looks clear. He drops back down.\n\n          INT. HOLE -- DUSK\n\n          The actors look miserable. Portnoy-looks.like his face is\n          going to fall off\n\n          SANDUSKY\n          It looks clear, but I can't be sure. I\n          say we stay in here till it's dark.\n\n          REDYKULOUS\n          I can't believe this is how it ends for\n          Redykulous. I'm a triple platinum\n          recording artist., Shit.\n\n          PORTNOY\n          (shivering and wheezing)\n          I gotta get back to the hotel. I'm not\n          gonna make.it...\n\n          SANDUSKY\n          Forget it. That guard patrol knows we're\n          out'here. They'll be looking for us.\n          Anyway, Speedman's in that compound. And\n          no one else knows but us.\n\n          LAZARUS\n          That's right. So here's the plan.\n          Everyone leans forward expectantly.\n\n          LAZARUS\n          We sneak out of here, make our way back\n          to the hotel and once we're safe, we\n          alert the government of Speedman's\n          situation.\n\n          REDYKULOUS\n          Sounds good.\n\n          SANDUSKY\n          Whoa whoa whoa ... . wait! So, we're just\n          gonna leave him here?\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 75.\n\n          REDYKULOUS\n          Yeah, and I don't wanna spend another\n          minute getting the full on smell'o vision\n          in this hole with his stinky ass.\n          Everyone agrees. They start packing up. Sandusky looks\n          horrified.\n          SANDUSKY Au II4\n          WAIT! Look, I don't think I've met a more\n          wildly self involved human than Speedman,\n          but you're just gonna leave him here? I\n          mean, come on. He's a person, guys.\n          These drug lords are killers. I mean,\n          they eat their enemies. We leave him\n          alone now, he doesn't have a chance in\n          hell.\n\n          LAZARUS,\n          That tosser is in there because of his\n          own stupidity. As far as I'm concerned,\n          he brought it on himself.\n\n          REDYKULOUS\n          Besides, how could we possibly rescue\n          him? Get real, Sandusky, we don't know\n          what the fuck we doing out here.\n\n          SANDUSKY\n          We've gotten this far. Look, we're making\n          a movie about one of the greatest rescues\n          ever. It's a true story,, right? I mean,\n          those guys weren't superheroes! They\n          were just put in extra-ordinary\n          circumstances, and they rose to the\n          occasion.\n\n          PORTNOY\n          Yeah, but they were trained soldiers.\n          They knew how to take care of themselves.\n\n          SANDUSKY\n          And we don't? They believed they could do\n          it. They believed in each other. Look,\n          I'm not saying it's gonna be easy.\n\n          (BEAT)\n          I mean, some of us might not come back.\n\n          REDYKULOUS\n          You mean, like, not on the same flight?\n          Sandusky just looks at them. They know that is not what\n          he meant.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 76.\n\n          PORTNOY\n\n          I NEED MY DRUGS!\n\n          SANDUSKY\n          Jeff -- I know this is really hard for\n          you,.â\u0080¢but you're gonna have to kick some\n          time, and it might as well be now.\n          (he turns to Lazarus)\n          Kirk, I've always admired you as an\n          actor. But as a person, I have to say,\n          not that impressive.' You got a.few\n          Oscars. Got any balls?\n          Lazarus takes this in.\n\n          SANDUSKY\n          Redyk. Whadda.you say? You talk a good\n          game, but how's it gonna feel when you're\n          sipping Cristalle with your homies.in the\n          hot tub back in.Cali knowing you left.a\n          man to die back here? You gonna rhyme\n          about that? ,\n          There is a long beat.\n\n          REDYKULOUS\n          Shit. I only wish they was filming this\n          for my show. I'm in.\n          He looks to LazaruS.,Lazarus takes a long dramatic pause..\n          Then...\n\n          LAZARUS\n          (with resolve)\n          We could fooster about for donkey's\n          years..Let:'s quit acting the maggot and\n          nix that mentaller.\n          The guys look at each other. What did that mean?\n\n          LAZARUS.\n          I'm in!\n\n          CUT TO:\n\n          INT. AGENCY OFFICE.- LOS ANGELES --DAY\n\n          Peck squeezes a stressball as his HOT YOUNG ASSISTANT\n          comes in.\n\n          HOT YOUNG ASSISTANT\n          Chris Michael is on the line.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 77.\n\n          RICK\n          (he hits a button)\n          Chris? What is this craziness?\n\n          SPEEDMAN (V.0.)\n          Hi, Rick. It's Chris--\n\n          INT. FLAMING DRAGON COMPOUND - COMMAND CENTER\n\n          Byong presses pause on a tape recorder he's holding up to\n          Chris's satellite phone. Tran watches, very serious.\n\n          RICK (O.S.)\n          Chris?\n\n          WE INTERCUT BETWEEN THEM\n\n          BYON G\n          Yes, that was Chris. But you will not\n          speak with him again. And do not bother\n          trying to trace this call.\n\n          RICK\n          What's going on? Who is this?\n\n          BYONG\n          We are Flaming Dragon. Speedman is with\n          us now.\n          There is a long silence as Rick processes this. Then he\n          nods slowly.\n\n          RICK\n          Oh. Really. Well I never heard of your\n          little agency. But if you wanna poach my\n          client? Lemme tell you something. His\n          career's been in a death spiral since\n          Simple Jack, so why don't you all go fuck\n          yourselves! Oh, and I bet he hasn't even\n          told you about the whole panda thing! He\n          killed a panda! And next time you're at\n          a cocktail party with Paris Hilton, or at\n          Kate Mantellini's choking down some egg\n          whites with Ron Howard, DON'T LET THAT\n          SLIP, because chances are, I ALREADY DID!\n          Rick slams the phone down.\n\n          \n\n          \n\n          \n\n          \n\n          I\n          Tropic Thunder 78.\n\n          INT. FLAMING DRAGON COMPOUND -'COMMAND CENTER\n\n          Byon,g stares at the phone, amazed. He looks to Tran.\n\n          TRAN\n          \n\n          (BEAT)\n          \n\n          EXT. HILLTOP -- NIGHT\n\n          Up on the.hill., our guys. are back up top, watching\n          Speedman through binoculars.\n\n          BINOCULAR POV.-- FLAMING DRAGON COURTYARD\n          Speedman is acting like Simple Jack, with his new bad\n          haircut.,He is performing for a small group, of chuckling.\n          GUARpS.\n\n          EXT. HILLTOP -- NIGHT\n\n\n          LAZARUS\n          Jaysus! We're too late. They brained him!\n          REDYKULOUS grabs the binoculars. Sees for himself.\n\n          REDYKULOUS\n          He's right, man, that ain't right.\n          Messin' with a man's brain.\n\n          SANDUSKY\n          We gotta get him outta there...\n\n          EXT. HILLTOP -- NIGHT -- LATER\n\n          The guys have set up a camp, with.a small fire. Everyone\n          watches as Sandusky diagrams a plan in the dirt.\n\n          SANDUSKY'\n          Here's us. Here's the compound.Here's\n          where Speedman was. It looks like they\n          move him at night, cause he's not here\n          now. Unfortunately we have no idea what\n          the layout of that place is.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 79.\n          SANDUSKY (cont'd)\n          But Speedman does. If we can get in\n          there, and find him, maybe he can help us\n          sneak him out.\n\n          PORTNOY\n          (sweating and in pain)\n          I got an idea.\n          Everyone turns to Portnoy.\n\n          11 N 0 6 III4\"\n\n          PORTNOY\n          It might be a little crazy, but...\n\n          REDYKULOUS\n          Crazy is better than nothin'.\n\n          SANDUSKY\n          What is it?\n\n          PORTNOY\n          (intermittent pain noises)\n          Back in '98, I did a low budget titty\n          comedy for skinemax, \"Sex Camp\". Anyway,\n          me and the campers from the uncool camp\n          had to break into the rich girls' camp.\n          So we did it by building a catapult.\n          They shot us over the wall and we\n          parachuted down.\n          The guys all look at each other... then finally:\n\n          LAZARUS\n          That's the stupidest idea I've ever\n          heard.\n\n          SANDUSKY\n          Yeah. Sorry Portnoy. That's lame. I say\n          we wait till just before dawn and sneak\n          over the fence. Take our chances. You\n          guys ok with that?\n          The group nods in approval.\n\n          SANDUSKY\n          Good. Then let's get some rest. Me and\n          Redyk are on first watch.\n          (to Lazarus)\n          I'll wake you in two hours, and we'll\n          switch.\n          They break up. Portnoy comes up to Sandusky, extremely\n          freaked out.\n\n          \n\n          \n\n          \n\n          \n\n          I\n          Tropic Thunder 80.\n\n          PORTNOY\n          I'm not gonna make it.\n\n          SANDUSKY\n          Yes you are.\n\n          PORTNOY\n          Then you gotta tie me up. I'm serious.\n          Tie me to a tree. No matter how much I\n          scream, or however much-I plead, you.must\n          not untie me. I will be cunning, I will\n          be in pain, and Iwill lie. The devil\n          works this way. I will say, do, and\n          excrete many regrettable things. But.no\n          matter what.. .you must leave me alone.\n          Beat..\n\n          SANDUSKY\n          Okay.. .Lazarus, you heard him. Tie him\n          up. We'll get you through it.\n\n          EXT. FLAMING DRAGON. COMPOUND -- NIGHT\n\n          Speedman has now been moved back to the cage. He is doing\n          a \"late show\" for a crowd of toothless old women. A\n          bodyguard plays a supporting female role, he wears a mop\n          for a wig.\n\n          BODYGUARD\n          (heav-i-l-y-accented Eng-l-is-h)\n          Jack...I could never go\n          -to the county ho-\n          down with you. I would be laughed out of\n          town. And what would Chet say?\n          The bodyguards laugh woodenly at Speedman.\n\n          SPEEDMAN\n          B-b-b-b-but I am a G-g-g-ggggoood Dd-d-d-\n          d-dancer.\n          Speedman bows, exhausted and exhilarated. The old women\n          .politely applaud. A new group forms in front of his cage.\n          Speedman stands. He sighs, and begins the movie over\n          again...\n\n          SPEEDMAN\n          Shu-sure is a puh-puh-purty\n          sssssssunrise, uh-uh-uh-uh-ain't it?\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 81.\n\n          BODYGUARD\n          Go do your chores, slowpoke!!\n\n          INT. CODY AND FOUR LEAF'S DETENTION HUT -- CONTINUOUS\n\n          Cody and Four Leaf watch through the slat in their\n          window.\n          11l I I, I. Inti\"\n\n          FOUR LEAF\n          That poor bastard. Looks like they coo-\n          coo nested him.\n\n          CODY\n\n          (IMPATIENT)\n          So what's the plan?\n\n          FOUR LEAF\n          What plan?\n\n          CODY\n          To get us out of here? Come on man, yoi4\n          lived this, you gotta have an idea of how\n          we can get out of here? Right?\n          Four Leaf looks a little at a loss...\n\n          FOUR LEAF\n          (trying to be stoic)\n          Sometimes the flowing stream can only\n          move when... the water... dries up.\n\n          CODY\n          No offense, but what the hell does that\n          mean?\n\n          FOUR LEAF\n          It means I'm,sick of your yappin'!\n\n          CODY\n          Come on man, you heard him back there.\n          They wanna off us! We gotta escape! You\n\n          GOTTA--\n          Four Leaf suddenly puts his hook hand right up to Cody's\n          neck. Cody instinctively blocks it with his hand.\n\n          FOUR LEAF\n          I gotta what? Take on the whole compound\n          by myself!\n\n          CODY\n          Stop it man! You're chokin' me!\n\n          \n\n          \n\n          \n\n          \n          .Tropic Thunder 82.\n          Cody tries to push him away. They get into a wrestling\n          match, hand to hook... Cody is pushing against Four\n          Leaf... then four Leaf tries to pull away.. But Cody\n          holds on to his hooks... he holds on until... HE PULLS\n          THEM OFF! Revealing... TWO PERFECT HANDS.\n\n          CODY\n          AHH! Who the hell are you?\n          Four Leaf looks down, sheepishly.\n\n          EXT. CAMPSITE -- NIGHT\n\n          PORTNOY,. tied to a tree, looking miserable and fidgety..\n          We TRACK PAST HIM to...\n          SANDUSKY AND.REDYKULOUS, who sit upright, back to back,\n          leaning against one another. Sandusky smokes a\n          cigarette. It's quiet except for the hum of cicadas, and.\n          the odd jungle noise.\n\n          SANDUSKY\n          Wow... .look at all those stars. Makes a\n          guy feel pretty small.\n\n          REDYKULOUS\n          Yup.\n\n          SANDUSKY\n          Back in LA, we don't get stars like this.\n          I wonder why there are so many here?\n\n          PORTNOY (O.S.)\n          Ohhhh...jeeesssusss..it's horrrrible.:...\n\n          REDYKULOUS\n          Man, how can;, you be talking about stars?\n          We might not make it outta here tomorrow.\n\n          SANDUSKY\n          I don't know. I give us pretty good odds.\n          Redykulous looks at'his watch, and lets out a chuckle.\n\n          SANDUSKY\n          What's so funny?\n\n          REDYKULOUS\n          Nothin'..\n\n          PORTNOY (O.S.)\n          .I can't feel my legs!...\n\n          \n\n          \n\n          \n\n          \n           'tropic Thunder 83.\n\n          I\" 1\n\n          REDYKULOUS\n          I'm just thinking about Lill Kantankerous\n          Bitch.\n\n          SANDUSKY\n          Who?\n\n          PORTNOY (O.S.)\n\n          (DRY HEAVES)\n\n          REDYKULOUS\n          She's a rapper I'm producing, a twelve\n          year old girl. Her first single drops\n          tomorrow and I'm not even gonna be there\n          to see it.\n\n          PORTNOY (O.S.)\n          Ohhhhh GOD! THERE'S BARBED WIRE IN MY\n\n          URINE!\n\n          REDYKULOUS\n          I pulled her off the streets six months\n          ago.\n\n          SANDUSKY\n          You did that?\n\n          REDYKULOUS\n          Well, not literally, she was trapped in a\n          dead end record deal with Rick Rubin.\n          Didn't even have a lawyer. Huh. And here\n          I am on the other side of the world.\n          About to die for a guy I barely even\n          know. Makes Redykulous wonder what's it\n          all about.\n\n          SANDUSKY\n          Yeah. . .well at least you have someone to\n          think about.\n\n          PORTNOY (O.S.)\n\n          (TTTTTHHHHWWAAAAAPPP... GURGLE)\n\n          REDYKULOUS\n          You single?\n\n          SANDUSKY\n          Yeah,... .I guess. I dunno. I got a girl.\n           But it's not too serious.\n\n           PORTNOY (O.S.)\n\n          (FFFAAAARRRRTTT... . FFFAAAARRRTTTT)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 84.\n\n          PORTNOY (O.S.)\n\n          MY EYES! SOMEONE RIP OUT MY FUCKING\n\n          EYES!!!! (VOMITING NOISE)\n\n          SANDUSKY\n          I don't think we're in love.\n\n           PORTNOY (O.S.)\n          Ohh... . thank God...its Over ...it's\n          finally over...\n\n          SANDUSKY:\n          It'.s kind of depressing. That feeling of\n          not having anyone who really loves you..\n          Redykuloils. puts his arm around Sandusky to comfort him..\n\n          REDYKULOUS\n          Hey, it's cool.. I think you're extremely\n          lovable.\n          Weird silence.\n\n          SANDUSKY\n          What?\n\n          REDYKULOUS\n          (removing his arm)\n          I mean like ...like,. I know what you mean.\n          I have love problems myself!\n\n          PORTNOY.(O.S.)\n\n          OH-H-GOD-! ITS--NOT-OVER!\n\n          SANDUSKY\n          .No you don't. What would the great\n          Redykulous, know about Girl Problems.\n          You're ten girls deep 24 hours a day!\n\n          REDYKULOUS\n          .That's the problem.\n          Silence.\n\n          SANDUSKY\n          How do you mean?\n\n          PORTNOY (O.S.)\n\n          (HUGE FART, BELCH VOMIT!)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 85.\n\n           PORTNOY (O.S.)\n          OHH GOOD!!!1 make it\n          stop! ... .Pahllleeeeeese!\n\n          REDYKULOUS\n          Jeesus, I can't believe I'm gonna tell\n          you this...\n          Beat.\n\n          REDYKULOUS\n          I'm... .I like guys.\n\n          SANDUSKY\n          What? But...\n\n          PORTNOY (O.S.)\n          Ohh...phew...\n\n          REDYKULOUS\n          I know-impossible huh. That's what I\n          say sometimes, but its true. Talk abort\n          living a loveless life. At least you\n          have someone who loves you. I don't even\n          have that.\n\n          PORTNOY (O.S.)\n          (THE SOUND OF GIVING BIRTH... then:)\n\n          OH MY GOD. MY SKIN IS A MILLION PIECES OF\n\n          SHATTERED GLASS RUBBING AGAINST AN OPEN\n\n          WOUND!\n\n          REDYKULOUS\n          When I think of the nights, alone in my\n          penthouse, when I've longed for the\n          gentle touch of another dude, to feel his\n          skin against mine, or his sweet breath on\n          my face.\n\n          PORTNOY (O.S.)\n\n          (LOUD SNORING)\n\n          SANDUSKY\n          All this from the same guy who\n          wrote\"Niggaz Gotta Bust a Nut on a Ho\".\n\n          PORTNOY (O.S.)\n\n          (LOUD VOMITING)\n\n          REDYKULOUS\n          Yeah, well, let me let you in on a big\n          secret.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          .Tropic Thunder 86.\n          REDYKULOUS,(cont'd)\n          Most of the time, when I'm writing about\n          ho's in my songs, 'I really mean Niggaz.\n          Creatively, that's the only way I can\n          cope.\n\n          SANDUSKY\n          So what! You're gay! You're also a great\n          artist and-businessman ... why not rap\n          about that?\n          ï¿½u IÂ° I. 11ï¿½jm\n\n          REDYKULOUS\n          Yeah right. And watch my clothing line,\n          e4ï¿½\n          sports drink,jewelry, nutrition, bars,\n          and fragrances go south? It's all such a\n          lie.\n          Now he begins to cry .a. little. Sandusky embraces him.\n\n          SANDUSKY.\n          Shhh...shhh... .shhh..shhh..shhh... .That's\n          it...let it out.\n\n          PORTNOY (O.S.)\n\n          (LOUD VOMITING)\n\n          REDYKULOUS\n          (muffled, crying in his\n\n          SHOULDER)\n          If you tell anyone I'll have someone\n          shoot your. ass.\n\n          SANDUSKY\n          I'm not gonna tell anyone, and your not\n          gonna shoot me... .th-at's it...l-et -tout.\n          Redykulous pulls back, and collects himself.\n\n          REDYKULOUS\n          Aww shit... (sniff sniff) I can't. believe\n          it's possibly the last day of my life,\n          and I'm not even gonna be able to let my\n          fans know how truly 'Utterly Redykulous I\n          really am.\n\n          SANDUSKY\n          (with total sincerity)\n          Listen, I know how utterly Redykulous you\n          are. Even for just.thisone\n          moment. . .and sometimes that enough.\n\n          PORTNOY (O.S.)\n\n          (SOUND LIKE A GALLON OF SQUID BEING\n\n          DUMPED INTO AN ALUMINUM PAIL)\n\n          \n\n          \n\n          \n\n          \n\n          I\n          Tropic Thunder 87.\n\n          REDYKULOUS\n          Thanks man.\n\n          CUT TO:\n\n          INT. CODY AND FOUR LEAF'S DETENTION HUT -- NIGHT\n\n          Cody, still awkwardly holding the hooks, is yelling at\n          Four Leaf.\n\n          CODY\n          So all of \"Tropic Thunder\" is bullshit?\n\n          FOUR LEAF\n          No! Four Leaf and his men were real, it\n          happened!\n\n          CODY\n          Are you even a VET!?\n\n          FOUR LEAF\n          YES! Well ...no! I mean, kinds! Yeah! Not\n          exactly. I served honorably in what they\n          called the \"forced service\". Sanitation\n          Detail at the United States Pentagon.\n\n          CODY\n          So you were some two bit criminal who got\n          caught and sentenced to clean toilets at\n          the Pentagon? I IDOLIZED YOU MAN!\n\n          FOUR LEAF\n          God-dammit, would you LISTEN! I was a\n          fuckup, sure, but one day as I was\n          cleaning the office of some Top-Brass big-\n          wig, I came across a file headed for the\n          shredder marked top secret. It was Four\n          Leaf Tayback's file. A nobody. No family.\n          Nothing. Killed in Action. They were\n          gonna bury the whole thing. Total black\n          op.\n\n          CODY\n          So you decided to take his identity?\n\n          FOUR LEAF\n          NO! I gave him one! I wrote the story\n          And I gave the American people a hero!\n          Yes, I am not technically Four Leaf, but\n          if I didn't pretend to be him then nobody\n          woulda ever known who he was! See what\n          I'm sayin'?\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 88.\n\n          CODY\n          And you cashed in!\n\n          FOUR LEAF\n          I was a fuck up my whole life! This guy\n          had a story worth-telling, and nobody\n          woulda ever known!\n          Cody slumps in the corner, looking spent and lost.\n\n          FOUR LEAF\n          I'm sorry, man.. I'm responsible: for this\n          .whole mess.\n\n          EXT. JUNGLE -- PRE-DAWN\n\n          PORTNOY wakes up, still tied to. the tree, looking like\n          shit. But realizes something-that makes him ecstatic:\n\n          PORTNOY\n          I'm clean! I'M CLEAN!!!!!\n          He struggles to his feet, doing a celebratory dance. He\n          immediately gets nauseous again and heaves.\n\n          PORTNOY\n          (still sick, but cheery)\n          My ' life .be_gins today!\n\n          CUT TO:\n\n          CLOSE ON THE FLAMING DRAGON INSIGNIA\n          Pull back to reveal that it is on a piece of paper being\n          pulled from a fax machine.\n          The text below reads:\n          \"Flamingg. Dragon has Speedman.lfyou want him, the price is $5O Million.\"\n          There's a phone number below it.\n          Reveal we're in...\n\n          INT. AGENCY OFFICE -- LOS ANGELES -- DAY.\n\n          Rick frowns at the fax. His Hot Assistant comes in.\n\n          \n\n          \n\n          \n\n          \n          ,, Tropic Thunder 89.\n\n           HOT YOUNG ASSISTANT\n          Rick, you better check your email.\n          He punches up his email. He opens a video attachment. We\n\n          SEE:\n\n          ON RICK'S COMPUTER\n          A bad quality video of Speedman sitting in the\n          interrogation room.\n\n          BYONG(V.O.)\n          Mr. Rick Peck. So far you have refused\n          to give us the respect we asked for.\n          Maybe this will change your mind.\n          Please state your name.\n\n          SPEEDMAN\n          Chris Michael Speedman.\n\n          BYONG (V.0.)\n          Who do you work for, Mr. Speedman?\n\n          SPEEDMAN\n          Well, I guess that really varies from\n          project to project--\n          Byong SCREAMS at Speedman, who cowers. Even Rick\n          flinches.\n\n          TRAM (V.0.)\n          Wrong answer!! You work for me now!! Do\n          you understand! Like my desk or my gun,\n          you are mine and you exist for me!!\n\n          SPEEDMAN\n          Yes! I work for you!\n\n          ON RICK\n\n          PECK\n\n          (IMPRESSED)\n          He really knows how to handle a client.\n          He hands the assistant the fax.\n\n          PECK\n          Get this yutzle on the phone. Now.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 90.\n\n          I\n\n          INT. FLAMING DRAGON COMPOUND -+., COMMAND CENTER\n\n          Tran,,and Byong sit by a phone. Byong looks impatient., i\n          Beat. The phone rings! Byong answers.\n\n          BYONG\n          Yes.\n\n          INT. RICK PECK'S OFFICE\n\n\n          RICK\n          I saw your 'little fax, Flaming Fuckwads.\n          I bet you thought I was just. going to lie\n          here and take it. Well, wrong! My name\n          is Rick Peck, not Rick Shaw,..and you are\n          not gonna take me.for a ride, you\n          industrious fuck; I don't care who you\n          people think you are, but I am coming.\n          there, and I am going to jack you up! I\n          am bringing the heavy artillery, my\n          friend, so you'd better be prepared for a\n          blood bath.! I am walking out of there\n          with Chris Speedman whether you, or he,\n          likes it or.not!\n          Rick slams down the phone, enjoying himself.\n\n          INT. FLAMING DRAGON COMMAND CENTER\n\n          Byong and Tran are stunned.\n\n          TRAN\n          \n          Byong turns to his lieutenants.\n\n          BYONG\n          \n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 91.\n\n          INT. RICK PECK'S OFFICE\n\n\n          RICK\n          Shandra, get tech support to put a trace\n          on this email attachment, let's find out\n          where this \"Flaming Dragon\" agency is!\n          Call the travel department. See if they\n          got a nonstop to Bien-Ben-Wherever-the\n          fuck-it-is!\n\n          EXT. FLAMING DRAGON COMPOUND -- PRE DAWN\n\n           SERIES OF SHOTS as the guerillas ready for an attack...\n\n          EXT. CAMPSITE -- PRE-DAWN\n\n          The guys are suiting up for combat. They apply burnt cork\n          to their faces for camouflage.\n\n          SANDUSKY\n          This is it. You know what you need to\n          do.' Tropic Thunder on three, two, one...\n\n          GUYS\n\n          TROPIC THUNDER!\n          They make their way down the hill.\n\n          EXT. FENCE LINE -- PRE-DAWN\n\n           They reach the fence. The coast looks clear and they each\n          scamper over...\n           Finally, it's PORTNOY'S turn. He's clearly too heavy.\n           The fence groans under'his weight. He launches himself --\n          and...\n          THWANG!!! Slams painfully into the razor wire of the\n          fence.\n          GUARDS hear the noise. They raise their weapons and\n          listen.. They see nothing in the pre-dawn darkness...\n          The actors run to the wall and clumsily pull PORTNOY\n          down, just in time.\n          Everyone's inside the perimeter... they quickly make their\n          way along the fence line to the entrance of the main\n          building, ducking away to avoid a LONE GUARD.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 92.\n\n          INT. MAIN BUILDING\n\n          Sandusky makes a series of hand gestures, indicating for\n          them to'split up and search for Speedman. A beat. The\n          guys all shrug, not understanding. Sandusky repeats the\n          hand gestures. Finally he has to speak.\n          i 1, 11 11^ï¿½%\n\n          SANDUSKY I 4I4\n          (in a loud whisper, also\n          signalling what.he's saying)\n          FAN OUT! 'GO ROOM BY ROOM ! IF YOU SEE, nci 16,\n          SPEEDMAN, give the signal!\n          We follow PORTNOY, working his wayldown a hall. He peaks\n          around a half opened door...\n\n          A DARKENED ROOM\n          .PORTNOY turns on his flashlight to reveal he is in fact\n          in... HEROIN HEAVEN! Wall to wall packets, ready,for\n          shipment.. PORTNOY is paralyzed. He spots a box with the\n          words \"For U.S.A., 100% pure, dilute before ingesting\".\n          His mouth LITERALLY waters, and'a drop. of .spittle oozes\n          from his bottom lip. He doesn't know what to do. He\n          gently takes two handfuls of the heroin from the box.\n          marked \"pure\". It's like holding two grenades...\n\n          HALLWAY\n          Sandusky moves silently toward a door. He kicks it'open\n          to reveal...\n\n          SPEEDMAN\n          Shackled to the floor. Delirious, he sits bolt upright.\n\n          SPEEDMAN\n          You mu-mu-make me ha-aa-ppy.\n\n          SANDUSKY\n          Oh sweet Jesus. Hold tight, Buddy! I'll\n          be right back!\n          Sandusky runs off to get the guys.\n\n          \n\n          \n\n          \n\n          \n           Tropic Thunder 93.\n\n          I\" 1\n\n          HALLWAY\n          Sandusky rounds up Redyk and Lazarus, points to both of\n          his eyes, signalling that he's got \"eyes\",on Speedman.\n          They take a step in that direction. Redykulous stops\n          them, and makes a made up, absurd signal for \"Where is\n          Portnoy?\", somehow trying to mime looking for a fat guy.\n          No one knbws what he is doing.\n\n          REDYKULOUS\n\n          (FRUSTRATED)\n          Where is Portnoy?!\n\n          SANDUSKY\n          Shhh!\n          A muffled, anguished animal noise that could only be\n          PORTNOY emanates from a nearby door. They run towards it.\n          Redykulous kicks it in.\n\n          HEROIN HEAVEN\n          The 'gang flies in, to discover Portnoy holding the bags,\n          crying.\n\n          REDYKULOUS\n          What are you doing, man!\n\n          SANDUSKY\n          Come on, let's go! We found Speedmani\n\n          PORTNOY\n          I don't care! It doesn't matter what I\n          do! I'll always be a screw-up! No one\n          will ever respect me...\n\n          REDYKULOUS\n          That's not true! Listen, back in the\n          day, I used to think I couldn't produce a\n          record simply because...\n\n          SANDUSKY\n          .he's gay.\n          Uh-oh. That's not what Redykulous was about to say. Beat.\n\n          REDYKULOUS\n          Actually I was going to say poor.\n\n          SANDUSKY\n          Sorry...\n\n          \n\n          \n\n          \n\n          \n\n          I\n          Tropic Thunder 94.\n\n          LAZARUS\n          Listen.. .Don't be crazy Portnoy --you're\n          not a fuck up. You'make millions of\n          people laugh!\n\n          PORTNOY\n          You said my farts made them laugh! Leave\n          me ALONE!!\n\n          REDYKULOUS.,\n           That ain't true Portnoy! Lotta people be\n          fartin' and not be gettin' 20 large a pop\n          for it!\n\n          OUTSIDE THE DOOR\n          .TWO GUARDS hear the noises inside, head. in to check it\n          out.\n\n          HEROIN ROOM\n          The guys hear the guards enter the far side of the room.\n          They can't see the guys through the.shelves packed with\n          heroin packets.\n\n          SANDUSKY\n          Damnit! We need to go!\n\n          PORTNOY\n          No, I can't do it.\n          (-l-ooking-in the-pac-ket )\n          I need it! I need it!! This'is all I\n          deserve.\n\n          REDYKULOUS\n          Come on, man...\n          And.the guards emerge. around a corner! They jab their\n          rifles.at:the guys and SCREAM AT THEM TO PUT THEIR HANDS\n\n          UP!\n          The guys all slowly raise their hands...\n          Then, in a moment of craziness, PORTNOY CHARGES THE\n\n          GUARDS, PIE-ING THEM IN THE FACE WITH THE HEROIN PACKETS.\n\n          PORTNOY\n\n          LAUGH AT THAT!! LAUGH AT THAT BASTARD!!\n          The guards let off a BURST OF MACHINE GUN FIRE as Portnoy\n          grinds it into their noses...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 95.\n\n          INT. CODY AND FOUR LEAF'S DETENTION HUT -- CONTINUOUS\n\n          They hear the fire. Four Leaf runs to the window. Through\n          it he sees the commotion...\n\n          CODY\n          What?\n\n          FOUR LEAF\n          Something's happening! Get me the hooks!\n\n          HEROIN ROOM\n          Portnoy watches as the white faced guards fall to their\n          knees, choking and groggy. After a beat, they collapse.\n\n          PORTNOY\n          Let's move! We got about sixteen hours\n          before they wake up!\n          They run out.\n\n          SPEEDMAN'S CELL\n          The guys run in. Redykulous breaks the lock off\n          Speedman's ankle with his rifle butt. Sandusky keeps\n          watch by the door.,\n\n          REDYKULOUS,\n          C'mon! We're busting you out!\n\n          SPEEDMAN\n          Muh-my nnnname is Juh-Jack. Some folks\n          call muh-me Simple Juh-Jack.\n\n          REDYKULOUS\n          What's wrong with him?\n\n          SANDUSKY\n          I think he thinks he's Simple Jack. Like\n          from the movie?\n\n          LAZARUS'\n          Shite. I was afraid of this. The same\n          thing happened to me when I played Neil\n          Armstrong in \"Moonshot\". They found me in\n          an alley in Burbank re-entering the\n          Earth's atmosphere in an old refrigerator\n          box.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 96.\n\n          REDYKULOUS\n          I heard that movie was good.\n\n          SANDUSKY\n          Can you fix him?!\n\n          LAZARUS\n          I'll try.\n          Lazarus takes Speedman's face in his hands, forces him to\n          look at him.\n\n          LAZARUS\n          .You're Chris Michael Speedman!\n\n          SPEEDMAN\n          Ah 1-1-likes pie.\n\n          LAZARUS\n          You're the greatest star in the world!\n          There's a flicker of intelligence in Speedman's eyes. It\n          passes.\n\n          INT. CODYAND FOUR LEAF'S DETENTION HUT -- CONTINUOUS\n\n          Four Leaf wedges one of the hooks in the. door jamb, and\n          Cody does the same with the other. In one fell swoop,\n          :they bust. the door off its hinges.\n\n          E-X-T . DE-T-EN-T-ION-HU-T----DAWN-\n          They emerge into the chaos. IT IS DAYLIGHT NOW. A GUARD\n          runs by, Four Leaf uses the hook to trip him up. Cody\n          knocks him out and grabs his machine gun. He tosses the\n          guard's pistol to Four Leaf.\n\n          CODY\n          By the way, what's your name anyway?\n\n          FOUR LEAF\n          Marvin Kaminsky.\n\n          CODY\n          you ever been in this jungle?\n\n          FOUR LEAF\n          Nope. First time outta the states\n          actually.\n          He shoots off a round and they run for cover.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 97.\n\n          INT. SPEEDMAN'S CELL -- CONTINUOUS\n\n          Lazarus is right in Speedman's face. He seems to be\n          getting clearer...\n\n          LAZARUS\n          The world needs you! It` needs its stars!\n          You make people forget how awful and 1ï¿½ I Ii I. 1 ,14M\n          depressing their lives are! People love\n          your work! And... I love your work, too.\n          Speedman is quiet.\n\n          SPEEDMAN I\n          Uhhhh-uh-I'm... Spah-speeedman?\n\n          LAZARUS\n          Simple Jack was magnificent!\n\n          SANDUSKY\n          Is it working?\n\n          LAZARUS\n          JESUS! Give me time, Sandusky! I'm not re-\n          programming a VCR!!\n          (back to Speedman)\n          You really committed yourself. And for\n          that you DESERVED AN OSCAR!\n          Speedman registers this.\n\n          LAZARUS\n\n          (FRUSTRATED)\n\n          C'MON CHRIS! DAMMIT! YOU MUST KNOW WHO\n\n          YOU ARE!\n          Lazarus's own words make him stop and think.\n\n          LAZARUS\n          (almost to himself)\n          You know who you are... . you do Chris.\n          Long beat.\n\n          LAZARUS\n          Unlike me. What am I doing? I can't do\n          this. How can I convince a man he is who\n          we know he is, when I can't even convince\n          myself of the same thing.\n          He lets go of Speedman, and begins to break down.\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 98.\n\n          REDYKULOUS\n          Yo, c'mon, man! Why is everybody gettin'.\n          so insecure alla a sudden?! You're Kirk\n          Lazarus! You're like the greatest actor\n          in the motherfuckin' world!\n\n          SANDUSKY\n          Guys, let's go, we gotta get outta here!\n          I it I. 11h.4%\n\n          LAZARUS\n          Am I Redykulous? ... AM I!...Or.am I just\n          acting like that's who I am?\n          No. The sad fact is... I'm not Sergeant\n          Osiris. . .or Father O'Malley ...or' Neil\n          .Armstrong. I'm not even .Kirk Lazarus.\n          (a beat)\n          I have no idea who I am.\n          The guys look at him... it's the first time he has let\n          his guard down.\n\n          SANDUSKY\n          Kirk, this is NOT the time!\n\n          LAZARUS\n          And I guess when you-do themath... .and\n          boil it all down, I've invented myself so\n          many times... .became so many\n          people... .that at the end of the.day...I'm\n\n          NOBODY.'\n\n          REDYKULOUSI\n          Bull-s-hit! Y-ou-l-isten to-me .-.-Y-ou-a-r-e-who\n          you want to be, and you-have to OWN. THAT!\n          Look at me! I'm GAY and, I'm proud!\n          He winks at Sandusky.\n\n          REDYKULOUS\n          That's right! We're.not what we're\n          called, or who we pretend to be. We are\n          what we are in our hearts. And to me,\n          looking into your heart, you're a hero..\n          Lazarus looks to Redykulous.\n\n          LAZARUS\n          You mean that?\n\n          REDYKULOUS\n          .Yup.\n\n          (BEAT)\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          '- -Tropic Thunder 99.\n           REDYKULOUS (cont'd)\n          And one of the finest pieces of black ass\n          I ever seen come out of Belfast.\n          Thera,... from off camera.\n\n          SPEEDMAN\n          And I'll second that.\n          They all'turn to see...SPEEDMAN. The million-dollar smile\n          is back!\n\n          SPEEDMAN\n          Now let's get the hell outta here!\n          Speedman leads the men to the door. Sandusky tosses\n          Speedman'a machine gun.\n\n          SPEEDMAN\n          Thanks Kevin.\n\n          SANDUSKY\n          My name...you remembered my name. You\n          gotta show us the way outta here Chris.\n\n          SPEEDMAN\n          Follow me.\n          This time they do...\n\n          HALLWAY\n          The guys run toward the opening to the courtyard,\n          Speedman leading the way...\n\n          EXT. FLAMING DRAGON COURTYARD -- CONTINUOUS\n\n           They huddle close to the wall, unseen, surveying the\n          situation: about 20 GUARDS on full alert... a JEEP about\n          30 feet away... beyond that, A HELIPAD with the\n          compound's chopper, maybe 200 yards in the distance...\n\n          SPEEDMAN\n          That's their supply chopper.\n\n          SANDUSKY\n          If we could create a diversion, we could\n          get to that jeep and drive it right over\n          there...\n\n          \n\n          \n\n          \n\n          \n\n          I\n          \"Ttopic Thunder 100.\n\n          PORTNOY\n          Anybody here know how to fly a\n          helicopter? Cause that would come in,\n          handy too.\n\n          SPEEDMAN\n          You want a diversion? I'll give you a\n          diversion. Is this baby loaded?\n          He holds up the machine gun...\n\n          SANDUSKY\n          Yeah, but...\n          And with'that, Speedman runs out in to the courtyard,..\n          the opposite direction from the jeep, doing a CRAZY WAR'\n\n          WHOOP...\n          A BUNCH OF GUARDS turns to,see.him... he does a-SUPER\n          MACHO TUCK AND ROLL, landing perfectly and EMPTYING HIS\n\n          CARTRIDGE ON. THE GUARDS...\n\n          SANDUSKY\n          (to.himself)\n          .they're blanks...\n          There is a long moment of silence as the guards just\n          stare at Speedman. He seems a. bit surprised that. they are\n          not dead,. as do the guards themselves. They cock their\n          weapons, about to shoot him when.,..\n          A HAIL OF-BULLET FIRE-erupts-behind-the-gu-ards... They\n          turn...WE REVEAL CODY AND FOUR LEAF BEHIND THEM, THEIR\n\n          GUNS FIRING INTO THE AIR!!\n\n          SANDUSKY\n          Let's move!\n          The.guys jump into the jeep, Sandusky at the wheel, and\n          'gun it..\n\n          SANDUSKY\n          Chris, come.on!\n          Speedman jumps. into the jeep as it passes by. They are\n          speeding toward the helipad.\n\n          SPEEDMAN WATCHES FOUR LEAF AND CODY, WHO CONTINUE\n\n          SHOOTING AT THE GUARDS...\n\n          SPEEDMAN\n          Four Leaf! Effects guy! Come on!!\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 101.\n          But they can't break away, they-are trying to run toward\n          the jeep but are under too much fire...\n\n          SPEEDMAN\n\n          WE GOTTA GET THEM, GO AROUND!!\n          Sandusky swings the wheel hard. . .the jeep careens back\n          toward the firefight...they come in hard, and SKID TO A\n\n          STOP NEXT TO FOUR LEAF AND CQDY..1.\n          Cody jumps in the jeep, but FOUR LEAF DOESN'T...\n\n          SANDUSKY\n          Get in the Jeep!\n\n          FOUR LEAF\n          You go... I got real bullets! I'll cover\n          you.. It's the only way you'll make it!\n\n          CODY\n          Marvin, you gotta --\n\n          FOUR LEAF\n          Just go!!\n          Sandusky looks at Speedman... they both know he's right.\n          They go... leaving Four Leaf in the dust, still firing...\n          The jeep speeds up to the helipad... the guys jump out.\n          Just as the last guy is out...\n\n          BOOM! A HUGE BLAST FLIPS THE JEEP INTO THE AIR...\n          Across the courtyard is TRAN... who just fired an RPG at\n          our guys!\n          The guys are freaked and shaken, but start to get in the\n          chopper... Sandusky pushes Cody in...\n\n          A\n\n          SANDUSKY\n          Start the chopper now Cody!\n          Cody nods, getting his bearings... and hitting the\n          ignition...the BLADES SLOWLY HUM TO LIFE, BEGINNING TO\n          TURN... Portnoy grabs Cody's gun and hangs by the runner,\n          shooting towards approaching guards...\n\n          WHAT WE SEE NEXT SHOULD PLAY OUT VERY MUCH THE SAME AS\n\n          THE OPENING OF THE MOVIE:\n          Tran is reloading his RPG...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 102.\n          REDYK and LAZARUS GET. IN, and SPEEDMAN grabs a live\n          machine gun off the ground and fires toward TRAN and his\n          men.\n\n          LAZARUS\n\n          WE GOTTA GO NOW!! LET'S MOVE!!\n\n          CODY\n\n          BUT FOUR LEAF --\n\n          LAZARUS\n\n          WE'RE. ALL DEAD MEAT IF WE DON'T.LIFT OFF\n\n          NOW!! DO IT CODY!!\n          Cody reluctantly pulls up the throttle. The chopper.\n          begins to LIFT OFF...\n\n          SPEEDMAN.\n\n          FOUR LEAF IS STILL OUT THERE!\n\n          LAZARUS\n\n          WE GOTTA GO! PORTNOY GET YER ASS IN THIS\n\n          CHOPPER!!\n\n          PORTNOY\n\n          I'M TRYING!!\n          Portnoy is not being heroic, he, is genuinely having\n          trouble getting in.-the chopper.\n          But then Speedman sees something...\n\n          SPEEDMAN\n          It's him...\n\n          SPEEDMAN'S POV\n          FOUR LEAF... much-like.Speedman playing him in the\n          beginning of the. movie... Arms extended, his body riddled\n          with bullets...\n\n          LAZARUS\n\n          FOOCK!\n          Cody lowers the chopper ... Speedman jumps out...\n\n          SPEEDMAN\n          Cover me!\n          Speedman runs towards Four Leaf, through a hailstorm of\n          bullets...PORTNOY AND THE GUYS PROVIDE AS MUCH COVER AS\n\n          THEY CAN...\n\n          \n\n          \n\n          \n\n          \n          i- Tropic Thunder 103.\n          Speedman reaches Four Leaf and collapses beside him,\n          cradling his head.\n          Trap's men continue to bear down on them...\n\n          FOUR LEAF\n          Go on...get outta here. I'm worm food,\n          you dig?\n\n          SPEEDMAN\n\n          DON'T YOU DIE ON ME!\n          (then totally surprised)\n          You have hands?\n\n          ON THE CHOPPER\n          The guys are busy shooting off their attackers, but they\n          see this moment happening...\n\n          BACK TO SPEEDMAN AND FOUR LEAF\n          The life is draining from Four Leaf (Marvin)...\n\n          FOUR LEAF\n          I ain't Four Leaf, Chris. We're in this\n          mess because of me.\n\n          SPEEDMAN\n          (can't get over it)\n          How did you get hands?\n\n          FOUR LEAF\n          I ain't never been worth a nothin'...and\n          it's too late to start bein' a somethin'\n          now.\n          Speedman tries to understand. He is welling up with\n          emotion.. .real emotion.\n\n          FOUR LEAF\n\n          (SINCERELY)\n          But you... you can tell the story. . .You\n          have to tell the real story...\n          And Four Leaf... or Marvin... dies.\n          Speedman begins to weep. Tears. Yes, he is crying, for\n          real...\n\n          AND WE PULL BACK TO REVEAL THIS PLAYING ON A GIANT VIDEO\n\n          SCREEN AT THE OSCARS...\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder 104.\n          Only... LAZARUS (CAUCASIAN AGAIN BUT LOOKING ALOT LIKE\n          FOUR LEAF) is now playing FOUR LEAF, (Or Marvin), dead in\n          Speedman's arms...\n\n          INT. ACADEMY AWARDS THEATER,\n\n          SPEEDMAN sits in.the audience, suirrounded-by his Tropic ï¿½i'4 1, I. 1 ,1M\n          -Thunder compatriots. Everyone watches with rapt\n          attention...\n\n          ON SCREEN\n\n          SPEEDMAN\n          Don't you die on me! Don't you...\n          And his weeping continues. He then looks up. to see:\n\n          20 GUERRILLAS RUNNING AT HIM, SHOOTING WILDLY...\n\n          MOVIE STAR STYLE, HE UNLEASHES A BARRAGE OF MACHINE GUN\n\n          FIRE, MOWING THEM DOWN,..\n\n          HE SLINGS FOUR LEAF/MARVIN OVER HIS SHOULDER, AND RUNS\n\n          FOR THE CHOPPER, STILL SHOOTING;..\n\n          HE GETS THERE WITH PORTNOY, REDYK AND SANDUSKY PULLING\n\n          HIM UP AND IN AS THEY TAKE OFF, LEAVING HELL BEHIND.\n\n          THE IMAGE FREEZES.\n\n          INT. ACADEMY AWARDS THEATER\n\n          The audience applauds wildly. HILARY SWANK opens the\n          envelope at the podium...\n\n          A\n\n          HILARY SWANK\n          And the Oscar goes to...Chris,Michael\n          Speedman as himself in \".PLAYING HOOKY\n\n          THE REAL TRUE STORY OF THE LIFE AND DEATH\n\n          OF FOUR LEAF TAYBACK AND THE MAN WHO\n\n          PRETENDED TO BE HIM\".\n          The audience erupts in applause. Speedman gets up,\n          hugging Redyk, Portnoy, Sandusky. Even Cody is there...\n          As he gets near.the stage, KIRK LAZARUS (CAUCASIAN BUT\n          LOOKING LIKE HIS-ORIGINAL SELF), with his own Oscar in\n          hand, bear hugs him...\n\n          \n\n          \n\n          \n\n          \n           i-Tropic Thunder 105.\n\n          I\" â\u0096º\n\n          ANNOUNCER\n          This is Chris Michael Speedman's first\n          Oscar. He joins four time Oscar winner\n          Kirk Lazarus, tonight's Best Supporting\n          Actor winner for the role of Marvin\n          Kaminsky...\n          And we FREEZE on Speedman and Lazarus, grinning eat to\n          ear, arms' around each other, awards in hand...\n\n          WE FADE SLOWLY TO BLACK\n          After a few moments...\n\n          CUT TO:\n\n          EXT. FLAMING DRAGON COURTYARD -- DAY\n\n          Peck is tied up, in ragged, prisoner clothes, hanging in\n          the cage. He has been there a while.\n\n          PECK\n          Ok, look, you wanna go through this\n          again, let's do it. I see more for you\n          than this. This whole 'big fish in the\n          little scary jungle pond' thing. I see\n          you as a front man, as a leader, not just\n          of this little rebel guerilla warrior\n          group. I see it big picture. Is it music,\n          is it movies? Is it a series on Fox? I\n          don't know. But I do know it is not\n          happening with you staring at me doing my\n          \"I Know Why The Caged Bird Sings\" routine\n          for you and the peanut gallery for\n          another six months. It's old school\n          already.\n          TRAN and some HENCHMEN watch, unamused. Tran nods, one of\n          the henchmen turns a handle which lowers the cage into\n          the water. After a moment, it comes back up with a\n          soaking Peck.\n\n          PECK\n          (not missing a beat)\n          And it makes me sad to see you chomping\n          on the stogie and you're not even\n          fourteen or whatever. I'm thinking \"what\n          hole does that need to fill, that you\n          have to keep dipping me into the water to\n          somehow feel better about yourself?\" I\n          can be a partner to you, not just a\n          captive.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n          Tropic Thunder\n\n           106.\n          PECK (cont'd)\n          But you have to allow me into your inner\n          workings, into your headspace to\n          facilitate that. And\"to do that you gotta\n          let me outta the cage,'both figuratively\n          and literally. Until you can let me go, I\n          you.can't let you go. Do you get that?\n          He gets dunked in the water again.\n\n          PECK\n          Obviously not. Dare I bring up.a sore\n          subject. Can we do a little business on\n          the blackberry privileges? Cause you're\n          killing me here.\n\n          BLACK\n\n\n                              THE END\n\n\n\n\n\n\n\n\nTropic Thunder\nWriters :   Ethan Cohen  Ben Stiller  Justin Theroux\nGenres :   Action  Adventure  Comedy  War\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Hook-handed Vietnam veteran Staff Sergeant John \"Four Leaf\" Tayback's (Nick Nolte) memoir, Tropic Thunder, is being made into a film. With the exception of newcomer supporting actor Kevin Sandusky (Jay Baruchel), the cast—fading action hero Tugg Speedman (Ben Stiller), five-time Academy Award-winning Australian method actor Kirk Lazarus (Robert Downey, Jr.), rapper Alpa Chino (Brandon T. Jackson), and drug-addicted comedian Jeff Portnoy (Jack Black)—behave unreasonably. Rookie director Damien Cockburn (Steve Coogan) cannot control them during filming of a large war scene, and production is reported to be one month behind schedule a mere week into production. Studio executive Les Grossman (Tom Cruise) orders Damien to resume filming as planned, or risk its cancellation.\nActing on Four Leaf's advice, Damien drops the actors into the middle of the jungle, with hidden cameras and rigged special effects explosions to film \"guerrilla-style\". The actors have guns that fire blanks, along with a map and scene listing that will lead to a helicopter waiting at the end of the route. Unknown to the actors and production, the group have been dropped in the middle of the Golden Triangle, the home of the heroin-producing Flaming Dragon gang. Just as the group are about to set off, Damien inadvertently steps on an old landmine and is blown up, stunning the actors. Tugg, believing Damien faked his death, persuades the others that Damien is alive and that they are still shooting the film. Kirk is unconvinced but joins them in their trek through the jungle.\nWhen Four Leaf and pyrotechnics operator Cody Underwood (Danny McBride) try to locate the dead director, they are captured by Flaming Dragon, at which point Four Leaf reveals that he fabricated his memoir, was never in the Army and has hands. As the actors continue through the jungle, Kirk and Kevin discover that Tugg is leading them in the wrong direction. The four actors, tired of walking and hoping to be rescued, leave Tugg, who goes off by himself and is captured by Flaming Dragon. Taken to their heroin factory, Tugg believes it is a POW camp from the script. The gang discovers he is the star of their favorite film, the box office bomb Simple Jack, and forces him to reenact it several times a day. Meanwhile in Los Angeles, Tugg's agent Rick Peck (Matthew McConaughey) is trying to negotiate with Les an unfulfilled term in Tugg's contract that entitles him to a TiVo. Flaming Dragon calls the two and demands a ransom for Tugg/Simple Jack, but, Les instead berates the gang. Despite the threats, Les expresses no interest in rescuing Tugg and tries to convince Rick about the benefits of allowing Tugg to die and collecting the insurance. Les also offers Rick a Gulfstream V jet and money in return for his cooperation.\nKirk, Alpa, Jeff and Kevin discover Flaming Dragon's heroin factory. After witnessing Tugg being tortured, they plan a rescue attempt based on the film's script. Kirk impersonates a farmer towing a captured Jeff on the back of a water buffalo, distracting the armed guards so Alpa and Kevin can locate the captives. After the gang's leader notices inconsistencies in Kirk's story the actors, knowing their cover has been blown, begin firing, temporarily subduing the gang. Their control of the gang falls apart when Jeff grabs the leader and heads for the drugs, and the gang regains their guns and begin firing.\nThe four actors locate Four Leaf, Underwood and Tugg and cross a bridge rigged to explode to get to Underwood's helicopter. Tugg asks to remain behind with the gang which he considers his family, but quickly returns when Flaming Dragon fires in pursuit. Four Leaf detonates the bridge allowing Tugg to reach safety, but, as the helicopter takes off, the gang fires a rocket-propelled grenade at the helicopter. Rick unexpectedly stumbles out of the jungle carrying a TiVo box and throws it in the path of the RPG, saving them. The crew return to Hollywood, where footage from the hidden cameras is compiled into a feature film, Tropic Blunder, which becomes a major critical and commercial success. The film wins Tugg his first Academy Award, which Kirk presents to him at the ceremony."}