{"title": "Twilight", "full_text": "TWILIGHT\n\n\n\n\n                                    Written by         \n          \n                                 Melissa Rosenberg\n          \n          \n          \n                               Based on the novel by \n\n                                  Stephenie Meyer\n          \n\n\n          \n\n                                                        SHOOTING DRAFT\n                                                     February 11, 2008\n          \n          \n          \n          FADE IN:\n          \n          \n          1 EXT. RAIN FOREST, OLYMPIC NATIONAL PARK, WASHINGTON - DAWN \n          \n          Moss-draped. Shadow-drenched. Tortured tree trunks twist \n          upward, reaching for rare sunlight. \n          \n          \n          BELLA (V.O.)\n          I'd never given much thought to how I would die..\n          \n          Suddenly, every creature in the forest is deadly silent. Neither \n          bird, beast nor insect make a noise. A predator is near. \n          \n          Then, in the distance, hear a tiny SNICK - a twig snapping. \n          Abruptly, we're on the move. Fast.\n          \n          \n          UNKNOWN POV - MOVING\n          \n          Trees start whipping past us at a dizzying speed, branches \n          are dodged with preternatural agility. And we're speeding\n          up, chasing something. It's exhilarating. Terrifying. \n          Finally, up ahead, we get the first glimpse of our prey -\n          -\n          \n          \n          A DEER\n          \n          \n          -- running for its life as it darts through this maze of \n          a forest. It sprints forward, but we gain on it. Beyond the deer, \n          SEE the forest's edge ahead, white sunlight glowing against the\n          trees. The buck races for the light. We're just behind it, \n          about to emerge from the shadowy darkness -\n          -\n          \n          \n          The deer LEAPS into the light in a high arc, hovering (suddenly \n          SLOW MOTION) against the WHITE GLARE of the sun... then BAM! \n          \n          \n          The deer abruptly plummets out of frame at an unnatural angle, \n          leaving the WHITE GLARE to fill the screen. HOLD ON WHITENESS \n          -\n          \n          \n          BELLA (V.O.)\n          \n          \n          But dying in the place of someone I\n          love seems like a good way to go..\n          . \n          \n          \n          -- Then into the WHITENESS steps the face of -\n          \n          \n          2 ISABELLA SWAN, 172\n          \n          \n          Eyes closed against the sunlight, absorbing its rays. Long, \n          dark hair frames alabaster skin. She's a vulnerable,\n          introverted, imperfect beauty.\n          \n          \n          BELLA (V.O.)\n          \n          ... So I can't bring myself to \n          regret the decision that brought me \n          here to die... \n          \n          \n          The background comes into focus as we realize we're now in -\n          \n          \n          2.\n          EXT. SCOTTSDALE, AZ - DAY\n          \n          \n          Bella stands at the end of a cul-de-sac on the desert's edge.\n          The sun blazes behind her -- she bends down and carefully \n          scoops a tiny BARREL CACTUS into a clay pot. \n          \n          \n          BELLA (V.O.)\n          \n          ... The decision to leave home.\n          \n          She stares at the cactus in a state of reverie, until \n          \n          \n          BLONDE #1 (O.S.)\n          Bye, Bella!\n          \n          \n          BELLA'S POV - McMansion ACROSS THE STREET \n          \n          \n          Three tanned, athletic, blonde GIRLS hop into a convertible \n          Mercedes. Their flawless, bought-and-paid for beauty contrasts \n          with Bella's pale naturalness. They wave.\n          \n          \n          BLONDE #\n          Good luck at your new school! \n          \n          \n          They ADLIB superficial good wishes, \"Don't forget to write;\"\n          \n          \"We'll miss you.\" Bella waves back, sweetly, but \n          halfheartedly as she steps off the curb.\n          \n          \n          BELLA\n          Have a good..\n          \n          --and trips. When she rights herself, they're already gone.\n          \n          \n          BELLA\n          ... life. \n          \n          \n          Clearly, not close friends. Bella's grown-up demeanor and\n          innate intelligence become apparent as -\n          -\n          \n          \n          BELLA'S MOTHER, RENE, mid 30's --exits their house --it's\n          low rent for this ritzy neighborhood. Rene is eclectic, \n          scattered, anxious, more best friend than parent. She \n          thrusts a cell phone at Bella. \n          \n          \n          RENE\n          It won't work again, baby. \n          \n          \n          BELLA\n          You put it on hold. \n          \n          \n          RENE\n          I did? \n          \n          \n          BELLA\n          Look. You also called Mexico.\n          \n          \n          Rene pushes her playfully, they laugh.\n          \n          \n          \n          3.\n          RENE\n          I'll figure it out. You gotta be able \n          to reach me and Phil on the road - \n          I \n          love saying that - on the road.\n          \n          \n          BELLA\n          Very romantic.\n          \n          \n          PHIL, 31, good looking with an athlete's body, exits the\n          house, carrying Bella's three suitcases with ease. \n          \n          \n          PHIL\n          If you call crappy motels, backwater \n          towns and ballpark hot dogs romantic.\n          \n          \n          He puts his Phoenix Desert Dogs baseball hat on Rene's head with \n          a\n          kiss. Phil's love of Rene reassures Bella. Phil heads to the old\n          station wagon to load the luggage, while Rene slips her arm \n          through Bella's, clinging to her as they walk to car.\n          \n          \n          RENE\n          Now, you know if you change your \n          mind, I'll race back here from \n          wherever the game is. \n          \n          \n          But Rene's strained expression tells us what a great \n          sacrifice that would be. Bella forces a smile.\n          \n          \n          BELLA\n          I won't change my mind, mom.\n          \n          \n          RENE\n          You might. You've always hated Forks. \n          \n          \n          BELLA\n          It's not about Forks, it's about \n          Dad. I mean, two weeks a year, we \n          barely know each other. \n          \n          \n          (off Rene's still worried \n          look)\n          Mom, I want to go. I'll be fine.\n          \n          \n          But as Rene hugs Bella, we see the truth on BELLA'S FACE \n          dread, doubt, regret. Off Bella, struggling to keep her \n          facade up as she climbs into the back seat of the car..\n          .\n          \n          \n          BEGIN TITLES OVER:\n          \n          \n          3 BELLA'S POV OUT THE CAR WINDOW - SCOTTSDALE \n          3\n          \n          \n          Bella, IPOD earbuds in her ears, gets a last glimpse of the \n          sparkling malls, chic shoppers, manicured cactus gardens..\n          . \n          \n          \n          PULL UP AND OUT OF THE CAR UNTIL WE'RE -\n          -\n          \n          \n          \n          4.\n          4 EXT. ABOVE SCOTTSDALE (AERIAL SHOT) - DAY \n          4\n          \n          \n          The McMansions get smaller as we SWEEP OVER the scorched \n          landscape, baking under a hot sun. Beyond the housing \n          developments SEE the rocky, dry desert, extending for miles..\n          . \n          \n          \n          Rise HIGHER, and higher still, until finally we're suspended\n          within the bright, perfect, blue SKY, with only an occasional \n          cloud..\n          . \n          \n          \n          Slowly, the clouds start getting more numerous, thicker, darker..\n          . \n          until we're completely immersed in them... the sun disappearing.\n          Finally, we EMERGE from the clouds to find below \n          -\n          \n          \n          5 EXT. WASHINGTON STATE - OLYMPIC PENINSULA (AERIAL SHOT)- DAY5\n          \n          \n          Nothing but deep, dark, green forests for miles. SWEEP DOWN, \n          finding the eerily dramatic Lake Crescent. Over it all hangs \n          the mist from the ever-present cloudy grey sky. Everything \n          is wet and green and drenched in shade..\n          . \n          \n          \n          FIND A TWO LANE HIGHWAY along which drives A POLICE \n          CRUISER... PUSH IN on the cruiser until we reach \n          -\n          \n          \n          THE PASSENGER SIDE WINDOW \n          \n          \n          Bella looks out, taking in her gloomy new surroundings..\n          .\n          \n          \n          END TITLES.\n          \n          \n          6 INT. POLICE CRUISER - DAY - WAITING AT LIGHT \n          6\n          \n          \n          Bella sits next to her uniformed father, police chief CHARLIE \n          SWAN, 40's. Taciturn, introverted like Bella. Their strained \n          silence contrasts Bella's relationship with her mother. Beat.\n          \n          \n          CHARLIE\n          Your hair's longer.\n          \n          \n          BELLA\n          I cut it since last time I saw you. \n          \n          \n          CHARLIE\n          Guess it grew out again.\n          \n          \n          She just nods. Silence.\n          \n          \n          CHARLIE\n          How's your mom?\n          \n          \n          BELLA\n          Good. \n          \n          \n          More silence. Yikes. They pass a SIGN: \u0093The City Of Forks\n          Welcomes You - Pop. 3246.\u0094 Bella sighs. \n          \n          \n          \n          5.\n          7 EXT. FORKS, WASHINGTON - DAY \n          7\n          \n          \n          As the cruiser drives through, Bella takes in this logging town \n          -\n          every storefront has a wood carving. The Timber Museum's sign is\n          two loggers sawing a stump. The POLICE STATION is a small wooden \n          building across from City Hall..\n          . \n          \n          \n          8 EXT. CHARLIE'S HOUSE - DAY \n          8\n          \n          \n          The cruiser pulls up to the old two-story house. A woodshed full \n          of firewood. There's a small boat in the garage, fishing gear, an\n          old buoy. Bella climbs out... home.\n          \n          \n          9 INT. CHARLIE'S HOUSE - DAY \n          9\n          \n          \n          Bella and Charlie carry in her bags. The house isn't stylish\n          (the only new thing here is a Flat Screen T.V.), but it's\n          comfortable, lived-in. Lots of fishing memorabilia; photos \n          of Charlie fishing with Quileute Indian BILLY BLACK. \n          \n          \n          Handmade cards to \u0093Daddy\u0094 and photos of Bella. She winces at\n          herself, age 7, in a tutu, sitting stubbornly on the ground. \n          \n          \n          CHARLIE\n          \n          \n          I put Grandpa's old desk in your \n          \n          \n          room. And I cleared some shelves \n          \n          \n          in the bathroom. \n          \n          \n          BELLA\n          (grimacing)\n          That's right. One bathroom.\n          \n          \n          Bella's eye lands on a PHOTO of a much younger Charlie and\n          Rene, on vacation, beaming with love. \n          \n          \n          CHARLIE\n          I'll just put these up in your room \n          -\n          \n          \n          BELLA\n          I can do it \n          -\n          \n          \n          They both reach for the bags, bumping one another awkwardly. \n          Bella backs off, letting Charlie carry the bags upstairs.\n          \n          \n          10 INT. BELLA'S ROOM - DAY 10\n          \n          \n          An antique rolltop desk sits in a corner. The room is filled with \n          childhood remnants that have seen better days. As she unpacks her \n          CD case, loneliness finally overwhelms her. She sits heavily on \n          the edge of the bed, tears threatening..\n          . \n          \n          \n          Then we hear a HONK outside. Bella runs across the hall and looks \n          out the window to see \n          -\n          \n          \n          11 OUTSIDE - A FADED RED TRUCK, CIRCA 1960 pulls up... 11\n          \n          \n          \n          6.\n          EXT. CHARLIE'S HOUSE - DAY\n          \n          \n          Bella exits to find Charlie greeting the driver, JACOB BLACK, \n          16, Quileute Indian, amiable with long black hair, and hints of \n          childish roundness in his face. The two of them help Jacob's\n          father, BILLY BLACK (from the photos), into a wheelchair. \n          \n          \n          CHARLIE\n          Bella, you remember Billy Black. \n          \n          \n          BILLY\n          Glad you're finally here. Charlie \n          hasn't shut up about it since you \n          told him you were coming. \n          \n          \n          CHARLIE\n          Keep exaggerating, I'll wheel you \n          down the hill. \n          \n          \n          BILLY\n          Right after I ram you in the ankles.\n          \n          \n          Billy takes several rolls at Charlie, who dodges. Jacob shakes \n          his head at their two fathers as he shyly approaches Bella.\n          \n          \n          JACOB\n          I'm Jacob. We made mud pies \n          together when we were little kids. \n          \n          \n          BELLA\n          Yeah... I think I remember..\n          .\n          (re: the dads)\n          Are they always like this?\n          \n          \n          JACOB\n          It's getting worse with old age.\n          \n          \n          Charlie then pats the hood of the truck, addressing Bella \n          -\n          \n          \n          CHARLIE\n          So what do you think of your \n          homecoming gift?\n          \n          \n          BELLA\n          No way. The truck is for me?\n          \n          \n          CHARLIE\n          Just bought it off Billy, here. \n          \n          \n          JACOB\n          I rebuilt the engine and -\n          -\n          \n          \n          BELLA\n          It's perfect!\n          \n          \n          \n          7.\n          She beams. It's the first genuine smile we've seen on her.\n          She rushes to the truck. Jacob eagerly joins her. \n          \n          \n          JACOB\n          Okay, so you gotta double pump the \n          clutch when you shift, but -\n          -\n          \n          \n          He hands her the keys as she climbs in.\n          \n          \n          BELLA\n          Maybe I can give you a ride to school.\n          \n          \n          JACOB\n          I go to school on the reservation.\n          \n          \n          BELLA\n          Too bad. Would've been nice to \n          know at least one person. \n          \n          \n          As she starts up the truck we MATCH CUT \n          -\n          \n          \n          12 EXT. FORKS HIGH SCHOOL - BELLA'S TRUCK - DAY 12\n          \n          \n          Loud, belching and turning heads as Bella parks, mortified. All \n          eyes are on her as she climbs out of her truck and steps in \n          a \n          PUDDLE, soaking her sneakers. She slinks toward school, as we \n          begin \n          -\n          \n          \n          13 INT. HIGH SCHOOL - A SERIES OF SHOTS - DAY 13\n          \n          \n          -- Bella (never without her IPOD) makes her way thru kids who \n          stare openly; a few brave ones say hi. They're all talking \n          about her. This is her hell. \n          -- Bella wanders the walkways looking for room numbers, lost. \n          -- Constant stares at Bella, the outsider..\n          .\n          SERIES ENDS when a sweet, nerd-cute, motor mouth boy, ERIC, \n          appears in her path. \n          \n          \n          ERIC\n          You're Isabella Swan, the new girl. Hi. \n          I'm Eric. The eyes and ears of this \n          place. Anything you need. Tour guide, \n          lunch date, shoulder to cry on.\n          \n          \n          Bella just looks at him. Is he for real?\n          \n          \n          BELLA\n          I'm kind of the \u0093suffer in silence\u0094 type.\n          \n          \n          ERIC\n          Good headline for your feature \n          -\n          I'm on the paper, and you're news, \n          baby, front page.\n          \n          \n          \n          8.\n          BELLA\n          I -- no, I'm not news -- I'm, seriously, \n          not at all \n          -\n          \n          \n          ERIC\n          Whoa, chillax. No feature.\n          \n          \n          BELLA\n          \n          \n          (relieved)\n          Would you mind just pointing me \n          toward Mr. Varner's class?\n          \n          \n          He leads her away, enjoying the attentive stares, as she cringes \n          from them \n          -\n          \n          \n          ERIC\n          You've missed a lot of the semester, \n          but I can hook you up - tutor, cliff \n          notes, medical excuse..\n          . \n          \n          \n          INT. GYM - DAY 14\n          \n          \n          The boys' basketball team runs drills on half the basketball\n          court. A girls' volleyball game occupies the other half.\n          \n          \n          Bella, in gym clothes, avoids the volleyball like it's\n          radioactive. An energetic, athletic team captain, JESSICA, \n          motivates the players.\n          \n          \n          JESSICA\n          Block it, Chloe! Yeah! Good attack! \n          \n          \n          Unfortunately, the volleyball heads toward Bella. She closes \n          her eyes and flails at it, SMACKING it. It flies off court \n          -\n          \n          \n          -- and beans a basketball player in the head. He is MIKE \n          NEWTON, good looking, affable, with blond spiky hair. \n          \n          \n          MIKE \n          Ow!\n          \n          \n          BELLA\n          (hurries to him, \n          \n          \n          embarrassed)\n          Are you alright? I warned them not \n          to make me play.\n          \n          \n          MIKE\n          It's only a flesh wound.\n          \n          \n          Mike grins and she smiles, relieved. A BELL RINGS, class over. \n          \n          \n          MIKE\n          You're Isabella, right? \n          \n          \n          \n          9.\n          BELLA\n          Just Bella. \n          \n          \n          MIKE\n          I'm Mike. Newton.\n          \n          \n          He looks at her a second too long, clearly taken by her -\n          -\n          Suddenly, Jessica appears, stepping between them. Subtle, \n          but possessive as she nudges Mike.\n          \n          \n          JESSICA\n          She's got a great spike, doesn't \n          she? \n          \n          \n          (to Bella)\n          So, you're from Arizona, right? \n          Aren't people supposed to be tan \n          down there?\n          \n          \n          BELLA\n          That's why they kicked me out.\n          \n          \n          Mike laughs, and because he does, Jessica does. Bella just \n          feels uncomfortable with the attention..\n          .\n          \n          \n          15 INT. CAFETERIA - DAY 15\n          \n          \n          FOLLOW Bella, Mike and Jessica as they carry their trays to \n          a \n          table. Eric appears, and squishes into a seat next to Bella. \n          \n          \n          ERIC\n          Mike, you met my home girl Bella. \n          \n          \n          MIKE\n          Your home girl?\n          \n          \n          JESSICA\n          \n          \n           (to Bella)\n          It's first grade all over again, \n          and you're the shiny new toy.\n          \n          \n          Bella smiles awkwardly. Suddenly, a FLASHBULB blinds Bella. \n          She looks up at the photographer, ANGELA, Jessica's sweet, \n          low key, insecure friend. \n          \n          \n          ANGELA\n          Sorry, needed a candid for the feature \n          -\n          \n          \n          ERIC\n          Feature's dead, Angela. Don't bring it \n          up again.\n          \n          \n          (to Bella)\n          I got your back, baby.\n          \n          \n          \n          10.\n          ANGELA\n          \n          \n          (disappointed)\n          Guess we'll just run another editorial on \n          teen drinking. \n          \n          \n          BELLA\n          Sorry. There's always eating disorders, \n          or Speedo padding on the swim team \n          -\n          \n          \n          ANGELA\n          -- Wait, that's a good one..\n          .\n          \n          \n          But Bella's attention is now riveted to \n          -\n          \n          \n          BELLA'S POV - THE DOUBLE DOORS OF THE CAFETERIA \n          \n          \n          They swing open as four of the most astounding people Bella's\n          ever seen enter (IN SLOW MOTION): THE CULLENS. Two guys, two \n          girls, all chalky pale, purplish shadows under their eyes..\n          . \n          and all devastatingly beautiful. \n          \n          \n          They move through the room with effortless grace, and take a seat \n          at a table furthest from Bella's. Bella leans over to Jessica and\n          Angela.\n          \n          \n          BELLA\n          Who are they?\n          \n          \n          ANGELA\n          The Cullens. \n          \n          \n          Jessica leans in, swinging into gossip mode.\n          \n          \n          JESSICA\n          Doctor and Mrs. Cullen's foster \n          kids. They all moved down here \n          from Alaska two years ago. \n          \n          \n          ANGELA\n          They kinda keep to themselves.\n          \n          \n          JESSICA\n          Because they're all together. \n          Like, together together. The \n          blonde girl, Rosalie, and the big \n          dark-haired guy, Emmett..\n          .\n          \n          \n          ON ROSALIE, 18, long blonde hair, model beautiful, knows it. \n          Alongside her is EMMETT, 17, big, brawny, like a weight \n          lifter, but a playful glint in his eye. \n          \n          \n          JESSICA\n          ... they're a thing. I'm not even\n          sure that's legal.\n          \n          \n          \n          11.\n          ANGELA\n          Jess, they're not actually related. \n          \n          \n          JESSICA\n          But they live together. And the \n          little dark haired girl, Alice, \n          she's really weird..\n          . \n          \n          \n          ON ALICE, 17, pixie-like, rail thin, light on her feet with short, \n          black hair going in every direction. She hovers over, JASPER, 18, \n          honey-blond hair, tall, lean, slightly tortured.\n          \n          \n          JESSICA\n          ... she's with Jasper, the blonde \n          who looks like he's in pain. \n          I \n          mean, Dr. Cullen's like this foster \n          dad slash match maker. \n          \n          \n          ANGELA\n          Maybe he'll adopt me.\n          \n          \n          Bella laughs, liking her... then sees the last Cullen to enter \n          -\n          \n          \n          EDWARD, 17. Lanky, with untidy, bronze colored hair. He seems \n          inwardly turned, mysterious. More boyish than the others. But \n          the most striking of all. Bella can't take her eyes off him.\n          \n          \n          BELLA\n          Who's he?\n          \n          \n          JESSICA\n          That's Edward Cullen.\n          \n          \n          Suddenly, Edward looks over, as if he heard Jessica from \n          across the room. His eyes meet Bella's. But he seems..\n          . \n          confused. Bella quickly looks away. \n          \n          \n          JESSICA\n          He's totally gorgeous, obviously. \n          But apparently, no one here is good \n          enough for him. Like I care. \n          \n          \n          (she obviously does)\n          Anyway, don't waste your time. \n          \n          \n          BELLA\n          I wasn't planning on it.\n          \n          \n          But Bella can't help but peek at Edward again. He's staring\n          at her outright now, with a slightly frustrated expression \n          that unnerves Bella. She hides behind her hair.\n          \n          \n          16 INT. BIOLOGY CLASS - DAY 16\n          \n          \n          A room of black-topped lab tables. Two to a table. Bella \n          and Mike enter. \n          \n          \n          \n          12.\n          Mike takes his seat and points her toward MR. MOLINA, \n          Birkenstocked, enthusiastic science teacher at the head of \n          the class. As Bella moves to the teacher with her class \n          slip, she notes \n          -\n          \n          \n          EDWARD -- his back to her, sitting at a front table. But as \n          she passes Edward's table..\n          .\n          \n          \n          SLOW MOTION -- the breeze she creates when she passes lifts \n          a \n          piece of paper next to Edward. We're still on his back as he\n          inhales --then abruptly stiffens. He grabs onto the edge of \n          the table, crumbling it slightly. No one notices. \n          \n          \n          Mr. Molina takes Bella's class slip. \n          \n          \n          MR. MOLINA\n          Welcome, Ms. Swan. Follow along as \n          best you can till you get caught \n          up. \n          \n          \n          Mr. Molina gestures to the only empty seat... next to Edward. \n          But as Bella approaches, she's taken aback when \n          -\n          \n          \n          ON EDWARD'S FACE -he slowly looks up at her, his eyes coal\n          black with repulsion, fury. If looks could literally kill..\n          .\n          \n          \n          Bella knocks someone's book bag off their chair. Replaces it,\n          mumbling an apology. Then slinks reluctantly into her seat. \n          Edward jerks away from her to the extreme edge of his chair. \n          \n          \n          MR. MOLINA\n          \n          \n          (to the class, animated)\n          \n          \n          Today we'll be observing the behavior \n          \n          \n          of planaria, a.k.a flatworms.\n          \n          \n          As Mr. Molina distributes two petri dishes per table \n          -\n          \n          \n          MR. MOLINA\n          We're going to cut them in half, \n          then watch them regenerate into two \n          separate worms..\n          . \n          \n          \n          Bella glances at Edward who averts his face, holding a hand over \n          his nose as if he smells something horrible. \n          \n          \n          Bella, shrinking, subtly sniffs the air, smells nothing. \n          Then she sniffs her hair. It's fine. She's perplexed. Mr.\n          Molina hands Edward two petri dishes.\n          \n          \n          MR. MOLINA\n          ... Yes, folks, zombie worms! They \n          just won't die.\n          \n          \n          Edward takes a dish, then slides the second one across the \n          table to Bella as if she had Ebola. She takes her dish, and \n          makes a dark curtain of her hair between them. \n          \n          \n          \n          13.\n          She can see EDWARD'S HANDS under the table. Clenched into\n          fists. Off Bella, utterly baffled, and deeply insecure..\n          .\n          \n          \n          17 INT. HIGH SCHOOL - HALLWAY - DAY 17\n          \n          \n          -- as the BELL RINGS, Edward bolts out the door. Other kids \n          and Bella exit a moment later. Bella looks down the hall; \n          he's gone. \n          \n          \n          18 INT. ADMINISTRATION OFFICE - DAY 18\n          \n          \n          Bella enters, but nearly turns and leaves when she sees \n          -\n          \n          \n          EDWARD sweet-talking the enchanted female ADMINISTRATOR, \n          40's. He doesn't see Bella enter.\n          \n          \n          EDWARD\n          \n          \n          There must be something open sixth \n          \n          \n          period. Physics? Biochem?\n          \n          \n          ADMINISTRATOR\n          \n          \n          No, every class is full. I'm \n          \n          \n          afraid you'll have to stay in \n          \n          \n          biology. I'm so sorry. \n          \n          \n          Bella blanches. The Administrator sees her and gestures for \n          her to wait a minute. \n          \n          \n          But Edward suddenly straightens as if sensing Bella. He slowly \n          turns to glare at her with piercing, hate-filled eyes. She backs \n          to the wall, hugging herself, suddenly chilled... with fear. \n          \n          \n          EDWARD\n          (to the Administrator)\n          I'll just... endure it. \n          \n          \n          He strides out the door. Off Bella..\n          . \n          \n          \n          19 EXT. HIGH SCHOOL - DAY 19\n          \n          \n          Edward climbs into a shiny new silver Volvo with the Cullens,\n          while Bella, upset, hurries to her truck. The many eyes still \n          watching her add insult to injury. ... Finally, she reaches \n          -\n          \n          \n          20 INT. BELLA'S TRUCK (CONTINUOUS) 20\n          \n          \n          -- and closes the door. Her eyes well... but she fights it, \n          getting mad. \n          \n          \n          BELLA\n          Jerk.\n          \n          \n          As she tries to start the car, choking the engine, we begin to \n          hear a MAN'S RAGGED, FRIGHTENED BREATH \n          -\n          \n          \n          SMASH TO:\n          \n          \n          \n          14.\n          21 ECU ON A SECURITY GUARD - IN THE DARKNESS 21\n          \n          \n          Extremely tight on his terrified FACE, sweat dripping, breathing \n          in short gasps, trying desperately not to make a sound. INCLUDE \n          -\n          \n          \n          22 INT. GRISHAM MILL - LATE AFTERNOON 22\n          \n          \n          --He's crouched in a dark corner. But then he sees a SHADOW\n          move blindingly fast past him. He jerks around, then another \n          SHADOW flies past, too fast to follow. He BOLTS!\n          \n          \n          He runs up a flight of stairs, harsh lights from the exterior of \n          the mill striating him. He moves as fast as humanly possible \n          -\n          \n          \n          UNKNOWN POV - ON THE SECURITY GUARD FROM SEVERAL FLOORS BELOW\n          \n          \n          UNKNOWN POV charges after him at an INHUMAN SPEED through this \n          maze of pillars and walkways. We dodge skull-crushing beams, \n          LEAP from one floor up to the next, up ladders, scaffolding, \n          beams, up, and up, getting closer and closer to \n          -\n          \n          \n          THE SECURITY GUARD\n          \n          \n          -- who desperately runs for his life, looking over his shoulder \n          with terror. UNKNOWN POV is closing in on him, but then he \n          BOLTS out a door \n          -\n          \n          \n          23 EXT. GRISHAM MILL (CONTINUOUS) - LATE AFTERNOON 23\n          \n          \n          -- The guard BURSTS OUT onto a stair landing, but loses his \n          footing and TRIPS, breaking through the rail and pitching \n          over the side, into the air \n          -\n          \n          \n          -- and stops, hovering mid-air, a yard from the landing. \n          A \n          HAND grips his shirt, then YANKS him out of the air and out \n          of frame with incredible strength. His guttural SCREAM is \n          choked short as BLOOD SPRAYS THE LANDING..\n          .\n          \n          \n          24 INT. FORKS COFFEE SHOP - LATE AFTERNOON 24\n          \n          \n          ON A TOP SIRLOIN STEAK as it is set in front of Charlie. He \n          shares a table with Bella. INCLUDE the waitress, CORA, 30's.\n          She beams at Bella as she sets a plate of cod in front of her.\n          \n          \n          Several LOGGERS at the counter offer Bella welcoming smiles. She \n          shrinks in her seat at the attention. Charlie's oblivious.\n          \n          \n          CORA\n          \n          \n          Can't get over how grown up you \n          \n          \n          are. And so gorgeous. \n          \n          \n          Bella glances at Charlie, who keeps his eyes on his steak. \n          A \n          bearded, hippy logger, WAYLON FORGE, 50, appears behind Cora, \n          leaning over her shoulder to Bella \n          -\n          \n          \n          \n          15.\n          WAYLON\n          \u0091Member me, honey? I was Santa one year.\n          \n          \n          CHARLIE\n          Waylon, she hasn't had a Christmas \n          here since she was four.\n          \n          \n          WAYLON\n          Bet I made an impression, though. \n          \n          \n          CHARLIE\n          You always do. \n          \n          \n          CORA\n          Let the girl eat her cod, Waylon. \n          \n          \n          (to Bella)\n          When you're done, I'll bring your \n          favorite - berry cobbler. Remember? \n          Your dad still has it. Every Thursday.\n          \n          \n          BELLA\n          (doesn't remember at\n          all)\n          That'd be great, thank you.\n          \n          \n          Cora shoos Waylon away. Left alone now, Charlie and Bella \n          both reach for the salt, knock hands. Charlie goes for the \n          ketchup instead. Silence as they eat. \n          \n          \n          A burst of LAUGHTER from a nearby happy FAMILY only serves to \n          emphasize their discomfort. Bella tries to bridge the gap.\n          \n          \n          BELLA\n          So... you eat here every night?\n          \n          \n          CHARLIE\n          Easier than washing dishes.\n          \n          \n          BELLA\n          I can cook.\n          \n          \n          He looks up, as if confused by the concept.\n          \n          \n          BELLA\n          I do the cooking at home - in Phoenix. \n          Mom's not great in the kitchen.\n          \n          \n          CHARLIE\n          I remember..\n          . \n          \n          \n          They both laugh -- recalling an especially bad dinner. \n          \n          \n          CHARLIE\n          How was school? Meet anyone?\n          \n          \n          \n          16.\n          BELLA\n          A few people... Do you know the \n          Cullen family?\n          \n          \n          CHARLIE\n          (looks up sharply)\n          Are people talking about them again?\n          \n          \n          BELLA\n          No... well, a little.\n          \n          \n          CHARLIE\n          Just \u0091cause they're newcomers. We're \n          lucky to have a surgeon like Dr. \n          Cullen at our podunk hospital. Lucky \n          his wife wanted to live in a small \n          town. Lucky his kids aren't like \n          a \n          lot of the hell-raisers around here.\n          \n          \n          BELLA\n          ... Okay.\n          \n          \n          CHARLIE\n          I just don't like narrow\n          mindedness. \n          \n          \n          And he returns to his food. Silence. \n          \n          \n          25 INT. BELLA'S ROOM - NIGHT 25\n          \n          \n          Bella looks out at the fog as she talks on the phone. \n          \n          \n          RENE (O.S.\n          )\n          If spring training goes well, we could \n          be living in Florida permanently. \n          \n          \n          TELEPHONE OPERATOR (O.S.)\n          Please insert 25 cents to continue.\n          \n          \n          BELLA\n          Mom, where's your cell?\n          \n          \n          INTERCUT WITH:\n          \n          \n          26 EXT. GAS STATION/GARAGE - NIGHT 26\n          \n          \n          Rene talks on a pay phone, her dead cell phone in her hand. \n          In the b.g., Phil and an Attendant work on the Subaru engine. \n          \n          \n          RENE\n          Ok, I didn't lose my power cord. It \n          ran away. Screaming. I literally \n          repel technology now.\n          \n          \n          \n          17.\n          Bella smiles, missing her mom. Rene feeds the phone \n          quarters. \n          \n          \n          RENE\n          \n          \n          Now, tell me more about your \n          \n          \n          school, baby. What are the kids \n          \n          \n          like? Are there any cute guys? \n          \n          \n          Are they being nice to you?\n          \n          \n          BELLA\n          \n          \n          (a beat, lying)\n          \n          \n          They've all been really..\n          . \n          \n          \n          welcoming.\n          \n          \n          PUSH IN ON BELLA'S FACE, getting mad all over again as..\n          .\n          \n          \n          FLASH POP TO -EDWARD'S FACE, HIS COAL BLACK EYES, THE FURY..\n          .\n          \n          \n          SMASH TO:\n          \n          \n          27 EXT. HIGH SCHOOL - MORNING (BEFORE SCHOOL) 27\n          \n          \n          ON BELLA, sitting atop a table, an open book in her lap. But her \n          eyes are on the arriving kids, and the parking lot as they pull \n          in. She's waiting for Edward.\n          \n          \n          Jessica, Angela, Mike and Eric kick around a soccerball \n          nearby. They wave Bella to join them but she smiles, \n          declining... and returns to watching for Edward. Her face \n          tells us she's ready for a confrontation. \n          \n          \n          28 INT. BIOLOGY CLASS - SAME DAY 28\n          \n          \n          Bella strides in... but stops, surprised to find her lab \n          table empty. Off Bella, frustrated..\n          .\n          \n          \n          BEGIN A SERIES OF SCENES OVER SEVERAL DAYS:\n          \n          \n          29 INT. CAFETERIA - DIFFERENT DAY 29\n          \n          \n          Bella sits with Jessica and Angela who watch a YouTube video \n          on their phone. Bella gives it a cursory look, but is \n          focused on the Cullen table --only four of them. Edward's\n          seat is empty..\n          . \n          \n          \n          30 INT. GIRLS BATHROOM - DIFFERENT DAY 30\n          \n          \n          Bella washes her hands, then looks up at the mirror, startled to \n          find Rosalie and Alice behind her. They study Bella, Rosalie \n          with chillingly cold eyes, Alice with curiosity. Bella, uneasy, \n          hurries out.\n          \n          \n          31 EXT. FORKS HIGH SCHOOL - DIFFERENT DAY 31\n          \n          \n          Bella exits with Angela, Mike, Jessica and Eric, becoming a part \n          of this circle. \n          \n          \n          \n          18.\n          She now only glances at Rosalie's car, a red M3 BMW, as it drives\n          past, noting, again, four Cullens, no Edward. Bella returns to \n          her friends, finally forgetting about him..\n          .\n          \n          \n          SERIES OF SCENES ENDS as we go to \n          -\n          32 INT. CHARLIE'S HOUSE - LIVING ROOM - MORNING 32\n          It's neater, rearranged more attractively. Clearly, Bella's\n          given it her touch. She sweeps through, folding Charlie's\n          fleece jacket, straightening up. She grabs her book bag \n          -\n          BELLA\n          Dad, I'm heading out.\n          33 EXT. CHARLIE'S HOUSE (CONTINUOUS) - MORNING 33\n          ON BELLA'S FACE as she opens the door and stops, dismay\n          filling her. It's pouring down rain --the yard is full of\n          puddles, some frozen. Bella shivers, wraps her coat tight.\n          BELLA\n          Great. \n          WHIP PAN to the driveway as Charlie pulls in -driving her \n          truck. \n          BELLA\n          Dad, I can drive myself to school.\n          \n          \n          As she walks down the steps, she doesn't realize, something's \n          watching her -\n          -\n          UNKNOWN POV - FROM THE TREES \n          --tracking Bella's every move as she slips and falls on \n          a\n          \n          \n          patch of ice -\n          -\n          BACK ON BELLA - fallen on her ass. Charlie climbs out of the \n          truck, helps her up. \n          CHARLIE\n          You okay, Bells?\n          BELLA\n          Ice doesn't help the uncoordinated.\n          \n          \n          CHARLIE\n          That's why I got you new tires. \n          She looks over at the truck -- yep, four new tires.\n          CHARLIE\n          \n          \n          The other ones were nearly bald. \n          \n          \n          \n          19.\n          BELLA\n          You got me new tires. No one's \n          ever done that before.\n          \n          \n          Charlie looks at her, confused.\n          \n          \n          BELLA\n          I mean... nothing.\n          \n          \n          He clearly doesn't get it as heads toward his Cruiser.\n          \n          \n          CHARLIE\n          I'll be late for dinner. I'm heading \n          down to Mason County. A security guard \n          at the Grisham Mill got killed by some \n          kind of animal..\n          .\n          \n          \n          UNKNOWN POV - ON BELLA AND CHARLIE, as he speaks..\n          .\n          \n          \n          BELLA\n          An animal?\n          \n          \n          CHARLIE\n          You're not in Phoenix any more, \n          honey. They've been hunting it for \n          a week with no luck. Thought I'd \n          lend a hand.\n          \n          \n          BELLA\n          Be careful.\n          \n          \n          CHARLIE\n          Always am.\n          \n          \n          BACK ON BELLA..\n          . \n          \n          \n          BELLA\n          And thank you. For the tires.\n          \n          \n          He sees emotion in her eyes. Doesn't understand it, but nods,\n          heads inside. Bella looks at the tires again, oddly moved..\n          .\n          \n          \n          34 OMITTED 34\n          \n          \n          35 INT. BIOLOGY CLASS/HALLWAY - DAY 35\n          \n          \n          Rain beats on the roof as Eric walks Bella into class. She \n          brushes water off her coat as he chats her up.\n          \n          \n          ERIC\n          ... and yeah, prom committee is \n          a \n          chick thing, but I gotta cover it \n          for the paper anyway, and they need \n          a guy to help choose the music -\n          -\n          So I need your play list \n          -\n          \n          \n          \n          20.\n          Bella is about to respond when Mike comes up behind her.\n          \n          \n          MIKE\n          Come on, Arizona. Give it up for \n          the rain.\n          \n          \n          And he shakes his wet baseball cap onto Bella's head.\n          \n          \n          BELLA\n          Terrific. \n          \n          \n          She heads toward her seat, brushing off her hair. But she \n          freezes when she sees --Edward. \n          \n          \n          Bella straightens, girding herself. Then strides to the \n          table, and confidently drops her books down, ready to address \n          him. But he looks up at her \n          -\n          \n          \n          EDWARD\n          Hello.\n          \n          \n          Bella stops. Stunned. He is direct, precise, as if every \n          word is an effort for him. \n          \n          \n          EDWARD\n          I didn't have a chance to introduce \n          myself last week. My name is \n          Edward Cullen. \n          \n          \n          She's too shocked that he's talking to her to answer.\n          \n          \n          EDWARD\n          (prompting)\n          ... You're Bella.\n          \n          \n          BELLA\n          I'm... yes. \n          \n          \n          Feeling like an idiot, she quickly sits. He abruptly moves to \n          the extreme edge of his seat. She's even more baffled now.\n          \n          \n          MR. MOLINA\n          \n          \n          (to the class)\n          Onion root tip cells! That's \n          what's on your slides. Separate \n          and label them into the phases of \n          mitosis. The first partners to get \n          it right, win... the golden onion! \n          \n          \n          He excitedly holds up a spray painted onion. Everyone just \n          looks at him. He's disappointed by their apathy.\n          \n          \n          MR. MOLINA\n          Come on, people. Tick tock.\n          \n          \n          \n          21.\n          Everyone sets to work. Edward pushes the microscope to \n          Bella, keeping his distance, his voice controlled.\n          \n          \n          EDWARD\n          Ladies first. \n          \n          \n          She grabs the microscope defensively and snaps the first slide \n          in, adjusting the lens. She's curt as she addresses him.\n          \n          \n          BELLA\n          You've been gone.\n          \n          \n          EDWARD\n          Out of town. For personal reasons.\n          \n          \n          She glances at him but he just leans far away, his face \n          tight. She looks back into the microscope.\n          \n          \n          BELLA\n          Prophase. \n          \n          \n          She begins to remove the slide. \n          \n          \n          EDWARD\n          May I look?\n          \n          \n          She slides him the microscope. He glances through the lens.\n          \n          \n          EDWARD\n          Prophase.\n          \n          \n          BELLA\n          (muttering)\n          Like I said.\n          \n          \n          He writes it on the worksheet. Then he takes a breath, as if \n          trying calm himself, and turns to her with enormous effort.\n          \n          \n          EDWARD\n          Enjoying the rain?\n          \n          \n          BELLA\n          Seriously? You're asking me about the \n          weather?\n          \n          \n          EDWARD\n          It appears.\n          \n          \n          BELLA\n          No. I don't like the cold. Or the \n          wet. Or the gray. Or parkas. Or \n          turtle necks. \n          \n          \n          Is that a smile playing on his lips? For the first time, he \n          seems more intrigued than agonized. He studies her. She still \n          can't tell if he despises her or not. It's infuriating.\n          \n          \n          \n          22.\n          BELLA\n          \n          \n          What?\n          \n          \n          He shakes his head and turns to the microscope, switching out \n          \n          \n          the slides. She looks at him. And keeps looking..\n          . \n          \n          \n          BELLA'S POV - ECU ON EDWARD'S FACE\n          \n          \n          His cheekbones, his lips. So perfect, like a sculpture..\n          .\n          EDWARD\n          \n          \n          Anaphase. \n          She snaps out of it. Covers with a dry look. \n          BELLA \n          May I? \n          \n          (she looks through the \n          lens)\n          Anaphase.\n          \n          \n          EDWARD\n          Like I said.\n          \n          \n          She glances at him, and this time sees a smirk. She simply \n          holds out her hand for another slide.\n          \n          \n          EDWARD\n          \n          \n          (handing her the slide)\n          If you hate cold and rain, why move to \n          the wettest place in the continental U.S.\n          \n          \n          BELLA\n          It's complicated.\n          \n          \n          EDWARD\n          I think I can keep up.\n          \n          \n          He actually seems interested. She looks into the microscope as \n          -\n          \n          \n          BELLA\n          My mother remarried. \n          \n          \n          EDWARD\n          Very complex. So you don't like him.\n          \n          \n          BELLA\n          Phil is fine. Young for her, but \n          nice enough.\n          \n          \n          (re: the slide)\n          Interphase.\n          \n          \n          CUT ON THE SCHOOL BELL:\n          \n          \n          \n          23.\n          36 INT. HIGH SCHOOL - HALLWAY - MOMENTS LATER 36\n          \n          \n          Bella exits holding the golden onion, and practically runs \n          into Edward, who's directly in front of her. \n          \n          \n          EDWARD\n          \n          \n          Why didn't you stay with your mom \n          \n          \n          and stepdad?\n          \n          \n          He waits for her answer, studying her, as if trying to decipher \n          her. She's drawn in by his attention, oddly compelled.\n          \n          \n          BELLA\n          \n          \n          Alright, Phil's a minor league \n          \n          \n          baseball player, so he travels \n          a \n          \n          \n          lot. My mother stayed home with me \n          \n          \n          but it made her unhappy. So \n          I \n          \n          \n          decided to spend time with my \n          \n          \n          father.\n          \n          \n          EDWARD\n          But now you're unhappy. \n          \n          \n          BELLA\n          No... I -- I just..\n          .\n          \n          \n          Bella turns away -- embarrassed, vulnerable. \n          \n          \n          EDWARD\n          \n          \n          I'm just trying to figure you out. \n          \n          \n          You're very hard to read.\n          \n          \n          He's clearly trying to read her now... their eyes meet again.\n          But now she looks more closely at him.\n          \n          \n          BELLA\n          Did you get contacts? \n          \n          \n          EDWARD\n          ... no.\n          \n          \n          BELLA\n          \n          \n          Your eyes were black before, now \n          \n          \n          they're this golden brown or \n          -\n          \n          \n          EDWARD\n          It's just the fluorescents.\n          \n          \n          He abruptly turns and walks away. As he does, Bella notes -\n          -\n          HIS HANDS clenched into tight fists. Off Bella, utterly \n          bewildered, both intrigued and frustrated.\n          \n          \n          37 EXT. HIGH SCHOOL - PARKING LOT - DAY 37\n          \n          \n          The rain has stopped, but the parking lot is full of water \n          and patches of black ice. \n          \n          \n          \n          24.\n          Shivering, Bella heads for her truck, carrying the onion, \n          carefully navigating the icy puddles. As she reaches her \n          truck, she looks across the lot \n          \n          \n          EDWARD stands by his silver Volvo with his siblings, about to \n          climb in. A moment as their eyes meet... then he looks toward the \n          sound of a high pitched SCREECH, that quickly grows LOUDER..\n          . \n          \n          \n          Bella turns to see a VAN -- skidding on the ice, careening out of \n          control, heading directly for her. TIME suddenly fractures, \n          compressing to stillness, then exploding in bursts of speed as \n          -\n          \n          \n          -- THE FACES OF THE STUDENTS - in shock, seeing what's coming.\n          --THE VAN DRIVER'S FACE -TYLER, desperately trying to gain\n          control, then shielding his face.\n          -- EDWARD'S FACE - looking at Bella with horror..\n          . \n          \n          \n          THE VAN is about to hit Bella's truck, with her standing in \n          between, when suddenly, something knocks Bella down, pinning \n          her to the ground. She looks up - Edward is on top of her. \n          \n          \n          The world around them FREEZES -- in this fraction of \n          a \n          second, their proximity is overwhelming, electrifying. He \n          breathes in her scent, she takes in his flawless face..\n          .\n          \n          \n          Abruptly, we BLAST BACK TO SPEED as several things happen so \n          quickly, we, and Bella, are unsure what's going on:\n          \n          \n          -- THE VAN SMASHES into the back of Bella's truck \n          -\n          -- Then SPINS around, once again careening toward her and \n          Edward, then suddenly \n          -\n          --EDWARD'S HANDS are creating a deep dent in the side of the\n          van's body as it shudders to a stop, a foot from Bella. \n          -- Edward literally pushes the van away.\n          \n          \n          Then silence. A long beat, void of any sound, as Bella looks at \n          Edward, trying to absorb what just happened. Edward's fear for\n          her is still alive on his face. She starts to speak but..\n          .\n          \n          \n          THE SCREAMING begins, yelling, calls for help. People leap to \n          Tyler's aid, run to Bella and Edward. Bella SEES the onion on the\n          ground, smashed as she would have been. As everyone sweeps in, \n          Edward moves into the b.g. Mike and Eric run to Bella \n          -\n          \n          \n          MIKE ERIC\n          \n          \n          Are you okay!? Are you What happened!? Did anyone \n          \n          \n          hurt?! see what happened?\n          !\n          \n          \n          Amid the chaos, Bella sees EDWARD'S SIBLINGS looking at\n          Edward. But they show no hint of concern for his safety. \n          Instead, they look at him with disapproval... and fury. \n          \n          \n          38 INT. HOSPITAL - TREATMENT AREA - DAY 38\n          \n          \n          The double doors BURST open as Charlie runs in, face white \n          with terror. He spots \n          -\n          \n          \n          \n          25.\n          BELLA - sitting on a gurney, the E.R. DOCTOR looking into her \n          eyes with a pen light. On the next gurney over, Tyler, the \n          van's driver, lies with a mild head wound. Charlie rushes up.\n          \n          \n          CHARLIE\n          Bells. Are you alright?\n          \n          \n          BELLA\n          I'm fine, dad. Calm down.\n          \n          \n          TYLER\n          I'm so sorry, Bella. I tried to stop.\n          \n          \n          BELLA\n          It's okay, Tyler.\n          \n          \n          CHARLIE\n          It sure as hell is not okay.\n          \n          \n          BELLA\n          Dad, it's not his fault-\n          \n          \n          CHARLIE \n          (stern, cutting her off)\n          We nearly lost you.\n          \n          \n          BELLA\n          But you didn't.\n          \n          \n          He'd hug her, if that was who he, or who she was. Instead,\n          he glares at Tyler.\n          \n          \n          CHARLIE\n          You can kiss your license goodbye.\n          \n          \n          DR. CULLEN (O.S.\n          )\n          I heard the Chief's daughter was here.\n          \n          \n          They look up as DR. CARLISLE CULLEN, mid 30's, approaches, blond,\n          movie star handsome. His face is kind, but pale, tired. \n          \n          \n          CHARLIE\n          Good. Dr. Cullen. \n          \n          \n          DR. CULLEN\n          (to E.R. Doctor)\n          I've got this one, Jackie.\n          \n          \n          The E.R. Doctor hands Dr. Cullen the chart, exits. Dr. Cullen \n          reviews her chart, then feels the back of her head as..\n          .\n          \n          \n          \n          26.\n          DR. CULLEN\n          You have a nice knot growing back \n          there, but your x-rays show no \n          indication of concussion. \n          \n          \n          TYLER\n          I'm so sorry, Bella. I'm really \n          -\n          \n          \n          Charlie abruptly pulls the curtain between them. \n          \n          \n          BELLA\n          It would have been a lot worse if Edward \n          hadn't knocked me out of the way.\n          \n          \n          CHARLIE\n          Edward? Your boy?\n          \n          \n          Dr. Cullen quickly looks back at the chart. Bella's \n          intuition flickers, sensing he knows something. She presses.\n          \n          \n          BELLA\n          It was amazing he got to me so \n          fast. He was nowhere near me.\n          \n          \n          DR. CULLEN\n          (smiles)\n          As long as you're safe. \n          \n          \n          INT. HOSPITAL - RECEPTION - DAY 39\n          \n          \n          Charlie and Bella exit the treatment area.\n          \n          \n          CHARLIE\n          I just have to sign some paperwork. \n          You better call your mom.\n          \n          \n          BELLA\n          You told her?! She's probably freaking.\n          \n          \n          He shrugs and hurries off. Bella shakes her head, pulls out her \n          cell phone. Is about to dial, but then sees down the hall..\n          .\n          \n          \n          BELLA'S POV - EDWARD, ROSALIE, AND DR. CULLEN\n          \n          \n          Rosalie is clearly furious at Edward who stands his ground. \n          Dr. Cullen plays intermediary. \n          \n          \n          ROSALIE\n          This isn't just about you, it's about \n          all of us -\n          -\n          \n          \n          Dr. Cullen sees Bella and stops Rosalie \n          -\n          \n          \n          DR. CULLEN\n          Let's take this in my office.\n          \n          \n          \n          27.\n          Rosalie glares at Edward as she goes off with Dr. Cullen. Edward \n          adopts a nonchalant air as Bella approaches, determined.\n          \n          \n          BELLA\n          Can I talk to you for a moment?\n          (off his nod)\n          How did you get over to me so quickly? \n          \n          \n          EDWARD\n          I was standing right next to you.\n          \n          \n          BELLA\n          You were next to your car, across \n          the lot.\n          \n          \n          He steps closer to her. His expression turns icy hard. \n          \n          \n          EDWARD\n          \n          \n          No, I wasn't.\n          \n          \n          She won't be bullied. Steps closer to him.\n          \n          \n          BELLA\n          Yes. You were. \n          \n          \n          EDWARD\n          You're confused. You hit your head. \n          \n          \n          BELLA\n          I know what I saw.\n          \n          \n          EDWARD\n          And what, exactly, was that?\n          \n          \n          BELLA\n          You stopped that van. You pushed\n          it away.\n          \n          \n          EDWARD\n          No one will believe that. \n          \n          \n          BELLA\n          I wasn't planning to tell anyone. \n          \n          \n          This registers with Edward. They're inches from each other,\n          the tension thick. \n          \n          \n          BELLA\n          I just want to know the truth.\n          \n          \n          EDWARD\n          Can't you just thank me and get \n          over it?\n          \n          \n          BELLA\n          \n          \n          Thank you.\n          \n          \n          \n          28.\n          A long beat as they look at each other, angry, defensive... and \n          without a doubt, attracted. \n          \n          \n          EDWARD\n          You're not going to let it go, are you?\n          \n          \n          BELLA\n          No.\n          \n          \n          EDWARD\n          (turns, walks away)\n          Then I hope you enjoy disappointment.\n          \n          \n          BELLA\n          Why did you even bother?\n          \n          \n          He stops, a beat. Looks back at her, unexpectedly vulnerable. \n          \n          \n          EDWARD\n          ... I don't know.\n          \n          \n          And he keeps walking. Off Bella, confused, frustratingly \n          attracted, and absolutely determined to find out the truth.\n          \n          \n          BELLA (V.O.\n          )\n          That was the first night I dreamed \n          of Edward Cullen..\n          .\n          \n          \n          40 DREAM SEQUENCE - UNDERWATER 40\n          \n          \n          Bella swims, white skin aglow, hair floating weightlessly, \n          sensually... suddenly, something BLASTS past her. She spins. \n          It's gone. Something BLASTS behind her. She spins again -\n          to find herself face to face with \n          -\n          \n          \n          EDWARD ... Bella reaches for him, but he abruptly springs \n          backward, just out of reach. \n          \n          \n          SMASH TO:\n          \n          \n          41 INT. BELLA'S ROOM - ON BELLA - NIGHT 41\n          \n          \n          -as she bolts up awake. In that split second, in the darkness, \n          she SEES Edward, watching her. She SNAPS on the light -- the \n          room is empty. Was she dreaming? \n          42 EXT. HIGH SCHOOL - PARKING LOT - DAY 42\n          \n          \n          Bella stands in the exact spot of the accident. Behind her \n          on the lawn, several CLASSES congregate, gathering for \n          a \n          field trip. Mr. Molina is in charge.\n          \n          \n          MR. MOLINA\n          Make sure I get your permission slips.\n          \n          \n          \n          29.\n          PUSH IN ON BELLA'S FACE staring at the skid marks on the\n          pavement..\n          .\n          \n          \n          FLASH POP TO THE VAN REELING RIGHT FOR HER \n          -\n          \n          \n          FLASH POP TO EDWARD'S HANDS STOPPING THE VAN \n          -\n          \n          \n          FLASH POP TO EDWARD ON TOP OF HER, THE PROXIMITY, ELECTRICITY \n          -\n          \n          \n          BACK ON BELLA, blushing at the memory. Then she SEES Edward \n          arrive with Alice and Jasper. She watches him, barely noticing as \n          Mike trots up to her -\n          -\n          \n          \n          MIKE \n          (ala Dr. Frankenstein)\n          Look! You're moving. You're ALIVE!\n          \n          \n          BELLA\n          ... Yeah, false alarm..\n          .\n          \n          \n          MIKE\n          Actually, I'm glad you're not dead \n          \u0091cause - well, that would suck, plus \n          I \n          wanted to ask you - even though it's, \n          like, a month away..\n          .\n          \n          \n          But Bella's distracted by Edward. Mike's VOICE DIPS as..\n          .\n          \n          \n          BELLA'S POV - ACROSS THE LAWN\n          \n          \n          Edward, head down, is in quiet conference with Jasper and Alice. \n          Abruptly, he looks up, as if listening to her and Mike, though \n          he's too far away to hear. Bella quickly refocuses on Mike.\n          \n          \n          MIKE\n          So what do you think?\n          (off her blank look)\n          You want to go? To prom. With me.\n          \n          \n          BELLA\n          (realizing, horrified)\n          Prom. As in dance. I, uh - have to go \n          \n          \n          -somewhere. To Jacksonville. Yeah.\n          MIKE\n          You can't go another weekend? \n          \n          \n          BELLA\n          Non-refundable ticket. Maybe you \n          should ask Jessica. \n          \n          \n          Mike follows Bella's eyes way across the lawn to Jessica.\n          She smiles at them -- Suddenly Edward crosses in front of \n          Jessica. He seems to be smirking..\n          .\n          \n          \n          \n          30.\n          43 INT. COMMUNITY COLLEGE GREENHOUSE - FIELD TRIP - DAY 43\n          \n          \n          Mr. Molina and a Tour Guide lead several dozen kids through \n          the greenhouse. Bella keeps an eye on Edward who's up ahead\n          with Alice and Jasper. Mr. Molina demonstrates the compost \n          machine as the students mess around. \n          \n          \n          MR. MOLINA\n          ...c'mon, Eric, stuff that compost \n          down deep... that's it..\n          .\n          (the machine gurgles and spins)\n          ... now Tyler, take a big steaming \n          cup of \u0093compost tea.\u0094 This is \n          recycling at its most basic level -\n          -\n          hey, don't drink that!\n          \n          \n          When Bella sees Edward pause by an ancient staghorn fern, \n          alone, she takes a breath for courage and strides up to him. \n          \n          \n          BELLA\n          Hello, Edward.\n          \n          \n          He glances at her, merely nodding. We notice his FISTS clench, \n          and unclench. Bella looks at him, appalled by his rudeness.\n          \n          \n          BELLA\n          Really?\n          \n          \n          No response. She turns, starts to walk away. \n          \n          \n          EDWARD \n          What's in Jacksonville?\n          \n          \n          She turns back to him.\n          \n          \n          BELLA\n          How did you know about that? \n          \n          \n          EDWARD\n          You didn't answer my question.\n          \n          \n          BELLA\n          You haven't answered any of mine. \n          You won't even say hello.\n          \n          \n          EDWARD\n          Hello.\n          \n          \n          BELLA\n          And how did you stop that van?\n          \n          \n          EDWARD\n          Adrenaline rush. Very common. \n          Google it. \n          \n          \n          \n          31.\n          BELLA\n          \n          \n          (not buying it)\n          Floridians. That's what's in \n          Jacksonville.\n          \n          \n          She turns to storm off but she stumbles over the irrigation \n          hose. Edward steadies her, catching her scent -- still so \n          powerful... He clenches his jaw.\n          \n          \n          EDWARD\n          It helps if you actually watch\n          where you put your feet.\n          \n          \n          Insulted, she keeps moving. He keeps pace, serious now. \n          \n          \n          EDWARD\n          I know I've been rude, but it's for \n          the best.\n          \n          \n          She just looks at him like he's crazy. He walks away as\n          Jessica suddenly rushes up.\n          \n          \n          JESSICA\n          Guess who just asked me to prom!\n          \n          \n          Bella smiles.\n          \n          \n          JESSICA\n          I totally thought Mike was going to \n          ask you, Bella. Is it gonna be \n          weird? \n          \n          \n          BELLA\n          No way. Zero weirdness. You guys \n          are great together.\n          \n          \n          JESSICA\n          I know, right?\n          \n          \n          Giddy, Jessica rushes to catch up with Angela. Bella heads \n          out the door that leads to \n          -\n          \n          \n          EXT. COMMUNITY COLLEGE GREENHOUSE - THE BUSES (CONTINUOUS)44\n          \n          \n          --where everyone's looking at the COMPOST \u0093WORM BOX\u0094, grossing\n          each other out with the slimy creatures. As Bella backs away, \n          Edward steps up.\n          \n          \n          EDWARD\n          Bella, it would be better if we \n          weren't friends. \n          \n          \n          BELLA\n          \n          \n          (wounded)\n          Too bad you didn't figure that out \n          earlier. \n          \n          \n          (MORE)\n          \n          \n          \n          32.\n          BELLA (cont'd)\n          You could have let the van crush me \n          and saved yourself all this regret.\n          \n          \n          EDWARD\n          (snapping, angry)\n          You think I regret saving you?\n          \n          \n          BELLA\n          I know you do.\n          \n          \n          EDWARD\n          (furious)\n          You don't know anything.\n          \n          \n          His harshness stings her. Suddenly, Alice appears at \n          Edward's side. She eyes Bella with curiosity.\n          \n          \n          ALICE\n          The bus is leaving.\n          (to Bella)\n          Hi. Will you be riding with us?\n          \n          \n          EDWARD\n          No. Our bus is full.\n          \n          \n          He purposefully walks Alice away. But he glances back at \n          Bella with, is that... remorse? She doesn't see it.\n          \n          \n          INT. CHARLIE'S HOUSE - KITCHEN - EVENING 45\n          \n          \n          Bella enters, throws down her book bag and coat, still angry. \n          She starts upstairs but Charlie enters from the kitchen.\n          \n          \n          CHARLIE\n          Your mother called. Again.\n          \n          \n          BELLA\n          Your fault, for telling her about \n          the accident.\n          \n          \n          CHARLIE\n          She always did know how to worry. \n          \n          \n          (hint of sadness)\n          But... she's changed, too. She \n          seems happy. Phil sounds all \n          right.\n          \n          \n          BELLA\n          He is.\n          \n          \n          She continues upstairs, glancing at her parents' WEDDING PHOTO.\n          Off Bella's FACE, we MATCH CUT -\n          -\n          \n          \n          \n          33.\n          46 INT. HIGH SCHOOL - CAFETERIA - ON BELLA'S FACE - DAY 46\n          \n          \n          -- as she pushes through the doors. She glances over at the \n          CULLEN TABLE, Edward with his siblings. He doesn't look at her.\n          Anger and determination set in again as Bella joins Eric, \n          Jessica, Mike and Angela. She drops her book bag on a seat \n          -\n          \n          \n          ERIC\n          La Push, baby. You in?\n          \n          \n          BELLA\n          Should I know what that means?\n          \n          \n          MIKE\n          La Push beach, down on the Quileute \n          rez. We're all going after school. \n          Big swell coming in. \n          \n          \n          ERIC\n          And I don't just surf the internet.\n          \n          \n          JESSICA\n          Eric, you stood up once. On a foam \n          board.\n          \n          \n          ANGELA\n          There's whale watching, too. Come with. \n          \n          \n          ERIC\n          La Push, baby.\n          \n          \n          BELLA\n          I'll go if you stop saying that. \n          \n          \n          47 THE SALAD BAR STATION - MINUTES LATER 47\n          \n          \n          Bella artfully designs an architectural salad. As she \n          reaches for an APPLE, Edward is suddenly next to her \n          -\n          \n          \n          EDWARD \n          (charmed)\n          Edible art..\n          .\n          \n          \n          Startled, she fumbles and drops the apple -- Edward catches \n          it with his foot, hackeysack style, then bounces it back into \n          his hand, the red of the apple, stark against his pale skin. \n          He presents it to her with small smile.\n          \n          \n          BELLA\n          Thanks... but your mood swings are \n          giving me whiplash.\n          \n          \n          EDWARD\n          I said it would be better if we weren't \n          friends, not that I didn't want to be. \n          \n          \n          \n          34.\n          BELLA\n          What does that even mean?\n          \n          \n          EDWARD\n          It means if you were smart, you'd \n          avoid me.\n          \n          \n          Edward inadvertently glances at his four inhumanly beautiful \n          siblings, who wait for him, expectantly, at their table. \n          \n          \n          She notes her own, very human friends monitoring this \n          conversation from their table. Mike glowers jealously.\n          \n          \n          BELLA\n          So let's say, for argument's sake, \n          that I'm not smart. Would you talk \n          to me? Tell me the truth? \n          \n          \n          EDWARD\n          Probably not. I'd rather hear your \n          theories.\n          \n          \n          BELLA\n          Okay... how \u0091bout radioactive \n          spiders? Kryptonite?\n          \n          \n          EDWARD\n          (levels his gaze, \n          \n          \n          challenging)\n          You're talking about superheroes. \n          What if I'm not a hero? What if \n          I'm a bad guy?\n          \n          \n          BELLA\n          (beat, looking closer at him)\n          No. I don't believe that. You're \n          not bad. You can be a jerk, but \n          it's like this... mask. To keep \n          people away. \n          \n          \n          He's taken aback by her honesty, her insight, drawn in by her..\n          .\n          \n          \n          BELLA\n          Look, why don't we just - hang out. \n          Like... come to the beach with us. \n          It'll be fun - sand fleas, wind burn, \n          salt water stinging your eyes..\n          .\n          \n          \n          EDWARD\n          (small smile, considering \n          it)\n          Which beach?\n          \n          \n          BELLA\n          La Push. \n          \n          \n          \n          35.\n          His smile lessens almost imperceptibly. \n          \n          \n          BELLA\n          Is something wrong with that beach?\n          \n          \n          Edward glances over at Mike - the two exchange cold looks.\n          \n          \n          EDWARD\n          It's just a little crowded.\n          \n          \n          Off Bella, as Edward walks away..\n          .\n          \n          \n          48 EXT. LA PUSH BEACH - DAY 48\n          \n          \n          It's freezing, but Mike, Tyler, Jessica and others suit up\n          for a surf. Eric hangs with them. Bella wanders by the \n          driftwood with Angela, who takes photographs. \n          \n          \n          ANGELA\n          I keep thinking Eric's going to ask me \n          to prom, then he just... doesn't.\n          \n          \n          BELLA\n          You could ask him. \n          (off Angela's flustered \n          \n          \n          look)\n          Take control. You're a strong \n          independent woman.\n          \n          \n          ANGELA\n          I am?\n          \n          \n          JACOB (O.S.\n          )\n          Bella!\n          \n          \n          She looks up to see three Quileute boys approaching the group; \n          Jacob Black, and SAM and EMBRY. Bella smiles at Jacob. \n          \n          \n          BELLA\n          Guys, this is Jacob. Are you \n          stalking me?\n          \n          \n          JACOB\n          You're on my rez, remember? You \n          surfing?\n          \n          \n          BELLA\n          Definitely not. \n          \n          \n          JESSICA\n          (teasing)\n          Keep her company. Her date bailed. \n          \n          \n          ERIC\n          What date?\n          \n          \n          \n          36.\n          JESSICA\n          She invited Edward. \n          \n          \n          BELLA\n          (embarrassed)\n          To be polite.\n          \n          \n          ANGELA\n          I think it's nice she invited him. \n          No one ever does.\n          \n          \n          MIKE\n          Because Cullen's a freak.\n          \n          \n          SAM\n          You got that right.\n          \n          \n          BELLA\n          You know them?\n          \n          \n          SAM\n          (sharply)\n          The Cullens don't come here.\n          \n          \n          Jacob shoots Sam a look, shakes his head. Bella registers this. \n          A beat, then she casually pulls Jacob aside \n          -\n          \n          \n          BELLA\n          You want to go look at tide pools?\n          \n          \n          She offers an awkwardly flirtatious smile. He grins, \n          infatuated. As they head toward the water..\n          .\n          \n          \n          EXT. LA PUSH BEACH - LATER DAY 49\n          \n          \n          Bella and Jacob wander near the water, looking out to sea for \n          whales. The surfers are out on the waves. She nudges him, \n          continuing her attempt at flirtation..\n          .\n          \n          \n          BELLA\n          So, what did your friend mean about \n          the Cullens not coming here?\n          \n          \n          JACOB\n          Oops. Caught that, huh? \n          \n          \n          He moves closer to her, lowering his voice for mock-secrecy. \n          \n          \n          JACOB\n          I'm not supposed to say anything.\n          \n          \n          Bella gives him her best alluring smile.\n          \n          \n          BELLA\n          I can keep a secret..\n          .\n          \n          \n          \n          37.\n          JACOB\n          \n          \n           (laughing) \n          It's just an old scary story. Did \n          you know the Quileutes are \n          supposedly descended from wolves?\n          \n          \n          BELLA\n          Like fur, fangs ... doggy breath?\n          \n          \n          Jacob chuckles. Bella smiles and prompts him to continue..\n          .\n          \n          \n          BELLA\n          So the legend about the Cullens is..\n          .\n          \n          \n          JACOB\n          Well, they're supposedly descended \n          from this, like..\n          .\n          \n          \n           (in a spooky voice)\n          \n          \n          \u0093enemy clan.\u0094 ... But they \n          claimed to be different, so we made \n          a treaty with them. \n          \n          \n          BELLA\n          Didn't they just move here?\n          \n          \n          JACOB\n          Or just moved back.\n          \n          \n          BELLA\n          Riiiight. So what was this treaty?\n          \n          \n          JACOB\n          \n          \n           (whispering)\n          If they promised to stay off Quileute \n          lands, we wouldn't expose what they \n          really were to the pale-faces..\n          . \n          \n          \n          Jacob pauses dramatically --Bella shivers. \n          \n          \n          GIRL (O.S)\n          AAAAAAAAGH!!!!!!\n          !\n          \n          \n          Bella JUMPS at the bloodcurdling scream, as Angela runs past, \n          chased by Eric waving a dead crustacean. Jacob smirks and \n          starts back to the group.\n          \n          \n          BELLA\n          Wait... what were they really? \n          \n          \n          JACOB \n          (laughing)\n          It's just a story, Bella.\n          \n          \n          Off Bella, with more unanswered questions..\n          .\n          \n          \n          \n          38.\n          50 EXT. SHACK COMMUNITY ON THE RIVER - LATE AFTERNOON 50\n          \n          \n          A collection of haphazard shacks and boat docks, connected by \n          wood plank sidewalks. FIND Waylon Forge (the hippy logger \n          who used to play Santa Claus) scraping paint off his boat, \n          swigging a pint as he listens to his prehistoric Walkman. \n          \n          \n          His old DOG lies next to him as the sounds of the forest and \n          river chirp and buzz. Waylon sings along to his Walkman..\n          . \n          \n          \n          Suddenly, the sounds of nature abruptly SILENCE themselves. The \n          dog raises his head, starts to GROWL. Waylon doesn't notice.\n          \n          \n          STAY ON WAYLON, singing, working... until he looks up and \n          realizes the dog's gone.\n          \n          \n          WAYLON\n          Jerry?\n          \n          \n          Waylon pulls off the headphones. WHISTLES. No dog. Waylon \n          walks up a walkway... then sees a DOG LEG, sticking out from \n          under a bush. \n          \n          \n          WAYLON\n          Come on, Jerry, you old mutt..\n          .\n          \n          \n          He pulls at the leg. It's detached. He reels back, stumbling \n          onto his boat, frantically untying the line and pushing out \n          -\n          \n          \n          ON THE WATER - Waylon floats, breath short, listening acutely. \n          \n          \n          WAYLON'S POV -ON THE WOODS lining the river. Ominous\n          darkness. A NOISE. He jerks around. Nothing. Then \n          suddenly, his boat ROCKS violently; he spins \n          -\n          \n          \n          A MAN - now stands on the bow. JAMES, 30, pale white. \n          A \n          vampire. But his eyes, unlike the Cullens, are a deep, \n          sinister BURGUNDY, and absolutely lethal. His catlike \n          movements are always on the edge of a crouch.\n          \n          \n          WAYLON\n          H-how did you do that?\n          \n          \n          JAMES\n          Always the same inane questions..\n          .\n          \n          \n          Waylon turns but a woman LEAPS onto the bow --it's VICTORIA,\n          26, chaotic red hair filled with leaves from the woods. \n          Terrified, Waylon spins around to see LAURENT, 28, glossy \n          black hair, olive skin, lounging on his boat seat. All three \n          Nomads wear frayed clothes, and all three are bare foot.\n          \n          \n          JAMES\n          \u0093What do you want?\n          \u0094\n          \n          \n          \n          39.\n          VICTORIA\n          \u0093Why are you doing this?\n          \u0094 \n          \n          \n          LAURENT\n          (sighs, slight French \n          accent)\n          ... James, must we?\n          \n          \n          JAMES\n          The question should be, \u0093will it hurt?\n          \u0094\n          \n          \n          Victoria grins sadistically. Then with lightening fast \n          speed, the three of them VIOLENTLY LUNGE \n          -\n          \n          \n          SMASH TO BLACK:\n          \n          \n          51 FADE IN ON EDWARD'S FACE AGAINST BLACKNESS 51\n          \n          \n          SNAPSHOTS of his eyes, his cheekbones, his lips..\n          .\n          \n          \n          52 INT. BELLA'S ROOM - ON HER FACE - MORNING 52\n          \n          \n          As she sits in front of her computer, lost in thought. She \n          shakes herself out of it and types into her search engine \n          \u0093Quileute legends, Olympic Peninsula.\u0094 An AD pops up,\n          \u0093Thunderbird & Whale Book Store, Port Angeles.\u0094 Bella,\n          intrigued, clicks on it..\n          . \n          \n          \n          53 EXT. FORKS HIGH SCHOOL - SUNNY DAY 53\n          \n          \n          The sun has come out and so has the skin. Kids are in shorts \n          though it's still barely sixty degrees. Everyone eats lunch \n          outdoors. Bella searches the crowd for Edward.\n          \n          \n          JESSICA (O.S.\n          )\n          He's not here.\n          \n          \n          She looks down to find Jessica sitting on the grass.\n          \n          \n          JESSICA\n          \n          \n          Whenever the weather's nice, the \n          \n          \n          Cullens disappear. \n          \n          \n          BELLA\n          They just... ditch?\n          \n          \n          JESSICA\n          \n          \n          No, Dr. and Mrs. Cullen yank \u0091em \n          \n          \n          out for hiking and camping and \n          \n          \n          stuff. I tried the idea out on my \n          \n          \n          parents. Not even close. \n          \n          \n          Bella registers this as Angela suddenly jumps on them.\n          \n          \n          \n          40.\n          ANGELA\n          I'm going to the prom with Eric! \n          I \n          just asked him, I took control! \n          \n          \n          (hugs Bella)\n          Are you sure you have to go out of town?\n          \n          \n          BELLA\n          It's a family thing.\n          \n          \n          JESSICA\n          Oh my God, we need to hit the \n          stores in Port Angeles before the \n          dresses get cleaned out. \n          \n          \n          BELLA\n          Port Angeles?..\n          . \n          (a plan forming in her \n          mind)\n          Can I go with you guys? \n          \n          \n          ANGELA\n          Thank God. We need your opinion.\n          \n          \n          Off Bella, that's not really what she had in mind..\n          .\n          \n          \n          54 INT. BOUTIQUE, PORT ANGELES -ON BELLA'S FACE- AFTERNOON 54\n          \n          \n          -- antsy, distracted, as Jessica and Angela try on dresses. \n          Bella pulls a Mapquest print-out from her purse -- it reads, \n          \u0093Thunderbird and Whale Book Store.\u0094 Jessica flounces out of\n          the changing room, posing provocatively.\n          \n          \n          JESSICA\n          I think this halter makes my boobs \n          look big. What do you think, \n          Bella?\n          \n          \n          Outside the window, a group of rowdy FRAT BOYS head toward \n          a \n          bar. Two of them stare at Jessica in her low-cut dress. \n          Embarrassed, she turns back to Bella. \n          \n          \n          JESSICA\n          Bella?\n          \n          \n          BELLA\n          (absently)\n          It looks great. \n          \n          \n          JESSICA\n          You said that about the last five \n          dresses.\n          \n          \n          ANGELA \n          (empathetic)\n          You're not very good at this, are you?\n          \n          \n          \n          41.\n          BELLA\n          \n          \n          Maybe I should just go check out the \n          \n          \n          book store and meet you at the \n          \n          \n          restaurant later.\n          \n          \n          ANGELA\n          You sure?\n          \n          \n          Bella nods, heads out. Jessica's looks in the mirror again.\n          \n          \n          JESSICA\n          \n          \n          She was right about this halter, \n          \n          \n          though. It does look great.\n          \n          \n          55 OMITTED 55\n          \n          \n          56 OMITTED 56\n          \n          \n          57 EXT. THUNDERBIRD AND WHALE BOOKSTORE/STREETS - NIGHT 57\n          \n          \n          Bella exits, thumbing through a BOOK she just bought. She \n          heads down the sidewalk, but then hears FOOTSTEPS behind her. \n          She turns, doesn't see anyone. She puts the book in her\n          shoulder bag and continues.\n          \n          \n          UNKNOWN POV - ON BELLA -someone's following her. She looks \n          around, changing course to cut across a parking lot. Unknown \n          POV gets closer... and closer, until she reaches \n          -\n          \n          \n          58 EXT. WAREHOUSE AT END OF PARKING LOT - NIGHT 58\n          \n          \n          Isolated. Bella, breath short, scared, turns around just as -\n          -\n          TWO MEN emerge from the shadows, not vampires, but the Frat \n          Boys, really wasted now. \n          \n          \n          FRAT BOY #\n          1\n          Wanna beer?\n          \n          \n          She looks to her left; the other TWO GUYS are there. She's\n          cornered. She takes her purse from around her shoulder.\n          \n          \n          BELLA\n          Look, just take my bag.\n          \n          \n          FRAT BOY #\n          2\n          We don't want your bag.\n          \n          \n          She takes a defensive stance and wraps the strap around her \n          wrist to use her purse as a mace. They chortle derisively. \n          But when Frat Boy #1 comes near, she swings it, hits him in \n          the groin. The BOOK in her bag doubles him over. The other \n          three laugh, and start to close in. But suddenly \n          -\n          \n          \n\n          HEADLIGHTS blind them. A silver Volvo screeches up. The \n          Frat Boys dive out of the way. The passenger-side door \n          opens. It's Edward. She's too stunned to even move.\n          \n          \n          \n          42.\n          EDWARD\n          Get in.\n          \n          \n          She finally does. But Frat Boy #2 jumps into the game and \n          rushes Edward's side of the car \n          -\n          \n          \n          Edward SCREECHES to a halt and is out of the car and facing \n          Frat Boy #2 so fast, neither the Frat Boys, nor Bella, see it. \n          Nor does Bella see Edward's GLARE, so chilling, so animalistic\n          in its fury that Frat Boy #2, scared, instinctively backs off. \n          As Edward climbs back into the car, Bella just stares at him.\n          \n          \n          59 INT. EDWARD'S CAR - DRIVING - NIGHT 59\n          \n          \n          Bella continues to stare. She sees that he's seething with anger,\n          hands gripping the steering wheel, jaw clenched.\n          \n          \n          BELLA\n          What -- no, how did you find -- \n          ?\n          \n          \n          EDWARD\n          (through gritted teeth)\n          I should go back and rip their heads off.\n          \n          \n          BELLA\n          No. Bad idea. \n          \n          \n          EDWARD\n          You don't know the vile, repulsive \n          things they were thinking.\n          \n          \n          BELLA\n          And you do?\n          \n          \n          EDWARD\n          (covering)\n          Not hard to guess. \n          \n          \n          60 EXT. WATERFALL RESTAURANT - FRONT ENTRANCE - NIGHT 60\n          \n          \n          Jessica and Angela exit the restaurant as Bella approaches.\n          \n          \n          ANGELA\n          Where were you!? We left you a message.\n          \n          \n          JESSICA\n          We waited, but we were starving \n          -\n          \n          \n          Then they see Edward behind her, climbing out of his car. \n          They freeze, agog. He's composed now, making an effort to be\n          charming. And they are charmed.\n          \n          \n          EDWARD\n          Sorry I kept Bella from dinner. We \n          ran into each other and got talking. \n          \n          \n          \n          43.\n          JESSICA\n          I - we - understand. We were \n          just... leaving, so \n          -\n          \n          \n          The two girls start to go. Bella is forced to go with them. \n          \n          \n          BELLA\n          Okay, well. Thank you.\n          \n          \n          She starts to follow the girls. Edward is torn, then abruptly \n          -\n          \n          \n          EDWARD\n          \n          \n          (abruptly)\n          Maybe I should make sure Bella gets \n          something to eat.\n          \n          \n          (off Bella's surprised \n          \n          \n          look)\n          ... If you'd like. Then I could \n          drive you back myself.\n          \n          \n          ANGELA\n          That's so... thoughtful.\n          \n          \n          JESSICA\n          Really thoughtful.\n          \n          \n          BELLA\n          (debates, then decides)\n          I could eat.\n          \n          \n          As he guides her off, the two girls share a look, and \n          a \n          noiseless scream of excitement. \n          \n          \n          EXT. WATERFALL RESTAURANT - DINING PATIO - NIGHT 61\n          \n          \n          Bella and Edward sit on the deck. A dramatic waterfall \n          shimmers behind them.\n          \n          \n          A waitress places a steaming plate of mesquite roasted salmon \n          in front of Bella and nothing in front of Edward. She exits.\n          \n          \n          BELLA\n          You're not eating?\n          \n          \n          EDWARD\n          I'm on a special diet.\n          \n          \n          BELLA\n          Like South Beach?\n          \n          \n          EDWARD\n          Not exactly.\n          \n          \n          She looks at him curiously as she takes a bite.\n          \n          \n          \n          44.\n          BELLA\n          So how \u0091bout some answers?\n          \n          \n          EDWARD\n          Yes, no. To get to the other side, \n          and 1 point 772453851.\n          \n          \n          BELLA\n          I didn't ask for the square root of pi.\n          \n          \n          EDWARD\n          You knew that?\n          \n          \n          BELLA\n          How did you know where I was? \n          \n          \n          EDWARD\n          I didn't.\n          \n          \n          She shakes her head, frustrated, and turns to go inside -\n          -\n          \n          \n          EDWARD\n          (stops her, sincerely)\n          Don't go.\n          \n          \n          He seems torn by some internal dilemma. Then finally..\n          .\n          \n          \n          BELLA\n          Were you following me?\n          \n          \n          EDWARD\n          I feel very protective of you. \n          \n          \n          BELLA\n          So that's a yes?\n          \n          \n          EDWARD\n          Yes, I followed you. I tried to \n          keep my distance...until you needed \n          help.\n          \n          \n          BELLA\n          (putting everything together)\n          You said before... That you heard \n          what those guys were thinking..\n          . \n          Can you... read minds?\n          \n          \n          EDWARD\n          \n          \n          (shrugs)\n          I'm thinking of getting a nine-\n          hundred number.\n          \n          \n          BELLA\n          \n          \n          (trying to grasp)\n          Alright, so you read minds... What am \n          I thinking? Wait -- okay now, go.\n          \n          \n          \n          45.\n          EDWARD\n          I have no idea. I can read every \n          mind in there, except yours. \n          \n          \n          (points at people \n          inside)\n          Work, sex, money, sex, sex, boyfriend \n          -\n          (points at Bella)\n          Nothing. It's quite frustrating. \n          \n          \n          BELLA\n          Why, what's wrong with me?\n          \n          \n          EDWARD\n          I tell you I read minds and you think \n          there's something wrong with you?\n          \n          \n          He smiles, charmed by her. But his smile fades, that torn \n          look returns. He holds onto the rail, looking out. \n          \n          \n          BELLA\n          What is it?\n          \n          \n          EDWARD\n          I... don't have the strength to \n          stay away from you anymore. \n          \n          \n          She's surprised. And thrilled.\n          \n          \n          BELLA\n          Edward, you don't have to.\n          \n          \n          He's drawn in by her encouraging gaze... but he closes his\n          eyes a beat, and turns back to the water.\n          \n          \n          EDWARD\n          (almost to himself)\n          This is wrong. \n          \n          \n          BELLA\n          Edward \n          -\n          \n          \n          EDWARD\n          You're cold. We should go.\n          \n          \n          He walks away before she can ask any more questions..\n          .\n          \n          \n          62 EXT. ROAD - NIGHT 62\n          \n          \n          Edward's Volvo speeds along the two lane highway.\n          \n          \n          63 INT. EDWARD'S VOLVO - NIGHT 63\n          \n          \n          Bella glances at Edward, might ask him more questions but he seems \n          to be wrestling with his own thoughts. Finally..\n          . \n          \n          \n          \n          46.\n          BELLA\n          I think I'm warm enough now. \n          \n          \n          She reaches for the heater dial, he does as well -- their \n          hands TOUCH. And hold a moment too long. An electric \n          current connecting them.\n          \n          \n          BELLA\n          Your hand, it's still freezing cold.\n          \n          \n          He pulls his hand away, but she keeps looking at it... then \n          her attention shifts outside to FLASHING POLICE LIGHTS. As \n          they drive past the FORKS POLICE STATION, a sheriff's car\n          pulls away. Charlie's cruiser is parked out front. \n          \n          \n          BELLA\n          \n          \n          (concerned)\n          Dad's here late. Something must \n          have happened.\n          \n          \n          EXT./INT. FORKS - POLICE STATION (CONTINUOUS) - NIGHT 64\n          \n          \n          The Volvo pulls up. Bella and Edward climb out. Edward then \n          sees a second car next to the cruiser. \n          \n          \n          EDWARD\n          That's my father's car. What's he -- \n          ?\n          \n          \n          EDWARD AND BELLA'S POV: INSIDE THE DARKENED POLICE STATION\n          \n          \n          In a pool of light, a distressed Charlie and Dr. Cullen study \n          photographs and evidence. As they wrap up their discussion, \n          Dr. Cullen puts a sympathetic hand on Charlie's shoulder,\n          then exits the police station looking grim. \n          \n          \n          EDWARD\n          Carlisle. What happened?\n          \n          \n          DR. CULLEN\n          Waylon Forge was found in the woods \n          out near his place. I just \n          examined the body.\n          \n          \n          Edward darkens. Bella is horrified.\n          \n          \n          BELLA\n          He died? How? \n          \n          \n          DR. CULLEN\n          Animal attack. \n          \n          \n          BELLA\n          The same kind that killed the security \n          guard down in Mason?\n          \n          \n          Edward and Dr. Cullen trade a look, subtle, but Bella catches it.\n          \n          \n          \n          47.\n          DR. CULLEN\n          Most likely.\n          \n          \n          BELLA\n          So it's getting closer to town.\n          \n          \n          EDWARD\n          Waylon lived all the way down on \n          Queets River. 75 miles south.\n          \n          \n          BELLA\n          But that's \n          -\n          \n          \n          DR. CULLEN\n          (with a kind, reassuring \n          \n          \n          smile)\n          Bella, you should go inside. \n          Waylon was your father's friend.\n          \n          \n          She goes to the door, but looks back to see them conferring \n          quietly, gravely. Clearly, there's more to this.\n          \n          \n          65 INT. POLICE STATION - NIGHT 65\n          \n          \n          Bella enters to find a distressed Charlie studying evidence, \n          photos, maps --trying to make sense of Waylon's death.\n          Deputies come and go in the background. Bella approaches \n          Charlie. He looks up.\n          \n          \n          BELLA\n          Dad, I'm sorry about Waylon.\n          \n          \n          CHARLIE\n          Known him going on thirty years. \n          \n          \n          He's obviously torn up. Bella isn't quite sure what to do.\n          And so puts a comforting hand on his shoulder. A beat..\n          . \n          \n          \n          Then Charlie squeezes her hand. It's the first physical\n          affection we've seen between them. And it threatens to evoke\n          even more emotion in Charlie. So he tamps it down, and rises, \n          then projects a confident manner. \n          \n          \n          CHARLIE\n          We'll get to the bottom of this, Bella. \n          But in the meantime..\n          .\n          \n          \n          As an ambulance pulls up outside, he opens a drawer, finds \n          out a cannister of PEPPER SPRAY. \n          \n          \n          CHARLIE\n          ... I want you to have this.\n          \n          \n          BELLA\n          That's probably not a good \n          -\n          \n          \n          \n          48.\n          CHARLIE\n          It'll give me some peace of mind. \n          \n          \n          She sees he needs this, and allows him to put it into her \n          purse. \n          \n          \n          As Charlie goes to get his coat, Bella steps outside to SEE \n          -\n          \n          \n          A66 EXT. POLICE STATION - NIGHT - BELLA'S POV A66\n          \n          \n          Two Attendants hoist a metal gurney into an ambulance. On it, \n          Waylon's dead, white, bloody bare FEET peek out from under \n          a\n          sheet, resting at a disturbingly unnatural angle. Off Bella, \n          chilled..\n          .\n          \n          \n          SMASH TO:\n          \n          \n          FLASH POP TO EDWARD'S BLACK EYES\n          \n          \n          FLASH POP TO EDWARD'S COLD WHITE HAND.\n          \n          \n          FLASH POP TO THE FIVE CULLENS, SLOW MOTION, beautiful and white.\n          \n          \n          FLASH POP TO WAYLON'S TWISTED WHITE FEET\n          \n          \n          INT. BELLA'S ROOM - ON BELLA - NIGHT 66\n          \n          \n          -- as she turns on the LIGHT. She hears a SNAP! outside the \n          window. She rises, digs into her purse for the PEPPER SPRAY \n          Charlie gave her, and goes to the window. She looks out -\n          -\n          all she sees is the wind blowing hard. But she's rattled.\n          \n          \n          She closes the curtains, then reaches for the BOOK she bought \n          earlier. She thumbs through, laying the pepper spray within \n          reach. \n          \n          \n          INSERT THE BOOK, \u0093QUILEUTE FOLK STORIES AND ART.\n          \u0094\n          \n          \n          As she leafs through we see PHOTOS of ancient, carved MASKS. \n          Comical, menacing, haunting... then she stops on a photo of \n          a \n          white mask with black eyes and a row of sharp teeth. THE \n          INSCRIPTION reads, \u0093The Cold One.\n          \u0094\n          \n          \n          Bella quickly goes to her computer and Googles \u0093Cold One \u0094 -\n          several beer ads appear. Frustrated, she closes the pop-ups, \n          revealing a link to: \u0093The Cold One: Apotamkin\u0094 -\n          -\n          \n          \n          INTERCUT BETWEEN BELLA AND THE COMPUTER SCREEN\n          \n          \n          Several PICTURES begin loading: the seductive Apotamkin with his \n          ice-blue skin, devouring his victims in tapestries, engravings, \n          paintings. Creatures beautiful and horrific. Craven, skeletal \n          demons attacking villages; perfectly sculpted predators, luring \n          innocent maidens... it's all murder, blood, sexuality.\n          \n          \n          THEN SEVERAL WORDS LEAP OUT in quick succession: \n          \n          \n          \n          49.\n          -- \u0093Speed.\u0094 \u0093Strength.\u0094 \u0093Cold skinned.\u0094 \u0093Immortal... \n          \u0093 \n          Then finally: \u0093Blood drinker.\n          \u0094 \n          \n          \n          And we LAND ON A PICTURE OF A HANDSOME MAN BITING A WOMAN'S\n          WHITE NECK..\n          . \n          \n          \n          FLASH POP TO THE SAME PICTURE AS IT MOMENTARILY COMES ALIVE, \n          BUT NOW IT'S EDWARD BITING BELLA'S NECK, BLOOD DRIPPING \n          -\n          \n          \n          BACK ON BELLA - she reels back from the computer in utter \n          disbelief.\n          BELLA\n          ... it's not possible..\n          . \n          Off BELLA'S FACE, struggling to make sense of it all..\n          .\n          MATCH CUT:\n          \n          \n          67 \n          EXT. SCHOOL -LAWN -ON BELLA'S FACE -DAWN --THICK FOG 67\n          She stands in the center of the deserted, green lawn. Her \n          expression tells us she's still reeling with disbelief. STAY \n          ON HER FACE, TIME LAPSING AS: \n          \n          \n          The bell rings and students exit class, rushing past Bella as \n          she stands still, waiting..\n          . \n          \n          \n          BELLA'S POV - EDWARD AND HIS SIBLINGS\n          -- cross the lawn, heading to class. Edward sees Bella, sees \n          the intensity on her face. He stops. \n          \n          \n          She walks to him, eyes meeting his... her look says, we have \n          to talk... and she continues directly past him, into the dark \n          forest that borders the school. \n          \n          \n          He watches her disappear in the trees, then takes a step to \n          follow. Jasper moves in front of him, Rosalie grabs his arm. \n          ROSALIE\n          Edward, don't go.\n          But Alice gently removes Rosalie's hand from his arm.\n          ALICE\n          He's already there.\n          \n          \n          68 \n          EXT. FOREST - DAY 68\n          Bella stands amid the trees, waiting. Then the SOUNDS OF THE \n          FOREST abruptly drop out. A predator is near. Edward \n          appears behind her. She doesn't turn around. A beat.\n          \n          \n          \n          50.\n          BELLA\n          You're impossibly fast. And strong. \n          Your skin is pale-white, ice-cold. \n          Your eyes change color. And \n          sometimes you speak like... you're \n          from a different time. \n          \n          \n          (turns to face him now)\n          You never eat food, or drink, or \n          come out in the sunlight. And you \n          said no to the beach trip only after \n          you heard where it was. Because of \n          the treaty. \n          \n          \n          This last registers with him. She steps closer to him.\n          \n          \n          BELLA\n          How old are you?\n          \n          \n          EDWARD\n          Seventeen.\n          \n          \n          BELLA\n          How long have you been seventeen?\n          \n          \n          A long beat as we begin to CIRCLE THEM. He sees he can't hide\n          anymore. Honesty is an enormous risk, but he has to take it.\n          \n          \n          EDWARD\n          ... A while.\n          \n          \n          She inhales. She knew, but it's still shocking. We CIRCLE\n          THEM FASTER \n          -\n          \n          \n          BELLA\n          I know what the Cold Ones are. \n          What you are. \n          \n          \n          EDWARD\n          Say it. Out loud. Say it.\n          \n          \n          All sound suddenly DROPS OUT. We hear only her whisper..\n          .\n          \n          \n          BELLA\n          ... Vampire\n          \n          \n          They seem to hover in momentary stasis, him utterly exposed, her \n          reality utterly rocked. \n          \n          \n          EDWARD\n          Are you afraid?\n          \n          \n          BELLA\n          No. \n          \n          \n          \n          51.\n          EDWARD\n          \n          \n          (angry)\n          Then ask me the most basic \n          question: what do we eat?\n          \n          \n          BELLA\n          You won't hurt me. You're different.\n          \n          \n          EDWARD\n          You think you know me?\n          \n          \n          He glares at her. She holds her ground. Suddenly, he takes \n          her by the hand. Starts walking. \n          \n          \n          BELLA\n          Where are we going?\n          \n          \n          EDWARD\n          Up the mountain. Out of the cloud \n          bank. You need to see what \n          I \n          really am. What I look like in the \n          harsh light of the sun. \n          \n          \n          BELLA\n          No! The sunlight will kill you.\n          \n          \n          EDWARD\n          Myth. You need to see the truth.\n          \n          \n          He pulls her but she stumbles. \n          \n          \n          BELLA\n          Slow down.\n          \n          \n          Suddenly, he's right next to her.\n          \n          \n          EDWARD\n          Are you afraid? \n          \n          \n          BELLA\n          No.\n          \n          \n          EDWARD\n          Then come with me. Someplace where \n          no one can protect you. Where \n          I \n          could do what I've wanted to do from \n          the first moment I met you. \n          \n          \n          Their proximity is intense, riveting both of them. \n          \n          \n          BELLA\n          I'm not afraid.\n          \n          \n          EDWARD\n          \n          \n          You should be.\n          \n          \n          \n          52.\n          He abruptly and effortlessly scoops her up into his arms. \n          \n          \n          EDWARD\n          Hold on.\n          \n          \n          Then he flings her onto his back... and starts running.\n          \n          \n          69 EXT. FOREST - RUNNING - DAY 69\n          \n          \n          As in the opening sequence, Edward races through the forest, dark \n          trunks STROBING past as he picks up speed, faster and faster. \n          Bella clings to his back as it seems he'll collide with the trees, \n          but he avoids them with supernatural grace. It's frightening, \n          nauseating, intoxicating. \n          \n          \n          EDWARD\n          Are you afraid!\n          ?\n          \n          \n          BELLA\n          No!\n          \n          \n          But she clings tighter. Terrified. They climb in altitude. \n          Higher and higher, above the fog layer. Finally, up ahead \n          -\n          \n          \n          THE FOREST'S EDGE fast approaches, a clearing is beyond. The\n          sunlight glows white hot beyond the trees... they're about to \n          emerge from the shadowy darkness... but suddenly-\n          \n          \n          Bella finds herself sitting on the ground, against a tree. \n          All is silent. She's dizzy, tries to regain her equilibrium. \n          Then she realizes she's alone. \n          \n          \n          BELLA\n          Edward? Where are you?\n          \n          \n          She rises, then steps just beyond the fringe of the ferns into \n          -\n          \n          \n          70 EXT. A MEADOW (CONTINUOUS) - DAY 70\n          \n          \n          A perfect circle of swaying grass, wildflowers and buttery \n          sunlight. HEAR a stream nearby. Bella looks around and finally \n          sees \n          -\n          \n          \n          EDWARD, his shirt open, standing nearby in the shade of some \n          trees. He watches her cautiously. She takes a step toward \n          him, but he holds up a hand. She waits. Finally, he takes \n          a \n          deep breath, and steps out of the shade \n          -\n          \n          \n          EDWARD\n          \n          \n          This is why we don't show ourselves \n          \n          \n          in sunlight..\n          . \n          \n          \n          As the sun hits him... EDWARD'S SKIN literally sparkles as if \n          embedded with thousands of tiny diamonds. He is magnificent, \n          shimmering, like a statue carved from glittering crystal. He \n          moves toward her. \n          \n          \n          \n          53.\n          EDWARD\n          This is what I am.\n          \n          \n          He nears, clearly expecting her to recoil, but..\n          . \n          \n          \n          BELLA\n          You're... beautiful..\n          .\n          \n          \n          He realizes that she's in awe. She reaches to touch him, but \n          he immediately backs into the shadows, his skin normal again. \n          \n          \n          EDWARD\n          \n          \n          (appalled)\n          Beautiful? I'm a killer, Bella. \n          This is the skin of a killer. \n          \n          \n          His arm juts into A SHAFT OF LIGHT, sparkling again.\n          \n          \n          BELLA\n          I don't believe that.\n          \n          \n          EDWARD\n          Because you believe the lie. The \n          camouflage. I'm the world's most \n          dangerous predator. Everything \n          about me invites you in - my voice, \n          my face, even my smell. As if \n          I \n          need any of that..\n          .\n          \n          \n          He's suddenly BEHIND her --then IN FRONT of her --then by \n          a\n          tree, DARTING so fast, we only see where he lands \n          -\n          \n          \n          EDWARD\n          As if you could outrun me. As if \n          you could fight me off.\n          \n          \n          He abruptly rips off a LARGE TREE LIMB, then THROWS it against \n          a \n          tree trunk with explosive force. \n          \n          \n          Bella flinches, but holds her ground, unshakable. \n          \n          \n          EDWARD\n          I'm designed to kill.\n          \n          \n          BELLA\n          I don't care.\n          \n          \n          EDWARD\n          I've killed people.\n          \n          \n          BELLA\n          It doesn't matter.\n          \n          \n          \n          54.\n          EDWARD\n          I wanted to kill you. I've never\n          wanted a human's blood so much in \n          my life. I'm dangerous to you.\n          \n          \n          BELLA\n          I trust you.\n          \n          \n          EDWARD\n          Don't.\n          \n          \n          BELLA\n          I trust you, Edward. I'm here.\n          \n          \n          She takes his hand. He reels at the warmth of her touch. \n          She leans in, drawn to him, unaware that her THROAT is \n          nearing his lips... then suddenly he's gone.\n          \n          \n          BELLA\n          Edward?\n          \n          \n          She looks over to FIND he's on the other side of the meadow, \n          catching his breath.\n          \n          \n          EDWARD\n          You... took me by surprise. \n          (collecting himself)\n          I don't know how to... do this.\n          \n          \n          He moves back toward her. Slowly. \n          \n          \n          EDWARD\n          Me, and my family, we're different \n          from others of our kind. We're not \n          nomadic, we have a permanent home. \n          We only hunt animals. We've \n          learned to control our thirst..\n          . \n          \n          \n          (shaking his head)\n          But you - your scent, it's like \n          a \n          drug to me... my own personal brand \n          of heroin. \n          \n          \n          BELLA\n          (realizing)\n          Oh... I thought you hated me when we met.\n          \n          \n          EDWARD\n          I did. For making me want you so badly. \n          I'm still not sure I can control myself.\n          \n          \n          He reaches her again.\n          \n          \n          BELLA\n          I know you can.\n          \n          \n          \n          55.\n          He's utterly vulnerable as he looks at her, searching her\n          face for clues.\n          \n          \n          EDWARD\n          I wish I could understand this \n          thing you see in me. You look at \n          me with those eyes..\n          . \n          \n          \n          (frustrated)\n          I can't read your mind. Tell me \n          what you're thinking.\n          \n          \n          BELLA\n          I'm afraid.\n          \n          \n          Stricken, he sinks gracefully to his knees in the grass.\n          \n          \n          EDWARD\n          (devastated)\n          Good. \n          \n          \n          She sinks down in front of him.\n          \n          \n          BELLA\n          Not of that. I'm afraid... you'll \n          disappear. That I'll lose you.\n          \n          \n          EDWARD\n          \n          \n          (amazed, elated)\n          You don't know how long I've looked \n          for you.\n          \n          \n          They share a smile. Then he reaches toward her neck, \n          pausing..\n          .\n          \n          \n          EDWARD\n          Be very still.\n          \n          \n          She does so. Exercising great control, he places his hand on \n          her throat... it's so exposed, so vulnerable. The rush\n          between them is overwhelming. But Bella doesn't move.\n          \n          \n          He brushes his hand up her cheek. Then lowers it to her \n          heart... Clouds float past the sun..\n          .\n          \n          \n          They're both overwhelmed, taking each other in.\n          \n          \n          EDWARD\n          And so the lion fell for the lamb.\n          \n          \n          BELLA\n          Stupid lamb.\n          \n          \n          EDWARD\n          Sick masochistic lion.\n          \n          \n          \n          56.\n          CRANE UP on the two of them, laying together, as close as \n          they dare... his hand to her heart..\n          .\n          \n          \n          DISSOLVE TO:\n          \n          \n          71 INT. BELLA'S ROOM - MORNING 71\n          \n          \n          CLOSE ON BELLA'S FACE. Still in bed. Thinking.\n          \n          \n          BELLA (V.O.\n          )\n          About three things I was absolutely \n          positive. One, Edward was \n          a \n          vampire. \n          \n          \n          She rises, goes to the mirror. Looks at herself, worry \n          knitting her brow.\n          \n          \n          BELLA (V.O.\n          )\n          Two, there was a part of him that \n          thirsted for my blood. And three..\n          .\n          \n          \n          As she moves past her window, something catches her eye, causing \n          her to BANG into her desk. She looks back out..\n          . \n          \n          \n          BELLA'S POV - THE DRIVEWAY\n          \n          \n          Edward leans against his car, looking up at her with a small \n          smile. She beams at the sight of him. \n          \n          \n          BELLA (V.O.\n          )\n          ... I was falling, unconditionally \n          and irrevocably, in love with him. \n          \n          \n          72 OMITTED 72\n          \n          \n          73 EXT. OLYMPIC RAINFOREST - DAY (ANOTHER DAY) 73\n          \n          \n          Edward helps Bella balance-walk across an enormous fallen pine \n          tree in the moss-covered forest. \n          \n          \n          BELLA\n          How long have you been like this?\n          \n          \n          EDWARD\n          Since nineteen-eighteen. That's \n          when Carlisle found me. \n          \n          \n          She takes that in, it's a lot. But it stokes her curiosity.\n          \n          \n          BELLA\n          Where'd he find you?\n          \n          \n          EDWARD\n          In a hospital, dying of Spanish \n          influenza. My parents had already died. \n          \n          \n          \n          57.\n          FLASHBACK to CHICAGO HOSPITAL, 1918 - NIGHT\n          \n          \n          BELLA (V.O.\n          )\n          What was it like?\n          \n          \n          EDWARD (V.O.\n          )\n          The word excruciating comes to \n          mind. But what Carlisle did was \n          much harder... not many of us have \n          the restraint to do that. \n          \n          \n          BELLA (V.O.\n          )\n          Didn't he just... bite?\n          \n          \n          EDWARD\n          Not just. Our bite contains venom. \n          And once we taste blood, a sort of..\n          . \n          frenzy begins. It's almost \n          impossible to stop. \n          \n          \n          BELLA (V.O.\n          )\n          But Carlisle did. \n          \n          \n          EDWARD\n          First with me, then with his wife, \n          Esme. He found her in a hospital, \n          as well. The others followed.\n          \n          \n          BACK to PRESENT DAY\n          \n          \n          BELLA \n          Does someone have to be dying to \n          become like you?..\n          .\n          \n          \n          Their CONVERSATION CONTINUES as we go to \n          -\n          \n          \n          74 EXT. RIVER'S EDGE - DAY (ANOTHER DAY) 74\n          \n          \n          They walk along a stunning coastline -- rugged black rocks, \n          covered in bright green moss.\n          \n          \n          EDWARD\n          ... No, that's just Carlisle. He \n          would never do... this, to someone \n          who had another choice. \n          \n          \n          BELLA\n          So Carlisle's the reason why you \n          hunt animals, instead of people. \n          \n          \n          EDWARD\n          Not the only reason.\n          \n          \n          He stops, looks down at her, serious, with emotion..\n          .\n          \n          \n          \n          58.\n          EDWARD\n          I don't want to be a monster.\n          \n          \n          She nods. Understands. He smiles.\n          \n          \n          EDWARD\n          We call ourselves vegetarians, by \n          the way... For our kind, hunting \n          animals is like living on tofu. It \n          keeps you strong but isn't very \n          satisfying. \n          \n          \n          Then abruptly, he whips past Bella. She turns to see him standing \n          on a large rock in the river.\n          \n          \n          BELLA\n          Show off.\n          \n          \n          EDWARD\n          It's not that impressive, really. \n          Anyone in my family can do this.\n          \n          \n          BELLA\n          Can they all read minds, too? \n          \n          \n          EDWARD\n          No, that's unique to me. But Alice can \n          see the future. \n          \n          \n          BELLA\n          \n          \n          (fishing)\n          Really? Bet she saw me coming \n          a \n          mile away.\n          \n          \n          She notes his change of mood as he slows, darkening.\n          \n          \n          EDWARD\n          Her visions are very subjective. \n          The future can change.\n          \n          \n          He cuts off her questions by returning to shore, and \n          continuing their walk..\n          .\n          \n          \n          75 EXT. CHARLIE'S HOUSE - TWILIGHT (ANOTHER DAY) 75\n          \n          \n          Water sprays from a hose as Bella and Edward wash her truck. \n          A boom box PLAYS. He perches on top of the roof. \n          \n          \n          EDWARD\n          Come to my house tomorrow. \n          \n          \n          Bella looks up, aiming the hose badly - water ricochets off \n          the cab and sprays in her face. He jumps down from the roof.\n          \n          \n          BELLA\n          Your house? With your family?\n          \n          \n          \n          59.\n          He wipes down the dented front fender, then reaches under it \n          and, with his bare hands, easily pops a large DENT out of the \n          truck's body. She's too flustered to register it.\n          \n          \n          BELLA \n          But... what if they don't like me?\n          \n          \n          EDWARD\n          \n          \n          (laughing heartily)\n          You're worried, not because you'll \n          be in a houseful of vampires, but \n          because you think they won't \n          approve of you? \n          \n          \n          BELLA\n          I'm glad I amuse you.\n          \n          \n          But then his laughter dies, as he hears something. \n          \n          \n          BELLA\n          What is it?\n          \n          \n          EDWARD\n          A complication.\n          \n          \n          ... as a BLACK CAR comes into view, and pulls up. \n          \n          \n          EDWARD\n          I'll pick you up tomorrow.\n          \n          \n          He heads to his car, eying the passengers in \n          -\n          \n          \n          EDWARD'S POV - INT. BLACK CAR\n          \n          \n          Jacob, with his father, Billy, who's expression is intense.\n          Anxious. SLOW MOTION as Edward locks eyes with Billy. Jacob \n          looks questioningly at his father.\n          \n          \n          Bella watches Edward drive away, perturbed by the exchange. She \n          forces a smile and goes to greet the visitors. Jacob sets up \n          Billy's wheelchair and Billy climbs into it as \n          -\n          \n          \n          BELLA\n          Come to visit your truck?\n          \n          \n          JACOB\n          Looks good. You got that dent out. \n          \n          \n          BILLY\n          Actually, we came to visit your \n          flat screen. First Mariners game \n          of the season. Plus Jacob here \n          kept bugging me to see you again.\n          \n          \n          \n          60.\n          JACOB\n          (mortified)\n          Great, Dad. Thanks. \n          \n          \n          Jacob shoots his father an irritated look, just as the POLICE \n          CRUISER pulls up. Charlie climbs out, holding two six-packs. \n          \n          \n          CHARLIE\n          Pale Ale.\n          \n          \n          BILLY\n          (holds up a brown paper \n          BAG)\n          Harry Clearwater's homemade fish fry.\n          \n          \n          Charlie smiles, pleased. He clicks on the game as they all head \n          inside \n          -\n          \n          \n          BILLY\n          Any luck with the Waylon case?\n          \n          \n          CHARLIE\n          \n          \n          (darkening)\n          Found a footprint out at the crime \n          scene today. A bare, human footprint. \n          \n          \n          Billy seems disturbed but not surprised. Bella is horrified.\n          \n          \n          BELLA\n          A person did that?\n          \n          \n          JACOB\n          A crazy person, walking around \n          barefoot this time of year.\n          \n          \n          CHARLIE\n          Spread the word out at the rez, will \n          ya? Keep the kids out of the woods. \n          \n          \n          BILLY\n          Will do. \n          (directed at Bella)\n          Don't want no one else getting hurt.\n          \n          \n          Bella looks away from Billy, unnerved.\n          \n          \n          76 OMITTED 76\n          \n          \n          77 OMITTED 77\n          \n          \n          78 DREAM SEQUENCE - UNDERWATER 78\n          \n          \n          Bella floats near Edward, only their hands touching, but \n          their bodies are nearing, so close, so sensual..\n          . \n          \n          \n          \n          61.\n          Suddenly, EDWARD IS YANKED DOWNWARD! Something has him, \n          pulling him down..\n          . \n          SMASH TO:\n          \n          \n          79 \n          INT. BELLA'S ROOM - ON BELLA - MORNING 79\n          -- as her eyes pop open... and relief sweeps over her as she \n          realizes it was just a dream. But it haunts her..\n          .\n          \n          \n          80 \n          EXT. OLYMPIC PENINSULA - ROAD - DAY 80\n          \n          \n          AERIAL SHOT of the forest as we sweep over its lush green \n          expanse, to FIND Edward's Volvo speeding along, very fast. \n          The Volvo finally turns off the paved highway and onto a long \n          \n          \n          serpentine dirt road. FOLLOW THE CAR until, finally, it \n          reaches a small meadow, in the center of which sits \n          -\n          \n          \n          81 \n          EXT. CULLEN HOUSE - DAY 81\n          A timeless graceful house. The Volvo pulls up and Bella \n          climbs out, surprised.\n          \n          \n          BELLA\n          It's... wonderful.\n          EDWARD\n          You expected turrets, dungeons and moats? \n          BELLA\n          No... not moats.\n          He takes her hand. She girds herself. They head inside.\n          \n          \n          82 \n          INT. CULLEN HOUSE - LIVING ROOM - DAY 82\n          Edward guides Bella into the large, bright house. Walls of glass \n          look out on the river. Everything's open and white. Historical\n          objects are tastefully placed throughout. \n          \n          \n          HEAR Verdi's \u0093La Traviata: Libiamo ne' lieti calici\u0094 coming from\n          another room. Bella is enraptured.\n          BELLA\n          It's so light and open. \n          \n          \n          EDWARD\n          Thanks to tinted windows... It's the one \n          place we never have to hide.\n          \n          \n          We then notice CLANGING coming from the kitchen. Edward \n          shakes his head.\n          EDWARD\n          I told them not to do this.\n          \n          \n          \n          62.\n          83 INT. CULLEN HOUSE - KITCHEN - DAY 83\n          \n          \n          Verdi's opera BLASTS Bella and Edward who enter to find the\n          kitchen in full swing. Dr. Cullen, Emmett, Rosalie, and ESME \n          prepare elaborate platters of Italian pastas and antipasti. \n          \n          \n          Esme rolls out a pizza dough and fans tomatoes around it in an \n          instant. Rosalie stirs a pot, disinterested. \n          \n          \n          Esme sees Bella and stops, emanating maternal warmth. Her \n          heart-shaped face and billows of hair are reminiscent of the \n          silent-movie era. \n          \n          \n          ESME\n          \n          \n          Bella. We're making Italiano for \n          \n          \n          you. \n          \n          \n          EDWARD\n          \n          \n          This is Esme, my mother for all \n          \n          \n          intents and purposes. \n          \n          \n          BELLA\n          Bon giorno?\n          \n          \n          ESME\n          Molto bene! \n          \n          \n          DR. CULLEN\n          \n          \n          You've given us an excuse to use \n          \n          \n          the kitchen for the first time. \n          \n          \n          Hit pause..\n          .\n          \n          \n          PAN across brand new Williams-Sonoma cookware boxes to the \n          corner --they're watching an ITALIAN COOKING SHOW on a TV.\n          Emmett hits the DVD remote control. \n          \n          \n          ESME\n          I hope you're hungry.\n          \n          \n          BELLA\n          Oh, absolutely \n          -\n          \n          \n          EDWARD\n          She already ate.\n          \n          \n          Bella shoots him a look, but something SHATTERS. Rosalie has \n          thrown down a bowl and now strides out \n          -\n          \n          \n          ROSALIE\n          Perfect.\n          \n          \n          \n          63.\n          84 INT. LIVING ROOM (CONTINUOUS) - DAY 84\n          \n          \n          -- Bella exits behind Rosalie, trying to explain. The \n          other's follow -\n          \n          BELLA\n          I just assumed -- because you don't \n          eat, you know..\n          .\n          \n          \n          ESME\n          Of course. That was very considerate \n          of you.\n          \n          \n          EDWARD\n          (re: Rosalie)\n          Ignore her. I do.\n          \n          \n          ROSALIE\n          Yes, let's keep pretending this \n          isn't dangerous for all of us. \n          \n          \n          BELLA\n          I would never, ever tell anyone.\n          \n          \n          DR. CULLEN\n          (reassuring)\n          She knows that. \n          \n          \n          EMMETT\n          The problem is, you two have gone \n          public now, so..\n          .\n          \n          \n          ESME\n          \n          \n          Emmett.\n          \n          \n          ROSALIE\n          No, she should know.\n          \n          \n          (to Bella)\n          The entire family will be \n          implicated if this ends badly. \n          \n          \n          BELLA\n          ... Badly?\n          \n          \n          This hangs in the air, uncomfortably. Edward can't look at her.\n          \n          \n          BELLA\n          \n          \n          (realizing)\n          Oh. Badly. Like, where I become \n          a \n          meal.\n          \n          \n          Emmett chokes back laughter. Edward grins. Wraps his arm \n          around Bella. Even Esme has to chuckle.\n          \n          \n          Rosalie, exasperated, heads back into the kitchen. Emmett \n          shrugs, goes after her.\n          \n          \n          \n          64.\n          ALICE (O.S.\n          )\n          Hi, Bella!\n          \n          \n          ON THE BALCONY Alice leaps over the rail, holding a bouquet \n          of wildflowers. Jasper follows her. She bounces forward to \n          kiss Bella's cheek and hands Bella the wildflowers. \n          \n          \n          ALICE\n          \n          \n          I'm Alice. You do smell good. \n          EDWARD \n          Alice. \n          ALICE \n          \n          It's alright, Bella and I are going \n          to be great friends. \n          \n          \n          BELLA\n          (extending her hand)\n          And you're Jasper, right?\n          \n          \n          JASPER\n          Pleasure to meet you.\n          \n          \n          But he shies away from her hand. \n          \n          \n          ALICE\n          (gently encouraging)\n          You won't hurt her, Jasper.\n          \n          \n          He isn't so sure. Edward takes Bella's hand instead.\n          \n          \n          EDWARD\n          I'll give you a tour of the house. \n          \n          \n          ALICE\n          (with meaning)\n          I'll see you soon.\n          \n          \n          Edward shoots Alice a look, which Bella catches before he guides \n          her up the stairs. As they ascend, Bella takes in the eclectic \n          ART PIECES from around the world, Ethiopian crosses, Dresden \n          China, Asian scrolls. They reach \n          -\n          \n          \n          THE LANDING - to FIND a wall of dozens of artistically arrayed \n          silk squares with tassels. Bella looks closer. \n          \n          \n          BELLA\n          Graduation caps?\n          \n          \n          EDWARD\n          A private joke. We matriculate a lot.\n          \n          \n          BELLA\n          What a nightmare, repeating high school. \n          \n          \n          \n          65.\n          EDWARD\n          True, but the younger we start out in \n          a \n          new place, the longer we can stay there.\n          \n          \n          She shivers at the thought of it, as they continue on..\n          .\n          \n          \n          85 INT. EDWARD'S ROOM - DAY 85\n          \n          \n          EDWARD\n          ... and this is my room.\n          \n          \n          Bella enters to find a wall of glass doors open to a deck, with \n          the river beyond. The rest is floor to ceiling CD's, vinyl, \n          8\n          track tapes, etc., with a sophisticated I-pod/stereo set up. \n          \n          \n          BELLA\n          So you're obsessed with music. But..\n          .\n          (looking around)\n          No bed?\n          \n          \n          EDWARD\n          No sleep.\n          \n          \n          BELLA\n          Ever?\n          \n          \n          EDWARD\n          No nightmares, no drool, no \n          snoring.\n          \n          \n          She considers this, as she runs a hand along a wall of CD's,\n          studying the titles.\n          \n          \n          EDWARD\n          Do you have any favorites?\n          \n          \n          BELLA\n          Depends. Alternative? Jazz? \n          Sixties, seventies..\n          .\n          \n          \n          EDWARD\n          Ooh, she knows her music. Alright, \n          nineties. Eighteen-nineties. Classical.\n          \n          \n          BELLA\n          I'd have to say... Debussy.\n          \n          \n          He looks at her, surprised, smiles. \n          \n          \n          EDWARD\n          My favorite, too. \n          \n          \n          Off their connection, he pulls out a CD and puts it on. \n          A \n          solo piano version of CLAIR DE LUNE begins to play.\n          \n          \n          \n          66.\n          He moves to her, taking her hand, then he starts to turn her \n          in a pirouette, dancing with her - but she breaks off and \n          backs away.\n          \n          \n          BELLA\n          No dancing.\n          \n          \n          EDWARD\n          Ever? \n          \n          \n          BELLA\n          No tripping, no falling, no derision. \n          \n          \n          EDWARD\n          (mischievously)\n          I can always make you.\n          \n          \n          BELLA\n          You don't scare me.\n          \n          \n          EDWARD\n          You really shouldn't have said that.\n          \n          \n          He grins, a low GROWLING SOUNDS in the back of his throat. \n          She laughs and backs out the door, onto \n          -\n          \n          \n          86 EXT. EDWARD'S ROOM - DECK (CONTINUOUS) 86\n          \n          \n          -- Bella backs up to the rail. Edward appears in the \n          doorway, shifting into a half-crouch, about to pounce. \n          \n          \n          BELLA\n          Don't you dare -\n          \n          Suddenly, she's airborne as he tackles her and they FLY OFF THE \n          DECK... then she finds herself \n          -\n          \n          \n          IN A TREE - in his arms. When she realizes where she is, she \n          laughs, delighted. It's infectious, he laughs heartily, too..\n          .\n          \n          \n          CUT AWAY TO:\n          \n          \n          87 INT. CULLEN HOUSE - LIVING ROOM - SAME 87\n          \n          \n          Esme and Dr. Cullen look out the window. Edward's LAUGHTER\n          filters inside to them; Esme, in turn, smiles.\n          \n          \n          ESME\n          She's brought him to life.\n          \n          \n          DR. CULLEN\n          He's been alone too long... but how \n          can it end well?\n          \n          \n          ESME\n          Alice has been wrong before.\n          \n          \n          \n          67.\n          DR. CULLEN\n          Not often.\n          \n          \n          Esme turns to Dr. Cullen, gentle but absolutely firm.\n          \n          \n          ESME\n          \n          \n          Carlisle. Bella is what he wants. \n          \n          \n          It will work out. Somehow. \n          \n          \n          Dr. Cullen smiles at her with love, then takes her hand as \n          they look back out the window..\n          .\n          \n          \n          EXT. TREE - SAME 88\n          \n          \n          Edward looks Bella in the eye. \n          \n          \n          EDWARD\n          Trust me?\n          \n          \n          BELLA\n          In theory. \n          \n          \n          EDWARD\n          Then close your eyes.\n          \n          \n          She does, warily. He grips her more firmly, then LEAPS them to \n          another tree like a flying squirrel! Then, again, to the TOP of \n          another tree. He easily gets a foothold, while holding Bella. \n          \n          \n          EDWARD\n          Open.\n          \n          \n          She does... to the most astonishing bird's eye VIEW of the\n          valley, river, and the mountains beyond. CAMERA whirls around \n          them allowing us a 360 degree view of their surroundings. Off \n          Bella's intoxicated face..\n          .\n          \n          \n          CUT AWAY TO:\n          \n          \n          A89 EXT. HIGH SCHOOL - DAY A89\n          \n          \n          Jessica pops a volleyball in the air, doing practice serves. \n          Angela takes a picture of her, then points her camera around, \n          looking for another shot. Eric studies some fliers \n          advertising the prom. \n          \n          \n          JESSICA\n          \n          \n          Monte Carlo? That's our prom \n          \n          \n          theme? \n          \n          \n          ERIC\n          Gambling, tuxedos and -\n          -\n          (ala Sean Connery)\n          Bond. James -- ow!\n          \n          \n          -- as Jessica head-butts the ball which hits him in the face.\n          \n          \n          \n          68.\n          ANGELA\n          \n          \n          Oh. My. God.\n          Angela, scanning for a shot, has frozen. Jessica and Eric \n          SEE \n          -\n          \n          \n          BELLA AND EDWARD \n          -- arriving together. All eyes on campus are turning to \n          them, filled with curiosity, jealousy, envy. \n          BELLA\n          Everyone's staring.\n          EDWARD\n          Not that guy over -- yeah, he just \n          looked.\n          Off his rakish, but reassuring smile..\n          .\n          \n          \n          89 \n          CLOSE ON A GERMAN SHEPHERD 89\n          Moving fast, tracking. INCLUDE CHARLIE holding the leash \n          -\n          EXT. FOREST - DAY\n          --It's a hunting party, several dogs, half a dozen armed men.\n          \n          \n          CHARLIE\n          Guys, we got something \n          -\n          \n          \n          The Deputies hurry to Charlie. They gather around \n          -\n          A FOOTPRINT. The dogs start pulling them in a certain \n          direction. As the posse takes off at a sprint \n          -\n          \n          \n          UNKNOWN POV - ON CHARLIE, FROM A DISTANCE\n          We watch Charlie and the posse move away... REVERSE to find \n          -\n          JAMES - ATOP A KNOLL, WATCHING THEM\n          Laurent stands next to him. Victoria jogs up.\n          \n          \n          VICTORIA\n          They took the bait. \n          \n          \n          JAMES\n          By tomorrow they'll be half way to \n          Winnipeg. \n          \n          \n          Victoria lasciviously grabs James' shirt. Pulls him to her.\n          VICTORIA\n          I love when men chase me.\n          \n          \n          \n          69.\n          He grins, then starts taking off her clothes. They pull each \n          other toward the woods with carnal lust. It barely registers \n          with Laurent, who continues to watch the posse with concern. \n          \n          \n          90 EXT./INT. FORKS COFFEE SHOP - LATE AFTERNOON 90\n          \n          \n          Bella hurries toward the entrance, trying to keep the joy on her \n          face in check... with minimal success. Outside the door, she \n          passes Mike, hanging out with several of his basketball TEAMMATES.\n          \n          \n          MIKE\n          Yo, Arizona. So. You and Cullen.\n          \n          \n          She shrugs, non-committal, but can't entirely hide a smile,\n          as she hurries inside to Charlie's table and slides in.\n          \n          \n          BELLA\n          Sorry I'm late. Biology project. \n          \n          \n          Cora sets a top sirloin steak in front of Charlie, and plate \n          of seafood in front of Bella.\n          \n          \n          CHARLIE\n          Ordered you the seafood combo.\n          \n          \n          BELLA\n          Order one for yourself next time. \n          You should cut back on the steak.\n          \n          \n          CHARLIE\n          I'm healthy as a horse.\n          \n          \n          CORA\n          \n          \n          (concerned)\n          Say Chief, boys want to know, you \n          find anything down by Queets River \n          today?\n          \n          \n          Charlie's aware of the LOGGERS at the counter listening, too.\n          He frames his answer carefully to keep everyone calm.\n          \n          \n          CHARLIE\n          The suspect's moving east. Kitsap \n          County Sheriff is taking over from \n          here. They're putting extra guys on.\n          \n          \n          CORA\n          Hope they catch him fast.\n          \n          \n          She moves off, with a measure of relief. Charlie and Bella \n          pass each other the salt, butter for bread, etc., with an \n          easy rhythm now. \n          \n          \n          CHARLIE\n          Your friends are flagging you.\n          \n          \n          \n          70.\n          She turns to see Mike and the guys horsing around outside, \n          straws in their noses, making faces at her. She smiles.\n          \n          \n          CHARLIE\n          It's okay you wanna join them. I'm \n          just gonna turn in early anyway.\n          \n          \n          BELLA\n          Yeah, me, too. \n          \n          \n          CHARLIE\n          It's a Friday night. Go out. The \n          Newton boy's got a big smile for \n          you. Nice family, the Newtons.\n          \n          \n          BELLA\n          He's just a friend.\n          \n          \n          CHARLIE\n          None of the boys in town interest you?\n          \n          \n          BELLA\n          We're not really going to talk \n          about boys, are we?\n          \n          \n          CHARLIE\n          Just... you should be around people. \n          I leave you alone too much.\n          \n          \n          BELLA\n          \n          \n          (with genuine affection)\n          I've never minded being alone. Guess \n          I'm a lot like my dad that way. \n          \n          \n          Charlie smiles. These two have come a long way. Cora returns \n          -\n          \n          \n          CORA\n          Berry cobbler, two forks.\n          \n          \n          She sets it between them. Off them, both reaching for forks..\n          .\n          \n          \n          91 INT. BELLA'S ROOM - NIGHT 91\n          \n          \n          Bella, dressed for bed, looks out the window as she talks on the \n          phone with Rene. Bella's euphoria still lingers in her eyes..\n          .\n          \n          \n          BELLA\n          So spring training's going well?\n          \n          \n          INTERCUT WITH:\n          \n          \n          92 INT. CAFE - NIGHT 92\n          \n          \n          Rene talks on her cell. Phil is in the background, post-batting \n          practice, chowing down with a couple of teammates.\n          \n          \n          \n          71.\n          RENE\n          Phil's working hard. We're looking \n          around for a house to rent, in case \n          it becomes permanent. You'd like \n          Jacksonville, baby. \n          \n          \n          BELLA\n          Actually, Forks is kind of growing on me. \n          \n          \n          RENE\n          (stops, knows there's \n          \n          \n          more)\n          Could... a guy have something to do \n          with that?\n          \n          \n          BELLA\n          (small smile)\n          Maybe..\n          .\n          \n          \n          RENE\n          Tell me everything! Jock? Indie? Bet \n          he's smart. Is he smart?\n          \n          \n          BELLA\n          (trying to avoid lies)\n          Well... he is kind of a history buff.\n          \n          \n          -- this as she turns to find \n          -\n          \n          \n          EDWARD LYING ON HER BED, smiling. She nearly drops the phone.\n          \n          \n          BELLA\n          I, uh... have to go.\n          \n          \n          RENE\n          No way, we gotta talk boys. Are \n          you being safe?\n          \n          \n          Edward shoots her a look, he heard that. She's mortified.\n          \n          \n          BELLA\n          I'll call you later, Mom. \n          \n          \n          STAY ON BELLA who hangs up.\n          \n          \n          BELLA\n          How did you get in here?\n          \n          \n          EDWARD\n          The window. As always.\n          \n          \n          BELLA\n          You've been here before?\n          \n          \n          EDWARD\n          What else is there to do at night? \n          \n          \n          \n          72.\n          She pushes him. He grabs her hand and playfully pulls her \n          onto the bed, wrestling as \n          -\n          \n          \n          BELLA\n          You're a peeping Tom! Perv!\n          \n          \n          EDWARD\n          Shh! The Chief will hear you!\n          \n          \n          But the electricity of their physical contact quickly overwhelms \n          them, their laughter quieting. He studies her face.\n          \n          \n          EDWARD\n          I just... like watching over you. \n          \n          \n          He raises his fingers to her lips, sending a thrill up her spine.\n          \n          \n          EDWARD\n          There's something I'd like to try. \n          \n          \n          She nods, bedazzled by him. He takes her face in his hands, \n          hesitates to test himself, then he softly kisses her..\n          . \n          \n          \n          What neither of them is prepared for is her response. Her \n          breath comes in a wild GASP. Her fingers knot in his hair, \n          clutching him to her. Lips part as she breathes his scent..\n          .\n          \n          \n          Then his hands gently, but forcefully push her face back. She \n          opens her eyes to see that his eyes are wild, his jaw clenched. \n          \n          \n          BELLA\n          (mortified)\n          Oh... I'm... oh.\n          \n          \n          He relaxes slightly, looking at her blushing face.\n          \n          \n          EDWARD\n          I'm stronger than I thought. \n          \n          \n          BELLA\n          Wish I could say the same. I'm so \n          embarrassed.\n          \n          \n          EDWARD\n          Don't be. But we have to be careful.\n          (serious)\n          I can never lose control with you. Ever. \n          \n          \n          She nods, then carefully lies on his chest. He wraps his arms \n          around her. Off the two of them..\n          .\n          \n          \n          93 INT. CHARLIE'S HOUSE - LIVING ROOM - LATE AFTERNOON 93\n          \n          \n          Bella enters to find Charlie cleaning a rifle. He starts to \n          say hello but she just blurts out -\n          -\n          \n          \n          \n          73.\n          BELLA\n          I have a date with Edward Cullen.\n          \n          \n          He suddenly looks like he's having an aneurysm. \n          \n          \n          CHARLIE\n          He's too old for you.\n          \n          \n          BELLA\n          We're both juniors. I thought you \n          liked the Cullens. \n          \n          \n          CHARLIE\n          And I thought you weren't interested in \n          any of the boys in town. \n          \n          \n          BELLA\n          Edward doesn't live \u0093in town.\u0094 And \n          it's in the early stage and -\n          -\n          whatever, he's outside right now.\n          \n          \n          CHARLIE\n          Now? He's out there?\n          \n          \n          BELLA\n          He wants to meet you. Officially. \n          \n          \n          CHARLIE\n          Good.\n          \n          \n          He cocks the rifle in mock-seriousness.\n          \n          \n          BELLA\n          Be nice, okay? He's... important.\n          \n          \n          Charlie gives his daughter a reassuring nod... then she opens \n          the door to REVEAL Edward in a parka and gloves. \n          \n          \n          EDWARD\n          Chief Swan. I wanted to formally \n          introduce myself. I'm Edward.\n          \n          \n          Edward extends his hand. Charlie takes it, but grunts \n          a \n          hello, resisting him.\n          \n          \n          EDWARD\n          I won't keep Bella out late \n          tonight. We're just going to go \n          play baseball with my family.\n          \n          \n          CHARLIE\n          Bella's going to play baseball?\n          \n          \n          Bella's equally surprised, but hides it.\n          \n          \n          \n          74.\n          EDWARD\n          Yes, sir, that's the plan.\n          \n          \n          CHARLIE\n          Well. More power to you, I guess.\n          \n          \n          EDWARD\n          (looks him in the eyes)\n          She'll be safe with me, sir, I promise.\n          \n          \n           As Edward exits... Charlie holds Bella back.\n          \n          \n          CHARLIE\n          (sotto)\n          You got that pepper spray?\n          \n          \n          BELLA\n          \n          \n          Dad.\n          \n          \n          94 EXT. CHARLIE'S HOUSE - LATE AFTERNOON 94\n          \n          \n          Edward and Bella climb into a massive JEEP parked in the drive.\n          \n          \n          EDWARD\n          \n          \n          (amused)\n          Your father thinks you should go to \n          an all-girl's school.\n          \n          \n          BELLA\n          No fair, reading Charlie's mind. \n          \n          \n          As they climb in the Jeep, Bella notices a baseball bat \n          -\n          \n          \n          BELLA\n          And since when do vampires like baseball? \n          \n          \n          EDWARD\n          It's the American pastime. Plus, \n          there's a thunderstorm coming. It's the \n          only time we can play. You'll see why.\n          \n          \n          95 EXT. CLEARING IN WOODS - TWILIGHT 95\n          \n          \n          Storm clouds gather in the sky as Bella and Edward pull up in \n          the Jeep. She takes in a rough baseball diamond, set into an \n          enormous field in the lap of the Olympic peaks. \n          \n          \n          Esme and Emmett come to greet Bella. \n          \n          \n          ESME\n          Good thing you're here. We need \n          a \n          umpire. \n          \n          \n          EMMETT\n          (big crooked grin)\n          She thinks we cheat.\n          \n          \n          \n          75.\n          ESME\n          I know you cheat. Call \u0091em as you \n          see \u0091em, Bella.\n          \n          \n          WHIP PAN to Alice on the Pitcher's Mound.\n          \n          \n          ALICE\n          It's time.\n          \n          \n          -- Just as a deep RUMBLE of thunder shakes the forest.\n          \n          \n          BEGIN MONTAGE - THE GAME\n          \n          \n          And it's extraordinary. Bella stays by Esme who plays \n          catcher. Alice pitches with lightning-fast speed. Edward \n          and Emmett take positions in the outfield. \n          \n          \n          -- ROSALIE SMASHES the ball with the aluminum bat. It CRACKS \n          like thunder -- and is followed directly by real THUNDER. \n          \n          \n          BELLA\n          (to Esme)\n          Now I get why you need the thunder.\n          \n          \n          The ball SHOOTS like a meteor deep into the forest, rocketing \n          through the trees. Edward disappears after it.\n          \n          \n          BELLA\n          That has to be a home run.\n          \n          \n          ESME\n          Edward's very fast.\n          \n          \n          Rosalie darts around the bases, almost a blur -- Edward races out \n          of the forest with the ball and WHIPS it to home plate. WHAP! \n          Esme catches it a millisecond before Rosalie slides in.\n          \n          \n          BELLA\n          Yer out?\n          \n          \n          Esme nods... Amazed, Bella watches as DR. CULLEN hits a line \n          drive. Edward and Emmett race for the catch, DIVING 15 feet \n          and COLLIDING with such might that it sounds like enormous \n          boulders falling. They miss the ball -- Dr. Cullen is safe! \n          \n          \n          JASPER WHACKS the next pitch -- deep into the forest. But \n          before Edward can chase it, Alice suddenly GASPS. \n          \n          \n          ALICE\n          Stop! I didn't see them..\n          . \n          \n          \n          They all stop. Edward is immediately at Bella's side. The \n          family instantly gathers at home plate. \n          \n          \n          ALICE\n          They're traveling so quickly \n          -\n          \n          \n          \n          76.\n          ROSALIE\n          You said they left the county -\n          -\n          \n          \n          ALICE\n          They did, but then they heard us..\n          .\n          (looking at Edward)\n          And changed their minds.\n          \n          \n          EDWARD\n          (to Bella)\n          Put your hair down \n          -\n          \n          \n          ROSALIE\n          Like that'll help. I could smell \n          her from across the field. \n          \n          \n          Edward ignores Rosalie as he arranges Bella's hair.\n          \n          \n          EDWARD\n          I shouldn't have brought you here. \n          I'm so sorry.\n          \n          \n          She'd ask why, but suddenly, they all turn as one toward -\n          \n          THE EDGE OF THE FOREST\n          \n          \n          There's a faint rustle... then James, Victoria and Laurent\n          emerge. As they near, Bella SEES their bare feet, then the \n          deep BURGUNDY of their eyes. Laurent holds up the baseball. \n          \n          \n          LAURENT\n          I believe this belongs to you.\n          \n          \n          He tosses the ball (his casual toss is still blindingly fast) \n          to Dr. Cullen who easily catches it and smiles politely.\n          \n          \n          DR. CULLEN\n          Thank you.\n          \n          \n          LAURENT\n          Could you use three more players?\n          \n          \n          DR. CULLEN\n          Of course.\n          \n          \n          LAURENT\n          I'm Laurent. This is Victoria. \n          And James.\n          \n          \n          DR. CULLEN\n          Would you like to bat first?\n          \n          \n          Laurent picks up a bat. The Cullens take the field. Dr. \n          Cullen is catcher, Edward is on first, with Bella behind him, \n          near the Jeep.\n          \n          \n          \n          77.\n          Bella sees that Edward's eyes are locked onto James. Laurent\n          is at bat first.\n          \n          \n          DR. CULLEN\n          I'm afraid your hunting activities have \n          caused something of a mess for us. \n          \n          \n          LAURENT\n          Our apologies. We didn't realize \n          the territory had been claimed. \n          \n          \n          DR. CULLEN\n          Yes, we maintain a permanent \n          residence.\n          \n          \n          The three newcomers exchange a look of surprise.\n          \n          \n          LAURENT\n          Really? Well, we won't be a problem \n          any more.\n          \n          \n          VICTORIA\n          The humans were tracking us, but we \n          led them East-\n          \n          \n          Jasper pitches the ball -- Laurent SLAMS it -- but Alice is \n          up a tree is a flash and the ball slams into Alice's hand\n          with a THWAP. Laurent is pissed, but James smiles ever so \n          slightly, delighted at the discovery of worthy opponents.\n          \n          \n          James is up next and he POWER-SLAMS IT with AMAZING FORCE..\n          .\n          \n          \n          He runs past first, past Edward, past Bella..\n          .\n          \n          \n          CLOSE ON BELLA -- IN SLOW MOTION as the wind from the ball \n          ruffles her hair, carrying her scent, which floats to \n          -\n          \n          \n          JAMES -- who suddenly SCREECHES to a halt. His head WHIPS \n          around at her and he lurches into a crouch, his nostrils \n          flaring, excitedly, eyes locked on Bella.\n          \n          \n          JAMES\n          You brought a snack.\n          \n          \n          EDWARD springs in front of Bella, baring his teeth. A truly \n          menacing, feral SNARL rips from his throat. James GROWLS back.\n          \n          \n          OVERHEAD SHOT: in a flash, the Cullens rush into position \n          behind Edward -- Laurent and Victoria line up behind James. \n          \n          \n          DR. CULLEN\n          The girl is with us.\n          \n          \n          \n          78.\n          LAURENT\n          (trying to defuse \n          situation)\n          We won't harm her.\n          \n          \n          EMMETT\n          (hungry for battle)\n          Just try it.\n          \n          \n          DR. CULLEN\n          I think it best if you leave.\n          \n          \n          LAURENT\n          Yes, I can see the game is over. \n          We'll go now. James?\n          \n          \n          But James' eyes don't leave Edward's. Laurent puts a hand on\n          James' shoulder, and finally, James backs into the woods with\n          his cohorts, disappearing. Once they're gone, Esme \n          immediately gathers up the bats-\n          -\n          \n          \n          DR. CULLEN\n          Get Bella out of here. We'll follow \n          them. \n          \n          \n          Dr. Cullen, Jasper and a resentful Rosalie race off after the \n          three vampires. Edward scoops Bella up as we \n          -\n          \n          \n          SMASH TO:\n          \n          \n          EXT. BASEBALL FIELD - ON THE JEEP - LATE TWILIGHT 96\n          \n          \n          Edward whips Bella into the Jeep and straps her in -\n          -\n          \n          \n          EDWARD\n          James is a tracker. I saw his mind. \n          The hunt is his obsession, and my \n          reaction set him off -\n          -\n          \n          \n          -- The tires spin as Edward WHIPS the jeep around \n          -\n          \n          \n          EDWARD\n          -- We're a large clan of strong fighters \n          all protecting one vulnerable human. \n          \n          \n          (dark with disgust)\n          I just made this his most exciting \n          game ever.\n          \n          \n          Bella blanches with the dawning realization of what she has just \n          wrought up on them all as..\n          .\n          \n          \n          THE JEEP CAREENS DOWN THE DIRT MOUNTAIN ROAD\n          \n          \n          A jolting, death defying ride, SPLASHING through creeks, until \n          they reach \n          -\n          \n          \n          \n          79.\n          97 EXT. MOUNTAIN ROAD - NIGHT 97\n          \n          \n          THE JEEP speeds wildly down the road.\n          \n          \n          EDWARD\n          The first place he'll go is your \n          house. He'll track your scent \n          there.\n          \n          \n          BELLA\n          \n          \n          (horrified)\n          What?!? Charlie's there. He's in \n          danger because of me. Because of \n          us!\n          \n          \n          EDWARD\n          \n          \n          (calmly)\n          Then we'll lead the tracker away \n          from him. Somehow.\n          \n          \n          He angrily WHIPS around a bend, MUD FLYING \n          -\n          \n          \n          98 INT. CHARLIE'S HOUSE - LIVING ROOM - NIGHT 98\n          \n          \n          Charlie watches a baseball game on T.V. as the door suddenly \n          BURSTS open to reveal Bella, crying, and Edward, devastated-\n          \n          \n          BELLA\n          I said, leave me alone! \n          \n          \n          EDWARD\n          Bella, don't do this. Just think \n          about it, please \n          -\n          \n          \n          BELLA\n          Get out! It's over.\n          \n          \n          She SLAMS the door. Charlie has risen, baffled, concerned.\n          \n          \n          CHARLIE\n          Bella? What happened? \n          \n          \n          BELLA\n          I have to get out of this place. \n          Out of Forks. I'm leaving. Now.\n          \n          \n          Bella runs upstairs. Charlie hurries after her \n          -\n          \n          \n          99 INT. BELLA'S BEDROOM - NIGHT 99\n          \n          \n          Bella slams the door behind her. REVEAL Edward's already there,\n          pulling things from her drawers and shoving them into a duffle \n          faster than humanly possible. Bella leans against the door. \n          \n          \n          \n          80.\n          BELLA\n          (a pained whisper)\n          I can't hurt him.\n          \n          \n          Edward gives her a look, you have to. There's a KNOCK.\n          \n          \n          INTERCUT Charlie on the other side. It's agony for both of them.\n          \n          \n          CHARLIE \n          Bells. Did he hurt you?\n          \n          \n          BELLA\n          No, Dad. \n          \n          \n          CHARLIE\n          Then what? Did he break up with you? \n          \n          \n          BELLA\n          I broke up with him. \n          \n          \n          CHARLIE\n          I thought you liked him?\n          \n          \n          BELLA\n          That's why I have to leave. I don't \n          want this. I want to go home.\n          \n          \n          EDWARD\n          (whispering)\n          I'll be in the truck.\n          \n          \n          And he disappears out the window. Bella gathers strength to \n          continue her performance. She opens the door to reveal Charlie. \n          He follows as she carries her duffle and truck keys into \n          -\n          \n          \n          100 INT. CHARLIE'S HOUSE - STAIRS (CONTINUOUS) - NIGHT 100\n          \n          \n          Bella charges down the stairs -- Charlie follows.\n          \n          \n          CHARLIE\n          Your mother's not even in Phoenix. \n          \n          \n          BELLA\n          She'll come home. I'll call her \n          from the road.\n          \n          \n          CHARLIE\n          You can't drive home now. I'll take \n          you to the airport in the morning.\n          \n          \n          BELLA\n          I want to drive. I need time to \n          think. I'll pull into a motel in \n          a \n          few hours. I promise.\n          \n          \n          She heads down the stairs. Charlie follows..\n          . \n          \n          \n          \n          81.\n          101 INT. CHARLIE'S HOUSE -LIVING ROOM (CONTINUOUS) -NIGHT 101\n          \n          \n          Bella reaches the ground floor with Charlie on her heels. \n          She's almost to the door but Charlie blocks her. \n          \n          \n          CHARLIE\n          \n          \n          Bells, I know I'm not around much, \n          \n          \n          but I can change that. We can do \n          \n          \n          more things together.\n          \n          \n          She takes a breath, hating herself for what she's about to say..\n          .\n          \n          \n          BELLA\n          \n          \n          Like watch more baseball on the flat \n          \n          \n          screen? Or go to the Coffee Shop? \n          \n          \n          Same people, same steak, same berry \n          \n          \n          cobbler every night? That's you, \n          \n          \n          Dad. Not me.\n          \n          \n          This hits Charlie hard. She can barely stand it, heads down \n          the stairs, as he takes a second to recover..\n          .\n          \n          \n          CHARLIE\n          Bella... I just got you back.\n          \n          \n          Which breaks Bella's heart... and forces her to deliver the\n          final blow.\n          \n          \n          BELLA\n          \n          \n          And if I don't get out now, I'm \n          \n          \n          going get stuck here like mom did.\n          \n          \n          Charlie is stunned, wounded. She takes advantage of his \n          shock, pushing past him out the door. \n          \n          \n          102 EXT. CHARLIE'S HOUSE - NIGHT 102\n          \n          \n          Bella exits, heads to her truck. Fresh tears spring to her \n          eyes. \n          \n          \n          ANGLE ON THE WOODS \n          \n          \n          Trees, branches... and a pair of DEADLY EYES. James. He watches \n          from a distance as Bella pulls out. The truck moves off... and \n          so does James, leaving Charlie alone with his pain, staring out \n          the window.\n          \n          \n          103 INT. BELLA'S TRUCK - NIGHT 103\n          \n          \n          Bella drives, wiping tears away. Suddenly Edward is outside \n          the car, near Bella's window. \n          \n          \n          \n          82.\n          EDWARD\n          He'll forgive you.\n          (off Bella's startled look)\n          Slide over..\n          .\n          \n          \n          Bella slides over to the passenger side as Edward opens the \n          door, sliding in, and takes the wheel. Bella slumps.\n          \n          \n          BELLA\n          His face... I said the same words \n          my mother used when she left him. \n          \n          \n          EDWARD\n          It was the only way he'd let you go. \n          \n          \n          Edward FLOORS it.\n          \n          \n          EDWARD\n          Your father's safe now, Bella. The \n          tracker is following us \n          -\n          \n          \n          Suddenly, BOOM! - a dark figure LEAPS onto the bed of the \n          truck. Bella SCREAMS. \n          \n          \n          EDWARD\n          It's alright. It's just Emmett. \n          Alice is in the car behind us. \n          \n          \n          She catches her breath. It kills him to see her so frightened. \n          She looks out the window as they drive through town..\n          . \n          \n          \n          104 BELLA'S POV - EXT. FORKS COFFEE SHOP (CONT) - NIGHT 104\n          \n          \n          The small, insulated town passes by in SLOW MOTION... INSIDE we \n          SEE Mike, Jessica, Eric and Angela laughing, flirting, innocent, \n          hopeful..\n          .\n          \n          \n          105 EXT. CULLEN HOUSE - NIGHT 105\n          \n          \n          Edward, Emmett and Alice rush Bella from the truck to the \n          house... but freeze when the door opens and Laurent exits. They \n          immediately take defensive positions but Dr. Cullen appears.\n          \n          \n          DR. CULLEN\n          He came to warn us. About James.\n          \n          \n          They back down slightly. Laurent address Dr. Cullen.\n          \n          \n          LAURENT\n          I've grown tired of his games. But \n          he's got unparalleled senses. \n          Absolutely lethal. I've never seen \n          anything like him in three hundred \n          years ... And the woman, Victoria, \n          will back him. Don't underestimate \n          her.\n          \n          \n          \n          83.\n          Dr. Cullen nods thanks. Laurent looks at Edward, apologetic. \n          \n          \n          LAURENT\n          I'm truly sorry for what's been \n          unleashed here.\n          \n          \n          And he moves off, disappearing into the woods..\n          .\n          \n          \n          106 INT. CULLEN HOUSE - FOUR CAR GARAGE - NIGHT\n          \n          \n          The side door BURSTS OPEN as Edward and the Cullens enter, \n          followed by Bella. The lights flip on to reveal a pristine \n          garage; the Volvo, the red BMW, a black Mercedes sedan, an SUV. \n          \n          \n          Everyone but Rosalie springs into action, opening cupboards for \n          supplies - cell phones, extra batteries, maps, portable GPS units, \n          changes of clothes, cans of gasoline, etc. As they load up the \n          vehicles \n          -\n          \n          \n          JASPER\n          I've had to fight our kind before. \n          We're hard to kill.\n          \n          \n          EDWARD\n          But not impossible. We'll tear him up \n          \n          \n          EMMETT\n          \n          \n          (with bloodlust)\n          We'll rip him apart with our hands, \n          then burn the pieces \n          -\n          \n          \n          DR. CULLEN\n          I don't relish killing another creature. \n          Even a sadistic one like James.\n          \n          \n          ROSALIE\n          If he doesn't get to one of us \n          first.\n          \n          \n          BELLA\n          \n          \n          (horrified)\n          This is insane. You can't put yourselves \n          in danger like this - for me.\n          \n          \n          ROSALIE\n          Too late.\n          \n          \n          Edward shoots Rosalie a look, but he grabs two sets of keys \n          off a hook, throwing one set, lightning fast, to Dr. Cullen \n          -\n          \n          \n          EDWARD\n          I'll run Bella south, while you lead \n          the tracker away \n          -\n          \n          \n          \n          84.\n          DR. CULLEN\n          No, Edward -- the tracker thinks \n          you won't leave Bella. He'll \n          follow you.\n          \n          \n          ALICE\n          I'll go with Bella. Jasper and \n          I \n          will drive her south.\n          \n          \n          (facing him)\n          I'll keep her safe, Edward.\n          \n          \n          Edward agonizes. Frustrated. Alice steps forward.\n          \n          \n          EDWARD\n          (studies her, torn)\n          Can you keep your thoughts to yourself?\n          \n          \n          She nods. An unspoken agreement. Edward finally surrenders \n          his keys to Alice. Then he opens one of Bella's suitcases,\n          pulling out clothes, tossing them to \n          -\n          \n          \n          EDWARD\n          Esme, Rosalie, put these on so the \n          tracker will pick up Bella's scent. \n          \n          \n          ROSALIE\n          \n          \n          (dropping the clothes)\n          Why should I? What is she to me? Just \n          a danger you've inflicted on us \n          -\n          \n          \n          DR. CULLEN\n          \n          \n          (spinning on her)\n          Rosalie. Bella is with Edward. She's \n          a part of this family now. And we \n          protect our family. \n          \n          \n          She glowers, but picks up the clothes. Dr. Cullen hits the door \n          opener and the massive METAL DOORS roll open. Dr. Cullen \n          squeezes Edward's shoulder before he and Esme climb into the\n          SUV. Everyone finishes loading up, climbing in cars \n          -\n          \n          \n          Amid this, Edward and Bella take a moment together.\n          \n          \n          BELLA\n          If any of you get hurt because of me \n          -\n          \n          \n          EDWARD\n          We won't, there are five of us, two of \n          them. When it's done, I'll come get you. \n          \n          \n          He pulls her closer, looking into her eyes. \n          \n          \n          EDWARD\n          You're my life now.\n          \n          \n          \n          85.\n          They drink each other in, possibly for the last time... as the SUV \n          PEELS out, WIPING THE FRAME \n          -\n          \n          \n          107 EXT. HIGHWAY, PACIFIC NORTHWEST - DAWN 107\n          \n          \n          The sun begins to rise on the empty road as a sleek, black \n          MERCEDES SEDAN with dark tinted windows BLASTS through frame \n          -\n          \n          \n          108 INT. MERCEDES - SAME 108\n          \n          \n          Jasper drives, Alice in the passenger seat. Bella is in the \n          back, her eyes red from crying. She talks on her cell phone \n          -\n          \n          \n          BELLA\n          \n          \n          Mom, it's me again. You must have \n          \n          \n          let your phone die. Anyway, I'm \n          \n          \n          not in Forks anymore but I'm okay. \n          \n          \n          I'll explain when you call.\n          \n          \n          She hangs up, then faces back out the window, watching the green, \n          misty Olympic Peninsula speed past. Off Bella's face -\n          \n          A SERIES OF DISSOLVES THROUGHOUT THE DAY, THEN THE NIGHT \n          \n          \n          -- show us the landscape as it changes from dark green \n          forests to stretches of grassy hillsides, to drier, browner \n          surroundings, until night falls and headlights lights flash \n          by us. Finally, we land in..\n          .\n          \n          \n          109 OMITTED 109\n          \n          \n          110 EXT. FOREST, OLYMPIC PENINSULA - DAY 110\n          \n          \n          TREES BLOW PAST US at a blinding speed as we track Edward, \n          Rosalie, and Emmett who dart in and out of frame, blasting through \n          the misty woods, Edward, the fastest, in the lead.\n          \n          \n          Edward stops, trying to read his enemy's thoughts. Rosalie \n          tears a tiny swatch of her shirt, leaves it on a FLOWERING \n          MAPLE TREE. And then they're gone.\n          \n          \n          111 OMITTED 111\n          \n          \n          112 EXT. ANOTHER PART OF THE WOODS - DAY 112\n          \n          \n          Esme and Dr. Cullen crouch atop a hill, looking down at the \n          river. In the distance, below, they SEE \n          -\n          \n          \n          THEIR POV - ON THE LAKE - VICTORIA jogs into view. She then looks \n          in their direction. Once Dr. Cullen and Esme are assured she has \n          their scent, they continue over the hill's crest. \n          \n          \n          113 OMITTED 113\n          \n          \n          114 EXT. FOREST, OLYMPIC PENINSULA - DAY 114\n          \n          \n          \n          86.\n          James blasts past the FLOWERING MAPLE -- then stops, backtracks to \n          the tree, finds the tiny swatch of fabric. He starts off again..\n          . \n          but stops, smells the fabric. Something's not right. He runs\n          back in the opposite direction... Uh oh..\n          .\n          \n          \n          SMASH TO:\n          \n          \n          115 INT. SCOTTSDALE HOTEL - BEDROOM - LATE AFTERNOON 115\n          \n          \n          ON BELLA'S FACE: her eyes pop open. She's lying atop a bed, \n          fully clothed. She rises, reorienting.\n          \n          \n          116 INT. SCOTTSDALE HOTEL - LIVING ROOM - LATE AFTERNOON 116\n          \n          \n          The blinds are pulled. Alice and Jasper stare blankly at \n          a \n          \n          \n          T.V. set. Several plates of food crowd a table. Alice looks \n          up as Bella enters, looking at her cell phone. \n          BELLA\n          I wish he'd call.\n          \n          \n          ALICE\n          You should eat.\n          \n          \n          But Bella ignores the food. She sits heavily.\n          \n          \n          BELLA\n          They could get hurt. It's not \n          worth it.\n          \n          \n          JASPER\n          (insistent)\n          Yes. It is. \n          \n          \n          She's taken aback. It's the first time he's engaged with her.\n          \n          \n          JASPER\n          Edward's changed since he found \n          you. And none of us want to look \n          into his eyes for the next hundred \n          years if he loses you. \n          \n          \n          (he looks forward again)\n          It's worth it.\n          \n          \n          Suddenly, Alice REELS. Jasper goes to her, Bella follows.\n          \n          \n          JASPER\n          What do you see?\n          \n          \n          ALICE\n          (with deep worry)\n          The tracker. He just changed course..\n          .\n          \n          \n          Jasper quickly sets a pad of paper and pencil in front of her. \n          \n          \n          \n          87.\n          JASPER\n          Where will it take him, Alice?\n          \n          \n          PUSH IN ON ALICE'S FACE as we-\n          \n          \n          FLASH POP TO - JAMES\n          \n          \n          A disorienting vision of him standing in a room full of..\n          .\n          \n          \n          ALICE\n          Mirrors. It's a room of mirrors.\n          \n          \n          Alice begins to draw at HYPER SPEED, closing her eyes, trying \n          to see it clearly.\n          \n          \n          BELLA\n          How do the visions work? Edward \n          said they weren't always certain. \n          \n          \n          JASPER\n          She sees the course people are on, \n          while they're on it. If they change \n          their minds, the visions change. \n          \n          \n          Bella looks over Alice's shoulder to see the drawing.\n          \n          \n          BELLA\n          So the course James is on now will \n          lead him to... a ballet studio?\n          \n          \n          ALICE\n          (looks up at her)\n          You've been here?\n          \n          \n          BELLA\n          No. I don't know. I used to take \n          ballet lessons as a kid. The \n          school had an arch like that.\n          \n          \n          JASPER\n          Was your school here in Phoenix? \n          \n          \n          BELLA\n          Yeah, around the corner from my house. \n          But I haven't been there in ten years.\n          \n          \n          JASPER\n          Do you have any reason to go now?\n          \n          \n          BELLA\n          No. Hell, no. I hated the place.\n          \n          \n          Alice and Jasper share a look, trying to figure this out. \n          Suddenly, Bella JUMPS as her cell phone RINGS. She picks it \n          up. Sees the caller I.D. and exhales relief. She answers..\n          .\n          \n          \n          \n          88.\n          BELLA\n          Edward. Are you alright?\n          \n          \n          INTERCUT WITH:\n          \n          \n          117 INT. JEEP/EXT. WASHINGTON ROAD - DAY 117\n          \n          \n          Dr. Cullen drives the Jeep, fast, Emmett in the back, Edward in \n          the passenger seat on his cell phone. \n          \n          \n          EDWARD\n          I'm coming to get you. \n          (hates having to say \n          \n          \n          this)\n          We lost the tracker. The woman is \n          still in the area. Rosalie and \n          Esme are protecting your father.\n          \n          \n          BELLA\n          \n          \n          (sinking)\n          This is my fault. You warned me, \n          but I didn't think. I just..\n          .\n          \n          \n          EDWARD\n          Bella, we're in too deep. We can't \n          change how we feel..\n          .\n          \n          \n          BELLA\n          No... we can't.\n          (then)\n          When will you get here?\n          \n          \n          EDWARD\n          In a couple hours. Then you and \n          I \n          will go somewhere. Together. The \n          others will keep hunting.\n          \n          \n          (then, determined)\n          Bella, I swear to you, I'll do whatever \n          it takes to make you safe again. \n          \n          \n          Off Bella, her eyes welling..\n          .\n          \n          \n          118 EXT. SCOTTSDALE HOTEL - DAY 118\n          \n          \n          SEE Alice in the lobby, settling the bill. Jasper loads up \n          the car out front. \n          \n          \n          119 INT. SCOTTSDALE HOTEL - BEDROOM - DAY 119\n          \n          \n          Bella gathers her things, then her phone RINGS again. \n          \n          \n          INSERT CALLER I.D. -It reads \u0093HOME.\u0094 Bella answers -\n          \n          BELLA\n          Mom, I'm so glad you got my -\n          -\n          \n          \n          \n          89.\n          RENE (O.S.\n          )\n          (panicked)\n          Bella? Bella? Where are you? \n          \n          \n          BELLA\n          Calm down, Mom. Everything is fine, \n          okay? I'll explain every \n          -\n          \n          \n          HEAR RUSTLING on the line, as if Rene dropped the phone.\n          \n          \n          BELLA\n          ... Mom? Are you there?\n          \n          \n          Then Bella HEARS a voice that sends a chill down her spine \n          -\n          \n          \n          JAMES (O.S.\n          )\n          Nice house you have here. Not the \n          best on the block, but comfortable. \n          \n          \n          INTERCUT WITH:\n          \n          \n          120 INT. RENE'S HOUSE, PHOENIX - DAY 120\n          \n          \n          VERY CLOSE ON JAMES, his sinister eyes and vicious smile.\n          \n          \n          JAMES\n          I was prepared to wait for you. \n          But then Mom came home after she \n          received a very worried call from \n          your Dad. It all worked out quite \n          well.\n          \n          \n          Bella's eyes are wild with fear.\n          \n          \n          JAMES\n          I must say, Forks High School doesn't \n          protect its students' privacy very \n          well. It was just too easy for \n          Victoria to find your previous address. \n          \n          \n          RENE (O.S.\n          )\n          Bella? Bella?..\n          .\n          \n          \n          BELLA\n          Leave my mother out of this.\n          \n          \n          JAMES\n          You're protective of her. That's \n          nice. You can still save her. But \n          you'll need to get away from your \n          friends. Can you do that? \n          \n          \n          BELLA\n          I... don't think so.\n          \n          \n          \n          90.\n          JAMES\n          If your mother's life depends on it? \n          \n          \n          Bella is terrified, but there's no choice here. \n          \n          \n          BELLA\n          Where should I meet you?\n          \n          \n          James grins as he fingers a PHOTO of Bella that's attached to\n          the refrigerator with a magnet. It's the same photo Charlie\n          has of her, age 7, in a tutu, sitting on the floor. \n          \n          \n          JAMES\n          The old ballet studio around the \n          corner. And I'll know if you bring \n          anyone along. Poor mommy would pay \n          the price for that mistake.\n          \n          \n          (sniffs the air)\n          She smells like you. Delicious.\n          \n          \n          STAY ON BELLA as she hangs up, panicked. She starts flinging \n          open drawers, searching for a weapon - a pen, a sewing kit. \n          Useless. Then she remembers..\n          .\n          \n          \n          Her purse. She dumps out the contents, and FINDS the pepper \n          spray Charlie gave her. She clings to it, her only protection \n          now.\n          \n          \n          121 OMITTED 121\n          \n          \n          122 OMITTED 122\n          \n          \n          123 OMITTED 123\n          \n          \n          124 OMITTED 124\n          \n          \n          125 OMITTED 125\n          \n          \n          126 OMITTED 126\n          \n          \n          127 INT./EXT. SCOTTSDALE HOTEL - TWILIGHT - DRIVING 127\n          \n          \n          Bella walks through the lobby, scanning for Jasper and Alice. \n          She spots them outside under the porte cacher, loading the \n          Mercedes, deep in a heated discussion. She slips out the \n          opposite door, rushes toward a Taxi and jumps in, closes the \n          door. The DRIVER is an elderly woman with a hacking COUGH. \n          \n          \n          BELLA\n          (taking a breath for \n          courage)\n          8th and Palo Verde, please.\n          \n          \n          The taxi pulls out. Bella watches the hotel disappear. Off \n          her FACE IN THE REAR WINDOW..\n          .\n          \n          \n          \n          91.\n          BELLA (V.O.\n          )\n          \n          \n          I've never given much thought to \n          \n          \n          how I would die..\n          .\n          \n          \n          128 EXT. SCOTTSDALE HOTEL - NIGHT - BELLA'S POV 128\n          \n          \n          Once again, we see the polished malls, the manicured cactus \n          gardens. All empty for the night. \n          \n          \n          BELLA (V.O.\n          )\n          \n          \n          But dying in the place of someone \n          I \n          \n          \n          love seems like a good way to go..\n          . \n          \n          \n          129 OMITTED 129\n          \n          \n          130 OMITTED 130\n          \n          \n          131 EXT. MIMI'S SCHOOL OF DANCE - NIGHT 131\n          \n          \n          Bella climbs out of the taxi. It pulls away, leaving her on the \n          curb facing the deserted building. Bella twirls her mother's\n          ring around her finger, then reaches for the pepper spray.\n          \n          \n          BELLA (V.O.\n          )\n          \n          \n          I can't bring myself to regret the \n          \n          \n          decisions that brought me face to \n          \n          \n          face with death... they also \n          \n          \n          brought me to Edward.\n          \n          \n          She slips the pepper spray into her jeans pocket. She wraps \n          her purse strap around her wrist. She takes a breath, \n          approaches the school. Peers in the windows. The blinds are \n          drawn. But from inside, we HEAR a faint sound..\n          .\n          \n          \n          RENE (O.S.\n          )\n          Bella? Bella? \n          \n          \n          It's time. Bella goes to the front door. It's unlocked.\n          \n          \n          132 OMITTED 132\n          \n          \n          133 INT. MIMI'S SCHOOL OF DANCE - STUDIO - NIGHT 133\n          \n          \n          Bella cautiously enters this grand, empty room of mirrors. \n          A \n          ballet bar wraps around the walls -\n          -\n          \n          \n          RENE (O.S.\n          )\n          Bella, where are you? \n          \n          \n          Bella whirls, trying to find its source. She follows the sound to \n          a cleaning supply CLOSET. She throws open the door to FIND \n          -\n          \n          \n          A T.V. - ON SCREEN A VIDEO PLAYS - Bella, age 7, hides in the \n          very closet the T.V. is in now. Little Bella looks up at us. \n          \n          \n          \n          92.\n          RENE (O.S.\n          )\n          Don't you want to dance, baby? \n          \n          \n          Little Bella shakes her head stubbornly. The frame jiggles \n          as Rene hands someone the camera. Rene, ten years younger, \n          appears on screen and kneels next to Bella.\n          \n          \n          BELLA\n          Everyone makes fun of me.\n          \n          \n          RENE\n          But you're a wonderful dancer.\n          \n          \n          BELLA\n          Mom, I suck. \n          \n          \n          LAUGHTER behind Bella. She spins, trying to locate James in \n          the mirrors. \n          \n          \n          JAMES\n          That's my favorite part. Stubborn \n          child, weren't you?\n          \n          \n          Bella's face flushes with rage... and relief. \n          \n          \n          BELLA\n          She's not here.\n          \n          \n          JAMES\n          Sorry. But you really made it too easy.\n          \n          \n          Visible in the mirror, he sighs, disappointed. Then he steps \n          up next to her and points a VIDEO CAMERA at Bella. \n          \n          \n          JAMES\n          So to make things more entertaining, \n          I'm going to make a little film of our \n          time together. Borrowed this from \n          your house. Hope you don't mind. \n          \n          \n          (turns it on)\n          And... action!\n          \n          \n          Bella FLINGS her purse at him, and runs for the door.\n          \n          \n          JAMES\n          Excellent! An escape attempt.\n          \n          \n          Suddenly, he's right behind her. She freezes. \n          \n          \n          JAMES\n          It'll break Edward's little heart.\n          \n          \n          He smells her hair. Touches her throat. \n          \n          \n          BELLA\n          Edward has nothing to do with this.\n          \n          \n          \n          93.\n          JAMES\n          He will. His rage will make for \n          more interesting sport than his \n          feeble attempt to protect you.\n          \n          \n          He's having too much fun to notice --the peppers spray in\n          her hand. She spins around and sprays him. \n          \n          \n          Then she runs, as James REELS back briefly. But he leaps \n          over her and lands RIGHT IN FRONT OF HER. \n          \n          \n          Amused, he flings her across the floor like a bowling ball. \n          She SMASHES hard into a mirrored column. James captures it \n          on film. \n          \n          \n          JAMES\n          Beautiful! Very visually dynamic. \n          I chose my stage well.\n          \n          \n          He advances toward her.\n          \n          \n          JAMES\n          Still stubborn, aren't you? Is that \n          what makes you special? Because \n          frankly, I don't see it. \n          \n          \n          He inhales as if he can taste her already \n          -\n          \n          \n          JAMES\n          Too bad he didn't have the strength \n          to turn you. Instead, he kept you \n          this fragile little human. It's \n          cruel, really. \n          \n          \n          James flips on the camera, but the lens is coated with pepper \n          spray. He tries to wipe it off.\n          \n          \n          JAMES\n          Well done! You've succeeded in \n          annoying me.\n          \n          \n          He STOMPS on her shin! HEAR her tibia SNAP! Bella SCREAMS in \n          agony. \n          \n          \n          JAMES\n          Tell Edward how much it hurts. \n          \n          \n          Abruptly, the camera is in her face \n          -\n          \n          \n          JAMES\n          Tell him to avenge you.\n          \n          \n          BELLA\n          No! Edward, don't..\n          . \n          \n          \n          \n          94.\n          James inhales as her blood pools. He leans in, hungry. Bella, \n          half-conscious, watches him turn the camera on his own face \n          -\n          \n          \n          VIDEO CAMERA'S POV - ECU ON JAMES' FACE\n          \n          \n          JAMES\n          Cut! The end.\n          \n          \n          Suddenly -- JAMES IS KNOCKED OUT OF FRAME! \n          \n          \n          He rises to find himself face to face with Edward. James \n          CHARGES Edward, forcing him up against a column. \n          \n          \n          JAMES\n          You're alone... because you're \n          faster than the others. But not \n          stronger.\n          \n          \n          James SMASHES Edward's face into the mirror until it cracks.\n          \n          \n          EDWARD\n          I'm strong enough to kill you.\n          \n          \n          Edward FLINGS James backwards -- SMASHING through \n          a \n          freestanding mirror -- into the doorway. He scoops Bella up \n          and leaps toward the balcony exit door -- when suddenly he \n          and Bella are JERKED downward.\n          \n          \n          James YANKS Edward violently onto the floor -- KNOCKING Bella \n          out of his arms -- as James FLINGS Edward up into the top \n          window -- EMBEDDING him in the casement and bricks. \n          \n          \n          James crouches beside Bella. He grabs her HAND \n          -\n          \n          \n          Looking directly at Edward with a sinister grin -- he SINKS \n          HIS TEETH into Bella's hand! She SCREAMS in agony. \n          \n          \n          Edward's rage ERUPTS -- he climbs out of the window casement \n          and SUICIDE-DIVE-BOMBS James, savagely PLOWING him through \n          the floorboards.\n          \n          \n          ON BELLA -- as the venom travels through her veins. \n          \n          \n          BELLA'S POV - dark figures twist and fight, in and out of \n          focus. \n          \n          \n          Her eyes suddenly POP OPEN to see the EXPLOSIVE RAW REALITY \n          of James KICKING Edward, delivering death blows when -\n          -\n          \n          \n          Suddenly Edward's hand SHOOTS UP and GRABS James' ankle.\n          Edward ROARS up to his feet and SWINGS James around like \n          a \n          baseball bat, SMASHING him into mirror after mirror. \n          \n          \n          James is battered, beaten. Bella moans -- and the sound of \n          her pain slices through Edward. In an animalistic fury, \n          Edward BITES OFF a piece of James' flesh ..\n          .\n          \n          \n          \n          95.\n          WHIP PAN from Bella's horrified face to DR. CULLEN --now\n          standing beside Edward, placing a hand on his son's shoulder.\n          \n          \n          Edward turns to see his father -- and EMMETT, JASPER, and \n          ALICE, dropping down from the balcony.\n          \n          \n          Edward's expression changes --he realizes he's gone too far.\n          He backs off as his siblings crouch into attack mode and \n          LUNGE at James like a pack of animals.\n          \n          \n          Dr. Cullen rushes to the injured Bella who SCREAMS again in \n          pain. Edward dashes toward her -\n          -\n          \n          \n          BELLA'S POV -ON THE THREE CULLEN SIBLINGS, going in and out\n          of focus... it almost looks like a tribal dance as they rip \n          out the floorboards and build a fire ... it's like a funeral\n          pyre as they rip James apart, throwing limbs into the fire..\n          . \n          \n          \n          BACK ON BELLA -- as Edward reaches her side. Dr. Cullen works \n          fast to assess her wounds, focusing on a massive bleed from her \n          leg. But clearly her hand hurts the most. She writhes in pain. \n          \n          \n          INTERCUT BELLA'S DISORIENTED POV WITH THE CHAOTIC REALITY:\n          \n          \n          Dr. Cullen applies pressure to the gash on her thigh -\n          -\n          \n          \n          DR. CULLEN\n          Her femoral artery's been severed. \n          She's losing too much blood \n          -\n          \n          \n          BELLA\n          It's on fire! My hand!\n          \n          \n          EDWARD\n          Venom -\n          -\n          \n          \n          DR. CULLEN\n          \n          \n           (working on Bella)\n          \n          \n          You have to make a choice. Either \n          \n          \n          let the change happen \n          -\n          \n          \n          EDWARD\n          No!\n          \n          \n          BELLA'S POV -ALICE appears behind Edward, fuzzy, indistinct.\n          \n          \n          ALICE\n          It's going to happen. I've seen it \n          -\n          \n          \n          EDWARD\n          It doesn't have to be that way.\n          \n          \n          DR. CULLEN\n          Alice, find me a tourniquet. \n          A \n          rag, a shirt.\n          \n          \n          \n          96.\n          Alice holds her nose and avoids the blood as she rips the \n          sleeve off her blouse and kneels to aid Dr. Cullen. \n          \n          \n          BELLA\n          It's burning!\n          \n          \n          EDWARD\n          What's the other choice? You said \n          -\n          \n          \n          DR. CULLEN\n          (to Alice)\n          Tighter, above the knee \n          -\n          \n          \n          EDWARD\n          \n          \n          Carlisle.\n          \n          \n          DR. CULLEN\n          You can try to suck the venom out. \n          \n          \n          EDWARD\n          I -- won't be able to stop \n          -\n          \n          \n          DR. CULLEN\n          Find the will to stop. But choose, \n          she only has minutes left.\n          \n          \n          Edward looks down at Bella, thrashing in pain. Finally, \n          Edward takes her hand. She tries to pull it away.\n          \n          \n          EDWARD\n          It's alright, Bella. I'll make it \n          go away. \n          \n          \n          He looks at her - then starts to suck the venom from her \n          hand. They never take their eyes off one another, the \n          connection palpable, intense..\n          . \n          \n          \n          CLOSE ON BELLA'S EYES -wild with pain. But subsiding..\n          .\n          \n          \n          CLOSE ON EDWARD'S EYES -the frenzy has begun. He sucks\n          harder. Hungrily. Anguished, he wants to stop but can't. \n          Dr. Cullen's voice sounds miles away..\n          .\n          \n          \n          DR. CULLEN\n          Stop. Her blood is clean, you're \n          killing her.\n          \n          \n          -- but the bloodlust is too strong. He is killing her. Bella \n          looks at him, forgivingly, as she begins to lose consciousness..\n          . \n          \n          \n          BELLA'S POV -ON EDWARD -growing blurry... he disappears\n          into the blinding light. It's as if she's underwater, like\n          her dreams..\n          . \n          \n          \n          BELLA (V.O.\n          )\n          Death is peaceful. Easy.\n          \n          \n          \n          97.\n          Bella starts to float away... we're losing her..\n          .\n          Suddenly from the darkness, Edward reaches out a hand..\n          .\n          A brilliant light flares..\n          .\n          \n          \n          134 BELLA'S FACE APPEARS IN THE WHITENESS\n          Eyes closed. But they slowly open. She squints at the light. \n          BELLA\n          Life... is harder..\n          . \n          An oxygen tube rests under her nose. She reaches for it, \n          confused. A hand stops her as her surroundings come into focus.\n          RENE (O.S.\n          )\n          \n          \n          You're awake, baby! You're okay!!\n          !\n          INT. HOSPITAL ROOM - DAY\n          Bella lies in a hospital bed. Bandaged, leg in a cast. In bad \n          \n          \n          shape. Rene hovers over her, tears in her eyes. On the dresser, \n\n          SEE get well cards and a PHOTO MONTAGE of her friends from Forks.\n          BELLA\n          Edward? Where's -\n          RENE\n          He's asleep.\n          She nods across the room to a chair in which Edward \u0093sleeps.\n          \u0094\n          \n          \n          RENE\n          He never leaves. And your dad's \n          down in the cafeteria. \n          \n          \n          BELLA\n          What... happened?\n          \n          \n          RENE\n          Baby, you fell down two flights of \n          stairs and through a window. \n          \n          \n          Bella is drawing a blank, confused. Rene jogs her memory \n          -\n          RENE\n          Edward came here to convince you to \n          come back to Forks. His father \n          brought him down. You went to their \n          hotel but you tripped on the stairs. \n          A moment... then Bella realizes it's a cover story. She nods.\n          BELLA\n          Sounds like me.\n          \n          \n          \n          98.\n          Rene's cell phone BEEPS. She opens it. Reads a text, starts\n          typing in a reply.\n          \n          \n          RENE\n          It's Phil. He's worried about you.\n          \n          \n          BELLA\n          Mom, you're... texting.\n          \n          \n          RENE\n          \n          \n           (smiling)\n          I told him to stay in Florida. The \n          Suns signed him! \n          \n          \n          BELLA\n          That's great mom.\n          \n          \n          RENE\n          Jacksonville is always sunny and \n          you'll have your own bathroom..\n          .\n          \n          \n          BELLA\n          Mom, wait. I want to live in \n          Forks. I have Dad..\n          . \n          \n          \n          (re: the get well cards)\n          ... and friends..\n          .\n          \n          \n          RENE\n          (re: Edward)\n          And he's there. \n          \n          \n          Bella shrugs, conceding the truth.\n          \n          \n          RENE\n          Charlie doesn't like him. Blames \n          him for your leaving. \n          \n          \n          BELLA\n          What do you think?\n          \n          \n          RENE\n          \n          \n          (lowering her voice)\n          I think that boy is in love with \n          you.\n          \n          \n          Bella smiles. Rene grins. Bella glances at Edward.\n          \n          \n          BELLA\n          Um, Mom, would you mind getting Dad? \n          I \n          want to talk to him. Apologize.\n          \n          \n          RENE\n          I'm sure he doesn't care about \n          that, Baby. But I\u0091ll go get him.\n          \n          \n          \n          99.\n          Rene kisses Bella's forehead. Exits. Bella watches her go.\n          The door shutting behind her. Bella turns back to find \n          Edward standing next to her with deep concern. Her eyes \n          well. He kisses her forehead soothingly. \n          \n          \n          BELLA\n          Is James - did you -- \n          ?\n          \n          \n          EDWARD\n          We took care of him. And the \n          woman, Victoria, she ran off.\n          \n          \n          She closes her eyes with relief, then looks at him. \n          \n          \n          BELLA\n          I'm alive because of you.\n          \n          \n          EDWARD\n          (darkens)\n          You're in here because of me. \n          \n          \n          Her wounds cause him pain. He strokes her face.\n          \n          \n          EDWARD\n          The worst of it... was thinking \n          I \n          couldn't stop -\n          \n          BELLA\n          But you did. \n          \n          \n          EDWARD\n          Bella, you should go to Jacksonville. \n          Where I can't hurt you anymore..\n          .\n          \n          \n          BELLA\n          What? No! I want to be with you! \n          I \n          don't want \n          -\n          \n          \n          EDWARD\n          \n          \n          (sitting next to her)\n          Sssh. It's alright. I'm not going \n          anywhere. I'm right here..\n          .\n          \n          \n          He wraps an arm around her. As she curls up in his arms..\n          . \n          \n          \n          DISSOLVE TO:\n          \n          \n          135 EXT. FORKS, WASHINGTON - LATE AFTERNOON 135\n          \n          \n          An AERIAL SWEEP over the lush green forests. We're back in\n          the misty, damp beauty of the Pacific Northwest..\n          .\n          \n          \n          \n          100.\n          136 EXT. CHARLIE'S HOUSE - BEAUTIFUL LATE AFTERNOON 136\n          \n          \n          At a picnic table, Charlie cleans a fish with a big knife. \n          Edward waits awkwardly near his Volvo, dressed in an elegant \n          suit. But even calm Edward is unnerved by Charlie's glare. The\n          front door opens and they look up to see \n          -\n          \n          \n          BELLA --framed in the doorway in a stunning long dress. Edward \n          is enchanted. Bella descends the steps with difficulty, due to \n          her LEG CAST. Charlie edges out Edward to help her down. \n          \n          \n          BELLA\n          \n          \n          Alice lent me the dress. It was the \n          \n          \n          only thing that would fit over my \n          \n          \n          cast. Is it too... \n          ?\n          \n          \n          EDWARD\n          \n          \n          You're perfect... I'll take good \n          \n          \n          care of her, Chief. \n          \n          \n          CHARLIE\n          Heard that before. \n          \n          \n          Edward moves to open the car door. Charlie holds Bella back.\n          \n          \n          CHARLIE \n          (sotto)\n          I put new pepper spray in your bag.\n          \n          \n          BELLA\n          \n          \n          Dad.\n          \n          \n          CHARLIE\n          ... and... you look beautiful.\n          \n          \n          Father and daughter share a smile..\n          .\n          \n          \n          137 EXT./INT. MANSION, VIEW POINT INN - TWILIGHT 137\n          \n          \n          Edward's Volvo pulls up to this lovely inn. He helps Bella\n          out of the car, and begins to guide her through the dining \n          room. Mr. Molina and other teachers are there. We may \n          notice the back of a Redhead, mingling with the chaperones.\n          \n          \n          BELLA\n          \n          \n          I can't believe you're making me do \n          \n          \n          this.\n          \n          \n          He just grins. Edward guides her around a corner to..\n          .\n          \n          \n          138 EXT. MANSION BACKYARD (CONTINUOUS) - TWILIGHT 138\n          \n          \n          THE PROM - Monte Carlo style. Gaming tables and roulette \n          wheels. Guys in tuxes and girls in gowns gamble for prizes, \n          dance and socialize. \n          \n          \n          \n          101.\n          BELLA\n          You really are trying to kill me.\n          \n          \n          EDWARD\n          Prom is an important rite of \n          passage. I don't want you to miss \n          anything. \n          \n          \n          She can't be mad at him, just shakes her head affectionately.\n          They continue into the prom. Several heads turn. Bella sees \n          -\n          \n          \n          THE DANCE FLOOR, where a gap has formed. In the middle, two \n          couples whirl gracefully. It's Alice and Jasper, Rosalie and \n          Emmett, looking absolutely stunning. \n          \n          \n          Rosalie glances over; indifference has replaced fury. But \n          Alice waves brightly. Bella returns it with a smile as we \n          hear a crossfade into the next track-\n          \n          \n          BELLA'S POV -- THE DJ BOOTH \n          -\n          \n          \n          It's Eric at the turntables, making the room bounce! Next to\n          him, Angela wears the headphones, flipping through a stack of \n          vinyl. They nod at Bella -- she shoots them a smile when -\n          -\n          \n          \n          A FLASHBULB gets her attention \n          -\n          \n          \n          BELLA'S POV - PHOTOGRAPHER'S STATION\n          \n          \n          Mike and Jessica stand in front of an Aston Martin cut-out. \n          Bella catches their eye -- Mike does his best James Bond \n          impersonation. Jessica poses like Pussy Galore.\n          \n          \n          Edward smirks, then turns to Bella \n          -\n          \n          \n          EDWARD\n          Shall we? \n          \n          \n          BELLA\n          (laughs, then realizes)\n          You're serious.\n          \n          \n          He doesn't wait for an answer, more or less CARRIES her to\n          the DANCE FLOOR -- then places her feet atop his own... and \n          starts to move. She actually begins to enjoy it.\n          \n          \n          EDWARD\n          See? You're dancing.\n          \n          \n          BELLA\n          At prom.\n          \n          \n          As they dance, she feels his grace, his strength. Becomes \n          thoughtful. Finally, she looks at him.\n          \n          \n          \n          102.\n          BELLA\n          Edward... why did you save me?\n          (off his questioning look)\n          If you'd let the venom spread, \n          I could've been like you by now.\n          \n          \n          EDWARD\n          \n          \n          (stops, horrified)\n          You don't know what you're saying. \n          You don't want this.\n          \n          \n          BELLA\n          I want you. Always.\n          \n          \n          EDWARD\n          (angry)\n          I won't end your life for you. \n          \n          \n          He keeps dancing, slowly, hoping his was the last word.\n          \n          \n          BELLA\n          I'm dying anyway. Every minute, \n          I get closer, older \n          \n          EDWARD\n          That's how it's supposed to happen. \n          \n          BELLA\n          Not the way Alice saw it. \n          (off his sharp look)\n          I heard her. She saw me like you. \n          \n          EDWARD\n          Her visions change, Bella. \n          \n          BELLA\n          Based on what someone decides. And \n          I've decided.\n          \n          \n          He looks at her, angry. \n          \n          \n          EDWARD\n          Is that what you dream about? \n          Becoming a monster? \n          \n          \n          BELLA\n          I dream about being with you forever. \n          \n          \n          EDWARD\n          You really want this?\n          \n          \n          BELLA\n          Yes.\n          \n          \n          He lowers his lips to her neck. One bite is all it would take. \n          \n          \n          \n          103.\n          EDWARD\n          You're ready right now?\n          \n          \n          BELLA\n          Yes.\n          \n          \n          His lips hover over her skin, a long beat... then he presses his \n          lips to her throat. Not a bite. A kiss. He looks at her.\n          \n          \n          EDWARD\n          You're going to have a long and \n          happy life with me. Isn't that \n          enough?\n          \n          \n          She looks at him... and finally smiles.\n          \n          \n          BELLA\n          For now.\n          \n          \n          They WHIRL around, gliding on his grace, never looking away from \n          one another, as we CRANE UP on them, in each other's arms..\n          .\n          \n          \n          BELLA (V.O.)\n          No one will surrender tonight. But \n          I won't give in. I know what I want.\n          \n          \n          CONTINUE UP AND BACK on the dance floor. We realize ..\n          \n          ... someone's watching it, looking down from the window of \n          a second floor hotel room in the Inn. The MUSIC wafting up in \n          echoes. PULL BACK to REVEAL..\n          \n          VICTORIA, turning from the window. She's stylishly dressed\n          now, but seething -- a low, sinister SNARL in the back of her \n          throat. PUSH IN FAST ON HER FACE, AND INTO HER BURGUNDY EYES \n          filled with vengeance as we \n          -\n          \n          \n          SMASH TO BLACK. \n\n\n\n\n\nTwilight\nWriters :   Melissa Rosenberg\nGenres :   Drama  Fantasy  Romance  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "Two men are in love with the same woman."}