{"title": "Valkyrie", "full_text": "VALKYRIE\n\n\n\n\n                          Written by\n\n            Christopher McQuarrie & Nathan Alexander\n\n\n\n\n                                         January 8, 2007\n\n\n   I swear by God this sacred oath:\n\n   That I shall render unconditional obedience to\n   Adolf Hitler, the Führer of the German Reich, and\n   that I shall at all times be prepared, as a brave\n   soldier, to give my life for this oath.\n\n\n1   BLACK                                                   1\n\n    And from out of the blackness a voice. A man speaking\n    in German - faint at first, crackling over the radio.\n    Subtitles translate the voice of Adolf Hitler.\n\n                       HITLER (V.O.)\n            My comrades. Once again - I don't\n            know how many times it has been now\n            - an attempt has been made on my\n            life. I speak to you tonight for\n            two reasons. First, so that you can\n            hear my voice and know that I am\n            unhurt. And second, so that you may\n            know the details of a crime without\n            parallel in German history...\n\n\n2   EXT. AIRFIELD - DAY                                     2\n\n    TITLES: SMOLENSK, RUSSIA - THE GERMAN EASTERN FRONT.\n    13 MARCH 1943.\n\n    A lonely airfield. A NAZI OFFICER and his AIDE stand\n    rigid by a gleaming limousine. The officer's uniform\n    denotes a man of high rank - a man of weight.\n\n    TITLES: MAJOR-GENERAL HENNING VON TRESCKOW - CHIEF OF\n    STAFF FOR ARMY GROUP CENTER.\n\n    Tresckow smokes a cigarette, his arm the only\n    movement in the frame.\n\n    PULL BACK TO REVEAL the airstrip is surrounded by\n    Army Group vehicles and personnel - SD and SS\n    escorts, photographers, aides, Nazi party\n    dignitaries, etc. - all frozen like statues. Eerie.\n    Whatever is going on, it's big. The faint sound of\n    distant airplanes brings tension, subtle but sharp.\n\n    Approaching the field are three Focke-Wulf 200\n    Condors escorted by a formation of Messerschmitt-109\n    fighters. Silence gives way to an escalating roar\n    that seems to have no maximum. One by one, the\n    massive four-engine Condors land while the fighters\n    roar overhead and circle the airfield. The Condors\n    come to rest and, needing no introduction:\n\n    ADOLF HITLER alights from the lead plane, obscured by\n    the surrounding platoon of heavily armed SS GUARDS.\n\n    (Note: Hitler is obscured throughout the entire\n    sequence proving how inaccessible he truly was.)\n\n                                                         2.\n\n\n\n    Tresckow and his Aide step forward to greet Hitler,\n    but they are pushed back by SS guards. The Führer\n    marches past without so much a glance at his hosts or\n    their waiting limo.\n\n    To Tresckow's surprise, a second limousine roars onto\n    the airfield from out of nowhere. It is dirty, the\n    windscreen spotted with bugs from a long drive.\n    Hitler gets in the dirty car and speeds off.\n\n                       VOICE (O.S.)\n           It's not so much your car he\n           doesn't trust... It's your driver.\n\n    Tresckow and his Aide turn. Standing behind them is:\n\n    TITLES: COLONEL HEINZ BRANDT - SENIOR STAFF OFFICER\n    OF THE ARMY OPERATIONS SECTION.\n\n    The consummate Nazi, he is always scribbling notes in           \n    a small datebook. Without looking up, Brandt hops               \n    into the limo they brought for Hitler.                          \n\n    Tresckow and his Aide share a glance and get in. A\n    beat later they are speeding after Hitler's car.\n\n\n3   EXT. ARMY GROUP CENTER - DAY                              3\n\n    Est. Hitler's headquarters for the Eastern Front is\n    bustling. Security is tight, everyone is on edge.\n\n\n4   INT. ARMY GROUP CENTER - MESS HALL - DAY                  4\n\n    Long tables packed with SOLDIERS straining their\n    necks to get a glimpse of their leader at the head\n    table, but he is obscured by his detail of SS guards.\n    ONE MAN dares to approach. The room falls silent.\n\n    HITLER'S PERSONAL CHEF places a tray before the\n    Führer, producing a knife and fork, cutting a bite.\n    We think he is going to hand feed Hitler until he\n    places the food in his own mouth, chewing slowly,\n    deliberately. He swallows. We wait for him to die.\n    When he doesn't, Hitler begins to eat. The rest of\n    the room relaxes slightly and digs in.\n\n    ANGLE ON: Seated further down the table are Tresckow\n    and his Aide. Between them, once again, is Brandt,\n    eating like a pig, still making notes in his book.              \n    Tresckow stares.                                                \n\n                                                        3.\n\n\n\n                         TRESCKOW\n           Managing the Führer's security must\n           be quite an undertaking.\n\n                         BRANDT\n                   (in between mouthfuls)\n           Irregularity is the Führer's                            \n           precaution of choice.\n\n                         TRESCKOW\n           I can assure you he's safe here.\n           Relax, Brandt. Enjoy your meal.\n\n    Brandt's look says, \"Don't be ridiculous.\" He cleans\n    his plate in seconds. Then he gently dabs his mouth,\n    takes out his datebook and starts writing - once\n    again the precise man we saw on the airfield.\n\n                    TRESCKOW (CONT'D)\n           I understand you're returning to\n           Berlin this afternoon...\n\n    Brandt nods.\n\n                    TRESCKOW (CONT'D)\n           Could I trouble you to deliver a\n           package to Colonel Stieff?\n\n    Brandt nods again, too busy writing to notice the\n    knowing glance Tresckow shares with his Aide...\n\n\n5   INT. ARMY GROUP CENTER - PRIVATE OFFICE - LATER          5\n\n    Tense silence. Tresckow and his Aide are hunched over\n    two bottles of Cointreau on a large desk next to:\n\n    TWO PAIRS OF BRITISH `CLAMS' - a small black plastic           \n    casing held together by magnets and adhesive tape.             \n\n    Tresckow inserts a short, pencil-shaped fuse through\n    the narrow opening. All that remains exposed is a\n    small glass capsule. The trigger. Tresckow turns his\n    attention to the bottles of Cointreau...\n\n\n6   EXT. AIRFIELD - DAY                                      6\n\n    The Condors' engines roar, ready for take off.\n    Soldiers stand at attention as Hitler boards. Brandt\n    is with him, scribbling in his ever-present datebook.\n\n                                                         4.\n\n\n\n    Tresckow and his Aide approach. Tresckow gently\n    handles a carefully wrapped package.\n\n    CLOSE ON: Tresckow presses a key against the side of\n    the package, crushing the glass capsule inside. The\n    explosive armed now, he hands it to Brandt.\n\n                         TRESCKOW\n           With my regards to Colonel Stieff.\n\n    Brandt accepts the gift, looking up from his book. He\n    studies the familiar shape.\n\n                          BRANDT\n           Cointreau? You better hope I don't\n           get thirsty on the flight.\n\n    Tresckow politely smiles, hiding his nerves, having\n    just handed a bomb to Hitler's Head of Security.\n    Brandt unknowingly carries it onto the plane with\n    Hitler. The door to the Condor is sealed behind him\n    along with, we hope, the Führer's fate.\n\n    Tresckow looks at his watch and we DISSOLVE TO:                   \n\n\n7   INT. ARMY GROUP CENTER - PRIVATE OFFICE - LATER             7\n\n    A clock shows us that thirty minutes have passed.\n\n    Tresckow and his Aide are seated on either side of a\n    desk staring at the telephone. Smoking. Waiting...\n\n                                                 DISSOLVE TO:\n\n\n8   INT. ARMY GROUP CENTER - PRIVATE OFFICE - LATER             8\n\n    Three hours later. The ashtray is overflowing but\n    Tresckow and his Aide have not moved. Finally...\n\n    The phone barely rings before Tresckow answers. He\n    doesn't say a word, he only nods and hangs up.\n\n                        TRESCKOW\n           He's... landed.                                            \n\n    It takes a moment for the gravity of this to set in.\n\n                           AIDE\n           What about the...\n\n    Tresckow is already dialing the telephone.\n\n                                                          5.\n\n\n\n                          TRESCKOW\n            Get me Colonel Brandt...\n                        (staying cool)\n            Colonel? Tresckow... I trust you\n            landed safely... I hate to trouble\n            you but there's been a bit of a mix\n            up. It seems you have the wrong\n            bottles for Colonel Stieff. You...\n            do still have the package?\n\n     Long pause. Torture. Then:\n\n                     TRESCKOW (CONT'D)\n            I can be at your office first thing\n            tomorrow morning to pick it up.\n            Terribly sorry for the\n            inconvenience... Thank you.\n\n     Tresckow slowly hangs up the phone.\n\n                            AIDE\n            Do you think he knows?\n\n     Tresckow shrugs, opening a bottle of Cointreau and\n     pouring two glasses with a shaking hand.\n\n                          TRESCKOW\n            There's only one way to be sure...\n\n\n9    EXT. OKH HEADQUARTERS - DAY                               9\n\n     Est. An early morning fog blankets the ground,\n     obscuring our view. Eerie.\n\n\n10   INT. OKH HEADQUARTERS - HALLWAY - DAY                     10\n\n     Footsteps echo through the cavernous hallways.\n     Tresckow marches with purpose through the numerous\n     security checkpoints. It is a long, suspenseful walk.\n     He is aware of someone walking up behind him, getting\n     closer. We think he's done for, but a BESPECTACLED,\n     MIDDLE-AGED OFFICER overtakes him and whispers:\n\n                             OFFICER                                  \n            What happened?                                            \n\n     TITLES: GENERAL FRIEDRICH OLBRICHT - CHIEF OF GENERAL            \n     ARMY OFFICE IN BERLIN.                                           \n\n                                                     6.\n\n\n\n                     TRESCKOW                               \n       I can only guess the altitude                        \n       caused the fuse to malfunction.                      \n       First the beer hall, Memorial Day -                  \n       now this. Someone is watching over                   \n       that sonofabitch, I swear it.                        \n\n                     OLBRICHT                               \n       We've been discovered.                               \n\nTresckow halts and faces Olbricht, expressionless.          \n\n                     TRESCKOW                               \n       What makes you think-\n\n                    OLBRICHT\n       Oster's been arrested. The Gestapo\n       came for him last night.\n\nTresckow thinks for a beat and resumes walking.\nOlbricht hurries after him.\n\n                OLBRICHT (CONT'D)\n       Did you hear what I said?\n\n                     TRESCKOW\n       The Gestapo could have arrested him\n       for anything. Find a replacement.                    \n\n                    OLBRICHT\n       There's no one we can trust. Not in                  \n       Berlin.                                              \n\n                     TRESCKOW\n       Then stop looking in Berlin.                         \n\nJust then, they approach the final threshold, a             \nSENTRY guards an office marked:\n\nCOLONEL HEINZ BRANDT.\n\nOlbricht stops, regarding the door with dread. But          \nTresckow presses on, reaching the door, about to\nenter when:\n\n                      SENTRY\n       Your pistol please.\n\nOh shit. Tresckow plays it cool, removing his pistol\nfrom its holster and handing it over.                       \n\nAnd with a nod to Olbricht, Tresckow squares his\nshoulders and enters Brandt's office.\n\n                                                        7.\n\n\n\n\n11   INT. OKH HEADQUARTERS - BRANDT'S OFFICE - CONTINUOUS    11\n\n     Brandt is at his desk, writing as always. Tresckow\n     notices Brandt's pistol sitting within arm's reach. A\n     clock ticks loudly. Imagine it. Then wait. Finally:            \n\n     Brandt puts his pen down, stands and salutes, but the          \n     gesture is almost casual. Pure formality.                      \n\n                           BRANDT                                   \n            You'll forgive me, General. This                        \n            little round-up has had me writing                      \n            reports all day.                                        \n\n                           TRESKOW                                  \n            Round-up?                                               \n\n                           BRANDT                                   \n            Dissenters. A plot against the                          \n            Führer.                                                 \n\n     Tresckow makes a good show of laughing that off.               \n\n                          TRESKOW                                   \n            Who would even have the balls?                          \n\n                           BRANDT                                   \n            You'd be surprised, the number of                       \n            cowards in this army that would be                      \n            willing to stand against the Reich.                     \n\n                          TRESKOW                                   \n            Only if the Führer were dead, of                        \n            course.                                                 \n\n                           BRANDT                                   \n            Of course. It's one thing to think                      \n            you know what's right. What matters                     \n            is having the strength to do it.                        \n\n     Clunk. Brandt produces the package, putting it on the          \n     desk in front of him.                                          \n\n                      BRANDT (CONT'D)                               \n            Is this what you've come for?                           \n\n     Pause. Staying cool, Tresckow reaches for it:                  \n\n                      BRANDT (CONT'D)                               \n            Perhaps we should open it.\n\n     Tresckow freezes, studies Brandt's cold smile.\n\n                                                          8.\n\n\n\n                          TRESCKOW\n            I beg your pardon.\n\n     Brandt sits back, smiles. Does he know?                          \n\n                           BRANDT\n            You've come a long way. You must be\n            thirsty.\n\n                          TRESCKOW\n            I wonder how the Führer, who does\n            not partake, would feel about an\n            officer who did so on duty...\n            Colonel Brandt.\n\n     Brandt's smile fades. We can't decide why. He picks\n     up the package carelessly. Tresckow stays cool\n     despite the armed explosive just a few feet away.\n\n                           BRANDT\n            I took you for another sort,\n            General.                                                  \n\n     And we realize he really did just want a drink. He\n     knows nothing about what the package hides.\n\n                          TRESCKOW\n            And I you.\n\n     Tresckow reaches out, grabbing the package and:                  \n\n     BANG. The sound of an EXPLOSION O.S. takes us to:                \n\n\n12   EXT. DESERT - DAY                                         12\n\n     TITLES: TUNISIA, NORTH AFRICA - THE RETREATING 10TH\n     PANZER DIVISION. 7 APRIL 1943.\n\n     Moving rapidly through an olive grove in the\n     otherwise wasted desert. A column of tanks, trucks\n     and heavy equipment flow by with a sense of barely\n     contained chaos. Men dismantle tents from around\n     others dumping documents into burning oil drums.\n\n     In the middle of it we find a tall, handsome young\n     officer (age 35). He wears an Afrika Korps uniform\n     complete with Colonel's badges, staying cooler than\n     the other side of your pillow. He directs men this\n     way and that, holding back panic.                                \n\n     TITLES: COLONEL CLAUS VON STAUFFENBERG - STAFF\n     OFFICER, 10TH PANZER DIVISION.\n\n                                                     9.\n\n\n\nA jeep speeds up to him from the distance, driven by\na YOUNG LIEUTENANT.\n\n                 YOUNG LIEUTENANT\n       Colonel Stauffenberg, sir. A new\n       headquarters has been established\n       at Mezzouna. I'm to take you there.\n\nStauffenberg looks over the scene, expressionless.\n\n                  STAUFFENBERG\n       Now they tell us to disengage - a\n       day late. No matter how many times\n       we tell Command the reality, they\n       always manage to leave us-\n\nBut he stops himself, containing his rage.\n\n                 YOUNG LIEUTENANT\n       Colonel, the enemy is less than\n       five kilometers from here. You've\n       done all you can.\n\nStauffenberg glances at his right hand, contemplating\na ring on his finger. After a beat:\n\n                   STAUFFENBERG\n       I wonder... Was there even a point\n       in our coming to Tunis?\n\n                YOUNG LIEUTENANT\n       To get taken prisoner, it seems.\n\nStauffenberg smiles bitterly and gets in the jeep as:\n\nBOOM. The first bomb explodes before we even see the\ntight formation of BRITISH FIRE-BOMBERS overhead.\nFighter planes strafe with machine-guns. Artillery\nblasts strike in front and behind the retreating\ncolumn. The 10th Panzer Division is trapped.\n\nPanic hits the column like a tidal wave. Stauffenberg\ntaps the Young Lieutenant who drives into the melee.\n\nSoldiers abandon their vehicles but cover is in short\nsupply and many are left in the open. So they run.\nDozens are gunned down by the assailing fighters. The\nsurvivors watch in horror as the fighters slowly turn\nto make another run. In a panic, the soldiers run the\nother direction, halted by a jeep blocking the way.\n\nStauffenberg stands in the passenger seat.\n\n                                                        10.\n\n\n\n                       STAUFFENBERG\n            STOP. WAIT UNTIL THEY COMMIT.\n\n     The men calm when they see the Colonel, trusting him.\n     They turn and watch the formation of planes complete\n     their turn and bear down, gaining speed. Knees tense,\n     some jerking from the natural inclination to flee.\n\n                   STAUFFENBERG (CONT'D)\n            STAND FAST, I SAID.\n\n     They do, despite the menace of the planes' engines\n     growing louder, meaner...\n\n\n13   INT. LEAD FIGHTER COCKPIT - DAY                          13\n\n     The confused PILOT takes in the mass of motionless\n     men below. His finger tenses on the trigger and...\n\n\n14   EXT. DESERT - DAY                                        14\n\n                           STAUFFENBERG\n            NOW.\n\n     The mob of soldiers breaks - some right, some left -\n     as the fighters open fire on what had been the center\n     of their mass. Unable to change course quickly\n     enough, they spray their lead into the sand.\n\n     In that same instant, Stauffenberg drops into his\n     seat, the Young Lieutenant jams the jeep in drive and\n     a wave of hot lead misses them by mere feet.\n     Stauffenberg watches his men regroup, waiting out the\n     turning squadron. They've got the idea now. He turns\n     to his Lieutenant who smiles admiringly. But\n     Stauffenberg's eyes widen. He grabs his Lieutenant's\n     head and jams it down, revealing a STRAY FIGHTER\n     coming up from behind. Stauffenberg ducks out of\n     frame, shielding the Young Lieutenant with his body.\n\n     BANG. Blood sprays across the jeep's windshield\n     before bullets rip it to pieces, leaving only clear\n     blue African sky... And then the EXPLOSION.\n\n     SILENCE. FADE TO WHITE.\n\n\n15   INT. HOSPITAL - DAY                                      15\n\n     TITLES: MUNICH, GERMANY - FIRST GENERAL MILITARY\n     HOSPITAL. 21 APRIL 1943.\n\n                                                      11.\n\n\n\n     A fast clicking. Heels on linoleum. A beautiful,\n     dignified woman keeps herself from running. She is:\n\n     NINA VON STAUFFENBERG (30), Stauffenberg's wife and\n     mother of his four children. Beside her is BERTHOLD\n     VON STAUFFENBERG (38), Stauffenberg's older brother.\n\n     They reach the door of a private hospital room just\n     as A DOCTOR comes out. Awkward pause.\n\n                           DOCTOR\n            Mrs. Stauffenberg?\n\n                            NINA\n               (nodding, gesturing to Berthold)\n            The Colonel's brother, Berthold.\n\n                           DOCTOR\n            Perhaps before you see the Colonel\n            we should go to my office and-\n\n                            NINA\n            I will see my husband now.\n\n     The Doctor wants to argue but Nina's eyes shut him\n     down. He opens the door and they enter to find:\n\n\n16   INT. HOSPITAL ROOM - CONTINUOUS                         16\n\n     A mass of mummy-like bandages with only small\n     openings around the mouth and one eye. The arms and\n     hands are also wrapped in heavy dressing. No movement\n     but for the rise and fall of the patient's chest.\n\n     Berthold cannot look. Holding back her anguish, Nina\n     bravely turns to the Doctor. \"Well?\"\n\n                          DOCTOR\n            He's been constant with fever but\n            he refuses any pain killers. The\n            right hand has been amputated above\n            the wrist. He's lost the fourth and\n            fifth fingers on the left. We...\n            couldn't save the left eye.\n\n     Berthold covers his face. Nina is a rock.\n\n                             NINA\n            His ring.\n\n                            DOCTOR\n            I don't-\n\n                                                        12.\n\n\n\n                            NINA\n            He had a ring on his right hand.\n            Where is it?\n\n                           DOCTOR\n            I'm sorry... His hand was amputated\n            in the field... I'm afraid-\n\n                             NINA\n            Thank you.                                               \n\n     As in: \"That will be all.\" The Doctor leaves. Nina              \n     sits beside her husband. She shows him a photo of\n     FOUR BEAUTIFUL CHILDREN - three boys and a girl.\n\n     Stauffenberg tries to speak but can't. His eye begins\n     to tear.\n\n     Nina removes a ring from her finger, placing it on a\n     chain with a cross she takes from around her neck. It\n     is identical to the ring Stauffenberg wore in Africa.\n\n     CLOSE ON: The engraving inside the band - finis-\n     initium [end-beginning]. Nina places the ring and\n     chain on her husband's chest, her hand lingering. She\n     cannot hold the tears back any longer. She stands and\n     turns away, not wanting her husband to see.\n\n     Berthold takes her place. Stauffenberg struggles to\n     speak. Berthold puts an ear to the hole where\n     Stauffenberg's mouth is - making out his question,\n     even if we can't. Berthold debates answering, then:\n\n                          BERTHOLD\n            We've lost North Africa.\n\n     CLOSE ON: That one eye staring at us closes.\n\n\n17   INT. HOSPITAL ROOM - DAYS LATER                          17\n\n     Stauffenberg's bandages are gone - a black patch\n     covering what had been his left eye. The chain with\n     the cross and ring from Nina hangs around his neck.\n\n     ANOTHER PATIENT lies motionless in the next bed.\n\n     A man's belongings tell you more about him than he\n     ever could. Stauffenberg's side of the room is neatly\n     arranged, books of poetry and philosophy are well\n     worn. Beside them are his own writings - the print\n     meticulous and flowing. Up to a certain date. After\n     that a new, child-like hand has taken over.\n\n                                                   13.\n\n\n\nA family photograph shows the Stauffenberg's of\nanother generation - wealthy aristocrats from a\nbygone era. He is a teenager in this photo and\nsmiling broadly. A smile he left in Africa.\n\nStauffenberg's three fingers push a cotton ball under\nhis eyepatch to dab the empty socket. Then he goes to\nbutton his shirt. Holding his collar in his teeth, he\ntries to do the buttons with the use of only three\nfingers on his left hand. It is heartbreaking to\nwatch.\n\nHe is about to give up when he notices a figure\nlooming in the doorway. General Olbricht. He winces\nat the sight of Stauffenberg's deformities.\n\n                  STAUFFENBERG\n       I don't know what I ever did with\n       ten.\n\nOlbricht manages a smile, he moves to speak, but\nStauffenberg beats him to it.\n\n              STAUFFENBERG (CONT'D)\n       I'm wanted in Berlin.\n\nOlbricht nods.\n\n              STAUFFENBERG (CONT'D)\n       Are you asking as a member of the\n       High Command?\n\nOlbricht contemplates his answer. He carefully closes\nthe door behind him, nervously glancing at the\npatient in the next bed.\n\n              STAUFFENBERG (CONT'D)\n       You can speak openly, General. He\n       died just before you came in.\n\nAwkward moment. Finally:\n\n                     OLBRICHT\n       We could use your help.\n\n                  STAUFFENBERG\n       I'm a field officer.\n\nOlbricht steps closer, speaking openly now.\n\n                     OLBRICHT\n       This war can't be won in the field.\n\n                                                 14.\n\n\n\n                   STAUFFENBERG\n       That's unfortunate for me.                         \n\n                     OLBRICHT\n       You can't honestly believe you'll\n       make a difference on the front-\n\n                   STAUFFENBERG\n       I'm a soldier, General. I serve my\n       country.\n\n                     OLBRICHT\n       It makes no sense. You opposed\n       Hitler, you opposed the war.\n\n                   STAUFFENBERG\n       The people chose otherwise and here\n       we are. Now we have to win. You\n       know what will happen if we don't.\n\n                     OLBRICHT\n       If we win, it will still be\n       Hitler's Germany.\n\n                   STAUFFENBERG\n       We all took an oath, General.                      \n\nOlbricht nods, resigning. He realizes it is no use.\nFinally, he produces a blue velvet box, opening it to\nreveal a brilliant gold medal.\n\n                    OLBRICHT\n       On behalf of the Führer.\n\nStauffenberg takes the medal and studies it.\n\n                  STAUFFENBERG\n       I'm a twin, you know.\n\nOlbricht is as confused as we are.\n\n                     OLBRICHT\n       I... I didn't.\n\n                  STAUFFENBERG\n       My brother died the day after we\n       were born.\n\n                     OLBRICHT\n       I'm sorry.\n\nWhat the hell is he talking about?\n\n                                                         15.\n\n\n\n                        STAUFFENBERG\n            I was lying in the desert, covered\n            in blood, sure I was going to die.\n            I tried to think about my wife, my\n            children... But my mind kept\n            drifting to my dead brother. How I\n            would finally be with him. How I\n            would finally be whole again...\n\n     He snaps out of his thoughts, holding up his arm.\n\n                   STAUFFENBERG (CONT'D)\n            This is my reward for what happened\n            to my men. It's all I deserve.\n\n     Stauffenberg nonchalantly tosses the medal into a\n     nearby bedpan.\n\n\n18   INT. HOSPITAL - CRITICAL WARD - DAY                       18   \n\n     CLOSE ON: A field of white. A three fingered hand             \n     enters the frame, gently placing a medal identical to         \n     the one just saw.                                             \n\n     PULL BACK TO REVEAL: Stauffenberg, done up in his             \n     finest dress uniform, placing said medal on an                \n     unconscious WOUNDED SOLDIER.                                  \n\n     AN AIDE stands behind him, carrying a silver tray             \n     stacked with MANY BOXES containing such medals.               \n\n     PULL BACK FURTHER TO REVEAL: Stauffenberg stands              \n     between two long rows of beds, each with A WOUNDED            \n     SOLDIER. Those that can respond to Stauffenberg do so         \n     with reverence. The ward is eerily silent.                    \n\n     With only three fingers, Stauffenberg cannot pin the          \n     medals to his men. He has to settle for simply laying         \n     them on a each soldier's chest or a pillow. With each         \n     medal he presents, the task becomes harder to watch.          \n\n     Suddenly, Stauffenberg freezes, finding himself               \n     looking at THE YOUNG LIEUTENANT - his driver in               \n     Africa. The young man is a mass of bandages, his legs         \n     gone, his face smashed.                                       \n\n     CLOSE ON: Stauffenberg's face - the reality of Africa         \n     taking the wind out of him. Over this we hear a               \n     familiar clicking of heels and:                               \n\n                                                      16.\n\n\n\n\n19   INT. HOSPITAL - HALLWAY - LATER                         19\n\n     Stauffenberg's boots pound the floor as he rushes for          \n     the door, desperate to get out, barely able to                 \n     breathe. At first he does not hear:\n\n                        VOICE (O.S.)\n            Colonel... COLONEL.\n\n     A hand grabs his shoulder. Stauffenberg turns, ready\n     to strike. He stops when he sees the Doctor holding a\n     small, square box. Another sort medal perhaps?                 \n\n                        STAUFFENBERG\n            I don't want the damn th-                               \n\n     The Doctor opens the box to reveal:                            \n\n     A GLASS EYEBALL sitting atop a layer of satin,\n     staring blankly back at Stauffenberg. Creepy.\n\n                          DOCTOR\n            When will you be going back to the\n            front?\n\n     Beat. Stauffenberg just stares back at the eyeball.\n\n                        STAUFFENBERG\n            I'm not going to the front. I'm\n            needed in Berlin.\n\n\n20   EXT. BERLIN - NIGHT                                     20\n\n     The city sleeps. An unsettling image knowing that, in\n     war, quiet can turn to chaos in the blink of an eye.\n\n\n21   INT. TOWNHOUSE FOYER - NIGHT                            21\n\n     Soft knocking at the front door is further muffled by\n     heavy black-out curtains. A YOUNG OFFICER enters the\n     frame, dousing the lights, parting the curtains and\n     opening the door to reveal a SHADOWY FIGURE on the\n     stoop.                                                         \n\n     The figure steps into the half light to reveal his\n     fresh scars and eye-patch. And from the dark quiet of          \n     the foyer we CUT TO:\n\n                                                       17.\n\n\n\n\n22   INT. SMOKY ROOM - NIGHT                                 22\n\n     Chaos. The air is thick with cigar smoke and harsh\n     words. A DOZEN MEN - some officers, some civilians -\n     are fighting bitterly, everyone talking at once.\n     Stauffenberg enters unnoticed, escorted in by the\n     YOUNG OFFICER who immediately ducks out again.\n\n     Stauffenberg scans the faces in the room. We\n     recognize Olbricht and Tresckow. With them we find...\n\n     A distinguished gentleman in his early sixties:\n\n     TITLES: ERWIN VON WITZLEBEN - FORMER FIELD MARSHAL OF\n     THE MILITARY DISTRICT. FORCED OUT BY HITLER, 1938.\n\n     Beside him is a rough-hewn, charismatic man despite\n     his 59 years. A face millions might follow. He is:\n\n     TITLES: DR. CARL GOERDELER - FORMER MAYOR OF LEIPZIG.\n     RESIGNED IN PROTEST, 1937.\n\n     And finally, a grandfatherly sort with surprisingly\n     kind eyes, sitting outside the fight - tired and\n     saddened by it.                                                \n\n     TITLES: LUDWIG BECK - FORMER CHIEF OF STAFF FOR THE\n     GERMAN ARMY. RESIGNED IN PROTEST, 1938.\n\n                         WITZLEBEN\n            ...He is not a man, he's a lunatic.\n            He doesn't drink, he doesn't fuck.\n            He has no weakness to exploit, no\n            vice to manipulate. His only                            \n            passion is complete control. How\n            can you expect to reason with him?\n\n                         GOERDELER\n            After this most recent failure I'd\n            say we've no other choice.\n\n                         WITZLEBEN\n            Confront Hitler now and you'll end\n            up with piano wire for a neck-tie.\n            Our only option is the central\n            solution.                                               \n\n                         GOERDELER\n            He's a man like any other. Flesh\n            and blood. Take him head on and-\n\n                                                   18.\n\n\n\n                    TRESCKOW\n       I'll say this for you, Doctor...\n       You're certainly delusional enough\n       to take Hitler's place.\n\n                    GOERDELER\n                  (eyes narrowing)\n       When that day comes, I'll be sure\n       to remember you.\n\n                     TRESCKOW\n       I doubt you'll remember much of\n       anything.\n\n                    GOERDELER\n       Dammit, Tresckow-\n\nAnd the shouting resumes. It is Beck who finally sees\nStauffenberg. He touches Tresckow's arm. He, in turn,\nnudges Olbricht and so on. A moment later, the room\nis silent, all eyes on the Colonel. Everyone is a\nlittle embarrassed. Olbricht clears his throat:\n\n                     OLBRICHT\n       Gentlemen, may I present Colonel\n       Stauffenberg. He's been reassigned\n       to my office at the War Ministry.\n                  (to Stauffenberg)\n       Colonel, may I introduce-\n\n                   STAUFFENBERG\n       These men need no introduction.\n\nBeck stands, shaking Stauffenberg's hand.                  \n\n                       BECK\n       I apologize for this unfortunate...\n       spectacle. On behalf of everyone,\n       welc-\n\nBut before he can finish, Beck is seized with a\ngravelly cough that sends an uncomfortable chill\nthrough the room. He is very ill.                          \n\n                     GOERDELER\n                   (to the others)\n       I haven't welcomed him. Not yet.\n       Where does he stand?\n\n                     TRESCKOW\n       For God's sake-\n\n                                                 19.\n\n\n\n                    GOERDELER\n                 (re: Stauffenberg)\n       He's a field officer. He knows the\n       army better than any of us. I want\n       to hear his opinion.\n\n                     TRESCKOW                            \n                  (to Stauffenberg)\n       All right. What do you think,                     \n       Colonel? Confront Hitler, force him               \n       to resign? Or the central solution?               \n\nBut before Stauffenberg can answer:                      \n\n                    GOERDELER                            \n       \"Central Solution.\" You soldiers                  \n       are all the same. Say what you                    \n       mean.                                             \n\n                    WITZLEBEN                            \n       That's a laugh coming from a                      \n       politician.                                       \n\n                    GOERDELER                            \n       The army will follow diplomats                    \n       before they follow assassins.\n\n                     TRESCKOW                            \n       They follow a butcher now. What\n       difference does it-                               \n\n                   STAUFFENBERG\n       What makes you think the army will                \n       follow you at all?                                \n\nThe room quiets down. Beck hides a slight smile. He      \nlikes Stauffenberg already.                              \n\n              STAUFFENBERG (CONT'D)                      \n       Oust him, kill him. That isn't what               \n       matters. How do you plan to take                  \n       control of the government when                    \n       Hitler is gone?                                   \n\nSilence. Then a wave of laughter. \"The balls on this     \nguy.\"                                                    \n\n                    GOERDELER                            \n       I beg your pardon, Colonel, but you               \n       are in the presence of men who                    \n       would have been Hitler's inner                    \n       circle. Instead we resigned. We put               \n       our principles above personal gain.               \n\n                                                        20.\n\n\n\n                         WITZLEBEN                                   \n            We have the have the respect of the                      \n            people. And the army.                                    \n\n                        STAUFFENBERG\n            With all respect, sir, you put too\n            much faith in your popularity.\n                    (to Goerdeler, pointed)\n            All of you do.\n\n                         GOERDELER\n            Now see here, Colonel-\n\n                       STAUFFENBERG\n            You said yourself, I'm a field                           \n            officer. You all may understand                          \n            government, but I know the men. A                        \n            great many of them may hate Hitler,                      \n            but they all fear him - they fear                        \n            Himmler, Goebbels, the whole of the                      \n            Reich. That kind of fear won't just                      \n            die with Hitler. And as for                              \n            respect: the army, and the people,                       \n            respect only one thing. Authority.                       \n            And if just one man questions that                       \n            authority, you can lose them all.                        \n                      (to Beck, pointed)                             \n            They were fooled into following                          \n            Hitler... How will you fool them -                       \n            force them - into following you?                         \n\n     Pause. The conspirators look at one another again,\n     unsure of how to answer. For Stauffenberg it is a\n     dreadful revelation.\n\n\n23   EXT. BERLIN - STREET - NIGHT                             23\n\n     A depressed Stauffenberg walks down the deserted\n     night streets. Silent but for the echo of his\n     footsteps. Eerie.\n\n     Across the street, an OLD WOMAN peers nervously out\n     her window. The instant Stauffenberg makes eye\n     contact she steps back, drawing the curtains. Afraid.\n\n     He approaches a cozy brick cottage - the Berlin home\n     he shares with his brother, Berthold. He is surprised\n     when he looks through the window to find FOUR\n     CHILDREN laughing and playing - the sound of music on\n     a phonograph. Bittersweet.\n\n                                                         21.\n\n\n\n     In the next house over, he catches sight of a TEENAGE\n     BOY, the picture of Aryan youth, watching him\n     suspiciously from the upstairs window. It seems\n     everyone is watching everyone in Hitler's German.\n\n\n24   INT. STAUFFENBERG FLAT - NIGHT                            24\n\n     Stauffenberg comes through the front door, the sound\n     of the phonograph blaring now. Meet the children:\n     BERTHOLD (9), HEIMERAN (7), FRANZ (5), VALERIE (2).\n\n     They chase one another around the house in their\n     pajamas making such a racket that the phonograph\n     skips. (It will do so throughout the scene.) The\n     children see Stauffenberg and charge, screaming:\n\n                           CHILDREN\n            PAPA.\n\n     He scoops them up, one by one, and kisses them,\n     instantly putting the day's events behind him.\n     Berthold follows them into the room, smiling.\n\n                        STAUFFENBERG\n                         (to children)\n            What are you doing here? I thought\n            I left you in Bamberg.\n                         (to Berthold)\n            It's a wonderful surprise. Thank\n            you, brother.\n\n                          CHILDREN\n            MAMA, COME DOWN. PAPA IS HERE. PAPA\n            IS HERE. (Etc.)\n\n\n25   INT. STAUFFENBERG FLAT - BEDROOM - NIGHT                  25\n\n     Nina nervously fixes her hair in the mirror. LOOK\n     DOWN TO REVEAL a small datebook with a smaller\n     monthly calendar in the corner of the page. A red dot\n     marks one date in particular, followed by black dots\n     for each day that has passed since. She turns\n     sideways, smoothing her dress over her belly. In\n     every way she indicates to us that she is pregnant.\n\n     She tucks the datebook under some sundries in her\n     luggage and rushes down to greet her husband.\n\n     We stay in the room, hearing her greet Stauffenberg\n     O.S. Laughter at children's antics we cannot see. The\n     phonograph skips. More laughter.\n\n                                                        22.\n\n\n     We want to go see them in their happiness. Instead we\n     linger on Stauffenberg's dresser - neat and orderly.\n     We focus on a photograph of the family from happier\n     times.\n\n     Beside it is a small box containing a glass eye.                \n\n\n26   INT. STAUFFENBERG FLAT - LIVING ROOM - NIGHT             26\n\n     Stauffenberg and Nina dance with one another to the\n     delight of the children. We gradually PUSH IN tight\n     on their faces, watching an entire conversation take\n     place without dialogue. Each has a secret the other\n     can guess. Stauffenberg looks at Nina, then her\n     belly, first realizing and then questioning. Nina\n     smiles and nods. Stauffenberg hugs her, delighted,\n     but his delight is tainted with worry.\n\n     Then the tables turn. Nina looks at Stauffenberg, as\n     if divining his secret. His face never changes - a\n     statue with that same tainted smile. In her face we\n     see slow, grim realization. She may not know exactly\n     what is going on, but she knows it is something. She\n     does her best to keep smiling for the children. After\n     the longest of moments, she nods. \"All right.\" Then\n     she puts her head on his shoulder, hiding her fears.\n\n     It is an important moment. Read it again, taking the\n     time to picture it in your mind. Then leave it alone.\n     Done right it's a beautiful scene about a man, his\n     family and the fate of the world.\n\n\n27   INT. STAUFFENBERG FLAT - DINING ROOM - NIGHT             27\n\n     Nina reads a story to the children in the adjoining\n     room - an idyllic scene. The sound of the phonograph\n     is soft and constant.\n\n     Stauffenberg picks at a late dinner, now adept at the\n     use of only three fingers. Berthold sits across from\n     him, deeply troubled by whatever conversation we have\n     just missed. They speak in hushed tones.\n\n                          BERTHOLD\n            What do you mean you quit?\n\n                       STAUFFENBERG\n            I came to join the Resistance, not\n            some sewing circle of discarded\n            generals and politicians.\n\n                                                 23.\n\n\n\n                     BERTHOLD\n       Beck is a just and capable man. As\n       for Goerdeler, well, he's popular.\n       He'll make a good Chancellor.\n\n                   STAUFFENBERG\n       Like Hitler before him, yes? Lately\n       I have to wonder if Germany is even\n       fit to choose her own destiny.\n\n                    BERTHOLD\n       You can't blame the people for\n       this. You have to see the beginning\n       of something to know how it'll end.\n       It's no different than a farmer\n       watching the corn grow. One day\n       it's over his head.\n\n                   STAUFFENBERG\n       Plenty of people thought-\n\n                     BERTHOLD\n       The greatest offenders are not the\n       ones who thought better but the\n       ones who sensed better.\n\n                  STAUFFENBERG\n       What are you trying to say?\n\n                    BERTHOLD\n       I seem to remember you telling me\n       about reports from the Ukraine -\n       the SS forcing Jews to dig their\n       own graves. You said then that\n       Hitler should be removed. An\n       officer's duty, you said. What's\n       changed?\n\n                   STAUFFENBERG\n       I said senior officers. The only\n       men that can get to him.                           \n\n                    BERTHOLD\n       Perhaps it doesn't matter that you\n       succeed.\n\nStauffenberg looks at Berthold like he is crazy, but:\n\n                BERTHOLD (CONT'D)\n       Perhaps it only matters that you\n       try. Don't you see? Someone has to\n       stand up and show the world that\n       not all of us were like him.\n\n                                                       24.\n\n\n\n                       STAUFFENBERG\n            Even if they could remove Hitler,\n            they can't hope to seize power. For\n            God's sake, they have no plan.\n\n                          BERTHOLD\n            Then give them one. Find a way.\n\n     He puts a hand on Stauffenberg's arm.\n\n                     BERTHOLD (CONT'D)\n            Evil happens when good men do\n            nothing.\n\n     Before Stauffenberg can answer, new music comes\n     blasting from the phonograph O.S. The unmistakable\n     sound of Wagner's Ride of the Valkyries.\n\n                       STAUFFENBERG\n            Children, that is far too-\n\n     He is cut off by the appearance of his four children,\n     all wearing cloaks made of bed sheets, pots for\n     helmets and brandishing makeshift swords. They charge\n     into the room, singing loudly and attacking their\n     father. He does his best to defend himself with one\n     hand. Their commotion causes the phonograph to skip.\n\n     And you'd think that's where it ends. We even pull\n     back, creating that effect. It takes a moment to\n     notice the wailing sound we're suddenly hearing is\n     not on the phonograph. Nina hears it first, then\n     Stauffenberg and Berthold. Finally the children\n     freeze and the phonograph skips without their help.\n     The glasses on the table rattle.\n\n     Now we hear the wailing quite clearly. A siren.\n\n                   STAUFFENBERG (CONT'D)\n            Air-raid.\n\n     The adults herd the children out of the room. Muffled\n     concussions cause the phonograph to skip frequently,\n     turning Wagner's masterpiece into a stutter.\n\n\n28   INT. STAUFFENBERG FLAT - BASEMENT - NIGHT               28\n\n     The family rushes down the stairs, huddling in a\n     corner - adults holding shivering children. The bombs\n     are closer, louder. The Wagner, the siren, the\n     explosions fray the nerves.\n\n                                                       25.\n\n\n     Stauffenberg reaches for Nina in the darkness,\n     finding her belly. Her hand clamps around his -\n     around their unborn child.\n\n     BOOM. So close the children scream. Dust and debris\n     fall from the ceiling. The needle rakes the\n     phonograph upstairs going back to the beginning.\n\n     CLOSE ON STAUFFENBERG - on his eye. His thoughts as\n     the bombs fall all around his home - a moment of\n     profound realization...\n\n\n29   INT. STAUFFENBERG FLAT - LIVING ROOM - NIGHT            29\n\n     Move across the room to the phonograph, looking down\n     at the 78 spinning on the turntable. The camera\n     begins to turn until all the world around us is\n     spinning and only the record is still. We read one\n     word of the title of the 78 quite clearly:\n\n                    STAUFFENBERG (V.O.)                             \n            Valkyrie.\n\n\n30   INT. SMOKY ROOM - NIGHT                                 30\n\n     Stauffenberg faces the top members of the Resistance.\n\n                          OLBRICHT\n            We've already considered Valkyrie.\n            It isn't suitable.\n\n                        STAUFFENBERG\n            Not as it's currently written.\n\n                         GOERDELER\n            Excuse me. What is Valkyrie?\n\n                          TRESCKOW\n            Operation Valkyrie.\n\n     Tresckow explains even as he studies Stauffenberg,\n     curious. What does he have in mind?\n\n                     TRESCKOW (CONT'D)\n            The Reserve Army has thousands of                       \n            men all over the city - most of                         \n            them not even in uniform. Valkyrie                      \n            is top secret plan to mobilize                          \n            those men in a national emergency.                      \n\n                                              26.\n\n\n\n                   STAUFFENBERG                       \n       Hitler designed it himself to crush\n       any internal unrest if he's cut off\n       or killed.\n\n                    GOERDELER\n       And what use is that to us?\n\n                   STAUFFENBERG\n       The orders could be rewritten. A               \n       few subtle changes would put those             \n       reserve units completely under our             \n       command.\n\n                     OLBRICHT\n       Yes, of course, but-\n\n                   STAUFFENBERG\n       Now what would the High Command do\n       if they thought, say, the SS was\n       staging a coup?\n\n                     OLBRICHT\n       They would declare a military state\n       of emergency.\n\n                     TRESCKOW\n       And initiate Operation Valkyrie.\n\n                     STAUFFENBERG\n       Hitler's   own Reserve Army, using\n       Hitler's   own plan and under our\n       command,   would automatically seize\n       power in   Berlin...                           \n\n                     GOERDELER                        \n                    (catching on)                     \n       While we put a new government in               \n       place.\n\n                   STAUFFENBERG\n       Precisely. It will seem as though\n       we're fighting for Hitler                      \n       Government, not against it.                    \n\n                    GOERDELER\n       But only if Hitler's dead.                     \n\nAll eyes turn to Goerdeler. Here we go.\n\n                GOERDELER (CONT'D)\n       That is what you're saying, isn't\n       it? The central solution.\n\n                                                 27.\n\n                GOERDELER (CONT'D)\n       How else will you make people\n       believe the SS is trying to seize\n       power?\n\n                   STAUFFENBERG\n       I'm afraid it's the only way.\n\n                    GOERDELER\n       I'm disappointed in you, Colonel. I\n       thought a man of your background\n       would appreciate a more-\n\n                   STAUFFENBERG\n       I'm a soldier first, an aristocrat\n       second.\n\n                       GOERDELER\n       Yes, but-\n\n                   STAUFFENBERG\n       And you're neither, Doctor. Now if\n       you want to be Chancellor, you'll\n       do as you're told.\n\nA moment of tension. Humiliated, Goerdeler nods. But\nhe won't ever forget this...\n\n                       BECK\n                    (to Tresckow)\n       Can this plan be made to work?\n\n                     TRESCKOW\n       Rewriting the order is one thing -\n       distributing it is another. A bomb\n       can be disarmed, recovered if it\n       fails. In this case we'd be\n       willfully circulating written\n       evidence of high treason.\n                      (thinks)\n       It's the best idea we've heard yet.\n\n                     OLBRICHT\n       There is one... small problem.\n\n                       TRESCKOW\n                       (realizing)\n       Fromm...\n\n                       GOERDELER\n       Who is Fromm?\n\n                                                         28.\n\n\n\n                          TRESCKOW\n            Commander of the Home Army.\n            Olbricht can put the reserve troops\n            on alert, but only Fromm can\n            actually initiate Valkyrie.\n\n                            BECK\n            Can we get to him?\n\n                          OLBRICHT\n            He's a careerist pig.\n\n                        STAUFFENBERG\n            But one who's gone as high as he\n            can go in Hitler's Army. It's no\n            secret he's not happy about it.\n\n                          TRESCKOW\n            Perhaps if we offered him a key\n            position in the new regime he could\n            be made to see the light.\n\n                            BECK\n            We don't seem to have a choice.\n            Without Fromm there is no Valkyrie.\n                (to Olbricht and Stauffenberg)\n            Get him.\n\n     We end on Goerdeler, a look of concern on his face.\n\n\n31   INT. WAR MINISTRY - WAITING ROOM - DAY                    31\n\n     TITLES: REICH WAR MINISTRY - OFFICE OF GENERAL\n     FRIEDRICH FROMM.\n\n     MUTED SHOUTS from O.S. Someone is getting reamed.\n     Fromm's adjutant, LIEUTENANT FRANZ HERBER - a young,\n     dedicated soldier - sits at his desk, trying to\n     ignore the screaming from the other room in between\n     stolen glances at...\n\n     PULL BACK TO REVEAL: Stauffenberg and Olbricht\n     waiting patiently, sitting across from:\n\n     MAJOR JOHN VON FREYEND, a dutiful Nazi whose face we\n     immediately don't like. He smiles coldly, taking\n     pleasure in the shouting O.S. He stares at\n     Stauffenberg, studying him, making us nervous.\n\n     Fromm's door finally opens and A BIGGER THAN LIFE\n     NAZI storms out.\n\n                                                         29.\n\n\n\n     TITLES: FIELD MARSHAL WILHELM KEITEL - HITLER'S CHIEF\n     OF STAFF.\n\n     Freyend stands, holding Keitel's hat and coat for\n     him. A perfect toady.\n\n                           KEITEL\n            You're a woman, Fromm. And a fat\n            one at that. I'd have you sent to\n            the front if I didn't think you'd\n            surrender just to be Montgomery's\n            whore.\n\n     Keitel storms out, leaving a pall. Freyend gives\n     Stauffenberg a last once-over and follows. Beat:\n\n                           HERBER\n            The... General will see you now.\n\n\n32   INT. WAR MINISTRY - FROMM'S OFFICE - CONTINUOUS           32\n\n     Stauffenberg and Olbricht step inside to find:\n\n     TITLES: GENERAL FRIEDRICH FROMM - COMMANDER OF THE\n     GERMAN RESERVE ARMY.\n\n     The haggard Fromm sits at his desk, rubbing his\n     temples. Stauffenberg and Olbricht share a confident\n     look. Surely this guy hates the High Command. Without\n     looking up to see them:\n\n                           FROMM\n            What is it you want?\n\n     Olbricht hesitates. Fromm looks up.\n\n                       FROMM (CONT'D)\n            Well, Olbricht? Speak up.\n\n                          OLBRICHT\n            I wanted to introduce you to our\n            new man - Colonel Stauffenberg.\n\n                           FROMM\n            Ah yes - the hero from Africa. I'd\n            offer my hand but you might not\n            give it back.\n\n                        STAUFFENBERG\n            I'd say the General's lost more\n            important things this morning.\n\n                                                 30.\n\n\n\nFreeze. But after a tense beat, Fromm relaxes and         \nlaughs, taking a cigarette from a box on his desk and\nnudging it toward them.\n\n                       FROMM\n       About time they put a man with\n       balls in this office. Have a seat.\n                    (to Olbricht)\n       You too, if you must.\n\nThey sit. Fromm lights a cigarette, leans back and\nexhales a cloud of smoke. We let things sit for\nawhile. The game of recruitment is about to begin and\nno one is sure where to start. The longer the quiet,\nthe more awkward things seem. Finally:\n\n                  FROMM (CONT'D)\n       They tell me you're critical of the\n       war, Colonel. Not that you don't\n       seem to have good reason.\n\n                   STAUFFENBERG\n       I am critical of losing the war,\n       General. All wars - as in Africa -\n       are lost through indecision.\n\n                      FROMM\n       In the field, you mean.\n\nHe's baiting Stauffenberg to talk shit about Hitler.\n\n                    STAUFFENBERG\n       In Berlin.\n\n                      FROMM\n       I take it that's why you're here.\n       To make decisions.\n\n                   STAUFFENBERG\n       I've made my decision, General. I`m\n       here to help others make theirs.\n\nStauffenberg makes no attempt to shade his delivery.\nHe is quite clearly indicating that he means more.\nFromm knows it, but he's being coy.\n\n                      FROMM\n       They say when there's no clear\n       option, one should do nothing.\n\n                   STAUFFENBERG\n       We're at war. We must act.                         \n       Sometimes... rashly.\n\n                                                 31.\n\n\n\n                      FROMM\n       Just what sort of rash action did\n       you have in mind, Colonel?\n\n                   STAUFFENBERG\n       That would be a decision for the\n       Supreme Military Commander.\n\nFromm is getting the message. He takes a deep drag.\n\n                      FROMM\n       Supreme Commander, you say.\n\n                   STAUFFENBERG\n       Second only to the Chancellor.\n\n                      FROMM\n       If only I were that man... This war\n       would be going quite differently.\n\n                     OLBRICHT\n       We were thinking the very same\n       thing.\n\nFromm frowns at Olbricht. This was a bit too obvious.\nStauffenberg shoots Olbricht a look. \"What the hell\nare you doing?\"\n\nFromm casually stamps out his cigarette in the\nashtray and picks up the telephone.\n\nOlbricht and Stauffenberg steel their nerves -\ncertain they are going to be reported. But Fromm\ndoesn't dial. Instead, to our relief, he disconnects\nthe line. When he is certain that it is dead:\n\n                      FROMM\n       I don't need to remind you that\n       we've all sworn an oath. That said,\n       I'm going to forget we had this\n       conversation with the understanding\n       that such speak will never occur\n       under this roof again. Am I clear?\n\n              STAUFFENBERG/OLBRICHT\n       Yes, sir.\n\n                        FROMM\n       Tell   your friends that I always\n       come   down on the right side. And as\n       long   as the Führer is alive, you\n       know   what side that is.\n\n                                                         32.\n\n                       FROMM (CONT'D)\n                      (raising his hand)\n            Heil Hitler.\n\n\n33   INT. WAR MINISTRY - CORRIDOR- CONTINUOUS                  33   \n\n                          OLBRICHT                                    \n                     (trying to be upbeat)                            \n            I think that went rather well.                            \n\n                        STAUFFENBERG                                  \n            Yes... Quite.                                             \n\n\n34   EXT. STAUFFENBERG FLAT - DAY                              34\n\n     A car loaded with luggage. Stauffenberg hugs his                 \n     children, one by one, before placing them inside.                \n\n     Then he turns to face Nina. As always, there is much             \n     to be said that they cannot say. She gently touches\n     the silver chain around his neck, the ring and the\n     cross she gave him. They embrace tightly and kiss.\n     She gets in the car, looking at him through the back\n     window as she is driven away.                                    \n\n\n35   EXT. FOREST - NIGHT                                       35\n\n     Darkness. As our eyes adjust we realize we are in the\n     middle of the woods. Is this a dream? A nightmare? We\n     are drawn toward a flickering light in the distance.\n\n\n36   EXT. FOREST - CLEARING - NIGHT                            36\n\n     From out of the darkness comes a candle held by a\n     nervous, almost mousy young woman, FRAULEIN VON OVEN.\n     Walking just behind her is Tresckow. He carries a\n     small but heavy case in one hand.\n\n     They come to a clearing in the woods and find a\n     strange sight. In the center is a tree stump\n     surrounded by papers, including the original orders\n     for OPERATION VALKYRIE, next to a leather valise\n     marked with the seal of the Reich. The orders have\n     been meticulously annotated.\n\n                        VOICE (O.S.)\n            Were you followed?\n\n                                                         33.\n\n\n\n     Fraulein Oven gasps. Tresckow turns, pistol drawn.\n     The tip of his barrel comes up just inches from\n     Stauffenberg's eyepatch. Stauffenberg smiles,\n     emerging from the shadows.\n\n                          TRESCKOW\n            Dammit, Stauffenberg. You scared me\n            half to death.\n\n                        STAUFFENBERG\n            We'll be closer than that before\n            we're finished.\n\n\n37   EXT. FOREST - LATER                                       37\n\n     Wearing white gloves, Fraulein Oven opens the case\n     Tresckow brought, revealing a portable typewriter.\n     She carefully feeds a sheet of crisp parchment into\n     the machine and sets the margins carefully. Pause.\n     Then she starts typing with remarkable speed.\n\n     (Note: The sound of typing runs throughout the scene,\n     punctuated by the crack of the carriage return - each\n     time a little louder.)\n\n     Stauffenberg and Tresckow carefully pore over the\n     Valkyrie orders, scribbling copious notes.\n\n                          TRESCKOW\n            Looking this over, I'm not\n            satisfied that the Reserve Army is\n            enough to shut down Berlin\n            completely.\n\n                        STAUFFENBERG\n                     (handing over papers)\n            Yes, I've been giving that some\n            thought. We should include any\n            field units that are home on leave.\n\n     Before Tresckow can respond, more papers:\n\n                   STAUFFENBERG (CONT'D)\n            I've also drawn up an outline for\n            orders to streamline combat groups\n            in order to quietly concentrate\n            forces at vital points - state and\n            government buildings, of course,\n            but also the radio and newspapers.\n\n     More papers. Tresckow can barely keep up.\n\n                                                         34.\n\n\n\n                      STAUFFENBERG (CONT'D)\n               Combat groups will be reorganized\n               as reinforced grenadier regiments.\n               One or two of them can be quickly\n               mobilized, eliminating the usual\n               six hour lag. We blitz the\n               government quarter, arrest all\n               Ministers and Party leaders,\n               surround all SS and police\n               barracks. Any officers who resist\n               will be arrested... or shot.\n\n     CRACK. A carriage return as loud as a rifle-shot.             \n\n\n38   EXT. BERLIN - STREET - LATER                              38   \n\n     A truck full of soldiers roars past. Stauffenberg,            \n     Tresckow and Fraulein Oven walk across a dimly lit            \n     bridge on a foggy night in Berlin, stopping in the            \n     middle.                                                       \n\n     Stauffenberg carries a leather valise with the                \n     Valkyrie orders, Tresckow carries the typewriter              \n     case. They stop at the center of the bridge, looking          \n     around carefully. No one is in sight, but anyone              \n     could be watching from the shadows. Eerie.                    \n\n                           STAUFFENBERG                            \n                          (to the Fraulein)                        \n               If anyone comes to you, play                        \n               ignorant. Just tell them-                           \n\n                          FRAULEIN OVEN                            \n               I'll tell that I was serving the                    \n               German people. Then I'll tell them                  \n               to go to hell.                                      \n\n     Both men smile, a bit taken aback. Von Oven shakes            \n     each man's hand and walks away, swallowed up by the           \n     darkness. When she is gone:                                   \n\n                            TRESCKOW                               \n               To Operation Valkyrie.                              \n\n     Stauffenberg nods. Tresckow heaves the typewriter             \n     case over the railing and into the water below.               \n\n     SPLASH.                                                       \n\n     They watch in silence as the water settles, then:             \n\n                                                 35.\n\n\n\n                TRESCKOW (CONT'D)                         \n       I've been transferred to the front.                \n\n                   STAUFFENBERG                           \n                      (shocked)                           \n       Why didn't you tell me?                            \n\n                     TRESCKOW                             \n       Would you have stayed?                             \n\nObviously not. Then it occurs to Stauffenberg.            \n\n                   STAUFFENBERG                           \n       Do you think Fromm reported us?                    \n\n                     TRESCKOW                             \n       It's more likely just... an                        \n       unfortunate coincidence. Anyway it                 \n       doesn't matter. You wrote the                      \n       orders. You know them better than                  \n       anyone.                                            \n\n                   STAUFFENBERG                           \n       You don't mean to say-                             \n\n                     TRESCKOW                             \n       I'm appointing you military leader                 \n       of the Resistance. Beck agrees.                    \n\n                   STAUFFENBERG                           \n       But Olbricht-                                      \n\n                     TRESCKOW                             \n       We both know Olbricht hasn't the                   \n       wit or the spine. No. It's you.                    \n\nA million thoughts are running through Stauffenberg's     \nmind. Fear. Anxiety. But he knows what he must do.        \n\n                TRESCKOW (CONT'D)                         \n       One more thing. You were right what                \n       you said that first night. It's not                \n       enough to kill Hitler. We need to                  \n       isolate his chain of command. The                  \n       slightest confusion could crush us.                \n       We need to be certain that no                      \n       conflicting orders get out after                   \n       the flash.                                         \n\nStauffenberg considers this for a moment.                 \n\n                                                      36.\n\n\n\n                        STAUFFENBERG                                \n            That greatly limits our options of                      \n            where and when to make our move,                        \n            but it's the only way.                                  \n\n                          TRESCKOW                                  \n            How will you do it?                                     \n\n                        STAUFFENBERG                                \n            Perhaps it's better I don't say.                        \n\n     Pause. A sad smile and nod from Tresckow, a moment             \n     ago he was in charge. Now he has no clearance.                 \n\n                         TRESCKOW                                   \n            God promised Abraham that he would                      \n            not destroy Sodom if he could find                      \n            just ten righteous men.                                 \n\n     He puts a hand on Stauffenberg's shoulder.                     \n\n                     TRESCKOW (CONT'D)                              \n            I have a feeling that for Germany                       \n            it may come down to one.                                \n\n\n39   INT. OFFICERS' CLUB - BERLIN - NIGHT                    39\n\n     A wild party - a small band, German officers, plenty\n     of women.\n\n     In stark contrast, two GESTAPO MEN sip coffee at a\n     corner table, keeping a watchful eye on the crowd.\n\n     A WAITER carries a tray of drinks to a rowdy group in\n     the corner who are immersed in the denial common to\n     Berlin these days. The Waiter serves carefully,\n     making sure one particular drink goes to:\n\n     TITLES: GENERAL ERICH FELLGIEBEL - CHIEF OF THE ARMY\n     SIGNAL CORPS.\n\n     The group toasts and downs their booze.\n\n     CLOSE ON: Fellgiebel's smile suddenly fades. He looks\n     into his glass, his good mood vanishing. He politely\n     excuses himself over the noise of the rowdy mob and\n     heads for the bathroom. He looks ill.\n\n                                                         37.\n\n\n\n\n40   INT. BATHROOM - NIGHT                                     40\n\n     Fellgiebel walks to the sink and dumps what is left\n     of his drink in the basin.\n\n     CLOSE ON: Mingling among the melting chunks of ice is\n     a GLASS EYE staring back at him.\n\n     He scowls in the mirror at Stauffenberg, waiting.\n\n                         FELLGIEBEL\n            You realize how close I am to\n            Hitler. With one word I could have\n            the Gestapo make you disappear.\n\n                        STAUFFENBERG\n            Why haven't you then?\n\n     Fellgiebel checks the stalls to make sure they are\n     empty. Stauffenberg collects his glass eye from the\n     sink, dabbing it dry on a hand towel.\n\n                   STAUFFENBERG (CONT'D)\n            None of my associates know we've\n            been talking if that's what you're\n            afraid of.\n\n                         FELLGIEBEL\n            But you know. And when the SS catch\n            you, they'll pull you apart like\n            warm bread. It'll be a crime just\n            to have known you then. I warn you.\n            If it means protecting myself, I\n            will expose you. Do not try to\n            contact me again.\n\n     Fellgiebel heads for the door but stops on:\n\n                        STAUFFENBERG\n            You can't report me. Maybe if you\n            had when I first approached you,\n            you'd have been keeping your oath.\n            But now you're just as guilty as-\n\n                         FELLGIEBEL\n            So you think that makes me a\n            sympathizer, eh? You give a man the\n            choice of betraying a fellow\n            officer or his Führer and assume\n            his actions will show you his\n            heart. It's not that simple.\n\n                                                 38.\n\n\n\n                   STAUFFENBERG\n       It is to me.\n\n                    FELLGIEBEL\n       For the last time, don't push me to\n       make a decision.\n\n                   STAUFFENBERG\n       I have no choice. It's clear now\n       that without you we have no hope of\n       success.\n\nPause. Fellgiebel's silence speaks volumes.\n\n              STAUFFENBERG (CONT'D)\n       You want us to succeed. Don't you?\n\n                    FELLGIEBEL\n       And what if you do, eh? What then?\n       Will you be any different from\n       Hitler? What of his Reich, his\n       people, the very momentum of\n       history? Will all of that let you\n       be something he isn't?\n\n                   STAUFFENBERG\n       No.\n\n                      FELLGIEBEL\n       There it is.\n\n                   STAUFFENBERG\n       But my pregnant wife, our four\n       children, the Germany I first swore\n       to defend... They demand that I be\n       something different. They demand\n       that I fight for their future even\n       if it means...\n\nAnd for a moment his voice breaks and he chokes back\nwhat may be tears.\n\n              STAUFFENBERG (CONT'D)\n       Even if it means that I never see\n       them again.\n\nIn that moment we see a side of Stauffenberg we were\nstarting to doubt existed. We see his humanity. This\nputs Fellgiebel in his place. He adjusts his tie and\nwe see the wedding ring on his finger.\n\n                                                         39.\n\n\n\n                   STAUFFENBERG (CONT'D)\n            Action is inevitable. As are the\n            consequences. When they come for me\n            I'll do what I can to hide what you\n            knew and when you knew it.\n                     (stepping closer now)\n            But don't delude yourself. You were\n            involved in a crime against your\n            country long before you met me.\n            There's still time to redeem\n            yourself. Only God can judge you\n            now.\n\n     BANG. The door bursts open, startling them both. But\n     it is only a DRUNKEN OFFICER and a YOUNG WOMAN\n     looking for some privacy.\n\n                      DRUNKEN OFFICER\n            Are you two finished or just\n            getting started?\n\n     The woman laughs. Stauffenberg walks out past them,\n     leaving Fellgiebel with Hitler's finest.\n\n\n41   INT. WAR MINISTRY - STAUFFENBERG'S OFFICE - DAY           41   \n\n     What first catches our eye is the enormous portrait\n     of Hitler looming over Stauffenberg's desk.\n\n     Stauffenberg sits before a mountain of paperwork,\n     surrounded on all sides by a flurry of SECRETARIES\n     and AIDES. He looks up to find:                               \n\n     Olbricht hovering in the doorway with that look that          \n     says, \"We need to talk.\" Stauffenberg clearly doesn't\n     have the time. He sighs.\n\n                       STAUFFENBERG                                \n            Leave us, please.\n\n     The staff instantly exits - a well-oiled machine.\n     Stauffenberg unplugs the phone.\n\n                          OLBRICHT\n            You play the part of bureaucrat\n            beautifully.\n\n                        STAUFFENBERG\n            It's the only time I can relax.\n\n                                                 40.\n\n\n\n                     OLBRICHT\n       There's a man here to interview as\n       your adjutant.\n\n                   STAUFFENBERG\n       Adjut- What for?\n\n                     OLBRICHT\n       No one told you?\n                   (obviously not)\n       You've been promoted Chief of Staff\n       for the Reserve Army.\n\nSome men might find a promotion to be good news. Not\nStauffenberg.\n\n                  STAUFFENBERG\n       For Christ's sake. Don't I have\n       enough to do?\n\n                     OLBRICHT\n       Unfortunately, your nocturnal\n       activities don't count as service\n       to the Reich.\n\n                   STAUFFENBERG\n       I'll refuse the promotion.\n\n                     OLBRICHT\n       You'll do no such thing.\n\n                   STAUFFENBERG\n       Dammit, I can't handle the work I\n       already-\n\n                     OLBRICHT\n       This is an opportunity we could\n       never have dreamed of. You're in\n       the inner circle now - with genuine\n       access to Hitler, his advisors, his\n       schedule... We need this.\n\n                   STAUFFENBERG\n       We're not ready. We're moving too\n       fast.\n\n                     OLBRICHT\n       Not half as fast as the Allies. An\n       invasion is coming, Colonel. Any\n       day now. We must act and we must\n       act soon.\n\n                                                    41.\n\n                OLBRICHT (CONT'D)\n       Tresckow may have left you in\n       charge of the \"central solution,\"                    \n       but in this world I still outrank\n       you. You will accept the\n       appointment. Is that understood?\n\nStauffenberg nods, grudgingly.\n\n                OLBRICHT (CONT'D)\n       Now. The new man is waiting\n       outside. He comes highly\n       recommended. He might even be an\n       ideal candidate.\n\n                    STAUFFENBERG\n       For what?\n\n                     OLBRICHT\n                      (smiling)                             \n       We still need an assassin.\n\nOlbricht leaves. Stauffenberg lets this sink in. He\ntakes a seat and goes back to work. After a moment:\n\nA HANDSOME SOLDIER (36) quietly enters.                     \n\nTITLES: LIEUTENANT WERNER VON HAEFTEN - RESERVIST.\nWOUNDED DURING THE RUSSIAN CAMPAIGN.\n\nHaeften clicks his heels and offers the Nazi salute,\nbut before he can say the words:\n\n                    STAUFFENBERG\n       Be seated.\n\nThrown, Haeften sits. Stauffenberg continues writing,\nignoring him. Haeften looks up at the portrait of\nHitler, startled when Stauffenberg finally speaks:\n\n              STAUFFENBERG (CONT'D)\n       Do you know how this war will end,\n       Haeften? The portrait will be un-\n       hung... And the man will be hung.\n\nStauffenberg looks up - looking for a reaction to\nsuch frank and treasonous talk. He gets none. He\nsighs, too tired to play games.\n\n              STAUFFENBERG (CONT'D)\n       Bottom line. I'm engaged in high\n       treason with all means available to\n       me. Can I count you in?\n\n                                                       42.\n\n\n\n     And the strangest thing - a reaction no one would\n     suspect - Haeften relaxes, almost sighs, like someone\n     who has at long last found a home.\n\n                          HAEFTEN\n            For anything, sir. Anything at all.\n\n                        STAUFFENBERG\n            Anything is a very dangerous word.\n\n\n42   EXT. NORMANDY - VARIOUS - DAY/NIGHT                     42\n\n     TITLES: 6 JUNE 1944.\n\n     NEWSREEL FOOTAGE OF D-DAY. Allied forces invade\n     Normandy. The liberation of Europe has begun.\n\n     But this is not the D-Day you learned about in\n     history class. This is a German newsreel. Nazi spin.\n     In it, Hitler's forces have nothing to fear.\n\n                      NEWSCASTER (V.O.)\n                          (subtitles)\n            The Allied Forces have blundered\n            into the trap awaiting them on the\n            beaches of Normandy - heroically\n            repelled by the combined might of\n            the German Army. It is a glorious\n            day for the Reich. At long last the\n            craven enemy has come to Europe to\n            face their inevitable defeat at the\n            hands of-\n\n\n43   INT. MILITARY SEDAN - NIGHT                             43\n\n                           HAEFTEN\n            Five thousand ships, one-hundred\n            thousand men from the combined\n            Allied forces.\n\n     Haeften and Stauffenberg ride in a sedan.                      \n     Stauffenberg is in profile the entire time.\n\n                        STAUFFENBERG\n            What about the Panzer divisions in-\n\n                          HAEFTEN\n            They were never dispatched. Word is\n            Hitler took a sleeping pill. His\n            staff was afraid to wake him.\n\n                                                      43.\n\n\n\n                        STAUFFENBERG\n            First Africa, now France.\n\n                          HAEFTEN\n            The Russians bearing down from the\n            East.\n\n                        STAUFFENBERG\n            Sometimes I wonder if Hitler's real\n            aim is to leave nothing but\n            scorched earth for all of Europe.\n\n     Stauffenberg rubs his forehead. The car stops.                  \n     SOLDIERS are waiting outside.\n\n     Stauffenberg gets out of the car wearing an ornate\n     dress uniform and carrying a leather valise. He has\n     arrived at a meeting of great importance.\n\n     He turns to face Haeften directly and we are\n     surprised to see both of his eyes - for an instant\n     the young lion he once was. But a closer look is\n     unsettling - we see the faint scarring, one eye\n     glowing and alive, the other cloudy and dead.\n\n     His glass eye. Stauffenberg only wore it on special\n     occasions. This is one.\n\n                          HAEFTEN\n            Maybe this is a blessing in\n            disguise. Maybe he'll finally\n            listen to reason - consider a truce\n            while he still can.\n\n                        STAUFFENBERG\n            We'll see if I can't convince him.\n\n\n44   EXT. THE BERGHOF - NIGHT                                 44\n\n     Est. Hitler's forboding southern headquarters.\n\n     TITLES: THE BERGHOF. 7 JUNE 1944.\n\n     Stauffenberg walks up a flight of wide marble stairs -\n     at the top he sees a group of WAITING ADJUTANTS\n     quietly smoking cigarettes - a clique of devoted\n     Nazis. In the group is Major Freyend, the wormy\n     officer we saw outside Fromm's office. He watches\n     Stauffenberg pass, aloof. We hate him.\n\n                                                         44.\n\n\n\n     Just then Stauffenberg is greeted by TWO SS OFFICERS\n     who move to physically search him - one his body, the\n     other his valise.\n\n                        VOICE (O.S.)\n            You don't need to search him.                             \n\n     ANGLE ON: Fromm's adjutant, Lt. Herber approaches,\n     waving off the SS.\n\n                          HERBER\n            Colonel Stauffenberg is an honored\n            guest. The hero of Africa.\n\n     The SS officers stand down. Herber and Stauffenberg              \n     share a friendly smile, about to speak when Fromm\n     walks up on them:\n\n                           FROMM\n            For God's sake, Stauffenberg,                             \n            you're-                                                   \n\n     He pauses, clearly caught off guard when he sees                 \n     Stauffenberg with two eyes.                                      \n\n                       FROMM (CONT'D)                                 \n             ... they're waiting for you.                             \n\n\n45   INT. THE BERGHOF - CONFERENCE ROOM - NIGHT                45\n\n     Stauffenberg and Fromm enter to the last thing we\n     would expect. Laughter. Drunken laughter.\n\n     PULL BACK TO REVEAL: THE BIG SIX.\n\n     Hitler and five men - some of them almost\n     caricatures, their features so distinct. The first\n     man we recognize as Keitel - the general who reamed\n     Fromm. The others we know from history and TITLES:\n\n     MINISTER ALBERT SPEER - ARCHITECT FOR THE NEW REICH.\n\n     DR. JOSEPH GOEBBELS - REICH MINISTER OF PUBLIC\n     ENLIGHTENMENT AND PROPAGANDA.\n\n     REICHSFÜHRER HEINRICH HIMMLER - HEAD OF THE SS AND\n     GESTAPO.\n\n     REICH MARSHAL HERMANN GOERING - HEAD OF THE GERMAN\n     ARMED FORCES, HITLER'S SECOND IN COMMAND.\n\n                                                    45.\n\n\n\nWe have arrived in the sanctum sanatorium of Nazi\nGermany on the day after the Normandy invasion. But\nyou would never know the tide of the war had just\nturned against Germany. A series of situation maps\nare scattered before them, ignored.\n\nOnly Speer seems to be reserved, smiling politely but\nclearly tuned into the present reality. Looking\ncloser at Goering we see he is wearing heavy make-up -\nadding to the already surreal nature of the scene.\n\nIt is also the first time we are allowed a clear,\nunobstructed view of Hitler.\n\n                      FROMM\n       Mein Führer... I wish to present\n       Colonel Claus von Stauffenberg -\n       our new Chief of General Staff for\n       the Replacement Army.\n\nThe laughter stops. Hitler and his cronies turn\ntoward Stauffenberg, looking him over. Hitler stands\nand crosses to him. Fromm meets him first, whispering\nin the Führer's ear - perhaps reminding him who\nStauffenberg is. Hitler nods: \"Ah yes.\" He takes\nStauffenberg's left hand with both of his. We are\nsurprised by his charm.\n\n                     HITLER\n       May I say, I am honored to meet a\n       hero who has sacrificed so much for\n       Germany. If only more of my\n       officers were like you.\n\nHitler's cronies smile despite the subtle insult to\nthemselves. To make it worse, Hitler turns to them.\n\n                 HITLER (CONT'D)\n       Let this man stand as an example to\n       all of you. He is the ideal German\n       officer.\n\nFromm nervously clears his throat.\n\n                      FROMM\n       Mein Führer, we have asked\n       Stauffenberg here today so that he\n       might brief us on mobilizing troops\n       from the Home Army to support those\n       in Normandy.\n\n                                                      46.\n\n\n\n                           HITLER\n            Hmmm? Oh yes, Normandy. That will\n            no longer be necessary. General\n            Goering has assured me that\n            Normandy is under control.\n\n     Stauffenberg's good eye flickers. \"Are you insane?\n     Normandy is a catastrophe.\" Another glance at the\n     situation map shows Allied forces over-running.\n\n     But the painted-on smiles of Hitler's nodding cronies\n     promote the lie. No one has the courage to tell\n     Hitler anything close to the truth. Somewhere in\n     their eyes is the fear that someone will.\n\n                        STAUFFENBERG\n            Mein Führer, if I may... The\n            situation in Normandy is-\n\n                           KEITEL\n            You're dismissed, Stauffenberg.\n\n                         STAUFFENBERG\n            But-\n\n                           KEITEL\n            Send your man home, Fromm. Then\n            bring us some brandy.\n\n     Fromm is stung - a man of his rank being treated like\n     a waiter. Stauffenberg steps back, clicks his heels\n     and salutes, just managing to say:\n\n                        STAUFFENBERG\n            Heil Hitler.\n\n     Hitler half waves, walking slowly back to his seat.\n     Fromm and Stauffenberg leave.\n\n\n46   EXT. THE BERGHOF - NIGHT                                46\n\n     Fromm escorts a visibly shaken Stauffenberg to his\n     waiting vehicle. Haeften opens the car door for\n     Stauffenberg to get in. Fromm leans in.\n\n                           FROMM\n            I don't know what you've got\n            brewing and I don't want to know...\n            But when the music stops, I'd be\n            much obliged if Keitel should find\n            himself without a chair.\n\n                                                      47.\n\n\n\n     Is Fromm saying he's in? Is Keitel's death a\n     condition? Hard to say and meant to be. Before\n     Stauffenberg can inquire, Fromm slams the door shut\n     and returns to the madness inside the Berghof.\n\n\n47   INT. MILITARY SEDAN - CONTINUOUS                        47\n\n     Stauffenberg leans back in his seat, mentally\n     calculating his next step.\n\n                        STAUFFENBERG\n            They're all insane. Every one of\n            them except for Speer, and he's\n            nothing but an architect.\n\n     Stauffenberg puts on his eyepatch before removing his\n     glass eye. He polishes it with a cloth and now it\n     stares at him from his gloved hand. A conscience.\n\n                    STAUFFENBERG (CONT'D)\n            Tell Beck we've found our\n            assassin...\n                 (off Haeften's confused look)\n            I'll do it myself.\n\n\n48   INT. CHURCH - NIGHT                                     48\n\n     We find ourselves in an empty church. Beck is seated\n     in a pew staring straight ahead. Stauffenberg sits\n     directly behind him. They can't risk being seen\n     together. They speak in hushed tones.\n\n     The first thing we notice is how weak and ill Beck\n     looks. He struggles to hide a persistent cough.\n\n                            BECK\n            Out of the question. It won't work.\n            We need you here in Berlin.\n\n                       STAUFFENBERG\n            Who else, then? Who can even get as\n            close?\n\n     Beck knows there is no other choice.\n\n                   STAUFFENBERG (CONT'D)\n            Valkyrie is very clear. Once the\n            order is given, the Reserve Army                        \n            will automatically seize control of\n            the government with or without me.                      \n\n                                                         48.\n\n\n\n                            BECK                                      \n            Orders are not enough. They need a                        \n            man to follow. The right man.                             \n\n     Pause. Stauffenberg knows he's right. The fucking                \n     pressure. He thinks for a moment, then with a sigh:              \n\n                       STAUFFENBERG                                   \n            Olbricht will oversee operations in                       \n            my absence. I can be back in Berlin                       \n            three hours after Hitler is-                              \n\n     Stauffenberg shuts up, lowering his head in prayer as\n     a CLERGYMAN passes. Once they are again alone:\n\n                            BECK                                      \n            Three very crucial hours.\n\n                        STAUFFENBERG\n            We both know there's no other way.\n\n     Beck nods, resigned.\n\n                           BECK\n            I'll tell the others-\n\n     As if on cue, Beck loses control of his cough.\n     Stauffenberg leans forward, handing him a\n     handkerchief and putting a reassuring hand on his\n     shoulder until the old man's hacking subsides.\n\n                       BECK (CONT'D)\n            I'm afraid whatever the outcome, I\n            won't be there to see it.\n\n                        STAUFFENBERG\n            Nonsense. You're stronger than you\n            think. You might just be the\n            strongest one of all.                                     \n\n\n49   EXT. STAUFFENBERG HOME - BAMBERG - DUSK                   49\n\n     Est. The sound of children at play takes us to:\n\n\n50   EXT. STAUFFENBERG HOME - BACK LAWN - CONTINUOUS           50\n\n     Once again, the scene idyllic. The Stauffenberg\n     children play football in the distance. Stauffenberg\n     himself is out of uniform for the first time since\n     the hospital, but he does not seem relaxed.\n\n                                                   49.\n\n\n\nNina sits across from him, half-reading a book, half\ntalking to her husband. Stauffenberg cannot hear a\nword she is saying - he is miles away.\n\nHe looks over at his children. One would never\nsuspect that Germany has waged a calamitous war and\nthat the country is facing total devastation.\n\n                       NINA\n       ...After that I thought I'd take\n       the children to the country for a\n       few days to see my- Claus?\n\nHe snaps out of his thoughts. \"Hmmm?\"\n\n                  NINA (CONT'D)\n       Have you heard a word I said?\n\n                   STAUFFENBERG\n       The country...\n                      (thinking)\n       Nina. Listen. I want you to delay\n       your trip. Just for a while.\n\nShe wants to ask, he wants to tell her. Finally:\n\n                       NINA\n       Does this have something to do\n       with... your work?\n\n                   STAUFFENBERG\n       I would just be more comfortable\n       knowing where you are - until I'm\n       back from Berlin. Things will be\n       different then. I promise.\n\nLong pause. Once again, a couple who know each other\nwell enough to not have to say things plainly. Nina\nis worried but strong.\n\n                       NINA\n       How long until... until we see you?\n\n                   STAUFFENBERG\n       A few days. If all goes well. Then\n       we can travel as a family.\n\n                       NINA\n       And if things... don't go well?\n\nHe hesitates.\n\n                                                         50.\n\n\n\n                       STAUFFENBERG\n            I love you, Nina.\n\n                           NINA\n            And I love you... What-\n\n                          CHILDREN\n            PAPA, COME AND PLAY WITH US. (Etc.)\n\n     The children kick the ball toward Stauffenberg - the\n     one sport he can play. He is about to say something\n     to Nina, but she cuts him off.\n\n                            NINA\n            Go be with your children.\n\n     Stauffenberg stands, touching Nina's cheek and\n     kissing her forehead. We stay on her as he joins the\n     children. She watches them play together, seeing her\n     husband laughing for the first time in a long while.\n     Her eyes well with tears - a mixture of happiness and\n     anguish. Too good to last, too much to bear.\n\n\n51   INT. SMOKY ROOM - DAY                                     51\n\n     Haeften, Olbricht and Stauffenberg stand around a\n     table giving their undivided attention to:\n\n     TITLES: COLONEL MERTZ VON QUIRNHEIM - STAUFFENBERG'S             \n     REPLACEMENT UNDER OLBRICHT.\n\n     He empties the contents of two tawny leather\n     briefcases onto the table:\n\n     Along with a crude drawing covered with calculations\n     he produces two brick-like lumps wrapped in butcher\n     paper, two small caps and two thin metal cylinders.\n\n                            MERTZ\n            Two 975 gram packs of plastic-W.\n            Enough explosive to cripple a\n            panzer.\n                       (pointing to caps)\n            Your detonators.\n                    (pointing to cylinders)\n            Your fuses. British time pencils.\n            This acid capsule is your trigger.\n\n     Stauffenberg carefully studies the items before him.\n\n                                                    51.\n\n\n\n                  MERTZ (CONT'D)\n       When you're ready to arm, attach\n       the detonator to the bottom of the\n       time pencil, like so...\n                   (demonstrating)\n       ...Insert the entire device into\n       either end of the plastic-W, crush\n       the acid capsule and you're live.\n       When the acid eats through the wire\n       holding back the trigger spring...\n       Well... You'll want to be very far\n       away.\n\n                     OLBRICHT\n       What if they search your bag?\n\n                   STAUFFENBERG\n       I'm one of the inner circle now.\n       They'll make sure I am who I am.\n       Beyond that, they won't touch me.\n                     (to Mertz)\n       How much time do I have?\n\n                      MERTZ\n       Theoretically there's a 30-minute\n       delay. But with the kind of heat\n       you can expect at the Wolf's Lair,\n       I'd give you 10, 15 minutes tops.\n\n                     HAEFTEN\n       That's... hardly precise.                            \n\n                      MERTZ\n       This is state of the art. You can\n       have small or precise. Not both.\n\n                     OLBRICHT\n       Might this be just a little too\n       small?\n\n                      MERTZ\n       The explosion won't do the killing.\n       The air in the room will.\n\nHe points to the drawing - an overhead sketch of:\n\n                  MERTZ (CONT'D)\n       Hitler's bunker is constructed of\n       reenforced concrete. A steel door,\n       no windows. Just one of these\n       explosives in a space like that\n       will cause tremendous air pressure.\n\n                                                   52.\n\n                  MERTZ (CONT'D)\n       Enough to instantly kill everyone\n       present. The second charge will be\n       entirely redundant.\n\n                     OLBRICHT\n       Of course, I'm all for redundancy.\n       However... If, by some miracle,\n       Hitler does survive, what then?\n\n                   STAUFFENBERG\n       We have an inside man at the Wolf's\n       Lair in communications. He'll\n       notify you immediately following\n       the flash and then sever all\n       contact with the outside world.\n\nThe others are stunned.\n\n                     OLBRICHT\n       Just how did you manage that?\n\n                   STAUFFENBERG\n       It's my job, isn't it? While\n       Hitler's inner circle is still\n       regrouping, you will initiate\n       Valkyrie and seize control in Paris\n       and Berlin. Even if Hitler\n       survives, we'll have momentum.\n\n                         MERTZ\n                      (to Olbricht)\n       But as   you said yourself it would\n       take a   miracle. Anyone in that\n       bunker   when just one of these goes\n       off is   not coming out alive.\n\nHaeften places the items back in the briefcases.\n\n                    OLBRICHT\n       Himmler is expected to be at the\n       meeting as well. Don't proceed\n       unless you can get them both.\n\n                   STAUFFENBERG\n       That could be difficult.\n\n                     OLBRICHT\n       Why kill a madman just to have a\n       lunatic take his place?\n\n                   STAUFFENBERG\n       This is Goerdeler's idea, isn't it?\n\n                                                      53.\n\n\n\n                          OLBRICHT\n            The members are in total agreement\n            on this.                                               \n\n     Stauffenberg chews on this, pissed. Then:                     \n\n                        STAUFFENBERG                               \n            Fucking politicians. I'll hold off                     \n            if the decision is unanimous. And I                    \n            want another man on the committee.                     \n            A soldier.                                             \n\n     A soldier himself, Olbricht is insulted.                      \n\n                          OLBRICHT                                 \n            And just who this soldier be?                          \n\n     Stauffenberg glances at Mertz, sizing him, up.                \n\n                        STAUFFENBERG                               \n                      (pointing to Mertz)                          \n            Him.                                                   \n\n                           OLBRICHT                                \n            Him?                                                   \n\n     Mertz's eyes widen. \"Me?\" But Stauffenberg and                \n     Haeften pick up their briefcases and leave without\n     another word. Assassins.\n\n     Olbricht reaches for the phone and dials.\n\n                     OLBRICHT (CONT'D)                             \n            This is General Olbricht. Order the\n            Guard Battalion and all Army\n            Schools near Berlin to take up\n            march readiness. Stand by for\n            Operation Valkyrie.\n\n     CLACK-CLACK-CLACK-CLACK-CLACK...\n\n\n52   INT. CENTRAL COMMUNICATIONS - BERLIN - DAY             52\n\n     A small, bunker-like room serves as the hub of all\n     military communications. The walls are lined with\n     chattering teletype machines and their OPERATORS.\n\n     CLOSE ON: One teletype in particular. The words are\n     clicking by quickly but we clearly make out:\n\n     STAND BY FOR OPERATION VALKYRIE...\n\n                                                       54.\n\n\n\n     One SERGEANT HELM leans in, reading it, curious. He\n     tears the sheet out of the teletype and takes it to:\n\n     The officious LIEUTENANT HAANS - officer in charge.\n     He likes his job and how well he does it.\n\n                            HELM\n                   (handing over the order)\n            Lieutenant.\n\n                             HAANS\n            What about it?\n\n                            HELM\n            This order is calling the Reserve\n            Army for some sort of stand-by\n            action... in Berlin.\n\n                           HAANS\n                           (shrugs)\n            Looks like a drill of some kind.\n\n                            HELM\n            Valkyrie? I've never heard of that.\n\n                           HAANS\n            Send the order through, Sergeant.\n\n     A SHRILL WHISTLE and a WAILING SIREN take us to...             \n\n\n     EXT. BERLIN - VARIOUS - DAY                                    \n\n     Shots of scattered elements of the Reserve Army                \n     coming together, taking shape:                                 \n\n     RESERVISTS and CADETS, from all walks of life, rush            \n     to their homes, hastily trading their civilian                 \n     clothes for uniforms.                                          \n\n\n54   EXT. AIRFIELD - RANGSDORF - DAY                         54\n\n     TITLES: 15 JULY 1944.\n\n     Stauffenberg and Haeften board a waiting courier\n     plane, preparing for departure. Both are clutching\n     their briefcases, faces like stone. Stauffenberg is\n     dressed once again in his ornate, formal attire - his\n     patch gone, glass eye in place.                                \n\n                                                         55.\n\n\n\n\n     EXT. DEUTSCHLAND GUARD BATTALION - BERLIN - DAY                  \n\n     AIR SIRENS wail. A SCULPTED EAGLE AND SWASTIKA loom              \n     over a large pillared stronghold.                                \n\n     From out of the surrounding barracks, RESERVE                    \n     SOLDIERS scramble to march readiness, assembling on              \n     the center parade grounds, awaiting orders.                      \n\n     Vehicles move into place along the perimeter. All in             \n     all, a well-oiled machine.                                       \n\n     CLOSE ON THE BERLIN COMMANDANT - GENERAL PAUL VON                \n     HASE - issuing the alert signal. AIR SIRENS wail.                \n\n     RESERVE SOLDIERS scramble into readiness. Vehicles               \n     move into place - a well-oiled machine.                          \n\n     We focus on two officers in particular: MAJOR OTTO               \n     ERNST REMER, Commander of the Deutschland Guard                  \n     Battalion, and SECOND LIEUTENANT DR. HANS HAGEN.                 \n     Loyal Nazis both.                                                \n\n                           REMER                                      \n            What do you suppose this is all                           \n            about?                                                    \n\n                           HAGEN                                      \n            Probably just a drill.                                    \n\n     But Remer doesn't seem convinced. Remember him.                  \n\n\n56   INT./EXT. VARIOUS - DAY                                   56\n\n     Shots of Stauffenberg and Haeften deplaning/getting\n     into a waiting car/slowly making their way to their\n     destination. Finally, they arrive at:\n\n\n57   EXT. WOLF'S LAIR - DAY                                    57\n\n     Est. A 625 acre compound hidden deep in the mosquito\n     infested forests of Wilhelmsdorf. Security is tight -\n     barbed wire fencing, checkpoints, flak towers,\n     machine gun nests, trenches, land mines.                         \n\n     TITLES: WOLFSCHANZE - \"THE WOLF'S LAIR\". HITLER'S\n     BAVARIAN HEADQUARTERS.\n\n                                                      56.\n\n\n\n\n58   EXT. WOLF'S LAIR - MAIN GATE - DAY                      58   \n\n     The car carrying Stauffenberg and Haeften arrives at\n     the first security checkpoint.                                 \n\n     TWO GUARDS check identity papers and confiscate                \n     pistols from Haeften and The Driver. Stauffenberg              \n     boldly extends his valise to one of the Guards, but            \n     rather than reach for it, the young soldier snaps to           \n     attention and raises his hand in a Nazi salute, eyes           \n     straight ahead, stone-like. A drone.                           \n\n     After an awkward pause:                                        \n\n                         STAUFFENBERG                               \n                         (to the Driver)                            \n            Drive on.                                               \n\n\n     EXT. WOLF'S LAIR - VARIOUS - DAY                               \n\n     CLOSE ON STAUFFENBERG'S BAG. A series of JUMP CUTS\n     follow the bag through the extensive security layers\n     one must endure before getting to the meeting. ID is\n     checked frequently. The bags, not once. The men here\n     are Hitler's inner circle, after all.\n\n\n59   EXT. WOLF'S LAIR - COMPOUND - DAY                       59\n\n     Finally, Stauffenberg and Haeften are escorted toward\n     the bunker where the meeting will be held. Pausing,\n     Stauffenberg looks back over his shoulder to find:\n\n     THE COMMUNICATIONS HUT - through the open door of the\n     small shack we see a mass of radios and telegraphs. A\n     LONE FIGURE stands outside, smoking a cigarette.\n\n                           HAEFTEN\n                    (whispering to Haeften)                         \n            Your man?\n\n     Yes. And it is none other than GENERAL ERICH\n     FELLGIEBEL, the man Stauffenberg confronted in the\n     bathroom at the Officers' Club so long ago.\n\n     He and Stauffenberg share a long, intense stare.\n     Finally, Fellgiebel nods, dropping his cigarette and\n     crushing it with his boot. He's in.\n\n     Stauffenberg and Haeften head inside the impervious\n     bunker through the heavy steel door.\n\n                                                         57.\n\n\n\n\n60   INT. WOLF'S LAIR - BUNKER - BRIEFING ROOM - DAY           60\n\n     Stauffenberg and Haeften find themselves in a\n     cramped, hot, windowless room filled with VARIOUS\n     OFFICERS waiting around a large conference table.\n\n     Silence. A moment later, Hitler enters - Keitel and\n     Fromm follow close behind. Heels click in unison.\n     Keitel starts the meeting, but Stauffenberg isn't\n     listening. While all eyes follow Hitler, Stauffenberg\n     watches the door, scanning the faces in the room.\n\n                        STAUFFENBERG\n                         (whispering)\n            Himmler. Where is Himmler?\n\n     Haeften doesn't see him either. Shit.\n\n                          KEITEL\n            ...Now for the first order of\n            business. Fromm, I believe you will\n            brief us on blocking divisions for\n            the Eastern Front...\n\n     Stauffenberg silently excuses himself from the room.\n     We hold on his briefcase. Remember where he left it.\n\n\n61   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY               61\n\n     The phone rings. A waiting Mertz grabs it.\n\n                            MERTZ\n            General Olbricht's Office.\n                      (suddenly nervous)\n            Hold the line.\n                         (to Olbricht)\n            Stauffenberg says Himmler's not at\n            the briefing. He wants to proceed.                        \n\n     All color drains from Olbricht's face.\n\n                           OLBRICHT\n            Call Beck.\n\n     He leaves. Mertz rolls his eyes and dials a second\n     phone.\n\n                                                         58.\n\n\n\n\n62   INT. SMOKY ROOM - DAY                                     62\n\n     Beck and Goerdeler sit impatiently by the telephone,\n     waiting for any word on the assassination and\n     impending coup. When the telephone RINGS:\n\n                             BECK\n            Beck.\n\n     He presses the receiver tightly to his ear, a look of\n     concern washing over his face. He turns to Goerdeler.\n\n                       BECK (CONT'D)\n            Himmler is not in the briefing.\n\n     Goerdeler's reaction is vintage politician. Blank.\n\n\n63   INT. WOLF'S LAIR - BUNKER - HALLWAY - DAY                 63\n\n     CLOSE ON A CIGARETTE. We watch as Stauffenberg\n     smokes, waits, looks at his watch - the sounds of the\n     meeting going on behind him. He drops his cigarette\n     and we see a pile of three more. He has been waiting\n     while the others deliberate. Finally:\n\n                      MERTZ (ON PHONE)\n            They say no. Wait.\n\n     (Note: Intercut between Mertz and Stauffenberg.)\n\n     Stauffenberg is furious. He calms himself.\n\n                        STAUFFENBERG\n            What do you say?\n\n     Pause. Mertz looks around, makes sure he is alone.\n\n                             MERTZ\n            I say do it.\n\n     Stauffenberg hangs up the phone. The moment of truth.\n\n\n64   INT. WOLF'S LAIR - BUNKER - BRIEFING ROOM - DAY           64\n\n     Stauffenberg quietly slips back into the briefing\n     unnoticed. He freezes:\n\n     CLOSE ON: The spot where Stauffenberg left his\n     briefcase. Remember? Well it's gone.\n\n                                                         59.\n\n\n\n     He looks around frantically. Some officers notice\n     him. Tension mounts. He gets Haeften's attention.\n\n                        STAUFFENBERG\n                          (mouthing)\n            My briefcase.\n\n     Before Haeften can answer, Fromm shoots them both a\n     glare. \"What the hell are you doing?\"\n\n                           KEITEL\n            ...Gentleman. You are dismissed.\n\n     And like that, the briefing has ended. Stauffenberg\n     is sickened - the opportunity lost. Hitler exits,\n     walking right past him. Keitel and the rest file out.\n     The last to leave is Fromm.\n\n                           FROMM\n            That call better have been\n            important.\n\n     Stauffenberg turns, coming face-to-face with Freyend,\n     Keitel's hateful toady. He holds the missing\n     briefcase. For a moment we're sure the jig is up.\n\n                          FREYEND\n            Your bag... Colonel.\n\n     He hands it over and leaves.\n\n\n65   EXT. DEUTSCHLAND GUARD BATTALION - BERLIN - DAY           65\n\n     A military sedan skids to a stop outside the Guard\n     Battalion headquarters. Olbricht jumps from the car,\n     racing to get General Hase's attention.\n\n     LARGE FORMATIONS of soldiers stand at attention in\n     the hot sun, awaiting orders.\n\n                            HASE\n                         (whispering)\n            What the hell is going on? My men\n            have been standing here for an\n            hour. I don't know what to tell\n            them.\n\n     CLOSE ON REMER (the officer we told you to remember)\n     standing before the ranks. He eyes Hase and Olbricht\n     suspiciously, trying to hear what they are saying.\n     After a moment, Hase addresses the men.\n\n                                                 60.\n\n\n\n                  HASE (CONT'D)\n       At ease, gentlemen.\n\nOlbricht addresses the men, trying unsuccessfully to\nhide his nerves.\n\n                     OLBRICHT\n       This has been a drill. You're all\n       to be commended for your quick\n       response. Dismissed.\n\nPause. The men linger, confused until:\n\n                OLBRICHT (CONT'D)\n       HEIL HITLER.\n\n                      SOLDIERS\n       HEIL HITLER.\n\nAnd the men fall out, nowhere to go so they just\nlight up and shoot the shit. Hagen approaches Remer.\n\n                      HAGEN\n       What did I tell you? A drill.\n\nBut Remer is not so sure. The way he stares at\nOlbricht makes us nervous.\n\nCLOSE ON: Olbricht sees Remer looking at him, making\nnote of the esteemed KNIGHT'S CROSS pinned to Remer's     \nuniform. Olbricht leans toward Hase.\n\n                    OLBRICHT\n       That man there. Who is he?\n\n                       HASE\n       Major Remer? He commands the\n       Deutschland Guard Battalion. What\n       about him?\n\n                     OLBRICHT\n       Get rid of him.\n\n                      HASE\n       Remer? Don't worry about him. He's\n       an order taker. To the bone.\n\nAh yes... But whose orders?\n\n                                                          61.\n\n\n\n\n66   INT. WAR MINISTRY - OUTSIDE FROMM'S OFFICE - DAY           66\n\n     As usual, Lt. Herber sits at his desk and, as usual,\n     he tries to ignore:\n\n     MUTED SHOUTS through Fromm's office door. PULL BACK\n     TO REVEAL Stauffenberg and Olbricht waiting.\n\n     They sit across from, Freyend. A beat later, Keitel\n     storms out of Fromm's office, his face red with\n     anger. Deja vu. When Keitel and Freyend are gone:\n\n     Herber looks up from his desk with a nervous smile.\n\n                           HERBER\n            The General will see you now.\n\n     Stauffenberg and Olbricht stand, hats in hand.\n\n\n67   INT. WAR MINISTRY - FROMM'S OFFICE - MOMENTS LATER         67\n\n                           FROMM\n            How dare you put the Reserve Army\n            on standby without my knowledge.\n            You damn near cost me my\n            commission. What in God's name made\n            you think you even had the\n            authority?\n\n                          OLBRICHT\n            It was only a drill. An exercise.\n\n                           FROMM\n            DON'T LIE, OLBRICHT. Not to me. We\n            both know it was no fucking drill.\n\n                        STAUFFENBERG\n            General, if I may-\n\n                           FROMM\n            You may not, Colonel. You may not\n            do anything. Because now you've not\n            only shown me you can't deliver,\n            you've painted a target on my back.\n            If I so much as sense you trying to\n            move the Reserve Army again, I'll\n            personally have you both arrested.\n            Do I make myself abundantly clear?\n\n                   STAUFFENBERG/OLBRICHT\n            Yes, sir.\n\n                                                         62.\n\n\n\n                               FROMM\n            Heil Hitler.\n\n                           OLBRICHT\n            Heil Hitler.\n\n     But Stauffenberg turns to leave without answering.\n\n                           FROMM\n            I'll hear you say it, Colonel.\n\n     Stauffenberg stops, glaring at Fromm with his one\n     eye. He squares his shoulders, clicks his heels\n     loudly and delivers a downright Nazi-like:\n\n                        STAUFFENBERG\n            HEIL HITLER.\n\n     Still managing to make it sound spiteful. He leaves\n     without being dismissed, slamming the door.\n\n\n68   INT. SMOKY ROOM - NIGHT                                   68\n\n     It has been a long day, the Resistance leaders are\n     all exhausted. Beck, Olbricht, Witzleben, Haeften and\n     Mertz watch Goerdeler circling a rigid Stauffenberg.\n\n                         GOERDELER\n            The point of your central solution\n            is to replace Hitler so that we can\n            negotiate a truce with the Allies.\n            The Allies, I suspect, would be\n            more amenable to a truce... IF WE\n            OFFER IT TO THEM BEFORE THEY ARE IN\n            FUCKING BERLIN.\n\n                        STAUFFENBERG\n            Today was a matter of indecision -\n            nothing more. A military operation\n            in the hands of a politician.\n\n     Stauffenberg's lack of respect infuriates Goerdeler.\n\n                         GOERDELER\n            I don't think I am alone when I say\n            your judgement is in question.\n                        (to the others)\n            I would like to take a vote.\n\n                               BECK\n            Carl.\n\n                                                    63.\n\n\n\n                     GOERDELER\n       I DEMAND THAT WE RELIEVE COLONEL\n       STAUFFENBERG.\n\n                       BECK\n       Carl, if I may have a word with you\n       in private.\n\n                    GOERDELER\n       If you have something to say,\n       Ludwig, say it here. Say it now.\n\n                       BECK\n       Very well. There's no need to vote.\n\nBeck turns to the bar, pours two drinks. Stauffenberg\nstiffens, ready for the axe.\n\n                  BECK (CONT'D)\n       I consider you a friend. And I look\n       forward to the day when we can once\n       again live as free men. But you've\n       become a liability.\n\nGoerdeler smiles smugly. But the smile fades when\nBeck turns, offering a drink to him.\n\n                  BECK (CONT'D)\n       I'm sorry it has to be this way.\n\n                    GOERDELER\n       Wha... What are you saying?\n\n                       BECK\n       Fellgiebel informed me this\n       evening... Himmler's issued an\n       order for your arrest. You'll have\n       to leave Germany. Tonight. When\n       we've succeeded with the central\n       solution you'll return as\n       Chancellor. Until then-\n\nGoerdeler stands, confronting Stauffenberg.\n\n                    GOERDELER\n       This is your doing, isn't it? ISN'T\n       IT? You can't just get rid of me\n       like this. I am the man Germany\n       will follow. I'm... I...\n\nStauffenberg says nothing. He's too cool. Goerdeler\nlooks at the other conspirators, but no one is going\nto speak for him. Finally, almost in tears:\n\n                                                 64.\n\n\n\n                GOERDELER (CONT'D)\n       Ludwig, I-\n\nBeck offers him an envelope.\n\n                      BECK\n       Disappear, Carl. Avoid contact with\n       anyone.\n\nUgly pause. Goerdeler snatches the envelope and sulks\nout. We could not be happier to see him go. Beck\ncoughs, turns to Stauffenberg.\n\n                  BECK (CONT'D)\n       No more indecision. From now on,\n       Stauffenberg has discretion.                       \n\n                     OLBRICHT\n       I can't issue Valkyrie again unless\n       we follow through. If he fails to-                 \n\n                   STAUFFENBERG\n       I'll do my job. You just take\n       Berlin.                                            \n\n\nINT. STAUFFENBERG'S BERLIN FLAT - NIGHT                   \n\nCLOSE ON: A telephone. Stauffenberg's three fingered      \nhand picks up the receiver and lifts it out of frame.     \n\n               STAUFFENBERG (V.O.)                        \n       I'd like to place a call to                        \n       Bamberg, please.                                   \n\n\nINT. STAUFFENBERG HOME - BAMBERG - NIGHT                  \n\nNina and her children eat supper around a single          \ncandle, Bamberg is experiencing a blackout. Though        \nNina manages a tranquil facade she is anything but.       \n\nANGLE ON: The silent telephone in the foreground. We      \nwait for it to ring, but it never does.                   \n\n\nINT. CHURCH - NIGHT                                       \n\nBeck enters to find Stauffenberg in the front pew,        \nstaring at Christ on the cross.                           \n\n                                                 65.\n\n\n\n                       BECK                              \n       Have you made your peace with God,                \n       then?                                             \n\n                   STAUFFENBERG                          \n       As best I can.                                    \n\n                       BECK                              \n       Then you have nothing to fear.                    \n\nStauffenberg manages a smile as Beck sits.               \n\n                  STAUFFENBERG                           \n       I know the soldier inside me is a                 \n       traitor. I wonder how I'll be                     \n       judged as a man.                                  \n\n                        BECK                             \n       By history?                                       \n\n                     STAUFFENBERG                        \n       By God.                                           \n\n                       BECK                              \n       In the end, we answer only to                     \n       ourselves.                                        \n\nStauffenberg fingers the cross and ring hanging from     \nthe chain around his neck.                               \n\n                  BECK (CONT'D)                          \n       Did you reach your wife?                          \n\n                  STAUFFENBERG                           \n       Bombing in Ebingen. I can't get                   \n       through.                                          \n\n                       BECK                              \n       Ebingen is a long way from Bamberg.               \n       They're safe. You've seen to that.                \n                   (realizing...)                        \n       To think... You came to us a                      \n       wounded soldier from Africa. Now...               \n       Now you are both the architect and                \n       the assassin. I'm still trying to                 \n       understand how this came to be.                   \n\n                   STAUFFENBERG                          \n                  (more to himself)                      \n       Like a farmer watching the corn                   \n       grow. One day it's over his head...               \n\n                                                         66.\n\n\n\n                             BECK                                     \n            What's that?                                              \n\n                         STAUFFENBERG                                 \n            Nothing...                                                \n\n     And the two men look up at the cross in silence.                 \n\n\n71   EXT. STAUFFENBERG FLAT - DAYBREAK                         71   \n\n     In these waking hours Berlin appears quite peaceful.\n     Only the distant sound of shelling reminds us that\n     the city is surrounded by war.\n\n\n72   INT. STAUFFENBERG FLAT - BEDROOM - CONTINUOUS             72\n\n     A tawny leather briefcase sits on a neatly made bed.\n\n     Stauffenberg, freshly bathed and wrapped in a towel,\n     shaves in front of the mirror. For the first time we\n     see his scars and deformities in full. He looks\n     himself over, finally focusing on the chain around\n     his neck, contemplating the small cross and the ring -\n     its engraving: finis-initium [end-beginning].\n\n     Though his face is clean-shaven now, he continues,\n     slowly running the razor down his throat. Then he\n     stops, pressing the blade a little too hard and\n     bringing blood. It almost seems intentional.\n\n     CLOSE ON: The box that holds his glass eye, staring.\n\n\n73   INT. STAUFFENBERG FLAT - BEDROOM - LATER                  73\n\n     Stauffenberg has since mastered the process of\n     dressing himself. JUMP CUTS take us from a wounded\n     soldier to an officer of the General Staff.\n\n     CLOSE ON: His crisp white collar, picking up a trace\n     of blood from the cut on his throat.\n\n\n74   EXT. STAUFFENBERG FLAT - DAY                              74\n\n     TITLES: 20 JULY 1944. 6:00 AM.\n\n     Haeften holds the door for Stauffenberg, stepping                \n     into a military sedan.                                           \n\n                                                         67.\n\n\n\n\n75   EXT. BERLIN - VARIOUS - DAY                               75\n\n     For the first time we see Berlin in broad daylight -\n     the city in ruins. The drive through the rubbled,\n     smoky streets is particularly eerie today.                       \n\n\n78   EXT. AIRFIELD - RANGSDORF - DAY                           78\n\n     TITLES: 7:00 AM.\n\n     Haeften and Stauffenberg board a three-engine courier\n     plane - each carrying a leather briefcase. A moment\n     later the plane is taking off.                                   \n\n\n79   INT. SMOKY ROOM - DAY                                     79\n\n     A group of 30 RESISTANCE OFFICERS talk quietly,\n     smoking cigarettes and waiting anxiously. Many of the\n     faces we recognize, some we see for the first time.\n     We notice Witzleben has donned his old military\n     uniform, looking a little too proud.\n\n     Beck looks over the faces of these men, trying to\n     contain his own fear. His eye catches the door\n     opening and a MAN IN A DECORATED POLICE UNIFORM\n     entering the room. We tense.\n\n     One by one, the men in the room stop talking, staring\n     at the police officer. Just as we think it's over:\n\n                            BECK\n            Gentlemen, may I introduce Chief\n            Helldorf. He's guaranteed the full\n            support of the Berlin Police.\n\n     Helldorf nods. The men breathe a collective sigh of\n     relief. Some laugh. Many shake Helldorf's hand.\n\n                       BECK (CONT'D)\n            We can begin.\n\n     Beck moves to a table covered with maps of Berlin,\n     Paris and the Wolf's Lair.\n\n                       BECK (CONT'D)\n            Hitler has scheduled a military\n            briefing for today at one o'clock.\n            Stauffenberg will strike regardless\n            of who else is present.\n\n                                                         68.\n\n\n\n     As Beck speaks, we see how things should play out...\n\n\n80   EXT. WOLF'S LAIR - DAY                                    80\n\n     Stauffenberg and Haeften are driven in a topless\n     sedan. Each carries his leather briefcase.\n\n                        BECK (V.O.)\n            Once in position, he will signal us\n            once to alert the troops and again\n            after the flash...\n\n\n81   EXT. WOLF'S LAIR - BUNKER - DAY                           81\n\n     Stauffenberg and Haeften quickly get in the sedan -\n     the concrete bunker just behind him - its steel door\n     closed. They speed out of frame a beat before a\n     muffled explosion rocks the bunker - the steel door\n     bulges but holds fast. Only a wisp of smoke escapes.\n\n\n82   INT. WAR MINISTRY- FROMM'S OFFICE - DAY                   82\n\n     SOLDIERS burst into Fromm's office and arrest the\n     bewildered General without incident.\n\n                        BECK (V.O.)\n            Assuming Fromm refuses to join us,\n            Olbricht will take Command of the\n            Reserve Army and initiate Operation\n            Valkyrie.\n\n     Olbricht takes Fromm's place and starts making calls.\n     At least this is how it should happen...\n\n\n83   INT./EXT. BERLIN - VARIOUS - DAY                          83\n\n     Establishing shots of the idle troops and equipment\n     as they are once again called into action.\n\n                        BECK (V.O.)\n            Then he'll notify all district\n            commanders between Paris and Berlin\n            that the SS is attempting to seize\n            power. The Reserve Army will arrest\n            all SS, Gestapo and Nazi officials.\n\n     The same soldiers are now storming government\n     buildings and seizing personnel.\n\n                                                         69.\n\n\n\n\n84   INT. WAR MINISTRY - DAY                                   84\n\n     Witzleben and Beck march in with ARMED SOLDIERS.\n\n                        BECK (V.O.)\n            When the time is right, Witzleben\n            and I will arrive at the War\n            Ministry and assume the roles of\n            Commander of the Armed Forces and\n            Head of State, respectively.\n\n\n85   INT. RADIO STATION - DAY                                  85\n\n     Goerdeler stands at a radio microphone, reading\n     passionately from a prepared script with dramatic\n     gestures painfully reminiscent of Hitler.\n\n                        BECK (V.O.)\n            With Berlin secured, Goerdeler will\n            return and address the nation as\n            our new Chancellor. Then, God\n            willing, we can negotiate a truce\n            with the Allies and spare Europe\n            from total destruction.\n\n\n86   INT. SMOKY ROOM - DAY                                     86\n\n                            BECK\n            Gentlemen, this is the most\n            important day of your lives. Long\n            live sacred Germany.                                      \n\n     The conspirators salute and leave. Beck places both\n     hands on the table to support himself, coughing and\n     exhausted. Then he looks nervously at his watch...\n\n\n87   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY               87   \n\n     Olbricht paces before his desk. Mertz watches him,               \n     anxiously waiting for:\n\n                           MERTZ\n            Put the Reserve Army on standby                           \n            alert.\n\n                          OLBRICHT\n            Not until I hear from Stauffenberg.\n            Not until I'm sure.                                       \n\n                                                         70.\n\n\n\n                           MERTZ\n            But that's not what he-\n\n                          OLBRICHT\n            Noted, Colonel. Thank you.\n\n\n88   EXT. AIRFIELD - RASTENBURG - DAY                          88   \n\n     The plane touches down and taxis to a stop.\n     Stauffenberg and Haeften deplane and immediately step\n     into a waiting courier car driven by a young, dutiful\n     Nazi. SECOND LIEUTENANT KRETZ. Remember him.\n\n\n89   EXT. WOLF'S LAIR - DAY                                    89\n\n     Even this early, the heat is oppressive.\n\n     We watch from a distance as the courier car is\n     stopped at the outer checkpoint. Once again, the\n     GUARD carefully examines Stauffenberg and Haeften's\n     identification and takes their pistols before\n     allowing the car to pass. We follow.\n\n\n90   EXT. WOLF'S LAIR - KEITEL'S OFFICE - DAY                  90\n\n     Est. Field Marshal Wilhelm Keitel's office as the\n     courier car arrives.                                             \n\n     Stauffenberg and Haeften are greeted by Freyend who              \n     shows them to:                                                   \n\n\n91   INT. KEITEL'S OFFICE - WAITING ROOM - CONTINUOUS          91\n\n     TWO OFFICERS are already waiting. They stand...\n\n                          FREYEND\n            Gentlemen, may I present Colonel\n            Claus von Stauffenberg - Chief\n            Officer of the Reserve Army.\n\n                         OFFICER #1\n            Colonel Stauffenberg. This is an\n            honor. They say you're the man that\n            will defend Berlin from the Red\n            Army single-hand-\n\n     The officer realizes what a faux pas he has made as\n     soon as he says it. Unfazed, Stauffenberg smiles,\n     raising his briefcase with his single hand.\n\n                                                    71.\n\n\n\n                   STAUFFENBERG\n       Indeed. I've got the whole bag of\n       tricks right here.\n\nThe officers laugh nervously, relieved he was not\ninsulted. Idiots. Meanwhile, Freyend steps toward\nHaeften, reaching for the handle of his briefcase.\n\n                     FREYEND\n       Let me take that for you.\n\nBut Haeften snaps the case back. Freyend raises a\nsuspicious eye. Before he can press:                        \n\n                   VOICE (O.S.)                             \n       Colonel Stauffenberg?\n\nEveryone turns to find General Fellgiebel standing at       \nthe door. Everyone stands at attention.                     \n\n                    FELLGIEBEL                              \n       At east, Gentlemen.                                  \n                  (to Stauffenberg)                         \n       General Fellgiebel, communications.                  \n       I just wanted to meet the hero of                    \n       Africa... And see if there's                         \n       anything you need.                                   \n\n                   STAUFFENBERG\n       Yes, sir, there is. I'm expecting a                  \n       call of the utmost importance. Even                  \n       if it comes when I am in conference                  \n       with the Führer I'd appreciate it                    \n       if you had a man come and get me.                    \n\nBeat. Fellgiebel and Stauffenberg share an instant\nlook of understanding.\n\n                    FELLGIEBEL\n       Of course, Colonel.\n\nFellgiebel salutes. Stauffenberg and the others             \nreturn it as Fellgiebel departs. Just then, Keitel          \nbursts from his office, fixing his tie.\n\n                      KEITEL\n       Gentlemen. The meeting has been\n       pushed forward to 12:30. Mussolini\n       is arriving on the afternoon train\n       and Hitler wants to have lunch with\n       him.\n\nStauffenberg is excited by a potential bonus.\n\n                                                         72.\n\n\n\n                        STAUFFENBERG\n            Will Mussolini be in the briefing?\n\n                           KEITEL\n            I only wish he were. Then some\n            ambitious officer might take the\n            opportunity to shoot the dago\n            bastard.\n\n     Keitel makes a beeline for the door and the others\n     follow like good sheep. Stauffenberg holds back,\n     however, attracting Freyend's attention.\n\n                        STAUFFENBERG\n            I'll need a place to wash up -\n            change my shirt.\n\n     Stauffenberg points to the shaving cut on his throat\n     and the tiny blood stain on his shirt. The cut was\n     intentional after all.\n\n     Annoyed, Freyend motions to the adjoining anteroom.\n\n                          FREYEND\n            Please, do be quick. You heard the\n            General.\n\n     Stauffenberg nods in appreciation. He motions for\n     Haeften to follow him. Freyend watches, curious.\n\n\n92   INT. KEITEL'S OFFICE - CHANGING ROOM - DAY                92\n\n     Fast on Stauffenberg's heels, Haeften closes the\n     door. A large portrait of Hitler looms, watching.\n     Stauffenberg positions himself at a small desk with\n     his back to the door. He removes a brick of plastic\n     explosive from his briefcase.\n\n                          HAEFTEN\n                         (whispering)\n            You're arming them... now?                                \n\n     Stauffenberg quickly unbuttons his shirt, taking a\n     clean one out of his bag and putting it on as:\n\n     Haeften assembles a fuse.\n\n                       STAUFFENBERG\n            No room for error this time. Assume\n            I have ten minutes in this heat.\n\n                                                         73.\n\n                   STAUFFENBERG (CONT'D)\n            Two minutes for the walk, one for\n            the security check and one to the\n            bunker. Three minutes for the walk\n            back. That's seven.\n\n                          HAEFTEN\n            Leaving just three minutes to place\n            the bomb.\n\n                        STAUFFENBERG\n            Plenty of time.\n\n                          HAEFTEN\n            If the bomb goes off in ten.\n\n     He carefully inserts the fuse into the explosive.\n\n     The RING OF A TELEPHONE startles us.\n\n\n93   INT. KEITEL'S OFFICE - WAITING ROOM - DAY                 93\n\n     CLOSE ON THE TELEPHONE. Freyend answers.\n\n                          FREYEND\n            Major Freyend speaking.\n                            (beat)\n            Stauffenberg? Yes, he's arrived...\n            They are on their way now.\n\n     Freyend hangs up, glancing impatiently at his watch.\n\n\n94   INT. KEITEL'S OFFICE - CHANGING ROOM - DAY                94\n\n     Neatly dressed again, Stauffenberg carefully places\n     the primed explosive back in his briefcase. He and\n     Haeften turn their attention to the second explosive -\n     assembling the fuse, about to insert it when:\n\n     BANG. The door swings suddenly open - stopped short\n     by Stauffenberg's backside. He nearly drops the fuse.\n\n                        STAUFFENBERG\n            Dammit man, what is it?\n\n     It's Freyend, of course, trying to peer through the\n     partially opened door. Stauffenberg hides the bombs\n     with his body.\n\n                          FREYEND\n            General Keitel insists that the\n            Colonel please hurry.\n\n                                                         74.\n\n\n\n     Haeften scoops the unarmed explosive into his\n     briefcase. Stauffenberg motions for Haeften to leave.\n\n\n95   INT. KEITEL'S OFFICE - HALLWAY - DAY                      95\n\n     Haeften comes out, moving Freyend back with his body\n     and shutting the door behind him - a charged moment.\n\n                          HAEFTEN\n            The Colonel is changing, Major. You\n            understand this can be difficult.\n\n     Freyend backs down. A little.\n\n\n96   INT. KEITEL'S OFFICE - CHANGING ROOM - DAY                96\n\n     Stauffenberg produces a pair of pliers (one handle\n     specially bent for easier use by a man with only\n     three fingers). With some effort, he manages to\n     secure the pliers around the fuse.\n\n     CLOSE ON THE ACID CAPSULE OF THE FUSE. The jaws of\n     the pliers gently squeeze, crushing it. The bomb is\n     live. There is no turning back now.\n\n     Stauffenberg closes his briefcase and opens the door,\n     greeted by Freyend and Haeften.\n\n\n97   EXT. WOLF'S LAIR - OUTSIDE KEITEL'S OFFICE - DAY          97\n\n     Freyend scurries, trying to catch up with Keitel.\n     Stauffenberg and Haeften lag behind.\n\n                        STAUFFENBERG\n                         (to Haeften)\n            See that the car is ready.\n\n     Haeften looks down at the briefcase in his hand - the\n     second, unarmed explosive inside.\n\n                           HAEFTEN\n            But sir-\n\n                        STAUFFENBERG\n            I have everything I need,\n            Lieutenant. Thank you.\n\n     Haeften reluctantly takes his leave just as Freyend\n     turns back, eager for Stauffenberg to pick up the\n     pace. He reaches for the briefcase.\n\n                                                         75.\n\n\n\n                          FREYEND\n            Please. Let me help you with that.\n\n                        STAUFFENBERG\n                       (pulling it away)\n            I can manage, thank you.\n\n     Freyend seems more than just a little peeved. But\n     Stauffenberg doesn't notice. He is focused straight\n     ahead, mentally calculating what time he has left.\n\n     The bunker suddenly seems miles away.\n\n\n98   EXT. WOLF'S LAIR - OUTSIDE BUNKER - DAY                   98\n\n     Security Perimeter I. Keitel and his men file through\n     the heavily guarded entrance. Each man holds up his\n     pass for the GUARDS to inspect. Stauffenberg is last.\n\n     Keitel heads toward a wooden structure up ahead -\n     AWAY FROM THE BUNKER. Stauffenberg is confused.\n\n                        STAUFFENBERG\n            Where are they going?\n\n                          FREYEND\n            It's too hot. The briefing has been\n            moved to the conference hut.\n\n     ANGLE ON: The conference hut. The door and many\n     windows of the flimsy wooden structure are all open.\n     Not ideal for generating the deadly air pressure\n     vital to Stauffenberg's plan. But this obstacle only\n     seems to strengthen his resolve. He is a soldier\n     after all. And no military operation goes according\n     to plan. Making matters worse:\n\n                      FREYEND (CONT'D)\n            Sir, your briefcase. I insist.\n\n     Annoyed but not wanting to arouse suspicion,\n     Stauffenberg finally acquiesces, handing it over. He\n     watches Freyend carry the bomb into the hut. Pause.\n\n     Stauffenberg looks back over his shoulder to:\n\n     Fellgiebel - standing by the communications building.\n     The man who will get Stauffenberg out of the room\n     before the bomb goes off. They share a nod. Then\n     Stauffenberg steps into the hut.                                 \n\n                                                       76.\n\n\n\n\n99    INT. CONFERENCE HUT - HALLWAY - CONTINUOUS               99\n\n      In the room beyond we see Hitler at the end of a long\n      table surrounded by RANKING OFFICERS. One by one,\n      they present their individual briefings to the\n      nodding Führer. Stauffenberg whispers to Freyend.\n\n                         STAUFFENBERG\n             My injuries left me a bit hard of\n             hearing. See that you place me as\n             near the Führer as possible.\n\n      Freyend nods, but for now his concerns are elsewhere -\n      wrangling everyone into the meeting.\n\n      Like the other officers, Stauffenberg hangs up his\n      belt and hat on hooks at the entrance to the briefing\n      room. He catches sight of SERGEANT-MAJOR ADAM, the\n      conference hut's young telephone operator.\n\n                    STAUFFENBERG (CONT'D)\n             Sergeant. I'm expecting an urgent\n             call from Berlin...\n\n\n100   INT. CONFERENCE HUT - BRIEFING ROOM - DAY                100\n\n      A small room measuring 15 by 32 feet. Stifling heat.             \n      We notice again that the windows are open to let in\n      some air. Hitler and his officers hunch over a long,\n      heavy table covered in detailed maps of Eastern\n      Europe and the Soviet Union.\n\n      LIEUTENANTS and SERGEANTS continually tiptoe in and\n      out of the room. A GENERAL stands beside Hitler in\n      the middle of his briefing:\n\n                           GENERAL\n             The Eastern Front forces are\n             assured a victory... but they need\n             reinforcements.\n\n      In other words, they are getting pounded but he can't\n      say that. The General is relived to be interrupted by\n      Keitel's arrival. The briefing stops momentary as:\n\n                            KEITEL\n             Please pardon our tardiness... You\n             remember Colonel Stauffenberg?\n\n                                                   77.\n\n\n\nHitler makes a deliberate effort to shake\nStauffenberg's hand, their eyes lock - an unnerving\nmoment. Stauffenberg has come to kill this man\ngreeting him. The moment is broken when the General\nclears his throat, continuing his presentation.\n\n                     GENERAL\n       As you can see, Mein Führer, the\n       situation in the East Prussian\n       sector is increasingly critical...\n                 (and on and on...)\n\nFreyend startles Stauffenberg slightly when he takes\nhim by the arm, moving him to his place at the table -\nless than half a step from Hitler. He is squeezed in\nbetween two other officers. We suck in wind when we\nsee who one of them is...\n\nCOLONEL HEINZ BRANDT - the same Brandt who carried\nthe bottles of Cointreau onto Hitler's plane so long\nago. He still scribbles in his damn datebook.\n\nFreyend sets the briefcase beside Stauffenberg -\nbumping Brandt's leg. Brandt looks down at the\nbriefcase - long enough to make us nervous.\n\nHe watches as Stauffenberg nonchalantly bends down,\nsliding the briefcase as close to Hitler as possible,\nleaning it against the heavy wooden table support\nimmediately to the right of Hitler's foot.                 \n\nStauffenberg looks back at the open door, glances at\nhis watch. He can clearly see Sergeant Adam, the\ntelephone operator. Where is his God-damn phone call?\n\nAround him generals talk, Hitler nods, but we hear\nnothing. Only the pulse of Stauffenberg's heartbeat\nin his own ears - the only thing betraying his\notherwise outward calm.\n\nHe looks down at the briefcase - the bomb just under\nhis feet. He looks at Hitler nodding. The longer we\nstay, the more excruciating it is. So we milk it.\n\nStauffenberg is startled when a hand touches his arm.\nThe annoying Freyend is there, whispering in his ear.\nKeitel sees this, irritated by the interruption.\nStauffenberg makes a gesture to Keitel with his hand,\nindicating a phone call. Keitel is not pleased.\n\n                                                          78.\n\n\n\n\n101   INT. CONFERENCE HUT - HALLWAY - DAY                       101\n\n      Freyend leads Stauffenberg to Adam who offers the\n      telephone receiver.\n\n                             ADAM\n             General Fellgiebel, sir. He says\n             it's urgent.\n\n      Stauffenberg takes the phone and stares at Freyend\n      and Adam - they get the idea that this is a private\n      call and leave. When they are gone, Stauffenberg\n      simply lays the receiver down and walks out. Fast.\n\n      A moment later, Adam returns to the room. He sees the\n      receiver laying there. Odd. Looking down the hallway\n      he sees Stauffenberg quickly exiting the building.\n\n      Then he notices Stauffenberg's hat and belt still\n      hanging outside the briefing room.\n\n                        ADAM (CONT'D)\n             Colonel... Colonel, you forgot your-\n\n\n102   INT. CONFERENCE HUT - BRIEFING ROOM - DAY                 102\n\n      Hitler leans on his elbows carefully studying the map\n      before him as the General's presentation drags on.\n\n      Brandt moves in closer, filling the void left by\n      Stauffenberg. His foot hits something. He looks at:\n\n      Stauffenberg's briefcase as it falls over.\n\n      Slowly, Brandt reaches down, picking up the\n      briefcase, looking around for Stauffenberg. He\n      considers the bag for a moment and we are sure he is\n      going to open it.\n\n      But then he puts it back under the table. But now the\n      heavy wooden support is BETWEEN Hitler and the bomb.\n\n                           GENERAL\n             ...And now I believe Colonel\n             Stauffenberg will present us with\n             his deployment for the Replacement\n             Army should the unthinkable occur\n             and the Russians reach-\n\n      Where is Stauffenberg? Keitel shoots Freyend a look.\n\n                                                          79.\n\n\n\n\n103   INT. CONFERENCE HUT - HALLWAY - DAY                       103\n\n      Freyend steps into the hall. No sign of Stauffenberg.\n      Sergeant Adam approaches, looking confused.\n\n                           FREYEND\n             Where the hell is Stauffenberg?\n\n      But Adam shrugs, holding out Stauffenberg's hat.\n\n\n104   EXT. WOLF'S LAIR - COMMUNICATIONS BUILDING - DAY          104   \n\n      Fellgiebel and Haeften watch anxiously as\n      Stauffenberg clears the security checkpoint and walks\n      toward them, slow and deliberate - eerily calm.                   \n\n\n      INT. CONFERENCE HUT - BRIEFING ROOM - DAY                         \n\n      Hitler at the far end of the room, bent over the                  \n      conference table, leaning on his elbows.                          \n\n      A MASSIVE, EAR-SPLITTING EXPLOSION lifts the table                \n      up, throwing Hitler back and simultaneously                       \n      vaporizing the men standing on either side of him.                \n\n\n      EXT. WOLF'S LAIR - CONFERENCE HUT - DAY                           \n\n      The hut explodes outward like a house of cards.                   \n      Bodies are thrown clear. Everyone hits the deck\n      except Stauffenberg. He just keeps walking.                       \n\n      A great cloud of smoke billows from the ruins. The                \n      sky is alive with a swirl of burnt paper scraps and\n      ash. STUNNED OFFICERS are running about. Shouting.\n      Screaming. Absolute chaos.\n\n      Even knowing it was coming, Haeften is stunned.\n      Stauffenberg walks up to the communications building\n      and takes him by the arm, turning to Fellgiebel.\n\n                        STAUFFENBERG\n             Contact General Olbricht in Berlin.\n             Tell him Hitler is dead. Proceed\n             with Operation Valkyrie. Then sever\n             all communications.\n\n      Fellgiebel nods and rushes to make the call.\n      Stauffenberg leads Haeften to their waiting car -\n      still driven by young Lt. Kretz.\n\n                                                        80.\n\n\n      He too is stunned by the explosion - so much so that\n      he does not think to get out and open the door for\n      his passengers. Stauffenberg climbs in next to Kretz,\n      pushing Haeften in the back.\n\n                      STAUFFENBERG (CONT'D)\n                             (to Kretz)\n             Drive.\n                           (Kretz lingers)\n             LIEUTENANT.\n\n      Kretz snaps out of it and jams the car in gear,\n      speeding off down the forested trail. Stauffenberg\n      and Haeften look back for a clear view of the total\n      destruction. Bodies are carried out of the demolished\n      hut - the grounds littered with the wounded.\n\n      Surly there is no way the Führer could have survived.\n\n\n105   INT. COMMUNICATIONS HUT - DAY                           105\n\n      Fellgiebel holds a phone to his ear.\n\n                   FELLGIEBEL (INTO PHONE)\n             I said Olbricht. General Olbricht\n             at the War Ministry. The call is\n             urgent.\n\n      A breathless COMMUNICATIONS OFFICER enters, pointing\n      in mute shock to the ruin outside.\n\n                    COMMUNICATIONS OFFICER\n             What the hell just happened?\n\n                          FELLGIEBEL\n             What does it look like? The Führer\n             is-\n\n      Fellgiebel freezes, something catching his eye.\n\n      COME AROUND TO HIS P.O.V. Share his horror. Through\n      the window, Fellgiebel has a clear view of the\n      conference hut, or rather what's left.\n\n      HITLER - limping, dazed, his clothes in tatters - is\n      being led from the smoldering ruins. He is very much:\n\n                        FELLGIEBEL (CONT'D)\n             Alive...\n\n                                                           81.\n\n\n\n\n106   EXT. WOLF'S LAIR - INNER SECURITY CHECKPOINT - DAY         106\n\n      Kretz brings the car to a sudden stop at the first\n      checkpoint. A barricade is in place. A GUARD\n      approaches. Stauffenberg and Haeften hold up passes.\n\n                         STAUFFENBERG\n             We have to get to the airfield at\n             once. Orders form the Führer.\n\n      The guard signals his men to remove the barricade.\n\n\n107   INT. COMMUNICATIONS HUT - MOMENTS LATER                    107\n\n      Fellgiebel waits to be connected to the War Ministry\n      in Berlin. His Communications Officer awaits orders.\n      This makes it hard for Fellgiebel to speak plainly.\n      He plays up his distress for his audience.\n\n                   FELLGIEBEL (INTO PHONE)\n             I am calling from The Wolf's Lair\n             with urgent news for the General.\n             Something terrible has happened...\n\n      Then he turns his back, lowers his voice.\n\n                     FELLGIEBEL (CONT'D)\n                          (whispering)\n             The Führer is still alive.\n\n                       VOICE (ON PHONE)\n             I'm sorry. Please come again.\n\n      But Fellgiebel's officer is watching him, trying to\n      hear. Fellgiebel has no choice but to hang up.\n\n                          FELLGIEBEL\n             Sever all communications.\n\n                     COMMUNICATIONS OFFICER\n             Sir?\n\n                          FELLGIEBEL\n             DON'T ARGUE WITH ME, DAMMIT. JUST\n             DO IT.\n\n\n108   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY                108\n\n      Olbricht anxiously hovers over Mertz who shouts into\n      the phone.\n\n                                                    82.\n\n\n\n                      MERTZ\n       I didn't hear you. Come again.\n       Fellgiebel. FELLGIEBEL.\n\nBut it's no use. Mertz slowly hangs up the phone.\n\n                     OLBRICHT\n       Well, what did he say?\n\n                      MERTZ\n       I... couldn't be sure. It sounded\n       as though he said... Hitler is\n       still alive.\n\nOlbricht clinches his teeth and starts sweating.\n\n                     OLBRICHT\n       Get him back on the line.\n\n                      MERTZ\n       Sir... The bomb did go off. That\n       much was clear. Fellgiebel's next\n       step will be to sever all\n       communications.\n\nOlbricht is confused. Frozen.                               \n\n                  MERTZ (CONT'D)\n       Colonel Stauffenberg was explicit.\n       We initiate Valkyrie regardless.\n\n                     OLBRICHT\n       Only Fromm can initiate. You know\n       that.\n\n                      MERTZ\n       Then lie. Tell him Hitler's dead.\n       Or arrest him. But do it now.                        \n\nBut Olbricht is frozen.\n\n                  MERTZ (CONT'D)\n       Sir... Did you hear me? You have to\n       give the order to initiate\n       Valkyrie. This is our only-\n\n                     OLBRICHT\n       I'm not doing anything until I talk\n       to Fellgiebel. Get him back on the\n       phone. NOW.\n\nMertz shakes his head bitterly and dials, but he'll\nnever get through.\n\n                                                           83.\n\n\n\n\n109   EXT. WOLF'S LAIR - OUTER SECURITY CHECKPOINT - DAY         109\n\n      Stauffenberg's car presses on through the woods\n      toward the last security checkpoint, but numerous new\n      road barriers are in place. This is not good.\n\n      One SERGEANT KOLBE and TWO ARMED SOLDIERS step from\n      the guardhouse, signalling Kretz to stop.\n\n                            KOLBE\n             No one gets in or out.\n\n                         STAUFFENBERG\n             We're on orders from the Führer. We\n             have to get to the airfield\n             immediately. You will step aside.\n\n                            KOLBE\n             I'm sorry, sir, but my orders are-\n\n      Stauffenberg steps out of the vehicle and makes a\n      beeline for the guardroom. Kolbe races after him.\n\n\n110   INT. GUARDROOM - CONTINUOUS                                110\n\n      Stauffenberg snatches up the telephone before Kolbe\n      and his men can stop him.\n\n                         STAUFFENBERG\n             Get me General Keitel.\n\n      Stauffenberg wipes a single bead of sweat from his\n      brow. With the guards hovering over him, he turns and\n      casually sits on the desk, blocking the phone with\n      his body. He surreptitiously rests his hand on the\n      telephone cradle, hanging up. He talks to no one.\n\n                    STAUFFENBERG (CONT'D)\n             Yes... General Keitel. Stauffenberg\n             here. I can't get past the outer\n             gate. A Sergeant...\n\n      He looks at Kolbe. Kolbe swallows.\n\n                             KOLBE\n             Kolbe.\n\n                         STAUFFENBERG\n             Sergeant Kolbe says no one is\n             getting out... Yes. Yes. Maybe you\n             can explain it to him.\n\n                                                        84.\n\n\n\n      Stauffenberg holds out the phone - staring hard,\n      bluffing harder. Kolbe considers the phone. Finally:\n\n                             KOLBE\n              That won't be necessary, Colonel.\n\n\n111   EXT. WOLF'S LAIR - OUTER SECURITY CHECKPOINT - LATER    111\n\n      A humiliated Kolbe watches Stauffenberg's car speed\n      away from the open barriers. Free.\n\n\n112   INT. CAR - DAY                                          112\n\n      Silence but for the chattering engine. Kretz is\n      distracted by movement in the rearview mirror.\n\n      P.O.V. IN REARVIEW MIRROR. Haeften rummages through\n      his briefcase, removing objects Kretz can't make out\n      - tossing them, one by one, into the woods. Haeften\n      realizes he is being watched by Kretz in the mirror\n      and shoots him a look. \"Mind your own business.\"\n\n      Kretz returns his attention to the road. But\n      something just isn't sitting right with him...\n\n\n113   EXT. AIRFIELD - RASTENBURG - DAY                        113\n\n      TITLES: 1:15 PM.\n\n      Stauffenberg and Haeften climb aboard a waiting\n      plane. A beat later it is rolling down the runway.\n\n                          MERTZ (V.O.)\n              Every second we stand here arguing\n              is a second lost.\n\n\n114   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY             114\n\n      Olbricht is calm - in full denial. He straightens his\n      tie in the mirror as Mertz paces the room, flustered.\n\n                            OLBRICHT\n              I can't initiate Valkyrie without\n              confirmation that Hitler's dead.\n              It's too great a risk.\n\n                                                       85.\n\n\n\n                            MERTZ\n             What about Stauffenberg? What about\n             his risk? He did his part and now\n             you're abandoning him.\n\n                           OLBRICHT\n             Watch yourself, Colonel.\n\n                            MERTZ\n             Shouldn't you be consulting Beck?\n\n                           OLBRICHT\n             I know just what Beck will say.\n             He's a dying man. What does he have                     \n             to lose?\n\n      He puts on his hat and coat now, turning to leave.\n\n                            MERTZ\n             At least put the Reserve Army on\n             alert.\n\n                          OLBRICHT\n             I can't cover up another false\n             alarm. When Stauffenberg returns,\n             when he gives me confirmation. Then                     \n             we'll proceed.                                          \n\n      Mertz is speechless. As Olbricht walks out:\n\n                            MERTZ\n             And where are you going?\n\n                           OLBRICHT\n             The same place you are. Lunch.\n\n\n115   INT. KEITEL'S OFFICE - DAY                             115\n\n      Keitel sits at his desk, listening intently to\n      someone O.S. Although his wounds are superficial, he\n      certainly took a beating in the blast.\n\n      PULL BACK TO REVEAL:\n\n                             ADAM\n             The one-eyed Colonel...\n\n                             KEITEL\n             Stauffenberg.\n\n                                                          86.\n\n\n\n                             ADAM\n             He left the building very abruptly -\n             just before the explosion.\n\n                            KEITEL\n             Several men left the building\n             before the explosion.\n\n                             ADAM\n             Yes, sir. Of course. But...\n\n                            KEITEL\n             But what? Spit it out, man.\n\n                             ADAM\n             Well. The Colonel left his hat.\n\n      Keitel's expression sours. \"Is that all you've got\n      for me?\" He is about to say so when that prick\n      Freyend barges in, also banged up. With him is Kretz -\n      Stauffenberg's driver.\n\n                           FREYEND\n             Pardon the intrusion, sir, but I\n             think you will be most interested\n             to hear what this man has to say.\n\n\n116   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY               116\n\n      TITLES: 2:00 PM.\n\n      Forty-five precious minutes have slipped away.\n\n      Mertz sits alone at Olbricht's desk, lighting a fresh\n      cigarette with the remains of another. The ashtray\n      says he's been at this for quite a while. He stares\n      at the clock, as if attempting to will time forward.\n\n      His eyes sweep across Olbricht's desk, past his\n      files, his stationery, framed photographs of his\n      family. Then he looks up at a portrait of Hitler.\n\n      Mertz is struck suddenly with a notion. He looks\n      again at Olbricht's desk. His stationery...\n\n      \"Fuck it.\"\n\n      He grabs the stationery and feeds it into a\n      typewriter.\n\n                                                        87.\n\n\n\n\n117   INT. WAR MINISTRY - COMMUNICATIONS OFFICE - DAY         117\n\n      Mertz approaches a LOWLY TELECOMMUNICATIONS OPERATOR.\n      Awkward pause. A struggle with the soul. Then he\n      hands over a sheet of paper.\n\n                            MERTZ\n             Orders from General Olbricht.\n\n      CLACK-CLACK-CLACK-CLACK-CLACK...\n\n\n118   INT. CENTRAL COMMUNICATIONS - BERLIN - DAY              118\n\n      Again we are inside the nerve center of Nazi\n      communications. Again the teletypes busily chatter\n      away. And again, Sgt. Helm is curious, watching:\n\n      STANDBY FOR OPERATION VALKYRIE...\n\n      The TELETYPE OPERATOR looks up at Helm. \"What do I\n      do?\" Helm glances over his shoulder to the uptight\n      Lt. Haan - oblivious. Helm shrugs.\n\n                             HELM\n             Send it through. But keep me\n             informed.\n\n      A SHRILL WHISTLE takes us to...\n\n\n      EXT. BERLIN - VARIOUS - DAY                                     \n\n      Once again RESERVISTS and CADETS rush to their homes            \n      and scramble to put on their uniforms.                          \n\n\n119   EXT. DEUTSCHLAND GUARD BATTALION - DAY                  119\n\n      The siren, the sculpted eagle and swastika, the                 \n      pillared stronghold. Tanks and heavy equipment are              \n      once again made ready.                                          \n\n      General Hase issues the alert signal just as he did\n      before, watching the men of the Reserve Army\n      scramble. In the melee we find Lieutenant Hagen.\n\n                            HAGEN\n             Here we go again.\n\n      He says this to:\n\n                                                         88.\n\n\n\n      Major Remer, the man who was so suspicious last time\n      is even more suspicious now.                                     \n\n\n121   EXT. WOLF'S LAIR - CONFERENCE HUT - DAY                  121\n\n      A light drizzle. A man jabbering in Italian O.S.\n\n      We get our first good look at the demolished briefing\n      hut. That anyone survived is a miracle. Officers\n      crowd around the smoldering ruins, the Führer himself\n      heading this procession. He wears new clothes,\n      nodding, smiling politely to the jabbering Italian\n      O.S. A slight wince is the only indication that he\n      was damn near blown to bits just hours ago.\n\n      COME AROUND TO REVEAL none other than BENITO\n      MUSSOLINI speaking an incessant stream of Italian.\n\n      HITLER'S P.O.V. Blissful silence. Mussolini's\n      blathering falls literally on deaf ears.\n\n\n122   EXT. AIRFIELD - RANGSDORF - DAY                          122\n\n      TITLES: 3:15 PM.\n\n      Three hours have passed since the explosion.\n      Stauffenberg and Haeften alight from the plane. The\n      airfield is surprisingly calm. No car to meet them.\n\n                          STAUFFENBERG\n              Quiet, isn't it?\n\n      Too quiet.\n\n                            HAEFTEN\n              I'll see where our driver is.\n\n      Haeften walks over to the office. Stauffenberg looks\n      around the airfield. The silence slowly becomes\n      unnerving. He goes after Haeften.\n\n\n123   INT. AIRFIELD OFFICE - DAY                               123\n\n      Stauffenberg enters just in time to hear:\n\n                      HAEFTEN (INTO PHONE)\n              You mean to tell me that the alert\n              is only just going out-\n\n      Stauffenberg swipes the phone from Haeften.\n\n                                                       89.\n\n\n\n                  STAUFFENBERG (INTO PHONE)\n             This is Stauffenberg. Get me\n             General Olbricht.\n\n\n124   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY            124\n\n      Olbricht storms in, furious. He stands over Mertz,\n      waving a document in his face - the very same\n      document Mertz typed on Olbricht's stationery.\n\n                             OLBRICHT\n             Explain this.\n\n                            MERTZ\n             Someone had to do something while\n             you were playing dead.\n\n                           OLBRICHT\n             We don't know that the Führer is\n             not alive. We don't know any-\n\n                            MERTZ\n             THIS IS ABOUT GERMANY, FOR GOD'S\n             SAKE. NOT YOU. BE A MAN.\n\n      Before a fuming Olbricht can respond, the phone\n      rings. Both men look at it - Olbricht is afraid to\n      answer. Mertz shakes his head and picks up.\n\n                        MERTZ (CONT'D)\n             General Olbricht's office.\n\n      He looks at Olbricht grimly, holding out the phone.\n\n                        MERTZ (CONT'D)\n             Stauffenberg for you, sir.\n\n      Olbricht would rather take a live cobra than handle\n      the phone right now. But take it he does.\n\n\n125   INT. AIRFIELD OFFICE - CONTINUOUS                      125\n\n      (Note: Intercut between Olbricht and Stauffenberg.)\n\n                         STAUFFENBERG\n             It's been three hours, Olbricht.                        \n             What the hell have you been doing?                      \n\n                           OLBRICHT\n             We've had no confirmation that-                         \n\n                                                 90.\n\n\n\n                   STAUFFENBERG\n       Dammit man, I saw the explosion                    \n       myself. Nothing else matters now.\n       We are committed.\n\nOlbricht sits, color draining from his face. A real\n\"what have I done\" moment.\n\n                       OLBRICHT\n       Dear God.\n\n                   STAUFFENBERG\n       Now where is Fromm? Is he with us\n       or did you-\n\n                     OLBRICHT\n       I- No one has spoken to him yet.\n\nStauffenberg pounds his fist on the wall, furious -       \nfor the first and only time showing us a crack in his     \nultra-cool exterior. He collects himself and looks at     \nhis watch.\n\n                   STAUFFENBERG\n       Listen to me, Olbricht. Never mind\n       Germany. Never mind Europe. Your\n       life is at stake now, do you\n       understand? If you want to live\n       through the night you'll do exactly\n       as I say.\n\n                       OLBRICHT\n       I understand.\n\n                   STAUFFENBERG\n       The second you hang up the phone,\n       initiate Operation Valkyrie in\n       Fromm's name. Then go over to his\n       office in force, give him the\n       choice to join us or place him\n       under immediate arrest. Do I make\n       myself perfectly clear?\n\n                       OLBRICHT\n       I understand.\n\n                  STAUFFENBERG\n       I am at the airfield now. I will be\n       in Fromm's office in fifteen\n       minutes. Be there when I arrive.                   \n\nHe slams the phone down, taking us to:                    \n\n                                                       91.\n\n\n\n\n126   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY             126\n\n      Silence. With shaking hands, Olbricht moves the\n      portrait of Hitler, exposing a hidden wall safe from\n      which he removes, at last, a thick folder marked:\n\n      VALKYRIE\n\n      He looks at Mertz.\n\n                           OLBRICHT\n             Get Beck and the others. Tell them                       \n             it's time.\n\n      Relieved, Mertz nods and rushes out. Olbricht picks\n      up the phone and dials. After a beat, he reads from\n      the first page of the Valkyrie order.\n\n                      OLBRICHT (CONT'D)\n             This is General Olbricht calling on\n             behalf of General Fromm - Commander\n             of the Home Army. Adolf Hitler, is                       \n             dead. A group of radicals from the                       \n             SS are attempting to seize control\n             of the government. Operation\n             Valkyrie is in effect. All military\n             districts, training schools and\n             replacement troops are to take\n             control of essential government\n             offices at once...\n\n      CLACK-CLACK-CLACK-CLACK-CLACK...\n\n\n127   INT. CENTRAL COMMUNICATIONS - BERLIN - DAY              127\n\n      Lt. Haans sits at his desk, sensing someone over his\n      shoulder. He turns to find Sgt. Helm, a sheet of\n      paper in his trembling hands.\n\n                             HELM\n             The Führer is dead.\n\n      Skeptical, Haans snatches the paper from Helm. When\n      he looks up, the entire staff is looking at him, some\n      with tears in their eyes - others perhaps hiding a\n      sense of relief.\n\n      A phone rings. Then another. The chattering teletypes\n      seem to surge into another gear as news of Hitler's\n      death starts to spread.\n\n                                                       92.\n\n\n\n      Long pause. Haans struggles with the sheer size of\n      the moment.\n\n                            HAANS\n             You all know your jobs. Get to\n             work.\n\n      Zombie-like, the Operators go back to their\n      teletypes, passing orders along.\n\n      But one Operator - the one Helm asked to keep him\n      informed - notices something strange about one order            \n      in a stack of many he is sifting through.                       \n\n                           OPERATOR\n             Sergeant. This order is signed by\n             Witzleben.                                               \n\n                             HELM\n                       (taking the paper)\n             That's ridiculous. He`s not even in\n             the army anymore.\n\n      But sure enough, there is Witzleben's name. Strange.\n      Helm looks over at the devastated Haans, wondering\n      how to handle this. Then, like a good little Nazi:\n\n                        HELM (CONT'D)\n             Pass the order along.\n\n\n128   EXT. DEUTSCHLAND GUARD BATTALION - DAY                  128\n\n      RESERVE SOLDIERS are marched into readiness. Vehicles\n      moved into place. As they await further orders...\n\n                         FROMM (V.O.)\n             Who told you the Führer was dead?\n\n\n129   INT. WAR MINISTRY - FROMM'S OFFICE - DAY                129\n\n      Mertz and a sheepish Olbricht stand before Fromm. A\n      stunned Lt. Herber hovers by the door.\n\n                           OLBRICHT\n             General Fellgiebel. At the Wolf's\n             Lair.\n\n      Fromm is at a loss for words. This just can't be so.\n      He picks up the phone.\n\n                                                         93.\n\n\n\n                     FROMM (INTO PHONE)\n             This is Fromm. Put me through to\n             The Wolf's Lair.\n\n                           OLBRICHT\n             There's no use calling, all\n             communication lines are-\n\n                      FROMM (INTO PHONE)\n             Yes. General Fromm for Field\n             Marshal Keitel. Urgent.\n\n      Mertz and Olbricht are shocked that he got through.              \n\n\n130   INT. WOLF'S LAIR - KEITEL'S OFFICE - DAY                 130\n\n      Keitel is still nursing a few wounds.\n\n                       FROMM (ON PHONE)\n             What's going on up there? The most\n             incredible rumors are circulating\n             in Berlin.\n\n      Immediately suspicious, Keitel plays dumb, leading...\n\n                            KEITEL\n             I don't know what you mean.\n             Everything's in order here.\n\n      Keitel looks out the window at the still smoldering\n      ruins of the conference hut in the distance.\n\n                            FROMM\n             There's talk the Führer's been\n             assassinated.\n\n                            KEITEL\n             Another failed attempt. The Führer\n             was never in danger.\n                             (beat)\n             By the way, where is your man\n             Colonel Stauffenberg?\n\n\n131   INT. WAR MINISTRY - FROMM'S OFFICE - DAY                 131\n\n                            FROMM\n             Stauffenberg? On his way back to\n             Berlin, I should think.\n\n      At the very mention of his name, Olbricht starts\n      squirming.\n\n                                                 94.\n\n\n\n                KEITEL (ON PHONE)\n       Let me know when he arrives. I'd\n       like a word with him.\n\n                       FROMM\n       Certainly.\n\nClick. After a beat, Fromm hangs up, smug.\n\n                  FROMM (CONT'D)\n       A false alarm. The Führer is fine.\n\nHerber's outward relief stands in sharp contrast to\nOlbricht's barely contained dread. Then:\n\n                   VOICE (O.S.)\n       That's a lie.\n\nAll eyes turn to see Stauffenberg and Haeften appear\nin the doorway. Mertz lets out a sigh of relief as\nthey push their way past Herber and march into the\nroom.\n\n                   STAUFFENBERG\n       Hitler is dead. Operation Valkyrie\n       is in effect.\n\nFromm stands, pounding his fist on the desk.\n\n                      FROMM\n       OPERATION VAL- WHO GAVE THE ORDER?\n\n                    STAUFFENBERG\n       You did.\n\n                      FROMM\n       THIS IS NOTHING LESS THAN TREASON.\n\n                   STAUFFENBERG\n       Be that as it may, the Reserve Army\n       is assuming control here in Berlin.\n       We trust you'll join us.\n\n                      FROMM\n       Dammit, man. Do you realize what\n       you've done? The Führer is a-\n\n                   STAUFFENBERG\n       I delivered the bomb myself. I saw\n       the blast. He is dead.\n\nFromm is stunned on several levels. He slowly sits\nback in his chair.\n\n                                                       95.\n\n\n\n      CLOSE ON: Lt. Herber, who sees Stauffenberg as the\n      model Nazi, is more shocked by this than the news of\n      Hitler's death.\n\n                            FROMM\n             This can't be happening. It's some\n             kind of joke.\n\n                         STAUFFENBERG\n             Are you with us or not?\n\n                            FROMM\n             Colonel, if what you say is true\n             you should shoot yourself at once.\n                         (to the others)\n             The rest of you are under arrest.\n\n                         STAUFFENBERG\n             No, General. You are.\n\n      And with those words, Haeften and Mertz draw their\n      pistols, training them on the confused Fromm. Herber\n      is paralyzed - unsure of what to do.\n\n                            FROMM                                    \n             I don't know where you think this                       \n             is going, but I suggest you men                         \n             change into civilian clothes and                        \n             find a place to hide.                                   \n\n                         STAUFFENBERG\n                          (to Haeften)\n             Lock him upstairs in his private\n             quarters. Make sure his phone lines\n             are cut.\n\n\n132   INT. WAR MINISTRY- HALLWAY - DAY                       132\n\n      Stauffenberg, Mertz and Olbricht march with great\n      purpose. They are joined by Beck, coming the other\n      way, wearing a plain dark suit. It is moving to see\n      the old man manage the long walk.\n\n                         STAUFFENBERG\n             You're not in uniform.\n\n                             BECK\n             This has to be seen as a movement\n             of the people.                                          \n\n      Then he takes Stauffenberg's arm, letting Mertz and            \n      Olbricht walk on, lowering his voice.                          \n\n                                                       96.\n\n\n\n                        BECK (CONT'D)                                 \n             You're certain he's dead.                                \n\n      Certain? Stauffenberg can see the private fear in               \n      beck's eyes. But before he can answer, he is                    \n      interrupted by a gasp O.S. as Olbricht opens the door           \n      to his office, stepping back in shock. The others\n      turn to see what it is...\n\n\n133   INT. WAR MINISTRY - OLBRICHT'S OFFICE - DAY             133\n\n      Looking out at the shocked faces of Olbricht, Mertz,\n      Beck and Stauffenberg. PULL BACK TO REVEAL:\n\n      Olbricht's office is packed to the four walls with\n      GERMAN OFFICERS - all of them standing in silence,\n      looking at the leaders of the Resistance with great\n      respect. Stauffenberg walks in and the crowd parts,\n      solemn and silent, nodding and whispering thanks.\n\n      A YOUNG OFFICER steps forward. He looks hauntingly\n      like the Lieutenant who drove Stauffenberg in Africa.\n\n                        YOUNG OFFICER\n             Colonel Stauffenberg, sir. We're\n             reporting for duty.\n\n      Stauffenberg is moved beyond words. Suddenly, what\n      was once a small clutch of discarded generals and\n      politicians is now a movement of motivated men.\n      Stauffenberg nods, collects himself. In the crowd he\n      finds Helldorf, the head of the Berlin Police, whom\n      we met earlier. At first he speaks quietly, humbled.\n\n                        STAUFFENBERG\n                         (shaking hands)\n             Helldorf, I'm... glad to see you.\n             We're getting a late start and we\n             need all of the manpower we can\n             muster. Can we count on the police?                      \n\n                          HELLDORF\n             There's a lot of talk that Hitler                        \n             isn't really dead. Is this true?                         \n\n      Awkward pause. Good question. The men in the room               \n      share nervous glances. Then all eyes on Stauffenberg.           \n\n                         STAUFFENBERG\n             I can't offer you any guarantees.                        \n             The decision is yours and yours\n             alone. Can we count on you?\n\n                                                         97.\n\n\n\n      Long pause. PAN ACROSS the uneasy faces of the men in\n      the room, perhaps all of them waiting to see what\n      Helldorf does before making their decisions. Finally:\n\n                             HELLDORF\n             I'm with you.\n\n      Stauffenberg can barely hide his relief. There is a\n      palpable shift in the room. One by one, the officers\n      in the room reaffirm their commitment to the coup.\n\n                         STAUFFENBERG\n             Have your men surround the\n             building. No one gets in or out of                        \n             here without my permission.                               \n                         (to the others)\n             I want every available soldier on\n             task - we need simultaneous control\n             of every government building in the\n             city. Dismissed.\n\n      The soldiers move, but Beck's voice stops them -\n      surprisingly loud and clear for a sick old man.\n\n                             BECK\n             Acts of vengeance will not be\n             tolerated. We represent a different\n             form of government. We represent\n             what is good and just in Germany.                         \n\n      AN EXPLOSION OF ACTIVITY:                                        \n\n\n135   INT. WAR MINISTRY - STAUFFENBERG'S OFFICE - DAY          135\n\n      Stauffenberg stands at his cluttered desk, a flurry\n      of activity surrounding him. He is frantically\n      speaking into the phone and to those present.\n\n                        STAUFFENBERG\n             ...Deploy troops to seize and\n             protect all Reich agencies. Of most\n             importance are communication\n             centers - newspapers, radio\n             stations, telephone and telegraph\n             offices. All Nazi officials and\n             government leaders are to be\n             arrested at once...                                       \n\n                                                         98.\n\n\n\n\n136   INT. MILITARY COMMANDANT'S OFFICE - BERLIN - DAY         136\n\n      General Hase, the Berlin Commandant, stands before a             \n      giant map of Berlin, addressing a roomful of NAZI\n      OFFICERS.\n\n                             HASE\n             ... Completely blockade the                               \n             government quarters. Everything\n             from the Brandenburg Gate to\n             Potsdamer Platz. Nobody, not even\n             generals or ministers, should be\n             allowed to pass.\n                              (beat)\n             You have your orders, gentlemen.\n\n      Again, we focus on Major Remer, Commander of the\n      Deutschland Guard Battalion and always suspicious.\n\n                        HASE (CONT'D)\n             Is there a problem, Major?\n\n                            REMER\n             It just all seems very... vague,\n             sir. Protocol dictates we should\n             receive orders in writing-\n\n                            HASE\n             These are the orders as they were\n             presented to me, Major. Now move.\n\n      Pause. Just before the pause becomes insolent, Remer\n      clicks his heels and salutes, leaving. But the look\n      on his face tells us he's hatching a plan of his own.\n\n      You are right to be nervous.\n\n\n137   EXT. GOVERNMENT QUARTERS - BERLIN - VARIOUS - LATER      137\n\n      The city center is abuzz with soldiers and military\n      vehicles as they frantically cordon off the streets.\n\n      SOLDIERS come out of various government buildings\n      with SEVERAL NAZI GENERALS in custody, hands bound.\n      They push them into waiting trucks.\n\n      Meanwhile, PASSING CIVILIANS walk quickly by, trying\n      to pretend they don't see anything. Years of Nazi\n      rule have told them to mind their own business.\n\n                                                          99.\n\n\n\n      ANGLE ON: A staff car - Major Remer in the back,\n      watching the entire scene with cold eyes. Lt. Hagen\n      emerges from the chaos on the streets.\n\n                            HAGEN\n             Major Remer. We've just had orders\n             from the War Ministry. The\n             battalion is to blockade the\n             government quarter and place\n             Minister Goebbels under arrest.\n\n      Remer does not move. He just thinks.\n\n                        HAGEN (CONT'D)\n             What is it, Major?\n\n                            REMER\n             Something just doesn't feel right\n             about this. I would hate to find\n             out I'm being taken advantage of.\n\n                             HAGEN\n                           (realizing)\n             A coup you think?\n\n                            REMER\n             Of that I am certain. What I can't\n             say is which side we're on. Get in.\n\n      As Hagen does, Remer turns to his DRIVER.\n\n                        REMER (CONT'D)\n             Take us to the Reichministry. Be\n             quick about it.                                            \n\n\n140   INT. WAR MINISTRY - FROMM'S OFFICE - DAY                  140\n\n      Stauffenberg, Beck and Olbricht lead a continued\n      effort to manage the coup. Each man shouts orders\n      into the phone, all the while signing dispatches sent\n      by a steady flow of RUNNERS.                                      \n\n      FRAULEIN VON OVEN (the secretary who worked with                  \n      Stauffenberg and Tresckow to compile the Valkyrie\n      orders) rushes in, whispering to Stauffenberg.                    \n\n                        STAUFFENBERG                                    \n             Send him in.\n                        (Oven hesitates)\n             It's all right. Send him in.\n\n                                                100.\n\n\n\nShe opens the door and motions to someone outside.\nAfter a beat, the door is filled with an almost\nclassic looking Nazi - A FAT GENERAL bristling with\nmedals. He enters the room, confused when he sees\nOlbricht at Fromm's desk.\n\n                   FAT GENERAL\n       Begging your pardon, but I have\n       orders to report to General Fromm.\n\n                     OLBRICHT\n       General Fromm is no longer in\n       command. I am.\n\n                    FAT GENERAL\n       I...\n                    (seeing Beck)\n       Beck? What are you- What is going\n       on here?\n\n                   STAUFFENBERG\n       The Führer is dead. The SS is\n       staging a coup. We've initiated\n       Operation Valkyrie to crush the\n       uprising and save Hitler's Germany.\n\nThe Fat General assesses the scene with suspicion.\n\n                   FAT GENERAL\n       I'd say there is a coup all right,\n       but it's not the SS.\n\nOlbricht offers a sheet of paper.\n\n                     OLBRICHT\n       You will present these orders to\n       your troops.\n\n                   FAT GENERAL\n       I will do no such thing without\n       speaking to General Fromm. I swore\n       an oath-\n\n                   STAUFFENBERG                           \n       You have your orders. Join us or                   \n       face the consequences.\n\nStauffenberg and Olbricht take an imposing step in\nthe Fat General's direction. He carefully backs away.\n\n                                                        101.\n\n\n\n                          FAT GENERAL\n             This is treason. I won't take part.\n             The Führer is not dead. THE FÜHRER\n             IS NOT DEAD.\n\n      The Fat General makes a break for it. The\n      conspirators chase him out into...\n\n\n141   INT. WAR MINISTRY - HALLWAY - CONTINUOUS                 141\n\n      The Fat General pushes past ONLOOKING OFFICERS.\n\n                           OLBRICHT\n             STOP THAT MAN.\n\n      But they just watch the commotion, stunned. A ranking\n      general being chased like a common criminal. Surreal.\n\n      Haeften and Mertz appear at the other end of the hall\n      - pistols raised, blocking the General's path. With\n      Stauffenberg and Olbricht they overpower the Fat\n      General who screams wildly to the amazement of the\n      gawking officers.\n\n                         FAT GENERAL\n             THE FÜHRER IS NOT DEAD. I'VE SWORN\n             AN OATH. YOU ALL HAVE...\n\n      When they have him under control, Stauffenberg turns\n      to the onlookers. He finds a familiar face in the\n      crowd. A face he can trust. He finds:\n\n                         STAUFFENBERG\n             Lt. Herber. Come here.\n\n      ANGLE ON: Lt. Herber. \"Who, me?\" He reluctantly steps\n      forward.\n\n                    STAUFFENBERG (CONT'D)\n             Lock him up with Fromm.\n\n      Herber hesitantly takes hold of the General, but the             \n      act of taking a General into custody is a strange                \n      one. Herber is clearly conflicted.                               \n\n\n142   EXT. REICHMINISTRY - DAY                                 142\n\n      Est. Remer arrives, followed by a wave of trucks.\n      Soldiers deploy, surrounding the building.\n\n                                                      102.\n\n\n\n\n143   INT. REICHMINISTRY - GOEBBELS' OFFICE - DAY             143\n\n      Propaganda Minister Goebbels - the most ghoulish of\n      Hitler's Big Six. His spooky, deep-set eyes watch the\n      action on the street below. Already he can hear\n      troops coming down the hallway. He takes a pistol\n      from his desk drawer and leaves it within reach. Then\n      he picks up the phone and dials. After a beat.\n\n                           GOEBBELS\n             I am ready to be connected.\n\n      The sound of footsteps outside his door. It bursts\n      open. Remer enters, followed by ARMED SOLDIERS.\n\n                      GOEBBELS (CONT'D)\n             What can I do for you, Major?\n\n                            REMER\n             Minister Goebbels, my battalion has\n             an order to blockade the government\n             quarter and place you under arrest.\n\n      Remer sees the pistol on Goebbels desk. But Goebbels\n      makes no attempt to grab for it. Instead:\n\n                           GOEBBELS\n             Are you a dedicated Nazi, Major?\n\n      Remer is caught off guard.\n\n                             REMER\n             Yes, sir.\n\n      With that Goebbels turns his attention to the phone\n      in his hand. We hear a faint voice: \"Hello?\"\n\n      With an eerie smile, Goebbels simply extends his arm,\n      offering the phone to a confused Remer. Silence as\n      the Major takes it, holding it to his ear...\n\n                         REMER (CONT'D)\n             Hello?\n\n                       VOICE (ON PHONE)\n             Do you recognize my voice?\n\n      Remer is in awe, for a moment unable to speak. Then:\n\n                            REMER\n             Of course, Mein Führer.\n\n                                                      103.\n\n\n\n                      HITLER (ON PHONE)\n             Then listen to me very carefully...\n\n\n144   INT. CENTRAL COMMUNICATIONS - BERLIN - DAY              144\n\n      The communications staff busily connects calls and\n      transmits orders. Sgt. Helm gingerly approaches Lt.\n      Haans with two sheets of paper.\n\n                            HAANS\n             What is it now, Sergeant?\n\n                             HELM\n             It's just that now we're getting\n             conflicting orders, sir. The Wolf's\n             Lair says one thing, Stauffenberg\n             another.\n\n      Haans sighs, genuinely irritated now.\n\n                            HAANS\n             Our job is not to interpret the\n             orders. Our job is to pass them\n             along. Regardless.\n\n                              HELM\n             Yes, but sir-\n\n                            HAANS\n             Is that perfectly clear, Sergeant?\n\n      Haans thrusts the orders back at Helm who sheepishly\n      walks back to his pool of radio operators.\n\n\n145   EXT. REICHMINISTRY - DUSK                               145\n\n      As day turns to night, the soldiers surrounding the\n      government quarters wait for further orders.\n\n      Major Remer comes out a new man - invigorated and\n      focused. He walks over to a truck loaded with RANKING\n      PRISONERS, turning to the soldiers guarding them.\n\n                             REMER\n                         (re: prisoners)                              \n             Release these men at once.                               \n\n                            HAGEN\n             But these men are part of a coup.                        \n\n                                                      104.\n\n\n\n                            REMER\n             I've just been on the phone with\n             Hitler himself. We are the coup,\n             you idiot. We've been duped.\n\n\n146   INT. WAR MINISTRY - FROMM'S QUARTERS - NIGHT            146\n\n      Fromm is a prisoner in his own quarters - staring at\n      a portrait of Hitler with equal parts disdain and\n      reverence. The door suddenly opens.\n\n      Herber enters, leading the handcuffed Fat General.\n      Avoiding Fromm's gaze, he removes the restraints and\n      turns to leave. But the wily Fromm can see the look\n      in Herber's eyes.\n\n                             FROMM\n             Well, Lieutenant. What do you make\n             of all of this?\n\n      Herber freezes. Beat.\n\n                            HERBER\n             I... I don't know...                                     \n\n                            FROMM\n             I won't ask you to make a choice.\n             That's for you and you alone. All I\n             ask is that you observe and think\n             for yourself. In time you'll see\n             things for what they truly are. You\n             know where to find me when you do.\n\n      Herber nods hesitantly, then turns to leave, but:\n\n                        FROMM (CONT'D)\n             Lieutenant.\n                     (as Herber turns back)\n             Heil Hitler.\n\n      Herber raises his right arm, just managing:\n\n                              HERBER\n             Heil Hitler.\n\n\n147   INT. REICHMINISTRY - GOEBBELS' OFFICE - NIGHT           147\n\n      Goebbels' office is now the scene of great activity.\n      Soldiers rush in and out carrying orders. Goebbels is\n      on two phones at the same time.\n\n                                                      105.\n\n\n\n      Through the melee comes none other than Heinrich\n      Himmler - the bespectacled villain whose appearance\n      is unmatched in fiction. His arrival cannot be good.\n\n                           GOEBBELS\n             Have you seen the Führer? Is he-\n\n                           HIMMLER\n             It seems the conference table\n             shielded him from the blast. He's\n             lucky to be alive.\n                        (looking around)\n             Do you want to tell me what's going\n             on?\n\n                           GOEBBELS\n             Everything is under control. I've\n             taken charge of the Guard Battalion\n             and given them new orders. We're\n             turning the tables on these\n             cowards.\n\n                           HIMMLER\n             I've been sent here personally by\n             the Führer to collect the\n             conspirators. He insists they be\n             taken alive.\n\n      Goebbels and Himmler, two of the most evil men who\n      ever lived, smile coldly. Being taken alive by this\n      mob is obviously a fate worse than death.\n\n      Goebbels turns to a nearby AIDE.\n\n                           GOEBBELS\n             Take this down. By order of Adolf\n             Hitler...\n\n      CLACK-CLACK-CLACK-CLACK-CLACK...\n\n\n148   INT. CENTRAL COMMUNICATIONS - BERLIN - NIGHT           148\n\n      Once again the operators are frozen, looking at Lt.\n      Haans. He in turn looks at two orders in his hands.\n      He is deeply confused. Sgt. Helm is not.\n\n                             HELM\n             It's a coup all right... And when\n             it's over, we'd better wind up on\n             the right side. Now we can't afford\n             to remain neutral any longer. We\n             have to make a decision.\n\n                                                      106.\n\n\n\n      CLOSE ON: Haans. All eyes watch him weigh the\n      decision of his life, of many lives. Millions in\n      fact. Finally he relents, handing one paper to Helm.\n\n                            HAANS\n             Very well. Send all communications\n             from the Wolf's Lair. Stop all\n             communications from Stauffenberg.\n\n      The operators spring into action.\n\n      CLACK-CLACK-CLACK-CLACK-CLACK...\n\n                   RADIO ANNOUNCER (V.O.)\n             Today an attempt was made on the\n             Führer's life...\n\n\n149   INT. WAR MINISTRY - FROMM'S OFFICE - NIGHT             149   \n\n      Stauffenberg works frantically in a room full of\n      officers - the energy here being the antithesis of\n      Goebbels' office - the morale quickly waning.\n\n      He ignores the radio, writing orders, making phone\n      calls, fighting to keep the coup alive. But we know\n      now his orders are hitting a dead end.\n\n                       RADIO ANNOUNCER\n             ...The Führer himself suffered no\n             major injuries and resumed his work\n             immediately...\n\n      Stauffenberg turns off the radio, grabbing Haeften\n      just as he is coming in.\n\n                         STAUFFENBERG\n             Send the following teleprint to all\n             Army Commanders... `Broadcast\n             communique not correct. The Führer\n             is dead. Orders to be carried out\n             with utmost dispatch.'\n\n      Haeften nods and leaves. Stauffenberg turns back to\n      his work, coming face to face with a deeply troubled\n      Beck. Stauffenberg whispers, frustrated...                  \n\n                    STAUFFENBERG (CONT'D)\n             I saw the blast...                                   \n\n                         VOICE (O.S.)\n             What the hell kind of coup is this?\n\n                                                   107.\n\n\n\nAll eyes turn to find Witzleben. Hours ago he was a\ncivilian, now he is a pompous, know-it-all General.\n\n                     WITZLEBEN\n       The military districts are\n       receiving contradictory reports.\n       I've got men sitting around joking\n       about whose turn it is to arrest\n       whom. Neither the capital nor the\n       radio network are under our\n       control. And where are the troops?\n       You'd think there would be some\n       activity going on in this city.\n                  (to Stauffenberg)\n       The word is all over the street\n       that Hitler is still alive. We\n       trusted you and you failed us. You                   \n       should have stayed. To be sure.                      \n\n                 OLBRICHT (O.S.)\n       And who would have led the men here                  \n       in Berlin? You?                                      \n\nFinding his balls, Olbricht confronts Witzleben.\n\n                OLBRICHT (CONT'D)\n       The Colonel did more than any man                    \n       could have hoped. If anyone is to                    \n       blame it's-                                          \n\n                   STAUFFENBERG                             \n       Field Marshal Witzleben is right. I                  \n       am the officer in charge. I am the                   \n       man responsible. No one else.                        \n\nOlbricht is moved and rightly so. Meanwhile:                \n\n                    WITZLEBEN\n       I'm going home to await my                           \n       inevitable arrest.                                   \n\nWitzleben turns, marching out. The room remains ill         \nat ease, everyone having just witnessed a serious\nblow to the Resistance. Those anonymous soldiers\npresent exchange glances of concern.                        \n\n                    OLBRICHT                                \n       I'm sorry, Colonel.                                  \n\nAfter a beat, Olbricht turns and leaves.\n\nCLOSE ON LIEUTENANT HERBER, tucked away in a corner\nof the office.\n\n                                                         108.\n\n\n      He looks at Stauffenberg in a new light now,\n      something darker - no longer the admirer. He shares a\n      look with TWO OTHER OFFICERS. A wordless\n      understanding. He leaves and they follow.\n\n\n150   INT. WAR MINISTRY - HALLWAY - NIGHT                       150\n\n      Herber and company march down the hallway in silence.\n      They stop for Herber to unlock the door to...\n\n\n151   INT. WAR MINISTRY - MUNITIONS STORAGE ROOM - NIGHT        151\n\n      The officers file in, making a beeline for a locker\n      in the corner of the room. Inside are all manner of\n      sub-machine guns, pistols, grenades...\n\n                            HERBER\n             Arm yourselves.\n\n\n152   EXT. WAR MINISTRY - NIGHT                                 152\n\n      Under Remer's direction the Deutschland Guard\n      Battalion quickly surrounds the War Ministry.\n\n      We see a figure moving behind the windows up above...\n\n\n153   INT. WAR MINISTRY - OLBRICHT'S OFFICE - NIGHT             153\n\n      Olbricht helplessly watches troops surround the\n      building below. It is only a matter of time now.\n\n      He sits at his desk. With a long trembling sigh, he\n      puts pen to paper and writes:\n\n      \"My dearest wife...\"\n\n      A commotion from the anteroom startles Olbricht and\n      he drops the pen. A loud, shrill scream follows.\n\n      The door bursts open to reveal Herber and his TWO\n      COHORTS. They are supported by A HALF DOZEN ARMED\n      SOLDIERS, all training their weapons on Olbricht.                 \n\n      In the anteroom behind the soldiers we see Fraulein\n      Oven quietly slipping out into the hallway.\n\n                                                         109.\n\n\n\n\n154   INT. WAR MINISTRY - FROMM'S OFFICE - NIGHT                154\n\n      Beck, Stauffenberg and Haeften are still making calls\n      and writing orders - doing all they can to keep the\n      coup alive. They are startled when Fraulein Oven\n      bursts in. It is written on her face.\n\n\n155   INT. WAR MINISTRY - HALLWAY - NIGHT                       155\n\n      Stauffenberg and Haeften rush toward Olbricht's\n      office, stopping when they see a MASS OF SOLDIERS\n      surrounding the doorway. A chill runs down our spines\n      when we see Herber talking to none other than Major\n      Remer. Just then, he spots Stauffenberg and Haeften.\n\n                              REMER\n             YOU THERE.\n\n      Stauffenberg and Haeften turn and run.\n\n                          REMER (CONT'D)\n             HALT.\n\n      BANG. A shot is fired. Stauffenberg and Haeften take\n      cover in a nearby doorway. Haeften returns fire.\n      Stauffenberg clamps his pistol under the stump of his\n      right arm, managing to cock it with the three fingers\n      of his left hand. Awkward. Then he aims and fires.                \n\n      Stauffenberg takes a bullet in the shoulder of his\n      good arm. He drops his gun, bleeding badly.                       \n\n      But MORE SOLDIERS appear at the opposite end of the\n      corridor. The loyal Haeften covers Stauffenberg with              \n      his body, aiming to fire. But Stauffenberg stops him,             \n      shaking his head. It's over. They toss down their                 \n      guns. Boot-steps approach loudly O.S.                             \n\n      As Stauffenberg looks down at the cross and ring                  \n      around his neck:                                                  \n\n                           HAEFTEN                                      \n             Thank you, Colonel.                                        \n\n      Stauffenberg is genuinely confused. \"For what?\"                   \n\n                       HAEFTEN (CONT'D)                                 \n             Better I die for Germany than for                          \n             Hitler.                                                    \n\n                                                         110.\n\n\n\n                         VOICE (O.S.)\n             Colonel Stauffenberg.\n\n      Stauffenberg turns to find Remer standing there.                  \n\n                            REMER\n             You're under arrest.                                       \n\n\n160   INT. WAR MINISTRY - FROMM'S OFFICE - LATER                160\n\n      Stauffenberg, Olbricht, Beck, Mertz and Haeften, the\n      last of the conspiracy, are held at gunpoint. A smug\n      Fromm enters, followed by Herber, the Fat General,\n      Remer and numerous GUN-TOTING OFFICERS.                           \n\n                            FROMM                                       \n             If you have any last messages,                             \n             you'd better write them now.                               \n\n                         STAUFFENBERG                                   \n             My actions speak for me.                                   \n                          (to his men)                                  \n             I'd rather my wife and children                            \n             remember our last time together.                           \n\n      The others bravely nod in agreement. But then:                    \n\n                             BECK\n             I'd like a pistol, please.\n\n      Stauffenberg looks at Beck with surprise.\n\n                        BECK (CONT'D)\n             For personal reasons.\n\n      Fromm thinks about it, then matter-of-factly hands\n      Beck a pistol. Remer quickly steps forward.\n\n                            REMER\n             General, my orders are to deliver\n             the prisoners alive.\n\n                             FROMM\n             Noted, Major.\n                            (to Beck)\n             Get on with it then.\n\n                             REMER\n             But, sir-\n\n                            FROMM\n             THAT WILL BE ALL, MAJOR.\n\n                                                  111.\n\n\n\nFromm glares at Remer who angrily backs down. Then he\nturns to Beck and with a casual wave of the hand:\n\n                    FROMM (CONT'D)\n        Continue.\n\nThe moment is surreal. Beck, seated at the desk,\nlooks at each of his fellow conspirators. A look of\nthanks, goodbye. With a badly trembling hand he\nplaces the gun to his temple.\n\n                        BECK\n        I'm thinking of earlier times...\n\nCLOSE ON: The conspirators turn away, unable to            \nwatch. Except Stauffenberg.                                \n\nBANG.                                                      \n\nAnd as if none of the last minute has even occurred,       \nFromm turns to the other conspirators.\n\n                        FROMM                              \n        Very well then... A court martial,\n        convened by me in the Führer's\n        absence, has pronounced sentence:\n        Colonel Mertz von Quernheim,\n        General Olbricht, Lieutenant\n        Haeften...\n               (glaring at Stauffenberg)\n        And the Colonel, whose name I will\n        not mention, are condemned to\n        death.\n                      (to his men)\n        Take them outside.\n\nRemer is clearly upset by this. Herber, on the other\nhand, seems clearer than ever. He nods to his men who\ndrag the conspirators out. Herber personally takes\nStauffenberg by the arm. The two men share a look.\nNothing needs to be said. Each has found his place.\n\nStauffenberg turns to confront Fromm. He is weak,\nwhite from fatigue and loss of blood.                      \n\n                    STAUFFENBERG                           \n        The Führer will want to put us on                  \n        trial, make an example of us. This                 \n        won't win you any favor. And it                    \n        won't hide you're involvement.                     \n\n                       FROMM                               \n        Involvement. I don't know what you-                \n\n                                                   112.\n\n\n\n                   STAUFFENBERG                             \n       You knew and you did nothing.                        \n       You're just as guilty as we are.                     \n       Even more so.                                        \n\n                      FROMM                                 \n       Spare me, Stauffenberg.                              \n\nAnd those words bring a genuine smile to                    \nStauffenberg's face. He almost pities Fromm now.            \n\n                   STAUFFENBERG                             \n       No one will be spared.                               \n\nAnd as Fromm motions for Herber to take Stauffenberg        \naway, we hear music, faintly at first - accompanied         \nby the subtle hiss and crackles of a phonograph... It       \nis the piece Stauffenberg and Nina were dancing to          \none night long ago... Over this:                            \n\nA voice. A man speaking in German - faint at first,         \ncrackling over the radio.                                   \n\n                  HITLER (V.O.)                             \n       My comrades. Once again - I don't                    \n       know how many times it has been now                  \n       - an attempt has been made on my                     \n       life.                                                \n\n\nINT./EXT. BERLIN - VARIOUS - NIGHT                          \n\nA series of images of the coup being reversed as the        \nNazis take back power, made all the more poignant by        \nthe lonely sound of the phonograph, the music slowly        \nrising, growing clearer and eventually becoming score       \nover the silent images of:                                  \n\nConspirators being rounded up and arrested. Among           \nthem are faces we recognize...                              \n\nGoerdeler, dragged from a hotel bed by SS OFFICERS as       \nhis informing INNKEEPER watches from the doorway.           \n\nTITLES: DR. CARL GOERDELER - TRIED, 7 SEPTEMBER             \n1944. HANGED, 2 FEBRUARY 1945.                              \n\nWitzleben is led in handcuffs from his home where he        \nhas been awaiting his fate.                                 \n\nTITLES: ERWIN VON WITZLEBEN - TRIED, 8 AUGUST 1944.         \nHANGED, 8 AUGUST 1944.                                      \n\n                                                         113.\n\n\n\n\n161   EXT. WAR MINISTRY - NIGHT                                 161   \n\n      Military vehicles are hastily arranged in a semi-              \n      circle - headlamps marking the scene in stark white\n      light and long black shadows.\n\n      Stauffenberg, Haeften, Olbricht and Mertz are marched          \n      into the courtyard, squinting in the harsh light as            \n      they are placed against the wall of the War Ministry.          \n\n                        HITLER (V.O.)                                \n             I speak to you tonight for two                          \n             reasons. First, so that you can                         \n             hear my voice and know that I am                        \n             unhurt. And second, so that you may                     \n             know the details of a crime without                     \n             parallel in German history...                           \n\n\n      INT./EXT. BERLIN - VARIOUS - NIGHT                             \n\n      Fellgiebel is swarmed by SS in his office at the               \n      Wolf's Lair and summarily beaten.                              \n\n      TITLES: GENERAL ERICH FELLGIEBEL - TRIED, 10 AUGUST            \n      1944. HANGED, 4 SEPTEMBER 1944.                                \n\n      Chief of Police Helldorf is caught by surprise as his          \n      own men burst into his office, rifles raised.                  \n\n      TITLES: CHIEF OF POLICE WOLF-HEINRICH VON HELLDORF -           \n      TRIED, 15 AUGUST 1944. HANGED, 15 AUGUST 1944.                 \n\n\n      EXT. WAR MINISTRY - NIGHT                                      \n\n      TEN SOLDIERS of the Deutschland Guard Battalion                \n      scramble to form a line opposite Stauffenberg and his          \n      conspirators. We can clearly read Fromm's lips,                \n      shouting: \"MAKE READY...\"                                      \n\n      Stauffenberg and Haeften share a reassuring smile.             \n\n      Remer watches bitterly from the shadows, focusing his\n      hatred not on the conspirators... but on Fromm.                \n\n\n      INT./EXT. BERLIN - VARIOUS - NIGHT                             \n\n      Berthold, Stauffenberg's brother, is taken from his            \n      flat in Berlin.                                                \n\n                                                         114.\n\n\n\n      TITLES: BERTHOLD VON STAUFFENBERG - TRIED, 10 AUGUST              \n      1944. HANGED, 10 AUGUST 1944.                                     \n\n\n      EXT. WAR MINISTRY - NIGHT                                         \n\n      Fromm smiles to himself, satisfied.                               \n\n                         HITLER (V.O.)                                  \n              A small clique of ambitious,                              \n              dishonorable, stupid officers have                        \n              conspired to eliminate me. Except                         \n              for a few bruises and burns, I was                        \n              completely untouched.                                     \n\n      Fromm raises his arm, his lips reading: \"TAKE AIM...\"             \n\n      TITLES: GENERAL FRIEDRICH FROMM - TRIED, 7 MARCH\n      1945. EXECUTED, 12 MARCH 1945.\n\n      Stauffenberg takes a breath and shouts defiantly, his             \n      lips reading: \"Long live sacred German-\"                          \n\n      Fromm drops his hand. Ten rifles open fire.                       \n\n      CRANE UP and away as the music swells, as what is                 \n      left of Berlin comes into view, as the few lights                 \n      that remain suddenly go out as if a dark shadow were              \n      passing over the land.                                            \n\n                     HITLER (V.O.) (CONT'D)                             \n              I see in this the hand of                                 \n              Providence... directing me to                             \n              complete my work.                                         \n\n      And the last strains   of music resolve in a single,              \n      sustained note as we   CRANE UP FURTHER, looking at               \n      last to the overcast   darkness of the night sky. The             \n      last note goes on as   if it might play forever...                \n\n      Until suddenly it dips and we realize we are no                   \n      longer hearing music at all, but the urgent wailing               \n      of an air-raid siren - the warning of allied bombers              \n      coming to deliver their nightly assault on Berlin.                \n\n      Hitler's gift to Germany.                                         \n\n\n162   BLACK                                                     162\n\n\n\n\n\nValkyrie\nWriters :   Christopher McQuarrie  Nathan Alexander\nGenres :   Drama  Thriller  War\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "During World War II, Wehrmacht Colonel Claus von Stauffenberg (Cruise) is severely wounded during an RAF air raid in Tunisia, losing his right hand, the ring and little finger on his left hand, and his left eye, and is evacuated home to Nazi Germany. Meanwhile, Major General Henning von Tresckow (Branagh) attempts to assassinate Adolf Hitler by smuggling a bomb aboard the Führer's personal airplane. The bomb, however, is a dud and fails to detonate, and Tresckow flies to Berlin in order to safely retrieve it. After learning that the Gestapo has arrested Major General Hans Oster, he orders General Olbricht (Nighy) to find a replacement. After recruiting Stauffenberg into the German Resistance, Olbricht presents Stauffenberg at a meeting of the secret committee which has coordinated previous attempts on Hitler's life. The members include General Ludwig Beck (Stamp), Dr. Carl Goerdeler (McNally), and Erwin von Witzleben (Schofield). Stauffenberg is stunned to learn that no plans exist on the subject of what is to be done after Hitler's assassination.\nDuring a bombing raid on Berlin, he gets the idea of using Operation Valkyrie, which involves the deployment of the Reserve Army to maintain order in the event of a national emergency. The plotters carefully redraft the plan's orders so that they can dismantle the Nazi régime after assassinating Hitler. Realizing that only General Friedrich Fromm (Wilkinson), the head of the Reserve Army, can initiate Valkyrie, they offer him a position as head of the Wehrmacht in a post-Nazi Germany and request his support, but Fromm declines to be directly involved, stating he will not side with them so long as Hitler is alive. With the rewritten Operation Valkyrie orders needing to be signed by Hitler (Bamber), Stauffenberg visits the Führer at his Berghof estate in Bavaria. Fromm's influence allows Stauffenberg to bring the copy directly before Hitler, and in the presence of Joseph Goebbels, Heinrich Himmler, Hermann Göring, Wilhelm Keitel and Albert Speer, his inner circle, Hitler praises Stauffenberg's heroism in North Africa and signs the orders without fully examining the modifications, believing Stauffenberg's changes \"are for the best\".\nAt Goerdeler's insistence, Stauffenberg is ordered to assassinate both Hitler and SS head Himmler at the Führer's command bunker, the Wolf's Lair. At a final briefing, Colonel Mertz von Quirnheim (Berkel) instructs the committee members in the use of pencil detonators. Stauffenberg also persuades General Fellgiebel (Izzard), who controls all communications at Wolf's Lair, to cut off communications after the bomb blast. On July 15, 1944, Stauffenberg attends a strategy meeting at Wolf's Lair with the bomb in his briefcase, but with Himmler not present at the meeting, Stauffenberg does not get the go-ahead from the committee leaders, and by the time von Quirnheim defies the others and tells him to do it anyway, the meeting is over. Meanwhile, the Reserve Army is mobilized by Olbricht, unbeknownst to Fromm, to stand by. With no action taken, Stauffenberg safely extracts himself and the bomb from the bunker, and the Reserve Army is ordered to stand down, believing that the mobilization was a drill. Back in Berlin, Olbricht and Stauffenberg are threatened by Fromm that if they try to control the reserve army again he will personally have them arrested; Stauffenberg goes to the committee to protest their indecisiveness and condemns Goerdeler, who has been selected to be chancellor after the coup. When Goerdeler demands that Stauffenberg be relieved, Beck informs him that the SS has issued a warrant for his arrest him, and that he must leave the country immediately.\nOn July 20, 1944, Stauffenberg and his adjutant Lieutenant Haeften (Parker) return to Wolf's Lair. To Stauffenberg's dismay, he discovers only after the timer has been activated that, due to the warm weather, the conference is being held in an open-window summer barrack, whereas the plotters had intended to detonate the bomb within the walls of the bunker for maximum damage. While his adjuntant waits with the car, Stauffenberg places the briefcase with the bomb armed at the meeting as close to Hitler as possible. Stauffenberg then leaves the barrack, returning to the car. However, one of the officers at the meeting moves the bomb behind a table leg, which will inadvertently protect Hitler from most of the blast. When the bomb explodes, Stauffenberg is certain that Hitler is dead and flees Wolf's Lair. Before shutting down communications, Fellgiebel calls Mertz about the explosion but cannot clearly convey whether or not Hitler is dead.\nAs Stauffenberg flies back to Berlin, Olbricht refuses to mobilize the Reserve Army until he knows without a doubt that Hitler is dead (if Hitler isn't dead, Olbricht will be arrested for having the reserve army mobilized without Fromm's permission). Behind Olbricht's back, Mertz forges his signature and issues the orders anyway. With Operation Valkyrie underway, Stauffenberg and his fellow plotters order the arrest of Nazi party leaders and SS officers, convincing lower officers that the Party and the SS are staging a coup. As Army soldiers begin to take control of Berlin's government ministries, including SS headquarters, mid-level officers relaying the orders begin to wonder which side they should be fighting for. Rumors reach Berlin that Hitler survived the blast, but Stauffenberg dismisses them as SS propaganda. Meanwhile, Fromm learns from Field Marshal Keitel that Hitler is still alive. The General refuses to join the plotters, resulting in them detaining him. Major Otto Ernst Remer of the Reserve Army prepares to arrest Goebbels, but is stopped when Goebbels connects him by phone to Hitler.\nImmediately recognizing the voice on the other end, Remer realizes that the Reserve Army has been duped—rather than containing a coup, they have unwittingly supported it. SS officers are released and the plotters in turn are besieged inside the Bendlerblock. The headquarters staff flees, but the resistance leaders are arrested. In an ultimately vain effort to save himself, General Fromm convenes an impromptu court martial and sentences the conspirators to death, contravening Hitler's orders that they be kept alive. Given a pistol by Fromm, Beck commits suicide. That night, the ringleaders are then executed by firing squad one by one. When Stauffenberg is about to be shot, in a last gesture of loyalty and defiance, Haeften places himself in the path of the bullets meant for Stauffenberg. When his turn arrives, Colonel Stauffenberg's last act is to cry \"Long live sacred Germany!\"\nA brief epilogue informs that the conspiracy of July 20, 1944 was the last of fifteen known assassination attempts on Hitler by Germans. It also mentions Hitler's suicide nine months later and that Countess Nina von Stauffenberg and her children survived the war. A shortened version of the dedication at the Memorial to the German Resistance is then shown onscreen:\n\nYou did not bear the shame\nYou resisted.\nBy sacrificing your impassioned lives,\nFor freedom, justice and honor."}