{"title": "Wanted", "full_text": "WANTED\n\n\n                                Written by\n\n                       Michael Brandt & Derek Haas\n\n\n\n                                                      12/1/2005         \n\n          \n\n          FADE IN:\n          CLOSE ON the face of WESLEY GIBSON, 25, STARING AT THE.\n\n          CAMERA.\n\n          WESLEY (V.O.)\n          Six weeks ago, I was ordinary and\n          pathetic.\n          His wry smile gives way to...\n          Black. And then...\n\n          INT. APPLEBY'S - DAY\n\n          The CAMERA STARTS FROM THE CEILING, pointing straight\n          down, overlooking a table of twenty-five people dressed\n          in business casual, pretending to have a good time at\n          lunch in. this cookie-cutter crappy restaurant.\n          At the end of the table, a bowl of spinach dip is in.\n          front of Wesley,'and the CAMERA STARTS descending\n          directly for it, slowly, as we hear...\n\n          WESLEY (V.O.)\n          It was Rochelle's birthday, which meant\n          there was a certain amount of inter-\n          office pressure to go to Appleby's and\n          sit at a table of twenty-five with my\n          boss Janice presiding at the head even\n          though she's too tight to pick up the\n          bill. Which meant, the poor bastard\n          waiting on us had to split the check\n          twenty-four ways -- everyone contributing\n          to Rochelle's free meal -- surf and turf,\n          no less -- don't do us any favors,\n          Rochelle. Anyway, I ate a plate of\n          extreme nachos and then polished off a\n          bowlful of spinach dip pretty much single-\n          handedly...\n          The CAMERA DISAPPEARS in the bowl of spinach dip and\n          we...\n\n          CUT TO:\n\n          INT. WESLEY'S CUBICLE - DAY\n\n          .where Wesley drops his head down on his desk.\n\n          \n\n          \n\n          \n\n          \n\n          2.\n\n          WESLEY\n          .so by the time I got back to my\n          cubicle, my eyelids were so damn heavy, I\n          had to put my head down, even if it was\n          just for a wink.\n\n          SMASH CUT TO:\n\n          EXT. OFFICE BUILDING - DAY\n\n          A sharply dressed man, MR. X, wearing a dark .Armani suit,\n          enters a skyscraper through the lobby. He's a shade\n          taller than most of the office workers who are coming and\n          going.\n\n          INT. LOBBY - DAY\n\n          He heads to an elevator and presses a button for the top\n          floor.\n          And as his finger presses the button, just where the\n          thumb meets the forefinger, we see a TATTOO of a three-\n          headed dog.\n          Soon...\n\n          INT. TOP FLOOR CORRIDOR - DAY\n\n          .the doors open again and he finds himself in an\n          opulent corridor -- sleek and expensively designed.\n          Only one office is at the end of the hall.\n          Expressionless, he makes his way toward it. Without\n          knocking, he steps inside...\n\n          INT. PUJA'S OFFICE - DAY\n\n          .an office fit for a king. Or a queen. Because behind\n          a glass desk sits a beautiful Indian woman dressed\n          traditionally in a serape, with a red bindi on her\n          forehead, the holy third eye. Her name is PUJA.\n          Mr. X sits in the single chair opposite her.\n          After a moment, Puja looks up.\n\n          PUJA\n          I didn't expect for you yourself to come.\n          One of the heads, in the flesh.\n\n          MR. X\n          You're an important fence.\n\n          \n\n          \n\n          \n\n          \n\n          3.\n\n          PUJA\n          I'm flattered.\n          She reaches over to an attachâ\u0082¬ case and removes a file.\n\n          PUJA (CONT'D)\n          The name of the target is Henry Helms.\n          Carrying the file, she moves around the desk and stands a\n          few feet away from Mr. X, who rises so that they are both\n          standing. She really is quite beautiful, exotic even,.\n          with piercing eyes.\n\n          PUJA (CONT'D)\n          He's a journalist who stumbled on to a\n          story exposing a lot of powerful people,\n          people who don't like having their power\n          threatened.\n          MR. x\n          Poor Helms.\n\n          PUJA\n          There.have been five attempts on his\n          life, but he has been well protected...\n          and well hidden. Turns out his wife's\n          family has a lot of money. He's in town\n          to accept an award.\n\n          MR. X\n          We'll see to it that it never makes his\n          mantle.\n\n          PUJA\n          And for that, my clients will pay\n          handsomely.\n          Mr. X is looking at Puja when a curious thing happens...\n          .he notices that the red bindi on he r forehead tarts\n          to move a little, like a second dot is trying to emerge\n          from it, like an amoeba splitting.\n          It's a sh hooter's laser!\n          His eyes go wide as saucers.\n          MR. x\n\n          GET DOWN1!1\n          .but it's too late as bullets rip into her head.\n          splattering everything above her eyebrows into the wet\n          bar.\n\n          \n\n          \n\n          \n\n          \n\n          4.\n          Mr. X crouches, drops his hands behind his back, and a.\n          PAIR OF GUNS -- as technologically advanced as anything\n          we've ever seen -- spring into his hands.\n          The bullets .stop flying and he sprints at the window from\n          which they came, smashing t rough what remains of it,\n          disappearing from the demolished room...\n          .all this as Puja's dead body hits the floor, blood\n          seeping out of that holy third eye.\n\n          EXT. OUTSIDE THE SKYSCRAPER - FORTY FLOORS UP - DAY\n\n          Mr. X's momentum carries him from one building to the\n          next, over an alleyway, the wet-concrete shining below.\n          He lands on the...\n\n          ROOF OF THE NEXT BUILDING:\n          ...and rolls up quickly, guns ready.\n          His eyes spot FOUR MARKSMEN running and ducking for cover\n          on the neighboring rooftop..\n          .and on a dead sprint across the roof...\n          . he spots about a CENTIMETER OF FLESH sticking out from\n          around an air-conditioning vent. He fiKes the his\n          left band.\n          The bullet flies through the air and rockets into the\n          flesh... which happens to be one of the marksmen's ears.\n          The guy YELPS IN PAIN and falls back from the vent,\n          exposing himself. That's all Mr. X needs, and another\n          shot rings out while he's still on a dead run. THWAP!\n          The bullet finds its mark in the yelping man's forehead,\n          silencing him, just as...\n          .Mr. X ducks behind a stairwell door.\n          He pulls up his right hand and looks down the barrel of\n          this pistol: built into the barrel is thin c u r\n          screen. It actually shows the heat signatures of the\n          three remaining marksmen, one of which is directly in\n          front of him, hiding behind a small rooftop supply shed.\n          A second marksmen is just on the other side of the\n          stairwell. The third is on the far side of the rooftop.\n          Mr. X takes another look at the heat signature of the\n          marksman hiding behind the shed and he FIRES his gun...\n\n          \n\n          \n\n          \n\n          \n\n          5.\n\n          /~,\n          ...then does an amazing thing: in the split second that\n          the bullet travels forward, he jerks his gun to the\n          side... actually steering the bullet around the wall and\n          into the ksman's throat.\n          Before the guy's blood hits the ground, the assassin is\n          moving again: he dashes away from the stairwell then\n          makes two incredible shots; one knocks a piece of\n          aluminum off the top of the stairwell...\n          ..which causes it to flip up in the air above the head\n          of the hiding marksman...\n          . the second shot strikes the aluminum again, ,,..,sending\n          the bullet ricocheting down into the ton of the\n          marksman's heads As he falls...\n          THE CAMERA MOVES OVER TO WHERE... the FINAL MARKSMAN is\n          breathing hard, like an engine with a chronic misfire, as\n          he looks out at the dead bodies of his fallen comrades...\n          all chopped down in a matter of seconds.\n          He squeezes his eyes shut, trying to psyche himself up...\n\n          LAST MARKSMAN\n\n          (SOFTLY)\n          C'mon, c'mon, c'mon.\n          He looks out at the stairwell door... and all is quiet.\n          Maybe Mr. X didn't know he was there, maybe he left,\n          maybe the last marksman can sneak away after all.\n\n          LAST MARKSMEN\n\n          (SOFTLY)\n          Okay... okay...\n          He finally decides...\n          .and takes one step forward...\n          THWAP1!1 A bullet disintegrates his knee.\n          He falls, clutching the knee in agony, as Mr. X walks\n          toward him slowly until he stands right over him like a\n          hunter over his prey.\n          Mr. X's shoe comes down on the final marksman's wrist,\n          pinning it away from his dropped weapon.\n\n          MR. X\n\n          (GROWLS)\n          Who sent you?\n\n          \n\n          \n\n          \n\n          \n\n          6.\n          For a moment, we're not sure the last marksman's going.to\n          answer. Then...\n\n          LAST MARKSMEN\n\n          (NERVOUSLY)\n          We're... we're just the decoys, man. We\n          were paid to get you out here...\n          The marksman points at a small VIDEO CAMERA sitting on\n          the roof, relaying their every move...\n          Mr. X's face falls as.those words register, and just\n          then...\n          RA ROCKETS over thetreets of the city, block\n          after block in the blink of any eye...\n          .until it reaches a rooftop, over a mile away.\n\n          ON THE NEW ROOFTOP:\n          A man named CROSS is in a crouch, holding a massive RIFLE\n          pointed upward, at an angle...\n          A small SCREEN on Cross' gun shows the scene from the\n          roof, along with various elemental measurements: wind\n          speed, pressure, temperature, distance, altitude...\n          .. the information on __the reflects off of Cross'\n          eyeball as he processes,,the shot... a quick adjustment to\n          the gun and a slight pull of the trigger...\n\n          BOOM...\n          We follow the arcing bullet back over the rooftops in an\n          instant. Somehow it keeps it's elevation and it's\n          path...\n          .to the resigned look on Mr. X's face: an outsmarted\n          man, a dead man.\n          The bullet hits him square in the chest, and he falls to\n          his knees, then slumps over, dead.\n          Flies start to gather as he lies there.\n          First one, then two, then several as night TIME-DISSOLVES\n          to day...\n\n          EXT. ROOFTOP - LATER\n\n          .and two pairs of legs approach the dead body of Mr. X.\n\n          \n\n          \n\n          \n\n          \n\n          7.\n          The first set belong to an older man, SLOAN, who looks.\n          like he has seen his share of death. The other set\n          belong to the hottest black woman on the planet, FOX.\n          As they look down at the dead body...\n\n          FOX\n          It was a set-up all the way?\n          Sloan just nods.\n          He then stoops down, shoos some of the flies away with\n          the back of his hand and picks up the file that Puja gave\n          Mr. X.\n          The CAMERA PUSHES IN on the back of Sloan's hand as he\n          reads the file. It, too, has the tattoo pf the three-\n          headed do q, in the same spot as Mr. X.\n\n          FOX (CONT'D)\n          (re: the dead body)\n          That's two heads in two weeks. Which\n          leaves only one: you.\n          Sloan nods.\n\n          SLOAN\n          He wants out.\n\n          FOX\n          And killing all three heads gets him\n          that?\n          Sloan nods again.\n\n          FOX (CONT'D)\n          Well, I don't know if we have anyone who\n          can stop him.\n          Sloan squints back up at Fox.\n\n          SLOAN\n          There's one person who can.\n\n          FOX\n          Yeah? Who?\n          And with that, we...\n\n          SMASH CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          8.\n\n          7 INT. WESLEY'S CUBICLE - DAY\n\n          .Wesley Gibson, the guy from the opening scene, fast\n          asleep in his little cubicle. Some drool falls off his\n          lip and 'erks h' awake.\n          Just then, the shot FREEZE-FRAMES, and we see IN THE\n          BACKGROUND OF THE SHOT, his fat boss JANICE caught in mid-\n          stride coming toward him, looking like she's ready to\n          bring the wrath of God.\n\n          WESLEY (V.O.)\n          My name is Wesley Gibson. If you look at\n          the corner of my desk, you'll see the\n          billing reports I was supposed to hand in\n          to Janice an hour ago.\n          The BILLING ORT is highlighted on the screen for just\n          a moment.\n          .then the movie RESUMES normal speed and Janice reaches\n          Wesley's cube in no time...\n\n          BOSS JANICE\n          Oh my fucking god I hope that's not my\n          billing report sitting on your fucking\n          desk. Holy shit on an altar, it isl\n          A couple of the other OFFICE WORKERS look up at the\n          fireworks and smile... like they're actually enjoying\n          Janice's histrionics.\n\n          BOSS JANICE (CONT'D)\n          why don't you just take a dump in your\n          hands, fork it over to me and say, \"this\n          is the best effort I'm gonna give to you,\n          Janice. This is the best you're ever\n          gonna get out of me.\" Hell, Rochelle on\n          her bbirthdav is doing a better a job than\n          your lazy ass and she's already left for\n          the day. Je-sus CHRIST!\n          Wesley looks like he'd rather be anywhere else.\n\n          WESLEY\n          I meant to...\n\n          BOSS JANICE\n          (imitating him)\n          I meant to... I meant to... Well I meant\n          to be a size four but meaning to doesn't\n          pick no cotton.\n\n          \n\n          \n\n          \n\n          \n\n          9.\n          She snatches up the report off his desk.\n\n          BOSS JANICE (CONT'D)\n          Tell you what. I'll just input the four-\n          ones myself.\n\n          (ANNOUNCES)\n          Look everyone, I'm gonna do Wesley's four-\n          ones for him! I don't have enough to do\n          with my own damn job so I'll do Wesley's\n          too!\n          Wesley grabs the report back.\n\n          WESLEY\n          I'll do it.\n\n          BOSS JANICE\n          Minimum for the maximum. That's all you\n          ever do. The minimum you can do to suck\n          the maximum from this company.\n\n          WESLEY\n          I said I'll get it done. I'm sorry.\n\n          BOSS JANICE\n          No, you're worthless. I'm the one who's\n          sorry I hired you.\n          She storms away, fuming.\n          Wesley looks over and sees some of the other workers\n          still staring at him, amused.\n          He sits back down to the semi-privacy of his little\n          cubicle.\n\n          CUT TO:\n\n          INT. MEETING ROOM - DAY\n\n          A CONSULTANT in a suit is droning on and on in front of a\n          nifty power-point presentation.\n          The CAMERA PULLS BACK to reveal Wesley, bored to tears,\n          sitting at a long table with Janice and other corporate\n          minions.\n          The CAMERA FINDS Wesley's note-pad where it looks like\n          he's taking notes on the presentation. Instead, covering\n          every inch of the page, is the phrase \"life sucks then\n          you die.\"\n\n          \n\n          \n\n          \n\n          \n\n          10.\n\n          WESLEY (V.O.)\n          My job title is Account Manager. I used\n          to be called an Account Service\n          Representative, but a consultant told us\n          we needed to \"manage\" our clients and not\n          \" service- them.\n          Onemore \"life sucks then you die.\"\n\n          WESLEY (V.0.) (CONT'D)\n          I have a girlfriend whom I neither manage\n          nor service.\n\n          CUT TO:\n\n          INT. GIRLFRIEND'S APARTMENT - DAY\n\n          Wesley's GIRLFRIEND is currently riding some guy named\n          BARRY on her living room.couch. She's not very\n          attractive, sort of plain and ordinary.\n\n          WESLEY (V.0.)\n          Her name's Cathy. She works at Banana\n          Republic. The guy she's humping is my\n          best friend, Barry.\n          She's giving it her best. As her MOANS reach a\n          crescendo, we...\n\n          CUT BACK TO:\n\n          INT. MEETING ROOM - DAY\n\n          Wesley is still sitting there with his note pad, while\n          the consultant continues to rattle on and on about God\n          knows what.\n          Through the blinds behind the speaker, Wesley can spot\n          his company.'s hot intern, NICOLE, talking on the phone.\n          He zeroes in on her, until...\n          Wesley suddenly looks around the room and everyone ijL_\n          staring at him.\n\n          WESLEY\n\n          (HESITANTLY)\n          Yes. Uh... Well the 602 deals with\n           applications sent by prospective clients\n           and the 603 is when the client is...\n          Everyone is still just staring...\n\n          \n\n          \n\n          \n\n          \n\n          11.\n\n          WESLEY (CONT'D)\n          I'm sorry, Jesus... uh... what was the\n          question?\n\n          CONSULTANT\n          I asked you about the effects of net\n          investment income with regards to\n          underwriting cycles.\n\n          WESLEY\n          Well, that's the thing.-\n\n          CONSULTANT\n          What's the thing?\n\n          WESLEY\n          (trying to redeem himself)\n          Cycles. Hard market, industry-wide\n          cycles differ from our firm's cycles so I\n          think it's amistake to apply...\n\n          JANICE\n          Good God a'mighty.\n\n          CONSULTANT\n          Son... everyone knows that net\n          investment income is inversely related to\n          both premium and loss reserves, making\n          firm cycles inherently dependent on\n          industry cycles!\n          Everyone snickers.\n\n          CONSULTANT (CONT'D)\n          In fact, to prove my point, I'd like you\n          to spend some time this afternoon adding\n          up the yearly differential responses.\n\n          JANICE\n          Get it to me by five.\n\n          WESLEY\n          Sure.\n          Wesley jots down on his pad: \"ACTION ITEMS,\" and\n          underneath it: \"Differential responses... then you die.\"\n          He underlines it three times.\n\n          INT. BREAK ROOM - DAY\n\n          Wesley sits at a small round table by himself, eating a\n          ham and cheese on white.\n\n          \n\n          \n\n          \n\n          \n\n          12.\n          A group of. other WORKERS sit at a table nearby, gossiping\n          and guffawing about whatever shit they have to discuss.\n\n          WESLEY (V.O.)\n          There are people, everyday you meet them,\n          who you wish could see you in a different\n          setting, a different place...\n          Just then, Nicole, the pretty intern, approaches and\n          starts fishing through the refrigerator.\n\n          WESLEY (V.0.) (CONT'D)\n          .instead of where you are, what you've\n          become.\n          Wesley sits upright, glad now that no one is sitting at\n          his table. Nicole turns and smiles at Wesley, starts to\n          head his way, when...\n\n          LOUDMOUTH AT OTHER TABLE\n          Nicole! Get your ass over here and.tell\n          us what the hell is going on with you and\n          Whitcock the big cock!\n          He pulls a chair over from next to Wesley to make room\n          for her at his table.\n          Wesley just takes another bite of his sandwich.\n\n          INT. WESLEY'S CUBICLE - DAY\n\n          Wesley is staring, at his monitor...\n\n          WESLEY (V.0.)\n          And you wish to god your eyeballs weren't\n          being sucked out of their sockets by\n          monitor fatigue. That you didn't spend\n          five years in college to do goddamn\n          differential responses.\n          see that he is actually i>laying solitaire on the\n          computer. He keeps checking over his shoulder for\n          Janice, but she is talking on the phone in her office\n          with the door shut.\n          He looks up and watches the computer clock turn from 4:59\n          to 5:00. He saves his solitaire game and then turns off\n          the computer, snatches up his jacket, waits for Janice to\n          turn her back to him as she is engrossed in her call, and\n          then sneaks away.\n\n          INT. ELEVATOR BANK - DAY\n\n          Wesley presses the down button and waits.\n\n          \n\n          \n\n          \n\n          \n\n          13.\n\n          WESLEY\n          C'mon, c'mon.\n          After an eternity, the doors open.\n\n          WESLEY (CONT'D)\n          But at least at the end. of the day...\n          Wesley steps in and turns around. Before the doors\n          close, he sees his boss Janice down the hall, looking at\n          him. She checks her watch and looks back at him,\n          pissed...\n\n          WESLEY (CONT'D)\n\n          (DEFEATED)\n          .you know that tomorrow it's going to\n          start all over again.\n          ..and then the doors close.\n\n          EXT.. CITY STREET - DAY\n\n          Wesley pedals a ten-speed down a busy street. It's\n          raining, and he squints to keep the water out of his\n          eyes.\n\n          EXT. ATM MACHINE - DAY\n\n          He stands nervously at an ATM machine. He checks to see\n          if anyone is looking, and then hits the \"check balance\"\n          button.\n          A message comes up: \"You have $47.92 in your account.\n          Would you like another transaction?\"\n          He clicks \"yes\" and then \"quick cash\" and waits for the\n          $40 to dispense.\n\n          IN . WESLEY'S APARTMENT - DUSK\n          Wesley enters, toting his bike, only to find Cathy and\n          Barry laughing on the couch, watching some crap on\n          television.\n          He's two steps in the door when...\n\n          CATHY\n          Where's the spaghetti?\n\n          WESLEY\n          What?\n\n          \n\n          \n\n          \n\n          \n\n          14.\n\n          CATHY\n          I specifically told you to get noodles on\n          your way home. God, Wesley, I already\n          put the sauce on.\n\n          WESLEY\n          Sorry. Iâ\u0080¢didn't...\n\n          CATHY\n          You didn't listen is what you didn't.- I\n          might as well talk to the wall.\n\n          WESLEY\n          I'll be right back.\n          He turns around.\n\n          INT. CORRIDOR OUTSIDE WESLEY'S APARTMENT - DUSK\n\n          He starts to head away when Barry pokes his head out of\n          the apartment door.\n\n          BARRY\n\n          (INSINCERELY)\n          You want me to go with you, buddy?\n          What a dick. Wesley doesn't turn around, defeated...\n\n          WESLEY\n          I got it.\n\n          EXT. CITY STREET - DUSK\n\n          He's back on the ten-speed, pedaling again in the rain,.a\n          pissed expression on his face.\n\n          WESLEY (V.O.)\n          My parents both died when I was born.\n          He grits his teeth as we...\n\n          CUT TO:\n\n          INT. FOSTER HOME - DAY\n\n          A young Wesley, 10, sits at a table with a couple of\n\n          RELIGIOUS FOSTER PARENT WACKOS.\n\n          WESLEY (V.0.)\n          The nutjobs I had as foster parents\n          thought any book that didn't contain a\n          red-letter edition was the spawn of the\n          devil...\n\n          \n\n          \n\n          \n\n          \n          .is.\n\n          EXT. FOSTER HOME - DAY\n\n          The ten-year-old Wesley moves furtively to a side of the\n          clap trap house, and pries loose a board.\n\n          WESLEY (V.O.)\n          ..so I had to hide my stash like it was\n          a bag of many jane.\n          Stuck in a hole is a copy of THE COUNT OF MONTE CRISTO.\n          He moves back around the corner and standing there is his\n          FOSTER MOTHER, pissed as hell...\n\n          WESLEY (V.0.), (CONT'D)\n          One time my foster mother found my copy\n          of CATCHER IN THE RYE...\n          .she holds a copy of the book in,her hand, getting\n          ready, to strike..\n\n          WESLEY (V.0.) (CONT'D)\n          .and God told her to beat me with it.\n          Young Wesley takes a beating, WHAP, WHAP, WRAP!\n          .his face screws up, taking the blows...\n\n          WESLEY (V.0.) (CONT'D)\n          .But despite them, I thought I was gonna\n          be something special.\n\n          CUT TO:\n\n          EXT. CITY STREET - DUSK\n\n          .that same expression is plastered on Wesley's face as\n          he pedals. He banks the bike up a curb and into a\n          grocery store parking lot.\n          Across the street, a man watches from behind the wheel of\n          a 171 Chevy Chevelle.\n          In fact, it's Cross, the man we last saw assassinating\n          Mr. X on the rooftop.\n          He watches Wesley park the bike and move into the store.\n\n          INT. KROGER - PASTA AISLE - NIGHT\n\n          Wesley stands, looking over all the different kinds of\n          noodles. None of them just say \"spaghetti.\"\n\n          \n\n          \n\n          \n\n          \n\n          16.\n          Suddenly, a woman's voice pops up behind-him...\n\n          FOX\n          There is a remedy for all things but\n          death.\n          She said it so fast he's not sure he heard it right.\n          He turns and sees the-hottest zQZM ever to ace\n          Kroger's aisles: ox. She's wearing barely enough\n          clothing to cover her tight body.\n\n          WESLEY\n          (like he.didn't hear)\n          I'm sorry?\n\n          FOX\n          You apologize too much.\n\n          WESLEY\n          (stammers again)\n          Sorry?\n          She looks him in the eye.\n\n          FOX\n          Spina bifida babies have more backbone\n          than you.\n          With that, she walks toward the end of the aisle, eyes\n          scanning the whole time.\n          Stunned, all Wesley can do is watch her walk.\n          on the sMll f her back is a tatt It'\n          tattoo we saw in the be i n n : a thKee-head2d dog.\n          She gets to the end and catches him looking at her.\n          Then she makes a very subtle gesture with her head... as\n          if to say \"come here.\"\n          Wesley still isn't sure what the hell is going on.\n          Sheepishly, he makes his way to where she stands.\n          She leans in close, her lips just inches from his ear.\n\n          FOX (CONT'D)\n          I knew your father.\n          Whatever Wesley was expecting_ it wasn't that. He pulls\n          back from her.\n\n          \n\n          \n\n          \n\n          \n\n          17.\n\n          WESLEY\n          I think you got the wrong guy.\n\n          FOX\n          Can't say that I agree with you, Wesley.\n\n          WESLEY\n          (running it all together)\n          What is this? How d'you know my name?\n\n          FOX\n          Your father...\n\n          WESLEY\n          My father died in a car wreck the week I\n          was born...\n\n          FOX\n          ,Your father died two days ago on the\n          rooftop. of the Metropolitan Building.\n          For a moment, just a moment, Wesley is stunned, but Fox\n          just keeps sizing him up.\n\n          FOX (CONT'D)\n          He'd be damn disappointed in what you've\n          become, too.\n          Wesley holds up his hands in a defensive gesture...\n\n          WESLEY\n          Lady...\n\n          FOX\n          I've been called a lot of things, but\n          \"lady\" ain't one of 'em.\n          Wesley starts to talk but Fox interrupts him...\n\n          FOX (CONT'D)\n          Damn, Wesley, how d'you ever learn\n          anything when you won't keep your mouth\n          shut and your ears open? I'm trying to\n          tell you about your father.\n          Wesley starts to open his mouth again, but then closes\n          it. He waits.\n\n          FOX (CONT'D)\n          Your father, Wesley, wits the greatâ\u0080\u009e sit\n          assassin to ever live. Your father,\n          Wesley, worked for the Fraternity.\n\n          \n\n          \n\n          \n\n          \n          is.\n\n          WESLEY\n          The Fraternity?\n\n          FOX\n          (keeps right on going)\n          Your father, Wesley, was set up and\n          gunned down by a man he used to consider\n          a friend. And your father, Wesley...\n          Suddenly, s raises her hands and-LS fist' two blgck\n\n          PISTOLS.\n\n          FOX (CONT'D)\n          .taught me everything I know.\n          Wesley takes a step back.\n\n          WESLEY\n\n          (SLOWLY)\n          What is this?\n\n          FOX\n          This is what you've dreamt about all your\n          life.\n          Just then, Cross o s the corner to t e' e\n          also fisting a Da'r of alms.\n          Wesley's eyes go wide as Fox suddenly starts firing, BAM!\n          BAMI BAMZ BAMI BAM: forcing Cross to take cover on the\n          far side of the aisle.\n\n          FOX (CONT'D)\n          Move! Now!\n          She screams this, grabbing Wesley's wrist and jerking him\n          forward, just as Cross comes back up, firing, a killing\n          machine.\n          They barely get out of the way, as the pasta aisle\n          explodes in an avalanche of bullets! Glass bottles of\n          spaghetti sauce shatter, turning the aisle into a\n          rainstorm of red droplets -- we're not sure what is sauce\n          and what is blood.\n          Then... Cross springs on to a display stand of tortillas\n          and up to the top of the freezer section, so he can have\n          a better angle of attack at the fleeing Fox and Wesley.\n          He starts sprinting down the top of the freezer section,\n          smashing over styrofoam coolers, as his bullets barely\n          miss Fox and Wesley, but slam into the freezers behind\n          them, sending ice and glass exploding everywhere.\n\n          \n\n          \n\n          \n\n          \n\n          19.\n          But Wesley and Fox are too quick.. She still has a.hold\n          of Wesley's wrist and she propels him through the\n          swinging doors of the stock room.\n\n          -EXT. OUTSIDE THE GROCERY STORE - DAY\n\n          There is a cherry red FERRARI convertible parked right\n          next to the store.\n          Wesley is still trying to figure out what the hell is\n          going on as Fox tosses him the ke !\n\n          FOX\n          Drive!\n\n          WESLEY\n          What?!!\n          But Fox just leaps into the passenger seat, guns up and\n          ready, as Wesley's legs. somehow take over and he hops\n          behind the wheel.\n          Just then, Cross's ev ll Mound the corner,\n          practically going up on two tires.\n          Wham! Wesley turns the ignition, pope the clutch, and\n          smashes the gas pedal as the car nearly snaps his neck\n          when it launches forward.\n          He races through the gears and rips around a corner and\n          out into traffic.\n\n          WESLEY (CONT'D)\n          Where are we going?\n\n          FOX\n          Just drive!\n          The Chevelle stays on his tail behind them; Cross drives\n          and fires his Glock at the same time. Bam! Bam! Sam!\n          Fox does her best to send bullets back his way, while\n          Wesley mans the wheel, breathing hard, still stunned at\n          what is happening.\n          He spots a side-street...\n\n          WESLEY\n          Hold on!\n          ...whips the car into a rubber-squealing turn...\n\n          \n\n          \n\n          \n\n          \n\n          20.\n\n          EXT. ONE WAY STREET - DAY\n\n          ...and ends up going the wrong way down a narrow one-way\n          street!\n          He now has to weave in and out of cars headed right for\n          them, as Cross stays tight on their ass.\n          Horns are BLARING in his face, but Wesley somehow keeps\n          the. Ferrari on all four tires as he bobs in'and out of\n          the paths of oncoming cars.\n          A 4 X 4 Chevy Pickup is headed like a missile right at\n          them...\n          Wesley's eyes go wide.\n\n          WESLEY\n          Truck!\n\n          FOX\n          Go around it!\n\n          WESLEY\n          No! Shoot the tires!\n          Fox looks at Wesley, momentarily stunned by his idea,\n          then spins and fires away at the oncoming truck.\n          The front tires on the truck explode and the truck veers\n          hard right, where it bounces off a Fed Extrugk.,,, hat\n          sends it into a violent roll.\n          Wesley guns the Ferrari at the tumbling truck as it flips\n          forward... right over their car!!!\n          Wesley watches it fly over them, amazed his idea\n          worked... when finally it SMASHES down into the street\n          between them and Cross's Chevellel\n          Cross is forced to slam on his brakes and slide out...\n          but it's too late... his Chevelle smashes into the 4 X 4\n          before skidding to a stop, a tangled mess in the street.\n          Wesley snaps back to reality and rips the Ferrari off the\n          one-way street and down a side street.\n\n          EXT. CITY STREET - LATER\n\n          He pulls the car to a stop, then looks over at Fox,\n          amazed.\n\n          \n\n          \n\n          \n\n          \n\n          21.\n\n          FOX\n\n          (SMILING)\n          There's a lot of things you don't know\n          about yourself, Wesley.\n\n          WESLEY\n          Who was that?\n\n          FOX\n          That... was the man who killed your\n          father. And now he's trying to kill you.\n          Wesley forces a laugh, but right now it's hard to paint\n          any-thing as ludicrous.\n\n          WESLEY\n          No. I mean... I told you my father died\n          when I was a baby.\n          She leans right into his face so that their noses are\n          only inches apart.\n\n          FOX\n          Have you ever believed that? Have you\n          ever been content with that answer?\n          Wesley stops, not sure of anything right now.\n\n          FOX (CONT'D)\n          Today's your new birthday, Wesley.\n          Drive.\n          He settles back in his seat and pops the clutch again,\n          this time, easing.a little more respectably into traffic.\n\n          EXT. WAREHOUSE - LATER\n\n          The Ferrari cruises to a stop outside a warehouse.\n\n          FOX\n          The people I work with... we believe your\n          father passed his skills on genetically\n          to you. You knew how to handle the car,\n          you knew to shoot at the truck.\n\n          WESLEY\n\n          I... I...\n\n          FOX\n          It's that confidence we're gonna need to\n          work on.\n          Wesley is still dazed.\n\n          \n\n          \n\n          \n\n          \n\n          22.\n\n          FOX (CONT'D)\n          Now I want you to look at me and tell me\n          something. And I want you to be honest\n          with me.\n\n          WESLEY\n          What?\n\n          FOX\n          Do you think I look fat in this outfit?\n\n          WESLEY\n          What?!\n\n          FOX\n          I thought so. Let's go.\n          She hops out. They walk inside a...\n\n          INT. SLAUGHTERHOUSE - DAY\n\n          .t where Mr. Sloan stands next to a hucre man, THE\n          BUTCHER, who is slicing beef off of hanging cow\n          ca f es. There are flies buzzing around and blood\n          draining into the center of the floor.\n          If Wesley wasn't nervous before, he is now.\n\n          FOX\n          Mr. Sloan.\n          The Butcher looks up from his work and lays down the\n          knife, right next to where Mr. Sloan has a pair of silver\n          pistols and a magnifying glass resting on a rolling\n          table.\n\n          FOX (CONT'D)\n\n          (PROUDLY)\n          This is Wesley Gibson. He needs his life\n          changed.\n          The Butcher looks him over.\n\n          THE BUTCHER\n          We all end up where we belong, don't we?\n          The Butcher snickers. Sloan speaks up...\n\n          SLOAN\n          Fox told you about your father?\n          Wesley looks from Sloan to Fox to the Butcher and back to\n          Sloan.\n\n          \n\n          \n\n          \n\n          \n\n          23.\n\n          WESLEY\n\n          (STAMMERS)\n          Like I told... um... the lady here... I\n          think you might ha\n          ve me mixed up with\n          someone else. I'm just an... um...\n          account serv... uh..that is... account\n          manager... and... my father died...\n          He hesitates.\n\n          SLOAN\n          When?\n          They look at him, imploringly, waiting for an answer.\n\n          WESLEY\n          I... I guess I'm not sure.\n          Sloan simply picks up one of the pistols and sticks the\n          gun in Wesley's hand.\n\n          SLOAN\n          Shoot the wings off the flies.\n\n          WESLEY\n          What?!\n\n          SLOAN\n\n          (GROWLS)\n          Shoot... the wings... off the flies.\n          For. the first time, Wesley notices flies buzzing all\n          around.\n\n          WESLEY\n          I don't...\n          In the blink of an eye, Sloan has plucked the second gun\n          off the rolling table and ',s\n          -pointing it at Weslev's temple. He begins to count...\n\n          SLOAN\n          You have three seconds. Three... two...\n          Before he can say one, Wesley reacts... blindly firing\n          the pistol in his hand, indiscriminately, B,AM! BAM!\n          BAM! BAM! CLICK...CLICK...CLICK... until his finger is\n          just jamming on the trigger over and over.\n          After a moment, he looks up, unsure why he isn't dead.\n\n          \n\n          \n\n          \n\n          \n\n          24.\n          Sloan smiles, drops his pistol on the rolling table and\n          picks up the magnifying glass. He stoops down and\n          signals Wesley to do the same.\n\n          THROUGH THE MAGNIFYING GLASS:\n          Four flies lie on - the floor. crawling o d... their\n           wings actually separated from their bodies!\n\n           IN THE SLAUGHTERHOUSE:\n          Wesley jerks upright, trying to process this.\n\n          FOX\n          Like I said, you got the skills.\n\n          SLOAN\n          And after we fine tune those skills...\n          His eyes lock on to Wesley's, holding them in a vice-like\n          grip...\n\n          SLOAN (CONT'D)\n          .you're going to hunt the man who\n          killed Your father.\n          Wesley is as stunned as we've ever seen him... he blinks\n          a couple of times.\n\n          SLOAN (CONT'D)\n          Walk with me.\n          He drapes his arm around Wesley and leads him out the\n          door.\n\n          EXT. CITY BLOCK - DAY\n\n          Sloan and Wesley move down a busy commercial street.\n\n          SLOAN\n          I know thin is hard for you to\n          understand, Wesley, but I want you to\n          concentrate on what I'm saying. Your\n          father was a member of the Fraternity, a\n          collection of the most powerful assassins\n          the world has ever known.\n          They weave against the flow of pedestrians out and about\n          on the city streets. Instinctively, people step out of\n          their way.\n\n          WESLEY\n          But I've never heard of...\n\n          \n\n          \n\n          \n\n          \n\n          25.\n\n          SLOAN\n          We don't advertise Wesley. We blend into\n          the environment like moths against a\n          tree.\n\n          CUT TO:\n\n          INT. RESTAURANT - DAY\n\n          The CAMERA moves over a diner's counter...\n\n          SLOAN (V.0.)\n          We stay in the shadows.\n          .. to the kitchen, where a massive man with a three-\n          headed dog tattoo on his hand, flips burgers. THE CHEF.\n\n          CUT TO:\n\n          EXT. MANSION - DAY\n\n          The CAMERA moves across an expansive lawn...\n\n          SLOAN (V.0.)\n          We disappear into our surroundings.\n          .until it finds a man with a three-headed dog tattoo on\n          his hand, trimming a hedge. THE GARDENER.\n\n          CUT TO:\n\n          INT. GUN COUNTER - DAY\n\n          The CAMERA moves down a gun display case...\n\n          SLOAN\n          Because the easiest place to hide is in\n          plain sight...\n          .until it finds a GUN SALESMAN holding out a weapon to\n          an Italian customer. He also has the tattoo. He's THE\n\n          GUNSMITH.\n\n          BACK TO:\n\n          EXT. CITY BLOCK - DAY\n\n          Sloan is still walking with Wesley. Wesley watches every\n          face that passes them by... any of them could be\n          Fraternity members.\n\n          \n\n          \n\n          \n\n          \n\n          26.\n\n          SLOAN\n          ..until that time when we are called\n          into action.\n\n          CUT TO:\n\n          INT. RESTAURANT - DAY\n\n          The Chef loads plates of food up on the warmer, where a\n          WAITRESS picks them up and delivers them to a group of\n          prominent looking BUSINESSMEN.\n          The lead businessman digs into his steak, and immediately\n          his left arm starts to curl up, like he's having a heart\n          attack. His cohorts look on as he spills over, knocking\n          all the plates off the table, gasping for breath, his\n          throat closed.\n          When the CAMERA PANS OVER AGAIN, the Chef is gone.\n\n          CUT TO:\n\n          EXT. MANSION - DAY\n\n          The Gardener works his gardening shears on a hedge in the\n          front of this mansion... CLIP, CLIP, CLIP. We realize\n\n          A,\n          he's cutting a hole all the way through the hedge.\n          Then, he reaches down into his burlap sack and withdraws\n          a long range rifle with a scope. He pokes the rifle\n          through the freshly-cut hole, looks through the lens,\n          starts to squeeze his trigger...\n          The CAMERA SHOOTS WAY UP to give us an aerial view of the\n          neighborhood. We see that we are in the hills over the\n          city, and across the canyon, a Japanese man is just\n          pulling into his driveway, driving a black Audi, a mile\n          away.\n          He brakes his car, opens his door, but THWAPI A bullet\n          disintegrates his head and he topples over, never knowing\n          what hit him.\n          Back at the hole in the hedge, we see the Gardener's\n          eyeball looking through from the other side... until it\n          disappears and he is gone.\n\n          CUT TO:\n\n          EXT. STORE PARKING LOT - DAY\n\n          The customer takes the gun from the Gunsmith and pays him\n          in cash.\n\n          \n\n          \n\n          \n\n          \n\n          27.\n          He then tucks the gun in his belt and walks out the door,\n          like he's a bad-ass, instead of the goombah that he is.\n          He only gets a block before the gun at his waist\n          EXPLODES, causing him to flop on the sidewalk, like he\n          just stepped on a land mine.\n          The bell to the Gun Shop jingles as the Gunsmith leaves\n          and heads in the opposite direction, whistling to\n          himself, not paying attention to the pedestrians running\n          to help the dying Italian.\n\n          SLOAN (V.0.)\n          And when the time comes that we are\n          called, death is as certain as the sun.\n\n          CUT BACK TO:\n\n          INT. PHARMACY - DAY\n\n          Sloan and Wesley enter a normal looking pharmacy. They\n          pass through the small front room and head directly to\n          the back.\n\n          SLOAN\n          We have been active for centuries,\n          Wesley... outlasting rulers, governments,\n          nations, kings. We recognize no borders;\n          the entire globe is our killing field.\n          They are buzzed through by THE PHARMACIST, and enter...\n\n          INT. COMMUNICATIONS ROOM - DAY\n\n          .a sophisticated back room, where a trio of flat screen\n          monitors are mounted on the wall.\n\n          SLOAN\n          We are the baddest of the bad, the three-\n          headed dog that guards the gates of hell.\n          We show no mercy, we destroy the weak, we\n          have absolute power.\n\n          (BEAT)\n          But recently, a fallen angel, one of our\n          own, has challenged that power.\n          The screens in the room come to life with the face of\n          Cross.\n\n          SLOAN (CONT'D)\n          This man left the Fraternity and decided\n          to strike down those who had befriended\n          him, trained him, made him who he is.\n\n          \n\n          \n\n          \n\n          \n\n          29.\n\n          SLOAN (V.0.)\n          ..a son whose mother died in\n          childbirth...\n          They reach the baby's bed and a pair of strong arms lift\n          up the child. But the CAMERA FINDS the face of the\n          second man...\n\n          SLOAN (V.0.) (CONT'D)\n          ..he took the boy to an orphanage so his\n          true identity would never be discovered.\n          .and now we see that the other man is a YOUNG MR.\n\n          SLOAN.\n\n          SLOAN (V.0.) (CONT'D)\n          And I helped him.\n\n          'INT. COMMUNICATIONS ROOM - DAY\n\n          Wesley is still absorbing the story, his life so\n          different than when he got up in the morning.\n\n          WESLEY\n          Why would you do that?\n          Sloan puts a hand on Wesley's shoulder, gently.\n          Paternally.\n\n          SLOAN\n          Your father was like a brother to me.\n\n          (BEAT)\n          I will do anything to avenge his death.'\n          Sloan turns off the monitors and pulls over a wooden\n          chair from where it rests by a wall.\n\n          SLOAN (CONT'D)\n          So Wesley... you have a choice. Would\n          you like to go back to your job, your\n          girlfriend, your life, just as it was\n          before?\n\n          (BEAT)\n          Or would you like to begin your training\n          with an assassin's Fraternity that writes\n          the world's history in blood and bullets?\n          Wesley doesn't know what to say. Sloan moves to a back\n          door .\n\n          SLOAN (CONT'D)\n          If the answer is the latter, then have a\n          seat in that chair.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          30.\n\n          SLOAN (CONT'D)\n\n          (BEAT)\n          If not, you're welcome to head out this\n          door here and we'll never see each other\n          again.\n          With that., Sloan leaves through that back door. But...\n\n          ON THE OTHER SIDE OF THE DOOR:\n          He stops. He pulls out a gun and waits for Wesley to\n          make his decision, pointing his gun at the door.\n\n          BACK IN THE ROOM:\n          Wesley is still standing there, unaware of what is on the\n          other side of the door, thinking, thinking, thinking. He\n          takes a step toward the door...\n          FLASH: His boss Janice, yelling at him, mocking him.\n          Wesley hesitates, looks at the chair, then the door\n          again...\n          FLASH: His girlfriend on the couch, riding high on\n          Barry, loving every minute of it.\n          Wesley stands frozen, staring hard at the chair as THE\n          CAMERA STARTS to swirl around him.\n          FLASHES: The consultant haranguing, the other employees\n          laughing, eating.alone in the break room, riding his\n          bike, all the aspects of his shitty life...\n          .. as the CAMERA CONTINUES to swirl around him, his face\n          going hard...\n\n          WESLEY (V.O.)\n          Fuck consultants and fuck action items\n          and fuck differential responses. Fuck it\n          all.\n          He takes a seat in the chair, which creaks when he sits\n          in it.\n\n          WESLEY (CONT'D)\n          (out loud)\n          Fuck it all.\n\n          ON THE OTHER SIDE OF THE BACK DOOR:\n          Sloan hears the creak of the chair and lowers his gun.\n          He smiles and walks off down an alley.\n\n          \n\n          \n\n          \n\n          \n\n          31.\n\n          IN THE ROOM:\n          Wesley waits in the chair for what seems an eternity.\n          starts to bite his thumbnail, nervously.\n          In comes the Pharmacist. The man is built like a\n          mountain, with muscles rippling out of his white smock.\n          .He's got a British accent and is extremely polite.\n\n          THE PHARMACIST\n          'Ah, made your choice, did 'ja, of boy?\n\n          WESLEY\n\n          (UNCOMFORTABLY)\n          Yeah.\n\n          THE PHARMACIST\n          Very good, very good.\n          He walks behind Wesley.\n\n          THE PHARMACIST (CONT'D)\n          The weather's been lovely the last couple\n          o' days-- would you mind putting your\n          hands back here for me?\n          Wesley does, and the Pharmacist binds his hands with some\n          rope.\n\n          THE PHARMACIST (CONT'D)\n          There, that's it. Very good.\n\n          WESLEY\n          Is this the beginning of my training?\n\n          THE PHARMACIST\n          Quite right.\n          The Pharmacist cracks his knuckles and then,\n          WHAM!!! He hits Wesley so hard right in the cheek\n          that it almost knocks him out of the chair.\n\n          WESLEY\n          What the fuck are...\n          WHANIlM 4!!!1 The Pharmacist smashes him again.\n          Wesley struggles against the ropes but isn't going\n          anywhere. The Pharmacist rears back. and WHAM! WHAMMM!\n          WHAMQ! keeps hitting him over-and over again until\n          Wesley's eyes roll to the back of his head.\n\n          \n\n          \n\n          \n\n          \n\n          32.\n\n          FADE TO BLACK.\n\n          CUT TO:\n\n          WESLEY (V.O.)\n          You know how when you have a dream and\n          wake up unexpectedly...\n\n          INT. WESLEY'S A13ARTMENT - BEDROOM - DAY\n\n          Wesley jerks awake in his bed...\n\n          WESLEY (V.O.)\n          ...and the dream is still. on the fringe\n          of your brain but you can't quite\n          remember the details?\n          He looks up at his ceiling fan, barely turning, a few\n          blades missing...\n\n          WESLEY (V.0.) (CONT'D)\n          But then you see that same old busted\n          ceiling fan over your bed and you are so\n          damn glad it was just a dream?\n          He sits up on his bed and checks himself in the mirror.\n          His face has been pummeled; it looks like a piece of\n          squashed fruit.\n\n          WESLEY (V.0.) (CONT'D)\n          This was nothing like that.\n\n          EXT. ATM MACHINE - DAY\n\n          Wesley shoves his ATM card in the machine and hits the\n          \"check balance\" button. Which reveals: $100,000.92.\n          Amazed, Wesley takes out a grand, the machine just\n          spitting him money.\n          Smiling, Wesley jumps back on his ten speed and zips into\n          traffic.\n          The s in in wheel of the bicycle turns into...\n\n          INT. WESLEY'S CUBICLE - DAY\n\n          .that little spinning wheel on a monitor tbAt indicates\n          your computer stuck. Wesley sits in his cubicle,\n          staring at it.\n          Then...\n\n          \n\n          \n\n          \n\n          \n\n          33.\n\n          NICOLE\n          What happened to your face?\n          Wesley turns in his chair, surprised. Nicole stands\n          there, looking as pretty as ever, way out of -his league.\n\n          WESLEY\n\n          (SHEEPISH)\n          I... uh...I got hit by a man much bigger\n          than me.\n          Nicole smiles, flirtatiously.\n\n          NICOLE\n          Was this over a girl?\n\n          WESLEY\n          Something like that.\n\n          NICOLE\n          I had no idea you had such a secret life\n          outside of here.\n          She cocks her head and studies him.\n\n          NICOLE (CONT'D)\n          Is there something different about you?\n          Besides the... face?\n\n          WESLEY\n          No. Not really. Same old Wesley.\n\n          NICOLE\n          I don't think so.\n          She puts her hand on top of his; he can only stare at\n          it... this kind of thing just doesn't happen to him.\n\n          NICOLE (CONT'D)\n          You aren't like these people Wesley.\n          I've always thought you were different.\n\n          WESLEY\n          Would you consider me to be an observant\n          person?\n\n          NICOLE\n          What's that mean?\n          Wesley's about to say something, when he spots Janice\n          heading their way.\n          Wesley nods at her and Nicole frowns.\n\n          \n\n          \n\n          \n\n          \n\n          34.\n\n          NICOLE (CONT'D)\n          Uh-oh, here comes the wicked bitch of the\n          west...\n          With that, she steps away, just as Janice walks up.\n          Wesley stands to face his boss, as Janice launches into\n          him...\n\n          BOSS JANICE\n          Jesus H. Fucking Popscile, you don't have\n          time to get me the differential responses\n          but you got time to chitty-chatty with\n          the intern? Why do I even keep you\n          around, Wesley? Well I know one thing,\n          your review is coming up next week and I\n          can't wait to start checking me off some\n          boxes... attitude: poor, performance:\n          poor, management skills: poor, works well\n          with others...\n          Wesley just focuses on that mouth. Fat lips over fat\n          gums over yellow teeth. But now all that's coming out of\n          it is JIBBERISH.\n          ' I Jibberish that goes straight from her larynx to Wesley's\n          ears where it imbeds in the soft flesh of his brain and\n          BURNS... It's so goddamn loudl if only...\n          ...if only it would just...\n\n          WESLEY\n\n          (ROARS)\n\n          SHUT THE FUCK UP11!!1111\n          It's so unbelievably stunning coming out of Wesley's\n          mouth that it hits Janice like a slap in the face.\n          Heads all over the office start to poke out of the tops\n          of their cubicles like gophers coming out of holes.\n          Nicole watches, pleasantly stunned, from a few feet away.\n          Janice looks around, shocked. Wesley likes the way that\n          felt, so...\n\n          WESLEY (CONT'D)\n          Just because you have one single iota of\n          tenuous power, you think you can push\n          everyone around?\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          35.\n\n          WESLEY (CONT'D)\n          .I understand, Janice, that junior high\n          must have been particularly difficult\n          being called Tubby all the time, but that\n          doesn't give you the goddamn right to\n          treat your workers like horseshit. Sure\n          we laugh at you behind your back and sure\n          we know you keep a stash of jelly\n          doughnuts in the top drawer of your\n          desk...\n          Janice looks down at her fingers, which still have a\n          little grape jelly on them...\n\n          WESLEY (CONT'D)\n          .and sure everyone takes their lunch an\n          hour before you so we can get an extra\n          hour away from you, and I know that must\n          sting sitting by yourself in the White\n          Castle parking lot every day gnawing on\n          your third burger thinking up ways to\n          humiliate us...\n          Janice's eyes fall to her feet.\n\n          WESLEY (CONT'D)\n          .you know, if you weren't such a bitch,\n          we might actually feel sorry for you. As\n          it is, I feel I can speak for the rest of\n          the office when I say... FUCK YOU!!!\n          With that, he throws all the papers off his desk, sending\n          them flying!\n          Empowered, Wesley marches toward the elevators as\n          everyone watches him go, admiration plastered on their\n          faces.\n          The loudmouth from the break-room steps out...\n\n          LOUDMOUTH\n          That was great dude!\n          He holds up his hand for a high-five, but Wesley just\n          WALLOPS him with a right cross, not breaking stride on\n          his way to the elevators.\n\n          EXT. OUTSIDE WESLEY'S OFFICE - DAY\n\n          Wesley flies out the front door, just as Fox's Diablo\n          swings around the corner.\n\n          FOX\n          What's up, new man?\n\n          \n\n          \n\n          \n\n          \n\n          36.\n\n          WESLEY\n          You were watching?\n\n          FOX\n          Never stopped. How'd it feel, saying\n          exactly what you wanted to say?\n\n          WESLEY\n          Like I had a gun in my hands.\n          Fox grins as Wesley jumps in the car and she mashes on\n          the pedal. The Diablo's tires smoke as she launches it\n          out of there.\n\n          INT. SLAUGHTERHOUSE ROOM - DAY\n\n          They return to the butcher shop. Sides of beef hang from\n          hooks next to a cutting table. The Butcher is sharpening\n          a knife.\n\n          FOX\n          You need to get used to the blood and the\n          muscle and the meat and the sinew and\n          what a single blade of steel can do to a\n          chunk of flesh.\n          The Butcher turns and slices a chunk of tenderloin off of\n          one of the hanging carcasses, then slaps it on the table.\n\n          FOX (CONT'D)\n          Take care of him, Butcher.\n\n          THE BUTCHER\n          Will do, Fox.\n          The Butcher measures Wesley, then starts to talk in a\n          steady, almost bored voice...\n\n          THE BUTCHER (CONT'D)\n          Remember, it's the body we are killing.\n          Know it like a surgeon.\n          Wesley nods, half disgusted, half enthralled.\n\n          THE BUTCHER (CONT'D)\n          Okay, we'll start at the beginning. To\n          cut the subclavian artery, hold the knife\n          ice-pick style and thrust down behind the\n          clavicle, cutting side to side.\n          He jabs the blade into the beef... and just as he does...\n\n          \n\n          \n\n          \n\n          \n\n          37.\n\n          FLASH - PARKING GARAGE:\n          .we smash cut to a BUSINESSMAN walking to his car just\n          as the Butcher comes up behind him and performs the exact\n          same move he was just demonstrating. Just as quickly,\n          we...\n\n          FLASH - BACK TO THE SLAUGHTERHOUSE:\n          .and the Butcher performs the next move...\n\n          THE BUTCHER -\n          To slice the diaphragm, first whip your\n          wrist into the target's trachea to\n          prevent screaming, then drive the knife\n          at a forty-five degree angle upward just\n          below the rib cage.\n          Just as the knife hits the side of beef, we smash cut\n          to...\n\n          FLASH - LUXURY HOTEL SUITE:\n          . a DRUG KINGPIN coming out of his hotel bathroom\n          wearing a bathrobe. Suddenly the Butcher is on him,\n          performing what he just described on this poor bastard,\n          who can no longer scream because he's missing his\n          trachea, and just as quickly...\n\n          FLASH - BACK TO THE SLAUGHTERHOUSE:\n          .we are right back to the hanging side of beef as the\n          Butcher performs the next move...\n\n          THE BUTCHER\n          If you want the jugular, pull your\n          enemy's head to the left and jab your\n          knife well into his sterno-cleio-\n          mastoideus muscle, here, then cut down\n          and left.\n          Just like before, we smash cut to...\n\n          FLASH - DIRTY ALLEY:\n          ...a MAN moseying down an alley, carrying a briefcase,\n          when suddenly, the Butcher comes out of nowhere, pulls\n          the enemy's head to the left and then WHAM!, jabs the\n          knife into the neck, matching the move-he was just\n          demonstrating.\n\n          \n\n          \n\n          \n\n          \n\n          38.\n\n          7 FLASH - HACK TO THE SLAUGHTERHOUSE:\n          The butcher continues to hack away at the hanging meat,\n          describing more and more ways to kill with a blade...\n\n          WESLEY (V.O.)\n          They never show you this shit on the\n          McDonald's commercials.\n          .. as the CAMERA FINDS Wesley, who is completely absorbed\n          in the lesson. The Butcher hands him the knife, and\n          Wesley starts to make his first chops at it, wanting to\n          please the Butcher, wanting to get it right...\n\n          EXT. OUTDOOR CAFE - NIGHT\n\n          Fox is seated at a small outdoor cafe, sipping on a\n          latte, reading the paper. There's a story about the\n          death threats to Henry Helms on the front page.\n          Just then Wesley approaches, his face splattered with\n          flecks of blood. She wipes his face with a napkin.\n\n          FOX\n          You haven't quite figured out this whole\n          \"blending in\" thing, yet. Let's go.\n\n          EXT. MORGUE - NIGHT\n\n          A huge Chevy 4X4 pulls up and Fox hope out from behind\n          the wheel, followed by Wesley. They get to the door and\n          Fox pulls out a metal device to pick the lock.\n\n          WESLEY\n          What is this?\n\n          FOX\n          This...\n          She picks the lock and they step inside...\n\n          INT. MORGUE - NIGHT\n\n           the empty morgue examining room. Empty except for a\n          d d ozen dead b s laid out on slabs, covered by white\n          sheets.\n\n          FOX\n          This is the Roach Motel, Wesley.\n          Wesley looks around, disgusted.\n\n          \n\n          \n\n          \n\n          \n\n          39.\n\n          FOX (CONT'D)\n          All right, find us some skinny bitches.\n          Wesley uncovers the first body... it's a. black male.\n\n          FOX (CONT'D)\n          Nahh, let the brother rest. Find us some\n          white meat. And nothing too fat.\n          Wesley covers the black male and moves over to a second\n          body. He unveils it to reveal... what looks like a dead\n          suburban housewife.\n\n          FOX (CONT'D)\n          Perfect. Load up soccer mom.\n\n          INT. TARGET ROOM - NIGHT\n\n          Fox and Sloan stand next to a paper target -- the kind of\n          thing you see in a police target range. It shows the\n          outline of a head and torso with concentric rings for\n          where you're supposed to aim.\n          The Gunsmith hoists the corpse of the dead soccer mom on\n          to a hook that hangs ten feet in front of the paper\n          target. Sloan flips a switch and a motor takes the mom\n          and target to the end of the range.\n          The CAMERA PULLS BACK to show Wesley is with them\n          standing in one of those firearm booths at the opposite\n          end of the range.\n\n          SLOAN\n          Selecting your weapon and then disposing\n          of it is the most pivotal aspect of every\n          assassination.\n          An array of firearms are on a shelf next to Wesley.\n\n          SLOAN (CONT'D)\n          Pick one.\n          Wesley eyes all the weaponry. Finally, he settles on a\n          short-barreled black handgun. Sloan takes it from him\n          and inspects it.\n\n          SLOAN (CONT'D)\n          Excellent. This is an Imanishi 18. It\n          holds seventeen bullets in the clip and\n          one in the chamber. It's made of a\n          composite material unrecognizable by\n          metal detectors.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          40.\n\n          SLOAN (CONT'D)\n          And the Imanishi's bullets have\n          microchips that communicate with similar\n          ones in the gun.\n\n          WESLEY\n          Computer chips?\n\n          SLOAN\n\n          (NODS)\n          Sometimes the closest distance between\n          two points is not a straight line. What\n          if soccer mom here is between you and\n          your target?\n\n          WESLEY\n          I suppose you're going to tell me to\n          shoot her first.\n\n          SLOAN\n          How'd you do in Physics class?\n\n          WESLEY\n          Mostly B's.\n          Fox cocks her head at Wesley, knows he's lying.\n\n          WESLEY (CONT'D)\n          Okay, I got a D.\n\n          SLOAN\n          Why?\n\n          WESLEY\n          I couldn't remember all the rules --\n\n          SLOAN\n          That's it. Rules. What if I told you\n          there weren't any?\n          He nods at Wesley, like he's on to something.\n\n          SLOAN (CONT'D)\n          People live by the rules set before them.\n          We take them on faith that they are\n          right. But how many times in your life\n          have you thought you had a better way,\n          against-the rules that was simply laughed\n          at.\n\n          WESLEY\n          Every day.\n\n          \n\n          \n\n          \n\n          \n\n          41.\n\n          SLOAN\n          Because you use your brain differently\n          than other people. All Fraternity\n          members do.\n\n          WESLEY\n          I don't get it.\n\n          SLOAN\n          Humans use neurons to think. But most\n          people can only handle a small percentage\n          of those neurons firing at once without\n          suffering a seizure or an aneurism. Not\n          us. And not you. We have the ability to\n          think differently than other people.\n\n          WESLEY\n          So we set our own rules.\n\n          SLOAN\n          That's right.\n          Sloan hands him back the weapon.\n\n          SLOAN (CONT'D\n          Try it.\n          Wesley aims the pistol at the target in front of him. He\n\n          FIRES...\n          ..and the bullet plugs soccer mom in the shoulder.\n\n          SLOAN (CONT'D)\n          Have you ever shot a gun before?\n\n          WESLEY\n          Just the flies.\n\n          SLOAN\n          So you have no pre-conceived habits we\n          need to break. Shoot the target. Don't\n          hit mom.\n\n          WESLEY\n          You mean curve the bullet? How?\n\n          SLOAN\n          This isn't about \"how.\" It's about\n          \"what.\" If you'd never been told a\n          bullet flies straight and I handed you\n          this and said hit that target... what\n          would you do? Allow your instincts to\n          guide you. Just like the flies.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          42.\n\n          SLOAN (CONT'D)\n          The technology is only here to assist\n          your natural instinct.\n          Wesley lifts the gun, his mind racing...\n\n          SLOAN (CONT'D)\n          It's not 'will' that makes the physical\n          react how we wish, it's 'control.' You\n          are in control...\n\n          BAM BAM BAM!\n          The bullets blast out of the gun, like they are on a\n          track set up by Wesley's brain. He flicks his wrists\n          and...\n          .they arc qUickly, Just missing the body i e th2\n          center of the target!\n          Sloan smiles.\n\n          SLOAN (CONT'D)\n          Rules are made to be broken, Wesley. No\n          one was better at that than your father.\n          He had a pair of pearl-handled revolvers\n          with which he could conduct a symphony.\n          L i\n          Wesley nods proudly, and squeezes off some more shots,\n          all chasing through the same hole in the target.\n\n          DISSOLVE TO:\n\n          INT. WESLEY'S APARTMENT - DAY\n\n          Cathy jumps up from the couch when Wesley comes in.\n\n          CATHY\n          Oh my god, Wesley, where have you been?\n          I've been so worried!\n          But Wesley just pushes past her and starts to throw\n          clothes out of drawers into a black duffel bag.\n\n          CATHY (CONT'D)\n          What're you doing? Are you leaving? You\n          .owe rent!\n          But Wesley just keeps packing.\n\n          CATHY (CONT'D)\n          You can't leave! This is bullshit,\n          Wesley. Bullshit, bullshit, bullshit.\n\n          \n\n          \n\n          \n\n          \n\n          43.\n          Wesley just zips up his bag and turns back toward the\n          door...\n          .where Egx is now standing, wearing outf' that\n          would make the devil blush.\n\n          CATHY (CONT'D)\n          Who the fuck are you?\n          But Fox doesn't even acknowledge her presence, and just\n          watches Wesley do his business.\n          Wesley walks out the door and Fox follows. Cathy chases\n          them out on to the landing...\n\n          CATHY (CONT'D)\n          You're nothing, Wesley! And you will\n          always be nothing! You think you're\n          gonna be happy.with that skank...\n          Uh-oh...\n          Fox stops and turns around -- fisting her pistols.\n          She unloads... BAM! BAM! BAM! BAM! BAM!\n          The CAMERA SWINGS OVER TO CATHY, who is about to pies\n          herself, standing in the door frame, with bullet holes\n          placed expertly around her head.\n          Wesley and Fox keep moving, down the steps. Barry is\n          coming up the steps, but he takes one look at them, does\n          a U-turn and hurries out of their path.\n\n          INT. FOX'S PENTHOUSE - NIGHT\n\n          Wesley tosses his bag into the corner of this\n          immaculately furnished penthouse apartment, overlooking\n          the skyline.\n\n          FOX\n          You can take the couch until we find you\n          someplace better.\n\n          WESLEY\n          Okay.\n          She moves toward a separate bedroom.\n\n          WESLEY (CONT'D)\n          Fox?\n          She stops.\n\n          \n\n          \n\n          \n\n          \n\n          44.\n\n          C WESLEY (CONT'D)\n          What was my father like?\n          For a moment, she thinks about it. Then...\n\n          FOX\n          Come on.\n\n          EXT. CITY STREET - NIGHT\n\n          They walk down a downtown lane, buildings crowding in on\n          them from all-sides. Not too many people are out this\n          late; they have the sidewalk to themselves.\n\n          FOX\n          Your father lov ed you, Wesley. He talked\n          about you all the time.\n\n          WESLEY\n          Really?\n          Wesley looks at her hopefully. She smiles, thinking\n          about the past.\n\n          FOX\n          That's a fact. He knew he wasn't\n          supposed to, but he couldn't help it.\n\n          WESLEY\n          You worked with him?\n\n          FOX\n\n          (NODS)\n          He trained me. Made me what I am.\n\n          CUT TO:\n\n          EXT. ALLEY - NIGHT - FLASHBACK\n\n          A younger, greener Fox stands alone in the alley, eyes\n          scanning the rooftops.\n\n          FOX (V.0.)\n          I remember one night he had me on my own\n          .for the first time, and I was tagging\n          this target named Buster Burgess. But I\n          was green and clumsy and stupid. Buster\n          marked me and disappeared into this old\n          tenement building.\n\n          \n\n          \n\n          \n\n          \n\n          45.\n\n          (-. EXT. TENEMENT ROOFTOP - SAME - FLASHBACK\n\n          A shadowy figure creeps to the edge of the building and\n          looks down. We can't quite make out his face. Fox is\n          looking the other way and he's got a clean shot.\n          He raises a rifle to his eye...\n\n          BAM!\n          He nails Fox in the thigh, and she falls helpless to the\n          pavement.\n\n          FOX (V.0.)\n          Motherfucker shot mein the leg. Put a\n          damn hole in my favorite skirt.\n          The figure re-aims, ready to take out the helpless Fox.\n\n          FOX (V.0.) (CONT'D)\n          Then you know what happened?\n\n          WESLEY (V.0.)\n          My father saved your life? Put a bullet\n          in Burgess?\n          k,\n\n          FOX (V.0.)\n          Naww. I ended up with four more slugs in\n          me.\n          The figure unleashes four more shots.\n\n          BACK TO:\n\n          EXT. CITY STREET - NIGHT\n\n          They turn a corner and head up into the lobby of a tall\n          building, their conversation continuing...\n\n          WESLEY\n          What kind of training is that?\n\n          FOX\n          I'm here, aren't I?\n\n          INSIDE THE LOBBY:\n          Wesley weighs all this, puts it together.\n\n          WESLEY\n          My father was Burgess, wasn't he?\n          Fox nods, smiling. They step...\n\n          \n\n          \n\n          \n\n          \n\n          46.\n\n          INSIDE AN ELEVATOR:\n          .andstart riding it up.\n\n          FOX\n          He didn't hit me anywhere important, and\n          he used pin-shot bullets that didn't do\n          any real damage. But you can be damn\n          sure I don't let any mark get the high\n          ground on me again.\n          Shesmiles at another thought.\n\n          FOX (CONT'D)\n          And you know what we did instead of go to\n          the hospital to stitch me up?\n\n          WESLEY\n          What?\n\n          FOX\n          We went driving.\n\n          CUT TO:\n\n          EXT. CITY STREET -- NIGHT - FLASHBACK\n\n          A PORSCHE SHOWROOM sits on the corner. SMASH! A black\n          911 convertible breaks through the glass and skids to a\n          stop next to Fox in the street.\n          Two hands pull her up and drop her in the passenger seat,\n          and the car roars off.\n\n          BACK TO:\n\n          EXT. ELEVATOR -- NIGHT\n\n          Wesley smiles. The elevator DINGS.\n\n          EXT. ROOFTOP - NIGHT\n\n          Fox and Wesley step out on to the rooftop where Mr. X was\n          gunned down.\n\n          WESLEY\n          What's this?\n\n          FOX\n          This is where your father was killed.\n          Wesley's eyes narrow and he looks around, taking it all\n          in.\n\n          \n\n          \n\n          \n\n          \n\n          47.\n\n          WESLEY\n          How?\n\n          FOX\n          We're not sure. The fence he was meeting\n          was shot in the head... which led him out\n          to here... but it must've been a set-up\n          all along. All I know is it would take a\n          hell of a trap to bring your father down.\n          Wesley crouches down by where his father's body would\n          have been, running his fingers over the gravel rooftop.\n\n          WESLEY\n          My whole life I thought he was dead. I\n          shouldn't feel any differently just\n          because it happened 20 years later.\n\n          FOX\n          But...\n\n          WESLEY\n          But, I do. Like I missed my one chance.\n\n          FOX\n          Well that's why you're here. To make up\n          for lost time.\n          Wesley looks back at her.\n\n          WESLEY\n          Can I see his body?\n\n          CUT TO:\n\n          INT. SHITTY MORGUE - NIGHT\n\n          They stand in a dark corner of a decrepit morgue, where a\n          couple of urns rest on a counter. The place doesn't look\n          like much more than a crack-house.\n\n          FOX\n          We cremate our dead. I'd like to say\n          it's to honor them, but it's mainly to\n          keep anyone from identifying them after\n          they're gone.\n\n          WESLEY\n          These are my father's ashes?\n\n          FOX\n          Yeah.\n\n          \n\n          \n\n          \n\n          \n\n          48.\n\n          WESLEY\n          Sloan said his heart stopped but there\n          was no entry wound?\n\n          FOX\n          That's right.\n\n          WESLEY\n          Can I have a minute?\n\n          FOX\n          Sure.\n          She leaves and Wesley approaches the urn holding his\n          father's'remains.\n          He runs his finger over it, and just when we think he's\n          going to have an emotional moment...'\n          ..he smashes the urn on to the stand, the ashes spilling\n          out everywhere.\n          Wesley runs his fingers through the decay: what a\n          mess... there are pieces of bone intermingled in the\n          cremains.\n          But then hisfingegs find something in the dust... a\n          BULLET with a hole running down its center. He holds it\n          up to the light for a closer look.\n          As he studies it, we start to hear... WHAM! WHAMI...\n\n          INT. SMALL ROOM - DAY\n\n\n          WHAM! WHAM! WHAM!\n          Wesley site with his hands tied behind his back, taking\n          another beating from The Pharmacist, who spouts\n          assassination techniques while he pummels Wesley.\n\n          THE PHARMACIST\n          If you get in the hoo-ha of a two on one\n          and find yourself the one, remember that\n          each foe will likely move at the same\n          steady speed away from each other,\n          allowing you to keep a gun on each.\n\n          WHAM! WHAM!\n\n          THE PHARMACIST (CONT'D)\n          Now, if you find yourself one ' on three,\n          that poses a real bit a' ball ache...\n\n          \n\n          \n\n          \n\n          \n\n          49.\n          The sound of the Pharmacist's voice fades to the\n          background as Wesley's voice-over comes up...\n\n          WESLEY (V.0.)\n          There are two kinds of pain. One is an\n          object. A living thing that crawls\n          around the outside of your body. Cuts,\n          broken bones, bruises... all deliver the\n          kind of pain you can learn to ignore, and\n          they soon disappear to nothing but the\n          sound of a gnat in your ear.\n          Wesley's eyes are starting to lose consciousness.\n\n          WESLEY (V.0.) (CONT'D)\n          I've lived with a different kind of pain\n          all my life... the kind that comes from\n          two decades of being passed over, pushed\n          around, ignored. But you can't hide from\n          that kind of pain either...\n          Wesley takes a brutal shot to the face.\n\n          WESLEY (V.0.) (CONT'D)\n          .because it finds you.\n          He involuntarily spite blood as his eyes roll back in his\n          head.\n\n          INT. INTERROGATION ROOM - DAY\n\n          Sloan sits across from Wesley at a skinny table in an\n          otherwise bare room.\n\n          SLOAN\n          Watch the eyes. Look for a slight\n          swelling of the pupil. You can train\n          your body to stay a constant temperature,\n          you can control your heartbeat, but you\n          can't control the center of your eyes.\n          That's how you know when someone is lying\n          to you.\n          Sloan looks right at him. Wesley narrows his eyes,\n          trying to fend off his stare.\n\n          SLOAN (CONT'D)\n          Do you want to fuck Fox?\n\n          WESLEY\n          No.\n\n          \n\n          \n\n          \n\n          \n\n          50.\n\n          SLOAN\n          I know that's a lie without even seeing\n          your eyes.\n\n          WESLEY\n          Fine. Try something else.\n\n          SLOAN\n          Okay. What are you hiding from me?\n          Wesley looks down, then focuses on Sloan.\n\n          WESLEY\n          Nothing.\n          Sloan waits. Wesley realizes it's useless to try to keep\n          something from this man. He reaches into his pocket and\n          pulls out the bullet with the hole in its center...\n          places it on the table.\n\n          WESLEY (CONT'D)\n          You told me to hunt down my father's\n          killer. That's what I'm doing.\n\n          SLOAN\n          What's this?\n\n          WESLEY\n          The bullet that killed him. You said his\n          heart stopped but there was no entrance\n          wound. This bullet has a hole cut into\n          its center...\n\n          SLOAN\n          Yes?\n\n          WESLEY\n          You know how a mole buries into the earth\n          by pushing the dirt back around it? I\n          think this bullet does what the mole\n          does... Splits the skin and pushes it\n          back through its center, filling the\n          space it just passed through.\n          Sloan looks at him, like he might have been\n          underestimating him until now.\n\n          WESLEY (CONT'D)\n          Fox was telling me that my father used\n          special bullets. It looks like Cross\n          does too... which means these are custom\n          made. If we find who makes them, then we\n          find someone who has access to Cross.\n\n          \n\n          \n\n          \n\n          \n\n          51.\n          Sloan picks up the bullet and leans back.\n\n          SLOAN\n          You put this all together on your own?\n          Wesley taps his head.\n\n          WESLEY\n          Firing neurons.\n\n          (BEAT)\n          Whatever happened to my father's guns?\n          The pearl handled ones?\n\n          SLOAN\n          Don't know. But whoever has them isn't\n          long for this place.\n          Sloan reaches down and picks up a binder which he drops\n          on the desk.\n\n          WESLEY\n          What's that?\n\n          SLOAN\n          Cross. The details of his life.\n          q Continue your hunt.\n\n          WESLEY\n          No rules, right?\n          This stops Sloan for a second.\n\n          SLOAN\n          No rules.\n\n          INT. FOX'S PENTHOUSE - DAY\n\n          Wesley lies on Fox's couch, trying his damndest not to\n          peek at her through her bedroom door. It's cracked just\n          enough that he can see her draping a towel around her\n          body as she heads to take a shower.\n          Wesley site up and looks at the binder sitting on the\n          table. Slowly he opens it and sees a picture of Cross\n          staring back at him. The man who took Wesley's father\n          from him.\n          Wesley studies the face, wanting to know every detail.\n\n          \n\n          \n\n          \n\n          \n\n          52.\n\n          IN THE BATHROOM:\n          Fox peers out the door and looks at Wesley, watching him\n          absorb more of Cross with every page.\n\n          CUT TO:\n\n          INT. LIBRARY - DAY\n\n          Sloan leads Wesley into a gigantic room lined from floor\n          to ceiling with leather-bound books.\n\n          SLOAN\n          We keep a record of every assassination\n          mission, going back to the Ides of March.\n          Maps, diagrams, logistics, complications,\n          weapons of choice... it's all there.\n          Wesley nods, impressed. Sloan just keeps leading him\n          through a set of double doors, into...\n\n          INT. MAP ROOM -- DAY\n\n          .a large room, the size of an auditorium. On the floor\n          is a gigantic model of the entire city, built to scale,\n          showing all the buildings, skyscrapers, churches, the\n          waterfront, the city streets. Everything the city has to\n          offer laid out in miniature.\n          Sloan and Wesley stand like giants in the middle of the\n          model city...\n\n          WESLEY\n          What's all this?\n\n          SLOAN\n          Where we plot our local hits. This city\n          is one of the Fraternity's major\n          headquarters.\n\n          WESLEY\n          (looking around)\n          This room. The books. Seems low-tech.\n\n          SLOAN\n          Part of mastering technology is knowing\n          when to use it. Models can't be hacked.\n          Your father built this room himself.\n          Most of the buildings are white, but interspersed amongst\n          them are a few vainted red. Some of the model street\n          lamps are also red.\n\n          \n\n          \n\n          \n\n          \n\n          53.\n          The color red appears sporadically throughout the entire\n          model city: on the sides of buildings, on mailboxes, on\n          some of the manhole covers.\n\n          WESLEY\n          What's with the red ones?\n          Sloan just smiles...\n          .and THE CAMERA MOVES TO HIS FEET, then PUSHES'IN on\n          one particular street on the map, further in on one RED\n          STREETLIGHT and we...\n\n          DISSOLVE TO:\n\n          EXT. STREET - DAY\n\n          .the s city street, now full-sized, buzzing with\n          activity, pedestrians hurrying to work, cars and taxis\n          and trucks whizzing through the street.\n          Sloan and Wesley walk down the sidewalk, passing\n          streetlight after streetlight until they reach one in\n          particular.\n\n          SLOAN\n          The Fraternity's grasp reaches every\n          facet of the world's major cities,\n          including their construction. Look at\n          this streetlight.\n          Wesley peers at it... there is a plaque affixed to the\n          pole... the standard thing you find on these things...\n          \"Municipal C. W. 63070.\"\n          But then there is something different on this one... a\n          tiny symbol on the bottom of the plaque... the Cerberus\n          instead of the seal of the cit\n          Sloan presses the symbol and the plaque slides aside,\n          revealing a hollow space behind it. He reaches his hand\n          inside and pulls out a small handgun... flips out the\n          clip expertly, then racks the weapon.\n          Wesley can't believe it.\n\n          WESLEY\n          You have stashes...\n\n          SLOAN\n          .everywhere.\n\n          WESLEY\n          Jesus.\n\n          \n\n          \n\n          \n\n          \n\n          54.\n          Just then, two POLICE OFFICERS walk by, eye.the gun Sloan\n          has pulled out.\n\n          POLICE OFFICER\n          Sir...\n          Sloan flashes his tattoo at them.\n\n          SLOAN\n          Keep moving, fellas.\n          They nod and do just that.\n\n          SLOAN (CONT'D)\n          They let us do our jobs, we let them\n          live.\n          THE CAMERA PUSHES IN on Wesley's face as he realizes the\n          full scope of this organization and we...\n\n          DISSOLVE TO:\n\n          SERIES OF SHOTS:\n          GUN RANGE. Wesley firing his Imanishi 18 on the shooting\n          range, steering the bullets wherever he wants them to go.\n\n          WESLEY\n          Closer.\n          Impressed, the Gunsmith moves the corpse closer to the\n          target, making the angle all that much tougher.\n          Wesley gets ready to squeeze his trigger, but a pistol\n          starts FIRING next to him.\n          He looks over... Sloan is standing nr= &o him, firing at\n          the target. Every shot bends around the body and hits\n          right in the forehead of the target.\n          Wesley smiles, impressed.\n          LIBRARY. Wesley thumbs through an old Fraternity book,\n          which has detailed sketches of an assassination in 17th\n          century Paris.\n          MEAT LOCKER. Wesley working out on a heavy bag, honing\n          his punches, the Chef holding the bag for him, muscles\n          rippling.\n          MAP ROOM. Wesley walks by himself amongst the miniature\n          city, trying to memorize where the red marks are.\n\n          \n\n          \n\n          \n\n          \n\n          55.\n          INTERROGATION ROOM. Wesley sitting here,. being grilled\n          by Sloan, as he tries to-tell the undetectable lie.\n\n          SLOAN\n          Our job isn't just about how fast or true\n          you shoot, Wesley. Physical agility will\n          always lose to mental agility. It's\n          warfare of the mind.\n          FO 'S APART. Wesley looking at Fox through the\n          bedroom door.\n          SLAUGHTERHOUSE. Wesley working with the Butcher on the\n          art of knife play.\n          MAP ROOM. The Gardener and Fox show Wesley the rooftop\n          of a certain building on the model city, one corner of\n          the roof painted red.\n          ROOFTOP. Fox and the Gardener now with Wesley on that\n          actual rooftop, pointing out firing angles, modes. of\n          ascension, and escape routes. The Gardener moves over to\n          a cornerstone in the roof of the building and then easily\n          lifts it off, revealing a stash of assault rifles.\n          k SHOOTING G . Wesley looking at some ammunition while\n          the Gunsmith talks and demonstrates. He fires at one of\n          the targets, which EXPLODES in a splattered mess and we\n          cut to...\n\n          INT. FOX'S PENTHOUSE - MORNING\n\n          Fox making coffee as Wesley sits, studying the binder,\n          his mind racing.\n\n          WESLEY\n          Cross and my father were tight. But\n          Cross thought he should be one of the\n          heads of the Fraternity so he left and\n          vowed to kill the three heads. Which\n          means my father is dead because of petty\n          jealousy.\n\n          FOX\n          More reason for Cross to die.\n          Wesley flips to the picture of cross.\n\n          WESLEY\n          But I don't see jealousy in those eyes,\n          do you?\n          Fox walks over and slams the binder shut.\n\n          \n\n          \n\n          \n\n          \n\n          56.\n\n          FOX\n          Listen .to me, Wesley. In two weeks, we\n          have to kill Henry Helms. Do-you know\n          who that is?\n\n          WESLEY\n          The journalist who's got a price-tag on\n          his head.\n\n          FOX\n          A price-tag that we're going to collect.\n          Your father was meeting with a fence\n          about the job when Cross took him down.\n          So we can only assume Cross knows about\n          the target too. We... you... have to\n          take Cross out before we prosecute this\n          mission. We can't have him out there as\n          a wildcard, wreaking havoc, do you\n          understand?\n\n          WESLEY\n          Yeah.\n\n          FOX\n          We've never defaulted on a job and this\n          1k one won't be the first.\n\n          INT. TARGET ROOM - DAY\n\n          Sloan fires at the target, the bullets following his\n          every command. Wesley does the same, equally skilled.\n          Fox sits, watching the two of them. Is it becoming\n          competitive? One shoots and then the other follows,\n          neither one ever missing.\n          Finally, Gunsmith runs the target back in to change out\n          the body.\n          Fox leans back, impressed.\n\n          FOX\n          May have found your match, Sloan.\n          Sloan smirks and turns to instruct Wesley.\n\n          SLOAN\n          Pick the weapon, make the kill, destroy\n          the weapon. No other rules.\n          Wesley nods as Gunsmith returns.\n\n          \n\n          \n\n          \n\n          \n\n          57.\n\n          WESLEY\n          (to the Gunsmith)\n          Close the gap. Push the body closer to\n          the target..\n\n          THE GUNSMITH\n          It's already at four feet.\n\n          WESLEY\n          Closer.\n\n          THE GUNSMITH\n          Here's two. Your father couldn't even do\n          that.\n\n          WESLEY\n          Closer.\n\n          THE GUNSMITH\n          Wesley, at some point --\n\n          WESLEY\n          Closer. I'll say when.\n\n          WN\n          Gunsmith starts sliding the target closer to the body,\n          until it's actually touching the back of the dead\n          business man!\n\n          THE GUNSMITH\n          How you gonna -- ?\n\n          FOX\n          Just run it out there. Let the kid work.\n          The Gunsmith shrugs and runs the target down the range.\n          Wesley looks at Sloan.\n\n          WESLEY\n          You wanna go first?\n\n          SLOAN\n          There are limits to everything, Wesley.\n          At some point the body becomes a shield.\n          Wesley pulls his gun and lets loose five rounds,\n          lightning fast.\n          The Gunsmith brings the target back to them...\n          ..a the business man is riddled with es.\n\n          THE GUNSMITH\n          I guess not every rule can be broken.\n\n          \n\n          \n\n          \n\n          \n\n          58.\n\n          WESLEY\n          Check the target.\n          The Gunsmith does and we see that each of the five\n          bullets has passed clean through the cadaver and found\n          it's mark on the target.\n\n          WESLEY (CONT'D)\n          You'll find one entry below the shoulder,\n          missing the major blood vessels there,\n          exiting the back. Second shot went\n          through the abdomen, clipped only the\n          bowel and exited cleanly. Third hit the\n          upper right quadrant of the abdomen,\n          which is partially protected by the\n          ribcage, and passed through the liver and\n          probably part of the gallbladder. Upper\n          left abdomen is a good place, where\n          number four ruptured the spleen before\n          continuing down main street. And\n          finally, what I like to call \"the ,7FK.\"\n          Number five entered the mouth, was\n          redirected downward by the upper jawbone\n          ON, and exited the back of the neck. That's\n          the shot you'll find in the middle of the\n          target.\n          Gunsmith sticks his finger through the hole in the middle of the target.\n\n          WESLEY (CONT'D)\n          (to Sloan)\n          Fuck the rules.\n          With that, he turns and walks away, a look on his face\n          that is his fiercest, a far cry from the kid in the\n          cubicle. That same expression is on his face as we...\n\n          CUT TO:\n\n          INT. INTERROGATION ROOM - DAY\n\n          Wesley strains against the ropes that bind his hands as\n          The Pharmacist waylays him. But is t' e. Wesley counts\n          out the punches as he takes the shots.\n\n          WESLEY\n          One!\n          There is a look in Wesley's eye we, haven't seen before, a\n          burning, searing fire.\n          As he continues to take punches and count them out...\n\n          \n\n          \n\n          \n\n          \n\n          59.\n\n           WESLEY (CONT'D)\n          Two! (WHAM!) Three! (WHAM!) Four!\n\n          (WHAM!) FIVE!! (WHAM!!)\n          ..he pulls his arms tight, and his muscles start to\n          twitch and bulge -- muscles we didn't know he had until.\n          now -- and as he continues to take punches, WHAM!, WHAM!,\n          WHAM!!, the rope strains against the wooden chair, and we\n          can HEAR the wooden legs start to pop, until...\n          CRACK!!! Wesley Jerks his arms ee and comes\n          swillcrincr with the broken of leg of the chair.\n          SMASH! SMASH!! The Pharmacist goes down hard and Wesley\n          stands over him, out of control,. furious, SMASH! SMASH!,\n          beating him with that broken chair leg.\n          The CAMERA PUSHES THOUGH one of the walls...\n\n          OBSERVATION ROOM:\n          .. to where Fox and Sloan are watching Wesley pummel the\n          pummeler through a one-way mirror.\n\n          SLOAN\n          He's ready.\n          the los2k on Fox's face becomes more and more and\n          sexual until...\n\n          INT. FOX'S PENTHOUSE - NIGHT\n\n          ..she leans on top of Wesley, straddling him on too of\n          her bed.\n          They unleash on each other, and from the looks of it, Fox\n          makes Cathy seem like a nun.\n\n          FOX\n          Don't you quit now, baby! Don't you quit\n          now!!\n          Wesley didn't know it could be like this.\n          After they finish, Fox gets up and heads to the shower\n          and he watches her go the whole way.\n          In the doorway, she turns around...\n\n          FOX (CONT'D)\n          Sloan says you're ready.\n\n          \n\n          \n\n          \n\n          \n\n          60\n\n          INT. TATTOO ROOM - DAY\n\n          Wesley site in a chair as Fox crouches next to him with\n          an advanced tattoo machine, inking his hand.\n\n          WESLEY\n          Do you like being the only chick in the\n          Fraternity?\n\n          FOX\n\n          (COYLY)\n          Who said I was the only sister? Maybe\n          you just haven't met any others yet.\n          Wesley laughs.\n\n          WESLEY\n          (playfully back)\n          Maybe I have and I'm just not telling\n          you.\n\n          FOX\n\n          (GRINNING)\n          Hold still.\n          He settles down.\n\n          WESLEY\n          How did you end up here, Fox?\n\n          FOX\n          Same way you did, sugar. They found me.\n\n          WESLEY\n          What did you do before?\n          Fox looks at him, a wry smile on her face.\n\n          FOX\n          Sold perfume. At the mall.\n\n          WESLEY\n          No shit?\n\n          FOX\n          No shit.\n\n          WESLEY\n          I can't see it.\n\n          FOX\n          Get in line.\n\n          \n\n          \n\n          \n\n          \n\n          61.\n\n          WESLEY\n          What made them come after you? I mean, I\n          know why I'm here.\n\n          FOX\n          Fraternity members all have something in\n          their lineage that shows they'll be good\n          at this.\n\n          WESLEY\n          And yours is?\n\n          FOX\n          My great-great-great-grandfather on my\n          mother's side. He was on a slave ship\n          coming over from East Africa and as it\n          was pulling into Charleston, he killed\n          every white man on the ship and swam to\n          shore. They caught him and hung him four\n          days later.\n\n          WESLEY\n          That's terrible.\n\n          FOX\n          I Nah. Motherfucker deserved it. Be raped\n          eight women in those four days. One of\n          them was my great-great-great-grandmama.\n          She pushes her chair back, done with her work.\n          The CAMERA PUSHES IN as Fox removes the device so we can\n          take a look: the three-headed dog has been tattooed into\n          his hand.\n\n          EXT. CITY STREET - NIGHT\n\n          Wesley and Fox walk down a crowded urban city street. The\n          CAMERA finds Wesley's tattoo and then moves around behind\n          Fox and holds on hers.\n\n          WESLEY\n          Where's the Diablo?\n\n          FOX\n\n          (SHRUGS)\n          I got tired of the color.\n          Wesley can't help but smile, then Fox stops. They're\n          standing right in front of a CAR SHOWROOM, displayed in\n          the window is a MIDNIGHT BLACK PORSCHE 911 convertible\n          sitting in a showroom window... 'us like the one\n          Wesley's father smashed in Fox's story.\n\n          \n\n          \n\n          \n\n          \n\n          62.\n\n          EXT. SHOWROOM - NIGHT\n\n          Suddenly, the car comes flying out of the window, glass\n          shattering everywhere as it tears up the street.\n\n          WESLEY (V.0.)\n          Being a member of the Fraternity was like\n          winning the lottery...\n\n          ON THE CITY STREETS:\n          Traffic lights mean nothing, as Wesley mashes the\n          accelerator to the mat, and the Porsche responds, ripping\n          up the road like a tiger on the prowl.\n          Fox rises up in the passenger seat, looking over the\n          windshield, the wind whipping her face...\n\n          WESLEY.(V.0.)\n          This... this is what my dad's life was\n          like. He was a fucking god.\n          He weaves in and out of traffic, then rips around a\n          corner, narrowly cutting in front of an eighteen-wheeler,\n          which has to slam on its brakes.\n\n          WESLEY (CONT'D)\n          Where we headed?\n\n          FOX\n          Trial by fire, sugar. Hook a right.\n          Wesley whips the car around a corner...\n\n          FOX (CONT'D)\n          Park it here, baby.\n          He pulls the car to the side of the street...\n          .in front of a busy outdoor mall. It's covered with\n          shops, eateries, movie theaters and people, people,\n          people.\n          Fox eyes the crowd.\n\n          WESLEY\n          You need a new wardrobe or something?\n\n          FOX\n          we're here for a reason and it ain't\n          clothes-shopping. Somewhere in that\n          crowd is your first target.\n\n          \n\n          \n\n          \n\n          \n\n          63.\n\n          WESLEY\n          A test?\n\n          FOX\n          (shakes her head)\n          The real thing.\n\n          WESLEY\n          Who's the mark?\n\n          FOX\n          You'll know him when you see him.\n\n          WESLEY\n          What if I don't?\n\n          FOX\n          Then you get shot.\n          Fox hands him his Imanishi pistol, which Wesley rolls\n          over in his hand.\n\n          FOX (CONT'D)\n          It's graduation day, baby.\n          I He nods and makes his way toward...\n\n          THE OUTDOOR MALL:\n          .where he quickly mingles with the crowd. He has his\n          hands tucked into the front pocket of his hooded-\n          sweatshirt, the pistol inside. People pass him on his\n          left and right, some make eye contact, some don't...\n          anybody could be the target..\n          Wesley's eyes scan to the rooftops, surveying... the\n          SECURITY GUARD by the theater, the SWEATER-FOLDER at The\n          Gap, the SCARY-LOOKING GUY shopping at the sunglasses\n          stand.\n          And then Wesley's eyes settle on someone he was not\n          expecting to see... Barry, his best friend that was\n          shagging his girlfriend... is thumbing through books\n          outside the BARNES AND NOBLE... seemingly. not paying\n          attention to what's around him.\n          Wesley can't believe it. It can't be him. Can it?\n          Just then, Barry stops looking at the books and starts\n          walking toward Wesley, keeping his eyes down. Fuck, this\n          can't really be happening...\n\n          \n\n          \n\n          \n\n          \n\n          64.\n          ..Wesley gets ready, both hands inside that front\n          pocket...\n          .and now Barry meets his eyes... still coming... still\n          coming...\n\n          BARRY\n          Wesley... hey dude.\n          Wesley can't believe itl\n\n          BARRY (CONT'D)\n          Thanks for calling me. I wanted to\n          say...\n          Wesley pulls out his gun and Barry throws up his hands...\n\n          BARRY (CONT'D)\n          Whoa, man!!\n          But now we see Wesley is looking past B_arry. over his\n          shoulder...\n\n          WESLEY\n          Get down!\n          .and he's looking at a man we recognize from his\n          office... The Consultant.\n          He's approaching rapidly behind Barry, fisting a 'pair of\n          pistols!\n          Just as Barry hits the deck, Wesley pulls the trigger...\n          .but it lust CLICKS, the chamber empty...\n\n          SMASH CUT TO:\n\n          THE PORSCHE:\n          Fox holds the clip to Wesley's Imanishi, tapping it in\n          her hand. Holy shit, she gave him an empty gun...\n\n          SMASH BACK TO:\n\n          THE OUTDOOR MALL:\n          Wesley can't believe his gun is empty. In the split-\n          second that it takes him to realize this, the Consultant\n          has his guns leveled, taking aim, but...\n\n          \n\n          \n\n          \n\n          \n\n          65.\n          ...Wesley moves faster than we thought he could move...\n          he darts behind a kiosk hocking monogrammed apparel, and\n          dashes full speed through the crowds lining the street.\n          The Consultant chases after him, knocking shoppers out of\n          the way, sending fanny packs and Nordstrom bags flying.\n          Wesley hooks a right around a SHARPER IMAGE and heads\n          straight down a narrower section, like he's on a mission,\n          knowing exactly where he's going. And now we see why...\n          Because the city around us goes stark white like the Mg\n          Room. We're seeing what Wesley sees, what he's memorized\n          in all those hours staring at the model. Finally we see\n          one SMALL BENCH next to a fountain, which is bright red.\n          Immediately the natural color of the city c2 Ws back and\n          Wesley is running all out for that bench. He goes into a\n          slide, hitting the grass .underneath the bench, sliding\n          under it, popping up on the other side.\n          He rips a metal panel off the back of it as he does,\n          revealing an AUTOMATIC PISTOL...\n          .and just as quickly, he's up on one knee, aiming,\n          using the bench as a shield as the Consultant rushes up,\n          surprised and BAM! BAM! BAM:\n          The Consultant drops where he is, three bullets hitting\n          him in his two shoulders and his chest.\n          People start SCREAMING and RUNNING the hell away from the\n          gunplay. Wesley is about to run away himself, but when\n          he turns, Fox is right there beside him... smiling. A\n          couple of SECURITY GUARDS are with her, smiling as well.\n          Wesley looks over at The Consultant, who site up, smiling\n          too, even though he's bleeding from three spots on his\n          body...\n\n          FOX\n          Pin shot bullets.\n          Wesley looks down at the gun.\n\n          WESLEY\n          Just like my father used on you.\n          Fox nods, as the Security Guards go to help the\n          Consultant to his feet.\n\n          WESLEY (CONT'D)\n          You were watching me in the office.\n\n          \n\n          \n\n          \n\n          \n\n          66.\n\n          FOX\n\n          (NODS)\n          Protecting our assets.\n          She hands the clip from the Imanishi over to Wesley...\n\n          FOX (CONT'D)\n          Time to do this for real.\n\n          CUT TO:\n\n          INT. LONG CORRIDOR\n\n          Wesley and Fox walk down a long hallway toward a single\n          doorway. They open it, revealing...\n\n          INT. SLOAN'S OFFICE - DAY\n\n          . a large office with a single desk and a roaring fire.\n          Sloan turns from the fire to greet them.\n          He holds up the \"mole\" bullet, and smiles.\n\n          SLOAN\n          The mole bullet is made by a midget\n          t Filipino named Pek War. His fingers are\n          so small that they can shape and smooth\n          the metal better than anyone.\n\n          WESLEY\n          You've known all along. You knew before\n          I ever broke the urn...\n\n          SLOAN\n          I had to let you figure it out for\n          yourself.\n\n          WESLEY\n          Part of my training.\n\n          SLOAN\n          Part of your quest. To get to know your\n          father.\n\n          (BEAT)\n          And his killer.\n          Wesley nods, a grave expression on his face, like he\n          knows what he is going to do next.\n\n          \n\n          \n\n          \n\n          \n\n          67.\n\n          SLOAN (CONT'D)\n          Pek War charges exorbitant prices, as\n          much as ten-thousand dollars for a single\n          round, but his craftsmanship is\n          unparalleled.\n          He heads over to Wesley, hands him a slip of paper.\n\n          'SLOAN (CONT'D)\n          You can find him at this address.\n\n          CUT TO:\n\n          INT. PEK WAR'S MANUFACTURING SHOP - NIGHT\n\n          A three-foot-seven-inch Asian man site at a worktable\n          with his little legs dangling over the end of his chair.\n          PEK.WAR is concentrating hard on the metal in his hands.\n          The diminutive man looks up from his worktable when he\n          hears a loud THUMP.\n\n          PEX WAR\n          Andey?\n          He gets no answer. He remains perfectly still,\n          listening.\n\n          PEK WAR (CONT'D)\n          Andey?l\n          Two louder THUMPS and a GUNSHOT jerk his head around.\n          Then he's up out of the chair, faster than we thought a\n          little man could move.\n          Breathing ragged, shimmying across his work space, Pek\n          War hurries over to a chest of drawers.\n          He gets to it and throws open the bottom drawer to reveal\n          a stash of handguns. He reaches for one...\n          ...but the muzzle off a pistol comes _ uE to the back of his\n          head and the hammer clicks as it is pulled back.\n          Pek War throws his hands up.\n\n          PEK WAR (CONT'D)\n          Alam man lamangl Alam man lamangl\n          Wesley signals for him to turn around. After he does...\n\n          400\n\n          \n\n          \n\n          \n\n          \n\n          68.\n\n          PER WAR (CONT'D)\n          Alam man lamang!\n          Wesley measures him with eyes that have gone hard. Fox\n          stands over Wesley's shoulder, loving every moment of\n          this. Then...\n\n          WESLEY\n          There are two things about you I'm sure\n          of right now, little man. One is that\n          you can speak English...\n          Pek War sees that Wesley means business.\n\n          PER WAR\n          (perfect English)\n          And what's the other?\n\n          WESLEY\n          That my nutsack is bigger than you.\n          Fox snickers.\n\n          PER WAR\n\n          (SPITS)\n          What do you want?\n\n          K\n\n          FOX\n          A bullet you made killed his father.\n          The bullet maker looks as though he knew a day like this\n          might eventually come. His face falls and he looks.at\n          his feet.\n\n          PER WAR\n          I only mold the ammunition... I cannot be\n          responsible for the way it is...\n          Wesley SMASHES him in the face with the butt of his gun,\n          then grabs a long, metal STILETTO-type tool from the work\n          table.\n\n          WESLEY\n          Bullshit. You're as responsible as if\n          you pulled the trigger yourself.\n\n          PER WAR\n\n          (WHIMPERS)\n          I didn't...\n\n          ARIV\n\n          \n\n          \n\n          \n\n          \n\n          WESLEY\n          I'm only going to ask you one question\n          and I want you to think very hard how you\n          want to answer.\n          With that, Wesley sticks the stiletto into Pek War's\n          side!\n\n          PEK WAR\n\n          OWWW1\n\n          WESLEY\n          Relax. The blade is in only an inch or\n          so.\n          The little man starts jabbering to God in some foreign\n          language.\n\n          WESLEY (CONT'D)\n          See I've learned a thing or two about\n          human anatomy recently. In fact, this\n          blade is stuck just beneath the coastal\n          cartilage of your tenth rib. Just a\n          little push and it will deflate your\n          lung. That's called a pneumothorax.\n          V Helluva way to go, suffocating in a'room\n          full of fresh air. Plus the sound, the\n          sound of all that oxygen hissing out of\n          your lung... pssssssh, like a balloon at\n          a birthday party. Enough to make a man\n          beg for a second chance.\n\n          (BEAT)\n          But you're only going to have one.\n          Pek War waits, trying not to writhe from the pain...\n\n          WESLEY (CONT'D)\n          So my question is... how do I find Cross?\n          Pek War's eyes go wide, pleading...\n\n          PEK WAR\n\n          (DEFENSIVE)\n          My clients use middlemen, I don't meet\n          them in person, I know so little about\n          them...\n          Wesley twitches the handle just a bit.\n\n          PEK WAR (CONT'D)\n          Okayl Okayl Dammitl God damiaitl I'll\n          tell you!\n\n          \n\n          \n\n          \n\n          \n\n          70.\n          Wesley lets up a little bit.\n\n          PEK WAR (CONT'D)\n          Prearranged meets.\n          Fox snatches up a nearby phone.\n\n          WESLEY.\n          Start prearranging.\n\n          EXT. CITY STREET -NIGHT\n\n          The Porsche once again tears across the asphalt, as\n          Wesley drives.\n\n          FOX\n          Wesley, you gotta know something. No\n          matter what kind of training you've done\n          these last few weeks, killing your first,\n          well that's gonna change you forever.\n          Wesley drives for a while. Then...\n\n          WESLEY\n          You know what my foster mother. told me\n          when I was six years old?\n          Fox shakes her head.\n\n          WESLEY (CONT'D)\n          She caught me eating some jello out of\n          the fridge after my bedtime. I knew I\n          wasn't supposed to but I was so damn\n          hungry, and it was just some fucking\n          jello. Anyway, after she hit me so hard\n          I couldn't bite down straight for a week,\n          she told me... she told me that God had\n          killed my parents because I was such a\n          wicked boy.\n\n          FOX\n          Jesus. Someone needs to find that bitch\n          and set her straight.\n\n          WESLEY\n          So I grew up thinking I was the reason I\n          never knew my parents. But now, to find\n          out, that no, my father didn't give me up\n          because he had died... he gave me up\n          because he was Protecting me... well I\n          guess I want to give him something back.\n\n          \n\n          \n\n          \n\n          \n\n          71.\n\n          FOX\n          Here we are.\n\n          EXT. WAREHOUSE DISTRICT - NIGHT\n\n          They are surrounded by industrial looking warehouses, one\n          of which has the words Times-Herald on it. Newspaper\n          delivery TRUCKS make their way in and out of the loading\n          dock area of this building.\n          Overhead, an EL TRAIN scrapes along the worn tracks.\n          Fox pulls around a corner and back into an alley, so they\n          can have a view of the corner in front of them.\n          Wesley scans the area quickly.\n\n          WESLEY\n          Not very discreet, are they?\n          Fox smiles knowingly, and looks up, revealing what Wesley\n          is talking about. On various rooftops we-see FIGURES\n          peering down. looking over the site.\n\n          FOX\n          The others are only backup singers. This\n          is your show.\n          Fox subtly moves her head and figures disappear,\n          crouching down.\n          Just then, out the windshield, they see a MAN wearing a\n          long black overcoat approaching the corner near the\n          newspaper building.\n          Fox's eyes start to dance.\n\n          FOX (CONT'D)\n          Remember: he's good, baby. But you're\n          the best I've ever seen.\n          Wesley nods and the two of them step out of the car.\n\n          IN THE STREET:\n          From a distance, Wesley approaches Cross from the back.\n          His steps become quicker, getting closer every passing\n          second. Wesley starts to reach in his coat for his\n          gun...\n          .and that's when Cross firesl Quick as lightning,\n          Cross has guns out and lets loose toward the roof of a\n          nearby warehouse.\n\n          \n\n          \n\n          \n\n          \n\n          72.\n          His bullet has the instincts of a bird dog, and it curves\n          over the edge of the building and finds its mark, causing\n          a crouching ASSASSIN to plunge from the roof to the\n          street near Wesley!\n          The others on the rooftops hail down bullets as Cross\n          disappears into the nearest building, the Times-Herald.\n          Wesley and Fox run toward the building as three other\n          Fraternity members beat them there, the BELLMAN, the\n          WAITER, and the ELECTRICIAN.\n          Wesley sees them congregate on the loading dock and then\n          start inside the building...\n\n          WESLEY\n          No!\n          The minute Bellman exposes himself in the open loading\n          dock door he is cut down from inside, his bloody body\n          falling backwards into a newspaper truck parked at the\n          dock.\n          Wesley and Fox join the other two on the dock as\n          screaming WORKERS run from the place.\n\n          WAITER\n          We need a way in there.\n\n          ELECTRICIAN\n          Let's find another door.\n\n          WESLEY\n          He'll be long gone by then.\n\n          FOX\n          (shaking her head)\n          He's got the high ground.\n          Wesley sees an unmanned forklift on the dock.\n\n          WESLEY\n          On the pallet.\n          They all jump on the pallet held by the forks of the\n          lift. Wesley throws the machine in reverse and it backs\n          into the warehouse, the four assassins safely crouching\n          on the pallet on the front.\n\n          INSIDE THE NEWSPAPER BUILDING:\n          Once inside...\n\n          \n\n          \n\n          \n\n          \n\n          73.\n\n          WESLEY\n          Separate.\n          The lowest level is the loading dock, where pallets of\n          newspapers and massive unused paper rolls await.\n\n          WITH THE ELECTRICIAN:\n          The Electrician hustles between the pallets and boxes,\n          eyes darting, guns drawn. He backs up to a pallet of\n          stacked newspapers, using it as cover. What he doesn't\n          realize is that between each stack of papers is a space,\n          just big enough for a --\n          THWAP! A bullet finds its way through the space and hits\n          the Electrician in the back of the shoulder, spinning him\n          around.\n          CLOSE ON: Cross' gun. Another shot and we follow the\n          bullet, across the dock and dipping low into the next\n          space in the paper stack -- right where Electrician is\n          now leaning...\n          .the bullet buries in his eye, sending him to the\n          flog.\n          Wesley sees Cross race for a set of stairs. Just as\n          Wesley is about to cut him down, Cross fires at a wooden\n          beam holding back some massive rolls of NEWSPAPER. The\n          rolls tumble over and Wesley has to dive out of the way,\n          allowing Cross to escape up the stairs.\n          Wesley, Fox and the Waiter all race for the stairs.\n\n          ON LEVEL TWO:\n          Giant printing machines are running full speed, printing\n          up the morning edition.\n          A group of NEWSPAPER EMPLOYEES see the guns the\n          Fraternity members are toting and scramble for safety.\n          Wesley has to yell to be heard over the whirring\n          machines...\n\n          WESLEY\n          (to the Waiter)\n          Stay here and cover us. There's no angle\n          for him to hit you if you stay here.\n          Wesley points at a scaffolding that runs above the\n          machines.\n\n          \n\n          \n\n          \n\n          \n\n          74.\n\n          WESLEY (CONT'D)\n          Don't let him get up there. And stay\n          clear of the presses! He'll use them\n          however he can.\n\n          WAITER\n          How do you know?\n\n          WESLEY\n          It's what I'd do.\n          With that, Wesley and Fox disappear amongst the\n          machinery.\n          The Waiter takes a step back from the press, where over a\n          hundred pounds of paper spins through every second.\n          He sticks his head out to try and keep an eye on that\n          scaffolding. Everything looks clear, until...\n          ...shots ring out and a shelf o w a1l o\n          Waiter's head gives way! He turns to see a bunch of cans\n          of spray lubricant falling to the floor. No big deal,\n          until Cross shoots one of them out of the air, causing it\n          to explode!\n          The burning oil covers the Waiter, who SCREAMS and\n          stumbles nearer the printing press...\n\n          BAM BAM BAM!\n          More shots from Cross and one of the RESTRAINING ARMS on\n          the roll of paper feeding the machine breaks in half.\n          The paper roll spins wildly from the machine and like a.\n          saw, cuts the Waiter in hplf !\n          With a leap, Cross is on the scaffolding over the\n          presses. For just a second, Cross stops as he locks eyes\n          with Wesley...\n          ..but Fox is already firing at him so Cross has to keep\n          moving...\n          He heads up a second staircase, but not before he sends a\n          stream of bullets back at Fox, who athletically\n          cartwheels away...\n          .but one of Cross's bullets disintegrates a gear on the\n          press near her, sending flying metal everywhere. A piece\n          of shXapnel b ies into Fox's leg... making her break out\n          of her cartwheel and flop down, wounded.\n\n          \n\n          \n\n          \n\n          \n\n          75.\n\n          FOX\n          Fuuuucckkk!\n          Cross races along the scaffolding and disappears into a\n          door.\n\n          FOX (CONT'D)\n          Keep goin', baby! Take him!\n          Wesley races for the stairs. He is the only one left to\n          chase Cross to level three.\n\n          ON LEVEL THREE:\n          Wesley bursts through the door, guns ready. The place is\n          already in pandemonium, with PEOPLE yelling and screaming\n          and running for cover. Quickly, Wesley realizes he's in\n          the business offices of the paper, and it looks\n          surprisingly similar to his old office. Lame-ass\n          cubicles and florescent lighting everywhere.\n          Wesley jumps up on a desk.\n\n          WESLEY\n          Cross!\n          Unafraid, Cross climbs up on a desk on the other side of\n          the office. Without hesitation, Wesley opens fire at\n          Cross... who immediately returns fire...\n          .and his bullets actually collide with Cross's by ets\n          in mid-air!!! The bullets ricochet and take out a\n          COMPUTER SCREEN where someone was playing SOLITAIRE.\n          The two assassins blast away, all while diving and moving\n          over and in the cubicles. Cross has a gun similar to the\n          Imanishis, and they each steer their bullets at each\n          other from sharp angles...\n          Strangely,. the first bullet collision was not blind luck,\n          but the pattern for the battle. They are fighting the\n          same fight, their bullets meeting in the middle, each man\n          using the same techniques at the exact same time.\n          Wesley needs an angle, and spots a DRY ERASE BOARD the\n          words \"Action Items\" written on it. He fires at it, and\n          his bullets bounce off it at an angle where one of them\n          strikes Cross in the shoulder... THWAP!!!\n          Cross can't believe he's hit but he doesn't have time to\n          flinch... right as Wesley fires again, he turns, barely\n          avoiding the rain of bullets and leaps through a nearby\n          window, smashing the glass out,\n\n          \n\n          \n\n          \n\n          \n\n          76.\n          Wesley doesn't hesitate behind him... he sprints for the\n          same window and dives through it, guns at the ready\n          and...\n\n          OUTSIDE THE WINDOW:\n          .we stay with Wesley as he falls from the third floor,\n          firing his guns the whole time...\n          .until he lands top of an \"L\" train moving at ll\n          speed.\n\n          THE WAREHOUSE DISTRICT:\n          Fox limps out of the newspaper building and hurries to\n          the Porsche. She ignores her wounds and rips the car out\n          of the alley, chasing after the fleeing L train.\n\n          ON THE L TRAIN:\n          Ahead of Wesley, Cross is also on the top of the train.\n          He manages to get up, spin around, and fire at Wesley...\n          .but they both have to duck as the L train whips under\n          an overpass, which misses smashing both of them by mere\n          inches.\n          Cross takes the opportunity to swing down between cars\n          and enter one of the L cars.\n\n          BEHIND HIM:\n          Wesley hurries across the top of the train, spying the\n          trail of blood that Cross is leaving behind from his\n          wound.\n          Wesley smiles, a shark on a wounded baby seal, as he also\n          swings down between the cars and enters...\n\n          THE FIRST L CAR:\n          .where he sees the trail of blood leading all the way\n          down the center of the empty car and out the back door.\n          Wesley hovers in the entry way, his guns up and ready.\n          He takes a step forward to follow the blood trail, and\n          immediately, he is decked from the side by an ambushing\n          Cross.\n          They tumble over the first row of seats, both losing\n          their guns.\n\n          \n\n          \n\n          \n\n          \n\n          77.\n          Wesley kicks Cross off of him, but Cross-spins with two\n          new suns in his hand! Wesley is.on him quick though, and\n          SLAMS Cross into one of the train's windows hard enough\n          to crack it. With a quick twist of Cross' wrist, Wesley\n          takes a sun from him Just as Cross kicks h,m off...\n          .Wesley fires as he falls backwards. Cross falls\n          backwards too from the momentum...\n          ..and they both smash out opposite windows of the train\n          before landing on either side of it!\n\n          EXT. DIRTY ALLEY - NIGHT\n\n          But the amazing thing is... they stand up and keep\n          firing as the cars are whipping by at 80mph, and\n          realize they. are timing their shots to actually blast\n          between each car in the s it-second the opening passes.\n\n          ON THE TRAIN:\n          COMMUTERS ride along in blissful ignorance, reading their\n          papers, holding on to the handrails... completely unaware\n          of the gunfight raging outside the train.\n          A bullet whizzes through an open window, pierces a\n          BUSINESSMAN'S paper, and exits a window on the opposite\n          side of the car. The man sticks his finger through the\n          hole, unaware of the battle outside. What the hell?\n\n          IN THE ALLEY:\n          On opposite sides of the train, Wesley and Cross are both\n          sprinting and firing, trying to get to the end of the\n          last train, while dodging each other's bullets...\n          .as the last car passes, they each jump on the tracks,\n          ending u with guns tucked under each other's chin!\n\n          CROSS\n          Wesley!\n          This takes Wesley aback...\n\n          CROSS (CONT'D)\n          Look into my eyes!\n          Wesley's finger is starting to squeeze his trigger... as\n          is Cross's.\n\n          CROSS (CONT'D)\n          (growls, in pain)\n          Look into my eyes, goddammit!\n\n          \n\n          \n\n          \n\n          \n\n          78.\n          Finally, Wesley does and his face goes slack as he sees\n          himself reflected in Cross's Dupils.\n          Just then, Fox pulls up in the Porsche about fifty yards\n          away, and her headlights illuminate them.\n          Cross shifts his eyes to her, then does a curious thing:\n          he lowers his gun, then drops it to the ground. Wesley\n          can't believe Cross would leave himself defenseless.\n          Moving swiftly, Cross men tucks something into the\n          Rocket of Wesley's hooded sweatshirt.\n\n          CROSS (CONT'D)\n\n          (WHISPERS)\n          Everything they told you was a lie,\n          Wesley.\n          With that... Cross falls down. His black jacket spills\n          open to show a gun shot wound not just to his shoulder,\n          but to hig n too. one of Wesley's bullets through\n          the train must have found its mark.\n          Cross is bleeding profusely. He gasps a couple of\n          times... then, with his last bit of energy...\n\n          CROSS (CONT'D)\n          Find the missing piece. And... don't...\n          let them... dispose of the weapon...\n          With that, the life goes out of Cross's eyes.\n          Wesley stares at that face, trying to decipher some\n          meaning there. But Cross just stares blankly back at\n          him, just as Fox comes limping up.\n\n          FOX\n          You did it, baby! Son of a bitch, you\n          did it. You put down motherfucking\n          Cross!\n          Wesley looks down and sees some of Cross's blood on his\n          hands from their clench. There is also some on the gun\n          he is holding. ar --h d ed crun.\n          Wesley reaches down and takes the other pearl-handled gun\n          from where it dropped and looks over them both.\n\n          FOX (CONT'D)\n          What'd he say to you?\n          Wesley looks up, sees some sort of anticipation in Fox's\n          eyes. He looks back down at Cross's body..\n\n          \n\n          \n\n          \n\n          \n\n          79.\n\n          WESLEY\n          He said... he said 'pies on the\n          Fraternity...'\n          Fox measures him, like she's not sure if he's telling the\n          whole story. Finally, she nods...\n\n          FOX\n          Well... damn, I couldn't be more proud of\n          you, baby! Let's go lay this on Sloan!\n\n          WESLEY\n          Yeah, sure.\n\n          FOX\n          What's wrong?\n\n          WESLEY\n          I think I need.a minute to myself.\n\n          FOX\n\n          (UNDERSTANDING)\n          Sure. It's your first kill. I'll wait\n          for you...\n\n          WESLEY\n          Naah, that's all right. You need to get\n          stitched up. I'll meet you at that\n          Korean place.\n\n          FOX\n          You sure?\n          But he's already walking off. She watches him go,\n          thinking...\n\n          CUT TO:\n\n          EXT. CITY STREET - NIGHT\n\n          Wesley walks down the street. PEOPLE instinctively get\n          out of his way as he cuts a path down the sidewalk.\n          Then he pulls out what Cross slipped inside his pocket:\n          a beaten-up copy of COUNT OF ONTE CRISTO. In fact,\n          there's no mistake, it's the same copy he had as a kid.\n          Wesley tries to make sense of this as he opens up the\n          cover... printed on the inside in a steady hand are the\n          words: \"I left you something.\"\n          Wesley lowers the book and sees a cheesy guy park a\n          Harley at a curb. He bee-lines for the guy.\n\n          \n\n          \n\n          \n\n          \n\n          80.\n\n          EXT. HIGHWAY - MORNING\n\n          Wesley now blazes down the highway, pushing the Harley to\n          its limits. His angry expression hasn't dissipated.\n\n          EXT. SUBURBAN STREET - MORNING\n\n          The Harley pulls up to a lower-middle-class house, the\n          kind you might find in any run-down suburb. Kids run\n          around the neighborhood, playing.\n\n          ON THE BIKE:\n          Wesley sits and looks at one particular house. He climbs\n          off'and heads to the side of the house, still carrying\n          his book.\n\n          SIDE OF THE HOUSE:\n          He ducks through a broken chain-link fence and moves down\n          the side of the house...\n          .until he finds a familiar wooden BOARD. Familiar\n          because we've seen this place before: it's where he\n          lived when he was a foster kid.\n          He removes the board, then reaches into the hole. His\n          hand seizes on something. From the hole, he withdraws a\n          KEY attached to a note with an address on it: 1850 North\n          Highbury St.\n          Wesley's eyes move from the copy of MONTE CRISTO, to the\n          key, and back to the book.\n          Finally, he lowers his hands... revealing a little eight-\n          year-old kid, watching him curiously from the back yard.\n\n          WESLEY\n          Hey.\n\n          KID\n          Hey.\n\n          WESLEY\n          You live here?\n          The kid.nods .\n\n           WESLEY (CONT'D)\n           Foster home?\n          4014 The kid nods again.\n\n          \n\n          \n\n          \n\n          \n\n          81.\n\n          WESLEY (CONT'D)\n          Read this.\n          He tosses the kid the book and heads off.\n\n          EXT. RESIDENTIAL STREET - DAY\n\n          He pulls the Harley over to a curb and then reaches into\n          his jacket pocket and withdraws the note and the key.\n          Across the street, the address matches: 1850 N.\n          Highbury. The place looks like a concrete fortress... no\n          windows, just a large-iron door in front.\n          Wesley approaches, not sure what the address could mean.\n          He gets to the door, looking for a key-hole, but he\n          doesn't find one.\n          He fidgets there awkwardly for a second, but then...\n          .the door opens, revealing a woman, ANNA. She takes a\n          look at Wesley and then puts a trembling hand over her\n          lips.\n\n          ANNA\n          Come in, Wesley.\n          He stares at her, trying to figure this out. He steps...\n\n          INSIDE THE HOUSE:\n          .and finds that the place is nicely decorated; an\n          attempt to cover up what is really a reinforced bunker.\n          Anna is now trying to hold back tears, but can't.\n\n          ANNA\n          He's dead, isn't he?\n          There's no point lying to this woman...\n\n          WESLEY\n          Yes, ma'am.\n          She nods knowingly, sadly.\n\n          ANNA\n          He told me if he didn't come back... it\n          would be you who pulled the trigger.\n\n          WESLEY\n          â\u009c\u0093 He killed my father...\n\n          \n\n          \n\n          \n\n          \n\n          82.\n          Anna looks at him, confused. But then, realization sets\n          in...\n\n          ANNA\n          I think you need to meet someone...\n          she leads Wesley into another room, where a five-year-old\n          boy, plays the floor.\n\n          ANNA (CONT'D)\n          Wesley. This is your brother... Andrew.\n          Wesley's not sure what to make of this.\n\n          WESLEY\n          My brother?\n\n          ANNA\n          Half-brother. But both of you, you are\n          both 100 percent your.father's boys.\n          I've seen that from the beginning.\n          Andrew is busy playing with a couple of BLACK TOY\n          BUILDINGS on the floor. Wesley studies the little guy,\n          still confused.\n\n          ANNA (CONT'D)\n          Your father... he was with you the whole\n          time.\n          Wesley looks up and sees what she's referring to. The\n          walls are filled with pictures of Andrew, Anna, and...\n          remarkably...\n          ...photoaraths of Wesley at various ages w hgn he was-\n          growing u !\n\n          ANNA (CONT'D)\n          This was his favorite.\n          She hands him a picture of Wesley at about age 12,\n          sitting with his back to a tree, reading COUNT OF MONTE\n          CRISTO. The picture has been taken through a windshield,\n          across the street.\n          Wesley reels, his legs give out, he slumps against one of\n          the walls...\n          FLASH: Cross firing at Fox and Wesley at the grocery\n          store. But now we see that Fox positioned Wesley between\n          herself and the shooter. He wasn't trying to hit Wesley,\n          he was trying to separate him from her.\n\n          \n\n          \n\n          \n\n          \n\n          83.\n          Wesley, thinking, remembering...\n          FLASH: Wesley studying Cross's face in the file, seeing\n          that there isn't jealousy in those eyes.\n          Wesley still slumped against the wall, surrounded by\n          pictures of himself...\n          FLASH: Wesley reflected in Cross's pupils.\n          Holy shitl!! Cross was his father!!! Wesley looks up at\n          Anna's kind face...\n\n          ANNA (CONT'D)\n          When your father and I found each other,\n          when we had Andrew, he said he could no\n          longer live the way he had been living.\n          He said he wouldn't give us up, the way\n          he had given up his first eon.\n          Wesley stares at the picture... he can't believe he was\n          being watched back when he felt so alone.\n\n          ANNA (CONT'D)\n          It was his greatest regret.\n          She leaves him in the room, alone, with his brother.\n          Wesley watches the kid, trying to process it all.\n          For the first time, emotions overcome him, and he breaks\n          down...\n          .but he's too tough now to sob, so he forces the Bob\n          down in his throat and blinks back the tears. Goddamn,\n          he has a brother.\n\n          IN THE KITCHEN OF THE SAFEHOUSE - NIGHT - LATER\n          He walks up behind Anna, who is sipping some coffee at a\n          kitchen table, red eyed.\n\n          ANNA\n          would you like some coffee?\n\n          WESLEY\n          I'm okay.\n          Wesley sets the key down on the table.\n\n          WESLEY (CONT'D)\n          Do you know what this opens?\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          84.\n          A LONE KEYHOLE in a solid closet door.\n          Wesley sticks the key in and swings the door open\n          revealing a LONG BLACK COAT, just like his father's.\n\n          ANNA\n          I guess it's not much of an inheritance.\n\n          WESLEY\n\n          (STEELY)\n          He left me more than this.\n          Wesley takes the coat and folds it over his arm.\n\n          ANNA\n          I want you to know that he forgave you\n          before you ever pulled the trigger. He\n          tried to keep you out of it for so\n          long...\n\n          WESLEY\n          Why didn't he just tell me?\n\n          ANNA\n          once they had you... he couldn't risk it\n          unless you were alone. He knew his one\n          shot at telling you might be his last.\n          Her eyes harden a little bit.\n\n          ANNA (CONT'D)\n          You have to finish what he was doing,\n          Wesley. It's the only way any of us will\n          ever be free. Especially your brother.\n          They won't stop hunting us... your father\n          knew that.\n          Wesley nods.\n\n          WESLEY\n          I'll be back as soon as this is over.\n\n          ANNA\n          You have family here.\n          Wesley nods, these words meaning so much to him.\n\n          INT. KOREAN BAR-B-QUE JOINT - NIGHT\n\n          Fox eats in a small restaurant in the heart of Koreatown,\n          the kind of place that has the hot hibachi grills on the\n          S table tops.\n\n          \n\n          \n\n          \n\n          \n\n          85.\n          The place is mostly empty, quiet, with mainly Korean\n          faces both dining and serving. It's the kind of place\n          where you can eat and not be bothered.\n          The doors swing open and Fox looks up. The silhouette of\n          e I URE IN THE DOgJLWM is disturbing, a familiar\n          person in a long black coat...\n\n          FOX\n          Jesus.\n          She squints, the setting sunlight nearly blinding her as\n          all she can see is a silhouette...\n\n          FOX (CONT'D)\n          For a second there I thought you looked\n          just like Cross.\n          Wesley steps into the light and moves over to the table\n          as Fox lights up a cigarette.\n\n          WESLEY\n          Skipped the hospital?\n\n          FOX\n          He picked me clean and I don't care much\n          for needles.\n          She blows out a lungful of smoke and watches as it rises\n          toward the ceiling.\n\n          FOX (CONT'D)\n          Sloan's on his way.\n          One of the waiters waves to her to put out her smoke and\n          she just stares him down. The man backs off, nodding and\n          smiling.\n\n          FOX (CONT'D)\n          You want something to eat, baby?\n\n          WESLEY\n          I'm all right.\n\n          FOX\n          They got some good shit. Ostrich,\n          chicken... won't fill you up too much if\n          you're watching your calories.\n\n          WESLEY\n          Naah.\n\n          \n\n          \n\n          \n\n          \n\n          8â\u0082¬.\n\n          FOX\n          Well, the big man should be here any\n          minute...\n\n          WESLEY\n          Yeah.\n\n          (BEAT)\n          Listen, can I ask you a :question?\n\n          FOX\n          Baby, you can ask me anything you want.\n          He focuses on her eyes, zeroing in on the pupils.\n\n          WESLEY\n          Did you know Cross was my father?\n\n          FOX\n          What?\n\n          WESLEY\n          Did you know?\n          Closer, closer... tight on those pupils...\n\n          FOX\n\n          O AW\n          What're you talking about Wesley? Cross\n          killed your father.\n\n          EXTREME CLOSE-UP:\n          We see her pupil swell, just a tiny bit.\n\n          KOREAN BAR-B-QUE:\n          He saw it... exactly what Sloan told him to look for when\n          someone is lying.\n          And from the look on Fox's face, she knows he saw it.\n\n          FOX\n          Goddammit, Wesley...\n          She stabs out her cigarette, crushing it on the hot grill\n          so that it SIZZLES.\n\n          FOX (CONT'D)\n          Why'd you have to ask me that?\n          With that, she kicks back from the table, holding a huge\n          black Smith and Wesson revolver.\n\n          \n\n          \n\n          \n\n          \n\n          $7.\n          Wesley only has a millisecond to respond,-and he does by\n          kicking over the table, which sends food and utensils\n          flying, but also shields him from Fox's bullets.\n          Just as quickly, Fox leaps up on top of one of the other\n          tables, trying to keep her heels on the sides so that her\n          feet don't touch the hot grill. If she's wounded, we\n          wouldn't know it.\n          Wesley does the same on a nearby table. They take shots\n          at each other as they leap from table to table, avoiding\n          the sizzling centers, but they're both so quick that no\n          bullets find their mark.\n          Then Fox takes a running leap at him, moving ferociously\n          fast. She's like the animal she's named after, and she\n          launches off one of the tables...\n          .and catches Wesley flush, kno in him backwards, a\n          form tackle on to a table...\n          ..where he lands Quare on the oven top... PSSSSBHH...\n          and his guns go flying across the room as...\n          .the table to starts to burn through his clothes!\n\n          %AW\n\n          WESLEY\n          Arrrh!\n\n          FOX\n          You shoulda known better, baby...\n          But he rolls over, taking Fox with him, and now the oven-\n          is burning into her back.\n          With all her strength, she bucks him off and then flips\n          herself backwards off the table. With another kick, she\n          sends the hot table flying at him. It rips free from its\n          wiring, and the nozzle sprays gas out into the\n          restaurant... SSSSSSSSS...\n          Wesley knocks the flying table out of the way, but not\n          before it burns his arm as he blocks it.\n          Spotting his guns, he sprints for them as Fox unleashes a\n          hailstorm of bullets.\n          But he's too damn fast, and he dives across the floor\n          Pete Rose style, sliding to a stop at the precise moment\n          where his hands come u holSling his weapons.\n          In.one fluid motion, he flips back over and EAM! BAM!\n\n          BAM! BAM! BAM!\n\n          \n\n          \n\n          \n\n          \n\n          88.\n          shoots bullets up in the air and then flicks his wrists\n          so they arc over at the open gas nozzle!\n          The bullets strike it, sparking, and then BOOM!!!:\n          fireball b sts from nozzle, while a great Riume of\n          sweltering fire keeps pouring out!\n          Fox dives to get out of the way, which gives Wesley the\n          opening he was looking for. He FIRES again, and one of\n          his bullets knocks her crun away and another nicks her in\n          the side of the face.\n          She stops, seeing the blood drip down her cheek and off\n          her chin. This only seems to enrage her.\n          Pissed, she produces two S R GUNS out of the small of\n          her bac -- where she had them hidden we have no idea --\n          and charges Wesley like an unleashed Pit Bull...\n\n          FOX (CONT'D)\n\n          (SCREAMS)\n          Aaaaahhhh!\n          She's firing both muzzles and her bullets find the marks\n          this time, knocking Wesley's guns out of his hands from\n          where he lies flat on the floor.\n          She's disarmed him, and now he's defenseless...\n          .and Fox stands over him, breathing hard, her face\n          bleeding, both gun barrels pointed right at Wesley's\n          face...\n\n          FOX (CONT'D)\n          I gotta admit, baby...\n          She starts to squeeze both the triggers...\n\n          FOX (CONT'D)\n          I thought we might have a future...\n          But, Wesley drives a fist into her wounded leg and she\n          reels...\n          In the same motion, he grabs her wrists and pulls her\n          toward him... taking her guns right out of her hands like\n          a quick-change artist.\n          Flipping them over, Fox's face full of surprise is the\n          last expression she'll ever have because...\n\n          BAM! BAM!!!\n\n          \n\n          \n\n          \n\n          \n\n          69.\n          Most of Fox's face is blown clean fr her head, and a\n          blood mess s ra s a oss the wall.\n          Wesley leans his head back and closes his eyes, the spume\n          of fire flickering brightly against his lids, the events\n          of the last several hours washing over him.\n\n          FADE OUT:\n          For several moments, there is nothing but darkness and a\n          silence as permanent as death. Finally...\n\n          WESLEY (V.0.)\n          There's a town in Germany called\n          Leverkusen that had a bear hunter named\n          Hans Koblenz.\n\n          FADE IN:\n\n          EXT. KOREAN BAR-B-QUE JOINT - LATER\n\n          Sloan, the Butcher and the Pharmacist walk across the\n          parking lot toward the door of the smoking Bar-b-que\n          joint.\n\n          WESLEY (V.0.)\n          60 During his life, he was said to have\n          killed over four hundred bears and was\n          the pride of this small community on the\n          Rhine. You want to know how he died? A\n          pair of black bears singled out his house\n          from the entire village, mauled his wife,\n          killed his twin daughters, and then lied\n          in wait for him to get back from the\n          woods.\n\n          INT. KOREAN BAR-B-QUE JOINT - LATER\n\n          The fire is out, but it has blackened the inside of the\n          joint, so that it looks like an absolute war zone.\n          Fox is in the same position as when Wesley shot her, but\n          there's a sheet of paper folded on her chest.\n          The Butcher and the Pharmacist flank Sloan as he\n          approaches the body, frowning.\n\n          WESLEY (V.0.)\n          When the hunter opened the door, they\n          ripped his throat out before he could\n          scream.\n\n          (MORE)\n\n          \n\n          \n\n          \n\n          \n\n          90.\n\n          WESLEY (V.0.) (CONT'D)\n          The two bears then curled up on the rug\n          LW in the middle of the floor -- the rug\n          that had once been their father -- and\n          proceeded to bite. each other till they\n          bled to death.\n          Sloan reaches down and picks up the paper, and sees\n          beneath it that pearl-handled revolver. The one with the\n          blood on the handle.\n\n          WESLEY (V.0.) (CONT'D)\n          That's a true story.\n          He unfolds it, to read printed in black ink on the paper:\n\n          7'HE GATES OF T.T ARE OPEN\n          Sloan folds the paper back up and looks at the blood on\n          the gun.\n\n          SLOAN\n          He knows.\n\n          CUT TO:\n\n          INT. SLAUGHTERHOUSE ROOM - NIGHT\n\n          Wesley stands in the slaughterhouse, holding two pistols,\n          looking around. The place has been cleaned out. There's\n          no sign of the Butcher.\n\n          INT. PHARMACY - NIGHT\n\n          Same thing at the Pharmacy, an empty store now...\n\n          INT. LIBRARY - NIGHT\n\n          .and in the Fraternity's library, nothing. All the\n          books are gone...\n          Wesley processes this, frowning. He keeps walking to\n          the...\n\n          MAP ROOM:\n          .where the entire model city has been destroyed, like a\n          Giant has trampled it beneath its feet.\n          Wesley stoops over and pulls one smashed building out of\n          the mess, looking at it, thinking, thinking...\n          .and then he's up and moving quickly.\n\n          CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          91.\n\n          INT. CROSS'S HOUSE - NIGHT\n\n          Anna opens the door for Wesley, who looks like he is on\n          to something...\n\n          WESLEY\n          My father... he was working on a plan,\n          right?\n\n          ANNA\n          I don't know. There was so much he\n          wanted to keep away from us...\n          Wesley moves into Andrew's roan... where the boy is still\n          playing with the black model buildings.\n          Wesley moves over and crouches down next to Andrew.\n\n          WESLEY\n          Can I see that for a second?\n          The boy hands him the building in his hand. It is\n          painted jet black, except for one corner of the first\n          floor, which is painted red. Wesley looks up at Anna.\n\n          WESLEY (CONT'D)\n          Do you know where he got this?\n\n          INT. BASEMENT - NIGHT\n\n          Anna leads Wesley down some wooden steps into Cross's\n          basement.\n          Sure enough, the entire floor of the basement has been\n          made into a model map, similar to the one that the\n          Fraternity used in the map room, but all the buildings\n          are black, with an occasional red mark.\n          The scale is larger, the model shows only one section of\n          the city, and a BLUE LINE indicates a route through the\n          streets.\n          And on the wall are PICTURES and CLIPPINGS of Henry\n          Helms.\n          Wesley squats over it, trying to figure out what his\n          father's plan was. He sees a missing place for a\n          building and puts Andrew's toy back in place, then\n          studies the map some more.\n\n          /'\" ANNA\n          I-\" Does this mean anything to you?\n\n          \n\n          \n\n          \n\n          \n\n          92.\n          There are large question marks painted on various\n          buildings along the Helms' route.\n\n          WESLEY\n\n          (AWED)\n          My God, he's been planning it from the\n          beginning.\n\n          (BEAT)\n          This is a Fraternity hit. Cross... my\n          fathar... set up Henry Helms as bait,\n          knowing Sloan would use his best men for\n          the job. He was going to take them all\n          out.\n          Wesley looks at it some more.\n\n          WESLEY (CONT'D)\n          Only he didn't know where on the route\n          they would try and hit Helms. That's the\n          missing piece he was t rying to figure\n          out.\n\n          ANNA\n          Do you know the answer to that?\n          Wesley looks up at her, resolve on his face.\n\n          WESLEY\n          No. But I know who does.\n\n          CUT TO:\n\n          INT. APARTMENT - NIGHT\n\n          It's dark. Really dark.\n\n          KNOCK KNOCK KNOCK.\n          A lump in a bed stirs.\n\n          KNOCK KNOCK KNOCK.\n          The lump stirs a little more...\n\n          CUT TO:\n          NICOLE, the hot girl from Wesley's office, moves to her\n          peephole and looks out, but there's no one there.\n          She opens the door and gives a quick look down the hall,\n          then shuts it and hurries to her kitchen.\n\n          \n\n          \n\n          \n\n          \n\n          93.\n          She starts to open a cabinet but stops, GASPS and jerks\n          back, scared shitless.\n          Wesley is-in her kitchen, lust a few-feet away. She\n          looks at him.\n\n          NICOLE\n          Jesus...\n          (seeing who it is)\n          Wesley? Is that you?\n          He looks bruised and battered, but there is a hardness to\n          his eyes.\n\n          WESLEY\n          It's me, Nicole.\n\n          NICOLE\n          What happened to you?\n          Wesley wipes his eyebrow with his thumb, like he's\n          considering what he wants to say next.\n\n          WESLEY\n          I asked you once if you thought I was an\n          observant person.\n          She doesn't understand... but suddenly we...\n\n          CUT BACK TO:\n\n          INT. MEETING ROOM - DAY\n\n          .that meeting room from his old job. In fact, it's a\n          replay of that same scene. Wesley is still sitting there\n          with his note pad, the words \"LIFE SUCKS AND THEN YOU\n          DIE\" printed over and over, while the consultant\n          continues to rattle on and on.\n          Through the blinds behind the speaker, Wesley spots the\n          hot intern Nicole, still talking on the phone. And just\n          like before, he's zeroing in on her, but this time, we\n          keep zeroing in and zeroing in, until we see something we\n          didn't see before...\n          Nicole reaches up over the counter to grab a stack of\n          papers, and her shirt pulls slightly up from her back...\n          .and that tattoo of Cerberus. &)A- three-headed !log _is\n          ,printed there, in the exact same place Fox had...-and we\n          keep zeroing in on it and zeroing in on it until we...\n\n          ../\n\n          SMASH CUT TO:\n\n          \n\n          \n\n          \n\n          \n\n          94.\n\n          INT. THE TATTOO ROOM - FLASHBACK:\n\n          Where Fox is tattooing his hand again and we get another\n          taste of that conversation they had...\n\n          FOX\n\n          (COYLY)\n          Who said I was the only sister? Maybe\n          you just haven't met any others yet..\n\n          WESLEY\n          (playfully back)\n          Maybe I have and I'm just not telling\n          you.\n          .and now with the gift of hindsight, we see that Wesley\n          meant what he said, and we...\n\n          SMASH CUT BACK TO:\n\n          INT. NICOLE'S KITCHEN - NIGHT\n\n          Wesley still stands there, just a few feet away from her.\n\n          WESLEY\n          Sloan didn't just have one person in my\n          office watching me, he had two.\n\n          NICOLE\n          What are you talking about?\n\n          WESLEY\n          What name do you go by? The Intern?\n          He points at her tattoo.\n\n          WESLEY (CONT'D)\n          Because I know you have the mark.\n          Nicole's face changes, goes hard, like someone flipped a\n          switch.\n          Like lightning, she grabs for a butcher's knife but\n          Wesley is faster. He pins her wrist back, twisting until\n          she drops the knife.\n          She lunges again, but a pistol comes up right below her\n          chin.\n\n          WESLEY (CONT'D)\n          Where's the Henry Helms hit going down?\n          Where's Sloan?\n\n          \n\n          \n\n          \n\n          \n\n          95.\n\n          NICOLE\n          Sloan's not your biggest problem,\n          fuckface.\n\n          WESLEY\n          Yeah? Why's that?\n          She reaches over, slowly, so he knows she's not going to\n          go for a knife... and she turns on a small TELEVISION\n          sitting on the kitchen counter.\n          The screen comes to life, showing an inf mercial for the\n          F ob'e.\n          Nicole shakes her head and. flips up the channels... and\n          now we see what she wanted to show him...\n\n          ON THE NEWS:\n          Wesley's EMPLOYEE PHOTO fills the screen above a\n          reporter's head while the REPORTER babbles in a serious\n          voice...\n\n          REPORTER\n          .responsible for several recent\n          shootings, including one tonight at this\n          Korean restaurant downtown and another at\n          an outdoor mall. Details are sketchy,\n          but we repeat, if you see this man,\n          please contact...\n\n          IN NICOLE'S KITCHEN:\n          She starts cycling through the news channels...\n          ...and each one shows. different REPORTERS standing\n          outside the smoking bar-b-que, or talking about Wesley,\n          or speaking with police. One is even interviewing\n          Wesley's old boss, Janice, who is very happy for the\n          forum...\n\n          ON THE NEWS:\n\n          JANICE\n          He was aggressive toward me and other\n          employees... a very negative person,\n          extremely negative. I can't even repeat\n          the words that came out of his mouth the\n          day we let him go...\n\n          \n\n          \n\n          \n\n          \n\n          96.\n\n          IN NICOLE'S KITCHEN:\n\n          WESLEY\n          Motherfucker. Dispose of the weapon...\n\n          (BEAT)\n          Me.\n\n          NICOLE\n          That's right. And the cops were told to\n          watch this place too. You have nowhere\n          to go. He's smarter than you. He'll\n          feed the cops evidence singling you out\n          for every hit the Fraternity has pulled\n          in the last ten years.\n\n          WESLEY\n          (ignoring her)\n          I'm only going to ask you one more time.\n          Where can I find him?\n\n          NICOLE\n          You won't get to him. You can't. The\n          cops will be here any second!\n          Wesley reaches over- -and cranks up a gas burner, the\n          menacing flame on high.\n\n          WESLEY\n          Then this is going to get painful\n          quickly.\n          She stares at that blue flame, fear in her eyes for the\n          first time.\n          He starts pushing her head toward it, closer and\n          closer...\n\n          WESLEY (CONT'D)\n          Henry Helms. Where is it going down?\n          The first SCREAM from Nicole is lost in...\n\n          THE FRONT DOOR:\n\n          BAM. BAM BAM!\n\n          POLICE OFFICER (0. S.)\n          Open up! Police!\n          The door to Nicole's apartment smashes open and four cops\n          burst through the door, guns ready.\n\n          \n\n          \n\n          \n\n          \n\n          97.\n          They spread out quickly, checking out the place. One of\n          the disappears into the kitchen...\n\n          POLICE OFFICER 2 (O.S.)\n          Oh, Christ.\n\n          CUT TO:\n\n          EXT. APARTMENT BUILDING ROOFTOP - NIGHT\n\n          SIRENS wail and a HELICOPTER hovers nearby as Wesley\n          stands on a roof, looking down on the scene. He sees\n          EMT's roll a gurney out toward an ambulance as COPS cover\n          every inch of the ground.\n          From where he is, it looks like every cop in the city is\n          here.\n\n          ON THE GROUND:\n          One COP looks up and sees a figure on the roof, long\n          jacket blowing in the breeze. Surprisingly conspicuous.\n\n          COP\n          What the fuck?\n\n          K\n\n          COP 2\n          What is it?\n          The first cop points up toward Wesley on the roof.\n\n          COP 2 (CONT'D)\n          (into the radio)\n          Air Support can you get a beam on the\n          four-story southeast of our position?\n\n          ON THE ROOFTOP:\n          Quickly, a spotlight lights up the spot where Wesley was\n          standing, but now we see it's iust an air-conditioning\n          vent with soave loose streamers flapping off of it. Damn,\n          it looked just like Wesley a moment ago... was it?\n\n          HELICOPTER PILOT\n          (on the radio)\n          Negative, roof is clean.\n\n          EXT. CITY STREET - NIGHT\n\n          Wesley steps out of a dark doorway, his hard eyes\n          following a police car as it roars by without noticing\n          him.\n\n          \n\n          \n\n          \n\n          \n\n          98.\n          He pulls his jacket collar up, puts on.a skull cap, and\n          takes off in the opposite direction, away from the scene.\n          He passes a newspaper dispenser, but the CAMERA STAYS.on\n          the front page, which is still talking about Henry Helms.\n          The CAMERA HOLDS ON A photograph of Helms, which...\n\n          DISSOLVES TO:\n          Morning...\n\n          INT. HOTEL ROOM - MORNING\n\n          .where HENRY HELMS himself is tying a tie in a hotel\n          mirror. He's a handsome enough guy, distinguished even,\n          but he looks tired, like the weight of living under a\n          death threat has dragged him down.\n          A door opens, and we see his wife, SARAH HELMS, step past\n          two, huge BODYGUARDS to come in.\n\n          SARAH HELMS\n          The car is here.\n\n          EXT. HOTEL SIDE DOOR - DAY\n\n          A gaggle of large bodyguards surround the Helmses as they\n          hurry out of a side door and make it into a LIMOUSINE.\n          They notice the half dozen MOTORCYCLE COPS positioned\n          around their limo.\n          A LEAD BODYGUARD holds the limo door for them.\n\n          HENRY HELMS\n          (re: the cops)\n          What's all this?\n\n          LEAD BODYGUARD\n          We're not taking any chances.\n          He shuts the door for them before climbing behind the\n          steering wheel.\n          The limo starts to make its way down the drive, flanked\n          in front and in back by dark SUBURBANS and the motorcycle\n          cops.\n\n          EXT. RIVER - DAY\n\n          Commercial ships cruise up and down a river, under an\n          expansive BRIDGE.\n\n          \n\n          \n\n          \n\n          \n\n          99.\n          Sitting next to the incline to the bridge, is an\n          abandoned four story building, what used to be.a\n\n          HOSPITAL.\n\n          INT. HOSPITAL ROOFTOP - DAY\n\n          A guy looks down at the street with his binoculars. It's\n          the Gunsmith!\n\n          THE GUNSMITH\n          (into a radio)\n          Nothing yet, sir.\n\n          EXT. BUILDING ROOFTOP - SAME\n\n          On another tall building, Sloan talks into a radio.\n\n          SLOAN\n          Hold until I give the word.\n          He clicks off the radio and looks into his palm, where-\n          e's holding that pearl handled aun, fingering the dried\n          blood.\n\n          ON A CITY STREET:\n          The suburbans and cops flank the limo as it rolls through\n          the concrete jungle.\n\n          IN THE LIMO:\n          The bodyguards peer up at the buildings ready for\n          anything.\n          Henry Helms reaches over and grabs his wife's hand, a\n          reassuring gesture. But his white knuckles betray his\n          trepidation.\n          The driver watches as they reach a frontage road on the\n          east side of the river.\n\n          ON THE ROAD:\n          They make a turn along the river and haul ass toward the\n          bridge. Traffic is sparse and they look like they have\n          an easy clear passing.\n\n          ON THE HOSPITAL ROOFTOP:\n          The Gunsmith sits, waiting patiently...\n\n          \n\n          \n\n          \n\n          \n\n          100.\n\n          ON ANOTHER ROOFTOP:\n          Sloan watches the Limo starting to approach the bridge.\n\n          SLOAN\n          (into the radio)\n          Here comes the car. Any minute now.\n          Take your positions.\n          Sloan leans out over the edge of his building, gun ready.\n\n          QUICK SHOTS:\n          On the hospital roof, the Gunsmith puts down his\n          binoculars and picks up a rifle.\n          The Pharmacist leans over the edge of a building and\n          looks down, high-powered rifle in his hand.\n          On another building, the Chef does the same.\n          And on still another building, the Gardener also gets\n          ready.\n          Each killer is in a different spot and has a gun, pointed\n          and ready, just waiting for the signal...\n\n          ON THE ROAD:\n          The limo is about halfway up the incline now, a sitting\n          duck, hellfire about to rain down upon it.\n\n          ON THE HOSPITAL ROOFTOP:\n          The Gunsmith waits, waits, waits...\n          .and then, out of nowhere, surprising the hell out of\n          him, a knife is held to his neck from behind.\n          The Gunsmith doesn't even so much as swallow, as the\n          blade is so tight against his throat that it draws a drop\n          of blood.\n\n          GUNSMITH\n\n          (NERVOUSLY)\n          Wesley?\n          The CAMERA MOVES TO THE SIDE to show Wesley crouched\n          right behind him, a look of icy determination on his face\n          as he holds the knife in place.\n\n          \n\n          \n\n          \n\n          \n\n          101.\n\n          WESLEY\n\n          (GROWLS)\n          The name is Cross.\n          In the distance, the Helms limo moves on, safely.\n\n          WESLEY\n          Looks like you missed your chance. Now\n          where is Sloan?\n          The Gunsmith feels the edge in Wesley's voice.\n\n          GUNSMITH\n          You don't understand, man. This ain't\n          about Helms. The Intern told you right\n          where to go...\n          He smiles.\n\n          GUNSMITH (CONT'D)\n          .I'm just the decoy.\n          THE CAMERA WHIPS around behind Wesley... to show that\n          three laser sights are lighting up his back in a perfect\n          pattern.\n          And now we see it, this was al a Bet-up to get Wesley in\n          the open. The three surrounding rooftops, slightly more\n          elevated, hold each of the three assassins crouched-in\n          sniper positions, zeroed in on Wesley's back.\n          But instead of surprise, Wesley just leans in closer to\n          the Gunsmith's ear.\n\n          WESLEY\n\n          (WHISPERS)\n          She told me that, too.\n          And with that, he rolls the o0 over of ,\n          just as the assassins on the higher rooftops all unleash\n          a hail of bullets.\n          BAM! BAM! BAM! BAM! BAM! The Gunsmith takes a dozen\n          shots, all in the chest, but none of the bullets make it\n          through the Gunsmith's body.\n\n          WESLEY (CONT'D)\n          Should've studied your anatomy, fellas.\n          Wesley FIRES BACK indiscriminately at the neighboring\n          rooftops, lying on his back, using the.dead assassin's\n          body as a shield.\n\n          \n\n          \n\n          \n\n          \n\n          102.\n          Quickly, he bucks the Gunsmith's body off of him and\n          scampers for a nearby stairwell.\n\n          ON THE ROOFTOPS:\n          The assassinB-all disappear from their positions and head\n          to the street.\n\n          CUT TO:\n\n          INT. HOSPITAL BUILDING - GROUND FLOOR - DAY\n\n          Wesley bursts from the stairwell doorway and moves to the\n          front door of the building. He clicks the empty\n          cartridges out of his guns and is about to reload when he\n          hears a sickening sound behind him...\n          The sound of two knife blades being rubbed together...\n          .and Wesley turns to f' the Butcher there waiting for\n          The Butcher quickly hurls a knife, which buries in_the\n          fleshy part of Wesley's shoulder 1\n           Wesley ignores it and fires...\n          i L\n\n          SAM BAM! DING DING!\n          The Butcher deflects them with the knives in his hands:\n          Wesley goes to fire again but his firing chambers recoil,\n          showing that he is out of ammo.\n          The Butcher's eyes go wide...\n\n          THE BUTCHER\n          Like I told you... the blade will always\n          live on.\n\n          WESLEY\n          I remember some dumb shit like that\n          coming out of your mouth.\n          Wesley tosses the guns in his pockets and then nulls out\n          the kniZ2 in his shoulder.\n          They charge each other, the blades whizzing and clanging\n          off each other as each tries to gain an edge.\n          The fight spills out the front door, and into...\n\n          \n\n          \n\n          \n\n          \n\n          103.\n\n          THE STREET:\n          .the two men slashing, ducking, and moving in the\n          middle of the street. -\n          Wesley strikes three auick swipes acrosiLthe Butcher's\n          face And forehead, filling his eyes with blood.\n          The Butcher grabs his face and sees the blood streaming\n          on to his hands. He tries to wipe the blood from his\n          eyes, but it's just getting worse.\n\n          THE BUTCHER\n          I can't see!\n\n          WESLEY\n          But you can hear. So hear this: To cut\n          the subclavian artery, hold the knife ice-\n          pick style...\n          Wesley lunges and the Butcher is defenseless to stop it.\n\n          WESLEY (CONT'D)\n          ...and thrust down behind the clavicle,\n          cutting side to side.\n          He does just as he describes and the big guy topples over\n          as his gore spills out into the street.\n          But before he can gloat, Wesley realizes his new\n          predicament...\n          He's standing in the middle of the street, and at one end\n          is the chef, and at the other is the Gardener. To make\n          things worse, directly across the street from Wesley is\n          the Pharmacist, and each has a gun on him.\n\n          THE PHARMACIST\n          Three on one, mate. You're out of ammo.\n          And you're in a part of the map with no\n          Fraternity stashes.\n\n          (LAUGHS)\n          That's what I'd call a real ball ache.\n          For a moment, Wesley stands there, sizing up the\n          situation. His eyes swivel from the Gardener to the Chef\n          to the Pharmacist.\n          Just then, the buildings ound all of them go black.,\n          just like in cross's model! Wesley's eyes fall on the on\n          the red corner of the nearest building, a cement block\n          making up a decorative support column in front of it.\n\n          \n\n          \n\n          \n\n          \n\n          104.\n          Wesley smiles.\n\n          WESLEY\n          I'm working off of a different map.\n          With that, the world goes back 12 its natural colorB, and\n          he races for the building, jumping up onto and over a\n          Lexus parked at the curb. The three assassins fire\n          relentlessly at him, but their bullets slam into the car,\n          smashing it to bits... as...\n          . on the other side of it, Wesley goes into a slide just\n          as he reaches that cement block... affixed to it is a\n          small SILVER CROSSI Wesley slaps his hand on the Cross\n          and the cement block mechanically opens, revealing: a new\n          pair of sophisticated MA ISHIS I\n          As his adversaries converge on him, Wesley takes the\n          guns, spins, splits both hands apart and we...\n\n          SPLITSCREEN:\n          ...to follow both of his bullets in flight.\n\n          ON THE LEFT SIDE OF THE SCREEN:\n          .THE BULLET from the left gun heads for the Chef. He\n          tries to drop down, but the bullet curves downward, it\n          pierces his body... and...\n\n          INSIDE HIS BODY:\n          We see the bullet ricochet off of one of his ribs-exit\n          his side and head for the Pharmacist, while...\n\n          ON THE RIGHT SIDE OF THE SCREEN:\n          ...the bullet from the right gun heads for the Gardener,\n          who moves fast to fire his own gun, but the bullet\n          catches him in the wrist, knocking his gun out of his\n          hand, and...\n\n          INSIDE THE WRIST:\n          . it hits the Gardener's scaphoid bone, ricocheting out,\n          also, right at the Pharmacist...\n\n          THE SCREEN RETURNS TO NORMAL:\n          .just as the two bullets come together...\n\n          THE PHARMACIST\n          Bugger.\n\n          \n\n          \n\n          \n\n          \n\n          105.\n          hitting the Pharmacist on both sides of-his head,\n          before he can even react.\n          Wesley watches a pink spray shoot out from both sides of\n          the Pharmacist's head as he falls to the asphalt, dead.\n          But Wesley's not through, he moves over to the Gardener\n          and rolls him over.\n\n          WESLEY\n          Where is he?\n\n          THE GARDENER\n          Where it started..\n          BAN! Wesley ends it for the Gardener.\n\n          EXT. ROOFTOP - DAY\n\n          We've seen this place before. It's the same roof where\n          cross took out the second head of\n          The door is kicked open and Wesley walks out, eyes\n          blazing.\n          Sloan is waiting for standing t feet away,\n          holding his father's pearl-handled gun, trained right on\n          Wesley's head.\n\n          SLOAN\n          Can't say I don't have a sense of irony.\n          The place I first decided to bring you\n          in.\n          Wesley is clutching his wounded shoulder with his wounded\n          hand as blood starts to seep out of it in big red drops.\n\n          SLOAN (CONT'D)\n          You once asked why I helped hide you as\n          an infant... It gave me power, Wesley'.\n          Power to become a head of the Fraternity.\n          Power over your father. And ultimately\n          it gave me you: the perfect weapon to\n          kill your father.\n\n          WESLEY\n          But now you have to dispose of the\n          weapon.\n\n          SLOAN\n          In some ways it pains me to do so. You\n          460 are like the son I never had.\n\n          \n\n          \n\n          \n\n          \n\n          106.\n\n          WESLEY\n          Fuck you.\n          Sloan's eyes narrow.\n\n          SLOAN\n          Fine. Keep your worthless dignity.\n          You're still just the same loser we\n          plucked off the street six weeks ago.\n          Wesley continues to bleed, taking this in. Sloan laughs\n          derisively.\n\n          SLOAN (CONT'D)\n          You can't win, Wesley. The Fraternity is\n          everywhere. Even if you kill me others\n          will come from other cities to take my\n          place. You'll be hunted your whole life.\n\n          (BEAT)\n          But that's not gonna happen. Like I told\n          you before, when we are called, death is\n          as certain as the sun.\n          Wesley stands as straight as he can muster. The two men\n          face each other like two gunmen on Main Street in Dodge\n          city... an old newspaper even blows through like a\n          tumbleweed.\n          And we are close on Wesley's face. act it i the\n          same shot from the opening of the movie.\n\n          WESLEY\n          Six weeks ago, I was ordinary and\n          pathetic.\n          We see now that his healthy hand is inching away from his\n          bleeding arm, reaching into his sleeve...\n\n          WESLEY (CONT'D)\n          But not today.\n          With that, he nulls out the matching pearl-handled gun,\n          the twin-brother of the one Sloan is holding, and they\n          both open fire...\n          .Wesley shoots Sloan's bullets out of the air and Sloan\n          does the same. Just like he did with h' father.\n          .But Sloan is good, and one of the bullets finds it's\n          mark, hitting Wesley sSMarely in the same arm that took\n          the knife.\n\n          \n\n          \n\n          \n\n          \n\n          107.\n\n          WESLEY (CONT'D\n          Uhhh!\n          He can't raise his arm, it's useless, but he's come too\n          damn far to stop now... he flips his gun from his good\n          hand to his bad hand and manages to keep FIRING!\n          Then Wesley does something unexpected... he starts\n          sprinting straight at Sloan, still knocking his bullets\n          out of the air...\n          He closes the gap... ten feet... five feet...\n          ..a surprised and worried expression now spreads on\n          Sloan's face,.like what is this kid doing?\n          But Wesley is not stopping, he shoots the gun out of\n          Sloan's hand and then closes on him, tackling him off his\n          feet!\n          They go flying right over the edge of the building.\n          Wesley's able to grab on to a railing cable and stop\n          himself...\n          ..but Sloan is going to go over.\n          At the last moment, Sloan reacher. for-something.\n          anything. and grabs one-handed the barrel of\n          Wesley's gun...\n          For a moment, they dangle there in this precarious\n          position, looking each other in the face. Sloan can't\n          believe he's been bested by this kid.\n\n          SLOAN\n\n          (SNARLS)\n          Go ahead and shoot me, killer. Just like\n          you did your old man.\n          Wesley's finger starts to squeeze the trigger, but then\n          he smiles...\n\n          WESLEY\n          I'm done with this life. Just like my\n          father.\n          And with that, Wes1gy drops the n out of his h\n\n          FROM TWO HUNDRED FEET BELOW:\n          We watch Sloan's body fall through the sky...\n\n          \n\n          \n\n          \n\n          \n\n          108.\n          ..down, down, down...\n          .until it SMASHES into the sidewalk, splattering like a\n          grapefruit.\n\n          ON THE ROOFTOP:\n          Wesley rolls over on to his back, looking up at the\n          darkening sky.\n\n          WESLEY (V.O.)\n          It's true. Six weeks ago I was ordinary\n          and-pathetic. Just like you.\n          He sits up, moving OUT OF FRAME.\n\n          CUT TO:\n\n          EXT. CITY STREET - DAY\n\n          The place is now blanketed with cops, looking at the dead\n          bodies, trying to make sense of what happened.\n\n          WESLEY (V.0.)\n          But I've learned something in that time.\n          I've learned about the man who made me.\n\n          EXT. DOWNTOWN CORNER - DAY\n\n          Cope stand on the street, handing out pictures of Wesley,\n          asking pedestrians if they've seen this man.\n\n          WESLEY (V.O.)\n          I've learned about the man I am.\n\n          INT. POST OFFICE - DAY\n\n          Patrons stand in line at a post office, but the'CAMERA\n          PUSHES PAST THEM, finding a black and white \"WANTED\"\n          poster of Wesley, describing all the killings he's\n          responsible for. It holds tight on the picture.\n\n          WESLEY (V.0.)\n          I've learned that all of us are unique,\n          even though sometimes we're too fucking\n          blind to see it.\n\n          EXT. RESIDENTIAL STREET - DAY\n\n          The door to the safehouse opens, and Anna, Wesley and\n          Andrew step out into the bright sunlight. Wesley is\n          carrying his little brother.\n\n          \n\n          \n\n          \n\n          \n\n          109.\n          They turn and head up the street, toward the eastern sun.\n          The CAMERA RISES UP, UP, UP, where it hovers for a\n          minute... and just when we think it is going to leave the\n          planet...\n\n          WESLEY (V.0.) (CONT'D)\n          And I learned, the easiest place to hide\n          is in plain sight.\n          .it comes back DOWN, DOWN, DOWN, until it finds...\n\n          INT. TYPICAL INSURANCE OFFICE - DAY\n\n          ..Wesley sitting at a computer in the middle of another\n          cubicle maze, pecking away at his keyboard. A sign\n          attached to one wall reads: \"SAN ANGELO INSURANCE\n          ASSOCIATES: Setting the Bar Highl\"\n          Office workers mill about in their drab suits and ties,\n          wishing they were anywhere else.\n          A pretty RECEPTIONIST comes over to Wesley's desk.\n\n          RECEPTIONIST\n          You're the new guy, huh?\n\n          WESLEY\n          Just started last week.\n\n          RECEPTIONIST\n          Where'd you move here from?\n\n          WESLEY\n          All over the place, really. Nothing too\n          exciting.\n\n          RECEPTIONIST\n          Well, welcome to the team. Just watch\n          out for Brokaw. He'll stab you in the\n          back first chance he gets.\n          Just then, a harried man, BROKAW, comes storming up.\n\n          BROKAW\n          Jesus, Connie, don't you have some faxes\n          to get to?\n          The receptionist hurries away, making a face as she does.\n\n          BROKAW (CONT'D)\n          Laziest skirt I ever hired. But nice fun\n          bags, I'll give her that.\n\n          \n\n          \n\n          \n\n          \n\n          110.\n          He leans over Wesley's desk, right in his space.\n\n          BROKAW (CONT ' D )\n          Jim, right?\n\n          WESLEY\n          Yes, sir.\n\n          BROKAW\n          Listen, Jim, I don't want to get started\n          off on the wrong foot here, but we.have\n          numbers to make and if we don't make\n          those numbers, it's my ass on the line.\n          And if my ass gets chewed out by\n          regional, I can guarantee.that your ass\n          is gonna be Purina doggy chow. Now I'm\n          not sure how they ran things...\n          Wesley stares at that mouth zeroing in further and--\n          further, until the words become gibberish, just like they\n          did with Janice.\n          Wesley catches himself and snaps out of it, just in time\n          to hear...\n\n          BROKAW (CONT'D)\n          .so do we understand each other?\n\n          WESLEY\n          Of course.\n\n          BROKAW\n          Good boy.\n          With that, he hurries away, his pants riding so high up\n          his ass that they look like they may burst at any second.\n          Wesley stares up at the clock on his monitor: it reads\n          11:15. He stands up, stretches, and makes his way to the\n          receptionist's desk. She looks up, bites her lower\n          lip...\n\n          WESLEY\n          You want to take a break with me?\n\n          RECEPTIONIST\n          Sure!\n          She stands and they move toward the elevators, waiting\n          for the doors to open.\n\n          RECEPTIONIST (CONT'D)\n          You know, we don't usually get breaks.\n\n          \n\n          \n          Just then, the elevator doors DING.\n\n          WESLEY\n          Well, you'll find there's nothing \"usual\"\n          about me.\n          They climb in.\n          THE CAMERA PUSHES IN TIGHTER AND TIGHTER on Wesley's\n          face...\n\n          WESLEY (V.O.)\n          This life is ours, to make of it what we\n          can.\n          .until it fills the screen, looking just like the shot\n          of Wesley we started with. And then a sly smile spreads\n          across his mug...\n\n          WESLEY (V.0.)\n          I think I'll give it a shot.\n          .and as the doors close, we officially...\n\n          FADE OUT.\n\n\n\n\n\nWanted\nWriters :   Michael Brandt  Derek Haas\nGenres :   Action  Crime  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "An innocent Abhay Mohanty comes to city with lots of dreams, a decent job, beautiful life. In a circumstances he has to fight with local goons. His ambitions leads him to the criminal world. Hi becomes Baba, the Don of the dons. He becomes the most wanted in police file."}