{"title": "War Horse", "full_text": "WAR HORSE\r\n                         \r\n                         \r\n\r\n                                  Written by\r\n\r\n                         Lee Hall & Richard Curtis\r\n\r\n\r\n\r\n          1.\r\n                         \r\n          EXT. DEVON, ENGLAND. A SUMMER'S DAY, 1912.\r\n                         \r\n          The bucolic magnificence of the Devon countryside. We fly\r\n          low over the high, thick hedges untouched for hundreds of\r\n          years. The thick verdant countryside in all its splendor,\r\n          ancient woodlands, fields of corn, and finally a paddock in a\r\n          typical Devonshire dale.\r\n                         \r\n          We come to rest beside three farmers standing over a pregnant\r\n          mare. The mare is in distress - she is about to give birth.\r\n          The farmers calm the mare and tend to her gently with\r\n          assurance and authority.\r\n                         \r\n          We pull back to see, ALBERT, a fifteen-year-old farm boy,\r\n          watching the whole drama with delight from the paddock gate.\r\n                         \r\n                          FARMER\r\n           Come on, easy, girl. Easy, girl.\r\n           Easy.\r\n                         \r\n          The men hold the mare firmly, but clearly this is a difficult\r\n          birth.\r\n                         \r\n                          FARMER 2\r\n           This is a stubborn one, huh?\r\n                         \r\n                          FARMER 3\r\n           There we go. Who's a clever girl?\r\n                         \r\n          Moments later - the summer's sun glints off the wet, sticky\r\n          hide of the foal (JOEY) - red hide, four white socks and a\r\n          distinctive white cross on its forehead.\r\n                         \r\n          Soon the creature is attempting its first clumsy steps. It is\r\n          both awesome and comical to see the new born creature\r\n          struggle to his feet, but eventually, he succeeds.\r\n          Title: WAR HORSE\r\n                         \r\n          EXT. PADDOCK/FIELD, DEVON. VARIOUS.\r\n                         \r\n          We follow Joey's progress over the course of his first year.\r\n          His initial fearfulness, his connection with his mother, the\r\n          intimacy of their relationship.\r\n                         \r\n          As Joey gets strong they run together, frolicking gayly in\r\n          the last dregs of summer. Albert looking on. Joey notices him\r\n          at the fence and they share a moment of connection.\r\n                         \r\n          Spring: flowers are beginning to sprout by the hedgerows. Our\r\n          boy Albert runs into the field. He takes an apple from his\r\n          pocket - he holds it out tentatively. Joey approaches Albert\r\n          with suspicion. Albert gently encourages him.\r\n           2.\r\n                         \r\n          His mother paws the ground and neighs at Joey. He turns and\r\n          runs over the field at her beck and call.\r\n                         \r\n          Albert tosses the apple to himself, ruefully - watches in awe\r\n          as Joey races away with his mother.\r\n                         \r\n          He is a magnificent one year old. His distinctive red coat\r\n          gleaming, now it is clear that he is half thoroughbred. He\r\n          runs quickly around the field enjoying his own power and\r\n          strength.\r\n                         \r\n          Later - the three farmers open the gate and come into the\r\n          field. Both Joey and his mother instinctively canter over to\r\n          the two men, expecting food. The three men gently greet the\r\n          horses and pet them, then we see one man has a noose made of\r\n          a rope. He slips it round Mum's neck. She pulls back, Joey is\r\n          shaken and bewildered but before he knows what's happening\r\n          the second farmer is trying to get a similar rope around his\r\n          neck. Joey balks and pushes the farmer aside, distressed to\r\n          see his mother tethered. The farmer grabs Joey again and\r\n          struggles with him, enlisting the help of the second farmer.\r\n          With some effort they get the rope around his neck and calm\r\n          him down.\r\n                         \r\n                          FARMER 2\r\n           Easy does it. Easy does it. Come on,\r\n           steady does it.\r\n                         \r\n          Unused to being tethered Joey pulls at the rope but the\r\n          farmers are solid and firm. They gently lead Joey and his\r\n          mother across the field to the gate and out into the road.\r\n                         \r\n          The whole road becomes overtaken by a flock of sheep on their\r\n          way to the market. In the distance we hear the bustle of\r\n          Market Day.\r\n                         \r\n          EXT. THE MARKET. THE SAME.\r\n          The farmers lead Joey and his mother through the chaos of the\r\n          market and into an auction pen. They find themselves amongst\r\n          a hoard of pigs, sheep and cows. Joey is agog at all of these\r\n          creatures and all this life he had no idea existed.\r\n                         \r\n          The farmers lead the horses into a stall to await the\r\n          auction. Joey is bewildered by all the noise - buttressed\r\n          against a couple of mules and a cow. He is uncomfortable in\r\n          this tight space.\r\n                         \r\n          An AUCTION WORKER holds a clipboard out for the lead farmer.\r\n                         \r\n                          AUCTION MAN 1\r\n           Mornin', pop. Put your mark here.\r\n           Good luck.\r\n           3.\r\n                         \r\n          EXT. JOEY'S PEN. THE SAME.\r\n                         \r\n          Two men approach the pen.\r\n                         \r\n                          AUCTION MAN 2\r\n           Get the colt...\r\n                         \r\n          One man grabs Joey and pulls him out of the pen. Suddenly\r\n          there is a look of horror on his face. His terrified mother\r\n          realises they are being separated. Joey panics and\r\n          desperately tries to get back to his mother, he rises up\r\n          throwing the man who is leading him aside. Joey is out of\r\n          control. The man regains control of Joey.\r\n                         \r\n                          AUCTION MAN 3\r\n           Whoa! Whoa!\r\n                         \r\n          He pulls Joey away from his mother, who lets out a heart-\r\n          rending cry, paws the ground, and crashes her foreleg against\r\n          the fence. Joey remains disoriented in the midst of the\r\n          market day chaos.\r\n                         \r\n           AUCTION MAN 3 (CONT'D)\r\n           Easy...\r\n                         \r\n          INT. MAIN AUCTION RING. THE SAME.\r\n                         \r\n          The auction ring is full of people of all shapes and sizes.\r\n          There is a sense of celebration and busyness about market\r\n          day.\r\n                         \r\n          We concentrate on two men - Ted Narracott (DAD), in his\r\n          forties, clearly both the cares of the world and alcohol have\r\n          worn him down before his time, and SI EASTON, his more solid\r\n          friend, both working farmers. Just behind Si is his 15 year\r\n          old son, ANDREW. Ted has a drink in his hand. They all look\r\n          at Joey bridling against the men who are trying to hold him.\r\n                          DAD\r\n           Now that's a beauty.\r\n                         \r\n                          SI EASTON\r\n           Forget it, Ted. He's half\r\n           thoroughbred and not got a day's\r\n           work in him.\r\n           (points to a plow horse next to\r\n                          JOEY)\r\n           Now, there... There's your ticket.\r\n                         \r\n          In contrast to Joey, the solid and bulky plow horse stands\r\n          like a rock. But Dad remains fixated on Joey.\r\n                         \r\n                          DAD\r\n           But look at him, Si. Look at that creature.\r\n           4.\r\n                         \r\n          Indeed, Joey is magnificent, his power clearly emerging\r\n          because of his upset.\r\n                         \r\n                          SI EASTON\r\n           Don't be daft. You need something\r\n           solid to plow a field.\r\n                         \r\n                          DAD\r\n           (fixed on Joey)\r\n           Yeah, but he's something else, that one.\r\n                         \r\n          The AUCTIONEER announces the start of the auction...\r\n                         \r\n                          AUCTIONEER\r\n           Alright gentlemen - settle down - settle\r\n           down - horses on my right - men with money\r\n           in their pockets on my left - it's the\r\n           perfect combination. Is Fred Goddard here?\r\n          FRED shouts his reply from the crowd.\r\n                         \r\n                          FRED\r\n           YES! I's here.\r\n                         \r\n                          AUCTIONEER\r\n           Good - more money than sense. Dave Hill?\r\n                         \r\n                          DAVE\r\n           I'm here. Yes!\r\n                         \r\n                          AUCTIONEER\r\n           Bugger off, you tight bastard - you've been\r\n           coming here for 20 years - never bought so\r\n           much as a pork scratching.\r\n                         \r\n          The crowd are loving all this.\r\n          Dad notices a figure across the ring, LYONS, clearly a man of\r\n          money. You can see something light up in Dad's eyes - a\r\n          combination of dislike and alcohol.\r\n                         \r\n          Joey is led into the auction pen.\r\n                         \r\n                          AUCTIONEER (CONT'D)\r\n           Okay - first up today - a gorgeous young\r\n           horse - prettiest thing I've seen since my\r\n           wife on our wedding day. Let's get going,\r\n           shall we? Who wants this wonderful creature.\r\n                         \r\n          But no-one bids.\r\n                         \r\n                          DAD\r\n           One guinea.\r\n           5.\r\n                         \r\n                          AUCTIONEER\r\n           One guinea, one guinea, one\r\n           guinea...\r\n                         \r\n           YOUNG ANDREW EASTON\r\n           I thought you needed a plow horse, Mister\r\n           Narracott.\r\n                         \r\n                          AUCTIONEER\r\n           Any advance on one guinea? Any\r\n           advance on one guinea?\r\n                         \r\n          Joey is still trying to get back to his mother. A voice from\r\n          the crowd pipes up:\r\n                         \r\n                          LYONS\r\n           Two guineas.\r\n                          DAD\r\n           Three!\r\n                         \r\n                          SI EASTON\r\n           Ted Narracott - it's completely the wrong\r\n           animal.\r\n                         \r\n          Lyons whispers to his son, DAVID, 15, next to him. David eyes\r\n          Joey skeptically.\r\n                         \r\n                          DAD\r\n           Si Easton - I'm not gonna let that\r\n           bastard see me off.\r\n                         \r\n                          LYONS\r\n           Five guineas.\r\n                         \r\n                          DAD\r\n           Six!\r\n                          SI EASTON\r\n           Oh for the love of...!\r\n                         \r\n          Joey is straining to get to his mother, the men are pulling\r\n          him back.\r\n                         \r\n                          LYONS\r\n           Seven.\r\n                         \r\n                          DAD\r\n           Greedy sod thinks he can just buy anybody.\r\n                          (BIDDING)\r\n           Eight.\r\n           6.\r\n                         \r\n                          SI EASTON\r\n           Stop it - he's your landlord - you\r\n           can't be picking fights with him.\r\n                         \r\n          Lyons looks over. There is now tension in the crowd as they\r\n          sense a Battle Royal for the horse.\r\n                         \r\n                          LYONS\r\n           Ten guineas.\r\n                         \r\n          He smirks at Dad.\r\n                         \r\n                          SI EASTON\r\n           You haven't got the money. Let's go\r\n           home - let's have a pint.\r\n                         \r\n                          DAD\r\n           Eleven guineas, sir, from as good a man as\r\n           any in this town.\r\n                         \r\n          They all look at Lyons in his suit and bowler hat.\r\n                         \r\n                          AUCTIONEER\r\n           Do I hear twelve guineas? Twelve guineas?\r\n                         \r\n                          SI EASTON\r\n           That's top price for a workin'\r\n           animal. Ted! Save it for the shire!\r\n                         \r\n                          DAD\r\n           There are big days and there are\r\n           small days. Which will it be?\r\n                         \r\n                          AUCTIONEER\r\n           Do I hear any advance on eleven guineas?\r\n                         \r\n          All eyes are on Lyons and his son - David is 15, smartly\r\n          dressed.\r\n                         \r\n                          DAVID LYONS\r\n           Just let him go, dad, I don't care\r\n           for him, he's too... jumpy.\r\n                         \r\n          Lyons isn't listening to David; he's looking hard at Ted.\r\n                         \r\n                          LYONS\r\n           Shall we say - twenty five?\r\n                         \r\n          The crowd gasps. This is clearly personal.\r\n                         \r\n                          SI EASTON\r\n           Well, he's got you there. Nice try, Ted.\r\n           7.\r\n                         \r\n                          ANDREW\r\n           You were great, Mr N. Gave him a run\r\n           for his money.\r\n                         \r\n          But when he looks at Ted, Ted's eyes are locked into the eyes\r\n          of his rival.\r\n                         \r\n                          AUCTIONEER\r\n           Going, going...\r\n                         \r\n                          DAD\r\n           Thirty. Thirty guineas!\r\n                         \r\n          Total silence. He stares hard at Lyons. Who simply smiles,\r\n          raises an eyebrow, tips his hat and walks away. It dawns on\r\n          Dad that he's won the auction. He breaks into a sweat.\r\n                         \r\n                          AUCTIONEER\r\n           Thirty guineas. Thirty guineas. Going\r\n           going gone - to Mister Ted Narracott.\r\n                         \r\n          He bangs his gavel. It's a done deal.\r\n                         \r\n                          SI EASTON\r\n           What have you done, Ted? What have you done?\r\n                         \r\n          Dad doesn't acknowledge Si.\r\n                         \r\n          Moments later - Ted stands staring at Joey, who looks back.\r\n          Ted holds his reins numbly, accepts his receipt from the\r\n          auction man in a kind of daze.\r\n                         \r\n          Suddenly, Lyons appears at Dad's shoulder.\r\n                         \r\n                          LYONS\r\n           Quite a beast, there. But what you gonna do\r\n           with him - on a working farm? I hope you\r\n           got the rent, Ted. I'll be around for it\r\n           when it comes due.\r\n                         \r\n          Dad does not acknowledge Lyons. Lyons smiles and walks away\r\n          with son David, and his cronies. Si shakes his head at Dad.\r\n                         \r\n                          SI EASTON\r\n           You're a fool, Ted. And our Rosie'll\r\n           never forgive you.\r\n                         \r\n          EXT. NARRACOTT'S FARM. SUNSET.\r\n                         \r\n          MRS. NARRACOTT kneels in her garden, digging up some carrots,\r\n          when she sees Ted returning.\r\n                         \r\n          Dad walks down the hedged lane as the sun sets pulling Joey\r\n          with him, his bad leg always moving slightly to the side.\r\n           8.\r\n                         \r\n          Mrs. Narracott looks in horror and bewilderment at Joey and\r\n          then at Dad. She is a good-looking, intelligent woman, but\r\n          clearly her life is always hard.\r\n                         \r\n           MRS. NARRACOTT\r\n           What have you done?\r\n                         \r\n          Dad stands shamefaced as Albert - the boy we have already met\r\n          - runs out of the house to join them.\r\n                         \r\n                          ALBERT\r\n           That's Mooney's colt!\r\n                         \r\n           MRS. NARRACOTT\r\n           You were supposed to buy a plow horse.\r\n                         \r\n                          ALBERT\r\n           You bought him?\r\n           MRS. NARRACOTT\r\n           What'd you pay for him?\r\n                         \r\n          Albert is totally taken by the horse.\r\n                         \r\n           MRS. NARRACOTT (CONT'D)\r\n           How much, Ted Narracott?\r\n                         \r\n                          DAD\r\n           I won't tell you a lie - though I would love\r\n           to. Thirty guineas.\r\n                         \r\n           MRS. NARRACOTT\r\n           Thirty guineas!\r\n                         \r\n          She is stunned. She looks at Ted - and he just nods.\r\n                         \r\n           MRS. NARRACOTT (CONT'D)\r\n           He's not worth ten! Are you out of your\r\n           mind? What about the rent?\r\n                         \r\n                          DAD\r\n           He's a strong one, Rosie. Look at\r\n           the way he holds his head!\r\n                         \r\n           MRS. NARRACOTT\r\n           How the hell are we gonna pull anything with\r\n           that? Ted - you have to take him back. You\r\n           have to take him back right now now.\r\n                         \r\n                          ALBERT\r\n           No.\r\n           9.\r\n                         \r\n           MRS. NARRACOTT\r\n           You have to get down on your knees and beg\r\n           for our money back.\r\n                         \r\n          Joey bridles at the raised voices but Albert takes the rope\r\n          and tries to calm him.\r\n                         \r\n                          ALBERT\r\n           No. No, please don't take him back.\r\n                         \r\n          Suddenly we see Dad's dejection. He is a man lost.\r\n                         \r\n                          DAD\r\n           We can't take him back till he's broken in.\r\n                         \r\n           MRS. NARRACOTT\r\n           And how are you gonna train a horse with\r\n           that leg?\r\n                          ALBERT\r\n           I'll train him.\r\n                         \r\n           MRS. NARRACOTT\r\n           No, you stay out of this, Albie. You don't\r\n           know nothing about horses.\r\n                         \r\n                          ALBERT\r\n           Please, Mum. Please let me. I can do it.\r\n                         \r\n                          DAD\r\n           We have to keep him. We've no choice.\r\n                         \r\n           MRS. NARRACOTT\r\n           Right. Well... you've got one month to\r\n           break him in or I'm taking him back myself.\r\n           (She turns to the house,\r\n           but then...)\r\n           How did you get to thirty - what other fool\r\n           bid you up that high?\r\n                         \r\n                          DAD\r\n           It was Lyons.\r\n                         \r\n          Mrs. Narracott turns back towards the house, then stops,\r\n          dazed, speaking almost to herself.\r\n                         \r\n           MRS. NARRACOTT\r\n           We're gonna lose everything. After all we've\r\n           been through - we're gonna lose it all.\r\n                         \r\n          She turns back to the others - the weight of the mistake\r\n          heavy on their shoulders - but Albert quickly steps forward.\r\n           10.\r\n                         \r\n                          ALBIE\r\n           Don't worry, Mum - I'll raise him - and I'll\r\n           raise him good.\r\n                         \r\n           MRS. NARRACOTT\r\n           Well, you better. Go on - get started. See\r\n           if a child can undo what your fool of a\r\n           father's done to this family of ours.\r\n                         \r\n          Mrs. Narracott storms into the house. Albert immediately\r\n          goes to stroke Joey but the nervous horse draws back\r\n          uncomfortably. Dad leads him off, drunk and bewildered,\r\n          across the yard to the barn.\r\n                         \r\n          EXT. STABLES. LATER.\r\n                         \r\n          Albert loads some oats into a bucket and approaches Joey in\r\n          the field.\r\n                          ALBERT\r\n           Right. Let's make a start then.\r\n                         \r\n          As Albert approaches, Joey nervously runs in circles, then\r\n          stops on a dime, looking at Albert suspiciously.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           It's oats. Very tasty, that is. It's\r\n           beef and gravy to us!\r\n                         \r\n          Albert squats down. He shows the food. Joey catches the\r\n          scent on the air, but still hesitates and shies away.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Come on...\r\n                         \r\n          This time, Albert takes a new tact, almost turning his body\r\n          fully away from Joey, but keeping the bucket extended.\r\n          Albert slowly backs towards Joey, speaking gently all the\r\n          while.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           I bet you're missing your mother.\r\n           Look at you... first time without\r\n           your mum. First time away from home.\r\n           But you're not alone, are you. In\r\n           fact. Cos I'm `ere...\r\n                         \r\n          Feeling safer, Joey moves toward the bucket of oats and\r\n          starts to eat.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           It's alright. It's alright.\r\n           11.\r\n                         \r\n          Albert reaches out his hand and touches Joey. And with a\r\n          slight start, the horse relaxes into Albert's hand, feeling\r\n          safe with the boy.\r\n                         \r\n          Albert stares at the distinctive white cross on Joey's\r\n          forehead. Joey calms.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           I'm gonna call you Joey. Understand? Joey.\r\n           That's you. And I'm Albert. It's alright,\r\n           You're mine now. You're mine.\r\n                         \r\n          Albert strokes Joey's forehead. Joey lifts his head and the\r\n          two stare at each other in close proximity.\r\n                         \r\n          EXT. FARMYARD. NEXT DAY.\r\n                         \r\n          Dad, with a hangover, hobbles off to work the fields. As he\r\n          reaches the gate, HAROLD the goose snaps at his heels. Dad\r\n          dismisses him with a stare and heads for the stables.\r\n                         \r\n          EXT. THE FARMYARD, DAY.\r\n                         \r\n          The training episode: Albert walks Joey around the yard on\r\n          the rope. It all seems to be going well. Mum looks on. Albert\r\n          is clearly proud of his progress.\r\n                         \r\n          EXT. PADDOCK. ANOTHER DAY.\r\n                         \r\n          Albert's friend, Andrew Easton, sits on a rock with an apple\r\n          in hand to watch the training.\r\n                         \r\n          Albert sets Joey in a spot and tells him to wait.\r\n                         \r\n                          ALBERT\r\n           Whoa. I want you to stay there,\r\n           Joey. Stay. That's it. Good boy.\r\n           That's it, you've got it.\r\n                         \r\n          Of course when Albert walks away, Joey follows.\r\n                         \r\n          A game of \"Grandma's footsteps\" ensues as Albert patiently\r\n          places Joey then walks away.\r\n                         \r\n                          ANDREW\r\n           Hey, look at him, Albie. He's\r\n           playing \"Grandma's Footsteps.\"\r\n                         \r\n          Albert patiently leads Joey back to his starting position.\r\n                         \r\n                          ALBERT\r\n           Right, come on, Joey. Back you go.\r\n           Come on. Back you go.\r\n                          (MORE)\r\n           12.\r\n                          ALBERT (CONT'D)\r\n           You're all right. That's it. Good\r\n           boy. Right. You've gotta stay\r\n           there, understand?\r\n                         \r\n          Albert walks away again.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           That's it. Good boy. You've got it.\r\n           Good boy.\r\n                         \r\n          Finally Joey stays put. Andrew smiles, impressed.\r\n                         \r\n                          ANDREW\r\n           Good boy. Good.\r\n                          (TO ALBERT)\r\n           Now call him. Whistle.\r\n                         \r\n                          ALBERT\r\n           Come now, Joey. Come on.\r\n                         \r\n          Albert whistles like an owl. Joey stands completely still.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           You can come now, Joey.\r\n                         \r\n          He whistles again. Joey remains still.\r\n                         \r\n                          ANDREW\r\n           Don't think he fancies your owls.\r\n                         \r\n          Albert walks back to Joey, frustrated.\r\n                         \r\n                          ALBERT\r\n           No, I read it in a story. It's how\r\n           the Indians used to summon their\r\n           horses.\r\n          He gently strokes Joey's nose.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Now, Joey, when I whistle, you've\r\n           gotta come, understand?\r\n                         \r\n                          ANDREW\r\n           My dad had a dog who stayed when you\r\n           called him. He used to run up\r\n           behind you when you weren't\r\n           looking, and uh...\r\n                         \r\n                          ALBERT\r\n           He's not a dog. He's just puzzling\r\n           it through.\r\n           13.\r\n                         \r\n          Albert runs further away than before and whistles. After a\r\n          moment, Joey trots over to him. Andrew smiles broadly.\r\n                         \r\n                          ANDREW\r\n           Brilliant. Look at you.\r\n                         \r\n          With the basis established, Albert begins to train Joey to\r\n          react to the owl whistle without his prompting. It's not all\r\n          easy going - sometimes Albert makes progress, sometimes not.\r\n                         \r\n          QUICK MONTAGE - Mrs. Narracott fills a bucket at the pump,\r\n          then promptly spills it when Joey trots past her in response\r\n          to an owl whistle. She calls off, frustrated.\r\n                         \r\n           MRS. NARRACOTT\r\n           Albie.\r\n                         \r\n          Dad heads out to the fields with a rake on his shoulder.\r\n          There's an owl call and Joey trots past him in the\r\n          background. Dad sees Albert welcome Joey by the haystacks,\r\n          stroking his nose affectionately. Dad walks on, his\r\n          expression inscrutable.\r\n                         \r\n          Joey trots up a path, pursuing another owl call. After\r\n          several more calls, he still can't spot Albert, until he\r\n          cranes his neck up and sees Albert sitting in a nearby tree.\r\n          Albert laughs.\r\n                         \r\n          INT. FARM HOUSE. LATER.\r\n                         \r\n          Lyons is there with his son, David, and his unlikable\r\n          cronies. He holds a meager handful of cash. Dad and Mum look\r\n          chastened. The mood is sombre.\r\n                         \r\n                          LYONS\r\n           There's only fifteen here.\r\n                          DAD\r\n           The rest will come.\r\n                         \r\n                          LYONS\r\n           You know by rights I could take this farm\r\n           back today, don't you? And I'm a great\r\n           believer in my rights.\r\n                         \r\n                          DAD\r\n           It will come.\r\n                         \r\n                          LYONS\r\n           If you drank less beer and bought fewer\r\n           horses you might be able to look your\r\n           landlord in the eye, Narracott.\r\n                         \r\n          Lyons begins loading up his ledger into his bag.\r\n           14.\r\n                         \r\n                          DAD\r\n           I said I'll pay you. We got to plant the\r\n           bottom field.\r\n                         \r\n                          LYONS\r\n           Bottom field's rock hard. Only stones down\r\n           there.\r\n                         \r\n                          DAD\r\n           No, we're going to plow it. Just give me\r\n           `til the autumn. I'll pay every penny I owe\r\n           you. With interest.\r\n                         \r\n                          LYONS\r\n           How you going to plow it? Not with that\r\n           fancy animal of yours?\r\n                         \r\n                          DAD\r\n           He'll do it.\r\n                         \r\n                          LYONS\r\n           You'll not get that one in a harness, let\r\n           alone pulling a plow. Even drunk on a\r\n           Tuesday night, you know that. And I can't\r\n           wait for the money - there's a war coming.\r\n                         \r\n          Dad stands up from his chair, resolute.\r\n                         \r\n                          DAD\r\n           I promise you that field will be plowed.\r\n           We'll plant it with turnips. And the money\r\n           will be yours when harvest comes.\r\n                         \r\n          Mrs. Narracott interjects, desperate.\r\n                         \r\n           MRS. NARRACOTT\r\n           Please, sir. Please.\r\n          Lyons takes his time. He looks at them both - Ted and Rosie,\r\n          almost beaten.\r\n                         \r\n                          LYONS\r\n           Very well - if that fancy plows that field\r\n           I'll give you till October to set things\r\n           straight.\r\n                         \r\n          Lyons heads for the door, but Albert stands in his way.\r\n                         \r\n                          ALBERT\r\n           What if he doesn't?\r\n                         \r\n                          LYONS\r\n           I'll take the horse on the day he fails.\r\n                          (BEAT)\r\n                          (MORE)\r\n           15.\r\n                          LYONS (CONT'D)\r\n           And I'll take your father's farm and give it\r\n           to working men who can hold their pints and\r\n           hold their heads high in decent company.\r\n                         \r\n          Lyons tries to move past, but Albert grabs his arm.\r\n                         \r\n                          ALBERT\r\n           No, please. Sir, you can't do that.\r\n                         \r\n                          LYONS\r\n           Now, now, now, lad. What - are you bladdered\r\n           as well?! Ted Narracott - I got you down in\r\n           my book!\r\n                         \r\n          Albert knows he has to back down. Lyons walks past him and\r\n          leaves with David and his cronies.\r\n                         \r\n          EXT. THE NARRACOTT FARM. THE SAME.\r\n          Harold the goose attacks Lyons and his men. They quickly\r\n          pile into his car and drive off.\r\n                         \r\n          Ted stands in the kitchen immobile with upset.\r\n                         \r\n          EXT. STABLES. MOMENTS LATER.\r\n                         \r\n          Dad throws open the stable door, jerks the harness from the\r\n          wall, throws open Joey's stall and starts to lunge at the\r\n          horse.\r\n                         \r\n          Albert runs in to try to stop him.\r\n                         \r\n                          ALBERT\r\n           You can't harness him.\r\n                         \r\n                          DAD\r\n           He's got to be collared.\r\n          Dad starts to grapple with Joey desperately flailing in an\r\n          attempt to get the harness onto Joey. Joey is completely\r\n          confused and frightened.\r\n                         \r\n                          ALBERT\r\n           No, you can't. Look, you're scaring him,\r\n           Dad. You're scaring him. He...\r\n                          (DESPERATE)\r\n           He can't take a plow!\r\n                         \r\n          Joey tries to push Dad out of the way, Dad frustrated by this\r\n          hits Joey hard with the harness.\r\n                         \r\n                          DAD\r\n           He's got to plow!\r\n           16.\r\n                         \r\n                          ALBERT\r\n           He won't be able to do it - he's too young -\r\n           he's not even been backed yet....\r\n                         \r\n          Joey rears up and kicks Dad. Who falls to the ground.\r\n                         \r\n           MRS. NARRACOTT\r\n           Ted!\r\n                         \r\n          Albert grabs Joey's bridle. Joey wrestles with Albert.\r\n                         \r\n                          ALBERT\r\n           It's alright, boy. It's alright. It's\r\n           alright. It's alright.\r\n                         \r\n          Dad is mad with anger and frustration - and in pain. He\r\n          staggers to his feet and leaves.\r\n          Albert calms Joey down. Mrs. Narracott returns the harness\r\n          to its hook.\r\n                         \r\n           MRS. NARRACOTT\r\n           I knew this would happen soon as I laid eyes\r\n           on him....\r\n                         \r\n          But then she notices Dad has returned. He has a gun.\r\n                         \r\n           MRS. NARRACOTT (CONT'D)\r\n           Ted. No. Ted, no!\r\n                         \r\n                          DAD\r\n           He's worth nothing to me! If he won't take\r\n           the collar, he's not worth a damn thing!\r\n                         \r\n                          ALBERT\r\n           Dad?\r\n          He grabs the rifle, but Dad shoves him away.\r\n                         \r\n                          DAD\r\n           Move aside.\r\n                         \r\n          Dad raises the rifle, but Albert wrestles for it again.\r\n                         \r\n                          ALBERT\r\n           Dad. Stop.\r\n                         \r\n          Furious with frustration Dad throws Albert to the ground and\r\n          takes aim at the horse.\r\n                         \r\n          Mrs. Narracott quickly pulls the gun aside.\r\n                         \r\n           MRS. NARRACOTT\r\n           You shoot that horse we have nothing.\r\n           17.\r\n                         \r\n          Dad whips the gun back towards Joey to find Albert standing\r\n          between them - right in front of the gun's barrel. For a\r\n          second we think Albert will be inadvertently shot.\r\n                         \r\n           MRS. NARRACOTT (CONT'D)\r\n           NO!\r\n                         \r\n          Dad pauses his finger just in time. Albert gently holds the\r\n          barrel of the gun. Speaks calmly.\r\n                         \r\n                          ALBERT\r\n           You were right what you said, Dad. \"He'll do\r\n           it,\" you told Lyons, \"He'll plow that\r\n           field.\" And he will! You'll see. He'll show\r\n           you. We'll show you. We'll get it done.\r\n                         \r\n          Dad looks at him, frozen. Mrs. Narracott eases the gun away\r\n          from him -\r\n                          MUM\r\n           Let go. Let go.\r\n                         \r\n          - and hands it to Albert, telling him -\r\n                         \r\n                          MUM (CONT'D)\r\n           Go back to the house.\r\n                         \r\n          As Albert leaves, Ted takes out his flask. But Rosie takes it\r\n          from him gently. He doesn't resist.\r\n                         \r\n           MRS. NARRACOTT\r\n           Here, here. Some days are best forgotten.\r\n           Today ain't one of them. Come on.\r\n                         \r\n          They exit the stable together, leaving Joey in his stall.\r\n                         \r\n          INT./ EXT. STABLES. DAWN.\r\n          Albert walks towards the stables - enters. And talks to Joey\r\n          as he prepares the harness.\r\n                         \r\n                          ALBERT\r\n           How are you today, Joey? I don't know much\r\n           about life, boy, but I do know that there\r\n           are big days and there are small days. And\r\n           most days are small days, and, well, they\r\n           don't matter much to anyone - but this -\r\n           well, this is a big one. This is our big\r\n           day. Well, it's cold out there. So I'm going\r\n           to take this off -\r\n           (he takes off his coat)\r\n           Well, if it's tough for you - it should be\r\n           tough for me, too...\r\n           18.\r\n                         \r\n          He is left in just a loose-fitting white shirt....\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Now, I'm gonna teach you how to plow\r\n           and you're gonna learn. Is that\r\n           understood? And then we can be\r\n           together, which is how I believe\r\n           things are meant to be.\r\n                         \r\n          Joey instinctively balks, but Albert is stern with him.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Boy. Steady, boy. Here we go. Here\r\n           we go.\r\n                         \r\n          As he approaches Joey with the harness, Harold the goose\r\n          enters the stable to watch.\r\n          Albert approaches gently and slowly puts the harness over his\r\n          own neck and shoulders to demonstrate -\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Easy, easy... Look at me, Joey. See?\r\n           See? You've just gotta put your nose\r\n           through.\r\n                         \r\n          It is a moment between them. The horse looks Albert in the\r\n          eye, then yields. Albert comforts him and show there is\r\n          nothing to fear. Finally he gets the harness in place.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           That's it. See? You've got it.\r\n           You've got it. Good boy. There...\r\n                         \r\n          Harold honks his approval.\r\n                         \r\n          Albert leads Joey out across the yard, through the broken\r\n          gate.\r\n                         \r\n          EXT. LOWER FIELD. THE SAME.\r\n                         \r\n          It is a grey day as they walk across the plowed fields\r\n          towards the huge lower field. They come to a rusty, primitive\r\n          plow left in the grass. Albert looks around the field - it is\r\n          overgrown, it seems to go on forever - even if Joey was a\r\n          plow horse this would be a heavy task.\r\n                         \r\n          Si Easton and Andrew stroll up the road to watch.\r\n                         \r\n                          SI EASTON\r\n           Too large, too rocky, matted with\r\n           grass roots. Even a sturdy plow\r\n           horse'd never manage it alone.\r\n           19.\r\n                         \r\n                          ANDREW\r\n           Yet he will, I say.\r\n                         \r\n                          SI EASTON\r\n           You'd swear he'd sprout wings and\r\n           fly if Albert had told you so.\r\n           (smiling at his son:)\r\n           It's a fine thing, loyal to your\r\n           mate. Even if he is a bit barmy. A\r\n           team of two might manage, given a\r\n           month and good weather.\r\n                         \r\n          They're interrupted by the honk of a horn as Lyons and David\r\n          pull up in a car. Lyons and David get out. Their driver\r\n          remains inside.\r\n                         \r\n                          LYONS\r\n           Ted too squeamish to watch, is he?\r\n                          SI EASTON\r\n           `Course he's watching.\r\n                         \r\n          Si nods in the direction of the house.\r\n                         \r\n          Albert steadies Joey and starts to tie on the heavy plow. It\r\n          just seems too big and bulky for Joey's sleek frame. Albert\r\n          sets Joey right and fixes the plow.\r\n                         \r\n          Lyons, David, Si, and Andrew walk towards Dad, who looks on\r\n          anxiously from a nearby hedgerow. Lyons gestures at David to\r\n          stay back and walks over to Ted alone. He stands beside him\r\n          and begins to talk gently.\r\n                         \r\n                          LYONS\r\n           Well, you've raised him up a true\r\n           Narracott, Ted, picture of his\r\n           father, he is: not a dollop of\r\n           ordinary sense but that thick\r\n           stubbornness that'll lead him to\r\n           insist on the impossible.\r\n                         \r\n          Down in the field, Albert continues to prep the plow.\r\n                         \r\n                          LYONS (CONT'D)\r\n           Wasn't a farmer in Devon didn't\r\n           admire you, myself among `em,\r\n           leaving your brothers that fine farm\r\n           and setting yourself at this stoney\r\n           patch of unpromising ground. You've\r\n           fettle enough for twenty men, but\r\n           with a gimpy leg and the drinking -\r\n           for the pain, isn't it, that you\r\n           drink?\r\n                          (MORE)\r\n           20.\r\n                          LYONS (CONT'D)\r\n           - yeah, none of us could have\r\n           anticipated an ending better than\r\n           this. Makes me question the wisdom\r\n           of the charity that urged me to rent\r\n           you this place, not only looking at\r\n           you, me old pal, but that pretty\r\n           little wife of yours, thought you\r\n           were a spark, she did.\r\n                         \r\n          Ted hasn't acknowledged Lyons for a second; he's never taken\r\n          his eyes off Albert. He simply stands and walks away as\r\n                         LYONS CONCLUDES:\r\n                         \r\n                          LYONS (CONT'D)\r\n           And now your son's sinking into the\r\n           selfsame bog that's swallowing you.\r\n                         \r\n          Albert has been meticulously preparing everything,\r\n          positioning Joey, checking the tethers, digging the rusty\r\n          plow in the earth. He takes his position behind the plow,\r\n          throwing the rear leather harness over his own neck.\r\n                         \r\n                          ALBERT\r\n           See Joey - I got the collar, too!\r\n                         \r\n          Albert gently snaps the reins. Joey doesn't move, confused by\r\n          the whole affair.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Come on, boy. Walk on. That's it. Walk on!\r\n           Walk on, Joey. Come on, boy, walk on.\r\n                         \r\n                          LYONS\r\n           You'd be better off startin' at the\r\n           top of the hill and goin' down!\r\n           Gravity's the only friend you're\r\n           gonna have today, young lad.\r\n                          ALBERT\r\n           Walk on, Joey! Walk on! Come on,\r\n           Joey, walk on. Walk on, boy.\r\n                         \r\n          At the house, Mrs. Narracott opens an upstairs window to look\r\n          on, anxiously. Ted, standing alone by the fence, only looks\r\n          at Albert.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Walk on. Come on, walk on.\r\n                         \r\n                          TED\r\n                          (TO HIMSELF:)\r\n           It'll take the whip to move him.\r\n           21.\r\n                         \r\n          Just as Ted is saying this, Albert, as if hearing his father,\r\n          takes a breath and then abruptly produces a whip. Joey's\r\n          ears prick up. Albert, grimly determined, snaps the whip at\r\n          Joey. Joey panics and bolts. The plow spins to its side,\r\n          pulls Albert off his feet. Joey drags them all the way to\r\n          the top of the hill, right by the farmhouse.\r\n                         \r\n          Lyons, yelling, starts laughing and can't stop.\r\n                         \r\n                          LYONS\r\n           Bravo! You've reached the top of the\r\n           hill! Off you go again, boy! You'll\r\n           make even better time comin' down!!\r\n                         \r\n          He continues past Dad, laughing.\r\n                         \r\n          INTERCUT - Mrs. Narracott looks on from the house. He\r\n          glances back at her. Her face is full of angry concern for\r\n          their son.\r\n                         \r\n          Townsfolk begin arriving, climbing the hill to the lower\r\n          field.\r\n                         \r\n          Ted looks down, ashamed. Mrs. Narracott looks back at Albert,\r\n          mortified, bruised, setting the plow right again.\r\n                         \r\n          Mrs. Narracott moves away from the window, takes a seat, and\r\n          picks up her knitting.\r\n                         \r\n          Later - Albert has made no progress. Joey is moving, but\r\n          only in a useless circle.\r\n                         \r\n                          ALBERT\r\n           Good boy. Good lad. Good lad. Now\r\n           walk on. Good boy.\r\n                         \r\n          More townsfolk clamor to the fence. Andrew calls out.\r\n                          ANDREW\r\n           Albie, we're all with ya!\r\n                         \r\n          Albert tries to encourage him forward but Joey still isn't\r\n          pulling sufficiently. The plow skips uselessly over the\r\n          surface stones.\r\n                         \r\n                          LYONS\r\n           Look look look! The plow hasn't even cut\r\n           yet!\r\n                         \r\n          As Albert struggles with the plow, he sees Dad walking up the\r\n          hill behind the spectators. He doesn't even turn to his son.\r\n           22.\r\n                         \r\n          Joey strains as Albert pushes with all his might. We sense\r\n          the strain on the horse and the inappropriateness of the\r\n          task. But Joey perseveres. The plow limps along.\r\n                         \r\n                          ALBERT\r\n           Do you know - I believe we can do\r\n           it, Joey. I knew when I first saw\r\n           you that you'd be the best of us.\r\n           That's why he bought you. He knows\r\n           you've all the courage he never had.\r\n           I knew when I first saw you that\r\n           you'd be the one who'd save us.\r\n                         \r\n          The plow skips and Albert falls. Joey's legs buckle and he\r\n          goes to his knees. Albert rushes to his side.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Whoa. Whoa.\r\n          Lyons calls from the crowd as rain starts to fall.\r\n                         \r\n                          LYONS\r\n           You've got no chance, lad. He'll not\r\n           turn over half an acre. Give it up\r\n           now. You've done well. You've tried\r\n           hard. You're more of a man than your\r\n           father.\r\n                         \r\n          Albert examines the collar - he sees it is ripping into\r\n          Joey's flesh. He grabs his shirt, tears a piece off it,\r\n          tenderly folds it and puts it between Joey's shoulder and the\r\n          collar.\r\n                         \r\n                          SI EASTON\r\n           Come on now, Mr. Lyons, that's a bit\r\n           rough, isn't it?\r\n                          LYONS\r\n                          (A SHRUG:)\r\n           Well, he'll destroy that horse.\r\n                         \r\n          The crowd's beginning to disperse. One of Lyons' cronies\r\n          holds his umbrella as he returns to his car. He passes Ted.\r\n                         \r\n                          LYONS (CONT'D)\r\n           I'll be over Thursday. Give you a\r\n           day to close it up.\r\n                         \r\n          Mrs. Narracott emerges from the house and heads to the fence -\r\n          holding her knitting in the rain, ignoring the leaving\r\n          crowds. A SYMPATHETIC NEIGHBOR hands her:\r\n           23.\r\n                         \r\n                          NEIGHBOUR\r\n           Your wool.\r\n                          (THEN)\r\n           I'm sorry, Rosie.\r\n                         \r\n          Lyons passes behind her, almost speaks, but then thinks\r\n          better of it.\r\n                         \r\n          As the rain intensifies, Albert digs his toe into the wet\r\n          soil and notices how it has softened. Suddenly something\r\n          flashes through Albert's mind. He leaps into action, runs\r\n          through the rain to shout at Joey.\r\n                         \r\n                          ALBERT\r\n           Now, boy! You've got to do it, Joey.\r\n           You don't know, so I'm gonna have to\r\n           do the knowing for you when the rest\r\n           of our lives depend on this! So get\r\n           set to pull - and pull straight! And\r\n           pull hard!\r\n                         \r\n          He races back to the plow and sets himself.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Now, boy! Go!\r\n                         \r\n          Joey pulls firmly and finally the inertia is broken - the\r\n          rain has softened the earth.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Walk on, Joey! Walk on! That's it!\r\n           Good boy, Joey! Good boy!\r\n                         \r\n          Finally, the plow bites deep into the soil.\r\n                         \r\n                          ANDREW\r\n           Walk on! Walk on! Walk on! Walk\r\n           on, Joey!\r\n                         \r\n          At the fence, Mrs. Narracott looks on in amazement.\r\n                         \r\n          Albert notices a large rock in their path. Andrew sees it,\r\n          too.\r\n                         \r\n                          ANDREW (CONT'D)\r\n                          (YELLING)\r\n           Go around it!!\r\n                         \r\n                          ALBERT\r\n           Whoa, Joey! Whoa, Joey! Joey! Joey,\r\n           whoa whoa whoa! Joey, stop! You'll\r\n           break the blade -\r\n           24.\r\n                         \r\n          Albert hauls back on the reins, but Joey throws his flanks\r\n          forward, straining and lurching until the plow blade splits\r\n          the rock completely in half and now the plow moves more\r\n          easily through the wet ground.\r\n                         \r\n          The ground yields. Soon Albert and Joey are making great\r\n          progress. The wet earth slipping open beneath them.\r\n                         \r\n          Andrew is loving it, speaks in wonder.\r\n                         \r\n                          ANDREW\r\n           Will you look at you?\r\n                         \r\n          Mrs. Narracott looks very happy, a smile breaking slowly\r\n          across her face...\r\n                         \r\n          The crowd begins to return. Lyons notices and looks out from\r\n          his car - sees the plow digging through the field.\r\n          Annoyed at the progress Albert's making, he gets out of his\r\n          car and walks over to Mrs. Narracott. With great disdain he\r\n                         SAYS:\r\n                         \r\n                          LYONS\r\n           I'd not let a child of mine slip in\r\n           the mud alongside a plow blade. He\r\n           could lose a foot!\r\n                         \r\n          Mrs. Narracott brandishes her knitting needles, backing him\r\n          up.\r\n                         \r\n                          ROSIE NARRACOTT\r\n           You'll likelier lose an eye, Mr.\r\n           Lyons, if you carry on prating at me\r\n           how to manage my son! Or my plow, or\r\n           my horse, or my field, or my farm!\r\n          Dad sits nearby, watching this exchange with silent approval.\r\n          Lyons stares at her, gape-mouthed, as she turns her attention\r\n          back to Albert.\r\n                         \r\n           MRS. NARRACOTT\r\n           Come on, Albie! Push on through!\r\n                         \r\n          The rain becomes torrential. Lyons turns towards the car -\r\n          gestures, frustrated, to his driver, who runs forward with\r\n          the umbrella to shield his boss from the rain. David remains\r\n          on the running board, watching Albert plowing.\r\n                         \r\n          The plow speeds through the earth. The boy and the horse are\r\n          working as one. It is a moment of triumph.\r\n                         \r\n                          ANDREW\r\n           Get it done, Albie! Get it done!\r\n           25.\r\n                         \r\n          We pull back to see they have made only the smallest dent in\r\n          the enormous field.\r\n                         \r\n          As Lyons' car passes, Dad steps forward, takes in the scene,\r\n          and almost smiles.\r\n                         \r\n          EXT. THE LOWER FIELD. EVENING.\r\n                         \r\n          The rain has abated. Albert, soaked to the skin, sits next\r\n          to Joey. They are both covered in mud.\r\n                         \r\n          Andrew, followed by Si Easton, charges through the gate up to\r\n          Albert. They are lifting Albert up between them, laughing,\r\n          Si Easton planting a kiss on Albert's muddy cheek, Andrew\r\n          tousling his filthy hair, when Mrs. Narracott arrives with\r\n          Ted. She helps Si and Andrew lift Albert and slings her\r\n          son's arm over her shoulder, glowing with pride, crying,\r\n          overjoyed.\r\n                          ROSIE\r\n           Oh, my pair of fools. My mighty\r\n           fools.\r\n                         \r\n          As the others help Albert up, Ted tends to Joey. He looks\r\n          over to his son and, after a moment, removes his cap and\r\n          slightly bows his head.\r\n                         \r\n          The others stagger away, supporting Albert, and Ted pats the\r\n          horse and gently begins to unbuckle the harness.\r\n                         \r\n          INT. STABLES. DAY.\r\n                         \r\n          Albert washes Joey and tends the wounds and sores on his\r\n          body. Rosie is putting antiseptic on Albert's wrists and\r\n          shoulders. Joey bristles but is soothed by Albert's care.\r\n                         \r\n                          ROSIE\r\n           You're as battered and bloodied as he is.\r\n                         \r\n                          ALBERT\r\n           And where's Dad?\r\n                         \r\n                          ROSIE\r\n           Still in the bottom field.\r\n                         \r\n                          ALBERT\r\n           Stumbling about, I suppose.\r\n                         \r\n                          ROSIE\r\n           It's not the drink, Albert, that\r\n           makes him stumble -\r\n           26.\r\n                         \r\n                          ALBERT\r\n                          (ABRUPTLY)\r\n           He drinks, mum.\r\n                         \r\n                          ROSIE\r\n           Well, so might you if you'd been\r\n           where he's been, seen what he's\r\n           seen!\r\n                         \r\n                          ALBERT\r\n           Well, he don't talk to me about it.\r\n                         \r\n                          ROSIE\r\n           He don't talk about it because he\r\n           can't. There aren't words for some\r\n           things. Come here...\r\n                         \r\n          Rosie stalks over to a pile of broken equipment in a corner\r\n          of the stables. She rummages until she finds a waterstained\r\n          brown paper parcel tied with yarn. She brushes away some\r\n          mouse turds.\r\n                         \r\n                          ROSIE (CONT'D)\r\n           The mice've been at it. Sit down.\r\n                         \r\n          They sit together on a step. As she begins to untie the\r\n          yarn, a change comes over her: her irritated determination\r\n          gives way to sadness. Albert comes to her and kneels beside\r\n          her as she gently opens the paper.\r\n                         \r\n          Inside there's a red and tan pennant, knotted and fringed at\r\n          both ends.\r\n                         \r\n           MRS. NARRACOTT\r\n           Here. It's his campaign pennant. He were\r\n           Sergeant, Seventh Battalion, Imperial\r\n           Yeomanry.\r\n          Then with great care she unfolds the sash to reveal two\r\n          silver medals. The first, with the profile of Victoria, hangs\r\n          from a red, blue and orange ribbon.\r\n                         \r\n                          ROSIE\r\n           And that is the Queen's South Africa\r\n           Medal. Every man who fought in the\r\n           Boer War got one of those. But\r\n           this...\r\n                         \r\n          She holds up the other medal, hanging from a red and black\r\n          ribbon.\r\n                         \r\n                          ROSIE (CONT'D)\r\n           That's the Distinguished Conduct\r\n           Medal.\r\n           27.\r\n                         \r\n          She hands Albert the Distinguished Conduct Medal. He takes\r\n          it, astonished.\r\n                         \r\n                          ALBERT\r\n           Not dad's?\r\n                         \r\n                          ROSIE\r\n           Well it ain't mine, dear. He got\r\n           that after the fighting at\r\n           Transvaal. After he'd been hurt, and\r\n           he'd saved some other lads, and\r\n           well... I don't know what else, he\r\n           won't tell me either. But the first\r\n           day he got home he just... tossed\r\n           them out. First day he could walk,\r\n           he threw `em straight in the\r\n           dustbin, and wouldn't hear a word I\r\n           said not to.\r\n          Albert nods, looking at the medal and campaign pennant. She\r\n          takes the medal back, puts it in the sash, and begins to wrap\r\n          it again.\r\n                         \r\n                          ROSIE (CONT'D)\r\n           See, what you done today, you and\r\n           Joey, you're chuffed up now, and so\r\n           you should be, my splendid boy. It's\r\n           good to be proud when you done\r\n           something good. But what he done, in\r\n           Africa, whatever it was, he takes no\r\n           pride in it. Hard as it surely was,\r\n           and however much pain it's cost him,\r\n           he refuses to be proud of killing, I\r\n           suppose.\r\n                         \r\n          She returns the things in the footlocker, closes it.\r\n                          ALBERT\r\n                          (CONFUSED:)\r\n           I'd be proud. If I'd gone off to\r\n           war. If I'd gone and saved my\r\n           mates, and -\r\n                         \r\n                          ROSIE\r\n           Well, whether or not you think you'd\r\n           do the same thing as him... Think\r\n           how brave he is for refusing to be\r\n           proud.\r\n                         \r\n          She heads back to Albert, pennant in hand.\r\n           28.\r\n                         \r\n                          ROSIE (CONT'D)\r\n           Oh, your dad makes mistakes. And he\r\n           drinks to forget the mistakes that\r\n           he's made - but he never gave up and\r\n           he does that for us. And today, you\r\n           showed the world it's all been worth\r\n           it.\r\n                         \r\n          As she leaves, she drapes the pennant over Albert's shoulder.\r\n                         \r\n                          ROSIE (CONT'D)\r\n           You keep looking after Joey and\r\n           he'll always be looking after you.\r\n                         \r\n          Albert looks again at the pennant.\r\n                         \r\n                          ALBERT\r\n                          (SOFTLY:)\r\n           Sergeant, Seventh Battalion,\r\n           Imperial Yeomanry.\r\n           (amazed, to Joey:)\r\n           You see this, Joey? It's been\r\n           through an entire war.\r\n                         \r\n          Albert holds the pennant in wonder.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           I'm not stealing it. I'll give it\r\n           back to him, someday.\r\n                         \r\n          EXT. FIELD. DAY.\r\n                         \r\n          Early morning. Dad hobbling across the furrows, alone,\r\n          planting the field by hand.\r\n                         \r\n          EXT. NARRACOTT FARM. DEVON COUNTRY MONTAGE.\r\n          Albert and Joey are now in a meadow. They trot past the field\r\n          he plowed, now packed with a strong and sturdy crop, which\r\n          Ted tends to.\r\n                         \r\n          The sun is breaking through and Joey starts to run across the\r\n          field and up a small incline. As both Joey and Albert gain\r\n          confidence they pick up speed. Albert pushes Joey on, they\r\n          are going faster and faster, Albert yells with the\r\n          exhilaration of it all. Joey races flat out across the\r\n          countryside. Albert hanging on for dear life.\r\n                         \r\n          Albert and Joey pull up beside a sleek red car. It's Lyons'\r\n          car, being driven by David Lyons, every inch the expensively-\r\n          tailored rural gentry.\r\n           29.\r\n                         \r\n                          DAVID\r\n           Um, I'm the only boy that drives in\r\n           the village. No one else drives but\r\n           me.\r\n                         \r\n                          YOUNG WOMAN\r\n           Oh, yeah?\r\n                         \r\n                          DAVID\r\n           That's right and this is my dad's\r\n           car. You're lucky that you're in\r\n           it. I'm not normally allowed to\r\n           drive it `cause it's so -\r\n                         \r\n          Albert urges Joey to go faster, till they're neck and neck\r\n          beside the car, racing it. David Lyons looks to see Albert\r\n          and Joey running alongside his car. He feigns disinterest.\r\n          Albert glances at David, but he's much more interested in the\r\n          very pretty young woman seated next to David, her hands\r\n          trying to control her hair, flying in the wind. Forgetting\r\n          himself momentarily, Albert stares at her, dazzled. The woman\r\n          turns to David:\r\n                         \r\n                          YOUNG WOMAN\r\n           Is he a friend of yours?\r\n                         \r\n          She smiles at Albert, encouraging him. David Lyons, annoyed,\r\n          pushes the accelerator down, and the car edges ahead of Joey.\r\n                         \r\n          But not for long. The sound of the acceleration and Albert's\r\n          eagerness to impress the young woman make Joey go faster, and\r\n          again he moves out ahead of the car. The young woman grins\r\n          at Albert.\r\n                         \r\n          Up ahead Albert sees that the wall alongside of which he's\r\n          been racing turns the corner, presenting him and Joey with an\r\n          obstacle. Albert encourages Joey to go faster.\r\n                         \r\n                          ALBERT\r\n           Come on, boy, let's show her how to\r\n           fly!\r\n                         \r\n          They head right for the wall, but at the very last moment,\r\n          Joey balks and comes to a dead standstill, sending Albert\r\n          sailing over the wall.\r\n                         \r\n          Back in the car, the girl gasps and covers her mouth,\r\n          concerned. David says nothing, but allows himself a small\r\n          smile.\r\n                         \r\n          On the other side of the wall, Albert stands a bit battered,\r\n          but unfazed.\r\n           30.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Well...you're clearly not gonna be a\r\n           jumper.\r\n                         \r\n          Thunder starts to rumble ominously in the background.\r\n                         \r\n          EXT. NARRACOTT FARM. NIGHT.\r\n                         \r\n          Albert and Joey return, driving sheep before them. Angry\r\n          storm clouds stretch to the horizon.\r\n                         \r\n          EXT. NARRACOTT FARM. NIGHT.\r\n                         \r\n          As Albert leads Joey to the stable, lighting blasts across an\r\n          angry sky. The rain is falling in torrents.\r\n                         \r\n          INT. FARMHOUSE. NIGHT.\r\n          Another crack of thunder - and a piece of wood in the roof\r\n          gives way - water gushes in - Dad rushes to support the roof\r\n          as the wind forces a window open.\r\n                         \r\n          At that moment, the door suddenly swings open with the\r\n          violence of the storm, smashing against the wall - Dad and\r\n          Rosie turn - and there is Harold the goose, who scuttles in\r\n          without his usual arrogance and hides himself in a corner.\r\n                         \r\n           MRS. NARRACOTT\r\n           Shoo, Harold. Shoo, shoo, shoo!\r\n                         \r\n          The thunder cracks again and...\r\n                         \r\n          EXT. LOWER FIELD. DAY.\r\n                         \r\n          Albert and Dad walk across the field. Mrs. Narracott digs\r\n          through the mess. The entire crop is flat - ruined by the\r\n          storms. The ground squelches beneath their feet.\r\n          The whole field is a write off.\r\n                         \r\n                          ALBERT\r\n           We can try planting something else, or we\r\n           could hire ourselves out to Uncle Bob.\r\n                         \r\n          Dad doesn't answer. He shakes his head and limps away.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           How else we gonna pay Mr. Lyons'\r\n           rent?\r\n                         \r\n          Ted doesn't turn around.\r\n           31.\r\n                         \r\n          INT. KITCHEN. EVENING.\r\n                         \r\n          Mrs. Narracott makes some coffee. Ted sits alone on a chair.\r\n                         \r\n           MRS. NARRACOTT\r\n           What we gonna do?\r\n                         \r\n                          DAD\r\n           I used to believe that God gave each man his\r\n           fair portion of bad luck. I don't feel that\r\n           any more. I've had more than my share.\r\n                          (PAUSE)\r\n           You'll stop loving me, Rose. And I won't\r\n           blame you when you do.\r\n                         \r\n                          ROSE\r\n           Well, I might hate you more - but I'll never\r\n           love you less.\r\n          Then somewhere in the distance, an unfamiliar sound...\r\n                         \r\n          EXT. LANE LEADING TO THE VILLAGE. EVENING.\r\n                         \r\n          A motorbike rumbles along the lane at huge speed creating a\r\n          cloud of dust as it goes. The noise of the motorbike is\r\n          drawing attention from all over the valley. It can be heard\r\n          fields away and everyone is drawn to this completely unheard\r\n          of sound.\r\n                         \r\n          EXT. THE VILLAGE. EVENING.\r\n                         \r\n          The motorbike whizzes through the village. Heads turn in\r\n          astonishment.\r\n                         \r\n                          MOTORBIKE RIDER\r\n           It's war!\r\n          The bike comes to a stop in the market place. The rider takes\r\n          off his goggles.\r\n                         \r\n          Men of the village start to flock around the machine, with\r\n          great curiosity.\r\n                         \r\n           MOTORBIKE RIDER (CONT'D)\r\n           We are at War with Germany. You hear?\r\n           England is at war with Germany.\r\n                         \r\n          Shock and amazement. The rider takes off his goggles:\r\n                         \r\n           MOTORBIKE RIDER (CONT'D)\r\n           They're going to ring the bells at six\r\n           o'clock - and then never ring them again\r\n           until the war is over.\r\n           32.\r\n                         \r\n          Everyone across England knows that their lives are about to\r\n          change.\r\n                         \r\n          EXT. FARM YARD. DAY.\r\n                         \r\n          Dawn rises over the farm.\r\n                         \r\n          EXT. FARM YARD. DAWN.\r\n                         \r\n          Albert races to the stables, excited with the campaign\r\n          pennant.\r\n                         \r\n          INT. STABLES. THE SAME.\r\n                         \r\n          As Albert enters the stables, he calls out:\r\n                         \r\n                          ALBERT\r\n           Look smart, Joey lad, it's the Tavistock\r\n           Fair!\r\n                         \r\n          Albert opens the doors and stops dead. He looks at the empty\r\n          stables.\r\n                         \r\n          EXT./ INT. KITCHEN / YARD. DAY.\r\n                         \r\n          Albert runs out.\r\n                         \r\n          He rushes into the kitchen. His mother stares out the window.\r\n          She has been crying.\r\n                         \r\n                          ALBERT\r\n           What has he done with him?\r\n                         \r\n          She says nothing, but her face gives everything away. Albert\r\n          in a panic turns and runs out into the lane. Mrs. Narracott\r\n          tears up again.\r\n          EXT. SQUARE OF A MARKET TOWN. THE SAME.\r\n                         \r\n          The market square is full of military men. The Union Jack is\r\n          flying up the flagpole. A group of girls has gathered to\r\n          check out the army boys. Eager young men crowd a table\r\n          staffed by recruiting officers:\r\n                         \r\n                          RECRUITING OFFICER\r\n           Last name first. First name, middle\r\n           name, last.\r\n                         \r\n          CAPTAIN NICHOLLS is in the square inspecting Joey,\r\n          knowledgably. He is a handsome, attractive, modest, upper\r\n          class man. Dad stands beside him. He checks Joey's teeth, his\r\n          feet and finally, looks him straight in the eye.\r\n           33.\r\n                         \r\n                          DAD\r\n           Take my word for it - finest horse\r\n           in the parish. Goes like a racer,\r\n           strong, decent, very fine.\r\n                         \r\n          Captain Nicholls has immediately connected with Joey and puts\r\n          him at his ease. SAM PERKINS, a tough sergeant, is physically\r\n          inspecting Joey.\r\n                         \r\n                          SAM PERKINS\r\n           No curbs, no splints, good feet and\r\n           teeth. He's as sound as a bell,\r\n           sir.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           And how much are you charging, sir - for\r\n           this strong, decent, and very fine animal?!\r\n                          DAD\r\n           Forty.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I'll give you twenty and not a penny more.\r\n                         \r\n                          DAD\r\n           Twenty is no good to me, Captain. Thirty\r\n           five and he's yours.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I don't even know how he rides.\r\n                         \r\n                          DAD\r\n           Oh, he rides... Splendidly. You'll\r\n           be astonished. I promise you that.\r\n           (his heart's in his\r\n           throat, fighting back\r\n                          GRIEF)\r\n           Finest horse in all of Devon. Finest\r\n           horse I ever seen.\r\n                         \r\n          EXT. SQUARE OF A MARKET TOWN. THE SAME.\r\n                         \r\n          Albert bursts into the square just in time to see Nicholls\r\n          and Dad shake hands. Their business concluded.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Thank you.\r\n                         \r\n          Albert races towards Joey. Ted grabs him. Albert fights to\r\n          get free. He looks at his father in anger and betrayal.\r\n                         \r\n                          ALBERT\r\n           You can't! You can't, he's mine! I trained\r\n           him!\r\n           34.\r\n                         \r\n                          DAD\r\n           Albert.\r\n                         \r\n          Albert is hysterical.\r\n                         \r\n                          ALBERT\r\n           You can't have him. He's my horse, sir.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I'm afraid it's too late, lad. I've just\r\n           paid thirty guineas for him.\r\n                         \r\n                          ALBERT\r\n                          (TO TED:)\r\n           Please, I'll get you money. I will,\r\n           I'll get you money. I'll...I'll work\r\n           for it! I'll work for it.\r\n                          (TO NICHOLLS:)\r\n           He won't obey anyone else. He won't\r\n           be any good in the war, neither.\r\n           He...he shies at every sound!\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I'm sorry.\r\n                         \r\n          Albert snaps to attention.\r\n                         \r\n                         \r\n                          ALBERT\r\n           Well, if Joey's going, I'm going,\r\n           too. I'm volunteering.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I see. What's your name, lad?\r\n                         \r\n                          ALBERT\r\n           Albert, sir.\r\n                          CAPTAIN NICHOLLS\r\n           And how old are you, Albert?\r\n                         \r\n                          ALBERT\r\n           Nineteen, sir.\r\n                         \r\n                          CAPTAIN NICHOLS\r\n           Is that the truth?\r\n                         \r\n                          ALBERT\r\n           No sir. But, but I look nineteen and\r\n           I'm bigger than most nineteen-year-\r\n           olds, sir! And I'm strong, sir! And\r\n           I...I'm not afraid of anything.\r\n                         \r\n                         NICHOLLS INTERJECTS:\r\n           35.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I don't doubt your qualifications,\r\n           Albert, but the law is very clear\r\n           about the proper age for soldiering,\r\n           and your father's done what he had\r\n           to do. You know that. Thirty guineas\r\n           isn't nearly enough to purchase a\r\n           horse as fine as your Joey, I know\r\n           that. But it's all I've got. Will\r\n           you lease him to me, Albert, to be\r\n           my own mount?\r\n           (he removes his cap,\r\n                          EARNEST)\r\n           I promise you, man to man, that I'll\r\n           look after him as closely as you've\r\n           done, I'll respect him and all the\r\n           care that you've taken with him. And\r\n           if I can - I'll return him to your\r\n           care.\r\n                         \r\n          Albert looks at him. Although Nicholls speaks with authority\r\n          he has a kindness which Albert recognizes.\r\n                         \r\n           CAPTAIN NICHOLLS (CONT'D)\r\n           Now say goodbye.\r\n                         \r\n          Albert kisses Joey.\r\n                         \r\n                          ALBERT\r\n           It's all right, boy...\r\n                         \r\n          But at that moment, Sam Perkins pulls Joey away:\r\n                         \r\n                          SAM PERKINS\r\n           All right, turn it in, eh? That's enough.\r\n           He's a horse, not a dog. Now, on your way.\r\n                          (TO JOEY)\r\n           Come on.\r\n                         \r\n          Nicholls walks away into the crowd. The Sergeant pulls Joey,\r\n          but Joey does not want to be separated from Albert. His\r\n          reaction is implacable, reminiscent to the separation from\r\n          his mother. Perkins leads Joey away. They disappear into the\r\n          crowd and Rosie is suddenly there. Ted senses her silent\r\n          judgment.\r\n                         \r\n                          DAD\r\n           Do you want to lose the farm, Rose?\r\n                         \r\n                          ROSIE\r\n           It's the way you did it.\r\n                         \r\n                          DAD\r\n           But we're at war.\r\n           36.\r\n                         \r\n                          ROSIE\r\n           Aren't we just.\r\n                         \r\n          She looks at Albert. Implacable. Forever.\r\n                         \r\n          EXT. VILLAGE SQUARE. THE SAME.\r\n                         \r\n          The recruits march through town under pennants and the\r\n          strains of a familiar song(\"The Jolly Plowboy\") - it is a\r\n          song they all know, which means a lot to them - full of soul -\r\n          a song of harvest or a Celtic hymn, something relating\r\n          specifically to the lives they have led together. Everyone of\r\n          every age - everyone in the village knows this song - it is\r\n          theirs.\r\n                         \r\n          Nicholls passes in his car and we see those they are leaving\r\n          behind - cheering - a whole generation of young men is\r\n          marching off to war. One girlfriend rushes up to kiss her\r\n          leaving boyfriend.\r\n                         \r\n          Albert watches Joey, then remembers the campaign pennant\r\n          dangling from his pocket. He runs up to Joey -\r\n                         \r\n                          ALBERT\r\n           Joey...\r\n                         \r\n          - and tucks the pennant into Joey's halter.\r\n                         \r\n                          SAM PERKINS\r\n           Here now, I've told you - sling your\r\n           hook!\r\n                         \r\n          But Nicholls intervenes from his car.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Let him be, Perkins.\r\n                          ALBERT\r\n           This isn't the end. This isn't the\r\n           end, my brother... I, Albert\r\n           Narracott, solemnly swear we will be\r\n           together again. Wherever you are, I\r\n           will find you. And I will bring you\r\n           home!\r\n                         \r\n          And then they are past him, leaving him behind. As Perkins\r\n          leads Joey across a stone bridge, Albert watches from the\r\n          bank of the stream.\r\n                         \r\n          Joey balks one last time -\r\n           37.\r\n                         \r\n                          SAM PERKINS\r\n           Whoa. Steady, steady. Steady now,\r\n           come on. Walk on! Walk on now,\r\n           come on!\r\n                         \r\n          - then Perkins leads him away, leaving Albert behind.\r\n                         \r\n          The very last recruits leave the village - leaving the debris\r\n          of this army's visit strewn on the square. Like the debris\r\n          of a party you are already beginning to regret.\r\n                         \r\n          INT. ARMY STABLES. THE SAME.\r\n                         \r\n          Joey is handed off to a groom. Joey is amazed by the scale\r\n          of the building. Each horse has a large stall and is being\r\n          tended to assiduously. Joey looks around at the hundreds of\r\n          men and horses around him and panics.\r\n                          GROOM\r\n           Whoa whoa whoa. Easy easy...\r\n                         \r\n          He bucks, throwing the groom to the ground, and gallops away.\r\n          But Perkins cuts him off, grabs his halter, and jerks him\r\n          back to attention.\r\n                         \r\n                          SAM PERKINS\r\n           Whoa whoa whoa, Joey! Stop muckin'\r\n           about, you hear? Yer in the army\r\n           now, son.\r\n                         \r\n          He pushes him into his stall, next to Major Stewart's horse,\r\n          a magnificent black stallion, TOPTHORN.\r\n                         \r\n           SAM PERKINS (CONT'D)\r\n           Good boy, good boy. Steady\r\n           steady... Easy. Relax. Easy easy,\r\n           back up.\r\n          Joey rears up in his stall.\r\n                         \r\n           SAM PERKINS (CONT'D)\r\n           Joey - meet Topthorn. Topthorn - this is\r\n           Joey. Sort out who's in charge between the\r\n           two of you, you hear? If you want to fight,\r\n           you get it over with - `cause once we're\r\n           over there, you're gonna need everything\r\n           you've got for Fritz!\r\n                         \r\n          This is the first time that Joey has had to deal with another\r\n          horse since his mother - the beginning of one of the most\r\n          important relationships in his life.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Gently, Perkins. I don't want to sour him.\r\n           38.\r\n                         \r\n          Nicholls passes his gloves and crop to his bat boy who is\r\n          there to assist him.\r\n                         \r\n                          SAM PERKINS\r\n           There'll be nothing gentle about the war,\r\n           sir. And there'll be nothing gentle about\r\n           this one either!\r\n                         \r\n           SAM PERKINS (CONT'D)\r\n           I understand that, Sergeant, but I\r\n           want him fit and shining. He's my\r\n           horse.\r\n                         \r\n           SAM PERKINS (CONT'D)\r\n           Sir.\r\n                         \r\n          Nicholls is joined by his friend LIEUTENANT CHARLIE WAVERLY.\r\n          He is sweet and friendly - upper class but completely benign.\r\n                          CHARLIE WAVERLY\r\n           Scares the living daylights out of me.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Who?\r\n                         \r\n                          CHARLIE WAVERLY\r\n           Perkins. Glad he's on our side.\r\n                         \r\n          They're both joined by a tall, confident officer, MAJOR JAMIE\r\n          STEWART. He sizes up Joey.\r\n                         \r\n                          MAJOR STEWART\r\n           Not bad. Not bad at all. Still not\r\n           a patch on my Topthorn.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I wouldn't be so sure. I think he's got\r\n           potential. He's certainly got the bit\r\n           between his teeth.\r\n                         \r\n                          CHARLIE WAVERLY\r\n           I actually think my Blenheim is faster than\r\n           the pair of them.\r\n                         \r\n                          MAJOR STEWART\r\n           Clear off!\r\n                         \r\n          He suddenly turns from the joking into the efficient senior\r\n          officer he is.\r\n           39.\r\n                         \r\n           MAJOR STEWART (CONT'D)\r\n           All right, gentlemen, listen here.\r\n           Everything tells us the same story, from\r\n           Waterloo to Omdurman, from Pickett's Charge\r\n           to the Battle of Mars La Tours - the first\r\n           attack can and should be the decisive one.\r\n           Perkins...\r\n                         \r\n                          SAM PERKINS\r\n           Yes, sir!\r\n                         \r\n                          MAJOR STEWART\r\n           No excuses, no mistakes - every\r\n           horse groomed and fit for\r\n           presentation! I want a full practice\r\n           charge tomorrow.\r\n                         \r\n                          SAM PERKINS\r\n           Sir.\r\n                         \r\n          They leave.\r\n                         \r\n          EXT. SALISBURY PLAIN. DAY.\r\n                         \r\n          The whole regiment is gathered. Everybody is in their\r\n          ceremonial uniform. It all has the feeling of the Changing of\r\n          the Guard rather than anything related to a real battle. The\r\n          day is hot, the plains are quiet and beautiful, the gathering\r\n          is huge, there is a real sense of pride and anticipation.\r\n                         \r\n          Captain Nicholls, resplendent in full uniform rides Joey out\r\n          over the vast expanse of the plain. Both Nicholls and Joey\r\n          are dressed up like something from the last century, out of\r\n          the Boer War, even the Charge of the Light Brigade. Nicholls\r\n          is proud and confident. They gather before hundreds of men\r\n          and horses all lined up to be inspected. Charlie joins them,\r\n          looking pretty good on Blenheim.\r\n          Finally, Nicholls and Charlie reach Stewart and Topthorn\r\n          waiting in position.\r\n                         \r\n                          MAJOR STEWART\r\n           Thought you two had bottled out.\r\n                         \r\n                          CHARLIE WAVERLY\r\n           As if.\r\n                         \r\n          Nicholls looks at his friend tolerantly.\r\n                         \r\n                          MAJOR STEWART\r\n           All right, then, let's see what you\r\n           two jokers are made of, shall we?\r\n           40.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           This is what quiet confidence looks like.\r\n                         \r\n                          CHARLIE WAVERLY\r\n           I'll wait for you two at the Duke of York.\r\n                         \r\n          Nicholls and Stewart and Charlie prepare themselves for the\r\n          charge. Joey and Topthorn size up to one another.\r\n                         \r\n                          MAJOR STEWART\r\n           Over to you, Captain Nicholls.\r\n                         \r\n          Topthorn bristles at Joey. Everyone is highly charged. The\r\n          competition between Stewart and Nicholls seems to have been\r\n          absorbed between the horses. Topthorn and Joey square up for\r\n          the practice charge like two athletes before a race.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Draw...swords!\r\n                         \r\n          Nicholls raises his sword. It glints in the summer air. It\r\n          seems to hang there forever. Every man follows suit.\r\n                         \r\n          Topthorn and Joey glance at each other, ready to charge.\r\n                         \r\n           CAPTAIN NICHOLLS (CONT'D)\r\n           Give...point!\r\n                         \r\n          Every sword is pointed directly ahead at arm's length.\r\n                         \r\n           CAPTAIN NICHOLLS (CONT'D)\r\n           Charge!!!!\r\n                         \r\n          A roar goes up from the men and a deafening pounding of\r\n          hooves breaks the silence. The huge line of horses start\r\n          running straight ahead of them. Joey and Topthorn run off at\r\n          top speed. Dust and earth rise up behind them.\r\n          Bugles, the deafening thunder of hooves. It is exhilarating.\r\n          We see the scale of the operation, we enjoy the speed and the\r\n          splendor of the mass of men and horses. The soldiers shout in\r\n          glee and excitement. Each man pushes his horse to out-run\r\n          those around him, Nicholls and Stewart seem locked in mortal\r\n          combat.\r\n                         \r\n          Nicholls smiles at Stewart, confidently.\r\n                         \r\n          Topthorn starts to pull away, ahead of all the other horses\r\n          in the line. Nicholls pushes Joey on. Topthorn seems too\r\n          strong, Joey will never catch them. Nicholls is determined\r\n          not to be beaten.\r\n           41.\r\n                         \r\n           CAPTAIN NICHOLLS (CONT'D)\r\n           Come on, Joey. I know you've got\r\n           it. Come on, boy! Come on!\r\n                         \r\n          He pushes Joey on. Joey digs in and finds hidden strength and\r\n          speed. He starts to catch up with Topthorn and draws along\r\n          side. Nicholls and Stewart exchange tense looks.\r\n                         \r\n           CAPTAIN NICHOLLS (CONT'D)\r\n           Come on, boy!\r\n                         \r\n          Stewart is amazed and pushes Topthorn harder.\r\n                         \r\n          Now both riders are going at their top speed. They are neck\r\n          and neck - they fight for every inch of advantage, every\r\n          fibre of their being invested in the race. Nicholls pushes\r\n          Joey on and Joey pulls away. Joey inches forward till he is\r\n          almost a length ahead of Topthorn. The effort is enormous.\r\n          Nicholls looks back at Stewart, very happy. Stewart's\r\n          frustration shows. He knows he is beaten.\r\n                         \r\n          Then suddenly they race over the line. Nicholls spears a ring\r\n          decorated with a blue ribbon and pulls Joey to a halt. They\r\n          have crossed the enemy line. Nicholls is ecstatic. Topthorn\r\n          comes to Joey's side.\r\n                         \r\n                          MAJOR STEWART\r\n           Whoa. Whoa.\r\n                         \r\n          Nicholls laughs, grinning.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Nice of you to turn up.\r\n                         \r\n          The horses are nose to nose, snorting, we sense the heat, the\r\n          exertion. Topthorn and Joey are brought together by the\r\n          effort. We sense Topthorn's newly minted respect for Joey.\r\n          And Joey is no soft touch - he slightly holds his head up in\r\n          victory, letting Topthorn know that he knows he won.\r\n                         \r\n          The other horses come charging in. There is a real sense of\r\n          achievement and congratulation amongst the regiment.\r\n                         \r\n                          MAJOR STEWART\r\n           He's got speed...I'll give him that. But\r\n           has he got stamina?\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           He has everything.\r\n                         \r\n          The two men enjoy the moment of rivalry and the exhilaration\r\n          of it all. The two horses, face to face rub against each\r\n          other for the first time. A bond has been formed...\r\n           42.\r\n                         \r\n          INT. OFFICERS' STUDY. DAY.\r\n                         \r\n          Stewart enters. A phonograph plays \"Roses of Picardy.\" The\r\n          walls are decorated with etchings of famous battles, and a\r\n          large map of Western Europe that depicts how the English\r\n          troops are crossing the channel to confront the Germans near\r\n          Belgium. Nicholls is writing a letter - though actually at\r\n          this moment, he is making a little pencil drawing of Joey to\r\n          enclose with it.\r\n                         \r\n                          MAJOR STEWART\r\n           What are you up to?\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I'm writing a letter.\r\n                         \r\n                          MAJOR STEWART\r\n           With a picture in it?\r\n                          CAPTAIN NICHOLLS\r\n           It's to the boy who owned Joey. I want to\r\n           show him how wonderful he's looking.\r\n                         \r\n                          MAJOR STEWART\r\n           Before we take him away across the Channel\r\n           to face a million Germans guns.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Yes. Before that...\r\n                         \r\n                          MAJOR STEWART\r\n           4 a.m. start tomorrow - travelling with the\r\n           Dragoon Guards and the Royals. Transport\r\n           detachment - they'll need to be at the docks\r\n           at 5 am. Check all kit. Battle orders: no\r\n           polishing - buttons, helmet buckles, stirrup\r\n           irons - let `em all go dull. I want nothing\r\n           to flash in the sun and give us away.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Of course.\r\n                         \r\n          As Stewart leaves, he passes Charlie. He casually\r\n          acknowledges him.\r\n                         \r\n                          MAJOR STEWART\r\n           Charlie...\r\n                         \r\n                          CHARLIE WAVERLY\r\n           Jamie.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Charlie.\r\n           43.\r\n                         \r\n          Charlie checks his new cap in the mirror.\r\n                         \r\n                          CHARLIE WAVERLY\r\n           What do you think of the cap?\r\n                         \r\n          He shows the bright red lining to Nicholls.\r\n                         \r\n           CHARLIE WAVERLY (CONT'D)\r\n           Silk lining. I quite like it.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           I'm not sure it's going to make a lot of\r\n           difference to the Germans.\r\n                         \r\n                          CHARLIE WAVERLY\r\n           Oh, I don't know about that. Think about it -\r\n           you're a Boche, just working out which of\r\n           two chaps to shoot - and you thought - \"Good\r\n           Lord - one of them really is wearing a very\r\n           stylish cap indeed!\" You might shoot the\r\n           other one instead.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Or, alternatively, think - \"I fancy that\r\n           cap\" and kill you first of all.\r\n                         \r\n          Pause. Charlie removes the cap.\r\n                         \r\n                          CHARLIE WAVERLY\r\n           Hadn't thought of that.\r\n                         \r\n          Nicholls returns to his sketch.\r\n                         \r\n          EXT. DIRT ROAD. FRANCE.\r\n                         \r\n          Three hundred horses and their charges in a slow march in the\r\n          middle of the most pristine French countryside.\r\n          TITLE: FRANCE - 1914, QUIÉVRECHAIN\r\n                         \r\n          EXT. ROAD. DAY.\r\n                         \r\n          Nicholls and Stewart and Charlie ride on a smooth road past a\r\n          series of posts screened with cloth. They're silhouetted\r\n          against the setting sun.\r\n                         \r\n          EXT. ROAD. DAY.\r\n                         \r\n          The regiment are tense and nervous as they gingerly make\r\n          their way along the country road. Topthorn and Joey sense\r\n          the grim change of atmosphere.\r\n           44.\r\n                         \r\n          EXT. WOODLAND ABOVE A PLAIN. DAY.\r\n                         \r\n          They are in woodland above a plain stretching for miles. A\r\n          small table has been taken out for Stewart and his officers.\r\n          SERGEANT MAJOR SINGH - a turbaned Indian with a magnificent\r\n          moustache dressed in ceremonial garb - explains the lines of\r\n          battle on a map.\r\n                         \r\n           SGT. MAJOR SINGH\r\n           That is our target - the German 11th\r\n           Division - at the moment bivouacked three\r\n           miles to the east of the Menin Road. We have\r\n           been watching them and they have pitched\r\n           tents for the night and lit cooking fires.\r\n           Knock them out - and we could slide in\r\n           behind the German lines and come at them\r\n           from the South at Geluveld.\r\n                          MAJOR STEWART\r\n           Excellent.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Numbers?\r\n                         \r\n           SGT. MAJOR SINGH\r\n           About six hundred. Infantry.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Twice our size...\r\n                         \r\n                          MAJOR STEWART\r\n           In regiments of horse and men, the\r\n           advantage is ours.\r\n                         \r\n           SGT. MAJOR SINGH\r\n           And we have surprise on our side.\r\n           But the sooner we move, the better -\r\n           we have no assurance they'll still\r\n           be there tomorrow morning.\r\n                         \r\n          Our officers just have a second to take in the news. The day\r\n          has suddenly arrived. The day they have worked for, for so\r\n          long.\r\n                         \r\n                          MAJOR STEWART\r\n           Right. Good. So - today it is.\r\n           Charlie - tell the men.\r\n                         \r\n                          CHARLIE WAVERLY\r\n           Salisbury formation?\r\n           45.\r\n                         \r\n                          MAJOR STEWART\r\n           Salisbury formation. We'll charge\r\n           through them and secure the ground\r\n           behind.\r\n                         \r\n           SGT. MAJOR SINGH\r\n           The grass to the left is taller than\r\n           we are - it's perfect cover.\r\n                         \r\n                          MAJOR STEWART\r\n           Excellent work, Sergeant Major.\r\n           Time spent on reconnaissance is\r\n           rarely wasted.\r\n                         \r\n          As Stewart departs:\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Thank you, Singh.\r\n                          (CALLING AFTER)\r\n           Jamie!\r\n                         \r\n          Nicholls catches up to Stewart, concerned.\r\n                         \r\n           CAPTAIN NICHOLLS (CONT'D)\r\n           They have no idea we're coming.\r\n                         \r\n                          MAJOR STEWART\r\n           Not having scruples, are you, Jim?\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           No. I understand the surprise is\r\n           everything. But if it must be done,\r\n           let's do it quickly.\r\n                         \r\n          Nicholls notices Charlie nervously attending his horse.\r\n                         \r\n           CAPTAIN NICHOLLS (CONT'D)\r\n           Are you alright, Charlie?\r\n                         \r\n                          CHARLIE WAVERLY\r\n           Never been better. Literally, never\r\n           better.\r\n                         \r\n          We worry for him - he is afraid.\r\n                         \r\n          Stewart rides through the lines astride Topthorn.\r\n                         \r\n                          MAJOR STEWART\r\n           Prepare to mount! Mount!\r\n                         \r\n          As the cry is echoed throughout the regiment, Nicholls\r\n          accepts Joey from an attending soldier.\r\n           46.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Thank you, Standley.\r\n                          (TO JOEY)\r\n           Hey, Joey. My bonny boy. You're\r\n           all right, aren't you, Joey? Hey?\r\n                         \r\n          Nicholls takes the red campaign pennant from his pocket and\r\n          threads it through Joey's reins.\r\n                         \r\n          Minutes later - Stewart addresses the men.\r\n                         \r\n                          MAJOR STEWART\r\n           Gentleman. It is an honour to ride\r\n           beside you. Make the Kaiser rue the\r\n           day he dared to cross swords with\r\n           us. Let every man make himself, his\r\n           King, his country, and his fallen\r\n           comrades proud! Be brave. Fear\r\n           God. Honor the King!\r\n                         \r\n                          TROOPERS\r\n           (in unison shout)\r\n           Fear God. Honor the King!\r\n                         \r\n                         \r\n          EXT. OVER GROWN CORN FIELD. DAY.\r\n                         \r\n          Cut to an elegant field of tall grass, waving in the gentle\r\n          breeze. Then suddenly three hundred men seem to rise out of\r\n          it. They are in fact our soldiers, mounting their horses -\r\n          but the horses are invisible in the height of the grass.\r\n                         \r\n          Stewart gives a signal. We see the intense anticipation on\r\n          his face. He takes out his sabre.\r\n                         \r\n                          MAJOR STEWART\r\n           Draw swords!\r\n          The men draw their sabres in silence. The birds chirping,\r\n          oblivious.\r\n                         \r\n          Then Nicholls just turns to his two friends and almost\r\n          whispers...\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           Good luck, my friends.\r\n                         \r\n          He pats Joey's side. And then...\r\n                         \r\n                          MAJOR STEWART\r\n           Forward, to walk! Walk...march!\r\n                         \r\n          The regiment begins moving through the field.\r\n           47.\r\n                         \r\n           MAJOR STEWART (CONT'D)\r\n           Forward to canter! Canter...march!\r\n                         \r\n          The men start to float over the grass - swept along by their\r\n          invisible horses, until...\r\n                         \r\n          Suddenly they emerge from the tall grass - the immense power\r\n          of the galloping horses - silence explodes into a violent\r\n          crashing of hooves. The noise is immense, swords are flying\r\n          in the air. Hundreds of horses racing towards the German\r\n          encampment.\r\n                         \r\n          On the German side, TWO SOLDIERS wake to the sound of\r\n          hoofbeats. They pull their tent flap aside to find the\r\n          invincible charge coming towards them. The Germans are\r\n          totally unprepared. We see them scramble back towards tents,\r\n          rush towards their guns - one man pulling up his trousers\r\n          rushes for cover. One German drops some dirty dishes into a\r\n          wash pot, screaming:\r\n                         \r\n                          GERMAN SOLDIER\r\n           Kavallerie!\r\n                         \r\n          Topthorn and Joey race each other like a rerun of their\r\n          practice on Salisbury Plain. The swords and uniforms glint in\r\n          the sun, the German troops look terrified - some run in\r\n          panic, others prepare to stand their ground.\r\n                         \r\n                          CAPTAIN NICHOLLS\r\n           CHARGE!\r\n                         \r\n          The British head in for the kill, the men scream battle cries\r\n          with sheer exhilaration.\r\n                         \r\n          We see the horses at close quarters running with all their\r\n          might. Nicholls and Stewart yell as they approach the enemy.\r\n          The surprise attack is a huge success. The first row of\r\n          unprepared Germans are falling...\r\n                         \r\n          The regiment sweeps through the encampment, cutting down\r\n          soldiers and driving the rest in a panicked retreat to the\r\n          tree line.\r\n                         \r\n          But then we see, in the shadows of the forest behind the\r\n                         CAMP --\r\n                         \r\n          A machine gun. No, a line of machine guns - at least twenty\r\n          guns, sandbagged apart - the logical, new, modern defence of\r\n          a garrison. In an instant, the fleeing Germans have manned\r\n          the guns. All now firing.\r\n           48.\r\n                         \r\n          The noise of the blast of bullets drowns out everything else.\r\n          A score of men and horses are suddenly on the ground, it\r\n          happens almost so quickly Joey and Topthorn don't realize\r\n          anything's wrong and find themselves racing straight towards\r\n          the guns. The bullets keep coming, now suddenly half of the\r\n          regiment are on the ground.\r\n                         \r\n          Horse after horse races past the guns into the woods...all of\r\n          them now riderless.\r\n                         \r\n          Nicholls watches helplessly as one of the barrels swings\r\n          towards him. His face goes slack as he realizes he is about\r\n          to die.\r\n                         \r\n          A moment later, Joey runs on - we pan up to see he is running\r\n          on riderless - he has not realized that Nicholls is gone. The\r\n          bullets whizz around his head, but he still runs directly\r\n          ahead. We would always know him by the red pennant Nicholls\r\n          tied on his saddle.\r\n                         \r\n          Joey is now running through the German lines. No one bothers\r\n          to attack him as the German's concentrate their efforts on\r\n          the cavalry behind him. The line of machine guns fire as one,\r\n          decimating the horses and their riders.\r\n                         \r\n          Joey leaps and dances nimbly through the German ranks, but\r\n          suddenly rears up in the confusion, surrounded by Germans.\r\n                         \r\n          Near him, surviving English officers are hauled from their\r\n          horses.\r\n                         \r\n          Stewart wheels back around on Topthorn, sabre in hand. But\r\n          he, too, is quickly surrounded by several Germans with their\r\n          rifles trained on him. A furious GERMAN OFFICER storms over,\r\n          speaks perfect English:\r\n                         \r\n                          GERMAN OFFICER\r\n                          (OUTRAGED)\r\n           What? Did you think that a garrison\r\n           on open ground would go undefended?\r\n           Look at yourself! Who do you think\r\n           you are?!!\r\n                         \r\n          Stewart looks at the Officer - at the guns that surround him -\r\n          and throws down his sabre, stabbing it into the ground. The\r\n          Germans take Stewart from Topthorn.\r\n                         \r\n          Around them, the fields are littered with dead soldiers and\r\n          horses.\r\n           49.\r\n                         \r\n          EXT. BATTLEFIELD. DAY.\r\n                         \r\n          Topthorn appears disoriented and frightened. Suddenly, he\r\n          rears up and bolts from his new German handler, galloping\r\n          over to Joey. The horses briefly nuzzle, but both rear up\r\n          again as they are separated and led past a young German\r\n          soldier, GUNTHER.\r\n                         \r\n          He zeroes in on them, the finest horses.\r\n                         \r\n          A slightly more JUNIOR OFFICER approaches the outraged senior\r\n          officer.\r\n                         \r\n           JUNIOR GERMAN OFFICER.\r\n           What do we do with the horses?\r\n                         \r\n                          GERMAN OFFICER\r\n           If they're injured, shoot them.\r\n           JUNIOR GERMAN OFFICER\r\n           And the others, sir?\r\n                         \r\n                          GERMAN OFFICER\r\n           The others you round up and take to\r\n           base camp - they will pull guns.\r\n                         \r\n                          THIRD OFFICER\r\n           You'll never get fancy horses like\r\n           these to pull guns.\r\n                         \r\n                          GERMAN OFFICER\r\n           Then shoot them also.\r\n                         \r\n          Gunther, the young private, now standing behind them,\r\n          interjects.\r\n                         \r\n                          GUNTHER\r\n           Sir - perhaps we could use some of\r\n           them with the ambulances - to get\r\n           the injured men off the field.\r\n                         \r\n                          GERMAN OFFICER\r\n           Will they take the harness?\r\n                         \r\n                          GUNTHER\r\n           I'd like to try, sir.\r\n                         \r\n          The officers move away - that's enough talk about horses...\r\n                         \r\n          CUT ON - Gunther is now with Joey and Topthorn. Near a wooden\r\n          ambulance - which is like a giant wagon to carry humans. He\r\n          is with MICHAEL, a very young soldier, his brother - possibly\r\n          as young as 14.\r\n           50.\r\n                         \r\n          Gunther lifts a heavy pulling harness - and tries to get\r\n          Topthorn into it.\r\n                         \r\n                          MICHAEL\r\n           It won't work - they're cavalry\r\n                         \r\n                          GUNTHER\r\n           Let's try.\r\n                         \r\n                          MICHAEL\r\n           You won't get the harness on.\r\n                         \r\n                          GUNTHER\r\n           Come on, Michael.\r\n                         \r\n          Topthorn balks violently.\r\n                         \r\n                          GUNTHER (CONT'D)\r\n           Whoa, whoa. Easy, now, easy now,\r\n           Englishman... Whoa, whoa, whoa.\r\n           Easy now, easy.\r\n                         \r\n                          MICHAEL\r\n           Gunther! It's hopeless - we can't\r\n           help them.\r\n                         \r\n          And suddenly Joey moves up and presents himself, with his\r\n          strange self assurance and self sacrifice. And instinct for\r\n          survival.\r\n                         \r\n          He sniffs the harness and places his head through it, which\r\n          helps to calm Topthorn enough that Gunther can slip the\r\n          collar onto the big black horse. Gunther turns to Joey,\r\n          impressed.\r\n                         \r\n                          GUNTHER\r\n           Well, well, look at you. Whoever\r\n           taught you this has just saved your\r\n           life.\r\n                         \r\n          Gunther spots the red ribbon in Joey's saddle, removes it,\r\n          folds it, and places it in his pocket.\r\n                         \r\n          Later - Gunther and Michael are returning from the\r\n          battlefield with Topthorn and Joey, pulling an ambulance with\r\n          British and German wounded. Amongst the wounded, we see a\r\n          hand gripping a battered, silk lined hat. It is Waverly,\r\n          wounded but alive.\r\n                         \r\n          EXT. NARRACOTT'S FARM. DEVON. DAY.\r\n                         \r\n          Si Easton lets himself in through the gate. Ted pulls up\r\n          turnips from their three acre crop.\r\n           51.\r\n                         \r\n          Rosie, just across a furrow, is also engaged in the harvest.\r\n          It's hard work. Si holds a parcel.\r\n                         \r\n                          SI EASTON\r\n           Hello the farm!\r\n                         \r\n                          ROSIE\r\n           (looking up, wiping her\r\n                          BROW)\r\n           Hello, Si Easton!\r\n                         \r\n          Albert passes carrying a crate laden with turnips, but pulls\r\n          up short when he hears:\r\n                         \r\n                          SI EASTON\r\n           I was at the post office and while I\r\n           was there, Mrs. Allen said a parcel\r\n           had come for Albert, from the, from\r\n           the, from over there - and I thought\r\n           I could go up that way in the\r\n           morning. And - here it is.\r\n                         \r\n                          ALBERT\r\n           Well, who'd be sending me a parcel\r\n           over there?\r\n                         \r\n                          DAD\r\n           Well, open it and see.\r\n                         \r\n          Albert opens the parcel and pulls out a leather sketchbook...\r\n                         \r\n                          ALBERT\r\n           It's a sketchbook...\r\n           (gasp of realization)\r\n           That's Captain Nicholls' sketchbook!\r\n           See that? That's a picture of Joey!\r\n                          ROSIE\r\n           It's a picture of Joey. Well, I\r\n           never!\r\n                         \r\n                          ALBERT\r\n                          (EXCITED)\r\n           And there's a letter...\r\n                         \r\n                          ROSIE\r\n           Well, go on then, go on.\r\n                         \r\n                          ALBERT\r\n           All right.\r\n                          (READING)\r\n           \"Dear Albert Narracott.\r\n                          (MORE)\r\n           52.\r\n                          ALBERT (CONT'D)\r\n           Captain Nicholls, who died...Captain\r\n           Nicholls, who died in action today\r\n           left you this. Yours, Sergeant Sam\r\n           Perkins.\r\n                         \r\n          Si Easton drops his head guiltily. Rosie catches this.\r\n                         \r\n                          ROSIE\r\n           You weren't to know it was bad news.\r\n                         \r\n                          ALBERT\r\n           He was riding Joey when he died.\r\n                         \r\n                          ROSIE\r\n           You don't know that he was riding\r\n           him...\r\n                         \r\n                          ALBERT\r\n           \"In action,\" it says.\r\n                         \r\n          Everybody falls silent. Albert goes to the fence and looks\r\n          down at the sketches of Joey. Rosie looks at her son, her\r\n          heart breaking for him. Dad returns to the harvest without a\r\n          word. Albert looks off to the horizon and - over there.\r\n                         \r\n          EXT. GERMAN BASE CAMP. EVENING.\r\n                         \r\n          CLOSE -- A step stool.\r\n                         \r\n          Michael mounts the stool next to Joey and Topthorn, removes\r\n          their harnesses and carries them across the road.\r\n                         \r\n          Michael slips and falls into the mud. Gunther dashes over\r\n          and pulls him up just before a military convoy pulls into the\r\n          camp, running over the tack.\r\n                         \r\n          The BASE CAMP OFFICER appears on a motorbike.\r\n           BASE CAMP OFFICER.\r\n           Gentlemen! We move forward to the\r\n           frontline tonight. Full marching\r\n           orders. Get moving!\r\n                         \r\n          As the soldiers hop to their orders, the officer turns to -\r\n                         \r\n           BASE CAMP OFFICER\r\n           Schroeder! Schroeder!\r\n                         \r\n          Both Michael and Gunther turn to him. But it's Gunther the\r\n          Officer wants to talk to.\r\n                         \r\n           BASE CAMP OFFICER (CONT'D)\r\n           No, not you - you. Come.\r\n           53.\r\n                         \r\n          Gunther picks up the dropped harnesses as he approaches.\r\n                         \r\n           BASE CAMP OFFICER (CONT'D)\r\n           I'm keeping you here. You are best\r\n           with the horses and we need to move\r\n           the camp quickly if the enemy\r\n           continue to push through from the\r\n           west.\r\n                         \r\n                          GUNTHER\r\n           They're pushing through?\r\n                         \r\n           BASE CAMP OFFICER\r\n           I'm told. We will move later when we\r\n           find where the horses are needed\r\n           most.\r\n                         \r\n                          GUNTHER\r\n           Yes, sir. Perhaps I can keep my\r\n           brother here with me, he's also very\r\n           good with horses.\r\n                         \r\n           BASE CAMP OFFICER\r\n           Oh no no. Not necessary.\r\n                          (TO MICHAEL)\r\n           Get moving. We leave tonight.\r\n                         \r\n          He walks away. Gunther is stricken by the news, but Michael\r\n          is excited. As he leads Joey past his brother:\r\n                         \r\n                          MICHAEL\r\n           It's all right, Gunther.\r\n                         \r\n          Gunther can't really speak. Michael is just a boy.\r\n                         \r\n          EXT. GERMAN CAMP / VARIOUS. EVENING.\r\n          Soldiers are lifting up their equipment - gathering - moving\r\n          in the same direction.\r\n                         \r\n          In a quiet tent, a few last soldiers are packing. And there\r\n          are Gunther and Michael, packing together.\r\n                         \r\n                          GUNTHER\r\n           You are not going. I'll tell them\r\n           you are only fourteen, that you're a\r\n           boy.\r\n                         \r\n                          MICHAEL\r\n           Father signed me in. He knew my age\r\n           -and so do they.\r\n           54.\r\n                         \r\n          The process of packing is their way of coping with the shock.\r\n          Gunther is folding one of Michael's shirts. Michael takes it\r\n          back...\r\n                         \r\n                          MICHAEL (CONT'D)\r\n           Mother obviously never taught you\r\n           how to fold a shirt.\r\n                         \r\n                          GUNTHER\r\n           Of course she did. I just wasn't\r\n           listening. But you need to listen\r\n           now! I promised her, I made her a\r\n           solemn promise, that you would be\r\n           safe with me. With me, Michael!!\r\n                         \r\n          He leans close to Michael, talking in almost a whisper.\r\n                         \r\n                          GUNTHER (CONT'D)\r\n           They'll never make a head count.\r\n           There are too many of us. You can\r\n           stay here - slip underneath the bed -\r\n           until they move out.\r\n                         \r\n                          MICHAEL\r\n           Then what?\r\n                         \r\n          Michael carries on with his packing.\r\n                         \r\n                          MICHAEL (CONT'D)\r\n           Gunther, it will be fine. And when\r\n           all the machines break down and they\r\n           call up the horses, I'll see you at\r\n           the front. We'll be together again.\r\n                         \r\n          And now the case is packed. Gunther heads to the tent\r\n          opening.\r\n                          MICHAEL (CONT'D)\r\n           Gunther...\r\n                         \r\n          Looking round, the tent is now empty. The moment to leave has\r\n          come. Gunther pulls the red pennant from his pocket and\r\n          follows Michael out of the tent to where the soldiers are\r\n          lining up in the road.\r\n                         \r\n                          GUNTHER\r\n           I'm giving this to you. For luck.\r\n                         \r\n          Gunther ties the pennant to the back of Michael's pack as he\r\n          forms up.\r\n                         \r\n                          GUNTHER (CONT'D)\r\n           To keep you safe.\r\n           55.\r\n                         \r\n          Michael smiles at him and begins to march. Marching towards\r\n          Ypres, on the Western Front.\r\n                         \r\n           BASE CAMP OFFICER\r\n           Im schnellschritt! Marsch...links!\r\n           Zwei, drei, vier!\r\n                         \r\n          We settle on young Michael - in line - he passes Gunther. He\r\n          remains eager. But it is goodbye. These soldiers moving into\r\n          the darkness and towards death. Gunther looks on - tears in\r\n          his eyes. The two horses are uneasy - sensing tension.\r\n                         \r\n          A few minutes later - Gunther grabs a saddle and throws it\r\n          onto Joey's back.\r\n                         \r\n          Back to the soldiers.\r\n                         \r\n          Suddenly we see the galloping legs of two horses. They whip\r\n          past the back of the line of marching soldiers. It's clear\r\n          what is happening - Gunther is on Topthorn - and has hold of\r\n          Joey, on a loose rope, galloping beside him.\r\n                         \r\n          Gunther, galloping along the line of soldiers, spots what he\r\n          is looking for, a red pennant unfurled and flapping in the\r\n          wind, tied onto Michael's pack. Gunther speeds toward him.\r\n          This was his plan all along. And in an instant he is beside\r\n          him and without Michael ever realizing, he suddenly finds his\r\n          arms and legs akimbo, as he is yanked out of the line and\r\n          dragged along the ground, desperately close to Joey's\r\n          pounding hooves.\r\n                         \r\n          Michael looks at the soldiers beside him - he looks at the\r\n          skyline of violence ahead...but before he can decide, he\r\n          feels his brother's arm - pulling him upwards. And now, the\r\n          two of them are fully on Topthorn.\r\n                         \r\n          They leave a jumble of soldiers in their wake as the officers\r\n          try to restore order.\r\n                         \r\n                          GERMAN OFFICER\r\n           Get back in line! Line!\r\n                         \r\n          EXT. WOODS. LATER.\r\n                         \r\n          Michael now rides Joey, following Gunther on Topthorn. The\r\n          brothers look at each other - can't believe what they have\r\n          done - Michael is following his brother, swept along, doesn't\r\n          know if it is right.\r\n                         \r\n          And Michael and Joey and Gunther and Topthorn charge on to\r\n          freedom.\r\n                         \r\n          They spot a lonely house and burst past a line with some\r\n          drying clothes.\r\n           56.\r\n                         \r\n          As they ride, they grab civilian shirts and jackets and\r\n          trousers, the clothes pegs pinging off and falling to the\r\n          ground.\r\n                         \r\n          And on they ride - though all too soon day starts to break in\r\n          the far distance. They see a very dilapidated windmill. They\r\n          aim for it as the sun begins to seriously break over the\r\n          horizon.\r\n                         \r\n          INT. / EXT. WINDMILL. DAWN.\r\n                         \r\n          They reach the windmill. It feels very unused. The machinery\r\n          of the windmill creaks in the dawn. The brothers untether the\r\n          horses, careful now that it is light outside.\r\n                         \r\n                          MICHAEL\r\n           I'm hungry. Did you bring food?\r\n                          GUNTHER\r\n           I'm sorry.\r\n                         \r\n          Michael fingers the pennant on Joey's reins. Then...\r\n                         \r\n                          MICHAEL\r\n           Will Father be ashamed?\r\n                         \r\n                          GUNTHER\r\n           He will pretend to be. Maybe at\r\n           first he will be. But in the end, he\r\n           will be glad.\r\n                         \r\n                          MICHAEL\r\n           And us? What about us?\r\n                         \r\n          Gunther looks at him - but doesn't reply. As Michael removes\r\n                         JOEY'S SADDLE:\r\n                          MICHAEL (CONT'D)\r\n           I was ready to go. I was proud to\r\n           go.\r\n           (after a beat, in a very\r\n                          SMALL VOICE)\r\n           I wanted to go.\r\n                         \r\n          Later - They sit in silence, waiting for sleep.\r\n                         \r\n                          MICHAEL (CONT'D)\r\n           The food in Italy is good.\r\n                         \r\n                          GUNTHER\r\n           Yes.\r\n                         \r\n                          MICHAEL\r\n           What about the women?\r\n           57.\r\n                         \r\n                          GUNTHER\r\n           Not as good as the food.\r\n                         \r\n                          MICHAEL\r\n           Because...they've eaten too much of\r\n           the food?\r\n                         \r\n                          GUNTHER\r\n           You are too young for war. And\r\n           you're too young for women!\r\n                         \r\n          Gunther laughingly pushes him over.\r\n                         \r\n                          MICHAEL\r\n           I don't feel so young. Not anymore.\r\n                         \r\n                          MICHAEL (CONT'D)\r\n           Michael.\r\n                          MICHAEL (CONT'D)\r\n           What?\r\n                         \r\n                          GUNTHER\r\n           Go to sleep - we have a big night of\r\n           riding ahead. Goodnight, Michael.\r\n                         \r\n          He jokingly strokes Michael's cheek. Michael swats him away,\r\n          but as he settles in the hay:\r\n                         \r\n                          MICHAEL\r\n           Night night, Gunther.\r\n                         \r\n          EXT. WINDMILL. DUSK.\r\n                         \r\n          Gunther and Michael sleep. Suddenly something awakens Joey.\r\n          He stirs and then rises. Hear the sound of engines and see\r\n          lights through the slats sweeping across Joey's face.\r\n          Michael and Gunther are stirring in their sleep as we hear a\r\n          car and several motorcycles approaching. Head-lamps filter\r\n          through the cracks in the windmill walls stabbing the\r\n          brothers awake.\r\n                         \r\n                          GERMAN SOLDIER\r\n           Hei! In die windmühle!\r\n                         \r\n          The boys spring up, speaking in terrified whispers.\r\n                         \r\n                          GUNTHER\r\n           Go, go, go...\r\n                         \r\n                          MICHAEL\r\n           Okay.\r\n           58.\r\n                         \r\n          They race up a nearby ladder, but Michael stumbles against a\r\n          table, upsetting some gear. It clatters loudly. They cower\r\n          as they hear boots tromping up the steps outside. Then the\r\n          windmill doors are thrown open, pinning them in the bright\r\n          headlights of the vehicles.\r\n                         \r\n          As they're marched out, we see what they see: A German car -\r\n          two motorcycles. Six Germans, including the officer who was\r\n          in charge of them.\r\n                         \r\n           BASE CAMP OFFICER\r\n           Schroeder.\r\n                         \r\n                          GUNTHER\r\n           Yes, sir.\r\n                         \r\n           BASE CAMP OFFICER\r\n           A mistake?\r\n          He's offering an excuse, but -\r\n                         \r\n                          GUNTHER\r\n           A promise.\r\n                         \r\n          The officer accepts this grimly, nods.\r\n                         \r\n           BASE CAMP OFFICER\r\n           Ja...\r\n                         \r\n          As the boys are taken away, he lights a cigarette.\r\n                         \r\n          INT. WINDMILL. NIGHT.\r\n                         \r\n          Through the turning arms of the windmill, we glimpse the\r\n          double execution. Four rifles fire - flashes of the soldiers\r\n          shooting - the bodies on the ground.\r\n          EXT. OUTSIDE THE WINDMILL. DAY.\r\n                         \r\n          Complete stillness in the empty countryside.\r\n                         \r\n          INT. THE WINDMILL. DAY.\r\n                         \r\n          There are Joey and Topthorn, still waiting.\r\n                         \r\n          And then suddenly - the doors of the windmill creak. The two\r\n          horses turn, immensely aware of the break in the silence. The\r\n          door opens a little - and we see, reflected in Joey's eye, a\r\n          very delicate, beautiful, thirteen-year-old country girl\r\n          (EMILIE).\r\n                         \r\n          She stares at the horses. They stare straight back at her.\r\n          And she walks straight out again, closing the big door behind\r\n          her. Joey and Topthorn settle for a moment.\r\n           59.\r\n                         \r\n          Time transition - Joey and Topthorn are in a slightly\r\n          different place - and the door opens again. It is the same\r\n          little girl - but this time she comes in carrying two buckets\r\n          full of water.\r\n                         \r\n          INT. / EXT. FARMHOUSE / FARM. DAY.\r\n                         \r\n          A small humble farmhouse - and round it, small fields,\r\n          planted with different fruit crops. We see an old man\r\n          (GRANDFATHER), burdened with a basket of berries heading back\r\n          towards the farmhouse.\r\n                         \r\n          A SOUND CAUSES HIM TO LOOK OUT ACROSS THE FARM -- far in the\r\n          distance the STORM OF WAR is in the sky.\r\n                         \r\n          He enters the kitchen - which is rough, but full of the\r\n          paraphernalia of jam-making - jars, sieves, pectin, sugar.\r\n          Emilie is at the sink, washing berries.\r\n                         \r\n                          EMILIE\r\n           Grandpére.\r\n                         \r\n          He heads towards the side-board, dumps the two bags and lifts\r\n          the first handful of fruits on to the counter.\r\n                         \r\n          She empties her clean berries into a bowl. Notes the\r\n          explosions outside.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           It's closer today.\r\n                         \r\n                          GRANDFATHER\r\n           The wind plays tricks with the noise\r\n           - it's moving away from us.\r\n                         \r\n                          EMILIE\r\n           I can hear it, Grandpére, and there\r\n           is no wind. You shouldn't lie to me.\r\n                         \r\n                          GRANDFATHER\r\n           Here. There is no wind here. But\r\n           over there - a wind so strong it\r\n           will lift you off the ground...\r\n                         \r\n                          EMILIE\r\n           You lie about everything. You say\r\n           you aren't worried but it's clear\r\n           you are. I know the war is\r\n           approaching but you say, \"Oh, it's\r\n           just a trick of the wind.\"\r\n                         \r\n          He retrieves a bottle of medicine from the mantle.\r\n           60.\r\n                         \r\n                          GRANDFATHER\r\n                          (SMILING)\r\n           Did I say that?\r\n                         \r\n                          EMILIE\r\n           You started lying when Mama and Papa\r\n           went away.\r\n                         \r\n          She pours a load of sugar into a bowl with the fruit.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           They're dead. But you won't say so.\r\n           Do you think I'll die if you tell me\r\n           the truth?\r\n                         \r\n                          GRANDFATHER\r\n           The truth is -\r\n          He feeds her a spoonful of the medicine.\r\n                         \r\n                          GRANDFATHER (CONT'D)\r\n           - you should speak to your elders\r\n           with respect.\r\n                         \r\n          She sticks her wet finger in the sugar and sucks it to help\r\n          with the taste of the medicine.\r\n                         \r\n                          EMILIE\r\n           If you tell me the truth about the\r\n           war, I will tell you the truth about\r\n           the big horses I've been keeping in\r\n           the windmill.\r\n                         \r\n                          GRANDFATHER\r\n           (standing, putting his\r\n           hands on his hips)\r\n           Now - who is the one telling lies!\r\n          EXT. COURTYARD. SAME.\r\n                         \r\n          Grandfather looks stunned as he paces in front of JOEY AND\r\n          TOPTHORN - who stand in the small courtyard outside the\r\n          house.\r\n                         \r\n                          GRANDFATHER\r\n           In the windmill?\r\n                         \r\n                          EMILIE\r\n           Yes. They were standing in the\r\n           windmill waiting for Don Quixote.\r\n           This is François (Joey) and this is\r\n           Claude (Topthorn).\r\n           61.\r\n                         \r\n                          GRANDFATHER\r\n           Yeah.\r\n                         \r\n                          EMILIE\r\n           I named them after two boys who\r\n           broke my heart last Summer.\r\n                         \r\n                          GRANDFATHER\r\n           They must belong to someone. Horses\r\n           like this don't just appear from a\r\n           fairy-tale.\r\n                         \r\n                          EMILIE\r\n           Yes - I know, Grandpére. They are\r\n           not unicorns - so I will be fair and\r\n           wait -- one day.\r\n                         \r\n                          GRANDFATHER\r\n           Emilie... Emilie...\r\n                         \r\n                          EMILIE\r\n           And if no one comes to get them by\r\n           night-time, then they belong to me.\r\n                         \r\n                          GRANDFATHER\r\n           Emilie. Look at me. You cannot\r\n           ride.\r\n                         \r\n                          EMILIE\r\n           Mother used to tell me how my bones\r\n           would give way with the slightest\r\n           bump or fall.\r\n                         \r\n                          GRANDFATHER\r\n           Yes. That's right. So it is\r\n           settled?\r\n          She kisses his cheek --\r\n                         \r\n                          GRANDFATHER (CONT'D)\r\n           Good girl.\r\n                         \r\n          -- but then calmly leads the horses back to the windmill.\r\n                         \r\n                          EMILIE\r\n           It will only be settled when I\r\n           decide which one to ride first.\r\n                         \r\n                          GRANDFATHER\r\n           But it's - Over my dead body!\r\n                         \r\n                          EMILIE\r\n           At least I won't have long to wait.\r\n           62.\r\n                         \r\n          That is the end of the conversation as far as she is\r\n          concerned.\r\n                         \r\n          EXT. FARM HOUSE. DAY.\r\n                         \r\n          Emilie is with the horses in the little stable at the end of\r\n          the courtyard - a bit away from the farm house - she is\r\n          feeding them out of a bucket - not very nice gruel.... WE\r\n          SEE THAT SHE IS HESITANT WITH THEM - that she has spent no\r\n          time around horses.\r\n                         \r\n                          EMILIE\r\n                          (TO JOEY)\r\n           I was in love with a boy called\r\n           François - who had your lovely eyes.\r\n                          (TO CLAUDE)\r\n           Unfortunately he was in love with a\r\n           girl called Marie, who had your\r\n           teeth. She fell for a boy called\r\n           Claude - who broke my heart. And who\r\n           I intend to marry one day.\r\n                         \r\n          INT./EXT. FIELD IN FRONT OF FARMHOUSE. DAY.\r\n                         \r\n          Grandfather watches Emilie from inside the house as he makes\r\n          jam.\r\n                         \r\n           EMILIE (O.S.)\r\n           Eyes on me. No talking.\r\n                         \r\n          Outside, Emilie has fashioned two jumps. The big one for Joey\r\n          and a little demonstration obstacle for herself. She leads\r\n          Joey to a starting point about 30 yards in front of some\r\n          crates supporting a stick about four feet off the ground.\r\n          The red pennant hangs from the stick. Joey stands quietly as\r\n          Emilie hobbles to the big jump, making a jumping gesture with\r\n          her hand.\r\n                          EMILIE (CONT'D)\r\n           Today we learn to jump. Did you know\r\n           the French cleared one meter eighty-\r\n           five at the Paris Olympics to win\r\n           the gold medal? Today we will beat\r\n           that record.\r\n                         \r\n          Grandfather chuckles. Emilie indicates the larger barrier.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           This is your jump. When I call\r\n           you....be very brave and leap over\r\n           it.\r\n                         \r\n          She claps, but Joey doesn't move.\r\n           63.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           Leap over it! Watch me.\r\n                         \r\n          She turns to her demonstration jump and easily steps over her\r\n          six-inch high barrier.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           And now it's your --\r\n                         \r\n          She turns to find Joey already stepping over her mini-jump,\r\n          stopping in front of her. He's only interested in the apple\r\n          in her hand. She takes a bite herself.\r\n                         \r\n                          JUMP TO:\r\n                         \r\n          Emilie returns Joey to the starting line and runs back behind\r\n          the big jump. From behind her back she produces three big\r\n          carrots dripping soil. Joey's ears perk and he takes off\r\n          quickly but at the last moment veers right and passes between\r\n          the two jumps.\r\n                         \r\n          INT. FARMHOUSE. DAY.\r\n                         \r\n          Grandfather is watching through the window as he prepares his\r\n          strawberry jams. He laughs and goes back to work.\r\n                         \r\n          BACK TO FIELD\r\n                         \r\n          Aware she's being watched, she slings the carrots over her\r\n          shoulder, frustrated.\r\n                         \r\n                          JUMP TO:\r\n                         \r\n          EXT. BARN. LATER.\r\n                         \r\n          Joey slowly emerges from the barn with Emilie out in front\r\n          leading him with one hand. In the other hand, she carries a\r\n          small wooden step ladder.\r\n                         \r\n                          EMILIE\r\n           He doesn't think we can do it. But\r\n           we will show him, won't we?\r\n                         \r\n          Emilie unfolds the ladder beside Joey and shakily starts\r\n          climbing to the top of it.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           (Her voice shaking)\r\n           No need to be afraid.\r\n           (Emilie looking down at\r\n           how far off the ground\r\n                          SHE IS)\r\n           You are...very tall.\r\n           64.\r\n                         \r\n          Before she can swing her leg over Joey's back -\r\n                         \r\n                          GRANDFATHER\r\n           You'll kill yourself.\r\n                         \r\n          Emilie turns, and there, blocking the hurdle, now standing\r\n          hands on hips, is Grandfather.\r\n                         \r\n                          EMILIE\r\n           Only if you get in my way to make me\r\n           fall.\r\n                         \r\n                          GRANDFATHER\r\n           Oh please, come off the ladd--\r\n                         \r\n          A SOUND from far down the road. Grandfather looks. Emilie\r\n          turns to look too. Two trucks led by a German motorcycle are\r\n          approaching the farm.\r\n                          GRANDFATHER (CONT'D)\r\n           Find somewhere to hide them. And do\r\n           it quickly!!!\r\n                         \r\n          As Emilie races off with the horses, Grandfather pushes over\r\n          the jumps and jams the pennant into his pocket.\r\n                         \r\n          The bikes arrive first, just missing Emilie as she leads the\r\n          horses behind the house.\r\n                         \r\n          The trucks arrive, pull round - one of the soldiers in the\r\n          front jumps out and opens the back.\r\n                         \r\n                          GERMAN OFFICER\r\n           Halt! Und aussteigen!\r\n                         \r\n          The people - 20 of them, all seeming to be poor French\r\n          peasants, mainly women, move out of the truck. As they walk\r\n          past, they avoid the eye of the Grandfather, who approaches\r\n          the soldiers.\r\n                         \r\n                          GRANDFATHER\r\n           My name is Bonnard - this is my\r\n           land. Why are you here?\r\n                         \r\n                          SOLDIERS\r\n           Food for the soldiers at the front.\r\n           Everyone must give their share.\r\n                         \r\n          And suddenly we see what is going to happen - the 20 peasants\r\n          spread out and move through the field - with either bags, or\r\n          using the aprons they wear - picking all the fruits - at just\r\n          the moment all the work has brought forth fruit - and the new\r\n          year's crop is ready.\r\n           65.\r\n                         \r\n          Raspberries, black-currants, gooseberries. In a few minutes,\r\n          everything he lives by will be gone.\r\n                         \r\n          Watching from his car and calmly smoking a cigar is BRANDT,\r\n          the officer in charge of the unit.\r\n                         \r\n          Cut to the fields - the aprons and baskets are getting full.\r\n          They move through the rows of fruit like a plague of locusts.\r\n                         \r\n          Back to the Grandfather - and out of the house comes Emilie.\r\n                         \r\n                          GRANDFATHER\r\n           They are taking everything. Where\r\n           are the horses?\r\n                         \r\n          Pause.\r\n                         \r\n                          EMILIE\r\n           What horses?\r\n                         \r\n          The sound of jars breaking draws Grandfather and Emilie into\r\n          the kitchen, where the Germans continue to raid their other\r\n          supplies.\r\n                         \r\n          One German picks up waterbath canner -- inspecting it.\r\n                         \r\n                          GERMAN SOLDIER\r\n           What is it?\r\n                         \r\n                          GRANDFATHER\r\n           Leave it if you don't know what it's\r\n           for.\r\n                         \r\n                          GERMAN SOLDIER\r\n           A pot is a pot. We'll find some use\r\n           for it. Sir, where's the livestock?\r\n          Brandt sits quietly, casually using his finger to scoop jam\r\n          from an open jar.\r\n                         \r\n                          GRANDFATHER\r\n           I make jam. We have no animals.\r\n                         \r\n                          GERMAN SOLDIER\r\n           But there's fresh hay in your barn.\r\n                         \r\n          Emilie enters, overhearing.\r\n                         \r\n                          EMILIE\r\n           We use it to replace the mattress\r\n           stuffings.\r\n                         \r\n                          GERMAN SOLDIER\r\n           Her grandfather?\r\n           66.\r\n                         \r\n                          GRANDFATHER\r\n           Yes.\r\n                         \r\n                          GERMAN SOLDIER\r\n           Where are her parents?\r\n                         \r\n                          EMILIE\r\n                          (BREAKING IN)\r\n           They're dead. They died.\r\n                         \r\n          The German nods and is about to take his leave, putting the\r\n          pot back where he found it, when a clumping noise from\r\n          somewhere in the house begins.\r\n                         \r\n                          GERMAN SOLDIER\r\n           What is that?\r\n                         \r\n                          GRANDFATHER\r\n           The wind. It plays tricks in the\r\n           attic.\r\n                         \r\n          Brandt licks his finger and tests:\r\n                         \r\n                          BRANDT\r\n           There is no wind.\r\n                         \r\n                          GRANDFATHER\r\n           An old house creaks.\r\n                          (TO EMILIE)\r\n           Go - close the shutters.\r\n                         \r\n          Emilie runs out of the room. The soldier picks up the\r\n          medicine bottle.\r\n                         \r\n                          GERMAN SOLDIER\r\n           She's sickly, no?\r\n                          GRANDFATHER\r\n           If you or any of your friends harm\r\n           her, as old as I am, I will kill\r\n           you.\r\n                         \r\n          The soldier looks shocked and then begins to laugh. He slaps\r\n          the medicine flask into Grandfather's chest.\r\n                         \r\n                          GERMAN SOLDIER\r\n           You know, I was going to give you\r\n           back your pot. But now I'm going to\r\n           keep it. For soup.\r\n                         \r\n          He slings the huge pot he had put back up on his shoulder and\r\n          leaves the house with the other soldiers.\r\n           67.\r\n                         \r\n                          BRANDT\r\n           We will be back in the new season.\r\n                         \r\n          As the Germans leave, we cut to the upstairs bedroom where\r\n          Emilie lies curled up on the bed - and there, standing on\r\n          either side of the bed - are the two horses. They look huge\r\n          in the tiny room.\r\n                         \r\n          INT. KITCHEN. LATE THAT NIGHT.\r\n                         \r\n          The sound of shells exploding. A huge bombardment somewhere\r\n          in the deep distance. But much closer than before. The\r\n          distant, malicious giants of war growl.\r\n                         \r\n          It is like a lightning storm on the horizon.\r\n                         \r\n          The kitchen has been emptied. The war has finally come to\r\n          them - and we can see it on Emilie's face.\r\n                          EMILIE\r\n           Tell me what happened to them. To my\r\n           mother and father.\r\n                         \r\n          Grandfather doesn't respond.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           You said you would tell me how they\r\n           died. On my birthday. And tomorrow's\r\n           my birthday! They died fighting,\r\n           didn't they? But when the soldiers\r\n                          COME -\r\n                         \r\n          She finally turns to face him.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           - you do nothing. You are a coward,\r\n           aren't you?\r\n                          GRANDFATHER\r\n           Yes. Yes. It was your parents who\r\n           were brave. I make jams.\r\n                         \r\n                          EMILIE\r\n           And you've never done a brave thing\r\n           in your life?\r\n                         \r\n          He eases himself into a chair and shrugs.\r\n                         \r\n                          GRANDFATHER\r\n           Maybe there are different ways to be\r\n           brave. Did you know the French have\r\n           the best carrier pigeons? And this\r\n           could be the difference in the war -\r\n           our messages getting through.\r\n           68.\r\n                         \r\n                          EMILIE\r\n           I don't want to hear about the\r\n           birds.\r\n                         \r\n                          GRANDFATHER\r\n           They are released at the front and\r\n           told to go home - this is all they\r\n           know. But to get there they must\r\n           fly over a war. Can you imagine\r\n           such a thing? Here you are flying\r\n           over so much pain and terror - and\r\n           you know you can never look down.\r\n           You have to look forward or you'll\r\n           never get home. I ask you - what\r\n           could be braver than that?\r\n                         \r\n          Emilie sheds a single tear.\r\n          INT. THE BARN. DAWN.\r\n                         \r\n          Grandfather enters the barn, strokes Topthorn's nose as he\r\n          passes. He sweeps aside a rug from the barn floor, to reveal\r\n          a trap door. Then, he opens it.\r\n                         \r\n          Now from out of the trap door, he lifts a big ungainly\r\n          object, covered in another rug.\r\n                         \r\n          INT. FARMHOUSE KITCHEN. MORNING.\r\n                         \r\n          Emilie comes down the stairs as Grandfather waits proudly by\r\n          the stove. She stops when she sees the OBJECT COVERED BY THE\r\n          RUG.\r\n                         \r\n                          EMILIE\r\n           What is that?\r\n                         \r\n                          GRANDFATHER\r\n           A present.\r\n                         \r\n          Emilie moves toward the object that is covered.\r\n                         \r\n                          EMILIE\r\n           I hope you have not bought me a\r\n           disgusting dress that I then have to\r\n           wear like last year.\r\n                         \r\n                          GRANDFATHER\r\n                          (LAUGHING)\r\n           It was disgusting?\r\n                         \r\n                          EMILIE\r\n           Yes. I looked like an ugly nun.\r\n           69.\r\n                         \r\n          Then she stops herself and turns to Grandfather with a\r\n          parental rebuke.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           Give me your hand.\r\n           (she takes it in hers)\r\n           Grandpére, we have no money. When\r\n           the war is over, then you can buy me\r\n           jewels and carriages.\r\n                         \r\n          The grandfather smiles and gives Emily a hug.\r\n                         \r\n                          GRANDFATHER\r\n           Anything you say, my sweet one.\r\n           Anything-you-say! You are, of\r\n           course, the boss. It's just an old\r\n           thing I found - don't worry yourself\r\n           - leave it, I'll put it back.\r\n          He leaves the room. Now Emilie is alone and she can't help it\r\n          when she brings her eyes back to the object covered by the\r\n          rug. She looks back over her shoulder to make sure she's not\r\n          being watched and then lifts one corner of the rug. Her face\r\n          explodes with a gorgeous smile. She pulls off the rug that\r\n          is covering the big thing and...it is a gorgeous old saddle.\r\n          She runs her hand along the saddle -- can hardly believe it.\r\n                         \r\n          INT. A HILL. JUST BEYOND THE FARMHOUSE. NEAR THE WINDMILL.\r\n          DAY.\r\n                         \r\n          Grandfather helps to swing Emilie up and into the saddle.\r\n          All at once, the Grandfather's charity evaporates.\r\n                         \r\n                          GRANDFATHER\r\n           It was your mother's. I hid it, so\r\n           as not to encourage you. Emilie, I\r\n           want you to ride very slowly, very\r\n           carefully. And promise me you won't\r\n           go far --\r\n                         \r\n                          EMILIE\r\n           Of course. Okay, I promise.\r\n                         \r\n                          GRANDFATHER\r\n           To the top of the hill and straight\r\n           back again.\r\n                         \r\n                          EMILIE\r\n           I promise.\r\n                         \r\n          Emilie unties her hair and tosses the red pennant to\r\n          Grandfather, releasing her hair to spill down her back and\r\n          shoulder.\r\n           70.\r\n                         \r\n                          EMILIE (CONT'D)\r\n           My hero.\r\n                         \r\n          She sets off on Joey - and quickly spurs him to a gallop.\r\n                         \r\n                          GRANDFATHER\r\n           Slowly...slowly...\r\n                         \r\n          She rides - past the windmill - and then over the top of a\r\n          nearby hill - she speeds over it and out of sight.\r\n                         \r\n          Back to the hill - a sudden change of mood. An empty shot. No\r\n          movement, no returning girl.\r\n                         \r\n                          GRANDFATHER (CONT'D)\r\n           Emilie!\r\n                         \r\n          Cut again to the top of the hill, then back to the\r\n          Grandfather, very worried.\r\n                         \r\n                          GRANDFATHER (CONT'D)\r\n           Emilie!\r\n                         \r\n          Topthorn suddenly rears up - and charges off following,\r\n          sensing danger. Grandfather starts to run in the direction of\r\n          the hill.\r\n                         \r\n          Topthorn charging over the brow of the hill.\r\n                         \r\n          The Grandfather running - out of breath.\r\n                         \r\n          He hears an indistinct scream from Emilie!\r\n                         \r\n          He reaches the top of the hill - comes over the brow - and\r\n          there is not the fallen body of Emilie, which he has been\r\n          fearing, but a brutal line of German soldiers - and\r\n          motorbikes. It is like a line of Indians in a Western -\r\n          total, alien fear.\r\n                         \r\n          And there amongst them is Emilie, astride a panicked Joey,\r\n          surrounded by soldiers. Another one holds Topthorn, who bucks\r\n          and rears, but to no avail. Grandfather starts down the hill\r\n          towards his granddaughter.\r\n                         \r\n          EXT. GERMAN COLUMN NEAR THE WINDMILL. THE SAME\r\n                         \r\n          The Germans are moving through the horses they have gathered.\r\n          Emilie, unhorsed, tries to get to Joey, who is being roughly\r\n          led away by a German soldier.\r\n                         \r\n                          EMILIE\r\n           No! Let go of me! No!\r\n           71.\r\n                         \r\n          Grandfather grabs her. She is screaming. He tries to calm her\r\n          down. Joey is tied up as is Topthorn. Emilie is kicking and\r\n          screaming - but also desperately short of breath.\r\n                         \r\n                          GRANDFATHER\r\n           She is my granddaughter! Emilie,\r\n           stop! Don't hurt her, please!\r\n           Don't hurt her.\r\n                         \r\n          A soldier roughly shoves Emilie at him.\r\n                         \r\n          Brandt approaches. Emilie screams at him, in tears.\r\n                         \r\n                          EMILIE\r\n           You don't need them! There are so\r\n           many others!\r\n                         \r\n          Emilie is still sobbing. Grandfather hugs her - in horror\r\n          that she is now struggling so hard for breath.\r\n                         \r\n                          GRANDFATHER\r\n           Please, take the bigger one and\r\n           leave the smaller one. You are\r\n           breaking my granddaughter's heart.\r\n                         \r\n                          BRANDT\r\n                          (LEAVING)\r\n           The war has taken everything from\r\n           everyone.\r\n                         \r\n                          GRANDFATHER\r\n                          (CALLING AFTER)\r\n           What will happen to them?\r\n                         \r\n                          BRANDT\r\n           They will pull artillery until they\r\n                          DIE -\r\n                          EMILIE\r\n                          (COUGHING)\r\n           François!\r\n                         \r\n                          BRANDT\r\n           - or until the war is over.\r\n                         \r\n                          GRANDFATHER\r\n           It will never be over!\r\n                         \r\n                          BRANDT\r\n           You have your answer then.\r\n                         \r\n          The motorbikes start up and drive off. The Grandfather\r\n          hugging tiny Emilie as she coughs.\r\n           72.\r\n                         \r\n          The Germans disappear up the lane leaving the old man and the\r\n          child bereft in the bitter cold.\r\n                         \r\n          EXT. GERMAN CAMP. LATER.\r\n                         \r\n          Two grooms trail Brandt, leading Joey and Topthorn toward a\r\n          makeshift corral.\r\n                         \r\n                          BRANDT\r\n           Heiglemann - these are yours.\r\n                         \r\n                          FRIEDRICH\r\n           Yes, sir.\r\n                         \r\n                          BRANDT\r\n           They look strong - should last a\r\n           month or two.\r\n          FRIEDRICH is an unprepossessing, chubby man. He marvels at\r\n          Topthorn.\r\n                         \r\n                          FRIEDRICH\r\n           You are beautiful.\r\n                         \r\n          But then he looks to the other horses penned nearby, haggard\r\n          and weak. He turns to Joey.\r\n                         \r\n                          FRIEDRICH (CONT'D)\r\n           It's a pity they found you.\r\n                         \r\n          He takes the leads of the pair of them. He sighs...\r\n                         \r\n                          FRIEDRICH (CONT'D)\r\n           Such a pity...\r\n                         \r\n          In a strange way, there are many humans Joey meets, but also\r\n          just one, the spirit of goodness and consideration for\r\n          animals, joined by little echoes throughout the film.\r\n                         \r\n          And then they go over a ridge - and we suddenly see the\r\n          explanation of Friedrich's comment. The road they can see\r\n          below them is the main through road of the area - and it is a\r\n          scene of horse horror - huge, massive guns and cannons and\r\n          artillery being dragged by teams of horses that are in a\r\n          terrible condition.\r\n                         \r\n          For Joey and Topthorn, this is a moment like when soldiers\r\n          arrived to liberate the prisoners who had been kept in Changi\r\n          prison by the Japanese during World War 2. They have never\r\n          seen horses in this condition. You can see in their eyes the\r\n          confusion. This is a whole different world, where horses can\r\n          turn into creatures that look like this.\r\n           73.\r\n                         \r\n          And it is also a vision of their future. This may be the\r\n          moment the mighty Topthorn begins to lose hope. For Joey it\r\n          is another level of knowledge - another mighty thing he will\r\n          fight through - because he always fights through.\r\n                         \r\n          EXT. STEEP INCLINE. DAY.\r\n                         \r\n          Friedrich leads Joey and Topthorn in the wake of THE HUGE\r\n          MORSER - an elaborate 15 ton monstrosity with a six inch\r\n          bore. It takes a team of six horses to haul it with a dozen\r\n          men pushing from behind.\r\n                         \r\n                          ARTILLERY OFFICER\r\n           Pull together!\r\n                         \r\n          A soldier calls from the front of the heavy cannon - pulled\r\n          by a particularly wretched group of horses.\r\n                          ARTILLERY SOLDIER\r\n           Halt! Halt! Stop!\r\n                         \r\n          Lower down the hill, Friedrich waves down the rest of the\r\n          column.\r\n                         \r\n                          FRIEDRICH\r\n           Stop! Stop!\r\n                         \r\n          At the front of the Morser, one of the lead horses collapses -\r\n          he will never get up again.\r\n                         \r\n          Brandt steps up, pulls a revolver out of his pocket and\r\n          shoots the horse dead. It has come to this.\r\n                         \r\n          Joey, Topthorn, and all the other horses are spooked by the\r\n          pistol shot.\r\n                         \r\n          Brandt shouts to Friedrich from the road.\r\n                          BRANDT\r\n           Heiglemann, bring up another one!\r\n                         \r\n                          ARTILLERY OFFICER\r\n           Heiglemann, bring up another horse!\r\n                         \r\n                          BRANDT\r\n           That one!\r\n                         \r\n          Friedrich begins leading Joey up the hill, but --\r\n                         \r\n                          BRANDT (CONT'D)\r\n           No, no. The big black one!\r\n                         \r\n          Friedrich hauls Topthorn, hesitantly, while Joey watches.\r\n           74.\r\n                         \r\n          As he reaches Brandt:\r\n                         \r\n                          FRIEDRICH\r\n           He's a good horse, sir. But if you\r\n           move him up to the heavy gun, he\r\n           will be no use at all. Prince is\r\n           already losing condition. His leg,\r\n           sir.\r\n                         \r\n                          BRANDT\r\n           You have given them names?\r\n                         \r\n                          FRIEDRICH\r\n           Yes, sir.\r\n                         \r\n                          BRANDT\r\n           You should never give a name to\r\n           anything you are certain to lose.\r\n                          FRIEDRICH\r\n           His leg is not good enough, sir.\r\n                         \r\n                          BRANDT\r\n           Private, you will do as you are\r\n           told.\r\n                          (CALLING OFF)\r\n           Hook him up.\r\n                         \r\n          Friedrich has no choice but as he starts to lead Topthorn,\r\n          Joey rears up and escapes his groom. He gallops up the hill\r\n          to the gun - offering himself up to save Topthorn. It is his\r\n          \"Tale of Two Cities\" moment - giving up his life to save his\r\n          friend. He bucks and rears. Friedrich turns to Brandt.\r\n                         \r\n                          FRIEDRICH\r\n           As you see, sir, this one is\r\n           stronger.\r\n          Brandt takes up Friedrich, and Joey's, offer -\r\n                         \r\n                          BRANDT\r\n           Hook him up.\r\n                         \r\n          As Joey is hooked to the gun, he looks back to Friedrich who\r\n          leads Topthorn back down the hill.\r\n                         \r\n          EXT. STEEP INCLINE. LATER.\r\n                         \r\n          The convoy struggles up the hill. Joey feels the dead weight\r\n          of the gun. These are several tons of cast iron - almost\r\n          dwarfing the horses. Friedrich notices. Together, this grim\r\n          circus struggles along the pot-holed country road in the\r\n          rain.\r\n           75.\r\n                         \r\n          Joey leads the team up the incline. Each step is an immense\r\n          effort. The going, over rough scree, is very tough indeed. It\r\n          is very difficult for Joey to get a foothold on the loose\r\n          ground, but his experience in Dartmoor comes into play and\r\n          although he almost loses his balance several times he stays\r\n          upright and hauls the cannon - Fitzcarraldo-like - over the\r\n          hill.\r\n                         \r\n          We follow his progress step by step. Friedrich watches\r\n          anxiously. Soldiers strain at the sides of the gun. One\r\n          throws boards under the wheels to aid in traction. As they\r\n          reach the top of the hill it almost seems the effort is too\r\n          much, the cannon always in danger of rolling back. Joey\r\n          finally staggers over the top - it feels as though the\r\n          tethers are going to snap with the strain - but at last the\r\n          cannon reaches the peak, the crest of the hill.\r\n                         \r\n          EXT. THE BATTLEFIELD. DAY.\r\n          Soldiers scurry around the giant gun, preparing it.\r\n                         \r\n                          OFFICER\r\n           Halt! Halt! Take the horses away!\r\n                         \r\n                          ARTILLERY OFFICER\r\n           Shell!\r\n                         \r\n          Friedrich observes with Topthorn as a giant shell is carried\r\n          to the gun's breech.\r\n                         \r\n           ARTILLERY OFFICER (CONT'D)\r\n           And load!\r\n                         \r\n          The men wrestle it into place -\r\n                         \r\n           ARTILLERY OFFICER (CONT'D)\r\n           Back! Case!\r\n          - and secure it.\r\n                         \r\n           ARTILLERY OFFICER (CONT'D)\r\n           Position!\r\n                         \r\n          The barrel of the giant gun ratchets upward.\r\n                         \r\n           ARTILLERY OFFICER (CONT'D)\r\n           And...fire!\r\n                         \r\n          The shell explodes from the barrel. And then from another.\r\n          And another. For the first time we see the big picture - the\r\n          line of assembled cannons of which they were just one tiny\r\n          part.\r\n           76.\r\n                         \r\n          Each gun recoils violently as they shoot their shells into\r\n          oblivion - as soon as one shell is fired another is loaded -\r\n          the noise is deafening - the line seemingly endless - an\r\n          obscene production line of death. This is what the horses\r\n          have been feeding - this massive merciless thing.\r\n                         \r\n          Smoke wafts from the guns as we see the explosions in the\r\n          distance. The sound of the explosions takes us to -\r\n                         \r\n          EXT. BRITISH TRENCH. NIGHT.\r\n                         \r\n          Explosions light the dirty faces of British boys in uniform,\r\n          one after the next. Each light fading out before the next\r\n          great blast illuminates another anonymous face -then another -\r\n          and then another - and then ALBERT. Hold on him for extra\r\n          moments before he fades completely.\r\n                         \r\n          EXT. BRITISH TRENCHES. EARLY DAWN.\r\n          TITLE: FRANCE - 1918, THE SOMME\r\n                         \r\n          With the barrage lifted, the British soldiers that are\r\n          huddled in a low sub-trench, are ordered back on the line.\r\n          Andrew Easton is with Albert and he's shaken and terrified. A\r\n          far cry from the happy young boy we knew.\r\n                         \r\n          A gruff sergeant (SERGEANT MARTIN) walks the trench with a\r\n          bucket and each soldier puts in their valuables and personal\r\n          belongings. One a lighter, some money, etc.\r\n                         \r\n                          SERGEANT MARTIN\r\n           Valuables in the bucket, lads. If\r\n           you live, you'll get them back. If\r\n           you live, you'll get them back.\r\n           Good lads.\r\n                         \r\n          Albert and Andrew move down the trench in a line of soldiers\r\n          who are given ammo belts and grenades.\r\n                         \r\n          Albert gets his grenades and walks further along the\r\n          trenches. We follow him in real time as he passes a bunch of\r\n          soldiers who are kneeling in the ankle deep water, a PADRE is\r\n          giving them communion. The deafening noise of shelling all\r\n          around.\r\n                         \r\n                          ANDREW\r\n           Maybe it's a drill, Albie. Maybe\r\n           it's a drill like last time.\r\n                         \r\n          We keep following Albert's progress in real time - further on\r\n          there is a post box where they all put their final letters\r\n          home in identical green envelopes. We see Albert's letter\r\n          addressed to \"Ted and Rose Narracott\" in Devon. He posts it\r\n          in a battered metal post box.\r\n           77.\r\n                         \r\n          An officer approaches:\r\n                         \r\n                          DAVID\r\n           Love letter?\r\n                         \r\n                          ALBERT\r\n           That's my business.\r\n                         \r\n          It is David - Lyon's son - now in charge of this small group\r\n          of men. Still arrogant - looking older than Albert in his\r\n          uniform - and clearly enjoying his superior rank.\r\n                         \r\n                          DAVID\r\n           I hear you and your mate were doing\r\n           bird imitations again. You gonna\r\n           write a letter to your horse?\r\n                         \r\n          Albert ignores him. Andrew can't help but giggle.\r\n                          DAVID (CONT'D)\r\n           After you find your horse, I've lost\r\n           my needle in a haystack, and I could\r\n           use some help.\r\n                         \r\n          David takes up a bucket and walks down the line of soldiers.\r\n                         \r\n                          DAVID (CONT'D)\r\n           Anything valuable. Anyone who comes\r\n           back gets to share it out.\r\n                         \r\n                          ALBERT\r\n                          (TO ANDREW)\r\n           Stay here.\r\n                         \r\n          Albert follows David down the trench.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Remember that day me and Joey raced\r\n           you in your car?\r\n                         \r\n                          DAVID\r\n           I remember you somersaulting through\r\n           the air.\r\n                         \r\n                          ALBERT\r\n           Who was that girl you were with?\r\n                         \r\n                          DAVID\r\n           There was a girl?\r\n                         \r\n          Albert nods.\r\n                         \r\n                          ALBERT\r\n           There was. Don't you remember?\r\n           78.\r\n                         \r\n                          DAVID\r\n           It was just some girl, I suppose. I\r\n           don't recall which one. I do\r\n           remember you falling on your bum in\r\n           a ditch.\r\n                         \r\n          Andrew laughs amiably. David points to him, smirking.\r\n                         \r\n                          DAVID (CONT'D)\r\n           You see? Always entertaining,\r\n           Narracott, I'll give you that.\r\n                         \r\n          As David walks on, Andrew smiles at Albert.\r\n                         \r\n                          ANDREW\r\n           You did that? You fell on your bum?\r\n                         \r\n          Albert leaves without answering. Andrew keeps smiling until\r\n          a large shell explodes nearby. Troops surge towards their\r\n          ladders as officers scream indistinct orders.\r\n                         \r\n          Now David leads his troop through the trenches to the front\r\n          line where they stop, lean against the enemy-side wall\r\n          nervously and wait - each man in private contemplation.\r\n                         \r\n          Sergeant Martin moves along the lines, pushing men forward.\r\n                         \r\n                          SERGEANT MARTIN\r\n           Be ready! Be ready! Let's go, men,\r\n           get ready to go! Get ready to move\r\n           out! Stay in position!\r\n                         \r\n          David calls out from atop a trench ladder.\r\n                         \r\n                          DAVID\r\n           Hold your nerve, boys. Remember,\r\n           it's not far to go. There's a way\r\n           through.\r\n           (he moves down the line)\r\n           Run fast, keep your wits about you,\r\n           keep your eyes open and God and the\r\n           King will keep an eye on you.\r\n           Company will fix bayonets! Fix\r\n           bayonets!\r\n                         \r\n          The echo of `fix bayonets' goes down the line - and every man\r\n          fixes the brutal shining bayonet to the end of his gun.\r\n                         \r\n          Then Albert turns to Andrew.\r\n                         \r\n                          ALBERT\r\n           You know what it reminds me of out\r\n           there?\r\n           79.\r\n                         \r\n                          ANDREW\r\n           What?\r\n                         \r\n                          ALBERT\r\n           That bloody impossible lower field\r\n           the day me and Joey plowed it. Best\r\n           day of my life that was and you were\r\n           there.\r\n                         \r\n                          ANDREW\r\n           And this here is the worst day of my\r\n           life, about to begin, and you're\r\n           here cheering me on. Us two, always.\r\n           And him.\r\n                         \r\n          He nods at David Lyons, who gives instructions to another\r\n          soldier.\r\n                          DAVID\r\n           Once you're in no man's land, go to\r\n           the flanks. Stay on the flanks.\r\n                         \r\n                          SOLDIER\r\n           Yes, sir.\r\n                         \r\n          David turns to Albert and Andrew.\r\n                         \r\n                          DAVID\r\n           Come on, boys, come on. To the\r\n           ladder!\r\n                         \r\n                          ALBERT\r\n                          (TO ANDREW)\r\n           Stick close to the gentry, that's\r\n           our ticket, yeah? We have the pluck\r\n           but they have the luck.\r\n          They both smile. And then the fear takes over again. Andrew\r\n          particularly feels as though he is on the very edge now.\r\n          David urges them forward.\r\n                         \r\n                          DAVID\r\n           You, too, Narracott.\r\n                          (TO ANDREW)\r\n           And you, too.\r\n                         \r\n          Andrew and Albert pass by the bucket. They throw some\r\n          valuables in. But a moment later, Albert goes back to the\r\n          bucket and pulls something out - a worn piece of paper - he\r\n          unfolds it - it is the little sketch that Captain Nicholls\r\n          drew of Joey the night before they left for France. He slips\r\n          it inside his shirt, next to his heart.\r\n           80.\r\n                         \r\n                          DAVID (CONT'D)\r\n           Come on, on your ladders, boy. On\r\n           your ladders. In you go, in you go.\r\n           That's it.\r\n                         \r\n          Andrew turns towards a ladder. As fate and placement would\r\n          have it - he is first in line. He puts his foot on the\r\n          ladder, when suddenly the Sergeant stops him.\r\n                         \r\n                          SERGEANT MARTIN\r\n           Listen to your sergeant!\r\n                         \r\n          He pulls Andrew aside, speaking so that everyone can hear.\r\n                         \r\n           SERGEANT MARTIN (CONT'D)\r\n           If anybody turns back, if any one of\r\n           our boys come running towards you -\r\n           you take this rifle and you shoot\r\n           them dead. Do you understand?\r\n                         \r\n                          SOLDIERS\r\n           Yes, sir!\r\n                         \r\n          The sergeant pushes in on Andrew, private and intense.\r\n                         \r\n                          SERGEANT\r\n           Do you understand me? Do you\r\n           understand what I'm telling you,\r\n           son? You take this rifle and you\r\n           shoot them dead. Understand?\r\n                         \r\n          Andrew looks ready to cry, but manages to nod. Albert turns\r\n          to him, only to be pushed back by the sergeant.\r\n                         \r\n                          SERGEANT (CONT'D)\r\n           Up there, son. Up your ladder. Up\r\n           your ladder to your work!\r\n          Albert looks nervously back at Albert, comforting.\r\n                         \r\n                          ALBERT\r\n           It's good. Andrew, it's good.\r\n           Andrew! Nobody's retreating today.\r\n           Andrew! Andrew! Nobody. Is\r\n           retreating. Today.\r\n                         \r\n          The COMMANDER arrives, checks the time on his AIDE's watch,\r\n          mounts his ladder and blows a whistle to signal the charge.\r\n          A BAGPIPER plays as the men go over the top.\r\n                         \r\n          David now heads up the ladder first. Gun fire overhead,\r\n          Albert steels himself, then hauls himself over the top,\r\n          followed by the next man and the next.\r\n           81.\r\n                         \r\n          Immediately machine gun fire whistles past, we hear the\r\n          screams of the first men who are shot. We follow Albert.\r\n                         \r\n          We are him. His vision. His experience. The ground is\r\n          blasted, there are bodies all around him. He tries to run but\r\n          his feet sink into the mud. Bullets fly past him. Felled men\r\n          are screaming at his feet in fear and agony. Albert staggers\r\n          forward. David is now right by him. They run together. Albert\r\n          looks round and suddenly, David is hit. He falls to the\r\n          ground, screaming.\r\n                         \r\n                          DAVID\r\n           I'm shot! No!\r\n                         \r\n          Albert instinctively goes to help. Bullets shower all around\r\n          him.\r\n                         \r\n                          DAVID (CONT'D)\r\n           Just leave me. Leave me!\r\n                         \r\n          Albert grabs him and drags him onwards with him - David\r\n          screaming at the pain - Albert grimly determined. Shells\r\n          explode around them as they stumble on. Other men are\r\n          running and falling. Albert sees cover in a huge shell-hole\r\n          so dives into it for a moment's reprieve from the gun fire.\r\n          He sits in still terror for a moment.\r\n                         \r\n                          ALBERT\r\n           You'll be all right here. You'll be\r\n           safe. Someone'll come for ya.\r\n                         \r\n                          DAVID\r\n           Albert. Albert, listen...\r\n                         \r\n                          ALBERT\r\n           It's all right. It's all right.\r\n           We're Devon boys, yeah?\r\n          David looks at Albert as though seeing him for the first\r\n          time.\r\n                         \r\n                          DAVID\r\n           Yeah...\r\n                         \r\n          Albert races onward.\r\n                         \r\n          Back at the trench, Andrew waits - terrified - and then, back\r\n          out of the mist step two men - heading back towards him. Then\r\n          a third. They suddenly catch sight of Andrew waiting there\r\n          with his gun pointed towards them. They slow down - in the\r\n          terror of the assault, they had forgotten that death was\r\n          waiting for them if they turned back.\r\n           82.\r\n                         \r\n          Time seems to slow down - Andrew shifts his gun from pointing\r\n          at one - to the other - we see their individual faces. They\r\n          are all just boys really.\r\n                         \r\n          And suddenly, instinct hits Andrew - he charges up the\r\n          ladder, and forward, firing - past the three men, towards the\r\n          enemy. He chooses his death instead of theirs. A sudden\r\n          barrage of machine gun fire all around him.\r\n                         \r\n          Cut back to Albert, who makes his way to the edge of the\r\n          shell hole. Bullets whizz inches from his head. He looks over\r\n          to see a German machine gun position to his right. Bullets\r\n          whizz past forcing him to duck.\r\n                         \r\n          Andrew charges past other soldiers, ignoring their warnings.\r\n                         \r\n                          RANDOM SOLDIER\r\n           Get down!\r\n          Albert continues forward to dive into another shell hole,\r\n          nearer to the German line. He scrambles from shell hole to\r\n          shell hole. Now he's very close to the machine gun position.\r\n                         \r\n          Albert takes a grenade, fumbles with the pin as his hands\r\n          tremble. He finally gets the pin out and he hurls the\r\n          grenade at the machine gunner. We see the explosion and the\r\n          machine gun stop. Albert sprints over the top again and makes\r\n          it all the way into the German trench.\r\n                         \r\n          Albert runs through the trench, which seems curiously empty.\r\n          Albert swings round as he sees the startling face of a gas-\r\n          masked German holding a rifle on him.\r\n                         \r\n          Albert readies his bayonet but the man is dead, slumped\r\n          backwards against the side of the trench still upright.\r\n          Albert spins round, his bayonetted rifle in front of him,\r\n          ready for action, but there is only the ghostly sight of dead\r\n          German soldiers.\r\n                         \r\n          Albert is alone, everyone else is dead. All the dead wear\r\n          gas masks.\r\n                         \r\n          More British soldiers drop into the trench, among them\r\n          Andrew. He stumbles in the mud, drops his rifle, recovers\r\n          it, and races through the trench.\r\n                         \r\n          He glimpses Albert ahead of him, stalking through the mist.\r\n          Andrew breaks into a smile and rushes forward, prompting\r\n          Albert to whirl with his rifle raised.\r\n                         \r\n                          ANDREW\r\n           NO!\r\n           83.\r\n                         \r\n          Albert pauses just in time. Then he collapses against the\r\n          side of the trench, overwhelmed.\r\n                         \r\n                          ANDREW (CONT'D)\r\n           Albie.\r\n                         \r\n          Andrew grabs Albert and holds him up, embracing him. Albert\r\n          can barely whisper:\r\n                         \r\n                          ALBERT\r\n           We made it. We made it.\r\n                         \r\n          A moment later, the pair of them hurry through the trenches.\r\n          Albert spots more comrades around a corner and calls ahead to\r\n          Andrew.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           Andrew, this way out!\r\n          Suddenly ANOTHER SOLDIER leaps from a trench branch between\r\n          them, shouting in panic.\r\n                         \r\n                          SOLDIER\r\n           Gas! Gas! Gas!\r\n                         \r\n          An instant later, a gas cloud blasts through the trench.\r\n          Andrew and Albert look in horror. It spreads towards them,\r\n          too powerful to avoid. Andrew is closest, turns to Albert\r\n          with a helpless -\r\n                         \r\n                          ANDREW\r\n           Albie...\r\n                         \r\n          - before he takes the full power of it. An instant later, the\r\n          white, deadly cloud encompasses Albert, too...\r\n                         \r\n          EXT. EDGE OF THE BATTLEFIELDS. DUSK.\r\n          Close on hooves and boots, slogging through muddy water,\r\n          several inches deep.\r\n                         \r\n          Friedrich is walking along, leading Topthorn and Joey.\r\n          Topthorn is limping.\r\n                         \r\n          Something is wrong - Topthorn seems to be failing - he coughs\r\n          badly, breathes strangely. Friedrich stops to check on him.\r\n          An officer notices.\r\n                         \r\n                          GERMAN OFFICER\r\n           Hey, there's no stopping here. Keep\r\n           them moving.\r\n           84.\r\n                         \r\n                          FRIEDRICH\r\n           Sir, there's something wrong. This\r\n           one needs to rest.\r\n                         \r\n                          GERMAN OFFICER\r\n           There's no rest for them. Move them\r\n           along. Move them along!\r\n                         \r\n          Instead, Friedrich leads the horses under the cover of a low\r\n          bridge for a brief respite. A moment later, Topthorn\r\n          collapses.\r\n                         \r\n                          FRIEDRICH\r\n           Please, please, please. Stay on\r\n           your feet. No, please. No no no...\r\n                         \r\n          Friedrich tries to help Topthorn valiantly struggling to get\r\n          up but finally sinks to the ground again. This time he lies\r\n          semi-conscious. He is dying.\r\n                         \r\n                          FRIEDRICH (CONT'D)\r\n           Please please... Stay on your feet.\r\n                         \r\n          Joey deeply upset nuzzles his nose into Topthorn but the life\r\n          drains out him. Friedrich is in panic at Topthorn's quick\r\n                         DECLINE:\r\n                         \r\n                          FRIEDRICH (CONT'D)\r\n           Come on. Please please...\r\n                         \r\n          Friedrich continues to stroke Topthorn's head. Joey pushes\r\n          Topthorn as if to stop him falling into unconsciousness. For\r\n          a moment we think Topthorn will come round but he slips away\r\n          and all life leaves his body. Friedrich solemnly strokes the\r\n          horse, knowing all is lost.\r\n                         \r\n          Joey does not understand. He pulls at Topthorn's reins, as if\r\n          trying to pull him upright. Topthorn's body is inert, his\r\n          head falls to the earth. Joey will not give up, he pulls at\r\n          him desperately not understanding that Topthorn has died.\r\n                         \r\n          Suddenly, Friedrich looks around. Chaos - all the German\r\n          soldiers stream back past their position, scrambling to get\r\n          their guns and helmets. An officer charges down the bank next\r\n          to the bridge, screaming orders at Friedrich.\r\n                         \r\n                          GERMAN OFFICER\r\n           They're coming! Leave it, private!\r\n                         \r\n          Friedrich tries to pull Joey away to safety but Joey will not\r\n          leave Topthorn's body. Friedrich pulls at Joey, but Joey is\r\n          too lost in his grief to care about or even notice the\r\n          danger.\r\n           85.\r\n                         \r\n           GERMAN OFFICER (CONT'D)\r\n           Leave it! Come with me!\r\n                         \r\n                          FRIEDRICH\r\n           Go to hell!\r\n                         \r\n          The officer nods to two other soldiers who pull Friedrich to\r\n          safety. As he's dragged away, he screams at Joey:\r\n                         \r\n                          FRIEDRICH (CONT'D)\r\n           Run. Run! Run! Run!\r\n                         \r\n          But this is all background noise to Joey's profound refusal\r\n          to accept Topthorn is dead. He paws at the ground next to\r\n          Topthorn, a horse standing over his best friend in a field,\r\n          and he will never leave him.\r\n                         \r\n          And then suddenly - from around a blind turn in the\r\n          streambed, a huge, remorseless tank turns, heading right for\r\n          Joey. He bolts, galloping down the streambed, until he\r\n          reaches a barbed wire barrier - a dead end. He attempts to\r\n          run up the banks, but they're blocked, as well. He rears up,\r\n          but the tank keeps advancing.\r\n                         \r\n          The tank is about to crush Joey. He has left it too late. He\r\n          is about to die.\r\n                         \r\n          But then, counter-intuitively, he runs straight towards the\r\n          tank and...leaps over it - a leap he learnt from Emilie. Then\r\n          scrambles up and over it and leaps down behind.\r\n                         \r\n          Joey keeps on running. He is wild, frightened.\r\n                         \r\n          EXT. COUNTRYSIDE / VILLAGE / TRENCH. THE SAME.\r\n                         \r\n          Joey is free - in countryside - but there is blood pouring\r\n          from his leg, clearly torn by his encounter with the tank. He\r\n          runs on - it is becoming night - suddenly there are\r\n          explosions to the left of him - this fast, elegant creature\r\n          simply runs through the gaps between explosions.\r\n                         \r\n          But as he charges on - the sky lights up in the direction he\r\n          is heading. He is suddenly in the thick of battle. A shell\r\n          explodes next to him, and he leaps entirely over a trench.\r\n          Another explosion sends him leaping, but not far enough - he\r\n          finds himself crashing downwards, and into a trench - and he\r\n          races through it - and finds himself charging towards a\r\n          German company. Both sides are equally startled - Joey\r\n          charging through a thin trench lined with German soldiers -\r\n          the soldiers, finding a live horse careering through them.\r\n                         \r\n          In desperation, Joey scrambles out of the trench - and once\r\n          again, rushes away from the fighting...\r\n           86.\r\n                         \r\n          But now it is very dark indeed - he is stumbling as he runs -\r\n          there is blood mixed with the mud on his legs.\r\n                         \r\n          Now it is total night - fog - confusion - he jumps again. And\r\n          now everywhere there are potholes - the land is massively\r\n          uneven - shells are exploding all around. And suddenly sees\r\n          in front of him barbed wire. He crashes through it - more -\r\n          he bursts through again - now dragging barriers behind him -\r\n          the barriers tangle, pulling him up short - he flips and\r\n          lands amongst even more barbed wire.\r\n                         \r\n          He pulls and turns to release himself but it is impossible.\r\n          The more he pulls, the more firmly he is trapped. He rises\r\n          up, wild, magnificent, a beast fighting for his life.\r\n                         \r\n          He is completely trapped. He cannot move. He cannot see. He\r\n          is in pain. He falls. It feels like an end.\r\n          EXT. BRITISH TRENCH. THE SAME.\r\n                         \r\n           GEORDIE SOLDIER (O.S.)\r\n           Stand to, stand to -\r\n                         \r\n          A young soldier, a Geordie, is on look-out duty. He looks\r\n          through a periscope. He alerts his colleague in his thick,\r\n          northern, Newcastle accent.\r\n                         \r\n           GEORDIE SOLDIER (CONT'D)\r\n           There's something moving.\r\n                         \r\n                          SOLDIER\r\n           What the hell is it?\r\n                         \r\n                          GEORDIE SOLDIER\r\n           It looks like a cow.\r\n                         \r\n          He passes the periscope to the second soldier.\r\n                          SOLDIER\r\n           What the hell would a cow be doing out\r\n           there?\r\n                         \r\n          We see what he sees - nothing but morning mist on the surreal\r\n          landscape - and something strange. It is Joey in the distance\r\n                         \r\n                          SOLDIER 2\r\n           That definitely isn't a cow.\r\n                         \r\n                          SOLDIER\r\n           (handing over periscope)\r\n           Well, what is it?\r\n           87.\r\n                         \r\n          EXT. GERMAN TRENCH. THE SAME.\r\n                         \r\n          We see an almost identical scene of several German soldiers\r\n          looking out at Joey just as the British soldiers had done.\r\n                         \r\n                          SECOND GERMAN\r\n           It can't be a horse. Nothing alive could be\r\n           out there.\r\n                         \r\n                          THIRD GERMAN\r\n           It isn't a horse. It isn't a horse.\r\n                         \r\n          The first German looks through his periscope. We see what he\r\n          sees - Joey in the mist:\r\n                         \r\n                          SECOND GERMAN\r\n           Yes - it's a horse.\r\n          The second German looks through the periscope, stunned.\r\n                         \r\n                          THIRD GERMAN\r\n           It's a horse.\r\n                         \r\n          A third German (PETER) lowers his binoculars.\r\n                         \r\n                          PETER\r\n           Yeah, it's a horse.\r\n                         \r\n          EXT. BRITISH TRENCHES. THE SAME.\r\n                         \r\n          Now all the soldiers are gathering to look out at Joey. A\r\n          CAPTAIN now has the periscope.\r\n                         \r\n                          BRITISH CAPTAIN\r\n           Well, bugger me. It's a horse.\r\n                         \r\n                          GEORDIE SOLDIER\r\n           Lads, we should call him.\r\n                         \r\n                          BRITISH SOLDIER\r\n           How do you call a horse?\r\n                         \r\n          The Geordie starts clicking his tongue, followed by all of\r\n          his comrades. They all try to attract Joey's attention with\r\n          tongue clicks.\r\n                         \r\n          EXT. GERMAN TRENCH. THE SAME.\r\n                         \r\n          The Germans hear the clicks and respond with a chorus of\r\n          whistles.\r\n                         \r\n          EXT. BRITISH TRENCHES. THE SAME.\r\n                         \r\n          Now both sides are whistling. Even the captain joins in.\r\n           88.\r\n                         \r\n          EXT. NO MAN'S LAND. THE SAME.\r\n                         \r\n          Joey tries to rise, but remains entangled. He whinnies in\r\n          pain.\r\n                         \r\n          EXT. GERMAN TRENCH. THE SAME.\r\n                         \r\n          Peter lowers his binoculars.\r\n                         \r\n                          PETER\r\n           He's caught on the wire.\r\n                         \r\n          EXT. BRITISH TRENCHES, THE SAME.\r\n                         \r\n                          GEORDIE SOLDIER\r\n           Oh sod it...\r\n                         \r\n          Geordie climbs up the side of the trench, and waves a white\r\n          handkerchief tied to the end of his bayonet.\r\n                         \r\n                          BRITISH CAPTAIN\r\n           What do you think you're doing? Get\r\n           back, do you hear me? Corporal,\r\n           that's an order! Get back!\r\n                         \r\n          Geordie, not receiving fire, is emboldened to stand up.\r\n                         \r\n                          BRITISH SOLDIER\r\n           Listen to him, sir. We can't leave him.\r\n                         \r\n          He waves the handkerchief to clearly signal he is no threat.\r\n                         \r\n          EXT. GERMAN TRENCH. THE SAME.\r\n                         \r\n          The Germans look at the young soldier making his way over No\r\n          Man's Land.\r\n                          PETER\r\n           What's he doing?\r\n                         \r\n                          SECOND GERMAN\r\n           It's a trap.\r\n                         \r\n                          PETER\r\n           No, I don't think so. I think he's\r\n           trying to help.\r\n                         \r\n          The second German cocks his rifle and starts to take aim.\r\n                         \r\n                          THIRD GERMAN\r\n           Scare him back into his hole.\r\n                         \r\n          The second German takes a shot aimed over the Geordie's\r\n          shoulder.\r\n           89.\r\n                         \r\n          EXT. NO MAN'S LAND. THE SAME.\r\n                         \r\n          The Geordie crouches for cover, waving his handkerchief more\r\n          frantically.\r\n                         \r\n                          GEORDIE\r\n           It's a white flag, ent it? You see\r\n           the white flag!? I'm just after\r\n           tending to this here horse, is all!\r\n                         \r\n          The Georgie marshals his courage and stands again, waving the\r\n          handkerchief.\r\n                         \r\n                          BRITISH CAPTAIN\r\n           Get back, you stupid git!\r\n                         \r\n          There's no fire from the German trenches. Muttering to\r\n          himself, the Geordie marches forward towards Joey:\r\n                          GEORDIE\r\n           The Lord is my shepherd, I shall not\r\n           want, he leadeth me into green\r\n           pastures, he lay me down beside the\r\n           still waters...\r\n                         \r\n          The Geordie walks very slowly across the mud - there are\r\n          bodies - the ground squelches beneath his feet. He waves his\r\n          handkerchief as he walks. He crosses a narrow bridge that\r\n          spans a flooded bomb crater.\r\n                         \r\n          Joey, lying on his side, wrapped head to toe in barbed wire,\r\n          covered in mud, watches Geordie approach. When Geordie gets\r\n          too close, Joey freaks out and begins thrashing about. Joey\r\n          whinnies a high scream of pain, because wire is cutting into\r\n          his hide in several places, and as he thrashes it cuts him\r\n          deeper. Particularly worrisome is a strand that's wrapped\r\n          around his head, crossing right over his eye, threatening to\r\n          slash it. The Geordie calls out in a soothing voice:\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           Poor beastie. Poor babbie. It's\r\n           alright. It's alright. Don't buck\r\n           and wriggle so, you're only\r\n           shredding yourself.\r\n                         \r\n          Joey calms a little, still moving his head up and down.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           You'll blind yourself.\r\n                         \r\n          He reaches Joey and surveys the formidable tangle of wire in\r\n          which Joey's bundled. The Geordie soothes and at the same\r\n          time gingerly tests other strands, trying to figure out where\r\n          to begin.\r\n           90.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           Bugger me worthless - I didn't think\r\n           to bring gloves or something to cut\r\n                          THE -\r\n                         \r\n          He stabs his hand on one of the barbs.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           OW! DAMN! OW!!\r\n                         \r\n          There's a noise behind him, and the Geordie turns around to\r\n          see the Peter (the German from the trench) standing several\r\n          feet away, holding some wire cutters.\r\n                         \r\n                          PETER\r\n           I thought perhaps you might need\r\n           these.\r\n          He holds out the wire cutters. The Geordie, still\r\n          frightened, stares stupidly at them.\r\n                         \r\n                          PETER (CONT'D)\r\n           For the barbed wire?\r\n                         \r\n                          GEORDIE\r\n           Yeah, yeah I... Ummm, thanks.\r\n           Cheers. Cheers...\r\n                         \r\n          He reaches out and takes the proffered cutters.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           Thanks.\r\n                         \r\n          He returns to Joey, nervous about turning his back. He tries\r\n          to figure out where to begin cutting. He lifts a long strand\r\n          of wire that wraps around Joey's neck, stretches across his\r\n          shoulder and torso and around one of his front legs. He puts\r\n          the wire in the crux of the cutters and is preparing to snip\r\n          when Peter steps closer to him.\r\n                         \r\n                          PETER\r\n           That...That's a very long strand.\r\n           When you cut it, it's going to\r\n           release this -\r\n                         \r\n          He points to a wire wrapped around the wire the Geordie's\r\n          lifting. Then he points to two other wires, similarly\r\n                         ENTANGLED:\r\n                         \r\n                          PETER (CONT'D)\r\n           - and this, and this, and they'll\r\n           coil back rather violently, which\r\n           I'm afraid will only wound the poor\r\n           fellow further.\r\n           91.\r\n                         \r\n          The Geordie nods.\r\n                         \r\n                          GEORDIE\r\n           You speak good English.\r\n                         \r\n                          PETER\r\n           I speak English well.\r\n           (re: the cutters)\r\n           May I?\r\n                         \r\n          The Geordie hands them over and Peter surveys the wires.\r\n                         \r\n                          PETER (CONT'D)\r\n           What if we cut his head free first?\r\n           So he won't try to stand up and\r\n           blind himself? And then -\r\n                         \r\n                          GEORDIE\r\n           Pity you didn't bring a second pair.\r\n           Then I could cut the wire here -\r\n                         \r\n          He points to one of the wires entangled with the strand he'd\r\n          been prepared to cut.\r\n                         \r\n          Peter stands and shouts in the direction of his trench.\r\n                         \r\n                          PETER\r\n           WE NEED MORE WIRE CUTTERS!\r\n                         \r\n          All at once one, two, three, six pairs of cutters come\r\n          soaring through the air and splash into the watery crater.\r\n                         \r\n          Moments later - Peter and the Geordie kneel beside Joey, each\r\n          with a pair of cutters.\r\n                         \r\n          Joey is calming down again.\r\n          The Geordie positions himself across Joey's body so that when\r\n          he's cut the wire, it won't coil back and cut Joey. Peter\r\n          positions himself to be able to cut the two wires in quick\r\n          succession, holding the first wire to stop it from springing\r\n          back.\r\n                         \r\n          Joey's completely still now.\r\n                         \r\n          Peter points between Joey's eyes.\r\n                         \r\n                          PETER (CONT'D)\r\n           His blind spot. The cutters won't\r\n           frighten him. If you could cut\r\n           here, holding this wire -\r\n                         \r\n          He points to wires that intersect the wire that crosses\r\n          Joey's eye. Then he points to the wire across Joey's eye.\r\n           92.\r\n                         \r\n                          PETER (CONT'D)\r\n           I could -\r\n                         \r\n                          GEORDIE\r\n           Say no more, I'm right behind you.\r\n                         \r\n          As they reposition themselves, the Geordie says to Joey:\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           And you understand what's happening,\r\n           do you not, O Best Beloved? That you\r\n           must lay so very nice and still.\r\n           There's a lad, you're a remarkable\r\n           horse, you are, helping us help you.\r\n           There's a lad. There's a remarkable\r\n           lad.\r\n                         \r\n          The Geordie looks into Joey's huge eye as he and Peter get to\r\n          work on their cutting. Joey returns his gaze.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           So how's things in yonder trench?\r\n                         \r\n                          PETER\r\n           Delightful. We read, we knit\r\n           sweaters, and we train our rats to\r\n           perform circus tricks.\r\n                         \r\n                          GEORDIE\r\n           Well, if ever you need any more\r\n           rats, we can always send ours over.\r\n           `Cause we've more than we need,\r\n           strictly speaking. Besides, they\r\n           scare off all the pretty girls.\r\n                         \r\n                          PETER\r\n           Our girls aren't afraid of rats.\r\n                          GEORDIE\r\n           Big strapping German girls, eh? Kind\r\n           what gives robust massages?\r\n                         \r\n          They laugh.\r\n                         \r\n                          PETER\r\n           Every Thursday! And they bring rum\r\n           cake on your birthday.\r\n                         \r\n          Both men smile at this while Joey is completely still; they\r\n          work quickly, in concert, cutting the horse's head free of\r\n          the wire.\r\n           93.\r\n                         \r\n          Joey raises his head, gives it a shake, neighs and then stirs\r\n          a little. The two soldiers smile at one another. Then they\r\n          set about cutting the rest of the wire; it's much easier now.\r\n                         \r\n          The Geordie cuts through the last wire binding Joey's legs.\r\n          The two soldiers help as the horse staggers upright.\r\n                         \r\n                          GEORDIE\r\n           Look at that horse! Look at the\r\n           muscles he's got, them long legs.\r\n           They're made for running, horses.\r\n           Runnin' away from danger.\r\n                         \r\n                          PETER\r\n           Running away is all they have.\r\n                         \r\n                          GEORDIE\r\n           Yet we taught `em opposite. Running\r\n           into the fray.\r\n                         \r\n                          PETER\r\n           War horse.\r\n                         \r\n                          GEORDIE\r\n           Yeah. War horse. And there he is.\r\n           What a strange beast you've become.\r\n                         \r\n          The Geordie grabs hold of Joey's halter, though Joey shows no\r\n          sign of running.\r\n                         \r\n          Joey is finally free.\r\n                         \r\n          The two men look at each other.\r\n                         \r\n                          PETER\r\n           And now?\r\n                          GEORDIE\r\n           I take him back with me, yeah?\r\n                         \r\n                          PETER\r\n           Since I supplied the cutters, the\r\n           horse is mine. This is fair, no?\r\n                         \r\n                          GEORDIE\r\n           In a pig's eye. He's English, plain\r\n           to see.\r\n                         \r\n                          PETER\r\n           Oh, you mean because he's so filthy?\r\n                         \r\n                          GEORDIE\r\n           Because he's so smart. And you're\r\n           none too clean yourself.\r\n           94.\r\n                         \r\n                          PETER\r\n           We could box. And the winner gets\r\n           the horse.\r\n                         \r\n          The Geordie smiles.\r\n                         \r\n                          GEORDIE\r\n           No, thanks, pet. Must be careful not\r\n           to start a war.\r\n           (patting his pockets:)\r\n           Do you have a coin of any sort?\r\n                         \r\n                          PETER\r\n           Coin toss?\r\n                         \r\n                          GEORDIE\r\n           Yeah.\r\n          He takes a coin from his pocket, hands it to the Geordie, who\r\n          looks at it.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           All right, Fritz - you're on.\r\n                         \r\n          He flips the coin back to Peter.\r\n                         \r\n                          PETER\r\n           My name is not Fritz - it is Peter.\r\n                         \r\n                          GEORDIE\r\n           Peter - I'm Colin.\r\n                         \r\n                          PETER\r\n           You call it, Colin.\r\n                         \r\n                          GEORDIE\r\n           Heads.\r\n          Peter spins it in the air and lets it fall into the mud. They\r\n          look down. Peter shakes his head, resigned.\r\n                         \r\n                          PETER\r\n           That's the face of my Kaiser and he does not\r\n           look pleased with me. The horse is yours.\r\n                         \r\n          They collect their helmets as snow begins to blow around\r\n          them.\r\n                         \r\n                          GEORDIE\r\n           Gone quiet, hasn't it?\r\n                         \r\n                          PETER\r\n           Yes.\r\n                          (PAUSE)\r\n                          (MORE)\r\n           95.\r\n                          PETER (CONT'D)\r\n           But wait half an hour and we'll be shooting\r\n           again.\r\n                         \r\n                          GEORDIE\r\n           I'm a terrible shot, Pete, don't believe\r\n           I'll ever hit the target.\r\n                         \r\n          He hands back the cutters.\r\n                         \r\n                          PETER\r\n           Thanks.\r\n                         \r\n          He notices the Geordie has offered his hand, as well. A\r\n          beat, then Peter shakes with him.\r\n                         \r\n                          PETER (CONT'D)\r\n           Cheerio, mate.\r\n                          (RE JOEY:)\r\n           You'll take good care of him, yes?\r\n                         \r\n                          GEORDIE\r\n           I will.\r\n                         \r\n                          PETER\r\n           Our strange beast.\r\n                         \r\n                          GEORDIE\r\n           And you take care of your own\r\n           strange self.\r\n                         \r\n          Peter tosses Geordie his cutters.\r\n                         \r\n                          PETER\r\n           Colin! A pair of German cutters - in memory\r\n           of your handsome friend from Dusseldorf.\r\n                         \r\n                          GEORDIE\r\n           Thanks.\r\n                         \r\n          Peter nods, and walks back to his trench. As he goes, the\r\n          Geordie calls after him:\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           I'll use `em back in the garden in\r\n           South Shields. You keep your head\r\n           down, now, Pete me lad!\r\n                         \r\n          As he walks away, Peter turns back briefly, calling:\r\n                         \r\n                          PETER\r\n           Remarkable! A remarkable horse!\r\n                         \r\n          The Geordie leads Joey towards the British trenches.\r\n           96.\r\n                         \r\n          EXT. TRENCHES. THE SAME.\r\n                         \r\n          Joey is now in the trenches, splashing about in the ankle\r\n          deep water. He seems enormous in this cramped labyrinth. He\r\n          is led past the broken and wounded soldiers who look at him\r\n          with amazement, dumbfounded. It is a surreal image. The horse\r\n          where horses shouldn't be.\r\n                         \r\n          As Joey makes his journey through the trenches soldiers\r\n          excitedly gather to watch him come by, taking pleasure in the\r\n          saving of this single life.\r\n                         \r\n          EXT. TRENCHES. THE SAME.\r\n                         \r\n          We arrive at a section we recognise as the place from where\r\n          Albert set off only the night before. Sergeant Martin is\r\n          there - as one man helps a wounded soldier into a medical\r\n          area. It is David, hobbling and looking shell-shocked.\r\n          Another wounded soldier approaches, but Martin waves him on.\r\n                         \r\n                          SERGEANT MARTIN\r\n           We're full up. Move on.\r\n                         \r\n          David is seated next to Albert, who now seems in worse\r\n          condition. His eyes are bandaged and he's wheezing. Andrew\r\n          is nowhere to be seen. As a MEDICAL OFFICER checks Albert:.\r\n                         \r\n                          DAVID\r\n           The gas got him - we had to wait\r\n           till morning.\r\n                         \r\n          The medic moves to Sergeant Martin, looking stricken.\r\n                         \r\n                          MEDICAL OFFICER\r\n           This can't be all of us.\r\n                         \r\n                          SERGEANT MARTIN\r\n           This is all.\r\n           (bellowing to the men)\r\n           All walking wounded, away to the\r\n           dressing station! Away to the\r\n           dressing station!\r\n                         \r\n          EXT. HOSPITAL AREA. LATER.\r\n                         \r\n          Joey is led into the hospital area beyond the trenches. The\r\n          Geordie leads him through the snowy streets. Bandaged men\r\n          strewn around, wounded soldiers waiting for attention.\r\n                         \r\n          The waiting soldiers gather to view the strange spectacle of\r\n          the horse.\r\n           97.\r\n                         \r\n          At one of the dressing areas, a NURSE tends to Albert's\r\n          damaged eyes. Behind him, we see Joey pass in the street,\r\n          but Albert doesn't know it.\r\n                         \r\n          Joey limps, his foreleg clearly injured. The Geordie soldier\r\n          stops outside a makeshift hospital. Joey looks frail and\r\n          exhausted.\r\n                         \r\n          A DOCTOR storms over from his patients.\r\n                         \r\n                          DOCTOR\r\n           What's this doing here?\r\n                         \r\n                          GEORDIE\r\n           We need a vet, sir.\r\n                         \r\n                          DOCTOR\r\n           There are no vets. We've scarcely\r\n           any horses left.\r\n                         \r\n                          GEORDIE\r\n           He's cut all over, but this leg\r\n           here's got the worst of it.\r\n                         \r\n          Geordie strokes Joey as the Doctor examines him.\r\n                         \r\n                          DOCTOR\r\n           It's probably tetanus. It's no good.\r\n                         \r\n                          GEORDIE\r\n           Please, sir -\r\n                         \r\n          The Doctor heads back into the hospital, dismissive.\r\n                         \r\n                          DOCTOR\r\n           I've all these men to take care of,\r\n           corporal, you can see that, can't\r\n           you?\r\n                         \r\n                          GEORDIE\r\n           Please, sir, this horse can pull\r\n           through anything.\r\n                         \r\n          The doctor absorbs his earnest appeal.\r\n                         \r\n          EXT. INTENSIVE CARE TENT. SAME.\r\n                         \r\n          Elsewhere, a line of soldiers waiting for medical assistance\r\n          are curious about what is going on. Blinded by gas, eyes\r\n          bandaged, one of them turns toward the commotion. It is\r\n          Albert.\r\n                         \r\n                          ALBERT\r\n           What is it?\r\n           98.\r\n                         \r\n                          AN ORDERLY\r\n           It's a horse they found, wandering about in\r\n           No Man's Land.\r\n           (easing him back onto a\r\n                          COT)\r\n           Down you go.\r\n                         \r\n                          ALBERT\r\n           What kind of an horse?\r\n                         \r\n                          AN ORDERLY\r\n           Bloody miraculous kind of an horse,\r\n           be my guess. Nothing makes it out\r\n           of No Man's Land.\r\n                         \r\n          Albert lies there, but can't let go of the thought:\r\n                         \r\n                          ALBERT\r\n           Miraculous horse...\r\n                         \r\n          EXT. HOSPITAL AREA. SAME.\r\n                         \r\n          Joey stands - breathing very deeply. The Doctor touches his\r\n          wounded leg.\r\n                         \r\n          The men from all over the medical area gather around Joey\r\n          concerned about their new hero's pain.\r\n                         \r\n          The doctor looks at the Geordie and frowns shaking his head\r\n          \"no.\"\r\n                         \r\n                          GEORDIE\r\n           (to the doctor:)\r\n           He was alive, y'see, sir, where\r\n           nothing survives, so to me and me\r\n           mates, to the men, sir, he's - Well,\r\n           we have high hopes for him -\r\n                          DOCTOR\r\n           You should shoot him now.\r\n                         \r\n          The Geordie is broken hearted.\r\n                         \r\n                          GEORDIE\r\n           Oh, but I can't.\r\n                         \r\n                          DOCTOR\r\n           It'd be a mercy, lad, that leg's not\r\n           going to mend.\r\n                         \r\n          The Doctor sadly addresses a nearby Sergeant.\r\n                         \r\n                          DOCTOR (CONT'D)\r\n           Sergeant. Put him out of his misery.\r\n           99.\r\n                         \r\n          The doctor nods his head towards Joey. The sergeant, SERGEANT\r\n          FRY, takes his gun from his holster, checks that it's loaded.\r\n          He turns to some nearby NURSES, urging them away.\r\n                         \r\n                          SERGEANT FRY\r\n           Ladies, if you please.\r\n                         \r\n          Total silence from the crowd who have gathered. They thought\r\n          they were there to see something wonderful. And now they find\r\n          that they've gathered for an execution - but can't take their\r\n          eyes off it. The Sergeant waves them back.\r\n                         \r\n           SERGEANT FRY (CONT'D)\r\n           All right, back off. Back off.\r\n                         \r\n          The Geordie is the last to step away from Joey. The sergeant\r\n          draws breath - before he steps forward to take aim. Joey is\r\n          totally still, sensing the atmosphere.\r\n          The sergeant cocks his pistol.\r\n                         \r\n          Suddenly there is a strange owl like whistle from fifty yards\r\n          away. Joey looks around startled.\r\n                         \r\n          The sergeant turns Joey's head back around, raises his pistol\r\n          once more.\r\n                         \r\n          Then, the whistle again. Even the doctor notices this time.\r\n                         \r\n          Joey turns. Slowly, the crowd parts - another owl whistle -\r\n          and we see Albert, his eyes bandaged - walking forward\r\n          blindly - guided by the hands of the crowd.\r\n                         \r\n          One soldier urges Albert gently.\r\n                         \r\n                          SOLDIER\r\n           Go on. Do it again.\r\n          One more whistle.\r\n                         \r\n                          ALBERT\r\n           Joey?\r\n                         \r\n          And this time, Joey trots over to Albert. The horse nuzzles\r\n          into him. Albert can't see Joey but he touches him.\r\n                         \r\n                          ALBERT (CONT'D)\r\n                          (SOFTLY:)\r\n           Hello, Joey. Hello boy. Where you\r\n           been then, hey? Where in the world\r\n           you been?\r\n                         \r\n          He strokes Joey's mane. Joey responds, becoming very still.\r\n          The Doctor approaches with the Geordie.\r\n           100.\r\n                         \r\n                          DOCTOR\r\n           (to the Geordie:)\r\n           Do you know this man?\r\n                         \r\n          The Geordie shakes his head, no. The Doctor speaks to Albert,\r\n          gently; clearly he thinks he's dealing with a traumatized,\r\n          possibly crazy soldier.\r\n                         \r\n                          DOCTOR (CONT'D)\r\n           What's your name?\r\n                         \r\n          Albert, realizing he's being addressed, turns to the doctor.\r\n                         \r\n                          ALBERT\r\n           Narracott, Private Albert Narracott,\r\n           sir.\r\n                         \r\n                          DOCTOR\r\n           This is a random horse, Narracott,\r\n           and too badly injured.\r\n           (to the orderly)\r\n           Is this man in your care?\r\n                         \r\n                          AN ORDERLY\r\n           Yes, sir.\r\n                         \r\n                          ALBERT\r\n           He's not random at all, sir! He's my\r\n           horse, I raised him, in Devon. Sir,\r\n           look at his legs! He's got four\r\n           white socks, he's brown all over -\r\n           (points to his own\r\n                          FOREHEAD)\r\n           - and he has a white mark here -\r\n           like so...\r\n                         \r\n          He makes the shape of a diamond with his hands. The doctor\r\n          turns to the orderly.\r\n                         \r\n                          DOCTOR\r\n           Take him back.\r\n                         \r\n                          AN ORDERLY\r\n           Come on, son.\r\n                         \r\n                          GEORDIE\r\n           Wait! You can't see `cause of the\r\n           mud.\r\n                         \r\n          The Geordie looks around, spots a bucket of water, grabs it\r\n          and uses a rag to clean Joey's legs, revealing the socks. The\r\n          Geordie looks at the doctor.\r\n           101.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           Four white socks!\r\n                         \r\n          The doctor takes a rag himself and wipes Joey's snout,\r\n          revealing the white diamond mark.\r\n                         \r\n          The Sergeant takes this in...and holsters his pistol.\r\n                         \r\n                          SERGEANT FRY\r\n           All right, break it up. Clear off,\r\n           the lot of ya.\r\n                         \r\n                          ALBERT\r\n           You see, sir? He's not random at\r\n           all.\r\n                         \r\n          The doctor steps up to him.\r\n                          DOCTOR\r\n           We will attend to your horse. Patch\r\n           him up best we can. Treat him like\r\n           the soldier he is.\r\n                         \r\n                          ALBERT\r\n           Thank you, sir.\r\n                         \r\n          With one last amazed look at Albert and Joey, the doctor\r\n          returns to the hospital area.\r\n                         \r\n          Moments later - Albert, the Geordie, and Sergeant Fry all\r\n          lead Joey through the snowy street together.\r\n                         \r\n          EXT. MESS HALL. EARLY MORNING.\r\n                         \r\n          Sergeant Fry strides into the middle of the throng of\r\n          soldiers.\r\n                          SERGEANT FRY\r\n           Gentlemen! Gentlemen! It falls on me to give\r\n           you some important news. At eleven o'clock\r\n           today, in two minutes time - the War will\r\n           come to an end.\r\n                         \r\n          Shock from the troops. Strangely muted. Not the explosion of\r\n          emotion you might have expected.\r\n                         \r\n          Albert enters, his eyes still red, but no longer bandaged.\r\n                         \r\n           SERGEANT FRY (CONT'D)\r\n           The King and Queen thank you for your\r\n           service. We have been victorious - even if\r\n           at a higher price than many of us might have\r\n           imagined.\r\n                          (MORE)\r\n           102.\r\n           SERGEANT FRY (CONT'D)\r\n           When the bells ring out - and they will in a\r\n           moment, for the first time for four years -\r\n           let us remember our brothers fallen in the\r\n           field. And thank God for the end of this\r\n           struggle and victory.\r\n                         \r\n          And, in the distance, the church bells ring.\r\n                         \r\n          INT. STABLES. THE SAME.\r\n                         \r\n          Joey stands tall, eating some hay, now healed.\r\n                         \r\n          INT. FIELD OFFICE. DAY.\r\n                         \r\n          Complete change of atmosphere. Silence. Tension. Albert\r\n          stands at attention with Sergeant Fry. A severe Major is\r\n          behind his desk.\r\n                          ALBERT\r\n           I don't understand, sir.\r\n                         \r\n                          MAJOR TOMPKINS\r\n           Officers' horses only. All other\r\n           horses are to be auctioned\r\n           immediately.\r\n                         \r\n                          SERGEANT FRY\r\n           That is a complete and bloody outrage. It's\r\n           the lad's horse, sir, from Devon. He raised\r\n           him up from a pup, he did. Trained him\r\n           right up to the day when the army came to\r\n           town.\r\n                         \r\n                          MAJOR TOMPKINS\r\n           These aren't my orders, sergeant.\r\n                          (TO ALBERT)\r\n           You'll have to take him to market. That's\r\n           all.\r\n                         \r\n          INT. STABLES, DAY.\r\n                         \r\n          Albert puts on a brave face as he collects Joey and leads him\r\n          out of the stables in silence.\r\n                         \r\n          EXT. THE STABLES, THE SAME.\r\n                         \r\n          As Albert comes out the men have gathered. There's a strange\r\n          sense of optimism, for such a gloomy moment. The Geordie\r\n          comes up to Albert and hands him a sheaf of pound notes.\r\n                         \r\n                          GEORDIE\r\n           We've all clubbed together. It's everything\r\n           we have. There's twenty-nine pounds there.\r\n           Buy him back.\r\n           103.\r\n                         \r\n                          ALBERT\r\n           Does the Major know?\r\n                         \r\n                          GEORDIE\r\n           The Major put in ten.\r\n                         \r\n          The Geordie flashes a sly wink.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           Mum's the word where the Major's\r\n           concerned. Your friend on the\r\n           crutches over there -\r\n                         \r\n          He turns to indicate David Lyons, who nods at Albert\r\n          solemnly.\r\n                         \r\n                          GEORDIE (CONT'D)\r\n           - even asked the Major to say that\r\n           Joey was his, an officer's horse, so\r\n           that he could go back with the\r\n           others.\r\n                         \r\n          Albert is amazed. He is about to show his gratitude when the\r\n          sergeant major shouts:\r\n                         \r\n                          SERGEANT FRY\r\n           Come on, Narracott! Get a move on. We don't\r\n           want to miss the show.\r\n                         \r\n          Albert snaps to attention and begins to lead Joey out of the\r\n          parade ground with the other horses.\r\n                         \r\n          As they walk off, the sergeant silently adds some of his own\r\n          money to the notes in Albert's hand.\r\n                         \r\n          EXT. MARKET PLACE. DAY.\r\n          The intense bustle of the market. Farmers are gathered,\r\n          bidding for horses.\r\n                         \r\n                          AUCTIONEER\r\n           Seven pounds! Seven pounds there!\r\n           Seven pounds! Eight pounds here!\r\n                         \r\n          A groom leads Joey to the auction pen with other horses.\r\n                         \r\n                          AUCTIONEER (CONT'D)\r\n           Eight pounds! Ten pounds here! Any\r\n           advance? Sold!\r\n                         \r\n          INT. AUCTION PEN. THE SAME.\r\n                         \r\n          Albert waits anxiously, the Geordie lad by his side, as Joey\r\n          is led into the pen.\r\n           104.\r\n                         \r\n                          GEORDIE\r\n           You're alright. Nobody's gonna bid more than\r\n           fifteen for a thoroughbred. They want work\r\n           horses.\r\n                         \r\n          The auctioneer starts the bidding on Joey.\r\n                         \r\n                          AUCTIONEER\r\n           Next one. We start at four pounds.\r\n           Four pounds.\r\n                         \r\n          The farmers seem disinterested, shaking of heads. The bidding\r\n          starts. Five pounds, six, seven, now it goes slowly, eight,\r\n          nine, ten. Albert looks pleased at how it's going. He feels\r\n          the cash in his hand. It seems to stick on ten, then a new\r\n          hand comes up at the back of the auction - it is a nasty\r\n          looking moustached man.\r\n                          THE BUTCHER\r\n           Eleven.\r\n                         \r\n          Sergeant Fry scowls.\r\n                         \r\n                          SERGEANT FRY\r\n           It's the butcher from Cambrai. He's\r\n           been bidding for the best all\r\n           morning.\r\n                         \r\n                          AUCTIONEER\r\n           Eleven. Eleven pounds. Eleven pounds.\r\n                         \r\n                          SERGEANT FRY\r\n           Let me handle this, private.\r\n           (he calls out) )\r\n           Fifteen, and let that be an end to it.\r\n                         \r\n          He looks daggers at the Butcher.\r\n                          AUCTIONEER\r\n           Fifteen pounds.\r\n                         \r\n                          BUTCHER\r\n           Sixteen.\r\n                         \r\n                          AUCTIONEER\r\n           Sixteen pounds.\r\n                         \r\n                          SERGEANT FRY\r\n           Seventeen.\r\n                         \r\n                          BUTCHER\r\n           Twenty of your English pounds. And let THAT\r\n           be the end of it, my friend.\r\n           105.\r\n                         \r\n                          AUCTIONEER\r\n           Twenty pounds.\r\n                         \r\n                          SERGEANT FRY\r\n           Twenty Five.\r\n                         \r\n                          AUCTIONEER\r\n           Twenty five pounds.\r\n                         \r\n                          BUTCHER\r\n           Twenty Six.\r\n                         \r\n                          AUCTIONEER\r\n           Twenty six pounds.\r\n                         \r\n          The men are all looking very worried... There's not much\r\n          left.\r\n                          SERGEANT FRY\r\n           Twenty seven.\r\n                         \r\n                          BUTCHER\r\n           Twenty eight.\r\n                         \r\n                          AUCTIONEER\r\n           Twenty eight pounds.\r\n                         \r\n                          SERGEANT FRY\r\n           Twenty nine.\r\n                         \r\n                          BUTCHER\r\n           And thirty.\r\n                         \r\n                          AUCTIONEER\r\n           Any advance at thirty pounds?\r\n                         \r\n          Then, from the back, another, new French voice...\r\n                          FINAL BIDDER\r\n           One hundred pounds.\r\n                         \r\n          He steps to the front of the crowd, and suddenly we see who\r\n          it is. It is Emilie's Grandfather.\r\n                         \r\n                          GRANDFATHER\r\n           And sir, if you bid against me, I will sell\r\n           the coat on my back and bid to one hundred\r\n           and ten. And if you bid against me again, I\r\n           will sell my farm and bid to a thousand.\r\n                         \r\n          Everyone looks at Albert who is devastated. Albert is\r\n          reeling. He hears the auctioneer repeat the final amount and\r\n          brings down his gavel.\r\n           106.\r\n                         \r\n                          AUCTIONEER\r\n           One hundred pounds. Going, going,\r\n           gone.\r\n                         \r\n          The soldiers slowly disperse, leaving Albert to stare at\r\n          Joey. It really is all over.\r\n                         \r\n          EXT. THE AUCTION. THE SAME.\r\n                         \r\n          The Grandfather finishes paying for Joey. Albert and the\r\n          Geordie stand in front of the grandfather.\r\n                         \r\n                          ALBERT\r\n           Sir, I'll give you all your money.\r\n           Everything you paid when we get back\r\n           to England. I'll give you twice -\r\n                         \r\n                          GRANDFATHER\r\n           You don't know anything about him.\r\n                         \r\n                          ALBERT\r\n           Oh, but you're wrong, sir, I know\r\n           everything!\r\n                         \r\n                          GRANDFATHER\r\n           Yes, you found him! I heard you\r\n           found a horse in the wire between\r\n           the armies -\r\n                         \r\n                          GEORDIE\r\n           No, I found him, he raised him -\r\n                         \r\n          The Grandfather goes to Joey and takes his reins.\r\n                         \r\n                          GRANDFATHER\r\n           When I heard about the miracle\r\n           horse, I traveled three days because\r\n           I knew whose horse it was. My\r\n           granddaughter's. She saved his life!\r\n           He was everything to her.\r\n                         \r\n          He pauses, briefly, to collect himself.\r\n                         \r\n                          GEORDIE\r\n           Where is your granddaughter?\r\n                         \r\n                          GRANDFATHER\r\n           The war has taken everything from\r\n           everyone. He is all that I have left\r\n           of her.\r\n                         \r\n          The Grandfather leads Joey away. Joey pulls, firmly but not\r\n          wildly, on the rein the grandfather's holding. The\r\n          grandfather lets go.\r\n           107.\r\n                         \r\n          He watches as Joey walks to Albert and nuzzles him. They have\r\n          a moment together. The Grandfather watches carefully.\r\n                         \r\n          Albert puts his face right near Joey - speaks gently.\r\n                         \r\n                          ALBERT\r\n           Don't be worried, boy, when I go. I\r\n           won't worry over you none. Hey, I\r\n           found you, didn't I, and you found\r\n           me.\r\n                         \r\n          Grandfather softens and begins to wonder about this soldier.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           And we'll both... we'll both know\r\n           that we made it through. Now go on.\r\n                         \r\n          He leads Joey back to the Grandfather.\r\n                          ALBERT (CONT'D)\r\n           We're the lucky ones. Always have\r\n           been. Lucky since the day I met you.\r\n                         \r\n          He quietly hands over the reins.\r\n                         \r\n                          ALBERT (CONT'D)\r\n           God be with you, sir.\r\n                         \r\n          The grandfather looks at Albert, then takes the regimental\r\n          pennant from his pocket:\r\n                         \r\n                          GRANDFATHER\r\n           Do you know what this is?\r\n                         \r\n          Albert's amazed.\r\n                         \r\n                          ALBERT\r\n           It's my father's. It's his\r\n           regimental pennant. How did you come\r\n           by this, sir?\r\n                         \r\n          Grandfather hands Albert the pennant.\r\n                         \r\n                          GRANDFATHER\r\n           You may have this.\r\n                         \r\n          Albert takes the pennant and looks at it, his eyes filling\r\n          with tears.\r\n                         \r\n                          ALBERT\r\n           Thank you ever so much for this,\r\n           sir...\r\n           108.\r\n                         \r\n                          GRANDFATHER\r\n           (with a sigh)\r\n           ... And this.\r\n                         \r\n          He hands Albert Joey's reins. Albert turns to face him,\r\n          almost mute with disbelief. He reaches for his money.\r\n                         \r\n                          GRANDFATHER (CONT'D)\r\n           No no, not necessary. He belongs to\r\n           you. That is, of course, what my\r\n           little girl would have wanted. And\r\n           she was the boss.\r\n                         \r\n          Grandfather laughs, then turns and slowly walks away.\r\n                         \r\n                          ALBERT\r\n           What was her name?\r\n                          GRANDFATHER\r\n           Emilie.\r\n           (turns back with a smile)\r\n           Her name is Emilie.\r\n                         \r\n          Albert gently embraces Joey.\r\n                         \r\n          EXT. FIELD. DEVON. DUSK.\r\n                         \r\n          Suddenly, we are back in the village in Devon, in the fold of\r\n          the valley. Dusk light. A figure approaches, silhouetted\r\n          against the setting sun.\r\n                         \r\n          Mrs. Naracott gathers the harvest, then notices as the figure\r\n          makes its way up the road to the farm.\r\n                         \r\n          A man in uniform. On a magnificent horse. Mrs. Narracott\r\n          meets them at the gate and we can finally see them clearly -\r\n          Albert and Joey.\r\n          Albert dismounts and removes his cap. An instant later, Mrs.\r\n          Narracott is hugging him for all that her life is worth.\r\n                         \r\n          EXT. ANOTHER PART OF THE FIELD. DEVON. THE SAME.\r\n                         \r\n          Ted sees them and makes his way to the field gate...shaky.\r\n          Albert approaches, and stops a slight distance away.\r\n                         \r\n          Ted opens the gate to stand before his son. Albert slips\r\n          something from his pocket and lets it unfurl in his hand -\r\n          Ted's campaign pennant.\r\n                         \r\n          Ted accepts it quietly, then offers his hand to Albert. They\r\n          shake, as men. And then slowly embrace, as father and son.\r\n           109.\r\n                         \r\n          Mrs. Narracott joins them as Joey looks on - a small family\r\n          and a beautiful horse, finally home.\r\n                         \r\n                          THE END\r\n\r\n\r\n\n\n\n\nWar Horse\nWriters :   Lee Hall  Richard Curtis\nGenres :   Drama  War\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "In 1912, a teenage boy named Albert Narracott (Jeremy Irvine) from Devon, England, witnesses the birth of a Bay Thoroughbred foal and subsequently watches with admiration the growth of the young horse. Much to the dismay of his mother Rose (Emily Watson), his father Ted (Peter Mullan) buys the colt at auction, despite their needing a more suitable plough horse for the farm work. Albert's best friend, Andrew Easton (Matt Milne), watches as Albert teaches his colt many things, such as to come when he imitates the call of an owl by blowing through his cupped hands.\nTed carries a war injury that causes him ongoing physical and mental pain. While he cannot speak of his time in the Cavalry, Rose shows Albert his father's medals from the Second Boer War that he earned for bravery under fire. She gives Albert his father's regimental pennant, telling Albert that his father felt shame over what he did during the war, and that he had thrown the flag and medals away, though Rose saved and kept them hidden. Albert does not understand why Ted would be ashamed of having fought in a war.\nAlbert trains Joey for the plough and Ted plants a field with turnips. However, a heavy downpour destroys the turnip crop, so Ted is compelled to sell the horse to the army in order to pay his rent. Albert begs his father to return the money. Captain James Nicholls (Tom Hiddleston) sees the boy's attachment and promises to look after the steed. Albert tries to enlist in the army but is too young, and before the captain leaves with Joey, Albert ties his father's pennant to Joey's bridle.\nJoey is trained for military operations and becomes attached to Topthorn, a black horse with whom he is trained for his military role. The two horses are deployed to Flanders with a flying column under the command of Nicholls and Major Jamie Stewart (Benedict Cumberbatch), but they lead a cavalry charge through a German encampment, and the unit is mown down by machine gun fire. Nicholls is killed along with almost all his fellow cavalrymen; the Germans capture the horses.\nOn the German side a 14-year-old Michael (Leonard Carow) convinces a superior that the two horses are fit to pull an ambulance wagon, and he and his brother Gunther (David Kross) drive the horses. Gunther gives the pennant to Michael as a good-luck \"charm\". The brothers desert on horseback, with Gunther riding Joey and Michael riding Topthorn. They hide in a windmill where they are discovered and shot as deserters.\nAn orphaned French girl named Emilie (Céline Buckens), who lives at the farm with her grandfather (Niels Arestrup), finds the two horses and takes care of them. German soldiers arrive and confiscate supplies from the property, even the jam that Emilie's grandfather makes, but Emilie hides the horses in her bedroom. Emilie suffers from a disease that makes her bones fragile and is not allowed to ride the horses for fear of falling. Nonetheless, Emilie's Grandfather, for her birthday, allows her to ride Joey. She gallops the horse up the hill and runs into the Germans who then take the horses, breaking Emilie's heart. The grandfather keeps the pennant.\nThe horses are put to work pulling German heavy artillery under the care of Private Friedrich (Nicolas Bro), who helps them survive this brutal work.\nBy 1918, Albert has enlisted and is fighting alongside Andrew in the Second Battle of the Somme, under the command of Lyons's son David (Robert Emms). After a British charge into no-man's land, Albert and Andrew miraculously make it across into a deserted German trench, where a gas bomb explodes, filling the trench with poison gas.\nTopthorn succumbs to exhaustion and dies. Friedrich is dragged away by other German soldiers, leaving Joey to face an oncoming tank. The horse escapes and runs into no-man's land, where he gets entangled in the barbed wire barriers. From their respective trenches, both British and German soldiers spot Joey in the night mist, and a British soldier named Colin (Toby Kebbell), waves a white flag and tries to free the horse. Peter (Hinnerk Schönemann), a German soldier, comes over with wire cutters, and together they free Joey from the wire. The two make friendly talk on the rather remorseful war. They flip a coin to decide who should take the horse; Colin wins and guides Joey back to the British trench, now having made friends with Peter.\nAndrew is killed by the gas attack, but Albert survives, temporarily blinded. While recuperating, he hears about the \"miraculous horse\" rescued from no-man's land. The army doctor (Liam Cunningham) instructs Sgt. Fry (Eddie Marsan) to put Joey down. But when Fry is about to shoot, Joey hears the owl call he learnt as a colt. Albert is led through the troops to Joey, again sounding his call, and Joey hurries to meet his long-missed friend. Albert explains that he raised Joey, and with bandages still covering his eyes, gives an exact description of the horse's markings, confirming his claim. With Joey covered in mud, the camp doctor at first dismisses Albert's statement, but he is astonished when soldiers wash away the grime, revealing the four white socks and diamond star on Joey's forehead.\nThe armistice that ends the war coincides with Albert's regaining his eyesight. When he learns that only officers' horses will be shipped home, he accepts funds from his fellow soldiers to purchase Joey at an auction, but finds himself losing a bidding war with a French butcher, reaching £30. Then a bid of £100 is entered. The bidder is an older gentleman, Emilie's grandfather, who informs the butcher that if he is bid against, he will sell his coat and bid to £110 – and should he bid against him again, he will sell his farm and bid to £1,000. No other bid is placed, and the grandfather takes ownership of Joey, planning to return with him to his farm. He tells Albert that Emilie has died, and after hearing about the miracle horse, he travelled for three days to get Joey back, for the sake of his beloved granddaughter's memory.\nAlbert pleads for the horse with Emilie's grandfather, who at first remains stoic. The old man is surprised, however, when the horse chooses to return to Albert, and he presents Albert with the military pennant, asking him what it is. Albert's quick recognition of the pennant convinces the grandfather that Joey is indeed his horse. He gives Joey back to Albert, saying that it's what Emilie would have wanted. Albert returns with Joey to his family's farm, where he returns the pennant to his father. The elder Narracott extends his hand to the boy, now a man and like him, a former soldier."}