{"title": "Wild Things", "full_text": "\"Wild Things\", production draft, revised by Kem Nunn\n\n\n\n   \n\n\n\n\n\n\n\n\n\n                             WILD THINGS\n\n\n                                 by\n\n                           Stephen Peters\n\n\n\n                             rewrite by\n\n                              Kem Nunn\n\n\n\n\n\n\n\n\n\n\n     MANDALAY ENTERTAINMENT                           January 21, 1997\n     1202 West Washington Blvd.\n     Culver City, CA 90232\n\n\n\n\n\n\n\n\n\n     FADE IN:\n\n     MAIN TITLE SEQUENCE -- BLACK\n\n     INTERCUT -- QUICK FLASH-FORWARDS\n\n     INSIDE A STEAMY SHOWER -- A wet naked woman and man wrapped\n     around each other in ecstasy -- legs, arms, hair, mouths.\n\n     BLACK -- MORE TITLES -- then\n\n     Moonlight reflects on a vehicle's shiny surface.  FISTS THUD into\n     flesh.  O.S. -- a man slams of the hood, rebounds away.\n\n     BLACK -- MORE TITLES -- then\n\n     LOVERS -- caught in FREEZE-FRAMES of green neon -- off, on, off,\n     on -- like a strobe's instant-images -- of gasping, tough sex.\n\n     BLACK -- MORE TITLES -- then\n\n     ON A GLEAMING POOL DECK of black-and-white tile -- two women in\n     soaked, clinging clothes -- fight -- hands squeeze a throat.\n\n     BLACK -- MORE TITLES -- then\n\n     A SCREAM -- a sickening hollow THWACK -- an arc of blood, two\n     teeth fall on dark stone.\n\n     BLACK -- MORE TITLES -- then\n\n     GUNSHOTS -- Blood sprays across the glass of a picture frame --\n     obscures the photo inside.\n\n     BLACK -- MORE TITLES -- then\n\n     THE SURFACE OF A SPARKLING SEA -- a distant emerald island.  A\n     40-foot sloop APPEARS -- shapes on deck -- we are about to SEE --\n\n     BLACK -- MORE TITLES -- then\n\n     SHARKS -- underwater -- rip something into a bloody cloud.\n\n     END MAIN TITLES.\n\n                                                 FADE TO:\n\n     EXT. BLUE BAY SCHOOL - DAY\n\n     A place of money and privilege.  White coral buildings surround\n     an open yard.  Tile roofs rise among banyan trees and banana\n     palms, shimmering before a blue blaze of sky.\n\n     Beyond the yard is the school's playing field and beyond that the\n     waters of Biscayne Bay, dappled in sunlight where the sloops of\n     the school's sailing class bob at their moorings.\n\n     For a moment all is quiet.  Then, faintly, the HUM of many\n     VOICES, rising and falling, LAUGHTER.\n\n     The CAMERA PANS to the open windows of a building somewhat larger\n     than the others.  The SOUNDS grow louder.\n\n     INT. BLUE BAY AUDITORIUM - DAY\n\n     A hundred high school kids sit before a raised, hardwood stage.\n     The students are not unlike the campus, radiant, well-tended -- a\n     veritable sea of adolescent sexuality -- bronze boys who seem to\n     have just come from the boats or tennis courts -- girls in tight\n     shorts riding high up shapely thighs, as...\n\n     SAM LOMBARDO strolls out onto the stage.  The man is thirtyish,\n     drop-dead handsome.  Dressed not that differently from the kids,\n     in an Izod polo shirt, khakis and boat shoes.\n\n     His entrance has an effect upon the audience, particularly upon\n     the girls.\n\n     KAREN and JANELLE, 16, pretty blondes, whisper then giggle.\n\n     NICOLE, a dark-eyed beauty, 17 but going on 25, watches Sam's\n     walk, then turns to the girl at her side...\n\n     KELLY VAN RYAN, 17, a fully-developed knockout.\n\n                                  NICOLE\n                  When we graduate the only thing I'm\n                  going to miss is...\n                         (with a nod to the stage)\n                  Know what I mean?\n\n     Kelly's eyes are locked on Sam.  Nicole has to nudge her.\n\n                                  NICOLE (CONT'D)\n                  Kelly?\n\n                                  KELLY\n                         (still staring)\n                  Oh yeah.\n\n     Sam is at the podium.  He looks out across the audience.  There\n     are a couple of flirtatious whistles, laughter.  Sam smiles,\n     silencing them with a wave of his hand.\n\n                                  SAM\n                  We've come to the halfway point in my\n                  senior seminars...\n\n     Cheers, applause.  Sam waits for the kids to settle.\n\n                                  SAM (CONT'D)\n                  Come on.  Beats study hall, doesn't it?\n\n                                  JIMMY (O.S.)\n                  No!\n\n     Boos as we FIND...\n\n     JIMMY LEACH, 18, grumge look, long hair.  He sits with a clique\n     of white trashy types, or at least what passes for such at Blue\n     Bay School.  Jimmy appears a bit more genuine, as does...\n\n     SUZlE TOLLER, a boyish brunette, seated nearby, but with just\n     enough space between her and everyone else to mark her as a\n     loner.  She studies Sam Lombardo with a dark, sullen stare.\n\n                                  SAM\n                  Thank you, Jimmy.\n\n                                  JIMMY\n                  Hey, man, at least in study hail I could\n                  meditate.\n\n                                  KIRK (O.S.)\n                  He means masturbate...\n\n     This remark is greeted by a chorus of laughter as we FIND...\n\n     KIRK, one of the golden boys, seated with Kelly and Nicole.\n\n                                  SAM\n                  Something Kirk with which I'm sure you\n                  have hands-on experience.\n\n     Loud laughter.  Sam quiets them again, then turns to the\n     blackboard, where he begins to write, in big letters -- S-E-X.\n     The kids start to cheer.\n\n     Sam writes another word -- C-R-I-M-E-S.\n\n     The cheering fades into silence.\n\n                                  SAM (CONT'D)\n                  We've all heard the words, date rape,\n                  sexual harassment.  We've talked about\n                  some of these things in this room.\n                         (beat)\n                  Our speakers today head up the Blue Bay\n                  Police Sex Crimes Unit -- Detectives Ray\n                  Duquette and Gloria Perez.\n                         (beat)\n                  They're here to give you what we hope\n                  will be a fresh perspective on these\n                  subjects, and to answer any questions\n                  you night have.\n\n     Sam turns to the wings, his hand out to welcome the visitors...\n\n     RAY DUQUETTE, mid-thirties, with the lanky build of a light\n     heavyweight, walks out onto the stage.  He's dressed in a dark\n     suit, dark hair combed straight back above steel-rimmed glasses.\n\n     GLORIA PEREZ walks at his side.  She's a good six inches shorter\n     than Ray, with a sweet face.  Attractive but no stunner.\n\n     About five kids applaud.  Ray takes the podium.\n\n                                  RAY\n                  Thank you for having us.  We'll each\n                  talk for ten or fifteen minutes, then\n                  open it up to your questions...\n\n     IN THE AUDIENCE\n\n     Suzie Toller suddenly gets to her feet.  As she passes behind\n     Jimmy, we HEAR her VOICE, beneath her breath.\n\n                                  SUZIE\n                  I'm not going to listen to this\n                  jack-off.\n\n     She marches down the aisle and bangs out the rear door..\n\n     Ray pauses, a dark look on his face, then goes on...\n\n                                  RAY\n                  Let's begin with a question.  What is a\n                  sex crime?\n\n     A moment.\n\n                                  JIMMY\n                  Not getting any.\n\n     This draws a few laughs from the kids, a couple of thin smiles\n     from Sam and Gloria.  And none at all from Ray Duquette.\n\n     EXT. AUDITORIUM - DAY\n\n     The kids change classes.  Sam, Ray and Gloria CROSS the grass.\n     The kids swarm past.  A pair of girls flash by.\n\n                                  CAROLE\n                  Have a nice weekend, Mr. Lombardo.\n\n                                  SAM\n\n                  Hey, Carole, you too.  And be good.\n\n                                  CAROLE\n                         (beneath a pouty look)\n                  I hate to be good.\n\n     The three adults ENTER an old wooden building.\n\n     INT. BUILDING - DAY\n\n                                  SAM\n                  This is one of the original buildings.\n                  We have the offices here now.\n\n     The walls are paneled in wood, decorated with framed photographs.\n     Gloria stops before one of the photos.\n\n     ANGLE ON PHOTOGRAPH\n\n     An old black-and-white, with that sepia caste harkening back to\n     another age.\n\n     A handsome young man of perhaps 14 stands at the helm of a boat\n     under sail.  His hair is swept back, his eyes fixed upon an\n     unseen horizon.  There is something in this boy's pose, in the\n     line of his jaw, in the clarity of his gaze, as if what he has\n     fixed upon is the future itself.\n\n                                  GLORIA\n                  Anybody in particular?\n\n     When no one answers, she turns to find Sam at her side.  He\n     stares at the picture, then looks at Gloria.\n\n                                  SAM\n                  Sam Lombardo.  The first.  Class of\n                  'Forty-Two\n                         (beat)\n                  My father.\n\n     Gloria does a slow double-take, looking from Sam to the photo and\n     back again.\n\n                                  VOICE (0.S.)\n                  Can't seem to get rid of the Lombardos\n                  around here.\n\n     Sam and the detectives turn as a professorial-looking guy in a\n     baggy brown suit (ART MADDOX) arrives on the scene.\n\n                                  SAM\n                  Art.  Say hello to Detectives Perez and\n                  Duquette.\n                         (to the cops)\n                  Art Maddox. A fellow guidance counselor.\n\n     Art and the detectives shake hands.\n\n                                  ART\n                  So, did you set 'em all straight on the\n                  ugly facts of life?\n\n                                  SAM\n                  I have the feeling, they got it down\n                  already.  They're a step ahead of us,\n                  Artie.\n\n     Gloria seems to find this amusing.  Ray stands at her side, looks\n     at Sam.  Sam feels it, makes eye contact with Ray -- a beat -- at\n     which point, Ray puts a hand on Gloria's back.\n\n                                  RAY\n                  I've got that two o'clock in town.\n\n                                  GLORIA\n                         (nodding)\n                  Back to the land of grownups.\n\n     The detectives shake hands once more with San and Art.\n\n                                  SAM\n                         (to Gloria)\n                  If old pictures interest you, come back\n                  some time, there's quite a collection\n                  down in the pagoda.  I'll see you get a\n                  proper tour.\n\n                                  GLORIA\n                         (smiling)\n                  I'd like that.\n\n     Ray opens a door for her.  The detectives pass through it.\n\n     Art claps Sam on the shoulder, then walks off down the hallway.\n     Sam remains near the doors, watching as...\n\n     ANGLE ON THE DRIVE LEADING TO THE SCHOOL\n\n     Ray and Gloria walk past half a dozen expensive cars -- Range\n     Rovers, Beamers and Mercedes, to a plain, white Ford Taurus,\n     which they get into and drive away.\n\n     EXT. BLUE BAY SCHOOL - LATER\n\n     Cheerleaders perform a sensual dance on the porch of a wooden\n     pagoda.  A rugby team runs drills on the grass, as out on the\n     bay, six tiny racing sloops tack toward the docks.\n\n     ANGLE ON DOCKS\n\n     As the sloops enter the narrow channel between the slips one\n     student from each boat jumps onto the dock where he or she sets\n     about tying off the boat.\n\n     Sam is on one of the boats.  Jimmy Leach is at the rudder.\n\n                                  SAM\n                         (loud enough to be heard\n                          by his class)\n                  Okay, you guys.  Good work.  Now coil\n                  those dock lines and I'll see you all on\n                  Monday.\n\n     He watches his class clamber up the docks.  His eye falls upon\n     the pagoda, the dancing cheerleaders -- Kelly Van Ryan in\n     work-out tights -- bare arms reaching for the sky.\n\n     EXT. SCHOOL DOCKS - SAM & JIMMY - LATER\n\n     hosing down boats, stowing sails.  They look up as...\n     A HUGE POWER BOAT glides past.  The docks rock in its wake.\n\n                                  JIMMY\n                  All right.  I could party on that.\n\n     Sam just laughs at him.\n\n                                  SAM\n                  That's about all it's good for.\n                         (beat)\n                  That's the one to have.\n\n     He points to a beautiful triple-masted schooner headed out of the\n     bay, under sail.\n\n                                  SAM\n                  The Windward Passage.  I crewed on that\n                  one summer.\n                         (beat)\n                  Long time ago.\n\n     He pulls his eyes from the boat, sets about coiling a line.\n\n                                  JIMMY\n                  You know, I want to thank you for\n                  getting me into this class...  No way was\n                  my old man going to spring for the\n                  fees...\n\n                                  SAM\n                  Hey, you're working for it.\n                         (beneath a laugh)\n                  Least you're supposed to be.\n\n     He tosses Jimmy the coiled line.  Jimmy's caught off-guard, but\n     catches it at the last second, then shares the laugh with Sam.\n\n                                  VOICE (O.S.)\n                  Can I play too?  Or is it just for boys?\n\n     Sam and Jimmy turn to find Kelly Van Ryan at the far end of the\n     dock.  She's fresh from cheerleader practice, in a white blouse\n     knotted at the bottom to REVEAL a flat, tanned stomach; open at\n     the top to REVEAL the swelling of her breasts.  She favors Sam\n     with a coy smile.\n\n                                  KELLY\n                  So who's washing your car this weekend,\n                  Mr. Lombardo?\n                         (off Sam's blank look)\n                  The senior car wash, remember?\n                         (beat)\n                  Tamara's making a schedule.  She said\n                  you bought a coupon but you're not on\n                  anybody's list.\n\n     Sam smiles, remembering.\n\n                                  SAM\n                  Well, you know.  Figured I'd buy a\n                  Washing ticket, support the effort.\n                  That old Jeep of mine's kind of a waste\n                  of time, don't you think?\n\n     Sam places the coiled hose on top of a locker then starts up the\n     dock, Jimmy at his side.  Kelly falls in with then.\n\n                                  KELLY\n                  Not at all.  How about if Nicole and I\n                  do it?  We're working as a team.\n\n     Sam just looks at her.  She looks back -- big, pleading eyes.\n\n                                  SAM\n                  Okay, try me on Sunday.  I'm going out\n                  to the Everglades on Saturday.  You guys\n                  can wash the mud off.\n\n                                  KELLY\n                  Deal.\n                         (beat)\n                  You know, I just looked out front.  My\n                  ride wasn't there.  You suppose you\n                  could give me one?\n\n     Sam doesn't answer right away.  He looks toward the school.\n\n                                  KELLY (CONT'D)\n                  You wouldn't want me to walk, would you?\n                  I mean like, something bad might happen.\n\n     Sam hesitates, momentarily at a loss, then turns to Jimmy, who\n     seems to regard Kelly with something akin to physical pain.\n\n                                  SAM\n                  What about you, Jimbo, you need a ride?\n\n                                  JIMMY\n                         (still looking at Kelly)\n                  What?\n\n                                  SAM\n                  A ride.  You want one?\n\n                                 JIMMY\n                  Yeah.  But I got my bike.\n\n     EXT. BLUE BAY SCHOOL - DAY\n\n     Sam's Jeep rolls out of the drive, Jimmy's bike in back, meaning\n     that Jimmy and Kelly are squeezed into the passenger seat, which\n     is fine with Jimmy.  Kelly's thigh is pressed against his.  His\n     arm pushes against her breast.  Kelly is not so happy.\n\n     As they near the school's entrance, they come upon a beat-to-shit\n     VW bug -- stalled at a stop sign.\n\n     A John Deere tractor mower sits nearby.  A groundsman -- a tall\n     black guy with a shaved head, waits at the wheel of the bug as...\n\n     Suzie Toller -- in black platform shoes, a T-shirt and cutoff\n     jeans, leans over the engine, fiddling with the car's linkage.\n\n     Sam pulls up next to the bug and stops.\n\n                                  SAM\n                  We got room for one more, Suzie.  You\n                  need a ride?\n\n     Kelly rolls her eyes as Suzie turns to look at them.\n\n                                  KELLY\n                  Jesus.  Where'd she get those shoes?\n                  Whores-4-Less?\n\n     Suzie's eyes go cold.  She signals the groundsman, who turns the\n     key.  The CAR SPLUTTERS to life.  Suzie flashes a smile, then\n     sticks out her tongue -- which has been pierced by a silver stud.\n\n                                  KELLY (CONT'D)\n                  That's cute.\n\n     Suzie gives her the finger.  Sam makes eye contact with Suzie,\n     offers a sad smile, while putting the Jeep in gear.\n\n                                  KELLY (CONT'D)\n                         (to Suzie)\n                  I hope you swallow it.\n\n     Jimmy turns, waving to Suzie as the Jeep pulls away.\n\n     EXT. UPSCALE NEIGHBORHOOD - DAY\n\n     Magnificent old mansions occupy five-acre bay-front parcels amid\n     lush, tropical settings.\n\n     Sam's Jeep stops before a pair of gates with the words \"VAN RYAN\"\n     woven into their wrought-iron design.  Beyond the gates a long\n     drive leads toward a huge stone house.  Kelly jumps out, punches\n     in a code.  The gates swing open.\n\n                                  KELLY\n                  Don't forget the car wash.\n\n                                  SAM\n                  I won't.\n\n     SANDRA VAN RYAN, Kelly's mom, big, sexy, aggressive, a young 42\n     in a string bikini, comes out from the side of the house.  When\n     she sees the Jeep, she starts down the drive.\n\n     Kelly waves to Sam, then walks up the drive.  When she sees her\n     mother coming toward her, her face hardens.\n\n                                  SANDRA\n                  Is that Sam Lombardo?\n\n                                  KELLY\n                         (sarcastic)\n                  Hi, Mon.\n\n                                  SANDRA\n                  Sam!  Hi!\n\n     Sam has already hung a U.\n\n     Sandra comes through the gate and up to the Jeep.\n\n     Jimmy is checking her out.  All eyes.\n\n                                  SANDRA (CONT'D)\n                         (to Sam; as if Jimmy\n                          wasn't even there)\n                  What?  You're going to drive off without\n                  even saying hi?\n\n                                  SAM\n                  Hi, Sandy.\n\n                                  SANDRA\n                  Why don't you come in, have a drink?\n\n                                  SAM\n                  Can't.  Got a passenger.\n\n     Sandra looks down her nose at Jimmy.\n\n                                  SANDRA\n                  He can wait.\n\n     Sam glances past her, to Kelly, who stands languidly at the front\n     of the house, watching.\n\n                                  SAM\n                  I can't, Sandy.  I've got to run.\n\n                                  SANDRA\n                  I'll bet.\n                         (then, softening)\n                  Look, Sam.  Why don't you come by this\n                  weekend.  We'll take the boat out...\n\n                                  SAM\n                         (cutting her off)\n                  Sorry, Sandy.  I've got plans.\n\n                                  SANDRA\n                  What?  Running over alligators with that\n                  silly swamp jalopy when you could be\n                  sailing a real boat...\n\n                                  SAM\n                  Swamp's where it's at, Sandy.  Gives you\n                  a look into the muck we all crawled out\n                  of.  You ought to try it some time.\n\n     Sandra gives him a hard stare, then marches off toward the house.\n\n     CLOSE ON KELLY\n\n     still at the door, a cold smile on her face.\n\n                                                 FADE TO:\n\n     EXT. SUBURBAN CUL-DE-SAC - DAY\n\n     Neat little stucco houses -- some not so neat -- simmer in\n     tropical heat.\n\n     A BMW Z-3 Roadster stops at the head of the cul-de-sac.  Nicole\n     is driving.  Kelly sits beside her.\n\n                                  NICOLE\n                  This is it?\n\n     Kelly looks at a pad of paper, nods.\n\n                                  KELLY\n                  Four-thirty-seven.\n\n     They pass a couple of teenagers playing basketball in a driveway,\n     a guy mowing his yard.\n\n                                  NICOLE\n                  Nice.\n\n                                  KELLY\n                  What do you want, he's a teacher for\n                  Christ's sake.\n                         (beat)\n                  It's here.  Pull over.\n\n     Nicole does, before one of the not-so-neat houses.  Sam's muddy\n     Jeep Wrangler is parked in the drive.  Behind that is a red\n     Mercedes convertible.\n\n     INT. SAM'S HOUSE - BEDROOM - SAME\n\n     Sam and BARBARA, 28, a lean, beautiful country-clubber roll on\n     the bed.  Barbara is dressed for tennis.  Sam wears a baggy pair\n     of khaki shorts.  Barbara struggles to escape.  Sam grabs a leg,\n     kisses the back of her knee.\n\n     He pushes up the little white skirt, kissing her between her\n     thighs.\n\n                                  BARBARA\n                         (getting just a little\n                          breathless)\n                  Sam, come on... I'm gonna be late for my\n                  game...\n\n     Sam keeps at it.  She's starting to weaken.\n\n                                  BARBARA (CONT'D)\n                  Not that I'm going to be much good after\n                  last night...\n\n                                  SAM\n                  Eat a power bar.\n\n     Barbara starts to giggle.  He's just about got her when...\n\n     The DOORBELL RINGS.  Sam lets go.  Barbara sighs.\n\n     INT. LIVING ROOM - SAME\n\n     Sam goes to the front door, opens it, to find...\n\n     Kelly and Nicole, holding plastic pails full of rags.  The girls\n     are dressed in Blue Bay High T-shirts, cropped to REVEAL flat\n     tummies, shorts and running shoes.\n\n                                  GIRLS\n                  Hi, Mr. Lombardo.\n\n     Sam looks over the girls -- a small, exasperated smile.\n\n                                  KELLY\n                  Look, he forgot.  I knew it.\n\n                                  SAM\n                  No I didn't.  Check out the Jeep.  It's\n                  nice and dirty for you.\n                         (beat)\n                  But you might want to wait a minute.\n                  The Mercedes is leaving.\n\n                                  NICOLE\n                  You mean that isn't yours too?\n\n     The girls giggle.  Sam smiles.\n\n                                  KELLY\n                  Where's the hose?  We can set up.\n\n                                  SAM\n                  In back of the garage.\n\n     As they walk away, he is joined by Barbara.  She watches the\n     girls with an appraising eye.\n\n                                  BARBARA\n                  Is that Sandra Van Ryan's kid?\n\n                                  SAM\n                  Kelly.\n\n                                  BARBARA\n                  She's going to wash your Jeep?\n\n                                  SAM\n                  Senior class fund-raising gig.  I told\n                  'em they could hose down the Jeep.\n                         (off Barbara's look)\n                  Hey, come on.  It's for a good cause.\n\n     Barbara laughs at him.\n\n                                  BARBARA\n                  Sam the philanthropist.\n                         (a beat)\n                  Tomorrow, right?\n\n     Sam nods.  Another kiss.\n\n     EXT. SAM'S DRIVEWAY - SAME\n\n     As Barbara goes to her car she sees the girls coming from behind\n     the garage.  She looks at Sam, standing in his doorway, watching\n     the girls.  When he sees Barbara looking at him, he shrugs, then\n     waves.\n\n     EXT. FRONT DOOR - SAM'S HOUSE - LATER\n\n     Kelly and Nicole, looking very much like the finalists in a wet\n     T-shirt derby, ring the bell.\n\n     Sam answers.  He looks them over.  A couple of houses down he can\n     see the guy with the mower, dumping grass into a can, watching\n     the girls, then turning to walk back to his house.\n\n                                  SAM\n                  So, where you off to now?\n\n                                  KELLY\n                  Aren't  you forgetting something?\n                          (off Sam's look)\n                  Your coupon.  We gotta have it.\n\n                                  SAM\n                  Jeez, that thing... Can't you...\n\n                                  KELLY\n                         (smiling)\n                  Rules are rules, Mr. Lombardo.\n\n     Nicole laughs.\n\n                                  SAM\n                  All right.  I'll have to look for it.\n\n                                  KELLY\n                         (as he starts to go)\n                  Mr. Lombardo.\n                         (as he stops)\n                  We're running kind of late.  How about\n                  if Nicole goes on to the Mansons?  You\n                  could give me a ride when you find the\n                  ticket.\n\n     Sam looks at her, as does Nicole.\n\n                                  SAM\n                  Give me a minute.\n\n     He hurries from the room.  Kelly turns to Nicole, giving her the\n     eye, pointing toward the drive.\n\n                                  NICOLE\n                         (mouthing the words)\n                  Are you sure?\n\n     Kelly nods, a mischievous smile on her face.\n\n     INT. SAM'S BEDROOM - SAME\n\n     Sam is rummaging through drawers.  He stops when he hears the\n     SOUND of a CAR.  He goes to the window in time to see Nicole's\n     BMW headed down his street.\n\n     INT. SAM'S LIVING ROOM - SAME\n\n     Sam ENTERS the room to find Kelly just inside the doorway, where\n     the water from her wet clothing has formed little pools on the\n     linoleum.\n\n     Sam looks at the water.  He looks at Kelly.  She moves a step\n     closer, allowing the door to SWING shut behind her.\n\n     EXT. SAM'S NEIGHBORHOOD\n\n     A long, slow, Antonioni PAN -- time passes -- the cul-de-sac --\n     the sparkling lawns -- the kids with the basketball -- a jogger\n     passing by...\n\n                                                 DISSOLVE TO:\n\n     EXT. SAM'S PORCH - LATER\n\n     The front door.  The door opens.  Kelly comes out, fast, slamming\n     the door behind her.  She walks down the drive.\n\n     There are tears on her face.  As she hits the street, she begins\n     to run.\n\n     The man with the mower is now seated on his parch, drinking beer.\n     He watches as the girl runs by.\n\n     The teenagers are still playing hoops.  They stop as Kelly jogs\n     past, sobbing.  They watch as she hits the end of the cul-de-sac\n     and DISAPPEARS around a corner.\n\n     EXT. THE EVERGLADES - DAY\n\n     Sam, perched in the pilot's seat of a beat-to-shit old air boat,\n     rips through the Florida swamp land.\n\n     He glides across channels of water, then turns into the tall\n     grass which whips at the hull of his boat.  Bits and pieces of\n     debris fly through the air.  Sam smiles, swinging the boat\n     through a series of wide, sliding turns.\n\n     Suddenly he spots something.  He throttles down gliding into a\n     shallow pool where... A HUGE ALLIGATOR, aware it has been found\n     out, whips about, stirring up mud, then scuttling OUT OF SIGHT\n\n                                  SAM\n                  Sly old fucker.  How you got so big,\n                  wasn't it?\n\n     Sam sits for a moment in the silence.  He pulls a pair of\n     binoculars from beneath his seat and looks through them.\n\n     ANGLE ON HORIZON\n\n     All we SEE is a shabby collection of whitewashed buildings\n     shimmering in the last long light of afternoon.\n\n     Sam watches for some time.  At last he lowers the binoculars,\n     revs up his engine and leaves.\n\n     ANGLE ON SAM'S BOAT\n\n     as it moves away, as SEEN from water level where...\n\n     The old gator has risen once more -- just the eyes -- a cold\n     primordial intelligence, gazing out, unblinking across the murky\n     waters of the swamp.\n\n     EXT. SAM'S HOUSE - NIGHT\n\n     Sam's Wrangler pulls in next to Barbara's Mercedes.  The Jeep is\n     muddy once more.  So is Sam.  He gets out.\n\n     INT. SAM'S HOUSE - SAME\n\n     Sam ENTERS.  The house is dark.\n\n                                   SAM\n                  Barbara?\n\n     Nothing.  Me CROSSES the living room and starts down the hallway,\n     where a faint light issues from beneath the bedroom door.\n\n     INT. BEDROOM - SAME\n\n     Sam opens the door.  He hears the SOUND of RUNNING WATER.  He\n     walks across the room and into the bathroom.\n\n     INT. BATHROOM - SAME\n\n     Clouded mirrors, a shower stall full of. steam.  Behind the glass\n     door we SEE an indistinct shape, moving about in the hot water.\n     Sam opens the shower door.  The steam clears to REVEAL Barbara's\n     gorgeous athletic body.\n\n                                  BARBARA\n                  It's hot in here, just the way you like\n                  it.\n\n     She grabs his shirt, pulling him into the shower's flow.  They\n     kiss.  She pulls his shirt open, loosens his pants.  His clothes\n     fall away.  Sam pushes her up against the tile wall, hard.  She\n     holds to his shoulders, nails sinking into his flesh, wrapping\n     her legs around his hips as...\n\n     The water, dark with swamp mud, spirals down the drain.\n\n     EXT. VAN RYAN ESTATE - NIGHT\n\n     Kelly Van Ryan sits on the dock, looking back toward the huge\n     stone house, where...\n\n     A YELLOW LIGHT burns in one of the upstairs windows.\n\n     Kelly has a shotgun laid across her knees.  Slowly, she raises\n     the gun, pointing at the yellow window.\n\n     She holds it there for some time, then, softly, to herself...\n\n                                  KELLY\n                  Bang...\n\n     INT. MASTER BEDROOM - VAN RYAN ESTATE - NEXT DAY\n\n     Sunlight streams through open windows, mingling with loud sighs\n     of pleasure... Sandra Van Ryan on top of FRANKIE CONDO, a big,\n     buffed-out Cuban.  They're making love on the bed.  She throws\n     her head back -- an explosion of hair -- gasps -- an orgasm is\n     near, as...\n\n     A cordless PHONE RINGS on the night table.  They try to ignore\n     it.  No dice.  Sandra groans, finally pulling away.\n\n                                  SANDRA\n                  Goddamnit!\n                         (she answers)\n                  Hello.\n\n                                  COMPUTER VOICE (V.O.)\n                  Hello, this is the attendance office at\n                  Blue Bay School.  Your son or daughter\n                  is absent today, Monday...\n\n                                  SANDRA\n                  Jesus H. Christ!\n\n     She hangs up hard.  Sits on the edge of the bed.\n\n                                  FRANKIE\n                  What?\n\n     Sandra waves him off.  She pulls on a T-shirt, then grabs up the\n     phone once more, punching in a number.\n\n     INT. SAM'S OFFICE - BLUE BAY SCHOOL - DAY\n\n     Desk, files, a terrarium full of swamp lizards, above which a\n     photo of the Windward Passage decorates the wall.  There's a\n     Waterford bowl on the desk -- etched with \"Sam Lombardo -- Blue\n     Bay Educator of the Year.\"\n\n     Sam is working on the computer.  The PHONE RINGS.  He answers.\n\n                                  SAM\n                  Counseling.\n\n     XNTERCUT - SANDRA/SAM PHONE CONVERSATION\n\n     Sandra seated on the bed, one long leg tucked beneath her.\n\n                                  SANDRA\n                  Sam, Sandy Van Ryan.\n\n     Frankie's eyes go cold when he hears the word \"Sam.\"\n\n     In his office, Sam pushes himself away from the computer,\n     stiffening noticeably.\n\n                                  SAM\n                  Sandy... What's up?\n\n                                  SANDRA\n                  Listen, Kelly skipped school.  Have you\n                  talked to her?\n\n                                  SAM\n                  No.\n\n                                  SANDRA\n                  Shit. Here we go again.\n\n                                  SAM\n                  Didn't you see her this morning?\n\n                                  SANDRA\n                  To tell you the truth, I haven't seen\n                  her since Friday.\n\n     BOOM -- A SHOTGUN BLASTS outside Sandra's window.  She jumps.\n     BOOM, BOOM -- more BLASTS.  She jumps up to look outside.\n\n     SANDRA'S POV - KELLY\n\n     stands at the edge of the bay, launching skeet then blasting them\n     high above the water.\n\n     BACK TO SCENE\n\n                                  SANDRA (CONT'D)\n                  Never mind.  I found her.\n                         (a long beat)\n                  Listen, Sam.  It was good seeing you the\n                  other day.\n                         (beat)\n                  I haven't found anyone else can handle\n                  the Jonathan like you can.\n\n     She glances at Frankie -- who has heard enough.  He gives her a\n     long hard look, then rolls from the bed to walk from the room.\n\n     Sam remains silent, watching the lizards with their blank,\n     unblinking eyes.\n\n                                  SANDRA (CONT'D)\n                  Look.  I know you're seeing Barbara\n                  Baxter.  So what?\n\n                                  SAM\n                  So maybe I'm a one-woman man.\n\n     Sandra laughs.\n\n                                  SANDRA\n                  Right.\n                         (beat)\n                  You really think you're gonna get one of\n                  these Blue Bay women to marry you?\n\n     Sandra pauses to laugh once more.\n\n                                  SANDRA (CONT'D)\n                  Grab a clue, Sam.  You're a hired hand\n                  around here.  Enjoy it while it lasts.\n\n                                  SAM\n                  Goodbye, Sandra.\n\n     Sam puts down the phone, looks at it -- a long moment as -- the\n     barest hint of a smile plays upon his face.\n\n     Sandra slams down her phone.  She looks to the bay, to the sleek\n     racing sloop floating beyond the private dock.\n\n                                  SANDRA\n                  The nerve of some people.\n\n     EXT. VAN RYAN ESTATE - DAY\n\n     The SHOTGUN BLASTS away.  Kelly pauses to reload.  She catches\n     sight of...\n\n     Sandra, approaching from the main house.\n\n                                  SANDRA\n                  You seem to find guns therapeutic.\n                  Maybe I oughta try it.\n\n     Kelly lets the gun's barrel drift over Sandra, then turns to walk\n     away.  She moves toward the guest house.  A used-brick cottage\n     tucked among the gnarled branches and roots of a huge banyan\n     tree.  Sandra follows.\n\n                                  SANDRA (CONT'D)\n                  Let me guess, some boy didn't call and\n                  screwed up the weekend.  So you're\n                  taking the day off.\n\n     Kelly looks toward the main house, in time to see...\n\n     Frankie walk from the bedroom and dive into the pool.\n\n                                  KELLY\n                  Which one of your \"bodyguards\" is that?\n\n                                  SANDRA\n                  Whichever one I want.\n\n     Kelly turns away, starts for the guest house once more.\n\n     INT. GUEST HOUSE - DAY\n\n     PAN to REVEAL room -- the gun case, the animal trophies, the\n     photos -- One of a stately old gentleman in an elaborate wicker\n     chair, a cane at his side, a bowler on his knee.  Others of Kelly\n     and a handsome middle-aged man in safari gear, posing with their\n     rifles above slain wildebeests and bison.\n\n     Sandra and Kelly ENTER.  Kelly puts down the shotgun, turns,\n     tears in her eyes.\n\n                                  SANDRA\n                  Okay, what's the matter?\n\n                                  KELLY\n                  You notice my new jumper?\n\n     Kelly does a three-sixty, like a model on a runway.\n\n                                  KELLY (CONT'D)\n                  My friends buy me clothes, so I don't\n                  look like trash.\n\n                                  SANDRA\n                  I would hardly say you look like trash.\n\n                                  KELLY\n                  No thanks to you.\n\n     She sits on the bed.  Sandra moves to stand over her, angry now.\n\n                                  SANDRA\n                  Come off of it.\n                         (a beat)\n                  You run with all these little trust fund\n                  brats... They think money grows on\n                  trees.  It doesn't.  Believe me.  And a\n                  lot of your little friends are gonna\n                  learn that one the hard way.\n                         (beat)\n                  I'm trying to spare you that.\n\n     Kelly goes to one shoulder on the bed, sobbing now.  Her mother\n     continues to stand over her, suddenly more perplexed than angry.\n\n                                  SANDRA (CONT'D)\n                  Kelly.  What is it?\n\n                                  KELLY\n                  I miss Dad.\n\n                                  SANDRA\n                  Jesus.\n                         (a long beat)\n                  Well, I do too, sometimes...\n\n                                  KELLY\n                  No you don't.\n\n                                  SANDRA\n                  He didn't have to kill himself, Kelly.\n                  He could have gone out and gotten a job.\n                  Christ, he could've found another rich\n                  woman... He never had a problem tucking\n                  my friends when we were married.\n\n     She pauses as Kelly cries all the harder.\n\n                                  SANDRA (CONT'D)\n                  I don't know why he did it.  I really\n                  don't...\n\n     Her voice trails away, as meanwhile Kelly has drawn herself up\n     into a fetal position on the bed.  The sobbing has stopped but\n     her shoulders continue to shake.  Sandra sits on the edge of the\n     bed, reaches over to rub Kelly's back.\n\n                                  SANDRA (CONT'D)\n                  Can I get you anything?\n\n     Kelly shakes her head, no.\n\n     Her mother looks at her, clearly at a loss.  At last she stands.\n     She is headed out of the room when Kelly says something, but the\n     words are indistinct, as her fists are pressed against her mouth.\n\n                                  SANDRA\n                  What, honey?  I can't hear you.\n\n     There is a long beat as Kelly collects herself.  She stares at\n     the wall, her eyes filled with tears, but when she speaks she\n     enunciates each word.\n\n                                  KELLY\n                  I said.  I was raped.\n\n     Sandra looks as if she has been struck.\n\n                                  SANDRA\n                  What?\n\n                                  KELLY\n                  I was raped.\n                         (a long beat)\n                  By Sam Lombardo.\n\n     Sandra moves over to the bed, sits once more.\n\n                                  SANDRA\n                  He... Sam Lombardo?\n\n                                  KELLY\n                  Yes.  God, Mom...\n\n     Kelly begins to cry.  Sandra pulls her upright, cradling her in\n     her arms, eyes on fire.\n\n     EXT. BLUE BAY POLICE STATION - DAY\n\n     An old Spanish-style building sits before a neat square of grass.\n\n                                  SANDRA (V.O.)\n                  My daughter does not get raped in Blue\n                  Bay!\n\n     INT. STATION HOUSE - INTERVIEW ROOM - DAY\n\n     Sandra slams a fist on the conference table.\n\n     Kelly is seated between her mother and her mother's attorney, TOM\n     BAXTER.  Baxter sports an Italian suit and a lethal Alexander\n     Haig look.\n\n     Seated across from these three are Ray, Gloria and BRYCE HUNTER,\n     the local D.A.\n\n     Silence follows Sandra's outburst.  Baxter reaches to squeeze\n     Sandra's shoulder.  Kelly puts her face in her hands.\n\n                                  RAY\n                         (in a quiet voice)\n                  You're saying that Kelly was raped by\n                  Sam Lombardo.\n\n                                  SANDRA\n                  That's right.\n\n     Ray and Gloria exchange looks.  Gloria in particular looks\n     slightly stunned.\n\n                                  GLORIA\n                  The guidance counselor at Blue Bay?\n\n                                  SANDRA\n                         (sarcastically)\n                  The guidance counselor at Blue Bay.\n\n                                  GLORIA\n                  We understand your feelings, Ms. Van\n                  Ryan.  But please, we'd like some time\n                  with Kelly.  We'd like to take her\n                  statement alone.\n\n     Baxter nods, yes.  Sandra looks at Kelly.\n\n                                  SANDRA\n                  Are you okay for this?\n\n     Kelly nods.\n\n                                  SANDRA (CONT'D)\n                  The man must be insane to think he can\n                  do this to me...\n\n     Tom Baxter takes her by the arm as Ray CROSSES the room to open\n     the door.  Bryce Hunter walks out with then.\n\n     Gloria takes a seat closer to Kelly.  When she speaks, she is\n     very calm and quiet.\n\n                                  GLORIA\n                  How are you, Kelly? Would you like to\n                  take a break for a minute?\n\n                                  KELLY\n                         (shaking her head)\n                  I just want to get it over with.  My\n                  mom's making me do this. I just want to\n                  forget it.\n\n                                  GLORIA\n                  I know you do.\n\n     She waits as Ray sets up a camera on a tripod.\n\n                                  GLORIA (CCNT'D)\n                  We'd like to videotape the statement if\n                  that's all right with you.\n\n     Kelly shrugs.\n\n                                  GLORIA (CONT'D)\n                  I know this is not pleasant, Kelly.  But\n                  these are serious charges and we need to\n                  know everything that happened between\n                  you and Mr. Lombardo.\n                         (beat)\n                  Are you ready?\n\n     Kelly nods.\n\n     CLOSE ON VIDEO MONITOR - KELLY'S STATEMENT\n\n                                  KELLY\n                  He started rubbing my shoulders.  Said\n                  must be sore after washing cars.  I...\n                  let him  I mean he's a nice guy.\n                         (beat)\n                  I don't know... It was so fast.  I\n                  closed my eyes.  I remember his hands\n                  moved to my breasts.  I mean just for a\n                  second it was nice... I forgot whore I\n                  was.  I mean he's so gorgeous...\n\n     PULL BACK to REVEAL...\n\n     INT. STATION HOUSE - DAY\n\n     Ray, Gloria and Bryce Hunter stand at one end of the long\n     conference table, watching the playback of Kelly's tape.\n\n     BACK TO VIDEOTAPE\n\n                                  KELLY\n                  The next thing... his hand was in my\n                  shorts... you know, from behind.  His\n                  fingers... his fingers...\n\n                                  GLORIA (O.S.)\n                  Take your time.\n\n                                  KELLY\n                  They were in me.  Both places... you\n                  know.\n\n                                  GLORIA (O.S.)\n                  I understand.\n\n                                  KELLY\n                  He said something like, \"Do you want it\n                  dirty7\" or something.\n                         (beat)\n                  I tried to turn away, but he pushed me\n                  to the floor.\n\n                                  GLORIA (O.S.)\n                  Was there penetration?  Did he put\n                  himself inside you?\n\n                                  KELLY\n                  Yes.  I said stop.  I screamed.  I mean\n                  that's how it sounded in my head.  He\n                  hurt me...\n\n                                  GLORIA (O.S.)\n                         (as Kelly breaks into\n                          tears)\n                  That's okay, Kelly.  You're doing fine.\n                         (beat)\n                  But I have to ask you something here.\n                  When you say it hurt.  Was this the\n                  first time a man was inside you?\n\n                                  KELLY\n                  No.  I've done it a couple of times, I\n                  mean with guys I dated.  But this\n                  hurt... like, he was built... you\n                  know...\n\n                                  GLORIA (O.S.)\n                  He was large?\n\n\n     Kelly nods, starts to break down again, then holds it off.\n\n                                  GLORIA (O.S., CONT'D)\n                  Did you try to fight him?\n\n                                  KELLY\n                  I... he had my wrists pinned behind me.\n                  I remember my hands were cold.'\n\n                                  GLORIA (O.S.)\n                  Then what?\n\n                                  KELLY\n                  He kept saying, \"Let it happen, let it\n                  happen.\"  Then he just stopped.\n\n                                  GLORIA (O.S.)\n                  You mean he withdrew...\n\n                                  KELLY\n                  Not at first.  He was still inside but\n                  he wasn't moving or anything...  He said\n                  we had this secret.  And that now he'd\n                  be able to help me... because we were\n                  close... Something like that.  I don't\n                  know.  It's hard to remember, exactly.\n\n                                  GLORIA (O.S.)\n                  Try, Kelly.\n\n                                  KELLY\n                  I know one thing he said.  It was\n                  when... when he took himself out and was\n                  standing up.\n                         (beat)\n                  He said, \"Don't worry, I didn't come.\"\n                  I can't forget that.  He said, \"No\n                  little girl can ever make me come.\"\n\n     The tape is paused -- FREEZES on Kelly's face ON SCREEN.\n\n     BACK TO RAY, GLORIA & HUNTER\n\n                                  HUNTER\n                  \"No little girl can ever make me come.\"\n                  Jesus.  Too bad.  We might have some\n                  physical evidence.\n\n     Ray and Gloria stare at the screen.\n\n                                  GLORIA\n                  I don't know.  It feels wrong.\n\n     Ray and Hunter look at her.\n\n                                  HUNTER\n                  Why?\n\n                                  GLORIA\n                  I think she's acting.  I think she set\n                  it up to be alone with him because she\n                  wanted him to come on to her.\n                         (beat)\n                  I think maybe she's upset that he\n                  didn't...\n\n                                  RAY\n                  Or maybe she thought that was what she\n                  wanted and she got a little more than\n                  she bargained for...\n\n                                  HUNTER\n                  The line I get on this guy, is that he's\n                  done half the women in Blue Bay.\n\n                                  GLORIA\n                  That doesn't make him a child rapist.\n                         (beat)\n                  There's something else.  This girl's had\n                  some problems.  Wrecked a couple of her\n                  mom's cars.  Ran away...\n\n                                  HUNTER\n                  Where's this coming from?\n\n                                  GLORIA\n                  I worked Juvenile in Dade County for\n                  three years.  We had a missing persons\n                  on Kelly Van Ryan for two weeks... Maybe\n                  a year ago... The family kept it out of\n                  the papers.\n\n                                  RAY\n                  That would make it about the time of her\n                  old man's suicide.  You don't think that\n                  could explain some erratic behavior?\n\n                                  GLORIA\n                  All I'm saying is, I think we should go\n                  slow here.\n\n     Hunter puts his hands together, thinking.  He looks from Ray to\n     Gloria, than back to Ray.\n\n                                  HUNTER\n                  I want a full-scale investigation.\n\n                                  GLORIA\n                  You know what that will mean for\n                  Lombardo.\n\n                                  HUNTER\n                  I don't care.  You heard that girl's\n                  statement.  I think he's dirty.  Get me\n                  a case.\n\n     Gloria and Ray watch as Hunter gets up and leaves the room.\n\n                                  GLORIA\n                  Well you were a big help.  You know\n                  what's going to happen if we go\n                  full-bore on this.\n\n     Ray looks at the screen.\n\n                                  RAY\n                  It's our job, Gloria.\n\n                                  GLORIA\n                  Hunter's making it our job because\n                  Sandra Van Ryan's got a bug up his ass.\n                  You know that as well as I do.\n                         (beat)\n                  We're gonna trash this guy's life and I\n                  keep asking myself if it's really\n                  necessary.\n\n     Ray thinks this over.  He continues to study the screen.\n\n     CLOSE ON SCREEN - KELLY'S FACE\n\n                                  RAY (0.S.)\n                  Yeah, well, maybe you're wrong about\n                  him.  Maybe he's got it coming.\n\n     BEGIN MONTAGE - INVESTIGATION\n\n     EXT. CUL-DE-SAC - DAY\n\n     Ray takes notes, talks with neighbors, kids, lawn mower man.\n\n     EXT. BLUE BAY SCHOOL - DRIVEWAY - DAY\n\n     Gloria talks with students -- Jimmy, Nicole, others.\n\n     INT. SAM'S OFFICE - DAY\n\n     Sam sits at his desk, toying with a pencil.  He watches students\n     pass -- no smiles, no waves, an occasional dark look.\n\n     Through the press of students Sam sees Art at the door of his\n     office.  The two men look at one another.  At which point...\n\n     Gloria, followed by Ray, steps INTO SCENE.  The detectives shake\n     hands with Art.  As Art turns to close the door, Sam falls within\n     his line of vision.  Art looks away.  The door swings shut.\n\n     EXT. BLUE BAY SCHOOL DOCKS - LATER\n\n     The sky has begun to color.  Art Maddox stands on the grass at\n     the end of the channel separating the slips, watching as...\n\n     A lone sailboat tacks toward the school.\n\n     ANGLE ON BOAT - SAM & JIMMY\n\n     Sam drops his sail, leaving himself just enough momentum to\n     cruise expertly into the little channel then into the slip.\n\n     Art watches as Jimmy jumps from the boat, ties it off.\n\n                                  SAM\n                  That's good, Jimbo.  I'll see you on\n                  Monday.\n\n     Jimmy hesitates, he wants to say something.  Sam waves him off.\n     Jimmy gives Art a hard look and heads for the grass.\n\n                                  SAM (CONT'D)\n                         (to Art, nodding after\n                          Jimmy)\n                  What's left of my sailing class.\n\n     Art studies the dock between his feet.\n\n                                  SAM (CONT'D)\n                  Talk to me Artie.\n\n                                  ART\n                  Kelly Van Ryan...\n\n                                  SAM\n                  ... is accusing me of rape.  Jimmy told\n                  me.  Apparently I'm the last to know...\n\n                                  ART\n                  Sam... I...\n                         (a long beat)\n                  Sandra Van Ryan's been on the horn with\n                  every member of the school board all day\n                  long.  She's pushing for suspension...\n\n                                  SAM\n                  This is insane.\n\n     Art shakes his head.\n\n                                  ART\n                  All I can tell you Sam, is hang in\n                  there.  They clear you of this mess, you\n                  get reinstated, with back pay...\n\n                                  SAM\n                  That's great.  I'll just tell my\n                  creditors I'm not a rapist.  No\n                  problem... Shit.\n                         (beat)\n                  I can't believe the board's going to act\n                  without even hearing my side of it.\n\n                                  ART\n                  The Van Ryan family created Blue Bay.\n                  They built the school... Sandra Van Ryan\n                  calls up the board and says kiss my ass,\n                  they say, left, right, or in the middle.\n                         (beat)\n                  You're gonna need some help on this one,\n                  Sam.  You're gonna need a lawyer, and\n                  he'd better be a good one.\n\n     EXT. STRIP MALL - DAY\n\n     Typical of its kind -- a Blockbuster Video, a 7-Eleven, half a\n     dozen small businesses, one of which, sandwiched between a donut\n     shop and the Mongolian Beef Bowl, bears the sign:  \"KEN BOWDEN --\n     ATTORNEY AT LAW.\"\n\n     INT. WAITING ROOM - DAY\n\n     Sam sits in a cramped waiting room, leafing through a magazine.\n\n     An attractive young SECRETARY sits a few feet away, behind her\n     desk.  Her PHONE RINGS.  She picks it up, then turns to Sam,\n     favoring him with a flirtatious smile.\n\n                                  SECRETARY\n                  Mr. Bowden will see you now.\n\n     INT. OFFICE - DAY\n\n     Ken Bowden, a slightly oily-looking young man in a nice suit and\n     a large, padded neck brace, rises to shake Sam's hand.\n\n                                  KEN\n                  Sam, hey, it's been a while.\n                         (beat)\n                  Looked for you at the ten year reunion.\n                  You missed out.  Three days at the\n                  Disneyworld Hotel... Partied ourselves\n                  silly.\n\n     Sam nods.\n\n                                  KEN (CONT'D)\n                  Couple of your old flames were there.\n                  You remember Jill, with the knockers.\n\n     Ken holds his hands out in front of his chest.\n\n                                  KEN (CONT'D)\n                  Blew up like the Goodyear blimp.\n\n     Sam forces a smile.\n\n                                  KEN (CONT'D)\n                  But check this...\n\n                                  SAM\n                         (interrupting)\n                  Ken.  I'm in some trouble.  I need an\n                  attorney and you're the only one I know.\n                  So I figured I'd start here.\n\n     Ken stops, puts on a serious face.\n\n                                  KEN\n                  Well, I'm glad you did.  And I'm sorry.\n                         (folding his hands before\n                          him)\n                  Why don't you tell me about it.\n\n     Sam looks at him.  He starts to speak, then checks himself.\n\n                                  SAM\n                  What did you do to your neck?\n\n     Ken puts a hand to his throat, as if aware of the brace for the\n     first time.\n\n                                  KEN\n                  Oh this... chiropractor did a number on\n                  me.\n\n     He takes the brace off, tossing it on his desk.\n\n                                  KEN (CONT'D)\n                  I don't really have to wear the thing\n                  all the time.\n                         (beat)\n                 A guy from the insurance was here.\n\n     Ken smiles.  Sam looks slightly ill.\n\n                                  KEN (CONT'D)\n                  Go ahead, Sam.  Shoot.  Let's see what\n                  we've got here.\n\n     EXT. A BLUE HAY RESTAURANT - NIGHT\n\n     Trendy nouveau.  A valet parks Sam's Jeep.\n\n     INT. RESTAURLNT - SAME\n\n     Sam walks across a tiled entry.  He looks tired, but smiles at\n     the maitre d'.\n\n                                  SAM\n                  Georgie, hey.  I'm meeting Barbara.  She\n                  here yet?\n\n     GEORGE looks stiff, maybe a little nervous.  Sam picks up on it.\n     He scans the room...\n\n     ANGLE ON ROOM\n\n     Dimly-lit, crowded, but we PICK OUT Barbara, stunning in a\n     delicate white sun dress, tanned arms resting upon a table.\n\n     Sam starts toward her.  George reaches out to touch his arm.\n\n                                  GEORGE\n                  Mr. Lombardo.\n\n     Sam ignores him, threading his way among the people at a lavish\n     bar, then stopping short as he sees who Barbara is with -- her\n     father, Tom Baxter.\n\n     Tom Baxter sees Sam, gets to his feet.\n\n                                  BAXTER\n                  This is not appropriate Lombardo.\n\n     Sam steps to one side, makes eye contact with Barbara.\n\n     Barbara has tears in her eyes.  She looks at Sam, then shakes her\n     head, looking away.\n\n                                  SAM\n                  Barbara...\n\n                                  BAZTER\n                  You're finished in Blue Bay, Lombardo.\n                  You've been scratching at the door long\n                  enough...\n                         (as Sam faces him)\n                  I ever see you around my daughter,\n                  you're going to be finished, period.\n\n     The two men square off, but already we can SEE Georgie, trailed\n     by a pair of beefy characters in blue blazers making their way\n     across the room.\n\n     Sam sees them too.  He takes a final look at Barbara.  When she\n     refuses to meet his eye, he pushes past Baxter, through the crowd\n     and out of the restaurant.\n\n     EXT. AN EVERGLADES ROADHOUSE - NIGHT\n\n     Red neon identifies it as Jim's Recovery Room.  A handful of\n     trucks sit in a dirt parking lot, Sam's Jeep among them.\n\n     INT. ROADHOUSE - NIGHT\n\n     The air is thick with smoke.  Locals shoot pool.  The walls are\n     decorated with dusty fishing nets and inflated blowfish.\n\n     An aging BARMAID -- good-looking -- once, runs a rag around a\n     pitcher, looks down the bar, smiles, finding...\n\n     Sam, alone, awaiting service.\n\n                                  BARMAID\n                  Sam, honey... Haven't seen you in a\n                  while.  How's life treatin' you?\n                         (off Sam's look)\n                  That bad, huh?  Well, you came to the\n                  right place.\n\n     EXT. ROADHOUSE - LATER\n\n     Sam walks outside.  He stands in the red glow of neon light,\n     looking toward the road... On the opposite side of which...\n\n     ... sits a sorry little collection of whitewashed stucco\n     bungalows, identified by a green neon sign as the Glades Motel.\n\n     Beyond the motel are the Everglades, a great expanse of darkness.\n\n     Sam stares at the motel.  At last he gets in his Jeep.  As he\n     EXITS the lot, a second pair of headlights flashes on.\n\n     EXT. EVERGLADES - NIGHT\n\n     A deserted two-lane road cuts through the swamp.  Trees bearded\n     with moss appear as ghostly shapes in the lights of Sam's Jeep.\n\n     INT./EXT. SAM'S JEEP - MOVING - SAME\n\n     San drives -- a tired face.  Soft MUSIC on the RADIO.\n\n     Something APPEARS in the road, caught for a moment in the\n     headlights.  Sam swerves, whirls his head around, sees...\n\n     A GATOR sliding of the shoulder and into the murky water.\n\n     Sam lets out some air, relaxing a bit, then catches sight of\n     something else -- Headlights finding reflection in his rearview\n     mirror, coming fast.  Sam watches as the lights get closer.  He\n     looks back to the road -- an approaching curve...\n\n     Sam is into the curve when the lights catch him.  A black Range\n     Rover moves out to pass, then turns suddenly into Sam's lane,\n     cutting him off.\n\n     It happens quickly.  Sam swerves to avoid hitting the larger car,\n     but the road affords little margin for error.\n\n     The JEEP slides across a narrow shoulder, then plummets down a\n     steep embankment, CRASHING through cattails, rolling over to SLAM\n     BACK DOWN on its tires in a swampy gulch.\n\n     Sam slumps back from the steering wheel.  Somewhere over his head\n     he can see headlights shining into the trees.\n\n     He hears a CAR DOOR SLAM, the SOUNDS of someone scrambling down\n     the embankment.\n\n     Sam tries to get out of his seat harness.  Someone is\n     approaching, splashing through the muck.  Suddenly a hand reaches\n     through the broken driver's window, helping him.\n\n                                  MAN'S VOICE\n                  Are you all right?\n\n     The hands get him loose.  Sam stumbles from the car.\n\n                                  SAM\n                  Yeah, I'm okay.\n\n     He looks up to find -- Frankie Condo, looming over him.\n\n                                  FRANKIE\n                  That's too bad.\n\n     He grabs Sam, pulling him OUT OF FRAME.  What we are left with is\n     the SOUND of FISTS THUDDING INTO FLESH -- then Sam, hitting the\n     hood of his Jeep, slumping down into the muck.\n\n     Frankie is breathing hard.  We HEAR him SLOGGING back up the\n     embankment.  We HEAR a DOOR SLAM, the RANGE ROVER driving away,\n     leaving only darkness, and the EERIE SOUNDS of the swamp.\n\n     EXT. THE STRIP MALL - DAY\n\n     Dazzling light.  Sam's smashed-up Jeep is parked before Ken\n     Bowden's office, next door to the Mongolian Beef Bowl.\n\n     INT. BEEF BOWL - SAME\n\n     Sam and Ken eye one another over a green plastic table -- Ken\n     with his neck brace, Sam with a bruised face.\n\n                                  KEN\n                  I figured, you know, it would be darker\n                  in here.\n\n     He moves a hand to his face.\n\n                                  SAM\n                  Good thinking.\n\n                                  KEN\n                  You can tie whoever did it to Sandra Van\n                  Ryan...\n\n                                  SAM\n                  Forget it.\n\n                                  KEN\n                  Lady has some deep pockets.  That's all\n                  I'm saying.\n\n                                  SAM\n                  I know how deep her pockets are, Ken.  I\n                  thought I might be able to save my\n                  fucking house with an equity loan.\n                  Guess who's on the board of directors at\n                  the bank?\n\n     He pauses to look at Ken Bowden.\n\n                                  SAM (CONT'D)\n                  Can't you take that stupid thing off?\n\n                                  KEN\n                  Not in here.  Chiropractor comes in here\n                  for lunch sometimes.\n\n     San sighs, slumps back in his plastic seat.\n\n                                  KEN (CONT'D)\n                  You're not in bad shape, really.  I know\n                  you think you are, but you're not.  Let\n                  me tell you why.\n                         (beat)\n                  Sandra Van Ryan.\n\n                                  SAM\n                  What's that supposed to mean?\n\n                                  KEN\n                  For you to be getting this kind of heat,\n                  for what they have on you... It doesn't\n                  add up.  Sandra Van Ryan's got 'em\n                  running scared.\n                         (beat)\n                  And I'll tell you something else, you\n                  rush, you get careless.\n\n     Ken reaches into his briefcase.  He pulls out some papers, tosses\n     them on the table.  Sam picks one up, starts to read.\n\n                                  SAM\n                  Nellie Gail Ranch...\n\n                                  KEN\n                  Sound nice?  It's a fucking drug rehab\n                  farm.  It's where Kelly Van Ryan went\n                  when her morn fished her out of the\n                  swamp.\n                         (beat)\n                  Meanwhile, you get educator of the year\n                  I mean there's no way they can put\n                  this thing in front of a jury.\n                         (beat)\n                  Shit, they haven't even taken your\n                  statement yet.  Reason?  They're still\n                  shoveling dirt and my guess is, they're\n                  coming up empty.  Now tell me I'm right.\n\n                                  SAM\n                  There's nothing for them to get.\n\n                                  KEN\n                  Good.  So what we're going to do is\n                  march right to Hunter's doorstep.  We're\n                  going to insist they take a statement.\n                  We're going to tell them to charge your\n                  ass or get off your back.\n                         (beat)\n                  They're walking a fine line here.\n                  Defamation of character, malicious\n                  prosecution...\n\n                                  SAM\n                  I just want my life back...\n\n                                  KEN\n                  Fair enough.  Let's go make a statement.\n\n     INT. POLICE INTERVIEW ROOM - DAY\n\n     Everyone's looking a little tired, with the possible exception of\n     Ray.  At this moment he sits back in his chair, staring at Sam.\n\n                                  RAY\n                  Why don't you tell us one more time, how\n                  Kelly came to be with you, alone in your\n                  house.\n\n                                  SAM\n                         (with growing impatience)\n                  Story's the same, Detective...\n\n     Ken pats him on the arm.  When Sam speaks again, it is in a\n     calmer voice, calm but tired.\n\n                                  SAM (CONT'D)\n                  I had to go look for this coupon.\n\n                                  RAY\n                  The one you bought at school.\n\n                                  SAM\n                         (nodding)\n                  Like I said, I hadn't really expected to\n                  use it.\n                         (beat)\n                  Anyway, I'm going through a drawer.  I\n                  hear a car.  I look out the window.  I\n                  see Nicole driving away.  I leave my\n                  room, and there's Kelly.\n\n                                  RAY\n                  In cutoffs, a wet T-shirt.\n\n                                  SAM\n                  Yes.\n\n                                  RAY\n                  And she wanted to talk.\n\n                                  SAM\n                  Yes.\n\n                                  RAY\n                  But you can't tell us what she wanted to\n                  talk about.\n\n                                  SAM\n                  I could, but it's confidential.  Look,\n                  the point is, we didn't talk.  I told\n                  her this was not an appropriate time or\n                  place.\n\n                                  RAY\n                  And she began to cry.  And you put an\n                  arm around her.\n\n                                  SAM\n                  Yes.  Mainly to turn her toward the\n                  door.  I told her we would talk on\n                  Monday, in the office.\n\n                                  GLORIA\n                  And when you turned her toward the door,\n                  where did you expect her to go, without\n                  a car?\n\n                                  SAM\n                  Again.  I think we covered this.  I told\n                  her I was going to call a cab.\n\n                                  RAY\n                  But she ran away.\n\n                                  SAM\n                  That's right.\n\n                                  GLORIA\n                  Did you call anyone?  Did you call her\n                  house to see if she got home?  Did you\n                  call the Masons?\n\n                                  SAM\n                  No.\n\n                                  GLORIA\n                  Weren't you a little worried about\n                  her...?\n\n                                  SAM\n                  There's a strip mall not half a mile\n                  from my house.  There's phones there.  I\n                  cruised the place, but I didn't see her.\n                  I figured she was probably there but\n                  that she was angry and didn't want to be\n                  found.  I don't know... Maybe I should\n                  have called.  But it's not like Kelly\n                  can't take care of herself.  I figured\n                  we'd just take it up on Monday, in the\n                  office.\n\n     There is a moment of silence in the room.\n\n                                  RAY\n                  But you do admit to touching her, to\n                  putting your arm around her.  Isn't that\n                  against the rules?\n\n                                  SAM\n                  It is and I don't.  Ordinarily...\n                         (beat)\n                  But, I mean... there's this kid standing\n                  in front of you crying...\n\n                                  RAY\n                  With a thirty-five inch bustline in a\n                  wet T-shirt with no bra...\n\n     He is cut short as Sam shoves his chair back from the table.\n\n                                  SAM\n                  Fuck you.  This is bullshit.  I'm outta\n                  here.\n\n                                  RAY\n                  Sit down, Lombardo.\n\n     Sam and Ray stare at one another.  Ken puts a hand on his\n     client's arm.\n\n                                  KEN\n                  All right, all right... Enough.\n\n     Ken stands up.  He walks to the two-way mirror set in one wall,\n     rapping on the glass with his knuckles.\n\n                                  KEN (CONT'D)\n                  We came down here to make a statement.\n                  We've made it.\n                         (beat)\n                  If you're going to charge my client, do\n                  it now.\n\n     INT. OPPOSITE SIDE MIRROR ROOM - HUNTER\n\n     stares at Ken's face, about a foot away.  Ken of course can't see\n     him.  Hunter gives him the finger.\n\n     INT. INTERVIEW ROOM - KEN\n\n     stares into the mirror, waiting.\n\n                                  KEN\n                  I didn't think so.\n                         (to Sam)\n                  Let's go.\n\n     Ken opens the door.  Sam turns back to Ray and Gloria.\n\n                                  SAM\n                  I've spent the last ten years of my life\n                  working with kids.  I love what I do,\n                  and I think I'm good at it.\n                         (beat)\n                  These kids trust me, and there is no\n                  way.  No way in hell I would ever betray\n                  that trust.\n\n     As Ken and Sam leave, Ray and Gloria are joined by Bryce Hunter.\n\n                                  HUNTER\n                  Nice speech.  Either of you buying?\n\n     Ray shrugs.\n\n                                  RAY\n                  Not that stuff about her running away,\n                  him trying to find her.  That's\n                  bullshit.\n\n                                  HUNTER\n                  What about witnesses?\n\n                                  RAY\n                  We've got three.  Guy mowing his yard,\n                  couple of kids playing hoops.\n\n                                  HUNTER\n                  And what do they say?\n\n                                  GLORIA\n                  Same as him.  They saw her come.  They\n                  saw her go.  They saw him follow.\n\n                                  RAY\n                  Still doesn't explain why he couldn't\n                  catch up with her.  I mean how long does\n                  it take to put on a shirt?\n\n     At which point, a COP APPEARS in the doorway.\n\n                                  COP\n                  Phone, Bryce.  It's Sandra Van Ryan.\n\n                                  HUNTER\n                  Christ Almighty.  That woman's calling\n                  me six times a day.\n\n     He starts away, then stops.\n\n                                  HUNTER (CONT'D)\n                  I think you're onto something, Ray.\n                  Stay with it.\n\n     Hunter bangs out of the room.  Gloria slumps in a chair, tired,\n     disgusted.\n\n                                  GLORIA\n                  We failed to mention the mower guy's a\n                  drunk, that he was after more beer and\n                  never really saw Kelly go into the\n                  house, so he can't say how long she was\n                  in there.  Same with the kids.  They saw\n                  her running down the street, but that's\n                  it.\n                         (beat)\n                  With no physical evidence, what do we\n                  have?  Her word against his.\n\n                                  RAY\n                  You're telling me you believe the guy?\n\n                                  GLORIA\n                  All I'm saying is, we let Sandra Van\n                  Ryan push us too hard, we're going to\n                  wind up looking stupid.\n\n     Ray is paged by his BEEPER.  He pulls it off his belt, looks at\n     the number.\n\n                                  RAY\n                  I'd better return this.\n\n     Ray leaves.  Gloria pulls a cigarette from her purse and lights\n     up, rests her head back in the chair, blowing smoke at the\n     ceiling.\n\n     INT. INTERVIEW ROOM - LATER\n\n     Gloria is grinding out the butt as Ray walks back in.  There is\n     something in the way he carries himself, some sense of urgency.\n\n                                  RAY\n                         (off Gloria's look)\n                  Seen any good gator wrestling lately?\n\n     EXT./INT. DETECTIVES' CAR - MOVING - DAY\n\n     Ray and Gloria drive through the Everglades, past marshlands\n     punctuated by thick stands of melaluca trees.\n\n                                  GLORIA\n                  They say it was old man Van Ryan planted\n                  the melalucas to dry up the swamp.\n\n     Ray nods.\n\n                                  GLORIA (CONT'D)\n                  You can go up to one of those trees and\n                  peel the bark.  You know what you get?\n                  More bark.  And more bark.  There's no\n                  core.  Tree's not good tar anything but\n                  sucking up water.  And now they can't\n                  get rid of them.  They've tried poisons.\n                  Nothing works.  They don't die.\n\n                                  RAY\n                  Yeah, well, Van Ryan got his.  I don't\n                  imagine he gives a shit now.\n\n     Gloria just looks at him.  Ray stares into the dusty light of an\n     approaching sunset.  At last he slows, turning off the highway\n     and onto a narrow dirt road.\n\n     A sign pokes out from the tall grass -- \"SMILIN' JACK'S FISH\n     CAMP.\"\n\n     The Taurus bounces along the washboard road.\n\n                                  GLORIA\n                  You're sure we're not lost?\n\n     They are driving now at the edge of a canal.\n\n                                  RAY\n                  You remember that little girl walked out\n                  of our talk at Blue Bay?\n\n                                  GLORIA\n                  The skinny brunette.\n\n                                  RAY\n                  This is where she lives.  She wants to\n                  talk.\n                         (beat)\n                  Beats the shit out of me why she would\n                  call me at all.  I busted her once for\n                  possession.  she wound up doing about\n                  six months at Camp Nine.\n\n                                  GLORIA\n                  You mean Camp Sixty-Nine.\n\n     Ray gives her a look.  Gloria shrugs.\n\n                                  GLORIA (CONT'D)\n                  That's what they called it when I was in\n                  Juvenile.  It's a pretty dismal place.\n\n                                  RAY\n                  It's a shithole.  But she was dirty,\n                  what was I gonna do?\n\n     They pass a sagging chain-link fence, entering a quarter-mile run\n     of shabby trailers and cheap shacks.\n\n     The squalor of the buildings is seat in contrast to the beauty of\n     the Glades where the waters have gone to the color of polished\n     brass beneath an immense, darkening sky.\n\n     Ray parks before a ramshackle building covered in vines and\n     peeling paint.  A sign reads:  \"NIGHT CRAWLERS $1 A BUCKET.\"  The\n     jawbones of numerous gators hang beneath the eaves.\n\n     As they get out of the car, something catches Gloria's eye --\n     along the bank of the canal...\n\n     ANGLE ON BANK\n\n     where a tall man (WALTER) with long white hair and tattooed arms\n     kneels inside a pen, slapping a huge gator on its snout.  The\n     reptile lifts its upper body, hissing, opening its jaws.\n\n     Walter takes a stick from his hip pocket, passing it through the\n     gator's mouth.  The jaws snap shut, incredibly fast, with a\n     hollow snapping sound.\n\n     Gloria jumps instinctively, then watches, aghast, as Walter slaps\n     the creature once more.  This time moving round to the front of\n     the gator, sticking halt his arm inside its mouth.\n\n                                  VOICE (0.5.)\n                  He's just showin' off for you now.\n\n     Gloria starts, then turns to find a woman (RUBY) has walked up\n     beside her.  The woman is in her sixties.  She's dressed in\n     polyester.  Her hair is piled on top of her head -- too dark to\n     be anything but a dye job.  A cigarette bobs from her lips.\n\n     Before Gloria can respond, Ray steps up behind than.\n\n                                  RAY\n                  Evening Ruby.\n                         (beat)\n                  I see you still got Walter.  I was sort\n                  of hoping something had eaten him by\n                  now.\n\n                                  RUBY\n                         (a long beat)\n                  Can I help you with something?\n\n     Ray and the old lady look at each other.\n\n                                  RAY\n                  Suzie called.  You know where we can\n                  find her?\n\n     Ruby looks toward the store.\n\n                                  RUBY\n                  You know the way.\n\n     She watches as the detectives CROSS the road, then calls to them\n     as they start up the steps.\n\n                                  RUBY (CONT'D)\n                  You won't shoot her will you?  I don't\n                  believe she's armed.\n\n     Gloria turns, surprised.  Ray gives the woman a long, cold stare,\n     then opens the door for Gloria.\n\n     INT. CAMP STORE - SAME\n\n     It's dark inside.  The main light source is a tiny, beat-up\n     black-and-white TV.\n\n     Two elderly women in colored bouffant hairdos sit on a ratty old\n     couch watching reruns of \"Family Feud.\"  They look up as Ray and\n     Gloria ENTER then EXIT through a door in the back.\n\n     INT. SUZIE'S ROOM - SAME\n\n     Black walls.  Cheap bookshelves, filled to overflowing.  A wire\n     strung with dismembered doll parts runs the length of the room.\n\n     Suzie is propped on a ratty futon, an open book on her stomach,\n     her thin, white arms crossed behind her head.\n\n                                  SUZIE\n                  Jesus.  It took you long enough.  What\n                  if somebody was trying to strangle me?\n                  Or fuck me in the ass, even?\n                         (beat)\n                  I mean, you guys are Sex Crimes.\n\n     Ray manages a thin smile.\n\n                                  RAY\n                  Meet my partner, Gloria Perez.\n\n                                  SUZIE\n                  I did.  At Blue Balls.\n\n                                  GLORIA\n                  Seems to me you left early, before we\n                  could meet.  But hi, Suzie.\n\n     Gloria puts out a hand.  Suzie looks at it, puts out a hand of\n     her own.\n\n     As the women shake, Gloria looks at the book on Suzie's stomach,\n     turning her head as if to read the title.\n\n                                  SUZIE\n                  It's Celine.  He's okay.  He had a\n                  pretty good line on what cheap fucks\n                  people are.\n\n                                  RAY\n                  So Suzie, you called us, remember?\n\n     Suzie takes a cigarette from a pack at her side, lights up, blows\n     smoke at the ceiling.\n\n                                  SUZIE\n                  Did they arrest Mr. Lombardo?\n\n     Ray and Gloria exchange looks.\n\n                                  RAY\n                  No.\n\n                                  SUZIE\n                  Will they?\n\n                                  RAY\n                  It doesn't look like it.\n\n                                  SUZIE\n                  Then he'll be back at Blue Balls?\n\n     Ray shrugs.\n\n                                  GLORIA\n                  That bothers you?\n\n                                  SUZIE\n                         (a long beat)\n                  Yeah, maybe, a little.\n\n                                  GLORIA\n                  Why is that?\n\n     Suzie lets out her breath.  She rests her head against the wall.\n\n                                  GLORIA (CONT'D)\n                  You can talk to us, Suzie.  That's why\n                  we're here...\n\n     INT. POLICE INTERVIEW ROOM - DAY\n\n     Suzie, Gloria and Hunter sit at the conference table.  Ray\n     operates the video cam.\n\n                                  GLORIA\n                  Okay, Suzie.  We want you to tell us\n                  about the day Mr. Lombardo gave you and\n                  Jimmy a ride.\n\n       Suzie stares at the three cops around her, then at the camera.\n\n                                  SUZIE\n                  You didn't tell me you were gonna put me\n                  on the fucking news.\n\n                                  GLORIA\n                  We need to tape the interview, Suzie.\n                  No one will see it but us.\n                         (beat)\n                  Now when was this, that Mr. Lombardo\n                  gave you the ride?\n\n     Suzie stares at the camera.  She's lost the cockiness she had on\n     her own turf.  She looks small, white and frail in the sterile\n     room, surrounded by the detectives.\n\n                                  SUZIE\n                  About a year ago.\n\n                                  GLORIA\n                  He dropped Jimmy off first?\n\n                                  SUZIE\n                  Yeah.\n\n                                  GLORIA\n                  And when he arrived at your house, was\n                  anyone there?\n\n                                  SUZIE\n                  No.\n\n                                  GLORIA\n                  So you were alone.\n\n                                  SUZIE\n                  Yes.\n\n                                  GLORIA\n                  Did he come in with you?\n\n                                  SUZIE\n                  I guess.\n\n                                  HUNTER\n                  You guess?  Did he or didn't he?\n\n                                  SUZIE\n                  Yeah... okay... he did\n\n                                  HUNTER\n                  And then what... he touched you?  Did\n                  you maybe flirt a little...\n\n                                  SUZIE\n                  I wanna go home now.\n\n     Gloria glares at Hunter, shakes her head.\n\n                                  GLORIA\n                  Suzie, look, I know you feel bad.  I\n                  know it's harder to talk here than in\n                  your room, but we need to get it on\n                  tape.\n                         (beat)\n                  Just tell us what you told us before.\n                  Tell us the truth.\n\n     Suzie huddles in her skinny arms, studying the detectives.\n\n                                  SUZIE\n                  I didn't say a thing to him.  He just\n                  put his arm around me.  Told me I was\n                  pretty... I could be really pretty, he\n                  said.\n\n   Another moment -- she looks at Ray, then at Hunter.\n\n                                  HUNTER\n                  What did you do then?\n\n                                  SUZIE\n                         (a long beat)\n                  Shit, what difference does it make...\n                  Nobody's gonna believe me anyway...\n\n                                  HUNTER\n                  Suzie!  Did this man rape you?\n\n                                  SUZIE\n                  Okay!  He did.  He pushed me to the\n                  floor and he did it to me.  Now, can I\n                  go home?\n\n     She stands up.\n\n                                  GLORIA\n                  At that point were you able to fight him\n                  off?\n\n                                  SUZIE\n                  No.  He stopped by himself.  Okay?\n                  That's all.  Let me go.\n\n     Gloria gets to her feet as well; she tries to put an arm around\n     Suzie.  The girl jumps back as if she has been shocked.\n\n                                  SUZIE (CONT'D)\n                  Don't touch me.\n\n     Gloria's hands fall to her sides.\n\n     Suzie heads for the door.\n\n\n     The detectives exchange looks.\n         \n     At which point, Suzie stops, turns to face the room.\n\n                                  SUZIE (CONT'D)\n                  He did say something.\n\n                                  GLORIA\n                  What was that?\n\n                                  SUZIE\n                  He said, \"No little bitch can ever make\n                  me come.\"\n\n     THE SLIDING BAR DOOR\n\n     of a jail SLAMS shut on Sam Lombardo.  He turns to...\n\n     TWO menacing PRISONERS.\n\n                                  PRISONER\n                  So you're the new chicken licker.\n\n                                                 CUT TO:\n\n     COURT TV IMAGE\n\n     The graphic -- \"Prime Time Justice\" -- then the anchor --\n     CYNTHIA.\n\n                                  CYNTHIA (TV)\n                  Today from Superior Court in Miami,\n                  Florida -- Dade County versus Samuel J.\n                  Lonbardo.\n\n     PULL BACK to REVEAL...\n\n     INT. ART'S OFFICE, BLUE BAY HIGH - DAY\n\n     Art, students, faculty members huddle around the TV.\n\n                                  CYNTHIA (TV, CONT'D)\n                  The Lonbardo rape case has galvanized\n                  the upscale town of Blue Bay...\n\n     EXT. COURTHOUSE - DAY\n\n     Video crews surround a limo as Sandra and Kelly EMERGE.\n\n                                  CYNTHIA (V.0., CONT'D)\n                  ... with its tabloid appeal -- Sandra\n                  Van Ryan -- jet-set real estate\n                  heiress...\n\n     Tom Baxter and Barbara jostle up the steps.\n\n                                  CYNTHIA (V.0., CONT'D)\n                  The powerful Blue Bay elite...\n\n     Suzie, in the company of Ruby and Walter, pushes past the video\n     crews.\n\n                                  CYNTHIA (V.0., CONT'D)\n                  ... the girl from the wrong side of the\n                  tracks...\n\n     INT. COURTROOM - DAY\n\n     Bryce Hunter confers with his team.\n\n     Ken in his neck brace, ENTERS with Sam and a bailiff.  Sam wears\n     a suit.  Re's clean-shaven, recovered from the car wreck and\n     beating.  Still, there is a weariness about him we have not seen\n     before.  He makes eye contact with Sandra -- a cold stare.\n\n                                  CYNTHIA (V.0., CONT'D)\n                  In the end, the prosecution's case will\n                  come down to...\n\n     INT. COURTROOM - DAY\n\n     Hunter in front of the jury.\n\n                                  HUNTER\n                  ... what happened to Kelly Lanier Van\n                  Ryan and Susan Marie Toller that will\n                  forever change the lives of these two\n                  young women?  What happened in those\n                  fifteen minutes alone with Samuel\n                  Lombardo?\n\n     CLOSE ON SAM\n\n     The dark, seductive eyes.\n\n     INT. COURTHOUSE - WITNESS WAITING ROOM - DAY\n\n     Suzie, nervous, paces the floor, stops, lights a cigarette.\n\n     The other witnesses sit in chairs along the wail -- the lawn\n     mower man, cul-de-sac kids, Barbara, Nicole, as...\n\n     IN THE COURTROOM\n\n     Kelly Van Ryan sits in the witness box, dabbing her eyes with a\n     handkerchief while Bryce Hunter stands before her.  The room is\n     silent, the spectators riveted on the scene.\n\n                                  HUNTER\n                  Do you need more time?\n\n     Kelly shakes her head, no.\n\n                                  HUNTER (CONT'D)\n                  I know this is hard, Kelly, but I have\n                  just one more question and even though\n                  its something we've been over, I want us\n                  all to be very clear about it.\n                         (a long beat)\n                  When you made the decision to stay at\n                  Mr. Lombardo's house, after he had\n                  offered you a ride.  When you saw that\n                  he intended to have sex with you, what\n                  were your exact words?  What did you\n                  say?\n\n                                  KELLY\n                  I told him, no.  I said stop, Mr.\n                  Lombardo, please... I screamed for him\n                  to stop...\n\n                                  HUNTER\n                  And did he?\n\n     Kelly looks defiantly at the courtroom.\n\n                                  KELLY\n                  No.  He raped me on the floor of his\n                  shitty house.\n\n                                                 CUT TO:\n\n     WITNESS WAITING ROOM - SAME - SUZIE\n\n     still pacing, as Ray and Gloria ENTER the room.\n\n     Suzie shoots them a nervous glance, drops her cigarette, bends to\n     pick it up, burns her fingers, drops it again.  She curses\n     beneath her breath, wrapping her fingers about her shoulders.\n\n     Ray and Gloria watch her, exchange glances.  Gloria picks up\n     Suzie's cigarette for her, puts it out in an ashtray.\n\n                                  GLORIA\n                  You've got nothing to be scared of,\n                  Suzie, just take a deep breath.\n\n     INT. COURTROOM - LATER\n\n     PANNING the spectators, we SEE Sandra, Baxter, Ray, Gloria.\n\n     Hunter is on the witness stand.\n\n     Suzie is in the box.  She looks pale, even more nervous.\n\n                                  SUZIE\n                  He pushed into me... I couldn't stop\n                  him... it hurt.\n\n                                  HUNTER\n                  I'm sorry... you said it hurt?  Why?\n\n                                  SUZIE\n                  Because... it was the biggest I've ever\n                  seen.  And I've seen a lot on their way\n                  through Jack's Fish Camp.\n\n     Chuckling in the courtroom.  The JUDGE glares, silencing it.\n\n                                  HUNTER\n                  Ms. Toller, did Samuel Lombardo rape you\n                  in your family's home on the 23rd of\n                  April last year?\n\n     Suzie glances at Sam, hesitates.\n\n                                  HUNTER (CONT'D)\n                  Ms. Toller?\n\n                                  SUZIE\n                  I said he did.\n\n                                  HUNTER\n                  Ms. Toller.  I'm asking you now, under\n                  oath, did Samuel Lonbardo rape you?\n\n     Suzie looks around, as if for help.  The spectators stir.\n     Ray rubs his eyes.  Gloria's are closed.\n\n                                  SUZIE\n                  This wasn't my idea.\n\n                                  HUNTER\n                  I'm sorry?\n\n     Suzie looks at Sam once more.\n\n                                  SUZIE\n                  Look.  I just don't want to get into any\n                  more trouble...\n\n     Tom Baxter rises to his feet.  The Judge raises a hand, motioning\n     him to sit back down.\n\n                                 JUDGE\n                         (to Baxter)\n                  The Court would like to hear what Miss\n                  Toller has to say.\n                         (to Suzie)\n                  Miss Toller.\n\n                                 SUZIE\n                  Mr. Lombardo didn't rape me.  He didn't\n                  rape Kelly either.  He didn't do\n                  anything.\n\n     QUICK CUTS\n\n     Hunter slumps back against the prosecution table.\n\n     Sandra's hand covers her mouth.  Baxter mumbles a curse.\n\n     Sam hangs his head in relief.  Ken grins above his neck brace.\n\n     COURTROOM LOBBY\n\n     The press corps scrambles for cameras.\n\n     BLUE BAY HIGS\n\n     Teachers, students, Art, Jimmy -- crammed around the TV.\n\n                                  JIMMY\n                  I don't believe it...\n\n     IN THE COURTROOM\n\n     Bryce Hunter and Tom Baxter are both on their feet, trying to\n     make themselves heard above the din.\n\n                                  HUNTER\n                  Your Honor... I must object...\n\n                                  JUDGE\n                         (hammering for order)\n                  I think I made it plain that the Court\n                  intends to near Miss Toller's story.\n\n     The Judge turns a cold eye on Suzie.\n\n                                  SUZIE\n                  I'm sorry.\n\n                                  JUDGE\n                  Sorry?  Just how far did you intend to\n                  let this go?\n\n                                  SUZIE\n                  I don't know.  I just wanted to hurt Mr.\n                  Lombardo.\n\n     Sam looks up, confused.\n\n                                  SUZIE (CONT'D)\n                  He was my friend at first.  Then I got\n                  busted... he didn't even stick up for\n                  me.  I had to go away to that hellhole.\n                  It's like, you're his favorite, then who\n                  cares?  You wanna know something?  When\n                  Kelly said we should do this, I thought\n                  cool, all these big shots screwing me\n                  over, like that cop, Duquette.  Now\n                  they're gonna get screwed.\n\n                                  HUNTER\n                  Your Honor... Please...\n\n                                  JUDGE\n                  Any more interruptions Mr. Hunter, and\n                  the Court will hold you in contempt.\n                         (to Suzie)\n                  What you are telling me, Ms. Toller, is\n                  that Kelly Van Ryan is responsible for\n                  conceiving this entire charade...\n\n                                  SUZIE\n                  Kelly's pissed at Mr. Lombardo, too.\n                  She's in love with him.  I mean her\n                  whole fantasy is him since her old man\n                  died.  Then she found out that Mr.\n                  Lombardo was doing her mom.  I mean that\n                  was it...\n\n     Gasps in the court as --\n\n     Kelly BURSTS from the witness waiting room, trailed by a bailiff.\n\n                                  KELLY\n                  You stupid little bitch...\n\n     She grabs the first thing she can get her hands on -- a glass of\n     water from one of the tables and hurls it toward the witness\n     stand before the bailiff can pin her arms against her sides.\n\n     INT. COURTHOUSE LOBBY - LATER\n\n     A mob scene.  Video crews are herded to one side by bailiffs as\n     Sandra and Baxter, with Kelly in tow, move toward a side door.\n\n     Sam and Ken round a corner, followed by Ray and Gloria who walk\n     on either side of Suzie.\n\n     Kelly sees them.  She makes a run at Suzie.  For a moment the\n     girls shove and kick but Ray and Gloria are between them in a\n     hurry, pulling then apart as Baxter arrives to take charge of\n     Kelly, pulling her toward the door.\n\n     Ruby and Walter arrive now too.  Suzie runs to them and they lead\n     her through the crowd, Walter pushing people aside with his long,\n     tattooed arms.\n\n     Gloria heaves a sigh.  Ray pushes a hand through his hair, then\n     turns to find Sam looking at him.  Most of the press have run off\n     to follow the girls -- looking for more action.  It is a quiet\n     moment.  The two men lock eyes.\n\n                                  SAM\n                  I've found that adolescents make the\n                  best liars.  They're old enough to be\n                  good at it, but you want like hell to\n                  believe them, because they're still\n                  children.\n\n     Ray just looks at him -- a hard stare.\n\n     EXT./INT. KEN'S T-BIRD - DAY\n\n     top down, speeds on a highway, banana palms on one side, the blue\n     Atlantic on the other.\n\n     Wind buffets Ken and Sam -- who has a dazed look.\n\n                                  KEN\n                         (hyped)\n                  Come on, let loose!\n\n                                  SAM\n                  I was just thinking about where I'm\n                  gonna stay.  I lost the house.  It's\n                  like waking up from a goddamn nightmare.\n\n                                  KEN\n                  You'll get over it. We've got a\n                  knockdown, airtight, motherfucker of a\n                  lawsuit against Sandra Van Ryan.\n\n                                  SAM\n                  Just like that?\n\n                                  KEN\n                  Just like that?  These people ruined\n                  your life, bro.\n\n     Ken pauses to thump the wheel with the butt of his hand.\n\n                                  KEN (CONT'D)\n                  I told you they were going overboard and\n                  they did... They'll settle.  Believe me.\n                  They'll be begging to settle...\n\n     At which point Ken spots something up ahead.  His smile broadens.\n     He swerves into the other lane, tooting his horn, waving, as...\n\n     The T-bird draws even with a sleek black limo.\n\n                                  SAM\n                  You don't think you're overdoing it?\n\n     He pulls off his neck brace, dangles it in front of Sam's face,\n     then tosses it out the window.\n\n     INT. LIMO - MOVING - SAME\n\n     Tom Baxter watches as the T-bird rockets off into the distance, a\n     white piece of foam rubber bouncing across the road in its wake.\n\n     A console TV is on -- news of the courthouse chaos.\n\n     Sandra is next to Baxter.  Kelly is on the opposite bench seat.\n\n                                  SANDRA\n                  I hope you're going to nail his scrotum\n                  to the nearest wall.\n\n                                  BAXTER\n                  That might have been a possibility, if\n                  little miss not-so-bright here hadn't\n                  started throwing things.\n\n                                  KELLY\n                  Fuck off.\n\n   Sandra lunges to slap Kelly.  Baxter stops it in midair.\n\n                                  BAXTER\n                  See what I mean...\n\n                                  SANDRA\n                  You're going to let them get away with\n                  this... this shit?  On the word of one\n                  little white trash bitch...\n\n                                  BAXTER\n                  You like seeing your name in the papers?\n\n     Sandra glares at him.\n\n                                  BAXTER (CONT'D)\n                  Leave town, Sandy.  Go to your place in\n                  St. Barts.  Let things cool down.\n\n     Sandra concentrates on the TV.\n\n                                  BAXTER (CONT'D)\n                  They'll try for twenty million.  The\n                  cheaper the lawyer, the higher the\n                  demand.\n\n                                  SANDRA\n                  You've got to be kidding.\n\n                                  HAXTER\n                  The man's life has been destroyed.\n                  There will always be doubters, no matter\n                  what happened in court.\n\n                                  SANDRA\n                  I'm not paying any idiot twenty million\n                  dollars.\n\n                                  BAXTER\n                  I said that's what they'd ask for.\n\n     Sandra stares from the window.  At last she turns to Kelly.\n         \n                                  SANDRA\n                  I hope you're happy.\n\n     Kelly seems to give this a moment's thought, then, smiling.\n\n                                  KELLY\n                  Ecstatic.\n\n     EXT. EVERGLADES - DAY\n\n     Sam cruises slowly across the water in his junked-out air boat.\n     He kills the engine, allowing the craft to glide to a stop.\n\n     He's close to where he found the big gator -- the same shabby\n     collection of whitewashed buildings we now RECOGNIZE as the\n     Glades Motel, shimmers in the distance.\n\n     Sam leans back, enjoying the silence.  He reaches into a cooler,\n     takes out a beer, opens it, takes a drink, then pulls something\n     else from the cooler --\n\n     -- a bundle of white butcher's paper.  Sam opens the paper, takes\n     out raw meat -- something disgusting to look at -- big red turkey\n     necks, maybe, which he tosses into the water.\n\n     ANGLE ON WATER\n\n     as the meat drifts down -- then, a sudden boiling, as -- quick as\n     the strike of a snake -- the huge gator EMERGES, jaws wide, to\n     snap up the morsel before slipping beneath the surface once mare.\n\n                                                 DISSOLVE TO:\n\n     INT. LAW OFFICE - DAY\n\n     Ken's Secretary opens the inner office door for Baxter.\n     Ken rises from a desk to greet him.\n\n                                  KEN\n                  Tom Baxter.  Good to see you again.\n\n                                  BAXTER\n                  Let's cut the crap.  What does your\n                  client want?\n\n                                  KEN\n                  Besides an apology?\n\n                                  BAXTER\n                  Unless you're planning on leaving Blue\n                  Bay, there's gonna be other cases, other\n                  days... You might want to keep that in\n                  mind.\n\n                                  KEN\n                  Okay Tom.  My client wants your client\n                  to saddle up... so we can ride her ass\n                  all the way to the bank.\n\n     EXT. BLUE BAY SCHOOL - DAY\n\n     A hot morning in June.  Shadows angle across the campus.\n\n     Students line up at the old wooden pagoda, picking up caps and\n     gowns.  A few turn, surprised to see...\n\n     SAM LOMBARDO cross the parking lot, ENTERS a building.\n\n     INT. ART'S OFFICE - ART\n\n     working at his desk.  Sam's terrarium is behind him, his\n     \"Educator of the Year\" Waterford bowl, a storage box of files.\n\n     Art looks up at a KNOCK on the DOOR.  Sam walks into the room.\n     It is a slightly awkward moment.\n\n                                  SAM\n                  Lizards don't seem to miss me.\n\n     The two men smile, breaking the tension.\n\n                                  SAM (CONT'D)\n                  How you doing, Artie?\n\n                                  ART\n                  I... You know... I...\n\n     Sam waves him off.\n\n                                  SAM\n                  Take care of my lizards, Art.\n\n     Art stands up.  The two men shake hands.\n\n     OUTSIDE GUIDANCE OFFICE\n\n     Sam comes out, then stops suddenly.\n\n     Kelly waits for him.  Kirk and Nicole are with her.  A long\n     moment.\n\n                                  SAM\n                  Kelly...\n\n                                  KELLY\n                  Drop dead... You know where my mom is\n                  trying to get the money to pay you off?\n                  She's trying to break my trust.  How do\n                  you like that?  I can't touch it until\n                  she's dead and she won't give me a dime\n                  and now she's trying to break it to pay\n                  you...\n\n                                  SAM\n                  Look, Kelly... I'm sorry... I know what\n                  you've been through... I should've seen\n                  something like this coning.\n\n     Art APPEARS in the door behind Sam.  Kelly cones closer.\n\n                                  KELLY\n                  Why don't you start fucking her again.\n                  You can spend it together.\n\n     Kirk tries to take Kelly's arm.  She jerks away, swings at Sam.\n\n     He ducks, dropping the Waterford BOWL, which SHATTERS upon the\n     floor.\n\n     Kirk bear-hugs Kelly.  She throws a notebook at Sam.\n\n                                  KELLY (CONT'D)\n                  I hate you!\n\n     She starts crying.  Kirk and Nicole drag her away as a crowd\n     gathers.\n\n     Sam, shaken, kneels over the broken crystal.  Art bends to help\n     him pick up the pieces.\n\n                                  SAM\n                  You see.  I couldn't stay, even if I\n                  wanted to.\n\n     EXT. STRIP MALL - NIGHT\n\n     Sam's Jeep is parked next to the T-bird and Jaguar.\n\n     INT. KEN'S OFFICE - SAME\n\n     Baxter, Ken, Sandra, Frankie stand watching, as Sam signs papers.\n     At last Sam looks up, faces Sandra -- not a happy moment.\n\n     Sandra gives him a long, hard stare, then walks from the room.\n     Frankie prepares to follow her, then stops, looks at Sam.\n\n                                  FRANKIE\n                  I'll be seeing you.\n\n     Sam just looks at him.  The big man leaves.  Baxter closes his\n     briefcase.\n\n                                  KEN\n                  So long, Tom.  Come by sometime.  We'll\n                  have lunch at the Beef Bowl.\n\n     Baxter stops, gives him a cold look, then a surprising smile.\n\n                                  BAXTER\n                  I don't think you're gonna be eating at\n                  the Beef Bowl anymore, kid.\n\n     He EXITS.  Ken goes apeshit -- whoops, dances around the desk,\n     drops into his chair, holds up the documents.\n\n     Sam watches, smiling, finally.\n\n                                  SAM\n                  Thanks Ken, you did okay.\n\n     Both men stand, they shake hands.  Ken claps him on the arm.\n\n                                  KEN\n                         (no clowning now)\n                  Look, I know there's a part of you\n                  wishes none of this had happened.  But\n                  it did.  Now take the money and get out\n                  of here.  Find a happy place.\n\n                                                 DISSOLVE TO:\n\n     EXT. EVERGLADES - NIGHT\n\n     Moonlit fog -- the vast swamp.\n\n     EXT. GLADES MOTEL - NIGHT\n\n     It's late.  A neon palm tree flashes across an empty lot as...\n\n     Sam's Jeep pulls in out of the night, parks before its bungalow.\n     Sam gets out, lifts his storage box of files from the rear.\n\n     INT. BUNGALOW - NIGHT\n\n     The neon's green light slashes across the dark walls through old\n     Venetian blinds.\n\n     Sam ENTERS, puts the file box on the floor.  Arches a sore back.\n\n     He reaches for a bedside lamp, stops, listens, decides it's\n     nothing, reaches again for the lamp, stops again, listening...\n\n     BZZZZZ -- the high-pitched WHINE of a MOSQUITO.  Then more -- a\n     flurry of BZZZZZZZZS\n\n     Sam frowns, sees...\n\n     A cloud of mosquitoes circling him.\n\n     He checks the front windows -- closed.  He goes around the bed.\n     The slightly ajar bathroom door with full-length mirror comes up\n     on his right.  Ahead is a rear window -- wide open.\n\n     Sam stops fast.\n         \n     Thinks.  Lets out a breath.\n\n                                  SAM\n                  Damn maid.\n\n     He steps to the window.  He looks down --\n\n     Muddy footprints.\n\n     Sam freezes.  He whirls around --\n\n     A sudden green FACE APPEARS in the big mirror -- like a nightmare\n     image -- lit by the neon flash, then DISAPPEARS.\n\n     Sam jumps back.\n\n                                  SAM\n                  Ahhhh!\n\n     The neon green face flashes again in the mirror -- DISAPPEARS.\n     Now the bathroom door slowly opens all the way.\n\n     Sam backs up, hits the wall.\n\n     Kelly Van Ryan steps out of the bathroom, a long object held at\n     her side, wrapped in a towel.\n\n                                  SAM\n                  Jesus Christ, what are you doing?\n\n                                  KELLY\n                  So you got my mom's money.\n\n     Sam tries to breathe, manages a nod.\n\n                                  KELLY (CONT'D)\n                  How much?\n\n     Kelly prods him with the concealed object.\n\n                                  KELLY (CONT'D)\n                  How much?\n\n                                  SAM\n                  About six and a half million dollars.\n\n     Kelly raises the abject covered by the towel, aims it at Sam.\n\n                                  KELLY\n                  Your turn to pay.\n\n     A moment -- then she yanks the towel away to REVEAL --\n\n     --  a two-foot-long novelty penis with giant balls.  Her hand\n     grips the acrylic scrotum like the butt of a gun.\n\n                                  KELLY (CONT'D)\n                  King Dong!  That's you, Sam!\n\n     She screams with joy, vaults into his arms, wraps those perfect\n     thighs around him.  The dildo goes flying.  They fall on the bed.\n\n                                  KELLY (CONT'D)\n                  It worked!  We screwed the bitch!\n\n     She's all over him now -- tongue kisses.\n\n                                  KELLY CCONT'D)\n                  It worked just like you said it would.\n\n     He kisses her, finally gets her to sit, straddling him.\n\n                                  SAM\n                  God, you scared the shit out of me.  You\n                  must be crazy coming here.\n\n                                  KELLY\n                  Of course I'm crazy.  Ask my mom.\n\n     She kisses him again, more passionately now.  He gets into it,\n     tears her blouse open, putting his tongue to her breasts.\n\n     A SHADOW moves on the wall, looming above them.  Sam sees it, his\n     eyes widen.  He tries to sit up, as...\n\n     BANG! -- an EXPLOSION.  Sam jumps, knocks Kelly to his side.\n\n     A champagne cork hits the ceiling.\n\n     Suzie Toller stands over the bed with a foaming champagne bottle.\n\n                                  SUZIE\n                  How much is about six and a half million\n                  divided by three?\n\n                                  SAM\n                  Jesus.  Two million one hundred\n                  thirty-three thousand three hundred\n                  thirty-three and change.\n\n     Kelly screams in joy again.\n\n                                  SAM (CONT'D)\n                  Now calm down.  Both of you.\n\n     The girls put on mock serious expressions.\n\n                                  SAM (CONT'D)\n                  From now on, if we're seen together,\n                  it's got to be accidental.  I thought\n                  that was understood...\n\n                                  KELLY\n                  Hey, come on... We've got to have at\n                  least one victory party.\n\n     Kelly grabs the champagne, takes a long gulp, pours some on her\n     breasts as she straddles Sam once more, inviting him to lick them\n     clean.\n\n                                  SAM\n                  Kelly, for christ's sake...\n\n     She has begun to move like a lap dancer, inviting him to take her\n     breasts in his mouth, putting a hand to his crotch...\n\n                                  SAM (CONT'D)\n                  The only way we're gonna blow this now,\n                  is if we do it ourselves...\n\n                                  KELLY\n                         (her hand in his crotch)\n                  Do it to ourselves?\n\n                                  SAM\n                         (weakening)\n                  We have to stick with the plan.\n\n                                  KELLY\n                  Stick?\n\n     Sam gives up, lays back as Kelly undoes his pants, then moves to\n     get him inside her.\n\n     Suzie watches.  She takes another drink, then tosses the bottle,\n     pulling off her top, REVEALING her small, white breasts, a couple\n     of tattoos, a pierced nipple.  She slips behind Kelly, fondling\n     Kelly's breasts as Sam arches beneath them both -- all of them\n     totally into it now, losing themselves in the sex...\n\n                                                 FADE TO:\n\n     INT. DETECTIVZS' ROOM, BLUE BAY POLICE STATION - NIGHT\n\n     The room is dark and empty, with the exception of a single desk\n     lamp, by which halo we find...\n\n     Ray Duquette, in an aloha shirt, waiting as his computer's\n     printer finishes a job, as suddenly...\n\n     ... a new light rushes into the room.  Ray turns to find Gloria\n     standing in the doorway.  He stops as his printer finishes the\n     job.  He pulls out the paper, looks at it, smiles.  Gloria walks\n     to his desk.\n\n                                  RAY\n                  You saw the news today?\n\n                                  GLORIA\n                  Lombardo's settlement?\n\n     Ray nods.\n\n                                  GLORIA (CONT'D)\n                  Yeah, well, I told you they were gonna\n                  make us look stupid.\n\n     Ray gives her a long look.  Gloria waits a moment, shrugs.\n\n                                  RAY\n                  Hey, don't back away from it, you were\n                  right.  We did look stupid.\n                         (beat)\n                  What you were wrong about, is who made\n                  us look that way.\n\n     Gloria just looks at him, puzzled.\n\n                                  RAY (CONT'D)\n                  Think back, before the suit was filed,\n                  before the trial.  Lombardo had an\n                  affair with Sandra, right?\n                         (Gloria nods)\n                  So why not tell us about the affair?  I\n                  mean it could be a hell of a motive for\n                  Kelly to fabricate her charge in the\n                  first place.\n\n                                  GLORIA\n                  Maybe Lombardo's attorney was saving the\n                  affair for the trial.\n\n                                  RAY\n                  I thought of that.  Then I said, come\n                  on, you're Lombardo.  Your reputation is\n                  getting trashed.  You want to stop the\n                  bleeding.  You don't want to sit in jail\n                  for three months.  Unless...\n\n                                  GLORIA\n                  Unless what?\n\n                                  RAY\n                  Unless you're setting up Sandra Van Ryan\n                  for the big payday.\n\n     It is quiet in the office, save for the soft BUZZ of Ray's\n     COMPUTER.\n\n                                  RAY (CONT'D)\n                  They chumped us, Gloria, right from the\n                  start.\n\n                                  GLORIA\n                  Why?  You ask me, Lombardo had it pretty\n                  good already, nice job in a beautiful\n                  setting, popular, an active social life.\n                         (beat)\n                  He's gonna put this all on the line for\n                  some dicey play like what you're\n                  describing...\n\n                                  RAY\n                         (interrupting)\n                  The job looks okay to us.  But look at\n                  it from his point of view.  The man's\n                  surrounded by wealth and privilege.  But\n                  for him... it's just a reminder of what\n                  should have been his.\n\n     Gloria gives this a moment's thought.\n\n                                  RAY (CONT'D)\n                  Your old man graduates from Blue Bay\n                  School, you're not supposed to wind up\n                  there.  Board of Directors maybe, but\n                  not in the lousy guidance office.  Now.\n                  Point number two.\n                         (he taps at the printout\n                          on his desk)\n                  I've run a financial on Lombardo.  Guy\n                  was eyeball-deep in debt before this all\n                  happened -- trying to keep up with\n                  pricey trim like Barbara Baxter.\n\n     He passes the printout to Gloria.  She looks at it, thinking.\n\n                                  GLORIA\n                  So what about the girls?  Suzie's poor,\n                  but why would Kelly have to steal from\n                  her own mother?  Surely her father...\n\n                                  RAY\n                         (interrupting)\n                  Her father didn't leave her squat.  The\n                  kid's got money in trust from her\n                  grandfather, but she can't touch that\n                  till her mother dies and Sandra seems to\n                  have the idea that Kelly ought to learn\n                  the value of a buck.\n\n     Gloria looks over Lombardo's financial once more, tosses it on\n     the desk, then studies Ray -- long beat.\n\n                                  GLORIA\n                  This one's got you working overtime,\n                  hasn't it?\n\n                                  RAY\n                  I flat don't like the guy, Glory.  He's\n                  dirty.  And I'll tell you something\n                  else.  You want to know how old man\n                  Lombardo lost his money?\n                         (beat)\n                  He was fucked out of it by old man Van\n                  Ryan, on a little item known as the Salt\n                  Creek Land Deal.\n                         (beat)\n                  It was after the war.  Van Ryan set up a\n                  corporation to develop swamp land, got\n                  investors like Lombardo to put up money,\n                  then turned around and got the state to\n                  declare the area an ecological preserve,\n                  on the sly, of course, but everyone knew\n                  it was him.  The freeway went to the\n                  coast, right where Van Ryan wanted it.\n\n                                  GLORIA\n                  Eliminate the competition.\n\n                                  RAY\n                  You got it.  The rich got richer.  While\n                  the saps like Lombardo went belly-up in\n                  the swamp.\n\n     Gloria looks at him a long moment.\n\n                                  GLORIA\n                  Where'd you come up with this stuff,\n                  anyway?\n\n                                  RAY\n                         (a long beat; then\n                          beneath a smile)\n                  I net a guy in a bar.\n\n     EXT. A BANK, BLUE BAY - DAY\n\n     Sam walks down the steps, gets into his Jeep, and drives away.\n\n     Across the street -- the white Taurus -- Ray and Gloria watch.\n\n     EXT. YACHT BROKERAGE - DAY\n\n     Sam comes out, rounds a corner and is gone.\n\n     Ray Duquette steps INTO FRAME, turns into the brokerage.  The\n     door swings shut behind him.\n\n     INT. SWIMMING POOL, BLUE BAY SCHOOL - DAY\n\n     Girls in tank suits finish laps, towel off.  As the girls begin\n     to walk toward the lockers, they encounter...\n\n     Ray Duquette, threading his way among the girls, his eye on...\n\n     Kelly, alone on the deck, still dripping -- a Botticelli vision.\n\n                                  RAY (O.S.)\n                  Nice stroke.\n\n     Kelly, startled, turns to find Ray walking toward her across the\n     deck.  She snatches a towel from one of the racing platforms and\n     begins to dry herself, wrapping the towel around her.\n\n                                 KELLY\n                  Is there some reason why you're here?\n\n                                 RAY\n                  Curiosity, I guess.\n\n                                 KELLY\n                  About what?  How to improve your breast\n                  stroke?\n\n     Ray gives her a cold smile.\n\n                                 RAY\n                  Actually, I was curious about how you\n                  see things working out, for you, Sam and\n                  Suzie.\n\n     This appears to give her pause, a moment of hesitation.\n\n                                  KELLY\n                  Excuse me?\n\n                                  RAY\n                  You all gonna go down to the Caribbean\n                  together?\n\n     Kelly looks around the pool area.  A number of girls are watching\n     from a corner of the deck, but no one is close enough to hear.\n\n                                  RAY (CONT'D)\n                  The thing about it is, threesomes so\n                  rarely work out.\n\n                                  KELLY\n                  You're out of your mind.\n\n                                  RAY\n                  I've been a cop for a while, Kelly.\n                         (beat)\n                  It's hard enough for one person to keep\n                  a secret, let alone three.  And then\n                  there's the love angle.  I mean do you\n                  and Sam really want that little\n                  pill-head around, now that you have the\n                  money?\n\n     Kelly starts to walk away.  Ray cuts her off.\n\n                                  RAY (CONT'D)\n                  Am I right, did Sam sell you on the idea\n                  right up front, of whacking Suzie?\n                  That's murder, Kelly.\n\n                                  KELLY\n                  Police -- God -- get a life.\n\n     She moves around him and walks calmly away.\n\n                                  RAY\n                         (loud enough to make\n                          himself heard)\n                  You're good.  But you don't think that\n                  little ditz Suzie's gonna hold together,\n                  do you?\n\n     Kelly continues to walk, her face giving nothing away, as Ray's\n     WORDS ECHO over the pool.\n\n     EXT. BLUE BAY SCHOOL PARKING LOT - LONG SHOT - LATER\n\n     Only a few cars left -- one of them Suzie's old VW bug, at the\n     side of which Kelly and Suzie engage in heated conversation.\n\n     CLOSER - SUZIE\n\n     paces around Kelly.\n\n                                  SUZIE\n                  You don't know Duquette.  I'm the one he\n                  busted... He's a fucker, man... He'll\n                  fuck us both over...\n\n     Kelly tries to take her by the arm.  Suzie jerks away.\n\n                                  SUZIE (CONT'D)\n                  I'm not going back to that prison.\n                  That's what it was... a fucking hell\n                  hole...\n\n     Kelly looks around the lot.  She takes Suzie by the arm once\n     more, this time more firmly, pulling Suzie to her.\n\n                                  KELLY\n                  Will you calm down.  Duquette's gonna\n                  come to you just like he did to me.\n                  You're gonna have to be ready for him.\n\n                                  SUZIE\n                  Yeah, but he can't push you around like\n                  he can me.  You've got family and\n                  they've got clout.  With we it's\n                  different... with me...\n\n                                  KELLY\n                         (circling her with her\n                          arm)\n                  Yeah, I've got family and they've got\n                  clout and now you have me.  Right?  And\n                  Sam.  Believe me, Suzie, this dickhead's\n                  not going to send you anywhere.  He's\n                  gonna try and rattle your cage, and\n                  that's it.  Stay strong and he can't do\n                  shit.\n\n                                  SUZIE\n                         (a long beat)\n                  Man, I wanna smoke a joint.\n\n     PULL BACK to REVEAL -- in the distance -- the white Ford Taurus\n     at the side of the road leading to the school.\n\n     The car is pulled just far enough off the road to be mostly\n     hidden among pampas grass and oleander, but angled in such a way\n     as to afford a view of the two girls now hugging in the lot.\n\n     EXT. SMILIN' JACK'S FISH CAMP - NIGHT\n\n     Suzie wanders along the canal, smoking a joint.  At her back a\n     few faint lights flicker here and there in the windows of\n     trailers.  She walks down to the little dock, sits on a rail,\n     takes another hit.\n\n                                  VOICE (0.S.)\n                  'Evening, Suzie.  How was school today?\n\n     Suzie freezes, holds back her exhale, looking around...\n\n     A shadow stirs in one of the skiffs tied to the dock.  A man\n     stands, walks up the couple of wooden stairs.  The light from a\n     trailer across the road glances off steel-rimmed glasses as Ray\n     Duquette steps onto the dock.\n\n     Suzie gags on the smoke in her lungs, coughs.  She squeezes the\n     lit roach into her palm, then tosses it into the canal.\n\n                                  RAY\n                  You ought to watch it with that shit,\n                  Suzie.  You get busted again, you go\n                  back in a two-tine loser.\n\n                                  SUZIE\n                  You got something against cigarettes?\n\n     Ray just laughs at her.\n\n                                  RAY\n                  Yeah, they're bad for your health.\n                         (beat)\n                  I'm tryin' to look out for you...\n\n                                  SUZIE\n                  That's cop bullshit.\n\n                                  RAY\n                  Well, you're half right.  Best thing you\n                  could do for yourself right now would be\n                  to talk to me.\n\n                                  SUZIE\n                  About what?\n\n                                  RAY\n                  Every triangle I've ever seen never\n                  lasts.  Somebody's got to go.\n\n                                  SUZIE\n                  Is this supposed to mean something to\n                  me?  What triangle?\n\n                                  RAY\n                  You, Kelly, Sam.\n\n                                  SUZIE\n                  I don't have to listen to this.  And you\n                  can't shove me around.  I have friends\n                  now...\n\n     She catches herself, falters.\n\n     Ray laughs once more.\n\n                                  RAY\n                  Is that what you think?  You have\n                  friends?  Is that what they told you?\n\n                                  SUZIE\n                  I don't mean who you're thinking.  I\n                  have other friends...\n\n                                  RAY\n                  Suzie, Suzie... This is me, Ray, you're\n                  talking to.  We both know you don't have\n                  shit, never have had shit, never will\n                  have shit...\n\n     He takes a sheet of paper from his coat.\n\n                                  RAY (CONT'D)\n                  Here, Suzie.  I want you :o look this\n                  over.  Know what it is?\n                         (as Suzie takes it)\n                  Sam deposited his check, transferred the\n                  funds to an offshore bank, a numbered\n                  account.  Not even the cops can find out\n                  whose names are on it.  Think one of\n                  them's yours?\n\n     Suzie looks over the paper.\n\n                                  RAY (CONT'D)\n                  He also put a down on some island\n                  property, and a lease-to-buy on a\n                  forty-foot sailboat.  You're into\n                  sailing, aren't you, Suzie?\n\n     Suzie thrusts the paper back at Ray.\n\n                                  SUZIE\n                  Get away from me.\n\n                                  RAY\n                  Don't you see what this means?  You\n                  really think Sam and Kelly are gonna\n                  give you a third of the money?  You, the\n                  pill-head with the rap sheet?\n\n                                  SUZIE\n                  Shut up.\n\n     Ray smiles at her.  He moves up close.\n\n                                  RAY\n                  You know, I don't think I ever told you\n                  I was sorry about your little friend...\n                  What was his name?\n\n     Suzie tries to back away.  She bumps against the rail.  Ray\n     reaches out, takes her hand in both of his.\n\n                                  RAY (CONT'D)\n                  Come on, Suzie, help me out here.  You\n                  know his name.\n\n     Suzie looks scared, in a way she hasn't before.  When she speaks\n     her voice is scarcely above a whisper.\n\n                                  SUZIE\n                  Davy.\n\n                                  RAY\n                         (nodding, a scary smile)\n                  That's right.  That was his name.\n\n     The smile fades, as if he's thinking about something, still\n     holding her hand, rubbing it with his fingers.\n\n                                  RAY (CONT'D)\n                  Sometimes I wonder if you're really as\n                  dumb as you pretend to be.\n\n     He looks into Suzie's eyes, slowly opening her hand to REVEAL the\n     burn mark on her palm.\n\n                                  RAY (CONT'D)\n                  But you know what?  I'd be keeping a\n                  clear mind right now if I were you.\n                         (beat)\n                  I'd hate to see you come to a bad end.\n                  Like Davy did.\n\n     He holds her hand a moment longer, then drops it.  He goes back\n     down he steps to the little skiff.  An outboard MOTOR STARTS in\n     the night.\n\n     INT. SUZIE'S ROOM - NIGHT\n\n     Suzie cones in fast, grabs the phone, punches out a number.\n\n                                  SAM (V.0.)\n                         (answering machine)\n                  This is Sam.  I'm not in right now...\n\n     EXT./INT. RAY'S PICKUP - NIGHT\n\n     parked behind some cottonwoods in a small launch area where the\n     highway crosses both the canal and the road to the fish camp.\n\n     The skiff has been shoved into the bed.  Ray sits at the wheel.\n     He removes his glasses, wipes his face with a handkerchief, then\n     starts at the uneven 50UNDS of a tired ENGINE, looks up to see...\n\n     HEADLIGHTS\n\n     Suzie's VW bouncing along the dirt road, turning onto the\n     highway.\n\n     RAY'S TRUCK - RAY\n\n     watching, then starting his truck and pulling out onto the\n     highway, following the tiny red lights of Suzie's bug.\n\n     SXT. VAN RYAN ESTATE - MAIN GATE - NIGHT\n\n     Suzie's VW idles.  She leans out the window, talks to the\n     intercom, the gate opens.  The VW ENTERS.  The gate closes.\n\n     Ray's pickup drives past.  He drives to a big lot where one of\n     the mansions has been torn down.  He drives up onto the dirt,\n     keeps going, right down to the water's edge where he pulls his\n     little skiff out of the back once more.\n\n     He walks back to the truck, pulls off his sport coat, hangs a\n     Hi-8 video camera over his shoulder and wades out into the calm\n     waters of the bay, pushing the skiff, then climbing in.\n\n     EXT. VAN RYAN ESTATE, REAR OF MAIN HOUSE - NIGHT\n\n     Suzie follows Kelly past the pool, which is all lit~up, and on\n     toward the jacuzzi.  The whole deck is tiled in black-and-white.\n\n     Kelly's in a bikini -- the killer body.  Suzie, the contrast --\n     pale, skinny, boyish, in a T-shirt and cutoff jeans.  They\n     argue -- we CANNOT HEAR.\n\n     EXT. THE BAY - SAME\n\n     Ray has arrived near the docks.  He has killed his engine,\n     maneuvering here with a single oar.  He ties the skiff off behind\n     the Jonathan, then climbs to the dock, moving around the guest\n     house and coming close to the pool.  He takes a position behind\n     the cabanas, readies his camera.\n\n     EXT. POOL AREA - SAME\n\n     Kelly and Suzie continue their argument in front of the jacuzzi.\n\n                                  KELLY\n                  I can't believe you called Sam.  What's\n                  the matter with you?\n\n                                  SUZIE\n                  I'm scared, that's what.  I'm scared\n                  there's no one to trust.\n\n                                  KELLY\n                  You can trust me.\n\n     A cordless PHONE RINGS on the patio chair.  Kelly and Suzie are\n     startled by it.  Kelly answers.\n\n     INT. SAM'S BUNGALOW - NIGHT\n\n     The bedside lamp is on.  Sam is on the phone.\n\n                                  SAM\n                  Kelly.  Is Suzie there?\n\n                                  KELLY (V.O.)\n                  Yes.\n\n                                  SAM\n                  Shit.  I was afraid of that.  She left\n                  this garbled message on my machine.\n                         (beat)\n                  Can you calm her down?\n\n                                  KELLY (V.0.)\n                  Why can't you come...\n\n                                  SAM\n                  No!  Christ.  Listen, Kelly, I'm\n                  counting on you.  You calm her down.\n                  I mean do whatever you have to, whatever\n                  it takes...\n\n                                  KELLY (V.O.)\n                  You know what it takes.\n\n                                  SAM\n                  Then do it.  I need you on this Kelly.\n                  Do it tonight.  We'll figure something\n                  out... Okay?\n\n     EXT. JACUZZI - NIGHT\n\n     Kelly glances across the steamy water at Suzie.\n\n                                  KELLY\n                  Yeah, right.  Can you at least talk to\n                  her, on the phone?\n\n     NT. SAM'S BUNGALOW - SAME\n\n     Sam lies on his bed, waits for Suzie's voice on the line.\n\n                                  SUZIE (V.O.)\n                  Sam...\n\n                                  SAM\n                  Put Kelly on too.\n\n     EXT. JACUZZI - SAME\n\n     The girls stand cheek-to-cheek, the phone between them.\n\n                                  KELLY\n                  I'm here.\n\n     INT. SAM'S BUNGALOW - SAME\n\n                                  SAM\n                  Okay.  I want you to hear this too.\n                  We've got to be cool.  All of us.\n                  People think I'm rich, for Christ's\n                  sake.   I'm doing what rich guys do.\n                         (beat)\n                  I'm spending my money.  It's more\n                  suspicious if I sit around doing\n                  nothing.  Now don't let this cop fuck\n                  with your minds.\n\n     EXT. CABANAS - NIGHT\n\n     Ray tapes the scene.\n\n     The girls still hold the phone.\n\n                                  SUZIE\n                  But I..\n\n                                  SAM (V.0.)\n                  Shut up.  Don't fall apart.  The only\n                  people who can blow this is us.\n                  Remember?\n\n                                  KELLY\n                  Right.\n\n     Suzie says nothing.  Kelly nudges her.\n\n                                  SUZIE\n                  Yeah, right.\n\n                                  SAM (V.0.)\n                  Good.  Just keep telling yourselves\n                  that, the only people who can fuck this\n                  up is us.\n\n     The line goes dead.  Kelly hangs up.  Suzie stares into the\n     jacuzzi.\n\n                                  SUZIE\n                  You're gonna fuck me over, aren't you?\n\n                                  KELLY\n                  Oh, for Christ's sake.\n\n                                  SUZIE\n                  You are.\n\n                                  KELLY\n                  Are you retarded, or just brain dead\n                  from whiffin' fumes out there in the\n                  swamp...\n\n     Suzie's face goes hard.\n\n                                  SUZIE\n                  That's what I am to you, isn't it?\n                  Swamp trash.  It's what I am to\n                  everybody, just like my mom...\n\n     Kelly tries to put an arm around her.  Suzie slaps her -- a\n     mistake -- Kelly's bigger, faster.  She slaps the side of Suzie's\n     head, then grabs her legs, dumping her on the tile deck.\n\n     ON RAY\n\n     focusing the camera.\n\n     Suzie tries to kick Kelly.\n\n     Something changes in Kelly, a scary, calm rage.\n\n                                  KELLY\n                  Stupid bitch.\n\n     She very methodically grabs Suzie's hair, dragging her into the\n     jacuzzi, holding her under the hot water.\n\n     Suzie thrashes, breaks free, gags, arches out of the water, the\n     wet T-shirt clinging to her small breasts.\n\n     Kelly is on her again, slaps her, puts her hands to Suzie's\n     throat -- violently sexual in her wet bikini.\n\n     Kelly slams Suzie back onto the black-and-white tile, gets on top\n     of her, knees between Suzie's legs, her hands on her throat.\n\n     Suzie's skinny shape writhes underneath Kelly on the gleaming\n     tile.  She gasps for air.  Kelly finally lets go, but remains on\n     her knees between Suzie's legs, breathing hard.  A moment.  Kelly\n     touches Suzie's face.\n\n                                  KELLY\n                  Why do you make me hurt you?  It's like\n                  you want it or something.\n\n     Suzie sobs, takes Kelly's hand.\n\n                                  KELLY (CONT'D)\n                  God, you are scared, aren't you?\n\n     Suzie runs her lips over Kelly's fingers, then pushes her T-shirt\n     up, pushing Kelly's hand onto her breast.\n\n                                  KELLY (CONT'D)\n                  And this is going to make you feel\n                  better, make you trust me...\n\n     Suzie nods, tearing her T-shirt, getting both of Kelly's hands\n     onto her breasts, then pushing at Kelly's wrists, getting her to\n     pull at her nipples, hard... Kelly obliges...\n\n     Suzie cries out in pain.  Kelly's hands move down to pull off\n     Suzie's bottoms...\n\n     ON RAY\n\n     still at it with the video, his face impassive, watching.\n\n     As Kelly pulls Suzie back into the jacuzzi, as the girls' hands\n     slide round the curves of each other's hips, pulling themselves\n     to each other, as the layers of steam rise to envelope them...\n\n                                                 CUT TO:\n\n     VIDEOTAPE\n\n     Kelly and Suzie making love in the jacuzzi.\n\n     PULL BACK to REVEAL --\n\n     INT. POLICE ROOM - DAY\n\n     Gloria, Ray, Hunter watch the tape.  Hunter's seen enough.  He\n     slams the stop/tape.\n\n                                  HUNTER\n                  Are you crazy, Ray?\n\n                                  RAY\n                  You heard Kelly say \"Sam.\"  That was\n                  Lombardo on the phone.  And you saw the\n                  girls...\n\n                                  HUNTER\n                  Ray.  The conversation on this tape is\n                  totally unintelligible.\n                         (beat)\n                  What we have here, is you on the Van\n                  Ryan property, without a proper warrant,\n                  shooting a porn flick...\n\n                                  RAY\n                  I don't believe I'm hearing this.  A\n                  month ago you were pulling these two\n                  apart at the courthouse.\n                         (beat)\n                  They were acting.  They were all acting,\n                  from the beginning.  And we bought it,\n                  hook, line and sinker... And now they're\n                  home free with six million of Sandra Van\n                  Ryan's money.\n\n                                  GLORIA\n                  Which she might have saved, if she\n                  hadn't set out to destroy the man's\n                  life.\n\n                                  RAY\n                         (turning now on Gloria)\n                  What?  You wouldn't go after some guy\n                  you thought raped your daughter?\n                         (beat)\n                  Cone on.  She bought the same story we\n                  did...\n\n     Ray stops as Hunter brings the palm of his hand down on the table\n     a loud SLAP.\n\n                                  HUNTER\n                  Listen, both of you.  You're not on a\n                  case.  There is no fucking case.\n                         (beat)\n                  I've had it up to here with Sandra Van\n                  Ryan.  Ray, you keep mucking around like\n                  this and you are going to have her suing\n                  us for invasion of privacy.  Get out of\n                  these people's lives.\n                         (beat)\n                  Am I getting through on this?\n\n     Ray walks to the door, jerks it open --\n\n     INT. CORRIDOR - DAY\n\n     Sam, angry, sits in the corridor with a uniformed officer.\n\n     Hunter sees Sam, rolls his eyes.\n\n                                  HUNTER\n                  Oh, Ray... no...\n\n                                  RAY\n                  You think this is just about money,\n                  about us looking foolish?  Question him.\n                  You're gonna find a stone cold\n                  manipulative psychopath.  And those\n                  girls are going to wind up dead...\n\n     Sam lunges at Ray.  The officer and Hunter restrain him.  Gloria\n     looks on, taken aback by Ray's accusations, Sam's response.\n\n                                  HUNTER\n                  Mr. Lombardo, please.  I'm sorry about\n                  this.\n\n                                  SAM\n                  Give this idiot something to do.  Let\n                  him look into the Kennedy assassination.\n\n     Ray flares, grabs Sam, shoves him against the wall, before they\n     can be separated once again.\n\n                                  SAM (CCNT'D)\n                         (to Hunter)\n                  Next time this guy drags me down here,\n                  I'll sue you.  You're goddamn lucky I\n                  didn't sue you the first time!\n\n     Sam storms from the room, followed by Hunter.  Ray stares after\n     them, finally he turns, looks at Gloria, collecting himself.\n\n                                  RAY\n                  Guess I kind of lost it there.\n\n                                  GLORIA\n                  You could say that.\n\n                                  RAY\n                  Were you ever in a situation where you\n                  could see a thing coming and you didn't\n                  do what you could to stop it?\n\n     Gloria studies Ray, clearly concerned.\n\n                                  GLORIA\n                  We all have...\n\n                                  RAY\n                  I mean something bad, Gloria, something\n                  bad you saw coning, and you didn't do\n                  anything, and then it happened.\n                         (off Gloria's silence)\n                  I did that once.  I don't want to do it\n                  again.\n\n     EXT. MALL ENTRANCE - LATE AFTERNOON\n\n     Sam EXXTS a building, a large package of wrapped goods beneath\n     his arm.  He looks toward the parking lot where --\n\n     Barbara Baxter stands beside the red Mercedes.  She tips a valet\n     then starts toward the mall.  She sees San.  Their eyes meet.  A\n     moment of hesitation, as neither is quite sure what to say.\n\n                                  SAM\n                  You look pretty.\n\n                                  BARBARA\n                  Thanks.\n\n     Sam smiles.  She points to the stuff beneath his arm.\n\n                                  BARBARA (CONT'D)\n                  Quite a shopping spree...\n\n     She's kidding, then seems to consider how Sam might take it.\n\n                                  BARBARA (CONT'D)\n                  I didn't mean...\n\n     Sam laughs it off.\n\n                                  SAM\n                  Hey, I've got it, I may as well spend\n                  it, right?  I've always wanted to live\n                  where I could dive for my dinner.\n\n                                  BARBARA\n                  And where might that be?\n\n                                  SAM\n                  I was thinking, Antigua, maybe.\n\n                                  BARBARA\n                  I love Antigua.\n                         (beat)\n                  Maybe I'll come visit you.\n\n                                  SAM\n                  I'd like that.\n\n     A moment, she touches his face.  Sam raises a hand to cover hers,\n     as...\n\n     ... in b.g., a BLACK RANGE ROVER -- just the roof VISIBLE above\n     the tops of the other cars, cruises the lot.\n\n     INT. RANGE ROVER - KELLY VAN RYAN\n\n     seated at the wheel, parks, stares toward the mall entrance.\n\n     ANGLE ON ENTRANCE - KELLY'S POV\n\n     Sam and Barbara stand in the orange light, hand-in-hand.  Barbara\n     leans forward, kisses Sam on the lips.\n\n     CLOSE ON KELLY\n\n     lost in thought, when she is startled by a sudden CACOPHONY of\n     ENGINE NOISE.  She turns to find...\n\n     Suzie's BUG, SPLUTTERING and BELCHING smoke, parks next to her.\n\n     Suzie opens the door of the Rover, jumps in.  She's wearing a\n     black ball cap, armed with a huge straw bag.  As she settles in\n     the seat, she lets out a long breath.\n\n     Kelly makes a face, fans the air.\n\n                                  KELLY\n                  Jesus.  What are you drinking?\n\n     Suzie laughs, pulls a bottle of Mad Dog 20/20 from the bag.\n\n                                  KELLY (CONT'D)\n                         (looking at the bottle)\n                  Anybody ever tell you that stuff will\n                  rot your brain?\n\n                                  SUZIE\n                  What brain?\n\n     Suzie takes a big drink.  Kelly shakes her head, looks back\n     toward the entrance.\n\n     ANGLE ON ENTRANCE - KELLY'S POV\n\n     empty.  Sam and Barbara are gone.\n\n     Kelly continues to stare.\n\n                                  SUZIE\n                  What are you looking at?\n\n                                  KELLY\n                         (starting the car)\n                  Nothing.\n\n     EXT. THE BEACH - NIGHT\n\n     The Atlantic rolls before a long stretch of empty sand as the\n     last red light drains from the sky.\n\n     The Range Rover comes down onto the sand, parks.\n\n     INT./EXT. RANGE ROVER - SAME\n\n     Kelly turns off the engine.  Suzie tokes on a joint, swills the\n     MD 20/20.  She gazes upon the sea, eyes at half-mast.\n\n                                  SUZIE\n                  I thought we were goin' to a movie.\n\n                                  KELLY\n                  I think we just need to get wasted.\n\n     Suzie shrugs, gets out.  Kelly gets out with her.  Suzie\n     staggers.  Kelly circles her with an arm, looks nervously around,\n     begins leading her down the beach.\n\n                                  SUZIE\n                  I wanna live at the beach someday.\n\n                                  KELLY\n                  Shit.\n\n     She stops walking.  Suzie takes a few more steps then turns to\n     look at her.\n\n                                  KELLY (CONT'D)\n                  I left the keys.  I'll get 'em.\n\n     Suzie plops down on the sand, drinks from the bottle.  She\n     watches Kelly fading into the darkness, mumbles something beneath\n     her breath, then lies on her back.\n\n     SUZIE'S POV - THE NIGHT SKY\n\n     The SOUND of CRASHING WAVES.  She rolls to one side, looking down\n     the beach\n\n     Murky blackness.\n\n     She tries to focus, sits up.\n\n                                  SUZIE\n                  Kelly?\n\n     She stands -- wobbly -- peers down the beach.\n\n     A shape EMERGES in the blackness, moving toward her.\n\n                                  SUZIE (CONT'D)\n                  Kelly?\n\n     The shape gets closer and closer, until...\n\n     Sam Lombardo steps up to loom over Suzie.\n\n     She takes a step back.\n\n     Sam puts a hand on her shoulder.  He carries something in his\n     other hand -- hard to see on the dark beach.\n\n                                  SAM\n                  Suzie, it's okay.  It's me.\n\n     Suzie steadies herself.  A face APPEARS behind Sam -- Kelly.\n\n                                  SAM (CONT'D)\n                  I was worried about you, Suzie.  I\n                  decided we should all get together, one\n                  more time, before we split up.\n\n                                  SUZIE\n                  Are you mad at me?\n\n                                  SAM\n                  No, no.  Look, I probably should have\n                  told you a little more, about the part I\n                  intended to play.\n                         (beat)\n                  We'll go through it all again tonight.\n\n     Sam takes the bottle from Suzie, looks at it.\n\n                                  SAM (CONT'D)\n                  This is a celebration Suzie, not a\n                  suicide pact.\n\n     He lifts the object in his other hand -- a champagne battle.\n\n                                  SAM (CONT'D)\n                  We'll chill out first, have a drink,\n                  watch the stars.\n\n     Suzie nods.\n\n                                  SAM (CONT'D)\n                  Kelly, there's a beach blanket in the\n                  Jeep.  Could you get it for us?\n\n     Kelly nods, starts back, looks once over her shoulder as...\n\n     Sam leads Suzie toward a huge rock formation.\n\n                                  SAM (CONT'D)\n                  Let me tell you about this boat I picked\n                  out for us...\n\n     They move OUT OF SIGHT.  Kelly continues to walk, back along the\n     sand toward the cars.\n\n     INSERT - A SCREAM\n\n     A sickening hollow THWACK -- an arc of blood and two teeth fall\n     silently on dark stone.\n\n     Kelly begins to run, stumbling through the sand to Sam's Jeep,\n     where she pulls a big roll of clear plastic from behind the\n     seats.  She stuffs it under her arm, then runs back along the\n     beach.  As she runs, she can hear them -- more THWACKS, MOANS --\n     it seems like forever\n\n     Sam APP£ARS before her on the sand.  The champagne bottle swings\n     loosely at the end of one arm.  it looks shiny now, dripping with\n     Suzie's blood.\n\n     Kelly goes to him.  She looks at the bottle, then throws herself\n     against him -- a hard kiss.\n\n                                  SAM\n                  I'm sorry, Kelly.  I'm sorry it had to\n                  happen like this.  She was losing it...\n\n                                  KELLY\n                         (breathless)\n                  There was no way.  That cop would've\n                  gotten her to tell him... everything.\n                  She was weak and dumb...\n\n     She kisses him again, her hands moving over his body.  Sam takes\n     a step back, looks into Kelly's face -- the parted lips, sultry\n     eyes -- as if seeing her for the first time -- a long beat -- at\n     which point he turns, heaving the champagne bottle as far as he\n     can into the black waves.\n\n     EXT. RANGE ROVER ON THE SAUD - LATER\n\n     Rear hatch open -- overhead light on.\n\n     Sam and Kelly drag Suzie's body -- wrapped in the plastic -- to\n     the rear hatch.  As they heft her inside, the light catches --\n\n     SUZIE'S FACE\n\n     A mask of blood.\n\n     Kelly turns away in disgust.  She goes to the passenger side\n     door, gets in.\n\n     Sam gets in behind the wheel.  For a moment the two of them just\n     sit there, in the darkness, with the SOUND of the SEA, and their\n     own BREATHING.  Sam looks at Kelly.\n\n     She is focused on the dark Atlantic.\n\n                                  SAM\n                  Are you okay?\n\n     Kelly turns to him -- an anxious face.\n\n                                  KELLY\n                         (a long beat)\n                  My mom would kill me if she knew I took\n                  the Rover.\n\n     EXT. EVERGLADES - NIGHT\n\n     Kelly waits by the Rover, swatting mosquitoes.\n\n     SLOSHING SOUNDS -- a shape approaches in the dark -- Sam in\n     waders, muddy, tired, carrying a shovel.\n\n     EXT. GALLERIA PARKING LOT - NIGHT\n\n     Almost empty of cars.  The Range Rover cruises past Suzie's VW,\n     circles, comes back.  Sam jumps out, pulls on latex gloves, gets\n     into the VW and backs it out.\n\n     EXT. BUS TERMINAL (MIAMI) - DAY\n\n     Almost dawn.  A long parking lot fronts the terminal.  Suzie's VW\n     arrives, parks, Sam gets out.  He goes to the waiting Range\n     Rover, gets in and drives away.\n\n     EXT. FRONT GATE - VAN RYAN ESTATE - DAY\n\n     A THIN STREAM OF MUDDY WATER\n\n     flows beneath the gate, down the drive, toward the street.\n\n     A HAND touches the water.\n\n     PULL BACK to REVEAL the hand as that of Ray Duquette.\n\n     EXT. VAN RYAN DRIVEWAY - SAME\n\n     Ray kneels, fingers wriggling in the water, then straightens,\n     looking toward the house where...\n\n     On the other side of the gate, Kelly, in a tube-top and tight\n     shorts, washes mud from the Range Rover.  She looks up, sees...\n\n     Ray, drying his hand on a handkerchief, walking up the drive,\n     arriving at the wrought-iron gates.\n\n                                  RAY\n                  Been four-wheelin'?\n\n     Kelly freezes -- not so cool this time.\n\n                                  KELLY\n                  Get off my property.\n\n                                  RAY\n                  I'm not on your property!\n\n     He grabs the wrought-iron gate -- rattles it -- harder and\n     harder.\n\n     Kelly backs away, frightened.\n\n     EXT. SMILIN' JACK'S FISH CAMP - DAY\n\n     Gloria and Ray stand in front of the ramshackle wooden building,\n     talking to Ruby.  Walter sits nearby, sharpening a knife.\n\n                                  RAY\n                  You say she didn't come back last night.\n\n                                  RUBY\n                  She's been sayin' she was going to go to\n                  L.A.  But I don't know.  I mean all her\n                  clothes are still here.  An' she's\n                  missin' her graduation.\n                         (a long beat)\n                  She should graduate.  She's a smart\n                  girl...\n\n     Ray nods.  He makes a note in his pad.\n\n                                  RAY\n                  May have been she just partied too\n                  much... But we'll look into it.  We find\n                  something, you'll be the first to know.\n\n     Ray turns and walks to the car.  Gloria follows.\n\n     INT. CAR - SAME\n\n     Ray sits for a moment behind the wheel.\n\n                                  RAY\n                  It's starting, Gloria.  This is how it\n                  begins...\n\n                                  GLORIA\n                  Ray.  We don't know anything yet.  She\n                  could be anywhere...\n\n     Ray silences her with a look.\n\n                                  RAY\n                  I'm gonna take you back to the office.\n                  Will you put out a call on Suzie's car\n                  for me?\n\n                                  GLORIA\n                  You have someplace to be?\n\n     Ray starts the car, doesn't answer.\n\n                                  GLORIA (CONT'D)\n                  If you want company...\n\n                                  RAY\n                  Just check out the car.\n\n     Gloria nods.  She looks toward the camp store where the old lady\n     can still be SEEN standing on the porch, beneath the jawbones.\n\n     EXT. BLUE BAY SCHOOL - DAY\n\n     Caps and gowns -- kids and parents on the lawn -- taking photos.\n\n     Kelly poses with Sandra.  Tom Baxter aims the camera.\n\n                                  BAXTER\n                  Smile.\n\n     Kelly and Sandra force miserable smiles.  CLICK.\n\n                                  BAXTER (CONT'D)\n                  That's one for the scrapbook.\n\n     Baxter moves away, greets Nicole and her parents.\n\n     Kelly puts some room between her and Sandra.\n\n                                  KELLY\n                  You didn't have to fly back -- from --\n                  wherever, for me...\n\n                                  SANDRA\n                  I'm here to congratulate my friends and\n                  their children.  I'm leaving again\n                  tonight.\n\n                                  KELLY\n                  Don't bother.  I'm taking a trip.\n\n                                  SANDRA\n                  Where, the mall?\n\n                                  KELLY\n                  A friend of mine bought a boat.\n\n     Sandra shakes her head, walks off.\n\n     Kelly turns away, freezes, as she catches sight of --\n\n     Ray talking with Jimmy.\n\n     EXT. THE BEACH - DAY\n\n     Ray and Jimmy walk along the sand, moving in the direction of the\n     big rocks.  Jimmy wears sagger shorts, a surfer T-shirt.  Ray\n     wears a suit.  He carries the coat over his shoulder.\n\n                                  JIMMY\n                  It's those rocks, up there.\n\n                                  RAY\n                  You and Suzie used to come out here\n                  together?\n\n                                  JIMMY\n                  Yeah, sometimes.  Lots of the kids hang\n                  out here.\n                         (beat)\n                  You really think something bad happened\n                  to Suzie?\n\n                                  RAY\n                         (ignoring the question)\n                  Lombardo ever come out here?\n\n     Jimmy looks at him, surprised, sees that Ray is serious.  Still,\n     the idea generates a laugh.\n\n                                  RAY (CONT'D)\n                  I say something funny?\n\n                                  JIMMY\n                  No.  But I mean... just the idea that\n                  Mr. Lombardo would...\n\n                                  RAY\n                  Way I hear it, he was pretty tight with\n                  the kids, one of the guys...\n\n                                  JIMMY\n                  Yeah, but...\n\n     He breaks off as Ray kneels over a big flat rock.  Ray brushes\n     away some sand, drapes the sport coat over his arm, taking\n     tweezers and latex gloves from the pockets.\n\n     Jimmy moves closer, curious, seeing what Ray sees.\n\n     CLOSE ON GLOVED HANDS\n\n     as tweezers pick up two teeth from a crevice in the stone.\n\n     Ray straightens, holding the teeth in the palm of his hand.\n\n     Jimmy stares at the teeth.\n\n     Ray takes a couple of bills from his pocket, hands them to Jimmy.\n\n                                  RAY\n                  I'm going to be staying here, Jimmy.\n                  You can catch a bus up there at the lot,\n                  okay?\n\n     Jimmy looks a little sick, but he takes the money.  He starts\n     toward the lot.\n\n     Ray watches for a moment.  Then calls out to him.\n\n                                  RAY\n                  People aren't always what they appear to\n                  be, kid.  Remember it.\n\n     Jimmy looks at him, trying to make sense of what Ray is saying,\n     clearly disturbed by the implications.  But he asks no more\n     questions.  He turns, trudging alone back through the sand.\n\n                                                 DISSOLVE TO:\n\n     EXT. OCEAN COVE - LATER\n\n     THE TEETH go into a plastic bag.\n\n     PULL BACK TO REVEAL\n\n     Black-and-whites, county cars -- police tape across the site.\n\n     Ray, Gloria and Hunter watch as DAVE MERRITT, a forensic expert\n     bags the teeth.  He passes the bag to Ray, then bends to the\n     rocks where he begins to take a blood sample.\n\n                                  RAY\n                  Lonbardo and Kelly killed her here.\n\n     Hunter and Gloria exchange a look.\n\n                                  GLORIA\n                  Two kids could've gotten into a fight,\n                  lost a couple of teeth.\n\n                                  RAY\n                  Those are Suzie Toller's teeth.\n\n                                  GLORIA\n                  Where's the body?\n\n                                  RAY\n                  The swamp, most likely... Lombardo's a\n                  swamp rat, knows the body will never be\n                  found there.  But he's made a mistake.\n\n     He holds up the evidence bag containing the teeth.\n\n                                  GLORIA\n                  Her grandmother said she'd been\n                  threatening to run away.  And I found\n                  the car at the Miami bus terminal.\n\n                                  RAY\n                  You don't think Sam could've put it\n                  there?\n\n                                  HUNTER\n                  Dust it for prints.  My guess is, if\n                  anybody murdered Suzie it was probably\n                  that little sociopath Kelly Van Ryan.\n\n     Ray shakes his head; he turns to Dave, still working.\n\n                                  RAY\n                  How soon can we get something?\n\n                                  DAVE\n                  We can get blood type right away.\n                  Dental records will take longer.  You\n                  want DNA, that can take weeks.\n\n     Ray nods, looks out to sea.\n\n                                  RAY (CONT'D)\n                  Poor dumb Suzie, she never had a chance.\n\n                                  GLORIA\n                  We don't know that, Ray...\n\n     Ray turns to her -- an intense look.\n\n                                  RAY\n                  Kelly's next, Gloria.\n\n                                  HUNTER\n                         (ice cold)\n                  Get off this Ray, now.\n                         (beat)\n                  If there is any evidence here, it's for\n                  Homicide.\n                         (turning to Dave)\n                  You get an ID, you call me.\n\n     Dave nods.  Hunter stalks off toward his car.  Ray turns to\n     Gloria.\n\n                                  RAY\n                  Will you do me one favor?\n\n                                  GLORIA\n                  Ray, you heard him...\n\n                                  RAY\n                  What if I'm right, Gloria?  What if I'm\n                  right and Hunter's wrong?\n                         (beat)\n                  What do you do if you see a bad thing\n                  coming?\n\n     Gloria looks toward the highway, trying to decide.\n\n                                  RAY (CONT'D)\n                  Stick with me on this Gloria.  I need\n                  you...\n\n                                  GLORIA\n                  And if the teeth aren't Suzie's?  You'll\n                  give this up?\n\n                                  RAY\n                  If I'm wrong about those teeth -- it's a\n                  promise.\n\n     EXT. GLADES MOTEL - SUNSET\n\n     Sam's Jeep -- a \"FOR SALE\" sign in the window -- sits in the lot.\n\n     Across the road -- Gloria sits in the white Taurus.\n\n     EXT. VAN RYAN ESTATE, MAIN GATE - SUNSET\n\n     Ray sits in his truck, picks up his cellular, punches in a\n     number.\n\n                                  DAVE (V.O.)\n                         (speaker)\n                  Merritt, Forensics.\n\n                                  RAY\n                  The teeth doin' any talkin'?\n\n                                  DAVE (V.0.)\n                  Ray.  Stop calling.  I told you the\n                  dental records will take time...\n\n                                  RAY\n                  What about the blood?\n\n                                  DAVE (V.0.)\n                         (a beat)\n                  Could be hers.  Types match.  Could be a\n                  lot of other people's too...\n\n                                  RAY\n                         (cutting him off)\n                  Second you get something on those teeth,\n                  I want it\n\n     Ray hangs up without waiting for a reply.  He turns to the Van\n     Ryan house, an orange light slanting across its facade.\n\n     EXT. GLADES MOTEL - NIGHT\n\n     Gloria waits in her car.  She looks toward the motel.\n\n     Sam's Jeep is parked before one of the bungalows.  There is a\n     light on in the room.  We can SEE inside.\n\n     Gloria sighs, picks up a pair of binoculars and trains them on\n     the room.\n\n     ANGLE ON ROOM - GLORIA'S POV\n\n     Suitcases and boxes are stacked everywhere.  Sam, bare-chested,\n     in khaki slacks, moves about the room.\n\n     CLOSE ON GLORIA\n\n     watching Sam, as...\n\n     IN THE ROOM\n\n     The PHONE has begun to RING.  Sam looks at it until it stops,\n     then picks it up and dials a number.  Kelly answers.\n\n                                  KELLY (V.O.)\n                  Hello?\n\n                                  SAM\n                  Hello.\n\n                                  KELLY (V.O.)\n                  God, I've been calling you.\n\n     INTERCUT - KELLY/SAM PHONE CONVERSATION\n\n     Kelly is in the guest house, pacing in front of the gun case.\n\n                                  KELLY\n                  I'm really serious.  That cop, he keeps\n                  watching me.\n\n                                  SAM\n                  Duquette.  Forget him...\n\n                                  KELLY\n                  I can't help it.  He gives me the\n                  creeps... I mean why was Suzie so scared\n                  of him?  She's not that way.  I think he\n                  did something...\n\n                                  SAM\n                  Yeah, he got her busted for\n                  possession...\n\n                                  KELLY\n                  I don't know... I think it was something\n                  else... Suzie says the bust was\n                  bullshit...\n\n                                  SAM\n                  And you believe her?\n\n                                  KELLY\n                         (a long beat -- a sigh)\n                  I don't know.\n                         (beat)\n                  I want to see you...\n\n                                  SAM\n                  Kelly... Relax.  Take one of your mom's\n                  valium or something.  In another week\n                  you get on the plane.  It's over.  We're\n                  rich.\n\n                                  KELLY\n                  But what if they find out... God, they'd\n                  put you in the gas chamber...\n\n     Sam is about to respond, then looks out the window, sees...\n\n     ACROSS THE STREET, the white Taurus.\n\n                                  SAM\n                  So if they're tapping your phone, we're\n                  dead.  Stay in the guest house.  Skip\n                  the graduation parties.  You'll never\n                  see Duquette.  Okay?  I love you.\n\n                                  KELLY\n                         (beat)\n                  Okay.  I love you too.\n\n     INT. TAURUS - SAME - GLORIA\n\n     sees the light go out in Sam's room, lowers her binoculars, sits\n     for a moment, then begins to write something on a pad.\n\n     She's still at it when something KNOCKS at a FENDER.  She looks\n     up, startled, to find...\n\n     Sam in the street, still shirtless, his arms and shoulders\n     back-lit by the neon light of the Glades Motel.\n\n                                  SAM\n                  Isn't that against the law, peeking into\n                  windows?\n\n                                  GLORIA\n                         (a long beat)\n                  Suzie Toller is missing.\n\n     Sam lets out his breath, shakes his head.\n\n                                  SAM\n                  How long?\n\n                                  GLORIA\n                  She didn't cone home last night.  We\n                  found her car at the bus terminal, but\n                  nothing to suggest she bought a ticket.\n\n                                  SAM\n                  Maybe she used another name.\n\n                                  GLORIA\n                  Ray thinks she was murdered.\n\n     Sam shakes his head once more.\n\n                                  SAM\n                  I don't know what to say...\n\n                                  GLORIA\n                  You could tell me where you were last\n                  night.\n\n     Sam stares at her.\n\n                                  SAM\n                  Goddannit... I don't have to...\n\n     He stops himself, calms down.\n\n                                  SAM\n                  Come here.  I want you to see something.\n\n     Gloria hesitates, looks up at Sam, then puts down the phone and\n     opens her door.\n\n     INT. GLADES MOTEL - SAME\n\n     Sam and Gloria walk among the boxes and suitcases.\n\n                                  GLORIA\n                  Looks like goodbye.\n\n     Sam nods.  He goes to one of his cardboard filing boxes, pulls\n     out a file, hands it to Gloria.  As she takes it, he goes to the\n     closet, takes a shirt from a hanger.\n\n                                  SAM\n                  Kelly's file.  Read it.  You're going to\n                  find an angry, sexually confused girl\n                  who's made threats on her mother's life\n                  and a female lover she'd never identify.\n\n                                  GLORIA\n                  Suzie?\n\n     Sam shrugs.\n\n                                  SAM\n                  You're telling me Ray thinks Suzie was\n                  killed.  I don't have to ask you who he\n                  thinks did it, do I?\n                         (beat)\n                  All I'm saying is, read that, you'll\n                  have a new perspective on things.\n\n     Gloria sits on the bed, the file in her hand.  She watches as Sam\n     pulls on the shirt.\n\n                                  GLORIA\n                  Why didn't you tell us about this before\n                  the trial?\n\n     Sam holds her eyes.\n\n                                  SAM\n                  Then -- I still had ethical standards to\n                  protect.  They meant a lot to me.  Now,\n                  I don't care.  And no amount of money\n                  can buy that back.\n\n     Sam is interrupted by the HONKING of a HORN.  He looks outside.\n\n     ANGLE ON LOT - SAM'S POV\n\n     A taxi waits in the glow of the green neon.\n\n     Sam looks down on Gloria, seated on his bed, her skirt short\n     enough to REVEAL shapely legs.  For a moment the two hold one\n     another's eyes.\n\n                                  SAM (CONT'D)\n                  My ride.  If you're not planning on\n                  arresting me, that is.\n\n     INT. RAY'S TRUCK - NIGHT - LATER\n\n     The PHONE RINGS.  Ray picks it up.\n\n                                  RAY\n                  Ray.  What's happening?\n\n     INTERCUT - RAY/GLORIA PHONE CONVERSATION\n\n     She's still in Sam's room, the file spread across the bed.\n\n                                  GLORIA\n                  I'm tired, Ray.  I'm going home.\n\n                                  RAY\n                  Where's Lombardo?\n\n                                  GLORIA\n                  He's leaving the country.  And I don't\n                  give a shit.\n\n                                  RAY\n                  The blood type on the rocks matches\n                  Suzie's.\n\n                                  GLORIA\n                  It's Homicide's job now, Ray, let 'em do\n                  it.  I'll tell you something else,\n                  there's more to this story than you\n                  know, Ray... If Suzie is dead, I think\n                  Hunter may be on the right track...\n\n     Ray clicks off his phone.\n\n                                  GLORIA (CONT'D)\n                  Ray?\n                         (nothing but dial tone)\n                  Shit.  Ray.\n\n     EXT. VAN RYAN ESTATE, FRONT GATE - NIGHT\n\n     Ray gets out of his car, presses the intercom.\n\n                                  SANDRA (V.O.)\n                         (intercom)\n                  Who is it?\n\n                                  RAY\n                         (into intercom)\n                  Detective Duquette, Ms. Van Ryan.  Let\n                  me in.  Now.\n\n     EXT. POOL & JACUZZI - NIGHT\n\n     Ray CROSSES the deck, Sandra at his heels.\n\n                                  RAY\n                  Where is she?\n\n                                  SANDRA\n                  Where she lives.  In the guest house.\n                  Now will you tell me what this is about?\n\n                                  RAY\n                  I'm placing your daughter under arrest.\n\n                                  SANDRA\n                  You can't...\n\n                                  RAY\n                         (turning, cutting her\n                          off)\n                  Suzie Toller is dead.  You don't want\n                  Kelly to be next, then take my advice.\n                  Stay out of my way.\n\n     INT. GUEST HOUSE - SAME\n\n     A cap and gown lay strewn on the sofa.\n\n     Kelly wears jeans and a bra.  She looks up to see Ray moving\n     across the tile.  Her eyes go wide, then move to the gun case.\n\n     EXT. GUEST HOUSE - SAME\n\n     Sandra stands near the jacuzzi, not exactly sure what to do,\n     watching as...\n\n     ANGLE ON GUEST HOUSE - SANDRA'S POV\n\n     Ray knocks at the French door.  It swings open.  He steps inside.\n\n     A long moment, then VOI?ES, the SOUND of things being knocked\n     about, BREAKING GLASS.\n\n     Sandra starts toward the house then stops at the SOUND of a\n     single GUNSHOT.\n\n     A SECOND GUNSHOT follows, then a THIRD.\n\n     The guest house door opens.  Ray stumbles out, his shoulder\n     bloody, a .357 in his hand.\n\n                                                 FADE TO:\n\n     VIDEOTAPE - RAY'S STATEMENT\n\n     We SEE him from the waist up -- a white T-shirt, his shoulder\n     bandaged, his arm in a sling.  There are red scratch marks on his\n     face.  His eyes look blankly into the camera.\n\n                                  RAY\n                  I fucked up.  I lost control of the\n                  situation, the one thing they train you\n                  for... God, what did I do?\n\n                                  HUNTER (0.S.)\n                  Just tell us what happened.\n\n                                  RAY\n                  I told Kelly Van Ryan she was under\n                  arrest for conspiracy and murder.  I did\n                  her rights.\n\n     INTERCUT --\n\n     EXT. CARIBBEAN BEACH RESORT - LONG SHOT - DAY\n\n     Perfect crescent of sand.  A man in white shorts reclines in a\n     beach chair, beneath a gaily-colored umbrella, sipping a drink.\n\n     VIDEOTAPE - RAY\n\n                                  RAY\n                  Kelly went crazy, started screaming.  I\n                  grabbed her, put her on the floor.\n\n     EXT. BEACH RESORT - CLOSER SHOT - DAY\n\n     Sam, in white shorts, looking good, watches a beautiful island\n     girl in a thong bikini frolic in the surf.\n\n     She seems to sense Sam watching, turns toward the beach.  Her\n     eyes meet Sam's.  She breaks into a beautiful smile.\n\n     VIDEOTAPE - RAY\n\n                                  HUNTER (O.S.)\n                  She bit you?\n\n                                  RAY\n                  Bit, scratched.  But I had her pinned.\n                  She calmed down.  I was going to cuff\n                  her... She said she thought she was\n                  going to be sick.  She asked to use the\n                  bathroom.\n\n     EXT. BEACH RESORT - DAY\n\n     Sam and the island girl sit at an outdoor table.  The girl wears\n     a short, terry cloth robe, Sam the white shorts and a flowered\n     shirt.  They sip drinks.  Their eyes meet.  Their fingers touch.\n\n     VIDEOTAPE - RAY\n\n                                  RAY\n                  I told her I was coming with her.  She\n                  nodded, like she understood.  We stood\n                  up together.\n\n                                  HUNTER (O.S.)\n                  You didn't cuff her?\n\n                                  RAY\n                  She looked shaky, but lucid.  I thought,\n                  I would just go with her, stand at the\n                  door...\n                         (shaking his head)\n                  I think I looked away.  A split second.\n                  Then, bingo.  Just like that.  She puts\n                  a knee into my groin.\n                         (beat)\n                  There was this coffee table between us\n                  and the wall.  She got one foot on that\n                  thing and launched herself at the gun\n                  case.  Thing had a glass door.  I could\n                  hear it breaking.\n                         (beat)\n                  I didn't go down, but she slowed me up,\n                  just enough.  Before I could get to her,\n                  she'd turned on me with this small\n                  caliber handgun.  I yelled at her to put\n                  it down.  She got off a shot.  I took it\n                  in the shoulder.  I... I had no choice.\n                  I returned fire.  Two rounds, I think.\n                  In the chest.\n\n     INT. POLICE ROOM - SAME\n\n     A moment of silence, save for the BUZZING of the MACHINE.  A\n     number of plainclothes police, Hunter and Gloria among them,\n     watch the tape.\n\n                                   RAY\n                  I went there to protect her...\n\n     He hangs his head, then looks up, his eyes focusing.\n\n                                   RAY (CONT'D)\n                  The teeth, were they...\n\n                                   HUNTER (0.S.)\n                  Suzie Toller's.  And that's the only\n                  thing saving your sorry ass.\n\n     EXT. BOAT HARBOR (CARIBBEAN ISLAND) - DAY\n\n     Brilliant sun on turquoise water.  A few boats anchored in a\n     lagoon.  A quiet place.\n\n     Heading out -- a forty-foot sloop, Sam at the helm.\n\n     INT. HEARING ROOM - DAY\n\n     Gloria, Baxter, a tearful Sandra, sit in seats, watch as --\n\n     Ray stands before a panel, A SUIT, A CHIEF in uniform, Hunter.\n\n     Ray wears a suit, his hair neatly trimmed.  His arm is no longer\n     in a sling, but one of his hands is still bandaged.\n\n                                  CHIEF\n                  Detective Duquette; our investigation\n                  concludes that this was a good shooting.\n                  But that's irrelevant.  You were not\n                  assigned to this case -- whatever you\n                  imagined this case to be.  And now two\n                  young women are dead.  You are\n                  terminated with forfeiture of pension\n                  and benefits.\n\n     Ray looks at the floor.\n\n     Hunter coughs.  His hands rest on a file -- we SEE the video\n     cassette inside -- labeled \"TOLLER/VAN RYAN -- CONFIDENTIAL.\"\n\n                                  HUNTER\n                  Suzie Toller's teeth and blood were\n                  found near the area known as Stoner\n                  Rocks.  Suzie's blood was found in the\n                  Van Ryan Range Rover.  This, in\n                  conjunction with evidence obtained by\n                  Detectives Duquette and Perez has led\n                  this office to the conclusion that Susan\n                  Marie Toller was murdered by Kelly\n                  Lanier Van Ryan...\n\n     Sandra chokes back a sob.  She gets to her feet, to be led from\n     the room by Tom Baxter.\n\n     Gloria Perez watches, a sad look in her eye, then turns to look\n     at Ray.  His back is to her -- the broad shoulders, expensive\n     suit.  His hands are clasped behind his back.\n\n                                                 DISSOLVE TO:\n\n     EXT. BLUE BAY CEMETERY - KELLY'S FUNERAL - DAY\n\n     Gloria stands among a considerable number of mourners.  She is\n     just back from Sandra and Tom Baxter, who, in turn, are just back\n     from the open grave.\n\n     As Gloria watches, Sandra looks off to the side, where something\n     catches her eye.  Gloria sees her start, then follows her gaze.\n\n     ANGLE ON CEMETERY - GLORIA'S POV\n\n     On a rise some fifty yards from the Van Ryan plot, two people\n     stand near an old oak -- Ruby and Walter.\n\n     When Gloria looks back at Sandra, it seems to her as if the woman\n     has slumped against Tom Baxter, who now stares at the two people\n     on the rise as if, by doing so with sufficient intensity, he\n     might make them disappear.\n\n     Gloria turns to the grave site, her eye lingers on the open\n     grave, then moves to the huge marker which dominates the Van Ryan\n     family plot and, in fact, the entire scene.\n\n     ANGLE CN MARKER\n\n     The angel Gabriel, trumpet in hand, carved in relief upon a huge\n     obelisk of black marble.  Beneath the angel is a carved scroll\n     and upon it the words:\n\n     \"I AM THE RESURRECTION AND THE LIFE,\" and below that:  \"WILLIAM\n     TECUMSEH VAN RYAN.  MAY HE REST IN PEACE.\"\n\n                                                 DISSOLVE TO:\n\n     EXT. A BEACH - NIGHT\n\n     Sam Lombardo walks along a moonlit lagoon, headed toward a lone\n     bungalow.\n\n     The bungalow is simple, picturesque -- whitewashed walls, a\n     thatched roof.  A patio opens onto the beach.\n\n     EXT. PATIO - SAME\n\n     As Sam steps in off the sand, he sees something and stops short.\n\n     Wet spots lead toward the bungalow.\n\n     Sam listens.  Everything is quiet.\n\n     INT. BUNGALOW - SAME\n\n     Sam ENTERS in a room lit only by the blue light of a large\n     aquarium.  He listens once more, hears it -- RUNNING WATER.\n\n     He moves down a short hallway, observes the light which spills\n     from beneath a bedroom door.  He pushes it open, goes inside.\n\n     INT. BEDROOM - SAME\n\n     He CROSSES the room.\n\n     The bathroom door is ajar, the room leaking steam.\n\n     INT. BATHROOM - SAME\n\n     Sam steps inside, looks at the shower stall -- an indistinct\n     shape moves there in the steam.\n\n     San watches, then jerks open the shower door.  The steam\n     clears -- REVEALING a tall, athletic body, and now the face --\n\n     Ray Duquette, grinning at Sam out of the swirling steam.\n\n                                  RAY\n                  Buy you a drink?\n\n     San takes a step back.\n\n                                  SAM\n                  Jesus.  I wasn't expecting you 'til\n                  tomorrow.\n\n     Ray turns off the water, steps out of the stall, wrapping himself\n     in a towel.  There's a fresh, raised scar across one shoulder and\n     Ray winces a little as he tucks the towel about his waist.  He\n     looks at himself in the mirror, touching the scar.\n\n                                  RAY\n                  Nice girlfriend you had there.\n\n     Sam just looks at him.\n\n                                  SAM\n                  Yeah, well, you fixed that.\n                         (beat)\n                  What the hell happened, anyway?\n\n                                  RAY\n                  The bitch shot me, is what happened.\n\n     Sam shakes his head, walks back into the bedroom.  Ray follows.\n\n                                  RAY (CCNT'D)\n                  Hey, what did you want me to do, die?\n\n                                  SAM\n                  Well, shit, you're the cop, they don't\n                  teach you to disarm people, shoot them\n                  in the leg or something?  You weren't\n                  supposed to kill her for Christ's sake.\n\n     Now Ray just looks at Sam, his eyes narrowing.\n\n                                  RAY\n                  Did you become squeamish about these\n                  things before or after you bludgeoned\n                  little Suzie Toller to death with a wine\n                  bottle?\n                         (off Sam's silence)\n                  Jesus, man.\n                  It couldn't have worked out better.\n                  They're convinced Kelly whacked Suzie.\n                  I can't talk 'em out of it.\n                         (beat)\n                  We should be celebrating.  This thing\n                  worked out just like you said, only\n                  better.\n\n                                  SAM\n                  Kelly was supposed to be framed, not\n                  killed.\n                         (beat)\n                  What I'm telling you is, I don't like\n                  surprises.\n\n     Ray walks to a dresser where a bottle of champagne sits in a\n     bucket of ice.  He opens the bottle, fills two glasses.  He hands\n     one of the glasses to Sam.\n\n                                  RAY\n                  Every cloud has a silver lining,\n                  partner.  Here's to no loose ends.\n\n     He raises his glass in a toast.\n\n     Sam looks at it, then raises his glass as well.  Ray smiles.  Sam\n     doesn't.\n\n                                  SAM\n                  Here's to no more surprises.\n\n     Ray shrugs.  The two men's eyes meet.  They touch glasses and\n     drink.\n\n     EXT. SMALL BOAT HARBOR (ISLAND) - DAY\n\n     Sam and Ray work on the deck of Sam's sloop, stowing gear,\n     loading supplies.\n\n     The boat's mast shines in the sunlight before a brilliant sky.\n     Palms sway.  The men work in silence.\n\n     EXT. SMILIN' JACK'S FISH CAMP - DAY\n\n     Gloria drives up in the white Taurus.  She parks before the\n     ramshackle old building and the gator pen.\n\n     Walter is in the pen.  Ruby stands just outside of it.  She looks\n     toward the road as Gloria gets out, then back to the pen.\n\n     Gloria comes down the bank to stand beside Ruby.  She's just in\n     time to see the huge old reptile raise itself, hissing, on its\n     front legs, jaws sprung wide.  The women watch as Walter sticks\n     his arm into the gator's mouth.\n\n                                  RUBY\n                  Gator can't see what's in front of it\n                  for shit.  They see out the sides.\n                         (beat)\n                  That one don't even know Walter's arm's\n                  in his mouth.\n\n                                  GLORIA\n                  What if something distracts it and it\n                  snaps anyway?\n\n                                  RUBY\n                  Then I guess Walter can kiss that arm of\n                  his goodbye.\n                         (loud enough for Walter\n                          to hear)\n                  He don't use it for no good deeds\n                  anyway.\n\n     Walter looks at the ladies, picks up the stick and sweeps it\n     between the gaping jaws, which snap in its wake.\n\n                                  RUBY (CONT'D)\n                  You come all the way out here to watch\n                  Walter?\n\n                                  GLORIA\n                  I was wondering if I could ask you a few\n                  questions.\n\n                                  RUBY\n                  About Suzie?\n\n                                  GLORIA\n                  Actually, I was wondering if I might ask\n                  you about Ray Duquette.\n\n                                  RUBY\n                         (a long beat)\n                  He used to come around here.  He had a\n                  thing going with one of the girls over\n                  at the Glades.\n\n     Ruby nods toward the motel, a bitter smile on her face.\n\n                                  RUBY (CONT'D)\n                  Got sort of hung up on her, from what\n                  hear.\n\n                                  GLORIA\n                  She still work there?\n\n                                  RUBY\n                  No.  Not after that night.\n                         (a long beat)\n                  I don't know what happened.  Maybe he\n                  caught her with some john...\n                  All I know is, the next morning the girl\n                  was gone and there was a dead boy...\n                  Indian kid named Davy.  Used to live\n                  down the road there in a wrecked car.\n                  Him and Suzie were at the Glades that\n                  night.\n                         (beat)\n                  It was right after that, Ray got Suzie\n                  busted and sent her away.  That's what\n                  there is to say about Ray Duquette.\n\n                                  GLORIA\n                  Was there ever any kind of\n                  investigation...\n\n     Ruby cuts her off with a short laugh.\n\n                                  RUBY\n                  Duquette always claimed the kid was\n                  dusted, came after him with a knife.\n                  But it was Jack's Fish Camp... This\n                  could be the moon for all most people\n                  care.\n                         (a long beat)\n                  Wasn't supposed to be like that though.\n                  This place was supposed to be something\n                  once.  There were going to be roads and\n                  houses.  There was going to be a town.\n                  They were going to call it Salt Creek.\n\n     EXT. OCEAN - DAY\n\n     From the surface of the sea -- the emerald island in the\n     distance.  The bow of the sloop comes INTO FRAME.\n\n     On board -- Sam stands in the cockpit, at the helm.  Ray lounges\n     on the deck.  The boat sails easily before the wind.\n\n                                  SAM\n                  Ray... you see that winch by your head?\n                  Take a couple of turns on it for me,\n                  she's luffing.\n\n     Ray cranes his neck to look at the winch.\n\n                                  RAY\n                  You mean this thing?\n\n                                  SAM\n                  Yes, we call it a winch.\n                         (pointing at pieces of\n                          the rigging)\n                  And these are shrouds, and these are\n                  stays.\n\n                                  RAY\n                  I thought this was supposed to be a\n                  vacation.  Why didn't you buy a nice big\n                  power boat?\n\n                                  SAM\n                  Come on, man.  I'll make a sailor out of\n                  you yet.\n\n                                  RAY\n                  Yeah, or get me drowned.\n\n     Ray kneels.  He begins to tighten the winch.\n\n     Sam watches him for a moment, then reaches around behind his back\n     to unhook the short line which holds the boom.\n\n     The mainsail catches wind, swinging the boom in a wide arc,\n     directly at Ray.\n\n     Ray looks up, sees it coming just in time to catch it on his arm.\n\n     The blow is enough to send him sprawling through the lifelines,\n     where he just manages to grab one of the nylon cords.\n\n     Sam ducks as the boon continues to swing erratically above the\n     deck, watching as Ray hauls himself on board.\n\n     The boat no longer driven by the wind, bobs up and down on a\n     small ground swell.\n\n     The two men face each other.\n\n                                  SAM\n                  Jesus, man... You okay?\n\n                                  RAY\n                  That how you planned it?  You take cut\n                  Suzie, get me to hang it on Kelly, then\n                  dump me in the ocean...\n\n                                  SAM\n                  Come off it, man... It was an accident.\n\n     Ray nods, then reaches down, pulls off the winch handle and\n     starts with it toward Sam.\n\n     Sam looks around.  He jerks open a storage compartment.  A\n     diver's weight belt tumbles out.  Sam grabs it, swings it over\n     his head in circles, letting the weight pick up momentum,\n     preparing to throw.\n\n     Ray crouches, still brandishing the winch handle.  The boom\n     sweeps the deck.\n\n     Sam throws the belt.\n\n     Ray grabs a shroud, dances out of the way, then steadies himself,\n     a mean grin spreading across his face.\n\n     There's no tine for Sam to look for anything else.\n\n     Ray moves quickly across the deck -- a menacing sight -- tall,\n     well-muscled, the handle gleaming in his hand.\n\n     Sam pulls himself out of the cockpit.  Ray jumps in.  But that's\n     as far as he gets.\n\n     WHOOSH -- A spear pierces Ray's thigh.  He screams, goes down,\n     the handle skittering across the deck.\n\n     Ray follows it with his eyes, reaching out, then freezing as he\n     sees something else.  He draws in his hand as if bitten.\n\n                                  RAY\n                  You... You're...\n\n     He scuttles backward, pulling himself onto the deck, clutching at\n     his leg which squirts blood as if an artery has been severed.\n     But his eyes never leave the hatchway leading belowdecks.\n\n                                  RAY (CONT'D)\n                  You're dead... for godsake...\n\n     The boat heels over.  The spear in Ray's thigh bangs against the\n     edge of the cockpit.  He grimaces in pain as...\n\n     Suzie Toller steps up from belowdecks.  She's wearing a bikini\n     and showing a nice tan.  She's carrying Sam's new spear gun, a\n     fresh spear at the ready.\n\n                                  SUZIE\n                  Rumors of my demise have been greatly\n                  exaggerated.\n                         (to Sam)\n                  Nice move.  Good thing I was here to\n                  save your incompetent ass.\n\n     Sam secures the boom.  Ray stares at Suzie, his face twisted with\n     some combination of pain, rage and fear.\n\n                                  RAY\n                  You... I should've killed you myself.\n                  should never have left it up to him...\n\n                                  SUZIE\n                  Shoulda, coulda, woulda...\n                         (to Sam)\n                  Get him in the water.\n\n     San starts for Ray.\n\n                                  RAY\n                  Sam, for Christ's sake...\n\n     Sam's feet slide in the bloody smear.  He stops.\n\n     Ray clings to a safety line.\n\n                                  SAM\n                  I can't.\n\n     WHOOSH -- A second spear penetrates Ray's shoulder.  He loses his\n     grip.  The boat heels over, dumping Ray into the water.\n\n     Suzie puts down her spear gun.  She goes to a storage locker,\n     takes out a bait bucket.  She steps up on the deck.\n\n     Ray is floating not far from the boat, the water going red around\n     him.  He calls out...\n\n                                  RAY\n                  Sam, for godsake.\n\n                                  SUZIE\n                  Hey, Ray.  Guess whose name is on the\n                  numbered bank account besides yours and\n                  Sam's?\n\n     She raises the bucket, heaves bloody chum into the water.\n\n                                  SUZIE (CONT'D)\n                  I like these joint survivorship\n                  accounts.  Something unfortunate happens\n                  to one of the signatories, the others\n                  don't have to worry.  Are you worrying,\n                  Ray?\n\n     She heaves more chum -- a big red slurp across Ray's face.\n\n     Ray gasps, goes under, thrashing around in the red slick.\n\n                                  SUZIE (CONT'D)\n                  Men, use 'em abuse 'em lose 'em.\n\n     INSERT - SHARKS\n\n     from underwater, in a frenzy, rip a human body into a bloody\n     cloud.\n\n     EXT. SAILBOAT - LATER\n\n     Suzie cones up from below with a champagne bottle and glasses,\n     already filled.\n\n                                  SUZIE\n                  Feeling better?\n\n     Sam gazes out to sea.\n\n                                  SAM\n                  That was about as grim as it gets.\n\n                                  SUZIE\n                  The guy was history when he killed\n                  Kelly.  You knew that.\n\n                                  SAM\n                  But then you knew what he was like all\n                  along... Maybe his killing Kelly was a\n                  thing you had counted on...\n\n                                  SUZIE\n                  But then it is better this way, don't\n                  you think?  No loose ends.\n\n     Sam just looks at her.\n\n                                  SUZIE (CONT'D)\n                  What?\n\n                                  SAM\n                  That was the same thing Ray said.\n\n     Suzie smiles -- showing the big gap where her two front teeth\n     used to be.\n\n                                  SUZIE\n                  Poor Ray.\n                         (a beat)\n                  Come on Sam, we did it.  We put the\n                  screws to the Van Ryans.  We won.\n\n     She hands a glass to Sam, takes the other.  He puts it to his\n     lips, suddenly hesitates, thinks, sniffs the glass.\n\n     A moment.  Suzie shakes her head.\n\n                                  SUZIE (CONT'D)\n                  Talk about paranoid.  Now are you gonna\n                  teach me to sail this big old boat or\n                  not?\n\n     Sam downs his drink.\n\n                                  SAM\n                  Okay.  Grab that winch there.\n\n     Suzie gives him a pouty look.\n\n                                  SAM (CONT'D)\n                  What's wrong?\n\n                                  SUZIE\n                  Fuck the winch.  I wanna drive.\n\n     Sam sighs.\n\n                                  SAM\n                  Okay.  Come here and take the helm.\n                  I'll get the winch.\n\n     Suzie gives him her best, gap-toothed smile, then comes forward\n     to take the gleaming chrome wheel, as Sam scrambles up on deck,\n     kneeling where Ray had kneeled before him to set the jib.\n\n     Suzie watches -- a long beat, then, slowly reaches behind her,\n     unhooking the line which holds the boom...\n\n     ANGLE ON BOOM\n\n     sweeping the deck -- coming right at us, blotting out the sky.\n\n     EXT. SMILING JACK'S - SUZIE'S ROOM - DAY\n\n     Gloria sits on Suzie's bed, books spread out around her.  Ruby\n     stands beside her.\n\n                                  RUBY\n                  You asked if Suzie knew about the Salt\n                  Creek land deal?  Girl read every book\n                  she could find on it, the Van Ryans too.\n\n     Ruby takes a photo album from among the books, opens it, tosses a\n     photograph on the bed.  It is one we have seen before.\n\n     ANGLE ON PHOTO\n\n     A stately old gentleman in a three-piece suit.  White hair, a\n     white handlebar mustache.  A derby on his knee, a walking stick\n     at his side.  He stares out at the world from a high-backed\n     wicker chair, flanked by potted palms and two small terriers.\n\n     Across the bottom of the picture is the name -- \"WILLIAM TECUMSEH\n     VAN RYAN.\"  And beside that, in another hand -- \"Dear old Dad.\"\n\n                                  RUBY\n                  Wasn't enough Van Ryan had to destroy\n                  the people who invested here.  He got to\n                  be old, he and his rich cronies would\n                  come down here, hunt and whore, act like\n                  assholes.  One trip he showed up with\n                  this young girl he'd picked up\n                  somewhere, gotten her pregnant then\n                  dumped her in the swamp.\n                         (indicating the photo)\n                  That came with her.\n\n                                  GLORIA\n                  And the child...\n\n                                  RUBY\n                  She had it, before she drank herself to\n                  death.  Wasn't exactly a love child...\n\n                                  GLORIA\n                  Suzie.\n                         (beat)\n                  Then you're not her grandmother...\n\n                                  RUBY\n                  Raised her like she was, but no,\n                  Walter's my only child.\n                         (beat)\n                  He was a good boy, till the army took\n                  him.\n\n     Gloria looks once more at the old photograph.\n\n                                  GLORIA\n                  So Suzie and Sandra Van Ryan were half-\n                  sisters.\n\n                                  RUBY\n                  And the other girl, Kelly.  Suzie's\n                  niece.\n\n     Gloria stands, a little weary.  Ruby walks her from the room.\n\n                                  GLORIA\n                  Thank you for talking to me, Ruby.  I am\n                  sorry about Suzie, she...\n\n     They have gotten to the main room and Gloria stops short,\n     noticing for the first time that the beat-up old black-and-white\n     TV has been replaced by a high-tech, giant-screen television.\n\n                                  RUBY\n                  You okay?\n\n                                  GLORIA\n                  I'm fine.  Nice TV.\n\n     The old lady nods, walks her outside.\n\n     EXT. SMILIN' JACK'S FISH CAMP - DAY\n\n     The dusty road, the little dock, the gator pen.\n\n                                  RUBY\n                  There's an old saying from the\n                  Everglades -- virtue may be missed but\n                  sin can't hide.\n                         (a long beat)\n                  Folks pay in the end.\n\n     Gloria nods.  She is distracted by a movement in the gator pen.\n\n     CLOSE ON PEN\n\n     For a moment there is nothing more than a few ripples across the\n     surface of the pond which lies inside the pen, then, slowly, the\n     GATOR'S EYES -- cold, reptilian, unblinking, rising up to gaze\n     across the oily waters.\n\n                                                 HARD CUT TO:\n\n     BLACK.  CREDITS...\n\n     for about ten seconds, enough to fool the audience, then...\n\n     INTERCUT - LIKE OUTTAKES...\n\n     ... PIECES OF SCENES WE COULDN'T SEE, or SCENES WE DIDN'T SEE AT\n     ALL, in reverse chronological order.\n\n     INT. GUEST HOUSE - NIGHT\n\n     Kelly is frantically trying to unlock the gun case as Ray comes\n     through the French doors.  She can't get it done.  He's there in\n     an instant.\n\n     She screams, backs away, then watches as Ray stops, wraps a hanky\n     around his hand and breaks the glass.\n\n     He takes out a small caliber handgun, checks the clip, aims the\n     gun at his own shoulder and fires.\n\n     BLACK -- MORE CREDITS -- then\n\n     EXT. EVERGLADES - DAY\n\n     A Jeep and a truck parked in the mud.  Sam and Ray meet under\n     heavy, moss-draped cypress.  Sam hands Ray a plastic bag -- the\n     teeth.\n\n                                  SAM\n                  You know the place I'm talking about --\n                  the big rocks?\n\n     BLACK -- MORE CREDITS -- then\n\n     EXT. BEACH - NIGHT\n\n     SAM & SUZIE\n\n     behind the big rocks.  He's got vise-grip pliers jammed in her\n     mouth.  Suzie moans, for real.  He loosens his grip.\n\n                                  SUZIE\n                  You've got the pressure too tight.\n                  You'll crush the fucking evidence.\n\n     Sam takes a breath, prepares to try again.  Suzie pops a couple\n     of pills with gulps of wine.  Sam goes to it once more.\n\n     BLACK -- MORE CREDITS -- then\n\n     INT. SAM'S HOUSE - DAY\n\n     Kelly and Sam on the floor, naked.  He's on her from the rear.\n     It's getting wild.  He suddenly stops, rolls to the floor.\n\n                                  SAM\n                  We gotta stop.  I'm gonna come.\n\n     Kelly laughs, straddles him.\n\n                                  KELLY\n                  That never seemed to worry you at the\n                  Glades.\n\n                                  SAM\n                  That's not your line.\n\n                                  KELLY\n                  Say you love me.\n\n                                  SAM\n                         (a beat)\n                  I love you.  Now give me the line.\n\n                                  KELLY\n                         (a whiny voice)\n                  No little girl can ever make me come.\n\n     BLACK -- MORE CREDITS -- then\n\n     EXT. THE GLADES MOTEL - NIGHT\n\n     Suzie's VW is parked across the street, in the shadows of tall\n     trees.  She and Sam sit inside, watching as...\n\n     Ray Duquette EXITS a bungalow, a sport coat over his arm.  He\n     heads for Jim's Recovery Room.  In another moment, a young hooker\n     in a leather miniskirt walks out of the same bungalow.\n\n                                  SUZIE\n                  Seems to like some of the same places\n                  you do.  Funny you never met.\n\n                                  SAM\n                  Yeah, real funny.  You're wrong about\n                  this, I could get busted on the spot.\n\n                                  SUZIE\n                  Trust me, the guy's dirty.  He'll like\n                  it.  Especially the part about offing\n                  me.\n                         (beat)\n                  Now get out of here.  Go make yourself a\n                  new friend.\n\n     INT. JIM'S RECOVERY ROOM - NIGHT\n\n     Ray is at the bar.  Sam sits down next to him.  A moment of\n     silence, the twang of a country JUKE BOX -- then...\n\n                                  SAM\n                  Buy you a drink?\n\n     BLACK -- MORE CREDITS -- then\n\n     ZNT. SAM'S OFFICE - BLUE BAY SCHOOL\n\n     Suzie Toller framed in the doorway.  She walks in.\n\n                                  SUZIE\n                  You like bein' a caddy for rich kids'\n                  problems?\n\n     Sam just looks at her.\n\n                                  SUZIE (CONT'D)\n                  I've seen you out there in your old air\n                  boat, thinking about what might have\n                  been, old man Van Ryan hadn't fucked you\n                  out of it.\n                         (beat)\n                  What if I told you I had a way we could\n                  get a big piece of it back?\n\n                                  SAM\n                  We?\n\n                                  SUZIE\n                  Well, I'd need the famous Lombardo\n                  charm, not that you'd have to do\n                  anything you haven't done already.\n\n     She takes an envelope from her notebook, tosses it in front of\n     Sam.  Pictures slide onto his desk -- Sam and Kelly -- in various\n     poses of coked-out debauchery at the Glades Motel.\n\n                                  SAM\n                         (white-faced)\n                  How...\n\n                                  SUZIE\n                  Walter.  He's been aimin' that Brownie\n                  through knotholes for years.  I saw\n                  these, I knew he'd finally struck gold.\n                         (beat)\n                  I can't decide which came out better,\n                  that little straw Kelly's got up her\n                  nose, or that vibrator you've got up her\n                  ass.  What do you think, Mr. Lombardo?\n\n                                  SAM\n                         (a long beat)\n                  I think there's some things you do, you\n                  don't want to see yourself doing them.\n\n     BLACK -- MORE CREDITS -- then\n\n     INT. JIM'S RECOVERY ROOM - DAY\n\n     Sam lounges in a booth.  He looks hot, bored.  He stirs a drink.\n     Kelly walks in out of the light.  She is looking a little strung\n     out, a big straw bag slung over one shoulder, but oh, so sexy in\n     skimpy cutoffs and cowboy boots -- long legs flashing as she\n     nears Sam's booth.  Sam looks up, as...\n\n                                  KELLY\n                  I'm running away.\n\n                                  SAM\n                         (a beat)\n                  You think that's wise?\n\n                                  KELLY\n                         (sitting next to him)\n                  Um-huh.  And guess what else?\n                         (reaching into her bag)\n                  I have toys.\n\n     She takes out a snail bag of white powder, taps out a line on the\n     table top.\n\n     Sam looks at it.  He looks at Kelly.  He's had a few drinks.\n\n                                  SAM\n                         (a long beat)\n                  Well, Z guess one taste wouldn't hurt.\n\n     END CREDITS.\n\n     The seal comes up.  It's over.  They head for the lobby -- but --\n\n     EXT. SMILIN' JACK'S FISH CAMP - LATE AFTERNOON\n\n     Gloria stands beneath the jawbones, looking toward the channel as\n     the shadows lengthen across the dirt road.\n\n     ANGLE ON CHANNEL\n\n     Walter hangs a \"FOR SALE\" sign on a small, shabby sloop.\n\n     Gloria CROSSES the road.\n\n                                  GLORIA\n                  Selling your boat?\n\n     Walter shoots her a look.\n\n                                  WALTER\n                  This was Suzie's boat.  Guess she won't\n                  be needin' it.\n\n                                  GLORIA\n                  I wouldn't have guessed Suzie was a\n                  sailor.\n\n     Walter finishes with the sign.\n\n                                  WALTER\n                  Old lady had her tested once.  They said\n                  her IQ was way up there, round two\n                  hundred or some such shit.\n                         (beat)\n                  That girl could do just about anything,\n                  she put her mind to it.\n\n     Gloria has nothing to say.  She stares at the little sloop\n     bobbing in the muddy water of the swamp.\n\n     EXT. THE CARIBBEAN - WIDE ANGLE - SEA LEVEL - DAY\n\n     A head bobs among the groundswells.\n\n     CLOSE - SAM LOMBARDO\n\n     sucking wind through a smashed face, struggling to stay afloat,\n     as...\n\n     ... in the distance, the sloop races toward a far horizon.\n\n     ANGLE ON SLOOP - HELICOPTER SHOT\n\n     Suzie, at the helm, looking good, face to the wind.\n\n\n                                END\n\n                              (really)\n\n\n   \n\n\n\n\n\n\n\n\nWild Things\nWriters :   Stephen Peters  Kem Nunn\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "The film begins with Max, a lonely nine-year-old boy with an active imagination whose parents are divorced, wearing a wolf costume and chasing his dog. His older sister, Claire, does nothing when her friends crush Max's snow fort (with him inside) during a snowball fight. Out of frustration, Max messes up her bedroom and destroys a frame that he had made for her. At school, Max's teacher teaches him and his classmates about the eventual death of the sun. Later on, his mother, Connie, invites her boyfriend Adrian to dinner. Max becomes upset with his mother for not coming to the fort he made in his room. He wears his wolf costume, acts like an animal, and demands to be fed. When his mother gets upset, he throws a tantrum and bites her on the shoulder. She yells at him and he runs away, scared by what has transpired. At the edge of a pond Max finds a small boat that he boards.\nThe pond soon becomes an ocean. Max, still in his wolf suit, eventually reaches an island. There, he stumbles upon a group of seven large, monstrous creatures. One of them, Carol, is in the middle of a destructive tantrum (caused by the departure of a female Wild Thing named K.W.) while the others attempt to stop him. As Carol wreaks havoc Max tries to join in on the mayhem, but soon finds himself facing the suspicious anger of the Wild Things. When they contemplate eating him, Max convinces them that he is a king with magical powers capable of bringing harmony to the group. They crown him as their new king. Shortly after, K.W. returns and Max declares a wild rumpus, in which the Wild Things smash trees and tackle each other.\nThe Wild Things introduce themselves as Carol, Ira, Judith, Alexander, Douglas, the Bull, and K.W. Soon, they all end up piling on one another before going to sleep, with Max at the center. Carol takes Max on a tour of the island, showing him a model he built depicting what he wishes the island looked like. Inspired by this, Max orders the construction of an enormous fort, with Carol in charge of construction. When K.W. brings her two owl friends Bob and Terry to the fort, a disagreement ensues, as Carol feels they are outsiders (Max had said earlier that if any outsiders entered the fort, they would \"have their brains automatically cut out\"). To release their frustrations, Max divides the tribe into \"good guys\" and \"bad guys\" for a dirt clod fight, but Alexander is hurt during the game. After an argument between K.W. and Carol, K.W. leaves once again.\nMax finds Alexander alone in the fort and has a conversation with him. Alexander reveals that he always suspected that Max is not a king with magical powers, but warns him to never let Carol know. Soon enough, at pre-dawn, Carol throws another tantrum — this time, about the fort, K.W.'s absence, and the eventual death of the sun (which Max had talked to Carol about earlier in the film). When Carol gets angry with Max for not doing a good job as a king, Douglas tries to explain to him that he's \"just a boy, pretending to be a wolf, pretending to be a king\", thus exposing the truth to the rest of the Wild Things. Carol becomes enraged and ends up ripping off Douglas' right arm (though only sand pours out of the wound). Then he chases Max into the forest and attempts to eat him. Max is saved by K.W., who hides him in her stomach. Max listens as Carol and K.W. have an argument over Carol's misbehavior. After Carol leaves, K.W. explains that their lives are difficult, with Carol's tantrums only making it worse. Max realizes what his mother is going through, and decides to leave the island and head home.\nMax finds the crushed remains of Carol's model island (presumably destroyed by Carol himself in a rage) and leaves a token of affection for him to find (a letter C inside a love-heart made of twigs). He finds Carol and tells him he is going home because he is not a king. The other Wild Things escort Max to his boat. Carol runs to join them after finding Max's token and arrives in time to see him off. He starts to howl and Max howls back, then all the other Wild Things join in. Carol looks at K.W. and she smiles kindly at him. Returning home, Max is embraced by his distraught mother, who gives him a bowl of hot soup, a piece of cake and a glass of milk and sits with him as he eats. He watches as she falls asleep."}