{"title": "Witness", "full_text": "<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nWITNESS\n\n\n                                        \"WITNESS\"\n\n                                            by\n\n                                     Earl W. Wallace\n\n                                      William Kelley\n\n                                      Pamela Wallace\n\n                \n\n               EXT. LANCASTER COUNTY, PA. COUNTRYSIDE \u0096 DAY\n\n               TITLE SEQUENCE\n\n               The faces of several young children are presented in CLOSEUP, \n               as they walk TOWARD US across a ploughed field. On the SOUND \n               TRACK, the haunting SOUNDS OF A GREGORIAN FUNERAL CHANT. The \n               CAMERA PANS UP to the faces of older brothers and sisters, \n               then to parents and grandparents. These are not familiar \n               faces, but faces from another age, strong and open. All are \n               dressed in the distinctive clothing of the Amish.\n\n               EXT. COUNTRY LANE \u0096 DAY\n\n               Through the last traces of early morning mist another group \n               of black-clad figures make their way down a lane.\n\n               EXT. COUNTRY LANE \u0096 DAY\n\n               An Amish buggy, black and highwheeled, stark against the \n               landscape, appears, a spirited chestnut in the traces.\n\n               Framed in the glass window of the narrow buggy is the stern \n               figure of an Amish man in black topcoat and flatbrimmed hat, \n               his bonneted wife in muted colors, the face of a boy, attired \n               like his father, peering out.\n\n               The horse's breath smokes on the frosty air, the buggy CREAKS \n               on its springs, and there's the rhythmic CLIP-CLOP OF HOOVES \n               on the pavement.\n\n               ANOTHER LANE\n\n               Two Amish buggies reach a crossroads, join a procession of \n               three others. They disappear as the lane wends through a \n               leafless thicket of hickory.\n\n               VALLEY\n\n               A BIG SHOT... now the procession numbers almost a dozen \n               buggies... it is headed toward a distant farmhouse.\n\n               BARNYARD\n\n               Where literally dozens of carriages are parked. The horses \n               have been taken from the traces, removed to the shelter of \n               the barn.\n\n               EXT. LAPP FARMHOUSE \u0096 FRONT PORCH\n\n               As the black clad mourners begin to move into the house (women \n               and children presumably first).\n\n               INT. LAPP FARMHOUSE\n\n               The coffin has the upper half open. We see that the corpse \n               has been dressed in white linen, a piece of white linen \n               partially covering the bearded face.\n\n               END TITLE SEQUENCE\n\n               INT. LAPP FARMHOUSE\n\n               Partitions have been removed, making the central rooms of \n               the farmhouse a spacious hall. The place is packed, a hundred-\n               fifty or more Amish, all sitting in absolute silence on rows \n               of wooden benches. A wooden coffin rests on a bench in the \n               f.g., and near it the close relatives of the deceased occupy \n               a special Place.\n\n               RACHEL LAPP\n\n               A young woman of perhaps twenty-seven. Her face is pale and \n               drawn.\n\n               In happier circumstances, although there haven't been too \n               many of late in Rachel's life, we would see a robust, sensual \n               woman of full figure, spirit and intelligence.\n\n               Eight-year-old SAMUEL LAPP flits next to his mother; he would \n               appear stunned, possibly not entirely comprehending events.\n\n               And the patriarch, ELI LAPP; his stubborn, weathered \u0096 yet \n               not unkind \u0096 features grief-stricken.\n\n               THE MOURNERS\n\n               Their faces...\n\n               CLOCK\n\n               As it begins to CHIME nine a.m.\n\n               FAVORING PREACHER\n\n               As he removes his hat. As one, the men in the congregation \n               remove their hats also.\n\n               Then the preacher begins to speak in a formal German dialect:\n\n               SUBTITLES OVER.\n\n                                     PREACHER\n                         ...a brother has been called home. \n                         God has spoken through the death of \n                         our neighbor, Jacob Lapp...\n\n               THE FAMILY\n\n               Where Rachel, Samuel and Eli are SITTING - SOUNDS of emotion \n               and grief not quite suppressed are heard throughout as:\n\n                                     PREACHER\n                         ...husband of Rachel, father to \n                         Samuel, son of Eli.\n                              (and)\n                         His chair is empty, his bed is empty, \n                         his voice will be heard no more. He \n                         was needed in our presence, but God \n                         needs such men, too. That one should \n                         be taken so suddenly. Treat sorrow. \n                         Still, we would not wish him back. \n                         Rather we should prepare ourselves \n                         to follow him.\n\n               TIGHTENING to the Lapps, and...\n\n               EXT. CEMETERY\n\n               The mourners have gathered about the grave, standing in \n               silence as four pallbearers are lowering the coffin into the \n               pit. The many buggies are aligned in the b.g.\n\n               As the pallbearers begin to shovel soil and gravel into the \n               grave, the Preacher begins to read a hymn in German... a \n               slow atonal litany which seems to hang forever on the frosty \n               air.\n\n               RACHEL\n\n               TIGHTENING to her as the hymn continues...\n\n                                                                    CUT TO:\n\n               INT. LAPP FARMHOUSE\n\n               Where the Amish have gathered for the traditional post \n               funeral, midday meals.\n\n               Long tables are laden with customary Amishfare... crocks of \n               soup, hams, fowl, fried boiled eggs and pickled beets, \n               preserves and an infinite variety of pies and pastries.\n\n               RACHEL\n\n               Where she sits among women, accepting their condolences.\n\n               DANIEL HOCHSTETLER\n\n               A brawny-armed, ruggedly-handsome, raffish looking Amishman. \n               There is something atypical about his face a slightly sardonic \n               set of mouth, a bold eye, a prominent set of jaw. Not exactly \n               what old Jacob Ammann had in mind, maybe, but a well set-up \n               man nonetheless, and at ease among men. He's among a group \n               of men including old STOLTZFUS, the local healer, FISHER, \n               BIEILER and Bieiler's stout young son, Tom.\n\n                                     STOLTZFUS\n                         Lapp was a good farmer. None better.\n\n                                     BEILER\n                         But not the man to buy a horse for \n                         you.\n                              (and)\n                         Hochstetler, wasn't it your father \n                         sold him that horse with a ruptured \n                         testicle?\n\n                                     TOM\n                              (grins)\n                         Told him it was a bee sting made him \n                         limp that way.\n\n                                     HOCHSTETLER\n                              (amused)\n                         That horse had one good ball. That's \n                         all it takes.\n\n               The others chuckle. But Hochstetler's attention is still on \n               Rachel.\n\n               RACHEL\n\n               As Hochstetler looms on the horizon, plants himself like a \n               tree in front of her.\n\n               At ease as he was with the men, he's a bit awkward at this. \n               All the women, very much aware of Hochstetler's availability, \n               tune in as Rachel looks up.\n\n                                     HOCHSTETLER\n                         I was sorry to hear about Jacob. Let \n                         us hope he walks close with God.\n\n                                     RACHEL\n                         I'm sure he does, Daniel.\n\n               FIELDS, LAPP FARM \u0096 DAY\n\n               It is some time after the funeral and the Lapp family is \n               hard at work breaking ground for the spring ploughing. The \n               death of Jacob has increased the work load on all three \u0096 \n               Samuel maneuvers a four-mule team while Rachel and old Eli \n               work nearby, further breaking up the earth. Rachel looks up \n               from the back-breaking labor as several figures approach \u0096 \n               it's Daniel Hochstetler and two of his brothers. Without a \n               word they fall in beside Eli and Rachel and take up various \n               tasks associated with the work in hand.\n\n               Daniel works close beside Rachel.\n\n               EXT. COUNTRY ROADS, LANCASTER COUNTY \u0096 DAY\n\n               A few BRIEF SHOTS of a lone buggy containing the Lapp family \n               take us from the 18th century into the 20th century the \n               reassuring RATTLE OF THE CARRIAGE WHEELS on quiet backroad, \n               to the ROAR OF TRAFFIC as the buggy waits patiently for a \n               chance to cross a busy interstate highway.\n\n               EXT. HIGHWAY, LANCASTER COUNTY \u0096 DAY\n\n               A huge tractor trailer rig hovers over the frail buggy as it \n               trots down the interstate. The camera cranes up to reveal a \n               procession of vehicles behind the truck for a chance to \n               overtake it.\n\n               EXT. PLATFORM, LANCASTER STATION \u0096 DAY\n\n               Daniel Hochstetler moves through the crowd on the plat-form, \n               Rachel turns surprised, as he approaches, a faint color coming \n               to her cheek.\n\n                                     RACHEL\n                         Daniel?\n\n                                     HOCHSTETLER\n                         I... I was at the feed store. And I \n                         saw your horse, so...\n\n               There is an embarrassment between them broken by the arrival \n               of the train.\n\n                                     HOCHSTETLER\n                         You will come back soon?\n\n               Samuel can barely contain his excitement as he drags at his \n               mother's hand.\n\n                                     SAMUEL\n                         Quickly, Mother Quickly!\n\n               Rachel embraces Eli.\n\n                                     ELI\n                         You be careful out among them English.\n\n               She turns to Hochstetler.\n\n                                     RACHEL\n                         I need time, Daniel.\n\n               EXT. CARPARK, LANCASTER STATION \u0096 DAY\n\n               Daniel Hochstetler leaps into the driving seat of his open \n               wagon and with a flick of the reins and a whoop sets his \n               horse off at a fast trot.\n\n               EXT. TRAIN \u0096 DAY\n\n               The ENGINE gives a WARNING BLAST before creeping slowly \n               forward.\n\n               INT. TRAIN (MOVING)\n\n               As Samuel spots something out of the window that causes him \n               to light up.\n\n                                     SAMUEL\n                         Look, Mama...!\n\n               HIS POV THROUGH WINDOW\n\n               A road runs parallel to the train track, and Hochstetler in \n               his wagon urges his horse almost to the gallop as he attempts \n               to keep pace with the train.\n\n               BACK TO SCENE\n\n               As Rachel smiles.\n\n                                     RACHEL\n                         I see, darling.\n\n               And Samuel cranes to look back, waving, for as long as he \n               can.\n\n               EXT. LANCASTER COUNTRYSIDE \u0096 DAY\n\n               The train moves across a broad panorama of fields, dotted \n               with dolls'-house-sized farms and the tiny figures of Amish \n               farmers working their horse-drawn equipment.\n\n               SERIES OF CUTS\n\n               As the train continues its eastward journey... Samuel stares \n               raptly out of the window at the changing patterns of the \n               countryside. He points in wonder at a brightly colored hot \n               air balloon as it drifts slowly over timbered hills... he \n               looks unsure as the pattern of field and wood gives way to \n               suburbs, bustling shopping centers, restaurants, car lots \n               and fast food outlets.\n\n               EXT. PHILADELPHIA SLUMS\n\n               As the train travels past dilapidated row houses, streets \n               choked with cars and the gutters with filth.\n\n               INT. TRAIN (MOVING)\n\n               Now Samuel is staring out the window with some confusion, \n               almost apprehension:\n\n                                     SAMUEL\n                         Is this where we're going?\n\n                                     RACHEL\n                         Of course not. We're going to \n                         Baltimore. It's much nicer in \n                         Baltimore.\n\n               And Rachel draws her son closer, turning her back on the \n               window.\n\n               INT. 30TH ST. STATION, PHILADELPHIA \u0096 DAY\n\n               Rachel is in a line at one of the counters. The plain dress \n               of the two Amish \u0096 particularly Samuel's black coat and hat \n               \u0096 are drawing curious stares.\n\n               SAMUEL\n\n               He's uncomfortably aware of the shy looks and giggles of a \n               little girl about his own age, standing in line with her \n               parents at the next counter. He edges away from his mother...\n\n               ANGLE\n\n               As Samuel comes upon a figure garbed in a long black frock \n               coat and flat-brimmed hat... the man's back is turned, could, \n               from appearances, be an Amishman.\n\n               Samuel stares... A beat, the man turns to face Samuel and we \n               discover that he is a Hasidic Jew.\n\n               SAMUEL\n\n               As he reacts.\n\n               BACK TO TICKET COUNTER\n\n               As Rachel's turn arrives. The TICKET SELLER glances up and \n               she shows him her ticket.\n\n                                     RACHEL\n                         We have a ticket to Baltimore. Where \n                         is that train, please?\n\n                                     TICKET SELLER\n                         Delayed three hours. You'll hear an \n                         announcement when it's time to board.\n\n               He starts to go without his hat, but Rachel collars him and \n               puts it on his head.\n\n               ANGLE IN MEN'S ROOM\n\n               As Samuel enters.\n\n               It's a long row of sinks, urinals, and stalls... Samuel stops \n               before one of the urinals \u0096 a long, trough-like affair with \n               water drizzling down the rear porcelain panel.\n\n               It's set a little high for Samuel, and it is making GLUGGING \n               FLUSHING NOISES that are, at least, intimidating. Samuel \n               stares for a moment, then turns, looks toward the stalls, \n               stoops to see which are empty.\n\n               HIS POV \u0096 TOILETS\n\n               Beneath the row of doors we can see no feet visible. Samuel \n               is alone in the restroom.\n\n               BACK TO SCENE\n\n               As Samuel proceeds along the row of door, finally selects a \n               stall near the end. He enters. As he does so, a heavily \n               bearded youth in a dirty sweatshirt enters. With some urgency, \n               he removes small notebook from his pocket and places it behind \n               a paper towel dispenser. Suddenly he glances up.\n\n               Two other men have entered the men's room; one is a large \n               BLACK MAN in a three-piece suit under an expensive, overcoat. \n               His PARTNER is a Caucasian in designer jeans, half boots and \n               a short leather jacket.\n\n               They advance on the young man with unmistakable menace.\n\n               The young man whirls in terror; his two assailants lunge for \n               him... a savage, wordless struggle ensues in the close \n               confines of the lavatory.\n\n               ANGLE IN SAMUEL'S STALL\n\n               As the struggling men bounce off the door of his stall... he \n               can see their feet under the edge of the door.\n\n               BACK TO FIGHT\n\n               As the struggle builds to a climax... ends with the young \n               man stiffening with a grunt, his face draining of color.\n\n               The two attackers step away, the blade in the black man's \n               hand bloodstained. His partner stares at what they've \n               accomplished with a stunned expression:\n\n                                     PARTNER\n                         Jesus...\n\n               The young man's hand comes away from his belly covered with \n               blood.\n\n               He stares at it, staggers toward the sinks. Finally his \n               bloodied hand reaches to smear at his face in the mirror. \n               Then he collapses to the floor.\n\n               The black man motions for his partner to watch the door, \n               then quickly reaches up and removes the notebook from behind \n               the dispenser.\n\n               ANGLE IN SAMUEL'S STALL\n\n               As he edges open the stall door a crack. Over his shoulder \n               we can see the black man, his BACK TO US, rifling the \n               backpack. But beyond him, in the mirror on the far wall, we \n               catch sight of the black man's face.\n\n               SAMUEL\n\n               As he stares out the narrow crack. A beat, then he closes \n               the stall door.\n\n               ANGLE IN STALL\n\n               Samuel tries to make the latch work, but it's warped and \n               won't fall closed.\n\n               BLACK MAN\n\n               As he checks the notebook before placing it in his pocket. \n               His partner is covering the door, an automatic in his hand.\n\n               The black man makes for the exit, then on second thought, \n               glances at the row of stalls.\n\n               HIS POV \u0096 STALLS\n\n               All quiet, but...\n\n               BACK TO SCENE\n\n               The black man whips out a .38 caliber revolver, and, starting \n               at the near end, starts pushing open the stall doors.\n\n               ANGLE IN SAM'S STALL\n\n               As the black man approaches, Samuel working desperately on \n               the latch. At the last minute he finally wedges it in.\n\n               BLACK MAN\n\n               He elbows Samuel's stall... the door won't open.\n\n               ANGLE IN SAM'S STALL\n\n               Fighting back panic, Samuel has retreated as far as he can.\n\n               BLACK MAN\n\n               As he gives the door a kick. It holds. He swears under his \n               breath.\n\n               ANGLE IN SAM'S STALL\n\n               In desperation, Samuel does the only thing he can think of... \n               he slips under the partition into the neighboring stall the \n               black man just checked out. But he loses his hat in the \n               process. His hand snakes back INTO FRAME to snatch it just \n               as the black man gives the door a ferocious kick that \n               splinters the lock and nearly takes it off its hinges. He's \n               framed there, the big muzzle of the .38 revolver looking \n               down our throats.\n\n               ANGLE\n\n               As his partner snaps from the doorway:\n\n                                     PARTNER\n                         Will you come on, for Christ's sakes!\n\n               A beat, then the black man holsters his weapon, turns to \n               follow the partner out.\n\n               BACK TO SAMUEL\n\n               As we hear the SOUND OF THE TWO MEN EXITING the lavatory. A \n               long beat, then Samuel opens the stall door a crack.\n\n               HIS POW THROUGH DOOR\n\n               Samuel's own face reflected in the blood-smeared mirror... \n               then PANNING DOWN to the still figure of the young man lying \n               in the crimson pool of his own blood on the floor.\n\n               BENCH WAITING ROOM \u0096 LOW ANGLE \u0096 NIGHT\n\n               Samuel sits close to his mother, his face pale, his eyes \n               staring.\n\n               Rachel holds his hand tightly in hers as the torsos of various \n               police and officials pass through foreground, occasionally \n               obscuring the lonely couple. There is considerable ECHOING \n               NOISE as commands and requests mingle with the CRACKLE OF \n               TWO-WAY RADIOS.\n\n                                                                    CUT TO:\n\n               DOOR \u0096 MEN'S' ROOM\n\n               The diffused shape of faces behind the frosted glass of the \n               Men's room door, which is pushed open to reveal, JOHN BOOK, \n               who comes striding through to be momentarily lost in the \n               crowd of police, reporters and others. He is about 40, with \n               a rangy, athletic body. Behind him comes CARTER, Book's black \n               partner \u0096 about five years younger than Book. Book is wearing \n               a suit, Carter is much more casually \u0096 almost disreputably \u0096 \n               dressed.\n\n                                                                    CUT TO:\n\n               BENCH\n\n               Little Samuel watching Book, back to crowd of police, as \n               Book questions an old black CUSTODIAN.\n\n                                     BOOK\n                         You found the body?\n\n                                     CUSTODIAN\n                         Uh uh. Not me, daddy, I just reported \n                         it. It was the kid.\n\n                                     BOOK\n                         What kid?\n\n                                     CUSTODIAN\n                         How'n hell do I know what kid? The \n                         kid in the funny black threads.\n\n               TIGHT SHOT \u0096 SAMUEL\n\n               Worry-eyed, still staring straight ahead. Then his eyes move \n               suddenly to his left.\n\n               BOOK'S LEGS \u0096 SAMUEL'S POV\n\n               Coming in at full stride, then stopping.\n\n               SAMUEL\n\n               He doesn't raise his eyes... just looks at the legs. And, \n               slowly, the legs begin to bend at the knees. We see Book's \n               belt buckle, then his big pistol in its holster, then his \n               face. He stares at Samuel for a moment, then...\n\n               ANGLE \u0096 BOOK\n\n               As his face breaks into a big grin, and...\n\n                                     BOOK\n                         Hi, kid.\n\n               RACHEL\n\n               Immediately alarmed, intervening.\n\n                                     RACHEL\n                         What do you want of my son?\n\n               THE SCENE\n\n               As Book takes out his wallet, displays his shield.\n\n                                     BOOK\n                         I'm a police officer. I'm going to \n                         have to talk to the boy. What's his \n                         name?\n\n                                     RACHEL\n                         Samuel. Samuel Lapp.\n                              (then, quickly)\n                         But what happened here is none of \n                         his affair. My sister is expecting \n                         me... our train is leaving soon.\n\n                                     BOOK\n                         There'll be another train.\n                              (turns to Samuel)\n                         The man who was killed tonight was a \n                         policeman, Sam. It's my job to find \n                         out who did it. I want you to tell \n                         me everything you saw when you went \n                         in there.\n\n                                     SAMUEL\n                              (stammers)\n                         I saw him.\n\n                                     BOOK\n                         Who'd you see?\n\n               Sam looks at his mother.\n\n                                     BOOK\n                         Who'd you see, Sam? The man on the \n                         floor?\n\n                                     SAMUEL\n                         No... I saw the man who killed him.\n\n               Book stares at him in surprise, speaks over his shoulder to \n               Carter.\n\n                                     BOOK\n                         Anybody know about this?\n\n                                     CARTER\n                         I didn't even know about it.\n\n                                     BOOK\n                              (back to Sam)\n                         Okay, Sam. Can you tell me what he \n                         looked like?\n\n                                     SAMUEL\n                              (groping, touching \n                              his clothes and \n                              pointing at Carter)\n                         He was... like him.\n\n                                     BOOK\n                              (nods)\n                         Black... I understand. What else,Sam?\n\n               A beat, then Sam crosses quickly to Carter, Book's rather \n               slightly built partner:\n\n                                     SAMUEL\n                         Not Zwartich, like him \u0096\n\n               Book frowns, puzzled:\n\n                                     BOOK\n                         Try that one again, Sam \u0096\n\n               Samuel gives his mother a helpless look; exasperated, Rachel \n               intervenes with Book. She glances at Carter:\n\n                                     RACHEL\n                         May I talk to you?\n\n               ANGLE\n\n               As Rachel takes Book aside, and in a low voice:\n\n                                     RACHEL\n                         Zwartich. It's the way we say... \n                         dwarf.\n                              (glances at Carter)\n                         Not like him... very big.\n\n               Book nods, starts to turn back to Sam. Just then a commotion \n               off screen catches his attention.\n\n               BOOK'S POV \u0096 ONCOMING COPS\n\n               It's Capt. TERRY DONAHUE, Chief of Homicide, striding past \n               the crowd of journalists and TV crews... brushing off \n               reporters' questions and snapping orders to the aides he's \n               got in tow:\n\n               BACK TO SCENE\n\n               AS DONAHUE COMES ON BOOK:\n\n                                     DONAHUE\n                              (to aides)\n                         Close it all down... I want a man on \n                         every exit... I want the lab in here \n                         now!\n                              (to Book)\n                         And I want to talk to you, Captain.\n\n               ANGLE\n\n               As Book steps aside with Donahue... In the b.g. Rachel moves \n               protectively to Samuel's side.\n\n                                     BOOK\n                         All right, talk. \n\n                                     DONAHUE\n                         This is homicide \u0096 not Internal \n                         Affairs! So why are you behaving \n                         like you own this case?\n\n                                     BOOK\n                         We were running Zenovitch... That's \n                         all I can tell you. But I want it, \n                         Terry.\n                              (then)\n                         I've got a call into Schaeffer.\n\n               RACHEL / SAMUEL\n\n               They can't help but watch the confrontation between Donahue \n               and Book... although they're keeping the volume down, it's \n               obviously intense and angry:\n\n                                     SAMUEL\n                              (alarmed)\n                         Momma... are they angry with us.\n\n                                     RACHEL\n                              (reassuring, but hardly \n                              in her own mind)\n                         No... No. It is just the English \n                         way.\n\n               Donahue has lost the confrontation; he gives Book a smile:\n\n                                     DONAHUE\n                         You ought to think about coming back \n                         to Homicide, Johnny... Stick with \n                         Internal Affairs and you're not gonna \n                         have any friends left.\n\n                                     BOOK\n                              (smiles right back)\n                         I'll buy a dog.\n\n               EXT. 30TH ST. STATION \u0096 NIGHT\n\n               Book emerges from the terminal, looks about him, then crosses \n               to a big Mercury Sedan which is parked nearby. Two men sit \n               in the front seat. Book crosses to the driver's side and \n               opens the door.\n\n                                     BOOK\n                         Go get a cup of coffee, Stan.\n\n               The driver, a uniformed policeman, glances at the man beside \n               him who nods in agreement. He gets out and Book gets in behind \n               the wheel.\n\n               INT. SEDAN\n\n               Book sits next to SCHAEFFER, a surprisingly kindly looking \n               man of about fifty. Schaeffer is a Deputy Chief.\n\n                                     SCHAEFFER\n                         How reliable is this kid?\n\n                                     BOOK\n                         Oh, he's good.\n\n                                     SCHAEFFER\n                         Amish.\n\n                                     BOOK\n                         Yeah.\n\n                                     SCHAEFFER\n                         What have you got?\n\n                                     BOOK\n                         Zenovitch was about to deliver a \n                         list of names tonight \u0096 street \n                         chemists... the guys processing this \n                         P2P into speed.\n\n                                     SCHAEFFER\n                         So one of them got to him.\n\n                                     BOOK\n                         Maybe.\n\n                                     SCHAEFFER\n                         You know who?\n\n                                     BOOK\n                         Maybe.\n\n                                     SCHAEFFER\n                         You're still convinced there's a \n                         link to the department?\n\n                                     BOOK\n                         If there isn't I've just wasted the \n                         last six months.\n\n                                     SCHAEFFER\n                         That's the problem. We need results. \n                         The press is driving us crazy over \n                         this P2P thing. Calling us the 'speed \n                         capitol of the country'. You know \n                         the sort of thing. It's getting \n                         political. The Commissioner's getting \n                         very uneasy.\n\n                                     BOOK\n                         The Amish boy saw him, Paul. I'll \n                         make it, but Set Donahue and the \n                         Homicide Department off my back or \n                         they'll blow the whole thing.\n\n                                     SCHAEFFER\n                         When word gets out that Zenovitch \n                         was a cop, all hell will break lose. \n                         You've got 24 hours. That's all I \n                         can give you. 24 hours on your own. \n                         After that the case and the witness \n                         go back to the Homicide Department.\n\n                                     SCHAEFFER\n                              (shakes his head)\n                         Tell you what... why don't you and \n                         that blonde \u0096 what's-her-name \u0096 come \n                         over for dinner Sunday. How 'bout \n                         that.\n\n                                     BOOK\n                         What's-her-name moved to Buffalo.\n\n                                     SCHAEFFER\n                              (sighs)\n                         Well, anyway, don't get crazy.\n                              (dismisses him)\n                         I'll do something for Zenovich's \n                         wife.\n\n               INT. BOOK'S CAR (MOVING) PHILADELPHIA \u0096 NIGHT\n\n               Book drives around 13th Street, a ravaged corridor between \n               neon lit restaurants, bars, porno shops and darkened \n               storefronts.\n\n               Carter sits beside him, Rachel and her son in the back seat \n               looking out at the assorted array of desperate characters \n               huddled in doorways or wandering aimlessly about. On the \n               POLICE RADIO a description of the cop killing is BROADCAST \n               EVERY FEW MINUTES.\n\n                                     CARTER\n                         I got there late, John.\n\n                                     BOOK\n                         Let's just find Coalmine.\n                              (beat)\n                         Listen, Zenovich made a mistake. You \n                         didn't let anybody down. It happens \n                         \u0096\n\n                                     CARTER\n                              (grimly)\n                         It won't happen again.\n\n                                     RACHEL\n                         Where are you taking us?\n\n                                     BOOK\n                         We're looking for a suspect. We've \n                         reason to believe he's still in the \n                         area.\n\n                                     RACHEL\n                         You have no right to keep us here.\n\n                                     BOOK\n                         Yes I do. Your son is a material \n                         witness to a homicide.\n\n                                     RACHEL\n                         You don't understand, we have nothing \n                         to do with your laws!\n\n                                     BOOK\n                         Doesn't surprise me. I meet a lot of \n                         people like that.\n\n                                     RACHEL\n                         It's not a joke.\n\n               Book decides to try contrition:\n\n                                     BOOK\n                         You're right. It's not a joke. Listen, \n                         I know a little about the Amish. I \n                         know this has to be an ordeal for \n                         you; and I'm really sorry you an \n                         Samuel got involved.\n\n               Samuel shoots a look at Book then mutters something to his \n               mother in German. She responds in the same language. Book \n               frowns.\n\n                                     BOOK\n                         What was that?\n\n                                     RACHEL\n                         He wants to know who you are. Your \n                         name. I told him we don't need to \n                         know anything about you.\n\n               Book eyes Samuel:\n\n                                     BOOK\n                         Book. John Book\n\n               EXT. 13TH ST. STATION \u0096 NIGHT\n\n               Book's car stops, and from out of the shadows darts a wizened \n               little MAN. He looks about before crossing to the driver's \n               side window.\n\n               INT. BOOK'S CAR \u0096 NIGHT\n\n               Book lowers the window.\n\n                                     BOOK\n                         Sammy, where's Coalmine?\n\n               The little man stares at the weird-looking couple in the \n               back seat.\n\n                                     SAMMY\n                         What you got there, the Salvation \n                         Army?\n\n                                     BOOK\n                         Coalmine.\n\n                                     SAMMY\n                         Try \"Happy Valley\".\n\n               EXT. HAPPY VALLEY BAR, SOUTH STREET \u0096 NIGHT\n\n               Book's car pulls up outside the bar and he and Carter get \n               out, and move swiftly inside.\n\n               INT. HAPPY VALLEY \u0096 NIGHT\n\n               Sixty black faces stare as the police enter. A hush falls on \n               the group. Book and Carter spot their man at the bar and \n               move up either side of him. They've moved carefully to this \n               point... no mistakes. From the back, the black man they've \n               approached certainly looks like he could be the man who did \n               the killing of Zenovitch. And, as Book and Carter make their \n               move...\n\n               EXT. HAPPY VALLEY \u0096 NIGHT\n\n               As Book and Carter explode through the door of the bar, \n               violently propelling Coalmine along with them. Now we see \n               Coalmine is not the killer.\n\n               As Book and Carter escort Coalmine out of the bar a police \n               squad car pulls up, its headlights shining into Book's car. \n               An alarmed Rachel holds Samuel close as Book forces Coalmine's \n               face down next to the car window.\n\n                                     BOOK\n                         Put some light on him.\n\n               A cop pulls out a flashlight, begins to play the beam over \n               Coalmine's face.\n\n                                     BOOK\n                              (continuing; to Samuel)\n                         Look at him.\n\n               Crazy as Rasputin on speed and booze, Coalmine glares at \n               Samuel inside the car:\n\n               Samuel, white-faced, finally shakes his head in the negative.\n\n               Coalmine tries to twist free of Book's grip. Book snaps, and \n               slams Coalmine's skull into the window edge, finally crushing \n               his face up against the front window. His face takes on a \n               grotesque shape against the glass. Carter restrains his \n               partner and Book cools down. Coalmine is led stumbling away \n               by the uniformed police. This sudden show of violence has \n               horrified and angered Rachel, and she glares at Book as he \n               gets back in the car.\n\n                                     RACHEL\n                         John Book, you listen to me! I will \n                         have no further part in this, nor \n                         will my son! As God stands between \n                         us!\n\n               Book sighs, starts the engine and moves off.\n\n               EXT. HOTEL \u0096 PHILADELPHIA \u0096 NIGHT\n\n               Book pulls up outside a hotel entrance as a uniformed DOORMAN \n               moves to open the rear door.\n\n               INT. CAR \u0096 NIGHT\n\n               Rachel and Sam recoil as the Doorman opens the door. He is \n               puzzled by the sight of the reluctant guests.\n\n                                     DOORMAN\n                         Ma'am?\n\n                                     RACHEL\n                         No! We do not stay in hotels.\n\n               Book and Carter exchange a glance.\n\n               EXT. / INT. FRONT DOOR, SUBURBAN HOUSE \u0096 PHILADELPHIA \u0096 \n               NIGHT\n\n               An attractive woman in her early thirties in robe and slippers \n               stares in disbelief as Rachel and Sam file into the house. \n               This is ELAINE, Book's sister. She stops Book as he tries to \n               follow Rachel inside.\n\n                                     ELAINE\n                         How could you do this to me tonight? \n                         I told you I had company\n\n                                     BOOK\n                         Sorry. It's important.\n\n               BACK TO RACHEL\n\n               As she glances in a doorway.\n\n               HER POV \u0096 ELAINE'S KITCHEN\n\n               It's a shambles, with dirty supper dishes piled sink, the \n               table littered with empty beer cans.\n\n               BACK TO RACHEL\n\n               As she hustles Samuel along.\n\n               BOOK / ELAINE\n\n               Book frowns:\n\n                                     BOOK\n                         Where's Timmy and Buck?\n\n                                     ELAINE\n                         Upstairs, asleep. Where'd you think?\n\n                                     BOOK\n                         You've got a man here and the kids \n                         are upstairs?\n\n                                     ELAINE\n                         That's none of your goddamn business! \n                         So keep your goddamn holier-than-\n                         thou mouth shut!\n                              (and)\n                         Anyway, they like Fred.\n\n                                     BOOK\n                         Oh sure, Fred.\n\n               Elaine looks like she's going to blow again, then decides \n               it's pointless.\n\n                                     ELAINE\n                         Who are these orphans, anyway?\n\n                                     BOOK\n                         They're Amish.\n\n               ANGLE IN GUEST ROOM\n\n               Samuel is asleep in one twin bed in a tiny, cluttered room.\n\n               Rachel, in a plain nightgown, is preparing to climb into the \n               other one.\n\n               Off screen we hear a DOOR CLOSE, presumably Book leaving. A \n               beat, then Elaine opens the door and looks in.\n\n                                     ELAINE\n                         Everything okay?\n\n                                     RACHEL\n                         Yes, thank you very much.\n\n                                     ELAINE\n                              (a beat)\n                         John said you're Amish.\n\n                                     RACHEL\n                         Yes.\n\n                                     ELAINE\n                              (blankly)\n                         Oh.\n\n               She nods and goes.\n\n               Rachel crosses to Samuel, sits on the bed. Samuel looks up \n               at her bleakly.\n\n                                     SAMUEL\n                         I don't want to stay here.\n\n                                     RACHEL\n                         They are English. They don't \n                         understand.\n\n                                     SAMUEL\n                         I wish dawdie was with us.\n\n                                     RACHEL\n                              (swallows)\n                         I know. Sleep now, Liebchen.\n\n               She puts her hand on his forehead, closes his eyes. she \n               frowns, and...\n\n               EXT. DRIVE-IN FAST-FOOD JOINT \u0096 PHILADELPHIA \u0096 DAWN\n\n               Carter exits the cafe carrying burgers, donuts and a couple \n               of beers. Book wakes from a brief nap as Carter gets into \n               the car.\n\n               Book chews into his burger while Carter takes a doughnut. \n               Its clear they've worked through the night.\n\n               EXT. ELAINE'S HOUSE \u0096 DAY\n\n               Elaine's house is situated on the corner of a row of terraces, \n               which stretch into the distance on both sides of the street.\n\n               INT. ELAINE'S HOUSE\n\n               As Samuel comes out of the guest room in his night-shirt, \n               turns up the hall and opens the door to the bathroom.\n\n               ANGLE\n\n               But it's not the bathroom; it's Elaine's bedroom. She and \n               FRED are tangled in the sheets, furiously making love. Elaine \n               gasps, Fred manages to grunt.\n\n                                     FRED\n                         Wrong door, kid.\n\n               ANOTHER ANGLE\n\n               As Samuel quickly shuts the door. A straight-faced beat; \n               then, barely suppressing a giggle, he hurries on...\n\n               ANGLE IN LIVING ROOM\n\n               As Rachel appears in the living room entry. Samuel is sitting \n               on the floor with two boys of about his own age, watching \n               television.\n\n               They're eating cold cereal out of a box.\n\n               RACHEL'S POV \u0096 TV SCREEN\n\n               Some artless Saturday morning cartoon.\n\n               BACK TO RACHEL\n\n               As she frowns, watching her son and the other two staring \n               hypnotically. And...\n\n               ANGLE IN LIVING ROOM\n\n               It's later in the morning now, as Elaine, a bit blearily, \n               appears in the entryway, stares in groggy disbelief.\n\n               HER POV \u0096 KIDS\n\n               Her oldest boy and Samuel are busily washing the windows \n               while her youngest is pushing a carpet sweeper. The TV is \n               off.\n\n               BACK TO ELAINE\n\n               As she stares.\n\n               ANGLE IN KITCHEN\n\n               Rachel is standing in the middle of the now immaculate kitchen \n               finishing a brisk mop of the floor. The coffee is perking. \n               Elaine appears.\n\n                                     ELAINE\n                              (mutters)\n                         Jesus...\n\n               Rachel turns cheerily.\n\n                                     RACHEL\n                         Good morning.\n\n                                     ELAINE\n                              (helplessly)\n                         You didn't have to...\n\n                                     RACHEL\n                         I wanted to. you were kind to take \n                         us in last night.\n                              (and)\n                         Anyway, I needed something to do. I \n                         was so angry with your brother. He's \n                         so... agaanisish!\n\n                                     ELAINE\n                         Aganishish? Yeah, that sounds like \n                         John.\n\n               She takes a seat at the table, still shaking her head.\n\n                                     RACHEL\n                         Just a minute. I'll pour you some \n                         coffee.\n\n                                     ELAINE\n                         You're not carrying a bullwhip... \n                         how'd you manage to put my kids to \n                         work?\n\n                                     RACHEL\n                              (smiles)\n                         I made it a contest... the one who \n                         does best gets his cereal back first.\n                              (and)\n                         Children like to help... they only \n                         need to be kept after a little bit.\n\n               Rachel means no harm by this, but Elaine's eyes begin to \n               storm.\n\n                                     ELAINE\n                         Oh, is that so?\n                              (and)\n                         No offense, lady, but I'm not so \n                         sure I like the idea of your coming \n                         in here and turning the place upside \n                         down!\n\n               Rachel's smile fades at Elaine's trembling outburst:\n\n                                     RACHEL\n                         Please, I didn't mean...\n\n               Abruptly Elaine rises and snatches the mop from Rachel's \n               hands.\n\n               She mops furiously as she Continues:\n\n                                     ELAINE\n                         I know exactly what you meant! Listen, \n                         maybe I'm not a world-class housefrau, \n                         but maybe I don't have time to polish \n                         the goddamn china and keep after the \n                         kids!\n                              (and)\n                         It's none of your business, but I \n                         don't happen to have a man around \n                         here full time. So I sell cosmetics \n                         in a goddamn drugstore and sometimes \n                         I can even pay the rent on time! So \n                         maybe I'm not Mary Poppins, but maybe \n                         I don't need to have it jammed down \n                         my throat like this.\n\n               She finishes the floor, hurls the mop aside with a CLATTER:\n\n                                     ELAINE\n                         There is that clean enough for you?\n\n               Rachel is speechless, Elaine is on the point of bursting \n               into tears. At which point Fred appears at the entry in his \n               undershirt, taking in the sparkling kitchen.\n\n                                     FRED\n                         Jesus, Elaine... Somebody die and \n                         leave you a broom?\n\n               Not a politic observation on Fred's part.\n\n                                     ELAINE\n                              (blurts)\n                         Go to hell, Fred!\n\n               And, bursting into tears, she flees the kitchen. Fred stares \n               after her.\n\n                                     FRED\n                         What's bugging her?\n\n               Unperturbed, he crosses to the counter and the coffee pot, \n               letting his eyes take in Rachel's full figure.\n\n               INT. ELAINE'S BEDROOM\n\n               As Rachel comes in with Elaine's coffee, closes the door \n               behind her. Elaine is lying across the bed, sobbing.\n\n                                     RACHEL\n                         I brought your coffee.\n\n               She takes a seat next to the bed.\n\n                                     RACHEL\n                         I'm sorry. I didn't mean it that \n                         way.\n\n               After a moment, Elaine starts to pull herself together:\n\n                                     ELAINE\n                         It's okay.\n                              (and)\n                         Look, I shouldn't have blown my top. \n                         It's like... somehow... I've let \n                         everything get away from me. And you \n                         sort of made me face it.\n\n               She takes the cup, sips the coffee. Rachel smiles at a private \n               thought.\n\n                                     ELAINE\n                         What's so funny?\n\n                                     RACHEL\n                         Fred. The way he looked when you \n                         screamed at him.\n\n                                     ELAINE\n                              (disparing)\n                         God, Fred...\n\n                                     RACHEL\n                         At home you'd never hear a woman \n                         scream at a man that way.\n\n                                     ELAINE\n                         No? Why not?\n\n                                     RACHEL\n                         You just wouldn't. It's not the Amish \n                         way.\n                              (then)\n                         But I think it would have done me \n                         good if I could have screamed at \n                         your brother last night.\n\n                                     ELAINE\n                         Listen, I don't know what's going on \n                         or how you got mixed up with him, \n                         but don't you let that self-righteous \n                         son of a bitch push you around, okay?\n\n               Rachel smiles.\n\n                                     RACHEL\n                         Okay.\n\n               INT. BOOK'S CAR (MOVING) \u0096 DAY\n\n               Book glances irritably at Rachel:\n\n                                     BOOK\n                         Now what's the problem?\n\n                                     RACHEL\n                         The problem is I don't happen to \n                         think my son should be spending all \n                         his time with a man who carried a \n                         gun under his coat and goes around \n                         whacking people.\n\n               Book gives her a look:\n\n                                     BOOK\n                         Whacking?\n\n                                     RACHEL\n                              (firmly)\n                         Yes. And I also want to leave this \n                         city.\n\n                                     BOOK\n                         Believe me, I'm trying to get this \n                         over with as fast as I can. But Samuel \n                         will probably have to come back and \n                         testify.\n\n                                     RACHEL\n                         We do not go into your courts.\n\n                                     BOOK\n                         People who don't go into our courts \n                         when they're told to sometimes go \n                         directly into our jail.\n\n               Rachel glares at him and the ride continues on that chilly \n               note for a beat.\n\n                                     BOOK\n                         Look, I'm genuinely sorry...\n\n                                     RACHEL\n                              (snaps)\n                         No you're not \u0096\n                              (off his look)\n                         You're glad, because now you've got \n                         a witness.\n                              (and)\n                         I heard the other police talking \n                         last night.\n                              (and)\n                         They don't seem to like you very \n                         much.\n\n                                     BOOK\n                         They kid a lot.\n\n                                     RACHEL\n                              (glances at him)\n                         I would not be too sure.\n\n               Samuel has been glancing at Book; finally he says something \n               to his mother in German. Book gives her an inquiring look.\n\n                                     RACHEL\n                         He says you look very tired. I thought \n                         the same thing.\n\n               Book says nothing.\n\n                                     RACHEL\n                         But not a good tired.\n\n                                     BOOK\n                         What's a 'good' tired. Tired is tired.\n\n               She doesn't bother to explain; Book settles even deeper into \n               his funk as Samuel glares at him with hostility.\n\n               INT. IDENTIFICATION ROOM \u0096 POLICE H.Q. \u0096 DAY\n\n               Samuel sits with Book at a desk, Rachel just behind. They \n               are looking at a police line-up of known black drug-dealers. \n               Samuel shakes his head \u0096 another negative.\n\n               Book winks, slyly reaches into a pocket, produces a yellow \n               gumball. He surreptitiously shows it to Samuel, gives him an \n               inquiring look. It's a peace offering.\n\n               Samuel grins, nods imperceptibly.\n\n               ANOTHER ANGLE\n\n               As Book rolls the gumball down the table to Samuel. But just \n               as Samuel is about to cover it with his hand, Rachel reaches \n               over and plucks it off the table. She shakes her head at \n               Samuel.\n\n                                     BOOK\n                              (to Rachel)\n                         Just wanted to see if you were on \n                         your toes.\n\n               EXT. CITY PARK \u0096 DAY\n\n               Book, Sam and Rachel sit on a park bench eating a lunch of \n               hot dogs heaped with kraut.\n\n               Book watches with amusement as Samuel wolfs down his lunch. \n               Rachel eyes him a beat. then:\n\n                                     RACHEL\n                         Your sister said you don't have a \n                         family?\n\n                                     BOOK\n                         No.\n\n                                     RACHEL\n                         She thinks you should get married \n                         and have children of your own. Instead \n                         of trying to be a father to hers. \n                         Except she thinks you're afraid of \n                         the responsibility.\n\n               Book gives her a look:\n\n                                     BOOK\n                         Oh? Anything else?\n\n                                     RACHEL\n                         Oh yes. She thinks you like policing \n                         because you think you're right about \n                         everything. And you're the only one \n                         who can do anything. And that when \n                         you drink a lot of beer you say things \n                         like none of the other police would \n                         know a crook from a... um... bag of \n                         elbows.\n\n               Book is staring at her. Rachel nods.\n\n                                     RACHEL\n                         I think that's what she said.\n\n               Just then Samuel belches with huge satisfaction, drawing \n               looks from Book and a couple of passersby. Rachel smiles \n               proudly.\n\n                                     RACHEL\n                         Good appetite.\n\n                                                                    CUT TO:\n\n               INT. OUTER OFFICE/WAITING ROOM, NARCOTICS DIVISION \u0096 DAY\n\n               Rachel sits uneasily in the outer office, one or two police \n               clerks eyeing her curiously. A sign on the desk reads \n               \"Narcotics Division.\"\n\n               Rachel cranes forward trying to peer through a partially \n               open door.\n\n               INT. DETECTIVES ROOM, NARCOTICS DIVISION, POLICE H.Q. \u0096 DAY\n\n               A group of Narcotics Detectives are interrupted in mid \n               conversation by the opening of the main office door. They \n               stare in considerable surprise.\n\n                                                                    CUT TO:\n\n               JOHN BOOK\n\n               Standing in the doorway, holding little Samuel by the hand.\n\n                                     BOOK\n                         Afternoon, gentlemen. I'd like you \n                         to meet Samuel Lapp. We'd like a \n                         little help.\n\n               INT. SMALL OFFICE, NARCOTICS DIVISION \u0096 DAY\n\n               A Narcotics Detective enters the room laden with several \n               volumes of mug shots. He puts them on the desk beside a \n               similar book which Samuel is intently studying. Sam sits on \n               the chair cushions in a big swivel rocker.\n\n               The Detective, SGT. KAMAN, eyes Book a little suspiciously \u0096 \n               internal affairs officers are not greeted warmly by the \n               working policemen in any department.\n\n                                     KAMAN\n                         There's a Sgt. Carter on the phone \n                         for you.\n\n               Book gets up and moves to the door.\n\n                                     KAMAN\n                         And, Captain, don't want to rush \n                         you, but I'm gonna need these files \n                         back in a half hour. We got a lot of \n                         work to do round here.\n\n               The two men leave. Samuel looks about before hopping off his \n               perch and following the direction taken by Book.\n\n               INT. DETECTIVES ROOM, NARCOTICS DIVISION \u0096 DAY\n\n               Through glass partitions we can see Book on the telephone in \n               a cubicle of an office.\n\n               Samuel has drifted out of the office and is idling amid the \n               bustle of the squadroom.\n\n               He crosses to a glass case which holds a collection of plaques \n               and framed newspaper accounts which denote instances of \n               outstanding duty and achievement.\n\n               ANGLE THOUGH GLASS CASE\n\n               As Samuel moves along, only half interested in what his eyes \n               are taking in, not really old enough to comprehend anyway.\n\n               Until suddenly he freezes.\n\n               SAMUEL'S POV \u0096 NEWSPAPER ACCOUNT\n\n               Enlarged, prominently displayed. The headline reads: \"Division \n               Chief McElroy Honored For Youth Project\". Accompanying the \n               item is a large sidebar mug-shot of McElroy \u0096 clearly the \n               black man who murdered the young cop in the train station \n               men's room.\n\n               BACK TO SAMUEL\n\n               He stares, transfixed.\n\n               A long beat, then Book, lowering himself to one knee next to \n               Samuel, ENTERS FRAME.\n\n               He's watching Samuel, knowing from the boy's expression that \n               they've found their man. Samuel slowly raises his hand to \n               point at the photograph. Book gently takes the boy's small \n               hand in his, concealing the accusation from watchful eyes. \n               He smiles gently at the boy.\n\n               INT. BOOK'S CAR (MOVING) \u0096 PHILADELPHIA \u0096 DUSK\n\n               Rachel is curled tight in her corner of the front seat holding \n               Samuel close. Book glances at her:\n\n                                     RACHEL\n                         Why don't you arrest that man? Are \n                         you protecting him because policeman?\n\n                                     BOOK\n                              (snaps)\n                         Listen, I'm the cop that polices the \n                         police. I'm not in the business of \n                         protecting crooked cops.\n                              (eases up)\n                         I'll make an arrest when I know \n                         everybody involved.\n\n               Rachel shakes her head.\n\n                                     RACHEL\n                         But why would they murder...\n\n                                     BOOK\n                         Because \u0096 somehow \u0096 they knew I was \n                         getting close.\n                              (and)\n                         Look, it's narcotics... They make \n                         dope out of chemicals... they sell \n                         it on the street for millions of \n                         dollars. They'll do anything.\n                              (and)\n                         And they can get away with it because \n                         they're cops.\n\n                                     RACHEL\n                              (beat, then)\n                         I'm afraid. I'm afraid for Samuel. I \n                         want to go home.\n\n                                     BOOK\n                         You'll be safe. You don't have to \n                         worry.\n\n               She says nothing.\n\n               Another beat, then:\n\n                                     BOOK\n                         Look, they're thinking as long as \n                         they keep the killer out of Samuel's \n                         way, we can't make an I.D. There's \n                         no way they can know Samuel saw that \n                         photograph, so he's safe.\n\n               He glances at her, but she continues ahead.\n\n                                     BOOK\n                         I mean it. You will be safe.\n\n               Suddenly Rachel explodes:\n\n                                     RACHEL\n                         Oh yes! Of Course. Why shouldn't we \n                         feel safe in a city where the police \n                         are so busy killing each other!\n\n                                                                    CUT TO:\n\n               EXT. / INT. SCHAEFFER HOME, PHILADELPHIA SUBURBS \u0096 NIGHT\n\n               The front door of Schaeffer's upper-middle class home is \n               opened by his wife MARILYN. She knows Book and is surprised \n               and delighted to see him. In the background daughter KATHY \n               is visible. Schaeffer himself appears and Book is welcomed \n               inside.\n\n               INT. SCHAEFFER'S STUDY \u0096 NIGHT\n\n               Schaeffer passes Book a drink.\n\n               Book is excited, animated... the hunter, after a long chase, \n               closing on his quarry:\n\n                                     BOOK\n                         It was McElroy, Paul.\n\n               Schaeffer gives him a sharp look:\n\n                                     BOOK\n                         Last guy I would have figured. But \n                         he's part of it.\n\n                                     SCHAEFFER\n                         I hope you don't have any doubts \n                         about that.\n\n                                     BOOK\n                         If I did, I'd have kept my mouth \n                         shut...\n                              (and)\n                         It fits, Paul... Fifty-five gallons \n                         of P2P confiscated four years ago... \n                         Guess who was in on the collar? Mac.\n                              (excited, explaining \n                              the thing eagerly)\n                         He salts it away somewhere... he \n                         knows the stuff is potent, but the \n                         street chemists haven't figured out \n                         how to process it. But they do now.\n                              (and)\n                         And now the stuff is worth five-grand \n                         a pint and there are a lot of pints \n                         in a fifty-five gallon drum.\n\n                                     SCHAEFFER\n                              (beat)\n                         Who else knows?\n\n                                     BOOK\n                         Just us.\n\n                                     SCHAEFFER\n                              (shakes his head)\n                         Okay, what are you going to need to \n                         clean it up\n\n                                     BOOK\n                         More people... Gotta pick up where \n                         Zenovich left off. People from outside \n                         the department.\n\n                                     SCHAEFFER\n                              (nods)\n                         Maybe the Bureau. Or those bastards \n                         at Treasury. I'll take care of it.\n                              (then)\n                         I hate this shit, Johnny. You cut \n                         their balls off for me. I'm counting \n                         on you.\n\n               Schaeffer pours himself another drink.\n\n                                     SCHAEFFER\n                         What's your first move?\n\n                                     BOOK\n                              (expels a breath)\n                         A hot shower... I haven't changed \n                         clothes in two days.\n\n               EXT. PARKING LOT \u0096 PHILADELPHIA \u0096 NIGHT\n\n               Book slams the front door of his car, checks it for being \n               locked, glances at a roiled newspaper in his hand (the sports \n               section of the Inquirer), starts across the parking lot toward \n               his apartment, walking as he keeps glancing down at the sports \n               section. He comes to a sort of crosswalk, stops, reads, starts \n               to take a step... and looks up.\n\n               WHAT HE SEES\n\n               McElroy, smiling nicely, starting across toward him from the \n               other side of the parking lot crosswalk\n\n               BACK TO BOOK\n\n               Freezing, eyes widening. Utterly surprised and caught.\n\n               MCELROY\n\n               Still smiling, he brings up his right hand out of a shopping \n               bag (which he appeared to be carrying) \u0096 letting the shopping \n               bag fall away as he does so \u0096 revealing a five-inch barrel \n               Smith and Wesson .357 blue finish revolver with a silencer. \n               Without hesitating, coming right on, still smiling, he FIRES \n               once.\n\n               BOOK\n\n               Already starting to leap away to one side, he is hit, driven \n               into a half-turn. He clutches at the wound, as:\n\n               MCELROY\n\n               Coming right on, FIRING again... the pistol's report a \n               WHOOSHING, like the opening of a bottle of cheap champagne. \n               And McElroy still smiling as:\n\n               BOOK\n\n               Hit... a grazing near-miss this time, but enough to send \n               Book down hard and grasping.\n\n               MCELROY\n\n               Lowering the pistol alongside his leg, as two MEN, barely \n               taking notice of anything, cross with their backs to Book \n               toward McElroy.\n\n               He smiles at them.\n\n               BOOK\n\n               Down, muttering CURSES.\n\n               THE SCENE\n\n               As McElroy walks past Book, drops the pistol to the pavement, \n               keeps on going... and is gone.\n\n               BOOK\n\n               GROANING in pain, beginning to try to crawl crab-like. And \n               we HEAR \u0096 from the agonized recesses of Book's Dream.\n\n                                     SCHAEFFER (V.O.)\n                         Who else knows?\n\n                                     BOOK (V.O.)\n                         Just us.\n\n               As the lights of an oncoming car \u0096 going very slowly, on its \n               way to a parking space \u0096 sweep over him and we HEAR it come \n               to a sudden, squealing stop. Book is already trying to get \n               to his feet... now succeeds, lurching into a swaying stance, \n               using an adjacent car for support. OFF SCREEN we HEAR a car \n               door slam, and footsteps hurrying in our direction, \n               accompanied by excited voices. Book HEARS, turns to face the \n               oncomers,\n\n               ANGLE\n\n               A fat, middle-aged MAN has approached to within some feet of \n               Book, looks on edgily:\n\n                                     MAN\n                         Hey, buddy, what's the score? Little \n                         too much to drink?\n\n               Book stares at him, then looks down at his belly.\n\n               BOOK'S WOUND\n\n               As Book removes his hand we can see one of the bullets struck \n               him low in the side, just below the ribcage... the other \n               just above it (but this one inflicting only minor damage).\n\n               THE SCENE\n\n               As the man stares:\n\n                                     MAN\n                         Goddamn, buddy. You better get to a \n                         hospital!\n                              (and)\n                         Here; I'll give you a hand.\n\n               He starts to approach, but Book shoves him away.\n\n                                     BOOK\n                         No! No hospital!\n\n               By now the man's WIFE is hovering at a safe distance:\n\n                                     WIFE\n                         Let him alone, Henry! If he wants to \n                         die in the street, that's his \n                         business!\n\n               But the man is not content:\n\n                                     MAN\n                         Shut up, Romona! Will ya look at \n                         that blood?\n\n               Book has tried to lurch toward his car; the man tries to \n               intercept him:\n\n                                     MAN\n                         Come on, buddy... you're gonna bleed \n                         to death!\n\n               Book whirls on him, his service revolver in his hand pointed \n               squarely at the fat man's face:\n\n                                     MAN\n                         Shit!\n\n                                     WIFE\n                              (quavering)\n                         I told you, Henry!\n\n               Book doesn't trust himself to speak, but the .38 is \n               sufficiently eloquent for the circumstances, He stares at \n               the fat man another beat, then hesitates, turns, starts back \n               toward his car.\n\n               EXT. STREET \u0096 PHILADELPHIA \u0096 NIGHT\n\n               As Book's car wheels somewhat erratically through traffic.\n\n               INT. BOOK'S CAR (MOVING)\n\n               Book has a gym bag open on the seat next to him, is stuffing \n               a tshirt under his belt to staunch the blood. And...\n\n               INT. CARTER'S APARTMENT \u0096 BEDROOM \u0096 NIGHT\n\n               As he's awakened by the RINGING bedside telephone. He snaps \n               on a lamp... He's instantly awake, not unused to such rousing \n               in the wee hours. A woman sleeps beside him.\n\n                                     CARTER\n                         Yeah...\n\n               INTERCUT BOOK\n\n               He's at an n.d. pay phone.\n\n                                     BOOK\n                         Listen carefully, I wrote the Amish \n                         woman's name and address on my desk \n                         calendar, I want you to lose it for \n                         me, Now. Tonight.\n\n                                     CARTER\n                         What the hell are you talking about?\n                         What's happening.\n\n                                     BOOK\n                         Nothing. I'm not going to be around \n                         for a while. I'll call you when I \n                         can.\n\n                                     CARTER\n                              (alarmed)\n                         Johnny, what the fuck?\n\n                                     BOOK\n                              (hard)\n                         Listen to me \u0096 Schaeffer's part of \n                         it. Maybe at the top of it.\n\n               There's a stunned silence at the other end.\n\n                                     BOOK\n                         Yeah... I can put it all together \n                         when I get back, 'Til then, you know \n                         nothing, understand? Business as \n                         usual...\n\n                                     CARTER\n                              (beat)\n                         I hear you.\n\n                                     BOOK\n                              (nods)\n                         Good. Take care of that woman's name \n                         for me. And watch your ass.\n\n               INT. GUEST ROOM, ELAINE'S HOUSE \u0096 NIGHT\n\n               As the door opens and Elaine switches on the light, rousing \n               Rachel. Elaine looks haggard.\n\n                                     ELAINE\n                         It's John. He says you have to leave \n                         now. He says it's urgent.\n\n               She leaves the room as Rachel instantly awake, moves quickly \n               to rouse Samuel.\n\n               EXT. BATHROOM DOOR\n\n               Elaine is outside the bathroom listening to instructions \n               from her brother. From inside we hear the SOUND OF RUNNING \n               WATER. Elaine is puzzled but also senses the urgency.\n\n                                     BOOK (V.O.)\n                         Put my car in the garage and close \n                         the door.\n\n                                     ELAINE\n                         John, I don't understand any of this.\n\n                                     BOOK (V.O.)\n                              (snaps)\n                         You don't know anything... borrowed \n                         your car. Didn't say why. And you \n                         never heard of that woman and her \n                         boy.\n\n                                     ELAINE\n                         John, why?...\n\n                                     BOOK\n                              (shouts)\n                         Just do it!\n\n               INT. BATHROOM\n\n               Book looks at himself in the mirror, his face is pale and \n               drawn.\n\n               He examines the wound, a cleanly drilled hole through his \n               right side, just under the rib cage. The wound continues to \n               bleed as he binds a towel tightly about him, before putting \n               his shirt back on.\n\n               He then carefully wipes away any traces of blood on basin \n               with tissues which he flushes down the toilet.\n\n               INT. BOOK'S CAR (MOVING)\n\n               As he drives across town. Samuel is curled up asleep, his \n               head on Rachel's lap.\n\n                                     RACHEL\n                         Where are you taking us now?\n\n                                     BOOK\n                         Home.\n\n                                     RACHEL\n                         You couldn't wait until morning?\n\n               Book gives her a look.\n\n                                     RACHEL\n                              (insistent)\n                         What happened?\n\n               But Book, glancing in his rearview mirror, tenses.\n\n               HIS POV \u0096 MIRROR\n\n               In it we can see a police car coming on fast, with lights \n               and SIREN.\n\n               BACK TO SCENE\n\n               Rachel eyes Book warily.\n\n               A beat, then the police car WAILS past. Book expels a breath.\n\n                                     RACHEL\n                         You said we would be safe in \n                         Philadelphia.\n\n                                     BOOK\n                         I was wrong.\n\n               Rachel looks away, speaks almost sarcastically, MUTTERING.\n\n                                     RACHEL\n                         Kinner un Narre...\n                         [\"Kinner un Narre saage die Waahret\" \n                         \u0096 \"Children and fools say the truth\" \n                         \u0096 Amish expressions]\n\n               INT. PHILADELPHIA POLICE HEADQUARTERS \u0096 BOOK'S OFFICE \u0096 \n               NIGHT\n\n               ANGLE PAST Book's desk calendar. Carter enters in the b.g., \n               crosses quickly to the desk. He snaps on a light, thumbs a \n               page of the calendar. Frowns.\n\n               INSERT\n\n               Rachel's name and address scribbled on a page of the calendar.\n\n               BACK TO SCENE\n\n               ANGLE\n\n               A couple of plainclothesmen have paused outside the door to \n               give him a look. Meets their eyes. They move on.\n\n               Carter shakes it off, goes. And...\n\n                                                                    CUT TO:\n\n               INT. CAR (MOVING)\n\n               As light colors the eastern horizon, Book is crossing into \n               Lancaster County.\n\n               Book glances at Rachel; she's asleep. He coughs wrackingly, \n               hurting... cinches the belt of his overcoat even tighter. \n               And...\n\n               EXT. LAPP FARM\n\n               HIS POV \u0096 BOOK'S CAR\n\n               Coming up the long drive.\n\n               BACK TO SCENE\n\n               As the car pulls up in the barnyard and Eli crosses to it.\n\n               Suddenly the car door flies open and Samuel jumps out, races \n               across the barnyard to hurl himself into the old man.\n\n               ANGLE AT CAR\n\n               As Rachel steps out of the passenger's side, Book remains \n               seated.\n\n               He lets his eyes travel around the farm.\n\n                                     RACHEL\n                         Stay for awhile. Rest. I'll make \n                         coffee and breakfast.\n\n                                     BOOK\n                         I can't.\n\n                                     RACHEL\n                         What about Samuel? Will you come \n                         back to take him to trial?\n\n               Book starts the engine:\n\n                                     BOOK\n                              (grimly)\n                         There isn't going to be one.\n\n               Rachel stares at him, not sure what he means. Then backs \n               away, closing the door. Book begins to turn the car around \n               in the barnyard.\n\n               ANGLE\n\n               As Eli crosses to Rachel, his arm around Samuel.\n\n                                     ELI\n                         Who was that man?\n\n                                     RACHEL\n                         His name is John Book.\n\n               Eli is about to inquire further when Samuel cries:\n\n                                     SAMUEL\n                         Momma \u0096 look.\n\n               They glance in the direction Samuel is looking.\n\n               THEIR POV \u0096 BOOK'S CAR\n\n               The car has failed to take a bend in the road and is now \n               bouncing across an adjoining ploughed field. It's knocked \n               over a tall birdhouse by the roadside. The car finally comes \n               to rest against a bank of earth.\n\n               BACK TO RACHEL\n\n               She stares...\n\n                                                                    CUT TO:\n\n               EXT. FIELD \u0096 DAY\n\n               As Samuel races for all he's worth across the field, \n               negotiates the creek via a fallen log \u0096 Rachel, now, also \n               running toward the car.\n\n               EXT. STABLES \u0096 DAY\n\n               Eli works fast harnessing his mules to an open wagon. He \n               hops up to the front seat and urges them to trot.\n\n               ANGLE AT BOOK'S CAR\n\n               We see that Rachel has made Book as comfortable as possible \n               in the front seat of the car and is packing the wound under \n               his trenchcoat with material ripped from her apron. \n               Momentarily he comes awake:\n\n                                     RACHEL\n                         But John... why didn't you go to a \n                         hospital?\n\n                                     BOOK\n                         No, no doctor...\n\n                                     RACHEL\n                              (bewildered)\n                         But why?\n\n                                     BOOK\n                         Gunshot... they'll file reports... \n                         they'll find me.\n\n                                     RACHEL\n                         But \u0096\n\n               Book reaches up to grip her arm fiercely:\n\n                                     BOOK\n                         And when they find me, they'll find \n                         your boy!\n\n               He slips under again. Rachel stares at him, realizing the \n               price he's paid in returning them to safety.\n\n               She reaches out, touches him gently.\n\n               But the moment is broken by...\n\n               ANOTHER ANGLE\n\n               As Eli reins up in the springwagon. He climbs down, crosses \n               to glance into the car.\n\n                                     ELI\n                         Is the English dead?\n\n                                     RACHEL\n                         No...\n\n                                     ELI\n                         Looks dead...\n\n               And together they begin to lift Book from the car and place \n               him in the back of the springwagon. And...\n\n               INT. LAMP FARMHOUSE\n\n               Where Eli is looking out a window.\n\n               HIS POV \u0096 BUGGY\n\n               An Amish buggy coming up the drive, past Book' s car.\n\n               ANGLE IN BEDROOM\n\n               Where Book lies on a bed. Rachel is bathing his wound with \n               warm water from a pan.\n\n               Eli appears in the doorway.\n\n                                     ELI\n                         Stoltzfus is coming.\n\n               Rachel looks at him, nods.\n\n               Eli frowns at Book's holstered pistol lying atop his neatly \n               folded clothes on a chair near the bed.\n\n                                     ELI\n                         That has no place in this house.\n\n                                     RACHEL\n                         I know.\n\n               She picks up the pile of clothes and the pistol and places \n               them in a chest.\n\n                                     RACHEL\n                         It will go when he goes.\n\n               INT. LIVING ROOM\n\n               As Samuel comes in with old Stoltzfus and Stoltzfus's teenage \n               son, LEVI.\n\n                                     RACHEL\n                         Thank you for coming, Stoltzfus.\n\n               Stoltzfus's eyes have gone to the bed:\n\n                                     STOLTZFUS\n                         That's the English is it?\n\n               INT. SICKROOM \u0096 TIGHT\n\n               As Stoltzfus runs his fingers lightly over the vicinity of \n               Book's wound:\n\n                                     STOLTZFUS (O.S.)\n                         I feel... burning.\n\n               WIDER\n\n               As Stoltzfus, in his shirt sleeves and concentrating mightily, \n               moistens his fingertips with saliva, continues the \n               examination.\n\n               Finally he steps back.\n\n                                     STOLTZFUS\n                         This man should be treated in town.\n                              (indicates)\n                         The bullet entered there... and came \n                         out there. But there is the danger \n                         of infection, and he has lost a great \n                         deal of blood.\n\n               Rachel looks at Stoltzfus, then turns away, torn by her \n               dilemma.\n\n               Her eyes fall on Samuel. Gently she ushers him from the room:\n\n                                     RACHEL\n                         Go help Levi with the car, Samuel.\n\n               She closes the door after him, then turns to face Eli and \n               Stoltzfus:\n\n                                     RACHEL\n                         No, he must stay here.\n\n               Stoltzfus gives Eli a puzzled look. And:\n\n                                     ELI\n                         Didn't you hear Stoltzfus? What if \n                         he dies? Then the sheriff will come. \n                         They'll say we broke their laws \u0096\n\n                                     RACHEL\n                         We'll pray that he doesn't die! But \n                         if he does, then we'll find a way so \n                         no one knows!\n\n                                     ELI\n                         Rachel, this is a man's life, we \n                         hold it in our hands.\n\n                                     RACHEL\n                         I know God help me, I know that, \n                         Eli.\n                              (then)\n                         But I tell you that if he's found \n                         here, the people who did this to him \n                         will come for Samuel.\n\n               Rachel beseeches them helplessly:\n\n                                     RACHEL\n                         What else can we do?\n\n               EXT. LAPP DRIVE\n\n               Levi has hitched Eli's mules to the rear of Book's car and \n               is towing it up the drive toward the barn, with Samuel \n               catching a ride on the bumper.\n\n               RACHEL\n\n               Where she's waiting with the big barn doors thrown open. As \n               the mules tow the car in, she closes the doors.\n\n               INT. LAPP FARMHOUSE LIVING ROOM\n\n               As Stoltzfus and Levi are about to go: Stoltzfus turns to \n               Rachel:\n\n                                     STOLTZFUS\n                         Make a poultice... three parts milk, \n                         two parts linseed oil... for the \n                         infection.\n\n               I'll send Mary by with some teas I will brew myself.\n\n                                     RACHEL\n                         Thank you.\n\n               Stoltzfus turns to Eli:\n\n                                     STOLTZFUS\n                         Lapp, I'll have to speak with the \n                         diener on this matter.\n\n                                     ELI\n                              (nods)\n                         As you see fit, Stoltzfus.\n\n                                                                    CUT TO:\n\n               INT. SICKROOM \u0096 LAPS FARM \u0096 NIGHT\n\n               As Rachel enters, turns up a kerosene lamp which is burning \n               low at bedside. She's carrying the poultice Stoltzfus ordered.\n\n               Book's brow is beaded with sweat.\n\n               Rachel seats herself next to the bed, strips away the sweat-\n               soaked sheet. Her eyes take in his bare torso, and we should \n               get the feeling that there's rather more male animal on \n               display here just now than she's quite comfortable with.\n\n               She begins to apply the poultice.\n\n               ANGLE\n\n               As Book rouses to semi-consciousness, in his delirium he \n               recoils with alarm.\n\n                                     RACHEL\n                         It's all right! You have got to lie \n                         still.\n\n               Book stares up at her without recognition, but some of what \n               she says seems to penetrate. He quiets.\n\n                                     RACHEL\n                              (soothingly)\n                         Yes, much better...\n\n               ANGLE\n\n               As Book lapses back into sleep. Rachel hasn't removed her \n               hand from his chest. Abruptly she does so.\n\n               She finds herself wondering about this man lying before her, \n               so suddenly a part of her life. She notices details; bruises, \n               scars, the knuckles are hard, grazed, a tattoo on one \n               shoulder. While lost in this reverie, the delirious \n               Philadelphia policeman begins to mutter. Incoherently at \n               first, then the words take shape \u0096 swear words; curses; fuck \n               this and that; shit; etc. Rachel rises abruptly, her cheeks \n               coloring, as the barrage of language pours from his mouth. \n               She beats a hasty retreat closing the door swiftly behind \n               her.\n\n               INT. SCHAEFFER'S OFFICE \u0096 DAY\n\n               He's on the phone:\n\n                                     SCHAEFFER\n                         Looks like we're going to need some \n                         help from you folks down there.\n\n               INT. LANCASTER COUNTY SHERIFF'S OFFICE \u0096 DAY\n\n               Where an UNDERSHERIFF is on the phone:\n\n                                     UNDERSHERIFF\n                         ...want to help any way we can, Chief, \n                         but you got to understand we've got \n                         upwards of seven thousand Amish over \n                         here.\n\n               And that's just Lancaster County.\n\n               INTERCUT SCHAEFFER\n\n               Who is trying to control his impatience:\n\n                                     SCHAEFFER\n                         I've got the woman's name, Sheriff. \n                         Lapp. Rachel Lapp. That should \n                         simplify your work.\n\n               The Undersheriff frowns. He doesn't like being talked down \n               to.\n\n                                     UNDERSHERIFF\n                         How about an address?\n\n                                     SCHAEFFER\n                         Ah... no.\n\n                                     UNDERSHERIFF\n                              (frowns)\n                         Maybe a road or route number?\n\n                                     SCHAEFFER\n                         Sorry.\n\n               The Undersheriff is not impressed.\n\n                                     UNDERSHERIFF\n                         Problem is, Chief, 'bout every third \n                         Amishman around here is named Lapp. \n                         That or Yoder. Or Hochstetler.\n                              (and)\n                         Chief, if the Amish have taken your \n                         man in, I wouldn't want to hang from \n                         a rope until you find him.\n\n               ANGLE\n\n               Schaeffer is tight-lipped with contained fury:\n\n                                     SCHAEFFER\n                         Thank you, Sheriff. It's been an \n                         education.\n\n               He hangs up. A beat; the man is a study in frustration. Then \n               he glances up.\n\n               ANOTHER ANGLE\n\n               Standing in his doorway are the two plainclothesmen who \n               spotted Carter in Book's office in the earlier scene. And...\n\n                                                                    CUT TO:\n\n               EXT. LAPP FARM \u0096 DAY\n\n               A bright, sunny afternoon.\n\n               SAMUEL\n\n               Where he's leading a team of horses to the barn. In the b.g. \n               three buggies are parked in the barnyard, traces empty. \n               Visitors.\n\n               ANGLE IN SICKROOM\n\n               Where Book lies in the bed. His fever seems to have subsided. \n               He's coming awake, tries to focus on the room.\n\n               BOOK'S POV \u0096 CLERGY\n\n               PANNING the four men in Amish black who are standing around \n               the bed looking down at Book, muttering among themselves in \n               German.\n\n               These include TSCHANTZ, the district bishop, a hawk-nosed, \n               sterneyed old fellow; Stoltzfus, a deacon as well as a healer; \n               and two preachers, ERB and HERSHBERGER. Eli stands somewhat \n               apart.\n\n               ANGLE\n\n               Another moment of silence, then Book opens his eyes.\n\n               Tschantz rumbles in German.\n\n               SUBTITLES OVER.\n\n                                     TSCHANTZ\n                         Well, Stoltzfus, another Lazarus to \n                         your credit.\n\n                                     STOLTZFUS\n                         He was touched by God's hand.\n\n               Tschantz grunts, motions, for the other clergy aside with \n               him.\n\n               Rachel enters briskly with a steaming pot of tea and a cup, \n               smiles.\n\n                                     RACHEL\n                         Hello.\n\n               Book stares at her, then at the old bearded gentlemen.\n\n                                     BOOK\n                              (closing his eyes)\n                         Who are they?\n\n                                     RACHEL\n                         The leadership of our district... \n                         the diener. Bishop Tschantz is the \n                         one with no hair on top. They decided \n                         to come and see you for themselves. \n                         Except Stoltzfus, of course. He came \n                         the first day. I think he saved your \n                         life.\n\n                                     BOOK\n                         Can I have something to drink?\n\n               Rachel brings him tea.\n\n                                     BOOK\n                         Does anybody know I'm here?\n\n                                     RACHEL\n                         Only the elders.\n\n                                     BOOK\n                         How long?\n\n                                     RACHEL\n                         What?\n\n                                     BOOK\n                         How long have I been here?\n\n                                     RACHEL\n                         Two days.\n\n                                     BOOK\n                              (a beat)\n                         Listen, thank you. Thanks for \n                         everything. But I've got to go.\n\n                                     RACHEL\n                              (frowns)\n                         But you can't.\n\n               He tries to rise, falls back faint. Rachel rearranges the \n               sheet.\n\n                                     RACHEL\n                         See. Anyway, you don't have any \n                         clothes on. And besides that, Bishop \n                         Tschantz wants to talk to you when \n                         you feel better.\n\n               The elders appear to have concluded their conference, and \n               are filing out. Stoltzfus pauses at bedside.\n\n                                     STOLTZFUS\n                         Rest, Mr. Book. That's the ticket. \n                         And drink my of my tea.\n\n               He goes. Book is still fending off the dizziness. Rachel \n               puts the teacup to his lips.\n\n                                     BOOK\n                         Tell him his tea stinks.\n\n                                     RACHEL\n                              (smiles)\n                         You tell him. When you're able.\n\n               He looks like he's about to drop off again. Rachel rises.\n\n                                     RACHEL\n                              (from the door)\n                         We're all very happy that you're \n                         going to live, John Book. We didn't \n                         quite know what we were going to do \n                         with you if you died.\n\n               That penetrates for a moment just before Book slips into \n               sleep again.\n\n               INT. LAPP LIVING ROOM \u0096 DAY\n\n               As the rather worrisome Hershberger frowns:\n\n                                     HERSHBERGER\n                         ...but a gunshot wound. Very serious.\n\n                                     TSCHANTZ\n                         It is not the first time we have \n                         done this. In the Englischer war of \n                         the revolution, old Elmer Miller's \n                         grandfather took in gunshot English \n                         soldiers.\n                              (a tad of pride)\n                         Saved them, too.\n\n               They all nod. What Tschantz says is well known. Then:\n\n                                     ERB\n                         Still, he should be among his own \n                         people.\n\n               Rachel enters on this last.\n\n                                     RACHEL\n                         He'll leave as soon as he is able. \n                         He already wants to go.\n\n               Hershberger gives her a gloomy look, turns to Stoltzfus:\n\n                                     HERSHBERGER\n                         How long will that be, Stoltzfus?\n\n                                     STOLTZFUS\n                              (shrugs)\n                         A month. Maybe less. With God's \n                         healing love.\n\n               EXT. BOOK'S SISTER'S HOUSE \u0096 PHILADELPHIA \u0096 DAY\n\n               Schaeffer is knocking at the front doors. A beat, then Elaine \n               opens it cautiously, peers out.\n\n                                     ELAINE\n                              (half fearfully)\n                         Did you find him?\n\n                                     SCHAEFFER\n                         Not yet.\n\n               Suddenly her eyes blaze, she starts to close the door:\n\n                                     ELAINE\n                         Then go away, you bastard.\n\n               Schaeffer quickly \u0096 but gently \u0096 prevents her from shutting \n               it.\n\n                                     SCHAEFFER\n                         Elaine, I've come to apologize for \n                         Lt. McElroy. He overstated the \n                         department's position.\n\n                                     ELAINE\n                              (bitterly)\n                         He accused John of taking kickbacks. \n                         And you know \u0096 anybody who knows \n                         John \u0096 knows that's a goddamn lie!\n\n                                     SCHAEFFER\n                              (smoothly)\n                         Of course, Elaine. But as long as \n                         there's any question, better Johnny \n                         should come back and clear his name.\n\n                                     ELAINE\n                              (cuts in)\n                         Better you should get off my front \n                         porch before I get my mace!\n\n                                     SCHAEFFER\n                         Elaine, I don't want to have to take \n                         you in for questioning. You've got \n                         his car, you were the last to see \n                         him \u0096\n\n                                     ELAINE\n                              (clipped)\n                         I don't know where he is.\n\n                                     SCHAEFFER\n                         But... if you had to guess?\n\n               ANOTHER ANGLE \u0096 SCHAEFFER'S CAR\n\n               McElroy watching.\n\n               THEIR POV \u0096 FRONT DOOR\n\n               We see a final exchange between Elaine and Schaeffer. Elaine \n               forces the door shut. Schaeffer turns, walks slowly to his \n               car.\n\n               INT. SCHAEFFER'S CAR\n\n               As Schaeffer opens the door, climbs in, sinks wearily into \n               the seat, beside McElroy.\n\n                                     MCELROY\n                         She say where he is?\n\n                                     SCHAEFFER\n                         I don't think she knows.\n\n               Schaeffer is staring grimly ahead.\n\n                                     SCHAEFFER\n                         What about Carter?\n\n                                     MCELROY\n                         Tight. But I'm working on him.\n\n                                     SCHAEFFER\n                         Lean on him.\n\n               EXT. LAPP FARM \u0096 LANCASTER COUNTY \u0096 NIGHT\n\n               REESTABLISHING, and TIGHTENING to the upstairs sickroom window \n               where a lamp dimly burns.\n\n               INT. SICKROOM\n\n               As Samuel comes in with a fresh bedpan. Book is lying asleep \n               on the bed.\n\n               Samuel puts the bedpan down, checks to make sure Book is \n               indeed asleep, then quietly crosses to the foot of the bed \n               and opens the clothes chest.\n\n               ANGLE\n\n               Book's big .38 revolver lies holstered atop his folded \n               clothes.\n\n               Fascinated, Samuel picks it up, admiring the heavy burled \n               pistol grips. Unable to resist, he starts to remove the weapon \n               from the holster, then pauses to steal a look. OFF SCREEN...\n\n               BOOK\n\n               His eyes are open and watching Samuel icily, which gives the \n               boy something of a jolt.\n\n                                     BOOK\n                         Give me that.\n\n               Mutely, Samuel hands Book the pistol from arm's length. He \n               looks on as Book takes the pistol out of the holster, shoots \n               the boy another look, then snaps open the cylinder and shakes \n               out the heavy, copper-jacketed bullets into his palm. He \n               snaps the cylinder closed again, then nods to Samuel.\n\n                                     BOOK\n                         Come here.\n\n               The boy edges closer.\n\n                                     BOOK\n                         You ever handle a pistol like this, \n                         Samuel?\n\n                                     SAMUEL\n                              (swallows)\n                         No pistol. Ever.\n\n                                     BOOK\n                         Tell you what \u0096 I'm going to let you \n                         handle this one. But only if you \n                         promise not to say anything to your \n                         momma. I've got a feeling she wouldn't \n                         understand.\n\n                                     SAMUEL\n                              (grins)\n                         Okay, Mr. Book.\n\n               Book smiles. Then he gives the boy a playful, John Wayne-\n               tough guy wink as he cocks and uncorks the pistol, \n               demonstrating the action.\n\n               He finally hands it over to Samuel, butt first.\n\n                                     BOOK\n                         Call me John.\n\n               The boy tries to imitate Book's one-handed expertise, but \n               his hands are too small. Book smiles.\n\n               Samuel finally manages to get the thing cocked, using two \n               hands, and Book reaches over to guide the muzzle away so \n               that it's not pointed at him.\n\n                                     BOOK\n                         You don't want to point that at people \n                         you just started calling by their \n                         first name.\n\n               Samuel levels the pistol at the door and, just as he snaps \n               the trigger, Rachel enters, pulls up short in some dismay to \n               find her son has a gun pointed at her. Samuel blanches and \n               Book winces, knowing there's heavy weather ahead.\n\n                                     RACHEL\n                              (snaps)\n                         Samuel!\n\n               Samuel quickly hands the pistol back to Book, who holsters \n               it:\n\n                                     RACHEL\n                         Wait for me downstairs.\n\n               Samuel quickly exits, and Rachel angrily advances on Book.\n\n                                     RACHEL\n                         John Book, I would appreciate it if, \n                         during the time you are with us, you \n                         would have as little to do with Samuel \n                         as possible.\n\n                                     BOOK\n                         Nobody meant any harm. The boy was \n                         curious. I unloaded the gun -\n\n                                     RACHEL\n                         It's not the gun. Don't you \n                         understand... It's you. What you \n                         stand for.\n                              (and)\n                         That is not for Samuel.\n\n               Book looks at her thoughtfully.\n\n               Rachel softens a bit:\n\n                                     RACHEL\n                         Please, it has nothing to do with \n                         you personally.\n\n               He hands her the holstered gun and the loose bullets.\n\n                                     BOOK\n                         Put it up someplace Samuel can't get \n                         it.\n\n               A beat, then Rachel, takes the pistol and starts to go. Book \n               stops her:\n\n                                     BOOK\n                         Friends?\n\n               Rachel glances back at him, smiles and nods. And...\n\n                                                                    CUT TO:\n\n               INT. KITCHEN \u0096 LAPP FARMHOUSE \u0096 NIGHT\n\n               Book's holstered gun and bullets at center table. Eli sits \n               on one side, a chastened Samuel on the other. Rachel looks \n               on from the b.g.\n\n               Eli knows that this is as important a dialogue as he will \n               ever have with his grandson: at issue is one of the central \n               pillars of the Amish way.\n\n                                     ELI\n                         The gun \u0096 that gun of the hand \u0096 is \n                         for the taking of human life. Would \n                         you kill another man? Eh?\n\n               Samuel stares at it, not meeting his grandfather's eyes. Eli \n               leans forward, extends his hands ceremonially.\n\n                                     ELI\n                         What you take into your hands, you \n                         take into your heart.\n\n               A beat, then Samuel musters some defiance.\n\n                                     SAMUEL\n                         I would only kill a bad man.\n\n                                     ELI\n                         Only a bad man. I see. And you know \n                         these bad men on sight? You are able \n                         to look into their hearts and see \n                         this badness?\n\n                                     SAMUEL\n                         I can see what they do.\n\n               Now he meets Eli's eyes:\n\n                                     SAMUEL\n                         I have seen it.\n\n               Eli expels a deep sigh; then:\n\n                                     ELI\n                         And having seen, you would become \n                         one of them?\n                              (intent... gesturing)\n                         Don't you see...? The hand leads the \n                         arm leads the shoulder leads the \n                         head... leads the heart. The one \n                         goes into the other into the other \n                         into the other... And you have \n                         changed, and gone amongst them...\n\n               He breaks off, bows his head for a moment. Then he fixes the \n               boy with a stern eye and, driving he heel of his palm firmly \n               into the tabletop with enormous intensity:\n\n                                     ELI\n                         \"Wherefore come out from among them \n                         and be ye separate, saith the Lord!\"\n\n                                     ELI\n                              (indicating pistol; \n                              continuing from \n                              Corinthians 6:17)\n                         \"And touch not the unclean thing!\"\n\n               His intensity tinged with righteous anger, he is hugely \n               impressive.\n\n               EXT. WASHHOUSE \u0096 NEAR KITCHEN \u0096 NIGHT \n\n               Book stands near the door to the kitchen, and has heard most \n               or all of Eli's words. He turns, and painfully makes his way \n               into the washhouse, moving quietly, hoping no one will come \n               out from the kitchen.\n\n               EXT. BARN \u0096 LAPP FARM \u0096 DAY\n\n               Samuel harnesses up the family mare, and backs her into the \n               traces of the buggy.\n\n               INT. BOOK'S BEDROOM \u0096 DAY\n\n               Book stands at the window in a worn robe. Below, through the \n               window, we can see Samuel and Eli in the barnyard. A beat, \n               then Book crosses impatiently back to his bed, sits down, \n               picks up a dog-earred copy of The American Dairyman. There's \n               a stack of well-thumbed farm magazines and copies of The \n               Budget (the Amish newspaper) on the bedside table.\n\n               There's a knock. Rachel enters carrying a pile of clothing. \n               She smiles.\n\n                                     RACHEL\n                         Enjoying your reading?\n\n                                     BOOK\n                         Very interesting. I'm learning a lot \n                         about manure.\n                              (eyes the clothing)\n                         What's that?\n\n                                     RACHEL\n                         Your shirt and jacket are still \n                         stained with blood. I have them \n                         soaking.You can wear these.\n\n               She passes the clothes to Book.\n\n                                     BOOK\n                         Your husband's?\n\n                                     RACHEL\n                         Yes. It's good that someone can have \n                         the use of them. Besides, in your \n                         clothes you'd stand out to strangers.\n\n               She continues, cheerfully.\n\n                                     RACHEL\n                         I should tell you these do not have \n                         buttons.\n                              (shows him)\n                         See? Hooks and eyes.\n\n                                     BOOK\n                         Something wrong with buttons?\n\n                                     RACHEL\n                         Buttons are Hochmut.\n\n                                     BOOK\n                         Hochmut?\n\n                                     RACHEL\n                         Vain. Proud. Such a person is \n                         Hochmutsnarr. He is not plain.\n\n                                     BOOK\n                              (nodding)\n                         Anything against zippers?\n\n                                     RACHEL\n                              (almost blushing)\n                         You make fun of me. Like the tourists.\n                         Driving by all the time. Some even \n                         come into the yard. Very rude. They \n                         seem to think we are quaint.\n\n                                     BOOK\n                         Quaint? Can't imagine why.\n\n               She smiles.\n\n                                     BOOK\n                         Where's the nearest telephone?\n\n                                     RACHEL\n                         Telephone? The Gunthers across the \n                         valley. They're Mennonite. They have \n                         cars and refrigerators and telephones \n                         in the houses even.\n\n                                     BOOK\n                         No. I'd want a public phone.\n\n               Rachel's face clouds.\n\n                                     RACHEL\n                         Well... the store at Saltzburg...\n                              (then briskly)\n                         But you won't be going to Saltzburg \n                         for a while.\n\n                                     BOOK\n                         I'm going this morning.\n\n                                     RACHEL\n                         But Stoltzfus said...\n\n                                     BOOK\n                              (cutting in)\n                         I know what he said.\n\n                                     RACHEL\n                         You can go with Eli. He's taking \n                         Samuel to school. But you'll have to \n                         hurry.\n\n               Rachel turns to leave when Book calls her back.\n\n                                     BOOK\n                         Rachel.\n\n               She turns to look at him. It's the first time he's used her \n               name.\n\n                                     BOOK\n                         Thanks.\n\n               She smiles and leaves.\n\n               EXT. FARMHOUSE \u0096 DAY\n\n               Eli calls impatiently from the buggy. Samuel sits beside \n               him.\n\n                                     ELI\n                         Hurry up now, John Book!\n\n               INT. KITCHEN \u0096 DAY\n\n               Rachel washing dishes turns on hearing Book enter. She laughs \n               out loud at the sight of him in his Amish gear, and rightly \n               so \u0096 the pants are highwater, the hat low-rise, the jacket \n               ill-fitting.\n\n               Book looks self-conscious, even a little sheepish.\n\n               Outside another SHOUT from Eli.\n\n                                     RACHEL\n                         You'd better go.\n\n               Book looks embarrassed.\n\n                                     BOOK\n                         My... eh... gun?\n\n               The smile fades from Rachel's face as she reaches up into a \n               cupboard. She passes the gun in its holster to Book. He \n               fastens it about him. The contradiction of an \"Armed Amishman\" \n               increases the awkwardness between them. Book turns his back \n               to her and checks the weapon. He turns back to her smiling \n               in an odd way.\n\n                                     BOOK\n                         The... bullets?\n\n                                     RACHEL\n                         Oh. The bullets.\n\n               She takes them out of a disused coffee jar, passes them to \n               Book.\n\n                                     BOOK\n                              (attempting a joke)\n                         Not much good without them.\n\n               INT. BUGGY \u0096 COUNTRY ROAD \u0096 DAY\n\n               Samuel sits between Eli and Book. Both men stare straight \n               ahead.\n\n               Eli looks particularly stern. It's pretty clear he doesn't \n               like this Englishman wearing the clothes of his faith.\n\n               EXT. AMISH ONE-TEACHER-SCHOOL \u0096 DAY\n\n               With awave Samuel runs into the schoolyard to join his \n               friends. A teacher begins ringing a bell.\n\n               INT. STORE \u0096 SALTZBURG\n\n               Book on the telephone waiting for his call to be answered. \n               He looks about him \u0096 several Amish and Dithers mingle in the \n               shop.\n\n               Book-has gotten a coke from a machine, seems a bit self-\n               conscious shout it sips at it surreptitiously... A voice \n               comes on the line; it's that of Book's partner.\n\n                                     CARTER\n                         Yeah?\n\n               A silence.\n\n                                     BOOK\n                         It's me.\n\n                                     CARTER\n                         Johnny! Where the hell have you been?\n\n                                     BOOK\n                         Never mind. I'm coming in to take \n                         care of business. How hot am I?\n\n                                     CARTER\n                              (low, urgent)\n                         Too hot. Don't do it. Don't come in.\n\n                                     BOOK\n                         I'm coming.\n\n                                     CARTER\n                         Listen, Johnny, don't do anything \n                         stupid. You couldn't get within a \n                         mile of Schaeffer right now. So stay \n                         put... Stay in touch \u0096 I'll let you \n                         know when maybe it makes sense.\n\n               A beat as Book considers that.\n\n                                     CARTER\n                              (edgily)\n                         You hear me?\n\n                                     BOOK\n                              (finally)\n                         I hear you. I'll stay in touch.\n\n                                     CARTER\n                         That's more like it.\n                              (and)\n                         Where are you at, anyway?\n\n               Book allows himself a small smile, regarding his Amish image \n               reflected in the window of the store.\n\n                                     BOOK\n                         Where I'm at is maybe 1890.\n\n                                     CARTER\n                              (uncomprehending)\n                         Say again?\n\n                                     BOOK\n                         Make that 1790.\n\n               He hangs up. A beat, then he stares toward the door of the \n               store.\n\n               INT. BARN \u0096 DAY\n\n               Book works on his car. The battery has gone flat and he's \n               trying to charge it up by running wires to a battery mounted \n               under the front seat of the Lapp buggy.\n\n               Eli stands at the barn door staring at him, again the \n               disapproving look.\n\n                                     ELI\n                         If you are well enough to do that \n                         thing, you can do work for me.\n\n               Book is genuinely apologetic.\n\n                                     BOOK\n                         Sure, I'm sorry. Hope you don't mind \n                         me plugging in to your battery. Mine's \n                         dead... How can I help? What can I \n                         do?\n\n                                     ELI\n                         Maybe milking.\n\n                                     BOOK\n                              (eyes Eli)\n                         Milking?\n\n                                     ELI\n                         Cows. You know, cows?\n\n                                     BOOK\n                         I've seen pictures.\n\n                                     ELI\n                         Good, you start tomorrow.\n\n               INT. BOOK'S ROOM \u0096 LAPP FARM \u0096 NIGHT\n\n               Where Book lies asleep. A beat, then Eli comes in carrying a \n               lamp.\n\n               He pauses a moment to peer at the sleeping figure with \n               undisguised anticipation. Then he gives him a jarring thump:\n\n                                     ELI\n                              (briskly)\n                         Veck oufl. Time for milking.\n\n               Book comes groggily awake as Eli exits. He gropes for his \n               watch.\n\n               INSERT WATCHFACE\n\n               It reads 4:30 a.m.\n\n               BACK TO BOOK\n\n               As he stares at it in disbelief.\n\n               INT. BARN\n\n               As the milk herd of half dozen or so cows ambles in with \n               Samuel prodding them along, headed for the milking stalls. \n               Book looks on in the lamplight, nonplused.\n\n               SAMUEL\n\n               Where he's pitching hay into the cow's feed-troughs.\n\n               BOOK, ELI\n\n               Where the old man is showing Book how to milk a cow by hand. \n               We see Rachel watching from the milkhouse door (steam from \n               scalding milk cans rising behind her).\n\n                                     ELI\n                         Good, firm twist and pull, eh?\n                              (and)\n                         Right. Now you try it.\n\n               Book gives him a look, takes over the milking stool. The cow \n               shoots him a rather skeptical look over her shoulder. Book \n               bends to his task.\n\n                                     ELI\n                         Didn't you hear me, Book? Pull! You \n                         never had your hands on a teat before?\n\n                                     BOOK\n                              (grimly)\n                         Not one this big.\n\n               Eli unexpectedly finds this hilarious, cackles, gives Book a \n               comradely, man-of-the-world thump on the shoulder that jars \n               him.\n\n               Then he moves off. Book bends to his task, and...\n\n               ANGLE \u0096 RACHEL\n\n               Grinning, giggling, covering her mouth with one hand.\n\n               As he pours a pail full of milk into a large, stainless steel \n               milk can.\n\n               EXT. BARN\n\n               As the milk herd is released back into the pasture. Book \n               crosses into the f.g., stares OFF SCREEN.\n\n               BOOK'S POV \u0096 HORIZON\n\n               And dawnfire etching the hilltops. The BELLHOUSE behind the \n               house, the sun reflecting from the heavy bell beneath its \n               small roof.\n\n               BACK TO BOOK\n\n               Something in him can't help but respond to the beauty.\n\n               A beat, then he blows on his hands, rubs them briskly together \n               against the morning chill, and turns back to the barn.\n\n               EXT. LAPP FARMHOUSE \u0096 DAY\n\n               It is later in the morning. Rachel comes out onto the porch, \n               tosses a pan of dirty dishwater off onto the grass, looks \n               toward the barn.\n\n               ANGLE \u0096 THE BARN\n\n               Eli and Book standing in one of the open doorways, looking \n               in.\n\n               INT. THE BARN\n\n               ANGLE FAVORING Luke, one of Eli's team of fine mules as Samuel \n               opens the stall gate. The beast is skittish, obviously \n               afflicted with something of a behavioral problem.\n\n               But he allows Samuel to lead him out.\n\n               BOOK, ELI\n\n               As Samuel brings Luke out. Eli is now harnessing the other \n               mule of the team to a large manure-spreader. But as Luke \n               nears Book, his eyes widen and he shies, almost hauling Samuel \n               off his feet.\n\n                                     BOOK\n                              (alarmed)\n                         Careful, son \u0096\n\n               Book moves to Samuel's aid; a gesture which proves a serious \n               mistake. Luke erupts into a SCREAMING, bucking cyclone. Samuel \n               \u0096 who no doubt has been here before \u0096 dives nimbly for cover \n               as a flying hoof nearly takes Book's head off.\n\n               Then Eli hustles into the fray, pushing Book aside as he \n               BELLOWS belligerently in German at the rearing animal. Finally \n               he gives Luke a swat upside the head that seems, somehow, to \n               have the effect of quieting the beast instantly.\n\n               ANGLE\n\n               Samuel gives the shaken Book a look:\n\n                                     SAMUEL\n                         That's Luke. He doesn't like \n                         strangers.\n\n                                     BOOK\n                              (still shaken)\n                         You don't say.\n\n               Eli leads the pacified mule back to the traces, grunting at \n               Book.\n\n                                     ELI\n                         Have to teach you mules, too, I guess.\n\n                                                                    CUT TO:\n\n               EXT. FIELD NEAR FARMHOUSE \u0096 DAY\n\n               Book collects the pieces of the birdhouse which his car \n               knocked down the day of his attempted departure. He pauses \n               as a figure approaches. We recognize Daniel Hochstetler, \n               Rachel's would-be suitor. He heads for Book with an outgoing \n               smile and outstretched hand. Here's a likable man who likes \n               people.\n\n                                     HOCHSTETLER\n                         Good morning. Book, is it? You are \n                         the Yankee they talk about?\n\n                                     BOOK\n                         I thought I was the English.\n\n                                     HOCHSTETLER\n                         English, Yankee. It's the same. My \n                         name is Daniel. Daniel Hochstetler.\n                              (sizes up his clothes)\n                         You look plain, Book.\n                              (grinning)\n                         Very plain.\n\n               Book is not particularly amused.\n\n                                     HOCHSTETLER\n                         I came to see Rachel Lapp.\n\n                                     BOOK\n                         Try the house.\n\n               Hochstetler gives Book a powerful clap on the shoulder.\n\n                                     HOCHSTETLER\n                              (genially)\n                         You bet. you take care of yourself.\n\n               Hochstetler heads for the house. Book stares after him with \n               some interest.\n\n               ANGLE\n\n               As Rachel emerges from the house to greet him. She also \n               catches sight of Book and she pauses, a shadow of confusion \n               crossing her expression for an instant.\n\n               And Hochstetler doesn't miss it either.\n\n               Then she gives her suitor a genuine smile of welcome.\n\n               HOG PENS\n\n               Book, having gathered up the pieces of the bird house, is \n               headed toward the outbuildings, passing by hog pens. He \n               glances toward the house:\n\n               HIS POV \u0096 THE BACK PORCH\n\n               Where Rachel and Hochstetler are sitting in a porch swing, \n               sharing a pitcher of lemonade.\n\n               BACK TO BOOK\n\n               Thoughtful... He glances at the hog pen as a huge sow SQUEALS \n               and angrily noses her young ones away from the trough so she \n               can feed.\n\n                                     BOOK\n                         Pigs.\n\n               INT. CARPENTRY SHOP, LAPP FARM \u0096 DAY\n\n               Book works on repairing the broken birdhouse when Rachel \n               enters.\n\n               BOOK\n\n               He uses a drawknife on a piece of 2x4, with some obvious \n               expertise.\n\n                                     RACHEL\n                         Eli is a fine carpenter. Best in the \n                         district. He and his father built \n                         the big house themselves forty years \n                         ago.\n\n                                     BOOK\n                         Oh?\n                              (and)\n                         What happened to Hochstetler?\n\n                                     RACHEL\n                         We had some lemonade and he left.\n\n                                     BOOK\n                         A real fireball.\n\n               Rachel smiles. Book crosses to a workbench and selects another \n               tool.\n\n                                     RACHEL\n                         You know carpentry?\n\n                                     BOOK\n                         I did some carpentry summers when I \n                         was going to school.\n\n                                     RACHEL\n                         What else can you do?\n\n                                     BOOK\n                              (really annoyed)\n                         I can whack people. I'm hell at \n                         whacking.\n\n                                     RACHEL\n                         Whacking is not of much use on a \n                         farm.\n\n                                     BOOK\n                         Now hold on. There's a lot of people \n                         who think being a cop is a legitimate \n                         job.\n\n                                     RACHEL\n                         I'm sorry. I'm sure it is.\n\n               She turns, starts to go. Then turns back, eyeing his makeshift \n               garb:\n\n                                     RACHEL\n                         Tonight I'll let out those trousers \n                         for you.\n\n               Stifling a smile, she goes. HOLD on Book a beat, then...\n\n                                                                    CUT TO:\n\n               INT. LAPP FARMHOUSE \u0096 DINING ROOM\n\n               Eli is seated at the head of the table, Book opposite Samuel \n               and Rachel. The table is piled high with an incredible amount \n               of food.\n\n               Eli eyes Book cagily, waves his fork at him:\n\n                                     ELI\n                         Eat up, Book. What's the matter with \n                         your appetite?\n\n                                     BOOK\n                         Guess I'm not used to so much.\n\n                                     ELI\n                              (snorts)\n                         Not used to hard work. That's what \n                         makes an appetite.\n\n               Book swallows that one. With difficulty. Rachel intervenes:\n\n                                     RACHEL\n                         Eli, John is a carpenter.\n                              (conciliatory \n                              afterthought)\n                         As well as being a fine policeman.\n\n                                     ELI\n                         Eh? Well then, maybe he can go to \n                         Zook's barn-raising, eh? See how \n                         good a carpenter.\n\n               Book can't refuse the challenge.\n\n                                     BOOK\n                         Sure.\n\n                                     RACHEL\n                         But... You may not be well enough.\n\n                                     BOOK\n                         I'll drink some more of Stoltzfus' \n                         tea.\n\n               EXT. / INT. BARN \u0096 NIGHT\n\n               As Rachel, lamp in hand, walks up to the barn. She looks in \n               to find Book tinkering with the battery hookup to the Lapp \n               buggy.\n\n               He glances up as she enters:\n\n                                     BOOK\n                         Hi...\n\n               As she sets her lamp down near the one he's using.\n\n                                     RACHEL\n                              (beat)\n                         When will you be going?\n\n                                     BOOK\n                         Not long... A few days.\n\n               Another beat as Rachel watches him... Book, checking out the \n               battery power, hits the radio \u0096 and suddenly from the \n               Twentieth Century comes the sound of one of its major \n               inventions \u0096 rock and roll.\n\n               It fills the barn, but Book turns up the volume a click more \n               even and, eyeing Rachel, starts moving with the beat. It's \n               his culture, coming through loud and clear, as incongruous \n               as it all might seem with the tough Philly cop decked out in \n               Amish.\n\n               Rachel can't help but laugh... Sensing her response, Book \n               sweeps her up and they boogie in the lamplight, Rachel \n               alternately protesting and laughing.\n\n                                     BOOK\n                         You like it... Don't you?\n\n               Rachel, confused, protests:\n\n                                     RACHEL\n                         No... You just stop \u0096\n\n               But she doesn't really want to. Book grins:\n\n                                     BOOK\n                              (mock alarm)\n                         Next thing you know you'll be off \n                         drinking beer and racing motorcycles.\n\n               And it goes on... Rachel alternately protesting and laughing.\n\n               ANGLE \u0096 THE BARN DOOR\n\n               As Eli suddenly appears. He glowers for an instant, \n               thunderstruck, then BELLOWS:\n\n                                     ELI\n                         Rachel!\n\n               THE SCENE\n\n               As Book and Rachel's dancing comes to a sudden halt. Both \n               turn, look at Eli. Rachel regards him level-eyed, without \n               discernible alarm. Book, looking a bit sheepish, goes over, \n               turns off the radio, as:\n\n                                     ELI\n                              (in the dialect)\n                         What is this? This Myusick?\n\n               Book hesitates, then starts to say something:\n\n                                     BOOK\n                         It's not her fault. I \u0096\n\n               But he gets such a look from Eli that he turns, goes out.\n\n                                     ELI\n                              (in the dialect)\n                         How can this be? How can you do such \n                         a thing? Is this plain? Is this the \n                         ordnung?\n\n                                     RACHEL\n                         I have done nothing against the \n                         ordnung.\n\n                                     ELI\n                              (in the dialect)\n                         Eh? Nothing? Rachel, you bring this \n                         man to our house. With his gun of \n                         the hand. You bring fear to this \n                         house. Fear of English with guns \n                         coming after. You bring blood and \n                         whispers of more blood. Now English \n                         music... and you are dancing to \n                         English music! And you call this \n                         nothing?\n\n                                     RACHEL\n                         I have committed no sin.\n\n                                     ELI\n                              (in English)\n                         No sin? Maybe. Not yet. But, Rachel, \n                         it does not look...\n                              (tone softening... in \n                              the dialect)\n                         Don't you know there has been talk? \n                         Talk about you, not him. Talk about \n                         going to the Bishop. About having \n                         you... shunned!\n\n                                     RACHEL\n                         That is idle talk.\n\n                                     ELI\n                              (in English, pleading)\n                         Do not make light of it, Rachel. \n                         They can do it... quick! Like that! \n                         And then... then I can not sit at \n                         table with you. I can not take a \n                         thing from your hand. I... I can not \n                         go with you to meeting!\n                              (the old man almost \n                              breaks down as, in \n                              the dialect)\n                         Rachel, good Rachel, you must not go \n                         too far! Dear child!\n\n               Rachel is annoyed \u0096 also touched, no doubt, by the old man's \n               plea \u0096 but irked by his condescending tone.\n\n                                     RACHEL\n                         I am not a child.\n\n                                     ELI\n                              (suddenly stern again)\n                         You are acting like one!\n\n                                     RACHEL\n                         I will be the judge of that.\n\n                                     ELI\n                              (fierce as a prophet)\n                         No! They will be the judge of that! \n                         And so will I... if you shame me!\n\n                                     RACHEL\n                              (blinking a tear now, \n                              but meeting his gaze)\n                         You shame yourself.\n\n               And shaken \u0096 but proud and erect \u0096 she turns and walks out.\n\n               INT. SCHAEFFER'S OFFICE \u0096 NIGHT\n\n               Carter sits, Schaeffer prowls... slowly, letting silences \n               grow before he strikes again with another softly-snarled \n               question or statement.\n\n                                     SCHAEFFER\n                         You know where he is.\n\n                                     CARTER\n                         Wrong.\n\n                                     SCHAEFFER\n                         You'd lie to protect him.\n\n                                     CARTER\n                              (cool)\n                         Probably.\n\n               Schaeffer snaps around, glares at him.\n\n                                     SCHAEFFER\n                         You admit you're lying?\n\n                                     CARTER\n                              (shakes head)\n                         I admit I don't know where he is.\n\n                                     SCHAEFFER\n                         You're the first one he'll contact.\n\n                                     CARTER\n                              (sighing)\n                         He's got my number.\n\n               Schaeffer stops, stands in front of Carter, takes a deep \n               breath... suddenly smiles. And is abruptly (as he is capable \n               of being) the man of charm and gentlemanly reason. He even \n               CHUCKLES as he begins:\n\n                                     SCHAEFFER\n                         It's funny. I know he's hiding \n                         somewhere with the Amish, I know it.\n                              (a quick glance at \n                              Carter)\n                         Can you imagine John Book at a prayer \n                         meeting? Our John Book?\n\n               Schaeffer CHUCKLES again, looks hopefully again at Carter.\n\n               Carter looks back, stony-eyed. Schaeffer makes another abrupt \n               shift in form... but still speaks softly.\n\n                                     SCHAEFFER\n                         Either you're a member of the club \n                         or you aren't, Elton.\n                              (he nods his head, as)\n                         Tell me what you know...\n\n                                     CARTER\n                         What I know, Paul, is...\n                              (nodding his head)\n                         He's going to take you out...\n\n               EXT. LAPP FARM \u0096 LANCASTER COUNTY \u0096 DAY\n\n               As Book pauses by the barn door, glances over his shoulder.\n\n               HIS POV \u0096 BUGGY\n\n               With trace horse harnessed... Samuel and Eli loading \n               provisions into the buggy, standing down by the house.\n\n               BACK TO BOOK \u0096 INT. / EXT. BARN\n\n               As he goes into the barn.\n\n               Book approaches Luke's stall warily... and as he does so the \n               temperamental mule, reacting to form, starts to skitter, his \n               hooves CRACKING against the walls of the stall. Book flinches.\n\n               Book starts to talk gently to the animal:\n\n                                     BOOK\n                         All right, you nasty son of a bitch, \n                         we're going to be friends whether \n                         you like it or not.\n\n               Then, summoning his resolve, he carefully opens the stall \n               gate.\n\n               ANGLE\n\n               As Luke eyes him balefully, Book reaches into his pocket, \n               brings out some lumps of sugar.\n\n                                     BOOK\n                         See... Sugar. You like sugar, don't \n                         you for Christ's sake?\n\n               Finally, keeping a mistrustful eye on Book, Luke condescends \n               to eat. Book nods with satisfaction.\n\n               ANOTHER ANGLE\n\n               Rachel has entered the barn, is watching Book with a puzzled \n               expression.\n\n                                     RACHEL\n                              (surprised)\n                         Well...\n\n               Book turns, grins with some pride of accomplishment!\n\n                                     BOOK\n                         Won him over just like that.\n\n                                     RACHEL\n                         I see.\n                              (and)\n                         But I hope you have a lot of sugar.\n                              (then, going)\n                         Eli is ready to go to Zook's.\n\n               Just then Luke skitters impatiently... Book gives him a \n               nervous look; one last tentative pat as Luke eyes him \n               skeptically, then closes the stall gate and turns to go:\n\n                                     BOOK\n                         Later.\n\n               And we...\n\n               EXT. ZOOK FARM \u0096 LANCASTER COUNTY \u0096 DAY\n\n               BIG SHOT... it's early morning as the Amish buggies are \n               arriving at the Zook farm for a barn-raising.\n\n               In the b.g. we can see big stacks of lumber all around the \n               construction site where a couple of dozen men have begun \n               raising the main supports on the already laid foundation.\n\n               Elsewhere, long tables have been set up and women are \n               spreading them with cloths, setting out big tanks of hot \n               coffee and cold lemonade for the men,\n\n               LAPP BUGGY\n\n               As Eli, Book, Rachel and Samuel step down, Book eyes the \n               construction site.\n\n                                     ELI\n                         Wait here 'til I find a gang you can \n                         work with.\n\n               He goes. Book glances around as even more buggies arrive and \n               more workmen and their families climb out.\n\n               Eli appears with Hochstetler in tow. Hochstetler's broad \n               face breaks into a grin:\n\n                                     HOCHSTETLER\n                         Book! Good to see you!\n\n               He pumps Book's hand with his usual vigor, smiling a greeting \n               and pleasantry to Rachel. She looks on, amused.\n\n               Hochstetler gives Rachel a look, and we realize that his \n               showing up just now to appropriate Book was no happenstance.\n\n               And Book realizes it as well.\n\n                                     HOCHSTETLER\n                         Eli says you're a carpenter, Book.\n\n                                     BOOK\n                         It's been a while.\n\n                                     HOCHSTETLER\n                         No matter. Come with me. We can always \n                         use a good carpenter.\n\n               With that he throws a huge arm around Book's shoulder and \n               ushers him away. Rachel calls after them:\n\n                                     RACHEL\n                         Good luck.\n\n               BOOK / HOCHSTETLER\n\n               As they move off.\n\n                                     HOCHSTETLER\n                         Your hole is healed, then?\n\n                                     BOOK\n                              (gives him a look)\n                         Pretty much.\n\n               Hochstetler nods with satisfaction:\n\n                                     HOCHSTETLER\n                         Good. Then you can go home.\n\n                                                               DISSOLVE TO:\n\n               CUTS\n\n               As the morning progresses:\n\n               ...Book and Hochstetler sawing and augering out heavy timbers \n               on big sawhorses. There's an unmistakable atmosphere of \n               competition between the two men, which doesn't go entirely \n               unnoticed by the half-dozen or so other young men on the \n               gang.\n\n               ...or, indeed, by Rachel; in fact, she seems \u0096 without leaning \n               on it too heavily \u0096 to be measuring the two men as the morning \n               progresses, and she occasionally passes within proximity of \n               them.\n\n               ...Eli and a couple of other elders prowling the job with \n               sheaves of hand-drawn sketches under their arms, supervising \n               the construction. All around them the structure is rising \n               with remarkable rapidity.\n\n               ...Rachel, where she's helping the women set out the huge \n               noon meal. Other women are sitting on benches in the b.g., \n               knitting or doing quiltwork.\n\n               ...Samuel, where he's banging away with a hammer, with a \n               group of boys his own age. Elsewhere we see little girls \n               \"botching\" (a hand-clapping game played to German rhymes).\n\n               ...The very elderly; sitting on the grass or in wheelchairs \n               in the sunlight, looking on \u0096 the old men kibitzing in German, \n               the women gossiping.\n\n               Until...\n\n               BIG SHOT\n\n               Of the barn-raising with the noon sun high overhead... at \n               least a hundred and fifty men are swarming over and about \n               the barn framework...\n\n               ...some aid the rafters, some hauling lumber to the job, \n               others sawing, hammering, drilling, joining, planing and \n               what-all... so many that the barn seems almost to be rearing \n               up before our very eyes. And there isn't a power tool in \n               sight.\n\n               WOMEN'S AREA\n\n               As Rachel crosses near the benches... we can see other women \n               eyeing her, whispering among themselves, some tittering. \n               Rachel ignores them.\n\n               She joins the stoutly amiable Mrs. Yoder from the funeral \n               sequence earlier. The older woman is emptying a big pan of \n               fried chicken into serving platters. She smiles, obviously \n               liking Rachel.\n\n                                     MRS. YODER\n                         Everyone has an idea about you and \n                         the English.\n\n                                     RACHEL\n                         All of them charitable, I'm sure.\n\n                                     MRS. YODER\n                         Hardly any of them.\n\n               ANGLE \u0096 THE ROOFBEAM\n\n               Book and Hochstetler astride the roofbeam studs, holding \n               them together prior to nailing them to the roof-beam. They \n               are, therefore, crotch to the mast and facing one another, \n               way out at the far end of the roof.\n\n               Suddenly, as Hochstetler raises his hammer, the studs start \n               to part, threatening to de-ball the both of them.\n\n               Hochstetler drops his hammer, grabs both sides of the roof \n               with incredible brute strength, and, literally, pulls it \n               back together.\n\n               Book stares at Hochstetler with nothing short of awe.\n\n               Hochstetler, straining and grinning, looks to Book:\n\n                                     HOCHSTETLER\n                         Nail it!\n\n                                     BOOK\n                         Yes, sir.\n\n               And he does nail it while Hochstetler, grinning and holding, \n               looks on.\n\n                                                               DISSOLVE TO:\n\n               BIG SHOT\n\n               The barn is done, the workmen climbing down from the rafters. \n               It's late afternoon.\n\n               ANGLE ON BOOK\n\n               He hesitates. His face is pale and covered with sweat. The \n               exertion of the day has taken its toll. He's in danger of \n               fainting and is some forty feet above the ground. But he's \n               determined it won't happen, determined that he won't fall, \n               nor will he humiliate himself by calling for help. Hochstetler \n               guesses the situation. He moves beside Book, claps an arm \n               about him, says nothing, doesn't even look at Book. From \n               below, someone TELLS them to hurry up.\n\n               Hochstetler shouts:\n\n                                     HOCHSTETLER\n                         We admire our work!\n\n               The moment passes for Book, and he's okay. Hochstetler removes \n               his supporting arm. Book looks him in the eye, nods his \n               appreciation almost imperceptibly. Hochstetler wants no \n               thanks, and Book knows it. Hochstetler gives him a resounding \n               SLAP on the back, and starts climbing down. Book follows.\n\n               EXT. ZOOK FARM \u0096 LANCASTER COUNTY \u0096 EVENING\n\n               The gathering has congregated to hear Bishop Tschantz offer \n               up a blessing on the new barn.\n\n               CONGREGATION\n\n               PANNING the faces as they listen to the heavy German words \n               rolling out over the still evening air.\n\n               Book stands a little to one side of the Amish. The prayers \n               he cannot share with them. Rachel is aware of this, feels \n               something of his emotion. She looks toward him, then she too \n               closes her eyes and drifts away from him, into the soothing \n               prayer.\n\n                                                                    CUT TO:\n\n               EXT. LAPP FARM \u0096 NIGHT\n\n               Book stands outside, listening to the NIGHT SOUNDS. He turns, \n               walks up toward the porch.\n\n               EXT. PORCH \u0096 TARP FARMHOUSE \u0096 NIGHT\n\n               Book takes a seat in a chair, SIGHS, looks toward the night \n               sky.\n\n               There is a SOUND, but it's a moment before he turns his eyes \n               toward the door.\n\n               ANGLE \u0096 THE DOOR\n\n               Samuel standing there in his nightshirt.\n\n               BACK TO SCENE\n\n               As Book leans forward in his chair.\n\n                                     BOOK\n                         Hey, Sam...\n\n                                     SAMUEL\n                         ...I want to say a thing.\n\n                                     BOOK\n                              (sitting up)\n                         What's that, Sam?\n\n               The boy hesitates, holds for a time, then suddenly darts \n               across to Book, wraps his arms around him, hugs him tightly... \n               then breaks away, turns and runs hack into the house, leaving \n               the door open behind him.\n\n               ANGLE \u0096 BOOK\n\n               Looking after the boy, genuinely moved. After a moment, he \n               speaks softly:\n\n                                     BOOK\n                         Same to you, Sam.\n\n               After another moment, he gets up, moves to close the door \n               that Samuel has left open behind him.\n\n               ANOTHER ANGLE \u0096 BOOK\n\n               From the lighted/shadowed area outside the door. He comes to \n               the door, starts to close it, then hesitates, looks into see \n               where the light is coming from. He looks down the corridor. \n               The light is obviously coming from the kitchen. He speaks \n               softly:\n\n                                     BOOK\n                         Sam?\n\n               No answer. Book steps inside, pulls the door shut behind \n               him, moves down-the corridor toward the kitchen.\n\n               INT. LAPP WASHHOUSE \u0096 NIGHT\n\n               Where Rachel, dressed only in a plain cotton camisole, is \n               pouring a pail of steaming water into a tub.\n\n               She replaces the pail on the stove, turns and slips out of \n               her camisole. Naked, she folds the garment across the back \n               of a chair.\n\n               Then she pauses, containing a startled intake of breath.\n\n               RACHEL'S POV \u0096 FRYING PAN\n\n               The gleaming bottom of a large copper skillet hanging over \n               the stove with other cookware, we can see Book's image \n               reflected there, framed in the kitchen doorway.\n\n               BACK TO SCENE\n\n               Rachel hesitates for a moment \u0096 and in that moment she makes \n               a choice.\n\n               Slowly she turns, to face him, without shame, meeting his \n               eyes.\n\n               And for a moment she attempts something: a look, a flash of \n               eve... a lovely, heartbreakingly innocent effort to become, \n               for an instant, a woman of Book's world.\n\n               BOOK\n\n               As he stands in the doorway, willing himself to leave, unable \n               to make it happen.\n\n               And suddenly the moment has passed. Rachel lowers her eyes, \n               picks up the camisole, covers herself with it without putting \n               it on, looks away.\n\n               BOOK\n\n               TIGHTENING to him, and...\n\n                                                                    CUT TO:\n\n               EXT. LAPP FARM \u0096 DAWN\n\n               REESTABLISHING...\n\n               ANGLE \u0096 HEN YARD\n\n               Where Rachel is scattering feed to the chickens.\n\n               A beat, then Book approaches from behind her. A moment, as \n               she senses his presence.\n\n               Book watches as Rachel begins to gather the eggs, placing \n               them in the fold of her apron.\n\n               When he speaks, he speaks softly, and she pauses in her work.\n\n                                     BOOK\n                         Last night.\n\n               She goes very still, but keeps her back to him.\n\n                                     BOOK\n                         If... we'd made love, then, I couldn't \n                         leave.\n\n               She lowers her head slightly, but remains turned away from \n               him.\n\n               Book continues to stare at her.\n\n               EXT. RURAL ROAD \u0096 LANCASTER COUNTY \u0096 DAY\n\n               The Lapp carriage on a winding lane.\n\n               INT. BUGGY (MOVING)\n\n               Rachel is driving, Book sitting next to her. Samuel is in \n               the back, looking out the rear window and not paying any \n               attention to the adults.\n\n               A beat, then a large produce truck roars past them. It's all \n               Book can do to keep from flinching.\n\n               Rachel stares straight ahead. Book glances at her.\n\n                                     BOOK\n                         Maybe I ought to learn to drive this \n                         thing.\n\n               Rachel says nothing.\n\n                                     BOOK\n                              (beat)\n                         Pick myself up another useful skill.\n\n               Now Rachel can't help but smile. She looks at him. And...\n\n               EXT. ANGLE\n\n               We can see the Lapp buggy approaching a rural intersection, \n               another buggy approaching at right angles.\n\n               INT. LAPP BUGGY\n\n               As Rachel eyes the other buggy through the windshield.\n\n                                     RACHEL\n                         Samuel, who is that?\n\n               Samuel checks out the buggy.\n\n                                     SAMUEL\n                         It looks like Hochstetler's mare.\n\n               EXT. ANGLE\n\n               As the Lapp buggy passes the intersection and the Hochstetler \n               buggy swings in behind them. Then the Hochstetler buggy, \n               coming on at a faster clip, starts to pass the Lapp buggy.\n\n               INT. LAPP BUGGY\n\n               As Rachel waves at the occupants of the other buggy; Daniel \n               returns her greeting:\n\n                                     BOOK\n                              (teasing her)\n                         Uh oh, they're leaving us behind.\n\n               Rachel gives him a look, and... gives the reins a flick \u0096 \n               the race is on.\n\n               RACE MONTAGE\n\n               Hochstetler has a couple of older folk on board, together \n               with his young sister \u0096 at first they're not aware of the \n               race, until Daniel can contain his excitement no longer and \n               gives his horse a couple of whoops. The buggies are neck and \n               neck, and the older people are not protesting loudly.\n\n               It's all Book can do to refrain from grabbing the reins off \n               Rachel, but she's something of a horsewoman and finally she \n               gains the edge and pulls ahead of Hochstetler, to the cheers \n               of Samuel and Book.\n\n               EXT. SALZBURGSTORE \u0096 DAY\n\n               It's a Saturday afternoon in the tourist season, and they're \n               everywhere \u0096 taking shots of anything Amish. There's a ROWDY \n               YOUNG ELEMENT amongst them who are making their presence \n               fast, and generally making a nuisance of themselves.\n\n               Book and Rachel get out of the buggy. Samuel stays inside; \n               the crowds make him nervous. A huge tourist bus billowing \n               smoke pulls up nearby.\n\n               Rachel enters the store, but before Book can follow he's \n               stopped by a TOURIST LADY with an instamatic camera... She \n               waggles the camera at him...\n\n                                     TOURIST LADY\n                         Could I... ah, you know?\n\n                                     BOOK\n                              (smiling)\n                         Lady, if you take my picture, I'll \n                         rip your brassiere off and strangle \n                         you with it.\n\n               The Tourist Lady stares at him in stunned disbelief, her \n               grin frozen on her face. Then she begins to scuttle back \n               from whence she came.\n\n               INT. STORE\n\n               Rachel is browsing among the stocked shelves in the company \n               of a young Amish woman, Ellie Beiler. Rachel is carrying \n               Ellie's tiny baby, and the infant is getting as much attention \n               as the shopping.\n\n               Book is standing at a wall pay phone in the b.g. We TIGHTEN \n               to him, and...\n\n                                     BOOK\n                         Lieutenant Elton Carter, please.\n\n               A beat, then we hear the FILTERED VOICE of the Philadelphia \n               Police Department switchboard:\n\n                                     VOICE\n                         Are you a member of the family?\n\n                                     BOOK\n                         What? I'm a friend of his.\n\n                                     VOICE\n                         I'm sorry. Last night Sergeant Carter \n                         was killed in the line of duty...\n\n               Book hangs up. His breathing is thrown out by the shock of \n               the news and he takes a couple of deep breaths to regain \n               control. He hesitates, unsure of his next move. He makes to \n               move away, then he turns back, finds more coins and dials a \n               second number.\n\n               INT. HALLWAY, SCHAEFFER'S HOME \u0096 DAY\n\n               Schaeffer's wife answers the phone; she is momentarily \n               shocked.\n\n               She calls for her husband, then makes polite conversation.\n\n                                     MRS. SCHAEFFER\n                         How are you, John?\n\n               Paul Schaeffer appears, slightly irritated at being called \n               away from the Saturday afternoon game.\n\n                                     MRS. SCHAEFFER\n                              (covering mouthpiece)\n                         John Book!\n\n                                     SCHAEFFER\n                         I'll take it in the study.\n\n               INT. STUDY / STORE \u0096 DAY\n\n               Schaeffer takes the phone.\n\n                                     SCHAEFFER\n                         You can hang up, dear.\n\n               We HEAR the click of the other phone,\n\n                                     BOOK\n                         You made a mistake, Paul. You \n                         shouldn't have taken Elton out.\n\n                                     SCHAEFFER\n                              (beat)\n                         How bad did Mac get you? We figured \n                         pretty bad.\n\n                                     BOOK\n                         I'm fine. I'm going to live a long \n                         time. That's what I called to tell \n                         you.\n\n                                     SCHAEFFER\n                              (quickly)\n                         Johnny \u0096\n\n                                     BOOK\n                         You might want to pass it along to \n                         Mac.\n\n                                     SCHAEFFER\n                              (urgently)\n                         Listen to me, Johnny. Come in! You're \n                         out there all alone... We're getting \n                         close... real close... Maybe if you \n                         listen to me for a minute we can \n                         work something out so you can come \n                         in \u0096\n\n                                     BOOK\n                         I've already got something worked \n                         out.\n                              (and)\n                         Be seeing you.\n\n               Book hangs up the phone and the dead CLICK registers on \n               Schaeffer.\n\n               Book has gripped the phone so tightly that it takes a second \n               to unclench his fist. Then it takes something else to resist \n               his first impulse, which is to smash out at something... \n               Training. Get it under control. Deal rationally with the \n               situation.\n\n               He straightens his jacket, wipes the sweat/tears from his \n               eyes, turns and walks stiffly out of the Saltzburg General \n               Store.\n\n               INT. BUGGY \u0096 MAIN STREET \u0096 SALTZBURG \u0096 DAY\n\n               Book, as Rachel eyes him. She has noticed his changed mood, \n               but doesn't ask about it. He stares straight ahead, oblivious \n               to the surroundings of the street, now crawling with tourists \n               and traffic.\n\n               EXT. NARROW SIDE STREET \u0096 SALTZBURG \u0096 DAY\n\n               The buggy turns into the side street. Some hundred yards \n               ahead another buggy is stopped in the middle of the road \u0096 \n               several youths gathered about it. A pickup truck is stopped, \n               facing the buggy.\n\n               INT. LAPP BUGGY \u0096 DAY\n\n               As Rachel approaches the scene, slowing down and finally \n               stopping.\n\n               Rachel is at first puzzled, then makes a small face, looks \n               at Book.\n\n               Rachel puts a restraining hand on Book's arm.\n\n                                     RACHEL\n                         Do nothing. This happens from time \n                         to time.\n\n               She senses him about to get out, grips his arm tightly.\n\n                                     RACHEL\n                         It's not our way, John. We'll have \n                         nothing to do with violence! John!\n\n               Book shakes free, gets out and slowly walks toward the...\n\n               EXT. HOCHSTETLER'S BUGGY \u0096 DAY\n\n               Hochstetler and his family sit, impassive, ignoring various \n               jeers and taunts from the English lads \u0096 various jokes about \n               them being dirty etc. One jabs an ice cream cone into \n               Hochstetler's forehead, which leaves a curious white circle \n               on his forehead. Another fools about with the horse causing \n               it to shy. A third notices the slow, sure, approach of John \n               Book.\n\n                                     YOUTH\n                         Here comes another one!\n\n               Book stops, his path blocked by the third youth. The youth \n               flicks off Book's hat.\n\n                                     BOOK\n                              (quietly)\n                         You're making a mistake.\n\n               Hochstetler calls from his buggy.\n\n                                     HOCHSTETLER\n                         Everything is all right, John.\n\n                                     BOOK\n                              (to the youth)\n                         Pick up the hat.\n\n               The youth momentarily unsure \u0096 something about Book's tone \n               of voice. The youth does pick up the hat, crumples it, stamps \n               on it, and puts it back at a crazy angle on Book's head. A \n               pause, then Book explodes.\n\n               The kid never knew what hit him or where it came from, he \n               hits the road surface already unconscious. A second youth \n               grabs Book from behind. A mistake. Book is smashing into \n               him, spatters of blood from his nose flying in all directions. \n               He's hitting too hard, too often. It's Schaeffer he's hitting. \n               Hochstetler is pulling him away, Rachel is there too. A crowd \n               is gathering, but as suddenly as it began it's over. Book \n               shakes Hochstetler off him, straightens his hat, and in a \n               kind of daze, begins walking past the scene in the direction \n               of the Lapp farm.\n\n               The youths are picking up their wounded, helping them back \n               to their truck, aided by none other than Hochstetler. An OLD \n               LOCAL addresses Rachel.\n\n                                     LOCAL MAN\n                         Never seen anything like that in all \n                         my years.\n\n                                     RACHEL\n                              (covering)\n                         He's from... Ohio... My cousin.\n\n                                     LOCAL MAN\n                         We'll, them Ohio Amish sure must be \n                         different.\n                              (addresses a gathering \n                              crow)\n                         Our Lancaster brethren, they just \n                         don't have that kind of fight in \n                         them.\n\n                                     RACHEL\n                         John, lost control of himself. He... \n                         will be repentant.\n\n                                     LOCAL MAN\n                              (to Rachel)\n                         You're Rachel Lapp, aren't you?\n\n                                     RACHEL\n                         Yes. Samuel! We're going.\n\n               A second man calls from the pickup.\n\n                                     SECOND MAN\n                         Kid's nose is broken!\n\n                                     LOCAL MAN\n                         We'll take him up the hospital. Good-\n                         day to you, Mrs. Lapp.\n                              (he shouts after her)\n                         This ain't good for the tourist trade, \n                         you know! You tell that to your Ohio \n                         cousin!\n\n               But Rachel is already steering past the scene and following \n               the by now distant figure of John Book.\n\n               EXT. BARN / CARPENTER'S SHOP \u0096 DUSK\n\n               Book comes out of the carpenter's shop carrying the repaired \n               birdhouse on its pole in one hand, a shovel in the other.\n\n               Rachel is shepherding the milking cows toward the barn.\n\n                                     RACHEL\n                         You should not bother with that \n                         birdhouse.\n                              (a beat)\n                         If you're leaving tomorrow.\n\n                                     BOOK\n                         I'm leaving tonight.\n                              (and)\n                         I'm going to need my clothes. And my \n                         gun.\n\n               She nods, looks away... looks back at him twice in glances. \n               There is a moment when it appears she might either bark at \n               him or begin to weep. He waits. When she does turn to him, \n               she speaks softly:\n\n                                     RACHEL\n                         There was a time when I thought you \n                         might have stayed.\n\n                                     BOOK\n                              (hesitating... then)\n                         There was.\n\n                                     RACHEL\n                         There was a time when I would have \n                         welcomed it.\n\n                                     BOOK\n                              (after a beat)\n                         I know.\n\n                                     RACHEL\n                              (asking)\n                         I was being foolish?\n\n                                     BOOK\n                         No.\n                              (and)\n                         I was being unrealistic. Even thinking \n                         about living this life.\n\n                                     RACHEL\n                         You're so sure of that?\n\n                                     BOOK\n                         Aren't you? After today?\n\n                                     RACHEL\n                              (almost conceding it, \n                              but... her voice \n                              rising a bit, annoyed)\n                         I'm not so sure of anything as you \n                         are, John Book. You could live this \n                         life if you wanted to bad enough.\n                              (a beat)\n                         Just as I could live yours!\n\n                                     BOOK\n                              (almost groaning)\n                         Oh, come on, Rachel. No way.\n\n                                     RACHEL\n                         There is always a way! But you are \n                         such a... a Glotzkopp you cannot \n                         see! You'd rather go back to that \n                         city! To nothing! No woman! No \n                         children! No land!\n\n                                     BOOK\n                              (now getting annoyed)\n                         Land! Are you crazy? I'm no Amishman \n                         and I'm no farmer! I'm a cop. That's \n                         what I know and that's what I do!\n\n                                     RACHEL\n                         What you do is take vengeance! Which \n                         is a sin against heaven!\n\n                                     BOOK\n                         That's your way, not mine.\n\n                                     RACHEL\n                         That's God's way!\n\n                                     BOOK\n                         Well in the City of Philadelphia, \n                         God needs a little help!\n\n               He has offended her, immediately knows it, but can't bring \n               himself to make an instant apology. But he's chewing on it \n               when she takes the moment unto herself. She pulls herself \n               up, speaks with great dignity:\n\n                                     RACHEL\n                         I could never love a man who was \n                         so... little.\n\n               He looks at her, sad-eyed, his anger ebbing and gone, \n               realizing that he'll never meet a finer woman... never even \n               get close to such a one. He appears to start to speak, but \n               then does not.\n\n               She turns, moves away a few steps, stops, looks back at him. \n               she holds for a moment, blinking tears, then speaks with \n               some difficulty, emotion welling in her words.\n\n                                     RACHEL\n                         The other night... when you saw me \n                         after my bath... I... I tried to \n                         look as I thought you would want a \n                         woman to look.\n                              (sadly... but with a \n                              slight, proud lift \n                              of chin)\n                         I am sorry... that I did not.\n\n               She holds for an instant, then turns and walks off.\n\n               BOOK\n\n               Looking after her. A face full of loss.\n\n               INT. KITCHEN \u0096 DUSK\n\n               Eli is lighting the lamps. Samuel reads a book at the kitchen \n               table. Rachel moves slowly to the sink and begins washing a \n               few dishes. She looks out the window.\n\n               CLOSE on her face, a strange expression.\n\n               INT. / EXT RACHEL'S POV \u0096 DUSK\n\n               The distant figure of Book working on the birdhouse.\n\n               INT. KITCHEN\n\n               CLOSE on Rachel's hands, lifting items slowly up and of the \n               water to the draining board, where she places them carefully \n               down. She shakes the water off her hands.\n\n               CLOSE on her face, still staring fixedly out the window. She \n               speaks without turning around.\n\n                                     RACHEL\n                         Eli, would you see Samuel to bed?\n\n               The old man glances at her; this is not their routine.\n\n               EXT. DRIVEWAY \u0096 DUSK\n\n               In the rapidly fading light, Rachel walks slowly toward Book.\n\n               CLOSE on her face, staring straight ahead toward Book.\n\n               ANGLE on Book, CLOSE. He turns and watches Rachel's approach.\n\n               BIG WIDE ANGLE\n\n               The light now nearly gone, the NIGHT SOUNDS beginning, as \n               Rachel reaches Book and they embrace.\n\n               EXT. FIELD BY ROAD \u0096 NIGHT\n\n               Book and Rachel in a passionate embrace, sink to the still \n               warm earth and make love.\n\n               EXT. SOUDERSBURG CAFE \u0096 LANCASTER COUNTY \u0096 NIGHT\n\n               ESTABLISHING an all-night cafe in the early hours of the \n               morning.\n\n               TIGHTENING to the bleakly lighted windows.\n\n               INT. CARE\n\n               A booth, where Schaeffer and McElroy and Fergie, a Lancaster \n               County Undersheriff and his SHERIFF \u0096 an expansive politician \n               type \u0096 are seated.\n\n               The Undersheriff eyes Schaeffer narrowly. The Sheriff has a \n               county map spread out on the table, amid breakfast dishes, \n               pointing directions to Schaeffer:\n\n                                     SHERIFF\n                         There... White Oak Road a couple of \n                         miles before it ties into two-twenty-\n                         two. Got it?\n\n                                     SCHAEFFER\n                         Got it. We owe you one, Sheriff.\n\n                                     SHERIFF\n                         My man Holmes here put it together. \n                         Fine officer, Chief. He spoke to the \n                         doctor at the hospital.\n\n                                     SCHAEFFER\n                         Undersheriff Holmes and I have talked \n                         on the phone.\n                              (nods at Holmes)\n                         Good work.\n\n                                     UNDERSHERIFF\n                         Sure you don't want us to post some \n                         backup units?\n\n                                     SCHAEFFER\n                         If we need any help, we'll give you \n                         a shout. I'd like to slip in there \n                         quiet, then get out before we attract \n                         any attention.\n\n               EXT. CAFE PORCH \u0096 DAY\n\n               As Schaeffer and his men are climbing into their car. Holmes \n               and the Sheriff watch after them.\n\n                                     HOLMES\n                         Maybe I'll take a drive over that \n                         way.\n\n                                     SHERIFF\n                         Let 'em be. It's their dirty laundry.\n\n               But Holmes pauses to watch Schaeffer's car pull out.\n\n               EXT. RURAL LANE \u0096 LANCASTER COUNTY \u0096 DAWN\n\n               With the first light of dawn on the eastern horizon, \n               Schaeffer's car approaches along the lane, pulls into the \n               Lapp driveway and comes to a halt.\n\n               In the b.g. we can make out the farmhouse and outbuildings.\n\n               HOLD as Schaeffer, McElroy and Fergie step out of the car. \n               They break out short-barreled twelve-gauge pumps, start TOWARD \n               CAMERA, spreading out as they turn up the long driveway... \n               figures of ominous intent striding through the misty dawn.\n\n               ANGLE\n\n               GOING WITH the trio of gunmen... McElroy, breath smoking in \n               the chill, eyes the terrain:\n\n                                     MCELROY\n                         Weird, man. No fuckin' electricity. \n                         What do you figure they plug all \n                         their shit into?\n\n                                     SCHAEFFER\n                         They don't have any shit.\n\n               INT. KITCHEN \u0096 DAWN\n\n               Where Eli is getting into a heavy coat, preparing to go out... \n               the remains of the hearty morning breakfast are on the table. \n               Rachel is beginning the dishes.\n\n               INT. BARN \u0096 DAWN\n\n               Book and Samuel are starting the morning milking...\n\n               INT. KITCHEN \u0096 DAWN\n\n               Eli is preparing to extinguish the lamp when suddenly the \n               kitchen door is kicked open and McElroy and Fergie weapons \n               leveled, burst in. Eli reacts with angry shock as Schaeffer \n               enters: Rachel is, for a moment, terrified.\n\n                                     SCHAEFFER\n                              (to Fergie)\n                         Outside \u0096\n                              (to Mac)\n                         Check out the rest of the house.\n\n               He turns to Eli, who is standing in the middle of the room.\n\n               Schaeffer flashes his badge:\n\n                                     SCHAEFFER\n                         We're police officers. We're looking \n                         for a fugitive, John Book. He's living \n                         here?\n\n                                     ELI\n                         I have nothing to say to you. Get \n                         out of my house!\n\n                                     SCHAEFFER\n                         You speak English. Good. Now listen \n                         \u0096\n\n                                     RACHEL\n                              (recovering)\n                         No, you listen. Get out!\n\n                                     SCHAEFFER\n                         Lady, I'm here to help you. This man \n                         is very dangerous. An armed criminal.\n                              (ingratiating)\n                         He's got a gun, hasn't he?\n\n                                     RACHEL\n                         You have no right here!\n\n               McElroy re-enters.\n\n                                     MCELROY\n                         He's not in this building.\n\n                                     SCHAEFFER\n                              (to Eli)\n                         All right, where is he?\n\n               Suddenly Eli SHOUTS: It's deafening. Probably the loudest \n               noise Eli has ever made:\n\n                                     ELI\n                         John Book!\n\n               McElroy whips around, smashes Eli on the temple with the \n               butt of his shotgun. Eli crumples to the floor. Rachel \n               SCREAMS, runs to Eli.\n\n               INT. BARN \u0096 DAY\n\n               Book and Samuel in the milkhouse. They've heard Eli's outcry. \n               Book moves to the window, looks out.\n\n               BOOK'S POV \u0096 FERGIE\n\n               About halfway between the barn and the house. He turns from \n               glancing back toward the house (having heard Eli's shout) \n               and starts again toward the barn. Gun at the ready.\n\n               INT. BARN \u0096 DAY\n\n               As Book REACTS.\n\n               INT. KITCHEN \u0096 DAY\n\n               Rachel kneeling next to Eli, wiping at his bruise with a \n               damp cloth. Schaeffer looks on.\n\n                                     SCHAEFFER\n                         He'll live.\n\n                                     RACHEL\n                         You might have killed him!\n\n                                     SCHAEFFER\n                              (to McElroy)\n                         Find Fergie, check the barns. I'll \n                         watch these two.\n\n               McElroy nods, moves outside, turns toward the barns.\n\n               INT. BARN \u0096 DAY\n\n               Book still at the window, Samuel now beside him, trying to \n               get a look.\n\n                                     SAMUEL\n                         Is it them?\n\n                                     BOOK\n                              (turning, mind racing)\n                         It's them, Sam.\n                              (he bends to the boy, \n                              takes him by the \n                              shoulders)\n                         Now, Sam, listen to me and listen to \n                         me carefully. Listen to me as you \n                         never listened before.\n\n                                     SAMUEL\n                              (interrupting)\n                         Are they going to kill you?\n\n                                     BOOK\n                         Listen to me, Sam! I want you to go \n                         across the new corn to Stoltzfus'. \n                         Run as fast as you can. And stay \n                         there!\n\n                                     SAMUEL\n                         What are you going to do?\n\n                                     BOOK\n                         I'll be all right. You just do as I \n                         say.\n\n               He takes Samuel by the hand, leads him to the side door. He \n               bends, holds the boy close.\n\n                                     SAMUEL\n                         Don't let them hurt you.\n\n                                     BOOK\n                              (rising, pushing Samuel \n                              toward door)\n                         I won't. Now run.\n                              (as Sam looks back)\n                         Fast as you can!\n\n               Sam turns, takes off.\n\n               EXT. REAR DOOR \u0096 DAY\n\n               Samuel running.\n\n               EXT. BARN \u0096 DAY\n\n               Fergie almost to the upper barn, McElroy \u0096 well back and \n               moving slowly, circumspectly \u0096 headed toward the lower barn.\n\n               INT. BARN \u0096 DAY\n\n               Book, at another window in the lower barn, sees McElroy \n               heading for the milkhouse door. He can't see Fergie. He turns, \n               crosses the cowpen area, climbs an inner ladder leading to \n               the upper barn.\n\n               EXT. BARN \u0096 DAY\n\n               Fergie at the door to the upper barn, moving very cautiously, \n               gun up. He eases around the doorpost, looks within.\n\n               INT. BARN \u0096 ANGLE PAST BOOK\n\n               Beyond Book, now at the top of the ladder, we see Fergie \n               easing into the barn. Book pulls himself up, crawls behind \n               the wall of the mule stalls, opens gate, eases in beside \n               Luke, urgently whispering and patting the animal to calm \n               him. He gets to the animal's head, crouches, strokes Luke's \n               nose. The mule's huge flanks quiver, his nostril's and eyes \n               widen, but he makes no untoward sound. Book closes the gate.\n\n               BACK TO FERGIE\n\n               He comes on warily, muzzle first, eyes darting.\n\n               DOLLYING WITH him as he reaches the first mule's stall, opens \n               the gate. An edgy mule turns, eyes him, shuffles nervously. \n               Fergie backs off, moves on.\n\n               BOOK\n\n               As he listens, tenses, hearing Fergie's feet in the fresh \n               straw.\n\n               Book eases back alongside Luke, waits.\n\n               BACK TO FERGIE\n\n               As he approaches Luke's stall, reaches for the gate-latch.\n\n               BOOK \u0096 FLASH CUT\n\n               As the gate swings open, Book shouts and gives Luke a whack \n               on the back. The mule's pent-up nerves and feral energy \n               explode in an horrendous SCREAM.\n\n               FERGIE\n\n               Bowled backwards by the rearing animal as the gate flies \n               open, involuntarily FIRING, suddenly finding himself under \n               the lethal hooves of a twelve-hundred pound beast. Staggering \n               backwards, he SCREAMS, FIRES again, the load striking the \n               mule in its heaving chest as a flailing hoof smashes into \n               Fergie's head and the other hoof snaps his shotgun in half \n               like a matchstick.\n\n               BOOK\n\n               As he slips out of the stall, ducks toward the rear of the \n               barn.\n\n               FERGIE\n\n               Fallen, skull smashed... and now the dying Luke's legs buckle \n               and he collapses atop Fergie.\n\n               EXT. BARN \u0096 DAY\n\n               McElroy standing still, shock-eyed, looking toward the sound \n               of the shots. Then starting slowly forward.\n\n               SCHAEFFER\n\n               On the porch of the house, looking toward the barn.\n\n               EXT. FIELD \u0096 DAY\n\n               Some distance from the barn, Samuel's hearing the shots, \n               stops dead in his tracks... the sound of the shots still \n               REVERBERATING across the quiet fields.\n\n                                     SAMUEL\n                              (stricken)\n                         Mr. Book?\n\n               He hesitates, then turns, starts trotting back toward the \n               barns.\n\n               EXT. / INT. KITCHEN PORCH \u0096 DAY\n\n               Rachel has moved into the open kitchen door, glances anxiously \n               toward the barns. Starts out. Schaeffer pushes her back.\n\n                                     SCHAEFFER\n                         Get back in there.\n\n                                     RACHEL\n                         My son is out there!\n\n                                     SCHAEFFER\n                         Nobody's going to hurt your son...\n\n               EXT. BARN \u0096 DAY\n\n               As McElroy, checking the safety on his twelve-gauge, steps \n               into the barn.\n\n               INT. BARN \u0096 DAY\n\n               McElroy flattens himself against the wall, looks around \n               fearfully.\n\n                                     MCELROY\n                              (softly)\n                         Fergie?\n\n               Only silence.\n\n               EXT. FRONT PORCH \u0096 DAY\n\n               Schaeffer staring toward the barn, SHOUTS:\n\n                                     SCHAEFFER\n                         What the hell happened?\n\n               He listens, hears nothing, snorts, starts toward the barn \n               checking his gun, not hurrying.\n\n               INT. KITCHEN \u0096 DAY\n\n               Eli now seated at the table, holding a cloth to his head.\n\n               Rachel at a window, peering out. Schaeffer on the porch\n\n               EXT. FIELD \u0096 DAY\n\n               Samuel running as fast as he can trips as he crosses a small \n               muddy stream, falls full length, scrambles up, runs on.\n\n               INT. BARN \u0096 DAY\n\n               McElroy, moving very cautiously, comes around the mule stalls, \n               stops short, stares off screen.\n\n               HIS POV \u0096 FERGIE\n\n               Where he lies half buried beneath the huge bulk of the mule, \n               his head crushed like an eggshell.\n\n               BACK TO MCELROY\n\n               As he moves on around Fergie and the dead mule, planting \n               each foot as if he were walking in a mine field.\n\n               BOOK\n\n               Standing in shadow at the back of the barn next to a hay \n               mow.\n\n               HIS POV \u0096 MCELROY\n\n               Moving toward the center of the barn.\n\n               BOOK\n\n               As he starts to move even further back, he nudges into a \n               rope fastened to the wall behind him, He looks at it, looks \n               up.\n\n               HIS POV \u0096 THE ROPE\n\n               It runs from where it is fastened to the wall straight up to \n               the center roofbeam of the barn to a trolley fixed to a track \n               that runs the length of the roofbeam. Attached to this trolley \n               is a big hayfork (Paul Krantz has one), U-shaped, sharply-\n               pointed at each end of the U. the points hanging toward the \n               floor. The thing weighs about eighty pounds, and is suspended \n               in place by the rope anchored at the wall next to Book.\n\n               BACK TO BOOK\n\n               Keeping one eye on McElroy, he carefully begins to un-tie \n               the trip rope.\n\n               MCELROY\n\n               Moving out toward the center of the barn, almost under the \n               suspended hay fork. He stops short, listens. Then, either \n               spotting a moving shadow or hearing a SOUND, he FIRES. His \n               shot rattles off the side of a manure spreader. He SHOUTS:\n\n                                     MCELROY\n                         Book, you sneaky bastard, I know \n                         you're here! Come out and fight!\n\n               EXT. BARNYARD \u0096 DAY\n\n               Samuel, at the top of the barnyard, stops at the SOUND OF \n               THE SHOT, wide-eyed. He listens for an-instant, starts a \n               step toward the barn, then stops again, looks to a large \n               bell suspended in a cupola by one of the outbuildings. He \n               moves quickly to the bell, seizes the rope, pulls. The bell \n               CLANGS loudly, Sonorously.\n\n               SCHAEFFER\n\n               On the front porch, looking around for the location of the \n               sounding bell. He takes a step toward the barn, the stops, \n               looks back toward the house... frustrated.\n\n               INT. BARN \u0096 DAY\n\n               Book watches as McElroy starts to move again looking back \n               toward the SOUNDING of the bell.\n\n               HIGH ANGLE \u0096 HAY FORK\n\n               Looking down we can see McElroy almost directly beneath the \n               hay fork. The bell SOUNDING throughout. BOOK Waiting... trip \n               rope in hand. Then:\n\n                                     BOOK\n                              (shouting)\n                         Hey, Mac!\n\n               And he lets go the trip rope.\n\n               MCELROY\n\n               As he turns toward the SOUND of Book's voice.\n\n               HAY FORK\n\n               As it plummets down, causing a RATCHETING SOUND that fills \n               the barn, even drowns out the SOUND of the bell.\n\n               MCELROY\n\n               Eyes darting wildly, looking up.\n\n               HIS POV \u0096 HAY FORK\n\n               Plunging straight for him.\n\n               MCELROY\n\n               Diving to one side.\n\n               ANGLE \u0096 HAY FORK\n\n               THUDDING into the barn floor like a great trident fork.\n\n               Quivering there, not a foot from McElroy's head.\n\n               MCELROY\n\n               Staring at the fork pop-eyed.\n\n               BOOK\n\n               Sprinting toward a ladder thrust up through an opening in \n               the barn floor just in front of his parked car.\n\n               MCELROY\n\n               Spotting Book, coming up to one knee, quick-aiming, FIRING. \n               The shot smashes the windshield of the car.\n\n               BOOK\n\n               Diving, rolling, slamming into the top of the ladder, flailing \n               down out of sight.\n\n               MCELROY\n\n               FIRING AGAIN, then again. Emptying the gun, cursing as he \n               begins to reload, gets to his feet, starts toward the ladder. \n               The BELL still SOUNDING outside. The hood of the car SLOWLY \n               POPS UP.\n\n               ANGLE\n\n               As McElroy wheels at the movement of the car's hood, FIRES \n               twice.\n\n               MCELROY'S POV \u0096 LAPP BUGGY\n\n               The buckshot virtually blows the dashboard off.\n\n               EXT. BARNYARD \u0096 DAY\n\n               Samuel RINGING the bell. The bell rope is short, and so is \n               Samuel and his feet go off the ground with every swing of \n               the rockerarm.\n\n               He hangs on grimly, his black hat clinging to the back of \n               his head, his face set against the tears that move down his \n               cheeks.\n\n               SCHAEFFER\n\n               Comes hesitantly down the path toward the barn, looking toward \n               the sound of the bell, but also looking back in glances toward \n               the house to make sure Rachel and Eli stay where they are. \n               He still can't see Samuel.\n\n               HIS POV \u0096 THE PORCH\n\n               As Rachel starts off the porch, takes a few steps.\n\n               SCHAEFFER\n\n               Turning, SHOUTING:\n\n                                     SCHAEFFER\n                         You stay put!\n\n               RACHEL\n\n               She stops. She is also unable to see Samuel.\n\n               SCHAEFFER\n\n               Moving out toward the barn, rounding a corner... and there \n               is Samuel at the bellrope. He starts toward him.\n\n               EXT. FIELDS \u0096 DAY\n\n               Beyond Samuel, well out in the fields of the Stoltzfus farm, \n               Stotlzfus and others \u0096 including Hochstetler and his brothers \n               \u0096 are baling the first cutting of June hay.\n\n               But the operation has come to a halt. All are looking in \n               toward the Lapp farm, hearing the RINGING OF THE BELL (the \n               Amish cry for help), wondering, hesitating.\n\n               But now, as we watch, led by Hochstetler, they start in toward \n               Samuel.\n\n               EXT. BARNYARD \u0096 DAY\n\n               As Schaeffer reaches Samuel, SHOUTS:\n\n                                     SCHAEFFER\n                         Cut that out!\n\n               Samuel looks at him, keeps on pulling.\n\n               Schaeffer quickly crosses to him, grabs him by the back of \n               the neck, tries to pull him off the bell rope. Samuel hangs \n               on grimly.\n\n               Schaeffer yanks hard, succeeds in yanking Samuel free, shoves \n               him roughly aside. Then Schaeffer turns, FIRES a shotgun \n               blast into the top of the bellrope. It still hangs by several \n               threads, so he FIRES again.\n\n               The rope drops to the ground. Schaeffer reloads, turns to \n               look at Samuel, just getting to his feet. A moment... when \n               Schaeffer, recognizing Samuel as the Amish kid who saw McElroy \n               kill Zenovich, perhaps thinks of disposing of the witness \n               right then and there.\n\n               But a glance toward the oncoming Amish gives him pause. He \n               SNARLS at Sam:\n\n                                     SCHAEFFER\n                         Get down to the house and stay there!\n\n               Samuel gets to his feet, turns, trots off.\n\n               RACHEL\n\n               Already halfway out to the barn, running to gather Sam in \n               her arms... then to lead him back toward the house.\n\n               SCHAEFFER\n\n               Turning, starting very slowly toward the barn.\n\n               INT. BARN \u0096 DAY\n\n               McElroy at the top of the ladder, looking down. Then easing \n               over, placing his feet on the rungs.\n\n               BOOK\n\n               He stands below in a cowpen, using the cows for cover. The \n               cows stare balefully at him. A large goat nuzzles him, hooks \n               at him with its horns. Book waits, watches.\n\n               HIS POV \u0096 MCELROY\n\n               Visible to his knees as he eases down the ladder. He stops \n               at every rung to scrape his shoes free of the cowshit covering \n               the rungs.\n\n               BACK TO BOOK\n\n               He turns now to a door at the back of the pen. He un-hooks \n               it, pulls it open, moves inside.\n\n               ANOTHER ANGLE \u0096 BOOK\n\n               He is now in a small passageway giving on to the entrance to \n               a nearly-empty silo. Above the entrance, a ladder (interior) \n               rises to the top of the structure.\n\n               Book looks in, and up. We should get the impression that \n               Book's been here before, expects what he sees.\n\n               WHAT HE SEES\n\n               Forty feet up, a patch of blue sky through an open hatch.\n\n               BACK TO BOOK\n\n               He steps through to the base of the ladder, then ducks beyond \n               it into the silo. There is about two feet of old silage \n               covering the floor. He turns, looks up the white walls.\n\n               HIS POV \u0096 INSIDE SILO\n\n               An inside ladder runs to the top.\n\n               HIS POV \u0096 KICKBOARD\n\n               Standing against the wall next to the entrance... . obviously \n               to be inserted as the silo is filled.\n\n               BOOK\n\n               Now, quickly, he ducks back out through the entrance, crosses \n               to the door to the cowpen, very cautiously peers out..\n\n               WHAT HE SEES\n\n               McElroy at the bottom of the ladder, looking in the other \n               direction (toward the milkhouse).\n\n               BACK TO BOOK\n\n               Very carefully he shoves the cowpen door (which opens outward \n               into the cowpen). It begins to swing very slowly open. Book \n               immediately turns, darts back into the silo.\n\n               MCELROY\n\n               Turning slowly toward the cowpen... then FIRES twice as his \n               eye catches the motion of the swinging door. His shots blow \n               half a row of Eli's precious tools off an adjacent wall. \n               McElroy reloads, starts across toward the door.\n\n               INT. KITCHEN\n\n               Old Eli, at the sight of Samuel, rises from the table.\n\n                                     ELI\n                         Praise Gott!\n\n               Rachel stands aside as the old man embraces Samuel long and \n               hard.\n\n               She watches as he turns to the cupboard, takes down the big \n               family Bible. He crosses to the table, sets the book down, \n               places his hand on its pulls Samuel to the table beside him.\n\n               Rachel holds another beat as she stares at the old man \n               helplessly, then she rushes to where she hid Book's gun, \n               takes it down... her trembling hands take the bullets out of \n               the coffee jar. She drops several as she tries to figure out \n               how to open the chamber to load it.\n\n               In the b.g., Eli glances up, sees what she is about... he \n               rises and crosses to her. Samuel watches from the table.\n\n                                     ELI\n                              (fiercely)\n                         No, Rachel...\n\n                                     RACHEL\n                         I have to help him!\n\n               Rachel somehow manages to open the chamber and begins to try \n               to load the bullets. Eli's callused hand closes over hers, \n               halting the action:\n\n                                     ELI\n                         It is not our way!\n\n               Bullets are already CLATTERING to the floor from her trembling \n               fingers as she raises her eyes to Eli's.\n\n               A long beat as Rachel looks at him... Finally her fingers \n               release the pistol and it CLATTERS to the floor. She closes \n               her eyes.\n\n               Samuel, who has gotten up, moved to a window, watches Eli \n               and Rachel silently.\n\n               Eli leads her to the table, places her hands on the Bible \n               beneath his. They stand there and they pray.\n\n               INT. SILO \u0096 DAY\n\n               Book finishes putting the kickboard into the entrance.\n\n               MCELROY\n\n               Moving among the cows, stepping cautiously between the \n               cowflops.\n\n               The goat nudges him once, then butts him rather firmly. \n               McElroy swats at him with the gun butt, moves to the door. \n               As he arrives, he HEARS a noise \u0096 very slight \u0096 from the \n               direction of the silo.\n\n               He enters the passage way, looks in toward the silo entrance, \n               He hesitates. Another slight noise. He steps in to the base \n               of the inner ladder, looks up.\n\n               HIS POV \u0096 THE HATCH\n\n               The patch of blue sky, forty feet up.\n\n               BACK TO MCELROY\n\n               He frowns, reaches out, grabs a rung.\n\n               INT. BARN \u0096 DAY\n\n               Schaeffer, easing toward the mule stalls, MUTTERS, CURSES \n               under his breath. Then he rounds the corner of the first \n               stall... and there is Fergie with Luke the mule on top of \n               him. Schaeffer stares, blinks... moves on spotting a spent \n               shotgun shell near the hayfork...\n\n               INT. SILO \u0096 DAY\n\n               Book listening at the kickboard. SOUNDS of feet, shotgun \n               rattling against metal rungs, Book moves to the ladder on \n               his side, starts silently up.\n\n               MCELROY\n\n               Climbing with difficulty, shotgun clutched in one hand.\n\n               BOOK\n\n               He climbs up to the second kickboard, pauses, checks the \n               distance to the floor, starts upward again.\n\n               BARN YARD \u0096 DAY\n\n               The Amish beginning to arrive. Sam comes running, pulls \n               Stoltzfus toward the door of the milkhouse as the other Amish \n               look at the shot-shattered bellrope. Rachel and Eli come \n               rapidly up the path toward the group.\n\n               INT. BARN \u0096 DAY\n\n               Schaeffer finds another spent shotgun shell, crosses to the \n               ladder, looks down. He sets his shotgun down, takes out his \n               service revolver, starts down.\n\n               INT. SILO \u0096 DAY\n\n               Book has reaches the third kickboard, about thirty feet from \n               the ground. He checks it, turns the thumb-screws that hold \n               it in place, places his hand on the handle, moves to one \n               side as best he can... hangs there, listening.\n\n               MCELROY\n\n               Rattling up the other ladder, approaching the third kickboard.\n\n               BOOK\n\n               Listening tensely, hearing McElroy arrive on the other side \n               of the kickboard. Then, deliberately, Book makes a fist, \n               raps on the board smartly once.\n\n               MCELROY\n\n               Startled, REACTING. He sets his feet, leans back against the \n               back wall of the ladder well, brings the shotgun up, puts \n               the muzzle against the kickboard, clicks off the safety.\n\n               BOOK\n\n               We HEAR with him the thump of the muzzle, the CLICK... and, \n               with marvelous speed, Book pulls the kickboard and drops it \n               to the floor.\n\n               McELROY \u0096 FLASH CUT Staring in, stun-eyed, already falling \n               forward (having leaned his weight on the shotgun) as Book \n               seizes the shotgun by the barrel, pulls inward.\n\n               ANOTHER ANGLE\n\n               As McElroy pitches forward through the opening, SCREAMS and \n               GRABS as he plunges past Book. The shotgun FIRES as McElroy \n               manages to hold onto Book, and both men plunge thirty feet \n               to the bottom of the silo.\n\n               BOOK\n\n               He falls almost straight down, lands on his back, lies \n               stunned.\n\n               MCELROY\n\n               His forward motion has carried him across the silo. His head \n               bounds off the white brick wall about five feet up... and he \n               falls in a heap, blood gushing from his head, as...\n\n               TIGHT ON BOOK\n\n               Blinking, groaning, just beginning to stir... and, suddenly, \n               into the frame comes a hand with a pistol in it. The muzzle \n               is placed firmly against Book's temple.\n\n               WIDER\n\n               Schaeffer holding the pistol. He cocks the pistol, tenses as \n               if to FIRE (and he is actually about to)... when there is a \n               SOUND behind him. He snaps around.\n\n               WHAT HE SEES\n\n               Old Stoltzfus and Samuel standing in the kickboard opening \n               (Schaeffer having kicked the kickboard in when he heard the \n               shot from within the silo). They stand solemnly, looking on \n               as:\n\n               SCHAEFFER\n\n               He eases the hammer down on this pistol, speaks softly:\n\n                                     SCHAEFFER\n                         Okay, Johnny. On your feet.\n\n               THE SCENE\n\n               As Book struggles to his feet \u0096 Schaeffer holding the pistol \n               tight to Book's head. Book turns, sees Samuel and Stoltzfus, \n               blinks.\n\n               Schaeffer shoves Book toward the opening. As Book moves toward \n               Samuel, he speaks quietly:\n\n                                     BOOK\n                         It's okay, Sam.\n\n               ANOTHER ANGLE\n\n               As Book and McElroy move out of the silo, down the passageway \n               toward the milkhouse, Stoltzfus and Sam (after a glance in \n               at the inert McElroy) follow and...\n\n               EXT. BARN \u0096 DAY\n\n               As first Stoltzfus and Samuel, then Book and Schaeffer emerge \n               into the barnyard. Schaeffer has the muzzle of his pistol \n               pressed firmly against Book's throat, just below his jaw.\n\n               Schaeffer pulls up, frowning:\n\n                                     SCHAEFFER\n                         Hold it.\n\n               WHAT HE SEES\n\n               The Amishmen gathered \u0096 the Stoltzfus family, the Hochstetler \n               brothers, et al. All staring hard at Schaeffer and Book.\n\n               EXT. BARN / DRIVE \u0096 DAY\n\n               From a high wide angle the final scene is played out. \n               Schaeffer and Book, now moving again slowly up the drive, \n               the Amish following along closely on both sides.\n\n               CLOSE ON BOOK\n\n               As Schaeffer prods Book forward, warily eyeing the Amish.\n\n                                     SCHAEFFER\n                         Get back, you people!\n                              (prodding)\n                         Keep moving, Johnny...\n\n               Book takes a couple of steps further, then abruptly stops. \n               The Amish stand about close, staring, no one moving. Book \n               now slowly turns his head, looks at Schaeffer.\n\n                                     BOOK\n                         You're going to have to do it right \n                         here, Schaeffer.\n\n                                     SCHAEFFER\n                         Don't try me, Johnny!\n\n               Eli steps forward, bloody cloth held to his head.\n\n                                     ELI\n                         So... will you kill us all, then?\n\n               ANGLE\n\n               As Schaeffer's eyes waver between Book and Eli, Book slowly \n               turns until he is facing Schaeffer... the gun now leveled \u0096 \n               and almost pressing against \u0096 Book's chest. Book locks eyes \n               with Schaeffer.\n\n               Quietly:\n\n                                     BOOK\n                         It's all over, Paul.\n\n                                     SCHAEFFER\n                         Move! Or you die right here!\n\n               Book's right hand snakes out, grabs Schaeffer by the gunhand \n               wrist, twists viciously, Schaeffer SCREAMS in pain, the gun \n               falls out of his hand, he starts to his knees under the force \n               of Book's grip.\n\n               ANOTHER ANGLE\n\n               As Book bends, picks up the pistol, releases Schaeffer, pushes \n               him away. Schaeffer staggers against Hochstetler, who \u0096 partly \n               to keep him from falling, and partly (it appears) to \n               congratulate him on his surrender \u0096 wraps one brawny arm \n               around Schaeffer's shoulders, gives him a short approving \n               nod... holds Schaeffer as:\n\n               BOOK\n\n               Turning, looking into the crowd, finding Rachel. Their gazes \n               meet, hold for a long MOMENT. In the eyes of both we read \n               resignation... whatever there was between them has been \n               terribly damaged. It is almost certainly over for them, too.\n\n               EXT. BARN \u0096 DAY\n\n               HIGH SHOT holding the moment.\n\n               EXT. LAPP FARM \u0096 LATE AFTERNOON\n\n               The door opens and Book steps out, looking somehow strange \n               in his working suit. He looks about him, sees Samuel down by \n               the pond.\n\n               EXT. POND\n\n               He eases down beside Samuel. They both stare into the pond.\n\n                                     SAMUEL\n                         Are you really ever coming back?\n\n                                     BOOK\n                         Got to, Sam. You and I are going to \n                         a courthouse together, put some people \n                         behind bars.\n\n                                     SAMUEL\n                         Have you got your gun on now?\n\n                                     BOOK\n                         Sure have, Sam.\n\n               Sam grins. Book takes him in his arms, holds him.\n\n               EXT. HOUSE \u0096 DAY\n\n               Book opens the door of the car, turns to find Rachel standing \n               there with his Amish hat in hand.\n\n                                     RACHEL\n                         I want you to take this... to remember \n                         by.\n\n                                     BOOK\n                         Where's my baggy pants?\n\n                                     RACHEL\n                         Here. Whenever you want them.\n\n               He wants to kiss her, but does not. Their eyes say it all. \n               Eli has a final word, SHOUTING from the porch.\n\n                                     ELI\n                         You be careful, John Book! Out among \n                         them English!\n\n               Book gets quickly into the car.\n\n               INT. /EXT. DRIVEWAY \u0096 LAPP FARM \u0096 DAY\n\n               As Book drives, he sees an open buggy coming down the hill \n               toward the farm, He slows as he passes, It's Daniel \n               Hochstetler. A long beat, and as they pass, Hochstetler gives \n               Book an expansive tip of his hat.\n\n               INT. BOOK'S CAR\n\n               Book turns to look back at his rival, a doubt in his eyes. \n\n               FREEZE FRAME.\n\n                                                                   FADE OUT\n\n                                         THE END\n\n\n\n\n\n\n\nWitness\nWriters :   Earl W. Wallace  Pamela Wallace  William Kelley\nGenres :   Crime  Drama  Romance  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb", "summary": "A man runs away to avoid suspicion of murder and ends up in more trouble."}