{"summary": "\"...Baby One More Time\" is the first single for Britney Spears released off her first album as its first single.", "full_text": "\"...Baby One More Time\" is the debut single by American singer Britney Spears. It was written and produced by Max Martin and Rami, and released in 1998, by Jive Records for Spears' debut studio album of the same name . After recording and sending a demo tape with an unused song from Toni Braxton, Spears signed a multi-album deal with Jive. \"...Baby One More Time\" is a teen pop and dance-pop song that refers to a girl's feelings after a break-up with her boyfriend. The song received generally favorable reviews from critics, who praised its composition.\n\"...Baby One More Time\" attained global success, reaching number one in every country it charted, including the United Kingdom, where it earned double-platinum status and became the country's best-selling song of 1999. It also received numerous certifications around the world, and is one of the best-selling singles of all time, with over 10 million copies sold. An accompanying music video, directed by Nigel Dick, portrays Spears as a student from a Catholic high school, who starts to daydream that she is singing and dancing around the school, while watching her love interest from afar. The music video was later referenced in the music video of \"If U Seek Amy\" , where Spears's fictional daughter is dressed with a similar schoolgirl outfit while wearing pink ribbons in her hair. In 2010, the music video for \"...Baby One More Time\" was voted the third most influential video in the history of pop music, in a poll held by Jam!. In 2011, \"...Baby One More Time\" was voted the best music video of the 1990s. It has been featured on all of her greatest hits and other compilation albums.\nSpears has performed \"...Baby One More Time\" in a number of live appearances and in all of her concert tours. It was the encore of the ...Baby One More Time Tour  and Dream Within a Dream Tour ; Spears also performed remixed versions of the song during the Oops!... I Did It Again World Tour , The Onyx Hotel Tour , The M+M's Tour , The Circus Starring Britney Spears , the Femme Fatale Tour , and Britney: Piece of Me . \"...Baby One More Time\" was nominated for a Grammy Award for Best Female Pop Vocal Performance, and has been included in lists by Blender, Rolling Stone and VH1. It has been noted for redefining the sound of late 1990s music. Spears has named \"...Baby One More Time\" as one of her favorite songs from her career. It was also the final song to be played on the BBC's music programme Top of the Pops in the 1990s.", "title": "...Baby One More Time (song)"}