{"summary": "The 16th century is the century from 1501 to 1600. In this century, many Europeans visited or moved to the newly-found Americas and some also searched for new routes to Asia.", "full_text": "The 16th century begins with the Julian year 1501 and ends with either the Julian or the Gregorian year 1600 .\nIt is regarded by historians as the century in which the rise of the West occurred. During the 16th century, Spain and Portugal explored the world's seas and opened world-wide oceanic trade routes. Large parts of the New World became Spanish and Portuguese colonies, and while the Portuguese became the masters of Asia's and Africa's Indian Ocean trade, the Spanish opened trade across the Pacific Ocean, linking the Americas with Asia.\nIn Europe, the Protestant Reformation gave a major blow to the authority of the papacy and the Roman Catholic Church. European politics became dominated by religious conflicts, with the groundwork for the epochal Thirty Years' War being laid towards the end of the century. In Italy, Luca Pacioli published the first work ever on accounting and Galileo Galilei made the first thermometer. In United Kingdom, the Italian Alberico Gentili wrote the first book on public international law and divided secularism from canon law and Roman Catholic theology.\nIn the Middle East, the Ottoman Empire continued to expand, with the Sultan taking the title of Caliph, while dealing with a resurgent Persia. Iran and Iraq were caught by major popularity of the once-obscure Shiite sect of Islam under the rule of the Safavid dynasty of warrior-mystics, providing grounds for a Persia independent of the majority-Sunni Muslim world.\nChina evacuated the coastal areas, because of Japanese piracy. Japan was suffering a severe civil war at the time.\nMughal Emperor Akbar extended the power of the Mughal Empire to cover most of the South Asian sub continent. His rule significantly influenced arts, and culture in the region.\nCopernicus proposed the heliocentric universe, which was met with strong resistance, and Tycho Brahe refuted the theory of celestial spheres through observational measurement of the 1572 appearance of a Milky Way supernova. These events directly challenged the long-held notion of an immutable universe supported by Ptolemy and Aristotle, and led to major revolutions in astronomy and science.", "title": "16th Century"}