{"summary": "The 1910s was the decade that started on January 1, 1910, and ended on December 31, 1919.", "full_text": "The 1910s  was a decade of the Gregorian calendar that began on January 1, 1910, and ended on December 31, 1919. The 1910s represented the culmination of European militarism which had its beginnings during the second half of the 19th century. The conservative lifestyles during the first half of the decade, as well as the legacy of military alliances, was forever changed by the assassination, on June 28, 1914, of Archduke Franz Ferdinand, the heir presumptive to the Austro-Hungarian throne. The murder triggered a chain of events in which, within 33 days, World War I broke out in Europe on August 1, 1914. The conflict dragged on until a truce was declared on November 11, 1918, leading to the controversial, one-sided Treaty of Versailles, which was signed on June 28, 1919.\nThe war's end triggered the abdication of various monarchies and the collapse of five of the last modern empires of Russia, Germany, China, Ottoman Turkey and Austria-Hungary, with the latter splintered into Austria, Hungary, southern Poland , Czechoslovakia and Yugoslavia, as well as the unification of Romania with Transylvania and Moldavia. However, each of these states  had large German and Hungarian minorities, there creating some unexpected problems that would be brought to light in the next two decades. \nThe decade was also a period of revolution in a number of countries. The Mexican Revolution spearheaded the trend in November 1910, which led to the ousting of dictator Porfirio Diaz, developing into a violent civil war that dragged on until mid-1920, not long after a new Mexican Constitution was signed and ratified. Russia also had a similar fate, since World War I led to a collapse in morale as well as to economic chaos. This atmosphere encouraged the establishment of Bolshevism, which was later renamed as communism. Like the Mexican Revolution, the Russian Revolution of 1917, known as the October Revolution, immediately turned to Russian Civil War that dragged until approximately late 1922.\nMuch of the music in these years was ballroom-themed. Many of the fashionable restaurants were equipped with dance floors. Prohibition in the United States began January 16, 1919, with the ratification of the Eighteenth Amendment to the U.S. Constitution.", "title": "1910s"}