{"summary": "Timothy \"Tim\" Theodore Duncan  is a professional basketball player from the US Virgin Islands.", "full_text": "The 1999 NBA Playoffs was the postseason tournament of the National Basketball Association's 1998-99 season. The tournament concluded with the Western Conference champion San Antonio Spurs defeating the Eastern Conference champion New York Knicks 4 games to 1. Tim Duncan was named NBA Finals MVP.\nThe 1999 Playoffs are memorable in that a #8 seed  made it to the Finals for the only time in history, and that it came after a lockout-shortened 50-game season. This was also the first time that two teams played each other on consecutive nights in playoff history. It also featured the Philadelphia 76ers' and Milwaukee Bucks' first trip to the playoffs since 1991 , and it was also the 76ers' first appearance since drafting Allen Iverson with the #1 overall pick in 1996. Iverson later led the Sixers to the 2001 NBA Finals. The Bulls, despite being defending champions, missed the playoffs for the first time since 1984 . They also became the first defending champion since the 1969-70 Boston Celtics to miss the playoffs.\nAlthough the Spurs had home-court advantage throughout the playoffs, they played more road games  than home games , as all their series were won on the road, which included back-to-back sweeps of the Lakers and Blazers . They won 12 straight games, and finished 15-2.\nAfter losing their Eastern Conference Semifinal series to the Knicks, the Hawks did not return to the playoffs until 2008.\nGame 4 of the Spurs-Lakers series was the last NBA game ever played in the Great Western Forum.\nGame 5 of the Knicks-Pacers series was the last NBA game ever played at Market Square Arena.\nFor the first time since 1991, no series went seven games.\nAfter spending their first 13 seasons in mediocrity , the Sacramento Kings made the first of eight consecutive playoff appearances in eight seasons , which included a trip to the Western Conference Finals in 2002.\nGame 4 of the Lakers-Rockets series turned out to be the final postseason appearance in Charles Barkley's Hall of Fame career.\n\n", "title": "1999 NBA Playoffs"}