{"summary": "The 19th century is the century from 1801 to 1900. Most of this century is normally called the Victorian period because Queen Victoria ruled the United Kingdom.", "full_text": "The 19th century  was the century marked by the collapse of the Spanish, First and Second French, Chinese, Holy Roman and Mughal empires. This paved the way for the growing influence of the British Empire, the Russian Empire, the United States, the German Empire, the Second French Colonial Empire and the Empire of Japan, with the British boasting unchallenged dominance after 1815. After the defeat of the French Empire and its allies in the Napoleonic Wars, the British and Russian empires expanded greatly, becoming the world's leading powers. The Russian Empire expanded in central and far eastern Asia. The British Empire grew rapidly in the first half of the century, especially with the expansion of vast territories in Canada, Australia, South Africa and heavily populated India, and in the last two decades of the century in Africa. By the end of the century, the British Empire controlled a fifth of the world's land and one quarter of the world's population. During the post Napoleonic era it enforced what became known as the Pax Britannica, which helped trade.\nThe first electronics appeared in the 19th century, with the introduction of the electric relay in 1835, the telegraph and its Morse code protocol in 1837, the first telephone call in 1876, and the first functional light bulb in 1878. By the 1970s global electric power penetration exceeded 50 percent, with about 60 percent of the world's households and nearly half of developing world households receiving power by the end of the 1980s. By the 2010s six out of seven people had access to electric power.\nThe 19th century was an era of rapidly accelerating scientific discovery and invention, with significant developments in the fields of mathematics, physics, chemistry, biology, electricity, and metallurgy that laid the groundwork for the technological advances of the 20th century. The Industrial Revolution began in Great Britain and spread to continental Europe, North America and Japan. The Victorian era was notorious for the employment of young children in factories and mines, as well as strict social norms regarding modesty and gender roles. Japan embarked on a program of rapid modernization following the Meiji Restoration, before defeating China, under the Qing Dynasty, in the First Sino-Japanese War. Advances in medicine and the understanding of human anatomy and disease prevention took place in the 19th century, and were partly responsible for rapidly accelerating population growth in the western world. Europe's population doubled during the 19th century, from approximately 200 million to more than 400 million. The introduction of railroads provided the first major advancement in land transportation for centuries, changing the way people lived and obtained goods, and fuelling major urbanization movements in countries across the globe. Numerous cities worldwide surpassed populations of a million or more during this century. London became the world's largest city and capital of the British Empire. Its population increased from 1 million in 1800 to 6.7 million a century later. The last remaining undiscovered landmasses of Earth, including vast expanses of interior Africa and Asia, were discovered during this century, and with the exception of the extreme zones of the Arctic and Antarctic, accurate and detailed maps of the globe were available by the 1890s. Liberalism became the pre-eminent reform movement in Europe.\n\nSlavery was greatly reduced around the world. Following a successful slave revolt in Haiti, Britain and France stepped up the battle against the Barbary pirates and succeeded in stopping their enslavement of Europeans. The UK's Slavery Abolition Act charged the British Royal Navy with ending the global slave trade. The first colonial empire in the century to abolish slavery was the British, who did so in 1834. America's 13th Amendment following their Civil War abolished slavery there in 1865, and in Brazil slavery was abolished in 1888 . Similarly, serfdom was abolished in Russia.\nThe 19th century was remarkable in the widespread formation of new settlement foundations which were particularly prevalent across North America and Australia, with a significant proportion of the two continents' largest cities being founded at some point in the century. Chicago in the United States and Melbourne in Australia were non-existent in the earliest decades but grew to become the 2nd largest cities in the United States and British Empire respectively by the end of the century. In the 19th century approximately 70 million people left Europe, with most migrating to the United States of America.\nThe 19th century also saw the rapid creation, development and codification of many sports, particularly in Britain and the United States. Association football, rugby union, baseball and many other sports were developed during the 19th century, while the British Empire facilitated the rapid spread of sports such as cricket to many different parts of the world.\n\nIt also marks the fall of the Ottoman rule of the Balkans which led to the creation of Serbia, Bulgaria, Montenegro and Romania as a result of the second Russo-Turkish War, which in itself followed the great Crimean War.\n\n", "title": "19th century"}