{"summary": "The 2nd millennium started on January 1, 1001, and ended on December 31, 2000.", "full_text": "The second millennium is a period of time that began on January 1, 1001, and ended on December 31, 2000, of the Gregorian calendar. It was the second period of one thousand years in the Anno Domini or Common Era.\nIt encompassed the high Middle Ages, the late Middle Ages, the Renaissance, the Baroque era, the early Modern Age, the age of Enlightenment, the age of colonialism, industrialization, the rise of nation states, and the 20th century with the impact of science, widespread education, and universal health care and vaccinations in many nations. The centuries of expanding large-scale warfare with high-tech weaponry  were offset by growing peace movements from the United Nations, the Peace Corps, plus doctors and health workers crossing borders to treat injuries and disease, and the return of the Olympics as contest without combat.\nScientists prevailed in explaining intellectual freedom; humans took their first steps on the Moon during the 20th century; and new technology was developed by governments, industry, and academia across the world, with education shared by many international conferences and journals. The development of movable type, radio, television, and the internet spread information worldwide, within minutes, in audio, video, and print-image format to inform, educate and entertain billions of people by the end of the 20th century.\nThe Renaissance saw the beginning of the second migration of humans from Europe, Africa, and Asia to the Americas, beginning the ever-accelerating process of globalization. The interwoven international trade led to the formation of multi-national corporations, with home offices in multiple countries. International business ventures reduced the impact of nationalism in popular thought.\nThe world population doubled over the first seven centuries of the millennium  and later increased tenfold over its last three centuries, exceeding 6 billion in AD 2000.", "title": "2nd millennium"}