{"summary": "Aberdeen is a city on the north east coast of Scotland where the rivers Dee and Don flow into the North Sea.", "full_text": "Aberdeen  is Scotland's third most populous city, one of Scotland's 32 local government council areas and the United Kingdom's 37th most populous built-up area, with an official population estimate of 196,670 for the city of Aberdeen itself and 228,990 for the local authority area.\nNicknames include the Granite City, the Grey City and the Silver City with the Golden Sands. During the mid-18th to mid-20th centuries, Aberdeen's buildings incorporated locally quarried grey granite, which can sparkle like silver because of its high mica content. Since the discovery of North Sea oil in the 1970s, other nicknames have been the Oil Capital of Europe or the Energy Capital of Europe. The area around Aberdeen has been settled since at least 8,000 years ago, when prehistoric villages lay around the mouths of the rivers Dee and Don. The city has a long, sandy coastline and a marine climate.\nAberdeen received Royal Burgh status from David I of Scotland , transforming the city economically. The city's two universities, the University of Aberdeen, founded in 1495, and Robert Gordon University, which was awarded university status in 1992, make Aberdeen the educational centre of the north-east. The traditional industries of fishing, paper-making, shipbuilding, and textiles have been overtaken by the oil industry and Aberdeen's seaport. Aberdeen Heliport is one of the busiest commercial heliports in the world and the seaport is the largest in the north-east of Scotland.\nAberdeen has won the Britain in Bloom competition a record-breaking ten times, and hosts the Aberdeen International Youth Festival, a major international event which attracts up to 1000 of the most talented young performing arts companies. In 2012, Mercer named Aberdeen the 56th most liveable city in the World, as well as the fourth most liveable city in Britain. In 2012, HSBC named Aberdeen as a leading business hub and one of eight 'super cities' spearheading the UK's economy, marking it as the only city in Scotland to receive this accolade.", "title": "Aberdeen"}