{"summary": "In mammals, an abortion is when a pregnancy ends early without the birth of babies.", "full_text": "Abortion is the ending of pregnancy by removing a fetus or embryo from the womb before it can survive on its own. An abortion which occurs spontaneously is also known as a miscarriage. An abortion may be caused purposely and is then called an induced abortion, or less frequently, \"induced miscarriage\". The word abortion is often used to mean only induced abortions. A similar procedure after the fetus could potentially survive outside the womb is known as a \"late termination of pregnancy\".\nModern methods use medication or surgery for abortions. The drugs mifepristone and prostaglandin are as good as surgery during the first trimester. While medical methods may work in the second trimester, surgery has lower risk of side effects. Birth control, such as the pill or intrauterine devices, can be started at once after an abortion. When allowed by local law, abortion in the developed world is and has long been one of the safest procedures in medicine. Uncomplicated abortions do not cause any long term mental or physical problems. The World Health Organization recommends safe and legal abortions be available to all women. Every year unsafe abortions cause 47,000 deaths and 5 million hospital admissions.\nAround 44 million abortions occur each year in the world, with a little under half done unsafely. Abortion rates have changed little between 2003 and 2008, before which they decreased for decades due to better education about family planning and birth control. As of 2008, 40% of the world's women had access to legal abortions without limits as to reason. Different governments have different limits on how late in pregnancy abortion is allowed.\nSince ancient times abortions, have been done using herbal medicines, sharp tools, with force, or through other traditional methods. Abortion laws and cultural or religious views of abortions are different around the world. In some areas abortion is legal only in special cases such as rape, problems with the fetus, poverty, risk to a woman's health, or incest. In many places there is much debate over the moral, ethical, and legal issues of abortion. Those who are against abortion often maintain that an embryo or fetus is a human with a right to life and may compare it to murder. Those who favor the legality of abortion often hold that a woman has a right to make decisions about her own body.", "title": "Abortion"}