{"summary": "Absolute temperature is the temperature of an object on a scale where 0 is taken as absolute zero.", "full_text": "Thermodynamic temperature is the absolute measure of temperature and is one of the principal parameters of thermodynamics.\nThermodynamic temperature is defined by the third law of thermodynamics in which the theoretically lowest temperature is the null or zero point. At this point, absolute zero, the particle constituents of matter have minimal motion and can become no colder. In the quantum-mechanical description, matter at absolute zero is in its ground state, which is its state of lowest energy. Thermodynamic temperature is often also called absolute temperature, for two reasons: one, proposed by Kelvin, that it does not depend on the properties of a particular material; two that it refers to an absolute zero according to the properties of the ideal gas.\nThe International System of Units specifies a particular scale for thermodynamic temperature. It uses the Kelvin scale for measurement and selects the triple point of water at 273.16K as the fundamental fixing point. Other scales have been in use historically. The Rankine scale, using the degree Fahrenheit as its unit interval, is still in use as part of the English Engineering Units in the United States in some engineering fields. ITS-90 gives a practical means of estimating the thermodynamic temperature to a very high degree of accuracy.\nRoughly, the temperature of a body at rest is a measure of the mean of the energy of the translational, vibrational and rotational motions of matter's particle constituents, such as molecules, atoms, and subatomic particles. The full variety of these kinetic motions, along with potential energies of particles, and also occasionally certain other types of particle energy in equilibrium with these, make up the total internal energy of a substance. Internal energy is loosely called the heat energy or thermal energy in conditions when no work is done upon the substance by its surroundings, or by the substance upon the surroundings. Internal energy may be stored in a number of ways within a substance, each way constituting a \"degree of freedom\". At equilibrium, each degree of freedom will have on average the same energy:  where  is the Boltzmann constant, unless that degree of freedom is in the quantum regime. The internal degrees of freedom  may be in the quantum regime at room temperature, but the translational degrees of freedom will be in the classical regime except at extremely low temperatures  and it may be said that, for most situations, the thermodynamic temperature is specified by the average translational kinetic energy of the particles.", "title": "Absolute temperature"}