{"summary": "An African American generally refers to a person who lives in the United States and speaks English, but whose ancestors were from Africa.", "full_text": "African Americans, also referred to as Black Americans or Afro-Americans, are an ethnic group of Americans  with total or partial ancestry from any of the native populations of Sub-Saharan Africa. On average, African Americans are of 78 percent West African, 19 percent European and 3 percent Native American heritage, with very large variation between individuals. The term may also be used to include only those individuals who are descended from enslaved Africans. As a compound adjective the term is usually hyphenated as African-American.\nAfrican Americans constitute the third largest racial and ethnic group in the United States . Most African Americans are of West and Central African descent and are descendants of enslaved blacks within the boundaries of the present United States. However, immigrants from African, Caribbean, Central American, and South American nations and their descendants may or may not also self-identify with the term.\nAfrican-American history starts in the 16th century, with Africans forcibly taken as slaves to Spanish America, and in the 17th century with African slaves taken to English colonies in North America. After the founding of the United States, black people continued to be enslaved, with four million denied freedom from bondage prior to the Civil War. Believed to be inferior to white people, they were treated as second-class citizens. The Naturalization Act of 1790 limited U.S. citizenship to whites only, and only white men of property could vote. These circumstances were changed by Reconstruction, development of the black community, participation in the great military conflicts of the United States, the elimination of racial segregation, and the Civil Rights Movement which sought political and social freedom. In 2008, Barack Obama became the first African American to be elected president of the United States.\n\n", "title": "African American"}