{"summary": "Aircraft carriers are warships that carry airplanes and other aircraft like helicopters.", "full_text": "An aircraft carrier is a warship that serves as a seagoing airbase, equipped with a full-length flight deck and facilities for carrying, arming, deploying, and recovering aircraft. Typically, it is the capital ship of a fleet, as it allows a naval force to project air power worldwide without depending on local bases for staging aircraft operations. Aircraft carriers are expensive to build and are critical assets. Aircraft carriers have evolved from converted cruisers to nuclear-powered warships that carry numerous fighter planes, strike aircraft, helicopters, and other types of aircraft.\nThere is no single definition of an \"aircraft carrier\", and modern navies use several variants of the type. These variants are sometimes categorized as sub-types of aircraft carriers, and sometimes as distinct types of naval aviation-capable ships. Aircraft carriers may be classified according to the type of aircraft they carry and their operational assignments. Admiral Sir Mark Stanhope, former head of the Royal Navy, has said that \"To put it simply, countries that aspire to strategic international influence have aircraft carriers\".\nCarriers have evolved since their inception in the early twentieth century from wooden vessels used to deploy balloons to nuclear-powered warships that carry dozens of aircraft, including fighter jets and helicopters. As of 5 December 2015, there are thirty-seven active aircraft carriers in the world within twelve navies. The United States Navy has 10 large nuclear-powered carriers , the largest carriers in the world; the total deckspace is over twice that of all other nations' combined. As well as the supercarrier fleet, the US Navy has nine amphibious assault ships used primarily for helicopters ; these can also carry up to 25 fighter jets, and in some cases, are as large as some other nations' fixed-wing carriers.", "title": "Aircraft carrier"}