{"summary": "Airships are kind of aircraft.", "full_text": "An airship or dirigible is a type of aerostat or lighter-than-air aircraft that can navigate through the air under its own power. Aerostats gain their lift from large gas bags filled with a lifting gas that is less dense than the surrounding air.\n\nIn early dirigibles, the lifting gas used was hydrogen, due to its high lifting capacity and ready availability. Helium gas has almost the same lifting capacity and is not flammable, unlike hydrogen, but is rare and relatively expensive. Significant amounts were first discovered in the United States and for a while helium was only used for airships by the United States. Most airships built since the 1960s have used helium, though some have used hot air.\nThe envelope of an airship may form a single gas bag, or may contain a number of internal gas-filled cells. An airship also has engines and crew and/or payload accommodation, typically housed in one or more \"gondolas\" suspended below the envelope.\nThe main types of airship are non-rigid, semi-rigid, and rigid. Non-rigid airships, often called \"blimps\", rely on internal pressure to maintain the shape of the airship. Semi-rigid airships maintain the envelope shape by internal pressure, but have some form of supporting structure, such as a fixed keel, attached to it. Rigid airships have an outer structural framework which maintains the shape and carries all structural loads, while the lifting gas is contained in one or more internal gas bags or cells. Rigid airships were first flown by Count Zeppelin and the vast majority of rigid airships built were manufactured by the firm he founded. As a result, all rigid airships are sometimes called zeppelins.\nAirships were the first aircraft capable of controlled powered flight, and were most commonly used before the 1940s, but their use decreased over time as their capabilities were surpassed by those of aeroplanes. Their decline was accelerated by a series of high-profile accidents, including the 1930 crash and burning of British R101 in France, the 1933 storm-related crash of the USS Akron and the 1937 burning of the hydrogen-filled Hindenburg. From the 1960s, helium airships have been used in applications where the ability to hover in one place for an extended period outweighs the need for speed and manoeuvrability such as advertising, tourism, camera platforms, geological surveys, and aerial observation.\n^ Merriam webster airship term\n^ \"Discovery of Helium in Natural Gas at the University of Kansas\". National Historic Chemical Landmarks. American Chemical Society. Retrieved 2014-02-21. \n^ \n^ Mowthorpe, C. E. S. Battlebags, British Airships of the First World War, Phoenix Mill, United Kingdom. Alan Sutton Publishing, 1995, p. xx. ISBN 0-7509-0989-7", "title": "Airship"}