{"summary": "Alabama is a state in the United States.", "full_text": "Alabama  is a state located in the southeastern region of the United States. It is bordered by Tennessee to the north, Georgia to the east, Florida and the Gulf of Mexico to the south, and Mississippi to the west. Alabama is the 30th-most extensive and the 23rd-most populous of the 50 United States. At 1,300 miles , Alabama has one of the longest navigable inland waterways in the nation.\nFrom the American Civil War until World War II, Alabama, like many Southern states, suffered economic hardship, in part because of continued dependence on agriculture. Despite the growth of major industries and urban centers, White rural interests dominated the state legislature from 1901 to the 1960s, as it did not regularly reapportion the legislature from 1901 to 1961; urban interests and African Americans were markedly under-represented. African Americans and poor whites were essentially disenfranchised altogether by the state constitution of 1901, a status that continued into the mid-1960s before being alleviated by federal legislation. Exclusion of minorities continued under at-large voting systems in most counties; some changes were made through a series of omnibus court cases in the late 1980s to establish different electoral systems.\nFollowing World War II, Alabama experienced growth as the economy of the state changed from one primarily based on agriculture to one with diversified interests. The power of the Solid South in Congress gained the establishment or expansion of multiple United States Armed Forces installations, which helped to bridge the gap between an agricultural and industrial economy during the mid-20th century. The state economy in the 21st century is based on management, automotive, finance, manufacturing, aerospace, mineral extraction, healthcare, education, retail, and technology.\nAlabama is nicknamed the Yellowhammer State, after the state bird. Alabama is also known as the \"Heart of Dixie\" and the Cotton State. The state tree is the longleaf pine, and the state flower is the camellia. The capital of Alabama is Montgomery. The largest city by population is Birmingham, which has long been the most industrialized city, and largest city by total land area is Huntsville. The oldest city is Mobile, founded by French colonists.\n\n", "title": "Alabama"}