{"summary": "Albania  is an independent republic in Southeastern Europe, with an area of 28,748 square kilometres .", "full_text": "Albania , officially known as the Republic of Albania , is a country in Southeastern Europe. It is bordered by Montenegro to the northwest, Kosovo to the northeast, the Republic of Macedonia to the east, and Greece to the south and southeast. It has a coast on the Adriatic Sea to the west and on the Ionian Sea to the southwest. It is less than 72 km  from Italy, across the Strait of Otranto which connects the Adriatic Sea to the Ionian Sea.\nAlbania is a member of the United Nations, NATO, the Organization for Security and Co-operation in Europe, the Council of Europe and the World Trade Organization. It is one of the founding members of the Energy Community, Organization of the Black Sea Economic Cooperation and the Union for the Mediterranean. It is also an official candidate for membership in the European Union.\nThe modern-day territory of Albania was at various points in history part of the Roman provinces of Dalmatia , Macedonia , and Moesia Superior. The modern Republic became independent after the collapse of the Ottoman Empire in Europe following the Balkan Wars. Albania declared independence in 1912 and was recognized the following year. It then became a Principality, Republic, and Kingdom until being invaded by Italy in 1939, which formed Greater Albania. The latter eventually turned into a Nazi German protectorate in 1943. The following year, a socialist People's Republic was established under the leadership of Enver Hoxha and the Party of Labour. Albania experienced widespread social and political transformations during the communist era, as well as isolationism from much of the international community. In 1991, the Socialist Republic was dissolved and the Republic of Albania was established.\nAlbania is a parliamentary republic. As of 2011, the capital, Tirana, was home to 421,286 of the country's 2,893,005 people within the city limits, 763,634 in the metropolitan area. Tirana is also the financial capital of the country. Free-market reforms have opened the country to foreign investment, especially in the development of energy and transportation infrastructure. Albania has a high HDI and provides a universal health care system and free primary and secondary education. Albania is an upper-middle income economy  with the service sector dominating the country's economy, followed by the industrial sector and agriculture.", "title": "Albania"}