{"summary": "Alec Douglas-Home  was Prime Minister of the United Kingdom from 1963 to 1964.", "full_text": "Alexander Frederick Douglas-Home, Baron Home of the Hirsel KT PC  was a British Conservative politician who served as Prime Minister from October 1963 to October 1964. He is notable for being the last Prime Minister to hold office while being a member of the House of Lords, before renouncing his peerage and taking up a seat in the House of Commons for the remainder of his premiership. His reputation, however, rests more on his two spells as the UK's foreign secretary than on his brief premiership.\nWithin six years of first entering the House of Commons in 1931, Douglas-Home  became parliamentary aide to Neville Chamberlain, witnessing at first hand Chamberlain's efforts as Prime Minister to preserve peace through appeasement in the two years before the outbreak of the Second World War. In 1940 Dunglass was diagnosed with spinal tuberculosis and was immobilised for two years. By the later stages of the war he had recovered enough to resume his political career, but lost his seat in the general election of 1945. He regained it in 1950, but the following year he left the Commons when, on the death of his father, he inherited the earldom of Home and thereby became a member of the House of Lords. Under the premierships of Winston Churchill, Anthony Eden and Harold Macmillan he was appointed to a series of increasingly senior posts, including Leader of the House of Lords and Foreign Secretary. In the latter post, which he held from 1960 to 1963, he supported United States resolve in the Cuban Missile Crisis and was the United Kingdom's signatory of the Partial Nuclear Test Ban Treaty in August 1963.\nIn October 1963 Macmillan was taken ill and resigned as Prime Minister. Home was chosen to succeed him. By the 1960s it was generally considered unacceptable for a Prime Minister to sit in the House of Lords, and Home renounced his earldom and successfully stood for election to the House of Commons. The manner of his appointment was controversial, and two of Macmillan's cabinet ministers refused to take office under him. He was criticised by the Labour Party as an aristocrat, out of touch with the problems of ordinary families, and he came over stiffly in television interviews, by contrast with the Labour leader, Harold Wilson. The Conservative Party, in office since 1951, had lost standing as a result of the Profumo affair, a sexual scandal involving a defence minister in 1963, and at the time of Home's appointment as Prime Minister seemed headed for heavy electoral defeat. Home's premiership was the second briefest of the twentieth century, lasting two days short of a year. Among the legislation passed under his government was the abolition of resale price maintenance, bringing costs down for the consumer against the interests of producers of food and other commodities.\nAfter narrow defeat in the general election of 1964 Douglas-Home resigned the leadership of his party, having instituted a new and less secretive method of electing the party leader. From 1970 to 1974 he served in the cabinet of Edward Heath as Secretary of State at the Foreign and Commonwealth Office, an expanded version of the post of Foreign Secretary, which he had held earlier. After the defeat of the Heath government in 1974 he returned to the House of Lords as a life peer, and retired from front-line politics.", "title": "Alec Douglas-Home"}