{"summary": "Alexander Valterovich Litvinenko  was a lieutenant-colonel in the Russian Security Service.", "full_text": "Alexander Valterovich Litvinenko  was a fugitive officer of the Russian FSB secret service, who specialised in tackling organised crime. In November 1998, Litvinenko and several other FSB officers publicly accused their superiors of ordering the assassination of the Russian tycoon and oligarch Boris Berezovsky. Litvinenko was arrested the following March on charges of exceeding the authority of his position. He was acquitted in November 1999 but re-arrested before the charges were again dismissed in 2000. He fled with his family to London and was granted asylum in the United Kingdom, where he worked as a journalist, writer and consultant for the British intelligence services.\nDuring his time in London, Litvinenko wrote two books, Blowing Up Russia: Terror from Within and Lubyanka Criminal Group, wherein he accused the Russian secret services of staging the Russian apartment bombings and other terrorism acts in an effort to bring Vladimir Putin to power. He also accused Putin of ordering the murder in October 2006 of the Russian journalist Anna Politkovskaya.\nOn 1 November 2006, Litvinenko suddenly fell ill and was hospitalised in what was established as a case of poisoning by radioactive polonium-210 which resulted in his death on 23 November. He became the first known victim of lethal Polonium 210-induced acute radiation syndrome. The events leading up to this are a matter of controversy, spawning numerous theories relating to his poisoning and death. A British murder investigation pointed to Andrey Lugovoy, a member of Russia's Federal Protective Service, as the prime suspect. Britain demanded that Lugovoy be extradited, which is against the Constitution of Russia, which directly prohibits extradition of Russian citizens without handing Russia any evidence related to the case. Russia denied the extradition, leading to the cooling of relations between Russia and the United Kingdom.\nAfter Litvinenko's death, his widow, Marina, pursued a vigorous campaign on behalf of her husband through the Litvinenko Justice Foundation. In October 2011, she won the right for an inquest into her husband's death to be conducted by a coroner in London; the inquest was repeatedly set back by issues relating to examinable evidence. A public enquiry began on 27 January 2015.", "title": "Alexander Litvinenko"}