{"summary": "Alice in Chains is a popular alternative rock band that formed in Seattle, Washington in 1987. They have sold an estimated 15 million albums in the US alone.", "full_text": "Alice in Chains is an American rock band formed in Seattle, Washington, in 1987 by guitarist and songwriter Jerry Cantrell and original lead vocalist Layne Staley. The initial lineup was rounded out by drummer Sean Kinney and bassist Mike Starr, who was replaced in 1993 by Mike Inez.\nAlthough widely associated with grunge music, the band's sound incorporates heavy metal elements. Since its formation, Alice in Chains has released five studio albums, three EPs, two live albums, four compilations, and two DVDs. The band is known for its distinctive vocal style, which often included the harmonized vocals of Staley and Cantrell.\nAlice in Chains rose to international fame as part of the grunge movement of the early 1990s, along with other Seattle bands such as Nirvana, Pearl Jam, and Soundgarden. The band was one of the most successful music acts of the 1990s, selling over 20 million albums worldwide, and over 14 million in the US alone. In 1992 the band's second album, Dirt, was released to critical acclaim and was certified quadruple platinum. Their third album, Alice in Chains, was released in 1995 and has been certified double platinum. Both albums achieved No. 1 Billboard 200 releases. The band has had 14 top ten songs on the Mainstream Rock Tracks chart and nine Grammy Award nominations.\nAlthough never officially disbanding, Alice in Chains was plagued by extended inactivity from 1996 onwards due to Staley's substance abuse, which resulted in his death in 2002. The band reunited in 2005 for a live benefit show, performing with a number of guest vocalists. They toured in 2006, with William DuVall taking over as lead vocalist full-time. The new line-up released the band's fourth studio album, Black Gives Way to Blue, in 2009. The album received gold certification by the RIAA. In 2013, the band released The Devil Put Dinosaurs Here, its fifth studio album. The band has toured extensively and released several videos in support of these albums. Alice in Chains is currently working on their sixth studio album.", "title": "Alice in Chains"}