{"summary": "National Public Radio  is a free media organization.", "full_text": "All Things Considered  is the flagship news program on the American network National Public Radio . It was the first news program on NPR, premiering on May 3, 1971. It is broadcast live on NPR affiliated stations in the United States, and worldwide through several different outlets. All Things Considered and Morning Edition were the highest rated public radio programs in the United States in 2002 and 2005. The show combines news, analysis, commentary, interviews, and special features, and its segments vary in length and style. ATC airs weekdays from 4:00 p.m. to 6:00 p.m. Eastern Standard Time. A weekend version of ATC, Weekends On All Things Considered, airs on Saturdays and Sundays.\n^ \"NPR Worldwide\". National Public Radio. Retrieved 2007-03-06. \n^ Freedman, Samuel G. . \"'Listener Supported' and 'NPR': All Things Considered\". Books. The New York Times . National Public Radio alone reaches more than 20 million listeners, and its daily newsmagazine shows, All Things Considered and Morning Edition, attract a larger audience than any program except Rush Limbaugh's. \n^ \"NPR Programs Attract Record-Breaking Audiences Public Radio Listenership at All-Time High\". National Public Radio . 19 March 2002. Archived from the original on 2008-12-24. Reflective of the intense news cycle following the September 11 terrorist attacks on the U.S., NPR's newsmagazines and talk programs increased audiences across the board. From Fall 2000 to Fall 2001, Morning Edition with Bob Edwards jumped from 10.7 to 13 million listeners; All Things Considered grew from 9.8 million to nearly 11.9 million; Talk of the Nation rocketed 40.8 percent to 3 million listeners; Fresh Air with Terry Gross grew 25.4 percent to nearly 4.2 million and The Diane Rehm Show grew 38.6 percent to nearly 1.4 million. Growth in the NPR news/talk audience outpaced similar gains realized by commercial news/talk radio.", "title": "All Things Considered"}