{"summary": "Native Americans  are the people, and their descendants, who were in North America, Central America, South America, and the Caribbean Islands when Europeans arrived.", "full_text": "In the United States, Native Americans are considered to be people whose pre-Columbian ancestors were indigenous to the lands within the nation's modern boundaries. These peoples were composed of numerous distinct tribes, bands, and ethnic groups, and many of these groups survive intact today as sovereign nations. The terms Native Americans use to refer to themselves vary regionally and generationally, with many older Native Americans self-identifying as \"Indians\" or \"American Indians\", while younger Native Americans often identify as \"Indigenous\". Which terms should be used to refer to Native Americans has at times been controversial. The term \"Native American\" has been adopted by major newspapers and some academic groups, but has not traditionally included Native Hawaiians or certain Alaskan Natives, such as Aleut, Yup'ik, or Inuit peoples. Indigenous American peoples from Canada are known as First Nations.\nSince the end of the 15th century, the migration of Europeans to the Americas has led to centuries of exchange and adjustment between Old and New World societies. Most Native American groups had historically lived as hunter-gatherer societies and preserved their histories by oral traditions and artwork, which has resulted in the first written sources on the conflict being authored by Europeans.\nAt the time of first contact, the indigenous cultures were quite different from those of the proto-industrial and mostly Christian immigrants. Some of the Northeastern and Southwestern cultures in particular were matrilineal and operated on a more collective basis than the Europeans were familiar with. The majority of Indigenous American tribes maintained their hunting grounds and agricultural lands for use of the entire tribe. Europeans at that time had patriarchal cultures and had developed concepts of individual property rights with respect to land that were extremely different. The differences in cultures between the established Native Americans and immigrant Europeans, as well as shifting alliances among different nations in times of war, caused extensive political tension, ethnic violence, and social disruption. Even before the European settlement of what is now the United States, Native Americans suffered high fatalities from contact with European diseases spread throughout the Americas by the Spanish to which they had yet not acquired immunity. Smallpox epidemics are thought to have caused the greatest loss of life for indigenous populations, although estimates of the pre-Columbian population of what today constitutes the U.S. vary significantly, from 1 million to 18 million.\nAfter the thirteen colonies revolted against Great Britain and established the United States of America, President George Washington and Henry Knox conceived of the idea of \"civilizing\" Native Americans in preparation for assimilation as U.S. citizens. Assimilation  became a consistent policy through American administrations. During the 19th century, the ideology of manifest destiny became integral to the American nationalist movement. Expansion of European-American populations to the west after the American Revolution resulted in increasing pressure on Native American lands, warfare between the groups, and rising tensions. In 1830, the U.S. Congress passed the Indian Removal Act, authorizing the government to relocate Native Americans from their homelands within established states to lands west of the Mississippi River, accommodating European-American expansion. This resulted in the ethnic cleansing of many tribes, with the brutal, forced marches coming to be known as The Trail of Tears.\nAs American expansion reached into the West, settler and miner migrants came into increasing conflict with the Great Basin, Great Plains, and other Western tribes. These were complex nomadic cultures based on  horse culture and seasonal bison hunting. They carried out resistance against United States incursion in the decades after the completion of the Civil War and the Transcontinental Railroad in a series of Indian Wars, which were frequent up until the 1890s but continued into the 20th century. Over time, the United States forced a series of treaties and land cessions by the tribes and established reservations for them in many western states. U.S. agents encouraged Native Americans to adopt European-style farming and similar pursuits, but European-American agricultural technology of the time was inadequate for often dry reservation lands, leading to mass starvation. In 1924, Native Americans who were not already U.S. citizens were granted citizenship by Congress.\nContemporary Native Americans have a unique relationship with the United States because they may be members of nations, tribes, or bands with sovereignty and treaty rights. Cultural activism since the late 1960s has increased political participation and led to an expansion of efforts to teach and preserve Indigenous languages for younger generations and to establish a greater cultural infrastructure: Native Americans have founded independent newspapers and online media, recently including FNX, the first Native American television channel; established Native American studies programs, tribal schools and universities, and museums and language programs; and have increasingly been published as authors.", "title": "American Indian"}