{"summary": "American Football  is a team sport.", "full_text": "American football  is a sport played by two teams of eleven players on a rectangular field with goalposts at each end. The offense, the team with control of the oval-shaped football, attempts to advance down the field by running with or passing the ball, while the team without control of the ball, the defense, aims to stop their advance and take control of the ball for themselves. The offense must advance at least ten yards in four downs, or plays, or else they turn over the football to the opposing team; if they succeed, they are given a new set of four downs. Points are primarily scored by advancing the ball into the opposing team's end zone for a touchdown or kicking the ball through the opponent's goalposts for a field goal. The team with the most points at the end of a game wins.\nAmerican football evolved in the United States, originating from the sport of rugby football. The first game of American football was played on November 6, 1869, between two college teams, Rutgers and Princeton, under rules based on the association football rules of the time. During the latter half of the 1870s, colleges playing association football switched to the Rugby code, which allowed carrying the ball. A set of rule changes drawn up from 1880 onward by Walter Camp, the \"Father of American Football,\" established the snap, eleven-player teams, and the concept of downs; later rule changes legalized the forward pass, created the neutral zone, and specified the size and shape of the football.\nAmerican football as a whole is the most popular sport in the United States; professional football and college football are the most popular forms of the game, with the other major levels being high school and youth football. As of 2012, nearly 1.1 million high school athletes and 70,000 college athletes play the sport in the United States annually. The National Football League, the most popular American football league, has the highest average attendance of any sports league in the world; its championship game, the Super Bowl, ranks among the most-watched club sporting events in the world, and the league has an annual revenue of around US$10 billion.", "title": "American football"}