{"summary": "Amphetamine is a synthetic drug.", "full_text": "Amphetamine  is a potent central nervous system  stimulant that is used in the treatment of attention deficit hyperactivity disorder , narcolepsy, and obesity. Amphetamine was discovered in 1887 and exists as two enantiomers: levoamphetamine and dextroamphetamine. Amphetamine properly refers to a specific chemical, the racemic free base, which is equal parts of the two enantiomers, levoamphetamine and dextroamphetamine, in their pure amine forms. However, the term is frequently used informally to refer to any combination of the enantiomers, or to either of them alone. Historically, it has been used to treat nasal congestion, depression, and obesity. Amphetamine is also used as a performance and cognitive enhancer, and recreationally as an aphrodisiac and euphoriant. It is a prescription medication in many countries, and unauthorized possession and distribution of amphetamine are often tightly controlled due to the significant health risks associated with recreational use.\nThe first pharmaceutical amphetamine was Benzedrine, a brand of inhalers used to treat a variety of conditions. Currently, pharmaceutical amphetamine is prescribed as racemic amphetamine, Adderall, dextroamphetamine, or the inactive prodrug lisdexamfetamine. Amphetamine, through activation of a trace amine receptor, increases biogenic amine and excitatory neurotransmitter activity in the brain, with its most pronounced effects targeting the catecholamine neurotransmitters norepinephrine and dopamine. At therapeutic doses, this causes emotional and cognitive effects such as euphoria, change in libido, increased wakefulness, and improved cognitive control. It induces physical effects such as decreased reaction time, fatigue resistance, and increased muscle strength.\nMuch larger doses of amphetamine may impair cognitive function and induce rapid muscle breakdown. Drug addiction is a serious risk with large recreational doses, but rarely arises from medical use. Very high doses can result in psychosis  which rarely occurs at therapeutic doses even during long-term use. Recreational doses are generally much larger than prescribed therapeutic doses and carry a far greater risk of serious side effects.\nAmphetamine belongs to the phenethylamine class. It is also the parent compound of its own structural class, the substituted amphetamines, which includes prominent substances such as bupropion, cathinone, MDMA , and methamphetamine. As a member of the phenethylamine class, amphetamine is also chemically related to the naturally occurring trace amine neuromodulators, specifically phenethylamine and N-methylphenethylamine, both of which are produced within the human body. Phenethylamine is the parent compound of amphetamine, while N-methylphenethylamine is a constitutional isomer that differs only in the placement of the methyl group.", "title": "Amphetamine"}