{"summary": "Amphibians are members of the class Amphibia.", "full_text": "Amphibians are ectothermic, tetrapod vertebrates of the class Amphibia. Modern amphibians are all Lissamphibia. They inhabit a wide variety of habitats with most species living within terrestrial, fossorial, arboreal or freshwater aquatic ecosystems. Amphibians typically start out as larvae living in water, but some species have developed behavioural adaptations to bypass this. The young generally undergo metamorphosis from larva with gills to an adult air-breathing form with lungs. Amphibians use their skin as a secondary respiratory surface and some small terrestrial salamanders and frogs lack lungs and rely entirely on their skin. They are superficially similar to reptiles but, along with mammals and birds, reptiles are amniotes and do not require water bodies in which to breed. With their complex reproductive needs and permeable skins, amphibians are often ecological indicators and in recent decades there has been a dramatic decline in amphibian populations for many species around the globe.\nThe earliest amphibians evolved in the Devonian period from sarcopterygian fish with lungs and bony-limbed fins, features that were helpful in adapting to dry land. They diversified and became dominant during the Carboniferous and Permian periods, but were later displaced by reptiles and other vertebrates. Over time, amphibians shrank in size and decreased in diversity, leaving only the modern subclass Lissamphibia. The three modern orders of amphibians are Anura , Urodela , and Apoda . The number of known amphibian species is approximately 7,000, of which nearly 90% are frogs. The smallest amphibian  in the world is a frog from New Guinea  with a length of just 7.7 mm . The largest living amphibian is the 1.8 m  Chinese giant salamander , but this is dwarfed by the extinct 9 m  Prionosuchus from the middle Permian of Brazil. The study of amphibians is called batrachology, while the study of both reptiles and amphibians is called herpetology.\n^", "title": "Amphibians"}