{"summary": "Ancient history is all the events we know about since the invention of writing.", "full_text": "Ancient history is the aggregate of past events from the beginning of recorded human history and extending as far as the Early Middle Ages or the Postclassical Era. The span of recorded history is roughly 5,000 years, beginning with Sumerian Cuneiform script, the oldest discovered form of coherent writing from the protoliterate period around the 30th century BC.\nThe term classical antiquity is often used to refer to history in the Old World from the beginning of recorded Greek history in 776 BC . This roughly coincides with the traditional date of the founding of Rome in 753 BC, the beginning of the history of ancient Rome, and the beginning of the Archaic period in Ancient Greece. Although the ending date of ancient history is disputed, some Western scholars use the fall of the Western Roman Empire in 476 AD , the closure of the Platonic Academy in 529 AD, the death of the emperor Justinian I in 565 AD, the coming of Islam or the rise of Charlemagne as the end of ancient and Classical European history.\nIn India, ancient history includes the early period of the Middle Kingdoms, and, in China, the time up to the Qin Dynasty.\n^ WordNet Search - 3.0, \"History\"\n^ see Jemdet Nasr period, Kish tablet; see also The Origin and Development of the Cuneiform System of Writing, Samuel Noah Kramer, Thirty Nine Firsts In Recorded History, pp 381-383\n^ Clare, I. S. . Library of universal history: containing a record of the human race from the earliest historical period to the present time; embracing a general survey of the progress of mankind in national and social life, civil government, religion, literature, science and art. New York: Union Book. Page 1519 \n^ United Center for Research and Training in History. . Bulgarian historical review. Sofia: Pub. House of the Bulgarian Academy of Sciences. Page 43. \n^ Hadas, Moses . A History of Greek Literature. Columbia University Press. p. 327. ISBN 0-231-01767-7. \n^ Robinson, C. A. . Ancient history from prehistoric times to the death of Justinian. New York: Macmillan.\n^ Breasted, J. H. . Ancient times, a history of the early world: an introduction to the study of ancient history and the career of early man. Boston: Ginn and Company.\n^ Myers, P. V. N. . Ancient history. New York : Ginn and company.\n^ Elphinstone, M. . The history of India. London: Murray.\n^ Smith, V. A. . The early history of India from 600 B.C. to the Muhammadan conquest, including the invasion of Alexander the Great. Oxford: Clarendon Press.\n^ Hoernle, A. F. R., & Stark, H. A. . A history of India. Cuttack: Orissa mission Press.\n^ Foster, S. . Adventure guide. China. Hunter travel guides. Edison, NJ: Hunter Publishing. Page 6-7 \n^ Gernet, J. . A history of Chinese civilization. Cambridge: Cambridge University Press.", "title": "Ancient history"}