{"summary": "Ancient China  is a very old civilization.", "full_text": "Written records of the history of China can be found from as early as 1500 BC  under the Shang dynasty . Ancient historical texts such as the Records of the Grand Historian  and the Bamboo Annals describe a Xia dynasty , which had no system of writing on a durable medium, before the Shang. The Yellow River is said to be the cradle of Chinese civilization, although cultures originated at various regional centers along both the Yellow River and the Yangtze River valleys millennia ago in the Neolithic era. With thousands of years of continuous history, China is one of the world's oldest civilizations.\nMuch of Chinese culture, literature and philosophy further developed during the Zhou dynasty . The Zhou dynasty began to bow to external and internal pressures in the 8th century BC, and the kingdom eventually broke apart into smaller states, beginning in the Spring and Autumn period and reaching full expression in the Warring States period. This is one of multiple periods of failed statehood in Chinese history, the most recent being the Chinese Civil War that started in 1927.\nBetween eras of multiple kingdoms and warlordism, Chinese dynasties have ruled parts or all of China; in some eras control stretched as far as Xinjiang and Tibet, as at present. In 221 BC Qin Shi Huang united the various warring kingdoms and created for himself the title of \"emperor\"  of the Qin dynasty, marking the beginning of imperial China. Successive dynasties developed bureaucratic systems that enabled the emperor to control vast territories directly. China's last dynasty was the Qing , which was replaced by the Republic of China in 1912, and in the mainland by the People's Republic of China in 1949.\nThe conventional view of Chinese history is that of alternating periods of political unity and disunity, with China occasionally being dominated by steppe peoples, most of whom were in turn assimilated into the Han Chinese population. Cultural and political influences from other parts of Asia and the Western world, carried by successive waves of immigration, expansion, foreign contact, and cultural assimilation are part of the modern culture of China.", "title": "Ancient China"}