{"summary": "Andrew Jackson  was a General in the War of 1812 and was considered to be a war hero.", "full_text": "Andrew Jackson  was the seventh President of the United States . He was born near the end of the colonial era, somewhere near the then-unmarked border between North and South Carolina, into a recently immigrated Scots-Irish farming family of relatively modest means. During the American Revolutionary War Jackson, whose family supported the revolutionary cause, acted as a courier. He was captured, at age 13, and mistreated by his British captors. He later became a lawyer. He was elected to the U.S. House of Representatives, and then to the U.S. Senate. In 1801, Jackson was appointed colonel in the Tennessee militia, which became his political as well as military base. Jackson owned hundreds of slaves who worked on the Hermitage plantation which he acquired in 1804. He killed a man in a duel in 1806, over a matter of honor regarding his wife Rachel. Jackson gained national fame through his role in the War of 1812, most famously where he won a decisive victory over the main British invasion army at the Battle of New Orleans. Jackson's army was then sent to Florida where he deposed the small Spanish garrison. This led directly to the treaty which formally transferred Florida from Spain to the United States.\nNominated for president in 1824, Jackson narrowly lost to John Quincy Adams. Jackson's supporters then founded what became the Democratic Party. Nominated again in 1828, Jackson crusaded against Adams and the \"corrupt bargain\" between Adams and Henry Clay he said cost him the 1824 election. Building on his base in the West and new support from Virginia and New York, he won by a landslide. The Adams campaigners called him and his wife Rachel Jackson \"bigamists\"; she died just after the election and he called the slanderers \"murderers,\" swearing never to forgive them. His struggles with Congress were personified in his personal rivalry with Henry Clay, whom Jackson deeply disliked, and who led the opposition . As president, he faced a threat of secession from South Carolina over the \"Tariff of Abominations\" which Congress had enacted under Adams. In contrast to several of his immediate successors, he denied the right of a state to secede from the union, or to nullify federal law. The Nullification Crisis was defused when the tariff was amended and Jackson threatened the use of military force if South Carolina  attempted to secede.\nCongress attempted to reauthorize the Second Bank of the United States several years before the expiration of its charter, which he opposed. He vetoed the renewal of its charter in 1832, and dismantled it by the time its charter expired in 1836. Jackson's presidency marked the beginning of the ascendancy of the \"spoils system\" in American politics. Also, he supported, signed, and enforced the Indian Removal Act, which relocated a number of native tribes to Indian Territory . He faced and defeated Henry Clay in the 1832 Presidential Election, and opposed Clay generally. Jackson supported his vice president Martin Van Buren, who was elected president in 1836. He worked to bolster the Democratic Party and helped his friend James K. Polk win the 1844 presidential election.", "title": "Andrew Jackson"}