{"summary": "The Church of England is the leading Christian church in England.", "full_text": "The Anglican Communion is an international association of churches consisting of the Church of England and of national and regional Anglican churches in full communion with it. The status of full communion means, ideally, that there is mutual agreement on essential doctrines and that full participation in the sacramental life of each church is available to all communicant Anglicans.\nThe Archbishop of Canterbury, Primate of All England, has a precedence of honour over the other bishops of the Anglican Communion. He is recognized as primus inter pares, or first among equals. The archbishop does not exercise direct authority in the provinces outside England, but instead acts as a focus of unity.\nThe Anglican Communion considers itself to be part of the One, Holy, Catholic and Apostolic Church and to be both Catholic and Reformed. For some adherents it represents a non-papal Catholicism, for others a form of Protestantism though without a dominant guiding figure such as Luther, Knox, Calvin, Zwingli or Wesley. For others, their self-identity represents some combination of the two. The communion encompasses a wide spectrum of belief and practice including evangelical, liberal and Catholic.\nWith a membership currently at 85 million members worldwide, the Anglican Communion is the third largest Christian communion in the world, after the Roman Catholic Church and the Eastern Orthodox Church. Some of these churches are known as Anglican, such as the Anglican Church of Canada, due to their historical link to England . Some, for example the Church of Ireland, the Scottish and American Episcopal churches, and some other associated churches have a separate name. Each church has its own doctrine and liturgy, based in most cases on that of the Church of England; and each church has its own legislative process and overall episcopal polity, under the leadership of a local primate.", "title": "Anglican Church"}