{"summary": "The Anglo-Saxons were the dominant people living in England from the mid-5th century AD until the Norman conquest in 1066. Some Anglo-Saxons came to Britain to fight, but others came peacefully, to find land to farm.", "full_text": "The Anglo-Saxons were a people who inhabited Great Britain from the 5th century. They comprised people from Germanic tribes who migrated to the island from continental Europe, their descendants, and indigenous British groups who adopted some aspects of Anglo-Saxon culture and language. The Anglo-Saxon period denotes the period of British history between about 450 and 1066, after their initial settlement, and up until the Norman conquest.\nThe Anglo-Saxon period includes the creation of an English nation, with many of the aspects that survive today including regional government of shires and hundreds; the re-establishment of Christianity; a flowering in literature and language; and the establishment of charters and law. The term Anglo-Saxon is also popularly used for the language, in scholarly use more usually called Old English, that was spoken and written by the Anglo-Saxons in England and eastern Scotland between at least the mid-5th century and the mid-12th century.\nThe history of the Anglo-Saxons is the history of a cultural identity, and how this developed from divergent groups, grew with the adoption of Christianity, was used in the establishment of various kingdoms, and, in the face of a threat from Danish settlers, re-established itself as one identity until after the Norman Conquest. The outward appearance of Anglo-Saxon culture can be seen in the material culture of buildings, dress styles, illuminated texts and grave goods. Behind the symbolic nature of these cultural emblems there are strong elements of tribal and lordship ties, and an elite that became kings who developed burhs, and saw themselves and their people in Biblical terms. Above all, as Helena Hamerow has observed, \"local and extended kin groups remained...the essential unit of production throughout the Anglo-Saxon period\". The effects persist even in the 21st century as according to a study published in March 2015, the genetic make up of British populations today shows traces of the political units in the early Anglo-Saxon period.\nUse of the term Anglo-Saxon assumes that the words Angles, Saxons or Anglo-Saxon have the same meaning in all the sources. Assigning ethnic labels such as \"Anglo-Saxon\" is fraught with difficulties, and the term itself only began to be used in the 8th century to distinguish \"Germanic\" groups in Britain from those on the continent. Catherine Hills summarised the views of many modern scholars that attitudes towards Anglo-Saxons and hence the interpretation of their culture and history have been \"more contingent on contemporary political and religious theology as on any kind of evidence.\"", "title": "Anglo-Saxon"}