{"summary": "Anne Hutchinson , was a religious dissenter in Puritan New England.", "full_text": "Anne Hutchinson, born Anne Marbury , was a Puritan spiritual adviser, mother of 15, and an important participant in the Antinomian Controversy that shook the infant Massachusetts Bay Colony from 1636 to 1638. Her strong religious convictions were at odds with the established Puritan clergy in the Boston area, and her popularity and charisma helped create a theological schism that threatened to destroy the Puritans' religious experiment in New England. She was eventually tried and convicted, then banished from the colony with many of her supporters.\nBorn in Alford, Lincolnshire, England, Anne was the daughter of Francis Marbury, an Anglican cleric and school teacher who gave her a far better education than most other girls received. She lived in London as a young adult, and married there an old friend from home, William Hutchinson. The couple moved back to Alford, where they began following the dynamic preacher named John Cotton in the nearby major port of Boston, Lincolnshire. After Cotton was compelled to emigrate in 1633, the Hutchinsons followed a year later with their 11 children, and soon became well established in the growing settlement of Boston in New England. Anne was a midwife, and very helpful to those needing her assistance, as well as forthcoming with her personal religious understandings. Soon she was hosting women at her house weekly, providing commentary on recent sermons. These meetings became so popular that she began offering meetings for men as well, including the young governor of the colony, Henry Vane.\nAs a follower of Cotton, she espoused a \"covenant of grace,\" while accusing all of the local ministers  of preaching a \"covenant of works.\" Following complaints of many ministers about the opinions coming from Hutchinson and her allies, the situation erupted into what is commonly called the Antinomian Controversy, resulting in her 1637 trial, conviction, and banishment from the colony. This was followed by a March 1638 church trial in which she was excommunicated. With encouragement from Providence founder Roger Williams, Hutchinson and many of her supporters established the settlement of Portsmouth in what became the Colony of Rhode Island and Providence Plantations. After her husband's death a few years later, threats of Massachusetts taking over Rhode Island compelled Hutchinson to move totally outside the reach of Boston, into the lands of the Dutch. While five of her older surviving children remained in New England or in England, she settled with her younger children near an ancient landmark called Split Rock in what later became The Bronx in New York City. Tensions with the native Siwanoy were high at the time. In August 1643, during Kieft's War, Hutchinson, six of her children, and other household members were massacred during an attack. The only survivor was her nine-year-old daughter, Susanna, who was taken captive.\nHutchinson is a key figure in the development of religious freedom in England's American colonies and the history of women in ministry. She challenged the authority of the ministers, exposing the subordination of women in the culture of colonial Massachusetts. She is honoured by Massachusetts with a State House monument calling her a \"courageous exponent of civil liberty and religious toleration.\" She has been called the most famous, or infamous, English woman in colonial American history.", "title": "Anne Hutchinson"}