{"summary": "Many people who are anti-nuclear, are against the use of nuclear power for electricity generation, since they think nuclear power is dangerous.", "full_text": "The anti-nuclear movement is a social movement that opposes various nuclear technologies. Some direct action groups, environmental groups, and professional organisations have identified themselves with the movement at the local, national, and international level. Major anti-nuclear groups include Campaign for Nuclear Disarmament, Friends of the Earth, Greenpeace, International Physicians for the Prevention of Nuclear War, and the Nuclear Information and Resource Service. The initial objective of the movement was nuclear disarmament, though since the late 1960s opposition has included the use of nuclear power. Many anti-nuclear groups oppose both nuclear power and nuclear weapons. The formation of green parties in the 1970s and 1980s was arguably a result of anti-nuclear politics.\nWith concerns about climate change and advances in nuclear reactor designs, nuclear power issues has come back into energy policy discussions in some countries. The 2011 Japanese nuclear accidents may have stalled a nuclear power renaissance and revived anti-nuclear passions worldwide. Nonetheless, the need for reliable, baseload, low-carbon electricity has ensured a continuing debate on this matter. As of 2014, a number of countries including Australia, Austria, Denmark, Greece, Ireland, Italy, Latvia, Liechtenstein, Luxembourg, Malta, Portugal, Israel, Malaysia, New Zealand, and Norway have no nuclear power stations. Nuclear energy is being actively debated in Australia. Germany and Switzerland are phasing-out nuclear power although the policy remains controversial. Coal-fired power plants now account for 50% of electricity generation, up from 43% in 2010. Germany recently licensed 26 new coal-fired power plants \nThe Economist says that more nuclear power reactors have closed than opened in recent years.\n^ \n^ Fox Butterfield. Professional Groups Flocking to Antinuclear Drive, The New York Times, March 27, 1982.\n^ William A. Gamson and Andre Modigliani. Media Coverage and Public Opinion on Nuclear Power, American Journal of Sociology, Vol. 95, No. 1, July 1989, p. 7.\n^ John Barry and E. Gene Frankland, International Encyclopedia of Environmental Politics, 2001, p. 24.\n^ \"Japan crisis rouses anti-nuclear passions globally\". Washington Post. March 16, 2011. \n^ \"Business groups want Government to 'get out of the way' of nuclear power\". \n^ https://theconversation.com/nuclear-power-isnt-economically-feasible-in-australia-but-34958\n^ http://www.world-nuclear-news.org/NP-Swiss-want-say-on-nuclear-phase-out-2301144.html\n^ Duroyan Fertl . \"Germany: Nuclear power to be phased out by 2022\". Green Left. \n^ http://www.world-nuclear.org/info/Country-Profiles/Countries-G-N/Germany/\n^ a b \"Difference Engine: The nuke that might have been\". The Economist. Nov 11, 2013. \n^ James Kanter . \"Switzerland Decides on Nuclear Phase-Out\". New York Times.", "title": "Anti-nuclear movement"}