{"summary": "An antigen is a protein expressed by a bacteria or virus that is recognized by the immune system as foreign which can stimulate the production of antibodies and combine specifically with them.", "full_text": "In immunology,TCR or BCR or its secreted form antibody. In simpler terms, an antigen is any substance that causes an immune system to produce antibodies against it. Each antibody is specifically selected after binding to a certain antigen because of random somatic diversification in the antibody complementarity determining regions. A common analogy used to describe this is the fit between a lock and a key.\nIn summary an antigen is a molecule that binds to Ag-specific receptors, but cannot induce an immune response in the body by itself. The term originally described a structural molecule that binds specifically to an antibody. It expanded to refer to any molecule or a linear molecular fragment that can be recognized by highly variable antigen receptors  of the adaptive immune system.\nThe antigen may originate from within the body  or from the external environment . The immune system usually does not react to self-antigens under normal homeostatic conditions due to negative selection of T cells in the thymus and is supposed to identify and attack only \"non-self\" invaders from the outside world or modified/harmful substances present in the body under distressed conditions.\nAntigen presenting cells present antigens in the form of peptides on histocompatibility molecules. The T cells of the adaptive immune system recognize the antigens. Depending on the antigen and the type of the histocompatibility molecule, different types of T cells activate. For T-Cell Receptor  recognition, the peptide must be processed into small fragments inside the cell and presented by a major histocompatibility complex . The antigen cannot elicit the immune response without the help of an Immunologic adjuvant. Similarly, the adjuvant component of vaccines plays an essential role in the activation of the innate immune system.\nAn immunogen is a substance  that is able to provoke a humoral and/or cell-mediated immune response. It first initiates an innate immune response, which causes the activation of the adaptive immune response. An antigen binds the highly variable immunoreceptor products  once these have been generated. All immunogenic molecules are also antigenic, although the reverse is not true.\nAt the molecular level, an antigen can be characterized by its ability to bind to an antibody's variable Fab region. Different antibodies have the potential to discriminate among specific epitopes present on the antigen surface. Hapten is a small molecule that changes the structure of an antigenic epitope. In order to induce an immune response, it has to be attached to a large carrier molecule such as a protein. Antigens are usually proteins and polysaccharides, and less frequently, lipids. This includes parts  of bacteria, viruses, and other microorganisms. Lipids and nucleic acids are antigenic only when combined with proteins and polysaccharides. Non-microbial non-self antigens can include pollen, egg white and proteins from transplanted tissues and organs or on the surface of transfused blood cells. Vaccines are examples of antigens in an immunogenic form, which are intentionally administered to induce the memory function of adaptive immune system toward the antigens of the pathogen invading the recipient.", "title": "Antigen"}