{"summary": "An antibiotic  is something that kills bacteria or slows the growth of bacteria.", "full_text": "Antibiotics or antibacterials are a type of antimicrobial used in the treatment and prevention of bacterial infection. They may either kill or inhibit the growth of bacteria. Several antibiotics are also effective against fungi and protozoans, and some are toxic to humans and animals, even when given in therapeutic dosage. Antibiotics are not effective against viruses such as the common cold or influenza, and may be harmful when taken inappropriately.\nIn 1928, Alexander Fleming identified penicillin, the first chemical compound with antibiotic properties. Fleming was working on a culture of disease-causing bacteria when he noticed the spores of little green mold in one of his culture plates. He observed that the presence of the mold killed or prevented the growth of the bacteria.\nAntibiotics revolutionized medicine in the 20th century, and have together with vaccination led to the near eradication of diseases such as tuberculosis in the developed world. Their effectiveness and easy access led to overuse, especially in livestock raising, prompting bacteria to develop resistance. This has led to widespread problems with antimicrobial and antibiotic resistance, so much as to prompt the World Health Organization to classify antimicrobial resistance as a \"serious threat  is no longer a prediction for the future, it is happening right now in every region of the world and has the potential to affect anyone, of any age, in any country\".\nThe era of antibacterial chemotherapy began with the discovery of arsphenamine, first synthesized by Alfred Bertheim and Paul Ehrlich in 1907, used to treat syphilis. The first systemically active antibacterial drug, prontosil was discovered in 1933 by Gerhard Domagk, for which he was awarded the 1939 Nobel Prize. All classes of antibiotics in use today were first discovered prior to the mid 1980s.\nSometimes the term antibiotic is used to refer to any substance used against microbes, synonymous to antimicrobial, leading to the widespread but incorrect belief that antibiotics can be used against viruses. Some sources distinguish between antibacterial and antibiotic; antibacterials used in soaps and cleaners etc., but not as medicine. This article treats the terms as synonymous and according to the most widespread definition of antibiotics being a substance used against bacteria.", "title": "Antibiotics"}