{"summary": "There is an antiparticle corresponding to most kinds of particle.", "full_text": "Corresponding to most kinds of particles, there is an associated antimatter antiparticle with the same mass and opposite charge . For example, the antiparticle of the electron is the positively charged positron, which is produced naturally in certain types of radioactive decay.\nThe laws of nature are very nearly symmetrical with respect to particles and antiparticles. For example, an antiproton and a positron can form an antihydrogen atom, which is believed to have the same properties as a hydrogen atom. This leads to the question of why the formation of matter after the Big Bang resulted in a universe consisting almost entirely of matter, rather than being a half-and-half mixture of matter and antimatter. The discovery of Charge Parity violation helped to shed light on this problem by showing that this symmetry, originally thought to be perfect, was only approximate.\nParticle-antiparticle pairs can annihilate each other, producing photons; since the charges of the particle and antiparticle are opposite, total charge is conserved. For example, the positrons produced in natural radioactive decay quickly annihilate themselves with electrons, producing pairs of gamma rays, a process exploited in positron emission tomography.\nAntiparticles are produced naturally in beta decay, and in the interaction of cosmic rays in the Earth's atmosphere.\nBecause charge is conserved, it is not possible to create an antiparticle without either destroying a particle of the same charge  or by creating a particle of the opposite charge. The latter is seen in many processes in which both a particle and its antiparticle are created simultaneously, as in particle accelerators. This is the inverse of the particle-antiparticle annihilation process.\nAlthough particles and their antiparticles have opposite charges, electrically neutral particles need not be identical to their antiparticles. The neutron, for example, is made out of quarks, the antineutron from antiquarks, and they are distinguishable from one another because neutrons and antineutrons annihilate each other upon contact. However, other neutral particles are their own antiparticles, such as photons, hypothetical gravitons, and some WIMPs.", "title": "Antiparticle"}