{"summary": "Anxiety is an unpleasant emotional state.", "full_text": "Anxiety is an emotion characterized by an unpleasant state of inner turmoil, often accompanied by nervous behavior, such as pacing back and forth, somatic complaints and rumination. It is the subjectively unpleasant feelings of dread over anticipated events, such as the feeling of imminent death. Anxiety is not the same as fear, which is a response to a real or perceived immediate threat; whereas anxiety is the expectation of future threat. Anxiety is a feeling of fear, uneasiness, and worry, usually generalized and unfocused as an overreaction to a situation that is only subjectively seen as menacing. It is often accompanied by muscular tension, restlessness, fatigue and problems in concentration. Anxiety can be appropriate, but when experienced regularly the individual may suffer from an anxiety disorder.\nPeople facing anxiety may withdraw from situations which have provoked anxiety in the past. There are various types of anxiety. Existential anxiety can occur when a person faces angst, an existential crisis, or nihilistic feelings. People can also face mathematical anxiety, somatic anxiety, stage fright, or test anxiety. Social anxiety and stranger anxiety are caused when people are apprehensive around strangers or other people in general. Furthermore anxiety has been linked with physical symptoms such as IBS and can heighten other mental health illnesses such as OCD and panic disorder.\nAnxiety can be either a short term \"state\" or a long term \"trait\". Whereas trait anxiety is a worry about future events, close to the concept of neuroticism, anxiety disorders are a group of mental disorders characterized by feelings of anxiety and fear, Anxiety disorders are partly genetic but may also be due to drug use, including alcohol and caffeine, as well as withdrawal from certain drugs. They often occur with other mental disorders, particularly bipolar disorder, eating disorders, major depressive disorder, or certain personality disorders. Common treatment options include lifestyle changes, medication, and therapy.", "title": "Anxiety"}