{"summary": "Archaeology is the study of the past by looking for the remains and artifacts  left by the people who lived long ago.", "full_text": "Archaeology, or archeology, is the study of human activity in the past, primarily through the recovery and analysis of material culture. The archaeological record consists of artifacts, architecture, biofacts or ecofacts, and cultural landscapes. Archaeology can be considered both a social science and a branch of the humanities. In North America, archaeology is considered a sub-field of anthropology, while in Europe archaeology is often viewed as either a discipline in its own right or a sub-field of other disciplines, such history in the United Kingdom or geology in France.\nArchaeologists study human prehistory and history, from the development of the first stone tools at Lomekwi, eastern Africa, 3.3 million years ago up until recent decades. Archaeology as a field is distinct from the discipline of paleontology, the study of fossil remains. Archaeology is particularly important for learning about prehistoric societies, for whom there may be no written records to study. Prehistory includes over 99% of the human past, from the Paleolithic until the advent of literacy in societies across the world. Archaeology has various goals, which range from understanding culture history to reconstructing past lifeways to documenting and explaining changes in human societies through time.\nThe discipline involves surveying, excavation and eventually analysis of data collected to learn more about the past. In broad scope, archaeology relies on cross-disciplinary research. It draws upon anthropology, history, art history, classics, ethnology, geography, geology, linguistics, semiology, physics, information sciences, chemistry, statistics, paleoecology, paleontology, paleozoology, paleoethnobotany, and paleobotany.\nArchaeology developed out of antiquarianism in Europe during the 19th century, and has since become a discipline practiced across the world. Since its early development, various specific sub-disciplines of archaeology have developed, including maritime archaeology, feminist archaeology and archaeoastronomy, and numerous different scientific techniques have been developed to aid archaeological investigation. Nonetheless, today, archaeologists face many problems, such as dealing with pseudoarchaeology, the looting of artifacts, a lack of public interest, and opposition to the excavation of human remains.\n^ \n^ \n^", "title": "Archeology"}