{"summary": "Armenia  is a country in the western part of Asia.", "full_text": "Armenia , officially the Republic of Armenia , is a landlocked country in the South Caucasus region of Eurasia. Located in Western Asia, it is bordered by Turkey to the west, Georgia to the north, the de facto independent Nagorno-Karabakh Republic and Azerbaijan to the east, and Iran and the Azerbaijani exclave of Nakhchivan to the south.\nArmenia is a unitary, multi-party, democratic nation-state with an ancient cultural heritage. The Satrapy of Armenia was established in the 6th century BC, after the fall of Urartu. In the 1st century BC the Kingdom of Armenia reached its height under Tigranes the Great. Armenia became the first state in the world to adopt Christianity as its official religion, in between late 3rd century to early years of the 4th century , becoming the first Christian nation.\" As a result, previously predominant Zoroastrianism and paganism in Armenia gradually declined. An Armenian principality and later a kingdom, known as Cilician Armenia, existed on the coast of the Mediterranean Sea between the 11th and 14th centuries.\nBetween the 16th century and first half of the 19th century, the traditional Armenian homeland composed of Eastern Armenia and Western Armenia came under rule of the rivaling Ottoman and successive Iranian Empires, passing between the two over the centuries. By the mid-19th century, Eastern Armenia had been conquered by Russia from Qajar Iran, while most of the western parts of the traditional Armenian homeland still remained under Ottoman rule. During World War I, the Armenians living in their ancestral lands in the Ottoman Empire were systematically exterminated in the Armenian Genocide. In 1918, during the Russian Revolution, all non-Russian countries were granted independence from the dissolved empire, leading to the establishment of the First Republic of Armenia. By 1920, the state was incorporated into the Transcaucasian Socialist Federative Soviet Republic, a founding member of the Soviet Union in 1922. In 1936, the Transcaucasian state was dissolved, leaving its constituent states, including the Armenian Soviet Socialist Republic, as full Union republics. The modern Republic of Armenia became independent in 1991 during the dissolution of the Soviet Union.\nThe Republic of Armenia recognizes the Armenian Apostolic Church, the world's oldest national church, as the country's primary religious establishment. The unique Armenian alphabet was invented by Mesrop Mashtots in 405 AD.\nArmenia is a member of the Eurasian Economic Union, the Council of Europe and the Collective Security Treaty Organization. Armenia supports the de facto independent Nagorno-Karabakh Republic, which was proclaimed in 1991.\n\n", "title": "Armenia"}