{"summary": "An asteroid is a small object in the Solar System that travels around the Sun.", "full_text": "Asteroids are minor planets, especially those of the inner Solar System. The larger ones have also been called planetoids. These terms have historically been applied to any astronomical object orbiting the Sun that did not show the disc of a planet and was not observed to have the characteristics of an active comet. As minor planets in the outer Solar System were discovered and found to have volatile-based surfaces that resemble those of comets, they were often distinguished from asteroids of the asteroid belt. In this article, the term \"asteroid\" refers to the minor planets of the inner Solar System including those in co-orbit with Jupiter.\nThere are millions of asteroids, many thought to be the shattered remnants of planetesimals, bodies within the young Sun's solar nebula that never grew large enough to become planets. The large majority of known asteroids orbit in the asteroid belt between the orbits of Mars and Jupiter, or are co-orbital with Jupiter . However, other orbital families exist with significant populations, including the near-Earth asteroids. Individual asteroids are classified by their characteristic spectra, with the majority falling into three main groups: C-type, S-type, and M-type. These were named after and are generally identified with carbon-rich, stony, and metallic compositions, respectively.\nOnly one asteroid, 4 Vesta, which has a relatively reflective surface, is normally visible to the naked eye, and this only in very dark skies when it is favorably positioned. Rarely, small asteroids passing close to Earth may be visible to the naked eye for a short time. As of November 2015, the Minor Planet Center had data on more than 1.25 million objects in the inner and outer Solar System, of which 750,000 had enough information to be given numbered designations.\nOn 22 January 2014, ESA scientists reported the detection, for the first definitive time, of water vapor on Ceres, the largest object in the asteroid belt. The detection was made by using the far-infrared abilities of the Herschel Space Observatory. The finding is unexpected because comets, not asteroids, are typically considered to \"sprout jets and plumes\". According to one of the scientists, \"The lines are becoming more and more blurred between comets and asteroids.\"", "title": "Asteroid"}