{"summary": "The atomic radius of an element is the distance between the nucleus and the edge of the electron cloud.", "full_text": "The atomic radius of a chemical element is a measure of the size of its atoms, usually the mean or typical distance from the center of the nucleus to the boundary of the surrounding cloud of electrons. Since the boundary is not a well-defined physical entity, there are various non-equivalent definitions of atomic radius. Three widely used definitions of atomic radius are: Van der Waals radius, ionic radius, and covalent radius.\nDepending on the definition, the term may apply only to isolated atoms, or also to atoms in condensed matter, covalently bound in molecules, or in ionized and excited states; and its value may be obtained through experimental measurements, or computed from theoretical models. The value of the radius may depend on the atom's state and context.\nElectrons do not have definite orbits, or sharply defined ranges. Rather, their positions must be described as probability distributions that taper off gradually as one moves away from the nucleus, without a sharp cutoff. Moreover, in condensed matter and molecules, the electron clouds of the atoms usually overlap to some extent, and some of the electrons may roam over a large region encompassing two or more atoms.\nUnder most definitions the radii of isolated neutral atoms range between 30 and 300 pm , or between 0.3 and 3 angstroms. Therefore, the radius of an atom is more than 10,000 times the radius of its nucleus , and less than 1/1000 of the wavelength of visible light .\n\nFor many purposes, atoms can be modeled as spheres. This is only a crude approximation, but it can provide quantitative explanations and predictions for many phenomena, such as the density of liquids and solids, the diffusion of fluids through molecular sieves, the arrangement of atoms and ions in crystals, and the size and shape of molecules.\nAtomic radii vary in a predictable and explicable manner across the periodic table. For instance, the radii generally decrease along each period  of the table, from the alkali metals to the noble gases; and increase down each group . The radius increases sharply between the noble gas at the end of each period and the alkali metal at the beginning of the next period. These trends of the atomic radii  can be explained by the electron shell theory of the atom; they provided important evidence for the development and confirmation of quantum theory. The atomic radii decrease across the Periodic Table because as the atomic number increases, the number of protons increases across the period, but the extra electrons are only added to the same quantum shell. Therefore, the effective nuclear charge towards the outermost electrons increases, drawing the outermost electrons closer. As a result, the electron cloud contracts and the atomic radius decreases.", "title": "Atomic radius"}