{"summary": "The atomic number  of an atom is the number of protons in the nucleus of the atom.", "full_text": "In chemistry and physics, the atomic number of a chemical element  is the number of protons found in the nucleus of an atom of that element, and therefore identical to the charge number of the nucleus. It is conventionally represented by the symbol Z. The atomic number uniquely identifies a chemical element. In an uncharged atom, the atomic number is also equal to the number of electrons.\nThe atomic number, Z, should not be confused with the mass number, A, which is the number of nucleons, the total number of protons and neutrons in the nucleus of an atom. The number of neutrons, N, is known as the neutron number of the atom; thus, A = Z + N . Since protons and neutrons have approximately the same mass  and the mass defect of nucleon binding is always small compared to the nucleon mass, the atomic mass of any atom, when expressed in unified atomic mass units , is roughly  equal to the whole number A.\nAtoms with the same atomic number Z but different neutron numbers N, and hence different atomic masses, are known as isotopes. A little more than three-quarters of naturally occurring elements exist as a mixture of isotopes , and the average isotopic mass of an isotopic mixture for an element  in a defined environment on Earth, determines the element's standard atomic weight. Historically, it was these atomic weights of elements  that were the quantities measurable by chemists in the 19th century.\nThe conventional symbol Z comes from the German word Zahl meaning number/numeral/figure, which, prior to the modern synthesis of ideas from chemistry and physics, merely denoted an element's numerical place in the periodic table, whose order is approximately, but not completely, consistent with the order of the elements by atomic weights. Only after 1915, with the suggestion and evidence that this Z number was also the nuclear charge and a physical characteristic of atoms, did the word Atomzahl  come into common use in this context.", "title": "Atomic number"}