{"summary": "An atomic mass  is the mass of a single atom of a chemical element.", "full_text": "The atomic mass  is the mass of an atomic particle, sub-atomic particle, or molecule. It is commonly expressed in unified atomic mass units  where by international agreement, 1 unified atomic mass unit is defined as 1/12 of the mass of a single carbon-12 atom . For atoms, the protons and neutrons of the nucleus account for almost all of the mass, and the atomic mass measured in u has nearly the same value as the mass number.\nWhen divided by unified atomic mass units or daltons to form a pure number ratio, the atomic mass of an atom becomes a dimensionless number called the relative isotopic mass . Thus, the atomic mass of a carbon-12 atom is 12 u or 12 daltons , but the relative isotopic mass of a carbon-12 atom is simply 12.\nThe atomic mass or relative isotopic mass refers to the mass of a single particle, and is fundamentally different from the quantities elemental atomic weight  and standard atomic weight, both of which refer to averages  of naturally-occurring atomic mass values for samples of elements. Most elements have more than one stable nuclide; for those elements, such an average depends on the mix of nuclides present, which may vary to some limited extent depending on the source of the sample, as each nuclide has a different mass.  By contrast, atomic mass figures refer to an individual particle species: as atoms of the same species are identical, atomic mass values are expected to have no intrinsic variance at all. Atomic mass figures are thus commonly reported to many more significant figures than atomic weights. Standard atomic weight is related to atomic mass by the abundance ranking of isotopes for each element. It is usually about the same value as the atomic mass of the most abundant isotope, other than what looks like  a rounding difference.\nThe atomic mass of atoms, ions, or atomic nuclei is slightly less than the sum of the masses of their constituent protons, neutrons, and electrons, due to binding energy mass loss .", "title": "Atomic mass"}