{"summary": "The Attack on Pearl Harbor was a surprise attack by Japan against the United States naval base at Pearl Harbor, Hawaii on the morning of December 7, 1941. It is what led the United States into World War II.", "full_text": "The attack on Pearl Harbor was a surprise military strike by the Imperial Japanese Navy against the United States naval base at Pearl Harbor, in the United States Territory of Hawaii, on the morning of December 7, 1941. The attack led to the United States' entry into World War II.\nJapan intended the attack as a preventive action to keep the U.S. Pacific Fleet from interfering with military actions the Empire of Japan planned in Southeast Asia against overseas territories of the United Kingdom, the Netherlands, and the United States. There were near-simultaneous Japanese attacks on the U.S.-held Philippines, Guam and Wake Island and on the British Empire in Malaya, Singapore, and Hong Kong. The attacks - from troop landings at Kota Bharu, Malaya, to the air attacks ranging geographically from Hong Kong to Pearl Harbor - took place over seven hours.\nThe attack commenced at 7:48 a.m. Hawaiian Time. The base was attacked by 353 Japanese fighter planes, bombers, and torpedo planes in two waves, launched from six aircraft carriers. All eight U.S. Navy battleships were damaged, with four sunk. All but Arizona were later raised, and six were returned to service and went on to fight in the war. The Japanese also sank or damaged three cruisers, three destroyers, an anti-aircraft training ship, and one minelayer. 188 U.S. aircraft were destroyed; 2,403 Americans were killed and 1,178 others were wounded. Important base installations such as the power station, shipyard, maintenance, and fuel and torpedo storage facilities, as well as the submarine piers and headquarters building  were not attacked. Japanese losses were light: 29 aircraft and five midget submarines lost, and 64 servicemen killed. One Japanese sailor, Kazuo Sakamaki, was captured.\nThe attack came as a profound shock to the American people and led directly to the American entry into World War II in both the Pacific and European theaters. The following day, December 8, the United States declared war on Japan. Domestic support for non-interventionism, which had been fading since the German attack on France in 1940, disappeared. Clandestine support of the United Kingdom  was replaced by active alliance. Subsequent operations by the U.S. prompted Germany and Italy to declare war on the U.S. on December 11, which was reciprocated by the U.S. the same day.\nFrom the 1950s, several writers alleged that parties high in the U.S. and British governments knew of the attack in advance and may have let it happen  with the aim of bringing America into war. However, this advance-knowledge conspiracy theory is rejected by mainstream historians.\nThere were numerous historical precedents for unannounced military action by Japan. However, the lack of any formal warning, particularly while negotiations were still apparently ongoing, led President Franklin D. Roosevelt to proclaim December 7, 1941, \"a date which will live in infamy\". Because the attack happened without a declaration of war and without explicit warning, the attack on Pearl Harbor was judged by the Tokyo Trials to be a war crime.\n\n", "title": "Attack on Pearl Harbor"}