{"summary": "Audrey Hepburn  was a Belgian-born British actress admired for her charm and elegance.", "full_text": "Audrey Hepburn  was a British actress and humanitarian. Recognised as a film and fashion icon, Hepburn was active during Hollywood's Golden Age. She was ranked by the American Film Institute as the third greatest female screen legend in Golden Age Hollywood and was inducted into the International Best Dressed List Hall of Fame. Born in Ixelles, a district of Brussels, Hepburn spent her childhood between Belgium, England, and the Netherlands, including German-occupied Arnhem during the Second World War where she worked as a courier for the Dutch resistance and assisted with fundraising. In Amsterdam, she studied ballet with Sonia Gaskell before moving to London in 1948 to continue her ballet training with Marie Rambert and perform as a chorus girl in West End musical theatre productions. She spoke several languages, including English, French, Dutch, Italian, Spanish, and German.\nFollowing minor appearances in several films, Hepburn starred in the 1951 Broadway play Gigi after being spotted by French novelist Colette. Hepburn shot to stardom for playing the lead role in Roman Holiday , for which she was the first actress to win an Academy Award, a Golden Globe and a BAFTA Award for a single performance. The same year, she won a Tony Award for Best Lead Actress in a Play for her performance in Ondine. Hepburn went on to star in a number of successful films, such as Sabrina , The Nun's Story , Breakfast at Tiffany's , Charade , My Fair Lady  and Wait Until Dark , for which she received Academy Award, Golden Globe and BAFTA nominations. Hepburn won a record three BAFTA Awards for Best British Actress in a Leading Role. In recognition of her film career, she was awarded the Lifetime Achievement Award from BAFTA, Golden Globe Cecil B. DeMille Award, the Screen Actors Guild Life Achievement Award, and the Special Tony Award. Hepburn remains one of the few people who have won Academy, Emmy, Grammy, and Tony Awards.\nHepburn appeared in fewer films as her life went on, devoting much of her later life to UNICEF. Although contributing to the organisation since 1954, she worked in some of the most profoundly impoverished communities of Africa, South America and Asia between 1988 and 1992. She was awarded the Presidential Medal of Freedom in recognition of her work as a UNICEF Goodwill Ambassador in December 1992. A month later, Hepburn died of appendiceal cancer at her home in Switzerland at the age of 63.", "title": "Audrey Hepburn"}