{"summary": "August Krogh  was a Danish zoologist.", "full_text": "Schack August Steenberg Krogh ForMemRS  was a Danish professor at the department of zoophysiology at the University of Copenhagen from 1916-1945. He contributed a number of fundamental discoveries within several fields of physiology, and is famous for developing the Krogh Principle.\nIn 1920 August Krogh was awarded the Nobel Prize in Physiology or Medicine for the discovery of the mechanism of regulation of the capillaries in skeletal muscle. Krogh was first to describe the adaptation of blood perfusion in muscle and other organs according to demands through opening and closing the arterioles and capillaries.\nKrogh was a pioneer in comparative studies on animals. He wrote his thesis on the respiration through the skin and lungs in frogs: Respiratory Exchange of Animals, 1915. Later Krogh took on studies of water and electrolyte homeostasis of aquatic animals and he published the books: Osmotic Regulation  and Comparative Physiology of Respiratory Mechanisms . In addition Krogh contributed more than 200 research articles in international journals. He was a constructor of scientific instruments of which several had considerable practical importance, e.g. the spirometer and the apparatus for measuring basal metabolic rate.\nKrogh brought insulin to Denmark shortly after its discovery in 1922 by Nicolae Paulescu. Together with Hagedorn, Krogh made decisive contributions to establishing a Danish production of insulin by ethanol extraction of the hormone from the pancreatic glands of pigs.\nMuch of Krogh's work was carried out in collaboration with his wife, Marie Krogh , a renowned scientist in her own right.\nIn 1910 August Krogh founded the first laboratory for animal physiology  at the University of Copenhagen. It was located in a small townhouse in central Copenhagen . The laboratory was considerably enlarged in 1928, when it moved to a new building at Juliane Maries Vej 28-32 called The Rockefeller Complex . The building also gave place to the institutes of medical physiology and biophysics, and to the institute for the theory of gymnastics . Today, the disciplines of animal physiology, exercise physiology, and some of the biochemical subdisciplines under the Faculty of Science are based at the August Krogh Institute, a building inaugurated in 1970. August and Marie had four children, the youngest of whom, Bodil, was born in 1918. Bodil married an eminent comparative physiologist, Knut Schmidt-Nielsen, in 1939 and had three children. She received her Dental degree in 1941, was the first recipient of a Doctor in Odontology in 1946, and her PhD in 1955, all from the University of Copenhagen. Knut and Bodil moved to America and each had independently prominent physiology careers at prestigious institutions, including Duke University and Mount Desert Island Biological Laboratory, and were well known for their many students who became leaders in the field.\nTorkel Weis-Fogh, an eminent pioneer on the study of insect flight, was a student of August Krogh's.", "title": "August Krogh"}