{"summary": "Ayrton Senna da Silva , better known as Ayrton Senna, was a Brazilian Formula 1 driver who won the championship three times, in 1988, 1990 and in 1991. He died in an accident that took place on the Autodromo Enzo e Dino Ferrari, better known as Imola, in the 1994 San Marino Grand Prix.", "full_text": "Ayrton Senna da Silva  was a Brazilian racing driver who won three Formula One world championships in 1988, 1990 and 1991. He was killed in an accident while leading the 1994 San Marino Grand Prix. He was among the most dominant and successful Formula One drivers of the modern era and is considered by many as the greatest racing driver of all time.\nSenna began his motorsport career in karting, moving up to open-wheel racing in 1981, and winning the British Formula 3 championship in 1983. He made his Formula One debut with Toleman-Hart in 1984 before moving to Lotus-Renault the following year and winning six Grands Prix over the next three seasons. In 1988, he joined Frenchman Alain Prost at McLaren-Honda. Between them, they won all but one of the 16 Grands Prix that year and Senna claimed his first World Championship. Prost claimed the championship in 1989, and Senna his second and third championships in 1990 and 1991. In 1992, the Williams-Renault combination began to dominate Formula One. Senna nonetheless managed to finish the 1993 season as runner-up, winning five races and negotiating a move to Williams in 1994.\nSenna has often been voted as the best and most influential Formula One driver of all time in various motorsport polls. He was recognised for his qualifying speed over one lap and from 1989 until 2006 held the record for most pole positions. He was also acclaimed for his wet weather performances, such as the 1984 Monaco Grand Prix, the 1985 Portuguese Grand Prix, and the 1993 European Grand Prix. He holds a record six victories at the Monaco Grand Prix, and is the fifth-most successful driver of all time in terms of race wins. Senna courted controversy throughout his career, particularly during his turbulent rivalry with Alain Prost. In the Japanese Grands Prix of 1989 and 1990, each of which decided the championship of that year, collisions between Senna and Prost determined the eventual winner.", "title": "Ayrton Senna"}