{"summary": "The Northrop Grumman B-2 Spirit, also called the Stealth Bomber, is an American strategic bomber.", "full_text": "The Northrop  B-2 Spirit, also known as the Stealth Bomber, is an American heavy penetration strategic bomber, featuring low observable stealth technology designed for penetrating dense anti-aircraft defenses; it is a flying wing design with a crew of two. The bomber can deploy both conventional and thermonuclear weapons, such as eighty 500 lb -class  JDAM Global Positioning System-guided bombs, or sixteen 2,400 lb  B83 nuclear bombs. The B-2 is the only acknowledged aircraft that can carry large air-to-surface standoff weapons in a stealth configuration.\nDevelopment originally started under the \"Advanced Technology Bomber\"  project during the Carter administration, and its expected performance was one of his reasons for the cancellation of the supersonic B-1A bomber. ATB continued during the Reagan administration, but worries about delays in its introduction led to the reinstatement of the B-1 program as well. Program costs rose throughout development. Designed and manufactured by Northrop Grumman, the cost of each aircraft averaged US$737 million . Total procurement costs averaged $929 million per aircraft, which includes spare parts, equipment, retrofitting, and software support. The total program cost including development, engineering and testing, averaged $2.1 billion per aircraft in 1997.\nBecause of its considerable capital and operating costs, the project was controversial in the U.S. Congress and among the Joint Chiefs of Staff. The winding-down of the Cold War in the latter portion of the 1980s dramatically reduced the need for the aircraft, which was designed with the intention of penetrating Soviet airspace and attacking high-value targets. During the late 1980s and 1990s, Congress slashed plans to purchase 132 bombers to 21. In 2008, a B-2 was destroyed in a crash shortly after takeoff, though the crew ejected safely. A total of 20 B-2s remain in service with the United States Air Force, which plans to operate the B-2 until 2058.\nThe B-2 is capable of all-altitude attack missions up to 50,000 feet , with a range of more than 6,000 nautical miles  on internal fuel and over 10,000 nautical miles  with one midair refueling. It entered service in 1997 as the second aircraft designed to have advanced stealth technology after the Lockheed F-117 Nighthawk attack aircraft. Though originally designed primarily as a nuclear bomber, the B-2 was first used in combat dropping conventional ordnance in the Kosovo War in 1999 and saw further service in Iraq and Afghanistan.", "title": "B-2 Spirit"}