{"summary": "Bahrain  is an island nation in the Persian Gulf.", "full_text": "Bahrain , officially the Kingdom of Bahrain , is a small island country situated near the western shores of the Persian Gulf in the Middle East. It is an archipelago with Bahrain Island, the largest land mass, at 55 km  long by 18 km  wide. Saudi Arabia lies to the west and is connected to Bahrain by the King Fahd Causeway while Iran lies 200 km  to the north across the Persian Gulf. The peninsula of Qatar is to the southeast across the Gulf of Bahrain. The population in 2010 stood at 1,234,571, including 666,172 non-nationals.\nBahrain is the site of the ancient land of the Dilmun civilisation. Bahrain was one of the earliest areas to convert to Islam in 628 AD. Following a period of Arab rule, Bahrain was occupied by the Portuguese in 1521, who in turn were expelled in 1602 by Shah Abbas I of the Safavid dynasty under the Persian Empire. In 1783, the Bani Utbah clan captured Bahrain from Nasr Al-Madhkur and has since been ruled by the Al Khalifa royal family, with Ahmed al Fateh as Bahrain's first hakim. In the late 1800s, following successive treaties with the British, Bahrain became a protectorate of the United Kingdom. In 1971, Bahrain declared independence. Formerly a state, Bahrain was declared a Kingdom in 2002. Since early 2011, the country has experienced sustained protests and unrest inspired by the regional Arab Spring, particularly by the majority Shia population.\nBahrain has the first post-oil economy in the Persian Gulf. Since the late 20th century, Bahrain has invested in the banking and tourism sectors. The country's capital, Manama, is home to many large financial structures. Bahrain has a high Human Development Index  and was recognised by the World Bank as a high income economy.\n^ \n^ \"Bahrain ends special pact\". The Straits Times. 15 August 1971. \n^ Bahrain- Cia World FactBook\n^ http://www.ifs.du.edu/ifs/frm_CountryProfile.aspx?Country=BH\n^ a b c d \"Bahrain\". International Monetary Fund. Retrieved 9 October 2014. \n^ \"Human Development Report 2011\" . United Nations. 2011. Retrieved 19 January 2012. \n^ \"General Tables\". Bahraini Census 2010. Retrieved 3 March 2012. \n^ Saudi Aramco World : Oman: The Lost Land\n^ CNN Wire Staff . \"Bahrain says ban on protests is response to rising violence\". CNN. Retrieved 16 November 2012. \n^ \"Bahrain: Reform-Promise and Reality\" . J.E. Peterson. p. 157. \n^ \"Bahrain's economy praised for diversity and sustainability\". Bahrain Economic Development Board. Archived from the original on 2010-12-28. Retrieved 24 June 2012.", "title": "Bahrain"}