{"summary": "Baku  is the capital and the largest city of Azerbaijan.", "full_text": "Baku  is the capital and largest city of Azerbaijan, as well as the largest city on the Caspian Sea and of the Caucasus region. Baku is located 28 metres  below sea level, which makes it the lowest lying national capital in the world and also the largest city in the world located below sea level. It is located on the southern shore of the Absheron Peninsula, which projects into the Caspian Sea. The city consists of two principal parts: the downtown area and the old Inner City . At the beginning of 2009, Baku's urban population was estimated at just over two million people. Officially, about 25 percent of all inhabitants of the country live in Baku's metropolitan area.\nBaku is divided into eleven administrative districts  and 48 townships. Among these are the townships on islands in the Baku Bay and the town of Oil Rocks built on stilts in the Caspian Sea, 60 km  away from Baku. The Inner City of Baku along with the Shirvanshah's Palace and Maiden Tower were inscribed as a UNESCO World Heritage Site in 2000. According to the Lonely Planet's ranking, Baku is also among the world's top ten destinations for urban nightlife.\nThe city is the scientific, cultural and industrial center of Azerbaijan. Many sizeable Azerbaijani institutions have their headquarters there, including SOCAR, one of the world's top 100 companies and others. The Baku International Sea Trade Port, sheltered by the islands of the Baku Archipelago to the east and the Absheron Peninsula to the north, is capable of handling two million tons of general and dry bulk cargoes per year. In recent years, Baku has become an important venue for international events. It hosted the 57th Eurovision Song Contest in 2012 and the 2015 European Games, and will host the 2016 European Grand Prix and UEFA Euro 2020.\nThe city is renowned for its harsh winds. This is reflected in the city's nickname, the \"City of Winds\".", "title": "Baku"}