{"summary": "Bangkok  is the capital city of the Asian country Thailand.", "full_text": "Bangkok  is the capital and most populous city of Thailand. It is known in Thai as Krung Thep Maha Nakhon  or simply  Krung Thep . The city occupies 1,568.7 square kilometres  in the Chao Phraya River delta in Central Thailand, and has a population of over 8 million, or 12.6 percent of the country's population. Over 14 million people  live within the surrounding Bangkok Metropolitan Region, making Bangkok an extreme primate city, dwarfing Thailand's other urban centres in terms of importance.\nBangkok traces its roots to a small trading post during the Ayutthaya Kingdom in the 15th century, which eventually grew in size and became the site of two capital cities: Thonburi in 1768 and Rattanakosin in 1782. Bangkok was at the heart of Siam's  modernization during the later 19th century, as the country faced pressures from the West. The city was the centre of Thailand's political struggles throughout the 20th century, as the country abolished absolute monarchy, adopted constitutional rule and underwent numerous coups and uprisings. The city grew rapidly during the 1960s through the 1980s and now exerts a significant impact among Thailand's politics, economy, education, media and modern society.\nThe Asian investment boom in the 1980s and 1990s led many multinational corporations to locate their regional headquarters in Bangkok. The city is now a major regional force in finance and business. It is an international hub for transport and health care, and is emerging as a regional centre for the arts, fashion and entertainment. The city is known for its vibrant street life and cultural landmarks, as well as its notorious red-light districts. The historic Grand Palace and Buddhist temples including Wat Arun and Wat Pho stand in contrast with other tourist attractions such as the nightlife scenes of Khaosan Road and Patpong. Bangkok is among the world's top tourist destinations. It is named the most visited city in MasterCard's Global Destination Cities Index, and was named \"World's Best City\" for four consecutive years by Travel + Leisure magazine.\nBangkok's rapid growth amidst little urban planning and regulation has resulted in a haphazard cityscape and inadequate infrastructure systems. Limited roads, despite an extensive expressway network, together with substantial private car usage, have resulted in chronic and crippling traffic congestion. This in turn caused severe air pollution in the 1990s. The city has since turned to public transport in an attempt to solve this major problem. Four rapid transit lines are now in operation, with more systems under construction or planned by the national government and the Bangkok Metropolitan Administration.", "title": "Bangkok"}