{"summary": "The Bangladesh Liberation War  was a revolutionary independence war in South Asia during 1971 which established the republic of Bangladesh.", "full_text": "The Bangladesh Liberation War , also known as the Bangladesh War of Independence, or simply the Liberation War in Bangladesh, was a revolution and armed conflict sparked by the rise of the Bengali nationalist and self-determination movement in East Pakistan and the 1971 Bangladesh genocide. It resulted in the independence of the People's Republic of Bangladesh. The war began after the Pakistani military junta based in West Pakistan launched Operation Searchlight against the people of East Pakistan on the night of 25 March 1971. It pursued the systematic elimination of nationalist Bengali civilians, students, intelligentsia, religious minorities and armed personnel. The junta annulled the results of the 1970 elections and arrested Prime Minister-elect Sheikh Mujibur Rahman.\nRural and urban areas across East Pakistan saw extensive military operations and air strikes to suppress the tide of civil disobedience that formed following the 1970 election stalemate. The Pakistan Army created radical religious militias - the Razakars, Al-Badr and Al-Shams- to assist it during raids on the local populace.  Members of the Pakistani military and supporting militias engaged in mass murder, deportation and genocidal rape. The capital Dacca was the scene of numerous massacres, including the Dacca University killings. An estimated 10 million Bengali refugees fled to neighboring India, while 30 million were internally displaced. Sectarian violence broke out between Bengalis and Urdu-speaking immigrants. An academic consensus prevails that the atrocities committed by the Pakistani military were a genocide.\nThe Bangladeshi Declaration of Independence was proclaimed from Chittagong by members of the Mukti Bahini- the national liberation army formed by Bengali military, paramilitary and civilians. The East Bengal Regiment and the East Pakistan Rifles played a crucial role in the resistance. Led by General M. A. G. Osmani and eleven sector commanders, the Bangladesh Forces waged a mass guerrilla war against the Pakistani military. They liberated numerous towns and cities in the initial months of the conflict. The Pakistan Army regained momentum in the monsoon. Bengali guerrillas carried out widespread sabotage, including Operation Jackpot against the Pakistan Navy. The nascent Bangladesh Air Force flew sorties against Pakistani military bases. By November, the Bangladesh Forces restricted the Pakistani military to its barracks during the night. They secured control of most parts of the countryside.\nThe Provisional Government of Bangladesh was formed on 17 April 1971 in Mujibnagar and moved to Calcutta as a government in exile. Bengali members of the Pakistani civil, military and diplomatic corps defected to the Bangladeshi provisional government. Thousands of Bengali families were interned in West Pakistan; from where many escaped to Afghanistan. Bengali cultural activists operated the clandestine Free Bengal Radio Station. The plight of millions of war ravaged Bengali civilians caused worldwide outrage and alarm. The Indian state led by Indira Gandhi provided substantial diplomatic, economic and military support to Bangladeshi nationalists. British, Indian and American musicians organized the world's first benefit concert in New York to support the Bangladeshi people. Senator Ted Kennedy in the United States led a congressional campaign for an end to Pakistani military persecution; while US diplomats in East Pakistan strongly dissented with the Nixon administration's close ties to the Pakistani military dictator Yahya Khan.\nIndia joined the war on 3 December 1971, after Pakistan launched preemptive air strikes on North India. The subsequent Indo-Pakistani War witnessed engagements on two war fronts. With air supremacy achieved in the eastern theatre; and the rapid advance of the Allied Forces of Bangladesh and India, Pakistan surrendered in Dacca on 16 December 1971.\nThe war changed the geopolitical landscape of South Asia, with the emergence of Bangladesh as the seventh-most populous country in the world. Due to complex regional alliances, the war was a major episode in Cold War tensions involving the United States, the Soviet Union and the People's Republic of China. The majority of member states in the United Nations recognized the Bangladeshi republic in 1972.", "title": "Bangladesh Liberation War"}