{"summary": "Bangladesh  is a country in South Asia.", "full_text": "Bangladesh , officially the People's Republic of Bangladesh , is a country in South Asia. It is bordered by India to its west, north and east; Myanmar  to its southeast; and is separated from Nepal and Bhutan by the Chicken's Neck corridor. To its south, it faces the Bay of Bengal. Bangladesh is the world's eighth-most populous country, with over 168 million people. It is one of the most densely populated countries, and among countries with a population exceeding 10 million, it is the most densely populated. It forms part of the ethno-linguistic region of Bengal, along with the neighbouring Indian states of West Bengal and Tripura.\nThe present-day borders of Bangladesh took shape during the Partition of Bengal and the British India in 1947, when the region came to be known as East Pakistan, as a part of the newly formed state of Pakistan. It was separated from West Pakistan by 1,400 kilometres  of Indian territory. Because of political exclusion, ethnic and linguistic discrimination and economic neglect by the politically dominant western wing, nationalism, popular agitation and civil disobedience led to the Bangladesh Liberation War and independence in 1971. After independence, the new state endured poverty, famine, political turmoil and military coups. The restoration of democracy in 1991 has been followed by relative calm and economic progress. In 2014, the Bangladeshi general election was boycotted by major opposition parties, resulting in a parliament and government dominated by the Awami League and its smaller coalition partners.\nBangladesh is a unitary parliamentary republic with an elected parliament called the Jatiyo Sangshad. The native Bengalis form the country's largest ethnic group, along with indigenous peoples in northern and southeastern districts. Geographically, the country is dominated by the fertile Bengal delta, the world's largest delta. This also gives Bangladesh a unique name tag as \"the land of rivers\". Bangladesh has a rich heritage of ancient civilization. Bangladesh's documented history spans 4,000 years. Bangladesh human history has lasted for more than 20,000 years.\nBangladesh is a Next Eleven emerging economy. It has achieved significant strides in human and social development since independence, including progress in gender equality, universal primary education, food production, health, and population control. However, Bangladesh continues to face numerous political, economic, social and environmental challenges, including political instability, corruption, poverty, overpopulation, and global warming.\nThe country is a founding member of SAARC, the Developing 8 Countries and BIMSTEC. It contributes one of the largest peacekeeping forces to the United Nations. It is a member of the Commonwealth of Nations, the Organization of Islamic Cooperation and the Non-Aligned Movement.\n\n", "title": "Bangladesh"}