{"summary": "In Judaism, a Bar Mitzvah is a Jewish boy, and a Bat Mitzvah a Jewish girl, who has turned 13 years old .", "full_text": "Bar Mitzvah  and Bat Mitzvah    are Jewish coming of age rituals.\nBar  is a Jewish Babylonian Aramaic word literally meaning \"son\" , while bat  means \"daughter\" in Hebrew, and mitzvah  means \"commandment\" or \"law\" . Thus bar mitzvah and bat mitzvah literally translate to \"son of commandment\" and \"daughter of commandment\". However, in rabbinical usage, the word bar means \"under the category of\" or \"subject to\". Bar mitzvah therefore translates to \"an  who is subject to the law\". Although the term is commonly used to refer to the ritual itself, in fact the phrase originally refers to the person.\nAccording to Jewish law, when Jewish boys become 13 years old, they become accountable for their actions and become a bar mitzvah. A girl becomes a bat mitzvah at the age of 12 according to Orthodox and Conservative Jews, and at the age of 13 according to Reform Jews. Prior to reaching bar mitzvah age, the child's parents hold the responsibility for the child's actions. After this age, the boys and girls bear their own responsibility for Jewish ritual law, tradition, and ethics, and are able to participate in all areas of Jewish community life. Traditionally, the father of the bar mitzvah gives thanks to God that he is no longer punished for the child's sins . In addition to being considered accountable for their actions from a religious perspective, b'nai mitzvah may be counted towards a minyan  and may lead prayer and other religious services in the family and the community.\nBar mitzvah is mentioned in the Mishnah  and in the Talmud. In some classic sources, the age of 13 appears for instance as the age from which males must fast on the Day of Atonement, while females fast from the age of 12. In the late Middle Ages this was systematized in Europe into a general rule as to when a young person was obligated to observe the mitzvot. The age of b'nai mitzvah roughly coincides with physical puberty. The bar or bat mitzvah ceremony is usually held on the first Shabbat after a boy's thirteenth and a girl's twelfth birthday.", "title": "Bar and Bat Mitzvah"}