{"summary": "Bath is a city in the county of Somerset in England.", "full_text": "Bath  is a city in the ceremonial county of Somerset, South West England, known for its Roman-built baths. In 2011, the population was 88,859. Bath is in the valley of the River Avon, 97 miles  west of London and 11 miles  south-east of Bristol. The city became a World Heritage Site in 1987.\nThe city became a spa with the Latin name Aquae Sulis  c. AD 60 when the Romans built baths and a temple in the valley of the River Avon, although hot springs were known even before then. Bath Abbey was founded in the 7th century and became a religious centre; the building was rebuilt in the 12th and 16th centuries. In the 17th century, claims were made for the curative properties of water from the springs, and Bath became popular as a spa town in the Georgian era. Georgian architecture, crafted from Bath stone, includes the Royal Crescent, Circus, Pump Room and Assembly Rooms where Beau Nash presided over the city's social life from 1705 until his death in 1761. Many of the streets and squares were laid out by John Wood, the Elder, and in the 18th century the city became fashionable and the population grew. Jane Austen lived in Bath in the early 19th century. Further building was undertaken in the 19th century and following the Bath Blitz in World War II.\nThe city has software, publishing and service-oriented industries. Theatres, museums, and other cultural and sporting venues have helped to make it a major centre for tourism with more than one million staying visitors and 3.8 million day visitors to the city each year. There are several museums including the Museum of Bath Architecture, Victoria Art Gallery, Museum of East Asian Art, and the Holburne Museum. The city has two universities: the University of Bath and Bath Spa University, with Bath College providing further education. Sporting clubs include Bath Rugby and Bath City F.C. while TeamBath is the umbrella name for all of the University of Bath sports teams.\nBath became part of the county of Avon in 1974, and, following Avon's abolition in 1996, has been the principal centre of Bath and North East Somerset.\n^ a b \"Bath\". BANES 2011 Census Ward Profiles. Retrieved 2 May 2015.  ", "title": "Bath, Somerset"}