{"summary": "The Battle of Stalingrad was a battle fought during the Second World War between Nazi Germany and the Soviet Union.", "full_text": "The Battle of Stalingrad  was a major battle of World War II in which Nazi Germany and its allies fought the Soviet Union for control of the city of Stalingrad  in Southern Russia, on the eastern boundary of Europe.\nMarked by constant close quarters combat and direct assaults on civilians by air raids, it is often regarded as the single largest and bloodiest battle in the history of warfare. The heavy losses inflicted on the German Wehrmacht make it arguably the most strategically decisive battle of the whole war. It was a turning point in the European theatre of World War II; German forces never regained the initiative in the East and withdrew a vast military force from the West to replace their losses.\nThe German offensive to capture Stalingrad began in late summer 1942, using the 6th Army and elements of the 4th Panzer Army. The attack was supported by intensive Luftwaffe bombing that reduced much of the city to rubble. The fighting degenerated into building-to-building fighting, and both sides poured reinforcements into the city. By mid-November 1942, the Germans had pushed the Soviet defenders back at great cost into narrow zones generally along the west bank of the Volga River.\nOn 19 November 1942, the Red Army launched Operation Uranus, a two-pronged attack targeting the weaker Romanian and Hungarian forces protecting the German 6th Army's flanks. The Axis forces on the flanks were overrun and the 6th Army was cut off and surrounded in the Stalingrad area. Adolf Hitler ordered that the army stay in Stalingrad and make no attempt to break out; instead, attempts were made to supply the army by air and to break the encirclement from the outside. Heavy fighting continued for another two months. By the beginning of February 1943, the Axis forces in Stalingrad had exhausted their ammunition and food. The remaining elements of the 6th Army surrendered. The battle lasted five months, one week, and three days.", "title": "Battle of Stalingrad"}