{"summary": "Belfast  is the capital of Northern Ireland.", "full_text": "Belfast  is the capital and largest city of Northern Ireland. Most of Belfast, including the city centre, is in County Antrim, but parts of East and South Belfast are in County Down. It is on the flood plain of the River Lagan. The city's motto is Pro Tanto Quid Retribuamus .\nBy population before the 2015 council reform, Belfast was the 17th largest city in the United Kingdom and the second largest on the island of Ireland. It is the seat of the devolved government and legislative Northern Ireland Assembly. At the time of the 2011 census, the city of Belfast had a population of 286,000. With the 2015 council reform it is 333,871 and lies at the heart of the Belfast Urban area, which has a population of 483,418 and the Belfast Metropolitan Area, which had a population of 579,276 at the 2001 census. The larger urban zone, as defined by the European Union, had an estimated total population of 673,000 on 1 January 2012. Belfast was granted city status in 1888.\nHistorically, Belfast has been a centre for the Irish linen industry , tobacco processing, rope-making and shipbuilding: the city's main shipbuilders, Harland and Wolff, which built the well-known RMS Titanic, propelled Belfast on to the global stage in the early 20th century as the biggest and most productive shipyard in the world. Belfast played a key role in the Industrial Revolution, establishing its place as a global industrial centre until the latter half of the 20th century. Industrialisation and the inward migration it brought made Belfast, if briefly, the biggest city in Ireland at the beginning of the 20th century, and the city's industrial and economic success was cited by unionist opponents of Home Rule as a reason why Ireland should shun devolution and later why Ulster unionists in particular would fight to resist it.\nToday, Belfast remains a centre for industry, as well as the arts, higher education, business, and law, and is the economic engine of Northern Ireland. The city suffered greatly during the period of conflict called \"the Troubles\", but latterly has undergone a sustained period of calm, free from the intense political violence of former years, and substantial economic and commercial growth. Additionally, Belfast city centre has undergone considerable expansion and regeneration in recent years, notably around Victoria Square.\nBelfast is served by two airports: George Best Belfast City Airport in the city, and Belfast International Airport 15 miles  west of the city. Belfast is a major port, with commercial and industrial docks dominating the Belfast Lough shoreline, including the famous Harland and Wolff shipyard. Belfast is a constituent city of the Dublin-Belfast corridor, which has a population of three million, or half the total population of the island of Ireland. Belfast is listed by the Globalization and World Cities Research Network  as a global city, with a ranking of 'Gamma'.", "title": "Belfast"}