{"summary": "Belgium, officially the Kingdom of Belgium, is a federal state in Western Europe.", "full_text": "Belgium , officially the Kingdom of Belgium, is a sovereign state in Western Europe. It is a founding member of the European Union and hosts several of the EU's official seats and as well as the headquarters of many major international organizations such as NATO. Belgium covers an area of 30,528 square kilometres  and has a population of about 11 million people.\nStraddling the cultural boundary between Germanic and Latin Europe, Belgium is home to two main linguistic groups: the Dutch-speaking, mostly Flemish community, which constitutes about 59% of the population, and the French-speaking, mostly Walloon population, which comprises 41% of all Belgians. Additionally, there is a small group of German-speakers who live in the East Cantons located around the High Fens area, and bordering Germany.\nBelgium is a federal constitutional monarchy with a parliamentary system of governance. Its two largest regions are the Dutch-speaking region of Flanders in the north and the French-speaking southern region of Wallonia. The Brussels-Capital Region, officially bilingual, is a mostly French-speaking enclave within the Flemish Region. A German-speaking Community exists in eastern Wallonia. Belgium's linguistic diversity and related political conflicts are reflected in its political history and complex system of government.\nHistorically, Belgium, the Netherlands and Luxembourg were known as the Low Countries; it once covered a somewhat larger area than the current Benelux group of states. The region was called Belgica in Latin, after the Roman province of Gallia Belgica, which covered more or less the same area. From the end of the Middle Ages until the 17th century, the area of Belgium was a prosperous and cosmopolitan centre of commerce and culture. From the 16th century until the Belgian Revolution in 1830, when Belgium seceded from the Netherlands, the area of Belgium served as the battleground between many European powers, causing it to be dubbed the \"Battlefield of Europe,\" a reputation strengthened by both world wars.\nUpon its independence, Belgium participated in the Industrial Revolution and, during the course of the 20th century, possessed a number of colonies in Africa. The second half of the 20th century was marked by rising tensions between the Dutch-speaking and the French-speaking citizens fueled by differences in language and the unequal economic development of Flanders and Wallonia. This continuing antagonism has led to several far-reaching reforms, resulting in a transition from a unitary to a federal arrangement during the period from 1970 to 1993. Despite the reforms, tensions between the groups remain; the formation of a coalition government took 18 months following the June 2010 federal election.", "title": "Belgium"}