{"summary": "Benito Amilcare Andrea Mussolini KSMOM GCTE  was an Italian politician and journalist.", "full_text": "Benito Amilcare Andrea Mussolini  was an Italian politician, journalist, and leader of the National Fascist Party, ruling the country as Prime Minister from 1922 until his ousting in 1943. He ruled constitutionally until 1925, when he dropped all pretense of democracy and set up a legal dictatorship. Known as Il Duce , Mussolini was the founder of fascism.\nIn 1912 Mussolini was the leading member of the National Directorate of the Italian Socialist Party . Prior to 1914 he was a keen supporter of the Socialist International, starting the series of meetings in Switzerland that organised the communist revolutions and insurrections that swept through Europe from 1917. Mussolini was expelled from the PSI due to his opposition to the party's stance on neutrality in World War I. Mussolini denounced the PSI, and later founded the fascist movement. Following the March on Rome in October 1922 he became the youngest Prime Minister in Italian history until the appointment of Matteo Renzi in February 2014. After destroying all political opposition through his secret police and outlawing labor strikes, Mussolini and his fascist followers consolidated their power through a series of laws that transformed the nation into a one-party dictatorship. Within five years he had established dictatorial authority by both legal and extraordinary means, aspiring to create a totalitarian state. Mussolini remained in power until he was deposed by King Victor Emmanuel III in 1943. A few months later, he became the leader of the Italian Social Republic, a German client regime in northern Italy; he held this post until his death in 1945.\nSince 1939, Mussolini had sought to delay a major war in Europe until at least 1942. Germany invaded Poland on 1 September 1939, starting World War II. On 10 June 1940, Mussolini sided with Germany, though he was aware that Italy did not have the military capacity in 1940 to carry out a long war with France and the United Kingdom. Mussolini believed that after the imminent French armistice, Italy could gain territorial concessions from France and then he could concentrate his forces on a major offensive in Egypt, where British and Commonwealth forces were outnumbered by Italian forces. However the UK refused to accept German proposals for a peace that would involve accepting Germany's victories in Eastern and Western Europe, plans for a German invasion of the UK did not proceed, and the war continued.\nOn 24 July 1943, soon after the start of the Allied invasion of Italy, the Grand Council of Fascism voted against him, and the King had him arrested the following day. On 12 September 1943, Mussolini was rescued from prison in the Gran Sasso raid by German special forces. In late April 1945, with total defeat looming, Mussolini attempted to escape north, only to be quickly captured and summarily executed near Lake Como by Italian partisans. His body was then taken to Milan where it was hung upside down at a service station for public viewing and to provide confirmation of his demise.\n\n", "title": "Benito Mussolini"}