{"summary": "Benjamin Franklin  was an American statesman.", "full_text": "Benjamin Franklin  was one of the Founding Fathers of the United States. A renowned polymath, Franklin was a leading author, printer, political theorist, politician, freemason, postmaster, scientist, inventor, civic activist, statesman, and diplomat. As a scientist, he was a major figure in the American Enlightenment and the history of physics for his discoveries and theories regarding electricity. As an inventor, he is known for the lightning rod, bifocals, and the Franklin stove, among other inventions. He facilitated many civic organizations, including Philadelphia's fire department and a university.\nFranklin earned the title of \"The First American\" for his early and indefatigable campaigning for colonial unity, first as an author and spokesman in London for several colonies. As the first United States Ambassador to France, he exemplified the emerging American nation. Franklin was foundational in defining the American ethos as a marriage of the practical values of thrift, hard work, education, community spirit, self-governing institutions, and opposition to authoritarianism both political and religious, with the scientific and tolerant values of the Enlightenment. In the words of historian Henry Steele Commager, \"In a Franklin could be merged the virtues of Puritanism without its defects, the illumination of the Enlightenment without its heat.\" To Walter Isaacson, this makes Franklin \"the most accomplished American of his age and the most influential in inventing the type of society America would become.\"\nFranklin, always proud of his working class roots, became a successful newspaper editor and printer in Philadelphia, the leading city in the colonies. With two partners he published the Pennsylvania Chronicle, a newspaper that was known for its revolutionary sentiments and criticisms of the British policies. He became wealthy publishing Poor Richard's Almanack and The Pennsylvania Gazette.\nHe played a major role in establishing the University of Pennsylvania and was elected the first president of the American Philosophical Society. Franklin became a national hero in America when as agent for several colonies he spearheaded the effort to have Parliament in London repeal the unpopular Stamp Act. An accomplished diplomat, he was widely admired among the French as American minister to Paris and was a major figure in the development of positive Franco-American relations. His efforts to secure support for the American Revolution by shipments of crucial munitions proved vital for the American war effort.\nFor many years he was the British postmaster for the colonies, which enabled him to set up the first national communications network. He was active in community affairs, colonial and state politics, as well as national and international affairs. From 1785 to 1788, he served as governor of Pennsylvania. Toward the end of his life, he freed his own slaves and became one of the most prominent abolitionists.\nHis colorful life and legacy of scientific and political achievement, and status as one of America's most influential Founding Fathers, have seen Franklin honored on coinage and the $100 bill; warships; the names of many towns; counties; educational institutions; corporations; and, more than two centuries after his death, countless cultural references.", "title": "Benjamin Franklin"}