{"summary": "Benjamin Harrison  was the 23rd president of the United States .", "full_text": "Benjamin Harrison  was the 23rd President of the United States ; he was the grandson of the ninth President, William Henry Harrison. Before ascending to the presidency, Harrison established himself as a prominent local attorney, Presbyterian church leader and politician in Indianapolis, Indiana. During the American Civil War, he served the Union as a colonel and on February 14, 1865 was confirmed by the U.S. Senate as a brevet brigadier general of volunteers to rank from January 23, 1865. After the war, he unsuccessfully ran for the governorship of Indiana. He was later elected to the U.S. Senate by the Indiana legislature.\nA Republican, Harrison was elected to the presidency in 1888, defeating the Democratic incumbent Grover Cleveland. Hallmarks of his administration included unprecedented economic legislation, including the McKinley Tariff, which imposed historic protective trade rates, and the Sherman Antitrust Act; Harrison facilitated the creation of the National Forests through an amendment to the Land Revision Act of 1891. He also substantially strengthened and modernized the Navy, and conducted an active foreign policy. He proposed, in vain, federal education funding as well as voting rights enforcement for African Americans during his administration.\nDue in large part to surplus revenues from the tariffs, federal spending reached one billion dollars for the first time during his term. The spending issue in part led to the defeat of the Republicans in the 1890 mid-term elections. Harrison was defeated by Cleveland in his bid for re-election in 1892, due to the growing unpopularity of the high tariff and high federal spending. He then returned to private life in Indianapolis but later represented the Republic of Venezuela in an international case against the United Kingdom. In 1900, he traveled to Europe as part of the case and, after a brief stay, returned to Indianapolis. He died the following year of complications from influenza. Although many have praised Harrison's commitment to African Americans' voting rights, scholars and historians generally regard his administration as below-average, and rank him in the bottom half among U.S. presidents.", "title": "Benjamin Harrison"}