{"summary": "Binjamin \"Bibi\" Netanyahu  is the Prime Minister of Israel and leader of the Likud party.", "full_text": "Benjamin \"Bibi\" Netanyahu  is the current Prime Minister of Israel. He also currently serves as a member of the Knesset and Chairman of the Likud party.\nBorn in Tel Aviv to secular Jewish parents, Netanyahu is the first Israeli prime minister born in Israel after the establishment of the state. Netanyahu joined the Israel Defense Forces shortly after the Six-Day War in 1967 and became a team leader in the Sayeret Matkal special forces unit. He took part in many missions, including Operation Inferno , Operation Gift  and Operation Isotope , during which he was shot in the shoulder. He fought on the front lines in the War of Attrition and the Yom Kippur War in 1973, taking part in special forces raids along the Suez Canal, and then leading a commando assault deep into Syrian territory. He achieved the rank of captain before being discharged. After graduating from MIT with SB and SM degrees, he was recruited as an economic consultant for the Boston Consulting Group. He returned to Israel in 1978 to found the Yonatan Netanyahu Anti-Terror Institute, named after his brother Yonatan Netanyahu, who died leading Operation Entebbe. Netanyahu served as the Israeli ambassador to the United Nations from 1984 to 1988.\nNetanyahu became the leader of Likud in 1993. Netanyahu won the 1996 elections, becoming Israel's youngest ever Prime Minister, serving his first term from June 1996 to July 1999. He moved from the political arena to the private sector after being defeated in the 1999 election for prime minister by Ehud Barak. Netanyahu returned to politics in 2002 as Foreign Affairs Minister  and Finance Minister  in Ariel Sharon's governments, but he departed the government over disagreements regarding the Gaza disengagement plan. As Minister of Finance, Netanyahu engaged in a major reform of the Israeli economy, which was credited by commentators as having significantly improved Israel's subsequent economic performance. He retook the Likud leadership in December 2005, after Sharon left to form a new party, Kadima. In December 2006, Netanyahu became the official Leader of the Opposition in the Knesset and Chairman of Likud. Following the 2009 parliamentary election, in which Likud placed second and right-wing parties won a majority, Netanyahu formed a coalition government. After the victory in the 2013 elections, he became the second person to be elected to the position of Prime Minister for a third term, after Israel's founder David Ben-Gurion. In March 2015, Netanyahu was elected to his fourth term as prime minister.\nNetanyahu has been elected Prime Minister of Israel four times, matching David Ben-Gurion's record. He is the only prime minister in Israel's history to have been elected three times in a row. He is currently the second longest-serving Prime Minister in Israel's history after David Ben-Gurion, and upon the completion of his current term he will become the longest-serving Prime Minister in the history of Israel.", "title": "Benjamin Netanyahu"}