{"summary": "Bette Davis  was an American actress of the stage, cinema and television.", "full_text": "Ruth Elizabeth \"Bette\" Davis  was an American actress of film, television and theater. Regarded as one of the greatest actresses in Hollywood history, she was noted for her willingness to play unsympathetic, sardonic characters and was reputed for her performances in a range of film genres, from contemporary crime melodramas to historical and period films and occasional comedies, although her greatest successes were her roles in romantic dramas.\nAfter appearing in Broadway plays, Davis moved to Hollywood in 1930, but her early films for Universal Studios  were unsuccessful. She joined Warner Bros. in 1932 and established her career with several critically acclaimed performances. In 1937 she attempted to free herself from her contract and although she lost a well-publicized legal case, it marked the beginning of the most successful period of her career. Until the late 1940s, she was one of American cinema's most celebrated leading ladies, known for her forceful and intense style. Davis gained a reputation as a perfectionist who could be highly combative, and confrontations with studio executives, film directors and costars were often reported. Her forthright manner, clipped vocal style and ubiquitous cigarette contributed to a public persona which has often been imitated and parodied.\nDavis was the co-founder of the Hollywood Canteen, and was the first female president of the Academy of Motion Picture Arts and Sciences. She won the Academy Award for Best Actress twice, was the first person to accrue 10 Academy Award nominations for acting, and was the first woman to receive a Lifetime Achievement Award from the American Film Institute. Her career went through several periods of eclipse, and she admitted that her success had often been at the expense of her personal relationships. Married four times, she was once widowed and thrice divorced, and raised her children as a single parent. Her final years were marred by a long period of ill health, but she continued acting until shortly before her death from breast cancer, with more than 100 films, television and theater roles to her credit. In 1999 Davis was placed second on the American Film Institute's list of the greatest female stars of classic Hollywood cinema.\n\n", "title": "Bette Davis"}