{"summary": "Wolverhampton is a city in England.", "full_text": "Beverley Knight MBE  is a British recording artist, radio presenter and musical theatre actress who released her debut album, The B-Funk, in 1995. Heavily influenced by American soul music icons such as Sam Cooke and Aretha Franklin, Knight has released seven studio albums to date. Widely labelled as one of Britain's greatest soul singers, Knight is best known for her hit singles \"Greatest Day\", \"Get Up!\", \"Shoulda Woulda Coulda\" and \"Come as You Are\".\nIn 2006 Knight solidified her transmission into the mainstream by starring in the BBC music TV series Just the Two of Us, a role she reprised in 2007. After releasing a platinum-selling compilation album in 2006, Knight went on to tour the UK with a reformed Take That. She has also hosted four series of the BBC Radio 2 show Beverley's Gospel Nights, which explores the origins and impact of gospel music. To date the show has run for four seasons and has featured interviews with stars such as Michelle Williams and Shirley Caesar.\nKnight is an ambassador for many charities such as Christian Aid and has travelled to areas affected by disease and poverty to help raise awareness. She is an active campaigner for anti-Aids organisations such as the Stop AIDS Campaign and The Terrence Higgins Trust and is also a vocal campaigner against homophobic lyrics in urban music. On Saturday, 15 August 2009, she performed live at the fourth annual UK Black Pride event in Regent's Park. On Friday 4 December 2009, at the invitation of Sarah Brown, wife of the Prime Minister, Knight performed the two songs \"Shoulda Woulda Coulda\" and \"Gold\" to an invited audience at 10 Downing Street in support of the White Ribbon Alliance for Safe Motherhood Million Mums charity.\nAfter more than a decade in the industry, Knight was made an MBE by Queen Elizabeth II in February 2007 in recognition of her charitable work and the contribution she has made to British music. In September 2005, Knight was made an honorary Doctor of Music from the University of Wolverhampton. After receiving a host of awards, including three MOBO Awards, Knight was presented with a Lifetime Achievement Award in 2004 at the Urban Music Awards in London.\nIn 2007, Knight was voted number 58 in the 100 Great Black Britons poll.\nKnight supported Prince during his residency at the O2 Arena and ended up performing at his after party. As a result of this, she was also flown to perform at his Oscars party in front of A-list stars and got a standing ovation from stars such as Quincy Jones. She is planning her American debut sometime in 2015.\n\nKnight sang at the London 2012 Paralympic Opening Ceremony. The performance was unanimously praised and a recorded version by Knight reached #101 on iTunes, her first charting single since \"Soul Survivor\" and highest since \"Beautiful Night\" in 2010 and 2009 respectively.\nOn 9 September 2013, Knight made her first foray into musical theatre, taking over the lead role of Rachel Marron from Heather Headley in The Bodyguard. On 21 February 2014, it was confirmed that Knight would take on the lead role of Felicia in the musical Memphis, opening on 23 October 2014.", "title": "Beverley Knight"}