{"summary": "Texas is the second largest state in the United States.", "full_text": "Big Lake is a small rural city in Reagan County, Texas, United States. As of the 2000 census, the city population was 2,885. It is the county seat of Reagan County.\nThe city takes its name from a dry lake, a unique dryland plains geographic feature situated atop the divide between the Rio Grande and Colorado River watersheds, located less than two miles south of the city, through which St Hwy 137 passes. The dry lake, with no outlet, is over two sections in size, making it the largest in Texas; it holds water temporarily and only after high runoff rain events, being used for grazing the remainder of the time. Though seasonal and temporal, the 'big playa lake', in wet periods, is significant in a semi-arid, drought-frequented environment and has been utilized regularly as a food and water resource by man and animal, alike, since prehistoric times.\nStarted as a small ranching community in the late 1880s, Big Lake owes its original existence to the Kansas City, Mexico and Orient Railway, which passed through the area in 1912 as it was extended from Sherwood, west of San Angelo, to Girvin and beyond the Pecos River. The growth from the railroad, coupled with that from the Santa Rita discovery well in 1923, allowed it, in 1925, to take over the position of county seat from Stiles, a pioneer ranching community established in 1894 on Centrailia Draw, approximately 20 miles to the north. The main highway through the area, US 67, was extended through the region in 1934, on the way to a termination in Presidio. The city's current existence is based on agriculture  and oil and gas service and production throughout the area.\n^ \"American FactFinder\". United States Census Bureau. Retrieved 2008-01-31. \n^ \"US Board on Geographic Names\". United States Geological Survey. 2007-10-25. Retrieved 2008-01-31. \n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07.", "title": "Big Lake, Texas"}