{"summary": "Billie Holiday  was an American jazz singer and songwriter.", "full_text": "Eleanora Fagan , professionally known as Billie Holiday, was an American jazz musician and singer-songwriter with a career spanning nearly thirty years. Nicknamed \"Lady Day\" by her friend and music partner Lester Young, Holiday had a seminal influence on jazz music and pop singing. Her vocal style, strongly inspired by jazz instrumentalists, pioneered a new way of manipulating phrasing and tempo. Holiday was known for her vocal delivery and improvisation skills, which made up for her limited range and lack of formal music education.\nAfter a turbulent childhood, Holiday began singing in nightclubs around Harlem. After being heard by producer John Hammond, who commended her voice, Holiday was signed to Brunswick Records in 1935. Collaborations with Teddy Wilson yielded the hit \"What a Little Moonlight Can Do\", which would later become a jazz standard. Throughout the 1930s and 1940s, Holiday booked mainstream success with labels such as Columbia Records and Decca Records. By the late 1940s, however, Holiday was beset with legal troubles and drug abuse. After a short prison sentence, Holiday performed a sold-out concert at Carnegie Hall. However, due to her drug and alcohol problems, her reputation deteriorated.\nThough she was a successful concert performer throughout the 1950s with two further sold-out shows at Carnegie Hall, Holiday's bad health, coupled with a string of abusive relationships and ongoing drug and alcohol abuse, caused her voice to wither. Her final recordings were met with mixed reaction to her damaged voice, but were mild commercial successes. Her final album, Lady in Satin, was released in 1958. Holiday died of cirrhosis of the liver in 1959. A posthumous album, Last Recordings, was released following her death.\nMuch of Holiday's material has been rereleased since her death, and she is considered a legendary performer with an ongoing influence on American music. Holiday is the recipient of four Grammy awards, all of them posthumous awards for Best Historical Album. Furthermore, Holiday herself was inducted into the Grammy Hall of Fame in 1973. Lady Sings the Blues, a film centered on Holiday's life, starring Diana Ross, was released in 1972.", "title": "Billie Holiday"}