{"summary": "William Jefferson \"Bill\" Clinton  is an American politician who served from 1993 to 2001 as the 42nd President of the United States.", "full_text": "William Jefferson Clinton , commonly known as Bill Clinton, is an American politician who served as the 42nd President of the United States from 1993 to 2001. He previously served as Governor of Arkansas from 1979 to 1981 and 1983 to 1992, and as the state's Attorney General from 1977 to 1979. A member of the Democratic Party, ideologically Clinton was a New Democrat, and many of his policies reflected a centrist Third Way philosophy of governance.\nClinton was born and raised in Arkansas, and is an alumnus of Georgetown University, where he was a member of Kappa Kappa Psi and Phi Beta Kappa and earned a Rhodes Scholarship to attend the University of Oxford. He is married to Hillary Clinton, who served as United States Secretary of State from 2009 to 2013 and who was a Senator from New York from 2001 to 2009. Both Clintons earned law degrees from Yale Law School, where they met and began dating. As Governor of Arkansas, Clinton overhauled the state's education system, and served as Chair of the National Governors Association.\nClinton was elected president in 1992, defeating incumbent George H. W. Bush. At age 46, he was the third-youngest president and the first from the baby boomer generation. Clinton presided over the longest period of peacetime economic expansion in American history, and signed into law the North American Free Trade Agreement. After failing to pass national health care reform, the Democratic House was ousted when the Republican Party won control of the Congress in 1994 for the first time in 40 years. Two years later, Clinton became the first Democrat since Franklin D. Roosevelt to be elected president twice. He passed welfare reform and the State Children's Health Insurance Program, providing health coverage for millions of children. In 1998, he was impeached for perjury before a grand jury and obstruction of justice during a lawsuit against him, both related to a scandal involving White House  employee Monica Lewinsky. He was acquitted by the U.S. Senate and served his complete term of office. The Congressional Budget Office reported a budget surplus between the years 1998 and 2000, the last three years of Clinton's presidency.\nClinton left office with the highest end-of-office approval rating of any U.S. president since World War II. Since then, he has been involved in public speaking and humanitarian work. Clinton created the William J. Clinton Foundation to address international causes such as the prevention of AIDS and global warming. In 2004, he published his autobiography My Life. He has remained active in politics by campaigning for Democratic candidates, including his wife's campaign for the 2008 Democratic presidential nomination, and then Barack Obama's presidential campaigns in 2008 and 2012. In 2009, he was named United Nations Special Envoy to Haiti, and after the 2010 Haiti earthquake he teamed with George W. Bush to form the Clinton Bush Haiti Fund. Since leaving office, Clinton has been rated highly in public opinion polls of U.S. presidents.", "title": "Bill Clinton"}