{"summary": "A binary star is two stars which orbit around each other.", "full_text": "A binary star is a star system consisting of two stars orbiting around their common barycenter. Systems of two, three, four, or even more stars are called multiple star systems. These systems, especially when more distant, often appear to the unaided eye as a single point of light, and are then revealed as double  by other means. Research over the last two centuries suggests that half or more of visible stars are part of multiple star systems.\nThe term double star is often used synonymously with binary star; however, double star can also mean optical double star. Optical doubles are so called because the two stars appear close together in the sky as seen from the Earth; they are almost on the same line of sight. Nevertheless, their \"doubleness\" depends only on this optical effect; the stars themselves are distant from one another and share no physical connection. A double star can be revealed as optical by means of differences in their parallax measurements, proper motions, or radial velocities. Most known double stars have not been studied sufficiently closely to determine whether they are optical doubles or they are doubles physically bound through gravitation into a multiple star system.\nBinary star systems are very important in astrophysics because calculations of their orbits allow the masses of their component stars to be directly determined, which in turn allows other stellar parameters, such as radius and density, to be indirectly estimated. This also determines an empirical mass-luminosity relationship  from which the masses of single stars can be estimated.\nBinary stars are often detected optically, in which case they are called visual binaries. Many visual binaries have long orbital periods of several centuries or millennia and therefore have orbits which are uncertain or poorly known. They may also be detected by indirect techniques, such as spectroscopy  or astrometry . If a binary star happens to orbit in a plane along our line of sight, its components will eclipse and transit each other; these pairs are called eclipsing binaries, or, as they are detected by their changes in brightness during eclipses and transits, photometric binaries.\nIf components in binary star systems are close enough they can gravitationally distort their mutual outer stellar atmospheres. In some cases, these close binary systems can exchange mass, which may bring their evolution to stages that single stars cannot attain. Examples of binaries are Sirius and Cygnus X-1 . Binary stars are also common as the nuclei of many planetary nebulae, and are the progenitors of both novae and type Ia supernovae.\n^ Filippenko, Alex, Understanding the Universe , Lecture 46, time 1:17, The Teaching Company, Chantilly, VA, USA, 2007", "title": "Binary star"}