{"summary": "A biologist is a scientist who studies biology.", "full_text": "A biologist, or biological scientist, is a scientist who studies living organisms, often in the context of their environment. Biologists involved in fundamental research attempt to explore and further explain the underlying mechanisms that govern the functioning of organisms. Biologists involved in applied research attempt to develop or improve more specific processes and understanding, in fields such as medicine, industry and agriculture.\nWhile \"biologist\" can apply to any scientist studying biology, most biologists research and specialise in specific fields. In this way, biologists investigate large-scale organism interactions , whole multicellular organisms, organs, tissues, cells, and small-scale cellular and molecular processes. Other biologists study less direct aspects of life, such as phylogeny and evolution.\nAs with other scientists, biologists conduct research based on the scientific method, with hypothesis formation, experimentation and documentation of methods and data.\nThere are many types of biologists. Some work on microorganisms while others study multicellular organisms. There is much overlap between different fields of biology such as botany, zoology, microbiology, genetics and evolutionary biology, and it is often difficult to classify a biologist as only one of them. Many jobs in biology as a field require an academic degree. A Ph.D. or its equivalent is generally required to direct independent research, and involves a specialization in a specific area of biology. Many biological scientists work in research and development. Some conduct fundamental research to advance our knowledge of living organisms, including bacteria and other pathogens. This research enhances understanding and adds to the scientific database of literature. Furthermore, it often aids the development of solutions to problems in areas such as human health and the natural environment. These biological scientists mostly work in government, university, and private industry laboratories. Many expand on specialized research that they started in post-graduate qualifications, such as a PhD.", "title": "Biologist"}