{"summary": "Biological warfare  is when pathogens are used as a weapon.", "full_text": "The Convention on the Prohibition of the Development, Production and Stockpiling of Bacteriological  and Toxin Weapons and on their Destruction  was the first multilateral disarmament treaty banning the production of an entire category of weapons.\nThe Convention was the result of prolonged efforts by the international community to establish a new instrument that would supplement the 1925 Geneva Protocol. The Geneva Protocol prohibits use but not possession or development of chemical and biological weapons.\nA draft of the BWC, submitted by the British was opened for signature on 10 April 1972 and entered into force 26 March 1975 when twenty-two governments had deposited their instruments of ratification. It commits the 173 states which are party to it as of December 2014 to prohibit the development, production, and stockpiling of biological and toxin weapons. However, the absence of any formal verification regime to monitor compliance has limited the effectiveness of the Convention. An additional nine states have signed the BWC but have yet to ratify the treaty.\nThe scope of the BWC's prohibition is defined in Article 1 . This includes all microbial and other biological agents or toxins and their means of delivery . Subsequent Review Conferences have reaffirmed that the general purpose criterion encompasses all future scientific and technological developments relevant to the Convention. It is not the objects themselves , but rather certain purposes for which they may be employed which are prohibited; similar to Art.II, 1 in the Chemical Weapons Convention . Permitted purposes under the BWC are defined as prophylactic, protective and other peaceful purposes. The objects may not be retained in quantities that have no justification or which are inconsistent with the permitted purposes.\nAs stated in Article 1 of the BWC:\n\"Each State Party to this Convention undertakes never in any circumstances to develop, produce, stockpile or otherwise acquire or retain:\n Microbial or other biological agents, or toxins whatever their origin or method of production, of types and in quantities that have no justification for prophylactic, protective or other peaceful purposes;\n Weapons, equipment or means of delivery designed to use such agents or toxins for hostile purposes or in armed conflict.\"\nThe United States Congress passed the Bioweapons Anti-Terrorism Act in 1989 to implement the Convention. The law applies the Convention's convent to countries and private citizens, and criminalizes violations of the Convention.", "title": "Biological Weapons Convention"}