{"summary": "Black-body radiation is radiation produced by heated objects, particularly from a kind of special object that is made so it will absorb all radiation  that falls on it, and so that it will also radiate at all frequencies that heat energy produces in it.", "full_text": "Black-body radiation is the type of electromagnetic radiation within or surrounding a body in thermodynamic equilibrium with its environment, or emitted by a black body  held at constant, uniform temperature. The radiation has a specific spectrum and intensity that depends only on the temperature of the body.\nThe thermal radiation spontaneously emitted by many ordinary objects can be approximated as blackbody radiation. A perfectly insulated enclosure that is in thermal equilibrium internally contains black-body radiation and will emit it through a hole made in its wall, provided the hole is small enough to have negligible effect upon the equilibrium.\nA black-body at room temperature appears black, as most of the energy it radiates is infra-red and cannot be perceived by the human eye. Because the human eye cannot perceive color at very low light intensities, a black body, viewed in the dark at the lowest just faintly visible temperature, subjectively appears grey , even though its objective physical spectrum peaks in the infrared range. When it becomes a little hotter, it appears dull red. As its temperature increases further it eventually becomes blindingly brilliant blue-white.\nAlthough planets and stars are neither in thermal equilibrium with their surroundings nor perfect black bodies, black-body radiation is used as a first approximation for the energy they emit. Black holes are near-perfect black bodies, in the sense that they absorb all the radiation that falls on them. It has been proposed that they emit black-body radiation , with a temperature that depends on the mass of the black hole.\nThe term black body was introduced by Gustav Kirchhoff in 1860. When used as a compound adjective, the term is typically written as hyphenated, for example, black-body radiation, but sometimes also as one word, as in blackbody radiation. Black-body radiation is also called complete radiation or temperature radiation or thermal radiation.\n\n", "title": "Black-body radiation"}