{"summary": "Blindness is the inability to see anything.", "full_text": "Visual impairment, also known as vision impairment or vision loss, is a decreased ability to see to a degree that causes problems not fixable by usual means, such as glasses. Some also include those who have a decreased ability to see because they do not have access to glasses or contact lenses. Visual impairment is often defined as a best corrected visual acuity of worse than either 20/40 or 20/60. The term blindness is used for complete or nearly complete vision loss. Visual impairment may cause people difficulties with normal daily activities such as driving, reading, socializing, and walking.\nThe most common causes of visual impairment globally are uncorrected refractive errors , cataracts , and glaucoma . Refractive errors include near sighted, far sighted, presbyopia, and astigmatism. Cataracts are the most common cause of blindness. Other disorders that may cause visual problems include age related macular degeneration, diabetic retinopathy, corneal clouding, childhood blindness, and a number of infections. Visual impairment can also be caused by problems in the brain due to stroke, prematurity, or trauma among others. These cases are known as cortical visual impairment. Screening for vision problems in children may improve future vision and educational achievement. Screening adults may also be beneficial. Diagnosis is by an eye exam.\nThe World Health Organization estimates that 80% of visual impairment is either preventable or curable with treatment. This includes cataracts, the infections river blindness and trachoma, glaucoma, diabetic retinopathy, uncorrected refractive errors, and some cases of childhood blindness. Many people with significant visual impairment benefit from vision rehabilitation, changes in their environmental, and assistive devices.\nAs of 2012 there were 285 million people who were visually impaired of which 246 million had low vision and 39 million were blind. The majority of people with poor vision are in the developing world and are over the age of 50 years. Rates of visual impairment have decreased since the 1990s. Visual impairments have considerable economic costs both directly due to the cost of treatment and indirectly due to decreased ability to work.", "title": "Blindness"}