{"summary": "Blue is one of the colors of the rainbow that people can see.", "full_text": "Blue is the colour between violet and green on the optical spectrum of visible light. Human eyes perceive blue when observing light with a wavelength between 450 and 495 nanometres. Blues with a higher frequency and thus a shorter wavelength gradually look more violet, while those with a lower frequency and a longer wavelength gradually appear more green. Pure blue, in the middle, has a wavelength of 470 nanometres. In painting and traditional colour theory, blue is one of the three primary colours of pigments, along with red and yellow, which can be mixed to form a wide gamut of colours. Red and blue mixed together form violet, blue and yellow together form green. Blue is also a primary colour in the RGB colour model, used to create all the colours on the screen of a television or computer monitor.\nThe modern English word blue comes from Middle English bleu or blewe, from the Old French bleu, a word of Germanic origin, related to the Old High German word blao. The clear sky and the deep sea appear blue because of an optical effect known as Rayleigh scattering. When sunlight passes through the atmosphere, the blue wavelengths are scattered more widely by the oxygen and nitrogen molecules, and more blue comes to our eyes. Rayleigh scattering also explains blue eyes; there is no blue pigment in blue eyes. Distant objects appear more blue because of another optical effect called atmospheric perspective.\nBlue has been used for art, decoration and as a clothing dye since ancient times. The semi-precious stone lapis lazuli, coming from mines in Afghanistan, was used in ancient Egypt for jewelry and ornament and later, in The Renaissance, to make the pigment ultramarine, the most expensive of all pigments. In the Middle Ages, cobalt blue was used to colour the stained glass windows of cathedrals. Beginning in the 9th century, Chinese artists used cobalt to make fine blue and white porcelain. Blue dyes for clothing were made from woad in Europe and indigo in Asia and Africa. In 1828 a synthetic ultramarine pigment was developed, and synthetic blue dyes and pigments gradually replaced mineral pigments and vegetable dyes. Pierre-Auguste Renoir, Vincent van Gogh and other late 19th century painters used ultramarine and cobalt blue not just to depict nature, but to create moods and emotions. In the late 18th century and 19th century, blue became a popular colour for military uniforms and police uniforms. In the 20th century, because blue was commonly associated with harmony, it was chosen as the colour of the flags of the United Nations and the European Union. Toward the end of the 20th century, dark blue replaced black and grey as the most common colour for business suits, because it was seen as serious without being grim.\nSurveys in the US and Europe show that blue is the colour most commonly associated with harmony, faithfulness, confidence, distance, infinity, the imagination, cold, and sometimes with sadness. In US and European public opinion polls it is overwhelmingly the most popular colour, chosen by almost half of both men and women as their favourite colour.", "title": "Blue"}