{"summary": "The blues is a form of music that started in the United States during the start of the 20th century.", "full_text": "Blues is a genre and musical form that originated in African-American communities in the \"Deep South\" of the United States around the end of the 19th century. The genre developed from a fusion of traditional African music and European folk music, that incorporated spirituals, work songs, field hollers, shouts and chants, and rhymed simple narrative ballads. The blues form, ubiquitous in jazz, rhythm and blues and rock and roll, is characterized by the call-and-response pattern, the blues scale and specific chord progressions, of which the twelve-bar blues is the most common. The blue notes  which are often thirds or fifths which are flatter in pitch than in other music styles, are also an important part of the sound. Blues shuffles or walking bass reinforce the trance-like rhythm and form a repetitive effect called a groove.\nBlues as a genre possesses other characteristics such as lyrics, bass lines, and instruments. The lyrics of early traditional blues verses consisted of a single line repeated four times. It was only in the first decades of the 20th century that the most common current structure became standard: the so-called AAB pattern, consisting of a line sung over the four first bars, its repetition over the next four, and then a longer concluding line over the last bars. Early blues frequently took the form of a loose narrative, often relating troubles experienced within African American society.\nMany elements, such as the call-and-response format and the use of blue notes, can be traced back to the music of Africa. The origins of the blues are also closely related to the religious music of the Afro-American community, the spirituals. The first appearance of the blues is often dated to after emancipation of slavery and, later, the development of juke joints. It is associated with the newly acquired freedom of the former slaves. Chroniclers began to report about blues music at the dawn of the 20th century. The first publication of blues sheet music was in 1908. Blues has since evolved from unaccompanied vocal music and oral traditions of slaves into a wide variety of styles and subgenres. Blues subgenres include country blues, such as Delta and Piedmont, as well as urban blues styles such as Chicago and West Coast blues. World War II marked the transition from acoustic to electric blues and the progressive opening of blues music to a wider audience, especially white listeners. In the 1960s and 1970s, a hybrid form called blues rock evolved.\n\n", "title": "Blues"}