{"summary": "The Book of Mormon is a book that Latter Day Saints believe is the word of God along with the Bible.", "full_text": "The Book of Mormon is a sacred text of the Latter Day Saint movement, which adherents believe contains writings of ancient prophets who lived on the American continent from approximately 2200 BC to AD 421. It was first published in March 1830 by Joseph Smith as The Book of Mormon: An Account Written by the Hand of Mormon upon Plates Taken from the Plates of Nephi.\nAccording to Smith's account and the book's narrative, the Book of Mormon was originally written in otherwise unknown characters referred to as \"reformed Egyptian\" engraved on golden plates. Smith said that the last prophet to contribute to the book, a man named Moroni, buried it in a hill in present-day New York, then returned to earth in 1827 as an angel, revealing the location of the book to Smith, and instructing him to translate it into English for use in the restoration of Christ's true church in the latter days. Critics claim that it was fabricated by Smith, drawing on material and ideas from contemporary 19th-century works rather than translating an ancient record.\nThe Book of Mormon has a number of original and distinctive doctrinal discussions on subjects such as the fall of Adam and Eve, the nature of the Atonement, eschatology, redemption from physical and spiritual death, and the organization of the latter-day church. The pivotal event of the book is an appearance of Jesus Christ in the Americas shortly after his resurrection.\nThe Book of Mormon is the earliest of the unique writings of the Latter Day Saint movement, the denominations of which typically regard the text primarily as scripture, and secondarily as a historical record of God's dealings with the ancient inhabitants of the Americas. The Book of Mormon is divided into smaller books, titled after the individuals named as primary authors and, in most versions, divided into chapters and verses. It is written in English very similar to the Early Modern English linguistic style of the King James Version of the Bible, and has since been fully or partially translated into 108 languages. As of 2011, more than 150 million copies of the Book of Mormon have been published.", "title": "Book of Mormon"}