{"summary": "The Book of Shadows is a a mix of religious text and personal diary content caried by many Wiccans.", "full_text": "A Book of Shadows is a book containing religious texts and instructions for magical rituals found within the Neopagan religion of Wicca. Originating within the Gardnerian tradition of the Craft, the first Book of Shadows was created by the pioneering Wiccan Gerald Gardner sometime in the late 1940s or early 1950s, and which he utilised first in his Bricket Wood coven and then in other covens which he founded in following decades. The concept of the Book of Shadows was then adopted by other Wiccan traditions, such as Alexandrianism and Mohsianism, and with the rise of books teaching people how to begin following Wicca in the 1970s onward, the idea of the Book of Shadows was then further propagated amongst solitary practitioners unconnected to earlier traditions.\nInitially, when Wicca was still dominated by covens, \"only one copy  existed for an entire coven, kept by the high priestess or high priest. That rule has proved unfeasible, and it is  commonplace for all Witches to have their own copies.\" In the various traditions that make up British Traditional Wicca, copies of the original Book composed by Gerald Gardner with the aid of his High Priestess Doreen Valiente, along with alterations and additions that have been made since then, is followed by adherents. They have tried to keep the contents of this Book a secret, although it has been published on a number of occasions by figures such as Charles Cardell, Lady Sheba, and Janet and Stewart Farrar. In other Wiccan traditions and amongst a number of solitary practitioners, alternate versions of the Book have been written that are independent of Gardner's original.\nNumerous associations and traditions have since grown up around the Book of Shadows. Traditionally, \"a Witch's book of shadows is destroyed upon death.\" The concept of the Book of Shadows has subsequently appeared in popular culture, for instance being utilised in the American television series Charmed and providing the title of films, musical albums and comics. However, in all these cases it was taken out of its original Wiccan context.", "title": "Book of Shadows"}