{"summary": "Boris Nikolayevich Yeltsin  was the first President of Russia and the country's first elected leader.", "full_text": "Boris Nikolayevich Yeltsin  was a Russian politician and the first President of the Russian Federation, serving from 1991 to 1999. Originally a supporter of Mikhail Gorbachev, Yeltsin emerged under the perestroika reforms as one of Gorbachev's most powerful political opponents. During the late 1980s, Yeltsin had been a member of the Politburo, and in late 1987 tendered a letter of resignation in protest. No one had resigned from the Politburo before. This act branded Yeltsin as a rebel and led to his rise in popularity as an anti-establishment figure.\nOn 29 May 1990 he was elected the chairman of the Russian Supreme Soviet. On 12 June 1991 he was elected by popular vote to the newly created post of President of the Russian Soviet Federative Socialist Republic , at that time one of the 15 constituent republics of the Soviet Union. Upon the resignation of Mikhail Gorbachev and the final dissolution of the Soviet Union on 25 December 1991, after which the RSFSR became the sovereign state of the Russian Federation, Yeltsin remained in office as president. He was reelected in the 1996 election, where critics widely claimed pervasive corruption; in the second round he defeated Gennady Zyuganov from the revived Communist Party by a margin of 13.7pp , despite the margin having been only 3.4pp during the first round. However, Yeltsin never recovered his early popularity after a series of economic and political crises in Russia in the 1990s.\nHe vowed to transform Russia's socialist economy into a capitalist market economy and implemented economic shock therapy, price liberalization and nationwide privatization. Due to the sudden total economic shift, a majority of the national property and wealth fell into the hands of a small number of oligarchs. The well-off millionaire and billionaire oligarchs likened themselves to 19th century robber barons. Rather than creating new enterprises, Yeltsin's democratization led to international monopolies hijacking the former Soviet markets, arbitraging the huge difference between old domestic prices for Russian commodities and the prices prevailing on the world market.\nMuch of the Yeltsin era was marked by widespread corruption, and as a result of persistent low oil and commodity prices during the 1990s, Russia suffered inflation, economic collapse and enormous political and social problems that affected Russia and the other former states of the USSR. Within a few years of his presidency, many of Yeltsin's initial supporters had started to criticize his leadership, and Vice President Alexander Rutskoy even denounced the reforms as \"economic genocide\".\nOngoing confrontations with the Supreme Soviet climaxed in the 1993 Russian constitutional crisis in which Yeltsin illegally ordered the dissolution of the Supreme Soviet parliament, which as a result decided to try to remove him from office. In October 1993, troops loyal to Yeltsin stopped an armed uprising outside of the parliament building, leading to a number of deaths. Yeltsin then scrapped the existing Russian constitution, banned political opposition and deepened his efforts to transform the economy.\nOn 31 December 1999, under enormous internal pressure, Yeltsin announced his resignation, leaving the presidency in the hands of his chosen successor, then-Prime Minister Vladimir Putin. Yeltsin left office widely unpopular with the Russian population.", "title": "Boris Yeltsin"}