{"summary": "Boron is a chemical element.", "full_text": "Boron is a metalloid chemical element with symbol B and atomic number 5. Produced entirely by cosmic ray spallation and supernovae and not by stellar nucleosynthesis, it is a low-abundance element in both the Solar system and the Earth's crust. Boron is concentrated on Earth by the water-solubility of its more common naturally occurring compounds, the borate minerals. These are mined industrially as evaporites, such as borax and kernite. The largest proven boron deposits are in Turkey, which is also the largest producer of boron minerals.\nChemically uncombined boron is found in small amounts in meteoroids but is not found naturally on Earth. Industrially, very pure boron is produced with difficulty, as boron tends to form refractory materials containing small amounts of carbon or other elements. Several allotropes of boron exist: amorphous boron is a brown powder, and crystalline boron is black, extremely hard , and a poor conductor at room temperature. The primary use of elemental boron is to make boron filaments, which are used in a similar way to carbon fibers in some high-strength materials.\nAlmost all boron use is as chemical compounds. About half of global consumption of boron compounds is as an additive in glass fibers of boron-containing fiberglass used for insulation or structural materials. The next leading use is in polymers and ceramics, that play specialized roles as high-strength lightweight structural and refractory materials. Borosilicate glass glassware is desired for its greater strength and thermal shock resistance than ordinary soda lime glass. Boron compounds are also used as fertilizers in agriculture, and in sodium perborate bleaches. In small-volume uses, boron is a dopant in semiconductors, and boron-containing reagents are used as intermediates in the synthesis of organic fine chemicals. A few boron-containing organic pharmaceuticals are used, or are in study. Natural boron is composed of two stable isotopes, one of which  has a number of uses as a neutron-capturing agent.\nIn biology, borates have low toxicity in mammals , but are more toxic to arthropods and are used as insecticides. Boric acid is mildly antimicrobial, and a natural boron-containing organic antibiotic is known. Boron is essential to life. Small amounts of boron compounds play a strengthening role in the cell walls of all plants, making boron a necessary plant nutrient. Boron is involved in the metabolism of calcium in both plants and animals. It is considered an essential nutrient for humans, and lack of boron is implicated in osteoporosis in humans.\n\n", "title": "Boron"}