{"summary": "Brandy Norwood , professionally known as Brandy, is a Grammy Award-winning American R&B singer, songwriter, dancer, and actress.", "full_text": "Brandy Rayana Norwood , better known mononymously as Brandy, is an American recording artist and actress. Born into a musical family in McComb, Mississippi and raised in Carson, California, she enrolled in performing arts schools as a child and performed as a backing vocalist for teen groups. From 1993 to 1994, Norwood appeared in a supporting role on the short-lived ABC sitcom Thea and signed with Atlantic Records. The following year, she released her self-titled debut album. Norwood starred in the UPN sitcom Moesha as the title character, which lasted six seasons and resulted in numerous other roles. She resumed her music career in 1998 with the widely successful duet with fellow R&B contemporary Monica, \"The Boy Is Mine\", and her second album, Never Say Never; it sold 16 million copies, featured two number one singles, and earned Norwood her first Grammy Award.\nThroughout the 2000s, Norwood held a precarious position in the pop industry. In 2002, she starred in the reality series Brandy: Special Delivery. Her third and fourth albums, Full Moon  and Afrodisiac , were released to critical success; however, they were not as commercially successful as her previous two albums in the 1990s. She served as a judge on the first season of America's Got Talent before being involved in a widely-publicized car accident in 2006. After several lawsuits stemming from the accident, Norwood's fifth album Human  was released to commercial failure.\nIn the 2010s, Norwood received a critical and commercial resurgence. In 2010, she returned to television as a contestant on the eleventh season of Dancing with the Stars and starred in the reality series Brandy & Ray J: A Family Business and the BET series The Game. She released her sixth album Two Eleven in 2012 to critical praise and in April 2015, Norwood made her Broadway debut in the musical Chicago. She is also set to star in her new sitcom Zoe Ever After which will premiere on the BET network in January 2016.\nWithin pop music, Norwood has become known for her distinctive sound, characterized by her peculiar timbre, voice-layering, intricate riffs, and beat-driven R&B. She has since been signed to both Epic Records and RCA Records, where she has acquired a catalogue of hits with singles such as \"What About Us?\", \"Talk About Our Love\", and \"Put It Down\" being her most successful. She has sold over 40 million records worldwide. The Recording Industry Association of America  lists Norwood as one of the top selling artists in the United States, with 10.5 million certified albums. Her work has earned her numerous awards and accolades, including a Grammy Award, three American Music Awards, and seven Billboard Music Awards.", "title": "Brandy Norwood"}