{"summary": "Bristol is a city in the United Kingdom.", "full_text": "Bristol  is a city, unitary authority and county in South West England with an estimated population of 442,500 in 2015. It is England's sixth and the United Kingdom's eighth most populous city, and the most populous city in Southern England after London. Bristol is one of the eight largest regional English cities that make up the Core Cities Group, and is ranked as a gamma world city by the Globalization and World Cities Research Network, the fourth highest ranked English city.\nPeople from the city are known as Bristolians. It borders the counties of Somerset and Gloucestershire, with the historic cities of Bath and Gloucester to the southeast and northeast, respectively. The city has a short coastline on the Severn Estuary .\nIron Age hill forts and Roman villas were built in the area around the confluence of the Rivers Frome and Avon, and it became known as Brycgstow  around the beginning of the 11th century. Bristol received a royal charter in 1155 and was part of Gloucestershire until 1373, when it became a county. From the 13th to the 18th century, Bristol was among the top three English cities after London  in tax receipts. Bristol was eclipsed by the rapid rise of Manchester, Liverpool and Birmingham during the Industrial Revolution.\nIts prosperity linked with the sea since its earliest days, Bristol was the base for the early voyages of exploration to the New World: on a ship out of Bristol in 1497 John Cabot, a Venetian, was the first European since the Vikings to land in North America, and in 1499 William Weston, a Bristol merchant, was the first Englishman to lead an exploration to North America. The Port of Bristol has since moved from Bristol Harbour in the city centre to the Severn Estuary at Avonmouth and Royal Portbury Dock.\nBristol's modern economy is built on the creative media, electronics and aerospace industries, and the city-centre docks have been redeveloped as centres of heritage and culture. The city has two universities, the University of the West of England and the University of Bristol and a variety of artistic and sporting organisations and venues including; The Royal West of England Academy, The Arnolfini, Spike Island, The Bristol Pavilion and The Memorial Stadium. It is well connected to London and other major UK cities by road, rail, sea and air including the M5 and M4 , Bristol Temple Meads and Bristol Parkway mainline rail stations, and Bristol Airport.\nOne of the UK's most popular tourist destinations, Bristol was selected in 2009 as one of the world's top-ten cities by international travel publishers Dorling Kindersley in their Eyewitness guides for young adults. The The Sunday Times named Bristol the best city to live in Britain in 2014, and won the EU's European Green Capital Award in 2015.\n\n", "title": "Bristol"}