{"summary": "British people, or Britons, are the people who live in Great Britain or citizens of the United Kingdom, of the Isle of Man, one of the Channel Islands, or of one of the British overseas territories.", "full_text": "British people, or Britons, are the citizens of the United Kingdom, British Overseas Territories, Crown Dependencies; and their descendants. British nationality law governs modern British citizenship and nationality, which can be acquired, for instance, by descent from British nationals. When used in a historical context, British people refers to the ancient Britons, the indigenous inhabitants of Great Britain south of the Forth.\nAlthough early assertions of being British date from the Late Middle Ages, the creation of the Kingdom of Great Britain in 1707 triggered a sense of British national identity. The notion of Britishness was forged during the Napoleonic Wars between Britain and the First French Empire, and developed further during the Victorian era. The complex history of the formation of the United Kingdom created a \"particular sense of nationhood and belonging\" in Great Britain and Ireland; Britishness became \"superimposed on much older identities\", of English, Scots, Welsh and Irish cultures, whose distinctiveness still resist notions of a homogenised British identity. Because of longstanding ethno-sectarian divisions, British identity in Ireland is controversial, but it is held with strong conviction by unionists.\nModern Britons are descended mainly from the varied ethnic groups that settled in the British Isles before the eleventh century. Prehistoric, Celtic, Roman, Anglo-Saxon, and Norse influences were blended in Britain under the Normans, descended from Scandinavian settlers in northern France. Conquest and union facilitated migration, cultural and linguistic exchange, and intermarriage between the peoples of England, Scotland and Wales during the Middle Ages, Early Modern period and beyond. Since 1922, there has been immigration to the United Kingdom by people from what is now the Republic of Ireland, the Commonwealth, mainland Europe and elsewhere; they and their descendants are mostly British citizens with some assuming a British, dual or hyphenated identity.\nThe British are a diverse, multi-national and multicultural society, with \"strong regional accents, expressions and identities\". The social structure of the United Kingdom has changed radically since the nineteenth century, with the decline in religious observance, enlargement of the middle class, and increased ethnic diversity. The population of the UK stands at around 62.5 million, with a British diaspora of around 140 million concentrated in Australia, Canada, South Africa, Hong Kong, New Zealand and the United States.", "title": "British people"}