{"summary": "In communications, such as radio and television, broadcasting means sending information such as television shows or music electronically to a large audience.", "full_text": "Broadcasting is the distribution of audio and/or video content to a dispersed audience via any electronic mass communications medium, but typically one using the electromagnetic spectrum , in a one-to-many model. Broadcasting began with AM radio broadcasting which came into popular use starting with the invention of the crystal detector in 1906. Before this, all forms of electronic communication, radio, telephone, and telegraph, were \"one-to-one\", with the message intended for a single recipient. The term \"broadcasting\", borrowed from the agricultural method of sowing seeds in a field by casting them broadly about, was coined by either KDKA manager Frank Conrad or RCA historian George Clark around 1920 to distinguish this new activity of \"one-to-many\" communication; a single radio station transmitting to multiple listeners.\nOver the air Broadcasting is usually associated with radio and television, though in practice radio and television transmissions take place using both wires and radio waves. The receiving parties may include the general public or a relatively small subset; the point is that anyone with the appropriate receiving technology can receive the signal. The field of broadcasting includes a wide range of practices, from relatively private exchanges such as public radio, community radio and commercial radio, public television, and commercial television.\nU.S. Code of Federal Regulations, title 47, part 97 defines \"broadcasting\" as \"transmissions intended for reception by the general public, either direct or relayed\". Private or two-way telecommunications transmissions do not qualify under this definition. For example, amateur  and citizens band  radio operators are not allowed to broadcast. As defined, \"transmitting\" and \"broadcasting\" are not the same.\nTransmission of radio and television programs from a radio or television station to home receivers over the spectrum is referred to as OTA  or terrestrial broadcasting and in most countries requires a broadcasting license. Transmissions using a combination of satellite and wired transmission, like cable television , are also considered broadcasts, and do not require a license. Transmissions of television and radio via streaming digital technology have increasingly been referred to as broadcasting as well, though strictly speaking this is incorrect.\n\n", "title": "Broadcasting"}