{"summary": "Brownian motion is the random motion of particles in a liquid or a gas.", "full_text": "Brownian motion or pedesis  is the random motion of particles suspended in a fluid  resulting from their collision with the quick atoms or molecules in the gas or liquid. Wiener Process refers to the mathematical model used to describe such Brownian Motion, which is often called a particle theory\nThis transport phenomenon is named after the botanist Robert Brown. In 1827, while looking through a microscope at particles trapped in cavities inside pollen grains in water, he noted that the particles moved through the water but was not able to determine the mechanisms that caused this motion. Atoms and molecules had long been theorized as the constituents of matter, and many decades later, Albert Einstein published a paper in 1905 that explained in precise detail how the motion that Brown had observed was a result of the pollen being moved by individual water molecules. This explanation of Brownian motion served as definitive confirmation that atoms and molecules actually exist, and was further verified experimentally by Jean Perrin in 1908. Perrin was awarded the Nobel Prize in Physics in 1926 \"for his work on the discontinuous structure of matter\" . The direction of the force of atomic bombardment is constantly changing, and at different times the particle is hit more on one side than another, leading to the seemingly random nature of the motion.\nThe mathematical model of Brownian motion has numerous real-world applications. For instance, stock market fluctuations are often cited, although Benoit Mandelbrot rejected its applicability to stock price movements in part because these are discontinuous.\nBrownian motion is among the simplest of the continuous-time stochastic  processes, and it is a limit of both simpler and more complicated stochastic processes . This universality is closely related to the universality of the normal distribution. In both cases, it is often mathematical convenience, rather than the accuracy of the models, that motivates their use.", "title": "Brownian motion"}