{"summary": "Charles Hardin Holley or Buddy Holly  was an American rock and roll singer, songwriter, and musician.", "full_text": "Charles Hardin Holley , known as Buddy Holly, was an American musician and singer/songwriter who was a central figure of mid-1950s rock and roll. Holly was born in Lubbock, Texas, to a musical family during the Great Depression; he learned to play guitar and to sing alongside his siblings. His style was influenced by country music and rhythm and blues acts, and he performed in Lubbock with his friends from high school. He made his first appearance on local television in 1952, and the following year he formed the group \"Buddy and Bob\" with his friend Bob Montgomery. In 1955, after opening for Elvis Presley, Holly decided to pursue a career in music. He opened for Presley three times that year; his band's style shifted from country and western to entirely rock and roll. In October that year, when he opened for Bill Haley & His Comets, Holly was spotted by Nashville scout Eddie Crandall, who helped him get a contract with Decca Records.\nHolly's recording sessions at Decca were produced by Owen Bradley. Holly was unhappy with Bradley's restrictions and the results of their work, and went to producer Norman Petty in Clovis, New Mexico, where, among other songs, they recorded a demo of \"That'll Be the Day\". Petty became the band's manager and he sent the demo to Brunswick Records, which released it as a single credited to \"The Crickets\", which became the name of Holly's band. In September 1957, as the band toured, \"That'll Be the Day\" topped the US \"Best Sellers in Stores\" chart and the UK Singles Chart. Its success was followed in October by another major hit, \"Peggy Sue\".\nIn November 1957, the album Chirping Crickets was released; it reached number five on the UK Albums Chart. By January 1958, Holly had appeared twice on The Ed Sullivan Show. Following his second performance on the show, he toured Australia and then the UK. In early 1959, Holly assembled a new band consisting of future country music icon Waylon Jennings  and Tommy Allsup , and embarked on a tour of the Midwestern U.S. After a show in Clear Lake, Iowa, Holly chartered an airplane to travel to his next show in Moorhead, Minnesota. Soon after takeoff, the plane crashed, killing Holly, Ritchie Valens, the Big Bopper, and the pilot. It was a milestone in rock history known as The Day the Music Died.\nDuring his short career, Holly wrote, recorded, and produced his own material. He is often regarded as the act that defined the traditional rock-and-roll lineup of two guitars, bass, and drums. Holly was a major influence on later popular music artists and bands, including the Beatles, the Rolling Stones, Eric Clapton, and Elton John. He was among the first acts to be inducted into the Rock and Roll Hall of Fame in 1986, and later ranked by Rolling Stone at number 13 on its list of \"100 Greatest Artists\".\n\n", "title": "Buddy Holly"}