{"summary": "The Buenos Aires Convention  is an international copyright treaty.", "full_text": "The Buenos Aires Convention is a copyright treaty signed at Buenos Aires, Argentina, on 11 August 1910, providing mutual recognition of copyrights where the work carries a notice containing a statement of reservation of rights . This was commonly done with the phrase \"All rights reserved\"  next to the copyright notice. This implementation varied as US law only required the author and year of publishing. Copyright protection under the Convention is granted for the shorter of the terms of the protecting country and the source country of the work . The rather vague nature of the requirement for a statement of reservation led to the development of longer and more legalistic wordings, which have persisted despite the developments in international copyright law.\nThe Convention is specifically retained by the Universal Copyright Convention  of 6 September 1952 , with the most recent formulation taking precedence in case of conflict. As the Buenos Aires Convention was not modified, the presence of a simple copyright notice was sufficient to ensure mutual recognition of copyright between countries which became parties to the UCC . As of 23 August 2000 , all parties to the Buenos Aires Convention are also parties to the Berne Convention for the Protection of Literary and Artistic Works, which provides for mutual recognition of copyright without any formalities whatsoever .\nThe Buenos Aires Convention became a \"special agreement\" in the terms of Article 20 of the Berne Convention. It remains in force, notably for determining the source country of a work and hence the term of protection which is applicable in countries which apply the \"rule of the shorter term\": when a work is simultaneously published in a Convention State and a non-Convention State, the Convention State will be taken to be the source country regardless of the term of protection in the non-Convention State.\nSources: U.S. Copyright Office, UNESCO, WIPO", "title": "Buenos Aires Convention"}