{"summary": "Bulgaria  is a country in southeastern Europe.", "full_text": "Bulgaria , officially the Republic of Bulgaria , is a country in southeastern Europe. It is bordered by Romania to the north, Serbia and Macedonia to the west, Greece and Turkey to the south, and the Black Sea to the east. With a territory of 110,994 square kilometres , Bulgaria is Europe's 16th-largest country.\nOrganised prehistoric cultures began developing on Bulgarian lands during the Neolithic period. Its ancient history saw the presence of the Thracians and later the Persians, Greeks and Romans. The emergence of a unified Bulgarian state dates back to the establishment of the First Bulgarian Empire in 681 AD, which dominated most of the Balkans and functioned as a cultural hub for Slavs during the Middle Ages. With the downfall of the Second Bulgarian Empire in 1396, its territories came under Ottoman rule for nearly five centuries. The Russo-Turkish War  led to the formation of the Third Bulgarian State. The following years saw several conflicts with its neighbours, which prompted Bulgaria to align with Germany in both world wars. In 1946 it became a single-party socialist state as part of the Soviet-led Eastern Bloc. In December 1989 the ruling Communist Party allowed multi-party elections, which subsequently led to Bulgaria's transition into a democracy and a market-based economy.\nBulgaria's population of 7.4 million people is predominantly urbanised and mainly concentrated in the administrative centres of its 28 provinces. Most commercial and cultural activities are centred on the capital and largest city, Sofia. The strongest sectors of the economy are heavy industry, power engineering, and agriculture, all of which rely on local natural resources.\nThe country's current political structure dates to the adoption of a democratic constitution in 1991. Bulgaria is a unitary parliamentary republic with a high degree of political, administrative, and economic centralisation. It is a member of the European Union, NATO, and the Council of Europe; a founding state of the Organization for Security and Co-operation in Europe ; and has taken a seat at the UN Security Council three times.", "title": "Bulgaria"}