{"summary": "A calculator is a machine which allows people to do math operations more easily.", "full_text": "An electronic calculator is a small, portable electronic device used to perform both basic operations of arithmetic and complex mathematical operations.\nThe first solid state electronic calculator was created in the 1960s, building on the extensive history of tools such as the abacus, developed around 2000 BC, and the mechanical calculator, developed in the 17th century. It was developed in parallel with the analog computers of the day.\nThe pocket sized devices became available in the 1970s, especially after the first microprocessor developed by Intel for the Japanese calculator company Busicom. They later became commonly used within the Oil and Gas industry.\nModern electronic calculators vary from cheap, give-away, credit-card-sized models to sturdy desktop models with built-in printers. They became popular in the mid-1970s as integrated circuits made their size and cost small. By the end of that decade, calculator prices had reduced to a point where a basic calculator was affordable to most and they became common in schools.\nComputer operating systems as far back as early Unix have included interactive calculator programs such as dc and hoc, and calculator functions are included in almost all PDA-type devices .\nIn addition to general purpose calculators, there are those designed for specific markets; for example, there are scientific calculators which include trigonometric and statistical calculations. Some calculators even have the ability to do computer algebra. Graphing calculators can be used to graph functions defined on the real line, or higher-dimensional Euclidean space. Currently, basic calculators are inexpensive, but the scientific and graphing models tend to be higher priced.\nIn 1986, calculators still represented an estimated 41% of the world's general-purpose hardware capacity to compute information. This diminished to less than 0.05% by 2007.", "title": "Calculator"}