{"summary": "Caligula , was the third Roman Emperor.", "full_text": "Caligula  was the popular nickname of Gaius Julius Caesar Augustus Germanicus , Roman emperor . Born Gaius Julius Caesar , Caligula was a member of the house of rulers conventionally known as the Julio-Claudian dynasty. Caligula's father Germanicus, the nephew and adopted son of Emperor Tiberius, was a very successful general and one of Rome's most beloved public figures. The young Gaius earned the nickname \"Caligula\"  from his father's soldiers while accompanying him during his campaigns in Germania.\nWhen Germanicus died at Antioch in AD 19, his wife Agrippina the Elder returned with her six children to Rome, where she became entangled in a bitter feud with Tiberius. The conflict eventually led to the destruction of her family, with Caligula as the sole male survivor. Untouched by the deadly intrigues, Caligula accepted the invitation to join the Emperor in AD 31 on the island of Capri, where Tiberius had withdrawn five years earlier. With the death of Tiberius in AD 37, Caligula succeeded his grand uncle and adoptive grandfather as emperor.\nThere are few surviving sources about the reign of Emperor Caligula, although he is described as a noble and moderate ruler during the first six months of his reign. After this, the sources focus upon his cruelty, sadism, extravagance, and sexual perversity, presenting him as an insane tyrant. While the reliability of these sources is questionable, it is known that during his brief reign, Caligula worked to increase the unconstrained personal power of the emperor, as opposed to countervailing powers within the principate. He directed much of his attention to ambitious construction projects and luxurious dwellings for himself, and initiated the construction of two aqueducts in Rome: the Aqua Claudia and the Anio Novus. During his reign, the empire annexed the Kingdom of Mauretania as a province.\nIn early AD 41, Caligula was assassinated as a result of a conspiracy by officers of the Praetorian Guard, senators, and courtiers. The conspirators' attempt to use the opportunity to restore the Roman Republic was thwarted: on the day of the assassination of Caligula, the Praetorian Guard declared Caligula's uncle, Claudius, the next Roman emperor.", "title": "Caligula"}