{"summary": "Canada is a country in the northern part of North America.", "full_text": "Canada  is a country, consisting of ten provinces and three territories, in the northern part of the continent of North America. It extends from the Atlantic to the Pacific and northward into the Arctic Ocean, covering 9.98 million square kilometres  in total, making it the world's second-largest country by total area and the fourth-largest country by land area. Canada's common border with the United States forms the world's longest land border. Canada is sparsely populated overall, the majority of its land territory being dominated by forest and tundra as well as the mountain range of the Rocky Mountains; about four-fifths of the population live near to the southern border. The majority of Canada has a cold or severely cold winter climate, but southerly areas are warm in summer.\nThe land now called Canada has been inhabited for millennia by various Aboriginal peoples. Beginning in the late 15th century, British and French colonies were established on the region's Atlantic coast. As a consequence of various conflicts, the United Kingdom gained and lost North American territories until left, in the late 18th century, with what mostly comprises Canada today. Pursuant to the British North America Act, on July 1, 1867, three colonies joined to form the autonomous federal Dominion of Canada. This began an accretion of provinces and territories to the new self-governing Dominion. In 1931, Britain granted Canada near total independence with the Statute of Westminster 1931 and full sovereignty was attained when the Canada Act 1982 severed the vestiges of legal dependence on the British parliament.\nCanada is a federal parliamentary democracy and a constitutional monarchy, Queen Elizabeth II being the current head of state. The country is officially bilingual at the federal level. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many countries, with a population of approximately 35 million as of 2015. Its advanced economy is the eleventh largest in the world, relying chiefly upon its abundant natural resources and well-developed international trade networks. Canada's long and complex relationship with the United States has had a significant impact on its economy and culture.\nCanada is a developed country and one of the wealthiest in the world, with the tenth highest nominal per capita income globally, and the eighth highest ranking in the Human Development Index. It ranks among the highest in international measurements of government transparency, civil liberties, quality of life, economic freedom, and education. Canada is a Commonwealth Realm member of the Commonwealth of Nations, a member of the Francophonie, and part of several major international and intergovernmental institutions or groupings including the North Atlantic Treaty Organization, the G8, the Group of Ten, the G20, the North American Free Trade Agreement and the Asia-Pacific Economic Cooperation forum.", "title": "Canada"}