{"summary": "Perry Como  was an American singer.", "full_text": "Canonsburg is a borough in Washington County, Pennsylvania, 18 miles  southwest of Pittsburgh. Canonsburg was laid out by Colonel John Canon in 1789 and incorporated in 1802.\nThe borough is in a rich coal district, and most of the town's work force once worked in local steel mills or coal mines. Canonsburg's population in 1910, including South Canonsburg, which was annexed in 1911, was 5,588; in 1920 it was 10,632; and in 1940 it was 12,599. The population was 8,992 at the 2010 census.\nInterstate 79 and Route 19 pass through the town, as do several railroad lines. The active railroad system in Canonsburg is now The Pittsburgh and Ohio Central Railroad. A trolley used to operate from Washington, Pennsylvania to Pittsburgh through Canonsburg until 1953.\nCanonsburg was home to singers Perry Como and Bobby Vinton, Bobby Shawn, Esther \"Essie\" Scott, the first African-American female to be recognized in Canonsburg's Bi-Centennial Publication, Bill Schmidt, Olympian bronze medalist in the javelin throw in Munich, 1972, the only American to ever medal in that event, and Bishop Theodosius Lazor, Metropolitan Bishop for the Orthodox Church in America. Jonathan Letterman, the \"Father of Battlefield Medicine\" during the Civil War, was also born in Canonsburg. The town was the birthplace of the members of the vocal group, The Four Coins, popular in the 1950s and 60s.\nThe town is home to Sarris Candies and is adjacent to the Southpointe office park located in Cecil Township, which has a number of large corporate tenants. Yenko Chevrolet, one of largest and most notorious custom muscle car shops of the late 1960s and early 1970s, was also located in Canonsburg.\nCanonsburg is also home to the Pittsburgh Cougars. They are a United Junior Hockey League team. The Cougars home is the Iceoplex at South Point just outside of Canonsburg.\nCanonsburg is home to an annual Oktoberfest. An episode  in the television series, \"Supernatural\", featured an episode taking place in the town while the Oktoberfest celebration is occurring.  Also, second-largest Fourth of July parade in the state of Pennsylvania, second only to Philadelphia. In the weeks leading up to the parade, the town frequently gains media attention for its residents setting up folding chairs along the town's main street to stake claim to prime viewing areas.\nThe borough is served by the Canon-McMillan School District.\n\n", "title": "Canonsburg, Pennsylvania"}