{"summary": "Death penalty, also called capital punishment, is when a government or state executes  someone, usually but not always because they have committed a serious crime.", "full_text": "Capital punishment, death penalty or execution is punishment by death. The sentence is referred to as a death sentence. Crimes that can result in a death penalty are known as capital crimes or capital offences. The term capital originates from the Latin capitalis, literally \"regarding the head\" .\nCapital punishment has, in the past, been practiced by most societies, as a punishment for criminals, and political or religious dissidents. Historically, the carrying out of the death sentence was often accompanied by torture, and executions were most often public.\nThirty-six countries actively practice capital punishment, 103 countries have completely abolished it de jure for all crimes, 6 have abolished it for ordinary crimes only , and 50 have abolished it de facto .\nNearly all countries in the world prohibit the execution of individuals who were under the age of 18 at the time of their crimes; since 2009, only Iran, Saudi Arabia, Sudan and Pakistan have carried out such executions. Executions of this kind are prohibited under international law.\nCapital punishment is a matter of active controversy in various countries and states, and positions can vary within a single political ideology or cultural region. In the European Union member states, Article 2 of the Charter of Fundamental Rights of the European Union prohibits the use of capital punishment. The Council of Europe, which has 47 member states, also prohibits the use of the death penalty by its members.\nThe United Nations General Assembly has adopted, in 2007, 2008, 2010, 2012 and 2014 non-binding resolutions calling for a global moratorium on executions, with a view to eventual abolition. Although many nations have abolished capital punishment, over 60% of the world's population live in countries where executions take place, such as China, India, the United States and Indonesia.", "title": "Capital punishment"}