{"summary": "A car is a vehicle used to transport passengers.", "full_text": "A car is a wheeled, self-powered motor vehicle used for transportation. Most definitions of the term specify that cars are designed to run primarily on roads, to have seating for one to eight people, to typically have four wheels, and to be constructed principally for the transport of people rather than goods. The year 1886 is regarded as the birth year of the modern car. In that year, German inventor Karl Benz built the Benz Patent-Motorwagen. Cars did not become widely available until the early 20th century. One of the first cars that was accessible to the masses was the 1908 Model T, an American car manufactured by the Ford Motor Company. Cars were rapidly adopted in the United States of America, where they replaced animal-drawn carriages and carts, but took much longer to be accepted in Western Europe and other, less developed, parts of the world.\nCars are equipped with controls used for driving, parking, passenger comfort and safety and controlling a variety of lights. As of the 2010s, controls have been added to vehicles, making them more complex. Examples include rear reversing cameras, air conditioning, navigation systems, and in car entertainment. Most cars in use in the 2010s are propelled by an internal combustion engine, fueled by deflagration of gasoline  or diesel. Both fuels cause air pollution and are also blamed for contributing to climate change and global warming. Vehicles using alternative fuels such as ethanol flexible-fuel vehicles and natural gas vehicles are also gaining popularity in some countries. Electric cars, which were invented early in the history of the automobile, began to become commercially available in 2008.\nThere are costs and benefits to car use. The costs of car usage include the cost of: acquiring the vehicle, interest payments , repairs and auto maintenance, fuel, depreciation, driving time, parking fees, taxes, and insurance. The costs to society of car use include: maintaining roads, land use, road congestion, air pollution, public health, health care, and disposing of the vehicle at the end of its life. Road traffic accidents are the largest cause of injury-related deaths worldwide.\nThe benefits may include on-demand transportation, mobility, independence and convenience. The societal benefits may include: economic benefits, such as job and wealth creation from car production, sales and maintenance, transportation provision, society well-being derived from leisure and travel opportunities, and revenue generation from the tax opportunities. The ability for humans to move flexibly from place to place has far-reaching implications for the nature of societies. It was estimated in 2010 that the number of cars had risen to over 1 billion vehicles, up from the 500 million of 1986. The numbers are increasing rapidly, especially in China, India and other NICs.", "title": "Car"}