{"summary": "Carbon dioxide  is a chemical compound.", "full_text": "Carbon dioxide  is a colorless, odorless gas vital to life on Earth. This naturally occurring chemical compound is composed of a carbon atom covalently double bonded to two oxygen atoms. Carbon dioxide exists in the Earth's atmosphere as a trace gas at a concentration of about 0.04 percent  by volume. Natural sources include volcanoes, hot springs and geysers and it is freed from carbonate rocks by dissolution in water and acids. Since carbon dioxide is soluble in water, it occurs naturally in groundwater, rivers and lakes, in ice caps and glaciers and in seawater. It is present in deposits of petroleum and natural gas.\nAtmospheric carbon dioxide is the primary source of carbon in life on Earth and its concentration in Earth's pre-industrial atmosphere since late in the Precambrian was regulated by photosynthetic organisms and geological phenomena. As part of the carbon cycle, plants, algae, and cyanobacteria use light energy to photosynthesize carbohydrate from carbon dioxide and water, with oxygen produced as a waste product. Carbon dioxide is produced by plants during respiration.\nCarbon dioxide  is a product of respiration of all aerobic organisms. It is returned to water via the gills of fish and to the air via the lungs of air-breathing land animals, including humans. Carbon dioxide is produced during the processes of decay of organic materials and the fermentation of sugars in bread, beer and winemaking. It is produced by combustion of wood, carbohydrates and fossil fuels such as coal, peat, petroleum and natural gas.\nIt is a versatile industrial material, used, for example, as an inert gas in welding and fire extinguishers, as a pressurizing gas in air guns and oil recovery, as a chemical feedstock and in liquid form as a solvent in decaffeination of coffee and supercritical drying. It is added to drinking water and carbonated beverages including beer and champagne to add sparkle. The frozen solid form of CO2, known as \"dry ice\" is used as a refrigerant and as an abrasive in dry-ice blasting.\nCarbon dioxide is an important greenhouse gas. Burning of carbon-based fuels since the industrial revolution has rapidly increased its concentration in the atmosphere, leading to global warming. It is also a major cause of ocean acidification since it dissolves in water to form carbonic acid.", "title": "Carbon dioxide"}