{"summary": "Cardiff is the capital and biggest city of Wales, in the United Kingdom.", "full_text": "Cardiff  is the capital and largest city in Wales and the tenth largest city in the United Kingdom. The city is the country's chief commercial centre, the base for most national cultural and sporting institutions, the Welsh national media, and the seat of the National Assembly for Wales. The unitary authority area's mid-2011 population was estimated to be 346,100, while the population of the Larger Urban Zone was estimated at 861,400 in 2009. Cardiff is part of the Cardiff and south Wales valleys metropolitan area of about 1,100,000 people. Cardiff is a significant tourist centre and the most popular visitor destination in Wales with 18.3 million visitors in 2010. In 2011, Cardiff was ranked sixth in the world in National Geographic's alternative tourist destinations.\nThe city of Cardiff is the county town of the historic county of Glamorgan . Cardiff is part of the Eurocities network of the largest European cities. The Cardiff Urban Area covers a slightly larger area outside the county boundary, and includes the towns of Dinas Powys and Penarth. A small town until the early 19th century, its prominence as a major port for the transport of coal following the arrival of industry in the region contributed to its rise as a major city.\nCardiff was made a city in 1905, and proclaimed the capital of Wales in 1955. Since the 1990s, Cardiff has seen significant development. A new waterfront area at Cardiff Bay contains the Senedd building, home to the Welsh Assembly and the Wales Millennium Centre arts complex. Current developments include the continuation of the redevelopment of the Cardiff Bay and city centre areas with projects such as the Cardiff International Sports Village, a BBC drama village, and a new business district in the city centre.\nSporting venues in the city include the Millennium Stadium , SWALEC Stadium , Cardiff City Stadium , Cardiff International Sports Stadium  and Cardiff Arms Park . The city was awarded with the European City of Sport in 2009 due to its role in hosting major international sporting events. Again Cardiff was the European City of Sport in 2014. The Millennium Stadium hosted 11 football matches as part of the 2012 Summer Olympics, including the games' opening event and the men's bronze medal match.", "title": "Cardiff"}