{"summary": "Carly Simon  is an American singer-songwriter.", "full_text": "Carly Elisabeth Simon  is an American singer-songwriter, musician and children's author. She first rose to fame in the 1970s with a string of hit records; her 13 Top 40 U.S. hits include \"Anticipation\" , \"You Belong To Me\" , \"Coming Around Again\" , and her four Gold certified singles \"Jesse\" , \"Mockingbird\" , a duet with James Taylor, \"You're So Vain\" , and \"Nobody Does It Better\"  from the 1977 James Bond film, The Spy Who Loved Me.\nAfter a brief stint with her sister Lucy Simon as duo group the Simon Sisters, she found great success as a solo artist with her 1971 self-titled debut album Carly Simon, which won her the Grammy Award for Best New Artist, and spawned her first Top 10 single \"That's the Way I've Always Heard It Should Be\". Simon achieved international fame with her breakthrough album No Secrets which sat firmly at No. 1 on the Billboard 200 for 5 weeks, and spawned the worldwide hit \"You're So Vain\", for which she received three Grammy nominations, including Record of the Year and Song of the Year. Over the course of her career, Simon has amassed 24 Billboard Hot 100 charting singles, 28 Billboard Adult Contemporary charting singles, and has won two Grammy Awards. AllMusic called Simon, \"One of the quintessential singer/songwriters of the '70s\". Simon has a contralto vocal range.\nFor her 1988 hit \"Let the River Run\", from the film Working Girl, Simon became the first artist in history to win a Grammy Award, an Academy Award, and a Golden Globe Award for a song composed and written, as well as performed, entirely by a single artist. She was inducted into the Songwriters Hall of Fame in 1994, inducted into the Grammy Hall of Fame for \"You're So Vain\" in 2004, and awarded the ASCAP Founders Award in 2012. In 1995 and 1998, respectively, Simon received the Boston Music Awards Lifetime Achievement and a Berklee College of Music Honorary Doctor of Music Degree.\nSimon is the former wife of another notable singer-songwriter, James Taylor. Simon and Taylor have two children together, Sarah \"Sally\" Maria Taylor and Benjamin \"Ben\" Simon Taylor, who are also musicians.", "title": "Carly Simon"}