{"summary": "The Central Intelligence Agency  is a part of the Federal government of the United States.", "full_text": "The Central Intelligence Agency  is a civilian foreign intelligence service of the U.S. Government, tasked with gathering, processing and analyzing national security information from around the world, primarily through the use of human intelligence . As one of the principal members of the U.S. Intelligence Community , the CIA reports to the Director of National Intelligence and is primarily focused on providing intelligence for the President and his Cabinet.\nUnlike the Federal Bureau of Investigation , which is a domestic security service, CIA has no law enforcement function and is mainly focused on overseas intelligence gathering, with only limited domestic collection. Though it is not the only U.S. government agency specializing in HUMINT, CIA serves as the national manager for coordination and deconfliction of HUMINT activities across the entire intelligence community. Moreover, CIA is the only agency authorized by law to carry out and oversee covert action on behalf of the President, unless the President determines that another agency is better suited for carrying out such action. It can, for example, exert foreign political influence through its tactical divisions, such as the Special Activities Division.\nBefore the Intelligence Reform and Terrorism Prevention Act, CIA Director concurrently served as the head of the Intelligence Community; today these functions and authorities reside with the Director of National Intelligence. Despite transferring some of its powers to the DNI, the CIA has grown in size as a result of the September 11 terrorist attacks. In 2013, The Washington Post reported that in fiscal year 2010, the CIA had the largest budget of all IC agencies, exceeding previous estimates.\nThe CIA has increasingly taken on offensive roles, including covert paramilitary operations. One of its largest divisions, the Information Operations Center , has shifted focus from counter-terrorism to offensive cyber-operations. Several CIA activities have attracted criticism. They include nonconsensual human experiments, extraordinary rendition, enhanced interrogation techniques , targeted killings, assassinations and the funding and training of militants who would go on to kill civilians and non-combatants.\n\n", "title": "Central Intelligence Agency"}