{"summary": "1991  was a common year starting on Tuesday of the Gregorian calendar.", "full_text": "Chagall Guevara was an American rock band formed in 1989 by solo artist Steve Taylor, guitarists Dave Perkins and Lynn Nichols , bassist Wade Jaynes, and drummer Mike Mead.\nThe band was named after Communist revolutionary Che Guevara and painter Marc Chagall to imply the meaning \"revolutionary art.\" All of the band members had histories within the Christian music industry, but the band was an effort to depart from the CCM industry. Despite this, the band still performed at the exclusively Christian music festivals Greenbelt and Cornerstone, and had their music  distributed through Christian bookstores. The group formed in 1989 and broke up in early 1993.\nThe band first appeared on the soundtrack to the motion picture Pump Up the Volume with a song called '\"Tale O' The Twister.\" The band's only album, the self-titled Chagall Guevara, was released on MCA Records in 1991. The band's only music video, for the song \"Violent Blue,\" received a few plays on MTV.\nSeveral CD and LP singles were released off the album, including a UK release of \"Violent Blue\" with an unreleased B-side track titled \"Still Know Your Number By Heart.\" Several songs from the band's 1991 performance at the Greenbelt Festival in England appeared on the official video \"Four Days in Summer.\"\nWork on a second album began, but the group broke up while attempting to be released from their contract with MCA Records. Several tracks for the second album were recorded, including \"Halcyon Days\" and \"A Bullet's Worth A Thousand Words.\" These songs, along with a November 15, 1991 concert recording, remain unreleased.\nIn 1994, a track titled \"Treasure of the Broken Land\" appeared on the Mark Heard tribute album Strong Hand of Love and the Orphans of God double-CD, which were sold mainly through Christian bookstores and similar outlets. The band reunited again in Nashville at a private industry party in October, 2005.\nIn November 2014 the band partially reunited  at the Cannery Ballroom in Nashville at the end of a set by Steve Taylor And The Perfect Foil.\n^ a b http://www.sockheaven.net/press/interviews/nc_20060616/", "title": "Chagall Guevara"}