{"summary": "Charles  Wendell Colson  was the chief counsel for President Richard Nixon from 1969 to 1973. Colson was also a public speaker and author.", "full_text": "Charles \"Chuck\" Wendell Colson  was an Evangelical Christian leader who founded Prison Fellowship and BreakPoint. Prior to his conversion to Christianity, he served as Special Counsel to President Richard Nixon from 1969 to 1973.\nOnce known as President Nixon's \"hatchet man,\" Colson gained notoriety at the height of the Watergate scandal, for being named as one of the Watergate Seven, and pleaded guilty to obstruction of justice for attempting to defame Pentagon Papers defendant Daniel Ellsberg. In 1974, he served seven months in the federal Maxwell Prison in Alabama as the first member of the Nixon administration to be incarcerated for Watergate-related charges.\nColson became a Christian in 1973. His mid-life conversion to Christianity sparked a radical life change that led to the founding of his non-profit ministry Prison Fellowship and to a focus on Christian worldview teaching and training. Colson was also a public speaker and the author of more than 30 books. He was the founder and chairman of The Chuck Colson Center for Christian Worldview, which is \"a research, study, and networking center for growing in a Christian worldview\", and while he was alive included Colson's daily radio commentary, BreakPoint, which was heard in its original format on more than 1,400 outlets across the United States.\nColson was a principal signer of the 1994 Evangelicals and Catholics Together ecumenical document signed by leading Evangelical Protestants and Roman Catholic leaders in the United States.\nColson received 15 honorary doctorates, and in 1993 was awarded the Templeton Prize for Progress in Religion, the world's largest annual award  in the field of religion, given to a person who \"has made an exceptional contribution to affirming life's spiritual dimension\". He donated this prize to further the work of Prison Fellowship, as he did all his speaking fees and royalties. In 2008, he was awarded the Presidential Citizens Medal by President George W. Bush.", "title": "Charles Colson"}