{"summary": "Cheese is milk made into a solid form that you eat.", "full_text": "Cheese is a food derived from milk that is produced in a wide range of flavors, textures, and forms by coagulation of the milk protein casein. It comprises proteins and fat from milk, usually the milk of cows, buffalo, goats, or sheep. During production, the milk is usually acidified, and adding the enzyme rennet causes coagulation. The solids are separated and pressed into final form. Some cheeses have molds on the rind or throughout. Most cheeses melt at cooking temperature.\nHundreds of types of cheese from various countries are produced. Their styles, textures and flavors depend on the origin of the milk , whether they have been pasteurized, the butterfat content, the bacteria and mold, the processing, and aging. Herbs, spices, or wood smoke may be used as flavoring agents. The yellow to red color of many cheeses, such as Red Leicester, is produced by adding annatto. Other ingredients may be added to some cheeses, such as black pepper, garlic, chives or cranberries.\nFor a few cheeses, the milk is curdled by adding acids such as vinegar or lemon juice. Most cheeses are acidified to a lesser degree by bacteria, which turn milk sugars into lactic acid, then the addition of rennet completes the curdling. Vegetarian alternatives to rennet are available; most are produced by fermentation of the fungus Mucor miehei, but others have been extracted from various species of the Cynara thistle family. Cheesemakers near a dairy region may benefit from fresher, lower-priced milk, and lower shipping costs.\nCheese is valued for its portability, long life, and high content of fat, protein, calcium, and phosphorus. Cheese is more compact and has a longer shelf life than milk, although how long a cheese will keep depends on the type of cheese; labels on packets of cheese often claim that a cheese should be consumed within three to five days of opening. Generally speaking, hard cheeses, such as parmesan last longer than soft cheeses, such as Brie or goat's milk cheese. The long storage life of some cheeses, especially when encased in a protective rind, allows selling when markets are favorable.\nThere is some debate as to the best way to store cheese, but some experts say that wrapping it in cheese paper provides optimal results. Cheese paper is coated in a porous plastic on the inside, and the outside has a layer of wax. This specific combination of plastic on the inside and wax on the outside protects the cheese by allowing condensation on the cheese to be wicked away while preventing moisture from within the cheese escaping.\nA specialist seller of cheese is sometimes known as a cheesemonger. Becoming an expert in this field requires some formal education and years of tasting and hands-on experience, much like becoming an expert in wine or cuisine. The cheesemonger is responsible for all aspects of the cheese inventory: selecting the cheese menu, purchasing, receiving, storage, and ripening.", "title": "Cheese"}