{"summary": "Many chemical reactions produce energy in the form of heat.", "full_text": "In chemistry, chemical energy is the potential of a chemical substance to undergo a transformation through a chemical reaction to transform other chemical substances. Examples include batteries, light bulbs, cells, nuclear weapons and many more. Breaking or making of chemical bonds involves energy, which may be either absorbed or evolved from a chemical system.\nEnergy that can be released  because of a reaction between a set of chemical substances is equal to the difference between the energy content of the products and the reactants. This change in energy is change in a chemical reaction. Where  is the internal energy of formation of the reactant molecules that can be calculated from the bond energies of the various chemical bonds of the molecules under consideration and  is the internal energy of formation of the product molecules. The internal energy change of a process is equal to the heat change if it is measured under conditions of constant volume, as in a closed rigid container such as a bomb calorimeter. However, under conditions of constant pressure, as in reactions in vessels open to the atmosphere, the measured heat change is not always equal to the internal energy change, because pressure-volume work also releases or absorbs energy. .\nAnother useful term is the heat of combustion, which is the energy released due to a combustion reaction and often applied in the study of fuels. Food is similar to hydrocarbon fuel and carbohydrate fuels, and when it is oxidized, its caloric content is similar .\nChemical potential energy is a form of potential energy related to the structural arrangement of atoms or molecules. This arrangement may be the result of chemical bonds within a molecule or otherwise. Chemical energy of a chemical substance can be transformed to other forms of energy by a chemical reaction. As an example, when a fuel is burned the chemical energy is converted to heat, same is the case with digestion of food metabolized in a biological organism. Green plants transform solar energy to chemical energy through the process known as photosynthesis, and electrical energy can be converted to chemical energy through electrochemical reactions.\nThe similar term chemical potential is used to indicate the potential of a substance to undergo a change of configuration, be it in the form of a chemical reaction, spatial transport, particle exchange with a reservoir...", "title": "Chemical energy"}