{"summary": "A chemical element is a substance that contains only one type of atom.", "full_text": "A chemical element or element is a chemical substance consisting of atoms having the same number of protons in their atomic nuclei . There are 118 elements that have been identified, of which the first 94 occur naturally on Earth with the remaining 24 being synthetic elements. There are 80 elements that have at least one stable isotope and 38 that have exclusively radioactive isotopes, which decay over time into other elements. Iron is the most abundant element  making up the Earth, while oxygen is the most common element in the crust of the earth.\nChemical elements constitute approximately 15% of the matter in the universe: the remainder is dark matter, the composition of which is unknown, but it is not composed of chemical elements. The two lightest elements, hydrogen and helium were mostly formed in the Big Bang and are the most common elements in the universe. The next three elements  were formed mostly by cosmic ray spallation, and are thus more rare than those that follow. Formation of elements with from six to twenty six protons occurred and continues to occur in main sequence stars via stellar nucleosynthesis. The high abundance of oxygen, silicon, and iron on Earth reflects their common production in such stars. Elements with greater than twenty six protons are formed by supernova nucleosynthesis in supernovae, which, when they explode, blast these elements far into space as planetary nebulae, where they may become incorporated into planets when they are formed.\nWhen different elements are chemically combined, with the atoms held together by chemical bonds, they form chemical compounds. Only a minority of elements are found uncombined as relatively pure minerals. Among the more common of such \"native elements\" are copper, silver, gold, carbon , and sulfur. All but a few of the most inert elements, such as noble gases and noble metals, are usually found on Earth in chemically combined form, as chemical compounds. While about 32 of the chemical elements occur on Earth in native uncombined forms, most of these occur as mixtures. For example, atmospheric air is primarily a mixture of nitrogen, oxygen, and argon, and native solid elements occur in alloys, such as that of iron and nickel.\nThe history of the discovery and use of the elements began with primitive human societies that found native elements like carbon, sulfur, copper and gold. Later civilizations extracted elemental copper, tin, lead and iron from their ores by smelting, using charcoal. Alchemists and chemists subsequently identified many more, with almost all of the naturally-occurring elements becoming known by 1900.\nThe properties of the chemical elements are summarized on the periodic table, which organizes the elements by increasing atomic number into rows  in which the columns  share recurring  physical and chemical properties. Save for unstable radioactive elements with short half-lives, all of the elements are available industrially, most of them in high degrees of purity.", "title": "Chemical element"}