{"summary": "Chester Alan Arthur  was an American politician and the 21st President of the United States.", "full_text": "Chester Alan Arthur  was an American attorney and politician who served as the 21st President of the United States ; he succeeded James A. Garfield upon the latter's assassination. At the outset, Arthur struggled to overcome a slightly negative reputation, which stemmed from his early career in politics as part of New York's Republican political machine. He succeeded by embracing the cause of civil service reform. His advocacy for, and subsequent enforcement of, the Pendleton Civil Service Reform Act was the centerpiece of his administration.\nArthur was born in Fairfield, Vermont, grew up in upstate New York, and practiced law in New York City. He served as quartermaster general in the New York Militia during the American Civil War. Following the war, he devoted more time to Republican politics and quickly rose in the political machine run by New York Senator Roscoe Conkling. Appointed by President Ulysses S. Grant to the lucrative and politically powerful post of Collector of the Port of New York in 1871, Arthur was an important supporter of Conkling and the Stalwart faction of the Republican Party. In 1878 the new president, Rutherford B. Hayes, fired Arthur as part of a plan to reform the federal patronage system in New York. When Garfield won the Republican nomination for president in 1880, Arthur, an eastern Stalwart, was nominated for vice president to balance the ticket.\nAfter just half a year as vice president, Arthur found himself in the executive mansion due to the assassination of his predecessor. To the surprise of reformers, Arthur took up the cause of reform, though it had once led to his expulsion from office. He signed the Pendleton Act into law and strongly enforced its provisions. He gained praise for his veto of a Rivers and Harbors Act that would have appropriated federal funds in a manner he thought excessive. He presided over the rebirth of the United States Navy but was criticized for failing to alleviate the federal budget surplus, which had been accumulating since the end of the Civil War.\nSuffering from poor health, Arthur made only a limited effort to secure the Republican Party's nomination in 1884; he retired at the close of his term. Journalist Alexander McClure later wrote, \"No man ever entered the Presidency so profoundly and widely distrusted as Chester Alan Arthur, and no one ever retired ... more generally respected, alike by political friend and foe.\" Although his failing health and political temperament combined to make his administration less active than a modern presidency, he earned praise among contemporaries for his solid performance in office. The New York World summed up Arthur's presidency at his death in 1886: \"No duty was neglected in his administration, and no adventurous project alarmed the nation.\" Mark Twain wrote of him, \"t would be hard indeed to better President Arthur's administration.\" Over the 20th and 21st centuries, however, Arthur's reputation mostly faded among the public. Although some have praised his economic policies, present-day historians and scholars list him among the bottom half when ranking the American presidents.", "title": "Chester A. Arthur"}