{"summary": "Chiang Kai-shek was a soldier and President of the Republic of China, born in Xikou on October 31, 1887. He was an officer in the army of the Manchu empire, but supported the Chinese Xinhai Revolution of 1911 that converted China into a republic.", "full_text": "Chiang Kai-shek  was a Chinese political and military leader who served as the leader of the Republic of China between 1928 and 1975. He is known as Chiang Chung-cheng  or Chiang Chieh-shih  in Standard Chinese. Chiang was an influential member of the Kuomintang , the Chinese Nationalist Party, and was a close ally of Sun Yat-sen. He became the Commandant of the Kuomintang's Whampoa Military Academy and took Sun's place as leader of the KMT when Sun died in 1925. In 1926, Chiang led the Northern Expedition to unify the country, becoming China's nominal leader. He served as Chairman of the National Military Council of the Nationalist government of the Republic of China  from 1928 to 1948. Chiang led China in the Second Sino-Japanese War , consolidating power from the party's former regional warlords. Unlike Sun Yat-sen, Chiang Kai-shek was socially conservative, promoting traditional Chinese culture in the New Life Movement and rejecting western democracy and the nationalist democratic socialism that Sun embraced in favour of an authoritarian government.\nChiang's predecessor, Sun Yat-sen, was well-liked and respected by the Communists, but after Sun's death Chiang was not able to maintain good relations with the Chinese Communist Party . A major split between the Nationalists and Communists occurred in 1927; and, under Chiang's leadership, the Nationalists fought a nationwide civil war against the Communists. After Japan invaded China in 1937, Chiang agreed to a temporary truce with the CCP. Despite some early cooperative military successes against Japan, by the time that the Japanese surrendered in 1945 neither the CCP nor the KMT trusted or was actively cooperating with the other.\nAfter the Marshall Mission, an American-sponsored attempt to negotiate a coalition government, failed in 1946, the Chinese Civil War resumed. The CCP defeated the Nationalists in 1949. Westad says the Communists won the Civil War because they made fewer military mistakes than Chiang Kai-Shek, and because in his search for a powerful centralized government, Chiang antagonized too many interest groups in China. Furthermore, his party was weakened in the war against Japan. Meanwhile, the Communists told different groups, such as peasants, exactly what they wanted to hear, and cloaked themselves in the cover of Chinese Nationalism.\nChiang's government and army retreated to Taiwan, where Chiang imposed martial law and persecuted people critical of his rule in a period known as the \"White Terror\". After evacuating to Taiwan, Chiang's government continued to declare its intention to retake mainland China. Chiang ruled Taiwan securely as President of the Republic of China and General of the Kuomintang until his death in 1975.", "title": "Chiang Kai-Shek"}