{"summary": "The Chicago Cubs are a Major League Baseball team that plays in Chicago, Illinois.", "full_text": "The Chicago Cubs are an American professional baseball team located on the North Side of Chicago, Illinois. The Cubs compete in Major League Baseball  as a members of the National League  Central division; the team plays its home baseball games at Wrigley Field. The Cubs are also one of two active major league teams based in Chicago; the other is the Chicago White Sox, who are a member of the American League  Central division. The team is currently owned by Thomas S. Ricketts, son of TD Ameritrade founder Joe Ricketts.\nThe team played its first games in 1876 as a founding member of the National League , eventually becoming known officially as the Chicago Cubs for the 1903 season. Officially, the Cubs are tied for the distinction of being the oldest currently active U.S. professional sports club, along with the Atlanta Braves, which also began play in the NL in 1876 as the Boston Red Stockings \nIn 1906, the franchise recorded a Major League record 116 wins  and posted a modern-era record winning percentage of .763, still held today. They appeared in their first World Series the same year, falling to their crosstown rivals, the White Sox, four games to two. The Cubs won back-to-back World Series championships in 1907 and 1908, becoming the first Major League team to play in three consecutive Fall Classics, and the first to win it twice. The team has appeared in seven World Series following their 1908 title, most recently in 1945. The Cubs have not won the World Series in 107 years, the longest championship drought of any major North American professional sports team, and are often referred to as the \"Lovable Losers\" because of this distinction. They are also known as \"The North Siders\" because Wrigley Field, their home park since 1916, is located in Chicago's North Side Lake View community at 1060 West Addison Street. The Cubs have a major rivalry with the St. Louis Cardinals.", "title": "Chicago Cubs"}