{"summary": "The Chinese Civil War was a civil war fought from 1927 to 1950. Because of a difference in thinking between the Communist Chinese Communist Party  and the Nationalist Kuomintang , there was a fight for legitimacy as the government of China.", "full_text": "The Chinese Civil War  was a civil war in China fought between forces loyal to the Kuomintang -led government of the Republic of China, and forces loyal to the Communist Party of China . The war began in August 1927, with Chiang Kai-Shek's Northern Expedition, and essentially ended when major active battles ceased in 1950. The conflict eventually resulted in two de facto states, the Republic of China  in Taiwan and the People's Republic of China  in mainland China, both officially claiming to be the legitimate government of China.\nThe war represented an ideological split between the Communist CPC and the KMT's brand of Nationalism. It continued intermittently until late 1937, when the two parties came together to form the Second United Front to counter a Japanese invasion and prevent the country from adding to an earlier invasion into Manchuria in 1931. China's full-scale civil war resumed in 1946, a year after the end of hostilities with Japan. Four years later came the cessation of major military hostilities, with the newly founded People's Republic of China controlling mainland China  and the Republic of China's jurisdiction being restricted to Taiwan, Penghu, Quemoy, Matsu and several outlying islands.\nHistorian Odd Arne Westad says the Communists won the Civil War because they made fewer military mistakes than Chiang Kai-shek and also because in his search for a powerful centralized government, Chiang antagonized too many interest groups in China. Furthermore, his party was weakened in the war against the Japanese. Meanwhile, the Communists targeted different groups, such as peasants, and brought them to its corner. Chiang wrote in his diary in June 1948 that the KMT had failed not because of external enemies but because of rot from within. Strong initial support from the US diminished with the failure of the Marshall Mission, and then stopped completely mainly because of KMT corruption    and KMT's military setback in Northeast China. Communist land reform policy, which promised poor peasants farmland from their landlords, ensured PLA popular support. After the surrender of Japan at the end of World War II, Soviet forces turned over their captured Japanese weapons to the CPC and allowed it to take control of territory in Manchuria; many believe the Soviet Union was allowed to do so by the US and the United Kingdom because of their desire to influence the outcome of the Chinese Civil War  at the expense of the Republic of China government by the result of the Yalta Conference until the start of the Cold War across the Taiwan Strait . In the Chinese Civil War after 1945, the economy in the ROC areas collapsed because of hyperinflation and the failure of price controls by the ROC government and financial reforms; the Gold Yuan devaluated sharply in late 1948  and resulted in the ROC government losing the support of the cities' middle classes; in the meantime, the Communists continued their relentless land reform  programs to win the support of the population in the countryside.\nTo this day no armistice or peace treaty has ever been signed, and there is debate about whether the Civil War has legally ended. Cross-Strait relations have been hindered by military threats and political and economic pressure, particularly over Taiwan's political status, with both governments officially adhering to a \"One-China policy.\" The PRC still actively claims Taiwan as part of its territory and continues to threaten the ROC with a military invasion if the ROC officially declares independence by changing its name to and gaining international recognition as the Republic of Taiwan. The ROC mutually claims mainland China, and they both continue the fight over diplomatic recognition. Today the war as such occurs on the political and economic fronts in the form of cross-Strait relations; however, the two separate de facto states have close economic ties.", "title": "Chinese Civil War"}