{"summary": "Christmas  is a Christian holiday that honors the birth of Jesus , and a cultural holiday for non-Christians.", "full_text": "Christmas or Christmas Day  is an annual festival commemorating the birth of Jesus Christ, observed most commonly on December 25 as a religious and cultural celebration among billions of people around the world. A feast central to the Christian liturgical year, it is prepared for by the season of Advent or Nativity Fast and is prolonged by the Octave of Christmas and further by the season of Christmastide. Christmas Day is a public holiday in many of the world's nations, is celebrated culturally by a large number of non-Christian people, and is an integral part of the Christmas and holiday season.\nThe celebratory customs associated in various countries with Christmas have a mix of pre-Christian, Christian, and secular themes and origins. Popular modern customs of the holiday include gift giving, completing an Advent calendar or Advent wreath, Christmas music and caroling, an exchange of Christmas cards, church services, a special meal, and the display of various Christmas decorations, including Christmas trees, Christmas lights, nativity scenes, garlands, wreaths, mistletoe, and holly. In addition, several closely related and often interchangeable figures, known as Santa Claus, Father Christmas, Saint Nicholas, and Christkind, are associated with bringing gifts to children during the Christmas season and have their own body of traditions and lore. Because gift-giving and many other aspects of the Christmas festival involve heightened economic activity, the holiday has become a significant event and a key sales period for retailers and businesses. The economic impact of Christmas is a factor that has grown steadily over the past few centuries in many regions of the world.\nWhile the month and date of Jesus' birth are unknown, by the early-to-mid 4th century, the Western Christian Church had placed Christmas on December 25, a date later adopted in the East, although some churches celebrate on the December 25 of the older Julian calendar, which, in the Gregorian calendar, currently corresponds to January 7, the day after the Western Christian Church celebrates the Epiphany. The date of Christmas may have initially been chosen to correspond with the day exactly nine months after the day on which early Christians believed that Jesus was conceived, or with one or more ancient polytheistic festivals that occurred near southern solstice ; a further solar connection has been suggested because of a biblical verse identifying Jesus as the \"Sun of righteousness\".\n\n", "title": "Christmas"}