{"summary": "Christopher Columbus was a Genoese trader, explorer, and navigator.", "full_text": "Christopher Columbus  was an Italian explorer, navigator, colonizer and citizen of the Republic of Genoa. Under the auspices of the Catholic Monarchs of Spain, he completed four voyages across the Atlantic Ocean. Those voyages, and his efforts to establish permanent settlements on the island of Hispaniola, initiated the Spanish colonization of the New World.\nIn the context of emerging Western imperialism and economic competition between European kingdoms through the establishment of trade routes and colonies, Columbus' proposal to reach the East Indies by sailing westward eventually received the support of the Spanish Crown, which saw in it a chance to enter the spice trade with Asia through a new westward route. During his first voyage in 1492, instead of arriving at Japan as he had intended, Columbus reached the New World, landing on an island in the Bahamas archipelago that he named \"San Salvador\". Over the course of three more voyages, Columbus visited the Greater and Lesser Antilles, as well as the Caribbean coast of Venezuela and Central America, claiming all of it for the Crown of Castile.\nThough Columbus was not the first European explorer to reach the Americas , his voyages led to the first lasting European contact with the Americas, inaugurating a period of European exploration, conquest, and colonization that lasted for several centuries. These voyages had, therefore, an enormous impact in the historical development of the modern Western world. Columbus spearheaded the transatlantic slave trade and has been accused by several historians of initiating the genocide of the Hispaniola natives. Columbus himself saw his accomplishments primarily in the light of spreading the Christian religion.\nNever admitting that he had reached a continent previously unknown to Europeans rather than the East Indies he had set out for, Columbus called the inhabitants of the lands he visited indios . Columbus' strained relationship with the Spanish crown and its appointed colonial administrators in America led to his arrest and dismissal as governor of the settlements on the island of Hispaniola in 1500 and later to protracted litigation over the benefits which Columbus and his heirs claimed were owed to them by the crown.", "title": "Christopher Columbus"}