{"summary": "The chromosomes of a cell are in the cell nucleus.", "full_text": "A chromosome  is a packaged and organized structure containing most of the DNA of a living organism. It is not usually found on its own, but rather is structured by being wrapped around protein complexes called nucleosomes, which consist of histones. The DNA in chromosomes is also associated with transcription  factors and several other macromolecules. During most of the duration of the Cell cycle, a chromosome consists of one long double-stranded DNA molecule . During S phase, the chromosome gets replicated, resulting in an 'X'-shaped structure called a metaphase chromosome. Both the original and the newly copied DNA are now called chromatids. The two \"sister\" chromatids join together at a protein junction called a centromere. Chromosomes are normally visible under a light microscope only when the cell is undergoing mitosis. Even then, the full chromosome containing both joined sister chromatids becomes visible only during a sequence of mitosis known as metaphase . This DNA and its associated proteins and macromolecules is collectively known as chromatin, which is further packaged along with its associated molecules into a discrete structure called a nucleosome. Chromatin is present in most cells, with a few exceptions - erythrocytes for example. Occurring only in the nucleus of eukaryotic cells, chromatin composes the vast majority of all DNA, except for a small amount inherited maternally which is found in mitochondria. In prokaryotic cells, chromatin occurs free-floating in cytoplasm, as these cells lack organelles and a defined nucleus. Bacteria also lack histones. The main information-carrying macromolecule is a single piece of coiled double-stranded DNA, containing many genes, regulatory elements and other noncoding DNA. The DNA-bound macromolecules are proteins, which serve to package the DNA and control its functions. Chromosomes vary widely between different organisms. Some species such as certain bacteria also contain plasmids or other extrachromosomal DNA. These are circular structures in the cytoplasm which contain cellular DNA and play a role in horizontal gene transfer.\nCompaction of the duplicated chromosomes during cell division  results either in a four-arm structure  if the centromere is located in the middle of the chromosome or a two-arm structure if the centromere is located near one of the ends. Chromosomal recombination during meiosis and subsequent sexual reproduction plays a vital role in genetic diversity. If these structures are manipulated incorrectly, through processes known as chromosomal instability and translocation, the cell may undergo mitotic catastrophe and die, or it may unexpectedly evade apoptosis leading to the progression of cancer.\nIn prokaryotes  and viruses, the DNA is often densely packed and organized. In the case of archaea by homologs to eukaryotic histones, in the case of bacteria by histone-like proteins. Small circular genomes called plasmids are often found in bacteria and also in mitochondria and chloroplasts, reflecting their bacterial origins.", "title": "Chromosome"}