{"summary": "Circumcision cuts off the foreskin on the penis of a boy or man.", "full_text": "Male circumcision  is the surgical removal of the foreskin  from the human penis. In the most common procedure, the foreskin is opened and then separated from the glans after inspection. The circumcision device  is placed, and then the foreskin is removed. Topical or locally injected anesthesia is occasionally used to reduce pain and physiologic stress. For adults, general anesthesia is an option, and the procedure may be performed without a specialized circumcision device. The procedure is most often an elective surgery performed on neonates and children for religious and cultural reasons, but in other cases may be indicated for both therapeutic and prophylactic reasons. It is a treatment option for pathological phimosis, refractory balanoposthitis and chronic urinary tract infections ; it is contraindicated in cases of certain genital structure abnormalities or poor general health.\nThe positions of the world's major medical organizations range from considering neonatal circumcision as having no benefit and significant risks to having a modest health benefit that outweighs small risks. No major medical organization recommends either universal circumcision for all infant males , or banning the procedure. Ethical and legal questions regarding informed consent and autonomy have been raised over non-therapeutic child and infant circumcision.\nEvidence supports that male circumcision reduces the risk of HIV infection among heterosexual men in sub-Saharan Africa. The WHO recommends considering circumcision as part of a comprehensive HIV program in areas with high rates of HIV. For men who have sex with men the evidence of an HIV benefit is less clear. Its use to prevent HIV in the developed world is unclear. Circumcision is associated with reduced rates of cancer causing forms of HPV and risk of both UTIs and penile cancer. Routine circumcision, however, is not justified for the prevention of those conditions. Studies of its potential protective effects against other sexually transmitted infections have been unclear. A 2010 review of literature worldwide found circumcisions performed by medical providers to have a median complication rate of 1.5% for newborns and 6% for older children, with few cases of severe complications. Bleeding, infection and the removal of either too much or too little foreskin are the most common complications cited. Complication rates are greater when the procedure is performed by an inexperienced operator, in unsterile conditions, or when the child is at an older age. Circumcision does not appear to have a negative impact on sexual function.\nAn estimated one-third of males worldwide are circumcised. The procedure is most prevalent in the Muslim world and Israel , the United States and parts of Southeast Asia and Africa; it is relatively rare in Europe, Latin America, parts of Southern Africa and most of Asia. The origin of circumcision is not known with certainty; the oldest documentary evidence for it comes from ancient Egypt. Various theories have been proposed as to its origin, including as a religious sacrifice and as a rite of passage marking a boy's entrance into adulthood. It is part of religious law in Judaism and is an established practice in Islam, Coptic Christianity and the Ethiopian Orthodox Church.\n\n", "title": "Circumcision"}