{"summary": "Civilization  comes from the Latin word civis meaning someone who lives in a town.", "full_text": "A civilization  or civilisation  is any complex society characterized by urban development, social stratification, symbolic communication forms , and a perceived separation from and domination over the natural environment by a cultural elite. Civilizations are intimately associated with and often further defined by other socio-politico-economic characteristics, including centralization, the domestication of both humans and other organisms, specialization of labor, culturally ingrained ideologies of progress and supremacism, monumental architecture, taxation, societal dependence upon farming as an agricultural practice, and expansionism.\nHistorically, a civilization was a so called \"advanced\" culture in contrast to more supposedly primitive cultures. In this broad sense, a civilization contrasts with non-centralized feudal or tribal societies, including the cultures of nomadic pastoralists or hunter-gatherers. As an uncountable noun, civilization also refers to the process of a society developing into a centralized, urbanized, stratified structure.\nCivilizations are organized in densely populated settlements divided into hierarchical social classes with a ruling elite and subordinate urban and rural populations, which engage in intensive agriculture, mining, small-scale manufacture and trade. Civilization concentrates power, extending human control over the rest of nature, including over other human beings.\nThe earliest emergence of civilizations is generally associated with the final stages of the Neolithic Revolution, culminating in the relatively rapid process of state formation, a political development associated with the appearance of a governing elite. This neolithic technology and lifestyle was established first in the Middle East , and later in the Yangtze and Yellow river basins in China , and later spread. But similar \"revolutions\" also began independently from 7,000 BCE in such places as the Norte Chico civilization in Peru and Mesoamerica at the Balsas River. These were among the six civilizations worldwide that arose independently. Mesopotamia is the site of the earliest developments of the Neolithic Revolution from around 10,000 BC. It has been identified as having \"inspired some of the most important developments in human history including the invention of the wheel, the planting of the first cereal crops and the development of cursive script, Mathematics, Astronomy and Agriculture.\"\nThe Neolithic Revolution in turn was dependent upon the development of sedentarism, the domestication of grains and animals and the development lifestyles which allowed economies of scale and the accumulation of surplus production by certain social sectors. The transition from \"complex cultures\" to \"civilisations\", while still disputed, seems to be associated with the development of state structures, in which power was further monopolised by an elite ruling class.\nTowards the end of the Neolithic period, various Chalcolithic civilizations began to rise in various \"cradles\" from around 3300 BCE. Chalcolithic Civilizations, as defined above, also developed in Pre-Columbian Americas and, despite an early start in Egypt, Axum and Kush, much later in Iron Age sub-Saharan Africa. The Bronze Age collapse was followed by the Iron Age around 1200 BCE, during which a number of new civilizations emerged, culminating in the Axial Age transition to Classical civilization. A major technological and cultural transition to modernity began approximately 1500 CE in western Europe, and from this beginning new approaches to science and law spread rapidly around the world.", "title": "Civilisation"}