{"summary": "Phillip Jack Brooks , better known by his ring name CM Punk, is an American mixed martial artist and retired professional wrestler.", "full_text": "Phillip Jack \"Phil\" Brooks , better known by the ring name CM Punk, is an American comic book writer, actor and retired professional wrestler. He is best known for his time in WWE, where he was the longest-reigning WWE Champion of the modern era, having held the title for 434 days from November 20, 2011 to January 27, 2013. His reign is officially recognized as the sixth longest of all time, as well as the longest since 1988.\nPunk won multiple world championships during his 15-year wrestling career: including the ROH World Championship and ECW Championship once each, WWE's World Heavyweight Championship three times, and the WWE Championship twice. He won the World Tag Team Championship  and the Intercontinental Championship, making him the 19th WWE Triple Crown Champion and the fastest man in WWE history to achieve this feat, in 203 days. He was a two-time ROH Tag Team Champion . Punk also won the 2008 and 2009 Money in the Bank ladder matches , and the 2011 Superstar of the Year Slammy Award in WWE.\nPunk initially came to prominence through his career on the American independent circuit, primarily as a member of the Ring of Honor  roster, where he was also the first head trainer of the ROH wrestling school. Along with Daniel Bryan and Seth Rollins, Punk is one of three men to hold both the WWE and ROH World championships. In 2005, he signed a contract with WWE and was sent to its developmental promotion, Ohio Valley Wrestling , where he won every championship available in that promotion. In June 2006, Punk made his WWE television debut, performing in ECW, which was then a branch of WWE. In 2011 he rose to stardom and became a fan favorite on the main WWE roster, remaining a company fixture until his acrimonious departure in 2014. Despite his prominence within the company, Punk was never selected to headline WWE's premier annual pay-per-view event, WrestleMania, which became a source of professional dissatisfaction.\nThroughout his career, Punk consistently portrayed the character of an outspoken, sharp-tongued, anti-establishment, straight edge iconoclast. His straight edge principles and outspokenness were based on his actual demeanor and way of life when out of character. Depending on his alignment as a hero or villain, he emphasized different aspects of the straight edge culture to garner the desired audience reaction. He also trained several wrestlers.\nFollowing his retirement from professional wrestling, Punk signed a multi-fight contract with the mixed martial arts promotion Ultimate Fighting Championship .", "title": "CM Punk"}