{"summary": "Cold fusion is nuclear fusion at room temperature and normal pressure.", "full_text": "Cold fusion is a hypothesized type of nuclear reaction that would occur at, or near, room temperature. This is compared with the \"hot\" fusion which takes place naturally within stars, under immense pressure and at temperatures of millions of degrees, and distinguished from muon-catalyzed fusion. There is currently no accepted theoretical model which would allow cold fusion to occur.\nIn 1989 Martin Fleischmann  and Stanley Pons reported that their apparatus had produced anomalous heat  of a magnitude they asserted would defy explanation except in terms of nuclear processes. They further reported measuring small amounts of nuclear reaction byproducts, including neutrons and tritium. The small tabletop experiment involved electrolysis of heavy water on the surface of a palladium  electrode. The reported results received wide media attention, and raised hopes of a cheap and abundant source of energy.\nMany scientists tried to replicate the experiment with the few details available. Hopes faded due to the large number of negative replications, the withdrawal of many reported positive replications, the discovery of flaws and sources of experimental error in the original experiment, and finally the discovery that Fleischmann and Pons had not actually detected nuclear reaction byproducts. By late 1989, most scientists considered cold fusion claims dead, and cold fusion subsequently gained a reputation as pathological science. In 1989, a review panel organized by the United States Department of Energy  concluded that \"the experimental results of excess heat from calorimetric cells reported to date do not present convincing evidence that useful sources of energy will result from the phenomena attributed to cold fusion\" and recommended against \"any special funding for the investigation of phenomena attributed to cold fusion\" or \"the establishment of special programs or research centers to develop cold fusion\", but was \"sympathetic toward modest support\" for experiments \"within the present funding system.\" A second DOE review, convened in 2004 to look at new research, reached conclusions similar to the first. Subsequently DOE funding for cold fusion research was not realized.\nA small community of researchers continues to investigate cold fusion, now often preferring the designation low-energy nuclear reactions  or condensed matter nuclear science . Since cold fusion articles are rarely published in peer-reviewed mainstream scientific journals, they do not attract the level of scrutiny expected for mainstream scientific publications.\n\n", "title": "Cold fusion"}