{"summary": "Columbus is the capital city and largest city of the U.S.", "full_text": "Columbus  is the capital and largest city of the U.S. state of Ohio. It is the 15th largest city in the United States, with a population of 835,957 . It is the core city of the Columbus, OH Metropolitan Statistical Area , which encompasses a ten county area. Under the Metropolitan Statistical Area  model, it is the third largest metropolitan area in Ohio, virtually tied with the Cleveland MSA and slightly behind the Cincinnati MSA .\nUnder the Combined Statistical Area  model, the Columbus, OH Metropolitan Statistical Area was the 28th largest in the United States. According to the U.S. Census Bureau, the Columbus-Marion-Zanesville, OH Combined Statistical Area  has a population of 2,370,839, making it the second largest metropolitan area in Ohio behind Cleveland. It is also the fourth most populous state capital in the United States, and the third largest city in the Midwestern United States.\nColumbus is the county seat of Franklin County. The city proper has also expanded and annexed portions of adjoining Delaware County and Fairfield County. Named for explorer Christopher Columbus, the city was founded in 1812 at the confluence of the Scioto and Olentangy rivers, and assumed the functions of state capital in 1816.\nThe city has a diverse economy based on education, government, insurance, banking, fashion, defense, aviation, food, clothes, logistics, steel, energy, medical research, health care, hospitality, retail, and technology. Columbus is home to the Battelle Memorial Institute, the world's largest private research and development foundation; Chemical Abstracts Service, the world's largest clearinghouse of chemical information; NetJets, the world's largest fractional ownership jet aircraft fleet; and The Ohio State University, one of the largest universities in the United States. As of 2013, the city has the headquarters of five corporations in the U.S. Fortune 500: Nationwide Mutual Insurance Company, American Electric Power, L Brands, Big Lots and Cardinal Health. The fast-food corporations Wendy's and White Castle are also based in the Columbus, Ohio metropolitan area.\nIn 2012, Columbus was ranked in BusinessWeek's 50 best cities in America. In 2013, Forbes gave Columbus an A rating as one of the top cities for business in the U.S., and later that year included the city on its list of Best Places for Business and Careers. Columbus was also ranked as the no. 1 up-and-coming tech city in the nation by Forbes in 2008, and the city was ranked a top ten city by Relocate America in 2010. In 2007, fDi Magazine ranked the city no. 3 in the U.S. for cities of the future, and the Columbus Zoo and Aquarium was rated no. 1 in 2009 by USA Travel Guide.", "title": "Columbus, Ohio"}