{"summary": "A computer algebra system  is a large computer program that helps people with mathematics and algebra.", "full_text": "A computer algebra system  is a software program that allows computation over mathematical expressions in a way which is similar to the traditional manual computations of mathematicians and scientists. The development of the computer algebra systems in the second half of the 20th century is part of the discipline of \"computer algebra\" or \"symbolic computation\", which has spurred work in algorithms over mathematical objects such as polynomials.\nComputer algebra systems may be divided in two classes: the specialized ones and the general purpose ones. The specialized ones are devoted to a specific part of mathematics, such as number theory, group theory, or teaching of elementary mathematics.\nGeneral purpose computer algebra systems aim to be useful to a user working in any scientific field that requires manipulation of mathematical expressions. To be useful, a general purpose computer algebra system must include various features such as\na user interface allowing to enter and display mathematical formulas\na programming language and an interpreter \na simplifier, which is a rewrite system for simplifying mathematics formulas\na memory manager, including a garbage collector, needed by the huge size of the intermediate data, which may appear during a computation\nan arbitrary-precision arithmetic, needed by the huge size of the integers that may occur\na large library of mathematical algorithms\nThe library must cover not only the needs of the users, but also the needs of the simplifier. For example, the computation of polynomial greatest common divisors is systematically used for the simplification of expressions involving fractions.\nThis large amount of required computer capabilities explains the small number of general purpose computer algebra systems. The main ones are Axiom, Macsyma, Magma, Maple, Mathematica and Sage.", "title": "Computer algebra system"}