{"summary": "A computed tomography  scanner is an X-ray machine that takes cross sectional images.", "full_text": "A CT scan, also called X-ray computed tomography  or computerized axial tomography scan , makes use of computer-processed combinations of many X-ray images taken from different angles to produce cross-sectional  images  of specific areas of a scanned object, allowing the user to see inside the object without cutting.\nDigital geometry processing is used to generate a three-dimensional image of the inside of the object from a large series of two-dimensional radiographic images taken around a single axis of rotation. Medical imaging is the most common application of X-ray CT. Its cross-sectional images are used for diagnostic and therapeutic purposes in various medical disciplines. The rest of this article discusses medical-imaging X-ray CT; industrial applications of X-ray CT are discussed at industrial computed tomography scanning.\nAs X-ray CT is the most common form of CT in medicine and various other contexts, the term computed tomography alone  is often used to refer to X-ray CT, although other types exist . Older and less preferred terms that also refer to X-ray CT are computed axial tomography  and computer-aided/assisted tomography. X-ray CT is a form of radiography, although the word \"radiography\" used alone usually refers, by wide convention, to non-tomographic radiography.\nCT produces a volume of data that can be manipulated in order to demonstrate various bodily structures based on their ability to block the X-ray beam. Although, historically, the images generated were in the axial or transverse plane, perpendicular to the long axis of the body, modern scanners allow this volume of data to be reformatted in various planes or even as volumetric  representations of structures. Although most common in medicine, CT is also used in other fields, such as nondestructive materials testing. Another example is archaeological uses such as imaging the contents of sarcophagi. Individuals responsible for performing CT exams are called radiographers or radiologic technologists\nUsage of CT has increased dramatically over the last two decades in many countries. An estimated 72 million scans were performed in the United States in 2007. One study estimated that as many as 0.4% of current cancers in the United States are due to CTs performed in the past and that this may increase to as high as 1.5 to 2% with 2007 rates of CT usage; however, this estimate is disputed, as there is not a consensus about the existence of damage from low levels of radiation. Kidney problems may occasionally occur following intravenous contrast agents used in some types of studies.", "title": "Computed tomography"}