{"summary": "Conducting in the musical sense means: beating time to help a group of musicians to play well together.", "full_text": "Conducting is the art of directing a musical performance, such as an orchestral or choral concert, by way of visible gestures with the hands, arms, face and head. The primary duties of the conductor are to unify performers, set the tempo, execute clear preparations  and beats , and to listen critically and shape the sound of the ensemble.\nThe conductor typically stands on a raised podium with a large music stand for the full score, which contains the musical notation for all the instruments and/or voices. He or she may or may not use a baton. In the 2010s, most conductors do not play an instrument when conducting, although in earlier periods of classical music history, leading an ensemble while playing an instrument was common. In Baroque music from the 1600s to the 1750s, the group would typically be led by the harpsichordist or first violinist , an approach that some 2010s-era conductor-performers also use for music from this period. Conducting while playing a piano or synthesizer may also be done with musical theatre pit orchestras. Communication is typically non-verbal during a performance . However, in rehearsals, frequent interruptions allow the conductor to give verbal directions as to how the music should be played or sung.\nConductors act as guides to the orchestras and/or choirs they conduct. They choose the works to be performed and study their scores, to which they may make certain adjustments , work out their interpretation, and relay their vision to the performers. They may also attend to organizational matters, such as scheduling rehearsals, planning a concert season, hearing auditions and selecting members, and promoting their ensemble in the media. Orchestras, choirs, concert bands and other sizable musical ensembles such as big bands are usually led by conductors.\n^ Michael Kennedy and Joyce Bourne Kennedy . Oxford Concise Dictionary of Music . Oxford University Press, Oxford. ISBN 9780199203833. Conducting \n^ About.com: The Conductor at the Wayback Machine ", "title": "Conductor (music)"}