{"summary": "Confetti is a lot of small pieces of paper or other material that is thrown into the air at a celebration such as party or a wedding.", "full_text": "Confetti are small pieces or streamers of paper, mylar, or metallic material which are usually thrown at parades, sporting team winners, and celebrations, especially weddings . The origins are from the Latin confectum, with confetti the plural of Italian confetto, small sweet. Modern paper confetti trace back to symbolic rituals of tossing grains and sweets during special occasions, traditional for numerous cultures throughout history as an ancient custom dating back to pagan times, but adapted from sweets and grains to paper through the centuries.\n\nConfetti are made in a variety of colors, and commercially available confetti come in many different shapes. A distinction is made between confetti and glitter; glitter is smaller than confetti  and is universally shiny. Most table confetti are also shiny. While they are called metallic confetti they are actually metallized PVC. The most popular shape is the star. Seasonally, Snowflake Confetti are the most requested shape. Most party supply stores carry paper and metallic confetti. Confetti are commonly used at social gatherings such as parties, weddings, and Bar Mitzvahs, but are considered taboo at funerals. At weddings the confetti canon is most often used to add drama to the newlyweds first dance as man and wife.  The simplest confetti are simply shredded paper , and can be made with scissors or a paper shredder. Other confetti often consist of chads punched out of scrap paper. A hole punch can be used to make small round chads. For more elaborate chads, a ticket punch can be used.\nIn recent years the use of confetti as a cosmetic addition to trophy presentations at sporting events has become increasingly common. In this case, larger strips of paper  in the colors appropriate to the team or celebration are used. For smaller volumes of confetti, ABS or PVC \"barrels\" are filled and the confetti is projected via a \"cannon\"  using compressed air or carbon dioxide. For larger venues or volumes of confetti, a venturi air mover powered by carbon dioxide is used to propel significantly larger volumes of confetti greater distances.\n\nA recent innovation at weddings is to use natural petal confetti. These are made from freeze-dried flower petals and are completely biodegradeable. In fact many venues now state that only these biodegradable versions may be used. Some wedding venues have decided that due to the mess and potential inconvenience caused by the use of confetti to ban it usage completely. One way that todays brides and grooms have circumvented this restriction is to use soap bubbles in place of confetti. \nConfetti also have a listing in the book of Guinness World Records, the current holder of the largest collection, based on some 1,700 unique shapes being Casey Larrain of California.", "title": "Confetti"}