{"summary": "Connecticut is a state in the United States.", "full_text": "Connecticut  is the southernmost state in the region of the United States known as New England. Connecticut is also often grouped along with New York and New Jersey as the Tri-State area. It is bordered by Rhode Island to the east, Massachusetts to the north, New York to the west, and Long Island Sound to the south. Its capital city is Hartford, and its most populous city is Bridgeport. The state is named after the Connecticut River, a major U.S. river that approximately bisects the state. The word \"Connecticut\" is derived from various anglicized spellings of an Algonquian word for \"long tidal river.\"\nConnecticut is the third smallest state by area, the 29th most populous, and the fourth most densely populated of the 50 United States. It is known as the \"Constitution State\", the \"Nutmeg State\", the \"Provisions State\", and the \"Land of Steady Habits\". It was influential in the development of the federal government of the United States. Much of southern and western Connecticut  is part of the New York metropolitan area: three of Connecticut's eight counties are statistically included in the New York City combined statistical area, which is widely referred to as the Tri-State area. Connecticut's center of population is in Cheshire, New Haven County, which is also located within the Tri-State area.\nConnecticut's first European settlers were Dutch. They established a small, short-lived settlement in present-day Hartford at the confluence of the Park and Connecticut rivers, called Huys de Goede Hoop. Initially, half of Connecticut was a part of the Dutch colony, New Netherland, which included much of the land between the Connecticut and Delaware rivers. The first major settlements were established in the 1630s by England. Thomas Hooker led a band of followers overland from the Massachusetts Bay Colony and founded what would become the Connecticut Colony; other settlers from Massachusetts founded the Saybrook Colony and the New Haven Colony. The Connecticut and New Haven Colonies established documents of Fundamental Orders, considered the first constitutions in North America. In 1662, the three colonies were merged under a royal charter, making Connecticut a crown colony. This colony was one of the Thirteen Colonies that revolted against British rule in the American Revolution.\nThe Connecticut River, Thames River, and ports along the Long Island Sound have given Connecticut a strong maritime tradition, which continues today. The state also has a long history of hosting the financial services industry, including insurance companies in Hartford and hedge funds in Fairfield County. As of the 2010 Census, Connecticut features the highest per-capita income, Human Development Index , and median household income in the United States.", "title": "Connecticut"}