{"summary": "Constantine is a 2005 American movie starring Keanu Reeves and Rachel Weisz.", "full_text": "Constantine is a 2005 supernatural action-thriller film directed by Francis Lawrence as his feature film directorial debut, starring Keanu Reeves as John Constantine, with Rachel Weisz, Shia LaBeouf, Tilda Swinton, and Djimon Hounsou. With a screenplay by Kevin Brodbin and Frank Cappello, the film is loosely based on Vertigo Comics' Hellblazer comic book, which is also a part of and run by DC Comics, with plot elements taken from the \"Dangerous Habits\" story arc  and the \"Original Sins\" trade paperback. The character of John Constantine was introduced by comic book writer/creator Alan Moore while writing the Swamp Thing, first appearing there in June 1985.\nIn 1988, the character of John Constantine was given his own comic book title, Hellblazer, published by DC Comics under its Vertigo Comics imprint. The \"Dangerous Habits\" story arc of Hellblazer was written by Garth Ennis in 1991, on which the film is partly based. The film, which was met by film critics with mixed reactions, portrays John Constantine as a cynic with the ability to perceive and communicate with half-angels and half-demons in their true form. He seeks salvation from eternal damnation in Hell for a suicide attempt in his youth. Constantine exorcises demons back to Hell in a bid to earn favor with Heaven but has become weary over time. With death looming, he helps a troubled police detective learn the truth about her sister's death while simultaneously unraveling a much larger and darker plot.\nConstantine was released in the United States and Canada on February 18, 2005 and in Hong Kong on February 8, 2005. Box Office Mojo reported that Constantine earned nearly $30 million at the North American box office on its opening weekend, making it the second highest earning movie for that weekend. It eventually earned $75,976,178 at the North American box office and a total of $230,884,728 around the world.", "title": "Constantine (movie)"}