{"summary": "In Conservative Judaism, Jewish values can be divided into ethical and ritual laws - the ethical laws do not change, while the ritual laws are used in different customs.", "full_text": "Conservative Judaism is a modern stream of Judaism, which views Religious Law  as binding, yet also regards it as subject to historical development. The movement regards its approach to Jewish Law as the authentic and traditional one, disavowing both what it considers the excesses of Reform Judaism and the stringency of Orthodoxy. Reconstructionist Judaism is an offshoot of Conservative Judaism.\nConservative Judaism views itself as a continuation of the Positive-Historical School led by Rabbi Zacharias Frankel in mid-19th Century Germany. While at first close to the pioneers of Reform Judaism, he broke with the movement which he perceived as too radical. In America, the term 'Conservative' came to denote the group centered around the JTS, which coalesced in opposition to the publication of the 1885 Pittsburgh Platform. While a common label from then onward, symbolizing relative traditionalism, JTS-affiliated communities and rabbinic organizations became a wholly independent denomination only in the postwar years, after a long process of separation from the moderate, Americanized wing of Orthodox Judaism.\nIn many countries outside the United States and Canada, including Israel, Germany and the UK, it is today known as Masorti Movement .\nIn the United States and Canada, the term Conservative, as applied, does not always indicate that a congregation is affiliated with the United Synagogue of Conservative Judaism, the movement's central institution and the one to which the term, without qualifier, usually refers. Rather, it is sometimes employed by unaffiliated Ashkenazi groups to indicate a range of beliefs and practices more liberal than is affirmed by the Orthodox or Modern Orthodox, and more traditional than the more liberal Reform and Reconstructionist Judaism. In Canada, several congregations belong to the Canadian Council of Conservative Synagogues instead of the United Synagogue. The moniker Conservadox is sometimes employed to refer to the right wing of the Conservative spectrum, although \"Traditional\" is used as well . Both Conservative/Masorti and Reform/Liberal rabbinical assemblies are installing women in highest leadership assignments and ordain female, as well as male, rabbis.", "title": "Conservative Judaism"}