{"summary": "Constantinople  was the capital of the Roman Empire , the Byzantine/East Roman Empire , the Latin Empire , and the Ottoman Empire .", "full_text": "Constantinople  was the capital city of the Roman/Byzantine , the Latin , and the Ottoman  empires. It was reinaugurated in 324 AD at ancient Byzantium, as the new capital of the Roman Empire by Emperor Constantine the Great, after whom it was named, and dedicated on 11 May 330. In the 12th century, the city was the largest and wealthiest European city and it was instrumental in the advancement of Christianity during Roman and Byzantine times. After the loss of its territory, the Eastern Roman  Empire was reduced to just its capital city and its environs, eventually falling to the Ottomans in 1453. Following the Muslim conquest, the former bastion of Christianity in the east, Constantinople, was turned into the capital of the Ottoman Empire, under which it prospered and flourished again. For many centuries the city was popularly called \"Istanbul\", from a Greek phrase meaning \"to the city\" , while officially it was known under various names, including Constantinople and Dersaadet. Names other than \"Istanbul\" became obsolete in late Ottoman Empire, and after Turkey switched to Latin script in 1928, it began to urge other countries to use the Turkish name, and \"Istanbul\" gradually attained international usage.\nConstantinople was famed for its massive defenses. Although besieged on numerous occasions by various peoples, the Byzantine city was taken only in 1204 by the Latin army of the Fourth Crusade, recovered in 1261 by the Byzantine Emperor Michael VIII Palaiologos, and in 1453 conquered by the Ottoman Sultan Mehmed II. The first, smaller wall was erected by Constantine I, and surrounded the city. Later, in the 5th century, Theodosius II constructed the Theodosian Walls, which consisted of a double wall lying about 2 km  to the west of the first wall. The city was built on seven hills as well as on the Golden Horn and the Sea of Marmara and thus presented an impregnable fortress enclosing magnificent palaces, domes, and towers, spanning two continents.\nThe city was also famed for its architectural masterpieces, such as the Greek Orthodox cathedral of Hagia Sophia which served as the seat of the Ecumenical Patriarchate, the sacred Imperial Palace where the Emperors lived, the Galata Tower, the Hippodrome, and the Golden Gate, lining the arcaded avenues and squares. Constantinople contained numerous artistic and literary treasures before it was sacked in 1204 and 1453. The city was virtually depopulated when it fell to the Ottoman Turks, but recovered rapidly, and was, by the mid-1600s, once again the world's largest city as the new capital of the Ottoman Empire.", "title": "Constantinople"}