{"summary": "Containment building is a building with a nuclear reactor in it.", "full_text": "A containment building, in its most common usage, is a reinforced steel or lead structure enclosing a nuclear reactor. It is designed, in any emergency, to contain the escape of radioactive steam or gas to a maximum pressure in the range of 40 to 80 psi . The containment is the fourth and final barrier to radioactive release , the first being the fuel ceramic itself, the second being the metal fuel cladding tubes, the third being the reactor vessel and coolant system.\nEach nuclear plant in the US is designed to withstand certain conditions which are spelled out as \"Design Basis Accidents\" in the Final Safety Analysis Report . The FSAR is available for public viewing, usually at a public library near the nuclear plant.\nThe containment building itself is typically an airtight steel structure enclosing the reactor normally sealed off from the outside atmosphere. The steel is either free-standing or attached to the concrete missile shield. In the United States, the design and thickness of the containment and the missile shield are governed by federal regulations , and must be strong enough to withstand the impact of a fully loaded passenger airliner without rupture.\nWhile the containment plays a critical role in the most severe nuclear reactor accidents, it is only designed to contain or condense steam in the short term  and long term heat removal still must be provided by other systems. In the Three Mile Island accident the containment pressure boundary was maintained, but due to insufficient cooling, some time after the accident, radioactive gas was intentionally let from containment by operators to prevent over pressurization. This, combined with further failures, caused the release of up to 13 million curies of radioactive gas to atmosphere during the accident.\nWhile the Fukushima Dai-Ichi plant had operated safely since 1971, an earthquake and tsunami well beyond the design basis resulted in failure of AC power, backup generators and batteries which defeated all safety systems. These systems were necessary to keep the fuel cool after the reactor had been shut down. This resulted in partial or complete meltdown of fuel rods, damage to fuel storage pools and buildings, release of radioactive debris to surrounding area, air and sea, and resorting to the expedient use of fire engines and concrete pumps to deliver cooling water to spent fuel pools and containment. The containment was breached from a hydrogen gas explosion. The fuel cladding around the rods heated up, releasing hydrogen gas which built up inside the reactor, without being vented.", "title": "Containment building"}