{"summary": "In modern physical cosmology, the cosmological principle is a prediction based on the idea that the universe is about the same in all places when viewed on a large scale.", "full_text": "In modern physical cosmology, the cosmological principle is the notion that the distribution of matter in the Universe is homogeneous and isotropic when viewed on a large enough scale, since the forces are expected to act uniformly throughout the Universe, and should, therefore, produce no observable irregularities in the large scale structuring over the course of evolution of the matter field that was initially laid down by the Big Bang.\nAstronomer William Keel explains:\n\nThe cosmological principle is usually stated formally as 'Viewed on a sufficiently large scale, the properties of the Universe are the same for all observers.' This amounts to the strongly philosophical statement that the part of the Universe which we can see is a fair sample, and that the same physical laws apply throughout. In essence, this in a sense says that the Universe is knowable and is playing fair with scientists.\n\nThe cosmological principle depends on a definition of \"observer,\" and contains an implicit qualification and two testable consequences.\n\"Observers\" means any observer at any location in the Universe, not simply any human observer at any location on Earth: as Andrew Liddle puts it, \"the cosmological principle  the Universe looks the same whoever and wherever you are.\"\nThe qualification is that variation in physical structures can be overlooked, provided this does not imperil the uniformity of conclusions drawn from observation: the Sun is different from the Earth, our galaxy is different from a black hole, some galaxies advance toward rather than recede from us, and the Universe has a \"foamy\" texture of galaxy clusters and voids, but none of these different structures appears to violate the basic laws of physics.\nThe two testable structural consequences of the cosmological principle are homogeneity and isotropy. Homogeneity means that the same observational evidence is available to observers at different locations in the Universe . Isotropy means that the same observational evidence is available by looking in any direction in the Universe . The principles are distinct but closely related, because a Universe that appears isotropic from any two  locations must also be homogeneous.", "title": "Cosmological principle"}