{"summary": "A covert operation is an operation that is done in a way that keeps it secret.", "full_text": "According to the U.S. Department of Defense Dictionary of Military and Associated Terms, a covert operation  is \"an operation that is so planned and executed as to conceal the identity of or permit plausible denial by the sponsor.\" It is intended to create a political effect which can have implications in the military, intelligence or law enforcement arenas affecting either the internal population of a country or individuals outside of it. Covert operations aim to secretly fulfill their mission objectives without any parties knowing who sponsored or carried out the operation.\nUnder United States law, the Central Intelligence Agency  must lead covert operations unless the president finds that another agency should do so and properly informs the Congress. Normally, the CIA is the US Government agency legally allowed to carry out covert action. The CIA's authority to conduct covert action comes from the National Security Act of 1947. President Ronald Reagan issued Executive Order 12333 titled United States Intelligence Activities in 1984. This order defined covert action as \"special activities\", both political and military, that the US Government could legally deny. The CIA was also designated as the sole authority under the 1991 Intelligence Authorization Act and in Title 50 of the United States Code Section 413. The CIA must have a \"Presidential Finding\" issued by the President of the United States in order to conduct these activities under the Hughes-Ryan amendment to the 1991 Intelligence Authorization Act. These findings are then monitored by the oversight committees in both the US Senate and the House of Representatives. As a result of this framework, the CIA \"receives more oversight from the Congress than any other agency in the federal government\". The Special Activities Division  is a division of the CIA's National Clandestine Service, responsible for Covert Action and \"Special Activities\". These special activities include covert political influence and paramilitary operations. The division is overseen by the United States Secretary of State.", "title": "Covert operation"}