{"summary": "The Crusades were battles fought between Christians and Muslims over control of the Holy Land.", "full_text": "The Crusades were military campaigns sanctioned by the Catholic Church in the Middle Ages. In 1095 Byzantine Emperor Alexios I, in Constantinople, sent an ambassador to Pope Urban II in Italy pleading for military help against the growing Turkish threat. The Pope responded promptly by calling Catholic soldiers to join the First Crusade. The immediate goal was to guarantee pilgrims access to the holy sites in the Holy Land under Muslim control. His long-range goal was to reunite the Eastern and Western branches of Christendom after their split in 1054 with the pope as head of the united Church. A complex 200-year struggle ensued.\nHundreds of thousands of Roman Catholics from many different classes and nations of Western Europe became crusaders by taking a public vow and receiving plenary indulgences from the church. Some crusaders were peasants hoping for Apotheosis at Jerusalem. Pope Urban II claimed that anyone who participated was forgiven of their sins. In addition to demonstrating devotion to God, as stated by the Catholic Church, participation satisfied feudal obligations and provided opportunities for economic and political gain. Crusaders often pillaged the countries through which they traveled, and contrary to their promises the leaders retained much of this territory rather than returning it to the Byzantines.\nThe People's Crusade prompted the murder of thousands of Jews, known as the Rhineland massacres. Constantinople was sacked during the Fourth Crusade rendering the reunification of Christendom impossible. Due to the weakening that resulted from the siege, the remnants of the Byzantine Empire finally fell to the Ottomans in 1453. The Catholic Church mounted no coherent response when their last stronghold in the region, Acre, fell in 1291.\nOpinions concerning the conduct of crusaders have varied from laudatory to highly critical. The impact of the crusades was profound; they reopened the Mediterranean to commerce and travel, enabling Genoa and Venice to flourish. Crusader armies would trade with the local populations while travelling, and Orthodox Byzantine emperors often organized markets for crusaders moving through their territory. The Crusades consolidated the collective identity of the Latin Church under papal leadership, and were a source of heroism, chivalry, and piety. This consequently spawned medieval romance, philosophy, and literature. However, the crusades reinforced the connection between Western Catholicism, feudalism, and militarism, which was counter to the Peace and Truce of God that Urban had promoted.\n\n", "title": "Crusades"}