{"summary": "Crystallography is the study of the arrangement of atoms in solids.", "full_text": "Crystallography is the experimental science of determining the arrangement of atoms in the crystalline solids . The word \"crystallography\" derives from the Greek words crystallon \"cold drop, frozen drop\", with its meaning extending to all solids with some degree of transparency, and grapho \"I write\". In July 2012, the United Nations recognised the importance of the science of crystallography by proclaiming that 2014 would be the International Year of Crystallography. X-ray crystallography is used to determine the structure of large biomolecules such as proteins.\nBefore the development of X-ray diffraction crystallography , the study of crystals was based on physical measurements of their geometry. This involved measuring the angles of crystal faces relative each other and to theoretical reference axes , and establishing the symmetry of the crystal in question. This physical measurement is carried out using a goniometer. The position in 3D space of each crystal face is plotted on a stereographic net such as a Wulff net or Lambert net. The pole to each face is plotted on the net. Each point is labelled with its Miller index. The final plot allows the symmetry of the crystal to be established.\nCrystallographic methods now depend on analysis of the diffraction patterns of a sample targeted by a beam of some type. X-rays are most commonly used; other beams used include electrons or neutrons. This is facilitated by the wave properties of the particles. Crystallographers often explicitly state the type of beam used, as in the terms X-ray crystallography, neutron diffraction and electron diffraction. These three types of radiation interact with the specimen in different ways.\nX-rays interact with the spatial distribution of electrons in the sample.\nElectrons are charged particles and therefore interact with the total charge distribution of both the atomic nuclei and the electrons of the sample.\nNeutrons are scattered by the atomic nuclei through the strong nuclear forces, but in addition, the magnetic moment of neutrons is non-zero. They are therefore also scattered by magnetic fields. When neutrons are scattered from hydrogen-containing materials, they produce diffraction patterns with high noise levels. However, the material can sometimes be treated to substitute deuterium for hydrogen.\nBecause of these different forms of interaction, the three types of radiation are suitable for different crystallographic studies.\n^ UN announcement \"International Year of Crystallography\". iycr2014.org. 12 July 2012", "title": "Crystallography"}