{"summary": "The Danelaw  is an 11th century name for an area of northern and eastern England under the administrative control of the Danish Viking empire  from the late 9th century until the early 11th century.", "full_text": "The Danelaw , as recorded in the Anglo-Saxon Chronicle, is a historical name given to the part of England in which the laws of the Danes held sway and dominated those of the Anglo-Saxons. Danelaw contrasts West Saxon law and Mercian law.\nModern historians have extended the term to a geographical designation. The areas that constituted the Danelaw lie in northern and eastern England.\nThe Danelaw originated from the Viking expansion of the ninth century AD, although the term was not used to describe a geographic area until the 11th century AD. With the increase in population and productivity in Scandinavia, Viking warriors, having sought treasure and glory in the nearby British Isles, \"proceeded to plough and support themselves\", in the words of the Anglo-Saxon Chronicle for the year 876.\nDanelaw can describe the set of legal terms and definitions created in the treaties between the West-Saxon king, Alfred the Great, and the Danish warlord, Guthrum, written following Guthrum's defeat at the Battle of Edington in 878. In 886 the Treaty of Alfred and Guthrum was formalised, defining the boundaries of their kingdoms, with provisions for peaceful relations between the English and the Vikings. The language spoken in England was also affected by this clash of cultures with the emergence of Anglo-Norse dialects.\nThe Danelaw roughly comprises 15 shires: Yorkshire, the Five Boroughs of Leicester, Nottingham, Derby, Stamford and Lincoln, as well as Essex, the Kingdom of East Anglia shires of Cambridgeshire, Suffolk and Norfolk, and the East Midlands shires of Northamptonshire, Huntingdonshire, Bedfordshire, Hertfordshire, Middlesex and Buckinghamshire. In all one third of the total area of the East Midlands fell within Danelaw.", "title": "Danelaw"}