{"summary": "Daniel Webster  was an important American statesman.", "full_text": "Daniel Webster  was a leading American senator and statesman during the era of the Second Party System. He was the outstanding spokesman for American nationalism with powerful oratory that made him a key Whig leader. He spoke for conservatives, and led the opposition to Democrat Andrew Jackson and his Democratic Party. He was a spokesman for modernization, banking, and industry, but not for the common people who composed the base of his opponents in Jacksonian Democracy. \"He was a thoroughgoing elitist, and he reveled in it,\" says biographer Robert Remini. During his 40 years in national politics, Webster served in the House of Representatives for eight years  and in the Senate for 19 years , and served as the United States Secretary of State under three presidents.\nOne of the highest-regarded courtroom lawyers of the era, Webster shaped several key U.S. Supreme Court cases that established important constitutional precedents that bolstered the authority of the federal government. As a diplomat he is best known for negotiating the Webster-Ashburton Treaty with Great Britain; it established the definitive eastern border between the United States and Canada. Chiefly recognized for his Senate tenure, Webster was a key figure in the institution's \"Golden days\". Webster was the Northern member of the \"Great Triumvirate\", with his colleagues Henry Clay from the West  and John C. Calhoun from the South . His \"Reply to Hayne\" in 1830 has been regarded as one of the greatest speeches in the senate's history.\nAs with his fellow Whig Henry Clay, Webster wanted to see the Union preserved and civil war averted. They both worked for compromises to stave off the sectionalism that threatened war between the North and the South. Webster tried and failed three times to become President of the United States. In 1957, a Senate Committee selected Webster as one of the five greatest U.S. Senators with Henry Clay, John C. Calhoun, Robert La Follette, and Robert A. Taft.", "title": "Daniel Webster"}