{"summary": "A day is the time it takes the Earth to spin around once.", "full_text": "A day is a unit of time. In common usage, it is an interval equal to 24 hours. It also can mean the consecutive period of time during which the Sun is above the horizon, also known as daytime. The period of time during which the Earth completes one rotation with respect to the Sun is called a solar day.\nSeveral definitions of this universal human concept are used according to context, need and convenience. In 1967, the second was redefined in terms of the wavelength of light, and was designated the SI base unit of time. The unit of measurement \"day\", redefined in 1967 as 86 400 SI seconds and symbolized d, is not an SI unit, but is accepted for use with SI. A civil day is usually also 86 400 seconds, plus or minus a possible leap second in Coordinated Universal Time , and, in some locations, occasionally plus or minus an hour when changing from or to daylight saving time. The word day may also refer to a day of the week or to a calendar date, as in answer to the question \"On which day?\" The life patterns of humans and many other species are related to Earth's solar day and the day-night cycle .\nIn recent decades the average length of a solar day on Earth has been about 86 400.002 seconds  and there are about 365.242 2 solar days in one mean tropical year. Because celestial orbits are not perfectly circular, and thus objects travel at different speeds at various positions in their orbit, a solar day is not the same length of time throughout the orbital year. A day, understood as the span of time it takes for the Earth to make one entire rotation with respect to the celestial background or a distant star , is called a stellar day. This period of rotation is about 4 minutes less than 24 hours  and there are about 366.242 2 stellar days in one mean tropical year . Mainly due to tidal effects, the Earth's rotational period is not constant, resulting in further minor variations for both solar days and stellar \"days\". Other planets and moons also have stellar and solar days.", "title": "Day"}