{"summary": "1991  was a common year starting on Tuesday of the Gregorian calendar.", "full_text": "Deacon Blue are a Scottish pop band formed in Glasgow during 1985. Their name was taken from the title of the Steely Dan song \"Deacon Blues\". The line-up of the band consists of vocalists Ricky Ross and Lorraine McIntosh, keyboard player James Prime and drummer Dougie Vipond. The original Deacon Blue band also included Ewen Vernal as bass guitarist. The original guitarist in Deacon Blue was the late Graeme Kelling; the current Deacon Blue guitarist is Gregor Philp and the current bass guitarist is Lewis Gordon. Although Kelling and Philp are the only two official Deacon Blue guitarists, a few others have played guitar for Deacon Blue albums; for their 2001 studio album Homesick , the guitarist was swapped around for different tracks, with Mick Slaven or Davy Scott playing when Graeme Kelling found it too difficult.\nThe band released their debut album, Raintown, on 1 May 1987 in the United Kingdom and in the United States on February 1988. The album has the overtones of a concept album relating to the struggles of getting by in life in the inner city of urban life - the city being unmistakably Glasgow, referenced by the roots of the band and by the images on the cover of the album, the view of a rainy day over Glasgow's West End  and, on the rear, a long-exposure capture of the Kingston Bridge blasting through the city centre at night. Their second album, When the World Knows Your Name  topped the UK Albums Chart for two weeks, and included \"Real Gone Kid\" which became their first UK top ten single.\nDeacon Blue released their fourth album, Whatever You Say, Say Nothing in 1993. Following Vipond's decision to quit the group in favour of a career in television, they split up in 1994. Five years later, the band held a reunion gig, and this led on to a new album, Walking Back Home, with the band now working on a part-time basis. The band released another album, Homesick, in 2001. Though Graeme Kelling died from pancreatic cancer in 2004, the band has continued in his absence and 2006 saw Deacon Blue returning to the studio to record three new tracks for a Singles album - including the track \"Bigger than Dynamite\". Deacon Blue's next album was The Hipsters, in 2012. A new album, A New House, is due for release in September 2014.\nAs of 2012, Deacon Blue's total album sales stood at six million, with twelve UK Top 40 singles, along with two UK number one albums. A new album has been announced for September 2014.", "title": "Deacon Blue"}