{"summary": "Death row is a place where people convicted of bad things go to be executed using different methods.", "full_text": "Death row, in English-speaking countries that have capital punishment, is the place, often a section of a prison, that houses prisoners awaiting execution. The term is also used figuratively to describe the state of awaiting execution , even in places where no special facility or separate unit for condemned inmates exists. After persons are found guilty of an offence and sentenced to death, they remain on death row during appeal and habeas corpus procedures.\nOpponents of capital punishment claim that a prisoner's isolation and uncertainty over his or her fate constitute a form of mental cruelty and that especially long-time death row inmates are liable to become mentally ill, if they are not already. This is referred to as the death row phenomenon. In extreme cases some inmates may attempt to commit suicide.\nIn the United States, prisoners may wait years before execution can be carried out due to the complex and time-consuming appeals procedures mandated in the jurisdiction. The time between sentencing and execution has increased relatively steadily between 1977 and 2010, including a 22% jump between 1989 and 1990 and a similar jump between 2008 and 2009. In 2010, a death row inmate waited an average of 178 months  between sentencing and execution. Nearly a quarter of deaths on death row in the U.S. are due to natural causes.\nWhen the United Kingdom had capital punishment, the convicted were given one appeal of their sentence. If that appeal was found to involve an important point of law it was taken up to the House of Lords, and if the appeal was successful, at that point the sentence was changed to life in prison. The Home Secretary in the United Kingdom had the power to exercise the Sovereign's royal prerogative of mercy to grant a reprieve on execution and change the sentence to life imprisonment.\nIn some Caribbean countries which still authorize execution, the Judicial Committee of the Privy Council is the ultimate court of appeals. It has upheld appeals by prisoners who have spent several years under sentence of death, stating that it does not desire to see the death row phenomenon emerge in countries under its jurisdiction.\nHaiti continued the conventional 'reprieved if not executed within 90 days' process adopted by Britain before its abolition .\n\nThere were 3,125 people on death row in the United States on January 1, 2013. Since 1977, the states of Texas , Virginia  and Oklahoma  have executed the most death row inmates. As of 2010, California , Florida , Texas  and Pennsylvania  housed more than half of all inmates pending on death row. As of 2008, the longest-serving prisoner on death row in the U.S.A. who has been executed was Jack Alderman who served over 33 years. He was executed in Georgia in 2008. However, Alderman only holds the distinction of being the longest-serving executed inmate so far. A Florida inmate, Gary Alvord, arrived on Florida's death row in 1974. On 9 April 2013, Alvord had been on death row for exactly 39 years until he died on May 19, 2013 from a brain tumor, having been longer on death row than any other United States inmate.  The oldest prisoner on death row in the United States was Leroy Nash, age 94, in Arizona. He died of natural causes on February 12, 2010.", "title": "Death row"}