{"summary": "Debate or debating is a method of argument.", "full_text": "Debate is contention in argument; strife, dissension, quarrelling, controversy; especially a formal discussion of subjects before a public assembly or legislature, in Parliament or in any deliberative assembly.\nDebate is a method of formally presenting an argument in a disciplined manner. Through logical consistency, factual accuracy and some degree of emotional appeal to the audience are elements in debating, where one side often prevails over the other party by presenting a superior \"context\" and/or framework of the issue. The outcome of a debate may depend upon consensus or some formal way of reaching a resolution, rather than the objective facts. In a formal debating contest, there are rules for participants to discuss and decide on differences, within a framework defining how they will interact.\nDebating is carried out in assemblies of various types to discuss matters and to make resolutions about action to be taken, often by voting. Deliberative bodies such as parliaments, legislative assemblies, and meetings of all sorts engage in debates. In particular, in parliamentary democracies a legislature debates and decides on new laws. Formal debates between candidates for elected office, such as the leaders debates that are sometimes held in democracies. Debating is also carried out for educational and recreational purposes, usually associated with educational establishments and debating societies. The major goal of the study of debate as a method or art is to develop the ability to debate rationally from either position with equal ease.\nInformal and forum debate is relatively common, shown by TV shows such as the Australian talk show, Q&A, the quality and depth of a debate improves with the knowledge and skills of its participants as debaters. The outcome of a contest may be decided by audience vote, by judges, or by some combination of the two.\n^ The New Shorter Oxford English Dictionary, 4th ed., 1993 pg. 603.\n^ Al-Mahrooqi & Tabakow, R. & M. \"Effectiveness of Debate in ESL/EFL-Context Courses in the Arabian Gulf: A Comparison of Two Recent Student-Centered Studies in Oman and in Dubai, U.A.E.\" . 21st Century Academic Forum. 21st Century Academic Forum. Retrieved 22 October 2015.", "title": "Debate"}