{"summary": "Decolonization is when a colony of any country becomes independent.", "full_text": "Decolonization  or decolonisation  is the undoing of colonialism, where a nation establishes and maintains its domination over dependent territories. The Oxford English Dictionary defines decolonization as \"the withdrawal from its colonies of a colonial power; the acquisition of political or economic independence by such colonies.\" The term refers particularly to the dismantlement, in the years after World War II, of the colonial empires established prior to World War I throughout the world. However, decolonization not only refers to the complete \"removal of the domination of non-indigenous forces\" within the geographical space and different institutions of the colonized, but it also refers to the \"decolonizing of the mind\" from the colonizer's ideas that made the colonized seem inferior.\nThe United Nations Special Committee on Decolonization has stated that in the process of decolonization there is no alternative to the colonizer allowing a process of self-determination, but in practice decolonization may involve either nonviolent revolution or national liberation wars by pro-independence groups. It may be intramural or involve the intervention of foreign powers acting individually or through international bodies such as the United Nations. Although examples of decolonization can be found as early as the writings of Thucydides, there have been several particularly active periods of decolonization in modern times. These include the breakup of the Spanish Empire in the 19th century; of the German, Austro-Hungarian, Ottoman, and Russian Empires following World War I; of the British, French, Dutch, Japanese, Portuguese, Belgian and Italian colonial empires following World War II; and of the Soviet Union  following the Cold War.\nAs a philosophy, \"decolonization\" refers to the ability to view and discuss non-European cultures from an unbiased, non-Western perspective.", "title": "Decolonization"}