{"summary": "The Deepwater Horizon oil spill is also called the BP oil spill, the Gulf of Mexico oil spill, or the Macondo blowout.", "full_text": "The Deepwater Horizon oil spill  began on 20 April 2010 in the Gulf of Mexico on the BP-owned Transocean-operated Macondo Prospect. Following the explosion and sinking of the Deepwater Horizon oil rig, a sea-floor oil gusher flowed for 87 days, until it was capped on 15 July 2010. Eleven people went missing and were never found and it is considered the largest accidental marine oil spill in the history of the petroleum industry, an estimated 8% to 31% larger in volume than the previously largest, the Ixtoc I oil spill. The US Government estimated the total discharge at 4.9 million barrels . After several failed efforts to contain the flow, the well was declared sealed on 19 September 2010. Reports in early 2012 indicated the well site was still leaking.\nA massive response ensued to protect beaches, wetlands and estuaries from the spreading oil utilizing skimmer ships, floating booms, controlled burns and 1.84 million US gallons  of Corexit oil dispersant. Due to the months-long spill, along with adverse effects from the response and cleanup activities, extensive damage to marine and wildlife habitats and fishing and tourism industries was reported. In Louisiana, 4.6 million pounds of oily material was removed from the beaches in 2013, over double the amount collected in 2012. Oil cleanup crews worked four days a week on 55 miles of Louisiana shoreline throughout 2013. Oil continued to be found as far from the Macondo site as the waters off the Florida Panhandle and Tampa Bay, where scientists said the oil and dispersant mixture is embedded in the sand. In 2013 it was reported that dolphins and other marine life continued to die in record numbers with infant dolphins dying at six times the normal rate. One study released in 2014 reported that tuna and amberjack that were exposed to oil from the spill developed deformities of the heart and other organs that would be expected to be fatal or at least life-shortening and another study found that cardiotoxicity might have been widespread in animal life exposed to the spill.\nNumerous investigations explored the causes of the explosion and record-setting spill. Notably, the U.S. government's September 2011 report pointed to defective cement on the well, faulting mostly BP, but also rig operator Transocean and contractor Halliburton. Earlier in 2011, a White House commission likewise blamed BP and its partners for a series of cost-cutting decisions and an insufficient safety system, but also concluded that the spill resulted from \"systemic\" root causes and \"absent significant reform in both industry practices and government policies, might well recur\".\nIn November 2012, BP and the United States Department of Justice settled federal criminal charges with BP pleading guilty to 11 counts of manslaughter, two misdemeanors, and a felony count of lying to Congress. BP also agreed to four years of government monitoring of its safety practices and ethics, and the Environmental Protection Agency announced that BP would be temporarily banned from new contracts with the US government. BP and the Department of Justice agreed to a record-setting $4.525 billion in fines and other payments. As of February 2013, criminal and civil settlements and payments to a trust fund had cost the company $42.2 billion.\nIn September 2014, a U.S. District Court judge ruled that BP was primarily responsible for the oil spill because of its gross negligence and reckless conduct.\nIn July 2015, BP agreed to pay $18.7 billion in fines, the largest corporate settlement in U.S. history.", "title": "Deepwater Horizon oil spill"}