{"summary": "The Defense Intelligence Agency, or DIA, is the central producer and manager of foreign military intelligence for the United States.", "full_text": "The Defense Intelligence Agency  is an external intelligence service of the United States specializing in defense and military intelligence. A component of the Department of Defense  and the United States Intelligence Community , DIA informs national civilian and defense policymakers about the military intentions and capabilities of foreign governments and non-state actors. DIA also ensures intelligence assistance, integration and coordination across uniformed military service intelligence components, which remain structurally separate from DIA. The agency's role is wide-reaching, encompassing collection and analysis of defense-related foreign political, economic, industrial, geographic, and medical and health intelligence. As part of its national IC responsibilities, DIA regularly provides input for the President's Daily Brief.\nThough sometimes compared to foreign military intelligence services, like the Russian GRU or Israeli Aman, DIA is unique in that two-thirds of its 17,000 employees are civilians and the agency's structure bears resemblance to that of its non-military counterpart. DIA's intelligence operations in support of U.S. national security extend far beyond the zones of combat, at hundreds of locations and U.S. Embassies in approximately 140 countries. The agency primarily specializes in collection and analysis of human-source intelligence , has its own Clandestine Service and is in charge of American military-diplomatic efforts overseas. DIA is also designated a national manager for the highly technical measurement and signature intelligence  and the Department of Defense manager for counterintelligence programs. The agency has no law enforcement authority, although it is occasionally portrayed so in American popular culture.\nEstablished in 1961 under President John F. Kennedy by Defense Secretary Robert McNamara, DIA has been at the forefront of U.S. intelligence efforts throughout the Cold War and rapidly expanded, both in size and scope, since the September 11 attacks. Due to the sensitive nature of its work, the spy organization has been embroiled in numerous controversies, including those related to its intelligence-gathering activities, its role in enhanced interrogations, as well as attempts to expand its activities on U.S. soil.\n^ DIA Public Web Page, Overview of the Origins of DIA, 1960's\n^ Locations\n^ The Defense Clandestine Service. Defense Intelligence Agency Retrieved: May 5th, 2013\n^ Defense Intelligence Agency . AllGov.Com: Everything our Government Really Does. Retrieved: May 5, 2013\n^ Defense Intel Alumni Association Log. November 2009, page 5.\n^ Knight, Judson. \"Defense Intelligence Agency\" Encyclopedia of Espionage, Intelligence and Security, Cengage Learning , 2003\n^ Defense Intelligence Agency. \"Get Ready: DIA Is Ready for a Changing World \", September 10, 2013\n^ DIA sending hundreds more spies overseas The Washington Post December 1, 2012", "title": "Defense Intelligence Agency"}