{"summary": "Delirium is a medical term.", "full_text": "Delirium, or acute confusional state, is an organically-caused decline from a previously attained baseline level of cognitive function. It is typified by fluctuating course, attentional deficits and generalized severe disorganization of behavior. It typically involves other cognitive deficits, changes in arousal , perceptual deficits, altered sleep-wake cycle, and psychotic features such as hallucinations and delusions.\nDelirium itself is not a disease, but rather a clinical syndrome . It may result from an underlying disease, from drugs administered during treatment of that disease in a critical phase, withdrawal from drugs, from a new problem with mentation, or from varying combinations of two or more of these factors. It is a corollary of the criteria that a diagnosis of delirium usually cannot be made without a previous assessment, or knowledge, of the affected person's baseline level of cognitive function. In other words, a mentally disabled or demented person who is operating at their own baseline level of mental ability would be expected to appear delirious without a baseline mental functional status against which to compare.\nDelirium may be caused by a disease process outside the brain that nonetheless affects the brain, such as infection  or drug effects, particularly anticholinergics or other CNS depressants . Although hallucinations and delusions are sometimes present in delirium, these are not required for the diagnosis, and the symptoms of delirium are clinically distinct from those induced by psychosis or hallucinogens  Delirium must by definition be caused by an organic process, i.e., a physically identifiable structural, functional, or chemical problem in the brain , and thus, fluctuations of mentation due to changes in purely psychiatric processes or diseases, such as sudden psychosis from schizophrenia or bipolar disorder, are  not termed delirium.\nLike its components , delirium is the common manifestation of new organic brain dysfunction . Delirium requires both a sudden change in mentation, and an organic cause for this. Thus, without careful assessment and history, delirium can easily be confused with a number of psychiatric disorders or long term organic brain syndromes, because many of the signs and symptoms of delirium are conditions also present in dementia, depression, and psychosis. Delirium may newly appear on a background of mental illness, baseline intellectual disability, or dementia, without being due to any of these problems.\nTreatment of delirium requires treating the underlying cause. In some cases, temporary or palliative or symptomatic treatments are used to comfort patients or to allow better patient management . Delirium is probably the single most common acute disorder affecting adults in general hospitals. It affects 10-20% of all hospitalized adults, and 30-40% of elderly hospitalized patients and up to 80% of ICU patients. In ICU patients or in other patients requiring critical care, delirium is not simply an acute brain disorder but in fact is a harbinger of much greater likelihood of death within the 12 months which follow the ICU patient's hospital discharge.", "title": "Delirium"}