{"summary": "The U.S.", "full_text": "The Democratic Party is one of the two major contemporary political parties in the United States, along with the Republican Party. Tracing its origins back to Thomas Jefferson's and James Madison's Democratic-Republicans, the modern-day Democratic Party was founded around 1828, making it the world's oldest active party.\nOnce the cradle of classical liberalism and, to some extent, libertarianism in the United States, since the 1930s, the party has promoted a center-left, social-liberal platform, supporting social justice and a mixed economy. The Democrats' philosophy of modern American liberalism advocates social and economic equality, along with the welfare state. It pursues a mixed economy by providing government intervention and regulation in the economy. These interventions, such as the introduction of social programs, support for labor unions, moves toward universal health care and equal opportunity, consumer protection, and environmental protection, form the core of the party's economic policy.\nWell into the 20th century, the party had a conservative pro-business wing and attracted strong support from the European ethnics, most of whom Catholics, based in the major cities and included a populist-conservative and evangelical wing based in the rural South. After 1932 and Franklin D. Roosevelt's New Deal, the business wing withered and, between the 1960s and the 1990s, Southern whites and many European ethnics moved into the Republican Party. Today, the congressional Democratic caucus is composed mostly of progressives and centrists, with a smaller minority of conservatives.\nThere have been 15 Democratic presidents: the first was Andrew Jackson, who served from 1829 to 1837, and the most recent is the current one, Barack Obama, the first African American president, who has served since 2009.\nIn the 114th Congress, following the 2014 elections, Democrats hold a minority of seats in the House of Representatives as well as in the Senate. The party also holds 18 governorships and control of a minority of state legislatures.", "title": "Democratic Party (United States)"}