{"summary": "Denver is the capital and largest city in the U.S.", "full_text": "The City and County of Denver  is the capital and most populous municipality of the U.S. state of Colorado. As of 2014, Denver is also the most populous county in Colorado. Denver is located in the South Platte River Valley on the western edge of the High Plains just east of the Front Range of the Rocky Mountains. The Denver downtown district is located immediately east of the confluence of Cherry Creek with the South Platte River, approximately 12 mi  east of the foothills of the Rocky Mountains. Denver is nicknamed the Mile-High City because its official elevation is exactly one mile  above sea level, making it one of the highest major cities in the United States. The 105th meridian west of Greenwich, the longitudinal reference for the Mountain Time Zone, passes directly through Denver Union Station.\nDenver is ranked as a Beta- world city by the Globalization and World Cities Research Network. With a 2014 estimated population of 663,862, Denver ranks as the 21st-most populous U.S. city. The 10-county Denver-Aurora-Lakewood, CO Metropolitan Statistical Area had an estimated 2013 population of 2,697,476 and ranked as the 21st most populous U.S. metropolitan statistical area. The 12-city Denver-Aurora, CO Combined Statistical Area had an estimated 2013 population of 3,277,309, which ranks as the 16th most populous U.S. metropolitan area. Denver is the most populous city of the Front Range Urban Corridor, an oblong urban region stretching across two states with population of 5,467,633 in 2010. Denver is the most populous city within a 500-mile  radius and the most populous city in the Mountain West and the third-most populous city in the Southwestern United States after Phoenix, Arizona and El Paso, Texas. Its metropolitan population is the second-largest in the Southwest after that of Phoenix. According to a 2009 Pew Research Center study, Denver ranks as the most popular American city, based on where people want to live.", "title": "Denver"}