{"summary": "Dhaka is the capital city of Bangladesh.", "full_text": "Dhaka  is the capital of Bangladesh. It is the principal city of Dhaka District and Dhaka Division. The Dhaka Metropolitan Area is the 11th largest city proper in the world, with a population of 12 million people. The Greater Dhaka Area covers a population of 17 million people. The historic quarter of Dhaka stands on the east bank of the Buriganga River. It is located in the central part of the Bengal delta. Bengali Muslims make up the majority of the population, followed by Bengali Hindu, Buddhist, Bengali Christian and Bahai Faith communities.\nThe city's name was Jahangir Nagar  in the 17th century. It was the Mughal capital of Bengal for 75 years; and flourished in trade and culture as a cosmopolitan commercial capital and the hub of the worldwide muslin and silk trade. The city hosted two major caravansaries of the subcontinent: the Bara Katra and Choto Katra, located on the riverfront of the Buriganga. The Mughals decorated the city with well-laid out gardens, tombs, mosques, palaces and forts. Dhaka became known as the City of Mosques in Bengal. It was also described as the Venice of the East. The old city was home to various Eurasian merchant groups. At the height of its medieval glory, Dhaka was regarded as one of the wealthiest and most prosperous cities in the world. It was central to the economy of Mughal Bengal, which generated 50% of Mughal GDP.\nIn 1793, Dhaka was ceded to the British East India Company. British Dacca developed in the late 19th and early 20th centuries, with the establishment of railways, jute trading and various educational and cultural institutions. It was the capital of British Eastern Bengal and Assam between 1905 and 1912. After the Partition of British India in 1947, Dhaka became the administrative capital of East Pakistan. Due to major political, economic and cultural frictions between East and West Pakistan, the city was subjected to long periods of martial law and military suppression during the Bangladesh Liberation War. After independence, Dhaka witnessed rapid urban growth as the center of political, economic and cultural life in Bangladesh.\nModern Dhaka is one of Bangladesh's twin economic centers, along with Chittagong, to which it is connected by the Grand Trunk Road and the Bangladesh Railway. The city was the 2012 ISESCO Asian Capital of Culture. It is served by Shahjalal International Airport. As the most densely populated and one of the fastest growing megacities in the world, it faces many challenges common to a developing world metropolis, including traffic congestion, crime, urban pollution and poverty. With a daily traffic of over 600,000 cycle rickshaws, Dhaka is nicknamed as the Rickshaw Capital of the World.", "title": "Dhaka"}