{"summary": "Die Hard 2  is an American action movie starring Bruce Willis, Bonnie Bedelia, and William Sadler.", "full_text": "Die Hard 2  is a 1990 American action film and the second in the Die Hard film series. It was released on July 4, 1990. The film was directed by Renny Harlin, and stars Bruce Willis as John McClane. The film co-stars Bonnie Bedelia , William Sadler, Art Evans, William Atherton , Franco Nero, Dennis Franz, Fred Thompson, John Amos, and Reginald VelJohnson, returning briefly in his role as Sgt. Al Powell from the first film.\nThe screenplay was written by Steven E. de Souza and Doug Richardson, adapted from Walter Wager's novel 58 Minutes. The novel has the same premise but differs slightly: A cop must stop terrorists who take an airport hostage while his wife's plane circles overhead. He has 58 minutes to do so before the plane crashes. Roderick Thorp, who wrote the novel Nothing Lasts Forever, upon which Die Hard was based, receives credit for creating \"certain original characters\", although his name is misspelled onscreen as \"Roderick Thorpe\".\nAs with the first film, the action in Die Hard 2 takes place on Christmas Eve. McClane is waiting for his wife to land at Washington Dulles International Airport when terrorists take over the air traffic control system. He must stop the terrorists before his wife's plane and several other incoming flights that are circling the airport run out of fuel and crash. During the night, McClane must also contend with airport police, maintenance workers, and a military commander who does not want his assistance.\nThe film was preceded by Die Hard and followed by Die Hard with a Vengeance in 1995, Live Free or Die Hard in 2007 and A Good Day to Die Hard in 2013.\n^ a b c \"Die Hard 2 - Box Office Mojo\". Retrieved 2011-07-23. \n^ The film's on-screen title is Die Hard 2, and the film's official website at the Wayback Machine  refers to it as such. The film's original advertising used \"Die Harder\" as a tagline, and many releases of the film  came out under the title Die Hard 2: Die Harder. Several other official sources, such as the director's website and the Die Hard Trilogy video game, also refer to it as Die Hard 2: Die Harder.", "title": "Die Hard 2"}