{"summary": "Tupac Amaru Shakur  was an American hip-hop artist, who sold many records.", "full_text": "Digital Underground was an alternative hip hop group from Oakland, California. Their personnel changed and rotated with each album and tour.\nDigital Underground's leader and mainstay was Greg \"Shock G\" Jacobs ; Shock G formed the group in 1987 with Jimi \"Chopmaster J\" Dright of Berkeley, California, and Tampa hip-hop radio deejay Kenneth \"Kenny-K\" Waters.\nHeavily influenced by the various funk bands of the 1970s, Digital Underground sampled such music frequently, which became a defining element of West Coast rap. As \"Rackadelic\", Jacobs designed album covers and cartoon-laced liner notes, in homage to Parliament-Funkadelic album designs. Digital Underground is also notable for launching the career of member Tupac Shakur, as well as spinning off side projects and solo acts including Raw Fusion, Saafir, and singer Mystic.\nFollowing the release of their \"Doowutchyalike\" single and video in the summer of 1989, the band gained popularity with their song \"The Humpty Dance\" in 1990. Digital Underground toured nearly every year up until 2008; this consisted of live shows in Europe, Japan, Canada, Australia, and the U.S. While the group's origins lay mostly in Oakland and Berkeley, California, various characters and voices from around the U.S and U.K. appeared on the band's albums. Shock G and Money-B were the only individuals to appear on every album. Other recurring key contributors were David \"DJ Fuze\" Elliot, and deejay/producer Jeremy \"J-Beats\" Jackson, who both assisted Jacobs in developing the sound.\nThe group appeared in and donated music to the 1991 Dan Aykroyd film Nothing but Trouble.\nAfter approximately twenty years of touring, Shock G announced that the group would officially disband in 2008. Shortly after that announcement was made, the group also confirmed that their May 2008 album ..Cuz a D.U. Party Don't Stop! would be their last studio effort.", "title": "Digital Underground"}