{"summary": "Dissociative identity disorder , is a mental disorder.", "full_text": "Dissociative identity disorder , previously known as multiple personality disorder , is a mental disorder on the dissociative spectrum characterized by the appearance of at least two distinct and relatively enduring identities or dissociated personality states that alternately control a person's behavior, accompanied by memory impairment for important information not explained by ordinary forgetfulness. These symptoms are not accounted for by substance abuse, seizures, other medical conditions, nor by imaginative play in children. Diagnosis is often difficult as there is considerable comorbidity with other mental disorders. Malingering should be considered if there is possible financial or forensic gain, as well as factitious disorder if help-seeking behavior is prominent.\nDID is one of the most controversial psychiatric disorders, with no clear consensus on diagnostic criteria or treatment. Research on treatment efficacy has been concerned primarily with clinical approaches and case studies. Dissociative symptoms range from common lapses in attention, becoming distracted by something else, and daydreaming, to pathological dissociative disorders. No systematic, empirically supported definition of \"dissociation\" exists. It is not the same as schizophrenia.\nAlthough neither epidemiological surveys nor longitudinal studies have been conducted, it is generally believed that DID rarely resolves spontaneously. Symptoms are said to vary over time. In general, the prognosis is poor, especially for those with comorbid disorders. There are few systematic data on the prevalence of DID. The International Society for the Study of Trauma and Dissociation states that the prevalence is between 1 and 3% in the general population, and between 1 and 5% in inpatient groups in Europe and North America. DID is diagnosed more frequently in North America than in the rest of the world, and is diagnosed three to nine times more often in females than in males. The prevalence of DID diagnoses increased greatly in the latter half of the 20th century, along with the number of identities  claimed by patients . DID is also controversial within the legal system, where it has been used as a rarely successful form of the insanity defense. The 1990s showed a parallel increase in the number of court cases involving the diagnosis.\nDissociative disorders including DID have been attributed to disruptions in memory caused by trauma and other forms of stress, but research on this hypothesis has been characterized by poor methodology. So far, scientific studies, usually focusing on memory, have been few and the results have been inconclusive. An alternative hypothesis for the etiology of DID is as a by-product of techniques employed by some therapists, especially those using hypnosis, and disagreement between the two positions is characterized by intense debate. DID became a popular diagnosis in the 1970s, 80s and 90s, but it is unclear if the actual rate of the disorder increased, if it was more recognized by health care providers, or if sociocultural factors caused an increase in therapy-induced  presentations. The unusual number of diagnoses after 1980, clustered around a small number of clinicians and the suggestibility characteristic of those with DID, support the hypothesis that DID is therapist-induced. The unusual clustering of diagnoses has also been explained as due to a lack of awareness and training among clinicians to recognize cases of DID.", "title": "Dissociative identity disorder"}