{"summary": "Djibouti  is a country on the eastern coast of Africa.", "full_text": "Djibouti , officially the Republic of Djibouti, is a country located in the Horn of Africa. It is bordered by Eritrea in the north, Ethiopia in the west and south, and Somalia in the southeast. The remainder of the border is formed by the Red Sea and the Gulf of Aden at the east. Djibouti occupies a total area of just 23,200 km2 .\nIn antiquity, the territory was part of the Land of Punt. Nearby Zeila  was the seat of the medieval Adal and Ifat Sultanates. In the late 19th century, the colony of French Somaliland was established following treaties signed by the ruling Somali and Afar sultans with the French and its railroad to Dire Dawa  allowed it to quickly supersede Zeila as the port for southern Ethiopia and the Ogaden. It was subsequently renamed to the French Territory of the Afars and the Issas in 1967. A decade later, the Djiboutian people voted for independence. This officially marked the establishment of the Republic of Djibouti, named after its capital city. Djibouti joined the United Nations the same year, on September 20, 1977. In the early 1990s, tensions over government representation led to armed conflict, which ended in a power sharing agreement in 2000 between the ruling party and the opposition.\nDjibouti is a multi-ethnic nation with a population of over 810,000 inhabitants. Arabic and French constitute the country's two official languages. About 94% of residents adhere to Islam, a religion that has been predominant in the region for more than 1,000 years. The Somali Issa and Afar make up the two largest ethnic groups. Both speak Afroasiatic languages, which serve as recognized national languages.\nDjibouti is strategically located near the world's busiest shipping lanes, controlling access to the Red Sea and Indian Ocean. It serves as a key refueling and transshipment center, and is the principal maritime port for imports to and exports from neighboring Ethiopia. A burgeoning commercial hub, the nation is the site of various foreign military bases, including Camp Lemonnier. The Intergovernmental Authority on Development  regional body also has its headquarters in Djibouti City.", "title": "Djibouti"}