{"summary": "Donald Allan \"Don\" Dunstan AC, QC  was a South Australian politician.", "full_text": "Donald Allan \"Don\" Dunstan AC, QC  was a South Australian politician. He entered politics as the Member for Norwood in 1953, became state Labor leader in 1967, and was Premier of South Australia between June 1967 and April 1968, and again between June 1970 and February 1979.\nThe son of business executive, Dunstan grew up as part of the Adelaide establishment. He excelled academically before encountering his progressive political awakening while training in law and arts at the University of Adelaide. His upper-class background and scholarly bearing made him unusual for the Labor Party at the time, but he rose quickly and entered parliament at the age of 26. Dunstan quickly came to attention as Labor's standout performer, a charismatic and aggressive debater in an era of sedate political conduct. The dominant political figure at the time was Premier Thomas Playford IV, then leading the Liberal and Country League  through a 27-year hold on power, aided by a system of electoral malapportionment dubbed the Playmander, which gave undue weight to the LCL's rural base since its introduction by the LCL in 1936. Dunstan stridently pursued the LCL over the Playmander. In the late 1950s, Dunstan became well known for his campaign against the death penalty being imposed on Max Stuart, who was convicted of rape and murder of a small girl. He harried Playford aggressively over the matter, creating an uproar over what he saw as an unfair process. Playford eventually relented, and appeared shaken thereafter; the event was seen as a turning point in the LCL's decline, and Labor gained momentum. During Labor's time in opposition, Dunstan was prominent in securing some reforms in Aboriginal rights, and was at the forefront of Labor abandoning the White Australia Policy.\nLabor conducted an extensive campaign in marginal LCL seats at the 1965 election, resulting in 21 of 39 seats, with Frank Walsh and the Labor Party taking power. As Deputy Premier and Attorney-General, the youthful and charismatic Dunstan made his older peers look lethargic as television became increasingly ubiquitous. The LCL opposition changed leaders and installed the young Steele Hall, worrying Labor as the elderly Walsh appeared bumbling in contrast. This resulted in Labor replacing Walsh with Dunstan. Despite maintaining a much larger vote over the LCL, Labor lost two seats at the 1968 election, with the LCL forming government with support of an independent. Dunstan responded by increasing his attacks on the Playmander and was able to convincingly sustain Playmander attacks with the effect of convincing the LCL into watering down the malapportionment. Again with little change in Labor's vote but with the Playmander removed, Labor won 27 of 47 seats at the 1970 election. With a fairer seat and boundary system in place, Dunstan won three more elections, in 1973, 1975 and 1977.\nA reformist, Dunstan brought profound change to South Australian society. His socially progressive administration saw Aboriginal land rights recognised, homosexuality decriminalised, the first female judge appointed, the first non-British governor, Sir Mark Oliphant, and later, the first indigenous governor Sir Douglas Nicholls. He enacted consumer protection laws, reformed and expanded the public education and health systems, abolished the death penalty, relaxed censorship and drinking laws, created a ministry for the environment, enacted anti-discrimination law, and implemented electoral reforms such as the overhaul of the Legislative Council of parliament, lowered the voting age to 18, enacted universal suffrage, and completely abolished malapportionment, changes which gave him a less hostile parliament and allowed him to enact his reforms. He established Rundle Mall, enacted measures to protect buildings of historical heritage, and encouraged a flourishing of the arts, with support for the Adelaide Festival Centre, the State Theatre Company, and the establishment of the South Australian Film Corporation. He encouraged cultural exchanges with Asia, multiculturalism and an increase in the state's culinary awareness and sophistication. He is recognised for his role in reinvigorating the social, artistic and cultural life of South Australia during his nine years in office, remembered as the Dunstan Decade. However, there were also problems; the economy began to stagnate, and the large increases to burgeoning public service generated claims of waste. One of Dunstan's pet projects, a plan to build a new city at Monarto to alleviate urban pressures in Adelaide, was abandoned when economic and population growth stalled, with much money and planning already invested. After four consecutive election wins, Dunstan's administration began to falter in 1978 following his dismissal of Police Commissioner Harold Salisbury, as controversy broke out over whether he had improperly interfered into a judicial investigation. In addition, policy problems and unemployment began to mount, as well as unsubstantiated rumours of corruption and personal impropriety. Dunstan became increasingly short-tempered, and the strain was increased by the death of his second wife. His resignation from the premiership and politics in 1979 was abrupt after collapsing due to ill health, but he would live for another 20 years, remaining a vocal and outspoken campaigner for progressive social policy.", "title": "Don Dunstan"}