{"summary": "Donald Hebb Rumsfeld  is a United States businessman and politician.", "full_text": "Donald Henry Rumsfeld  is an American politician and businessman. Rumsfeld served as the 13th Secretary of Defense from 1975 to 1977 under President Gerald Ford, and as the 21st Secretary of Defense from 2001 to 2006 under President George W. Bush. He is the youngest and the second oldest  person to have served as Secretary of Defense. Additionally, Rumsfeld was a four-term U.S. Congressman from Illinois , Director of the Office of Economic Opportunity , Counsellor to the President , the United States Permanent Representative to NATO , and White House Chief of Staff .\nBorn in Illinois, Rumsfeld attended Princeton University, graduating in 1954 with a degree in political science. After serving in the Navy for three years, he mounted a campaign for Congress in Illinois' 13th Congressional District, winning in 1962 at the age of 30. He was a leading co-sponsor of the Freedom of Information Act. Rumsfeld reluctantly accepted an appointment by President Richard Nixon to head the Office of Economic Opportunity in 1969; appointed Counsellor by Nixon and entitled to Cabinet-level status, he would also head up the Economic Stabilization Program before being appointed Ambassador to NATO. Called back to Washington in August 1974, Rumsfeld was appointed Chief of Staff by President Ford, and soon successfully urged Ford to veto an expansion of the Freedom of Information Act, though the veto was easily overridden. Rumsfeld recruited a young one-time staffer of his, Dick Cheney, to succeed him when Ford nominated him Secretary of Defense in 1975.\nWhen Ford lost the 1976 election, Rumsfeld returned to private business life, and was named president and CEO of the pharmaceutical corporation G. D. Searle & Company, during which time he led the legalization of Aspartame. He was later named CEO of General Instrument from 1990 to 1993, and chairman of Gilead Sciences from 1997 to 2001.\nRumsfeld was recommended for the position of Defense Secretary by incoming Vice President Dick Cheney in late 2000, and was appointed in January 2001 by President George W. Bush. During his tenure, he was a leading neoconservative voice and one of the key individuals responsible for the restructuring of the military in the new 21st century. Rumsfeld was crucial in planning the United States' response to the September 11 attacks, which included two wars, one in Afghanistan and one in Iraq. In addition to war strategy, Rumsfeld's tenure became highly controversial for the Abu Ghraib torture and prisoner abuse scandal, as well as the use of enhanced interrogation techniques. Known in media circles for his outspokenness and candor, he gradually lost political support as the wars continued, and he resigned in late 2006. He has since published his autobiography Known and Unknown: A Memoir and Rumsfeld's Rules: Leadership Lessons in Business, Politics, War, and Life.\nIn an authorized biography released in November 2015, 41st President George H. W. Bush was openly critical of Rumsfeld's role in George W. Bush's administration, particularly his role in the Iraq War.", "title": "Donald Rumsfeld"}