{"summary": "Donovan Phillips Leitch  is a Scottish-born pop singer and guitarist, who was popular in the 1960s.", "full_text": "Donovan  is a Scottish singer, songwriter and guitarist. He developed an eclectic and distinctive style that blended folk, jazz, pop, psychedelia, and world music . He has lived in Scotland, London and California, and, since at least 2008, in County Cork, Ireland, with his family. Emerging from the British folk scene, Donovan reached fame in the United Kingdom in early 1965 with live performances on the pop TV series, Ready Steady Go!.\nHaving signed with Pye Records in 1965, he recorded singles and two albums in the folk vein, but after a new contract with US CBS/Epic Records his popularity spread to other countries. After extricating himself from his original management contract, he began a long and successful collaboration with Mickie Most, a leading British independent record producer, with hits in the UK, the US and other countries.\nHis most successful singles were the early UK hits \"Catch the Wind\", \"Colours\" and \"Universal Soldier\" in 1965. \"Sunshine Superman\" topped the US Billboard Hot 100 chart , and \"Mellow Yellow\" reached US number two the following year, with \"Hurdy Gurdy Man\" in the Top 5 in both countries in 1968. He was the first artist to be signed to CBS/Epic Records by the new administrative vice-president, Clive Davis. Donovan and Most collaborated on hit albums and singles between 1965 and 1970. He became a friend of pop musicians including Joan Baez, Brian Jones and The Beatles. He taught John Lennon a finger-picking guitar style in 1968. Donovan's commercial fortunes waned after parting with Most in 1969, and he left the industry for a time.\nDonovan continued to perform and record sporadically in the 1970s and 1980s. His musical style and hippie image were scorned by critics, especially after punk rock. He stopped performing and recording several times but had a revival in the 1990s with the emergence of the rave scene in Britain. He recorded the 1996 album Sutras with producer Rick Rubin and in 2004 made a new album, Beat Cafe. Donovan was inducted into the Rock and Roll Hall of Fame in 2012 and the Songwriters Hall of Fame in 2014.", "title": "Donovan"}