{"summary": "Switzerland  is a small country in Western Europe.", "full_text": "Doris Leuthard  is a Swiss politician and lawyer. Since 1 August 2006, she has been a member of the Swiss Federal Council. From 1 August 2006 till 31 October 2010 she was head of the Federal Department of Economic Affairs . Since 1 November 2010 she is head of the Federal Department of Environment, Transport, Energy and Communications. She was elected President of the Confederation for 2010.\nLeuthard was a member of the Swiss National Council from 1999 to 2006 and President of the Christian Democratic People's Party  .\nFollowing the resignation of Joseph Deiss from the Swiss Federal Council, Leuthard was elected as his successor on 14 June 2006. She received 133 out of 234 valid votes, and became the 109th member  of the Federal Council. Her election represented a departure from a long precedent of replacing a member of the Federal Council with someone from the same language group. While Deiss was a French speaker, Leuthard is a German speaker.\nFor the calendar year 2009, Leuthard was elected Vice President of the Swiss Confederation, virtually assuring her election as president for the calendar year 2010. Due to a large amount of turnover on the Council in recent years, she was the longest-serving councilor not to have served as president. She was the third woman to hold the post, after Ruth Dreifuss  and Micheline Calmy-Rey .\nAs President of the Confederation, Leuthard presided over meetings of the Federal Council and carried out representative functions that would normally be handled by a head of state in other democracies . She was also the highest-ranking official in the Swiss order of precedence, and had the power to act on behalf of the whole Council in emergency situations. However, in most cases, Leuthard was merely primus inter pares, with no power above and beyond her six colleagues. She was succeeded by Calmy-Rey in 2011, the first time two women had held the office in succession.\nFollowing a reshuffle of portfolios after the by-election of two new councilors in 2010, Leuthard replaced outgoing Moritz Leuenberger at the head of the Federal Department of Environment, Transport, Energy and Communications.\nThe project SAFFA 2020 is under the patronage of the three federal councillors  Doris Leuthard, Simonetta Sommaruga and Eveline Widmer-Schlumpf as well as by the former councillor  Micheline Calmy-Rey.", "title": "Doris Leuthard"}