{"summary": "According to the WHO, a drug is a substance that can change how a living organism works.", "full_text": "A drug is, in the broadest of terms, a chemical substance that has known biological effects on humans or other animals. Foods are generally excluded from this definition, in spite of their physiological effects on animal species.\nIn pharmacology, a drug is \"a chemical substance used in the treatment, cure, prevention, or diagnosis of disease or used to otherwise enhance physical or mental well-being.\" Pharmaceutical drugs may be used for a limited duration, or on a regular basis for chronic disorders. Pharmaceutical drugs are often classified into groups of related drugs known as a drug class, which have similar chemical structures, the same mechanism of action , a related mode of action, and/or are used to treat the same disease. The Anatomical Therapeutic Chemical Classification System , the most widely used drug classification system, assigns drugs a unique ATC code, which is an alphanumeric code that assigns it to specific drug classes within the ATC system.\nPsychoactive drugs are chemical substances that affect the function of the nervous system, altering perception, mood or consciousness. Alcohol, nicotine, and caffeine are the most widely consumed psychoactive drugs worldwide. Recreational drugs are drugs that are not used for medicinal purposes, but are instead used for pleasure. Common recreational drugs include alcohol, nicotine and caffeine, as well as other substances such as opiates and amphetamines. Some drugs can cause addiction and habituation and all drugs can cause side effects. Many drugs are illegal for recreational purposes and international treaties such as the Single Convention on Narcotic Drugs exist for the purpose of legally prohibiting certain substances.\n^ Richard Lovett . \"Coffee: The demon drink?\". Retrieved 2014-05-01. \n^ http://www.forbes.com/sites/robertlaura/2013/12/26/will-your-retirement-home-have-a-liquor-license/\n^ Nelson, Max . The Barbarian's Beverage: A History of Beer in Ancient Europe. Abingdon, Oxon: Routledge. p. 1. ISBN 0-415-31121-7. Retrieved 21 September 2010. \n^ According to the statistic of the Food and Agriculture Organization the production quantity in 2006 of coffee was 7.8 million tonnes and of tobacco was 6.7 million tonnes.\n^ \"Drug.\" Merriam Webster: Concise Encyclopedia\n^ a b \"Drug.\" Dictionary.com Unabridged , Random House, Inc., via dictionary.com. Retrieved on 20 September 2007.\n^ \"Drug Definition\". Retrieved 2014-05-01. \n^ \"Drug - Definition\". Retrieved 2014-05-01. \n^ \"Drug.\" The American Heritage Science Dictionary, Houghton Mifflin Company, via dictionary.com. Retrieved on 20 September 2007.\n^ Mahoney A, Evans J. \"Comparing drug classification systems\". AMIA ... Annual Symposium Proceedings / AMIA Symposium. AMIA Symposium: 1039. PMID 18999016. \n^ World Health Organization . Introduction to drug utilization research . Geneva: World Health Organization. p. 33. ISBN 924156234X. \n^ \"CHAPTER 1 Alcohol and Other Drugs\". ISBN 0-7245-3361-3 http://www.nt.gov.au/health/healthdev/health_promotion/bushbook/volume2/chap1/sect1.htm.  \n^ http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3181622/\n^ \"Recreational Drug\". The Free Dictionary. Retrieved 16 March 2015. \n^ Fox, Thomas Peter; Oliver, Govind; Ellis, Sophie Marie . \"The Destructive Capacity of Drug Abuse: An Overview Exploring the Harmful Potential of Drug Abuse Both to the Individual and to Society\". ISRN Addiction 2013. doi:10.1155/2013/450348. Retrieved 15 April 2015. \n^ \"MHRA Side Effects of Medicines.\" MHRA Side Effects of Medicines,", "title": "Drug"}