{"summary": "Edward Kennedy \"Duke\" Ellington  was an American composer, pianist, and Big band leader.", "full_text": "Edward Kennedy \"Duke\" Ellington  was an American composer, pianist and bandleader of jazz orchestras. He led his orchestra from 1923 until his death, his career spanning over 50 years.\nBorn in Washington, D.C., Ellington was based in New York City from the mid-1920s onward, and gained a national profile through his orchestra's appearances at the Cotton Club in Harlem. In the 1930s, his orchestra toured in Europe. Though widely considered to have been a pivotal figure in the history of jazz, Ellington embraced the phrase \"beyond category\" as a liberating principle, and referred to his music as part of the more general category of American Music, rather than to a musical genre such as jazz.\nSome of the musicians who were members of Ellington's orchestra, such as saxophonist Johnny Hodges, are considered to be among the best players in jazz. Ellington melded them into the best-known orchestral unit in the history of jazz. Some members stayed with the orchestra for several decades. A master at writing miniatures for the three-minute 78 rpm recording format, Ellington often composed specifically to feature the style and skills of his individual musicians.\nOften collaborating with others, Ellington wrote more than one thousand compositions; his extensive body of work is the largest recorded personal jazz legacy, with many of his extant works having become standards. Ellington also recorded songs written by his bandsmen, for example Juan Tizol's \"Caravan\", and \"Perdido\", which brought a Spanish tinge to big band jazz. After 1941, Ellington collaborated with composer-arranger-pianist Billy Strayhorn, whom he called his writing and arranging companion. With Strayhorn, he composed many extended compositions, or suites, as well as additional short pieces. Following an appearance at the Newport Jazz Festival, in July 1956, Ellington and his orchestra enjoyed a major career revival and embarked on world tours. Ellington recorded for most American record companies of his era, performed in several films, scoring several, and composed stage musicals.\nDue to his inventive use of the orchestra, or big band, and thanks to his eloquence and charisma, Ellington is generally considered to have elevated the perception of jazz to an art form on a par with other traditional musical genres. His reputation continued to rise after his death, and he was awarded a special Pulitzer Prize for music in 1999.\n\n", "title": "Duke Ellington"}