{"summary": "The University of Durham is a university in the City of Durham in the north of England.", "full_text": "Durham University  is a collegiate research university in Durham, North East England. It was founded by an Act of Parliament in 1832 and granted a Royal Charter in 1837. It was one of the first universities to commence tuition in England for more than 600 years and claims to be the third oldest university in England, and consequently the seventh oldest in the UK, although this is disputed.\nDurham has an estate which includes 63 listed buildings, ranging from the 11th-century Castle to a 1930s Art Deco Chapel. The university also owns and manages the Durham World Heritage Site in partnership with Durham Cathedral. The university's ownership of the World Heritage Site includes Durham Castle , Palace Green, and the surrounding buildings including the historic Cosin's Library.\nThe chancellor of the university is Sir Thomas Allen, who succeeded Bill Bryson in January 2012. As a collegiate university, its main functions are divided between the academic departments of the university and 16 colleges. In general, the departments perform research and provide lectures to students, while the colleges are responsible for the domestic arrangements and welfare of undergraduate students, graduate students, post-doctoral researchers and some university staff. The university is a member of the Russell Group of leading UK universities after previously being a member of the 1994 Group. Durham is also affiliated with several university groups including the N8 Research Partnership and the Matariki Network of Universities.\nThe university is currently ranked 5th to 6th by recent national league tables of the British universities . In terms of average UCAS points of entrants, Durham ranked 5th in 2014. \"Long established as the leading alternative to Oxford and Cambridge\", the university attracts \"a largely middle class student body\" according to The Times's Good University Guide. In 2014, Durham had the fifth highest proportion of privately educated students at 36.6%. In 2013, Durham was judged to have the best quality of student life in the country in the inaugural Lloyds Bank rankings and has never  been out of the top three, coming in third in 2014 and second in 2015. The university was named Sunday Times University of the Year for 2005, having previously been shortlisted for 2004 award, and the Times and Sunday Times Sports University of the Year for 2015.\nCurrent and emeritus academics include 14 Fellows of the Royal Society, 17 Fellows of the British Academy, 14 Fellows of the Academy of Social Sciences, 5 Fellows of the Royal Society of Edinburgh, 2 Fellows of the Royal Society of Arts and 2 Fellows of the Academy of Medical Sciences. Durham graduates have long used the Latin post-nominal letters Dunelm after their degree, from Dunelmensis .", "title": "Durham University"}