{"summary": "New Jersey is one of the 50 states of the United States of America.", "full_text": "The Province of East Jersey, along with the Province of West Jersey, between 1674 and 1702 in accordance with the Quintipartite Deed were two distinct political divisions of the Province of New Jersey, which became the U.S. state of New Jersey. The two provinces were amalgamated in 1702. East Jersey's capital was located at Perth Amboy. Determination of an exact location for a border between West Jersey and East Jersey was often a matter of dispute.\nThe area comprising East Jersey had been part of New Netherland. Early settlement  by the Dutch included Pavonia , Vriessendael  and Achter Col  These settlements were compromised in Kieft's War  and the Peach Tree War . Settlers again returned to the western shores of the Hudson River in the 1660 formation of Bergen, New Netherland, which would become the first permanent European settlement in the territory of the modern state of New Jersey. During the Second Anglo-Dutch War, on August 27, 1664, New Amsterdam surrendered to English forces.\nBetween 1664 and 1674 most settlement was from other parts of the Americas, especially New England, Long Island, and the West Indies. Elizabethtown and Newark in particular had a strong Puritan character. South of the Raritan River the Monmouth Tract was developed primarily by Quakers from Long Island. In 1675, East Jersey was partitioned into four counties for administrative purposes: Bergen County, Essex County, Middlesex County, and Monmouth County. There were seven established towns: Shrewsbury, Middleton, Piscataway, Woodbridge, Elizabethtown, Newark, and Bergen. In a survey taken in 1684 the population was estimated to be 3500 individuals in about 700 families. .\nAlthough a number of the East Jersey proprietors in England were Quakers and the governor through most of the 1680s was the leading Quaker Robert Barclay, the Quaker influence on government was not significant. Even the immigration instigated by Barclay was oriented toward promoting Scottish influence more than Quaker influence. In 1682 Barclay and the other Scottish proprietors began the development of Perth Amboy as the capital of the province.\nFrequent disputes between the residents and the mostly-absentee proprietors over land ownership and quitrents plagued the province until its surrender to Queen Anne's government in 1702.", "title": "East Jersey"}