{"summary": "The Eastern Front of World War I was the theatre in which Germany and Austria-Hungary fought Russia.", "full_text": "The Eastern Front of World War I  was a major theatre of operations that encompassed at its greatest extent the entire frontier between the Russian Empire and Romania on one side and the Austro-Hungarian Empire, Bulgaria, the Ottoman Empire and Germany on the other. It stretched from the Baltic Sea in the north to the Black Sea in the south, included most of Eastern Europe and stretched deep into Central Europe as well. The term contrasts with \"Western Front\", which was being fought in Belgium and France.\nIn the opening months of the war, the Imperial Russian Army attempted an invasion of eastern Prussia in the northwestern theater, only to be beaten back by the Germans after some initial success. At the same time, in the south, they successfully invaded Galicia, defeating the Austro-Hungarian forces there. In Russian Poland, the Germans failed to take Warsaw. But by 1915, the German and Austro-Hungarian armies were on the advance, dealing the Russians heavy casualties in Galicia and in Poland, forcing it to retreat. Grand Duke Nicholas was sacked from his position as the commander-in-chief and replaced by the Tsar himself. Several offensives against the Germans in 1916 failed, including Lake Naroch Offensive and the Baranovichi Offensive. However, General Aleksei Brusilov oversaw a highly successful operation against Austria-Hungary that became known as the Brusilov Offensive, which saw the Russian army make large gains.\nThe Kingdom of Romania entered the war in August 1916. The Entente promised the region of Transylvania  in return for Romanian support. The Romanian Army invaded Transylvania and had initial successes, but was forced to stop and was pushed back by the Austro-Hungarians when Bulgaria attacked them in the south. Meanwhile, a revolution occurred in Russia in February 1917 . Tsar Nicholas II was forced to abdicate and a Russian Provisional Government was founded, with Georgy Lvov as its first leader, who was eventually replaced by Alexander Kerensky.\nThe newly formed Russian Republic continued to fight the war alongside Romania and the rest of the Entente until it was overthrown by the Bolsheviks in October 1917. Kerensky oversaw the July Offensive, which was largely a failure and caused a collapse in the Russian army. The new government established by the Bolsheviks signed the Treaty of Brest-Litovsk with the Central Powers, taking it out of the war and making large territorial concessions. Romania was forced to surrender and signed a similar treaty, though both of the treaties were nullified with the surrender of the Central Powers in November 1918.", "title": "Eastern Front (World War I)"}