{"summary": "Year 1852  was a leap year starting on Thursday of the Gregorian calendar.", "full_text": "The East Asiatic Company   was founded by Hans Niels Andersen in Copenhagen in 1897. Service which would eventually include both passenger and freight lines between the Danish capital, Bangkok and the far east was the initial objective. Routes to include the Baltic and Black Seas were established when in 1899, the subsidiary Russian East Asiatic Steamship Co. of St. Petersburg was formed.\nEurope-Asia operations widened when the firm, Est Asiatique Francais of Paris, followed in 1902, the new Danish West India Company, in 1905 and the Siam Steam Navigation Company, in 1908. The second of these was eventually renamed Thai Navigation Co. after the Thai government took it over in 1941. For trade in the South of Africa, the Swedish East Asiatic Company later began regular trips. The subsidiary Russian American Line began sailing to North America in 1916, continuing until 1917. Another, the Baltic American Line, continued the service under the Danish flag from 1921 to 1930. EAC was also involved in shipping for hire with tramp operations beginning in 1915 under the subsidiary D/S A/S Orient of Copenhagen.\n\nThe company was a pioneer in development of large, commercial motorships with President Andersen placing an order with Burmeister & Wain, headed by the engineer and diesel marine engine pioneer, Ivar Knudsen, for two motorships, MS Selandia and MS Fionia, to be built by that firm. Selandia began operation in 1912 after maiden voyage with the Danish crown prince and princess aboard followed by a visit to London where the ship created great interest with visits by Winston Churchill, admirals and influential shipping figures who then remained aboard for a voyage to Antwerp. A third contracted ship, Jutlandia, was built in Scotland by Barclay, Curle & Company and became the second large motorship in commercial service with any company. By 1935 the company was operating twenty-seven motorships, including a new MS Jutlandia.\nIn these middle years, business grew considerably. The United Baltic Corporation was formed as a partnership with Andrew Weir & Co. in 1919. The early 1920s saw services extend from Copenhagen to South Africa, Cuba, Australia, Mexico and North Pacific ports. New York and, later, Philadelphia, Baltimore or Norfolk, Virginia were among the ports of call added for ships on the north Pacific route in 1940. Connections between Vancouver and the far east were handled by Johnson Walton Steamships Ltd of Vancouver, when they were acquired in 1949.\nMost recently, cargo was the mainstay of the business. As air travel became more popular in later years, passenger operations shrank until 1969, when they were discontinued.", "title": "East Asiatic Company"}