{"summary": "Ecology is the science which studies the biota and the environment, and their interactions.", "full_text": "Ecology  is the scientific analysis and study of interactions among organisms and their environment. It is an interdisciplinary field that includes biology and Earth science. Ecology includes the study of interactions organisms have with each other, other organisms, and with abiotic components of their environment. Topics of interest to ecologists include the diversity, distribution, amount , and number  of particular organisms; as well as cooperation and competition between organisms, both within and among ecosystems. Ecosystems are composed of dynamically interacting parts including organisms, the communities they make up, and the non-living components of their environment. Ecosystem processes, such as primary production, pedogenesis, nutrient cycling, and various niche construction activities, regulate the flux of energy and matter through an environment. These processes are sustained by organisms with specific life history traits, and the variety of organisms is called biodiversity. Biodiversity, which refers to the varieties of species, genes, and ecosystems, enhances certain ecosystem services.\nEcology is not synonymous with environment, environmentalism, natural history, or environmental science. It is closely related to evolutionary biology, genetics, and ethology. An important focus for ecologists is to improve the understanding of how biodiversity affects ecological function. Ecologists seek to explain:\nLife processes, interactions and adaptations\nThe movement of materials and energy through living communities\nThe successional development of ecosystems\nThe abundance and distribution of organisms and biodiversity in the context of the environment.\nEcology is a human science as well. There are many practical applications of ecology in conservation biology, wetland management, natural resource management , city planning , community health, economics, basic and applied science, and human social interaction . For example, the Circles of Sustainability approach treats ecology as more than the environment 'out there'. It is not treated as separate from humans. Organisms  and resources compose ecosystems which, in turn, maintain biophysical feedback mechanisms that moderate processes acting on living  and non-living  components of the planet. Ecosystems sustain life-supporting functions and produce natural capital like biomass production , the regulation of climate, global biogeochemical cycles, water filtration, soil formation, erosion control, flood protection and many other natural features of scientific, historical, economic, or intrinsic value.\nThe word \"ecology\"  was coined in 1866 by the German scientist Ernst Haeckel . Ecological thought is derivative of established currents in philosophy, particularly from ethics and politics. Ancient Greek philosophers such as Hippocrates and Aristotle laid the foundations of ecology in their studies on natural history. Modern ecology became a much more rigorous science in the late 19th century. Evolutionary concepts relating to adaptation and natural selection became the cornerstones of modern ecological theory.", "title": "Ecology"}