{"summary": "Munich  is the third biggest city of Germany , and the capital of Bavaria.", "full_text": "Germany is the largest national economy in Europe, the fourth-largest by nominal GDP in the world, and fifth by GDP . The country is a founding member of the European Union and the Eurozone.\nThe socio-economic policy of Germany is based on the concept of the social market economy.\nIn 2014, Germany recorded the highest trade surplus in the world worth $285 billion, making it the biggest capital exporter globally. Germany is the third largest exporter in the world with 1.13 trillion euros  in goods and services exported in 2014. The service sector contributes around 70% of the total GDP, industry 29.1%, and agriculture 0.9%. Exports account for 41% of national output.  The top 10 exports of Germany are vehicles, machineries, chemical goods, electronic products, electrical equipments, pharmaceuticals, transport equipments, basic metals, food products, and rubber and plastics.\nGermany is rich in timber, iron ore, potash, salt, uranium, nickel, copper and natural gas. Energy in Germany is sourced predominantly by fossil fuels , followed by nuclear power second, then gas, wind, biomass , hydro and solar. Germany is the first major industrialized nation to commit to the renewable energy transition called Energiewende. Germany is the leading producer of wind turbines in the world. Renewables now produce over 27% of electricity consumed in Germany.\n99 percent of all German companies belong to the German \"Mittelstand,\" small and medium-sized enterprises, which are mostly family-owned. Of the world's 2000 largest publicly listed companies measured by revenue, the Fortune Global 2000, 53 are headquartered in Germany, with the Top 10 being Volkswagen, Allianz, Daimler, BMW, Siemens, BASF, Munich Re, E.ON, Bayer, and RWE.\nGermany is the world's top location for trade fairs. Around two thirds of the world's leading trade fairs take place in Germany. The largest annual international trade fairs and congresses are held in several German cities such as Hanover, Munich, Frankfurt and Berlin.\nGermany is the only country among the top five arms exporters that is not a permanent member of the United Nations Security Council.\n\n", "title": "Economy of Germany"}