{"summary": "Opportunity cost is the value of the next best thing you give up whenever you make a decision.", "full_text": "Economics education or economic education is a field within economics that focuses on two main themes: 1 the current state of, and efforts to improve, the economics curriculum, materials and pedagogical techniques used to teach economics at all educational levels; and 2 research into the effectiveness of alternative instructional techniques in economics, the level of economic literacy of various groups, and factors that influence the level of economic literacy. Economics education is distinct from economics of education, which focuses on the economics of the institution of education.\nNumerous organizations devote resources toward economics education. In the United States, organizations whose primary purpose is the advancement of economics education include the Council for Economic Education and its network of councils and centers, the Foundation for Teaching Economics and Junior Achievement. The U.S. National Center for Research in Economic Education is a resource for research and assessment in economics education. Among broader U.S. organizations that devote significant resources toward economics education is the Federal Reserve System. The Federal Reserve Bank of St. Louis has a website, EconLowdown http://www.stlouisfed.org/education_resources/ that includes free resources for teaching economics and personal finance in K-16 classes. These resources include online courses, videos, podcasts, lesson plans and more. In the United Kingdom there is The Economics Network, a government-funded national project to support economics education in Higher education contexts, and the non-profit Economics & Business Education Association  for secondary education.\nJournals devoted to the topic of economics education include the Journal of Economic Education, International Review of Economics Education, Australasian Journal of Economics Education, and Computers in Higher Education Economics Review.\n^ W.E. Becker . \"Economic Education,\" International Encyclopedia of the Social & Behavioral Sciences, pp. 4078-4084. Abstract.\n^ Computers in Higher Education Economics Review\n^ Journal of Economic Education\n^ International Review of Economics Education\n^ Australasian Journal of Economics Education", "title": "Economics education"}