{"summary": "An economy is a system of exchange of things of value.", "full_text": "An economy  or economic system consists of the production, distribution or trade, and consumption of limited goods and services by different agents in a given geographical location. The economic agents can be individuals, businesses, organizations, or governments. Transactions occur when two parties agree to the value or price of the transacted good or service, commonly expressed in a certain currency.\nIn the past, economic activity was theorized to be bounded by natural resources, labor, and capital. This view ignores the value of technology , and innovation , especially that which produces intellectual property.\nA given economy is the result of a set of processes that involves its culture, values, education, technological evolution, history, social organization, political structure and legal systems, as well as its geography, natural resource endowment, and ecology, as main factors. These factors give context, content, and set the conditions and parameters in which an economy functions. The largest national economies by continent are: the United States in the Americas, Germany in Europe, Nigeria in Africa, China in Asia and Australia in Oceania.\nA market-based economy is where goods and services are produced without obstruction or interference, and exchanged according to demand and supply between participants  by barter or a medium of exchange with a credit or debit value accepted within the network, such as a unit of currency and at some free market or market clearing price. Capital and labor can move freely to any area of emerging shortage, signaled by rising price, and thus dynamically and automatically relieve any such threat. Market based economies require transparency on information, such as true prices, to work, and may include various kinds of immaterial production, such as affective labor that describes work carried out that is intended to produce or modify emotional experiences in people, but does not have a tangible, physical product as a result.\nA command-based economy is where a central political agent commands what is produced and how it is sold and distributed. Shortages are common problems with a command-based economy, as there is no mechanism to manage the information  about the systems natural supply and demand dynamics.\nA green economy is low-carbon, resource efficient, and socially inclusive. In a green economy, growth in income and employment are driven by public and private investments that reduce carbon emissions and pollution, enhance energy and resource efficiency, and prevent the loss of biodiversity and ecosystem services.\n\n", "title": "Economy"}