{"summary": "Edinburgh  is the capital city and second largest city in Scotland.", "full_text": "Edinburgh  is the capital city of Scotland, located in Lothian on the southern shore of the Firth of Forth. It is the second most populous city in Scotland and the seventh most populous in the United Kingdom. The most recent official population estimates are 464,990 for the city of Edinburgh itself and 492,680 for the local authority area. Edinburgh lies at the heart of the Edinburgh & South East Scotland City region with a population in 2014 of 1,339,380. Recognised as the capital of Scotland since at least the 15th century, Edinburgh is home to the Scottish Parliament and the seat of the monarchy in Scotland. The city is also the annual venue of the General Assembly of the Church of Scotland and home to national institutions such as the National Museum of Scotland, the National Library of Scotland and the Scottish National Gallery. It is the largest financial centre in the UK after London.\nThe city has long been known as a centre of education, particularly in the fields of medicine, Scots law, literature, the sciences and engineering. The University of Edinburgh, founded in 1582 and now one of four in the city, was placed 17th in the QS World University Rankings in 2013 and 2014. The city is also famous for the Edinburgh International Festival and the Fringe, the latter being the largest annual international arts festival in the world. The city's historical and cultural attractions have made it the second most popular tourist destination in the United Kingdom after London, attracting over one million overseas visitors each year . Historic sites in Edinburgh include Edinburgh Castle, Holyrood Palace, the churches of St. Giles, Greyfriars and the Canongate, and the extensive Georgian New Town, built in the 18th century. Edinburgh's Old Town and New Town together are listed as a UNESCO World Heritage Site, which has been managed by Edinburgh World Heritage since 1999.", "title": "Edinburgh"}