{"summary": "Sir Edward Richard George Heath, KG, MBE, PC  also commonly known as Ted Heath was a British Conservative politician.", "full_text": "Sir Edward Richard George Heath KG MBE , often known as Ted Heath, was Prime Minister of the United Kingdom from 1970 to 1974 and Leader of the Conservative Party from 1965 to 1975.\nBorn in Kent, Heath studied at Oxford University and served in the Second World War. He was first elected to Parliament in 1950 for Bexley, and was the Chief Whip from 1955 to 1959. Entering the Cabinet as Minister of Labour in 1959, he was later promoted to Lord Privy Seal and later became President of the Board of Trade. In 1965, Heath was elected leader of the Conservative Party, retaining that position despite losing the 1966 election.\nHeath became Prime Minister after winning the 1970 election. In 1971 he oversaw the decimalisation of British coinage and in 1972, he reformed Britain's system of local government, reducing the number of local authorities and creating a number of new metropolitan counties. Possibly most significantly, he took Britain into the European Economic Community in 1973. Heath's Premiership also oversaw the height of The Troubles in Northern Ireland, with the suspension of the Stormont Parliament and the imposition of direct British rule. Unofficial talks with Provisional Irish Republican Army  delegates were unsuccessful, as was the Sunningdale Agreement of 1973, which caused the Ulster Unionist Party to withdraw from the Conservative whip.\nHeath also tried to curb the trade unions with the Industrial Relations Act 1971, and had hoped to deregulate the economy and make a transfer from direct to indirect taxation. However, rising unemployment in 1972 caused Heath to reflate the economy, attempting to control the resulting high inflation by a prices and incomes policy. Two miners' strikes, in 1972 and at the start of 1974, damaged the government, the latter causing the implementation of the Three-Day Week to conserve energy. Heath eventually called an election for February 1974 to obtain a mandate to face down the miners' wage demands, but this instead resulted in a hung parliament in which Labour, despite winning fewer votes, had four more seats than the Tories. Heath resigned as Prime Minister after trying in vain to form a coalition with the Liberal Party.\nDespite losing a second general election in October that year, Heath vowed to continue as leader of his party. In February 1975, however, his former Education Secretary Margaret Thatcher challenged and defeated Heath to win the leadership. Returning to the backbenches, Heath became an active critic of Thatcher's policies as leader and, from 1979, as Prime Minister. He remained a backbench MP until retiring in 2001, serving as the Father of the House for his last nine years in Parliament. Outside politics, Heath was a world-class yachtsman and a talented musician. He was also one of only four British Prime Ministers never to have married.\nIn August 2015 several police forces such as Hampshire, Jersey, Kent, Wiltshire, Gloucestershire, Thames Valley, and London's Metropolitan Police were reportedly investigating allegations of child sexual abuse by Heath.", "title": "Edward Heath"}