{"summary": "It is a law of mechanics and physics by Robert Hooke.", "full_text": "Elastic energy is the potential mechanical energy stored in the configuration of a material or physical system as work is performed to distort its volume or shape. Elastic energy occurs when objects are compressed and stretched, or generally deformed in any manner. Elasticity theory primarily develops formalisms for the mechanics of solid bodies and materials. The elastic potential energy equation is used in calculations of positions of mechanical equilibrium. The energy is potential as it will be converted into another form of energy, such as kinetic. Mathematically, the equation can be stated as:\n\nThe essence of elasticity is reversibility. Forces applied to an elastic material transfer energy into the material which, upon yielding that energy to its surroundings, can recover its original shape. However, all materials have limits to the degree of distortion they can endure without breaking or irreversibly altering their internal structure. Hence, the characterizations of solid materials include specification, usually in terms of strains, of its elastic limits. Beyond the elastic limit, a material is no longer storing all of the energy from mechanical work performed on it in the form of elastic energy.\nElastic energy of or within a substance is static energy of configuration. It corresponds to energy stored principally by changing the inter-atomic distances between nuclei. Thermal energy is the randomized distribution of kinetic energy within the material, resulting in statistical fluctuations of the material about the equilibrium configuration. There is some interaction, however. For example, for some solid objects, twisting, bending, and other distortions may generate thermal energy, causing the material's temperature to rise. Thermal energy in solids is often carried by internal elastic waves, called phonons. Elastic waves that are large on the scale of an isolated object usually produce macroscopic vibrations sufficiently lacking in randomization that their oscillations are merely the repetitive exchange between  potential energy within the object and the kinetic energy of motion of the object as a whole.\nAlthough elasticity is most commonly associated with the mechanics of solid bodies or materials, even the early literature on classical thermodynamics defines and uses \"elasticity of a fluid\" in ways compatible with the broad definition provided in the Introduction above.\nSolids include complex crystalline materials with sometimes complicated behavior. By contrast, the behavior of compressible fluids, and especially gases, demonstrates the essence of elastic energy with negligible complication. The simple thermodynamic formula:  where dU is an infinitesimal change in recoverable internal energy U, P is the uniform pressure  applied to the material sample of interest, and dV is the infinitesimal change in volume that corresponds to the change in internal energy. The minus sign appears because dV is negative under compression by a positive applied pressure which also increases the internal energy. Upon reversal, the work that is done by a system is the negative of the change in its internal energy corresponding to the positive dV of an increasing volume. In other words, the system loses stored internal energy when doing work on its surroundings. Pressure is stress and volumetric change corresponds to changing the relative spacing of points within the material. The stress-strain-internal energy relationship of the foregoing formula is repeated in formulations for elastic energy of solid materials with complicated crystalline structure.", "title": "Elastic potential energy"}