{"summary": "Anna Eleanor Roosevelt  was the longest-serving First Lady of the United States, holding the post from 1933 to 1945 during her husband President Franklin D.", "full_text": "Anna Eleanor Roosevelt  was an American politician, diplomat, and activist. She was the longest-serving First Lady of the United States, holding the post from March 1933 to April 1945 during her husband President Franklin D. Roosevelt's four terms in office. President Harry S. Truman later called her the \"First Lady of the World\" in tribute to her human rights achievements.\nA member of the Roosevelt and Livingston families, Eleanor had an unhappy childhood, suffering the deaths of both parents and one of her brothers at a young age. At 15, she attended Allenwood Academy in London, and was deeply influenced by its feminist headmistress Marie Souvestre. Returning to the U.S., she married her fifth cousin once removed, Franklin Delano Roosevelt, in 1905. The Roosevelts' marriage was complicated from the beginning by Franklin's controlling mother, Sara, and after discovering Franklin's affair with Lucy Mercer in 1918, Eleanor resolved to seek fulfillment in a public life of her own. She persuaded Franklin to stay in politics following his partial paralysis from polio, and began to give speeches and campaign in his place. After Franklin's election as Governor of New York, Eleanor regularly made public appearances on his behalf. She also shaped the role of First Lady during her tenure and beyond.\nThough widely respected in her later years, Roosevelt was a controversial First Lady for her outspokenness, particularly her stance on racial issues. She was the first presidential spouse to hold press conferences, write a syndicated newspaper column, and speak at a national convention. On a few occasions, she publicly disagreed with her husband's policies. She launched an experimental community at Arthurdale, West Virginia, for the families of unemployed miners, later widely regarded as a failure. She advocated for expanded roles for women in the workplace, the civil rights of African Americans and Asian Americans, and the rights of World War II refugees.\nFollowing her husband's death, Eleanor remained active in politics for the rest of her life. She pressed the United States to join and support the United Nations and became one of its first delegates. She served as the first chair of the UN Commission on Human Rights, and oversaw the drafting of the Universal Declaration of Human Rights. Later she chaired the John F. Kennedy administration's Presidential Commission on the Status of Women. By the time of her death, she was regarded as \"one of the most esteemed women in the world\"; she was called \"the object of almost universal respect\" in her New York Times obituary. In 1999, she was ranked ninth in the top ten of Gallup's List of Most Widely Admired People of the 20th Century.\n^ a b Moore, Frazier . \"PBS' 'The Roosevelts' portrays an epic threesome\". Associated Press. Retrieved September 10, 2014. \n^ \"First Lady of the World: Eleanor Roosevelt at Val-Kill\". National Park Service. Archived from the original on November 21, 2012. Retrieved May 20, 2008. \n^ \"Mrs. Roosevelt, First Lady 12 Years, Often Called 'World's Most Admired Woman'\". The New York Times. November 8, 1962. Archived from the original on December 7, 2012. Retrieved December 7, 2012. \n^ \"Mother Teresa Voted by American People as Most Admired Person of the Century\". The Gallup Organization. December 31, 1999. Archived from the original on November 21, 2012. Retrieved May 20, 2008.", "title": "Eleanor Roosevelt"}