{"summary": "Electricity is a force caused by electric charge.", "full_text": "Electricity is the set of physical phenomena associated with the presence and flow of electric charge. Electricity gives a wide variety of well-known effects, such as lightning, static electricity, electromagnetic induction and electric current. In addition, electricity permits the creation and reception of electromagnetic radiation such as radio waves.\nIn electricity, charges produce electromagnetic fields which act on other charges. Electricity occurs due to several types of physics:\nelectric charge: a property of some subatomic particles, which determines their electromagnetic interactions. Electrically charged matter is influenced by, and produces, electromagnetic fields.\nelectric field : an especially simple type of electromagnetic field produced by an electric charge even when it is not moving . The electric field produces a force on other charges in its vicinity.\nelectric potential: the capacity of an electric field to do work on an electric charge, typically measured in volts.\nelectric current: a movement or flow of electrically charged particles, typically measured in amperes.\nelectromagnets: Moving charges produce a magnetic field. Electric currents generate magnetic fields, and changing magnetic fields generate electric currents.\nIn electrical engineering, electricity is used for:\nelectric power where electric current is used to energise equipment;\nelectronics which deals with electrical circuits that involve active electrical components such as vacuum tubes, transistors, diodes and integrated circuits, and associated passive interconnection technologies.\nElectrical phenomena have been studied since antiquity, though progress in theoretical understanding remained slow until the seventeenth and eighteenth centuries. Even then, practical applications for electricity were few, and it would not be until the late nineteenth century that engineers were able to put it to industrial and residential use. The rapid expansion in electrical technology at this time transformed industry and society. Electricity's extraordinary versatility means it can be put to an almost limitless set of applications which include transport, heating, lighting, communications, and computation. Electrical power is now the backbone of modern industrial society.", "title": "Electricity"}