{"summary": "The United States Electoral College is a name used to describe the 538  Presidential electors who come together every four years during the presidential election to give their official votes for President and Vice President of the United States.", "full_text": "The United States Electoral College is the institution that elects the President and Vice President of the United States every four years. Citizens of the United States do not directly elect the president or the vice president; instead, these voters directly elect designated intermediaries called \"electors,\" who almost always have pledged to vote for particular presidential and vice presidential candidates  and who are themselves selected according to the particular laws of each state. Electors are apportioned to each of the 50 states as well as to the District of Columbia . The number of electors in each state is equal to the number of members of Congress to which the state is entitled, while the Twenty-third Amendment grants the District of Columbia the same number of electors as the least populous state, currently three. Therefore, in total, there are currently 538 electors, corresponding to the 435 members of the House of Representatives and 100 senators, plus the three additional electors from the District of Columbia.\nExcept for the electors in Maine and Nebraska, electors are elected on a \"winner-take-all\" basis. That is, all electors pledged to the presidential candidate who wins the most votes in a state become electors for that state. Maine and Nebraska use the \"congressional district method\", selecting one elector within each congressional district by popular vote and selecting the remaining two electors by a statewide popular vote. Although no elector is required by federal law to honor a pledge, there have only been very few occasions when an elector voted contrary to a pledge. The Twelfth Amendment, in specifying how a president and vice president are elected, requires each elector to cast one vote for president and another vote for vice president.\nThe candidate that receives an absolute majority of electoral votes  for the office of president or of vice president is elected to that office. The Twelfth Amendment provides for what happens if the Electoral College fails to elect a president or vice president. If no candidate receives a majority for president, then the House of Representatives will select the president, with each state delegation  having only one vote. If no candidate receives a majority for vice president, then the Senate will select the vice president, with each senator having one vote. On four occasions, most recently in 2000, the Electoral College system has resulted in the election of a candidate who did not receive the most popular votes in the election.", "title": "Electoral College (United States)"}