{"summary": "Elizabeth is a city in Union County, New Jersey, United States.", "full_text": "Elizabeth is both the largest city and the county seat of Union County, New Jersey, United States. As of the 2010 United States Census, the city had a total population of 124,969, retaining its ranking as New Jersey's fourth largest city . The population increased by 4,401  from the 120,568 counted in the 2000 Census, which had in turn increased by 10,566  from the 110,002 counted in the 1990 Census.\nIn 2008, Elizabeth was named one of \"America's 50 Greenest Cities\" by Popular Science magazine, the only city in New Jersey selected.\n^ a b c d e 2010 Census Gazetteer Files: New Jersey County Subdivisions, United States Census Bureau. Accessed May 21, 2015.\n^ US Gazetteer files: 2010, 2000, and 1990, United States Census Bureau. Accessed September 4, 2014.\n^ 2015 New Jersey Mayors Directory, New Jersey Department of Community Affairs, as of October 20, 2015. Accessed November 10, 2015.\n^ a b Departments, City of Elizabeth. Accessed August 15, 2013.\n^ \n^ U.S. Geological Survey Geographic Names Information System: City of Elizabeth, Geographic Names Information System. Accessed March 5, 2013.\n^ a b DP-1 - Profile of General Population and Housing Characteristics: 2010 for Elizabeth city, Union County, New Jersey, United States Census Bureau. Accessed December 21, 2011.\n^ \n^ a b Table DP-1. Profile of General Demographic Characteristics: 2010 for Elizabeth city, New Jersey Department of Labor and Workforce Development. Accessed December 20, 2011.\n^ 2010 Census Population: Union County, Asbury Park Press. Accessed September 2, 2011.\n^ \n^ a b GCT-PH1 Population, Housing Units, Area, and Density: 2010 - State -- County Subdivision from the 2010 Census Summary File 1 for New Jersey, United States Census Bureau. Accessed July 10, 2013.\n^ Look Up a ZIP Code for Elizabeth, NJ, United States Postal Service. Accessed December 21, 2011.\n^ Zip Codes, State of New Jersey. Accessed August 15, 2013.\n^ Area Code Lookup - NPA NXX for Elizabeth, NJ, Area-Codes.com. Accessed November 1, 2013.\n^ American FactFinder, United States Census Bureau. Accessed September 4, 2014.\n^ A Cure for the Common Codes: New Jersey, Missouri Census Data Center. Accessed July 9, 2012.\n^ US Board on Geographic Names, United States Geological Survey. Accessed September 4, 2014.\n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ Union County, NJ, National Association of Counties. Accessed January 21, 2013.\n^ The Counties and Most Populous Cities and Townships in 2010 in New Jersey: 2000 and 2010, United States Census Bureau. Accessed September 2, 2011.\n^ Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010, New Jersey Department of Labor and Workforce Development, February 2011. Accessed July 9, 2012.\n^ Svoboda, Elizabeth. \"America's 50 Greenest Cities\", Popular Science, February 8, 2008.", "title": "Elizabeth, New Jersey"}