{"summary": "Emotions are what people feel.", "full_text": "Emotion, in everyday speech, is any relatively brief conscious experience characterized by intense mental activity and a high level of pleasure or displeasure. Scientific discourse has drifted to other meanings and there is no consensus on a definition. Emotion is often intertwined with mood, temperament, personality, disposition, and motivation. In some theories, cognition is an important aspect of emotion. Those acting primarily on emotion may seem as if they are not thinking, but mental processes are still essential, particularly in the interpretation of events. For example, the realization of danger and subsequent arousal of the nervous system  is integral to the experience of fear. Other theories, however, claim that emotion is separate from and can precede cognition.\nEmotions are complex. According to some theories, they are a state of feeling that results in physical and psychological changes that influence our behavior. The physiology of emotion is closely linked to arousal of the nervous system with various states and strengths of arousal relating, apparently, to particular emotions. Emotion is also linked to behavioral tendency. Extroverted people are more likely to be social and express their emotions, while introverted people are more likely to be more socially withdrawn and conceal their emotions. Emotion is often the driving force behind motivation, positive or negative. Definition has been described as is a \"positive or negative experience that is associated with a particular pattern of physiological activity.\" According to other theories, emotions are not causal forces but simply syndromes of components, which might include motivation, feeling, behavior, and physiological changes, but no one of these components is the emotion. Nor is the emotion an entity that causes these components\nEmotions involve different components, such as subjective experience, cognitive processes, expressive behavior, psychophysiological changes, and instrumental behavior. At one time, academics attempted to identify the emotion with one of the components: William James with a subjective experience, behaviorists with instrumental behavior, psychophysiologists with physiological changes, and so on. More recently, emotion is said to consist of all the components. The different components of emotion are categorized somewhat differently depending on the academic discipline. In psychology and philosophy, emotion typically includes a subjective, conscious experience characterized primarily by psychophysiological expressions, biological reactions, and mental states. A similar multicomponential description of emotion is found in sociology. For example, Peggy Thoits described emotions as involving physiological components, cultural or emotional labels , expressive body actions, and the appraisal of situations and contexts.\nResearch on emotion has increased significantly over the past two decades with many fields contributing including psychology, neuroscience, endocrinology, medicine, history, sociology, and even computer science. The numerous theories that attempt to explain the origin, neurobiology, experience, and function of emotions have only fostered more intense research on this topic. Current areas of research in the concept of emotion include the development of materials that stimulate and elicit emotion. In addition PET scans and fMRI scans help study the affective processes in the brain. It also is influenced by hormones and neurotransmitters such as dopamine, noradrenaline, serotonin, oxytocin, cortisol and GABA.\n\n", "title": "Emotion"}