{"summary": "Environmental chemistry is the scientific study of the chemical and biochemical phenomena that occur in natural places.", "full_text": "Environmental chemistry is the scientific study of the chemical and biochemical phenomena that occur in natural places. It should not be confused with green chemistry, which seeks to reduce potential pollution at its source. It can be defined as the study of the sources, reactions, transport, effects, and fates of chemical species in the air, soil, and water environments; and the effect of human activity and biological activity on these. Environmental chemistry is an interdisciplinary science that includes atmospheric, aquatic and soil chemistry, as well as heavily relying on analytical chemistry and being related to environmental and other areas of science.\nEnvironmental chemistry is the study of chemical processes occurring in the environment which are impacted by humankind's activities. These impacts may be felt on a local scale, through the presence of urban air pollutants or toxic substances arising from a chemical waste site, or on a global scale, through depletion of stratospheric ozone or global warming. The focus in our courses and research activities is upon developing a fundamental understanding of the nature of these chemical processes, so that humankind's activities can be accurately evaluated.\nEnvironmental chemistry involves first understanding how the uncontaminated environment works, which chemicals in what concentrations are present naturally, and with what effects. Without this it would be impossible to accurately study the effects humans have on the environment through the release of chemicals.\nEnvironmental chemists draw on a range of concepts from chemistry and various environmental sciences to assist in their study of what is happening to a chemical species in the environment. Important general concepts from chemistry include understanding chemical reactions and equations, solutions, units, sampling, and analytical techniques.", "title": "Environmental chemistry"}