{"summary": "The EPR paradox is an early and strong criticism of quantum mechanics.", "full_text": "The EPR paradox of 1935 is an influential thought experiment in quantum mechanics with which Albert Einstein and his colleagues Boris Podolsky and Nathan Rosen  claimed to demonstrate that the wave function does not provide a complete description of physical reality, and hence that the Copenhagen interpretation is unsatisfactory; resolutions of the paradox have important implications for the interpretation of quantum mechanics. The essence of the paradox is that particles can interact in such a way that it is possible to measure both their position and their momentum more accurately than Heisenberg's uncertainty principle allows, unless measuring one particle instantaneously affects the other to prevent it, which would involve information being transmitted faster than light as forbidden by the theory of relativity .\nThis consequence had not previously been noticed and seemed unreasonable at the time; the phenomenon involved is now known as quantum entanglement. While EPR felt that the paradox showed that quantum theory was incomplete and should be extended with hidden variables, the usual modern resolution is to say that due to the common preparation of the two particles  the property we want to measure has a well defined meaning only when analyzed for the whole system while the same property for the parts individually remains undefined. Therefore if similar measurements are being performed on the two entangled subsystems, there will always be a correlation between the outcomes resulting in a well defined global outcome i.e. for both subsystems together. However, the outcomes for each subsystem separately at each repetition of the experiment will not be well defined or predictable. This correlation does not imply any action of the measurement of one particle on the measurement of the other, therefore it doesn't imply any form of action at a distance. This modern resolution eliminates the need for hidden variables, action at a distance or other structures introduced over time in order to explain the phenomenon.\nA preference for the latter resolution is supported by experiments suggested by Bell's theorem of 1964, which exclude some classes of hidden variable theory.\nAccording to quantum mechanics, under some conditions, a pair of quantum systems may be described by a single wave function, which encodes the probabilities of the outcomes of experiments that may be performed on the two systems, whether jointly or individually. At the time the EPR article discussed below was written, it was known from experiments that the outcome of an experiment sometimes cannot be uniquely predicted. An example of such indeterminacy can be seen when a beam of light is incident on a half-silvered mirror. One half of the beam will reflect, and the other will pass. If the intensity of the beam is reduced until only one photon is in transit at any time, whether that photon will reflect or transmit cannot be predicted quantum mechanically.\nThe routine explanation of this effect was, at that time, provided by Heisenberg's uncertainty principle. Physical quantities come in pairs called conjugate quantities. Examples of such conjugate pairs are position and momentum of a particle and components of spin measured around different axes. When one quantity was measured, and became determined, the conjugated quantity became indeterminate. Heisenberg explained this as a disturbance caused by measurement.\nThe EPR paper, written in 1935, was intended to illustrate that this explanation is inadequate. It considered two entangled particles, referred to as A and B, and pointed out that measuring a quantity of a particle A will cause the conjugated quantity of particle B to become undetermined, even if there was no contact, no classical disturbance. The basic idea was that the quantum states of two particles in a system cannot always be decomposed from the joint state of the two. An example  is: \nHeisenberg's principle was an attempt to provide a classical explanation of a quantum effect sometimes called non-locality. According to EPR there were two possible explanations. Either there was some interaction between the particles  or the information about the outcome of all possible measurements was already present in both particles.\nThe EPR authors preferred the second explanation according to which that information was encoded in some 'hidden parameters'. The first explanation of an effect propagating instantly across a distance is in conflict with the theory of relativity. They then concluded that quantum mechanics was incomplete since its formalism does not permit hidden parameters.\nViolations of the conclusions of Bell's theorem are generally understood to have demonstrated that the hypotheses of Bell's theorem, also assumed by Einstein, Podolsky and Rosen, do not apply in our world. Most physicists who have examined the issue concur that experiments, such as those of Alain Aspect and his group, have confirmed that physical probabilities, as predicted by quantum theory, do exhibit the phenomena of Bell-inequality violations that are considered to invalidate EPR's preferred \"local hidden-variables\" type of explanation for the correlations to which EPR first drew attention.", "title": "EPR paradox"}