{"summary": "Ernest Orlando Lawrence  was an American physicist.", "full_text": "Ernest Orlando Lawrence  was a pioneering American nuclear scientist and winner of the Nobel Prize in Physics in 1939 for his invention of the cyclotron. He is known for his work on uranium-isotope separation for the Manhattan Project, for founding the Lawrence Berkeley National Laboratory and the Lawrence Livermore National Laboratory.\nA graduate of the University of South Dakota and University of Minnesota, Lawrence obtained a PhD in physics at Yale in 1925. In 1928, he was hired as an associate professor of physics at the University of California, becoming the youngest full professor there two years later. In its library one evening, Lawrence was intrigued by a diagram of an accelerator that produced high-energy particles. He contemplated how it could be made compact, and came up with an idea for a circular accelerating chamber between the poles of an electromagnet. The result was the first cyclotron.\nLawrence went on to build a series of ever larger and more expensive cyclotrons. His Radiation Laboratory became an official department of the University of California in 1936, with Lawrence as its director. In addition to the use of the cyclotron for physics, Lawrence also supported its use in research into medical uses of radioisotopes. During World War II, Lawrence developed electromagnetic isotope separation at the Radiation Laboratory. It used devices known as calutrons, a hybrid of the standard laboratory mass spectrometer and cyclotron. A huge electromagnetic separation plant was built at Oak Ridge, Tennessee, which came to be called Y-12. The process was inefficient, but it worked.\nAfter the war, Lawrence campaigned extensively for government sponsorship of large scientific programs, and was a forceful advocate of \"Big Science\", with its requirements for big machines and big money. Lawrence strongly backed Edward Teller's campaign for a second nuclear weapons laboratory, which Lawrence located in Livermore, California. After his death, the Regents of the University of California renamed the Lawrence Livermore National Laboratory and Lawrence Berkeley National Laboratory after him. Chemical element number 103 was named lawrencium in his honor after its discovery at Berkeley in 1961.\n\n", "title": "Ernest Lawrence"}