{"summary": "Escape velocity is the initial speed that something would need to completely escape the gravity of a large body, like a star or a planet , by mere inertia.", "full_text": "In physics, escape velocity is the minimum speed needed for an object to \"break free\" from the gravitational attraction of a massive body. The escape velocity from Earth is about 40,270 km/h . More particularly, escape velocity is the velocity  at which the sum of an object's kinetic energy and its gravitational potential energy is equal to zero. At escape velocity the object will move away forever from the massive body, without additional acceleration  applied to the object. As the object moves away from the massive body, the object will continually slow and asymptotically approach zero speed as the object's distance approaches infinity.\nFor a spherically symmetric massive body such as a  star or planet, the escape velocity at a given distance is calculated by the formula\n\nwhere G is the universal gravitational constant , M the mass of the body to be escaped, and r the distance from the center of mass of the mass M to the object. Notice that the relation is independent of the mass of the object escaping the mass body M. Conversely, a body that falls under the force of gravitational attraction of mass M from infinity, starting with zero velocity, will strike the mass with a velocity equal to its escape velocity.\nIn this equation atmospheric friction  is not taken into account. A rocket moving out of a gravity well does not actually need to attain escape velocity to escape, but could achieve the same result  at any speed with a suitable mode of propulsion and sufficient propellant to provide the accelerating force on the object to escape. Escape velocity is only required to send a ballistic object on a trajectory that will allow the object to escape the gravity well of the mass M.\nThe term escape velocity is actually a misnomer, and it is more accurately referred to as escape speed since the necessary speed is a scalar quantity  which is independent of direction .", "title": "Escape velocity"}