{"summary": "The European Commission  is one of the seven organisations that manage the European Union .", "full_text": "The European Commission  is the executive body of the European Union responsible for proposing legislation, implementing decisions, upholding the EU treaties and managing the day-to-day business of the EU. Commissioners swear an oath at the European Court of Justice in Luxembourg, pledging to respect the treaties and to be completely independent in carrying out their duties during their mandate.\nThe Commission operates as a cabinet government, with 28 members of the Commission . There is one member per member state, though members are bound to represent the interests of the EU as a whole rather than their home state. One of the 28 is the Commission President  proposed by the European Council and elected by the European Parliament. The Council then appoints the other 27 members of the Commission in agreement with the nominated President, and the 28 members as a single body are then subject to a vote of approval by the European Parliament. The current Commission is the Juncker Commission, which took office in late 2014.\nThe term commission is used either in the narrow sense of the 28-member College of Commissioners  or to also include the administrative body of about 23,000 European civil servants who are split into departments called Directorates-General and Services. The usual procedural languages of the Commission are English, French and German.\nThe Members of the Commission and their \"cabinets\"  are based in the Berlaymont building in Brussels.\n^ EC.europa.eu\n^ \"Institutions of the EU: The European Commission\". Europa. Archived from the original on 2007-06-23. Retrieved 18 June 2007. \n^ europa.eu: \"European Commission swears oath to respect the EU Treaties\" 3 May 2010\n^ European Commission . How the European Union works: Your guide to the EU institutions . p. 20. ISBN 92-79-02225-3. Retrieved 4 December 2011. Informally, the appointed members of the Commission are known as 'commissioners'. European Commission. \"About the European Commission\". Retrieved 4 December 2011. A new team of 27 Commissioners  is appointed every five years. \n^ \n^ Treaty on European Union: Article 17:7\n^ Summaries of EU legislation: Rules of Procedure of the European Commission\n^ European Commission. \"Departments  and services\". Retrieved 4 December 2011. The Commission is divided into several departments and services. The departments are known as Directorates-General . European Commission. \"About the European Commission\". Retrieved 4 December 2011. 23 000 staff members work in the Commission in departments, known as directorates-general  or services, each responsible for a particular policy area and headed by a Director-General, who reports directly to the President. \n^ \"Official EU languages\". Europa. Retrieved 17 September 2013. The European Union has 24 official and working languages ... The European Commission employs English, French and German in general as procedural languages ...", "title": "European Commission"}