{"summary": "The Everglades is a wide and flat tropical river and mangrove swamp in the southern part of Florida near the city of Miami.", "full_text": "The Everglades  are a natural region of tropical wetlands in the southern portion of the U.S. state of Florida, comprising the southern half of a large watershed. The system begins near Orlando with the Kissimmee River, which discharges into the vast but shallow Lake Okeechobee. Water leaving the lake in the wet season forms a slow-moving river 60 miles  wide and over 100 miles  long, flowing southward across a limestone shelf to Florida Bay at the southern end of the state. The Everglades experience a wide range of weather patterns, from frequent flooding in the wet season to drought in the dry season. Writer Marjory Stoneman Douglas popularized the term \"River of Grass\" to describe the sawgrass marshes, part of a complex system of interdependent ecosystems that include cypress swamps, the estuarine mangrove forests of the Ten Thousand Islands, tropical hardwood hammocks, pine rockland, and the marine environment of Florida Bay.\nHuman habitation in the southern portion of the Florida peninsula dates to 15,000 years ago. Before European colonization, the region was dominated by the native Calusa and Tequesta tribes. With Spanish colonization, both tribes declined gradually during the following two centuries. The Seminole formed from mostly Creek people who had been warring to the North; they assimilated other peoples and created a new culture. After being forced from northern Florida into the Everglades during the Seminole Wars of the early 19th century, they were able to resist removal by the United States Army. They adapted to the region.\nMigrants to the region who wanted to develop plantations first proposed draining the Everglades in 1848, but no work of this type was attempted until 1882. Canals were constructed throughout the first half of the 20th century, and spurred the South Florida economy, prompting land development. In 1947, Congress formed the Central and Southern Florida Flood Control Project, which built 1,400 miles  of canals, levees, and water control devices. The Miami metropolitan area grew substantially at this time and Everglades water was diverted to cities. Portions of the Everglades were transformed into farmland, where the primary crop was sugarcane. Approximately 50 percent of the original Everglades has been developed as agricultural or urban areas.\nFollowing this period of rapid development and environmental degradation, the ecosystem began to receive notable attention from conservation groups in the 1970s. Internationally, UNESCO and the Ramsar Convention designated the Everglades a Wetland Area of Global Importance. The construction of a large airport 6 miles  north of Everglades National Park was blocked when an environmental study found that it would severely damage the South Florida ecosystem. With heightened awareness and appreciation of the region, restoration began in the 1980s with the removal of a canal that had straightened the Kissimmee River. However, development and sustainability concerns have remained pertinent in the region. The deterioration of the Everglades, including poor water quality in Lake Okeechobee, was linked to the diminishing quality of life in South Florida's urban areas. In 2000 the Comprehensive Everglades Restoration Plan was approved by congress to combat these problems. To date, it is the most expensive and comprehensive environmental restoration attempt in history, but its implementation has faced political complications.\n^ U.S. Geological Survey . \"Florida Everglades\". Circular 1182. U.S. Geological Survey. Retrieved 2008-03-14.", "title": "Everglades"}