{"summary": "An expert is an individual recognized as a reliable source of knowledge or skill in a particular field.", "full_text": "An expert  is someone widely recognized as a reliable source of technique or skill whose faculty for judging or deciding rightly, justly, or wisely is accorded authority and status by peers or the public in a specific well-distinguished domain. An expert, more generally, is a person with extensive knowledge or ability based on research, experience, or occupation and in a particular area of study. Experts are called in for advice on their respective subject, but they do not always agree on the particulars of a field of study. An expert can be believed, by virtue of credential, training, education, profession, publication or experience, to have special knowledge of a subject beyond that of the average person, sufficient that others may officially  rely upon the individual's opinion. Historically, an expert was referred to as a sage . The individual was usually a profound thinker distinguished for wisdom and sound judgment.\nExperts have a prolonged or intense experience through practice and education in a particular field. In specific fields, the definition of expert is well established by consensus and therefore it is not always necessary for individuals to have a professional or academic qualification for them to be accepted as an expert. In this respect, a shepherd with 50 years of experience tending flocks would be widely recognized as having complete expertise in the use and training of sheep dogs and the care of sheep. Another example from computer science is that an expert system may be taught by a human and thereafter considered an expert, often outperforming human beings at particular tasks. In law, an expert witness must be recognized by argument and authority.\nResearch in this area attempts to understand the relation between expert knowledge and exceptional performance in terms of cognitive structures and processes. The fundamental aim of this research is to describe what it is that experts know and how they use their knowledge to achieve performance that most people assume requires extreme or extraordinary ability. Studies have investigated the factors that enable experts to be fast and accurate.", "title": "Expert"}