{"summary": "The Federal Republic of Germany, also called Germany , is a country in Central Europe.", "full_text": "During the later stages of World War II and the post-war period German citizens and people of German ancestry were expelled from various Eastern European countries and sent to Germany and Austria. After 1950, some emigrated to the United States, Australia, and other countries from there. The areas of expulsions included Germans who lived in the former eastern territories of Germany which were annexed by Poland and the Soviet Union after the war, as well as Germans in areas occupied by Nazi Germany within the prewar borders of Poland, Czechoslovakia, Hungary, Romania, Yugoslavia and the Baltic States\nBy 1950, a total of approximately 12 million Germans had fled or been expelled from east-central Europe into Allied-occupied Germany and Austria. Some sources put the total at 14 million, including migrants to Germany after 1950 and the children born to expelled parents. The largest numbers came from territories ceded to Poland and the Soviet Union , and from Czechoslovakia . During the Cold War, the West German government also counted as expellees 1 million foreign colonists settled in territories conquered by Nazi Germany.\nDuring the war the long-term goal of Nazi Germany's Generalplan Ost was to exterminate between 45-70 million \"non-Germanizable\" people in Poland, Czechoslovakia and the western parts of the Soviet Union. The post-war expulsions of the Germans were part of the geopolitical and ethnic reconfiguration of postwar Europe that attempted to create ethnically homogeneous nations. Between 1944 and 1948 about 31 million people, including ethnic Germans, were permanently or temporarily moved from Central and Eastern Europe.\nThe death toll attributable to the flight and expulsions is disputed, with estimates ranging from 500,000, up to a West German demographic estimate from the 1950s of over 2.0 million. More recent estimates by some historians put the total at 500-600,000 attested deaths; they maintain that the West German government figures lack adequate support and that during the Cold war the higher figures were used for political propaganda. The German Historical Museum puts the figure at 600,000 : they maintain that the figure of 2 million deaths in the previous government studies cannot be supported. The current official position of the German government is that the death toll resulting from expulsions ranged from 2 to 2.5 million civilians.\nThe displacements occurred in three overlapping phases, the first of which was the spontaneous flight and evacuation of ethnic Germans in the face of the advancing Red Army, from mid-1944 to early 1945. The second phase was the disorganised expulsion of ethnic Germans immediately following the Wehrmacht's defeat. The third phase was a more organised expulsion following the Allied leaders' Potsdam Agreement, which redefined the Central European borders and approved orderly and humane expulsions of ethnic Germans from Poland, Czechoslovakia and Hungary. Many German civilians were sent to internment and labour camps. The major expulsions were complete in 1950. Estimates for the total number of people of German ancestry still living in Central and Eastern Europe in 1950 range from 700,000 to 2.7 million.", "title": "Expulsion of Germans after World War II"}