{"summary": "A risk factor in medicine is something that causes, or helps to cause, a medical condition.", "full_text": "In a variety of contexts, exogeny or exogeneity  is the fact of an action or object originating externally. It contrasts with endogeny or endogeneity, the fact of being influenced within a system.\nIn an economic model, an exogenous change is one that comes from outside the model and is unexplained by the model. For example, in the simple supply and demand model, a change in consumer tastes or preferences is unexplained by the model and also leads to endogenous changes in demand that lead to changes in the equilibrium price. Similarly, a change in the consumer's income is given outside the model but affects demand. Put another way, an exogenous change involves an alteration of a variable that is autonomous, i.e., unaffected by the workings of the model.\nIn linear regression, an exogenous variable is independent of the random error term in the linear model.\nIn biology, an exogenous contrast agent in medical imaging for example, is a liquid injected into the patient intravenously that enhances visibility of a pathology, such as a tumor. An exogenous factor is any material that is present and active in an individual organism or living cell but that originated outside that organism, as opposed to an endogenous factor.\nExogenous factors in medicine include both pathogens and therapeutics.\nDNA introduced to cells via transfection or viral infection  is an exogenous factor.\nCarcinogens are exogenous factors.\n\nIn geography, exogenous processes all take place outside the Earth and all the other planets. Weathering, erosion, transportation and sedimentation are the main exogenous processes.\nIn attentional psychology, exogenous stimuli are external stimuli without conscious intention. An example of this is attention drawn to a flashing light in the periphery of vision.\nIn ludology, the study of games, an exogenous item is anything outside the game itself. Therefore, an item in a massively multiplayer online game would have exogenous value if people were buying it with real world money rather than in-game currency .\nIn materials science, an exogenous property of a substance is derived from outside or external influences, such as a nano-doped material.\nIn philosophy, the origins of existence of self, or the identity of self, emanating from, or sustaining, outside of the natural or influenced realm, is exogenous.", "title": "Factor (medicine)"}