{"summary": "A family name is a name shared by people in the same family.", "full_text": "A family name  is typically a part of a person's personal name which, according to law or custom, is passed or given to children from one or both of their parents' family names. The use of family names is common in most cultures around the world, with each culture having its own rules as to how these names are formed, passed and used. But the practice is not universal, with some cultures not using family names . Also, in most Slavic countries and in Greece, for example, there are different family name forms for male and female members of the family. Issues of family name arise especially on the passing of a name to a new-born child, on the adoption of a common family name on marriage, on renouncing of a family name and on changing of a family name.\nMost countries have laws requiring its citizens and those resident within its jurisdiction to have a family name. Traditionally in many European countries for the past few hundred years, it was the custom or law that a woman would on marriage use the surname of her husband and that children of a man would have the father's surname. If a child's paternity was not known, or if the putative father denied paternity, the new-born child would have the surname of the mother. That is still the custom and law in many countries. The surname for children of married parents is usually inherited from the father. In recent years there has been a trend towards equality of treatment in relation to family names with women not being automatically required or expected, some places even forbidden, to take the husband's surname on marriage, and children not automatically being given the father's surname. In this article, family name and surname both mean the patrilineal  surname, handed down from or inherited from the father's line or patriline, unless explicitly stated otherwise. Thus, the term \"maternal surname\" means the patrilineal surname which one's mother inherited from either or both of her parents. For a discussion of matrilineal  surnames, passing from mothers to daughters, see matrilineal surname.", "title": "Family name"}