{"summary": "Live 8 was a rock concert organized by activist Bob Geldof.", "full_text": "Farm Aid started as a benefit concert held September 22, 1985, in Champaign, Illinois, to raise money for family farmers in the United States. The concert was organized by Willie Nelson, John Mellencamp and Neil Young, spurred on by Bob Dylan's comments at Live Aid earlier in that year that he hoped some of the money would help American farmers in danger of losing their farms through mortgage debt.\nThe first concert was at University of Illinois' Memorial Stadium in Champaign on September 22 before a crowd of 80,000 people. Performers included Bob Dylan, Billy Joel, B.B. King, Roy Orbison, among others, and raised over $9 million for America's family farmers.\nNelson and Mellencamp then brought family farmers before Congress to testify about the state of family farming in America. Congress subsequently passed the Agricultural Credit Act of 1987 to help save family farms from foreclosure. Today, Farm Aid is an organization that works to increase awareness of the importance of family farms, and puts on an annual concert of country, blues and rock music with a variety of stars. The board of directors includes Nelson, Mellencamp, Young, and Dave Matthews. Young's speeches about the environment are a highlight of the annual shows. After the initial concert, the organization established emergency hotlines for farmers and farm associations. Farm Aid holds a farm disaster fund for farmers who lost their belongings and crops through natural disasters, such as the victims of Hurricane Katrina and the 2011 tornadoes. The funds raised are used to pay the farmer's expenses and provide food, legal and financial help, and psychological assistance.\nThe 2005 concert, marking the 20th anniversary of Farm Aid, took place at the Tweeter Center in Tinley Park, Illinois, with events in downtown Chicago as well. The 2007 Concert took place at Randall's Island in New York City  and was recorded in High Definition to be broadcast on HDNet as a 2 Hour Special highlighting many of the performances from the Allman Brothers and Counting Crows to John Mellencamp and Willie Nelson.", "title": "Farm Aid"}