{"summary": "The Federal Bureau of Investigation  is an agency of the United States Government.", "full_text": "The Federal Bureau of Investigation  is the domestic intelligence and security service of the United States, which simultaneously serves as the nation's prime Federal law enforcement organization. Operating under the jurisdiction of the U.S. Department of Justice, FBI is concurrently a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counterterrorism, counterintelligence, and criminal investigative organization, FBI has jurisdiction over violations of more than 200 categories of federal crimes.\nAlthough many of FBI's functions are unique, its activities in support of national security are comparable to that of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency , which has no law enforcement authority and is focused on intelligence collection overseas, FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in lesser cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.\nDespite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache  offices and 15 sub-offices in U.S. embassies and consulates across the globe. These overseas offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries. It is of note that the FBI can and does at times carry out secret activities overseas, just as the CIA has a limited domestic function; these activities generally require coordination across government agencies.\nFBI was established in 1908 as the Bureau of Investigation . Its name was changed to the Federal Bureau of Investigation  in 1935. The FBI headquarters is the J. Edgar Hoover Building, located in Washington, D.C.\n\n", "title": "Federal Bureau of Investigation"}