{"summary": "In physics, a field means that a physical quantity is assigned to every point in space .", "full_text": "In physics, a field is a physical quantity that has a value for each point in space and time. For example, on a weather map, the surface wind velocity is described by assigning a vector to each point on a map. Each vector represents the speed and direction of the movement of air at that point. As another example, an electric field can be thought of as a \"condition in space\" emanating from an electric charge and extending throughout the whole of space. When a test electric charge is placed in this electric field, the particle accelerates due to a force. Physicists have found the notion of a field to be of such practical utility for the analysis of forces that they have come to think of a force as due to a field.\nIn the modern framework of the quantum theory of fields, even without referring to a test particle, a field occupies space, contains energy, and its presence eliminates a true vacuum. This led physicists to consider electromagnetic fields to be a physical entity, making the field concept a supporting paradigm of the edifice of modern physics. \"The fact that the electromagnetic field can possess momentum and energy makes it very real... a particle makes a field, and a field acts on another particle, and the field has such familiar properties as energy content and momentum, just as particles can have\". In practice, the strength of most fields has been found to diminish with distance to the point of being undetectable. For instance the strength of many relevant classical fields, such as the gravitational field in Newton's theory of gravity or the electrostatic field in classical electromagnetism, is inversely proportional to the square of the distance from the source . One consequence is that the Earth's gravitational field quickly becomes undetectable on cosmic scales.\nA field can be classified as a scalar field, a vector field, a spinor field or a tensor field according to whether the represented physical quantity is a scalar, a vector, a spinor or a tensor, respectively. A field has a unique tensorial character in every point where it is defined: i.e. a field cannot be a scalar field somewhere and a vector field somewhere else. For example, the Newtonian gravitational field is a vector field: specifying its value at a point in spacetime requires three numbers, the components of the gravitational field vector at that point. Moreover, within each category , a field can be either a classical field or a quantum field, depending on whether it is characterized by numbers or quantum operators respectively. In fact in this theory an equivalent representation of field is a field particle, namely a boson.", "title": "Field (physics)"}