{"summary": "Fish  are vertebrates which live in water and respire  with gills.", "full_text": "A fish is any member of a paraphyletic group of organisms that consist of all gill-bearing aquatic craniate animals that lack limbs with digits. Included in this definition are the living hagfish, lampreys, and cartilaginous and bony fish, as well as various extinct related groups. Most fish are ectothermic , allowing their body temperatures to vary as ambient temperatures change, though some of the large active swimmers like white shark and tuna can hold a higher core temperature. Fish are abundant in most bodies of water. They can be found in nearly all aquatic environments, from high mountain streams  to the abyssal and even hadal depths of the deepest oceans . With 33,100 described species, fish exhibit greater species diversity than any other group of vertebrates.\nFish are an important resource for humans worldwide, especially as food. Commercial and subsistence fishers hunt fish in wild fisheries  or farm them in ponds or in cages in the ocean . They are also caught by recreational fishers, kept as pets, raised by fishkeepers, and exhibited in public aquaria. Fish have had a role in culture through the ages, serving as deities, religious symbols, and as the subjects of art, books and movies.\nBecause the term \"fish\" is defined negatively, and excludes the tetrapods  which descend from within the same ancestry, it is paraphyletic, and is not considered a proper grouping in systematic biology. The traditional term pisces  is considered a typological, but not a phylogenetic classification.\nThe earliest organisms that can be classified as fish were soft-bodied chordates that first appeared during the Cambrian period. Although they lacked a true spine, they possessed notochords which allowed them to be more agile than their invertebrate counterparts. Fish would continue to evolve through the Paleozoic era, diversifying into a wide variety of forms. Many fish of the Paleozoic developed external armor that protected them from predators. The first fish with jaws appeared in the Silurian period, after which many  became formidable marine predators rather than just the prey of arthropods.", "title": "Fish"}