{"summary": "Pentateuch means the first five books of the Bible.", "full_text": "Torah , or the Pentateuch , is the central reference of the religious Judaic tradition. It has a range of meanings. It can most specifically mean the first five books of the twenty-four books of the Tanakh, and it usually includes the rabbinic commentaries. The term Torah means instruction and offers a way of life for those who follow it; it can mean the continued narrative from Genesis to the end of the Tanakh, and it can even mean the totality of Jewish teaching, culture and practice. Common to all these meanings, Torah consists of the foundational narrative of the Jews: their call into being by God, their trials and tribulations, and their covenant with their God, which involves following a way of life embodied in a set of moral and religious obligations and civil laws .\nIn rabbinic literature the word \"Torah\" denotes both the five books, Torah Shebichtav , and an Oral Torah, Torah Shebe'al Peh . The Oral Torah consists of interpretations and amplifications which according to rabbinic tradition have been handed down from generation to generation and are now embodied in the Talmud and Midrash.\nAccording to rabbinic tradition, all of the teachings found in the Torah, both written and oral, were given by God through Moses, a prophet, some of them at Mount Sinai and others at the Tabernacle, and all the teachings were written down by Moses, which resulted in the Torah we have today. According to a Midrash, the Torah was created prior to the creation of the world, and was used as the blueprint for Creation. The majority of Biblical scholars believe that the written books were a product of the Babylonian exilic period  and that it was completed by the Persian period . However, it is worth noting that the 2004 discovery of fragments of the Hebrew Bible at Ketef Hinnom dating to the 7th century BCE, and thus to before the Babylonian captivity, suggests that at least some elements of the Torah were current before the Babylonian exile.\nTraditionally, the words of the Torah are written on a scroll by a sofer on parchment in Hebrew. A Torah portion is read publicly at least once every three days, in the halachically prescribed tune, in the presence of a congregation. Reading the Torah publicly is one of the bases for Jewish communal life.", "title": "Five Books of Moses"}