{"summary": "Flanders  is a region in the north of Belgium.", "full_text": "Flanders  today normally refers to the Dutch-speaking northern portion of Belgium. It is one of the communities, regions and language areas of Belgium. The demonym associated with Flanders is Fleming, while the corresponding adjective is Flemish. Flanders' capital is Brussels, although Flanders is competent only in Brussels' culturally related matters and shares this competence with Wallonia.\nHistorically, the name referred to the County of Flanders, which around 1000 CE stretched from the Strait of Dover to the Scheldt estuary. The only parts of historical Flanders that lay within modern-day Flanders are the provinces West Flanders and East Flanders. Nevertheless, during the 19th and 20th centuries it became increasingly commonplace to designate by \"Flanders\" the entire Dutch-speaking part of Belgium. In accordance to Belgium's state reforms  the area was made into two political entities: the \"Flemish Community\"  and the \"Flemish Region\" . These entities were merged, although geographically they do not coincide .\nModern Flanders has figured prominently in European history. During the late Middle Ages, cities such as Ghent, Bruges, Antwerp and Brussels made it one of the richest and most urbanized parts of Europe, weaving the wool of neighbouring lands into cloth for both domestic use and export. As a consequence, a very sophisticated culture developed, with impressive achievements in the arts and architecture, rivaling those of northern Italy. In the 19th century Flanders was barely industrialised, unlike French-speaking Wallonia. In the second half of the 20th century, however, Flanders' economy modernised rapidly, and today Flanders is more wealthy and prosperous than its southern counterpart.\nGeographically, Flanders is generally flat, and has a small section of coast on the North Sea. Flanders is agriculturally fertile and densely populated, with a population density of almost 500 people per square kilometer . It borders France to the west, the Netherlands to the north and east, and Wallonia to the south. The Brussels Capital Region is enclaved within the Flemish Region. Flanders has exclaves of its own: Voeren in the east is clamped between Wallonia and the Netherlands and Baarle-Hertog in the north consists of 22 exclaves located in the Netherlands.\n^ \"Belgium\". U.S. Department of State. Retrieved 21 June 2015.", "title": "Flanders"}