{"summary": "Wildfire is a general term which includes forest fires, grassland fires, bushfires, brush fires and any other vegetation fire in countryside areas.", "full_text": "A wildfire or wildland fire is an uncontrolled fire in an area of combustible vegetation that occurs in the countryside area. Other names such as brush fire, bush fire, forest fire, desert fire, grass fire, hill fire, peat fire, vegetation fire, and veldfire may be used to describe the same phenomenon depending on the type of vegetation being burned, and the regional variant of English being used. A wildfire differs from other fires by its extensive size, the speed at which it can spread out from its original source, its potential to change direction unexpectedly, and its ability to jump gaps such as roads, rivers and fire breaks. Wildfires are characterized in terms of the cause of ignition, their physical properties such as speed of propagation, the combustible material present, and the effect of weather on the fire.\nBushfires in Australia are a common occurrence; because of the generally hot and dry climate, they pose a great risk to life and infrastructure during all times of the year, though mostly throughout the hotter months of summer and spring. In the United States, there are typically between 60,000 and 80,000 wildfires that occur each year, burning 3 million to 10 million acres  of land depending on the year. Fossil records and human history contain accounts of wildfires, as wildfires can occur in periodic intervals. Wildfires can cause extensive damage, both to property and human life, but they also have various beneficial effects on wilderness areas. Some plant species depend on the effects of fire for growth and reproduction, although large wildfires may also have negative ecological effects.\nStrategies of wildfire prevention, detection, and suppression have varied over the years, and international wildfire management experts encourage further development of technology and research. One of the more controversial techniques is controlled burning: permitting or even igniting smaller fires to minimize the amount of flammable material available for a potential wildfire. While some wildfires burn in remote forested regions, they can cause extensive destruction of homes and other property located in the wildland-urban interface: a zone of transition between developed areas and undeveloped wilderness.\nThe name wildfire was once a synonym for Greek fire but now refers to any large or destructive conflagration. Wildfires differ from other fires in that they take place outdoors in areas of grassland, woodlands, bushland, scrubland, peatland, and other wooded areas that act as a source of fuel, or combustible material. Buildings may become involved if a wildfire spreads to adjacent communities. While the causes of wildfires vary and the outcomes are always unique, all wildfires can be characterized in terms of their physical properties, their fuel type, and the effect that weather has on the fire. Wildfire behaviour and severity result from the combination of factors such as available fuels, physical setting, and weather. While wildfires can be large, uncontrolled disasters that burn through 0.4 to 400 square kilometres  or more, they can also be as small as 0.001 square kilometres  or less. Although smaller events may be included in wildfire modeling, most do not earn press attention. This can be problematic because public fire policies, which relate to fires of all sizes, are influenced more by the way the media portrays catastrophic wildfires than by small fires.", "title": "Forest fire"}