{"summary": "Fossil fuels are fuels that come from very old life forms that decomposed over a long period of time.", "full_text": "Fossil fuels are fuels formed by natural processes such as anaerobic decomposition of buried dead organisms. The age of the organisms and their resulting fossil fuels is typically millions of years, and sometimes exceeds 650 million years. Fossil fuels contain high percentages of carbon and include coal, petroleum and natural gas. Other more commonly used derivatives of fossil fuels include kerosene and propane. They range from volatile materials with low carbon:hydrogen ratios like methane, to liquid petroleum to nonvolatile materials composed of almost pure carbon, like anthracite coal. Methane can be found in hydrocarbon fields, alone, associated with oil, or in the form of methane clathrates. The theory that fossil fuels formed from the fossilized remains of dead plants by exposure to heat and pressure in the Earth's crust over millions of years  was first introduced by Georg Agricola in 1556 and later by Mikhail Lomonosov in the 18th century.\nThe Energy Information Administration estimates that in 2007 the primary sources of energy consisted of petroleum 36.0%, coal 27.4%, natural gas 23.0%, amounting to an 86.4% share for fossil fuels in primary energy consumption in the world. Non-fossil sources in 2006 included hydroelectric 6.3%, nuclear 8.5%, and others  amounting to 0.9%. World energy consumption was growing about 2.3% per year.\nAlthough fossil fuels are continually being formed via natural processes, they are generally considered to be non-renewable resources because they take millions of years to form and the known viable reserves are being depleted much faster than new ones are being made.\nThe use of fossil fuels raises serious environmental concerns. The burning of fossil fuels produces around 21.3 billion tonnes  of carbon dioxide  per year, but it is estimated that natural processes can only absorb about half of that amount, so there is a net increase of 10.65 billion tonnes of atmospheric carbon dioxide per year . Carbon dioxide is one of the greenhouse gases that enhances radiative forcing and contributes to global warming, causing the average surface temperature of the Earth to rise in response, which the vast majority of climate scientists agree will cause major adverse effects. A global movement towards the generation of renewable energy is therefore under way to help reduce global greenhouse gas emissions.", "title": "Fossil fuel"}