{"summary": "A Fountain is an arrangement, usually made by man; in it, the water from a source is captured in some way.", "full_text": "A fountain  is a piece of architecture which pours water into a basin or jets it into the air to supply drinking water and/or for a decorative or dramatic effect.\nFountains were originally purely functional, connected to springs or aqueducts and used to provide drinking water and water for bathing and washing to the residents of cities, towns and villages. Until the late 19th century most fountains operated by gravity, and needed a source of water higher than the fountain, such as a reservoir or aqueduct, to make the water flow or jet into the air.\nIn addition to providing drinking water, fountains were used for decoration and to celebrate their builders. Roman fountains were decorated with bronze or stone masks of animals or heroes. In the Middle Ages, Moorish and Muslim garden designers used fountains to create miniature versions of the gardens of paradise. King Louis XIV of France used fountains in the Gardens of Versailles to illustrate his power over nature. The baroque decorative fountains of Rome in the 17th and 18th centuries marked the arrival point of restored Roman aqueducts and glorified the Popes who built them.\nBy the end of the 19th century, as indoor plumbing became the main source of drinking water, urban fountains became purely decorative. Mechanical pumps replaced gravity and allowed fountains to recycle water and to force it high into the air. The Jet d'Eau in Lake Geneva, built in 1951, shoots water 140 metres  in the air. The highest such fountain in the world is King Fahd's Fountain in Jeddah, Saudi Arabia, which spouts water 260 metres  above the Red Sea.\nFountains are used today to decorate city parks and squares; to honor individuals or events; for recreation and for entertainment. A Splash pad or spray pool allows city residents to enter, get wet and cool off in summer. The musical fountain combines moving jets of water, colored lights and recorded music, controlled by a computer, for dramatic effects. Drinking fountains provide clean drinking water in public buildings, parks and public spaces.", "title": "Fountain"}