{"summary": "Franz Boas  was a German-born American anthropologist.", "full_text": "Franz Uri Boas  was a German-American anthropologist and a pioneer of modern anthropology who has been called the \"Father of American Anthropology\".\nStudying in Germany, Boas was awarded a doctorate in 1881 in physics while also studying geography. He then participated in a geographical expedition to northern Canada where he became fascinated with the culture and language of the Baffin Island Inuit. He went on to do field work with the indigenous cultures and languages of the Pacific Northwest. In 1887 he emigrated to the United States where he first worked as a museum curator at the Smithsonian, and in 1899 became professor of anthropology at Columbia University where he remained for the rest of his career. Through his students, many of whom went on to found anthropology departments and research programmes inspired by their mentor, Boas profoundly influenced the development of American anthropology. Among his most significant students were Manuel Gamio, A. L. Kroeber, Ruth Benedict, Edward Sapir, Margaret Mead, and Zora Neale Hurston.\nBoas was one of the most prominent opponents of the then popular ideologies of scientific racism, the idea that race is a biological concept and that human behavior is best understood through the typology of biological characteristics. In a series of groundbreaking studies of skeletal anatomy he showed that cranial shape and size was highly malleable depending on environmental factors such as health and nutrition, in contrast to the claims by racial anthropologists of the day that held head shape to be a stable racial trait. Boas also worked to demonstrate that differences in human behavior are not primarily determined by innate biological dispositions, but are largely the result of cultural differences acquired through social learning. In this way, Boas introduced culture as the primary concept for describing differences in behavior between human groups, and as the central analytical concept of anthropology.\nAmong Boas's main contributions to anthropological thought was his rejection of the then popular evolutionary approaches to the study of culture, which saw all societies progressing through a set of hierarchic technological and cultural stages, with Western-European culture at the summit. Boas argued that culture developed historically through the interactions of groups of people and the diffusion of ideas, and that consequently there was no process towards continuously \"higher\" cultural forms. This insight led Boas to reject the \"stage\"-based organization of ethnological museums, instead preferring to order items on display based on the affinity and proximity of the cultural groups in question. Boas also introduced the ideology of cultural relativism which holds that cultures cannot be objectively ranked as higher or lower, or better or more correct, but that all humans see the world through the lens of their own culture, and judge it according to their own culturally acquired norms. For Boas the object of anthropology was to understand the way in which culture conditioned people to understand and interact with the world in different ways, and to do this it was necessary to gain an understanding of the language and cultural practices of the people studied. By uniting the disciplines of archaeology, the study of material culture and history, and physical anthropology, the study of variation in human anatomy, with ethnology, the study of cultural variation of customs, and descriptive linguistics, the study of unwritten indigenous languages, Boas created the four field subdivision of anthropology which became prominent in American anthropology in the 20th century.", "title": "Franz Boas"}