{"summary": "The state of Texas is divided into 254 counties.", "full_text": "The Fredonian Rebellion  was the first attempt by Anglo settlers in Texas to secede from Mexico. The settlers, led by Empresario Haden Edwards, declared independence from Mexican Texas and created the Republic of Fredonia near Nacogdoches. The short-lived republic encompassed the land the Mexican government had granted to Edwards in 1825 and included areas that had been previously settled. Edwards's actions soon alienated these established residents, and the increasing hostilities between them and settlers recruited by Edwards led the Mexican government to revoke Edwards's contract.\nIn late December 1826, a group of Edwards's supporters took control of the region by arresting and removing from office several municipality officials affiliated with the established residents. Supporters declared their independence from Mexico. Although the nearby Cherokee tribe initially signed a treaty to support the new republic, overtures from Mexican authorities and respected Empresario Stephen F. Austin convinced tribal leaders to repudiate the rebellion. On January 31, 1827, a force of over 100 Mexican soldiers and 250 militiamen from Austin's colony marched into Nacogdoches to restore order. Many of the participants, including Edwards, fled to the United States. A local merchant was arrested and sentenced to death, but later paroled.\nThe rebellion led Mexican President Guadalupe Victoria to increase the military presence in the area. As a result, several hostile tribes in the area halted their raids on settlements and agreed to a peace treaty. The Comanche abided by this treaty for many years. Fearing that through the rebellion the United States hoped to gain control of Texas, the Mexican government severely curtailed immigration to the region from the US. This new immigration law was bitterly opposed by colonists and caused increasing dissatisfaction with Mexican rule. Some historians consider the Fredonian Rebellion to be the beginning of the Texas Revolution. In the words of one historian, the rebellion was \"premature, but it sparked the powder for later success.\"", "title": "Fredonian Rebellion"}