{"summary": "1995  was a common year starting on Sunday of the Gregorian calendar.", "full_text": "Frederick John \"Fred\" Perry  was a championship-winning English tennis and table tennis player and former World No. 1 who won 10 Majors including eight Grand Slams and two Pro Slams single titles, as well as six Major doubles titles. Perry won three consecutive Wimbledon Championships from 1934 to 1936 and was World Amateur number one tennis player during those three years. Prior to Andy Murray in 2013, Perry was the last British player to win the men's Wimbledon championship, in 1936 and the last British player to win a men's singles Grand Slam title until Andy Murray won the 2012 US Open.\nPerry was the first player to win a \"Career Grand Slam\" winning all four singles titles at the age of 26 which he completed at the 1935 French Championships and remains the only British player ever to achieve this. Although Perry began his tennis career aged 18, he was also a Table Tennis World Champion in 1929.\nIn 1933, Perry helped lead the Great Britain team to victory over France in the Davis Cup; the team's first success since 1912, followed by wins over the United States in 1934, 1935, and a fourth consecutive title with victory over Australia in 1936. But due to his disillusionment with the class-conscious nature of the Lawn Tennis Club of Great Britain, the working-class Perry turned professional at the end of the 1936 season and moved to the United States where he became a naturalised US citizen in 1938. In 1942, he was drafted into the US Air Force during the Second World War.\nDespite his unprecedented contribution to British tennis, Perry was not accorded full recognition by tennis authorities until later in life because between 1927 to 1967, the International Lawn Tennis Federation, ignored amateur champions that later turned professional. In 1984, a modest statue of Perry was unveiled at Wimbledon, and in the same year Perry became the only tennis player listed in a survey of 2,000 Britons to find the \"Best of the Best\" British sportsmen of the 20th century.", "title": "Fred Perry"}