{"summary": "Freedom of speech is the right to state one's opinions and ideas without being stopped or punished.", "full_text": "Freedom of speech is the right to communicate one's opinions and ideas without fear of government retaliation or censorship. The term freedom of expression is sometimes used synonymously, but includes any act of seeking, receiving and imparting information or ideas, regardless of the medium used.\nGovernments restrict speech with varying limitations. Common limitations on speech relate to libel, slander, obscenity, pornography, sedition, incitement, fighting words, classified information, copyright violation, trade secrets, non-disclosure agreements, right to privacy, right to be forgotten, public security, public order, public nuisance, campaign finance reform and oppression. Whether these limitations can be justified under the harm principle depends upon whether influencing a third party's opinions or actions adversely to the second party constitutes such harm or not. Governmental and other compulsory organizations often have policies restricting the freedom of speech for political reasons, for example, speech codes at state schools.\nThe term \"offense principle\" is also used to expand the range of free speech limitations to prohibit forms of expression where they are considered offensive to society, special interest groups or individuals. For example, freedom of speech is limited in many jurisdictions to widely differing degrees by religious legal systems, religious offense or incitement to ethnic or racial hatred laws.\nThe right to freedom of expression is recognized as a human right under article 19 of the Universal Declaration of Human Rights and recognized in international human rights law in the International Covenant on Civil and Political Rights . Article 19 of the ICCPR states that \"everyone shall have the right to hold opinions without interference\" and \"everyone shall have the right to freedom of expression; this right shall include freedom to seek, receive and impart information and ideas of all kinds, regardless of frontiers, either orally, in writing or in print, in the form of art, or through any other media of his choice\". Article 19 additionally states that the exercise of these rights carries \"special duties and responsibilities\" and may \"therefore be subject to certain restrictions\" when necessary \"or respect of the rights or reputation of others\" or \"or the protection of national security or of public order , or of public health or morals\".\n^ van Mill, David. \"Freedom of Speech\". Stanford Encyclopedia of Philosophy. Retrieved 10 April 2014. \n^ \"Article 19\". International Covenant on Civil and Political Rights . 23 March 1976. Retrieved 13 March 2014. \n^ Ambika Kumar . \"Using Courts to Enforce the Free Speech Provisions of the International Covenant on Civil and Political Rights\". Chicago Journal of International Law 7 .  ", "title": "Free speech"}