{"summary": "For the automobile, see Ford Galaxy.", "full_text": "A galaxy is a gravitationally bound system of stars, stellar remnants, interstellar gas, dust, and dark matter. The word galaxy is derived from the Greek galaxias , literally \"milky\", a reference to the Milky Way. Galaxies range in size from dwarfs with just a few thousand  stars to giants with one hundred trillion  stars, each orbiting their galaxy's own center of mass. Galaxies are categorized according to their visual morphology, including elliptical, spiral, and irregular. Many galaxies are thought to have black holes at their active centers. The Milky Way's central black hole, known as Sagittarius A*, has a mass four million times greater than our own Sun. As of July 2015, EGSY8p7 is the oldest and most distant galaxy with a light travel distance of 13.2 billion light-years from Earth, and observed as it existed 570 million years after the Big Bang. Previously, as of May 2015, EGS-zs8-1 was the most distant known galaxy, estimated to have a light travel distance of 13.1 billion light-years away and to have 15% of the mass of the Milky Way.\nApproximately 170 billion  to 200 billion  galaxies exist in the observable universe. Most of the galaxies are 1,000 to 100,000 parsecs in diameter and usually separated by distances on the order of millions of parsecs . The space between galaxies is filled with a tenuous gas with an average density less than one atom per cubic meter. The majority of galaxies are gravitationally organized into associations known as galaxy groups, clusters, and superclusters. At the largest scale, these associations are generally arranged into sheets and filaments that are surrounded by immense voids.\n^ \n^ \n^ \n^ \n^ \n^ \n^ Oesch, P.A. et al. . \"A Spectroscopic Redshift Measurement for a Luminous Lyman Break Galaxy at z=7.730 using Keck/MOSFIRE\". ArXiv. arXiv:1502.05399. Bibcode:2015arXiv150205399O. Retrieved May 6, 2015.  CS1 maint: Explicit use of et al. \n^ Staff . \"Astronomers unveil the farthest galaxy\". Phys.org. Retrieved May 6, 2015. \n^ Overbye, Dennis . \"Astronomers Measure Distance to Farthest Galaxy Yet\". New York Times. Retrieved May 6, 2015. \n^ Borenstein, Seth . \"Astronomers find farthest galaxy: 13.1 billion light-years\". AP News. Retrieved May 6, 2015. \n^ \n^", "title": "Galaxies"}