{"summary": "Troyal Garth Brooks  is an American country music singer and songwriter.", "full_text": "Troyal Garth Brooks , best known as Garth Brooks, is an American country music singer-songwriter. His eponymous first album was released in 1989 and peaked at number 2 in the US country album chart while climbing to number 13 on the Billboard 200 album chart. Brooks' integration of rock elements into his recordings and live performances earned him immense popularity. This progressive approach allowed him to dominate the country single and album charts while crossing over into the mainstream pop arena.\nBrooks broke records for both sales and concert attendance throughout the 1990s. As of 2013, his recordings continue to sell well and, according to Nielsen Soundscan, his albums sales up to May 2013 are 68,630,000, which makes him the best-selling albums artist in the United States in the SoundScan era , a title held since 1991, well over 5 million ahead of his nearest rival, the Beatles. According to RIAA he is the second best-selling solo albums artist in the United States of all time ahead of Elvis Presley  with 135 million units sold. Brooks is one of the world's best-selling artists of all time, having sold more than 150 million records.\nBrooks has released six albums that achieved diamond status in the United States, those being: Garth Brooks , No Fences , Ropin' the Wind , The Hits , Sevens  and Double Live . Since 1989, Brooks has released 20 records in all, which include; 10 studio albums, 1 live album, 3 compilation albums, 3 Christmas albums and 3 box sets, along with 77 singles. He won several important awards in his career, including 2 Grammy Awards, 17 American Music Awards  and the RIAA Award as Best selling solo albums artist of the Century in the United States.\nTroubled by conflicts between career and family, Brooks officially retired from recording and performing from 2001 until 2009. During this time, he sold millions of albums through an exclusive distribution deal with Walmart and sporadically released new singles. In 2005, Brooks started a partial comeback, and has since given several performances and released two compilation albums.\nOn October 15, 2009, Garth Brooks announced the end of his retirement. In December 2009, he began a five-year concert deal with the Encore Hotel and Casino on the Las Vegas Strip. Following the conclusion of his residency in Las Vegas, Brooks announced his signing with Sony Music Nashville in July 2014. In September 2014, he began his comeback world tour. His most recent album, Man Against Machine, was released on November 11, 2014 via his new online music store GhostTunes.\nBrooks was inducted into the Country Music Hall of Fame on October 21, 2012.", "title": "Garth Brooks"}