{"summary": "Same-sex marriage  is a term for a relationship in which two people of the same sex live together as a family in a governmentally, socially, or religiously recognized marriage.", "full_text": "Same-sex marriage, also known as gay marriage, is marriage between people of the same sex, either as a secular civil ceremony or in a religious setting.\nIn the late 20th century, religious rites of marriage without legal recognition became increasingly common. The first law providing for marriage of people of the same sex in modern times was enacted in 2001 in the Netherlands. As of 16 November 2015, fourteen countries  and certain sub-jurisdictions  allow same-sex couples to marry. A similar law in Finland is not yet in force. Polls show rising support for legally recognizing same-sex marriage in the Americas, Australia and most of Europe. However, as of 2015 South Africa is the only African country where same-sex marriage is recognized, and none of the Asian countries have recognized same-sex marriage.\n\nIntroduction of same-sex marriage laws has varied by jurisdiction, being variously accomplished through legislative change to marriage laws, a court ruling based on constitutional guarantees of equality, or by direct popular vote . The recognition of same-sex marriage is a political and social issue, and also a religious issue in many countries, and debates continue to arise over whether people in same-sex relationships should be allowed marriage or some similar status . Same-sex marriage can provide those in same-sex relationships who pay their taxes with government services and make financial demands on them comparable to those afforded to and required of those in opposite-sex marriages. Same-sex marriage also gives them legal protections such as inheritance and hospital visitation rights. Various faith communities around the world support allowing those of the same sex to marry, while many major religions oppose same-sex marriage. Opponents of same-sex marriages have argued that recognition of same-sex marriages would erode religious freedoms, undermine a right of children to be raised by their biological mother and father or erode the institution of marriage itself.\nSome analysts state that financial, psychological and physical well-being are enhanced by marriage, and that children of same-sex parents or carers benefit from being raised by two parents within a legally recognized union supported by society's institutions. Court documents filed by American scientific associations also state that singling out gay men and women as ineligible for marriage both stigmatizes and invites public discrimination against them. The American Anthropological Association avers that social science research does not support the view that either civilization or viable social orders depend upon not recognizing same-sex marriage.", "title": "Gay marriage"}