{"summary": "The George Washington University is a private, coeducational university in Washington, D.C..", "full_text": "The George Washington University  is a private, coeducational research university located in the Foggy Bottom neighborhood of Washington, D.C. with two other campuses including the Mount Vernon campus in the Foxhall neighborhood, as well as the Virginia Science & Technology campus in Loudoun County, Virginia. GW is the largest institution of higher education in the District of Columbia.\nGeorge Washington, the first president of the United States, had indicated to Congress through various letters, as well as his last will and testament, that he wanted to establish a university within the nation's capital. Washington left fifty shares of the Potowmack Company in his estate for a national university in the District of Columbia. However, due to the company's financial status, the university never received the shares. The university was chartered by an Act of Congress on February 9, 1821, as the Columbian College in the District of Columbia. In 1904, it changed its name to the George Washington University in honor of Washington.\nThe university has ten colleges and schools: the Columbian College of Arts and Sciences ; the School of Business, the Elliott School of International Affairs, the Milken Institute School of Public Health, the College of Professional Studies , the School of Engineering and Applied Science, the George Washington University School of Medicine & Health Sciences, the Law School, the School of Nursing, and the Graduate School of Education and Human Development.\nGW's Graduate School of Political Management is the only school of applied politics in the nation's capital. GW's professional schools and the Elliott School of International Affairs are consistently ranked highly in national and international college rankings lists.\nGeorge Washington is consistently ranked by The Princeton Review in the top \"Most Politically Active\" Schools. Some of the university's graduates have gone on to high positions within both the U.S. government and foreign governments. Notable alumni include Senate Majority Leader Harry Reid, former Secretary of State Colin Powell, and former First Lady Jacqueline Kennedy. The school colors are buff and blue, and the sports teams and current and former students in general are called the Colonials.", "title": "George Washington University"}