{"summary": "1991  was a common year starting on Tuesday of the Gregorian calendar.", "full_text": "Succession to the British throne is determined by descent, legitimacy, and religion. Under common law, the crown is inherited by an individual's children and by a childless individual's nearest collateral line. The Bill of Rights 1689 and the Act of Settlement 1701, both of them as amended in March 2015, restrict the succession to the legitimate Protestant descendants of Sophia, Electress of Hanover that are in \"communion with the Church of England\" . Protestant descendants of those excluded for being Catholics are eligible to succeed.\nQueen Elizabeth II is the present sovereign and her heir apparent is her eldest son, Charles, Prince of Wales. Second in line is Prince William, Duke of Cambridge, the Prince of Wales's eldest son. Third in line is Prince George of Cambridge, the son of the Duke of Cambridge, followed by his sister, Princess Charlotte of Cambridge in fourth place. Fifth in line is Prince Harry , the younger son of the Prince of Wales. The first four individuals in the line of succession who are twenty-one years or older, and the sovereign's consort, may be appointed Counsellors of State. Counsellors of State perform some of the sovereign's duties in the United Kingdom while he or she is out of the country or temporarily incapacitated. Otherwise, individuals in the line of succession need not have specific legal or official duties .\nThe United Kingdom is one of the 16 Commonwealth realms. Each of those countries has the same person as monarch and the same order of succession. In 2011, the prime ministers of the realms agreed unanimously to adopt a common approach to amending the rules on the succession to their respective Crowns so that absolute primogeniture would apply for persons born after the date of the agreement, instead of male-preference primogeniture, and the ban on marriages to Roman Catholics would be lifted. The ban on Catholics themselves was retained to ensure that the monarch would be in communion with the Church of England. After the necessary legislation had been enacted in accordance with each realm's constitution, the changes took effect on 26 March 2015.", "title": "George William Carnegie"}