{"summary": "Georgetown University is a Catholic university in Washington, D.C.", "full_text": "Georgetown University is a private research university in Washington, D.C. Founded in 1789, it is the oldest Catholic and Jesuit institution of higher education in the United States. Located in Washington's historic Georgetown neighborhood, the university's main campus is noted for Healy Hall, a National Historic Landmark. Georgetown's law school is located on Capitol Hill, and the university has auxiliary campuses in Italy, Turkey, and Qatar.\nGeorgetown's founding by John Carroll, America's first Catholic bishop, realized efforts dating from the settlement of the province of Maryland in 1634 to establish a local Roman Catholic college in the face of religious persecution. The university expanded after the American Civil War under the leadership of Patrick Francis Healy, who came to be known as Georgetown's \"second founder\" despite having been born a slave by law. Jesuits have participated in the university's administration since 1805, a heritage Georgetown celebrates, but the university has always been governed independently of the Society of Jesus and of church authorities.\nComprising 9 undergraduate and graduate schools, the university has about 7,000 undergraduate and over 10,000 post-graduate students from a wide variety of religious, ethnic, and geographic backgrounds, including 130 foreign countries. The university's most notable alumni are prominent in public life in the United States and abroad. Among them are former U.S. President Bill Clinton, U.S. Chief Justice Edward Douglass White, Supreme Court Associate Justice Antonin Scalia, dozens of U.S. governors and members of Congress, heads of state or government of more than a dozen countries, royalty and diplomats.\nCampus organizations include the country's largest student-run business and largest student-run financial institution. Georgetown's athletic teams, nicknamed the Hoyas, include a men's basketball team that has won a record-tying seven Big East championships, appeared in five Final Fours, and won a national championship in 1984.", "title": "Georgetown University"}