{"summary": "Geraldine Ferraro  was an American politician.", "full_text": "Geraldine Anne Ferraro  was an American attorney, a Democratic Party politician, and a member of the United States House of Representatives. She was the first female vice presidential candidate representing a major American political party.\nFerraro grew up in New York City and worked as a public school teacher before training as a lawyer. She joined the Queens County District Attorney's Office in 1974, heading the new Special Victims Bureau that dealt with sex crimes, child abuse, and domestic violence. In 1978 she was elected to the House, where she rose rapidly in the party hierarchy while focusing on legislation to bring equity for women in the areas of wages, pensions, and retirement plans. In 1984, former vice president and presidential candidate Walter Mondale, seen as an underdog, selected Ferraro to be his running mate in the upcoming election. Ferraro became the only Italian American to be a major-party national nominee in addition to being the first woman. The positive polling the Mondale-Ferraro ticket received when she joined soon faded, as damaging questions arose about her and her businessman husband's finances and wealth and her Congressional disclosure statements. In the general election, Mondale and Ferraro were defeated in a landslide by incumbent President Ronald Reagan and Vice President George H. W. Bush.\nFerraro ran campaigns for a seat in the United States Senate from New York in 1992 and 1998, both times starting as the front-runner for her party's nomination before losing in the primary election. She served as a United States Ambassador to the United Nations Commission on Human Rights from 1993 until 1996, in the presidential administration of Bill Clinton. She also continued her career as a journalist, author, and businesswoman, and served in the 2008 presidential campaign of Senator Hillary Rodham Clinton. Ferraro died on March 26, 2011, from multiple myeloma, 12 years after being diagnosed.", "title": "Geraldine Ferraro"}