{"summary": "Germanium is a chemical element.", "full_text": "Germanium is a chemical element with symbol Ge and atomic number 32. It is a lustrous, hard, grayish-white metalloid in the carbon group, chemically similar to its group neighbors tin and silicon. Purified germanium is a semiconductor, with an appearance most similar to elemental silicon. Like silicon, germanium naturally reacts and forms complexes with oxygen in nature. Unlike silicon, it is too reactive to be found naturally on Earth in the free  state.\nBecause very few minerals contain it in high concentration, germanium was discovered comparatively late in the history of chemistry. Germanium ranks near fiftieth in relative abundance of the elements in the Earth's crust. In 1869, Dmitri Mendeleev predicted its existence and some of its properties based on its position on his periodic table and called the element ekasilicon. Nearly two decades later, in 1886, Clemens Winkler found the new element along with silver and sulfur, in a rare mineral called argyrodite. Although the new element somewhat resembled arsenic and antimony in appearance, its combining ratios in the new element's compounds agreed with Mendeleev's predictions for a relative of silicon. Winkler named the element after his country, Germany. Today, germanium is mined primarily from sphalerite , though germanium is also recovered commercially from silver, lead, and copper ores.\nGermanium \"metal\"  is used as a semiconductor in transistors and various other electronic devices. Historically the first decade of semiconductor electronics was based entirely on germanium. Today, however, its production for use in semiconductor electronics is a small fraction  of that of ultra-high purity silicon, which has largely replaced it. Presently, germanium's major end uses are in fibre-optic systems, infrared optics and in solar cell applications. Germanium compounds are also used for polymerization catalysts and have most recently found use in the production of nanowires. This element forms a large number of organometallic compounds, such as tetraethylgermane, which are useful in organometallic chemistry.\nGermanium is not thought to be an essential element for any living organism. Some complexed organic germanium compounds are being investigated as possible pharmaceuticals, though none have yet proven successful. Similar to silicon and aluminum, natural germanium compounds tend to be insoluble in water, and thus have little oral toxicity. However, synthetic soluble germanium salts are nephrotoxic, and synthetic chemically reactive germanium compounds with halogens and hydrogen are irritants and toxins.\n^ Standard Atomic Weights 2013. Commission on Isotopic Abundances and Atomic Weights\n^ Magnetic susceptibility of the elements and inorganic compounds, in Handbook of Chemistry and Physics 81st edition, CRC press.\n^ a b c d \"Properties of Germanium\". Ioffe Institute.", "title": "Germanium"}