{"summary": "Giorgio Napolitano  was the 11th President of the Italian Republic.", "full_text": "Giorgio Napolitano OMRI  is an Italian politician who was the 11th President of Italy from 2006 to 2015. Due to his dominant position in Italian politics, critics often refer to him as Re Giorgio . He is the longest serving President in the history of the modern Italian Republic, which has been in existence since 1946.\nAlthough the presidency is a nonpartisan office as guarantor of Italy's Constitution, Napolitano was a longtime member of the Italian Communist Party . He was a leading member of a modernizing faction on the right of the party. First elected to the Chamber of Deputies in 1953, he took an assiduous interest in parliamentary life, and was President of the Chamber of Deputies from 1992 to 1994. He was Minister of the Interior from 1996 to 1998 under Romano Prodi.\nNapolitano was appointed a Senator for life in 2005 by President Carlo Azeglio Ciampi. In May 2006, he was elected by parliament as President of Italy. During his first term of office, he oversaw governments both of the centre-left, led by Prodi, and the centre-right, led by Silvio Berlusconi. In November 2011, Berlusconi resigned as Prime Minister amid financial and economic problems. Napolitano, in keeping with his constitutional role, then asked former EU commissioner Mario Monti to form a cabinet of unelected professionals, which became widely referred to as a \"government of the president\".\nWhen his seven-year presidential term expired in April 2013, Napolitano  reluctantly agreed to stand again, to safeguard the continuity of the country's institutions during the parliamentary deadlock that followed the 2013 general election. On being reelected as President with broad cross-party support in parliament, he overcame the impasse by inviting Enrico Letta to propose a government in the form of a grand coalition. When Letta handed in his resignation on 14 February 2014, Napolitano mandated Matteo Renzi  to form a new government. After a record eight and a half years as president, Napolitano resigned at age 89 in January 2015.", "title": "Giorgio Napolitano"}