{"summary": "Glasgow  is the biggest and busiest city in Scotland.", "full_text": "Glasgow  is the largest city in Scotland, and the third largest in the United Kingdom . Greater Glasgow had a population of 1,199,629 at the 2001 census. At the 2011 census, it had a population density of 8,790/sq mi , the highest of any Scottish city. It is situated on the River Clyde in the country's West Central Lowlands. Inhabitants of the city are referred to as Glaswegians.\nGlasgow grew from a small rural settlement on the River Clyde to become the largest seaport in Britain. Expanding from the medieval bishopric and royal burgh, and the later establishment of the University of Glasgow in the 15th century, it became a major centre of the Scottish Enlightenment in the 18th century. From the 18th century the city also grew as one of Great Britain's main hubs of transatlantic trade with North America and the West Indies.\nWith the onset of the Industrial Revolution, the population and economy of Glasgow and the surrounding region expanded rapidly to become one of the world's pre-eminent centres of chemicals, textiles and engineering; most notably in the shipbuilding and marine engineering industry, which produced many innovative and famous vessels. Glasgow was the \"Second City of the British Empire\" for much of the Victorian era and Edwardian period, although many cities argue the title was theirs.\nIn the late 19th and early 20th centuries Glasgow grew in population, eventually reaching a peak of 1,128,473 in 1939. In the 1960s, comprehensive urban renewal projects resulting in large-scale relocation of people to new towns and peripheral suburbs, followed by successive boundary changes, have reduced the current population of the City of Glasgow council area to 599,650 with 1,209,143  people living in the Greater Glasgow urban area. The entire region surrounding the conurbation covers about 2.3 million people, 41% of Scotland's population. Glasgow hosted the 2014 Commonwealth Games. Glasgow is also well known in the sporting world for the football rivalry of the Old Firm between Celtic and Rangers.", "title": "Glasgow"}