{"summary": "Professor John Cromwell Mather  is an American astrophysicist and cosmologist.", "full_text": "The Goddard Space Flight Center  is a major NASA space research laboratory established on May 1, 1959 as NASA's first space flight center. GSFC employs approximately 10,000 civil servants and contractors, and is located approximately 6.5 miles  northeast of Washington, D.C. in Greenbelt, Maryland, USA. GSFC, one of ten major NASA field centers, is named in recognition of Dr. Robert H. Goddard , the pioneer of modern rocket propulsion in the United States.\nGSFC is the largest combined organization of scientists and engineers in the United States dedicated to increasing knowledge of the Earth, the Solar System, and the Universe via observations from space. GSFC is a major U.S. laboratory for developing and operating unmanned scientific spacecraft. GSFC conducts scientific investigation, development and operation of space systems, and development of related technologies. Goddard scientists can develop and support a mission, and Goddard engineers and technicians can design and build the spacecraft for that mission. Goddard scientist John C. Mather shared the 2006 Nobel Prize in Physics for his work on COBE.\nGSFC also operates two spaceflight tracking and data acquisition networks , develops and maintains advanced space and Earth science data information systems, and develops satellite systems for the National Oceanic and Atmospheric Administration .\nGSFC manages operations for many NASA and international missions including the Hubble Space Telescope , the Explorer program, the Discovery Program, the Earth Observing System , INTEGRAL, MAVEN, OSIRIS-REx, the Solar and Heliospheric Observatory , the Solar Dynamics Observatory , the Rossi X-ray Timing Explorer  and Swift. Past missions managed by GSFC include the Compton Gamma Ray Observatory, SMM, COBE, IUE, and ROSAT. Typically, unmanned earth observation missions and observatories in Earth orbit are managed by GSFC, while unmanned planetary missions are managed by the Jet Propulsion Laboratory  in Pasadena, California.\n^ Langley Research Center, however, is NASA's oldest field center", "title": "Goddard Space Flight Center"}