{"summary": "GoldenEye is a British action-adventure espionage drama released in November 1995. Starring in this are Pierce Brosnan  and Judi Dench .", "full_text": "GoldenEye  is the seventeenth spy film in the James Bond series, and the first to star Pierce Brosnan as the fictional MI6 officer James Bond. The film was directed by Martin Campbell and is the first film in the series not to take story elements from the works of novelist Ian Fleming. The story was conceived and written by Michael France, with later collaboration by other writers. In the film, Bond fights to prevent an ex-MI6 agent, gone rogue, from using a satellite against London in order to cause global financial meltdown.\nGoldenEye was released in 1995 after a six-year hiatus in the series caused by legal disputes, during which Timothy Dalton resigned from the role of James Bond and was replaced by Pierce Brosnan. M was also recast, with actress Judi Dench becoming the first woman to portray the character, replacing Robert Brown. The role of Miss Moneypenny was also recast, with Caroline Bliss being replaced by Samantha Bond. GoldenEye was the first Bond film made after the dissolution of the Soviet Union and the end of the Cold War, which provided a background for the plot.\nThe film accumulated a worldwide gross of US$350.7 million, considerably better than Dalton's films, without taking inflation into account. Some critics viewed the film as a modernisation of the series, and felt Brosnan was a definite improvement over his predecessor. The film also received award nominations for \"Best Achievement in Special Effects\" and \"Best Sound\" from the British Academy of Film and Television Arts.\nThe name \"GoldenEye\" pays homage to James Bond's creator, Ian Fleming. While working for British Naval Intelligence as a lieutenant commander, Ian Fleming liaised with the American OSS to monitor developments in Spain after the Spanish Civil War in an operation codenamed Operation Goldeneye. Fleming used the name of his operation for his estate in Oracabessa, Jamaica.", "title": "GoldenEye"}