{"summary": "Goodfellas is a 1990 American biographical crime movie directed by Martin Scorsese.", "full_text": "Goodfellas  is a 1990 American biographical crime film directed by Martin Scorsese. It is a film adaptation of the 1986 non-fiction book Wiseguy by Nicholas Pileggi, who co-wrote the screenplay with Scorsese. The film narrates the rise and fall of Lucchese crime family associate Henry Hill  and his friends over a period from 1955 to 1980.\nScorsese initially named the film Wise Guy and postponed making it; later, he and Pileggi changed the name to Goodfellas. To prepare for their roles in the film, Robert De Niro, Joe Pesci, and Ray Liotta often spoke with Pileggi, who shared research material left over from writing the book. According to Pesci, improvisation and ad-libbing came out of rehearsals wherein Scorsese gave the actors freedom to do whatever they wanted. The director made transcripts of these sessions, took the lines he liked best, and put them into a revised script the cast worked from during principal photography.\nMade on a budget of $25 million, Goodfellas grossed $46.8 million domestically. It received positive reviews from critics and was nominated for six Academy Awards, including Best Picture and Best Director, and it won for Pesci in the Best Actor in a Supporting Role category. Scorsese's film won five awards from the British Academy of Film and Television Arts, including Best Film and Best Director. Additionally, Goodfellas was named Best Film of the year by various film critics groups.\nGoodfellas is often regarded as one of the greatest films of all time, both in the crime genre and in general. In 2000, the film was deemed \"culturally, historically, and aesthetically significant\" and selected for preservation in the National Film Registry by the United States Library of Congress. Its content and style have been emulated in numerous other films and television shows. Scorsese followed up making this film with two more about organized crime: Casino  and The Departed .", "title": "Goodfellas"}