{"summary": "The Eastern Cape is a province of South Africa.", "full_text": "Govan Archibald Mvuyelwa Mbeki  was a South African politician and father of the former South African president Thabo Mbeki and political economist Moeletsi Mbeki.\nHe attended Fort Hare University, completing in 1936 a Bachelor of Arts degree in politics and psychology and a teaching diploma. Mbeki met other African struggle leaders there. He worked for a time as a teacher but lost his job because of his political activities.\nIn 1954, he joined the editorial board of New Age, a prominent leftist newspaper. Mbeki played a crucial role in ensuring that the pages and columns reflected the conditions, demands, and aspirations of the black peoples, particularly in the countryside. In November 1962, the then Minister of Justice, John Vorster, banned New Age. When the editorial board came out with its successor publication Spark, Vorster went one step further by banning not the newspaper but its editors and writers.\nMbeki was a leader of the African National Congress  and of the South African Communist Party. After the Rivonia Trial, he was imprisoned  on charges of terrorism and treason, together with Nelson Mandela, Walter Sisulu, Raymond Mhlaba, Ahmed Kathrada and other eminent ANC leaders.\nOn 26 June 1980, the Secretary General of the African National Congress, Alfred Nzo, announced the conferring of the Isitwalandwe Medal, the ANC's highest honour, on Govan Mbeki. Mbeki was not present to receive the award, because he was serving a life imprisonment sentence on Robben Island.\nGovan Mbeki was released from custody after serving 24 years in the Robben Island prison on 5 November 1987. He served in South Africa's post-apartheid Senate from 1994 to 1997 as Deputy President of the Senate. He then served in the Senate's successor, the National Council of Provinces, from 1997 to 1999.\nMbeki died in Port Elizabeth in September 2001. His remains were the subject of controversy in 2006 when plans were made to exhume them, and place them in a museum. These plans were called off after Mbeki's family refused the request.\nMbeki received international recognition for his political achievements including the renaming  of the recently opened health building at Glasgow Caledonian University. The Govan Mbeki Health Building was inaugurated in 2001 at a ceremony featuring his son Thabo.\nMbeki received an honorary doctorate in the Social Sciences from the University of Amsterdam. His son Thabo attended the ceremony, as Mbeki was imprisoned at Robben Island.", "title": "Govan Mbeki"}