{"summary": "Daniel D.", "full_text": "The Governor of New York is the head of the executive branch of New York's state government and the commander-in-chief of the state's military forces. The governor has a duty to enforce state laws, to convene the New York legislature, the power to either approve or veto bills passed by the legislature, and to grant pardons, except in cases of treason and impeachment.\nFifty-six individuals have served as governor, four of whom served non-consecutive terms, totaling 60 distinct terms; the official numbering only lists each governor once, so there have officially been fifty-six governors. This numbering includes one acting governor: the lieutenant governor who filled the vacancy after the resignation of the governor, under the 1777 State Constitution. The list does not include people who have acted as governor when the governor was out of state, such as Lt. Gov. Timothy L. Woodruff during Theodore Roosevelt's vice presidential campaign in 1900, or Acting Speaker of the New York State Assembly Moses M. Weinstein, who acted as governor for ten days in 1968 while the governor, the lieutenant governor, and the senate majority leader were out of the state, attending the Republican National Convention in Miami, Florida.\nFour men have become President of the United States after serving as Governor of New York: Martin Van Buren, Grover Cleveland, Theodore Roosevelt, and Franklin Delano Roosevelt, and six were Vice President of the United States.  Two governors have been Chief Justice of the United States: John Jay held that position when he was elected governor in 1795, and Charles Evans Hughes became chief justice in 1930, two decades after leaving the governorship.\nThe longest-serving governor was the first, George Clinton, who first took office on July 30, 1777, and served seven terms in two different periods, totaling just under 21 years in office.  Charles Poletti had the shortest term, serving 29 days following the resignation of the previous governor in 1942. The current governor is Andrew Cuomo, who took office on January 1, 2011.", "title": "Governors of New York"}