{"summary": "A Global Positioning System, also known as GPS, is a system designed to help navigate on the Earth, in the air, and on water.", "full_text": "The Global Positioning System  is a space-based navigation system that provides location and time information in all weather conditions, anywhere on or near the Earth where there is an unobstructed line of sight to four or more GPS satellites. The system provides critical capabilities to military, civil, and commercial users around the world. The United States government created the system, maintains it, and makes it freely accessible to anyone with a GPS receiver.\nThe US began the GPS project in 1973 to overcome the limitations of previous navigation systems, integrating ideas from several predecessors, including a number of classified engineering design studies from the 1960s. The U.S. Department of Defense  developed the system, which originally used 24 satellites. It became fully operational in 1995. Roger L. Easton, Ivan A. Getting and Bradford Parkinson are credited with inventing it.\nAdvances in technology and new demands on the existing system have now led to efforts to modernize the GPS and implement the next generation of GPS Block IIIA satellites and Next Generation Operational Control System . Announcements from Vice President Al Gore and the White House in 1998 initiated these changes. In 2000, the U.S. Congress authorized the modernization effort, GPS III.\nIn addition to GPS, other systems are in use or under development. The Russian Global Navigation Satellite System  was developed contemporaneously with GPS, but suffered from incomplete coverage of the globe until the mid-2000s. There are also the planned European Union Galileo positioning system, India's Indian Regional Navigation Satellite System, China's BeiDou Navigation Satellite System, and the Japanese Quasi-Zenith Satellite System.\n^ \"What is a GPS?\". \n^ National Research Council . Committee on the Future of the Global Positioning System; National Academy of Public Administration . The global positioning system: a shared national asset: recommendations for technical improvements and enhancements. National Academies Press. p. 16. ISBN 0-309-05283-1. Retrieved August 16, 2013. , //books.google.com/books?id=FAHk65slfY4C&pg=PA16\n^ \"Factsheets : GPS Advanced Control Segment \". Losangeles.af.mil. October 25, 2011. Retrieved November 6, 2011. \n^ \"Russia Launches Three More GLONASS-M Space Vehicles\". Inside GNSS. Retrieved December 26, 2008.", "title": "GPS"}