{"summary": "The four Grand Slam tournaments, also known as The Majors, are the most important tennis tournaments.", "full_text": "The Grand Slam tournaments, also called majors, are the four most important annual tennis events. They offer the most ranking points, prize money, public and media attention, the greatest strength and size of field, and greater number of \"best of\" sets for men. The Grand Slam itinerary consists of the Australian Open in mid January, the French Open in May and June, Wimbledon in June and July, and the US Open in August and September. Each tournament is played over a period of two weeks. The Australian and United States tournaments are played on hard courts, the French on clay, and Wimbledon on grass. Wimbledon is the oldest, founded in 1877, followed by the US in 1881, the French in 1891, and the Australian in 1905. However, of these four, only Wimbledon was a major before 1924/25, the time when all four became designated Grand Slam tournaments.\nThe term Grand Slam also, and originally, refers to the achievement of winning all four major championships in a single calendar year within one of the five events: men's and women's singles; men's, women's, and mixed doubles. In doubles, one team may accomplish a Grand Slam playing together or one player may achieve it with different partners. The term \"Grand Slam\" without qualification refers to winning the four majors in a single calendar year.\nWinning the four majors in consecutive tournaments but not in the same year is known as a Non-Calendar Year Grand Slam, while winning all four majors at any point during the course of a career is known as a Career Grand Slam. Winning the gold medal at the Summer Olympic Games in addition to the four majors in a one calendar year is known as a \"Golden Grand Slam\" or more commonly the \"Golden Slam\". Also, winning the Year-End Championship  in the same period is known as a \"Super Slam\". Together, all four Majors in all three disciplines  are called a \"boxed set\" of Grand Slam titles. No male or female player has won all twelve events in one calendar year, although a \"career boxed set\" has been achieved by three female players during their careers.\n\n", "title": "Grand Slam (tennis)"}