{"summary": "The Grand Coulee Dam is a dam on the Columbia River in the United States state of Washington.", "full_text": "Grand Coulee Dam is a gravity dam on the Columbia River in the U.S. state of Washington built to produce hydroelectric power and provide irrigation water. It was constructed between 1933 and 1942, originally with two power plants. A third power station was completed in 1974 to increase its energy production. It is the largest electric power-producing facility in the United States.\nThe proposal to build the dam was the focus of a bitter debate during the 1920s between two groups. One wanted to irrigate the ancient Grand Coulee with a gravity canal and the other supported a high dam and pumping scheme. Dam supporters won in 1933, but for fiscal reasons the initial design was for a \"low dam\" 290 ft  high which would generate electricity, but not support irrigation. The U.S. Bureau of Reclamation and a consortium of three companies called MWAK  began construction that year. After visiting the construction site in August 1934, President Franklin Delano Roosevelt began endorsing the \"high dam\" design which, at 550 ft  high, would provide enough electricity to pump water to irrigate the Columbia Basin. The high dam was approved by Congress in 1935 and completed in 1942; the first water over-topped its spillway on June 1 of that year.\nPower from the dam fueled the growing industries of the Northwest United States during World War II. Between 1967 and 1974, the Third Powerplant was constructed. The decision to construct the additional facility was influenced by growing energy demand, regulated river flows stipulated in the Columbia River Treaty with Canada and competition with the Soviet Union. Through a series of upgrades and the installation of pump-generators, the dam now supplies four power stations with an installed capacity of 6,809 MW. As the center-piece of the Columbia Basin Project, the dam's reservoir supplies water for the irrigation of 671,000 acres .\nThe reservoir is called Franklin Delano Roosevelt Lake, named after the United States President who presided over the authorization and completion of the dam. Creation of the reservoir forced the relocation of over 3,000 people, including Native Americans whose ancestral lands were partially flooded. The dam has also blocked the migration of salmon and other fish upstream to spawn.", "title": "Grand Coulee Dam"}