{"summary": "Greece , officially the Hellenic Republic , is a country in Southeastern Europe.", "full_text": "Greece , officially the Hellenic Republic  and known since ancient times as Hellas , is a country located in southeastern Europe. According to the 2011 census, Greece's population is around 10.8 million. Athens is the nation's capital and largest city, followed by Thessaloniki, which is commonly referred to as the co-capital.\nGreece is strategically located at the crossroads of Europe, Asia, and Africa. Situated on the southern tip of the Balkan peninsula, it shares land borders with Albania to the northwest, the Republic of Macedonia and Bulgaria to the north and Turkey to the northeast. Greece consists of nine geographic regions: Macedonia, Central Greece, the Peloponnese, Thessaly, Epirus, the Aegean Islands , Thrace, Crete, and the Ionian Islands. The Aegean Sea lies to the east of the mainland, the Ionian Sea to the west, and the Mediterranean Sea to the south. Greece has the longest coastline on the Mediterranean Basin and the 11th longest coastline in the world at 13,676 km  in length, featuring a vast number of islands, of which 227 are inhabited. Eighty percent of Greece is mountainous, with Mount Olympus being the highest peak at 2,918 metres .\nGreece has one of the longest histories of any country, tracing its roots to the civilization of Ancient Greece, which is considered the cradle of all Western civilization; its legacy includes democracy, Western philosophy, the Olympic Games, Western literature, historiography, political science, major scientific and mathematical principles, and Western drama, including both tragedy and comedy. After centuries of independence, the Greek city-states were unified by Philip of Macedon in the fourth century BCE. His son Alexander the Great rapidly conquered much of the ancient world, spreading Greek culture and science from the eastern Mediterranean to the Indus River. Annexed by Rome in the second century BCE, Greece became an integral part of the Roman Empire and formed the core of its successor, the Byzantine Empire. The Greek Orthodox Church, rooted in the first century CE, shaped the modern Greek identity and transmitted Greek traditions to the wider Orthodox World. Falling under Ottoman dominion in the mid-15th century, the nation state of Greece emerged in 1830 following the war of independence. The country's rich history is reflected in large part by its 17 UNESCO World Heritage Sites, among the most in Europe and the world.\nGreece is a democratic and developed country with an advanced high-income economy, a high quality of life and a very high standard of living. A founding member of the United Nations, Greece was the tenth member to join the European Communities  and has been part of the Eurozone since 2001. It is also a member of numerous other international institutions, including the Council of Europe, NATO, OECD, OIF, OSCE and the WTO. Greece, which is one of the world's largest shipping powers, middle powers and top tourist destinations, has the largest economy in the Balkans, where it is an important regional investor.", "title": "Greece"}