{"summary": "The Gregorian calendar is the calendar that is used throughout most of the world.", "full_text": "The Gregorian calendar, also called the Western calendar and the Christian calendar, is internationally the most widely used civil calendar. It is named for Pope Gregory XIII, who introduced it in 1582.\nThe calendar was a refinement to the Julian calendar amounting to a 0.002% correction in the length of the year. The motivation for the reform was to bring the date for the celebration of Easter to the time of the year in which it was celebrated when it was introduced by the early Church. Because the celebration of Easter was tied to the spring equinox, the Roman Catholic Church considered the steady drift in the date of Easter caused by the year being slightly too long to be undesirable. The reform was adopted initially by the Catholic countries of Europe. Protestants and Eastern Orthodox countries continued to use the traditional Julian calendar and adopted the Gregorian reform after a time, for the sake of convenience in international trade. The last European country to adopt the reform was Greece, in 1923.\nThe Gregorian reform contained two parts: a reform of the Julian calendar as used prior to Pope Gregory XIII's time and a reform of the lunar cycle used by the Church, with the Julian calendar, to calculate the date of Easter. The reform was a modification of a proposal made by Aloysius Lilius. His proposal included reducing the number of leap years in four centuries from 100 to 97, by making 3 out of 4 centurial years common instead of leap years. Lilius also produced an original and practical scheme for adjusting the epacts of the moon when calculating the annual date of Easter, solving a long-standing obstacle to calendar reform.\nThe Gregorian reform modified the Julian calendar's scheme of leap years as follows:\n\nEvery year that is exactly divisible by four is a leap year, except for years that are exactly divisible by 100, but these centurial years are leap years if they are exactly divisible by 400. For example, the years 1700, 1800, and 1900 are not leap years, but the year 2000 is.\n\nIn addition to the change in the mean length of the calendar year from 365.25 days  to 365.2425 days , a reduction of 10 minutes 48 seconds per year, the Gregorian calendar reform also dealt with the accumulated difference between these lengths. The canonical Easter tables were devised at the end of the third century, when the vernal equinox fell either on 20 March or 21 March depending on the year's position in the leap year cycle. As the rule was that the full moon preceding Easter was not to precede the equinox the equinox was fixed at 21 March for computational purposes and the earliest date for Easter was fixed at 22 March. The Gregorian calendar reproduced these conditions by removing ten days.\nTo unambiguously specify the date, dual dating or Old Style  and New Style  are sometimes used with dates. Dual dating uses two consecutive years because of differences in the starting date of the year, or includes both the Julian and Gregorian dates. Old Style and New Style  indicate either whether the start of the Julian year has been adjusted to start on 1 January  even though documents written at the time use a different start of year , or whether a date conforms to the Julian calendar  rather than the Gregorian .\nThe Gregorian calendar continued to use the previous calendar era , which counts years from the traditional date of the nativity , originally calculated in the 6th century by Dionysius Exiguus. This year-numbering system, also known as Dionysian era or Common Era, is the predominant international standard today.", "title": "Gregorian calendar"}