{"summary": "Greta Garbo  was a Swedish-American actress.", "full_text": "Greta Garbo born Greta Lovisa Gustafsson  was a Swedish film actress and an international star and icon during the twenties and thirties. Garbo was nominated three times for the Academy Award for Best Actress and received an honorary one in 1954 for her \"luminous and unforgettable screen performances.\" In 1999, the American Film Institute ranked Garbo fifth on their list of the greatest female stars of Classic Hollywood Cinema, after Katharine Hepburn, Bette Davis, Audrey Hepburn, and Ingrid Bergman.\nGarbo launched her career with a secondary role in the 1924 Swedish film The Saga of Gosta Berling. Her performance caught the attention of Louis B. Mayer, chief executive of Metro Goldwyn Mayer , who brought her to Hollywood in 1925. She immediately stirred interest with her first silent film, Torrent, released in 1926; a year later, her performance in Flesh and the Devil, her third movie, made her an international star.\nGarbo's first talking film was Anna Christie . MGM marketers enticed the public with the catch-phrase \"Garbo talks!\" That same year she starred in Romance. For her performances in these films she received the first of three Academy Award nominations for Best Actress.  In 1932, her popularity allowed her to dictate the terms of her contract and she became increasingly selective about her roles. Her success continued in films such as Mata Hari  and Grand Hotel . Many critics and film historians consider her performance as the doomed courtesan Marguerite Gautier in Camille  to be her finest. The role gained her a second Academy Award nomination. Garbo's career soon declined, however, and she was one of the many stars labeled \"Box Office Poison\" in 1938. Her career revived upon her turn to comedy in Ninotchka , which earned her a third Academy Award nomination, but after the failure of Two-Faced Woman , she retired from the screen, at the age of 35, after acting in twenty-eight films.\nFrom then on, Garbo declined all opportunities to return to the screen. Shunning publicity, she began a private life, and neither married nor had children. Garbo also became an art collector in her later life; her collection, including works from painters such as Pierre Renoir, Pierre Bonnard, and Kees van Dongen, was worth millions at the time of her death.", "title": "Greta Garbo"}