{"summary": "Lanthanum is a chemical element.", "full_text": "Group 3 is a group of elements in the periodic table. This group, like other d-block groups, should contain four elements, but it is not agreed what elements belong in the group. Scandium  and yttrium  are always included, but the other two spaces are usually occupied by lanthanum  and actinium , or by lutetium  and lawrencium ; less frequently, it is considered the group should be expanded to 32 elements  or contracted to contain only scandium and yttrium. The group itself has not acquired a trivial name; however, scandium, yttrium and the lanthanides are sometimes called rare earth metals.\nThree group 3 elements occur naturally, scandium, yttrium, and either lanthanum or lutetium. Lanthanum continues the trend started by two lighter members in general chemical behavior, while lutetium behaves more similarly to yttrium. This is in accordance with the trend for period 6 transition metals to behave more similarly to their upper periodic table neighbors. This trend is seen from hafnium, which is almost identical chemically to zirconium, to mercury, which is quite distant chemically from cadmium, but still shares with it almost equal atomic size and other similar properties. They all are silvery-white metals under standard conditions. The fourth element, either actinium or lawrencium, has only radioactive isotopes. Actinium, which occurs only in trace amounts, continues the trend in chemical behavior for metals that form tripositive ions with a noble gas configuration; synthetic lawrencium is calculated and partially shown to be more similar to lutetium and yttrium. So far, no experiments have been conducted to synthesize any element that could be the next group 3 element. Unbiunium , which could be considered a group 3 element if preceded by lanthanum and actinium, might be synthesized in the near future, it being only three spaces away from the current heaviest element known, ununoctium.", "title": "Group number of lanthanides and actinides"}