{"summary": "The Guadalcanal Campaign was fought between August 7, 1942, and February 9, 1943, in the Pacific theatre of World War II.", "full_text": "The Guadalcanal Campaign, also known as the Battle of Guadalcanal and code-named Operation Watchtower, originally applying only to an operation to take the island of Tulagi, by Allied forces, was a military campaign fought between 7 August 1942 and 9 February 1943 on and around the island of Guadalcanal in the Pacific theater of World War II. It was the first major offensive by Allied forces against the Empire of Japan.\nOn 7 August 1942, Allied forces, predominantly United States Marines, landed on the islands of Guadalcanal, Tulagi, and Florida in the southern Solomon Islands, with the objective of denying their use by the Japanese to threaten the supply and communication routes between the US, Australia, and New Zealand. The Allies also intended to use Guadalcanal and Tulagi as bases to support a campaign to eventually capture or neutralize the major Japanese base at Rabaul on New Britain. The Allies overwhelmed the outnumbered Japanese defenders, who had occupied the islands since May 1942, and captured Tulagi and Florida, as well as an airfield  that was under construction on Guadalcanal. Powerful US naval forces supported the landings.\nSurprised by the Allied offensive, the Japanese made several attempts between August and November to retake Henderson Field. Three major land battles, seven large naval battles , and continual, almost daily aerial battles culminated in the decisive Naval Battle of Guadalcanal in early November, in which the last Japanese attempt to bombard Henderson Field from the sea and land with enough troops to retake it was defeated. In December, the Japanese abandoned their efforts to retake Guadalcanal and evacuated their remaining forces by 7 February 1943 in the face of an offensive by the US Army's XIV Corps.\nThe Guadalcanal campaign was a significant strategic combined arms victory by Allied forces over the Japanese in the Pacific theater. The Japanese had reached the peak of their conquests in the Pacific. The victories at Milne Bay, Buna-Gona, and Guadalcanal marked the Allied transition from defensive operations to the strategic initiative in that theater, leading to offensive operations, such as the Solomon Islands, New Guinea, and Central Pacific campaigns, that resulted in Japan's eventual surrender and the end of World War II.", "title": "Guadalcanal Campaign"}