{"summary": "Hackensack is a city of Bergen County in the state of New Jersey in the United States.", "full_text": "Hackensack is a city in Bergen County, New Jersey, United States, and serves as its county seat. It was officially named New Barbadoes Township until 1921, though it was informally known as Hackensack. As of the 2010 United States Census, the city's population was 43,010, reflecting an increase of 333  from the 42,677 counted in the 2000 Census, which had in turn increased by 5,628  from the 37,049 counted in the 1990 Census.\nAn inner suburb of New York City, Hackensack is located approximately 12 miles  northwest of Midtown Manhattan and about 7 miles  from the George Washington Bridge. From a number of locations, one can see the New York City skyline.\nThe Metropolitan Campus of Fairleigh Dickinson University borders the Hackensack River in both Hackensack and Teaneck. Hackensack is also the home of the New Jersey Naval Museum and the World War II submarine USS Ling. Astronaut Walter Schirra is perhaps Hackensack's most famous native son.\nThe city is known for a great diversity of neighborhoods and land uses existing in very close proximity to each other. Within its borders are the prominent Hackensack University Medical Center, a trendy high-rise district about a mile long, classic suburban neighborhoods of single-family houses, stately older homes on acre-plus lots, older two-family neighborhoods, large garden apartment complexes, industrial areas, the Bergen County Jail, a tidal river, Hackensack River County Park, Borg's Woods Nature Preserve, various city parks, large office buildings, a major college campus, the Bergen County Court House, a vibrant small-city downtown district, and various small neighborhood business districts.\n^ \"Hackensack\", FDU Magazine, Fall / Winter 2001. Accessed June 14, 2007. \"Billed as 'A City in Motion,' Hackensack has been on the move since before the founding of the United States.\"\n^ a b c d e 2010 Census Gazetteer Files: New Jersey County Subdivisions, United States Census Bureau. Accessed May 21, 2015.\n^ US Gazetteer files: 2010, 2000, and 1990, United States Census Bureau. Accessed September 4, 2014.\n^ 2015 New Jersey Mayors Directory, New Jersey Department of Community Affairs, as of October 20, 2015. Accessed November 11, 2015. As of date accessed, Labrosse is listed as mayor with an incorrect term-end year of 2016.\n^ City Manager, City of Hackensack. Accessed August 4, 2012.\n^ City Clerk, City of Hackensack. Accessed August 4, 2012.\n^ \n^ U.S. Geological Survey Geographic Names Information System: City of Hackensack, Geographic Names Information System. Accessed March 5, 2013.\n^ a b DP-1 - Profile of General Population and Housing Characteristics: 2010 for Hackensack city, Bergen County, New Jersey, United States Census Bureau. Accessed December 10, 2011.\n^ \n^ a b Profile of General Demographic Characteristics: 2010 for Hackensack borough, New Jersey Department of Labor and Workforce Development. Accessed December 13, 2011.\n^ \n^ a b GCT-PH1 Population, Housing Units, Area, and Density: 2010 - State -- County Subdivision from the 2010 Census Summary File 1 for New Jersey, United States Census Bureau. Accessed September 20, 2012.\n^ Look Up a ZIP Code, United States Postal Service. Accessed November 8, 2011.\n^ Zip Codes, State of New Jersey. Accessed August 29, 2013.\n^ Area Code Lookup - NPA NXX for Hackensack, NJ, Area-Codes.com. Accessed August 29, 2013.\n^ American FactFinder, United States Census Bureau. Accessed September 4, 2014.\n^ A Cure for the Common Codes: New Jersey, Missouri Census Data Center. Accessed August 4, 2012.\n^ US Board on Geographic Names, United States Geological Survey. Accessed September 4, 2014.\n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ Bergen County, NJ, National Association of Counties. Accessed January 22, 2013.\n^ Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010, New Jersey Department of Labor and Workforce Development, February 2011. Accessed August 4, 2012.\n^ a b Rondinaro, Gene. \"IF YOU'RE THINKING OF LIVING IN: HACKENSACK\", The New York Times, March 18, 1984. Accessed December 13, 2011. \"There are other signs of renewed health. New high-rise residential buildings with exceptional views of the Manhattan skyline have sprung up along Prospect Avenue in the Heights area to the west.\"\n^ Cheslow, Jerry. \"If You're Thinking of Living In/Hackensack, N.J.; After Long Decline, Downtown Rebounds\", The New York Times, May 3, 1998. Accessed December 13, 2011.", "title": "Hackensack, New Jersey"}