{"summary": "The Han Dynasty came to power in 202 BC.", "full_text": "The Han dynasty  was the second imperial dynasty of China, preceded by the Qin dynasty  and succeeded by the Three Kingdoms period . Spanning over four centuries, the Han period is considered a golden age in Chinese history. To this day, China's majority ethnic group refers to itself as the \"Han people\" and the Chinese script is referred to as \"Han characters\". It was founded by the rebel leader Liu Bang, known posthumously as Emperor Gaozu of Han, and briefly interrupted by the Xin dynasty  of the former regent Wang Mang. This interregnum separates the Han dynasty into two periods: the Western Han or Former Han  and the Eastern Han or Latter Han .\nThe emperor was at the pinnacle of Han society. He presided over the Han government but shared power with both the nobility and appointed ministers who came largely from the scholarly gentry class. The Han Empire was divided into areas directly controlled by the central government using an innovation inherited from the Qin known as commanderies, and a number of semi-autonomous kingdoms. These kingdoms gradually lost all vestiges of their independence, particularly following the Rebellion of the Seven States. From the reign of Emperor Wu onward, the Chinese court officially sponsored Confucianism in education and court politics, synthesized with the cosmology of later scholars such as Dong Zhongshu. This policy endured until the fall of the Qing dynasty in 1911 AD.\nThe Han dynasty was an age of economic prosperity and saw a significant growth of the money economy first established during the Zhou dynasty . The coinage issued by the central government mint in 119 BC remained the standard coinage of China until the Tang dynasty . The period saw a number of limited institutional innovations. To pay for its military campaigns and the settlement of newly conquered frontier territories, the government nationalized the private salt and iron industries in 117 BC, but these government monopolies were repealed during the Eastern Han period. Science and technology during the Han period saw significant advances, including papermaking, the nautical steering rudder, the use of negative numbers in mathematics, the raised-relief map, the hydraulic-powered armillary sphere for astronomy, and a seismometer employing an inverted pendulum.\nThe Xiongnu, a nomadic steppe confederation, defeated the Han in 200 BC and forced the Han to submit as a de facto inferior partner, but continued their raids on the Han borders. Emperor Wu of Han  launched several military campaigns against them. The ultimate Han victory in these wars eventually forced the Xiongnu to accept vassal status as Han tributaries. These campaigns expanded Han sovereignty into the Tarim Basin of Central Asia, divided the Xiongnu into two separate confederations, and helped establish the vast trade network known as the Silk Road, which reached as far as the Mediterranean world. The territories north of Han's borders were quickly overrun by the nomadic Xianbei confederation. Emperor Wu also launched successful military expeditions in the south, annexing Nanyue in 111 BC and Dian in 109 BC, and in the Korean Peninsula where the Xuantu and Lelang Commanderies were established in 108 BC.\nAfter 92 AD, the palace eunuchs increasingly involved themselves in court politics, engaging in violent power struggles between the various consort clans of the empresses and empress dowagers, causing the Han's ultimate downfall. Imperial authority was also seriously challenged by large Daoist religious societies which instigated the Yellow Turban Rebellion and the Five Pecks of Rice Rebellion. Following the death of Emperor Ling , the palace eunuchs suffered wholesale massacre by military officers, allowing members of the aristocracy and military governors to become warlords and divide the empire. When Cao Pi, King of Wei, usurped the throne from Emperor Xian, the Han dynasty ceased to exist.", "title": "Han Dynasty"}