{"summary": "A hard disk drive , hard disk or hard drive, is something used by computers to store information.", "full_text": "A hard disk drive , hard disk, hard drive or fixed disk is a data storage device used for storing and retrieving digital information using one or more rigid  rapidly rotating disks  coated with magnetic material. The platters are paired with magnetic heads arranged on a moving actuator arm, which read and write data to the platter surfaces. Data is accessed in a random-access manner, meaning that individual blocks of data can be stored or retrieved in any order rather than sequentially. HDDs retain stored data even when powered off.\nIntroduced by IBM in 1956, HDDs became the dominant secondary storage device for general-purpose computers by the early 1960s. Continuously improved, HDDs have maintained this position into the modern era of servers and personal computers. More than 200 companies have produced HDD units, though most current units are manufactured by Seagate, Toshiba and Western Digital. Worldwide disk storage revenues were US $32 billion in 2013, down 3% from 2012.\nThe primary characteristics of an HDD are its capacity and performance. Capacity is specified in unit prefixes corresponding to powers of 1000: a 1-terabyte  drive has a capacity of 1,000 gigabytes . Typically, some of an HDD's capacity is unavailable to the user because it is used by the file system and the computer operating system, and possibly inbuilt redundancy for error correction and recovery. Performance is specified by the time required to move the heads to a track or cylinder  plus the time it takes for the desired sector to move under the head , and finally the speed at which the data is transmitted .\nThe two most common form factors for modern HDDs are 3.5-inch, for desktop computers, and 2.5-inch, primarily for laptops. HDDs are connected to systems by standard interface cables such as PATA , SATA , USB or SAS  cables.\nAs of 2015, the primary competing technology for secondary storage is flash memory in the form of solid-state drives , which have higher data transfer rates, better reliability, and significantly lower latency and access times, but HDDs remain the dominant medium for secondary storage due to advantages in price per bit and per-device recording capacity. However, SSDs are replacing HDDs where speed, power consumption and durability are more important considerations.", "title": "Hard disk"}