{"summary": "James Harold Wilson, Baron Wilson of Rievaulx, KG, OBE, FRS, PC  was one of the most prominent British politicians of the 20th century.", "full_text": "James Harold Wilson, Baron Wilson of Rievaulx KG OBE PC FRS   was a British Labour Party politician who served as the Prime Minister of the United Kingdom from 1964 to 1970 and 1974 to 1976. He won four general elections.\nFirst entering Parliament in 1945, Wilson was immediately appointed the Parliamentary Secretary to the Ministry of Works and rose quickly through the ministerial ranks, becoming the Secretary for Overseas Trade in 1947 and being appointed to the Cabinet just months later as the President of the Board of Trade. Later, in the Labour Shadow Cabinet, he served first as Shadow Chancellor of the Exchequer from 1955 to 1961 and then as the Shadow Foreign Secretary from 1961 to 1963, when he was elected Leader of the Labour Party after the sudden death of Hugh Gaitskell. Wilson narrowly won the 1964 election, going on to win a much increased majority in a snap 1966 election.\nWilson's first period as Prime Minister coincided with a period of low unemployment and relative economic prosperity, though also of significant problems with Britain's external balance of payments. In 1969 Wilson sent British troops to Northern Ireland. After losing the 1970 general election to Edward Heath, he spent four years as Leader of the Opposition before the February 1974 general election resulted in a hung parliament. After Heath's talks with the Liberals broke down, Wilson returned to power as leader of a minority government until there was a second general election in the autumn, which resulted in a narrow Labour victory. A period of economic crisis was now beginning to hit most Western countries, and in 1976 Wilson suddenly announced his resignation as Prime Minister.\nWilson's own approach to socialism was moderate, with emphasis on increasing opportunity within society, for example through change and expansion within the education system, allied to the technocratic aim of taking better advantage of rapid scientific progress, rather than on the more controversial socialist goal of promoting wider public ownership of industry. He took little action to pursue the Labour Party constitution's stated dedication to such nationalisation, though he did not formally disown it. Himself a member of the Labour Party's \"soft left\", Wilson joked about leading a Cabinet that was made up mostly of social democrats, comparing himself to a Bolshevik revolutionary presiding over a Tsarist cabinet, but there was arguably little to divide him ideologically from the cabinet majority.\nLabour Party historians see his years in office as lost opportunities for major reforms. However, in keeping with the mood of the 1960s his government sponsored liberal changes in a number of social areas; they were generally not his initiatives. These included the liberalisation of laws on censorship, divorce, homosexuality, immigration, and abortion; as well as the abolition of capital punishment, which was due in part to the initiatives of backbench MPs who had the support of Roy Jenkins during his time as Home Secretary. Overall, Wilson is seen to have managed a number of difficult political issues with considerable tactical skill, including such potentially divisive issues for his party as the role of public ownership, British membership of the European Community, and the Vietnam War, in which he consistently resisted US pressure to involve Britain and send British troops, while continuing to maintain a costly military presence East of Suez. His stated ambition of substantially improving Britain's long-term economic performance remained largely unfulfilled. He lost his energy and drive in his second government 1974-76 and accomplished little as the leadership split over Europe and trade union issues began ripping Labour apart.", "title": "Harold Wilson"}