{"summary": "Harry S.", "full_text": "Harry S. Truman  was the 33rd President of the United States . As the final running mate of President Franklin D. Roosevelt in 1944, Truman succeeded to the presidency on April 12, 1945, when Roosevelt died after months of declining health. The Allies soon finished World War II; in the aftermath of the conflict, tensions with the Soviet Union increased, marking the start of the Cold War by 1947.\nTruman was born in Missouri and spent most of his youth on his family's farm. In the last five months of World War I, he served in combat in France as an artillery officer in his National Guard unit. After the war, he briefly owned a haberdashery and joined the Democratic Party political machine of Tom Pendergast in Kansas City, Missouri. Truman was first elected to public office as a county official and became a U.S. Senator in 1935. He gained national prominence as head of the Truman Committee formed in March 1941, which exposed waste, fraud, and corruption in wartime contracts.\nDuring World War II, while Nazi Germany surrendered a few weeks after Truman assumed the presidency, the war with Imperial Japan was expected to last another year or more. Truman approved the use of atomic weapons against Japan, intending to force Japan's surrender and spare American lives in a planned invasion; the decision remains controversial. His presidency was a turning point in foreign affairs, as his government supported an internationalist foreign policy in conjunction with European allies. Following the war, Truman assisted in the founding of the United Nations, issued the Truman Doctrine to contain communism, and passed the $13 billion Marshall Plan to rebuild Europe, including the Axis Powers, whereas the wartime allied Soviet Union became the peacetime enemy, and the Cold War began. He oversaw the Berlin Airlift of 1948 and the creation of NATO in 1949. When communist North Korea invaded South Korea in 1950, he immediately sent in U.S. troops and gained UN approval for the Korean War. After initial success, the UN forces were thrown back by Chinese intervention and the conflict was stalemated through the final years of Truman's presidency.\nOn domestic issues, bills endorsed by Truman often faced opposition from a conservative Congress dominated by the South, but his administration successfully guided the American economy through post-war economic challenges. He said civil rights was a moral priority and in 1948 submitted the first comprehensive legislation; in addition, he issued Executive Orders the same year to start racial integration in the military and federal agencies. Corruption in Truman's administration, which was linked to certain members in the cabinet and senior White House staff, was brought up as a central issue in the 1952 presidential campaign. Adlai Stevenson, Truman's successor as Democratic nominee, lost to Republican Dwight D. Eisenhower, former Commander of the Allied Armed Forces. Popular and scholarly assessments of Truman's presidency were initially poor, but became more positive over time, following his retirement from politics. Truman's 1948 election upset to win a full term as president is routinely invoked by underdog candidates.", "title": "Harry Truman"}