{"summary": "Gengen Wer is a god in Egyptian mythology that appears as a goose.", "full_text": "He Long  was a Chinese military leader. He was from a poor rural family of a minority ethnic group in Hunan, and his family was not able to provide him with any formal education. He began his revolutionary career after avenging the death of his uncle, when he fled to become an outlaw and attracted a small personal army around him. Later his forces joined the Kuomintang, and he participated in the Northern Expedition.\nHe rebelled against the Kuomintang after Chiang Kai-shek began violently suppressing Communists, when he planned and led the unsuccessful Nanchang Uprising. After escaping, he organized a soviet in rural Hunan , but was forced to abandon his bases when pressured by Chiang's Encirclement Campaigns. He joined the Long March in 1935, over a year after forces associated with Mao Zedong and Zhu De were forced to do so. He met with forces led by Zhang Guotao, but he disagreed with Zhang about the strategy of the Red Army and led his forces to join and support Mao.\nAfter settling and establishing a headquarters in Shaanxi, He led guerrilla forces in Northwest China in both the Chinese Civil War and the Second Sino-Japanese War, and was generally successful in expanding areas of Communist control. He commanded a force of 170,000 troops forces by the end of 1945, when his force was placed under the command of Peng Dehuai and He became Peng's second-in-command. He was placed in control of Southwest China in the late 1940s, and spent most of the 1950s in the Southwest administering the region in both civilian and military roles.\nHe held a number of civilian and military positions after the founding of the People's Republic of China in 1949. In 1955 He's contributions to the victory of the Communist Party in China were recognized when he was named one of the Ten Marshals, and he served as China's vice premier. He did not support Mao Zedong's attempts to purge Peng Dehuai in 1959 and attempted to rehabilitate Peng. After the Cultural Revolution was declared in 1966, He was one of the first leaders of the PLA to be purged. He died in 1969 when a glucose injection provided by his jailers complicated his untreated diabetes.", "title": "He Long"}