{"summary": "The head of government of a country is the person who runs it.", "full_text": "Head of government is a generic term used for either the highest or second highest official in the executive branch of a sovereign state, a federated state, or a self-governing colony who often presides over a cabinet. The term \"head of government\" is often used differentiating it from the term \"head of state\", e.g. as in article 7 of the Vienna Convention on the Law of Treaties, article 1 of the Convention on the Prevention and Punishment of Crimes against Internationally Protected Persons, including Diplomatic Agents and the United Nations protocol list. The authority of a head of government, and the relationship between that position and other state institutions  varies greatly among sovereign states, depending largely on the particular constitutional model chosen.\nIn a parliamentary system, the head of government is the de facto political leader of the state, and is answerable to the legislature . Although there is often formal reporting relationship to a head of state, the latter usually acts as a figurehead who may only act as a chief executive, on limited occasions, either when receiving constitutional advice from the head of government or under specific provisions in a constitution.\nIn presidential republics or absolute monarchies; the head of state generally is also the head of government. The relationship between such a head of state and government and the other branches of the state varies, ranging from separation of powers to autocracy, according to the constitution  of the particular state.\nIn semi-presidential systems, the head of government may answer to both the head of state and the legislature, with the specifics provided by each constitution. A prominent example is the French Fifth Republic , where the President appoints the Prime Minister, but must choose someone who can get government business done, and enjoy support, in the National Assembly. When the opposition controls the National Assembly , the President is in effect forced to choose a Prime Minister from the opposition party. In such cases, known as cohabitation, the Prime Minister  controls domestic policy, with the President's influence largely restricted to foreign affairs.", "title": "Head of government"}