{"summary": "Health is \"a state of complete physical, mental, and social well-being and not merely the absence of disease\" according to the World Health Organization .", "full_text": "Health is the level of functional or metabolic efficiency of a living organism. In humans it is the ability of individuals or communities to adapt and self-manage when facing physical, mental or social challenges. The World Health Organization  defined health in its broader sense in its 1948 constitution as \"a state of complete physical, mental, and social well-being and not merely the absence of disease or infirmity.\" This definition has been subject to controversy, in particular as lacking operational value and because of the problem created by use of the word \"complete\"   Other definitions have been proposed, among which a recent definition that correlates health and personal satisfaction. Classification systems such as the WHO Family of International Classifications, including the International Classification of Functioning, Disability and Health  and the International Classification of Diseases , are commonly used to define and measure the components of health. Health is that balanced condition of the living organism in which the integral, harmonious performance of the vital functions tends to the preservation of the organism and the normal development of the individual.\nSystematic activities to prevent or cure health problems and promote good health in humans are undertaken by health care providers. Applications with regard to animal health are covered by the veterinary sciences. The term \"healthy\" is also widely used in the context of many types of non-living organizations and their impacts for the benefit of humans, such as in the sense of healthy communities, healthy cities or healthy environments. In addition to health care interventions and a person's surroundings, a number of other factors are known to influence the health status of individuals, including their background, lifestyle, and economic, social conditions, and spirituality; these are referred to as \"determinants of health.\" Studies have shown that high levels of stress can affect human health.", "title": "Health"}