{"summary": "An acute myocardial infarction, also called a heart attack, happens when a blood vessel in the heart suddenly becomes blocked.", "full_text": "Myocardial infarction  or acute myocardial infarction , commonly known as a heart attack, occurs when blood flow stops to a part of the heart causing damage to the heart muscle. The most common symptom is chest pain or discomfort which may travel into the shoulder, arm, back, neck, or jaw. Often it is in the center or left side of the chest and lasts for more than a few minutes. The discomfort may occasionally feel like heartburn. Other symptoms may include shortness of breath, nausea, feeling faint, a cold sweat, or feeling tired. About 30% of people have atypical symptoms, with women more likely than men to present atypically. Among those over 75 years old, about 5% have had an MI with little or no history of symptoms. An MI may cause heart failure, an irregular heartbeat, or cardiac arrest.\nMost MIs occur due to coronary artery disease. Risk factors include high blood pressure, smoking, diabetes, lack of exercise, obesity, high blood cholesterol, poor diet, and excessive alcohol intake, among others. The mechanism of an MI often involves the rupture of an atherosclerotic plaque, leading to complete blockage of a coronary artery. MIs are less commonly caused by coronary artery spasms, which may be due to cocaine, significant emotional stress, and extreme cold, among others. A number of tests are useful to help with diagnosis, including electrocardiograms , blood tests, and coronary angiography. An ECG may confirm an ST elevation MI if ST elevation is present. Commonly used blood tests include troponin and less often creatine kinase MB.\nAspirin is an appropriate immediate treatment for a suspected MI. Nitroglycerin or opioids may be used to help with chest pain; however, they do not improve overall outcomes. Supplemental oxygen should be used in those with low oxygen levels or shortness of breath. In ST elevation MIs treatments which attempt to restore blood flow to the heart are typically recommended and include angioplasty, where the arteries are pushed open, or thrombolysis, where the blockage is removed using medications. People who have a non-ST elevation myocardial infarction  are often managed with the blood thinner heparin, with the additional use angioplasty in those at high risk. In people with blockages of multiple coronary arteries and diabetes, bypass surgery  may be recommended rather than angioplasty. After an MI, lifestyle modifications, along with long term treatment with aspirin, beta blockers, and statins, are typically recommended.\nWorldwide, more than 3 million people have ST elevation MIs and 4 million have NSTEMIs each year. STEMIs occur about twice as often in men as women. About one million people have an MI each year in the United States. In the developed world the risk of death in those who have had an STEMI is about 10%. Rates of MI for a given age have decreased globally between 1990 and 2010.\n\n", "title": "Heart attack"}