{"summary": "Heat is the opposite of cold.", "full_text": "In physics, heat is energy that is in a process of transfer between a system and its surroundings, other than as work or with the transfer of matter. In thermodynamics, finer detail of the process is unknowable. When there is a suitable physical pathway, heat flows from a hotter to a colder body. The pathway can be direct, as in conduction and radiation, or indirect, as in convective circulation.\nOriginally, quantity of heat transferred was measured by how much it changed the states of participating bodies, for example, as amount of ice melted, or change in temperature, without work or matter transfer. This is possible because many bodies, over most temperature ranges, expand reversibly on being heated. This is called thermal expansion.\nAfter the first and second laws of thermodynamics were established, it came to be regarded by physicists as more rational to define quantity of heat transferred in terms of equivalent work. Thus the concept of temperature was reserved for definition in terms of the second law, segregated from the statement of the first law.\nKinetic theory explains heat as a macroscopic manifestation of the motions and interactions of microscopic constituents such as molecules and photons.\nIn calorimetry, sensible heat is defined with respect to a specific chosen state variable of the system, such as pressure or volume. Sensible heat transfer causes change of temperature of the system while leaving the chosen state variable unchanged. Heat transfer that occurs with the system at constant temperature and that does change that particular state variable is called latent heat with respect to that variable. For infinitesimal changes, the total incremental heat transfer is then the sum of the latent and sensible heat increments. This is a basic paradigm for thermodynamics, and was important in the historical development of the subject.\nThe quantity of energy transferred as heat is a scalar expressed in an energy unit such as the joule  , with a sign that is customarily positive when a transfer adds to the energy of a system.", "title": "Heat"}