{"summary": "The Hebrew language is a Semitic language.", "full_text": "Hebrew  is a West Semitic language of the Afroasiatic language family. Historically, it is regarded as the language of the Israelites and their ancestors, although the language was not referred to by the name Hebrew in the Tanakh. The earliest examples of written Paleo-Hebrew date from the 10th century BCE. Today, Hebrew is spoken by a total of 9 million people worldwide.\nHebrew had ceased to be an everyday spoken language somewhere between 200 and 400 CE, declining since the aftermath of the Bar Kokhba revolt. Aramaic and to a lesser extent Greek were already in use as international languages, especially among elites and immigrants. It survived into the medieval period as the language of Jewish liturgy, rabbinic literature, intra-Jewish commerce, and poetry. Then, in the 19th century, it was revived as a spoken and literary language, and, according to Ethnologue, had become, as of 1998, the language of 5 million people worldwide. The United States has the second largest Hebrew speaking population, with 220,000 fluent speakers, mostly from Israel.\nModern Hebrew is one of the two official languages of Israel , while premodern Hebrew is used for prayer or study in Jewish communities around the world today. Ancient Hebrew is also the liturgical tongue of the Samaritans, while modern Hebrew or Arabic is their vernacular. As a foreign language, it is studied mostly by Jews and students of Judaism and Israel, and by archaeologists and linguists specializing in the Middle East and its civilizations, as well as by theologians in Christian seminaries.\nThe Torah , and most of the rest of the Hebrew Bible, is written in Biblical Hebrew, with much of its present form specifically in the dialect that scholars believe flourished around the 6th century BCE, around the time of the Babylonian captivity. For this reason, Hebrew has been referred to by Jews as Leshon Hakodesh , \"the Holy Language\", since ancient times.", "title": "Hebrew language"}