{"summary": "Helsinki  is the capital city of Finland.", "full_text": "Helsinki  is the capital and largest city of Finland. It is in the region of Uusimaa, in southern Finland, on the shore of the Gulf of Finland, an arm of the Baltic Sea. Helsinki has a population of 626,305, an urban population of 1.2 million , and a metropolitan population of 1.4 million, making it the most populous municipality and urban area in Finland. Helsinki is located some 80 kilometres  north of Tallinn, Estonia, 400 kilometres  north east of Stockholm, Sweden, and 388 kilometres  west of Saint Petersburg, Russia. Helsinki has close historical connections with these three cities.\nThe Helsinki metropolitan area includes the urban core of Helsinki, Espoo, Vantaa, Kauniainen, and surrounding commuter towns. It is the world's northernmost metro area of over one million people, and the city is the northernmost capital of an EU member state. The Helsinki metropolitan area is the fourth largest Nordic metropolitan area after the metropolitan areas of Copenhagen, Stockholm, and Oslo, and the City of Helsinki is the third biggest Nordic city after Stockholm and Oslo.\nHelsinki is Finland's major political, educational, financial, cultural, and research center as well as one of northern Europe's major cities. Approximately 75% of foreign companies operating in Finland have settled in the Helsinki region. The nearby municipality of Vantaa is the location of Helsinki Airport, with frequent service to various destinations in Europe and Asia.\nIn 2009, Helsinki was chosen to be the World Design Capital for 2012 by the International Council of Societies of Industrial Design, narrowly beating Eindhoven for the title. The city was the venue for the XV Olympic Games 1952 and the 52nd Eurovision Song Contest 2007.\nIn 2011, the Monocle magazine ranked Helsinki the most liveable city in the world in its \"Liveable Cities Index 2011\". In the Economist Intelligence Unit's August 2015 Liveability survey, assessing the best and worst cities to live in globally, Helsinki placed among the world's top ten cities.", "title": "Helsinki"}