{"summary": "Henry Clay, Sr.", "full_text": "Henry Clay, Sr.  was an American lawyer, politician, and skilled orator who represented Kentucky in both the United States Senate and House of Representatives. He served three non-consecutive terms as Speaker of the House of Representatives and was also Secretary of State from 1825 to 1829. He lost his campaigns for president in 1824, 1832 and 1844.\nClay was a very dominant figure in both the First and Second Party systems. As a leading war hawk in 1812, he favored war with Britain and played a significant role in leading the nation to war in the War of 1812. In 1824 he ran for president and lost, but maneuvered House voting in favor of John Quincy Adams, who made him secretary of state as the Jacksonians denounced what they considered a \"corrupt bargain.\" He ran and lost again in 1832 and 1844 as the candidate of the Whig Party, which he founded and usually dominated. Clay was the foremost proponent of the American System, fighting for an increase in tariffs to foster industry in the United States, the use of federal funding to build and maintain infrastructure, and a strong national bank. He opposed the annexation of Texas, fearing it would inject the slavery issue into politics. Clay also opposed the Mexican-American War and the \"Manifest Destiny\" policy of Democrats, which cost him votes in the close Election of 1844. Dubbed the \"Great Pacificator,\" Clay brokered important compromises during the Nullification Crisis and on the slavery issue. As part of the \"Great Triumvirate\" or \"Immortal Trio,\" along with his colleagues Daniel Webster and John C. Calhoun, he was instrumental in formulating the Missouri Compromise of 1820 and the Compromise of 1850. He was viewed as the primary representative of Western interests in this group, and was given the names \"Henry of the West\" and \"The Western Star.\" Being a plantation owner, Clay held slaves during his lifetime, but freed them in his will.\nAbraham Lincoln, the Whig leader in Illinois, was a great admirer of Clay, saying he was \"my ideal of a great man.\" Lincoln wholeheartedly supported Clay's economic programs. In 1957, a Senate Committee selected Clay as one of the five greatest U.S. Senators, along with Daniel Webster, John C. Calhoun, Robert La Follette, and Robert A. Taft.", "title": "Henry Clay"}