{"summary": "Henry VI  was King of England upon the death of Henry V on 31 August 1422 to 1461 and then from 1470 to 21 May 1471. He was also the King of France from 1422 to 1453.", "full_text": "Henry VI  was King of England from 1422 to 1461 and again from 1470 to 1471, and disputed King of France from 1422 to 1453. The only child of Henry V, he succeeded to the English throne upon his father's death at the age of nine months, and succeeded to the French throne on the death of his grandfather Charles VI shortly afterwards. Henry inherited a long running conflict in France, known as the Hundred Years' War, where Charles VII contested his claim to the French throne. Henry married Charles' niece, Margaret of Anjou, partially in the hope of achieving peace in 1445, but the policy failed, leading to the murder of William de la Pole, one of Henry's key advisors. The war recommenced, with France taking the upper hand; by 1453, Calais was Henry's only remaining territory on the continent.\nHenry experienced a mental breakdown after the failure of the war, with Richard of York taking control of the government as regent until his recovery the following year. Civil war broke out in 1460, leading to a long period of dynastic conflict known as the Wars of the Roses. Henry was taken prisoner by Richard of York at Northampton on 10 July 1460 but was rescued that December by forces loyal to Margaret. He was deposed on 29 March 1461 following the victory at Towton by Richard's son, who took the throne as Edward IV. Henry was suffering from another breakdown and, despite Margaret continuing to lead a resistance to Edward, he was captured by his forces in 1465 and imprisoned in the Tower of London. Richard Neville, the Earl of Warwick, restored Henry to the throne in 1470, but Edward defeated Neville and retook power in 1471, imprisoning Henry in the Tower once again.\nHenry died in the Tower during the night of 21 May 1471, possibly killed on the orders of Edward. He was buried at Chertsey Abbey, before being moved to Windsor Castle in 1484. Miracles were attributed to Henry after his death, and he was informally regarded as a saint and martyr until the 16th century. He left a legacy of educational institutions, having founded Eton College, King's College, Cambridge and All Souls College, Oxford. William Shakespeare wrote a trilogy of plays about his life, depicting him as weak-willed and easily influenced by his wife, Margaret.", "title": "Henry VI of England"}