{"summary": "Hertfordshire is a county in England.", "full_text": "Hertfordshire  is a county in southern England, bordered by Bedfordshire to the north, Cambridgeshire to the north-east, Essex to the east, Buckinghamshire to the west and Greater London to the south.\nFour towns have between 50,000 and 100,000 residents: Hemel Hempstead, Stevenage, Watford and St Albans. The county town, Hertford, once the main market town for the medieval agricultural county ranks 13th in population today deriving its name from a hart  and a ford used as the components of the county's coat of arms and flag. Elevations are high for the region in the north and west. These reach over 240m in the western projection around Tring which is in the Chilterns. The county's borders are approximately the watersheds of the Colne and Lea, which flow southwards each accompanied by a canal. Hertfordshire is at the edge of the London Basin and most of its undeveloped land is agricultural and protected as Metropolitan Green Belt. The volume of intact medieval and Tudor buildings surpasses London, in places in well-preserved conservation areas, especially in St Albans which includes some remains of Verulamium, the town where in the third century AD an early recorded British martyrdom took place. Saint Alban, a Romano-British soldier, took the place of a Christian priest and was beheaded on Holywell Hill. His martyr's cross of a yellow saltire on a blue background is reflected in the flag and coat of arms of Hertfordshire.\nThe county's landmarks span many centuries, ranging from the six 'Hills', next to the New Town of Stevenage built by inhabitants during the Roman Britain centuries, to Leavesden Film Studios. Leavesden filmed much of the UK-based $7.7 Bn box office Harry Potter film series and has the country's studio tour. The largest sector of the economy of the county is services and it has a large proportion of residents who are City of London commuters. Ten railway lines and three motorways pass through or reach into the county.\nIn 2013, the county had a population of 1,140,700 living in an area of 634 square miles .\n^ \"Resident Population\". Hertfordshire Local Information System. Retrieved 10 February 2015. \n^ \"Area Measurements\". Hertfordshire Local Information System. Retrieved 10 February 2015.", "title": "Hertfordshire"}