{"summary": "Brian P.", "full_text": "The High-Z Supernova Search Team was an international cosmology collaboration which used Type Ia supernovae to chart the expansion of the universe. The team was formed in 1994 by Brian P. Schmidt, then a post-doctoral research associate at Harvard University, and Nicholas B. Suntzeff, a staff astronomer at the Cerro Tololo Inter-American Observatory  in Chile. The original team first proposed for the research on September 29, 1994 in a proposal called A Pilot Project to Search for Distant Type Ia Supernova to the CTIO Inter-American Observatory. The original team as co-listed on the first observing proposal was: Nicholas Suntzeff ; Brian Schmidt ;  R. Chris Smith, Robert Schommer, Mark M. Phillips, Mario Hamuy, Roberto Aviles, Jose Maza, Adam Riess, Robert Kirshner, Jason Spiromilio, and Bruno Leibundgut. The original project was awarded four nights of telescope time on the CTIO Victor M. Blanco Telescope on the nights of February 25, 1995, and March 6, 24, and 29, 1995. The pilot project led to the discovery of supernova SN1995Y. In 1995, the HZT elected Brian P. Schmidt of the Mount Stromlo Observatory which is part of the Australian National University to manage the team.\nThe team expanded to roughly 20 astronomers located in the United States, Europe, Australia, and Chile. They used the Victor M. Blanco telescope to discover Type Ia supernovae out to redshifts of z = 0.9. The discoveries were verified with spectra taken mostly from the telescopes of the Keck Observatory, and the European Southern Observatory.\nIn a 1998 study led by Adam Riess, the High-Z Team became the first to publish evidence that the expansion of the Universe is accelerating . The team later spawned Project ESSENCE led by Christopher Stubbs of Harvard University and the Higher-Z Team led by Adam Riess of Johns Hopkins University and Space Telescope Science Institute.\nIn 2011, Riess and Schmidt, along with Saul Perlmutter of the Supernova Cosmology Project, were awarded the Nobel Prize in Physics for this work.", "title": "High-z Supernova Search Team"}