{"summary": "Hilda Solis  was the United States Secretary of Labor.", "full_text": "Hilda Lucia Solis  is an American politician and a member of the Los Angeles County Board of Supervisors for District 1. Solis previously served as the 25th United States Secretary of Labor from 2009 to 2013, as part of the administration of President Barack Obama. She is a member of the Democratic Party and served in the United States House of Representatives from 2001 to 2009, representing the 31st and 32nd congressional districts of California that include East Los Angeles and the San Gabriel Valley.\nSolis was raised in La Puente, California, by immigrant parents from Nicaragua and Mexico. She gained degrees from the California State Polytechnic University, Pomona and the University of Southern California and worked for two federal agencies in Washington, D.C. Returning to her native state, she was elected to the Rio Hondo Community College Board of Trustees in 1985, the California State Assembly in 1992, and the California State Senate in 1994. She was the first Hispanic woman to serve in the State Senate, and was reelected there in 1998. Solis sought to pass environmental justice legislation. She was the first female recipient of the John F. Kennedy Profile in Courage Award in 2000.\nSolis defeated a long-time Democratic incumbent as part of getting elected to the U.S. House of Representatives in 2000, where she focused mainly on labor causes and environmental work. She was reelected easily to four subsequent terms. In December 2008, President-elect Barack Obama announced his intention to nominate Solis as the next U.S. Secretary of Labor. She took office after being confirmed by the United States Senate in February 2009, becoming the first Hispanic woman to serve in the U.S. Cabinet. There she focused on workplace safety issues and on strengthening compliance with wage and hour laws. In January 2013, Solis stepped down from her post as Labor Secretary.\nReturning to the area of her upbringing, in April 2014 Solis formally announced a campaign for a seat on the non-partisan Los Angeles County Board of Supervisors. Solis won the seat outright in a June 3 election and was sworn in on December 1.", "title": "Hilda Solis"}