{"summary": "Hillary Diane Rodham Clinton  is an American politician.", "full_text": "Hillary Diane Rodham Clinton  is an American politician who served as the 67th United States Secretary of State under President Barack Obama from 2009 to 2013. She is the wife of the 42nd President of the United States Bill Clinton, and was First Lady of the United States during his tenure from 1993 to 2001. Clinton subsequently served as a United States Senator from New York from 2001 to 2009, and is a candidate for President of the United States in the 2016 presidential election.\nA native of Chicago, Illinois, Hillary Rodham graduated from Wellesley College in 1969, where she became the first student commencement speaker. She went on to earn her J.D. from Yale Law School in 1973. After a stint as a Congressional legal counsel, she moved to Arkansas, marrying Bill Clinton in 1975. She co-founded Arkansas Advocates for Children and Families in 1977, became the first female chair of the Legal Services Corporation in 1978, and was named the first female partner at Rose Law Firm in 1979. While First Lady of Arkansas from 1979 to 1981, and 1983 to 1992, she led a task force that reformed Arkansas' education system, and served on the board of directors of Wal-Mart, among other corporations. In 1988 and 1991, The National Law Journal listed her as one of the \"100 Most Influential Lawyers in America\".\nAs First Lady of the United States, her major initiative, the Clinton health care plan of 1993, failed to reach a vote in Congress. In 1997 and 1999, she played a leading role in advocating the creation of the State Children's Health Insurance Program, the Adoption and Safe Families Act and the Foster Care Independence Act. The only First Lady to have been subpoenaed, she testified before a federal grand jury in 1996 regarding the Whitewater controversy, although no charges against her related to this or other investigations during her husband's presidency were ever brought. Her marriage to the president was subject to considerable public discussion following the Lewinsky scandal of 1998, and overall her role as First Lady drew a polarized response from the American public.\nAfter moving to New York, Clinton was elected in 2000 as the first female senator from the state, the first and so far only First Lady ever to have sought elected office. Following the September 11 attacks, she voted for and supported military action in Afghanistan and the Iraq Resolution, but subsequently objected to the George W. Bush administration's conduct of the Iraq War, as well as most of Bush's domestic policies. Clinton was re-elected to the Senate in 2006. Running for the Democratic nomination in the 2008 presidential election, Clinton won more primaries and delegates than any other female candidate in American history, but ultimately lost the nomination to Barack Obama.\nAs Secretary of State in the Obama administration from January 2009 to February 2013, Clinton was at the forefront of the U.S. response to the Arab Spring and advocated the U.S. military intervention in Libya. She took responsibility for security lapses related to the 2012 Benghazi attack, which resulted in the deaths of American consulate personnel, but defended her personal actions in regard to the matter. Clinton visited more countries than any other Secretary of State. She viewed \"smart power\" as the strategy for asserting U.S. leadership and values, by combining military power with diplomacy and American capabilities in economics, technology, and other areas. She encouraged empowerment of women everywhere and used social media to communicate the U.S. message abroad. Leaving office at the end of Obama's first term, she authored her fifth book and undertook speaking engagements before announcing her second run for the Democratic nomination in the 2016 presidential election in April 2015.", "title": "Hillary Clinton"}