{"summary": "Hillel Slovak  was an Israeli musician.", "full_text": "Hillel Slovak  was an Israel-born American musician best known as the original guitarist and founding member of the Los Angeles rock band Red Hot Chili Peppers. Prior to his death of a heroin overdose in 1988, Slovak recorded two albums with the band, Freaky Styley  and The Uplift Mofo Party Plan . His guitar work was primarily rooted in funk and hard rock, although he often experimented with other genres including reggae and speed metal. He is considered to have been a major influence on the Red Hot Chili Peppers' early sound.\nBorn in Haifa, Israel, Slovak immigrated with his family to the United States in 1967 when he was five years old. Slovak met future band mates Anthony Kiedis, Flea, and Jack Irons while attending high school in Los Angeles. He joined the group Anthym along with Irons while attending Fairfax High School; Flea would later join the group, which later changed its name to What Is This?. Slovak, Flea, Kiedis, and Irons started Red Hot Chili Peppers in 1982, which became popular in the Los Angeles area, playing various shows around the city. However, Slovak quit the band to focus on What is This?, which had gotten a record deal, leaving the Red Hot Chili Peppers to record their debut album without him. He rejoined the Chili Peppers in 1985, and recorded the albums Freaky Styley and The Uplift Mofo Party Plan with the band.\nDuring his career, Slovak developed a serious heroin addiction. He attempted to quit the drug many times, but ultimately succumbed to his addiction, dying of an overdose on June 25, 1988 at age 26. He was replaced by guitarist John Frusciante, who was greatly influenced by Slovak's playing style. Several Red Hot Chili Peppers songs have been written as tributes to Slovak, including \"Knock Me Down\" and \"My Lovely Man\". In 1999, his brother James Slovak published a book entitled Behind the Sun: The Diary and Art of Hillel Slovak, which features Slovak's diaries and paintings. Slovak was inducted into the Rock and Roll Hall of Fame as a member of the Red Hot Chili Peppers on April 14, 2012, with his brother accepting on his behalf.", "title": "Hillel Slovak"}