{"summary": "The history of the Earth describes the most important events and fundamental stages in the development of the planet Earth from its formation to the present day.", "full_text": "The history of Earth concerns the development of the planet Earth from its formation to the present day. Nearly all branches of natural science have contributed to the understanding of the main events of the Earth's past. The age of Earth is approximately one-third of the age of the universe. An immense amount of geological change has occurred in that timespan, along then with biological change.\nEarth formed around 4.54 billion years ago by accretion from the solar nebula. Volcanic outgassing probably created the primordial atmosphere then the ocean, but the atmosphere contained almost no oxygen so would have been toxic to most modern life including humans. Much of the Earth was molten because of frequent collisions with other bodies which led to extreme volcanism. One very large collision is thought to have been responsible for forming the Moon. Over time, the Earth cooled, causing the formation of a solid crust, and allowing liquid water to exist on the surface.\nThe first life forms appeared between 3.8 and 3.5 billion years ago. The earliest evidences for life on Earth are graphite found to be biogenic in 3.7-billion-year-old metasedimentary rocks discovered in Western Greenland and microbial mat fossils found in 3.48-billion-year-old sandstone discovered in Western Australia. Photosynthetic life appeared around 2 billion years ago, enriching the atmosphere with oxygen. Life remained mostly small and microscopic until about 580 million years ago, when complex multicellular life arose. During the Cambrian period it experienced a rapid diversification into most major phyla. More than 99 percent of all species, amounting to over five billion species, that ever lived on Earth are estimated to be extinct. Estimates on the number of Earth's current species range from 10 million to 14 million, of which about 1.2 million have been documented and over 86 percent have not yet been described.\nGeological change has been constantly occurring on Earth since the time of its formation and biological change since the first appearance of life. Species continuously evolve, taking on new forms, splitting into daughter species, or going extinct in response to an ever-changing planet. The process of plate tectonics has played a major role in the shaping of Earth's oceans and continents, as well as the life they harbor. The biosphere, in turn, has had a significant effect on the atmosphere and other abiotic conditions on the Earth, such as the formation of the ozone layer, the proliferation of oxygen, and the creation of soil.", "title": "History of the Earth"}