{"summary": "This is a list of political parties in Germany.", "full_text": "As a consequence of the defeat of Nazi Germany in World War II, Germany was split between the two global blocs in the East and West, a period known as the division of Germany. Germany was stripped of its war gains and lost territories in the east to Poland and the Soviet Union. Seven million prisoners and forced laborers left Germany, most of whom died either during their emigration of starvation, due to harsh conditions, or because they were worked to death. Over 10 million German-speaking refugees arrived in Germany from other countries in Central and Eastern Europe. Many German POWs became forced laborers to provide restitution to the countries Germany had devastated in the war and some industrial equipment was removed as reparations.\nThe Cold War divided Germany between the Allies in the west and Soviets in the east. Germans had little voice in government until 1949 when two states emerged; the Federal Republic of Germany  was a parliamentary democracy with a capitalist economic system and free churches and labour unions. The other new state was the smaller German Democratic Republic , a Marxist-Leninist dictatorship with its leadership dominated by the Soviet-aligned Socialist Unity Party of Germany  in order to retain it within the Soviet sphere of influence.\nAfter experiencing its Wirtschaftswunder or \"economic miracle\" in 1955, West Germany became the most prosperous economy in Europe. Under Chancellor Konrad Adenauer, West Germany built strong relationships with France, the United States, and Israel. West Germany also joined the North Atlantic Treaty Organisation and what would later become the European Union. East Germany stagnated as its economy was largely organised to meet the needs of the Soviet Union; the secret police  tightly controlled daily life, and the Berlin Wall  ended the steady flow of refugees to the west. Germany was reunited in 1990, following the decline and fall of the SED as the ruling party of the GDR.", "title": "History of Germany since 1945"}