{"summary": "A hospital is a place where a person goes to be healed when he or she is sick or injured.", "full_text": "A hospital is a health care institution providing patient treatment with specialized staff and equipment. The best-known type of hospital is the general hospital, which has an emergency department. A district hospital typically is the major health care facility in its region, with large numbers of beds for intensive care and long-term care. Specialised hospitals include trauma centres, rehabilitation hospitals, children's hospitals, seniors'  hospitals, and hospitals for dealing with specific medical needs such as psychiatric problems  and certain disease categories. Specialised hospitals can help reduce health care costs compared to general hospitals. A teaching hospital combines assistance to people with teaching to medical students and nurses. The medical facility smaller than a hospital is generally called a clinic. Hospitals have a range of departments  and specialist units such as cardiology. Some hospitals have outpatient departments and some have chronic treatment units. Common support units include a pharmacy, pathology, and radiology.\nHospitals are usually funded by the public sector, by health organisations , by health insurance companies, or by charities, including direct charitable donations. Historically, hospitals were often founded and funded by religious orders or charitable individuals and leaders. Today, hospitals are largely staffed by professional physicians, surgeons, and nurses, whereas in the past, this work was usually performed by the founding religious orders or by volunteers. However, there are various Catholic religious orders, such as the Alexians and the Bon Secours Sisters that still focus on hospital ministry today, as well as several other Christian denominations, including the Methodists and Lutherans, which run hospitals. In accordance with the original meaning of the word, hospitals were originally \"places of hospitality\", and this meaning is still preserved in the names of some institutions such as the Royal Hospital Chelsea, established in 1681 as a retirement and nursing home for veteran soldiers.", "title": "Hospital"}