{"summary": "Konstantin Ustinovich Chernenko  was the leader of the Soviet Union for a short time.", "full_text": "Hu Yaobang  was a high-ranking official of the People's Republic of China. He achieved his most senior status within the Communist Party of China from 1981 to 1987, first as Party chairman from 1981 to 1982, then as General Secretary of the Communist Party from 1982 to 1987. Hu joined the Chinese Communist Party in the 1930s, and rose to prominence as a comrade of Deng Xiaoping. During the Cultural Revolution , Hu was purged, recalled, and purged again, following the political career of Deng.\nAfter Deng rose to power, following the death of Mao Zedong, Deng promoted Hu to a series of high political positions. Throughout the 1980s Hu pursued a series of economic and political reforms under the direction of Deng. Hu's political and economic reforms made him the enemy of several powerful Party elders, who opposed free market reforms and attempts to make China's government more transparent. When widespread student protests occurred across China in 1987, Hu's political opponents successfully blamed Hu for the disruptions, claiming that Hu's \"laxness\" and \"bourgeois liberalization\" had either led to, or worsened, the protests. Hu was forced to resign as Party general secretary, but was allowed to retain a seat in the Politburo.\nHu's position as Party general secretary was taken by Zhao Ziyang, who continued many of Hu's economic and political reforms. A day after Hu's death, in 1989, a small-scale demonstration commemorated him and demanded that the government reassess his legacy. A week later, the day before Hu's funeral, some 100,000 students marched on Tiananmen Square, leading to the Tiananmen Square protests of 1989. Following the government's suppression of the 1989 protests, the Chinese government censored the details of Hu's life inside mainland China, but it officially rehabilitated his image and lifted its censorship restrictions on the 90th anniversary of Hu's birth, in 2005.", "title": "Hu Yaobang"}