{"summary": "Homophobia is the fear or poor treatment of homosexuals.", "full_text": "Human rights are moral principles or norms, that describe certain standards of human behavior, and are regularly protected as legal rights in municipal and international law. They are commonly understood as inalienable fundamental rights \"to which a person is inherently entitled simply because she or he is a human being,\" and which are \"inherent in all human beings\" regardless of their nation, location, language, religion, ethnic origin or any other status. They are applicable everywhere and at every time in the sense of being universal, and they are egalitarian in the sense of being the same for everyone. They require empathy and the rule of law and impose an obligation on persons to respect the human rights of others. They should not be taken away except as a result of due process based on specific circumstances; for example, human rights may include freedom from unlawful imprisonment, torture, and execution.\nThe doctrine of human rights has been highly influential within international law, global and regional institutions. Actions by states and non-governmental organizations form a basis of public policy worldwide. The idea of human rights suggests that \"if the public discourse of peacetime global society can be said to have a common moral language, it is that of human rights.\" The strong claims made by the doctrine of human rights continue to provoke considerable skepticism and debates about the content, nature and justifications of human rights to this day. The precise meaning of the term right is controversial and is the subject of continued philosophical debate; while there is consensus that human rights encompasses a wide variety of rights such as the right to a fair trial, protection against enslavement, prohibition of genocide, free speech, or a right to education, there is disagreement about which of these particular rights should be included within the general framework of human rights; some thinkers suggest that human rights should be a minimum requirement to avoid the worst-case abuses, while others see it as a higher standard.\nMany of the basic ideas that animated the human rights movement developed in the aftermath of the Second World War and the atrocities of The Holocaust, culminating in the adoption of the Universal Declaration of Human Rights in Paris by the United Nations General Assembly in 1948. Ancient peoples did not have the same modern-day conception of universal human rights. The true forerunner of human rights discourse was the concept of natural rights which appeared as part of the medieval natural law tradition that became prominent during the Enlightenment with such philosophers as John Locke, Francis Hutcheson, and Jean-Jacques Burlamaqui, and which featured prominently in the political discourse of the American Revolution and the French Revolution. From this foundation, the modern human rights arguments emerged over the latter half of the twentieth century, possibly as a reaction to slavery, torture, genocide, and war crimes, as a realization of inherent human vulnerability and as being a precondition for the possibility of a just society.\n\nWhereas recognition of the inherent dignity and of the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world...\n\nAll human beings are born free and equal in dignity and rights.", "title": "Human rights violation"}