{"summary": "Hydrogen sulfide  is the chemical compound with the formula H2S, is a colorless, toxic, flammable gas that is responsible for the foul smell of rotten eggs and flatulence.", "full_text": "Hydrogen sulfide is the chemical compound with the formula H\n2S. It is a colorless gas with the characteristic foul odor of rotten eggs; it is heavier than air, very poisonous, corrosive, flammable, and explosive.\nHydrogen sulfide often results from the bacterial breakdown of organic matter in the absence of oxygen gas, such as in swamps and sewers; this process is commonly known as anaerobic digestion. H\n2S also occurs in volcanic gases, natural gas, and in some sources of well water. It is also present in natural halite type rock salts, most notably in Himalayan Black Salt, which is mostly harvested from the mineral-rich \"Salt Range\" mountains of Pakistan. The human body produces small amounts of H\n2S and uses it as a signaling molecule.\nDissolved in water, hydrogen sulfide is known as hydrosulfuric acid or sulfhydric acid, a weak acid.\nSwedish chemist Carl Wilhelm Scheele is credited with having discovered hydrogen sulfide in 1777.\nThe British English spelling of this compound is hydrogen sulphide, but this spelling is not recommended by the International Union of Pure and Applied Chemistry or the Royal Society of Chemistry.\nIn 2015, hydrogen sulfide under extremely high pressure  was found to undergo superconducting transition near 203K , the highest temperature superconductor known to date.\n^ \"Hydrogen Sulfide - PubChem Public Chemical Database\". The PubChem Project. USA: National Center for Biotechnology Information. \n^ Perrin, D.D., Ionisation Constants of Inorganic Acids and Bases in Aqueous Solution, 2nd Ed., Pergamon Press: Oxford, 1982.\n^ Bruckenstein, S.; Kolthoff, I.M., in Kolthoff, I.M.; Elving, P.J. Treatise on Analytical Chemistry, Vol. 1, pt. 1; Wiley, NY, 1959, pp. 432-433.\n^ Pradyot Patnaik. Handbook of Inorganic Chemicals. McGraw-Hill, 2002, ISBN 0-07-049439-8\n^ a b Zumdahl, Steven S. . Chemical Principles 6th Ed. Houghton Mifflin Company. p. A23. ISBN 0-618-94690-X. \n^ http://msds.chem.ox.ac.uk/HY/hydrogen_sulfide.html\n^ a b c \"NIOSH Pocket Guide to Chemical Hazards #0337\". National Institute for Occupational Safety and Health . \n^ a b \"Hydrogen sulfide\". Immediately Dangerous to Life and Health. National Institute for Occupational Safety and Health . \n^ \"Hydrogen sulfide\". npi.gov.au. \n^ Cartlidge, Edwin . \"Superconductivity record sparks wave of follow-up physics\". Nature News. Retrieved 18 August 2015.", "title": "Hydrogen sulfide"}