{"summary": "Fracking, or hydraulic fracturing, is forcing fractures in a rock layer, by fluid that is put under pressure.", "full_text": "Hydraulic fracturing  is a well-stimulation technique in which rock is fractured by a pressurized liquid. The process involves the high-pressure injection of 'fracking fluid'  into a wellbore to create cracks in the deep-rock formations through which natural gas, petroleum, and brine will flow more freely. When the hydraulic pressure is removed from the well, small grains of hydraulic fracturing proppants  hold the fractures open.\nHydraulic fracturing began as an experiment in 1947, and the first commercially successful application followed in 1950. As of 2012, 2.5 million \"frac jobs\" had been performed worldwide on oil and gas wells; over one million of those within the U.S. Such treatment is generally necessary to achieve adequate flow rates in shale gas, tight gas, tight oil, and coal seam gas wells. Some hydraulic fractures can form naturally in certain veins or dikes.\nHydraulic fracturing is highly controversial in many countries. Its proponents advocate the economic benefits of more extensively accessible hydrocarbons. However, opponents argue that these are out-weighed by the potential environmental impacts, which include risks of ground and surface water contamination, air and noise pollution, and potentially triggering earthquakes, along with the consequential hazards to public health and the environment.\nIncreases in seismic activity following hydraulic fracturing along dormant or previously unknown faults are sometimes caused by the deep-injection disposal of hydraulic fracturing flowback , and produced formation brine . For these reasons, hydraulic fracturing is under international scrutiny, restricted in some countries, and banned altogether in others. Some countries have banned the practice or put moratoria in place, while others have adopted an approach involving tight regulation. The European Union is drafting regulations that would permit controlled application of hydraulic fracturing.", "title": "Hydraulic fracturing"}