{"summary": "Ian Lancaster Fleming  was a British author and journalist.", "full_text": "Ian Lancaster Fleming  was an English author, journalist and naval intelligence officer, best known for his James Bond series of spy novels. Fleming came from a wealthy family connected to the merchant bank Robert Fleming & Co., and his father was the Member of Parliament for Henley from 1910 until his death on the Western Front in 1917. Educated at Eton, Sandhurst and, briefly, the universities of Munich and Geneva, Fleming moved through several jobs before he started writing.\nWhile working for Britain's Naval Intelligence Division during the Second World War, Fleming was involved in planning Operation Goldeneye and in the planning and oversight of two intelligence units, 30 Assault Unit and T-Force. His wartime service and his career as a journalist provided much of the background, detail and depth of the James Bond novels.\nFleming wrote his first Bond novel, Casino Royale, in 1952. It was a success, with three print runs being commissioned to cope with the demand. Eleven Bond novels and two short-story collections followed between 1953 and 1966. The novels revolved around James Bond, an officer in the Secret Intelligence Service, commonly known as MI6. Bond was also known by his code number, 007, and was a commander in the Royal Naval Reserve. The Bond stories rank among the best-selling series of fictional books of all time, having sold over 100 million copies worldwide. Fleming also wrote the children's story Chitty-Chitty-Bang-Bang and two works of non-fiction. In 2008, The Times ranked Fleming 14th on its list of \"The 50 greatest British writers since 1945\".\nFleming was married to Ann Charteris, who was divorced from the second Viscount Rothermere owing to her affair with the author. Fleming and Charteris had a son, Caspar. Fleming was a heavy smoker and drinker for most of his life and succumbed to heart disease in 1964 aged 56. Two of his James Bond books were published posthumously; other writers have since produced Bond novels. Fleming's creation has appeared in film twenty-six times, portrayed by seven actors.", "title": "Ian Fleming"}