{"summary": "1991  was a common year starting on Tuesday of the Gregorian calendar.", "full_text": "Igor Vladimirovich Talkov , was a Russian rock singer-songwriter.\nHe is often compared to another Russian singer and songwriter of that time, Viktor Tsoi, whom, according to his diaries, Talkov highly appreciated and to whom he even dedicated a song on his death. Talkov's songs also have much in common - particularly from a lyrical perspective - with Russian bard music.\nIgor Talkov was born in Gretsovka, Tula Oblast, Soviet Union. While he is mostly remembered for songs about love and fate, most of his work held a clearly political message against the Soviet regime, desperately calling for a change. This is one of the reasons why Talkov was never popular with the Soviet government; even as a performer renowned and loved throughout the whole Soviet Union, he lived in a small two-room apartment with his wife and son, even composing his masterful lyrics and music \"on top of the washing machine in the bathroom\", according to the rumours. Curiously enough, he was not satisfied with Perestroika, claiming it to be nothing but the same regime under a different guise. In his post-Perestroika songs, he openly mocked the changes, calling them a ruse. Talkov was an avid reader of pre-revolutionary Russian history, which served as the inspiration for many of his songs. He even guaranteed at his last concert that he was willing to \"back up\" his lyrics with historical facts.\nTalkov also made a brief presence in post-Soviet cinema, acting in the films Za posledney chertoy  and Knyaz Serebryanniy . The latter film he disliked, apologizing to a preview audience for participating in the film. Since Talkov refused to complete post-production sound on the film, Talkov's character was voiced by another actor.\nHe was fatally shot backstage at the Yubileiny concert hall in Leningrad; the next day was declared a national tragedy throughout the whole Soviet Union. His funeral was a televised, nationwide event, where his casket was carried by some of the most prominent members of Russian stage to its burial. It is not uncommon to meet people in former Soviet countries who still dedicate October 6 to the honour of Igor Talkov.\nWhile Valeriy Schlyafman, Talkov's one time manager, was found guilty of the murder by a Russian court, he fled through Ukraine to Israel before he could be arrested. He remains in Israel to this day, insisting he is not guilty of the crime while Israel refuses to extradite him. Schlyafman and his supporters have claimed that the KGB orchestrated the murder.\nTalkov is interred in the Vagankovskoye Cemetery in Moscow.\nIn 1999 he was honoured with his image portrayed on a Russian postage stamp. There is an Igor Talkov Museum in Moscow.", "title": "Igor Talkov"}