{"summary": "Ike Turner  was an American singer, songwriter and recording artist.", "full_text": "Izear Luster \"Ike\" Turner, Jr.  was an American musician, bandleader, songwriter, arranger, talent scout, and record producer. An early pioneer of fifties rock and roll, he is most popularly known for his work in the 1960s and 1970s with his then-wife Tina Turner in the Ike & Tina Turner Revue.\nTurner began playing piano and guitar when he was eight, forming his group, the Kings of Rhythm, as a teenager. He employed the group as his backing band for the rest of his life. His first recording, \"Rocket 88\", credited to \"Jackie Brenston and his Delta Cats\", in 1951 is considered a contender for \"first rock and roll song\". Relocating to St. Louis, Missouri, in 1954, he built the Kings into one of the most renowned acts on the local club circuit. There he met singer Anna Mae Bullock, whom he renamed Tina Turner, forming The Ike & Tina Turner Revue, which over the course of the sixties became a soul/rock crossover success.\nTurner recorded for many of the key R&B record labels of the 1950s and 1960s, including Chess, Modern, Trumpet, Flair and Sue. With the Ike & Tina Turner Revue, he graduated to larger labels Blue Thumb and United Artists. Throughout his career Turner won two Grammy Awards and was nominated for three others. With his former wife, Turner was inducted into the Rock and Roll Hall of Fame in 1991 and in 2001 was inducted into the St. Louis Walk of Fame.\nAllegations by Tina Turner of abuse by Ike, published in her autobiography I, Tina and included in the film adaptation of the book, coupled with his cocaine addiction, damaged Ike Turner's career in the 1980s and 1990s. Addicted to cocaine and crack for at least 15 years, Turner was convicted of drug offenses, serving seventeen months in prison between July 1989 and 1991. He spent the rest of the 1990s free of his addiction but relapsed in 2004. Near the end of his life, he returned to live performance as a front man and, returning to his blues roots, produced two albums that were critically well received and award-winning. Turner has frequently been referred to as a 'great innovator' of Rock and Roll by contemporaries such as Little Richard and Johnny Otis. Phil Alexander  described Turner as 'the cornerstone of modernday rock 'n' roll'.", "title": "Ike Turner"}