{"summary": "Illinois is a state in the United States.", "full_text": "Illinois  is a state in the Midwestern United States. It is the 5th most populous state and 25th largest state in terms of land area, and is often noted as a microcosm of the entire country. With Chicago in the northeast, small industrial cities and great agricultural productivity in central and northern Illinois, and natural resources like coal, timber, and petroleum in the south, Illinois has a diverse economic base and is a major transportation hub. The Port of Chicago connects the state to other global ports from the Great Lakes, via the Saint Lawrence Seaway, to the Atlantic Ocean, as well as the Great Lakes to the Mississippi River, via the Illinois River. For decades, O'Hare International Airport has been ranked as one of the world's busiest airports. Illinois has long had a reputation as a bellwether both in social and cultural terms and politics.\nAlthough today the state's largest population center is around Chicago in the northern part of the state, the state's European population grew first in the west, with French Canadians who settled along the Mississippi River, and gave the area the name, Illinois. After the American Revolutionary War established the United States, American settlers began arriving from Kentucky in the 1810s via the Ohio River, and the population grew from south to north. In 1818, Illinois achieved statehood. After construction of the Erie Canal increased traffic and trade through the Great Lakes, Chicago was founded in the 1830s on the banks of the Chicago River, at one of the few natural harbors on southern Lake Michigan. John Deere's invention of the self-scouring steel plow turned Illinois' rich prairie into some of the world's most productive and valuable farmlands, attracting immigrant farmers from Germany and Sweden. Railroads carried immigrants to new homes, as well as being used to ship their commodity crops out to markets.\nBy 1900, the growth of industrial jobs in the northern cities and coal mining in the central and southern areas attracted immigrants from Eastern and Southern Europe. Illinois was an important manufacturing center during both world wars. The Great Migration from the South established a large community of African Americans in Chicago, who created the city's famous jazz and blues cultures.\nThree U.S. presidents have been elected while living in Illinois: Abraham Lincoln, Ulysses S. Grant, and Barack Obama. Additionally, Ronald Reagan, whose political career was based in California, was the only U.S. president born and raised in Illinois. Today, Illinois honors Lincoln with its official state slogan, Land of Lincoln, which has been displayed on its license plates since 1954. The Abraham Lincoln Presidential Library and Museum is located in the state capital of Springfield.\n\n^ \"  State Designations Act.\". Illinois Compiled Statutes. Springfield, Illinois: Illinois General Assembly. September 4, 1991. Retrieved April 10, 2009. Sec. 20. Official language. The official language of the State of Illinois is English. \n^ \n^ \"Charles\". NGS data sheet. U.S. National Geodetic Survey. Retrieved October 20, 2011. \n^ a b \"Elevations and Distances in the United States\". United States Geological Survey. 2001. Retrieved October 21, 2011. \n^ a b Elevation adjusted to North American Vertical Datum of 1988.\n^ a b Ohlemacher, Stephen . \"Analysis ranks Illinois most average state\". Carbondale, Illinois: The Southern Illinoisan. Associated Press. Retrieved April 10, 2009. \n^ \"Chicago's Front Door: Chicago Harbor.\" A digital exhibit published online by the Chicago Public Library. . Retrieved October 20, 2007. Archived September 9, 2013 at the Wayback Machine\n^ \"Jazz\". Encyclopedia of Chicago. Retrieved May 19, 2012. \n^ \"Blues\". Encyclopedia of Chicago. Retrieved May 19, 2012. \n^ \"The History of Illinois License Plates\". Cyberdriveillinois.com. Retrieved February 15, 2012. \n^ \"Slogan\". Museum.state.il.us. Retrieved February 7, 2011.", "title": "Illinois"}