{"summary": "Immanuel Kant  was a German philosopher.", "full_text": "Immanuel Kant  was a German philosopher who is considered the central figure of modern philosophy. Kant argued that fundamental concepts of the human mind structure human experience, that reason is the source of morality, that aesthetics arises from a faculty of disinterested judgment, that space and time are forms of our understanding, and that the world as it is \"in-itself\" is unknowable. Kant took himself to have effected a Copernican revolution in philosophy, akin to Copernicus' reversal of the age-old belief that the sun revolved around the earth. His beliefs continue to have a major influence on contemporary philosophy, especially the fields of metaphysics, epistemology, ethics, political theory, and aesthetics.\nKant in his critical phase sought to 'reverse' the orientation of pre-critical philosophy by showing how the traditional problems of metaphysics can be overcome by supposing that the agreement between reality and the concepts we use to conceive it arises not because our mental concepts have come to passively mirror reality, but because reality must conform to the human mind's active concepts to be conceivable and at all possible for us to experience. Kant thus regarded the basic categories of the human mind as the transcendental \"condition of possibility\" for any experience.\nPolitically, Kant was one of the earliest exponents of the idea that perpetual peace could be secured through universal democracy and international cooperation. He believed that this eventually will be the outcome of universal history, although it is not rationally planned. The exact nature of Kant's religious ideas continue to be the subject of especially heated philosophical dispute, with viewpoints ranging from the idea that Kant was an early and radical exponent of atheism who finally exploded the ontological argument for God's existence, to more critical treatments epitomized by Nietzsche who claimed that Kant had \"theologian blood\" and that Kant was merely a sophisticated apologist for traditional Christian religious belief, writing that \"Kant wanted to prove, in a way that would dumbfound the common man, that the common man was right: that was the secret joke of this soul.\"\nIn Kant's major work, the Critique of Pure Reason , he attempted to explain the relationship between reason and human experience and to move beyond the failures of traditional philosophy and metaphysics. Kant wanted to put an end to an era of futile and speculative theories of human experience, while resisting the skepticism of thinkers such as David Hume. Kant regarded himself as ending and showing the way beyond the impasse which modern philosophy had led to between rationalists and empiricists, and is widely held to have synthesized these two early modern traditions in his thought.\nKant argued that our experiences are structured by necessary features of our minds. In his view, the mind shapes and structures experience so that, on an abstract level, all human experience shares certain essential structural features. Among other things, Kant believed that the concepts of space and time are integral to all human experience, as are our concepts of cause and effect. One important consequence of this view is that our experience of things is always of the phenomenal world as conveyed by our senses: we do not have direct access to things in themselves, the so-called noumenal world. Kant published other important works on ethics, religion, law, aesthetics, astronomy, and history. These included the Critique of Practical Reason , the Metaphysics of Morals , which dealt with ethics, and the Critique of Judgment , which looks at aesthetics and teleology.\nKant aimed to resolve disputes between empirical and rationalist approaches. The former asserted that all knowledge comes through experience; the latter maintained that reason and innate ideas were prior. Kant argued that experience is purely subjective without first being processed by pure reason. He also said that using reason without applying it to experience only leads to theoretical illusions. The free and proper exercise of reason by the individual was a theme both of the Age of Enlightenment, and of Kant's approaches to the various problems of philosophy. His ideas influenced many thinkers in Germany during his lifetime, and he moved philosophy beyond the debate between the rationalists and empiricists.", "title": "Immanuel Kant"}