{"summary": "Immunization is a way of preventing a person from getting a disease.", "full_text": "Immunization, or immunisation, is the process by which an individual's immune system becomes fortified against an agent .\nWhen this system is exposed to molecules that are foreign to the body, called non-self, it will orchestrate an immune response, and it will also develop the ability to quickly respond to a subsequent encounter because of immunological memory. This is a function of the adaptive immune system. Therefore, by exposing an animal to an immunogen in a controlled way, its body can learn to protect itself: this is called active immunization.\nThe most important elements of the immune system that are improved by immunization are the T cells, B cells, and the antibodies B cells produce. Memory B cells and memory T cells are responsible for a swift response to a second encounter with a foreign molecule. Passive immunization is direct introduction of these elements into the body, instead of production of these elements by the body itself.\nImmunization is done through various techniques, most commonly vaccination. Vaccines against microorganisms that cause diseases can prepare the body's immune system, thus helping to fight or prevent an infection. The fact that mutations can cause cancer cells to produce proteins or other molecules that are known to the body forms the theoretical basis for therapeutic cancer vaccines. Other molecules can be used for immunization as well, for example in experimental vaccines against nicotine  or the hormone ghrelin in experiments to create an obesity vaccine.\nImmunizations are definitely less risky and an easier way to become immune to a particular disease than risking a milder form of the disease itself. They are important for both adults and children in that they can protect us from the many diseases out there. Through the use of immunizations, some infections and diseases have almost completely been eradicated throughout the United States and the World. One example is polio. Thanks to dedicated health care professionals and the parents of children who vaccinated on schedule, polio has been eliminated in the U.S. since 1979. Polio is still found in other parts of the world so certain people could still be at risk of getting it. This includes those people who have never had the vaccine, those who didn't receive all doses of the vaccine, or those traveling to areas of the world where polio is still prevalent.\nActive immunization/vaccination has been named one of the \"Ten Great Public Health Achievements in the 20th Century\".", "title": "Immunization"}