{"summary": "The Intergovernmental Panel on Climate Change  is a group of scientists chosen by governments and other large groups from around the world who study the chance that humans may make the Earth heat up unnaturally.", "full_text": "The Intergovernmental Panel on Climate Change  is a scientific intergovernmental body under the auspices of the United Nations, set up at the request of member governments. It was first established in 1988 by two United Nations organizations, the World Meteorological Organization  and the United Nations Environment Programme , and later endorsed by the United Nations General Assembly through Resolution 43/53. Membership of the IPCC is open to all members of the WMO and UNEP. The IPCC produces reports that support the United Nations Framework Convention on Climate Change , which is the main international treaty on climate change. The ultimate objective of the UNFCCC is to \"stabilize greenhouse gas concentrations in the atmosphere at a level that would prevent dangerous anthropogenic  interference with the climate system\". IPCC reports cover \"the scientific, technical and socio-economic information relevant to understanding the scientific basis of risk of human-induced climate change, its potential impacts and options for adaptation and mitigation.\"\nThe IPCC does not carry out its own original research, nor does it do the work of monitoring climate or related phenomena itself. The IPCC bases its assessment on the published literature, which includes peer-reviewed and non-peer-reviewed sources.\nThousands of scientists and other experts contribute  to writing and reviewing reports, which are then reviewed by governments. IPCC reports contain a \"Summary for Policymakers\", which is subject to line-by-line approval by delegates from all participating governments. Typically this involves the governments of more than 120 countries.\nThe IPCC provides an internationally accepted authority on climate change, producing reports which have the agreement of leading climate scientists and the consensus of participating governments. The 2007 Nobel Peace Prize was shared, in two equal parts, between the IPCC and Al Gore.", "title": "Intergovernmental Panel on Climate Change"}