{"summary": "Intel Corporation  is a microprocessor company that was set up in the 1960s.", "full_text": "Intel Corporation  is an American multinational technology company headquartered in Santa Clara, California. Intel is one of the world's largest and highest valued semiconductor chip makers, based on revenue. It is the inventor of the x86 series of microprocessors, the processors found in most personal computers. Intel supports processors for computer companies such as HP and Dell.\nIntel Corporation was founded on July 18, 1968. Intel also makes motherboard chipsets, network interface controllers and integrated circuits, flash memory, graphics chips, embedded processors and other devices related to communications and computing. Founded by semiconductor pioneers Robert Noyce and Gordon Moore and widely associated with the executive leadership and vision of Andrew Grove, Intel combines advanced chip design capability with a leading-edge manufacturing capability. Though Intel was originally known primarily to engineers and technologists, its \"Intel Inside\" advertising campaign of the 1990s made it a household name, along with its Pentium processors.\nIntel was an early developer of SRAM and DRAM memory chips, and this represented the majority of its business until 1981. Although Intel created the world's first commercial microprocessor chip in 1971, it was not until the success of the personal computer  that this became its primary business. During the 1990s, Intel invested heavily in new microprocessor designs fostering the rapid growth of the computer industry. During this period Intel became the dominant supplier of microprocessors for PCs, and was known for aggressive and sometimes illegal tactics in defense of its market position, particularly against Advanced Micro Devices , as well as a struggle with Microsoft for control over the direction of the PC industry.\nThe 2013 rankings of the world's 100 most valuable brands published by Millward Brown Optimor showed the company's brand value at number 61.\nIntel has also begun research into electrical transmission and generation. Intel has recently introduced a 3-D transistor that improves performance and energy efficiency. Intel has begun mass-producing this 3-D transistor, named the Tri-Gate transistor, with their 22 nm process, which is currently used in their 3rd generation core processors initially released on April 29, 2012. In 2011, SpectraWatt Inc., a solar cell spinoff of Intel, filed for bankruptcy under Chapter 11. In June 2013, Intel unveiled its fourth generation of Intel Core processors  in an event named Computex in Taipei.\nThe Open Source Technology Center at Intel hosts PowerTOP and LatencyTOP, and supports other open-source projects such as Wayland, Intel Array Building Blocks, Threading Building Blocks , and Xen.\nIntel is a portmanteau of the words integrated and electronics. The fact that \"intel\" is the term for intelligence information also made the name appropriate.", "title": "Intel"}