{"summary": "November is the eleventh and penultimate  month of the year in the Gregorian calendar, coming between October and December.", "full_text": "International Men's Day  is an annual international event celebrated on 19 November. Inaugurated in 1992 on 7 February by Prof Thomas Oaster, the project was re-initialised in 1999 in Trinidad and Tobago. The longest running celebration of International men's day is Malta, where events have occurred since 7 February 1994.\nInternational Men's Day finds support from a variety of individuals and groups in Australia, the Caribbean, North America, Asia, Europe and Africa. Speaking on behalf of UNESCO, Director of Women and Culture of Peace Ingeborg Breines said of IMD, \"This is an excellent idea and would give some gender balance.\" She added that UNESCO was looking forward to cooperating with the organizers.\nThe objectives of celebrating an International Men's Day include focusing on men's and boys' health, improving gender relations, promoting gender equality, and highlighting positive male role models. It is an occasion to highlight discrimination against men and boys and to celebrate their achievements and contributions, in particular for their contributions to community, family, marriage, and child care. The broader and ultimate aim of the event is to promote basic humanitarian values.\nInternational Men's Day is celebrated in over 70 countries, including Antigua and Barbuda, Australia, Austria, Bosnia and Herzegovina, Botswana, Burundi, Canada, the Cayman Islands, China, Croatia, Cuba, Denmark, France, Ghana, Grenada, Hungary, India, Ireland, Italy, Isle of Man, Jamaica, Malta, Nigeria, Norway, Pakistan, Romania, Saint Kitts and Nevis, Saint Lucia, Seychelles, Singapore, South Africa, Tanzania, Trinidad and Tobago, Ukraine, the United Kingdom, the United States, and Zimbabwe, on 19 November, and global support for the celebration is broad. International Men's Day followed by Universal Children's Day on 20 November form a 48-hour celebration of men and children respectively.", "title": "International Men's Day"}