{"summary": "The Fields Medal is a prize given to two, three, or four people who study math who are not over 40 years of age at each International Congress of the International Mathematical Union, a meeting that takes place every four years.", "full_text": "The International Mathematical Union  is an international non-governmental organisation devoted to international cooperation in the field of mathematics across the world. It is a member of the International Council for Science  and supports the International Congress of Mathematicians. Its members are national mathematics organizations from more than 80 countries.\nThe objectives of the International Mathematical Union  are to promote international cooperation in mathematics. By supporting and assisting the International Congress of Mathematicians  and other international scientific meetings/conferences. To acknowledge outstanding research contributions to mathematics, through the awarding of scientific prizes and to encourage and support other international mathematical activities, considered likely to contribute to the development of mathematical science in any of its aspects, whether pure, applied, or educational.\nThe IMU was established in 1920, but dissolved in September 1932 and then re-established 1950 de facto at the Constitutive Convention in New York, de jure on September 10, 1951, when ten countries had become members. The last milestone was the General Assembly in March 1952, in Rome, Italy where the activities of the new IMU were inaugurated and the first Executive Committee, President and various commissions where elected. In 1952 the IMU was also readmitted to the ICSU. The past president of the Union is Ingrid Daubechies . The current president is Shigefumi Mori who is the first head of the group from Asia.\nAt the 16th meeting of the IMU General Assembly in Bangalore, India, in August 2010, Berlin was chosen as the location of the permanent office of the IMU, which was opened on January 1, 2011, and is hosted by the Weierstrass Institute for Applied Analysis and Stochastics , an institute of the Gottfried Wilhelm Leibniz Scientific Community, with about 120 scientists engaging in mathematical research applied to complex problems in industry and commerce.", "title": "International Mathematical Union"}