{"summary": "The International Statistical Classification of Diseases and Related Health Problems  is a list of codes that classify diseases and medical problems.", "full_text": "The International Statistical Classification of Diseases and Related Health Problems, usually called by the short-form name International Classification of Diseases , is the international \"standard diagnostic tool for epidemiology, health management and clinical purposes\". The ICD is maintained by the World Health Organization , the directing and coordinating authority for health within the United Nations System. The ICD is designed as a health care classification system, providing a system of diagnostic codes for classifying diseases, including nuanced classifications of a wide variety of signs, symptoms, abnormal findings, complaints, social circumstances, and external causes of injury or disease. This system is designed to map health conditions to corresponding generic categories together with specific variations, assigning for these a designated code, up to six characters long. Thus, major categories are designed to include a set of similar diseases.\nThe ICD is published by the WHO and used worldwide for morbidity and mortality statistics, reimbursement systems, and automated decision support in health care. This system is designed to promote international comparability in the collection, processing, classification, and presentation of these statistics. As in the case of the analogous  Diagnostic and Statistical Manual of Mental Disorders , the ICD is a major project to statistically classify health disorders, and provide diagnostic assistance. The ICD is a core statistically based classificatory diagnostic system for health care related issues of the WHO Family of International Classifications .\nThe ICD is revised periodically and is currently in its tenth revision. The ICD-10, as it is therefore known, was developed in 1992 to track health statistics. ICD-11 was planned for 2017, but has been pushed up to 2018. As of 2007, development plans included using Web 2.0 principles to support detailed revision. Annual minor updates and triennial major updates are published by the WHO. The ICD is part of a \"family\" of guides that can be used to complement each other, including also the International Classification of Functioning, Disability and Health which focuses on the domains of functioning  associated with health conditions, from both medical and social perspectives.", "title": "International Statistical Classification of Diseases and Related Health Problems"}