{"summary": "INXS were an Australian rock band.", "full_text": "INXS  were an Australian rock band, formed as The Farriss Brothers in 1977 in Sydney, New South Wales. They began playing covers in Western Australian pubs and clubs, occasionally playing some of their original music. Mainstays were main composer and keyboardist Andrew Farriss, drummer Jon Farriss, guitarists Tim Farriss and Kirk Pengilly, bassist Garry Gary Beers and main lyricist and vocalist Michael Hutchence. For twenty years, INXS was fronted by Hutchence, whose \"sultry good looks\" and magnetic stage presence made him the focal point of the band. Initially known for their new wave/pop style, the band later developed a harder pub rock style that included funk and dance elements.\nIn 1980, INXS first charted in their native Australia with their debut self-titled album, but later garnered moderate success in other countries with Shabooh Shoobah and a single, \"The One Thing\". Though The Swing brought more success from around the world, its single \"Original Sin\" was even greater commercially, becoming their first number-one single. They would later achieve international success with a series of hit recordings through later in the 1980s and the 1990s, including the albums Listen Like Thieves, Kick, and X, and the singles \"What You Need\", \"Need You Tonight\", \"Devil Inside\", \"New Sensation\", and \"Suicide Blonde\".\nIn the 1990s, INXS achieved a greater fan following through Hutchence's romance with fellow Australian singer Kylie Minogue, and achieved greater acclaim in the United Kingdom. However, starting with Welcome to Wherever You Are, in 1992, they achieved less success in the United States. After Hutchence was found dead in his hotel suite in Sydney in November 1997, the band did not perform publicly for a year. They made appearances with several guest singers, including Jimmy Barnes, Terence Trent D'Arby and Jon Stevens; Stevens formally joined the band for a tour and recording session in 2002. In 2005, members of INXS participated in Rock Star: INXS, a reality television series broadcast worldwide, culminating in the selection of their new lead singer, Canadian J.D. Fortune. With Fortune, the band released \"Pretty Vegas\" and \"Afterglow\" as singles, and the album Switch.\nIn late 2010, the band recorded and released Original Sin, a tribute album, featuring guest artists such as Kavyen Temperley  and Ben Harper. In September 2011, the band announced that Irish singer-songwriter Ciaran Gribbin had replaced Fortune as their lead vocalist ahead of a planned tour of South America, Australia and Europe later in the year. On November 11, 2012, during their performance as support act to Matchbox Twenty at Perth Arena, Australia, INXS announced that the performance would be their last, though they did not officially announce a permanent band retirement.\nINXS won six Australian Recording Industry Association  awards including three for 'Best Group' in 1987, 1989 and 1992, and was inducted into the ARIA Hall of Fame in 2001. As of June 2015, INXS has sold over 45 million records worldwide.", "title": "INXS"}