{"summary": "2001  was a common year starting on Monday of the Gregorian calendar.", "full_text": "The Iraq disarmament crisis was one of primary issues that led to the multinational invasion of Iraq on 20 March 2003. Since the 1980s, Iraq was widely assumed to have been producing and extensively running the programs of biological, chemical and nuclear weapons. During the heights of Iran-Iraq War, Iraq had used its offensive chemical program against Iran and Kurdish civilians, also in the 1980s. With the French and Soviet assistance given to Iraqi nuclear program, its primary facility was secretly destroyed by Israel in 1981.\nAfter the Gulf War in 1990, the United Nations located and destroyed large quantities of Iraqi chemical weapons and related equipment and materials with varying degrees of Iraqi cooperation and obstruction, but the Iraqi cooperation later diminished in 1998. The disarmament issue remained tense throughout the 1990s with U.S. at the UN, repeatedly demanding Iraq to allow inspections teams to its facilities. Finally, this disarmament crises reached to its climax in 2002-2003, when U.S. President George W. Bush demanded a complete end to what he alleged was Iraqi production of weapons of mass destruction, and reasoned with Iraqi President Saddam Hussein to comply with UN Resolutions requiring UN weapons inspectors unfettered access to areas those inspectors thought might have weapons production facilities.\nSince the Gulf War in 1991, Iraq had been restricted by the United Nations  from developing or possessing such weapons. It was also required to permit inspections to confirm Iraqi compliance. Bush repeatedly backed demands for unfettered inspection and disarmament with threats of invasion. In 20 March 2003, an multinational alliance containing the armed forces of the United States and United Kingdom launched an invasion of Iraq in 2003. After the war ending in 2011, a number of failed Iraqi peace initiatives were revealed.\n^ Cleminson, Ronald. What Happened to Saddam's Weapons of Mass Destruction? Arms Control Association. September 2003", "title": "Iraq disarmament crisis"}