{"summary": "Alabaster is a city and southern suburb of Birmingham in Shelby County, Alabama, United States.", "full_text": "Isaac Shelby  was the first and fifth Governor of the U.S. state of Kentucky and served in the state legislatures of Virginia and North Carolina. He was also a soldier in Lord Dunmore's War, the Revolutionary War, and the War of 1812. While governor, he personally led the Kentucky militia in the Battle of the Thames, an action that was rewarded with a Congressional Gold Medal. Counties in nine states, and several cities and military bases, have been named in his honor. His fondness for John Dickinson's The Liberty Song is believed to be the reason Kentucky adopted the state motto \"United we stand, divided we fall\".\nShelby's military service began when he served as second-in-command to his father at the Battle of Point Pleasant, the only major battle of Lord Dunmore's War. He gained the reputation of an expert woodsman and surveyor, and spent the early part of the Revolutionary War gathering supplies for the Continental Army. Later in the war, he and John Sevier led expeditions over the Appalachian Mountains against the British forces in North Carolina. He played a pivotal role in the British defeat at the Battle of King's Mountain. For his service, he was presented with a ceremonial sword and a pair of pistols by the North Carolina legislature, and the nickname \"Old King's Mountain\" followed him the rest of his life.\nFollowing the war, Shelby relocated to Kentucky on lands awarded to him for his military service and became involved in Kentucky's transition from a county of Virginia to an independent state. His heroism made him popular with the citizens of the state, and the state electoral college unanimously elected him governor in 1792. He secured the state from Indian attacks and organized its first government. He leveraged the Citizen Genet affair to convince the Washington administration to make an agreement with the Spanish for free trade on the Mississippi River.\nAt the end of his gubernatorial term, Shelby retired from public life, but he was called back into politics by the impending War of 1812. Kentuckians urged Shelby to run for governor again and lead them through the anticipated conflict. He was elected easily, and at the request of General William Henry Harrison, commanded troops from Kentucky at the Battle of the Thames. At the conclusion of the war, he declined President James Monroe's offer to become Secretary of War. In his last act of public service, he and Andrew Jackson acted as commissioners to negotiate the Jackson Purchase from the Chickasaw Indian tribe. Shelby died at his estate in Lincoln County, Kentucky, on July 18, 1826.", "title": "Isaac Shelby"}