{"summary": "Islam  is a monotheistic religion articulated by the Qur'an, considered by its adherents  to be the verbatim word of God, also by the teachings and normative example of Muhammad, considered by them to be the last prophet of God.", "full_text": "Islam  is a monotheistic and Abrahamic religion based upon the Qur'an, a religious text considered by its adherents to be the verbatim word of God , and, for the vast majority of adherents, by the teachings and normative example  of Muhammad , considered by most of them to be the last prophet of God. An adherent of Islam is called a Muslim .\nMuslims believe that God is one and incomparable and that the purpose of existence is to worship God. Muslims also believe that Islam is the complete and universal version of a primordial faith that was revealed many times before through prophets including Adam, Noah, Abraham, Moses, and Jesus. Although a large majority of Muslims do maintain that the previous messages and revelations have been partially misinterpreted over time, they are nevertheless all obliged, according to the Qur'an, to treat the older scriptures with the utmost respect. As for the Qur'an, Muslims consider it to be both the unaltered and the final revelation of God. Religious concepts and practices include the five pillars of Islam, which are basic concepts and obligatory acts of worship, and following Islamic law, which touches on virtually every aspect of life and society, providing guidance on multifarious topics from banking and welfare, to family life and the environment.\nThe expansion of the Islamic Empire in the years following Prophet Muhammed's death led to the creation of caliphates, occupying a vast geographical area and conversion to Islam was boosted by missionary activities. These early caliphates, coupled with Muslim economics and trading and the later expansion of the Ottoman Empire, resulted in Islam's spread outwards from Mecca towards both the Atlantic and Pacific Oceans and the creation of the Muslim world.\nMost Muslims are of two denominations: Sunni  or Shia . About 13% of Muslims live in Indonesia, the largest Muslim-majority country, 25% in South Asia, 20% in the Middle East, and 15% in Sub-Saharan Africa. Sizable Muslim communities are also found in Europe, China, Russia, and the Americas. Converts and immigrant communities are found in almost every part of the world. With about 1.62 billion followers or 23% of the global population, Islam is the second-largest religion by number of adherents and, according to many sources, the fastest-growing major religion in the world.", "title": "Islam"}