{"summary": "Islamabad  is the Federal capital city of Pakistan, and is in the Pothohar Plateau in the northwest of the country.", "full_text": "Islamabad  is the capital city of Pakistan located within the Islamabad Capital Territory. It has a population of 2 million and together with its neighboring twin city of Rawalpindi, the greater Islamabad-Rawalpindi metropolitan area is the third largest in Pakistan with a population of over 4.5 million inhabitants.\nSince its foundation, Islamabad has attracted people from all over Pakistan, making it one of the most cosmopolitan and urbanized cities of Pakistan. As the national capital, Islamabad is the seat of the Government of Pakistan; the Presidential Palace  is located here. Islamabad is also home to the Pakistan Monument, which is one of the two national monuments of Pakistan. Islamabad hosts a large number of foreign diplomats, politicians and government employees. The Capital Development Authority is responsible for managing the public works within the city.\nIslamabad is located in the Pothohar Plateau in the northeastern part of the country, within the Islamabad Capital Territory. The region has historically been a part of the crossroads of Punjab and Khyber Pakhtunkhwa with the Margalla Pass acting as the gateway between the two regions. The city was built during the 1960s to replace Karachi as Pakistan's capital. Islamabad is a well-organised international city divided into several different sectors and zones. It is regarded as the most developed city in Pakistan and is ranked as a Gamma+ world city.\nThe city is home to the Faisal Mosque, the largest mosque in South Asia and the fourth largest mosque in the world. Islamabad has one of the highest literacy rates in Pakistan. There are 16 recognized universities in Islamabad, including Air University , Quaid-i-Azam University and the National University of Sciences and Technology. Allama Iqbal Open University in Islamabad is one of the world's largest universities by enrollment.", "title": "Islamabad"}