{"summary": "October 4 is the 277th day of the year  in the Gregorian calendar.", "full_text": "Israeli Jews , also known as Jewish Israelis, refers to Israeli citizens or residents who are Jews, and also the descendants of Israeli-Jewish emigrants outside of Israel.\nIsraeli Jews are found mostly in Israel and the Western world, as well as other countries worldwide, not necessarily only in Jewish communities. Israeli Jews mostly speak Hebrew and most follow at least some religious Jewish practices. Israel, the Jewish state, currently has almost half the world's Jews.\nThe Jewish community in Israel is composed from all Jewish ethnic divisions, including Ashkenazi Jews, Sephardi Jews, Mizrahi Jews, Beta Israel, Bene Israel, Yemeni Jews, Karaites, and many other groups. The Israeli Jewish community manifests a wide range of Jewish cultural traditions, as well as encompassing the full spectrum of religious observance, from the Haredi communities to the Hilonim Jewish communities who live a secular lifestyle. The population consists of many ethnic groups. The majority of Israeli Jews are Mizrahi Jews, with 61% of Israeli Jews having Mizrahi Jewish ancestry as of 2005.\nDespite the ongoing debate over the question of who is a Jew among Israeli Jews, the Jewish status of a person, which is considered a matter of 'nationality' by the Israeli authorities, is registered and controlled by the Israeli Ministry of the Interior, which requires a person to meet the halakhic definition to be registered as a 'Jew'. Israel's Central Bureau of Statistics estimated the Israeli Jewish population was 6,300,000 as of September 2015 .\nAn IDI Guttman Study of 2008 shows that a plurality of Israeli Jews  identify themselves first as Jews and Israeli second, and that only 39% consider themselves first and foremost Israeli.\nJews living in the region prior to the establishment of the State of Israel were commonly referred to in English as \"Palestinian Jews\" and in Hebrew as HaYishuv HaYehudi Be'Eretz Yisra'el .", "title": "Israeli Jews"}