{"summary": "The Israel Academy of Sciences and Humanities is the supreme institution for Sciences and humanities in Israel, located in Jerusalem.", "full_text": "Israel Academy of Sciences and Humanities, based in Jerusalem, Israel, was established in 1961 by the State of Israel to foster contact between Israeli scholars in the sciences and humanities and create a think tank for advising the government on research projects of national importance. Its members include many of Israel's most distinguished scholars.\nThe offices of the Israel Academy of Sciences and Humanity are located next door to the official residence of the President of Israel and the Council for Higher Education in Israel in Albert Einstein Square in Jerusalem.\nIn the sciences, the Academy funds projects on the geology, flora, and fauna of Israel, and facilitates the participation of Israeli scientists in research at international projects, such as high-energy physics at CERN and synchrotron radiation at the European Synchrotron Radiation Facility. Israel has the highest concentration of scientists and engineers in the world. The academy funds a number of prestigious awards in the sciences including the Alon Prize.\nIn the humanities, research is funded into the study of the Tanakh and Talmud, Jewish history, Jewish philosophy, Jewish art, and the Hebrew language, as well as Hebrew prose and poetry.\nThe Academy administers the Einstein Fellowships fund, which to fosters relations between scientists from around the world and the Israeli academic community, the Israel Science Fund, with an annual budget of $53 million, and a number of research funds based on grants from the Adler Fund for Space Research, the Wolf Foundation, and the Fulks Fund for Medical Research. The Academy also runs the Israel Academic Center in Cairo, which assists Israeli scholars with research into Egypt and Egyptian culture, and facilitates cooperation with Egyptian academics.\nThe Academy has observer status at the European Science Foundation, and runs exchange programs with the British Royal Society, the British Academy, the Swedish Academy, and the National Research Council of Singapore.", "title": "Israel Academy of Sciences and Humanities"}