{"summary": "Italy is a country in Europe and a member of the European Union.", "full_text": "Italy , officially the Italian Republic , is a unitary parliamentary republic in Europe. Italy covers an area of 301,338 km2  and has a largely temperate climate; due to its shape, it is often referred to in Italy as lo Stivale . With 61 million inhabitants, it is the 4th most populous EU member state. Located in the heart of the Mediterranean Sea, Italy shares open land borders with France, Switzerland, Austria, Slovenia, San Marino and Vatican City.\nSince ancient times, Greek, Etruscan, Celtic, and other cultures have thrived on the Italian Peninsula. Rome ultimately emerged as the dominant power, conquering much of the ancient world and becoming the leading cultural, political, and religious centre of Western civilisation. During the Dark Ages, the region suffered sociopolitical collapse amid calamitous barbarian invasions, but by the 11th century, numerous Italian city-states rose to great prosperity through shipping, commerce and banking, and even laid the groundwork for capitalism. The Renaissance led to a flourishing of Italian culture, producing famous scholars, artists, and polymaths such as Leonardo da Vinci, Galileo, Michelangelo and Machiavelli. Italian explorers such as Marco Polo, Christopher Columbus, Amerigo Vespucci, and Giovanni da Verrazzano discovered new routes to the Far East and the New World, helping to usher in the European Age of Discovery. Nevertheless, Italy remained politically fragmented and fell prey to European powers such as France, Spain, and later Austria, subsequently entering a long period of decline that lasted until the mid-19th century.\nAfter various unsuccessful attempts, the second and the third wars for Italian independence resulted in the eventual unification of most of present-day Italy by 1866. From the late 19th century to the early 20th century, the new Kingdom of Italy rapidly industrialised and acquired a colonial empire, becoming a great power. However, southern and rural areas of the country remained largely excluded from industrialisation, fuelling a large and influential diaspora. Despite being one of the main victors in World War I, Italy entered a period of economic crisis and social turmoil, leading the way to the rise of a Fascist dictatorship in 1922. The subsequent participation in World War II on the Axis side ended in military defeat, economic destruction and civil war. In the years that followed, Italy abolished the monarchy, reinstated democracy, and enjoyed a prolonged economic boom, thus becoming one of the world's most developed nations.\nItaly has the third largest economy in the Eurozone and the eighth largest economy in the world. It has a very high level of human development and enjoys the highest life expectancy in the EU. Italy plays a prominent role in global military, cultural and diplomatic affairs and is also considered to be a major regional power in Europe. Italy is a founding and leading member of the European Union and the member of numerous international institutions, including the UN, NATO, the OECD, the OSCE, the WTO, the G7/G8, G20, the Union for the Mediterranean, the Council of Europe, Uniting for Consensus, and many more. As a reflection of its vast cultural wealth, Italy is home to 51 World Heritage Sites, the most in the world, and is one of the most visited countries.", "title": "Italy"}