{"summary": "A nuclear weapon is a weapon that suddenly releases the energy in the nucleus of certain types of atoms.", "full_text": "Ivy King was the largest pure-fission nuclear bomb ever tested by the United States. The bomb was tested during the Truman administration as part of Operation Ivy. This series of tests involved the development of very powerful nuclear weapons in response to the nuclear weapons program of the Soviet Union.\nThe production of Ivy King was hurried to be ready in case its sister project, Ivy Mike, failed in its attempt to achieve a thermonuclear reaction. The Ivy King test actually took place two weeks after Mike. Unlike the Mike bomb, the Ivy King device could theoretically have been added to United States' nuclear arsenal because it was designed to be air-deliverable.\nOn November 16, 1952 at 11:30 local time  a B-36H bomber dropped the bomb over a point 2,000 feet  north of Runit Island in the Enewetak atoll, resulting in a 500 kiloton explosion at 1,480 feet . The tropopause height at the time of the detonation was about 58,000 feet . The top of the King cloud reached about 74,000 feet  with the mushroom base at about 40,000 feet .\nThe Ivy King bomb, designated as a Mk-18 bomb and named the \"Super Oralloy Bomb\", was a modified version of the Mk-6D bomb. Instead of using an implosion system similar to the Mk-6D, it used a 92-point implosion system initially developed for the Mk-13. Its uranium-plutonium core was replaced by 60 kg of highly enriched uranium  fashioned into a thin-walled sphere equivalent to approximately four critical masses. The thin-walled sphere was a commonly used design, which ensured that the fissile material remained sub-critical until imploded. The HEU sphere was then enclosed in a natural-uranium neutron reflector. To physically prevent the HEU sphere collapsing into a critical condition if the surrounding explosives were detonated accidentally, or if the sphere was crushed following an aircraft accident, the hollow center was filled with a chain made from aluminum and boron, which was pulled out to arm the bomb. The boron-coated chain also absorbed the neutrons needed to drive the nuclear reaction.\nThe primary designer of the Super Oralloy Bomb, physicist Ted Taylor, later became a vocal proponent of nuclear disarmament.\n\n", "title": "Ivy King"}