{"summary": "November 30 is the 334th day of the year  in the Gregorian calendar.", "full_text": "Sir Jagadish Chandra Bose, CSI, CIE, FRS  was a polymath, physicist, biologist, biophysicist, botanist, archaeologist, as well as an early writer of science fiction. Living in British controlled India, he pioneered the investigation of radio and microwave optics, made very significant contributions to plant science, and laid the foundations of experimental science in the Indian subcontinent. IEEE named him one of the fathers of radio science. He is considered the father of Bengali science fiction. He also invented the crescograph. A crater on the moon has been named in his honour.\nBorn in Mymensingh, Bengal Presidency during the British Raj, Bose graduated from St. Xavier's College, Calcutta. He then went to the University of London to study medicine, but could not pursue studies in medicine because of health problems. Instead, he conducted his research with the Nobel Laureate Lord Rayleigh at Cambridge and returned to India. He then joined the Presidency College of University of Calcutta as a Professor of Physics. There, despite racial discrimination and a lack of funding and equipment, Bose carried on his scientific research. He made remarkable progress in his research of remote wireless signalling and was the first to use semiconductor junctions to detect radio signals. However, instead of trying to gain commercial benefit from this invention, Bose made his inventions public in order to allow others to further develop his research.\nBose subsequently made a number of pioneering discoveries in plant physiology. He used his own invention, the crescograph, to measure plant response to various stimuli, and thereby scientifically proved parallelism between animal and plant tissues. Although Bose filed for a patent for one of his inventions because of peer pressure, his reluctance to any form of patenting was well known. To facilitate his research, he constructed automatic recorders capable of registering extremely slight movements; these instruments produced some striking results, such as Bose's demonstration of an apparent power of feeling in plants, exemplified by the quivering of injured plants. His books include Response in the Living and Non-Living  and The Nervous Mechanism of Plants .", "title": "Jagadish Chandra Bose"}