{"summary": "James \"Jabby\" Jabara  was the first American pilot to shoot down 5 Mig-15 airplanes in Korea.", "full_text": "James \"Jabby\" Jabara  was the first American  and United States Air Force jet ace in history. Born in Oklahoma, he lived in Kansas where he enlisted as an aviation cadet at Fort Riley after graduating from high school. Jabara attended four flying schools in Texas before he received his pilot's wings and was commissioned as a Second Lieutenant. Jabara flew two tours of combat duty in Europe during World War II as a North American P-51 Mustang pilot, and scored 1.5 air victories against German aircraft.\nJabara flew his first jet aircraft in 1948, the USAF Lockheed F-80 Shooting Star before transitioning to the USAF North American F-86 Sabre. Jabara used this aircraft to shoot down multiple Soviet-built MiG-15 jets during the Korean War. He achieved his first confirmed air victory of the war on 3 April 1951. A month later he scored his fifth and sixth victories, making him the first American jet ace in history. He eventually scored 15 victories, giving him the title of \"triple ace\". Jabara was ranked as the second-highest-scoring U.S. ace of the Korean War. He received the Distinguished Service Cross, Silver Star, Distinguished Flying Cross, Air Medal, and the British Distinguished Flying Cross for his accomplishments in combat.\nJabara next held a series of commands at various Air Force bases across the United States. He flew the Lockheed F-104 Starfighter and later the Convair B-58 Hustler. In 1966, while on leave from service in Vietnam, Colonel Jabara was traveling with his family in two cars to their new home when his daughter crashed the car she was driving and he was riding in, killing them both. They were buried together at Arlington National Cemetery. In recognition of his contributions to military aviation, an airport outside of Wichita, Kansas was named in his honor. Each year the United States Air Force Academy alumni association bestows the Jabara Award upon an Academy graduate whose aerospace accomplishments demonstrate superior performance.", "title": "James Jabara"}