{"summary": "Sir James Chadwick CH FRS,  was an English physicist and Nobel Prize winner who is best known for discovering the neutron.", "full_text": "Sir James Chadwick, CH, FRS  was an English physicist who was awarded the 1935 Nobel Prize in Physics for his discovery of the neutron in 1932. In 1941, he wrote the final draft of the MAUD Report, which inspired the U.S. government to begin serious atomic bomb research efforts. He was the head of the British team that worked on the Manhattan Project during the Second World War. He was knighted in England in 1945 for his achievements in physics.\nChadwick graduated from the Victoria University of Manchester in 1911, where he studied under Ernest Rutherford . At Manchester, he continued to study under Rutherford until he was awarded his MSc in 1913. The same year, Chadwick was awarded an 1851 Research Fellowship from the Royal Commission for the Exhibition of 1851. He elected to study beta radiation under Hans Geiger in Berlin. Using Geiger's recently developed Geiger counter, Chadwick was able to demonstrate that beta radiation produced a continuous spectrum, and not discrete lines as had been thought. Still in Germany when the First World War broke out in Europe, he spent the next four years in the Ruhleben internment camp.\nAfter the war, Chadwick followed Rutherford to the Cavendish Laboratory at the University of Cambridge, where Chadwick earned his Doctor of Philosophy degree under Rutherford's supervision from Gonville and Caius College, Cambridge in June 1921. He was Rutherford's assistant director of research at the Cavendish Laboratory for over a decade at a time when it was one of the world's foremost centres for the study of physics, attracting students like John Cockcroft, Norman Feather, and Mark Oliphant. Chadwick pursued a line of research that led to his discovery of the neutron in 1932, and went on to measure its mass. He anticipated that neutrons would become a major weapon in the fight against cancer. Chadwick left the Cavendish Laboratory in 1935 to become a professor of physics at the University of Liverpool, where he overhauled an antiquated laboratory and, by installing a cyclotron, made it an important centre for the study of nuclear physics.\nDuring the Second World War, Chadwick carried out research as part of the Tube Alloys project to build an atomic bomb, while his Liverpool lab and environs were harassed by Luftwaffe bombing. When the Quebec Agreement merged his project with the American Manhattan Project, he became part of the British Mission, and worked at the Los Alamos Laboratory and in Washington, D.C. He surprised everyone by earning the almost-complete trust of project director Leslie R. Groves, Jr. For his efforts, Chadwick received a knighthood in the New Year Honours on 1 January 1945. In July 1945, he viewed the Trinity nuclear test. After this, he served as the British scientific advisor to the United Nations Atomic Energy Commission. Uncomfortable with the trend toward Big Science, Chadwick became the Master of Gonville and Caius College in 1948. He retired in 1959.", "title": "James Chadwick"}