{"summary": "James Howard Meredith  is an American civil rights movement figure, writer, and political adviser.", "full_text": "James Howard Meredith  is an American Civil Rights Movement figure, writer, political adviser and Air Force veteran. In 1962, he became the first African-American student admitted to the segregated University of Mississippi, after the intervention of the federal government, an event that was a flashpoint in the African American Civil Rights Movement. Inspired by President John F. Kennedy's inaugural address, Meredith decided to exercise his constitutional rights and apply to the University of Mississippi. His goal was to put pressure on the Kennedy administration to enforce civil rights for African Americans.\nIn 1966 Meredith planned a solo 220-mile March Against Fear from Memphis, Tennessee to Jackson, Mississippi; he wanted to highlight continuing racism in the South and encourage voter registration after passage of the Voting Rights Act of 1965. He did not want major civil rights organizations involved. The second day, he was shot by a white gunman and suffered numerous wounds. Leaders of major organizations vowed to complete the march in his name after he was taken to the hospital. While Meredith was recovering, more people from across the country became involved as marchers. He rejoined the march and when Meredith and other leaders entered Jackson on June 26, they were leading an estimated 15,000 marchers, in what was the largest civil rights march in Mississippi. During the course of it, more than 4,000 African Americans had registered to vote, and the march was a catalyst to continued community organizing and additional registration.\nIn 2002 and again in 2012, the University of Mississippi led year-long series of events to celebrate the 40th and 50th anniversaries of Meredith's integration of the institution. He was among numerous speakers invited to the campus, where a statue of him commemorates his role. The Lyceum-The Circle Historic District at the center of the campus has been designated as a National Historic Landmark for these events.\n^ Dave, Paresh . \"James Meredith talks about vandals\". The Los Angeles Times. \n^ a b Bryant 2006, p. 60.", "title": "James Meredith"}