{"summary": "James Monroe  was the fifth President of the United States.", "full_text": "James Monroe  was the fifth President of the United States . Monroe was the last president who was a Founding Father of the United States and the last president from the Virginian dynasty and the Republican Generation. Born in Westmoreland County, Virginia, Monroe was of the planter class and fought in the American Revolutionary War. He was wounded in the Battle of Trenton with a musket ball to his shoulder. After studying law under Thomas Jefferson from 1780 to 1783, he served as a delegate in the Continental Congress. As an anti-federalist delegate to the Virginia convention that considered ratification of the United States Constitution, Monroe opposed ratification, claiming it gave too much power to the central government. He took an active part in the new government, and in 1790 he was elected to the Senate of the first United States Congress, where he joined the Jeffersonians. He gained experience as an executive as the Governor of Virginia and rose to national prominence as a diplomat in France, when he helped negotiate the Louisiana Purchase in 1803. During the War of 1812, Monroe held the critical roles of Secretary of State and the Secretary of War under President James Madison.\nFacing little opposition from the fractured Federalist Party, Monroe was easily elected president in 1816, winning over 80 percent of the electoral vote and becoming the last president during the First Party System era of American politics. As president, he bought Florida from Spain and sought to ease partisan tensions, embarking on a tour of the country that was generally well received. With the ratification of the Treaty of 1818, under the successful diplomacy of his Secretary of State John Quincy Adams, the United States extended from the Atlantic to the Pacific, giving America harbor and fishing rights in the Pacific Northwest. The United States and Britain jointly occupied the Oregon Country. In addition to the acquisition of Florida, the landmark Treaty of 1819 secured the border of the United States along the 42nd Parallel to the Pacific Ocean and represented America's first determined attempt at creating an \"American global empire\". As nationalism surged, partisan fury subsided and the \"Era of Good Feelings\" ensued until the Panic of 1819 struck and dispute over the admission of Missouri embroiled the country in 1820. Nonetheless, Monroe won near-unanimous reelection.\nMonroe supported the founding of colonies in Africa for free African Americans that would eventually form the nation of Liberia, whose capital, Monrovia, is named in his honor. In 1823, he announced the United States' opposition to any European intervention in the recently independent countries of the Americas with the Monroe Doctrine, which became a landmark in American foreign policy. His presidency concluded the first period of American presidential history before the beginning of Jacksonian democracy and the Second Party System era. Following his retirement in 1825, Monroe was plagued by financial difficulties. He died in New York City on July 4, 1831.", "title": "James Monroe"}