{"summary": "Leonard James Callaghan, Baron Callaghan of Cardiff, KG, PC, , was Labour Prime Minister of the United Kingdom from 1976 to 1979. He is the only Prime Minister to have held all four of the Great Offices of State.", "full_text": "Leonard James Callaghan, Baron Callaghan of Cardiff KG PC , often known as Jim Callaghan, was the Prime Minister of the United Kingdom from 1976 to 1979 and Leader of the Labour Party from 1976 to 1980. Callaghan is to date the only politician in history to have served in all four of the \"Great Offices of State\", having been Chancellor of the Exchequer from 1964 to 1967, Home Secretary from 1967 to 1970, and Foreign Secretary from 1974, until his appointment as Prime Minister in 1976.\nCallaghan's period as Chancellor of the Exchequer coincided with a turbulent period for the British economy, during which he had to wrestle with a balance of payments deficit and speculative attacks on the pound sterling . On 18 November 1967, the Government was forced to devalue the pound sterling despite having previously denied that this would be necessary. Callaghan offered to resign over the matter, but instead swapped ministerial positions with Roy Jenkins to become Home Secretary. In that capacity, Callaghan took the decision to use the British Army to support the police in Northern Ireland, after a request from the Northern Ireland Government.\nAfter Labour lost the 1970 election, Callaghan played a key role in the Shadow Cabinet before returning to office as Foreign Secretary in 1974, taking responsibility for renegotiating the terms of Britain's membership of the European Economic Community, and supporting a \"Yes\" vote in the 1975 referendum for the UK to remain in the EEC. When Harold Wilson suddenly resigned as Prime Minister in 1976, Callaghan defeated five other candidates to be elected as his replacement. Labour had already lost its small majority in the House of Commons by the time he became Prime Minister, and further by-elections and defections forced Callaghan to deal with minor parties such as the Liberal Party, particularly in the \"Lib-Lab pact\" from 1977 to 1978. Industrial disputes and widespread strikes in the 1978 \"Winter of Discontent\" made Callaghan's government unpopular, and the defeat of the referendum on devolution for Scotland led to the successful passage of a motion of no confidence on 28 March 1979. This was followed by a defeat in the ensuing general election.\nCallaghan remained Leader of the Labour Party until November 1980, to reform the process by which the Party elected its leader, before returning to the backbenches where he remained until retiring as an MP in 1987. That year he was made a life peer as Baron Callaghan of Cardiff. He died in 2005, one day before his 93rd birthday.", "title": "James Callaghan"}