{"summary": "Japanese American internment happened during World War II when the United States government forced about 110,000 Japanese Americans to leave their homes and live in internment camps.", "full_text": "The internment of Japanese Americans in the United States was the forced relocation and incarceration during World War II of between 110,000 and 120,000 people of Japanese ancestry who lived on the Pacific coast in camps in the interior of the country. Sixty-two percent of the internees were United States citizens. President Roosevelt ordered the Incarceration of Japanese Americans during World War II, shortly after Imperial Japan's attack on Pearl Harbor.\nSuch incarceration was applied unequally due to differing population concentrations and, more importantly, state and regional politics: more than 110,000 Japanese Americans, nearly all who lived on the West Coast, were forced into interior camps, but in Hawaii, where the 150,000-plus Japanese Americans comprised over one-third of the population, only 1,200 to 1,800 were interned. The forced relocation and incarceration has been determined to have resulted more from racism and discrimination among white people on the West Coast, rather than any military danger posed by the Japanese Americans.\nPresident Franklin D. Roosevelt authorized the deportation and incarceration with Executive Order 9066, issued February 19, 1942, which allowed regional military commanders to designate \"military areas\" from which \"any or all persons may be excluded.\" This power was used to declare that all people of Japanese ancestry were excluded from the entire West Coast, including all of California and much of Oregon, Washington and Arizona, except for those in government camps. Approximately 5,000 Japanese Americans voluntarily relocated outside the exclusion zone, and some 5,500 community leaders arrested after Pearl Harbor were already in custody, but the majority of mainland Japanese Americans were evacuated  from their West Coast homes during the spring of 1942. The United States Census Bureau assisted the internment efforts by providing confidential neighborhood information on Japanese Americans. The Bureau denied its role for decades, but this was finally proven in 2007. In 1944, the Supreme Court upheld the constitutionality of the removal by ruling against Fred Korematsu's appeal for violating an exclusion order. The Court limited its decision to the validity of the exclusion orders, avoiding the issue of the incarceration of U.S. citizens with no due process.\nIn 1980, under mounting pressure from the Japanese American Citizens League and redress organizations, President Jimmy Carter opened an investigation to determine whether the decision to put Japanese Americans into internment camps had been justified by the government. He appointed the Commission on Wartime Relocation and Internment of Civilians  to investigate the camps. The Commission's report, titled Personal Justice Denied, found little evidence of Japanese disloyalty at the time and, concluding the incarceration had been the product of racism, recommended that the government pay reparations to the survivors. In 1988, President Ronald Reagan signed into law the Civil Liberties Act, which apologized for the internment on behalf of the U.S. government and authorized a payment of $20,000 to each individual camp survivor. The legislation admitted that government actions were based on \"race prejudice, war hysteria, and a failure of political leadership.\" The U.S. government eventually disbursed more than $1.6 billion in reparations to 82,219 Japanese Americans who had been interned and their heirs.\nOf 127,000 Japanese Americans living in the continental United States at the time of the Pearl Harbor attack, 112,000 resided on the West Coast. About 80,000 were nisei  and sansei . The rest were issei .", "title": "Japanese American internment"}