{"summary": "Japan  is a country in Asia.", "full_text": "Japan  is an island country in East Asia. Located in the Pacific Ocean, it lies to the east of the Sea of Japan, the East China Sea, China, North Korea, South Korea and Russia, stretching from the Sea of Okhotsk in the north to the East China Sea and Taiwan in the south. The kanji that make up Japan's name mean \"sun origin\", and Japan is often called the \"Land of the Rising Sun\".\nJapan is a stratovolcanic archipelago of 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area. Japan's population of 126 million is the world's tenth largest. Approximately 9.1 million people live in Tokyo, the capital city of Japan, which is the second largest city proper in the OECD. The Greater Tokyo Area, which includes Tokyo and several surrounding prefectures, is the world's largest metropolitan area with over 35 million residents and the world's largest urban agglomeration economy.\nArchaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly Imperial China, followed by periods of isolation, later from Western European influence, has characterized Japan's history. From the 12th century until 1868, Japan was ruled by successive feudal military shoguns who ruled in the name of the Emperor. Japan entered into a long period of isolation in the early 17th century, which was only ended in 1853 when a United States fleet pressured Japan to open to the West. Nearly two decades of internal conflict and insurrection followed before the Meiji Emperor was restored as head of state in 1868 and the Empire of Japan was proclaimed, with the Emperor as a divine symbol of the nation. In the late 19th and early 20th centuries, victories in the First Sino-Japanese War, the Russo-Japanese War and World War I allowed Japan to expand its empire during a period of increasing militarism. The Second Sino-Japanese War of 1937 expanded into part of World War II in 1941, which came to an end in 1945 following the atomic bombings of Hiroshima and Nagasaki. Since adopting its revised constitution in 1947, Japan has maintained a unitary constitutional monarchy with an Emperor and an elected legislature called the National Diet.\nJapan is a member of the UN, the G7, the G8, and the G20. Japan is a great power. The country has the world's third-largest economy by nominal GDP and the world's fourth-largest economy by purchasing power parity. It is also the world's fifth-largest exporter and fifth-largest importer. Although Japan has officially renounced its right to declare war, it maintains a modern military with the world's eighth largest military budget, used for self-defense and peacekeeping roles. Japan is a developed country with a high standard of living and Human Development Index whose population enjoys the highest life expectancy and the third lowest infant mortality rate of any country.", "title": "Japan"}