{"summary": "Jazz is a type of music which was invented in the United States.", "full_text": "Jazz is a genre of music that originated in African American communities in the United States in the late 19th and early 20th centuries. It emerged in the form of independent traditional music and popular musical styles, all linked by the common bonds of African American and European American musical parentage with a performance orientation. Jazz spans a period of over a hundred years, encompassing a range of music from ragtime to jazz-rock fusion of the 1970s and 1980s, and has proved to be difficult to define. Jazz makes heavy use of improvisation, polyrhythms, syncopation and the swung note, as well as aspects of European harmony, American popular music, the brass band tradition, and African musical elements such as blue notes and African-American styles such as ragtime. The birth of jazz in the multicultural society of America has led intellectuals from around the world to hail jazz as \"one of America's original art forms\".\nAs jazz spread around the world, it drew on different national, regional, and local musical cultures, giving rise to many distinctive styles. New Orleans jazz began in the early 1910s, combining earlier brass band marches, French quadrilles, biguine, ragtime and blues with collective polyphonic improvisation. In the 1930s, heavily arranged dance-oriented swing big bands, Kansas City jazz, a hard-swinging, bluesy, improvisational style and Gypsy jazz  were the prominent styles. Bebop emerged in the 1940s, shifting jazz from danceable popular music towards a more challenging \"musician's music\" which was played at faster tempos and used more chord-based improvisation. Cool jazz developed in the end of the 1940s, introducing calmer, smoother sounds and long, linear melodic lines.\nThe 1950s saw the emergence of free jazz, which explored playing without regular meter, beat and formal structures, and in the mid-1950s, hard bop emerged, which introduced influences from rhythm and blues, gospel music, and blues, especially in the saxophone and piano playing. Modal jazz developed in the late 1950s, using the mode, or musical scale, as the basis of musical structure and improvisation. Jazz-rock fusion appeared in the late 1960s and early 1970s, combining jazz improvisation with rock rhythms, electric instruments and the highly amplified stage sound of rock. In the early 1980s, a commercial form of jazz fusion called smooth jazz became successful, garnering significant radio airplay. Other styles and genres abound in the 2000s, such as Latin jazz and Afro-Cuban jazz.\nProminent jazz musician Louis Armstrong, whose career spanned from the 1920s to the 1960s, observed: \"At one time they were calling it levee camp music, then in my day it was ragtime. When I got up North I commenced to hear about jazz, Chicago style, Dixieland, swing. All refinements of what we played in New Orleans... There ain't nothing new.\" Or as jazz musician J. J. Johnson put it in a 1988 interview: \"Jazz is restless. It won't stay put and it never will.\"", "title": "Jazz music"}