{"summary": "Jehovah's Witnesses are people that teach about Jehova and have more than eight million members throughout the world.They are sure Jehova  will end the present system of things, which belongs to Satan.", "full_text": "Jehovah's Witnesses is a millenarian restorationist Christian denomination with nontrinitarian beliefs distinct from mainstream Christianity. The group claims a worldwide membership of more than 8.2 million adherents involved in evangelism, convention attendance figures of more than 15 million, and an annual Memorial attendance of more than 19.9 million. Jehovah's Witnesses are directed by the Governing Body of Jehovah's Witnesses, a group of elders in Brooklyn, New York, which establishes all doctrines based on its interpretations of the Bible. They prefer to use their own translation, the New World Translation of the Holy Scriptures, although their literature occasionally quotes and cites other translations. They believe that the destruction of the present world system at Armageddon is imminent, and that the establishment of God's kingdom over the earth is the only solution for all problems faced by humanity.\nThe group emerged from the Bible Student movement, founded in the late 1870s by Charles Taze Russell with the formation of Zion's Watch Tower Tract Society, with significant organizational and doctrinal changes under the leadership of Joseph Franklin Rutherford. The name Jehovah's witnesses was adopted in 1931 to distinguish themselves from other Bible Student groups and symbolize a break with the legacy of Russell's traditions.\nJehovah's Witnesses are best known for their door-to-door preaching, distributing literature such as The Watchtower and Awake!, and refusing military service and blood transfusions. They consider use of the name Jehovah vital for proper worship. They reject Trinitarianism, inherent immortality of the soul, and hellfire, which they consider to be unscriptural doctrines. They do not observe Christmas, Easter, birthdays, or other holidays and customs they consider to have pagan origins incompatible with Christianity. Adherents commonly refer to their body of beliefs as \"the truth\" and consider themselves to be \"in the truth\". They consider secular society to be morally corrupt and under the influence of Satan, and most limit their social interaction with non-Witnesses. Congregational disciplinary actions include disfellowshipping, their term for formal expulsion and shunning. Baptized individuals who formally leave are considered disassociated and are also shunned. Disfellowshipped and disassociated individuals may eventually be reinstated if deemed repentant.\nThe religion's position regarding conscientious objection to military service and refusal to salute national flags has brought it into conflict with some governments. Consequently, some Jehovah's Witnesses have been persecuted and their activities are banned or restricted in some countries. Persistent legal challenges by Jehovah's Witnesses have influenced legislation related to civil rights in several countries.\nThe organization has attracted criticism over issues surrounding biblical translation, doctrines, handling of sexual abuse cases, and alleged coercion of its members. The claims are rejected by the religion's leaders, and some have been disputed by courts and religious scholars.\n\n", "title": "Jehovah's Witnesses"}