{"summary": "Jesus , also referred to as Jesus of Nazareth, is the central figure of Christianity.", "full_text": "Jesus , also referred to as Jesus of Nazareth or Jesus Christ, is the central figure of Christianity, whom the teachings of most Christian denominations hold to be the Son of God. Christianity regards Jesus as the awaited Messiah  of the Old Testament.\nVirtually all modern scholars of antiquity agree that Jesus existed historically, and historians consider the Synoptic Gospels  to be the best sources for investigating the historical Jesus. Most scholars agree that Jesus was a Galilean, Jewish rabbi who preached his message orally, was baptized by John the Baptist, and was crucified by the order of the Roman Prefect Pontius Pilate. In the current mainstream view, Jesus was an apocalyptic preacher and the founder of a restoration movement within Judaism, although some prominent scholars argue that he was not apocalyptic. After Jesus' death, his followers believed he was resurrected, and the community they formed eventually became the Christian church. The widely used calendar era, abbreviated as \"AD\" or sometimes as \"CE\", is based on the birth of Jesus.\nChristians believe that Jesus has a \"unique significance\" in the world. Christian doctrines include the beliefs that Jesus was conceived by the Holy Spirit, was born of a virgin named Mary, performed miracles, founded the Church, died by crucifixion as a sacrifice to achieve atonement, rose from the dead, and ascended into Heaven, whence he will return. Most Christians believe Jesus enables humans to be reconciled to God, and will judge the dead either before or after their bodily resurrection, an event tied to the Second Coming of Jesus in Christian eschatology; though some believe Jesus's role as savior has more existential or societal concerns than the afterlife, and a few notable theologians have suggested that Jesus will bring about a universal reconciliation. The great majority of Christians worship Jesus as the incarnation of God the Son, the second of three persons of a Divine Trinity. A few Christian groups reject Trinitarianism, wholly or partly, as non-scriptural.\nIn Islam, Jesus  is considered one of God's important prophets and the Messiah, second in importance only to Muhammad. To Muslims, Jesus was a bringer of scripture and was born of a virgin, but was neither the son of God nor the victim of crucifixion. According to the Quran, Jesus was not crucified but was physically raised into Heaven by God. Judaism rejects the Christian and Islamic belief that Jesus was the awaited Messiah, arguing that he did not fulfill the Messianic prophecies in the Tanakh.", "title": "Jesus"}