{"summary": "A Jew is a person who is of Jewish heritage or who has converted to the Jewish religion.", "full_text": "The Jewish Agency for Israel  is the largest Jewish nonprofit organization in the world. Established as the Palestine Office  in 1908, it became the Zionist Commission, later Palestine Zionist Executive, which was designated in 1929 as the \"Jewish agency\" provided for in the League of Nations' Palestine Mandate and was thus again renamed as The Jewish Agency for Palestine. After the establishment of the State it received its current name.\nIt is best known as the primary organization responsible for the immigration  and absorption of Jews and their families from the Diaspora into Israel. Since 1948, the Jewish Agency for Israel has been responsible for bringing 3 million immigrants to Israel, and offers them transitional housing in \"absorption centers\" throughout the country. The Jewish Agency played a central role in the founding and the building of the State of Israel, including the establishment of about 1,000 towns and villages, and continues to serve as the main link between Israel and Jewish communities around the world. Its mission is to \"inspire Jews throughout the world to connect with their people, heritage, and land, and empower them to build a thriving Jewish future and a strong Israel.\"\nThe Jewish Agency is a non-governmental organization  and does not receive core funding from the Israeli government. The Jewish Agency is funded by The Jewish Federations of North America, Keren Hayesod, major Jewish communities and federations, the International Fellowship of Christians and Jews, foundations and donors from Israel and around the world. The dozens of programs it supports or operates benefit well over a million Israelis and Jews worldwide every year.\nSome of The Jewish Agency's best-known programs include Masa Israel Journey, Partnership2Gether, Youth Futures, Youth Villages, and its many Aliyah and Absorption programs.\nIn 2008, The Jewish Agency won the Israel Prize for its historical contribution to Israel and to the worldwide Jewish community.\n^ League of Nations, Mandate for Palestine and Memorandum by the British Government Relating to Its Application to Transjordan, Approved by the Council of the League of Nations on September 16th, 1922. Published in Geneva, Switzerland on September 2, 1926. Document # C.P.M 466  . Page 2, Article 4. Copy available upon request from the League of Nations Archives in Geneva.\n^ \"Jewish Agency - Aliyah\". Jewish Agency. Retrieved September 15, 2014. \n^ \"Jewish Agency - Aliyah Statistics\". The Jewish Agency for Israel. Retrieved August 12, 2013. \n^ \"Jewish Agency - Aliyah of Rescue\". Jewish Agency. Retrieved September 15, 2014. \n^ \"Jewish Agency: About Us\". Retrieved September 30, 2013. \n^ http://cms.education.gov.il/EducationCMS/Units/PrasIsrael/Tashsch/SochnotYehodit/\n^ Haviv Rettig Gur . \"Jewish Agency Approves New Mission\". Jerusalem Post. Retrieved August 12, 2013. \n^ a b \"Jewish Agency Annual Report 2014\". Jewish Agency. Retrieved September 15, 2014. \n^ \"Prize Organizations\". Jerusalem Post. May 5, 2008. Retrieved August 12, 2013.", "title": "Jewish Agency for Israel"}