{"summary": "This is a Chinese name; the family name is Lin.", "full_text": "Jiang Qing  was a Chinese actress and a major political figure during the Cultural Revolution . She was the fourth wife of Mao Zedong, the Chairman of the Communist Party of China. She used the stage name Lan Ping  during her acting career, and was known by many other names . She married Mao in Yan'an in November 1938 and served as the inaugural \"First Lady\" of the People's Republic of China. Jiang Qing was best known for playing a major role in the Cultural Revolution and for forming the radical political alliance known as the \"Gang of Four\".\nJiang Qing served as Mao's personal secretary in the 1940s and was head of the Film Section of the Communist Party's Propaganda Department in the 1950s. She served as an important emissary for Mao in the early stages of the Cultural Revolution. In 1966 she was appointed deputy director of the Central Cultural Revolution Group. She collaborated with Lin Biao to advance Mao's unique brand of Communist ideology as well as Mao's cult of personality. At the height of the Cultural Revolution, Jiang Qing held significant influence in the affairs of state, particularly in the realm of culture and the arts, and was idolized in propaganda posters as the \"Great Flagbearer of the Proletarian Revolution\". In 1969, Jiang gained a seat on the Politburo.\nBefore Mao's death, the Gang of Four maintained control of many of China's political institutions, including the media and propaganda. However, Jiang Qing, deriving most of her political legitimacy from Mao, often found herself at odds with other top leaders. Mao's death in 1976 dealt a significant blow to Jiang Qing's political fortunes. She was arrested in October 1976 by Hua Guofeng and his allies, and was subsequently condemned by party authorities. Since then, Jiang Qing has been officially branded as having been part of the \"Lin Biao and Jiang Qing Counter-Revolutionary Clique\" , to which most of the blame for the damage and devastation caused by the Cultural Revolution was assigned. Though initially sentenced to death, her sentence was commuted to life imprisonment in 1983. After being released for medical treatment, Jiang Qing committed suicide in May 1991.", "title": "Jiang Qing"}