{"summary": "James Maury \"Jim\" Henson  was an American artist, animator, puppeteer, and moviemaker.", "full_text": "James Maury \"Jim\" Henson  was an American puppeteer, artist, cartoonist, inventor, screenwriter, actor, film director, and producer. Born in Greenville, Mississippi, and raised in Leland, Mississippi, and Hyattsville, Maryland, he began developing puppets while attending high school. While he was a freshman at the University of Maryland, College Park, he created Sam and Friends, a five-minute sketch-comedy puppet show that appeared on television. After graduating from the University of Maryland with a degree in home economics, he produced coffee advertisements and developed some experimental films. Feeling the need for more creative output, Henson founded Muppets Inc. in 1958 . He remains best known as the creator of the Muppets.\nHenson became famous in the 1970s when he joined the children's educational television program Sesame Street, and there helped develop characters for the series. He also appeared in the sketch comedy show Saturday Night Live. In 1976, after scrapping plans for a Broadway show, he produced The Muppet Show. He won fame for his creations, particularly Kermit the Frog, Rowlf the Dog, and Ernie, and he was involved with Sesame Street for over 20 years. He also had frequent roles in Muppets films such as The Muppet Movie, The Great Muppet Caper and The Muppets Take Manhattan, and created advanced puppets for projects like Fraggle Rock, The Dark Crystal, and Labyrinth. During the later years of his life, he also founded the Jim Henson Foundation, and Jim Henson's Creature Shop. He won two Emmy Awards for his work on The Storyteller and The Jim Henson Hour.\nOn May 16, 1990, Henson died suddenly from streptococcal toxic shock syndrome at the age of 53. In the weeks after his death, he was celebrated in a wave of tributes. He was posthumously inducted into Hollywood Walk of Fame in 1991, and as a Disney Legend in 2011.", "title": "Jim Henson"}