{"summary": "Jim Harbaugh  is an American football coach and former player.", "full_text": "James Joseph \"Jim\" Harbaugh  is the head football coach at the University of Michigan and a former quarterback. He played college football at Michigan and played in the National Football League  for 14 seasons, from 1987 to 2000. Harbaugh has been a head coach since 2004. He previously served as the head coach of the San Diego Toreros , the Stanford Cardinal , and the NFL's San Francisco 49ers . In 2015, Harbaugh began coaching his alma mater, Michigan.\nHarbaugh was born in Toledo, Ohio. His father, Jack, was a football coach, and the family lived in Ohio, Kentucky, Iowa, Michigan, and California. He attended high school in Ann Arbor, Michigan, and Palo Alto, California, when his father was an assistant coach at Michigan and Stanford, respectively. After graduation from high school in Palo Alto in 1982, Harbaugh returned to Ann Arbor and enrolled at the University of Michigan and played quarterback for the Wolverines, starting for three seasons. As a fifth-year senior in 1986, he led Michigan to the 1987 Rose Bowl and was a Heisman Trophy finalist, finishing third.\nThe Chicago Bears selected Harbaugh in the first round of the 1987 NFL Draft. He played 14 years as a quarterback in the NFL, with Chicago from 1987 to 1993, the Indianapolis Colts from 1994 to 1997, the Baltimore Ravens in 1998, and the San Diego Chargers in 1999 and 2000. He first became a regular starting quarterback in 1990 with Chicago. In 1995 with Indianapolis, he led the Colts to the AFC Championship Game, was selected to the Pro Bowl and was honored as NFL Comeback Player of the Year.\nFrom 1994 to 2001, while still playing in the NFL, Harbaugh was an unpaid assistant coach at Western Kentucky University, where his father Jack was head coach. In 2002, he returned to the NFL as the quarterbacks coach for the Oakland Raiders. Harbaugh returned to the college ranks in 2004 as the head coach at the University of San Diego. After leading San Diego to consecutive Pioneer League championships in 2005 and 2006, he moved up to Stanford in 2007 for four seasons and led the Cardinal to two bowl berths, including the 2011 Orange Bowl. Immediately afterward, Harbaugh signed a five-year deal as head coach of the NFL San Francisco 49ers, where he led the team to playoff wins in each of his first three seasons. He and his older brother, Baltimore Ravens coach John Harbaugh, became the first pair of brothers to serve as head coaches in NFL history. Their teams played in a Thanksgiving Classic game in 2011 and Super Bowl XLVII in February 2013.", "title": "Jim Harbaugh"}