{"summary": "Joseph Robinette Biden, Jr.", "full_text": "Joseph Robinette \"Joe\" Biden, Jr.  is an American politician who is the 47th and current Vice President of the United States, jointly elected twice with President Barack Obama, and in office since 2009. A member of the Democratic Party, Biden represented Delaware as a United States Senator from 1973 until becoming Vice President in 2009.\nBiden was born in Scranton, Pennsylvania, in 1942, and lived there for ten years before moving to Delaware. He became an attorney in 1969, and was elected to the New Castle County council in 1970. Biden was first elected to the Senate in 1972, and became the sixth-youngest senator in U.S. history. He was re-elected to the Senate six times, and was the fourth most senior senator at the time of his resignation to assume the Vice Presidency in 2009. Biden was a long-time member and former chairman of the Foreign Relations Committee. He opposed the Gulf War in 1991, but advocated U.S. and NATO intervention in the Bosnian War in 1994 and 1995. Biden voted in favor of the resolution authorizing the Iraq War in 2002, but opposed the surge of U.S. troops in 2007. He has also served as chairman of the Senate Judiciary Committee, dealing with issues related to drug policy, crime prevention, and civil liberties, and led the legislative efforts for creation of the Violent Crime Control and Law Enforcement Act, and the Violence Against Women Act. He chaired the Judiciary Committee during the contentious U.S. Supreme Court nominations of Robert Bork and Clarence Thomas.\nBiden unsuccessfully sought the Democratic presidential nomination in 1988 and in 2008, both times dropping out early in the race. In the 2008 U.S. presidential election, Barack Obama chose Biden to be his running mate in the race, which they went on to successfully win. Biden became the first Roman Catholic, and the first Delawarean, to be Vice President of the United States.\nAs Vice President in the Obama administration, Biden oversaw the infrastructure spending aimed at counteracting the Great Recession, and U.S. policy toward Iraq up until the withdrawal of U.S. troops in 2011. His ability to negotiate with congressional Republicans helped bring about legislation such as the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010 that resolved a taxation deadlock, the Budget Control Act of 2011 that resolved that year's debt ceiling crisis, and the American Taxpayer Relief Act of 2012 that addressed the impending \"fiscal cliff\". In 2011, Biden opposed going ahead with the military mission that resulted in the death of Osama bin Laden. Obama and Biden were re-elected in 2012. In October 2015, after months of speculation, Biden decided not to enter the 2016 presidential race.", "title": "Joe Biden"}