{"summary": "John Adams  was the second President of the United States , and father of the sixth President, John Quincy Adams.", "full_text": "John Adams, Jr.  was an American lawyer, author, statesman, and diplomat. He served as the second President of the United States , the first Vice President , and as a Founding Father was a leader of American independence from Great Britain. Adams was a political theorist in the Age of Enlightenment who promoted republicanism and a strong central government. His innovative ideas were frequently published. He was also a dedicated diarist and correspondent, particularly with his wife and key advisor Abigail.\nHe collaborated with his cousin, revolutionary leader Samuel Adams, but he established his own prominence prior to the American Revolution. After the Boston Massacre, despite severe local anti-British sentiment, he provided a successful though unpopular legal defense of the accused British soldiers, driven by his devotion to the right to counsel and the \"protect of innocence\". As a delegate from Massachusetts to the Continental Congress, Adams played a leading role in persuading Congress to declare independence. He assisted Thomas Jefferson in drafting the Declaration of Independence in 1776, and was its foremost advocate in the Congress. As a diplomat in Europe, he helped negotiate the eventual peace treaty with Great Britain, and acquired vital governmental loans from Amsterdam bankers. Adams was the primary author of the Massachusetts Constitution in 1780 which influenced American political theory, as did his earlier Thoughts on Government.\nAdams' credentials as a revolutionary secured for him two terms as President George Washington's vice president  and also his own election in 1796 as the second president. In his single term as president, he encountered fierce criticism from the Jeffersonian Republicans, as well as the dominant faction in his own Federalist Party, led by his opponent Alexander Hamilton. Adams signed the controversial Alien and Sedition Acts, and built up the army and navy in the face of an undeclared naval \"Quasi-War\" with France. The major accomplishment of his presidency was a peaceful resolution of the conflict in the face of Hamilton's opposition. Due to his strong posture on defense, Adams is \"often called the father of the American Navy\". He was the first U.S. president to reside in the executive mansion, now known as the White House.\nIn 1800, Adams lost re-election to Thomas Jefferson, and retired to Massachusetts. He resumed his friendship with Jefferson upon the latter's own retirement by initiating a correspondence which lasted fourteen years. He and his wife established a family of politicians, diplomats, and historians now referred to as the Adams political family. Adams was the father of John Quincy Adams, the sixth President of the United States. He died on the fiftieth anniversary of the adoption of the Declaration of Independence. Modern historians in the aggregate have ranked his administration favorably.", "title": "John Adams"}