{"summary": "Sir John Major  KG CH is a British politician who was Prime Minister of the United Kingdom and leader of the Conservative Party from November 1990 to May 1997. He was also a member of the Cabinet of Margaret Thatcher as Chief Secretary to the Treasury , Foreign Secretary  and Chancellor of the Exchequer .", "full_text": "Sir John Major KG CH PC  is a British Conservative Party politician who was the Prime Minister of the United Kingdom and Leader of the Conservative Party from 1990 to 1997. He was Chancellor of the Exchequer and Foreign Secretary in the Thatcher Government and was the Member of Parliament for Huntingdon from 1979 to 2001.\nWithin weeks of becoming Prime Minister, Major presided over British participation in the Gulf War in March 1991 and negotiated the Maastricht Treaty in December 1991. He went on to lead the Conservatives to a fourth consecutive election victory, winning the most votes in British electoral history with over 14 million in the 1992 general election, with a reduced majority in the House of Commons. Shortly after this, the Major Government became responsible for the United Kingdom's exit from the Exchange Rate Mechanism  after Black Wednesday on 16 September 1992. This event led to a loss of confidence in Conservative economic policies and from thereon in he was never able to achieve a lead in the opinion polls again.\nDespite the eventual revival of economic growth amongst other successes such as the beginnings of the Northern Ireland peace process, by the mid-1990s the Conservatives were embroiled in ongoing sleaze scandals involving various MPs, including Cabinet Ministers. Criticism of Major's leadership reached such a pitch that he chose to resign as leader in June 1995, challenging his critics to either back him or challenge him; he was duly challenged by John Redwood but was easily re-elected. By this time, the Labour Party was seen as a reformed and credible alternative under the leadership of Tony Blair and a large number of by-election defeats eventually robbed the Government of its majority. Major went on to lose the 1997 general election in one of the largest electoral defeats since the Great Reform Act of 1832.\nAfter defeat, Major resigned as Conservative Leader and was succeeded by William Hague. He went on to retire from active politics, leaving the House of Commons at the 2001 general election. Major is the oldest living former British Prime Minister.\n^ Hansard . \"European Council \". Hansard. Retrieved 17 May 2011.", "title": "John Major"}