{"summary": "John Muir  was a Scottish-born American naturalist, author, writer, and early advocate of preservation of wilderness in the United States.", "full_text": "John Muir  was a Scottish-American naturalist, author, environmental philosopher and early advocate of preservation of wilderness in the United States. His letters, essays, and books telling of his adventures in nature, especially in the Sierra Nevada of California, have been read by millions. His activism helped to preserve the Yosemite Valley, Sequoia National Park and other wilderness areas. The Sierra Club, which he founded, is a prominent American conservation organization. The 211-mile  John Muir Trail, a hiking trail in the Sierra Nevada, was named in his honor. Other such places include Muir Woods National Monument, Muir Beach, John Muir College, Mount Muir, Camp Muir and Muir Glacier. In Scotland, the John Muir Way, a 130 mile long distance route, was named in honor of him.\nIn his later life, Muir devoted most of his time to the preservation of the Western forests. He petitioned the U.S. Congress for the National Park bill that was passed in 1890, establishing Yosemite National Park. The spiritual quality and enthusiasm toward nature expressed in his writings inspired readers, including presidents and congressmen, to take action to help preserve large nature areas. He is today referred to as the \"Father of the National Parks\" and the National Park Service has produced a short documentary about his life.\nMuir has been considered 'an inspiration to both Scots and Americans'. Muir's biographer, Steven J. Holmes, believes that Muir has become \"one of the patron saints of twentieth-century American environmental activity,\" both political and recreational. As a result, his writings are commonly discussed in books and journals, and he is often quoted by nature photographers such as Ansel Adams. \"Muir has profoundly shaped the very categories through which Americans understand and envision their relationships with the natural world,\" writes Holmes. Muir was noted for being an ecological thinker, political spokesman, and religious prophet, whose writings became a personal guide into nature for countless individuals, making his name \"almost ubiquitous\" in the modern environmental consciousness. According to author William Anderson, Muir exemplified \"the archetype of our oneness with the earth\", while biographer Donald Worster says he believed his mission was \"...saving the American soul from total surrender to materialism.\" On April 21, 2013, the first ever John Muir Day was celebrated in Scotland, which marked the 175th anniversary of his birth, paying homage to the conservationist.", "title": "John Muir"}