{"summary": "March 22 is the 81st day of the year  in the Gregorian calendar.", "full_text": "John Ainsworth Horrocks , pastoralist and explorer, was one of the first settlers in the Clare Valley in 1840. He established the town of Penwortham in South Australia.\n\nHorrocks was born on Easter Sunday, 22 March 1818, at Penwortham Lodge, near Preston, Lancashire. His father, Peter Horrocks, was an investor/shareholder in the Secondary Towns Association, which aspired to develop secondary towns in the new colony of South Australia. John Ainsworth Horrocks, aged 21, and his brother Eustace, aged 16, arrived at Adelaide in March 1839. Impatient to settle on their own land, the brothers set up camp on 16 January 1840 at present Penwortham, a village which they founded and named.\nIn 1846 he mounted an exploratory expedition into the far north of South Australia, aiming for distant hills near Lake Torrens, hoping to find good agricultural land. His second in command was John Henry Theakston , a surveyor who in 1844 had served dutifully as second in command of the ill-fated Darke expedition. An unpaid volunteer in the party was artist and amateur botanist Samuel Thomas Gill. The several hired men included Bernard Kilcoy as cook and driver, and goatherd Jimmy Moorhouse, a young Aboriginal employee at his Penwortham station.\nNear Lake Dutton, still short of his objective, Horrocks was accidentally shot in a hunting accident, and so is unfortunately known more for his death than for anything else. His gun fired after the camel he was using lurched, knocking him and causing the weapon to discharge. His injuries were very substantial and included some teeth being knocked out by the bullet. The expedition was abandoned and the party returned to Horrocks' home at Penwortham, where he died of gangrene a month later, on 23 September 1846. He is buried at St. Mark's Anglican Church, which is also located in the town; the camel, who had previously attacked other humans , was 'executed' at Horrocks' express wish.\nAlthough Horrocks' expedition thus failed to reach its objective, in 1851 this was achieved by Horrocks' close associate John Jackson Oakden.\nHorrocks gave his name to several geographical features in the vicinity of Mount Remarkable and the Clare Valley, such as Horrocks Pass near Mount Remarkable and Mount Horrocks near Clare.\nA short biography published in 1906 was derived from Horrocks' diary plus notes written by his sister.", "title": "John Ainsworth Horrocks"}