{"summary": "John Winthrop  was the first governor of the Massachusetts Bay Colony.", "full_text": "John Winthrop  was a wealthy English Puritan lawyer and one of the leading figures in the founding of the Massachusetts Bay Colony, the first major settlement in what is now New England after Plymouth Colony. Winthrop led the first large wave of immigrants from England in 1630, and served as governor for 12 of the colony's first 20 years of existence. His writings and vision of the colony as a Puritan \"city upon a hill\" dominated New England colonial development, influencing the governments and religions of neighboring colonies.\nBorn into a wealthy landowning and merchant family, Winthrop was trained in the law, and became Lord of the Manor at Groton in Suffolk. Although he was not involved in the founding of the Massachusetts Bay Company in 1628, he became involved in 1629 when the anti-Puritan King Charles I began a crackdown on Nonconformist religious thought. In October 1629 he was elected governor of the Massachusetts Bay Colony, and in April 1630 he led a group of colonists to the New World, founding a number of communities on the shores of Massachusetts Bay and the Charles River.\nBetween 1629 and his death in 1649, he served 19 annual terms as governor, and was a force of comparative moderation in the religiously conservative colony, clashing with the more conservative Thomas Dudley and the more liberal Roger Williams and Henry Vane. Although Winthrop was a respected political figure, his attitude toward governance was somewhat authoritarian: he resisted attempts to widen voting and other civil rights beyond a narrow class of religiously approved individuals, opposed attempts to codify a body of laws that the colonial magistrates would be bound by, and also opposed unconstrained democracy, calling it \"the meanest and worst of all forms of government\". The authoritarian and religiously conservative nature of Massachusetts rule was influential in the formation of neighboring colonies, which were in some instances formed by individuals and groups opposed to the rule of the Massachusetts elders.\nWinthrop's son, John, was one of the founders of the Connecticut Colony, and Winthrop himself wrote one of the leading historical accounts of the early colonial period. His long list of descendants includes famous Americans, and his writings continue to influence politicians today.", "title": "John Winthrop"}