{"summary": "\"I Saw Mommy Kissing Santa Claus\" is a Christmas song with words and music by British songwriter Tommie Connor.", "full_text": "John J Mellencamp , also known as John Cougar Mellencamp, is an American musician, singer-songwriter, painter, and actor. He is known for his catchy, populist brand of heartland rock, which emphasizes traditional instrumentation. He rose to superstardom in the 1980s while \"honing an almost startlingly plainspoken writing style that, starting in 1982, yielded a string of Top 10 singles\", including \"Hurts So Good,\" \"Jack & Diane,\" \"Crumblin' Down,\" \"Pink Houses,\" \"Lonely Ol' Night,\" \"Small Town,\" \"R.O.C.K. in the U.S.A.,\" \"Paper in Fire,\" and \"Cherry Bomb.\" He has amassed 22 Top 40 hits in the United States. In addition, he holds the record for the most tracks by a solo artist to hit number one on the Hot Mainstream Rock Tracks chart, with seven, and has been nominated for 13 Grammy Awards, winning one. Mellencamp released his latest album, Plain Spoken, on September 23, 2014, to widespread critical acclaim.\nMellencamp is also one of the founding members of Farm Aid, an organization that began in 1985 with a concert in Champaign, Illinois, to raise awareness about the loss of family farms and to raise funds to keep farm families on their land. Farm Aid concerts have remained an annual event over the past 30 years, and as of 2015 the organization has raised over $48 million to promote a strong and resilient family farm system of agriculture.\nMellencamp was inducted into the Rock and Roll Hall of Fame on March 10, 2008. His biggest musical influences are Bob Dylan, Woody Guthrie, James Brown and the Rolling Stones. Said longtime Rolling Stone contributor Anthony DeCurtis: \"Mellencamp has created an important body of work that has earned him both critical regard and an enormous audience. His songs document the joys and struggles of ordinary people seeking to make their way, and he has consistently brought the fresh air of common experience to the typically glamour-addled world of popular music.\"\nThe late Billboard magazine editor-in-chief Timothy White said in 2001:\nJohnny Cash called Mellencamp \"one of the 10 best songwriters\" in music.", "title": "John Mellencamp"}