{"summary": "John Tavares  is a Canadian professional ice hockey centre.", "full_text": "John Tavares  is a Canadian professional ice hockey centre who currently serves as the captain of the New York Islanders of the National Hockey League . He was selected first overall by the Islanders in the 2009 NHL Entry Draft.\nPreviously, Tavares competed at the major junior level as a member of the Oshawa Generals of the Ontario Hockey League  before being traded to the London Knights at the 2009 OHL trading deadline along with Michael Del Zotto. Tavares broke into the OHL after gaining \"exceptional player\" status at the age of 14, allowing the Generals to select him in the OHL Priority Draft as an underage player in 2005. Tavares was named the Canadian Hockey League  Rookie of the Year in 2006 and CHL Player of the Year in 2007. In 2009, he finished the season with a career total of 215 goals, breaking Peter Lee's OHL record by two.\nTavares was the focus of an unsuccessful push to have the NHL's draft rules changed to allow him to participate in the 2008 Entry Draft, as well as an attempt to allow him to play in the American Hockey League  as a 17-year-old in 2007. Tavares was ranked as the top prospect for the 2009 Draft by both the NHL Central Scouting Bureau and International Scouting Services.\nTavares has represented Canada at five International Ice Hockey Federation -sanctioned events, including the 2010 and 2011 World Championships. At the under-20 level, he won gold medals at the 2008 and 2009 World Junior Ice Hockey Championships. He was named the most valuable player of the 2009 tournament after scoring eight goals and 15 points in six games. He also participated in the 2006 IIHF World U18 Championships, but failed to medal. Additionally, Tavares represented Team Ontario at the 2006 World U-17 Hockey Challenge and 2007 Super Series. On January 7, 2014, he was named to the 2014 Canadian Olympic Hockey Team, winning a gold medal at the 2014 Winter Olympics despite an injury preventing him from participating in the nation's final two games.", "title": "John Tavares (ice hockey)"}