{"summary": "John Fitzgerald Kennedy , commonly known as \"Jack\" or by his initials JFK, was the 35th President of the United States.", "full_text": "John Fitzgerald \"Jack\" Kennedy , commonly referred to by his initials JFK, was an American politician who served as the 35th President of the United States from January 1961 until his assassination in November 1963. The Cuban Missile Crisis, The Bay of Pigs Invasion, the Nuclear Test Ban Treaty, the establishment of the Peace Corps, developments in the Space Race, the building of the Berlin Wall, the Civil Rights Movement, the \"New Frontier\" domestic program, abolition of the federal death penalty in the District of Columbia, and increased U.S. involvement in the Vietnam War all took place during his presidency.\nKennedy's time in office is also marked by high tensions with Communist states, Cuba in particular. An attempt in April, 1961 at the Bay of Pigs to overthrow the country's dictator, Fidel Castro, was thwarted by armed forces within three days. His administration subsequently rejected plans by the Joint Chiefs of Staff to orchestrate false-flag attacks on American soil in order to gain public approval for a war against Cuba. In October 1962, it was discovered Soviet ballistic missiles had been deployed in Cuba; the resulting period of unease, often termed the Cuban Missile Crisis, is seen by many historians as the closest the human race has ever come to nuclear war.\nAfter military service as United States Navy commander of PT boats PT-109 and PT-59 during World War II in the South Pacific, Kennedy represented Massachusetts's 11th congressional district in the U.S. House of Representatives from 1947 to 1953 as a Democrat. Thereafter, he served in the U.S. Senate from that state from 1953 until 1960. Kennedy defeated Vice President and Republican candidate Richard Nixon in the 1960 U.S. Presidential Election. At age 43, he was the youngest man to have been elected to the office, the second-youngest president . Kennedy was the first person born in the 20th century to serve as president. To date, Kennedy has been the only Roman Catholic president and the only president to have won a Pulitzer Prize, for his biography Profiles in Courage.\nKennedy was assassinated in Dallas, Texas on November 22, 1963 by a sniper at the Texas School Book Depository. Lee Harvey Oswald was arrested that afternoon as a person of interest in the crime. Dallas nightclub owner Jack Ruby mortally wounded Oswald two days later in a jail corridor, which ironically was the one place where Oswald should have been safe. The FBI and the Warren Commission officially concluded that Oswald was the lone assassin. The United States House Select Committee on Assassinations  agreed with the conclusion that Oswald fired the shots that killed the president, but also concluded that Kennedy was probably assassinated as the result of a conspiracy.\nSince the 1960s, information concerning Kennedy's private life has come to light. Details of Kennedy's health problems with which he struggled have become better known, especially since the 1990s. Although initially kept secret from the general public, reports of Kennedy being unfaithful in marriage have garnered much press. Kennedy ranks highly in historians' polls of U.S. presidents, although a slight gap exists between his public reputation and his standing among academics, with the public generally more commendatory.", "title": "John F. Kennedy"}