{"summary": "The Honourable Sir Charles Kuen Kao, GBM, KBE, FRS, FREng  is a Chinese-born Hong Kong, American and British electrical engineer and physicist.", "full_text": "Joint Publishing  is a book store chain and publisher founded at Queen's Road Central in Hong Kong in 18 October 1948. It is one of major book store chains in Hong Kong. Currently a subsidiary company of Sino United Publishing  Limited.\nThe book store was merged from three leading publishers and book stores, ,  and  , at Shanghai in 1948. The newly merged book store was closely related to the communist government at that time. Many intellects stayed in Hong Kong and publishing in Hong Kong was its main business. It moved its headquarters to Peking with many key staff in March 1949. Joint Publishing  was its subsidiary.\nAfter the establishment of People's Republic of China in 1 October 1949, the book store located in Hong Kong was mainly responsible for publishing materials from mainland China. While the main branch in mainland China was nationalized. After the coming of Cultural Revolution in mainland China in 1966, the publishing business in mainland China was seriously damaged and the book store in Hong Kong earned its survival by republishing old books.\nWith several re-locations, it finally settled in current premises in Queen Victoria Street in May 1971 and opened a retail store at the ground floor in July 1974.\nThe Cultural Revolution ended in 1976 and was soon replaced with economic reform. In 1978 the book store in Hong Kong decided to publish their own books independently and join with other international publishers. It initially targeted in Chinese culture, literature and art and later concentrated Hong Kong topics and social science. Its direction was proved successful and the book store aggressively opened branches in Hong Kong.\nOutside Hong Kong, the book store expanded to various cities in mainland China by joint venture, and five stores in North America, specifically in Toronto, Vancouver, New York, Los Angeles, and San Francisco.\nIn mainland China, Beijing's SDX Joint Publishing Company  and Shanghai Joint Publishing Company  were found in 1986 but are not currently related to the Hong Kong company.", "title": "Joint Publishing"}