{"summary": "October 31 is the 304th day of the year  in the Gregorian calendar.", "full_text": "The Joint Declaration on the Doctrine of Justification  is a document created, and agreed to, by the Catholic Church's Pontifical Council for Promoting Christian Unity  and the Lutheran World Federation in 1999, as a result of extensive ecumenical dialogue. It states that the churches now share \"a common understanding of our justification by God's grace through faith in Christ.\" To the parties involved, this essentially resolves the conflict over the nature of justification which was at the root of the Protestant Reformation.\nIn substance, the PCPCU and the Lutheran World Federation acknowledge in the Declaration that the excommunications relating to the doctrine of justification set forth by the Council of Trent do not apply to the teachings of the Lutheran churches set forth in the text; likewise, the churches acknowledged that the condemnations set forth in the Lutheran Confessions do not apply to the Catholic teachings on justification set forth in the document.\nOf the 124 members of the Lutheran World Federation, 35 cast votes against JDDJ, these included many churches who are members of International Lutheran Council. Member churches of the Confessional Evangelical Lutheran Conference even stated that \"JDDJ...should be repudiated by all Lutherans.\"\nSome Catholics have argued that the Lutheran signers do not have the required authority to represent their communities  and, therefore, that no Lutheran can make the agreement binding on the constituents of the Lutheran World Federation. The final paragraph of the Annex to the Official Common Statement, however, settles this matter. Some Catholics argue that the JDDJ is out of line with the Council of Trent but the document is clear that it is not negating or contradicting any statements from Trent, rather it is arguing for the non-applicability of its canons to concrete Christian bodies in the modern world. The document was approved by the Vatican under the auspices of the PCPCU and is therefore a magisterial document, though since it is not an ex cathedra statement, it may be possible for Catholics to hold that it is open to reform or correction.\nOn July 18, 2006, members of the World Methodist Council, meeting in Seoul, South Korea, voted unanimously to adopt the document.", "title": "Joint Declaration on the Doctrine of Justification"}