{"summary": "Jonas Edward Salk  was an American medical researcher and virologist, best known for his discovery and development of the first successful polio vaccine in Pittsburgh, Pennsylvania.", "full_text": "Jonas Edward Salk  was an American medical researcher and virologist. He discovered and developed the first successful polio vaccine. Born in New York City, he attended New York University School of Medicine, later choosing to do medical research instead of becoming a practicing physician.\nUntil 1957, when the Salk vaccine was introduced, polio was considered one of the most frightening public health problems in the world. In the postwar United States, annual epidemics were increasingly devastating. The 1952 U.S. epidemic was the worst outbreak in the nation's history. Of nearly 58,000 cases reported that year, 3,145 people died and 21,269 were left with mild to disabling paralysis, with most of its victims being children. The \"public reaction was to a plague\", said historian Bill O'Neal. \"Citizens of urban areas were to be terrified every summer when this frightful visitor returned.\" According to a 2009 PBS documentary, \"Apart from the atomic bomb, America's greatest fear was polio.\" As a result, scientists were in a frantic race to find a way to prevent or cure the disease. In 1938, U.S. President Franklin D. Roosevelt, the world's most recognized victim of the disease, had founded the National Foundation for Infantile Paralysis , an organization that would fund the development of a vaccine.\nIn 1947, Salk accepted an appointment to the University of Pittsburgh School of Medicine. In 1948, he undertook a project funded by the National Foundation for Infantile Paralysis to determine the number of different types of polio virus. Salk saw an opportunity to extend this project towards developing a vaccine against polio, and, together with the skilled research team he assembled, devoted himself to this work for the next seven years. The field trial set up to test the Salk vaccine was, according to O'Neill, \"the most elaborate program of its kind in history, involving 20,000 physicians and public health officers, 64,000 school personnel, and 220,000 volunteers.\" Over 1,800,000 school children took part in the trial. When news of the vaccine's success was made public on April 12, 1955, Salk was hailed as a \"miracle worker\" and the day almost became a national holiday. Around the world, an immediate rush to vaccinate began, with countries including Canada, Sweden, Denmark, Norway, West Germany, the Netherlands, Switzerland, and Belgium planning to begin polio immunization campaigns using Salk's vaccine.\nSalk campaigned for mandatory vaccination, claiming that public health should be considered a \"moral commitment.\" His sole focus had been to develop a safe and effective vaccine as rapidly as possible, with no interest in personal profit. When asked who owned the patent to it, Salk said, \"There is no patent. Could you patent the sun?\" In 1960, he founded the Salk Institute for Biological Studies in La Jolla, California, which is today a center for medical and scientific research. He continued to conduct research and publish books, including Man Unfolding , The Survival of the Wisest , World Population and Human Values: A New Reality , and Anatomy of Reality: Merging of Intuition and Reason . Salk's last years were spent searching for a vaccine against HIV. His personal papers are stored at the University of California, San Diego Library.", "title": "Jonas Salk"}