{"summary": "Joseph Eugene Stiglitz, ForMemRS, FBA  is an American economist and a professor.", "full_text": "Joseph Eugene Stiglitz, ForMemRS, FBA  is an American economist and a professor at Columbia University. He is a recipient of the Nobel Memorial Prize in Economic Sciences  and the John Bates Clark Medal . He is a former senior vice president and chief economist of the World Bank and is a former member and chairman of the  Council of Economic Advisers. He is known for his critical view of the management of globalization, laissez-faire economists , and some international institutions like the International Monetary Fund and the World Bank.\nIn 2000, Stiglitz founded the Initiative for Policy Dialogue , a think tank on international development based at Columbia University. He has been a member of the Columbia faculty since 2001, received that university's highest academic rank  in 2003, and is the co-chair of the university's Committee on Global Thought. He also chairs the University of Manchester's Brooks World Poverty Institute as well as the Socialist International Commission on Global Financial Issues and is a member of the Pontifical Academy of Social Sciences. In 2009 the President of the United Nations General Assembly Miguel d'Escoto Brockmann, appointed Stiglitz as the chairman of the U.N. Commission on Reforms of the International Monetary and Financial System, where he oversaw suggested proposals and commissioned a report on reforming the international monetary and financial system. Since 2012 Stiglitz has been the president of the International Economic Association . He presided over the organization of the IEA triennial world congress held near the Dead Sea in Jordan in June 2014.\nBased on academic citations, Stiglitz is the 4th most influential economist in the world today, and in 2011 he was named by Time magazine as one of the 100 most influential people in the world. Stiglitz's work focuses on income distribution, asset risk management, corporate governance, and international trade. He is the author of several books, the latest being The Great Divide: Unequal Societies and What We Can Do About Them .", "title": "Joseph E. Stiglitz"}