{"summary": "Judas Priest are an English heavy metal band.", "full_text": "Judas Priest are a British heavy metal band formed in Birmingham, England, in 1970. The band has sold over 45 million albums to date. MTV ranked them the second greatest metal band of all time.\nDespite an innovative and pioneering body of work in the latter half of the 1970s, the band struggled with indifferently-produced records, repeated changes of drummer and a lack of major commercial success or attention until 1980, when they adopted a more simplified sound on the album British Steel, which helped shoot them to rock superstar status. In 1989, they were named as defendants in an unsuccessful lawsuit alleging that subliminal messages on the song Better By You, Better Than Me had caused the suicide attempts of two young men.\nThe band's membership has seen much turnover, including a revolving cast of drummers in the 1970s, and the temporary departure of singer Rob Halford in the early 1990s. The current line-up consists of lead vocalist Rob Halford, guitarists Glenn Tipton and Richie Faulkner, bassist Ian Hill, and drummer Scott Travis. The band's best-selling album is 1982's Screaming for Vengeance with their most commercially successful line-up, featuring Halford, Tipton, Hill, K. K. Downing , and Dave Holland .\nTheir influence, while mainly Rob Halford's operatic vocal style and the twin guitar sound of K.K. Downing and Glenn Tipton, has been adopted by many bands. Their image of leather, spikes, and other taboo articles of clothing were widely influential during the glam metal era of the 1980s. Their British Steel album has been referred to as the \"record that, more than any other, codified what we mean by 'heavy metal'\". Despite a decline in exposure during the mid 1990s, the band has once again seen a resurgence, including worldwide tours, being inaugural inductees into the VH1 Rock Honors in 2005, receiving a Grammy Award for Best Metal Performance in 2010, and their songs featured in video games such as Guitar Hero and the Rock Band series.", "title": "Judas Priest"}