{"summary": "This article is about the Jewish religion.", "full_text": "Judaism  encompasses the religion, philosophy, culture and way of life of the Jewish people. Judaism is an ancient monotheistic religion, with the Torah as its foundational text , and supplemental oral tradition represented by later texts such as the Midrash and the Talmud. Judaism is considered by religious Jews to be the expression of the covenantal relationship that God established with the Children of Israel.\nJudaism includes a wide corpus of texts, practices, theological positions, and forms of organization. Within Judaism there are a variety of movements, most of which emerged from Rabbinic Judaism, which holds that God revealed his laws and commandments to Moses on Mount Sinai in the form of both the Written and Oral Torah. Historically, this assertion was challenged by various groups such as the Sadducees and Hellenistic Judaism during the Second Temple period; the Karaites and Sabbateans during the early and later medieval period; and among segments of the modern non-Orthodox denominations. Modern branches of Judaism such as Humanistic Judaism may be nontheistic. Today, the largest Jewish religious movements are Orthodox Judaism , Conservative Judaism and Reform Judaism. Major sources of difference between these groups are their approaches to Jewish law, the authority of the Rabbinic tradition, and the significance of the State of Israel. Orthodox Judaism maintains that the Torah and Jewish law are divine in origin, eternal and unalterable, and that they should be strictly followed. Conservative and Reform Judaism are more liberal, with Conservative Judaism generally promoting a more \"traditional\" interpretation of Judaism's requirements than Reform Judaism. A typical Reform position is that Jewish law should be viewed as a set of general guidelines rather than as a set of restrictions and obligations whose observance is required of all Jews. Historically, special courts enforced Jewish law; today, these courts still exist but the practice of Judaism is mostly voluntary. Authority on theological and legal matters is not vested in any one person or organization, but in the sacred texts and rabbis and scholars who interpret them.\nJudaism claims a historical continuity spanning more than 3,000 years. Judaism has its roots as a structured religion in the Middle East during the Bronze Age. Of the major world religions, Judaism is considered one of the oldest monotheistic religions. The Hebrews / Israelites were already referred to as \"Jews\" in later books of the Tanakh such as the Book of Esther, with the term Jews replacing the title \"Children of Israel\". Judaism's texts, traditions and values strongly influenced later Abrahamic religions, including Christianity, Islam and the Baha'i Faith. Many aspects of Judaism have also directly or indirectly influenced secular Western ethics and civil law.\nJews are an ethnoreligious group and include those born Jewish and converts to Judaism. In 2012, the world Jewish population was estimated at about 14 million, or roughly 0.2% of the total world population. About 42% of all Jews reside in Israel and another 42% reside in North America, with most of the remainder living in Europe, and other minority groups spread throughout South America, Asia, Africa, and Australia.", "title": "Judaism"}