{"summary": "In the law, the judiciary or judicial system is the system of courts that administer justice in the name of the sovereign or state.", "full_text": "The judiciary  is the system of courts that interprets and applies the law in the name of the state. The judiciary also provides a mechanism for the resolution of disputes. Under the doctrine of the separation of powers, the judiciary generally does not make law  or enforce law , but rather interprets law and applies it to the facts of each case. This branch of the state is often tasked with ensuring equal justice under law. It usually consists of a court of final appeal , together with lower courts.\nIn many jurisdictions the judicial branch has the power to change laws through the process of judicial review. Courts with judicial review power, may annul the laws and rules of the state when it finds them incompatible with a higher norm, such as primary legislation, the provisions of the constitution or international law. Judges constitute a critical force for interpretation and implementation of a constitution, thus de facto in common law countries creating the body of constitutional law.\nIn the US during recent decades the judiciary became active in economic issues related with economic rights established by constitution because \"economics may provide insight into questions that bear on the proper legal interpretation\". Since many countries with transitional political and economic systems continue treating their constitutions as abstract legal documents disengaged from the economic policy of the state, practice of judicial review of economic acts of executive and legislative branches have begun to grow.\nIn the 1980s, the Supreme Court of India for almost a decade had been encouraging public interest litigation on behalf of the poor and oppressed by using a very broad interpretation of several articles of the Indian Constitution.\nBudget of the judiciary in many transitional and developing countries is almost completely controlled by the executive. The latter undermines the separation of powers, as it creates a critical financial dependence of the judiciary. The proper national wealth distribution including the government spending on the judiciary is subject of the constitutional economics. It is important to distinguish between the two methods of corruption of the judiciary: the state , and the private.\nThe term \"judiciary\" is also used to refer collectively to the personnel, such as judges, magistrates and other adjudicators, who form the core of a judiciary , as well as the staffs who keep the system running smoothly.\nIn some countries and jurisdictions, judiciary branch is expanded to include additional public legal professionals and institutions such as prosecutors, state lawyers, ombudsmen, public notaries, judicial police service and legal aid officers. These institutions are sometimes governed by the same judicial administration that governs courts, and in some cases the administration of the judicial branch is also the administering authority for private legal professions such as lawyers and private notary offices.", "title": "Judiciary"}