{"summary": "Judy Garland  was an American actress, singer and vaudevillian.", "full_text": "Judy Garland , born Frances Ethel Gumm, was an American singer, actress and vaudevillian. She was renowned for her vocals and attained international stardom which continued throughout a career that spanned more than 40 years as an actress in musical and dramatic roles, as a recording artist and on concert stages. Respected for her versatility, she received a Juvenile Academy Award and won a Golden Globe Award as well as Grammy Awards and a Special Tony Award.\nShe was nominated for the Academy Award for Best Actress for her role in the remake of A Star Is Born and for Best Supporting Actress for her performance in the 1961 film Judgment at Nuremberg. She remains the youngest recipient  of the Cecil B. DeMille Award for lifetime achievement in the motion picture industry.\nAfter appearing in vaudeville with her two older sisters, Garland was signed to Metro-Goldwyn-Mayer as a teenager. There, she made more than two dozen films, including nine with Mickey Rooney, and 1939's The Wizard of Oz. After 15 years, she was released from the studio but gained renewed success through record-breaking concert appearances, including a return to acting, beginning with critically acclaimed performances.\nDespite her professional triumphs, Garland struggled immensely in her personal life, starting when she was a child. Her self-image was strongly influenced by film executives, who said she was unattractive and constantly manipulated her onscreen physical appearance. She was plagued by financial instability, often owing hundreds of thousands of dollars in back taxes. She married five times, with her first four marriages ending in divorce. She also had a long battle with drugs and alcohol, which ultimately led to her death from a barbiturate overdose at the age of 47.\nIn 1997, Garland was posthumously awarded a Grammy Lifetime Achievement Award. Several of her recordings have been inducted into the Grammy Hall of Fame. In 1999, the American Film Institute placed her among the ten greatest female stars of Classic American cinema.", "title": "Judy Garland"}