{"summary": "Julius Kambarage Nyerere , also known as Mwalimu , was President of Tanzania from 1964 to 1985. He was born in Butiama, Tanganyika.", "full_text": "Julius Kambarage Nyerere  was a Tanzanian statesman who served as the leader of Tanzania, and previously Tanganyika, from 1960 until his retirement in 1985.\nBorn in Tanganyika to Nyerere Burito , Chief of the Zanaki, Nyerere was known by the Swahili honorific Mwalimu or 'teacher', his profession prior to politics. He was also referred to as Baba wa Taifa . Nyerere received his higher education at Makerere University in Kampala and the University of Edinburgh. After he returned to Tanganyika, he worked as a teacher. In 1954, he helped form the Tanganyika African National Union.\nWhen Tanganyika was granted responsible government in 1960, Nyerere became Chief Minister. He led Tanganyika to independence a year later and became the new country's first Prime Minister. The country became a republic in 1962, with Nyerere as the country's first president. During the first years, Nyerere created a single-party system and used \"preventive detention\" to eliminate trade unions and opposition political forces. In 1964, Tanganyika united politically with Zanzibar and was renamed Tanzania, with Nyerere as president of the unified country. He was the sole candidate for president in the unified country's first election, in 1965, and was reelected unopposed every five years until his retirement in 1985.\nIn 1967, influenced by the ideas of African socialism, Nyerere issued the Arusha Declaration, which outlined his vision of ujamaa . Ujamaa was a concept that came to dominate Nyerere's policies. However, his policies led to economic decline, systematic corruption, and unavailability of goods. In the early 1970s, Nyerere ordered his security forces to forcibly transfer much of the population to collective farms and, because of opposition from villagers, often burned villages down. This campaign pushed the nation to the brink of starvation and made it dependent on foreign food aid.\nIn 1985, after more than two decades in power, he relinquished power to his hand-picked successor, Ali Hassan Mwinyi. Nyerere left Tanzania as one of the poorest, least developed, and most foreign aid-dependent countries in the world, although much progress in services such as health and education had nevertheless been achieved. As such, Julius Nyerere is still a controversial figure in Tanzania. He remained the chairman of the Chama Cha Mapinduzi for another five years until 1990. He died of leukemia in London in 1999.\n^ \"Obituary: Julius Nyerere\". The Daily Telegraph. 15 October 1999. Retrieved 15 October 2013. \n^ \n^ \n^ \n^ \n^ \n^ \n^ http://www.policyforum-tz.org/files/LeeKyongKoo.pdf", "title": "Julius Nyerere"}