{"summary": "Kailasam Balachander  was an Indian movie director, screenwriter and producer.", "full_text": "Kailasam Balachander  was an Indian director, producer, writer, actor, playwright, stage conductor, and comedian who worked mainly in the Tamil film industry. He was well known for his distinct film-making style, and the Indian film industry knew him as a master of unconventional themes and hard-hitting contemporary subject matter. Balachander's films are well known for their portrayal of women as bold personalities and central characters. Popularly referred to as Iyakkunar Sigaram , his films are usually centred on unusual or complicated interpersonal relationships and social themes. Starting his cinematic career as a screenwriter, Balachander soon graduated as a director with Neerkumizhi in 1965. He was given a break into Tamil films by M. G. Ramachandran.\nIn a career that spread over 50 years, he had contributed to nearly 100 feature films either as a screenwriter or director, thus becoming one of the most prolific film-makers in the country. Known among his colleagues as a tough task master, he was credited with having nurtured numerous actors, notably Nagesh, Sujatha, Kamal Haasan, Rajinikanth, Nassar, Chiranjeevi, Jayaprada, Jayasudha, Saritha, Renuka, Prakash Raj , Ramesh Aravind and Vivek.\nAs of 2013, Balachander had won nine National Film Awards and 13 Filmfare Awards. He was honored with the Padma Shri, India's fourth highest civilian award, in 1987, and is a recipient of the ANR National Award and Dadasaheb Phalke Award, India's highest award in cinema. K. Balachander is revered as one of the best directors India has ever produced.\nA production house named Kavithalaya Productions which has been producing films since 1981 is Balachander's very own production house. Apart from Tamil, he had made films in other languages such as Telugu, Kannada and Hindi. He had also made a few film appearances and has directed a few TV serials as well. In the late 80s Balachander was one of the first to recognise and accept the development of TV as a very powerful media and created his own production house named Minbimbangal Productions along with his first son Bala Kailasam. Minbimbangal was considered by many as a pioneer in daily serials in Television media.\n\n", "title": "K. Balachander"}