{"summary": "Kabbalah  is a Jewish mysticism of the Torah.", "full_text": "Kabbalah  is an esoteric method, discipline, and school of thought that originated in Judaism. A traditional Kabbalist in Judaism is called a Mekubbal .\nKabbalah's definition varies according to the tradition and aims of those following it, from its religious origin as an integral part of Judaism, to its later Christian, New Age, and Occultist syncretic adaptations. Kabbalah is a set of esoteric teachings meant to explain the relationship between an unchanging, eternal, and mysterious Ein Sof  and the mortal and finite universe . While it is heavily used by some denominations, it is not a religious denomination in itself. It forms the foundations of mystical religious interpretation. Kabbalah seeks to define the nature of the universe and the human being, the nature and purpose of existence, and various other ontological questions. It also presents methods to aid understanding of the concepts and thereby attain spiritual realisation.\nKabbalah originally developed within the realm of Jewish thought, and kabbalists often use classical Jewish sources to explain and demonstrate its esoteric teachings. These teachings are held by followers in Judaism to define the inner meaning of both the Hebrew Bible and traditional Rabbinic literature and their formerly concealed transmitted dimension, as well as to explain the significance of Jewish religious observances.\nTraditional practitioners believe its earliest origins pre-date world religions, forming the primordial blueprint for Creation's philosophies, religions, sciences, arts, and political systems. Historically, Kabbalah emerged, after earlier forms of Jewish mysticism, in 12th- to 13th-century Southern France and Spain, becoming reinterpreted in the Jewish mystical renaissance of 16th-century Ottoman Palestine. It was popularised in the form of Hasidic Judaism from the 18th century onwards. Twentieth-century interest in Kabbalah has inspired cross-denominational Jewish renewal and contributed to wider non-Jewish contemporary spirituality, as well as engaging its flourishing emergence and historical re-emphasis through newly established academic investigation.", "title": "Kabbalah"}