{"summary": "Kelly Brianne Clarkson  is an American singer and actress.", "full_text": "Kelly Brianne Clarkson  is an American singer and songwriter. She rose to fame in 2002 after winning the first season of American Idol, and has since been established as \"The Original American Idol.\" Her debut single, \"A Moment Like This\", topped the United States Billboard Hot 100 and became the best-selling single of 2002 in the U.S. She became the runner-up of World Idol the following year. Clarkson's debut studio album, Thankful , debuted at number one on the Billboard 200. It was certified double platinum by the Recording Industry Association of America  while selling over 4.5 million copies worldwide. Its lead single, \"Miss Independent,\" became an international top-ten hit.\nTrying to reinvent her own image, Clarkson decided to part ways with American Idol management and developed a rock-oriented sound for her second album, Breakaway . It was certified sextuple-platinum and sold over 15 million copies worldwide. The album earned Clarkson two Grammy Awards for Best Pop Vocal Album and Best Female Pop Vocal Performance. Taking full creative control of her third album, My December , Clarkson served as the executive producer and co-wrote the entire album's material. Clarkson's fourth album, All I Ever Wanted , became her second album to debut at number one on the Billboard 200. Its lead single, \"My Life Would Suck Without You\", holds the record for the biggest jump to number one on the Billboard Hot 100.\nClarkson's fifth studio album, Stronger , won the Grammy Award for Best Pop Vocal Album, making her the only act to receive the award twice. The album scored her third number-one hit on the Billboard Hot 100, \"Stronger \", which remains the best-selling single of her career. Clarkson's sixth album and first Christmas music release, Wrapped in Red , became the best-selling holiday album of the year, making her the first American female artist to achieve this goal. In 2015, Clarkson released her seventh studio album, Piece by Piece, which debuted at number one on the Billboard 200, becoming her third number one album in the U.S. Its lead single, \"Heartbeat Song\" was certified platinum and became Clarkson's fifth consecutive number one on the US Hot Dance Club Songs.\nApart from her work in music, Clarkson has also ventured into television and film, beginning with her leading role in the romantic musical From Justin to Kelly . She is known for her vocal versatility and range. Her music has mainly dealt with themes of heartbreak, independence, and self-empowerment for women and young teens. Her musical work has also gained her numerous accolades, including three Grammy Awards, three MTV Video Music Awards, twelve Billboard Music Awards, four American Music Awards, and two Academy of Country Music Awards. In a career spanning over a decade, Clarkson has accumulated over 90 Billboard number-one hits and sold over 25 million albums worldwide. In 2012, Clarkson was ranked nineteenth on VH1's list of \"100 Greatest Women in Music.\" Billboard also ranked Clarkson as the 14th-best-selling artist of the 2000s.", "title": "Kelly Clarkson"}