{"summary": "The state of Texas is divided into 254 counties.", "full_text": "Kenneth Lewis Anderson  was a lawyer, the fourth and last Vice President of the Republic of Texas.\nAnderson was born in Hillsborough, North Carolina, where he worked as a shoemaker at an early age. By 1824 he was living in Bedford County, Tennessee, where he became deputy sheriff in 1826 and sheriff in 1830; he was a colonel in the militia by 1832.\nIn 1837 he and his family moved to San Augustine, Texas, where his wife's brother-in-law Joseph Rowe had lived for five years. In 1838 Anderson served successively as deputy sheriff and sheriff. It was probably after he arrived in Texas that he studied to become a lawyer. President of Texas Mirabeau B. Lamar appointed him collector of customs for the district of San Augustine, and he was confirmed on November 21, 1839. He served as collector until he became a candidate from San Augustine County for the Texas House of Representatives of the Sixth Congress in 1841; he won with the largest majority in San Augustine County's history at that time.\nAs a partisan of Sam Houston, Anderson was elected Speaker of the House on November 1, 1841. He immediately led an unsuccessful attempt to impeach President Lamar and Vice President David G. Burnet. Anderson had for a time been considered for secretary of the treasury of the republic, a post that went to William Henry Daingerfield. In 1842 he helped convince President Houston to veto the popular but dangerous war bill, which sought to force an invasion of Mexico.\nAfter one term, and despite Houston's pleas, Anderson retired later in 1842 to practice law in San Augustine with Royall T. Wheeler; he eventually formed a partnership with J. Pinckney Henderson and Thomas Jefferson Rusk. In December Anderson became district attorney of the Fifth Judicial District. In 1844 Anderson was frequently mentioned as a candidate for president of the republic, but eventually he became the candidate for vice president, on a ticket headed by Anson Jones. Anderson's opponent, Patrick Jack, died before the election, and Anderson won nearly unanimously. He presided over the Senate at Washington-on-the-Brazos, Texas in June 1845, when the Texas Congress approved the Texas Annexation by the United States.\nAfter the annexation vote he immediately left for home despite being sick. After only twenty miles, at the Fanthorp Inn in modern-day Anderson, Texas, his fever flared and he died in office at age 39. The Vice President had been considered the leading candidate to become the first governor of Texas. His law partner, Pinckney Henderson, was instead elected governor in December.\nBoth Anderson County and the town of Anderson in Texas are named for him.", "title": "Kenneth Lewis Anderson"}