{"summary": "The Kennedys have been a famous family in American politics and have had several members chosen to important positions in the U.S.", "full_text": "The Kennedy family is an American family of Irish descent who are prominent in American politics, government, and business. The first Kennedys to reside in America were Patrick Kennedy and Bridget Murphy, who sailed from Ireland to America in 1849. Their son P. J. went into politics and business. P. J. and his wife, Mary Hickey, were the parents of businessman and politician Joseph P. Kennedy, Sr. The four sons of Joe, Sr. and Rose Fitzgerald were Joe, Jr., John, Robert, and Ted. John served as president, while Robert and Ted both became prominent senators. The Kennedys' political involvement has revolved around the Democratic Party. Harvard University educations have been common among them, and they have contributed heavily to that university's John F. Kennedy School of Government. The wealth and glamour of the family members, as well as their extensive and continuing involvement in public service, has elevated them to iconic status over the past half-century, with the Kennedys sometimes referred to as \"America's Royal Family\".\nJoe, Sr. originally pinned his hopes on eldest son, Joseph Jr., to enter politics and be elected president. After Joe, Jr. was killed during World War II, however, those hopes later fell on his second son, John, to become president. Soon after John was elected in 1960, he, Robert, and Ted all held prominent positions in the federal government. They received intense publicity, often emphasizing their relative youth, allure, education, and future in politics. Between 1947 and 2011, there were 64 years with a Kennedy in elective office in Washington. This spans more than a quarter of the nation's existence.\nThe family has been at the center of many deaths, which contributed to the idea of the \"Kennedy curse\". Rosemary was forced to undergo a lobotomy which crippled her entire life; John and Robert were both assassinated during the 1960s; Ted was involved in the Chappaquiddick incident in 1969, which caused the death of his young colleague, Mary Jo Kopechne; and Joe, Jr., Kathleen, and John Jr. all died in plane crashes.\n\n", "title": "Kennedy family"}