{"summary": "Kingston upon Hull, often shortened to Hull, is a city and unitary authority in the East Riding of Yorkshire, England.", "full_text": "Kingston upon Hull , usually abbreviated to Hull, is a city and unitary authority in the East Riding of Yorkshire, England. It lies upon the River Hull at its junction with the Humber estuary, 25 miles  inland from the North Sea, with a population of 257,710 .\nThe town of Hull was founded late in the 12th century. The monks of Meaux Abbey needed a port where the wool from their estates could be exported. They chose a place at the junction of the rivers Hull and Humber to build a quay.\nThe exact year the town was founded is not known but it was first mentioned in 1193. Renamed Kings-town upon Hull by King Edward I in 1299, Hull has been a market town, military supply port, trading hub, fishing and whaling centre, and industrial metropolis.\nHull was an early theatre of battle in the English Civil Wars. Its 18th-century Member of Parliament, William Wilberforce, played a key role in the abolition of the slave trade in Britain.\nThe city is unique in the UK in having had a municipally owned telephone system from 1902, sporting cream, not red, telephone boxes.\nAfter suffering heavy damage in the Second World War , Hull weathered a period of post-industrial decline, gaining unfavourable results on measures of social deprivation, education and policing. In the early 21st-century spending boom before the late 2000s recession the city saw large amounts of new retail, commercial, housing and public service construction spending.\nTourist attractions include the historic Old Town and Museum Quarter, Hull Marina and The Deep, a city landmark. The redevelopment of one of Hull's main thoroughfares, Ferensway, included the opening of St. Stephen's Hull and the new Hull Truck Theatre. Spectator sports include Championship football and Super League Rugby. The KC Stadium houses Hull City football club and Hull FC rugby club and Craven Park rugby club Hull Kingston Rovers. Hull is also home to the English Premier Ice Hockey League Hull Pirates.\nIn 2013, it was announced that Hull would be the 2017 UK City of Culture.", "title": "Kingston upon Hull"}