{"summary": "A knight was a professional heavy cavalry soldier in the Middle Ages.", "full_text": "A knight  is a person granted an honorary title of knighthood by a monarch or other political leader for service to the Monarch or country, especially in a military capacity. Historically, in Europe, knighthood has been conferred upon mounted warriors. During the High Middle Ages, knighthood was considered a class of lower nobility. By the Late Middle Ages, the rank had become associated with the ideals of chivalry, a code of conduct for the perfect courtly Christian warrior. Often, a knight was a vassal who served as a fighter for a lord, with payment in the form of land holdings. The lords trusted the knights, who were skilled in battle on horseback. Since the early modern period, the title of knight is purely honorific, usually bestowed by a monarch, as in the British honours system, often for non-military service to the country. The modern female equivalent is Dame.\nHistorically, the ideals of chivalry were popularized in medieval literature, especially the Matter of Britain and Matter of France, the former based on Geoffrey of Monmouth's Historia Regum Britanniae , written in the 1130s. Sir Thomas Malory's Le Morte d'Arthur , written in 1485, was important in defining the ideal of chivalry which is essential to the modern concept of the knight as an elite warrior sworn to uphold the values of faith, loyalty, courage, and honour. Furthermore, Geoffroi de Charny's \"Book of Chivalry\" expounded upon the importance of Christian faith in every area of a Knights life. During the Renaissance, the genre of chivalric romance became popular in literature, growing ever more idealistic and eventually giving rise to a new form of realism in literature popularised by Miguel de Cervantes' Don Quixote. This novel explored the ideals of knighthood and their incongruity with the reality of Cervantes' world. In the late medieval period, new methods of warfare began to render classical knights in armour obsolete, but the titles remained in many nations.\nSome orders of knighthood, such as the Knights Templar, have become the subject of legend; others have disappeared into obscurity. Today, a number of orders of knighthood continue to exist in several countries, such as the English Order of the Garter, the Swedish Royal Order of the Seraphim, and the Royal Norwegian Order of St. Olav. Each of these orders has its own criteria for eligibility, but knighthood is generally granted by a head of state to selected persons to recognise some meritorious achievement.\nKnighthood in the Middle Ages was closely linked with horsemanship  from its origins in the 12th century until its final flowering as a fashion among the high nobility in the Duchy of Burgundy in the 15th century. This linkage is reflected in the etymology of chivalry, cavalier and related terms . The special prestige given to mounted warriors finds a parallel in the furusiyya in the Muslim world, and the Greek hippeus  and the Roman eques of Classical Antiquity.", "title": "Knight"}