{"summary": "Kylie Ann Minogue  is an Australian singer, songwriter and actress.", "full_text": "Kylie Ann Minogue, OBE , often known simply as Kylie, is an Australian-born singer, songwriter, and actress. She achieved recognition by starring in the Australian soap opera Neighbours, where she played tomboy mechanic Charlene Robinson. Appearing in the series for two years, Minogue's character married Scott Robinson, played by Jason Donovan in an episode viewed by nearly 20 million people in the United Kingdom which became one of the most watched Australian TV episodes ever worldwide. Since then, Minogue has been a recording artist and has achieved commercial success and critical acclaim in the entertainment industry. Minogue has been recognised with several honorific nicknames and has been referred to as the \"Princess of Pop\" and \"Goddess of Pop\".\nBorn in Melbourne in Australia, Minogue has for many years worked and lived in London. She signed to PWL in 1987 and released her first studio album Kylie the next year. In 1992, Minogue left PWL and signed with Deconstruction Records and where she created her self-titled studio album and Impossible Princess, both of which received positive reviews from critics. Returning to more mainstream dance-oriented music, Minogue signed to Parlophone and released \"Spinning Around\", which was considered a return to prominence. Her 2001 single \"Can't Get You Out of My Head\" became one of the most successful singles during the 2000s period, selling over ten million units, recognized as her \"signature song\" and was named \"...the catchiest song ever\" by Yahoo! Music. Her album Fever  was a hit in many countries, including the United States, a market in which Minogue had previously received little recognition. Throughout her career, Minogue has released many successful singles, including \"The Loco-Motion\", \"Especially for You\", \"Hand on Your Heart\", \"Better the Devil You Know\", \"Confide in Me\", \"Spinning Around\", \"Slow\", \"2 Hearts\" and \"All The Lovers\".\nIn 2005, while Minogue was on her Showgirl: The Greatest Hits Tour, she was diagnosed with breast cancer. After treatment, she resumed the tour under the title Showgirl: The Homecoming Tour, which critics viewed as a \"triumph\". Minogue resumed work as an actress and appeared in the films Moulin Rouge! , Jack & Diane, and Holy Motors  which met mixed reviews. In 2014, she appeared as a judge on the third series of The Voice UK and The Voice Australia. Her other ventures include product endorsements, children books and fashion. Minogue's own musical company Darenote has been registered throughout all her endorsed products, musical recordings and her own range of home ware.\nAs of 2015, Minogue had worldwide record sales of more than 80 million, and has received notable music awards. She has mounted several successful and critically acclaimed concert world tours and received a Mo Award for \"Australian Entertainer of the Year\" for her live performances. She was appointed by the French government as a Chevalier  of the Ordre des Arts et des Lettres, the junior grade of France's highest cultural honour, for her contribution to the enrichment of French culture. Minogue was awarded an honorary Doctor of Health Science  degree by Anglia Ruskin University in the United Kingdom for her work in raising awareness for breast cancer. In November 2011, on the 25th anniversary of the ARIA Music Awards, Minogue was inducted by the Australian Recording Industry Association into the ARIA Hall of Fame.", "title": "Kylie Minogue"}