{"summary": "A land mine  is a weapon that is put on the ground or just underneath the ground so that it explodes when a person or vehicle goes by.", "full_text": "A land mine is an explosive device concealed under or on the ground and designed to destroy or disable enemy targets, ranging from combatants to vehicles and tanks, as they pass over or near it. Such a device is typically detonated automatically by way of pressure when a target steps on it or drives over it, though other detonation mechanisms are also sometimes used. A land mine may cause damage by direct blast effect, by fragments that are thrown by the blast, or by both.\nThe name originates from the ancient practice of military mining, where tunnels were dug under enemy fortifications or troop formations by sappers. These killing tunnels  were at first collapsed to destroy targets located above, but they were later filled with explosives and detonated in order to cause even greater devastation.\nNowadays, in common parlance, land mines generally refer to devices specifically manufactured as anti-personnel or anti-vehicle weapons. Though many types of improvised explosive devices  can technically be classified as land mines, the term land mine is typically reserved for manufactured devices designed to be used by recognized military services, whereas IED is used for makeshift devices assembled by paramilitary, insurgent, or terrorist groups.\nThe use of land mines is controversial because of their potential as indiscriminate weapons. They can remain dangerous many years after a conflict has ended, harming the economy and civilians of many developing nations. With pressure from a number of campaign groups organised through the International Campaign to Ban Landmines, a global movement to prohibit their use led to the 1997 Convention on the Prohibition of the Use, Stockpiling, Production and Transfer of Anti-Personnel Mines and on their Destruction. Currently, a total of 161 nations are party to the Ottawa treaty.\n\n", "title": "Land mine"}