{"summary": "English is the de facto national language of the United States, with 82% of the population claiming it as a mother tongue, and some 96% claiming to speak it \"well\" or \"very well\".", "full_text": "Many languages are used, or historically have been used in the United States. The most commonly used language is English. There are also many languages indigenous to North America or to U.S. states or holdings in the Pacific region. Languages brought to the country by colonists or immigrants from Europe, Asia, or other parts of the world make up a large portion of the languages currently used; several languages, including creoles and sign languages, have also developed in the United States. Approximately 337 languages are spoken or signed by the population, of which 176 are indigenous to the area. Fifty-two languages formerly spoken in the country's territory are now extinct.\nThe most common language in the United States is known as American English. However, no official language exists at the federal level. There have been several proposals to make English the national language in amendments to immigration reform bills, but none of these bills have become law with the amendment intact. The situation is quite varied at the state and territorial levels, with some states mirroring the federal policy of adopting no official language in a de jure capacity, others adopting English alone, others officially adopting English as well as local languages, and still others adopting a policy of de facto bilingualism.\nSince the 1965 Immigration Act, Spanish is the second most common language in the country, and is spoken by approximately 35 million people. The United States holds the world's fifth largest Spanish-speaking population, outnumbered only by Mexico, Spain, Colombia, and Argentina; other estimates put the United States at over 50 million, second only to Mexico. Throughout the Southwestern United States, long-established Spanish-speaking communities coexist with large numbers of more recent Hispanophone immigrants. Although many new Latin American immigrants are less than fluent in English, nearly all second-generation Hispanic Americans speak English fluently, while only about half still speak Spanish.\nAccording to the 2000 US census, people of German ancestry make up the largest single ethnic group in the United States, and the German language ranks fifth. Italian, Polish, and French are still widely spoken among populations descending from immigrants from those countries in the early 20th century, but the use of these languages is dwindling as the older generations die. Russian is also spoken by immigrant populations.\nTagalog and Vietnamese have over one million speakers each in the United States, almost entirely within recent immigrant populations. Both languages, along with the varieties of the Chinese language, Japanese, and Korean, are now used in elections in Alaska, California, Hawaii, Illinois, New York, Texas, and Washington.\nNative American languages are spoken in smaller pockets of the country, but these populations are decreasing, and the languages are almost never widely used outside of reservations. Hawaiian, although having few native speakers, is an official language along with English at the state level in Hawaii. The state government of Louisiana offers services and documents in French, as does New Mexico in Spanish. Besides English, Spanish, French, German, Navajo and other Native American languages, all other languages are usually learned from immigrant ancestors that came after the time of independence or learned through some form of education.", "title": "Languages of the United States"}