{"summary": "Latvia is a country in Northern Europe.", "full_text": "Latvia , officially the Republic of Latvia , is a country in the Baltic region of Northern Europe, one of the three Baltic states. It is bordered by Estonia to the north, Lithuania to the south, Russia to the east, and Belarus to the southeast, as well as a maritime border to the west with Sweden. Latvia has 2,070,371 inhabitants and a territory of 64,589 km2 . The country has a temperate seasonal climate.\nLatvia is a democratic parliamentary republic established in 1918. The capital city is Riga, the European Capital of Culture 2014. Latvian is the official language. Latvia is a unitary state, divided into 118 administrative divisions, of which 109 are municipalities and 9 are cities.\nLatvians and Livs are the indigenous people of Latvia. Latvian is an Indo-European language; it and Lithuanian are the only two surviving Baltic languages. Despite foreign rule from the 13th to 20th centuries, the Latvian nation maintained its identity throughout the generations via the language and musical traditions. Latvia and Estonia share a long common history. As a consequence of the Soviet occupation, both countries are home to a large number of ethnic Russians , some of whom are non-citizens. Latvia is historically predominantly Protestant Lutheran, except for the Latgale region in the southeast, which has historically been predominantly Roman Catholic.\nThe Republic of Latvia was founded on 18 November 1918. However, its de facto independence was interrupted at the outset of World War II. In 1940, the country was forcibly incorporated into the Soviet Union, invaded and occupied by Nazi Germany in 1941, and re-occupied by the Soviets in 1944 to form the Latvian SSR for the next fifty years. The peaceful Singing Revolution, starting in 1987, called for Baltic emancipation of Soviet rule. It ended with the Declaration on the Restoration of Independence of the Republic of Latvia on 4 May 1990, and restoring de facto independence on 21 August 1991.\nLatvia is a member of NATO, the European Union, the United Nations, the Council of Europe, CBSS, the IMF, NB8, NIB, OSCE and WTO. It is currently in the accession process for joining the OECD. For 2013, Latvia was listed 48th on the Human Development Index and as a high income country until 1 July 2014. It used the Latvian lats as its currency until this was replaced by the euro on 1 January 2014.", "title": "Latvia"}