{"summary": "The law is a set of rules that people are made to follow by the state.", "full_text": "Law is a system of rules that are enforced through social institutions to govern behaviour. Laws can be made by a collective legislature or by a single legislator, resulting in statutes, by the executive through decrees and regulations, or by judges through binding precedent, normally in common law jurisdictions. Private individuals can create legally binding contracts, including arbitration agreements that may elect to accept alternative arbitration to the normal court process. The formation of laws themselves may be influenced by a constitution, written or tacit, and the rights encoded therein. The law shapes politics, economics, history and society in various ways and serves as a mediator of relations between people.\nA general distinction can be made between  civil law jurisdictions , in which the legislature or other central body codifies and consolidates their laws, and  common law systems, where judge-made precedent is accepted as binding law. Historically, religious laws played a significant role even in settling of secular matters, which is still the case in some religious communities, particularly Jewish, and some countries, particularly Islamic. Islamic Sharia law is the world's most widely used religious law.\nThe adjudication of the law is generally divided into two main areas referred to as  Criminal law and  Civil law. Criminal law deals with conduct that is considered harmful to social order and in which the guilty party may be imprisoned or fined. Civil law  deals with the resolution of lawsuits  between individuals or organizations. These resolutions seek to provide a legal remedy  to the winning litigant. Under civil law, the following specialties, among others, exist: Contract law regulates everything from buying a bus ticket to trading on derivatives markets. Property law regulates the transfer and title of personal property and real property. Trust law applies to assets held for investment and financial security. Tort law allows claims for compensation if a person's property is harmed. Constitutional law provides a framework for the creation of law, the protection of human rights and the election of political representatives. Administrative law governs what executive branch agencies may and may not do, procedures that they must follow to do it, and judicial review when a member of the public is harmed by an agency action. International law governs affairs between sovereign states in activities ranging from trade to military action. To implement and enforce the law and provide services to the public by public servants, a government's bureaucracy, military, and police are vital. While all these organs of the state are creatures created and bound by law, an independent legal profession and a vibrant civil society inform and support their progress.\nLaw provides a rich source of scholarly inquiry into legal history, philosophy, economic analysis and sociology. Law also raises important and complex issues concerning equality, fairness, and justice. There is an old saying that 'all are equal before the law', although Jonathan Swift argued that 'Laws are like cobwebs, which may catch small flies, but let wasps and hornets break through.' In 1894, the author Anatole France said sarcastically, \"In its majestic equality, the law forbids rich and poor alike to sleep under bridges, beg in the streets, and steal loaves of bread.\" Writing in 350 BC, the Greek philosopher Aristotle declared, \"The rule of law is better than the rule of any individual.\" Mikhail Bakunin said: \"All law has for its object to confirm and exalt into a system the exploitation of the workers by a ruling class\". Cicero said \"more law, less justice\". Marxist doctrine asserts that law will not be required once the state has withered away.", "title": "Law"}