{"summary": "Lawrencium is a chemical element.", "full_text": "Lawrencium is a synthetic chemical element with chemical symbol Lr  and atomic number 103. It is named in honor of Ernest Lawrence, inventor of the cyclotron, a device that was used to discover many artificial radioactive elements. A radioactive metal, lawrencium is the eleventh transuranic element and is also the final member of the actinide series. Like all elements with atomic number over 100, lawrencium can only be produced in particle accelerators by bombarding lighter elements with charged particles. Eleven isotopes of lawrencium are currently known; the most stable is 262Lr with a half-life of 3.6 hours, but the shorter-lived 260Lr  is most commonly used in chemistry because it can be produced on a larger scale. A new isotope, 266Lr, with a half-life of 11 hours has been reported but not confirmed.\nChemistry experiments have confirmed that lawrencium indeed behaves as a heavier homolog to lutetium in the periodic table, and is a trivalent element. It thus could also be classified as the first of the 7th-period transition metals: however, its electron configuration is anomalous for its position in the periodic table, having an s2p configuration instead of the s2d configuration of its homolog lutetium. This means that lawrencium may be less volatile than expected for its position in the periodic table and have a volatility comparable to that of lead.\nIn the 1950s, 1960s, and 1970s, many claims of the synthesis of lawrencium of varying quality were made from laboratories in the Soviet Union and the United States. The priority of the discovery and therefore the naming of the element was disputed between Soviet and American scientists, and while the International Union of Pure and Applied Chemistry  established lawrencium as the official name for the element and gave the American team credit for the discovery, this was reevaluated in 1997, giving both teams shared credit for the discovery but not changing the element's name.", "title": "Lawrencium"}