{"summary": "The League of Nations  was the predecessor to the United Nations.", "full_text": "The League of Nations  was an intergovernmental organisation founded on 10 January 1920 as a result of the Paris Peace Conference that ended the First World War. It was the first international organisation whose principal mission was to maintain world peace. Its primary goals, as stated in its Covenant, included preventing wars through collective security and disarmament and settling international disputes through negotiation and arbitration. Other issues in this and related treaties included labour conditions, just treatment of native inhabitants, human and drug trafficking, arms trade, global health, prisoners of war, and protection of minorities in Europe. At its greatest extent from 28 September 1934 to 23 February 1935, it had 58 members.\nThe diplomatic philosophy behind the League represented a fundamental shift from the preceding hundred years. The League lacked its own armed force and depended on the Great Powers to enforce its resolutions, keep to its economic sanctions, or provide an army when needed. However, the Great Powers were often reluctant to do so. Sanctions could hurt League members, so they were reluctant to comply with them. During the Second Italo-Abyssinian War, when the League accused Italian soldiers of targeting Red Cross medical tents, Benito Mussolini responded that \"the League is very well when sparrows shout, but no good at all when eagles fall out.\"\nAfter a number of notable successes and some early failures in the 1920s, the League ultimately proved incapable of preventing aggression by the Axis powers in the 1930s. Germany withdrew from the League, as did Japan, Italy, Spain, and others. The onset of the Second World War showed that the League had failed its primary purpose, which was to prevent any future world war. The League lasted for 26 years; the United Nations  replaced it after the end of the Second World War on 20 April 1946 and inherited a number of agencies and organisations founded by the League.", "title": "League of Nations"}