{"summary": "Lee Harvey Oswald  was, according to five government investigations, the sniper who assassinated U.S.", "full_text": "Lee Harvey Oswald  was an American sniper who assassinated President John F. Kennedy on November 22, 1963. According to five U.S. government investigations, Oswald shot and killed Kennedy as he traveled by motorcade through Dealey Plaza in the city of Dallas, Texas.\nOswald was a former U.S. Marine who defected to the Soviet Union in October 1959. He lived in the city of Minsk in Belarus until June 1962, at which time he returned to the United States. Oswald was initially arrested for the murder of police officer J. D. Tippit, who was killed on a Dallas street approximately 45 minutes after President Kennedy was shot. Oswald was later charged with the murder of President Kennedy; he denied shooting anybody, saying that he was a patsy. Two days later, while being transferred from police headquarters to the county jail, Oswald was shot and mortally wounded by Dallas nightclub owner Jack Ruby in full view of television cameras broadcasting live.\nIn 1964, the Warren Commission concluded that Oswald acted alone in assassinating Kennedy, firing three shots. This conclusion was supported by previous investigations carried out by the Federal Bureau of Investigation, the Secret Service, and Dallas Police Department.\nDespite forensic, ballistic, and eyewitness evidence supporting the lone gunman theory, public opinion polls taken over the years have shown that most Americans believe that Oswald did not act alone, but conspired with others to kill the president, and the assassination has spawned numerous conspiracy theories. In 1979, the House Select Committee on Assassinations concluded that Oswald fired the shots that killed Kennedy, but differed from previous investigations in concluding that \"scientific acoustical evidence establishes a high probability that two gunmen fired at President John F. Kennedy\". The House Select Committee's acoustical evidence has since been discredited.", "title": "Lee Harvey Oswald"}