{"summary": "In politics, left-wing means an attitude that sees social equality as very important.", "full_text": "Left-wing politics are political positions or activities that accept or support social equality, often in opposition to social hierarchy and social inequality. They typically involve concern for those in society who are perceived as disadvantaged relative to others and a belief that there are unjustified inequalities that need to be reduced or abolished.\nThe political terms Left and Right were coined during the French Revolution , referring to the seating arrangement in the Estates General: those who sat on the left generally opposed the monarchy and supported the revolution, including the creation of a republic and secularization, while those on the right were supportive of the traditional institutions of the Old Regime. Use of the term \"Left\" became more prominent after the restoration of the French monarchy in 1815 when it was applied to the \"Independents\". The word \"wing\" was appended to Left and Right in the late 19th century, usually with disparaging intent, and \"left-wing\" was applied to those who were unorthodox in their religious or political views.\nThe term was later applied to a number of movements, especially republicanism during the French Revolution in the 18th century, followed by socialism, communism, anarchism and social democracy in the 19th and 20th centuries. Since then, the term left-wing has been applied to a broad range of movements including civil rights movements, feminist movements, anti-war movements, and environmental movements, as well as a wide range of parties.\nAccording to author Barry Clark, \"Leftists  claim that human development flourishes when individuals engage in cooperative, mutually respectful relations that can thrive only when excessive differences in status, power, and wealth are eliminated.\" The Left includes different and conflicting positions, most notably between the centre-left, which promotes equality of opportunities, and the far-left that supports equality of outcome.", "title": "Left-wing"}