{"summary": "The Federal Republic of Germany, also called Germany , is a country in Central Europe.", "full_text": "Lesbian, gay, bisexual and transgender  rights in Germany have evolved significantly over the course of the last decades. During the 1920s, LGBT people in Berlin were generally tolerated by society and many bars and clubs specifically pertaining to gay men were opened. Although same-sex sexual activity between men was already made illegal under Paragraph 175 by the German Empire in 1871, Nazi Germany extended these laws during World War II, which resulted in the persecution and deaths of thousands of homosexual citizens. The Nazi extensions were repealed in 1950 and same-sex sexual activity between men was decriminalized in both East and West Germany in 1968 and 1969. The age of consent was equalized in unified Germany in 1994.\nAlthough same-sex marriage is not legal in Germany, registered partnerships for same-sex couples have been legal since 2001, which provides most of the same rights as opposite-sex married couples receive. Same-sex step adoption has also been legal since 2004, however, joint adoption has not yet been legislated. Discrimination protections on the basis of sexual orientation and gender identity vary across Germany, but discrimination in employment and the provision of goods and services is in principle banned countrywide. Transsexuals have been allowed to change their legal gender since 1980, although more controversially, as recently as 2011, law still required transsexuals to undergo surgical alteration of their genitals in order to have key identity documents changed. This has since been declared unconstitutional. Germany has become the first country in Europe to enact a law that allows German citizens to choose to neither identify as male or female on their birth certificate, which has been said to specifically benefit hermaphrodites and intersex persons.\nDespite two of the three political parties in the German government being socially conservative on the issues of LGBT rights, Germany has frequently been seen as one of the most gay friendly countries in the world. Recent polls have indicated that a majority of Germans support same-sex marriage. Another poll in 2013 indicated that 87% of Germans viewed that homosexuality should be accepted by society, which was the second highest in the world following Spain . Berlin has been referred to by publications as one of the most gay friendly cities in the world. The former mayor of Berlin, Klaus Wowereit, is one of the most famous openly gay men in Germany.", "title": "LGBT rights in Germany"}