{"summary": "Liberalism is a way of thinking about politics and government.", "full_text": "Liberalism is a political philosophy or worldview founded on ideas of liberty and equality. The former principle is stressed in classical liberalism while the latter is more evident in social liberalism. Liberals espouse a wide array of views depending on their understanding of these principles, but generally they support ideas and programs such as freedom of speech, freedom of the press, freedom of religion, free markets, civil rights, democratic societies, secular governments, and international cooperation.\nLiberalism first became a distinct political movement during the Age of Enlightenment, when it became popular among philosophers and economists in the Western world. Liberalism rejected the notions, common at the time, of hereditary privilege, state religion, absolute monarchy, and the Divine Right of Kings. The 17th-century philosopher John Locke is often credited with founding liberalism as a distinct philosophical tradition. Locke argued that each man has a natural right to life, liberty and property, while adding that governments must not violate these rights based on the social contract. Liberals opposed traditional conservatism and sought to replace absolutism in government with representative democracy and the rule of law.\nProminent revolutionaries in the Glorious Revolution, the American Revolution, and the French Revolution used liberal philosophy to justify the armed overthrow of what they saw as tyrannical rule. Liberalism started to spread rapidly especially after the French Revolution. The 19th century saw liberal governments established in nations across Europe, South America, and North America. In this period, the dominant ideological opponent of classical liberalism was conservatism, but liberalism later survived major ideological challenges from new opponents, such as fascism and communism. During the 20th century, liberal ideas spread even further as liberal democracies found themselves on the winning side in both world wars. In Europe and North America, the establishment of social liberalism became a key component in the expansion of the welfare state. Today, liberal parties continue to wield power and influence throughout the world.", "title": "Liberal"}