{"summary": "Libya , officially the State of Libya, is a country in North Africa.", "full_text": "Libya  is a country in the Maghreb region of North Africa bordered by the Mediterranean Sea to the north, Egypt to the east, Sudan to the southeast, Chad and Niger to the south, and Algeria and Tunisia to the west. The three traditional parts of the country are Tripolitania, Fezzan and Cyrenaica. With an area of almost 1.8 million square kilometres , Libya is the fourth largest country in Africa, and is the 16th largest country in the world. Libya has the 10th-largest proven oil reserves of any country in the world.\nThe largest city and capital, Tripoli, is located in western Libya and contains over one million of Libya's six million people. The other large city is Benghazi, which is located in eastern Libya.\nLibya has been inhabited by Berbers since the late Bronze Age. The Phoenicians established trading posts in western Libya, and Ancient Greek colonists established city-states in eastern Libya. Libya was variously ruled by Persians, Egyptians and Greeks before becoming a part of the Roman Empire. Libya was an early center of Christianity. After the fall of the Western Roman Empire, the area of Libya was mostly occupied by the Vandals until the 7th century, when invasions brought Islam and Arab colonization. In the sixteenth century, the Spanish Empire and the Knights of St John occupied Tripoli, until Ottoman rule began in 1551. Libya was involved in the Barbary Wars of the 18th and 19th centuries. Ottoman rule continued until the twentieth-century Italian occupation of Libya and large-scale Italian immigration. Italian rule ended during the Second World War, during which Libya was an important area of warfare. The Italian population then went into decline. Libya became an independent kingdom in 1951.\nIn 1969, a military coup overthrew King Idris I, beginning a period of brutal suppression of dissent. The most prominent coup conspirator, Muammar Gaddafi, was ultimately able to fully concentrate power in his own hands during the Libyan Cultural Revolution. Muammar Gaddafi remained in power until a civil war in 2011, in which the rebels were supported by NATO. Since then, Libya has experienced instability and political violence which has severely affected both commerce and oil production. The European Union is involved in an \"operation to disrupt human smuggling networks\" fleeing the war for Europe.\nAt least two political bodies claim to be the government of Libya. The Council of Deputies is internationally recognized as the legitimate government, but it does not hold ground in the capital of Tripoli, instead meeting in the eastern city of Tobruk. Meanwhile, the new General National Congress purports to be the legal continuation of the General National Congress, which was elected in July 2012 and was dissolved following the June 2014 elections but then reconvened by a minority of its members. The Supreme Court in Libya Dawn-controlled Tripoli declared the Tobruk government unconstitutional in November 2014, but the internationally recognized government has rejected the ruling as made under threat of violence. Parts of Libya are outside of either government's control, with various Islamist, rebel, and tribal militias administering some cities and areas. The United Nations is sponsoring peace talks between the Tobruk and Tripoli-based factions.", "title": "Libya"}