{"summary": "In international law a political entity needs to fulfill different criteria to become a state: One of these criteria is that other states must recognize it as a state.", "full_text": "A number of geopolitical entities have declared statehood and have sought recognition as de jure sovereign states with varying degrees of success. In the past, similar entities have existed. As of 2015 there are entities claiming independence, often with de facto control of their territory, with recognition ranging from complete non-recognition to complete recognition by all states.\nThere are two traditional doctrines that provide indicia of when a de jure sovereign state should be recognised as a member of the international community. The \"declarative\" theory defines a state as a person in international law if it meets the following criteria:\na defined territory\na permanent population\na government, and\na capacity to enter into relations with other states.\nAccording to declarative theory, an entity's statehood is independent of its recognition by other states. By contrast, the \"constitutive\" theory defines a state as a person of international law if it is recognised as such by another state that is already a member of the international community.\nSeveral entities reference either or both doctrines in order to legitimise their claims to statehood. There are, for example, entities which meet the declarative criteria , but their statehood is not recognised by one or more other states. Non-recognition is often a result of conflicts with other countries that claim those entities as integral parts of their territory. In other cases, two or more partially recognised entities may claim the same territorial area, with each of them de facto in control of a portion of it . Entities that are recognised by only a minority of the world's states usually reference the declarative doctrine to legitimise their claims.\nIn many situations, international non-recognition is influenced by the presence of a foreign military force in the territory of the presumptive, self-declaring independent entity, so to make problematic the description of the country de facto status. The international community can judge this military presence too intrusive, reducing the entity to a puppet state where effective sovereignty is retained by the foreign power. Historical cases in this sense can be seen in Japanese-led Manchukuo or German-created Slovak Republic and Independent State of Croatia before and during World War II. In the 1996 case Loizidou vs. Turkey, the European Court of Human Rights judged Turkey for having exercised authority in the territory of Northern Cyprus.\nThere are also entities which do not have control over any territory or do not unequivocally meet the declarative criteria for statehood but have been recognised to exist de jure as sovereign entities by at least one other state. Historically this has happened in the case of the Holy See , the Sovereign Military Order of Malta, Estonia, Latvia and Lithuania , among other cases. See list of governments in exile for unrecognised governments without control over the territory claimed.", "title": "List of unrecognized countries"}