{"summary": "This is a list of elements by symbol.", "full_text": "In chemistry, a symbol is a code for a chemical element. It is usually derived from the name of the element, often in Latin.\n\nFor example, \"He\" is the symbol for helium , \"Pb\" for lead , \"W\" for tungsten . Only the first letter is capitalized. Temporary symbols assigned to newly or not-yet synthesized elements use 3-letter symbols based on their atomic numbers. For example, \"Uno\" was the temporary symbol for hassium which had the temporary name of unniloctium and \"Uuo\" is the symbol for ununoctium  with the atomic mass 118.\nChemical symbols may be modified by the use of prepended superscripts or subscripts to specify a particular isotope of an atom. Additionally, appended superscripts may be used to indicate the ionization or oxidation state of an element. They are widely used in chemistry and they have been officially chosen by the International Union of Pure and Applied Chemistry. There are also some historical symbols that are currently not official any more.\nAttached subscripts or superscripts specifying a nucleotide or molecule have the following meanings and positions:\nThe nucleon number  is shown in the left superscript position \nThe proton number  may be indicated in the left subscript position \nIf necessary, a state of ionization or an excited state may be indicated in the right superscript position . In astronomy, non-ionised atomic hydrogen is often known as \"H I\", and ionised hydrogen as \"H II\".\nThe number of atoms of an element in a molecule or chemical compound is shown in the right subscript position \nA radical is indicated by a dot on the right side \nIn Chinese, each chemical element has a dedicated character, usually created for the purpose . However, Latin symbols are also used, especially in formulas.\n\nA list of current, dated, as well as proposed and historical signs and symbols is included here with its signification. Also given is each element's atomic number, atomic weight or the atomic mass of the most stable isotope, group and period numbers on the periodic table, and etymology of the symbol.", "title": "List of elements by symbol"}