{"summary": "Texas is the second largest state in the United States.", "full_text": "The Governor of Texas is the chief executive of the U.S. State of Texas, the presiding officer over the executive branch of the Texas state government, and the commander-in-chief of the Texas National Guard, the state's militia. The governor has the power to consider bills passed by the Texas Legislature, by signing them into law, or vetoing them, and in bills relating to appropriations, the power of a line-item veto. He may convene the legislature, and grant pardons and reprieves, except in cases of impeachment, and upon the permission of the legislature, in cases of treason. The state provides and official residence, the Governor's Mansion in Austin. The incumbent, Greg Abbott, is the forty-eighth governor, of whom two have been women, to serve in the office since Texas' statehood in 1845.\nWhen compared to those of other states, the Governorship of Texas has been described as one of relative weakness. In some respects, it is the Lieutenant Governor of Texas, who presides over the Texas Senate, who possesses greater influence to exercise their prerogatives.\nThe governor is inaugurated on the third Tuesday of January every four years along with the Lieutenant Governor, and serves a term of four years. Prior to the present laws, in 1845, the state's first constitution established the office of governor, serving a term of two years, but no more than four years of every six. The 1861 constitution, following secession from the Union, established the first Monday of November following election as the term's start. Following the end of the American Civil War, the 1866 constitution increased term length to four years, limiting overall service to no more than eight years of every twelve, moving the term's start to the first Thursday following organization of the legislature, or \"as soon thereafter as practicable.\" The constitution of 1869, enacted during Reconstruction, removed term limitations, to this day making Texas one of fourteen states with no limit on gubernatorial terms. The present constitution of 1876 returned terms to two years, but a 1972 amendment again returned them to four.\nSince its establishment, four men have served in excess of eight years as governor: Allan Shivers, Price Daniel, John Connally, and Rick Perry. Perry, the longest-serving governor in state history, assumed the governorship in 2000 upon the exit of George W. Bush, who resigned to take office as President of the United States and was re-elected in 2002, 2006 and 2010.\nShivers assumed the governorship upon the death of Beauford Jester in July 1949 and was re-elected in 1950, 1952 and 1954. Daniel was elected to the governorship in 1956 and re-elected in 1958 and 1960 before losing his re-election for an unprecedented fourth term in the 1962 Democratic primary, missing the runoff. Connally was elected in 1962 and re-elected in 1964 and 1966 before choosing to retire in 1968.\nIn the case of a vacancy in the office, the lieutenant governor becomes governor. Prior to a 1999 amendment, the lieutenant governor only acted as governor until the expiration of the term to which he succeeded.\n\n", "title": "List of Governors of Texas"}