{"summary": "This is a list of the Emperors of the late Eastern Roman Empire, called Byzantine by modern historians.", "full_text": "This is a list of the Byzantine emperors from the foundation of Constantinople in 330 AD, which marks the conventional start of the Eastern Roman or Byzantine Empire, to its fall to the Ottoman Empire in 1453 AD. Only the emperors who were recognized as legitimate rulers and exercised sovereign authority are included, to the exclusion of junior co-emperors  who never attained the status of sole or senior ruler, as well as of the various usurpers or rebels who claimed the imperial title.\nTraditionally, the line of Byzantine emperors is held to begin with the Roman Emperor Constantine the Great, the first Christian emperor, who rebuilt the city of Byzantium as an imperial capital, Constantinople, and who was regarded by the later Byzantine emperors as the model ruler. It was under Constantine that the major characteristics of what is considered the Byzantine state emerged: a Roman polity centered at Constantinople and culturally dominated by the Greek East, with Christianity as the state religion.\nAll Byzantine emperors considered themselves \"Roman Emperors\"; the term \"Byzantine\" was coined by Western historiography only in the 16th century. The use of the title \"Roman Emperor\" was not contested until after the Papal coronation of the Frankish Charlemagne as \"Holy Roman Emperor\" , done partly in response to the Byzantine coronation of Empress Irene, whose claim, as a woman, was not recognized by Pope Leo III.\nThe title of all Emperors preceding Heraclius was officially \"Augustus,\" although other titles such as Dominus were also used. Their names were preceded by Imperator Caesar and followed by Augustus. Following Heraclius, the title commonly became the Greek Basileus , which had formerly meant sovereign but was then used in place of Augustus. Following the establishment of the rival Holy Roman Empire in Western Europe, the title \"Autokrator\"  was increasingly used. In later centuries, the Emperor could be referred to by Western Christians as the \"Emperor of the Greeks.\" Towards the end of the Empire, they referred to themselves as \" in Christ, Emperor and Autocrat of the Romans\" .\nIn the medieval period, dynasties were common, but the principle of hereditary succession was never formalized in the Empire, and hereditary succession was a custom rather than an inviolable principle.\nIncluding the Palaiologan dynasty, claimed Byzantine Emperors in exile, there were a total of 99 Emperors of the thousand-year-old Eastern Roman Empire.\n\n", "title": "List of Byzantine Emperors"}