{"summary": "This is a list of religions and spiritual traditions.", "full_text": "Religion is a collection of cultural systems, beliefs, and world views that establishes symbols that relate humanity to spirituality and, sometimes to moral values. While religion is hard to define, one standard model of religion, used in religious studies courses, was proposed by Clifford Geertz, who simply called it a \"cultural system.\" A critique of Geertz's model by Talal Asad categorized religion as \"an anthropological category.\" Many religions have narratives, symbols, traditions, and sacred histories that are intended to give meaning to life or to explain the origin of life or the universe. They tend to derive morality, ethics, religious laws, or a preferred lifestyle from their ideas about the cosmos and human nature. According to some estimates, there are roughly 4,200 religions in the world.\nThe word religion is sometimes used interchangeably with \"faith\" or \"belief system\", but religion differs from private belief in that it has a public aspect. Most religions have organized behaviors, including clerical hierarchies, a definition of what constitutes adherence or membership, congregations of laity, regular meetings or services for the purposes of veneration of a deity or for prayer, holy places , and/or religious texts. Certain religions also have a sacred language often used in liturgical services. The practice of a religion may also include sermons, commemoration of the activities of a god or gods, sacrifices, festivals, feasts, trance, initiations, funerals, marriages, meditation, music, art, dance, public service, or other aspects of human culture. Religious beliefs have also been used to explain parapsychological phenomena such as out-of-body experiences, near-death experiences and reincarnation, along with many other paranormal experiences.\nSome academics studying the subject have divided religions into three broad categories: world religions, a term which refers to transcultural, international faiths; indigenous religions, which refers to smaller, culture-specific or nation-specific religious groups; and new religious movements, which refers to recently developed faiths. One modern academic theory of religion, social constructionism, says that religion is a modern concept that suggests all spiritual practice and worship follows a model similar to the Abrahamic religions as an orientation system that helps to interpret reality and define human beings, and thus religion, as a concept, has been applied inappropriately to non-Western cultures that are not based upon such systems, or in which these systems are a substantially simpler construct.", "title": "List of religions and spiritual traditions"}