{"summary": "Little Rock is the capital city and largest city of the U.S.", "full_text": "Little Rock is the capital and the most populous city of the U.S. state of Arkansas. It is also the county seat of Pulaski County. It was incorporated on November 7, 1831 on the south bank of the Arkansas River very near the geographic center of the state. The city derives its name from a small rock formation along the river, named \"La Petite Roche\" by the French in 1799. The capital of the Arkansas Territory was moved to Little Rock from Arkansas Post in 1821. The city's population was 193,524 at the 2010 census. The five-county Little Rock-North Little Rock-Conway, AR Metropolitan Statistical Area  is ranked 75th in terms of population in the United States with 724,385 residents according to the 2013 estimate by the United States Census Bureau.\nLittle Rock is a major cultural, economic, government and transportation center within Arkansas and the South. The city includes cultural institutions such as the Arkansas Arts Center, the Arkansas Repertory Theatre, and the Arkansas Symphony Orchestra, in addition to the hiking, boating, and other outdoor recreational opportunities. Little Rock's history is also available to residents and visitors in a variety of ways; history museums, historic districts or neighborhoods like the Quapaw Quarter, and historic sites like Little Rock Central High School. The city is the headquarters of Dillard's, Windstream Communications, Acxiom, Stephens Inc., University of Arkansas for Medical Sciences, Heifer International, the Clinton Foundation, and the Rose Law Firm. Other large corporations, including Dassault Falcon Jet and LM Wind Power have large operations in the city. State government is also a large employer, with most offices being located in downtown Little Rock. Two major Interstate highways, Interstate 30 and Interstate 40 meet in Little Rock, with the Port of Little Rock serving as a major shipping hub.", "title": "Little Rock, Arkansas"}