{"summary": "Little Boy is the name that was given to the first atomic bomb that was dropped in a war.", "full_text": "Little Boy was the codename for the type of atomic bomb dropped on the Japanese city of Hiroshima on 6 August 1945 by the Boeing B-29 Superfortress Enola Gay, piloted by Colonel Paul W. Tibbets, Jr., commander of the 509th Composite Group of the United States Army Air Forces. It was the first atomic bomb to be used in warfare. The Hiroshima bombing was the second artificial nuclear explosion in history, after the Trinity test, and the first uranium-based detonation. It exploded with an energy of approximately 15 kilotons of TNT . The bomb caused significant destruction to the city of Hiroshima.\nLittle Boy was developed by Lieutenant Commander Francis Birch's group of Captain William S. Parsons's Ordnance  Division at the Manhattan Project's Los Alamos Laboratory during World War II. Parsons flew on the Hiroshima mission as weaponeer. The Little Boy was a development of the unsuccessful Thin Man nuclear bomb. Like Thin Man, it was a gun-type fission weapon, but derived its explosive power from the nuclear fission of uranium-235. This was accomplished by shooting a hollow cylinder of uranium over another hollow enriched uranium cylinder by means of a charge of nitrocellulose propellant powder. It contained 64 kg  of enriched uranium, of which less than a kilogram underwent nuclear fission. Its components were fabricated at three different plants so that no one would have a copy of the complete design.\nAfter the war ended, it was not expected that the inefficient Little Boy design would ever again be required, and many plans and diagrams were destroyed, but by mid-1946 the Hanford Site reactors were suffering badly from the Wigner effect, so six Little Boy assemblies were produced at Sandia Base. The Navy Bureau of Ordnance built another 25 Little Boy assemblies in 1947 for use by the nuclear-capable Lockheed P2V Neptune aircraft carrier aircraft. All the Little Boy units were withdrawn from service by the end of January 1951.", "title": "Little Boy"}