{"summary": "Liverpool is a city in Merseyside, United Kingdom.", "full_text": "Liverpool  is a city in Merseyside, England. A borough from 1207 and a city from 1880, in 2014 the city local government district had a population of 470,537 and the wider Liverpool/Birkenhead metropolitan area had a population of 2,241,000.\nLiverpool is in the south west of the historic county of Lancashire in North West England, on the eastern side of the Mersey Estuary. The town historically lay within the ancient Lancashire division of West Derby known as a \"hundred\".\nThe urbanisation and expansion of the city were largely brought about by its advantageous location during the industrial revolution status that led to its growth as a major port, which included its participation in the Atlantic slave trade. Liverpool was the port of registry of the ocean liner RMS Titanic, and many other Cunard and White Star ocean liners such as the RMS Lusitania, Queen Mary, and Olympic. Liverpool's status as a port city has contributed to its diverse population, which, historically, was drawn from a wide range of peoples, cultures, and religions, particularly those from Ireland. The city is also home to the oldest Black African community in the country and the oldest Chinese community in Europe.\nNatives of Liverpool are referred to as Liverpudlians  and colloquially as \"Scousers\", a reference to \"scouse\", a form of stew. The word \"Scouse\" has also become synonymous with the Liverpool accent and dialect.\nTourism forms a significant part of the city's modern economy. The city celebrated its 800th anniversary in 2007, and it held the European Capital of Culture title together with Stavanger, Norway, in 2008. Labelled the \"World Capital City of Pop\" by Guinness World Records, the popularity of The Beatles, and other groups from the Merseybeat era and later, contributes to Liverpool's status as a tourist destination.\nSeveral areas of Liverpool city centre were granted World Heritage Site status by UNESCO in 2004. The Liverpool Maritime Mercantile City includes the Pier Head, Albert Dock, and William Brown Street. Liverpool is also the home of two Premier League football clubs, Liverpool and Everton. Matches between the two are known as the Merseyside derby. The world-famous Grand National also takes places annually at Aintree Racecourse on the outskirts of the city.", "title": "Liverpool"}