{"summary": "The Hague  is the third-largest city in the Netherlands, after Amsterdam and Rotterdam.", "full_text": "Lobbying  is the act of attempting to influence decisions made by officials in a government, most often legislators or members of regulatory agencies. Lobbying is done by many types of people, associations and organized groups, including individuals in the private sector, corporations, fellow legislators or government officials, or advocacy groups . Lobbyists may be among a legislator's constituencies, meaning a voter or block of voters within his or her electoral district, or not; they may engage in lobbying as a business, or not. Professional lobbyists are people whose business is trying to influence legislation on behalf of a group or individual who hires them. Individuals and nonprofit organizations can also lobby as an act of volunteering or as a small part of their normal job . Governments often define and regulate organized group lobbying that has become influential.\nThe ethics and morality of lobbying are dual-edged. Lobbying is often spoken of with contempt, when the implication is that people with inordinate socioeconomic power are corrupting the law  in order to serve their own interests. When people who have a duty to act on behalf of others, such as elected officials with a duty to serve their constituents' interests or more broadly the public good, stand to benefit by shaping the law to serve the interests of some private parties a conflict of interest exists. Many critiques of lobbying point to the potential for conflicts of interest to lead to agent misdirection or the intentional failure of an agent with a duty to serve an employer, client, or constituent to perform those duties. The failure of government officials to serve the public interest as a consequence of lobbying by special interests who provide benefits to the official is an example of agent misdirection.\nIn contrast, another side of lobbying is making sure that others' interests are duly defended against others' corruption, or even simply making sure that minority interests are fairly defended against mere tyranny of the majority. For example, a medical association may lobby a legislature about increasing the restrictions in smoking prevention laws, and tobacco companies lobby to reduce them: the first regarding smoking as injurious to health and the second arguing it is part of the freedom of choice.", "title": "Lobbying"}