{"summary": "Locust are the swarming phase of certain species of short-horned grasshoppers in the family Acrididae.", "full_text": "Locusts are the swarming phase of certain species of short-horned grasshoppers in the family Acrididae. In the solitary phase, these grasshoppers are innocuous, their numbers are low and they cause little economic threat to agriculture. However, under suitable conditions of drought followed by rapid vegetation growth, serotonin in their brains triggers a dramatic set of changes: they start to breed abundantly, becoming gregarious and nomadic  when their populations become dense enough. They form bands of wingless nymphs which later become swarms of winged adults. Both the bands and the swarms move around and rapidly strip fields and cause damage to crops. The adults are powerful fliers; they can travel great distances, consuming most of the green vegetation wherever the swarm settles.\nLocusts have formed plagues since prehistory. The Ancient Egyptians carved them on their tombs and the insects are mentioned in the Bible and the Quran. Swarms have devastated crops and been a contributory cause of famines and human migrations. More recently, changes in agricultural practices and better surveillance of locations where swarms tend to originate, have meant that control measures can be used at an early stage. The traditional means of control are based on the use of insecticides from the ground or the air, but other methods using biological control are proving effective.\nSwarming behaviour has decreased in the twentieth century, but despite modern surveillance and control methods, the potential for swarms to form is still present, and when suitable climatic conditions occur and vigilance lapses, plagues can still occur. Locusts are large insects and convenient for use in research and the study of zoology in the classroom. They are also edible insects; they have been eaten throughout history and are considered a delicacy in many countries. The word \"locust\" is derived from the Vulgar Latin locusta, meaning locust or lobster.", "title": "Locusts"}