{"summary": "A loudspeaker, which is also called a speaker, is a device that is used to create the sound in radios, television sets, and electric musical instrument amplifier systems.", "full_text": "A loudspeaker  is an electroacoustic transducer; a device which converts an electrical audio signal into a corresponding sound. The first primitive loudspeakers were invented during the development of telephone systems in the late 1800s, but electronic amplification by vacuum tube beginning around 1912 made loudspeakers truly practical. By the 1920s they were used in radios, phonographs, public address systems and theatre sound systems for talking motion pictures.\nThe most widely-used type of speaker today is the dynamic speaker, invented in 1925 by Edward W. Kellogg and Chester W. Rice. The dynamic speaker operates on the same basic principle as a dynamic microphone, but in reverse, to produce sound from an electrical signal. When an alternating current electrical audio signal is applied to its voice coil, a coil of wire suspended in a circular gap between the poles of a permanent magnet, the coil is forced to move rapidly back and forth due to Faraday's law of induction, which causes a diaphragm  attached to the coil to move back and forth, pushing on the air to create sound waves. Besides this most common method, there are several alternative technologies that can be used to convert an electrical signal into sound. The sound source  must be amplified with an amplifier before the signal is sent to the speaker.\nSpeakers are typically housed in an enclosure which is often a rectangular or square box made of wood or sometimes plastic, and the enclosure plays an important role in the quality of the sound. Where high fidelity reproduction of sound is required, multiple loudspeakers are often mounted in the same enclosure, each reproducing a part of the audible frequency range . In this case the individual speakers are referred to as \"drivers\" and the entire unit is called a loudspeaker. Drivers made for reproducing high audio frequencies are called tweeters, those for middle frequencies are called mid-range drivers, and those for low frequencies are called woofers. Miniature loudspeakers are found in devices such as radio and TV receivers, and many forms of music players. Larger loudspeaker systems are used for music, sound reinforcement in theatres and concerts, and in public address systems.", "title": "Loudspeaker"}