{"summary": "Louis Pasteur  was a French microbiologist and chemist.", "full_text": "Louis Pasteur  was a French chemist and microbiologist renowned for his discoveries of the principles of vaccination, microbial fermentation and pasteurization. He is remembered for his remarkable breakthroughs in the causes and preventions of diseases, and his discoveries have saved countless lives ever since. He reduced mortality from puerperal fever, and created the first vaccines for rabies and anthrax. His medical discoveries provided direct support for the germ theory of disease and its application in clinical medicine. He is best known to the general public for his invention of the technique of treating milk and wine to stop bacterial contamination, a process now called pasteurization. He is regarded as one of the three main founders of bacteriology, together with Ferdinand Cohn and Robert Koch, and is popularly known as the \"father of microbiology\".\nPasteur was responsible for disproving the doctrine of spontaneous generation. He performed experiments that showed that without contamination, microorganisms could not develop. Under the auspices of the French Academy of Sciences, he demonstrated that in sterilized and sealed flasks nothing ever developed, and in sterilized but open flasks microorganisms could grow. This experiment won him the Alhumbert Prize of the academy.\nAlthough Pasteur was not the first to propose the germ theory, he developed it and conducted experiments that clearly indicated its correctness and managed to convince most of Europe that it was true.  Today, he is often regarded as  fathers of germ theory.\nPasteur also made significant discoveries in chemistry, most notably on the molecular basis for the asymmetry of certain crystals and racemization. Early in his career, his investigation of Tartaric acid resulted in the first resolution of what we now call optical isomers. His work led the way to our current understanding of a fundamental principal in the structure of organic compounds.\nHe was the director of the Pasteur Institute, established in 1887, till his death, and his body lies beneath the institute in a vault covered in depictions of his accomplishments in Byzantine mosaics.\nAlthough Pasteur made groundbreaking experiments, his reputation became associated with various controversies. Historical reassessment of his notebook revealed that he practiced deception to overcome his rivals.", "title": "Louis Pasteur"}