{"summary": "Louisiana  is a state in the Southern United States of America.", "full_text": "Louisiana  is a state located in the southern region of the United States. Louisiana is the 31st most extensive and the 25th most populous of the 50 United States. Its capital is Baton Rouge and largest city is New Orleans. Louisiana is the only state in the U.S. with political subdivisions termed parishes, which are the local government's equivalent to counties. The largest parish by population is East Baton Rouge Parish, and the largest by land area is Plaquemines. Louisiana is bordered by Arkansas to the north, Mississippi to the east, Texas to the west, and the Gulf of Mexico to the south.\nMuch of the state's lands were formed from sediment washed down the Mississippi River, leaving enormous deltas and vast areas of coastal marsh and swamp. These contain a rich southern biota; typical examples include birds such as ibis and egrets. There are also many species of tree frogs, and fish such as sturgeon and paddlefish. In more elevated areas, fire is a natural process in the landscape, and has produced extensive areas of longleaf pine forest and wet savannas. These support an exceptionally large number of plant species, including many species of orchids and carnivorous plants.\nSome Louisiana urban environments have a multicultural, multilingual heritage, being so strongly influenced by a mixture of 18th-century French, Spanish, Native American, and African cultures that they are considered to be exceptional in the US. Before the American purchase of the territory in 1803, the current Louisiana State had been both a French colony and for a brief period, a Spanish one. In addition, colonists imported numerous African slaves as laborers in the 18th century. Many came from peoples of the same region of West Africa, thus concentrating their culture. In the post-Civil War environment, Anglo-Americans increased the pressure for Anglicization, and in 1921, English was made the only official language of the state. Louisiana has more Native American tribes than any other southern state, including four that are federally recognized, ten that are state recognized, and four that have not yet received recognition.", "title": "Louisiana"}