{"summary": "1988  was a leap year starting on Friday of the Gregorian calendar.", "full_text": "Luis Walter Alvarez  was an American experimental physicist, inventor, and professor who was awarded the Nobel Prize in Physics in 1968. The American Journal of Physics commented, \"Luis Alvarez was one of the most brilliant and productive experimental physicists of the twentieth century.\"\nAfter receiving his PhD from the University of Chicago in 1936, Alvarez went to work for Ernest Lawrence at the Radiation Laboratory at the University of California in Berkeley. Alvarez devised a set of experiments to observe K-electron capture in radioactive nuclei, predicted by the beta decay theory but never observed. He produced tritium using the cyclotron and measured its lifetime. In collaboration with Felix Bloch, he measured the magnetic moment of the neutron.\nIn 1940 Alvarez joined the MIT Radiation Laboratory, where he contributed to a number of World War II radar projects, from early improvements to Identification Friend or Foe  radar beacons, now called transponders, to a system known as VIXEN for preventing enemy submarines from realizing that they had been found by the new airborne microwave radars. The radar system for which Alvarez is best known and which has played a major role in aviation, most particularly in the post war Berlin airlift, was Ground Controlled Approach . Alvarez spent a few months at the University of Chicago working on nuclear reactors for Enrico Fermi before coming to Los Alamos to work for Robert Oppenheimer on the Manhattan project. Alvarez worked on the design of explosive lenses, and the development of exploding-bridgewire detonators. As a member of Project Alberta, he observed the Trinity nuclear test from a B-29 Superfortress, and later the bombing of Hiroshima from the B-29 The Great Artiste.\nAfter the war Alvarez was involved in the design of a liquid hydrogen bubble chamber that allowed his team to take millions of photographs of particle interactions, develop complex computer systems to measure and analyze these interactions, and discover entire families of new particles and resonance states. This work resulted in his being awarded the Nobel Prize in 1968. He was involved in a project to x-ray the Egyptian pyramids to search for unknown chambers. With his son, geologist Walter Alvarez, he developed the Alvarez hypothesis which proposes that the extinction event that wiped out the dinosaurs was the result of an asteroid impact.\nAlvarez was a member of the JASON Defense Advisory Group, the Bohemian Club, and the Republican Party.\n\n", "title": "Luis Walter Alvarez"}