{"summary": "We use time to sequence events, to compare their durations and the intervals between them, and to quantify the speed at which objects move and things change.", "full_text": "A lustrum  was a term for a five-year period in Ancient Rome.\nThe lustration was originally a sacrifice for expiation and purification offered by one of the censors in the name of the Roman people at the close of the taking of the census. The sacrifice was often in the form of an animal sacrifice, known as a suovetaurilia.\nThese censuses were taken at five-year intervals, thus a lustrum came to refer to the five-year inter-census period. Lustrum  is a lustration or purification of the whole Roman people performed by one of the censors in the Campus Martius, after the taking of the census was over. As this purification took place only once in five years, the word lustrum was also used to designate the time between two lustra.\nThe first lustrum was performed in BC 566 by King Servius, after he had completed his census, and afterwards it is said to have taken place regularly every five years after the census was over. In the earliest period of the republic, the business of the census and the solemnities of the lustrum were performed by the consuls. The first censors were appointed in BC 443, and from this year down to BC 294 there had, according to Livy , only been 26 pairs of censors, and only 21 lustra, or general purifications, although if all had been regular, there would have been 30 pairs of censors and 30 lustra. Sometimes the census was not held at all, or at least not by the censors. The census might take place without the lustrum, and indeed two cases of this kind are recorded, in BC 459 and 214. In these cases, the lustrum was not performed because of some great calamities that had befallen the republic.\nThe time when the lustrum took place has been calculated. Six ancient Romulian years, of 304 days each, were, with the difference of two days, equal to five solar years of 365 days each, with one leap year of 366 days; or the six ancient years made 1824 days, while the five solar years contained 1826 days. The lustrum, or the great year of the ancient Romans, was thus a cycle, at the end of which, the beginning of the ancient year nearly coincided with that of the solar year. As the coincidence, however, was not perfect, a month of 24 days was interposed in every eleventh lustrum. It is highly probable that the recurrence of such a cycle or great year was, from the earliest times, solemnized with sacrifices and purifications, and that King Servius did not introduce them, but merely connected them with his census, and thus set the example for subsequent ages, which however, as we have seen, was not observed with regularity.\nThe last lustrum was solemnized at Rome, in AD 74, in the reign of Vespasian.\n\n", "title": "Lustrum"}