{"summary": "The Macao Special Administrative Region  is one of China's two Special Administrative Regions.", "full_text": "Macau , also spelled Macao, officially known as the Macao Special Administrative Region of the People's Republic of China, is an autonomous territory on the southern coast of the People's Republic of China. Macau lies on the western side of the Pearl River Delta across from Hong Kong, which is about 64 kilometers to the east, and it is also bordered by Guangdong of Mainland China to the north and the South China Sea to the east and south. With an estimated population of around 636,200 living in an area of 30.3 km2 , it is the most densely populated region in the world.\nAs Portuguese Macau, it was administered by the Portuguese Empire and its inheritor states from the mid-16th century until late 1999, when it was the last remaining European colony in Asia under Portugal. Portuguese traders first settled in Macau in the 1550s. In 1557, Macau was rented to Portugal from Ming China as a trading port. The Portuguese Empire administered the city under Chinese authority and sovereignty until 1887, when Macau became a colony. Sovereignty over Macau was transferred to China on 20 December 1999. The Joint Declaration on the Question of Macau and Macau Basic Law stipulate that Macau operate with a high degree of autonomy until at least 2049, fifty years after the transfer.\nUnder the policy of \"one country, two systems\", the State Council of the People's Republic of China is responsible for military defense and foreign affairs while Macau maintains its own legal system, the public security force, monetary system, customs policy, and immigration policy. Macau participates in many international organizations and events that do not require members to possess national sovereignty.\nMacau is one of the world's richest cities, and as of 2013 its GDP per capita by purchasing power parity is higher than that of any country in the world, according to the World Bank. It became the world's largest gambling centre in 2006, with the economy heavily dependent on gambling and tourism, as well as manufacturing. Cantonese people from Hong Kong and Guangdong, in addition to the recent mainland tourism from Mandarin-speaking regions, have boosted the economy of Macau significantly. According to The World Factbook, Macau has the fourth highest life expectancy in the world. Moreover, it is one of only a few regions in Asia with a \"very high Human Development Index\", ranking 14th as of 2013.", "title": "Macau"}