{"summary": "A machine gun is a weapon that can fire one bullet after another as long as the trigger is pulled and there are bullets ready to fire.", "full_text": "A machine gun is a fully automatic mounted or portable firearm, designed to fire bullets in quick succession from an ammunition belt or magazine, typically at a rate of three hundred to eighteen hundred rounds per minute. Fully automatic weapons are generally categorized as submachine guns, assault rifles, battle rifles, automatic shotguns, machine guns, or autocannons.\nAs a class of military firearms, true machine guns are fully automatic weapons designed to be used as support weapons and generally used when attached to a mount or fired from the ground on a bipod or tripod. Light machine guns are small enough to be fired hand-held, but are more effective when fired from a prone position. The difference between machine guns and other categories of weapons is based on caliber, with autocannons using calibers larger than 20 mm, and whether the gun fires conventional bullets, shotgun cartridges, or explosive rounds. Fully automatic guns firing shotgun cartridges are usually called automatic shotguns, and those firing large-caliber explosive rounds are generally considered either autocannons or automatic grenade launchers . Submachine guns are hand-held automatic weapons for personal defense or short-range combat firing pistol-caliber rounds. In contrast to submachine guns and autocannons, machine guns  tend to have a very high ratio of barrel length to caliber ; indeed, a true machine gun is essentially a fully automatic rifle, and often the primary criterion for a machine gun as opposed to a battle rifle is the presence of a quick-change barrel, heavyweight barrel, or other cooling system. Battle rifles and assault rifles may be capable of fully automatic fire, but are not designed for sustained fire.\nIn United States gun law, machine gun is a legal term for any weapon able to fire more than one shot per trigger pull regardless of caliber, the receiver of any such weapon, any weapon convertible to such a state using normal tools, or any component or part that will modify an existing firearm such that it functions as a \"machine gun\" such as a drop-in auto sear. Civilian possession of such weapons is not prohibited by any Federal law and not illegal in many states, but they must be registered as Title II weapons under the National Firearms Act and have a tax stamp paid. The Hughes Amendment to the Firearm Owners Protection Act of 1986 banned new production of firearms classified as machine guns for most civilian applications, however, so only \"grandfathered\" weapons produced before this date are legally transferable.", "title": "Machine gun"}