{"summary": "A magnet is a very special metal.", "full_text": "A magnet  is a material or object that produces a magnetic field. This magnetic field is invisible but is responsible for the most notable property of a magnet: a force that pulls on other ferromagnetic materials, such as iron, and attracts or repels other magnets.\nA permanent magnet is an object made from a material that is magnetized and creates its own persistent magnetic field. An everyday example is a refrigerator magnet used to hold notes on a refrigerator door. Materials that can be magnetized, which are also the ones that are strongly attracted to a magnet, are called ferromagnetic . These include iron, nickel, cobalt, some alloys of rare earth metals, and some naturally occurring minerals such as lodestone. Although ferromagnetic  materials are the only ones attracted to a magnet strongly enough to be commonly considered magnetic, all other substances respond weakly to a magnetic field, by one of several other types of magnetism.\nFerromagnetic materials can be divided into magnetically \"soft\" materials like annealed iron, which can be magnetized but do not tend to stay magnetized, and magnetically \"hard\" materials, which do. Permanent magnets are made from \"hard\" ferromagnetic materials such as alnico and ferrite that are subjected to special processing in a powerful magnetic field during manufacture, to align their internal microcrystalline structure, making them very hard to demagnetize. To demagnetize a saturated magnet, a certain magnetic field must be applied, and this threshold depends on coercivity of the respective material. \"Hard\" materials have high coercivity, whereas \"soft\" materials have low coercivity.\nAn electromagnet is made from a coil of wire that acts as a magnet when an electric current passes through it but stops being a magnet when the current stops. Often, the coil is wrapped around a core of \"soft\" ferromagnetic material such as steel, which greatly enhances the magnetic field produced by the coil.\nThe overall strength of a magnet is measured by its magnetic moment or, alternatively, the total magnetic flux it produces. The local strength of magnetism in a material is measured by its magnetization.", "title": "Magnet"}