{"summary": "Magnesium  is a chemical element with the symbol Mg, atomic number 12 and common oxidation state +2. It is an alkaline earth metal and the eighth most abundant element in the Earth's crust, where it constitutes about 2% by mass, and ninth in the known universe as a whole.", "full_text": "Magnesium is a chemical element with symbol Mg and atomic number 12. It is a shiny gray solid which bears a close physical resemblance to the other five elements in the second column  of the periodic table: they each have the same electron configuration in their outer electron shell producing a similar crystal structure.\nMagnesium is the ninth most abundant element in the universe. It is synthesized in large, aging stars from the sequential addition of three helium nuclei to a carbon nucleus. When such a star explodes as a supernova, much of its magnesium is expelled into the interstellar medium, where it can be recycled into new star systems. Consequently, magnesium is the eighth most abundant element in the Earth's crust and the fourth most common element in the Earth , making up 13% of the planet's mass and a large fraction of the planet's mantle. It is the third most abundant element dissolved in seawater, after sodium and chlorine.\nMagnesium only occurs naturally in combination with other elements, where it invariably has a +2 oxidation state. The free element  can be produced artificially, and is highly reactive . The free metal burns with a characteristic brilliant-white light, making it a useful ingredient in flares. The metal is now obtained mainly by electrolysis of magnesium salts obtained from brine. In commerce, the chief use for the metal is as an alloying agent to make aluminium-magnesium alloys, sometimes called magnalium or magnelium. Since magnesium is less dense than aluminium, this alloy is prized for its properties of lightness combined with strength.\nMagnesium is the eleventh most abundant element by mass in the human body. Its ions are essential to all cells. They interact with polyphosphate compounds such as ATP, DNA, and RNA. Hundreds of enzymes require magnesium ions to function. Magnesium compounds are used medicinally as common laxatives, antacids , and to stabilize abnormal nerve excitation or blood vessel spasm such as in eclampsia. Magnesium ions are sour to the taste, and in low concentrations they help impart a natural tartness to fresh mineral waters. Magnesium is the metallic ion at the center of chlorophyll, and is a common additive to fertilizers.", "title": "Magnesium"}