{"summary": "Malawi  is a country in south-east Africa.", "full_text": "Malawi , officially the Republic of Malawi, is a landlocked country in southeast Africa that was formerly known as Nyasaland. It is bordered by Zambia to the northwest, Tanzania to the northeast, and Mozambique on the east, south and west. The country is separated from Tanzania and Mozambique by Lake Malawi. Malawi is over 118,000 km2  with an estimated population of 16,777,547 . Its capital is Lilongwe, which is also Malawi's largest city; the second largest is Blantyre and the third is Mzuzu. The name Malawi comes from the Maravi, an old name of the Nyanja people that inhabit the area. The country is also nicknamed \"The Warm Heart of Africa\".\nMalawi is among the smallest countries in Africa. Lake Malawi takes about a third of Malawi's area.\nThe area of Africa now known as Malawi was settled by migrating Bantu groups around the 10th century. Centuries later in 1891 the area was colonized by the British. In 1953 Malawi, then known as Nyasaland, a protectorate of the United Kingdom, became a protectorate within the semi-independent Federation of Rhodesia and Nyasaland. The Federation was dissolved in 1963. In 1964 the protectorate over Nyasaland was ended and Nyasaland became an independent country under Queen Elizabeth II with the new name Malawi. Two years later it became a republic. Upon gaining independence it became a single-party state under the presidency of Hastings Banda, who remained president until 1994, when he lost an election. Peter Mutharika is the current president. Malawi has a democratic, multi-party government. Malawi has a small military force that includes an army, a navy and an air wing. Malawi's foreign policy is pro-Western and includes positive diplomatic relations with most countries and participation in several international organisations.\nMalawi is among the world's least-developed countries. The economy is heavily based in agriculture, with a largely rural population. The Malawian government depends heavily on outside aid to meet development needs, although this need  has decreased since 2000. The Malawian government faces challenges in building and expanding the economy, improving education, health care, environmental protection, and becoming financially independent. Malawi has several programs developed since 2005 that focus on these issues, and the country's outlook appears to be improving, with improvements in economic growth, education and healthcare seen in 2007 and 2008.\nMalawi has a low life expectancy and high infant mortality. There is a high prevalence of HIV/AIDS, which is a drain on the labour force and government expenditures. There is a diverse population of native peoples, Asians and Europeans, with several languages spoken and an array of religious beliefs. Although there was periodic regional conflict fuelled in part by ethnic divisions in the past, by 2008 it had diminished considerably and the concept of a Malawian nationality had re-emerged.", "title": "Malawi"}