{"summary": "Manchester is a city in North West England.", "full_text": "Manchester  is a city and metropolitan borough in Greater Manchester, England, with a population of 514,417 in 2013. It lies within the United Kingdom's second most populous urban area, with a population of 2.55 million. Manchester is fringed by the Cheshire Plain to the south, the Pennines to the north and east and an arc of towns with which it forms a continuous conurbation. The local authority is Manchester City Council.\nThe recorded history of Manchester began with the civilian settlement associated with the Roman fort of Mamucium, a variant of which name  is preserved by the city's demonym: residents are still referred to as Mancunians . The Roman fort was established in about 79 AD on a sandstone bluff near the confluence of the rivers Medlock and Irwell. It was historically a part of Lancashire, although areas of Cheshire south of the River Mersey were incorporated during the 20th century. Throughout the Middle Ages Manchester remained a manorial township but began to expand \"at an astonishing rate\" around the turn of the 19th century. Manchester's unplanned urbanisation was brought on by a boom in textile manufacture during the Industrial Revolution, and resulted in it becoming the world's first industrialised city.\nManchester achieved city status in 1853, the first new British city for three hundred years. The Manchester Ship Canal, at the time the longest river navigation canal in the world, opened in 1894, creating the Port of Manchester and linking the city to sea, 36 miles  to the west. Its fortunes declined after the Second World War however, owing to deindustrialisation, but investment spurred by the 1996 Manchester bombing led to extensive regeneration.\nToday Manchester is ranked as a beta world city by the Globalization and World Cities Research Network and is consequently the highest ranked British city except for London. Its metropolitan economy is the second biggest in England according to the ONS. Manchester is the third-most visited city in the UK by foreign visitors, after London and Edinburgh. It is notable for its architecture, culture, musical exports, media links, scientific and engineering output, social impact, sports clubs and transport connections. Manchester Liverpool Road railway station was the world's first inter-city passenger railway station and it was in the city that scientists first split the atom and developed the stored-program computer.\n\n", "title": "Manchester"}