{"summary": "June 25 is the 176th day of the year  in the Gregorian calendar.", "full_text": "Dame Margaret Joan Anstee, DCMG  served at the United Nations for over four decades , rising to the rank of Under-Secretary General in 1987. She worked on operational programmes of economic and social development in all regions of the world, mostly with the United Nations Development Programme. From 1987-1992 she served as Director General of the United Nations at Vienna, Head of the Centre for Social Development and Humanitarian Affairs and Coordinator of all United Nations narcotic drug-control programs. From 1992-93 she was the Secretary General's Special Representative to Angola.\nMargaret Anstee served successively as Resident Representative of the UN Development Programme  in eight countries in Asia, Latin America and Africa. From 1974 - 1987 she occupied senior positions at the UN's New York HQ. She was also given major responsibilities in a number of disaster relief operations  as well as special assignments for the Secretary General to assist countries in dire economic distress . In addition, she was involved in the design and implementation of several major reforms of the UN system.\nSince leaving the UN in July 1993, she has been a Special Adviser to the government of Bolivia on matters relating to development and international finance. In 1994 she wrote a report for UNCTAD on the technical cooperation needs of developing countries in the wake of the completion of the Uruguay Round and led an Inter-American Development Bank mission to Bolivia on socio-economic reform. She writes and lectures widely on the United Nations, particularly on issues related to development, peacekeeping, and UN reform. Since 1996 she has advised the Secretary General of the United Nations' Department of Political Affairs, on a pro bono publico basis, on operational aspects of post-conflict peace-building.\nShe also chairs the Advisory Board of the Lessons Learned Unit of the UN Department of Peacekeeping Operations, and for some years has actively taken part in practical training in peacekeeping techniques for both military and civilian personnel, including simulation exercises, in the UK, Sweden, South America and the United States, South Africa and other African countries.", "title": "Margaret Anstee"}