{"summary": "Maria Theresa of Austria  was the only female head of the Habsburg Dynasty.", "full_text": "Maria Theresa Walburga Amalia Christina  was the only female ruler of the Habsburg dominions and the last of the House of Habsburg. She was the sovereign of Austria, Hungary, Croatia, Bohemia, Transylvania, Mantua, Milan, Lodomeria and Galicia, the Austrian Netherlands and Parma. By marriage, she was Duchess of Lorraine, Grand Duchess of Tuscany and Holy Roman Empress.\nShe started her 40-year reign when her father, Emperor Charles VI, died in October 1740. Charles VI paved the way for her accession with the Pragmatic Sanction of 1713 and spent his entire reign securing it. Upon the death of her father, Saxony, Prussia, Bavaria, and France all repudiated the sanction they had recognised during his lifetime. Prussia proceeded to invade the affluent Habsburg province of Silesia, sparking a nine-year conflict known as the War of the Austrian Succession, and subsequently conquered it. Maria Theresa would later unsuccessfully try to reconquer Silesia during the Seven Years' War.\nMaria Theresa and her husband, Francis I, Holy Roman Emperor, had sixteen children, including the Queen of France, the Queen of Naples and Sicily, the Duchess of Parma and two Holy Roman Emperors, Joseph II and Leopold II. Out of the sixteen, nine or ten of them did not make it to adulthood. She had eleven daughters, ten of which were named Marie, and five sons. Though she was expected to cede power to Francis and Joseph, both of whom were officially her co-rulers in Austria and Bohemia, Maria Theresa was the absolute sovereign who ruled by the counsel of her advisers. She criticised and disapproved of many of Joseph's actions. Although she is considered to have been intellectually inferior to both Joseph and Leopold, Maria Theresa understood the importance of her public persona and was able to simultaneously evoke both esteem and affection from her subjects.\nMaria Theresa promulgated financial and educational reforms, with the assistance of Count Friedrich Wilhelm von Haugwitz and Gerard van Swieten, promoted commerce and the development of agriculture, and reorganised Austria's ramshackle military, all of which strengthened Austria's international standing. However, she refused to allow religious toleration and contemporaneous travellers thought her regime was bigoted and superstitious. As a young monarch who fought two dynastic wars, she believed that her cause should be the cause of her subjects, but in her later years she would believe that their cause must be hers.", "title": "Maria Theresa of Austria"}