{"summary": "Marian Anderson  was an American contralto singer.", "full_text": "Marian Anderson  was an American contralto and one of the most celebrated singers of the twentieth century. Music critic Alan Blyth said: \"Her voice was a rich, vibrant contralto of intrinsic beauty.\" Most of her singing career was spent performing in concert and recital in major music venues and with famous orchestras throughout the United States and Europe between 1925 and 1965. Although offered roles with many important European opera companies, Anderson declined, as she had no training in acting. She preferred to perform in concert and recital only. She did, however, perform opera arias within her concerts and recitals. She made many recordings that reflected her broad performance repertoire of everything from concert literature to lieder to opera to traditional American songs and spirituals. Between 1940 and 1965 the German-American pianist Franz Rupp was her permanent accompanist.\nAnderson became an important figure in the struggle for black artists to overcome racial prejudice in the United States during the mid-twentieth century. In 1939, the Daughters of the American Revolution  refused permission for Anderson to sing to an integrated audience in Constitution Hall. The incident placed Anderson into the spotlight of the international community on a level unusual for a classical musician. With the aid of First Lady Eleanor Roosevelt and her husband Franklin D. Roosevelt, Anderson performed a critically acclaimed open-air concert on Easter Sunday, April 9, 1939, on the steps of the Lincoln Memorial in Washington, D.C. She sang before a crowd of more than 75,000 people and a radio audience in the millions. Anderson continued to break barriers for black artists in the United States, becoming the first black person, American or otherwise, to perform at the Metropolitan Opera in New York City on January 7, 1955. Her performance as Ulrica in Giuseppe Verdi's Un ballo in maschera at the Met was the only time she sang an opera role on stage.\nAnderson worked for several years as a delegate to the United Nations Human Rights Committee and as a \"goodwill ambassadress\" for the United States Department of State, giving concerts all over the world. She participated in the civil rights movement in the 1960s, singing at the March on Washington for Jobs and Freedom in 1963. The recipient of numerous awards and honors, Anderson was awarded the Presidential Medal of Freedom in 1963, the Kennedy Center Honors in 1978, the National Medal of Arts in 1986, and a Grammy Lifetime Achievement Award in 1991.\n^ Marian Anderson Biography, Lakewood Public Library. Retrieved April 9, 2012.\n^ a b Max de Schauensee/Alan Blyth: \"Marian Anderson\", Grove Music Online, ed. L. Macy , \n^ Allan Keiler, Marian Anderson: A Singer's Journey, New York 2000", "title": "Marian Anderson"}