{"summary": "Samuel Langhorne Clemens , more widely known as Mark Twain, was a well known American writer born in Florida, Missouri.", "full_text": "Samuel Langhorne Clemens , better known by his pen name Mark Twain, was an American author and humorist. He wrote The Adventures of Tom Sawyer  and its sequel, Adventures of Huckleberry Finn , the latter often called \"The Great American Novel\".\nTwain grew up in Hannibal, Missouri, which provided the setting for Huckleberry Finn and Tom Sawyer. After an apprenticeship with a printer, he worked as a typesetter and contributed articles to the newspaper of his older brother, Orion Clemens. He later became a riverboat pilot on the Mississippi River before heading west to join Orion in Nevada. He referred humorously to his singular lack of success at mining, turning to journalism for the Virginia City Territorial Enterprise. In 1865, his humorous story, \"The Celebrated Jumping Frog of Calaveras County\", was published, based on a story he heard at Angels Hotel in Angels Camp, California, where he had spent some time as a miner. The short story brought international attention, and was even translated into classic Greek. His wit and satire, in prose and in speech, earned praise from critics and peers, and he was a friend to presidents, artists, industrialists, and European royalty.\nThough Twain earned a great deal of money from his writings and lectures, he invested in ventures that lost a great deal of money, notably the Paige Compositor, a mechanical typesetter, which failed because of its complexity and imprecision. In the wake of these financial setbacks, he filed for protection from his creditors via bankruptcy, and with the help of Henry Huttleston Rogers eventually overcame his financial troubles. Twain chose to pay all his pre-bankruptcy creditors in full, though he had no legal responsibility to do so.\nTwain was born shortly after a visit by Halley's Comet, and he predicted that he would \"go out with it\", too. He died the day after the comet returned. He was lauded as the \"greatest American humorist of his age\", and William Faulkner called Twain \"the father of American literature\".", "title": "Mark Twain"}