{"summary": "Marriage is a union between individual people.", "full_text": "Marriage, also called matrimony or wedlock, is a socially or ritually recognized union or legal contract between spouses that establishes rights and obligations between them, between them and their children, and between them and their in-laws. The definition of marriage varies according to different cultures, but it is principally an institution in which interpersonal relationships, usually sexual, are acknowledged. In some cultures, marriage is recommended or considered to be compulsory before pursuing any sexual activity. When defined broadly, marriage is considered a cultural universal.\n\nIndividuals may marry for several reasons, including legal, social, libidinal, emotional, financial, spiritual, and religious purposes. Whom they marry may be influenced by socially determined rules of incest, prescriptive marriage rules, parental choice and individual desire. In some areas of the world, arranged marriage, child marriage, polygamy, and sometimes forced marriage, may be practiced as a cultural tradition. Conversely, such practices may be outlawed and penalized in parts of the world out of concerns for women's rights and because of international law. In developed parts of the world, there has been a general trend towards ensuring equal rights within marriage for women and legally recognizing the marriages of interfaith, and same-sex couples. Often, these trends have been motivated by a desire to establish equality and uphold human rights.\nMarriage can be recognized by a state, an organization, a religious authority, a tribal group, a local community or peers. It is often viewed as a contract. Civil marriage, which does not exist in some countries, is marriage without religious content carried out by a government institution in accordance with the marriage laws of the jurisdiction, and recognised as creating the rights and obligations intrinsic to matrimony. Marriages can be performed in a secular civil ceremony or in a religious setting via a wedding ceremony. The act of marriage usually creates normative or legal obligations between the individuals involved, and any offspring they may produce. In terms of legal recognition, most sovereign states and other jurisdictions limit marriage to opposite-sex couples and a diminishing number of these permit polygyny, child marriages, and forced marriages. Over the twentieth century, a growing number of countries and other jurisdictions have lifted bans on and have established legal recognition for interracial marriage, interfaith marriage, and most recently, same-sex marriage. Some cultures allow the dissolution of marriage through divorce or annulment. In some areas, child marriages and polygamy may occur in spite of national laws against the practice.\nSince the late twentieth century, major social changes in Western countries have led to changes in the demographics of marriage, with the age of first marriage increasing, fewer people marrying, and more couples choosing to cohabit rather than marry. For example, the number of marriages in Europe decreased by 30% from 1975 to 2005.\nHistorically, in most cultures, married women had very few rights of their own, being considered, along with the family's children, the property of the husband; as such, they could not own or inherit property, or represent themselves legally . In Europe, the United States, and other places in the developed world, beginning in the late 19th century and lasting through the 21st century, marriage has undergone gradual legal changes, aimed at improving the rights of the wife. These changes included giving wives legal identities of their own, abolishing the right of husbands to physically discipline their wives, giving wives property rights, liberalizing divorce laws, providing wives with reproductive rights of their own, and requiring a wife's consent when sexual relations occur. These changes have occurred primarily in Western countries. In the 21st century, there continue to be controversies regarding the legal status of married women, legal acceptance of or leniency towards violence within marriage , traditional marriage customs such as dowry and bride price, forced marriage, marriageable age, and criminalization of consensual behaviors such as premarital and extramarital sex.", "title": "Marriage"}