{"summary": "The Marshall Plan  was a plan of the United States for rebuilding the allied countries of Europe after World War II.", "full_text": "The Marshall Plan  was an American initiative to aid Western Europe, in which the United States gave $13 billion  in economic support to help rebuild Western European economies after the end of World War II. The plan was in operation for four years beginning in April 1947. The goals of the United States were to rebuild war-devastated regions, remove trade barriers, modernize industry, make Europe prosperous again, and prevent the spread of communism. The Marshall Plan required a lessening of interstate barriers, a dropping of many petty regulations constraining business, and encouraged an increase in productivity, labour union membership, as well as the adoption of modern business procedures.\nThe Marshall Plan aid was divided amongst the participant states roughly on a per capita basis. A larger amount was given to the major industrial powers, as the prevailing opinion was that their resuscitation was essential for general European revival. Somewhat more aid per capita was also directed towards the Allied nations, with less for those that had been part of the Axis or remained neutral. The largest recipient of Marshall Plan money was the United Kingdom , followed by France  and West Germany . Some 18 European countries received Plan benefits. Although offered participation, the Soviet Union refused Plan benefits, and also blocked benefits to Eastern Bloc countries, such as East Germany and Poland. The United States provided similar aid programs in Asia, but they were not called \"Marshall Plan\".\nThe initiative is named after Secretary of State George Marshall. The plan had bipartisan support in Washington, where the Republicans controlled Congress and the Democrats controlled the White House with Harry S. Truman as president. The Plan was largely the creation of State Department officials, especially William L. Clayton and George F. Kennan, with help from Brookings Institution, as requested by Senator Arthur H. Vandenberg, chairman of the Senate Foreign Relations Committee. Marshall spoke of an urgent need to help the European recovery in his address at Harvard University in June 1947. The purpose of the Marshall Plan was to aid in the economic recovery of nations after WWII as well as to antagonize the Soviet Union. By providing economic assistance to nations including the USSR, the United States was informing nations of the squalid and depraved conditions that they lived in. In order to combat the effects of the Marshall Plan, the USSR developed and forcefully imposed its own economic plan, known as the Molotov Plan\nThe phrase \"equivalent of the Marshall Plan\" is often used to describe a proposed large-scale economic rescue program.", "title": "Marshall Plan"}