{"summary": "Martin Luther  was a German monk and theologian of Christianity.", "full_text": "Martin Luther  was a German friar, priest, professor of theology, and a seminal figure in the Protestant Reformation. Initially an Augustinian friar, Luther came to reject several teachings and practices of the Roman Catholic Church. He strongly disputed the claim that freedom from God's punishment for sin could be purchased with money. He confronted indulgence salesman Johann Tetzel, a Dominican friar, with his Ninety-Five Theses in 1517. His refusal to retract all of his writings at the demand of Pope Leo X in 1520 and the Holy Roman Emperor Charles V at the Diet of Worms in 1521 resulted in his excommunication by the Pope and condemnation as an outlaw by the Emperor.\nLuther taught that salvation and subsequently eternal life is not earned by good deeds but is received only as a free gift of God's grace through faith in Jesus Christ as redeemer from sin. His theology challenged the authority and office of the Pope by teaching that the Bible is the only source of divinely revealed knowledge from God and opposed sacerdotalism by considering all baptized Christians to be a holy priesthood. Those who identify with these, and all of Luther's wider teachings, are called Lutherans even though Luther insisted on Christian as the only acceptable name for individuals who professed Christ. Today, Lutheranism constitutes a major branch of Protestant Christianity with some 80 million adherents, while Protestantism itself is represented by an estimated more than 800 million people worldwide.\nHis translation of the Bible into the vernacular  made it more accessible, which had a tremendous impact on the church and German culture. It fostered the development of a standard version of the German language, added several principles to the art of translation, and influenced the writing of an English translation, the Tyndale Bible. His hymns influenced the development of singing in churches. His marriage to Katharina von Bora set a model for the practice of clerical marriage, allowing Protestant clergy to marry.\n\n", "title": "Martin Luther"}