{"summary": "Martin Luther King, Jr. was an American pastor, activist, humanitarian, and leader in the African-American Civil Rights Movement.", "full_text": "Martin Luther King, Jr.  was an American Baptist minister, activist, humanitarian, and leader in the African-American Civil Rights Movement. He is best known for his role in the advancement of civil rights using nonviolent civil disobedience based on his Christian beliefs.\nKing became a civil rights activist early in his career. He led the 1955 Montgomery Bus Boycott and helped found the Southern Christian Leadership Conference  in 1957, serving as its first president. With the SCLC, King led an unsuccessful 1962 struggle against segregation in Albany, Georgia , and helped organize the 1963 nonviolent protests in Birmingham, Alabama. King also helped to organize the 1963 March on Washington, where he delivered his famous \"I Have a Dream\" speech. There, he established his reputation as one of the greatest orators in American history.\nOn October 14, 1964, King received the Nobel Peace Prize for combating racial inequality through nonviolence. In 1965, he helped to organize the Selma to Montgomery marches, and the following year he and SCLC took the movement north to Chicago to work on segregated housing. In the final years of his life, King expanded his focus to include poverty and speak against the Vietnam War, alienating many of his liberal allies with a 1967 speech titled \"Beyond Vietnam\".\nIn 1968, King was planning a national occupation of Washington, D.C., to be called the Poor People's Campaign, when he was assassinated on April 4 in Memphis, Tennessee. His death was followed by riots in many U.S. cities.\nKing was posthumously awarded the Presidential Medal of Freedom and the Congressional Gold Medal. Martin Luther King, Jr. Day was established as a holiday in numerous cities and states beginning in 1971, and as a U.S. federal holiday in 1986. Hundreds of streets in the U.S. have been renamed in his honor, and a county in Washington State was also renamed for him. The Martin Luther King, Jr. Memorial on the National Mall in Washington, D.C., was dedicated in 2011.", "title": "Martin Luther King, Jr."}