{"summary": "The Massachusetts Bay Colony was an English settlement in the 17th century on the east coast of North America.", "full_text": "The Massachusetts Bay Colony was an English settlement on the east coast of North America  in the 17th century, in New England, situated around the present-day cities of Salem and Boston. The territory administered by the colony included much of present-day central New England, including portions of the U.S. states of Massachusetts, Maine, New Hampshire, Rhode Island, and Connecticut. Territory claimed but never administered by the colonial government extended as far west as the Pacific Ocean.\nThe colony was founded by the owners of the Massachusetts Bay Company, which included investors in the failed Dorchester Company, which had in 1623 established a short-lived settlement on Cape Ann. The second attempt, the Massachusetts Bay Colony begun in 1628, was successful, with about 20,000 people migrating to New England in the 1630s. The population was strongly Puritan, and its governance was dominated by a small group of leaders who were strongly influenced by Puritan religious leaders. Although its governors were elected, the electorate were limited to freemen, who had been examined for their religious views and formally admitted to the local church. As a consequence, the colonial leadership exhibited intolerance to other religious views, including Anglican, Quaker, and Baptist theologies.\nAlthough the colonists initially had decent relationships with the local native populations, frictions arose over cultural differences, which were further exacerbated by Dutch colonial expansion. These led first to the Pequot War , and then to King Philip's War , after which most of the natives in southern New England had been pacified, killed, or driven away.\nThe colony was economically successful, engaging in trade with England and the West Indies. A shortage of hard currency in the colony prompted it to establish a mint in 1652. Political differences with England after the English Restoration led to the revocation of the colonial charter in 1684. King James II established the Dominion of New England in 1686 to bring all of the New England colonies under firmer crown control. The dominion collapsed after the Glorious Revolution of 1688 deposed James, and the colony reverted to rule under the revoked charter until 1692, when Sir William Phips arrived bearing the charter of the Province of Massachusetts Bay, which combined the Massachusetts Bay territories with those of the Plymouth Colony and proprietary holdings on Nantucket and Martha's Vineyard. The political and economic dominance of New England by the modern state of Massachusetts was made possible in part by the early dominance in these spheres by the Massachusetts Bay colonists.", "title": "Massachusetts Bay Colony"}