{"summary": "Boxing is one of the world's oldest combat sports.", "full_text": "Maximillian Adolph Otto Siegfried \"Max\" Schmeling  was a German boxer who was heavyweight champion of the world between 1930 and 1932. His two fights with Joe Louis in 1936 and 1938 were worldwide cultural events because of their national associations.\nStarting his professional career in 1924, Schmeling came to the United States in 1928 and, after a ninth-round technical knockout of Johnny Risko, became a sensation. He became the first to win the heavyweight championship  by disqualification in 1930, after opponent Jack Sharkey knocked him down with a low blow in the fourth round. Max retained his crown successfully in 1931 by a t.K.o victory over Young Stribling. A rematch in 1932 with Sharkey saw the American gaining the title from Schmeling by a controversial fifteen-round split decision. In 1933, Schmeling lost to Max Baer by a tenth-round TKO. The loss left people believing that Schmeling was past his prime. Meanwhile, Adolf Hitler and the Nazi Party took over control in Germany, and Schmeling came to be viewed as a 'Nazi puppet.'\nIn 1936, Schmeling knocked out American rising star Joe Louis, placing him as the number one contender for Jim Braddock's title, but Louis got the fight and knocked Braddock out to win the championship in 1937. Schmeling finally got a chance to regain his title in 1938, but Louis knocked him out in one round. During World War II, Schmeling served with the German Air Force  as an elite paratrooper . After the war, Schmeling mounted a comeback, but retired permanently in 1948.\nAfter retiring from boxing, Schmeling worked for The Coca-Cola Company. Schmeling became friends with Louis, and their friendship lasted until the latter's death in 1981. Schmeling died in 2005 aged 99, a sporting icon in his native Germany. Long after the Second World War, it was revealed that Schmeling had risked his own life to save the lives of two Jewish children in 1938.\nIn 2003, Schmeling was ranked 55 on The Ring magazine's list of 100 greatest punchers of all time.\n\n", "title": "Max Schmeling"}