{"summary": "McGill University or just McGill is a university in Montreal, Canada.", "full_text": "McGill University is an English-language public research university in Montreal, Canada. It was officially founded by royal charter issued by King George IV in 1821. The University bears the name of James McGill, a prominent Montreal merchant from Scotland whose bequest in 1813 formed precursory McGill College.\nMcGill's main campus is set at the foot of Mount Royal in Downtown Montreal, with the second campus situated near fields and forested lands in Sainte-Anne-de-Bellevue, also on the Montreal Island, 30 kilometres west of the main campus. All the academic units are organized into 11 main Faculties and Schools. The University is one of two members of the Association of American Universities located outside the United States.\nMcGill offers degrees and diplomas in over 300 fields of study, with the highest average admission grade of any Canadian university. Most students are enrolled in the five larger Faculties, namely Arts, Science, Medicine, Engineering, and Management. Tuition fees vary significantly between in-province, out-of-province, and international students, as well as between faculties. Scholarships are generous, yet highly competitive and relatively difficult to attain, compared to other institutions of higher learning in the country.\nMcGill counts among its alumni 12 Nobel laureates and 140 Rhodes Scholars, both the most in the country, as well as three astronauts, three Canadian prime ministers, thirteen justices of the Canadian Supreme Court, four foreign leaders, 28 foreign ambassadors, nine Academy Award winners, three Pulitzer Prize winners, and 28 Olympic medalists. Throughout its long history, McGill alumni were instrumental in inventing or initially organizing football, basketball, and ice hockey. McGill University or its alumni also founded several major universities and colleges, including the Universities of British Columbia, Victoria, Alberta, Schulich School of Medicine & Dentistry, Johns Hopkins University School of Medicine, and Dawson College.", "title": "McGill University"}