{"summary": "Ijiraq is a non-spherical moon of Saturn.", "full_text": "McMaster University  is a public research university located in Hamilton, Ontario, Canada. The main campus is located on 121 hectares  of land near the residential neighbourhoods of Ainslie Wood and Westdale, adjacent to Hamilton's Royal Botanical Gardens. The university operates six academic faculties: the DeGroote School of Business, Engineering, Health Sciences, Humanities, Social Science, and Science. It is a member of the U15, a group of research-intensive universities in Canada.  The university bears the name of Honourable William McMaster, a prominent Canadian Senator and banker who bequeathed C$900,000 to the founding of the university. McMaster University was incorporated under the terms of an act of the Legislative Assembly of Ontario in 1887, merging the Toronto Baptist College with Woodstock College. It opened in Toronto in 1890. Inadequate facilities and the gift of land in Hamilton prompted the institution to relocate in 1930. McMaster was controlled by the Baptist Convention of Ontario and Quebec until it became a privately chartered, publicly funded non-denominational institution in 1957.\nThe university is co-educational, and has over 25,000 undergraduate and over 4,000 post-graduate students. Alumni and former students of the university can be found all across Canada and in 140 countries around the world. Notable alumni include government officials, academics, business leaders and two Nobel laureates. The university ranked 4th among Canadian universities and 94th in the world according to the 2015-2016 Times Higher Education World University Rankings, 4th among Canadian universities and 96th in the world according to the 2015 Academic Ranking of World Universities, and 6th among Canadian universities and 149th in the world according to the 2014 QS World University Rankings. McMaster University is particularly well known for its medical school, which was recently ranked 25th in the world and 3rd in Canada by the Times Higher Education World University Subject Rankings in 2015. The McMaster athletic teams are known as the Marauders, and are members of the Canadian Interuniversity Sport.", "title": "McMaster University"}