{"summary": "1963  was a common year starting on Tuesday of the Gregorian calendar.", "full_text": "\"Mean Woman Blues\" is a 12-bar blues song written by Claude Demetrius. It was first recorded by Elvis Presley as part of the soundtrack for his 1957 motion picture, Loving You. Presley also released the song on Side 2 of a four-song EP record. The Elvis Presley version of \"Mean Woman Blues\" went to #11 on the R&B charts.\nJerry Lee Lewis recorded a version of the song on Sun Records which was released in 1957 as part of an EP, The Great Ball of Fire. Lewis also recorded his version of the song on the 1964 live album Live at the Star Club, Hamburg with The Nashville Teens. The song was also featured as the B side to the UK release of his hit \"Great Balls of Fire\". Jerry Lee Lewis' version differed significantly lyrically from the Claude de Metrius version as recorded by Elvis Presley. Roy Orbison's 1963 recording used the lyrics from the 1957 Jerry Lee Lewis version.\nIn 1959, Cliff Richard and The Shadows recorded a studio version on their Cliff Sings album.\n1950s rockabilly artist Glen Glen from Los Angeles recorded a version of this song for England's Ace label which was released on the album \"Everybody's Movin' Again\"  using the same musicians from his 1950s Era records.\nIn 1963, the song was recorded with \"Blue Bayou\" as a 45rpm single by Roy Orbison that went to #5 on the Billboard Hot 100 music charts. The Roy Orbison version was based on the 1957 Jerry Lee Lewis recording.\nThe song was recorded by The Spencer Davis Group on their album Autumn '66 with Stevie Winwood on lead vocals.\nJay and the Americans released a cover version of the song on their 1969 album, Sands of Time.\nAlthough the song was written in the mid-1950s, many similarly titled though different songs with the same theme had emerged decades previously. These include \"Jimmie's Mean Mama Blues,\" a Jimmie Rodgers composition covered also by Bob Wills, Moon Mullican's \"Mean Mama Blues,\" and Ernest Tubb's \"Mean Mama Blues.\"", "title": "Mean Woman Blues"}