{"summary": "Stanley Benjamin Prusiner  is an American neurologist and biochemist.", "full_text": "Biomedical research  is in general simply known as medical research. It is the basic research, applied research, or translational research conducted to aid and support the development body of knowledge in the field of medicine.\nAn important kind of medical research is clinical research, which is distinguished by the involvement of patients. Other kinds of medical research include pre-clinical research, for example on animals, and basic medical research, for example in genetics.\nBoth clinical and pre-clinical research phases exist in the pharmaceutical industry's drug pipelines, where the clinical phase is denoted by the term clinical trial. However, only part of the whole of clinical or pre-clinical research is oriented towards a specific pharmaceutical purpose. The need for understanding, diagnostics, medical devices and non-pharmaceutical therapies means that medical research is much bigger than just trying to make new drugs.\nThe most basic medical research is a rapidly evolving area that owes much to basic biology and is given names such as Human Biosciences by universities.\nA new paradigm to biomedical research is being termed translational research, which focuses on iterative feedback loops between the basic and clinical research domains to accelerate knowledge translation from the bedside to the bench, and back again. Medical research may involve doing research into public health, biochemistry, clinical research, microbiology, physiology, oncology, surgery and research into many other non-communicable diseases such as diabetes and cardiovascular diseases.\nThe increased longevity of humans over the past century can be significantly attributed to advances resulting from medical research. Among the major benefits of medical research have been vaccines for measles and polio, insulin treatment for diabetes, classes of antibiotics for treating a host of maladies, medication for high blood pressure, improved treatments for AIDS, statins and other treatments for atherosclerosis, new surgical techniques such as microsurgery, and increasingly successful treatments for cancer. New, beneficial tests and treatments are expected as a result of the Human Genome Project. Many challenges remain, however, including the appearance of antibiotic resistance and the obesity epidemic.\nMost of the research in the field is pursued by biomedical scientists, however significant contributions are made by other biologists, as well as chemists and physicists. Medical research, done on humans, has to strictly follow the medical ethics as sanctioned in the Declaration of Helsinki and elsewhere. In all cases, the research ethics has to be respected.", "title": "Medical research"}