{"summary": "Meher Baba  was a spiritual teacher who lived in India.", "full_text": "Meher Baba , born Merwan Sheriar Irani, was an Indian spiritual master who said he was the Avatar, God in human form.\nMerwan Sheriar Irani was born in 1894 in Pune, India to Irani Zoroastrian parents. At the age of 19, he began a seven-year spiritual transformation. During this time he contacted five spiritual masters before beginning his own mission and gathering his own disciples in early 1922, at the age of 27.\nFrom 10 July 1925 to the end of his life, Meher Baba maintained silence, communicating by means of an alphabet board or by unique hand gestures. With his mandali , he spent long periods in seclusion, during which time he often fasted. He also traveled widely, held public gatherings and engaged in works of charity with lepers, the poor and the mentally ill.\nIn 1931, Meher Baba made the first of many visits to the West, where he attracted followers. Throughout most of the 1940s, Meher Baba worked with a category of spiritual aspirants called masts, who he said are entranced or spellbound by internal spiritual experiences. Starting in 1949, along with selected mandali, he traveled incognito about India in an enigmatic and still largely unexplained period he called the \"New Life\".\nAfter being injured as a passenger in two serious automobile accidents, one in the United States in 1952 and one in India in 1956, his ability to walk became severely limited. In 1962, he invited his Western followers to India for a mass darshan called \"The East-West Gathering\". Concerned by an increasing use of LSD and other psychedelic drugs, in 1966 Baba stated that they did not convey real benefits. Despite deteriorating health, he continued what he called his \"Universal Work\", which included fasting and seclusion, until his death on 31 January 1969. His samadhi  in Meherabad, India, has become a place of international pilgrimage.\nMeher Baba gave numerous teachings on the cause and purpose of life, including teaching reincarnation and that the phenomenal world is an illusion. He taught that the Universe is imagination, that God is what really exists, and that each soul is really God passing through imagination to realize individually His own divinity. In addition he gave practical advice for the aspirant who wishes to attain Self-realization and thereby escape the wheel of births and deaths. He also taught about the concept of Perfect Masters, the Avatar, and those on the various stages of the spiritual path that he called involution. His teachings are most importantly recorded in his principal books Discourses and God Speaks.\nHis legacy includes the Avatar Meher Baba Charitable Trust he established in India, a handful of centers for information and pilgrimage, as well as an influence on pop-culture artists and the introduction of common expressions such as \"Don't Worry, Be Happy.\" Meher Baba's silence has remained a mysterious issue as much among his followers as with the rest of the world.", "title": "Meher Baba"}