{"summary": "Mercer County is a county in New Jersey, United States of America.", "full_text": "Mercer County is a county located in the U.S. state of New Jersey. Its county seat is Trenton, the state capital. The county is part of the Trenton, NJ Metropolitan Statistical Area and is considered part of the New York metropolitan area by the United States Census Bureau, but also directly borders the Philadelphia metropolitan area and is included within the Federal Communications Commission's Philadelphia Designated Market Area. As of 2014, Mercer County's Census-estimated population was 371,537, an increase of 1.4% from the 2010 United States Census, when its population was enumerated at 366,513, in turn an increase of 15,752  from the 350,761 enumerated in the 2000 Census, retaining its position as the 12th-most populous county in the state. Mercer County stands among the highest-income counties in the United States, with the Bureau of Economic Analysis having ranked the county as having the 78th-highest per capita income of all 3,113 counties in the United States  as of 2009.\n\nThe county was formed by an Act of the New Jersey Legislature on February 22, 1838, from portions of Burlington County , Hunterdon County , and Middlesex County . The old Keith Line bisects the county and is the boundary between municipalities that previously had been separated into West Jersey and East Jersey. It was named for Continental Army General Hugh Mercer, who died as a result of wounds received at the Battle of Princeton on January 3, 1777. The Mercer Oak, against which the dying general rested as his men continued to fight, appears on the county seal and stood for 250 years until it collapsed in 2000.\nMercer County is home to Princeton University, Princeton Theological Seminary, the Institute for Advanced Study, Rider University, The College of New Jersey, Thomas Edison State College and Mercer County Community College.\n^ a b Mercer County, NJ, National Association of Counties. Accessed January 20, 2013.\n^ a b DP1 - Profile of General Population and Housing Characteristics: 2010 Demographic Profile Data for Mercer County, New Jersey, United States Census Bureau. Accessed January 21, 2013.\n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ May 2012 Metropolitan and Nonmetropolitan Area Definitions, Bureau of Labor Statistics. Accessed October 5, 2013.\n^ Revised Delineations of Metropolitan Statistical Areas, Micropolitan Statistical Areas, and Combined Statistical Areas, and Guidance on Uses of the Delineations of These Areas, Office of Management and Budget, February 28, 2013. Accessed October 3, 2013.\n^ - Philadelphia Market Area Coverage Maps, Federal Communications Commission. Accessed December 28, 2014.\n^ \n^ \n^ NJ Labor Market Views, New Jersey Department of Labor and Workforce Development, March 15, 2011. Accessed October 6, 2013.\n^ \n^ 250 Highest Per Capita Personal Incomes of the 3113 Counties in the United States, 2009, Bureau of Economic Analysis. Accessed April 9, 2012.\n^ Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 161. Accessed October 1, 2013.\n^ Kane, Joseph Nathan; and Aiken, Charles Curry. The American Counties: Origins of County Names, Dates of Creation, and Population Data, 1950-2000, p. 201. Scarecrow Press, 2005. ISBN 0810850362. Accessed January 21, 2013.\n^ Princeton Battlefield's Mercer Oak, Princeton Battlefield's Clarke House Volunteers. Accessed October 6, 2013. \"This white oak later became the symbol for Mercer County , Princeton Township, the NJ Green Acres program, and other agencies. The approximately 250-year-old tree collapsed of its own weight March 3, 2000.\"\n^ About Mercer County, Mercer County. Accessed January 11, 2015.", "title": "Mercer County, New Jersey"}