{"summary": "The Universe is defined as everything that exists, has existed, or will exist, in every location.", "full_text": "The metric expansion of space is the increase of the distance between two distant parts of the universe with time. It is an intrinsic expansion whereby the scale of space itself changes. This is different from other examples of expansions and explosions in that, as far as observations can ascertain, it is a property of the entirety of the universe rather than a phenomenon that can be contained and observed from the outside.\nMetric expansion is a key feature of Big Bang cosmology, is modeled mathematically with the FLRW metric, and is a generic property of the Universe we inhabit. However, the model is valid only on large scales . At smaller scales matter has become bound together under the influence of gravitational attraction and such things do not expand at the metric expansion rate as the Universe ages. As such, the only galaxies receding from one another as a result of metric expansion are those separated by cosmologically relevant scales larger than the length scales associated with the gravitational collapse that are possible in the age of the Universe given the matter density and average expansion rate.\nAt the end of the early universe's inflationary period, all the matter and energy in the Universe was set on an inertial trajectory consistent with the equivalence principle and Einstein's general theory of relativity and this is when the precise and regular form of the universe's expansion had its origin .\nAccording to measurements, the Universe's expansion rate was decelerating until about 5 billion years ago due to the gravitational attraction of the matter content of the Universe, after which time the expansion began accelerating. In order to explain the acceleration, physicists have postulated the existence of dark energy which appears in the simplest theoretical models as a cosmological constant. According to the simplest extrapolation of the currently-favored cosmological model , this acceleration becomes more dominant into the future.\nWhile special relativity prohibits objects from moving faster than light with respect to a local reference frame where spacetime can be treated as flat and unchanging, it does not apply to situations where spacetime curvature or evolution in time become important. These situations are described by general relativity, which allows the separation between two distant objects to increase faster than the speed of light. For example, galaxies that are more than the Hubble radius, approximately 4.5 gigaparsecs or 14.7 billion light-years, away from us have a recession speed that is faster than the speed of light. Visibility of these objects depends on the exact expansion history of the Universe. Light that is emitted today from galaxies beyond the cosmological event horizon, about 5 gigaparsecs or 16 billion light-years, will never reach us, although we can still see the light that these galaxies emitted in the past.\nBecause of the high rate of expansion, it is also possible for a distance between two objects to be greater than the value calculated by multiplying the speed of light by the age of the Universe. These details are a frequent source of confusion among amateurs and even professional physicists.\nDue to the non-intuitive nature of the subject and what has been described by some as \"careless\" choices of wording, certain descriptions of the metric expansion of space and the misconceptions to which such descriptions can lead are an ongoing subject of discussion in the realm of pedagogy and communication of scientific concepts.", "title": "Metric expansion of space"}