{"summary": "Interstate 40, or I-40 is an Interstate Highway in the United States.", "full_text": "Mexican Texas is the name given by Texas history scholars to Texas during the period between 1821 and 1836, when Texas was an integral part of Mexico. The time began with Mexico's victory over Spain in its war of independence in 1821. For the first several years of its existence, Mexican Texas operated very similarly to Spanish Texas. The 1824 Constitution of Mexico joined Texas with Coahuila to form the state of Coahuila y Tejas. The same year, Mexico enacted the General Colonization Law, which enabled all heads of household, regardless of race or immigrant status, to claim land in Mexico. The first empresarial grant had been made under Spanish control to Stephen F. Austin, whose settlers, known as the Old Three Hundred, settled along the Brazos River in 1822. The grant was later ratified by the Mexican government. Twenty-three other empresarios brought settlers to the state, the majority from the United States of America, while others were from Mexico and Europe.\nIn 1830 President Bustamante outlawed the immigration of United States citizens to Texas. Several new presidios were established in the region to monitor immigration and customs practices. Angry colonists held a convention in 1832 to demand that US citizens be allowed to immigrate. A convention the following year proposed that Texas become a separate Mexican state. Although Mexico implemented several measures to appease the colonists, Antonio Lopez de Santa Anna's measures to transform Mexico from a federalist to a centralist state motivated the Texan colonists to revolt.\nThe first violent incident occurred on June 26, 1832, at the battle of Velasco. On March 2, 1836, Texans signed the Texas Declaration of Independence. The Texas Revolution ended on April 21, 1836, when Santa Anna was taken prisoner following the Battle of San Jacinto. Although Texas then governed itself as the Republic of Texas, Mexico refused to recognize its independence.", "title": "Mexican Texas"}