{"summary": "Muhammad Yunus is a Bangladeshi banker and economist who was born on 28 June 1940. He was a professor of economics and is famous for his work in microcredit.", "full_text": "This article is specific to small loans, often provided in a pooled manner. For direct payments to individuals for specific projects, see Micropatronage. For financial services to the poor, see Microfinance. For small payments, see Micropayment.\nMicrocredit is the extension of very small loans  to impoverished borrowers who typically lack collateral, steady employment and a verifiable credit history. It is designed not only to support entrepreneurship and alleviate poverty, but also in many cases to empower women and uplift entire communities by extension. In many communities, women lack the highly stable employment histories that traditional lenders tend to require. Many are illiterate, and therefore unable to complete paperwork required to get conventional loans. As of 2009 an estimated 74 million men and women held microloans that totalled US$38 billion. Grameen Bank reports that repayment success rates are between 95 and 98 percent.\nMicrocredit is part of microfinance, which provides a wider range of financial services, especially savings accounts, to the poor. Modern microcredit is generally considered to have originated with the Grameen Bank founded in Bangladesh in 1983. Many traditional banks subsequently introduced microcredit despite initial misgivings. The United Nations declared 2005 the International Year of Microcredit. As of 2012, microcredit is widely used in developing countries and is presented as having \"enormous potential as a tool for poverty alleviation.\"\nCritics argue, however, that microcredit has not had a positive impact on gender relationships, does not alleviate poverty, has led many borrowers into a debt trap and constitutes a \"privatization of welfare\". The first randomized evaluation of microcredit, conducted by Esther Duflo and others, showed mixed results: there was no effect on household expenditure, gender equity, education or health, but the number of new businesses increased by one third compared to a control group. Professor Dean Karlan from Yale University says that whilst microcredit generates benefits it isn't the panacea that it has been purported to be. He advocates also giving the poor access to savings accounts.", "title": "Microcredit"}