{"summary": "Microfinance is the idea to provide services banks and insurance companies provide to those people who usually are not served by such businesses.", "full_text": "Microfinance is a source of financial services for entrepreneurs and small businesses lacking access to banking and related services. The two main mechanisms for the delivery of financial services to such clients are:  relationship-based banking for individual entrepreneurs and small businesses; and  group-based models, where several entrepreneurs come together to apply for loans and other services as a group. In some regions, for example Southern Africa, microfinance is used to describe the supply of financial services to low-income employees, which is closer to the retail finance model prevalent in mainstream banking.\nFor some, microfinance is a movement whose object is \"a world in which as many poor and near-poor households as possible have permanent access to an appropriate range of high quality financial services, including not just credit but also savings, insurance, and fund transfers.\" Many of those who promote microfinance generally believe that such access will help poor people out of poverty, including participants in the Microcredit Summit Campaign. For others, microfinance is a way to promote economic development, employment and growth through the support of micro-entrepreneurs and small businesses.\nMicrofinance is a broad category of services, which includes microcredit. Microcredit is provision of credit services to poor clients. Microcredit is one of the aspects of microfinance and the two are often confused. Critics may attack microcredit while referring to it indiscriminately as either 'microcredit' or 'microfinance'. Due to the broad range of microfinance services, it is difficult to assess impact, and very few studies have tried to assess its full impact. Proponents often claim that microfinance lifts people out of poverty, but the evidence is mixed. What it does do, however, is to enhance financial inclusion.", "title": "Microfinance"}