{"summary": "A microwave is a kind of high-frequency radio wave.", "full_text": "Microwaves are a form of electromagnetic radiation with wavelengths ranging from one meter to one millimeter; with frequencies between 300 MHz  and 300 GHz . This broad definition includes both UHF and EHF , and various sources use different boundaries. In all cases, microwave includes the entire SHF band  at minimum, with RF engineering often restricting the range between 1 and 100 GHz .\nThe prefix micro- in microwave is not meant to suggest a wavelength in the micrometer range. It indicates that microwaves are \"small\", compared to waves used in typical radio broadcasting, in that they have shorter wavelengths. The boundaries between far infrared, terahertz radiation, microwaves, and ultra-high-frequency radio waves are fairly arbitrary and are used variously between different fields of study.\nBeginning at about 40 GHz, the atmosphere becomes less transparent to microwaves, at lower frequencies to absorption from water vapor and at higher frequencies from oxygen. A spectral band structure causes absorption peaks at specific frequencies . Above 100 GHz, the absorption of electromagnetic radiation by Earth's atmosphere is so great that it is in effect opaque, until the atmosphere becomes transparent again in the so-called infrared and optical window frequency ranges.\nThe term microwave also has a more technical meaning in electromagnetics and circuit theory. Apparatus and techniques may be described qualitatively as \"microwave\" when the frequencies used are high enough that wavelengths of signals are roughly the same as the dimensions of the equipment, so that lumped-element circuit theory is inaccurate. As a consequence, practical microwave technique tends to move away from the discrete resistors, capacitors, and inductors used with lower-frequency radio waves. Instead, distributed circuit elements and transmission-line theory are more useful methods for design and analysis. Open-wire and coaxial transmission lines used at lower frequencies are replaced by waveguides and stripline, and lumped-element tuned circuits are replaced by cavity resonators or resonant lines. In turn, at even higher frequencies, where the wavelength of the electromagnetic waves becomes small in comparison to the size of the structures used to process them, microwave techniques become inadequate, and the methods of optics are used.", "title": "Microwave"}