{"summary": "The Mid-Atlantic States  form one of the nine geographic divisions within the United States that are officially recognized by the United States Census Bureau.", "full_text": "The Mid-Atlantic, also called Middle Atlantic states or the Mid-Atlantic states, form a region of the United States generally located between New England and the South Atlantic States. Its exact definition differs upon source, but the region often includes New York, New Jersey, Pennsylvania, Delaware, Maryland, Washington D.C., Virginia, and West Virginia. When discussing climate, Connecticut  is often included with the Mid-Atlantic region. The Mid-Atlantic has played an important role in the development of American culture, commerce, trade, and industry.\nIt has been called \"the typically American\" region by Frederick Jackson Turner. Religious pluralism and ethnic diversity have been important elements of Mid-Atlantic society from its settlement by Dutch, Swedes, English Catholics, and Quakers through to the period of English rule, and beyond to the current day. After the American Revolution, the Mid-Atlantic region hosted each of the historic capitals of the United States, including the current federal capital, Washington D.C.\nIn the early part of the 19th century, New York and Pennsylvania overtook Virginia as the most populous states and the New England states as the country's most important trading and industrial centers. Large numbers of German, Irish, Italian, Jewish, Polish, and other immigrants transformed the region, especially coastal cities such as New York City, Newark, Philadelphia, Washington D.C., and Baltimore, but also interior cities such as Pittsburgh, Albany, and Buffalo.\nNew York City, with its skyscrapers, subways, and headquarters of the United Nations, emerged in the 20th century as an icon of modernity and American economic and cultural power. By the 21st century, the coastal areas of the Mid-Atlantic were thoroughly urbanized.\nThe Northeast Corridor and Interstate 95 link an almost contiguous sprawl of suburbs and large and small cities, forming the Mid-Atlantic portion of the Northeast megalopolis, one of the world's most important concentrations of finance, media, communications, education, medicine, and technology.\nThe Mid-Atlantic is a relatively affluent region of the nation, having 43 of the 100 highest-income counties in the nation based on median household income and 33 of the top 100 based on per capita income. Most of the Mid-Atlantic states rank among the 15 highest-income states in the nation by median household income and per capita income.", "title": "Mid-Atlantic States"}