{"summary": "Middlesex is one of the historic counties of England and the second smallest by area.", "full_text": "Middlesex  was a county in southeast England that is now mostly part of Greater London, with small sections in neighbouring counties. It was established in the Anglo-Saxon system from the territory of the Middle Saxons. The historic county included land stretching north of the River Thames from 3 miles  east to 17 miles  west of the City of London with the rivers Colne and Lea and a ridge of hills as the other boundaries. The largely low-lying county, dominated by clay in its north and alluvium on gravel in its south, was the second smallest by area in 1831.\nThe City of London was a county in its own right from the 12th century and was able to exert political control over Middlesex. Westminster Abbey dominated most of the early financial, judicial and ecclesiastical aspects of the county. As London grew into Middlesex, the Corporation of London resisted attempts to expand the city boundaries into the county, which posed problems for the administration of local government and justice. In the 18th and 19th centuries the population density was especially high in the southeast of the county, including the East End and West End of London. From 1855 the southeast was administered, with sections of Kent and Surrey, as part of the area of the Metropolitan Board of Works. When county councils were introduced in England in 1889 about 20% of the area of Middlesex, along with a third of its population, was transferred to the new County of London and the remainder became an administrative county governed by the Middlesex County Council that met regularly at the Middlesex Guildhall in Westminster, in the County of London. The City of London, and Middlesex, became separate counties for other purposes and Middlesex regained the right to appoint its own sheriff, lost in 1199.\nIn the interwar years suburban London expanded further, with improvement and expansion of public transport, and the setting up of new industries. After the Second World War, the population of the County of London and inner Middlesex was in steady decline, with high population growth continuing in the outer parts. After a Royal Commission on Local Government in Greater London, almost all of the original area was incorporated into an enlarged Greater London in 1965, with the rest transferred to neighbouring counties. Since 1965 various areas called Middlesex have been used for cricket and other sports. Middlesex was the former postal county of 25 post towns.", "title": "Middlesex"}