{"summary": "Midnight Oil is an Australian rock band.", "full_text": "Midnight Oil  were an Australian rock band originally performing as Farm from 1972 with drummer Rob Hirst, bass guitarist Andrew James and keyboard player/lead guitarist Jim Moginie. While vocalist Peter Garrett was studying at Australian National University in Canberra, he answered an advertisement for a spot in Farm, and by 1975 the band was touring the east coast. By late 1976, Garrett moved to Sydney to complete his law degree, and Farm changed its name to Midnight Oil by drawing the name out of a hat.\nImportant to their development was manager Gary Morris who was able to negotiate favourable contracts with tour promoters and record companies and frustrate rock journalists. Guitarist Martin Rotsey joined in 1977 and Midnight Oil, with Morris, established their own record label Powderworks, which released their debut eponymous album in November 1978, and their first single \"Run by Night\" followed in December. Founding bass guitarist James, forced to leave due to illness in , was replaced by Peter Gifford. Gifford was himself replaced by Bones Hillman in 1987. Through a long and distinguished career, the band became known for its driving hard-rock sound, intense live performances and political activism, particularly in aid of anti-nuclear, environmentalist and indigenous causes.\nMidnight Oil's albums which peaked in the Australian Top Ten were 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, Red Sails in the Sunset, Species Deceases, Diesel and Dust, Blue Sky Mining, Scream in Blue , Earth and Sun and Moon, Breathe, 20,000 Watt R.S.L., Redneck Wonderland, The Real Thing, Capricornia and Flat Chat. Australian Top Ten singles were \"Power and the Passion\", \"The Dead Heart\", \"Beds Are Burning\" and \"Blue Sky Mine\". Aside from chart success, both \"Power and the Passion\" and \"Beds Are Burning\" were listed by Australasian Performing Right Association  in the Top 30 best Australian songs of all time in 2001, a chart in which Midnight Oil are the only artists to feature twice. In December 2002, Garrett announced that he would seek to further his political career and Midnight Oil disbanded. But they would reform for two warm-up shows in Canberra leading up to their performance at one of the \"Sound Relief\" charity concerts, in honour of the victims of the 2009 \"Black Saturday\" fires in Victoria and floods in Queensland.\nMidnight Oil won eleven Australian Recording Industry Association  Awards during its career, including induction into the Hall of Fame in 2006. At the induction, ARIA chairman Denis Handlin described Midnight Oil as true legends that always led by example in a uniquely Australian way with music that is powerful, uncompromising, inspiring, entertaining and enduring.\nIn 2010, their album Diesel and Dust ranked no. 1 in the book The 100 Best Australian Albums by Toby Creswell, Craig Mathieson and John O'Donnell.\n\n", "title": "Midnight Oil"}