{"summary": "Tanakh is an acronym that is almost the same thing as saying the \"Hebrew Bible.\"", "full_text": "Mikveh or mikvah  is a bath used for the purpose of ritual immersion in Judaism. In the Hebrew Bible, the word is employed in its broader sense but generally means a collection of water. Several biblical regulations specify that full immersion in water is required to regain ritual purity after ritually impure incidents have occurred. A person was required to be ritually pure in order to enter the Temple. In addition, a convert to Judaism is required to immerse in a mikveh as part of his/her conversion, and a woman is required to immerse in a mikveh after her menstrual period or childbirth before she and her husband can resume marital relations. In this context, \"purity\" and \"impurity\" are imperfect translations of the Hebrew \"tahara\" and \"tumah\", respectively, in that the negative connotation of the word impurity is not intended; rather being \"impure\" is indicative of being in a state in which certain things are prohibited  until one has become \"pure\" again by immersion in a mikveh.\nFull ritual purity of the type needed to enter or serve in the Temple is not attainable by anyone today, as all are considered to be ritually impure by virtue of exposure to death , and that kind of ritual purity can only be obtained when the Jewish people have a Red heifer.\nMost forms of impurity can be nullified through immersion in any natural collection of water. However, some impurities, such as a zav, require \"living water,\" such as springs or groundwater wells. Living water has the further advantage of being able to purify even while flowing, as opposed to rainwater which must be stationary in order to purify. The mikveh is designed to simplify this requirement, by providing a bathing facility that remains in ritual contact with a natural source of water.\nIts main uses nowadays are:\nby Jewish women to achieve ritual purity after menstruation or childbirth;\nby Jewish men to achieve ritual purity ;\nas part of a traditional procedure for conversion to Judaism;\nto immerse newly acquired utensils used in serving and eating food.\nIn Orthodox Judaism, these regulations are steadfastly adhered to and, consequently, the mikveh is central to an Orthodox Jewish community; they formally hold in Conservative Judaism as well. The existence of a mikveh is considered so important in Orthodox Judaism that an Orthodox community is required to construct a mikveh before building a synagogue, and must go to the extreme of selling Torah scrolls or even a synagogue if necessary, to provide funding for the construction. Reform Judaism and Reconstructionist Judaism regard the biblical regulations as anachronistic to some degree, and consequently do not put much importance on the existence of a mikveh. Some opinions within Conservative Judaism have sought to retain the ritual requirements of a mikveh while recharacterizing the theological basis of the ritual in concepts other than ritual purity.\nAncient mikvehs dating from before the late 1st century can be found throughout the land of Israel as well as in historic communities of the Jewish diaspora. In modern times, mikvehs can be found in most communities in Orthodox Judaism. Jewish funeral homes may have a mikveh for immersing a body during the purification procedure  before burial.", "title": "Mikveh"}