{"summary": "Mir was a space station created by the Soviet Union and later owned and operated by Russia.", "full_text": "Mir  was a space station that operated in low Earth orbit from 1986 to 2001, owned by the Soviet Union and later by Russia. Mir was the first modular space station and was assembled in orbit from 1986 to 1996. It had a greater mass than any previous spacecraft. Until 21 March 2001 it was the largest artificial satellite in orbit, succeeded by the International Space Station after Mir's orbit decayed. The station served as a microgravity research laboratory in which crews conducted experiments in biology, human biology, physics, astronomy, meteorology and spacecraft systems with a goal of developing technologies required for permanent occupation of space.\nMir was the first continuously inhabited long-term research station in orbit and set the record for the longest continuous human presence in space at 3,644 days until 23 October 2010 when it was surpassed by the ISS. It holds the record for the longest single human spaceflight, with Valeri Polyakov spending 437 days and 18 hours on the station between 1994 and 1995. Mir was occupied for a total of twelve and a half years out of its fifteen-year lifespan, having the capacity to support a resident crew of three, or larger crews for short term visits.\nFollowing the success of the Salyut programme, Mir represented the next stage in the Soviet Union's space station programme. The first module of the station, known as the core module or base block, was launched in 1986, and followed by six further modules. Proton rockets were used to launch all of its components except for the docking module, which was installed by space shuttle mission STS-74 in 1995. When complete, the station consisted of seven pressurised modules and several unpressurised components. Power was provided by several photovoltaic arrays attached directly to the modules. The station was maintained at an orbit between 296 km  and 421 km  altitude and traveled at an average speed of 27,700 km/h , completing 15.7 orbits per day.\nThe station was launched as part of the Soviet Union's manned spaceflight programme effort to maintain a long-term research outpost in space, and, following the collapse of the USSR, was operated by the new Russian Federal Space Agency . As a result, the vast majority of the station's crew were Russian; however, through international collaborations such as the Intercosmos, Euromir and Shuttle-Mir programmes, the station was made accessible to astronauts from North America, several European nations and Japan. Mir was deorbited in March 2001 because of a lack of funding. The cost of the Mir programme was estimated by former RKA General Director Yuri Koptev in 2001 as $4.2 billion over its lifetime .", "title": "Mir"}