{"summary": "Mogadishu  is the capital city of the African country of Somalia.", "full_text": "Mogadishu , known locally as Xamar , is the largest and capital city of Somalia. Located in the coastal Banaadir region on the Indian Ocean, the city has served as an important port for centuries. As of 2015, it has a population of 2,120,000 residents.\nTradition and old records assert that southern Somalia, including the Mogadishu area, was historically inhabited by hunter-gatherers. These were later joined by Cushitic agro-pastoralists, who would go on to establish local aristocracies. During its medieval Golden Age, Mogadishu was ruled by the Muzaffar dynasty, a vassal of the Ajuran Sultanate. It subsequently fell under the control of an assortment of local Sultanates and polities, most notably the Geledi Sultanate. The city later became the capital of Italian Somaliland  in the colonial period. After the Somali Republic became independent in 1960, Mogadishu became known and promoted as the White Pearl of the Indian Ocean. After the ousting of the Siad Barre regime in 1991 and the ensuing civil war, various militias fought for control of the city, later to be replaced by the Islamic Courts Union in the mid-2000s. The ICU thereafter splintered into more radical groups, notably Al-Shabaab, which fought the Transitional Federal Government  and its AMISOM allies. With a change in administration in late 2010, government troops and their military partners had succeeded in forcing out Al-Shabaab by August 2011. Mogadishu has subsequently experienced a period of intense reconstruction.\nAs Somalia's capital city, many important national institutions are based in Mogadishu. It is the seat of the Federal Government of Somalia established in August 2012, with the Somalia Federal Parliament serving as the government's legislative branch. Yusuf Hussein Jimaale has been the Mayor of Mogadishu since October 2015. Villa Somalia is the official residential palace and principal workplace of the President of Somalia, Hassan Sheikh Mohamud. In May 2012, the First Somali Bank was established in the capital, which organized Mogadishu's first ever Technology, Entertainment, Design  conference. The establishment of a local construction yard has also galvanized the city's real-estate sector. Arba'a Rukun Mosque is one of the oldest Islamic places of worship in the capital, built circa 667 . The Mosque of Islamic Solidarity in Mogadishu is the largest masjid in the Horn region. Mogadishu Cathedral was built in 1928 by the colonial authorities in Italian Somaliland in a Norman Gothic style, and served as the traditional seat of the Roman Catholic Diocese of Mogadiscio. The National Museum of Somalia is based in Mogadishu and holds many culturally important artefacts. The National Library of Somalia is undergoing a $1 million Somali federal government funded renovation, including a new library complex.\nMogadishu is home to a number of scholastic and media institutions. As part of the municipality's urban renewal program, 100 schools across the capital are scheduled to be refurbished and reopened. The Somali National University  was established in the 1950s, and professors from the university later founded the non-governmental Mogadishu University . Benadir University  was established in 2002 with the intention of training doctors. Various national sporting bodies have their headquarters in Mogadishu, including the Somali Football Federation and the Somali Olympic Committee. Mogadishu Stadium was constructed in 1978 during the Siad Barre administration, with the assistance of Chinese engineers. It hosts football matches with teams from the Somalia League and the Somalia Cup. Additionally, the Port of Mogadishu serves as a major national seaport and is the largest harbour in Somalia. Mogadishu International Airport, the capital's main airport, is the hub of the relaunched national carrier Somali Airlines.", "title": "Mogadishu"}