{"summary": "The Portuguese Grand Prix  was a motor racing event held for several years, starting in the 1950s.", "full_text": "Monsanto Company is a publicly traded American multinational agrochemical and agricultural biotechnology corporation headquartered in Creve Coeur, Greater St. Louis, Missouri. It is a leading producer of genetically engineered  seed and Roundup, a glyphosate-based herbicide. Monsanto's role in agricultural changes, biotechnology products, lobbying of government agencies, and history as a chemical company have made the company controversial.\nFounded in 1901 by John Francis Queeny, Monsanto initially produced food additives like saccharin and vanillin, expanded into industrial chemicals like sulfuric acid and PCBs in the 1920s, and by the 1940s was a major producer of plastics, including polystyrene and synthetic fibers. Notable achievements by Monsanto and its scientists as a chemical company included breakthrough research on catalytic asymmetric hydrogenation and being the first company to mass-produce light emitting diodes . The company also formerly manufactured controversial products such as the insecticide DDT, PCBs, Agent Orange, and recombinant bovine somatotropin .\nMonsanto was among the first to genetically modify a plant cell, as one of four groups announcing the introduction of genes into plants in 1983, and was among the first to conduct field trials of genetically modified crops, which it did in 1987. It remained one of the top 10 U.S. chemical companies until it divested most of its chemical businesses between 1997 and 2002, through a process of mergers and spin-offs that focused the company on biotechnology.\nMonsanto was one of the first companies to apply the biotechnology industry business model to agriculture, using techniques developed by Genentech and other biotech drug companies in the late 1970s in California. In this business model, companies invest heavily in research and development, and recoup the expenses through the use and enforcement of biological patents. Its seed patenting model has also been criticized as biopiracy and a threat to biodiversity.", "title": "Monsanto"}