{"summary": "Morristown is a town of Morris County in the state of New Jersey, United States.", "full_text": "Morristown is a town in Morris County, New Jersey, United States. As of the 2010 United States Census, the town's population was 18,411, reflecting a decline of 133  from the 18,544 counted in the 2000 Census, which had in turn increased by 2,355  from the 16,189 counted in the 1990 Census. It is the county seat of Morris County. Morristown has been called \"the military capital of the American Revolution\" because of its strategic role in the war for independence from Great Britain. Today this history is visible in a variety of locations throughout the town that collectively make up Morristown National Historical Park.\nAccording to British colonial records, the first permanent European settlement at Morristown occurred in 1715, when a settlement was founded as New Hanover by migrants from New York and Connecticut. Morris County was created on March 15, 1739, from portions of Hunterdon County. The county, and ultimately Morristown itself, was named for the popular Governor of the Province, Lewis Morris, who championed benefits for the colonists.\nMorristown was incorporated as a town by an act of the New Jersey Legislature on April 6, 1865, within Morris Township, and it was formally set off from the township in 1895.\n^ a b c d e 2010 Census Gazetteer Files: New Jersey County Subdivisions, United States Census Bureau. Accessed May 21, 2015.\n^ US Gazetteer files: 2010, 2000, and 1990, United States Census Bureau. Accessed September 4, 2014.\n^ 2015 New Jersey Mayors Directory, New Jersey Department of Community Affairs, as of October 20, 2015. Accessed November 12, 2015.\n^ a b Staff Directory, Town of Morristown. Accessed July 19, 2012.\n^ \n^ U.S. Geological Survey Geographic Names Information System: Town of Morristown, Geographic Names Information System. Accessed March 8, 2013.\n^ a b DP-1 - Profile of General Population and Housing Characteristics: 2010 for Morristown town, Morris County, New Jersey, United States Census Bureau. Accessed July 19, 2012.\n^ \n^ a b Profile of General Demographic Characteristics: 2010 for Morristown town, New Jersey Department of Labor and Workforce Development. Accessed July 19, 2012.\n^ \n^ a b GCT-PH1 Population, Housing Units, Area, and Density: 2010 - State -- County Subdivision from the 2010 Census Summary File 1 for New Jersey, United States Census Bureau. Accessed December 19, 2012.\n^ Look Up a ZIP Code, United States Postal Service. Accessed September 4, 2011.\n^ Area Code Lookup - NPA NXX for Convent Station, NJ, Area-Codes.com. Accessed September 6, 2014.\n^ American FactFinder, United States Census Bureau. Accessed September 4, 2014.\n^ A Cure for the Common Codes: New Jersey, Missouri Census Data Center. Accessed July 19, 2012.\n^ US Board on Geographic Names, United States Geological Survey. Accessed September 4, 2014.\n^ Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010, New Jersey Department of Labor and Workforce Development, February 2011. Accessed July 19, 2012.\n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ Morris County, NJ, National Association of Counties. Accessed January 21, 2013.\n^ About Morristown, Town of Morristown. Accessed April 3, 2013. \"Morristown became characterized as 'the military capital of the American Revolution' because of its strategic role in the war for independence from Great Britain.\"\n^ Weig, Melvin J.; and Craig, Vera B. Morristown: A Military Capital of the American Revolution, National Park Service, 1950, reprinted 1961. Accessed July 19, 2011.\n^ Hutchinson, Viola L. The Origin of New Jersey Place Names, New Jersey Public Library Commission, May 1945. Accessed September 8, 2015.\n^ Gannett, Henry. The Origin of Certain Place Names in the United States, p. 215. United States Government Printing Office, 1905. Accessed September 8, 2015.\n^ Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 195. Accessed July 19, 2012.", "title": "Morristown, New Jersey"}