{"summary": "Mozambique, officially the Republic of Mozambique, is a country in southeastern Africa.", "full_text": "Mozambique , officially the Republic of Mozambique , is a country in Southeast Africa bordered by the Indian Ocean to the east, Tanzania to the north, Malawi and Zambia to the northwest, Zimbabwe to the west, and Swaziland and South Africa to the southwest. It is separated from Madagascar by the Mozambique Channel to the east. The capital and largest city is Maputo .\nBetween the 1st and 5th centuries AD, Bantu-speaking peoples migrated from farther north and west. Swahili, and later also Arab, commercial ports existed along the coasts until the arrival of Europeans. The area was explored by Vasco da Gama in 1498 and colonized by Portugal from 1505. After over four centuries of Portuguese rule, Mozambique gained independence in 1975, becoming the People's Republic of Mozambique shortly thereafter. After only two years of independence, the country descended into an intense and protracted civil war lasting from 1977 to 1992. In 1994, Mozambique held its first multiparty elections and has remained a relatively stable presidential republic.\nMozambique is one of the poorest and most underdeveloped countries in the world. Mozambique is endowed with rich and extensive natural resources. The country's economy is based largely on agriculture, but industry, mainly food and beverages, chemical manufacturing, aluminium and petroleum production, is growing. The country's tourism sector is also growing. South Africa is Mozambique's main trading partner and source of foreign direct investment. Portugal, Brazil, Spain and Belgium are also among the country's most important economic partners. Since 2001, Mozambique's annual average GDP growth has been among the world's highest. However, the country ranks among the lowest in GDP per capita, human development, measures of inequality, and average life expectancy.\nThe only official language of Mozambique is Portuguese, which is spoken mostly as a second language by about half of the population. Common native languages include Swahili, Makhuwa and Sena. The country's population of around 24 million is composed overwhelmingly of Bantu people. The largest religion in Mozambique is Christianity, with significant minorities following Islam and African traditional religions. Mozambique is a member of the African Union, the Commonwealth of Nations, the Community of Portuguese Language Countries, the Latin Union, the Non-Aligned Movement and the Southern African Development Community, and an observer at La Francophonie.", "title": "Mozambique"}