{"summary": "Muhammad  was an Arabian religious and political leader.", "full_text": "Muhammad , the Prophet of Islam, is seen by non-believers as its founder, but by almost all Muslims as its last prophet sent by God to mankind to restore Islam, which they believe to be the unaltered original monotheistic faith of Adam, Abraham, Moses, Jesus, and other prophets. He had united Arabia into a single Muslim polity and ensured that his teachings, practices, and the Quran, which Muslims believe was revealed to him by God, formed the basis of Islamic religious belief.\nBorn approximately in 570 CE in the Arabian city of Mecca, Muhammad was orphaned at an early age; he was raised under the care of his paternal uncle Abu Talib. After his childhood Muhammad primarily worked as a merchant. Occasionally, he would retreat to a cave named Hira in the mountains for several nights of seclusion and prayer; later, at age 40, he reported being visited by Gabriel in the cave and received his first revelation from God. Three years after this event Muhammad started preaching these revelations publicly, proclaiming that \"God is One\", that complete \"surrender\"  to him is the only way  acceptable to God, and that he was a prophet and messenger of God, similar to the other prophets in Islam.\nMuhammad gained few early followers, and met hostility from some Meccan tribes. To escape persecution, Muhammad sent some followers to Abyssinia before he and his followers migrated from Mecca to Medina  in the year 622. This event, the Hijra, marks the beginning of the Islamic calendar, also known as the Hijri Calendar. In Medina, Muhammad united the tribes under the Constitution of Medina. After eight years of intermittent conflict with Meccan tribes, Muhammad gathered an army of 10,000 Muslim converts and marched on the city of Mecca. The attack went largely uncontested and Muhammad seized the city with little bloodshed. He destroyed 360 pagan idols at the Kaaba. In 632, a few months after returning from the Farewell Pilgrimage, Muhammad fell ill and died. Before his death, most of the Arabian Peninsula had converted to Islam.\nThe revelations , which Muhammad reported receiving until his death, form the verses of the Quran, regarded by Muslims as the \"Word of God\" and around which the religion is based. Besides the Quran, Muhammad's teachings and practices , found in the Hadith and sira literature, are also upheld by Muslims and used as sources of Islamic law .", "title": "Muhammad"}