{"summary": "The Munich Agreement was an agreement between France, Italy, Nazi Germany and Britain.", "full_text": "The Munich Agreement was a settlement permitting Nazi Germany's annexation of portions of Czechoslovakia along the country's borders mainly inhabited by German speakers, for which a new territorial designation \"Sudetenland\" was coined. The agreement was negotiated at a conference held in Munich, Germany, among the major powers of Europe, excluding the Soviet Union and Czechoslovakia. Today, it is widely regarded as a failed act of appeasement toward Germany. The agreement was signed in the early hours of 30 September 1938 . The purpose of the conference was to discuss the future of the Sudetenland in the face of ethnic demands made by Adolf Hitler. The agreement was signed by Germany, France, the United Kingdom, and Italy. Sudetenland was of immense strategic importance to Czechoslovakia, as most of its border defenses were situated there, and many of its banks and heavy industries were located there as well.\nBecause the state of Czechoslovakia was not invited to the conference, it considered itself to have been betrayed by the United Kingdom and France, so Czechs and Slovaks call the Munich Agreement the Munich Diktat . The phrase \"Munich Betrayal\"  is also used because the military alliance Czechoslovakia had with France and Britain proved useless and also known because of the phrase \"About us, without us!\" This phrase is most hurtful for people of Czechoslovakia . Today the document is typically referred to simply as the Munich Pact .\nIn Germany the Sudeten crisis led to the so-called Oster Conspiracy. General Hans Oster, deputy head of the Abwehr, and prominent figures within the German military who opposed the regime for its behaviour that was threatening to bring Germany into a war that they believed it was not ready to fight, discussed overthrowing Hitler and the Nazi regime through a planned storming of the Reich Chancellery by forces loyal to the plot.", "title": "Munich agreement"}