{"summary": "Island Records is a record label that was founded by British makers in Jamaica.", "full_text": "The music of the United States reflects the country's multi-ethnic population through a diverse array of styles. It is a mixture of music influenced by West African, Irish, Scottish, Mexican, and Cuban music traditions among others. The country's most internationally renowned genres are jazz, blues, country, bluegrass, rock, rhythm and blues, ragtime, hip hop, barbershop, pop, experimental, techno, house, dance, boogaloo, salsa, and rock and roll. The United States has the world's largest music market with a total retail value of 4,481.8 million dollars in 2012, and its music is heard around the world. Since the beginning of the 20th century, some Forms of American popular music have gained a near global audience.\nNative Americans were the earliest inhabitants of the land that is today known as the United States and played its first music. Beginning in the 17th century, immigrants from the United Kingdom, Ireland, Spain, Germany and France began arriving in large numbers, bringing with them new styles and instruments. African slaves brought musical traditions, and each subsequent wave of immigrants contributed to a melting pot.\nMuch of modern popular music can trace its roots to the emergence in the late 19th century of African American blues and the growth of gospel music in the 1920s. The African American basis for popular music used elements derived from European and indigenous musics. There are also strong African roots in the music tradition of the original white settlers, such as country and bluegrass. The United States has also seen documented folk music and recorded popular music produced in the ethnic styles of the Ukrainian, Irish, Scottish, Polish, Hispanic and Jewish communities, among others.\nMany American cities and towns have vibrant music scenes which, in turn, support a number of regional musical styles. Along with musical centers such as Philadelphia, Seattle, New York City, San Francisco, New Orleans, Detroit, Minneapolis, Chicago, Miami, Atlanta, Nashville, Austin, and Los Angeles, many smaller cities such as Asbury Park, New Jersey have produced distinctive styles of music. The Cajun and Creole traditions in Louisiana music, the folk and popular styles of Hawaiian music, and the bluegrass and old time music of the Southeastern states are a few examples of diversity in American music.\n^ \"RIAJ Yearbook 2013: IFPI 2011, 2012 Report: 29. Global Sales of Recorded Music \" . Recording Industry Association of Japan. Retrieved 2013-09-08. \n^ Provine, Rob with Okon Hwang and Andy Kershaw. \"Our Life Is Precisely a Song\" in the Rough Guide to World Music, Volume 2, pg. 167", "title": "Music of the United States"}