{"summary": "Islam  is a monotheistic religion articulated by the Qur'an, considered by its adherents  to be the verbatim word of God, also by the teachings and normative example of Muhammad, considered by them to be the last prophet of God.", "full_text": "A Muslim, sometimes spelled Moslem, relates to a person who follows the religion of Islam, a monotheistic and Abrahamic religion based on the Quran. Muslims consider the Quran to be the verbatim word of God as revealed to the Islamic prophet Muhammad. They also follow the teachings and practices of Muhammad as recorded in traditional accounts called hadith. \"Muslim\" is an Arabic word meaning \"one who submits \". A female Muslim is sometimes called a Muslimah. There are customs holding that a man and woman or teenager and adolescent above the age of fifteen of a lunar or solar calendar who possesses the faculties of rationality, logic or sanity, but misses numerous successive Jumu'ahs without a valid excuse, no longer qualifies as a Muslim.\nMost Muslims will accept anyone who has publicly pronounced the declaration of faith  as a Muslim. The shahadah states:\n\nThere is no god but the God and Muhammad is the last messenger of the God.\n\nIslamic beliefs commonly held by Muslims include: that God  is eternal, transcendent and absolutely one ; that God is incomparable, self-sustaining and neither begets nor was begotten; that Islam is the complete and universal version of a primordial faith that has been revealed before through many prophets including Abraham, Moses, Ishmael and Jesus; that these previous messages and revelations have been partially changed or corrupted over time and that the Qur'an is the final unaltered revelation from God .\nThe religious practices of Muslims are enumerated in the Five Pillars of Islam, which, in addition to Shahadah, consist of daily prayers , fasting during the Islamic month of Ramadan , almsgiving , and the pilgrimage to Mecca  at least once in a lifetime.", "title": "Muslim"}