{"summary": "Mystery Science Theater 3000  was a comedy television series.", "full_text": "Mystery Science Theater 3000, abbreviated MST3K, is an American television comedy series created by Joel Hodgson and produced by Best Brains, Inc. The show premiered on KTMA in Minneapolis, Minnesota on November 24, 1988. It later aired on The Comedy Channel/Comedy Central for another six seasons until its cancellation in 1997. Through a fan-driven write-in campaign, the show was picked up by The Sci-Fi Channel and aired for another three seasons until its final cancellation in August 1999. The series ran for 11 years, with 197 episodes, and one feature film.\nThe show's premise is based on janitor Joel Robinson  being launched against his will onto the Satellite of Love by \"The Mads,\" a pair of mad scientists, as part of an experiment to find the worst film ever made. During the course of an episode, the Mads would force Joel to watch a bad B-movie to study its effects on him. Joel, to keep his sanity, crafted a number of robot companions, including Tom Servo, Crow T. Robot, and Gypsy, to keep him company and to help him humorously comment atop the movie, a process knowing as riffing. The show would be presented in its trademarked \"Shadowrama\" style, with silhouettes of Joel, Tom and Crow on a row of theater seats at the bottom of the film, and also included interstitial sketches based on prop comedy throughout an episode. The show's cast changed over its duration; most notably, Joel was replaced by Mike Nelson  in the show's fifth season. Other cast members, most who were also writers for the show, include Trace Beaulieu, Josh Weinstein, Jim Mallon, Kevin Murphy, Frank Conniff, Mary Jo Pehl, and Bill Corbett.\nMST3K won a Peabody Award in 1993, and was listed as one of Time magazine's \"100 Best TV Shows of All-Time\" in 2007. It was also nominated for two Emmy Awards  in 1994 and 1995, and a CableACE Award.\nFollowing the show's cancellation, various crew members launched separate projects in the same theme as MST3K, including Rifftrax  and Cinematic Titanic. A revival of the series was launched in 2015 by Hodgson and Shout! Factory, who has helped to secure licensing rights for the MST3K brand and for past MST3K episodes for home media and online streaming. The revival, based on crowd-sourced Kickstarter funding, will include at least 6 new episodes, and will star Jonah Ray as the new human test subject aboard the Satellite of Love, and Felicia Day and Patton Oswalt as the new Mads.\n\n", "title": "Mystery Science Theater 3000"}