{"summary": "The Nanking Massacre was a genocide that took place in Nanjing, China during the Second World War.", "full_text": "The Nanking Massacre or Nanjing Massacre, also known as the Rape of Nanking or Rape of Nanjing, was an episode during the Second Sino-Japanese War of mass murder and mass rape by Japanese troops against the residents of Nanjing , then capital of the Republic of China. The massacre occurred over six weeks starting December 13, 1937, the day that the Japanese captured Nanjing. During this period, soldiers of the Imperial Japanese Army murdered an estimated 40,000 to over 300,000 Chinese civilians and disarmed combatants, and perpetrated widespread rape and looting. Several key perpetrators were tried and found guilty at the International Military Tribunal for the Far East and the Nanjing War Crimes Tribunal, and were executed. A key perpetrator, Prince Asaka of the Imperial Family, escaped prosecution by having earlier been granted immunity by the Allies.\nSince most Japanese military records on the killings were kept secret or destroyed shortly after the surrender of Japan in 1945, historians have not been able to accurately estimate the death toll of the massacre. The International Military Tribunal for the Far East estimated in 1948 that over 200,000 Chinese were killed in the incident. China's official estimate is more than 300,000 dead based on the evaluation of the Nanjing War Crimes Tribunal in 1947. The death toll has been actively contested among scholars since the 1980s.\nThe event remains a contentious political issue, as aspects of it have been disputed by historical negationists and Japanese nationalists who assert that the massacre has been either exaggerated or fabricated for propaganda purposes. The controversy surrounding the massacre remains a stumbling block in Sino-Japanese relations and in Japanese relations with other Asia-Pacific nations such as South Korea and the Philippines.\nAlthough the Japanese government has admitted to the killing of a large number of non-combatants, looting, and other violence committed by the Imperial Japanese Army after the fall of Nanking, and Japanese veterans who served there have confirmed that a massacre took place, a small but vocal minority within both the Japanese government and society have argued that the death toll was military in nature and that no such crimes ever occurred. Denial of the massacre and revisionist accounts of the killings have become a staple of Japanese nationalism. In Japan, public opinion of the massacres varies, but few deny outright that it happened.", "title": "Nanking Massacre"}