{"summary": "The Napoleonic Wars were wars which were fought during the rule of Napoleon Bonaparte over France.", "full_text": "The Napoleonic Wars  were a series of major conflicts pitting the French Empire, led by Emperor Napoleon I, against an array of European powers formed into various coalitions. They revolutionized European armies and played out on an unprecedented scale, mainly owing to the application of modern mass conscription. The wars are traditionally seen as a continuation of the Revolutionary Wars, which broke out in 1792 during the French Revolution. Initially, French power rose quickly as the armies of Napoleon conquered much of Europe. In his military career, Napoleon fought about 60 battles and lost seven, mostly at the end of his reign. The great French dominion collapsed rapidly after the disastrous Invasion of Russia in 1812. Napoleon was defeated in 1814, and then once more in 1815 at Waterloo after a brief return to power. The Allies then reversed all French gains since the Revolutionary Wars at the Congress of Vienna.\nBefore a final victory against Napoleon, five of seven coalitions saw defeat at the hands of France. France defeated the first and second coalitions during the French Revolutionary Wars, the third , the fourth  and the fifth coalition  under the leadership of Napoleon. These great victories gave the French Army a sense of invulnerability, especially when it approached Moscow. But after the retreat from Russia, in spite of incomplete victories, France was defeated by the sixth coalition at Leipzig, in the Peninsular War at Vitoria and at the hands of the seventh coalition at Waterloo.\nThe wars resulted in the dissolution of the Holy Roman Empire and sowed the seeds of nationalism that would lead to the consolidations of Germany and Italy later in the century. Meanwhile, the global Spanish Empire began to unravel as French occupation of Spain weakened Spain's hold over its colonies, providing an opening for nationalist revolutions in Spanish America. As a direct result of the Napoleonic wars, the British Empire became the foremost world power for the next century, thus beginning Pax Britannica.\nNo consensus exists about when the French Revolutionary Wars ended and the Napoleonic Wars began. An early candidate is 9 November 1799, the date of Bonaparte's coup seizing power in France. However, the most common date is 18 May 1803, when renewed war broke out between Britain and France, ending the one-year-old Peace of Amiens, the only period of general peace in Europe between 1792 and 1814. Most actual fighting ceased following Napoleon's final defeat at Waterloo on 18 June 1815, although skirmishing continued as late as 3 July 1815 at the Battle of Issy. The Second Treaty of Paris officially ended the wars on 20 November 1815.", "title": "Napoleonic Wars"}