{"summary": "A national park is a park officially recognised by a nation's government.", "full_text": "A national park is a park in use for conservation purposes. Often it is a reserve of natural, semi-natural, or developed land that a sovereign state declares or owns. Although individual nations designate their own national parks differently, there is a common idea: the conservation of 'wild nature' for posterity and as a symbol of national pride. An international organization, the International Union for Conservation of Nature , and its World Commission on Protected Areas, has defined \"National Park\" as its Category II type of protected areas.\nWhile this type of national park had been proposed previously, the United States established the first \"public park or pleasuring-ground for the benefit and enjoyment of the people\", Yellowstone National Park, in 1872. Although Yellowstone was not officially termed a \"national park\" in its establishing law, it was always termed such in practice and is widely held to be the first and oldest national park in the world. The first area to use \"national park\" in its creation legislation was the US's Mackinac Island, in 1875. Australia's Royal National Park, established in 1879, was the world's third official national park. In 1895 ownership of Mackinac Island was transferred to the State of Michigan as a state park and national park status was consequently lost. As a result, Australia's Royal National Park is by some considerations the second oldest national park now in existence.\nThe largest national park in the world meeting the IUCN definition is the Northeast Greenland National Park, which was established in 1974. According to the IUCN, 6,555 national parks worldwide met its criteria in 2006. IUCN is still discussing the parameters of defining a national park.\nNational parks are almost always open to visitors. Most national parks provide outdoor recreation and camping opportunities as well as classes designed to educate the public on the importance of conservation and the natural wonders of the land in which the national park is located.", "title": "National parks"}