{"summary": "Nationalism is a way of thinking that says that every ethnic group of humans should be free to rule itself.", "full_text": "Nationalism is essentially a shared group feeling in the significance of a geographical and sometimes demographic region seeking independence for its culture and/or ethnicity that holds that group together. This can be expressed as a belief or political ideology that involves an individual identifying with or becoming attached to one's nation. Nationalism involves national identity, by contrast with the related concept of patriotism, which involves the social conditioning and personal behaviors that support a state's decisions and actions.\nFrom a political or sociological perspective, there are two main perspectives on the origins and basis of nationalism. One is the primordialist perspective that describes nationalism as a reflection of the ancient and perceived evolutionary tendency of humans to organize into distinct groupings based on an affinity of birth. The other is the modernist perspective that describes nationalism as a recent phenomenon that requires the structural conditions of modern society in order to exist.\nAn alternative perspective to both of these lineages comes out of Engaged theory, and argues that while the form of nationalism is modern, the content and subjective reach of nationalism depends upon 'primordial' sentiments.\nThere are various definitions for what constitutes a nation, however, which leads to several different strands of nationalism. It can be a belief that citizenship in a state should be limited to one ethnic, cultural, religious, or identity group, or that multinationality in a single state should necessarily comprise the right to express and exercise national identity even by minorities. The adoption of national identity in terms of historical development has commonly been the result of a response by influential groups unsatisfied with traditional identities due to inconsistency between their defined social order and the experience of that social order by its members, resulting in a situation of anomie that nationalists seek to resolve. This anomie results in a society or societies reinterpreting identity, retaining elements that are deemed acceptable and removing elements deemed unacceptable, in order to create a unified community. This development may be the result of internal structural issues or the result of resentment by an existing group or groups towards other communities, especially foreign powers that are or are deemed to be controlling them.\nNational flags, national anthems and other symbols of national identity are commonly considered highly important symbols of the national community.", "title": "Nationalism"}