{"summary": "Naturalization is when a person changes his or her nationality.", "full_text": "Naturalization  is the legal act or process by which a non-citizen in a country may acquire citizenship or nationality of that country. It may be done by a statute, without any effort on the part of the individual, or it may involve an application and approval by legal authorities. The rules of naturalization vary from country to country and typically include a minimum legal residency requirement, and may specify other requirements such as knowledge of the national dominant language or culture, a promise to obey and uphold that country's laws. An oath or pledge of allegiance is also sometimes required. Some countries also require that the person renounce any other citizenship that they currently hold, forbidding dual citizenship, but whether this renunciation actually causes loss of the person's original citizenship, as seen by the host country and by the original country, will again depend on the laws of the countries involved.\nThe massive increase in population flux due to globalization and the sharp increase in the numbers of refugees following World War I created a large number of stateless persons, people who were not citizens of any state. In some rare cases, procedures of mass naturalization were passed. As naturalization laws had been designed to cater for the relatively few people who had voluntarily moved from one country to another , western democracies were not ready to naturalize the massive influx of stateless people which followed massive denationalizations and the expulsion of ethnic minorities from newly created nation states in the first part of the 20th century, but they also counted the  Russians who had escaped the 1917 October Revolution and the war communism period, and then the Spanish refugees. As Hannah Arendt pointed out, internment camps became the \"only nation\" of such stateless people, since they were often considered \"undesirable\" and were stuck in an illegal situation .\nSince World War II, the increase in international migrations created a new category of refugees, most of them economic refugees. For economic, political, humanitarian and pragmatic reasons, many states passed laws allowing a person to acquire their citizenship after birth , in order to reduce the scope of this category. However, in some countries this system still maintains a large part of the immigrated population in an illegal status, albeit some massive regularizations .", "title": "Naturalisation"}