{"summary": "There are some sciences that are used to study nature.", "full_text": "Natural science is a branch of science concerned with the description, prediction, and understanding of natural phenomena, based on observational and empirical evidence. Validity, accuracy, and social mechanisms ensuring quality control, such as peer review and repeatability of findings, are amongst the criteria and methods used for this purpose.\nNatural science can be broken into two main branches: life science  and physical science. Physical science is further broken down into branches, including physics, astronomy, chemistry, and Earth science. All of these branches of natural science are divided into many further specialized branches , and each of these is known as a \"natural science\".\nIn Western society's analytic tradition, the empirical and especially natural sciences use tools from formal sciences, such as mathematics and logic, converting information about nature into measurements which can be explained as clear statements about the \"laws of nature\". The social sciences also use such methods, but rely more on qualitative research, so that they are sometimes called \"soft science\", whereas natural sciences, insofar as emphasizing quantifiable data produced, tested, and confirmed through the scientific method are sometimes called \"hard science\".\nModern natural science succeeded more classical approaches to natural philosophy, usually traced to ancient Greece. Galileo, Descartes, Francis Bacon, and Newton debated the benefits of using approaches which were more mathematical and more experimental in a methodical way. Still, philosophical perspectives, conjectures, and presuppositions, often overlooked, remain requisite in natural science. Systematic data collection, including discovery science, succeed natural history, which emerged in the 16th century by describing and classifying plants, animals, minerals, and so on. Yet today, natural history suggests observational descriptions aimed at popular audiences.", "title": "Natural sciences"}