{"summary": "Nauru is a small island in the Pacific Ocean.", "full_text": "Nauru , officially the Republic of Nauru  and formerly known as Pleasant Island, is an island country in Micronesia in the Central Pacific. Its nearest neighbour is Banaba Island in Kiribati, 300 kilometres  to the east. With 9,488 residents in a 21-square-kilometre  area, Nauru is the smallest state in the South Pacific and third smallest state by area in the world, behind only Vatican City and Monaco.\nSettled by native peoples from Micronesia and Polynesia, Nauru was annexed and claimed as a colony by the German Empire in the late 19th century. After World War I, Nauru became a League of Nations mandate administered by Australia, New Zealand and the United Kingdom. During World War II, Nauru was occupied by Japanese troops, who were bypassed by the Allied advance across the Pacific. After the war ended, the country entered into UN trusteeship. Nauru gained its independence in 1968.\nNauru is a phosphate rock island with rich deposits near the surface, which allowed easy strip mining operations. It has some remaining phosphate resources which, as of 2011, are not economically viable for extraction. Nauru boasted the highest per-capita income enjoyed by any sovereign state in the world during the late 1960s and early 1970s. When the phosphate reserves were exhausted, and the island's environment had been seriously harmed by mining, the trust that had been established to manage the island's wealth diminished in value. To earn income, Nauru briefly became a tax haven and illegal money laundering centre. From 2001 to 2008, and again from 2012, it accepted aid from the Australian Government in exchange for hosting the Nauru detention centre.\nThe president of Nauru is Baron Waqa, who heads a 19-member unicameral parliament. The country is a member of the United Nations, the Commonwealth of Nations, the Asian Development Bank and the Pacific Islands Forum. Nauru also participates in the Commonwealth and Olympic Games. Recently Nauru became a member country of the International Renewable Energy Agency .\n\n", "title": "Nauru"}