{"summary": " is a Pakistani politician and business tycoon who served as 12th Prime Minister of Pakistan in two non-consecutive terms from November 1990-July 1993 and February 1997-October 1999. He leads the political party, Pakistan Muslim League .", "full_text": "Mian Muhammad Nawaz Sharif  is the 18th and current Prime Minister of Pakistan in office since June 2013. A veteran politician and industrialist, he previously served as Prime Minister from November 1990 to July 1993 and from February 1997 to October 1999. Sharif is the president of Pakistan Muslim League, which is currently Pakistan's largest political party, and has formed the government. As the owner of Ittefaq Group, a leading business conglomerate, he is also one of the country's wealthiest people. He is commonly known as the \"Lion of the Punjab\".\nNawaz Sharif entered politics in the 1980s when in the general elections of 1985, he won with an overwhelming majority, both in the National and Provincial Assemblies. On 9 April 1985, he was sworn-in as Chief Minister of Punjab. On 31 May 1988, he was appointed caretaker Chief Minister, after the dismissal of Assemblies by General Zia. Nawaz Sharif was again elected as Chief Minister after the 1988 general elections. After Zia's death and Benazir Bhutto's being elected Prime Minister in 1988, Sharif emerged as opposition leader from the conservative Pakistan Muslim League. When Bhutto was dismissed by President Ghulam Ishaq Khan in 1990 on corruption charges, Sharif was elected Prime Minister the same year. But relations between Sharif and Ghulam Ishaq too deteriorated, with Ghulam Ishaq attempting to dismiss Sharif on similar charges. Sharif successfully challenged the President's decision in the Supreme Court, but both men were ultimately persuaded to step down in 1993 by army chief Abdul Waheed Kakar.\nServing as the Leader of the Opposition during Bhutto's second tenure, Sharif was re-elected Prime Minister with a historic two-thirds majority in parliament, after Benazir was again dismissed for corruption by new President Farooq Leghari. Sharif replaced Leghari with Rafiq Tarar as president after Leghari 's voluntary resignation. Presidency was already stripped off of its powers by parliament's passing of the Thirteenth Amendment. He also notably ordered Pakistan's first nuclear tests in response to neighbouring India's second nuclear tests as part of the tit-for-tat policy. When Western countries suspended foreign aid, Sharif froze the country's foreign currency reserves to prevent further capital flight, but this only worsened economic conditions.\nWith rising unemployment and record foreign debt, Sharif's second term also saw tussles with the judiciary and the military. Sharif was summoned for contempt by the Supreme Court in 1997 after making a speech in parliament criticising recent decisions by Chief Justice Sajjad Ali Shah. Sharif also forcefully relieved Chairman joint chiefs General Jehangir Karamat from the command of the military over a policy issue and replaced him with Pervez Musharraf in 1998, but after Pakistan's haphazard performance in the Kargil War, relations between the two also deteriorated. When he attempted to relieve Musharraf from his command on 12 October 1999, the military instead ousted Sharif's government, exiling him to Saudi Arabia.\nSharif returned in 2008, and his party contested elections in 2008, forming the provincial government in Punjab under Sharif's brother Shehbaz until 2013. He successfully called for Musharraf's impeachment and the reinstatement of Chief Justice Iftikhar Chaudhry. Between 2008 and 2013, Sharif was in opposition. In the general elections in 2013, his party achieved the largest number of votes and he formed a government to become the 18th Prime Minister of Pakistan, returning to the position after fourteen years, for an unprecedented third time.\nSharif's third term in office started on 5 June 2013, since then his government has launched macro economic stability with the help of substantial loans from international financial institutions, while has signed multi-billion investment deals to construct the CPEC and to chronic power shortages. His government has also launched military offensive to remove extremist groups in northwestern Pakistan and removed the moratorium on the death penalty, while on foreign policy front his government has so far seen improved ties with United States as a result of the operation and with Russia, China among others while relationship with India has deteriorated. On the domestic front, Sharif struggled to revive economic growth as electricity shortages remained an endemic problem.", "title": "Nawaz Sharif"}