{"summary": "Nelson Aldrich Rockefeller  was a liberal Republican American politician and businessman.", "full_text": "Nelson Aldrich Rockefeller  was an American businessman, philanthropist, public servant, and politician. He served as the 41st Vice President of the United States  under President Gerald Ford, and as the 49th Governor of New York . He also served in the administrations of Presidents Franklin Roosevelt regarding Latin America and Dwight Eisenhower regarding welfare programs. A member of the wealthy Rockefeller family, he was also a noted art collector, as well as administrator of Rockefeller Center.\nRockefeller, a Republican, was politically liberal, progressive, or moderate. In his time, liberals in the Republican Party were called \"Rockefeller Republicans\". As Governor of New York from 1959 to 1973 his achievements included the expansion of the State University of New York, efforts to protect the environment, the building of the Governor Nelson A. Rockefeller Empire State Plaza in Albany, increased facilities and personnel for medical care, and creation of the New York State Council on the Arts.\nAfter unsuccessfully seeking the Republican presidential nomination in 1960, 1964, and 1968, he served as Vice President from 1974 to 1977 under President Gerald R. Ford. Ford ascended to the presidency following the August 1974 resignation of Richard Nixon over the Watergate Scandal, and Ford selected Rockefeller as his replacement, only the second vice president to be appointed under the provisions of the 25th Amendment, Ford having been the first. However Rockefeller did not join the 1976 Republican national ticket with President Ford, marking his retirement from politics.\nAs a businessman he was President and later Chairman of Rockefeller Center, Inc., and he formed the International Basic Economy Corporation in 1947. Rockefeller assembled a significant art collection and promoted public access to the arts. He served as trustee, treasurer, and president, of the Museum of Modern Art, and founded the Museum of Primitive Art in 1954. In the area of philanthropy, he established the American International Association for Economic and Social Development in 1946, and with his four brothers he founded the Rockefeller Brothers Fund in 1940 and helped guide it.", "title": "Nelson Rockefeller"}