{"summary": "Arthur Neville Chamberlain,  was a politician, Lord Mayor of Birmingham, Chancellor of the Exchequer and British Prime Minister from 1937 to 1940.", "full_text": "Arthur Neville Chamberlain FRS  was a British Conservative politician who served as Prime Minister of the United Kingdom from May 1937 to May 1940. Chamberlain is best known for his appeasement foreign policy, and in particular for his signing of the Munich Agreement in 1938, conceding the German-speaking Sudetenland region of Czechoslovakia to Germany. However, when Adolf Hitler later invaded Poland, the UK declared war on Germany on 3 September 1939, and Chamberlain led Britain through the first eight months of World War II.\nAfter working in business and local government and after a short spell as Director of National Service in 1916 and 1917, Chamberlain followed his father, Joseph Chamberlain, and older half-brother, Austen Chamberlain, in becoming a member of parliament in the 1918 general election at age 49. He declined a junior ministerial position, remaining a backbencher until 1922. He was rapidly promoted in 1923 to Minister of Health and then Chancellor of the Exchequer. After a short Labour-led government, he returned as Minister of Health, introducing a range of reform measures from 1924 to 1929. He was appointed Chancellor of the Exchequer in the National Government in 1931.\nWhen Stanley Baldwin retired in May 1937, Chamberlain took his place as Prime Minister. His premiership was dominated by the question of policy toward the increasingly aggressive Germany, and his actions at Munich were widely popular among Britons at the time. When Hitler continued his aggression, Chamberlain pledged Britain to defend Poland's independence if the latter were attacked, an alliance that brought Britain into war when Germany attacked Poland in 1939. Chamberlain resigned the premiership on 10 May 1940 after the Allies were forced to retreat from Norway, as he believed a government supported by all parties was essential, and the Labour and Liberal parties would not join a government headed by him. He was succeeded by Winston Churchill but remained very well regarded in Parliament, especially among Conservatives. Before ill health forced him to resign he was an important member of Churchill's War Cabinet, heading it in the new premier's absence. Chamberlain died of cancer six months after leaving the premiership.\nChamberlain's reputation remains controversial among historians, with the initial high regard for him being entirely eroded by books such as Guilty Men, published in July 1940, which blamed Chamberlain and his associates for the Munich accord and for allegedly failing to prepare the country for war. Most historians in the generation following Chamberlain's death held similar views, led by Churchill in The Gathering Storm. Some recent historians have taken a more favourable perspective of Chamberlain and his policies, citing government papers released under the Thirty Year Rule. Nevertheless, Chamberlain is still unfavourably ranked amongst British Prime Ministers.", "title": "Neville Chamberlain"}