{"summary": "1966  was a common year starting on Saturday of the Gregorian calendar.", "full_text": "The New Vaudeville Band was a group created by songwriter Geoff Stephens  in 1966 to record his novelty composition \"Winchester Cathedral\", a song inspired by the dance bands of the 1920s and a Rudy Vallee megaphone style vocal. To his surprise, the song became a transatlantic hit that autumn, reaching the Top 10 in the UK and rising to #1 in the US. The record sold over three million copies worldwide, earning the RIAA certification of gold disc status. The track also won a Grammy Award for Best Contemporary Song in 1967. The lead vocal was sung by John Carter, formerly of The Ivy League, who had sung on the demo of the record, which Stephens decided to keep for the commercial release. An initial long-playing album was also issued in late 1966 by Fontana Records, also titled Winchester Cathedral.\nWhen Stephens received several requests for The New Vaudeville Band to tour, he had to put together a group, as the song was recorded by session musicians hired only for the recording session. He contacted a real group, the Bonzo Dog Doo-Dah Band, which played similar music at the time. Only Bob Kerr from that group was interested, so he left The Bonzos to help Stephens form a touring version of The New Vaudeville Band, which included original session drummer Henri Harrison. The lead singer of the touring version of the group was Alan Klein, who was billed as 'Tristram - Seventh Earl of Cricklewood'.\nIn 1967, The New Vaudeville Band released the On Tour album, with the single \"Peek-A-Boo,\" which made the Billboard chart that February and reached #7 in the UK Singles Chart. Further UK hits followed with \"Finchley Central\"  and \"Green Street Green\" , both based on locations in London.\nThe New Vaudeville Band was managed by Peter Grant. Kerr left the group following disputes with Grant. He then formed his own group, Bob Kerr's Whoopee Band, which continues to perform with Henri Harrison.\nA further privately released album  did not bear a date but was apparently released in 1979, and stated in the sleeve notes that the band \"have firmly re-established themselves in the higher echelons of the British club scene\" since returning four years previously from \"their successful three years in the USA and Canada\".", "title": "New Vaudeville Band"}