{"summary": "New England is a part in the north of the United States.", "full_text": "New England is a region which comprises six states of the Northeastern United States: Connecticut, Maine, Massachusetts, New Hampshire, Rhode Island, and Vermont. It is bordered by New York to the west, Long Island Sound to the south, the Atlantic Ocean and the Canadian province of New Brunswick to the east, and the Canadian province of Quebec to the north.\nIn one of the earliest English settlements in North America, Pilgrims from England first settled in New England in 1620, to form Plymouth Colony. Ten years later, the Puritans settled north of Plymouth Colony in Boston, thus forming Massachusetts Bay Colony. Over the next 126 years, New England fought in four French and Indian Wars, until the British and their Iroquois Confederacy allies defeated the French and their Algonquin allies in North America.\nIn the late 18th century, the New England Colonies initiated the resistance to the British Parliament's efforts to impose new taxes without the consent of the colonists. The Boston Tea Party was a protest to which Great Britain responded with a series of punitive laws stripping Massachusetts of self-government, which were termed the \"Intolerable Acts\" by the colonists. The confrontation led to open warfare in 1775, the expulsion of the British authorities from New England in spring 1776, and the Declaration of Independence in July 1776.\nSome of the first movements of American literature, philosophy, and education originated in New England. The region played a prominent role in the movement to abolish slavery, and was the first region of the United States transformed by the Industrial Revolution. Today, New England is a major world center of education, high technology, insurance, and medicine. Boston is its cultural, financial, educational, medical, and transportation center.\nEach state is principally subdivided into small incorporated municipalities known as towns, which are often governed by town meetings. The only unincorporated area in New England exists in the sparse, northern regions of Vermont, New Hampshire, and Maine. Since 1970, voters have more often supported liberal candidates at the state and federal level than those of any other region in the United States.\nNew England is one of the United States Census Bureau's nine regional divisions and the only multi-state region with clear, consistent boundaries. It maintains a strong sense of cultural identity, although the terms of this identity are often contested, combining Puritanism with liberalism, agrarian life with industry, and isolation with immigration.", "title": "New England"}