{"summary": "New Hampshire is a state in the New England region of the United States.", "full_text": "New Hampshire  is a state in the New England region of the northeastern United States. It is bordered by Massachusetts to the south, Vermont to the west, Maine and the Atlantic Ocean to the east, and the Canadian province of Quebec to the north. New Hampshire is the 5th smallest by land area, and the 9th least populous of the 50 United States.\nIn January 1776 it became the first of the British North American colonies to establish a government independent of Great Britain's authority and it was the first to establish its own state constitution. Six months later, it became one of the original 13 states that founded the United States of America, and in June 1788 it was the ninth state to ratify the United States Constitution, bringing that document into effect.\nConcord is the state capital, while Manchester is the largest city in the state. It has no general sales tax, nor is personal income  taxed at either the state or local level. It is known for the New Hampshire primary, the first primary in the U.S. presidential election cycle. Its license plates carry the state motto: \"Live Free or Die\". The state's nickname, \"The Granite State\", refers to its extensive granite formations and quarries.\nAmong prominent individuals from New Hampshire are founding father Nicholas Gilman, Senator Daniel Webster, Revolutionary War hero John Stark, editor Horace Greeley, founder of the Christian Science religion Mary Baker Eddy, poet Robert Frost, astronaut Alan Shepard, rock musician Ronnie James Dio, author Dan Brown, actor Adam Sandler, inventor Dean Kamen, and President of the United States Franklin Pierce.\nWith some of the largest ski mountains on the East Coast, New Hampshire's major recreational attractions include skiing, snowmobiling, and other winter sports, hiking and mountaineering, observing the fall foliage, summer cottages along many lakes and the seacoast, motor sports at the New Hampshire Motor Speedway, and Motorcycle Week, a popular motorcycle rally held in Weirs Beach near Laconia in June. The White Mountain National Forest links the Vermont and Maine portions of the Appalachian Trail, and boasts the Mount Washington Auto Road, where visitors may drive to the top of 6,288-foot  Mount Washington.", "title": "New Hampshire"}