{"summary": "The New Age , also called the New Age movement is a kind of spiritual belief and way of life held by some westerners.", "full_text": "The New Age is a term applied to a range of spiritual or religious beliefs and practices that developed in Western nations during the 1970s. Precise scholarly definitions of the movement differ in their emphasis, largely as a result of its highly eclectic structure. Although analytically often considered to be religious, those involved in it typically prefer the designation of \"spiritual\" and rarely use the term \"New Age\" themselves. Many scholars of the subject refer to it as the New Age movement, although others contest this term, believing that it gives a false sense of homogeneity to the phenomenon.\nAs a form of Western esotericism, the New Age movement drew heavily upon a number of older esoteric traditions, in particular those that emerged from the occultist current that developed in the eighteenth century. Such prominent occult influences include the work of Emanuel Swedenborg and Franz Mesmer, as well as the ideas of Spiritualism, New Thought, and the Theosophical Society. A number of mid-twentieth century influences, such as the UFO cults of the 1950s, the Counterculture of the 1960s, and the Human Potential Movement, also exerted a strong influence on the early development of the New Age movement. Although the exact origins of the movement remain contested, it is agreed that it developed in the 1970s, at which time it was centred largely in the United Kingdom. It expanded and grew largely in the 1980s and 1990s, in particular within the United States.\nDespite its highly eclectic nature, a number of beliefs commonly found within the New Age movement have been identified. Theologically, the movement typically adopts a belief in a holistic form of divinity which imbues all of the universe, including human beings themselves. There is thus a strong emphasis on the spiritual authority of the self. This is accompanied by a common belief in a wide variety of semi-divine non-human entities, such as angels and masters, with whom humans can communicate, particularly through the form of channeling. Typically viewing human history as being divided into a series of distinct ages, a common New Age belief is that whereas once humanity lived in an age of great technological advancement and spiritual wisdom, it has entered a period of spiritual degeneracy, which will be remedied through the establishment of a coming Age of Aquarius, from which the movement gets its name. There is also a strong focus on healing, particularly using forms of alternative medicine, and an emphasis on a \"New Age science\" which seeks to unite science and spirituality.\nThose involved in the New Age movement have been primarily from middle and upper-middle-class backgrounds. The degree to which New Agers are involved in the movement varied considerably, from those who adopted a number of New Age ideas and practices to those who fully embraced and dedicated their lives to it. The movement has generated criticism from established Christian organisations as well as contemporary Pagan and indigenous communities. From the 1990s onward, the movement became the subject of research by academic scholars of religious studies.", "title": "New Age"}