{"summary": "Star Trek: The Next Generation was the second television series of the science fiction franchise Star Trek.", "full_text": "NeXT, Inc.  was an American computer company headquartered in Redwood City, California, that developed and manufactured a series of computer workstations intended for the higher education and business markets. NeXT was founded in 1985 by Apple Computer cofounder Steve Jobs, after he was forced out of Apple, along with a few of his coworkers. NeXT introduced the first NeXT Computer in 1988, and the smaller NeXTstation in 1990. The NeXT computers experienced relatively limited sales, with estimates of about 50,000 units shipped in total. Nevertheless, their innovative object-oriented NeXTSTEP operating system and development environment were highly influential.\nThe NeXT Computer and this object-oriented NeXTSTEP operating system was the platform used for creating the World Wide Web as well as creating the first App Store which was originally demonstrated to Steve Jobs in 1993.\nNeXT later released much of the NeXTSTEP system as a programming environment standard called OpenStep. NeXT withdrew from the hardware business in 1993 to concentrate on marketing OPENSTEP for Mach, its own OpenStep implementation, for several OEMs. NeXT also developed WebObjects, one of the first enterprise web application frameworks. WebObjects never became very popular because of its initial high price of $50,000, but it remains a prominent early example of a web server based on dynamic page generation rather than on static content.\nApple purchased NeXT in 1997 for $429 million and 1.5 million shares of Apple stock. As part of the agreement, Steve Jobs, Chairman and CEO of NeXT Software, returned to Apple, the company he had cofounded in 1976. The merger promised to marry software from NeXT with Apple's hardware platforms, eventually resulting in OS X. Parts of these operating systems incorporated the OPENSTEP foundation.\n^ \"NeXT Inc. to Drop Hardware 300 losing jobs in strategy shift\". San Francisco Chronicle. February 9, 1993. \n^ \"Apple Computer, Inc. Agrees to Acquire NeXT Software Inc.\" . Apple Computer. 1996-12-20. Archived from the original on 2002-02-08. Retrieved 2008-06-13. \n^ \"Apple Computer, Inc. Finalizes Acquisition of NeXT Software Inc.\" . Apple Computer. 1997-02-07. Archived from the original on 1999-01-17. Retrieved 2008-06-13.", "title": "Next"}