{"summary": "Nicholas II redirects here, for other people named Nicholas II, see Nicholas.", "full_text": "Nicholas II   was the last Emperor of Russia, Grand Duke of Finland, and titular King of Poland. His official short title was Tsar Nicholas II, Emperor and Autocrat of All the Russias. Like other Russian Emperors he is commonly known by the monarchical title Tsar . He is known as Saint Nicholas the Passion-Bearer by the Russian Orthodox Church and has been referred to as Saint Nicholas the Martyr.\nNicholas II ruled from 1 November 1894 until his forced abdication on 15 March 1917. His reign saw Imperial Russia go from being one of the foremost great powers of the world to economic and military collapse. Political enemies nicknamed him Nicholas the Bloody because of the Khodynka Tragedy, anti-Semitic pogroms, Bloody Sunday, his violent suppression of the 1905 Revolution, his execution of political opponents and his perceived responsibility for the Russo-Japanese War.\nUnder his rule, Russia was decisively defeated in the Russo-Japanese War, which saw the annihilation of the Russian Baltic Fleet at the Battle of Tsushima. The Anglo-Russian Entente, designed to counter German attempts to gain influence in the Middle East, ended the Great Game between Russia and the United Kingdom. As head of state, Nicholas approved the Russian mobilisation of August 1914, which marked the beginning of Russia's involvement in the First World War, a war in which 3.3 million Russians were killed. The Imperial Army's severe losses and the High Command's incompetent handling of the war, along with other policies directed by Nicholas during his reign, are often cited as the leading causes of the fall of the Romanov dynasty.\nNicholas II abdicated following the February Revolution of 1917 during which he and his family were imprisoned first in the Alexander Palace at Tsarskoye Selo, then later in the Governor's Mansion in Tobolsk, and finally at the Ipatiev House in Yekaterinburg. In the spring of 1918, Nicholas was handed over to the local Ural soviet by commissar Vasili Yakovlev who was given a written receipt. Nicholas II, his wife, Alexandra Feodorovna, his son, Alexei Nikolaevich, his four daughters, Olga Nikolaevna, Tatiana Nikolaevna, Maria Nikolaevna and Anastasia Nikolaevna, the family's medical doctor, Evgeny Botkin, the Emperor's footman, Alexei Trupp, the Empress' maidservant, Anna Demidova, and the family's cook, Ivan Kharitonov, were executed in the same room by the Bolsheviks on the night of 16/17 July 1918.\nThis led to the canonisation of Nicholas II, his wife the Empress Alexandra and their children as passion bearers, a title commemorating believers who face death in a Christ-like manner, on 15 August 2000 by the Russian Orthodox Church within Russia and, in 1981, as martyrs by the Russian Orthodox Church Outside Russia, located in New York City.", "title": "Nicholas II"}