{"summary": "Nickelback is a Canadian rock band founded in 1995. They are signed to EMI in Canada and Roadrunner Records in the rest of the world.", "full_text": "Nickelback is a Canadian rock band formed in 1995 in Hanna, Alberta. The band is composed of guitarist and lead vocalist Chad Kroeger, guitarist, keyboardist and backing vocalist Ryan Peake, bassist Mike Kroeger, and drummer Daniel Adair. The band went through a few drummer changes between 1995 and 2005, achieving its current form when Adair replaced drummer Ryan Vikedal.\nNickelback is one of the most commercially successful Canadian groups, having sold more than 50 million albums worldwide and ranking as the eleventh best-selling music act, and the second best-selling foreign act in the U.S. of the 2000s, behind The Beatles. Billboard ranks them the most successful rock group of the decade; their song \"How You Remind Me\" was listed as the best-selling rock song of the decade and the fourth best-selling of the decade. They were listed number seven on the Billboard top artist of the decade, with four albums listed on the Billboard top albums of the decade.\nThe band signed with Roadrunner Records in 1999 and re-released their once-independent album The State. The band achieved commercial success with the release of their 2000 album The State and then they achieved mainstream success with the release of their 2001 album Silver Side Up. Following the release of Silver Side Up the band released their biggest and most known hit today, \"How You Remind Me\" which peaked number 1 on the American and Canadian charts at the same time. Then, the band's fourth album The Long Road  spawned 5 singles and continued the band's mainstream success with their hit single \"Someday\" which peaked at number 7 on the Billboard Hot 100 and number 1 at the Canadian Singles Chart. Afterwards, the band put out their biggest album to date, All The Right Reasons  which produced 3 top 10 singles and 5 top 20 singles, on the Billboard Hot 100 example of songs like \"Photograph\", \"Far Away\", and \"Rockstar\". The band's album Dark Horse  was a success which produced eight singles, one of which peaked on the top 10 on the Billboard Hot 100 and two of which peaked on the top 20 on the Billboard Hot 100. In 2011, the band released their seventh album Here and Now which again topped the charts. Their eighth studio album No Fixed Address was released on 17 November 2014.\nThe band is based in Vancouver, Canada. The band's original domestic signing was with EMI Canada. They subsequently obtained an American deal with global distribution via Roadrunner Records. For the release of their seventh album, the band parted from EMI Canada and signed a new Canadian domestic distribution deal with Universal Music Canada.", "title": "Nickelback"}