{"summary": "Nicolaas Bloembergen  is a Dutch-American physicist.", "full_text": "Nicolaas Bloembergen  is a Dutch-American physicist and Nobel laureate.\nHe received his Ph.D. degree from University of Leiden under Cor Gorter in 1948; while pursuing his PhD at Harvard, Bloembergen also worked part-time as a graduate research assistant for Edward Mills Purcell at the MIT Radiation Laboratory . He became a professor at Harvard University in Applied Physics. He was brought up in the Protestant household.\nBloembergen enrolled in 1938 at the University of Utrecht to study physics. Bloembergen left the war ravaged Netherlands in 1945 to pursue graduate studies at Harvard University. Six weeks before his arrival, Harvard Professor Edward M. Purcell  discovered nuclear magnetic resonance. Bloembergen was hired to develop a first NMR machine. While at Harvard he enjoyed classes from J. Schwinger, J. H. van Vleck, and E. C. Kemble. His thesis Nuclear Magnetic Relaxation was submitted in Leiden, where he passed qualifying criteria. After a brief postdoctoral appointment with C. J. Gorter in the Netherlands, he joined Harvard where he was named a junior fellow of Society of Fellows in 1949 and associate professor in 1951.\nIn 1958, he became a naturalized citizen of the United States.\nHe was awarded the Lorentz Medal in 1978. Bloembergen shared the 1981 Nobel Prize in Physics with Arthur Schawlow and Kai Siegbahn for their work in laser spectroscopy. Bloembergen and Schawlow investigated properties of matter undetectable without lasers. He had earlier modified the maser of Charles Townes. Bloembergen serves on the University of Arizona faculty.\nBloembergen belongs to prolific J. J. Thomson academic lineage tree, following in footsteps of other Nobel Laureates beginning with Lord Rayleigh  and J. J. Thomson , and continued with Ernest Rutherford , Owen Richardson  and finally Bloembergen's advisor, Edward Purcell . Prof. Bloembergen is a member of the Board of Sponsors of The Bulletin of the Atomic Scientists and Honorary Editor of the Journal of Nonlinear Optical Physics & Materials. His other influences included John Van Vleck  and Percy Bridgman .\n^ \"Nicolaas Bloembergen\". IEEE Global History Network. IEEE. Retrieved 18 July 2011. \n^ http://www.nobelprize.org/nobel_prizes/physics/laureates/1981/bloembergen.html\n^ World Scientific. Journal of Nonlinear Optical Physics & Materials. Journal Editorial Board.", "title": "Nicolaas Bloembergen"}