{"summary": "Niobium is a chemical element.", "full_text": "Niobium, formerly columbium, is a chemical element with symbol Nb  and atomic number 41. It is a soft, grey, ductile transition metal, which is often found in the pyrochlore mineral, the main commercial source for niobium, and columbite. The name comes from Greek mythology: Niobe, daughter of Tantalus since it is so similar to tantalum.\nNiobium has physical and chemical properties similar to those of the element tantalum, and the two are therefore difficult to distinguish. The English chemist Charles Hatchett reported a new element similar to tantalum in 1801 and named it columbium. In 1809, the English chemist William Hyde Wollaston wrongly concluded that tantalum and columbium were identical. The German chemist Heinrich Rose determined in 1846 that tantalum ores contain a second element, which he named niobium. In 1864 and 1865, a series of scientific findings clarified that niobium and columbium were the same element , and for a century both names were used interchangeably. Niobium was officially adopted as the name of the element in 1949, but the name columbium remains in current use in metallurgy in the United States.\nIt was not until the early 20th century that niobium was first used commercially. Brazil is the leading producer of niobium and ferroniobium, an alloy of niobium and iron. Niobium is used mostly in alloys, the largest part in special steel such as that used in gas pipelines. Although these alloys contain a maximum of 0.1%, the small percentage of niobium enhances the strength of the steel. The temperature stability of niobium-containing superalloys is important for its use in jet and rocket engines. Niobium is used in various superconducting materials. These superconducting alloys, also containing titanium and tin, are widely used in the superconducting magnets of MRI scanners. Other applications of niobium include its use in welding, nuclear industries, electronics, optics, numismatics, and jewelry. In the last two applications, niobium's low toxicity and ability to be colored by anodization are particular advantages.\n^ Standard Atomic Weights 2013. Commission on Isotopic Abundances and Atomic Weights\n^ Knapp, Brian. Francium to Polonium. Atlantic Europe Publishing Company, 2002, p. 40.", "title": "Niobium"}