{"summary": "Nitrogen is a nonmetal chemical element.", "full_text": "Nitrogen is a chemical element with symbol N and atomic number 7. It is the lightest pnictogen and at room temperature, it is a transparent, odorless diatomic gas. Nitrogen is a common element in the universe, estimated at about seventh in total abundance in the Milky Way and the Solar System. On Earth, the element forms about 78% of Earth's atmosphere and as such is the most abundant uncombined element. The element nitrogen was discovered as a separable component of air, by Scottish physician Daniel Rutherford, in 1772.\nMany industrially important compounds, such as ammonia, nitric acid, organic nitrates , and cyanides, contain nitrogen. The extremely strong triple bond in elemental nitrogen  dominates nitrogen chemistry, causing difficulty for both organisms and industry in converting the N2 into useful compounds, but at the same time causing release of large amounts of often useful energy when the compounds burn, explode, or decay back into nitrogen gas. Synthetically-produced ammonia and nitrates are key industrial fertilizers and fertilizer nitrates are key pollutants in causing the eutrophication of water systems.\nOutside the major uses of nitrogen compounds as fertilizers and energy-stores, nitrogen is a constituent of organic compounds as diverse as Kevlar fabric and cyanoacrylate \"super\" glue. Nitrogen is a constituent of molecules in every major pharmacological drug class, including antibiotics. Many drugs are mimics or prodrugs of natural nitrogen-containing signal molecules: for example, the organic nitrates nitroglycerin and nitroprusside control blood pressure by being metabolized to nitric oxide. Plant alkaloids  contain nitrogen by definition, and thus many notable nitrogen-containing drugs, such as caffeine and morphine are either alkaloids or synthetic mimics that act  on receptors of animal neurotransmitters .\nNitrogen occurs in all organisms, primarily in amino acids , in the nucleic acids  and in the energy transfer molecule adenosine triphosphate. The human body contains about 3% by mass of nitrogen, the fourth most abundant element in the body after oxygen, carbon, and hydrogen. The nitrogen cycle describes movement of the element from the air, into the biosphere and organic compounds, then back into the atmosphere.", "title": "Nitrogen"}