{"summary": "No Doubt is a third wave ska and alternative rock band from Anaheim, California, United States.", "full_text": "No Doubt is an American rock band from Anaheim, California, that formed in 1986. Since 1994, the group has consisted of vocalist Gwen Stefani, bassist and keyboardist Tony Kanal, guitarist and keyboardist Tom Dumont, and drummer Adrian Young. Since the mid-1990s in live performances and the studio, they have been supported by keyboardist and trombonist Gabrial McNair and keyboardist and trumpeter Stephen Bradley.\nThe ska sound of their first album No Doubt  failed to make an impact. The Beacon Street Collection  is a raw expression of their sound, inspired by ska punk and released independently by the band under their own record label. The album sold over 100,000 copies in 1995, over three times as many as their first album sold. The band's diamond-certified album Tragic Kingdom  helped launch the third-wave ska revival of the 1990s, and \"Don't Speak\", the third single from the album, set a record when it spent 16 weeks at the number one spot on the Billboard Hot 100 Airplay chart.\nThe group's next album, Return of Saturn , despite the Top 40 hit single \"Simple Kind of Life\", did not match the success of their previous but received critical praise and was nominated for Best Rock Album at the 43rd Grammy Awards. Fifteen months later, the band reappeared with Rock Steady , which incorporated reggae and dancehall music into their work. The album was primarily recorded in Jamaica and featured collaborations with Jamaican artists Bounty Killer, Sly and Robbie, and Lady Saw. The album produced two Grammy-winning singles, \"Hey Baby\" and \"Underneath It All\", as well as \"Hella Good.\" On 22 November 2002, No Doubt received the Key to the City of Anaheim, given by the Mayor of Anaheim, Tom Daly in Disneyland during the band's appearance on 'Breakfast with Kevin and Bean'  where they performed five songs. After a 2004 tour the band embarked on solo projects, with Stefani releasing two successful solo albums Love. Angel. Music. Baby.  and The Sweet Escape  while Tom Dumont released his own solo music project, Invincible Overlord. In 2008, the band resumed working slowly on their sixth effort, titled Push and Shove , and released their single \"Settle Down\". They have sold over 33 million albums worldwide.", "title": "No Doubt"}