{"summary": "The Nobel Prize in Literature is one of many Nobel Prizes given in honor of Alfred Nobel.", "full_text": "Since 1901, the Nobel Prize in Literature  has been awarded annually to an author from any country who has, in the words of the will of Alfred Nobel, produced \"in the field of literature the most outstanding work in an ideal direction\" . Though individual works are sometimes cited as being particularly noteworthy, here \"work\" refers to an author's work as a whole. The Swedish Academy decides who, if anyone, will receive the prize in any given year. The academy announces the name of the chosen laureate in early October. It is one of the five Nobel Prizes established by the will of Alfred Nobel in 1895; the others are the Nobel Prize in Chemistry, Nobel Prize in Physics, Nobel Peace Prize, and Nobel Prize in Physiology or Medicine.\nNobel's choice of emphasis on idealism in his criteria for the Nobel Prize in Literature has led to recurrent controversy. In the original Swedish, the word idealisk translates as either \"idealistic\" or \"ideal\". In the early twentieth century, the Nobel Committee interpreted the intent of the will strictly. For this reason, they did not award certain world-renowned authors of the time such as James Joyce, Leo Tolstoy, Anton Chekhov, Marcel Proust, Henrik Ibsen, and Henry James. More recently, the wording has been more liberally interpreted. Thus, the prize is now awarded both for lasting literary merit and for evidence of consistent idealism on some significant level. In recent years, this means a kind of idealism championing human rights on a broad scale. Hence the award is now arguably more political.\nThe Swedish Academy has attracted significant criticism in recent years for its handling of the award. Some critics contend that many well-known writers have not been awarded the prize or even been nominated, but others contend that some well-known recipients do not deserve it. There have also been controversies involving alleged political interests relating to the nomination process and ultimate selection of some of the recent literary laureates. Some, such as Indian academic Sabaree Mitra, have noted that, though the Nobel Prize in Literature is significant and tends to overshadow other awards, it is \"not the only benchmark of literary excellence\".", "title": "Nobel Prize in Literature"}