{"summary": "Noise is another word for sound.", "full_text": "Noise is a variety of sound. It means any unwanted sound. Sounds, particularly loud ones, that disturb people or make it difficult to hear wanted sounds, are noise. For example, conversations of other people may be called noise by people not involved in any of them; any unwanted sound such as domesticated dogs barking, neighbours playing loud music, portable mechanical saws, road traffic sounds, or a distant aircraft in quiet countryside, is called noise.\nAcoustic noise can be anything from quiet but annoying to loud and harmful. At one extreme users of public transport sometimes complain about the faint and tinny sounds emanating from the headphones or earbuds of somebody listening to a portable audio player; at the other the sound of very loud music, a jet engine at close quarters, etc. can cause irreversible hearing damage. At intermediate levels there are a range of deleterious health effects from noise. This \"intolerable corruption of human space\" can be called noise pollution. A claim made by Luigi Russolo in his article, The Joys of Noise is that noise has become so prominent that pure sound no longer exists.\nRoland Barthes also observes that noise can be perceived either physiologically or psychologically. We perceive noise physiologically when we \"hear\" it. On the other hand, when we \"listen\" to a noise we are doing this psychologically. When we perceive a physiological noise we subconsciously feel the vibrations of the noise  waves with our particles in our physical body whereas psychological noise refers to noise that is perceived when our conscious awareness shifts its attention to that noise rather than letting it filter through our subconscious where it goes unnoticed.\nSound intensity follows an inverse square law with distance from the source; doubling the distance from a noise source reduces its intensity by a factor of four, or 6 dB.\n^ a b Listening Roland Barthes. The Responsibilities of Farms: Critical Essays on Music, Art and Representation. NY: Hill and Wang 1985.\n^ ", "title": "Noise"}