{"summary": "The Norman conquest of England was a military invasion of England by William the Conqueror in 1066.", "full_text": "The Norman conquest of England was the 11th century invasion and occupation of England by an army of Norman, Breton, and French soldiers led by Duke William II of Normandy, later styled as William the Conqueror.\nWilliam's claim to the English throne derived from his familial relationship with the childless Anglo-Saxon King Edward the Confessor, who may have encouraged William's hopes for the throne. Edward died in January 1066 and was succeeded by his brother-in-law Harold Godwinson. The Norwegian king Harald Hardrada invaded northern England in September 1066 and was victorious at the Battle of Fulford, but Harold defeated and killed him at the Battle of Stamford Bridge on 25 September 1066. Within days, William landed in southern England. Harold marched south to confront him, leaving a significant portion of his army in the north. Harold's army confronted William's invaders on 14 October at the Battle of Hastings; William's force defeated Harold, who was killed in the engagement.\nAlthough William's main rivals were gone, he still faced rebellions over the following years and was not secure on his throne until after 1072. The lands of the resisting English elite were confiscated; some of the elite fled into exile. To control his new kingdom, William gave lands to his followers and built castles commanding military strongpoints throughout the land. Other effects of the conquest included the court and government, the introduction of Norman French as the language of the elites, and changes in the composition of the upper classes, as William enfeoffed lands to be held directly from the king. More gradual changes affected the agricultural classes and village life: the main change appears to have been the formal elimination of slavery, which may or may not have been linked to the invasion. There was little alteration in the structure of government, as the new Norman administrators took over many of the forms of Anglo-Saxon government.", "title": "Norman conquest of England"}