{"summary": "In physics and chemistry, a nucleon refers to any subatomic particle found in the nucleus of an atom.", "full_text": "In chemistry and physics, a nucleon is one of the particles that makes up the atomic nucleus. Each atomic nucleus consists of one or more nucleons, and each atom in turn consists of a cluster of nucleons surrounded by one or more electrons. There are two known kinds of nucleon: the neutron and the proton. The mass number of a given atomic isotope is identical to its number of nucleons. Thus the term nucleon number may be used in place of the more common terms mass number or atomic mass number.\nUntil the 1960s, nucleons were thought to be elementary particles, each of which would not then have been made up of smaller parts. Now they are known to be composite particles, made of three quarks bound together by the so-called strong interaction. The interaction between two or more nucleons is called internucleon interactions or nuclear force, which is also ultimately caused by the strong interaction. \nNucleons sit at the boundary where particle physics and nuclear physics overlap. Particle physics, particularly quantum chromodynamics, provides the fundamental equations that explain the properties of quarks and of the strong interaction. These equations explain quantitatively how quarks can bind together into protons and neutrons . However, when multiple nucleons are assembled into an atomic nucleus , these fundamental equations become too difficult to solve directly . Instead, nuclides are studied within nuclear physics, which studies nucleons and their interactions by approximations and models, such as the nuclear shell model. These models can successfully explain nuclide properties, for example, whether or not a certain nuclide undergoes radioactive decay.\nThe proton and neutron are both baryons and both fermions. They are quite similar. One carries a non-zero net charge and the other carries a zero net charge; the proton's mass is only 0.1% less than the neutron's. Thus, they can be viewed as two states of the same nucleon. They together form the isospin doublet . In isospin space, neutrons can be rotationally transformed into protons, and vice versa. These nucleons are acted upon equally by the strong interaction. This implies that strong interaction is invariant when doing rotation transformation in isospin space. According to the Noether theorem, isospin is conserved with respect to the strong interaction.\n^ Griffiths, David J. , Introduction to Elementary Particles , WILEY-VCH, ISBN 978-3-527-40601-2", "title": "Nucleon"}