{"summary": "Nuclear espionage is sharing a country's secrets about nuclear weapons to other countries without permission.", "full_text": "Nuclear weapon designs are physical, chemical, and engineering arrangements that cause the physics package of a nuclear weapon to detonate. There are three existing basic design types. In most existing designs, the explosive energy of deployed devices is derived primarily from nuclear fission, not fusion.\nPure fission weapons were the first nuclear weapons built and have so far been the only type ever used in warfare. The active material is fissile uranium  or plutonium , explosively assembled into a chain-reacting critical mass by one of two methods:\nGun assembly: one piece of fissile uranium is fired at a fissile uranium target at the end of the weapon, similar to firing a bullet down a gun barrel, achieving critical mass when combined.\nImplosion: a fissile mass of either material  is surrounded by high explosives that compress the mass, resulting in criticality.\n\nThe implosion method can use either uranium or plutonium as fuel. The gun method only uses uranium. Plutonium is considered impractical for the gun method because of early triggering due to Pu-240 contamination and due to its time constant for prompt critical fission being much shorter than that of U-235.\nBoosted fission weapons improve on the implosion design. The high pressure and temperature environment at the center of an exploding fission weapon compresses and heats a mixture of tritium and deuterium gas . The hydrogen fuses to form helium and free neutrons. The energy release from this fusion reaction is relatively negligible, but each neutron starts a new fission chain reaction, speeding up the fission and greatly reducing the amount of fissile material that would otherwise be wasted when expansion of the fissile material stops the chain reaction. Boosting can more than double the weapon's fission energy release.\nStaged thermonuclear weapons are essentially a chain of fusion-boosted fission weapons, usually with only two stages in the chain. The secondary stage is imploded by x-ray energy from the first stage, called the \"primary.\" This radiation implosion is much more effective than the high-explosive implosion of the primary. Consequently, the secondary can be many times more powerful than the primary, without being bigger. The secondary can be designed to maximize fusion energy release, but in most designs fusion is employed only to drive or enhance fission, as it is in the primary. More stages could be added and conceptual designs incorporating up to seven have been produced, but the result would be a multi-megaton weapon too powerful to serve any plausible purpose. \nPure fusion weapons have not been invented. Such weapons, though, would produce far less radioactive fallout than current designs, although they would release huge amounts of neutrons.\nPure fission weapons historically have been the first type to be built by a nation state. Large industrial states with well-developed nuclear arsenals have two-stage thermonuclear weapons, which are the most compact, scalable, and cost effective option once the necessary industrial infrastructure is built.\nMost known innovations in nuclear weapon design originated in the United States, although some were later developed independently by other states; the following descriptions feature U.S. designs.\nIn early news accounts, pure fission weapons were called atomic bombs or A-bombs, a misnomer since the energy comes only from the nucleus of the atom. Weapons involving fusion were called hydrogen bombs or H-bombs, also a misnomer since their energy comes mostly from fission. Insiders favored the terms nuclear and thermonuclear, respectively.\nThe term thermonuclear refers to the high temperatures required to initiate fusion. It ignores the equally important factor of pressure, which was considered secret at the time the term became current. Many nuclear weapon terms are similarly inaccurate because of their origin in a classified environment.", "title": "Nuclear weapon design"}