{"summary": "Nuclear power is the controlled use of nuclear energy.", "full_text": "Nuclear power is the use of nuclear reactions that release nuclear energy to generate heat, which most frequently is then used in steam turbines to produce electricity in a nuclear power station. The term includes nuclear fission, nuclear decay and nuclear fusion. Presently, the nuclear fission of elements in the actinide series of the periodic table produce the vast majority of nuclear energy in the direct service of humankind, with nuclear decay processes, primarily in the form of geothermal energy, and radioisotope thermoelectric generators, in niche uses making up the rest.\nNuclear  power stations, excluding the contribution from naval nuclear fission reactors, provided 11% of the world's electricity in 2012, somewhat less than that generated by hydro-electric stations at 16%. Since electricity accounts for about 25% of humanity's energy usage with the majority of the rest coming from fossil fuel reliant sectors such as transport, manufacture and home heating, nuclear fission's contribution to the global final energy consumption is about 2.5%, a little more than the combined global electricity production from \"new renewables\"; wind, solar, biofuel and geothermal power, which together provided 2% of global final energy consumption in 2014.\nRegional differences in the use of fission energy are large. Fission energy generation, with a 20% share of the U.S. electricity production, is the single largest deployed technology among current low-carbon power sources in the country. In addition, two-thirds of the European Union's twenty-seven nations's low-carbon energy is produced by fission. Some of these nations have banned its generation, such as Italy, which ended the use of fission-electric generation, which started in 1963, in 1990. France is the largest user of nuclear energy, deriving 75% of its electricity from fission.\nAlong with other sustainable energy sources, nuclear fission power is a low carbon power generation method of producing electricity, meaning that it is in the renewable energy family of low associated greenhouse gas emissions per unit of energy generated. As all electricity supplying technologies use cement etc., during construction, emissions are yet to be brought to zero. A 2014 analysis of the carbon footprint literature by the Intergovernmental Panel on Climate Change  reported that fission electricities embodied total life-cycle emission intensity value of 12 g CO2 eq/kWh is the lowest out of all commercial Baseload energy sources, and second lowest out of all commercial electricity technologies known, after wind power which is an Intermittent energy source with embodied greenhouse gas emissions, per unit of energy generated of 11 g CO2eq/kWh. Each result is contrasted with coal & fossil gas at 820 and 490 g CO2 eq/kWh. With this translating into, from the beginning of Fission-electric power station commercialization in the 1970s, having prevented the emission of about 64 billion tonnes of carbon dioxide equivalent, greenhouse gases that would have otherwise resulted from the burning of fossil fuels in thermal power stations.\nIn 2013, the IAEA reported that there are 437 operational civil fission-electric reactors in 31 countries, although not every reactor is producing electricity. In addition, there are approximately 140 naval vessels using nuclear propulsion in operation, powered by some 180 reactors. As of 2013, attaining a net energy gain from sustained nuclear fusion reactions, excluding natural fusion power sources such as the Sun, remains an ongoing area of international physics and engineering research. With commercial fusion power production remaining unlikely before 2050.\nIn 2015, the IAEA report that worldwide there were 67 civil fission-electric power reactors under construction in 15 countries including Gulf states such as the United Arab Emirates . Over half of the 67 total being built are in Asia, with 28 in the Peoples Republic of China , with the most recently completed fission-electric reactor to be connected to the electrical grid, as of August 2015, occurring in Wolseong Nuclear Power Plant in the Republic of Korea. Five other new grid connections were completed by the PRC so far this year. In the US, four new Generation III reactors are under construction at Vogtle and Summer station, while a fifth is nearing completion at Watts Bar station, all five are expected to enter service before 2020. In 2013, four aging uncompetitive U.S reactors were closed.\nThere is a social debate about nuclear power. Proponents, such as the World Nuclear Association and Environmentalists for Nuclear Energy, contend that nuclear power is a safe, sustainable energy source that reduces carbon emissions. Opponents, such as Greenpeace International and NIRS, contend that nuclear power poses many threats to people and the environment.\nFar reaching fission power reactor accidents, or accidents that resulted in medium to long-lived fission product contamination of inhabited areas, have occurred in Generation I & II reactor designs, blueprinted between 1950 and 1980. These include the Chernobyl disaster which occurred in 1986, the Fukushima Daiichi nuclear disaster , and the more contained Three Mile Island accident . There have also been some nuclear submarine accidents. In terms of lives lost per unit of energy generated, analysis has determined that fission-electric reactors have caused less fatalities per unit of energy generated than the other major sources of energy generation. Energy production from coal, petroleum, natural gas and hydroelectricity has caused a greater number of fatalities per unit of energy generated due to air pollution and energy accident effects. However, the economic costs of nuclear power accidents is high, and meltdowns can render areas uninhabitable for very long periods. The human costs of evacuations of affected populations and lost livelihoods is also significant.\nJapan's 2011 Fukushima Daiichi nuclear disaster, which occurred in a reactor design from the 1960s, prompted a re-examination of nuclear safety and nuclear energy policy in many countries. Germany plans to close all its reactors by 2022, and Italy has re-affirmed its ban on electric utilities generating, but not importing, fission derived electricity. In 2011 the International Energy Agency halved its prior estimate of new generating capacity to be built by 2035. In 2013 Japan signed a deal worth $22 billion, in which Mitsubishi Heavy Industries would build four modern Atmea reactors for Turkey. In August 2015, following 4 years of near zero fission-electricity generation, Japan began restarting its fission fleet, after safety upgrades were completed, beginning with Sendai fission-electric station.", "title": "Nuclear power"}