{"summary": "A nuclear meltdown describes a malfunction of a nuclear reactor.", "full_text": "A nuclear meltdown is an informal term for a severe nuclear reactor accident that results in core damage from overheating. The term is not officially defined by the International Atomic Energy Agency or by the Nuclear Regulatory Commission. However, it has been defined to mean the accidental melting of the core of a nuclear reactor, and is in common usage a reference to the core's either complete or partial collapse. \"Core melt accident\" and \"partial core melt\" are the analogous technical terms for a meltdown.\nA core melt accident occurs when the heat generated by a nuclear reactor exceeds the heat removed by the cooling systems to the point where at least one nuclear fuel element exceeds its melting point. This differs from a fuel element failure, which is not caused by high temperatures. A meltdown may be caused by a loss of coolant, loss of coolant pressure, or low coolant flow rate or be the result of a criticality excursion in which the reactor is operated at a power level that exceeds its design limits. Alternately, in a reactor plant such as the RBMK-1000, an external fire may endanger the core, leading to a meltdown.\nOnce the fuel elements of a reactor begin to melt, the fuel cladding has been breached, and the nuclear fuel  and fission products  within the fuel elements can leach out into the coolant. Subsequent failures can permit these radioisotopes to breach further layers of containment. Superheated steam and hot metal inside the core can lead to fuel-coolant interactions, hydrogen explosions, or water hammer, any of which could destroy parts of the containment. A meltdown is considered very serious because of the potential for radioactive materials to breach all containment and escape  into the environment, resulting in radioactive contamination and fallout, and potentially leading to radiation poisoning of people and animals nearby.\n\n", "title": "Nuclear meltdown"}