{"summary": "A nuclear weapon is a weapon that suddenly releases the energy in the nucleus of certain types of atoms.", "full_text": "The United Kingdom was the third country to test an independently developed nuclear weapon, in October 1952. It is one of the five nuclear-weapon states under the NPT and a permanent member of the UN Security Council. Since the 1958 US-UK Mutual Defence Agreement, the United States and the United Kingdom have cooperated extensively on nuclear security matters. The special relationship between the two countries has involved the exchange of classified scientific data and materials such as plutonium.\nThe UK is thought to retain a stockpile of around 225 thermonuclear warheads, of which 160 are operational, but has refused to declare the exact size of its arsenal. Since 1998, the Trident programme has been the only operational nuclear weapons system in British service. The delivery system consists of four Vanguard class submarines based at HMNB Clyde in Scotland. Each submarine is armed with up to 16 Trident II missiles, each carrying warheads in up to eight MIRV re-entry vehicles. With at least one submarine always on patrol, the Vanguards perform a strategic deterrence role and are also believed to have a sub-strategic capability. In contrast with the other permanent members of the United Nations Security Council, the United Kingdom operates only a submarine-based delivery system, having decommissioned its tactical WE.177 free-fall bombs in 1998.\nThe UK has not run a programme to develop an independent delivery system since the cancellation of the Blue Streak missile in 1960. Instead it has purchased US delivery systems for UK use, fitting them with warheads designed and manufactured by the UK's Atomic Weapons Establishment and its predecessor. In 1974, a US proliferation report discussing British nuclear and missile development noted that \"In many cases, it is based on technology received from the US and could not legitimately be passed on without US permission.\"\nThe Atomic Weapons Establishment is undertaking research which is largely dedicated to providing new warheads and on 4 December 2006 the then Prime Minister Tony Blair announced plans for a new class of nuclear missile submarines.\n^ \"UK to be \"more open\" about nuclear warhead levels\". BBC News. 26 May 2010. Retrieved 30 July 2010. \n^ \"Trident missile factfile\". BBC News. 23 September 2009. Retrieved 11 May 2012. \n^ \"Federation of American Scientists :: Status of World Nuclear Forces\". Fas.org. 26 May 2010. Retrieved 30 July 2010. \n^ Prospects for Further Proliferation of Nuclear Weapons . Special National Intelligence Estimate. CIA. 23 August 1974. p. 40. SNIE 4-1-74. Retrieved 20 January 2008. \n^ Woolf, Marie . \"So, minister, are we developing new nuclear weapons or not?; Scientists say they are designing a new warhead design, despite government denials\". The Independent on Sunday . p. 6.  \n^ \"Blair's Trident statement in full\". BBC News. 4 December 2006. Retrieved 4 December 2006.", "title": "Nuclear weapons and the United Kingdom"}