{"summary": "Nuclear energy policy is a national and international policy concerning some or all aspects of nuclear energy, such as mining for nuclear fuel, extraction and processing of nuclear fuel from the ore, electricity generation by nuclear power, enriching and storing spent nuclear fuel and nuclear fuel reprocessing.", "full_text": "Nuclear energy policy is a national and international policy concerning some or all aspects of nuclear energy, such as mining for nuclear fuel, extraction and processing of nuclear fuel from the ore, generating electricity by nuclear power, enriching and storing spent nuclear fuel and nuclear fuel reprocessing.\nNuclear energy policies often include the regulation of energy use and standards relating to the nuclear fuel cycle. Other measures include efficiency standards, safety regulations, emission standards, fiscal policies, and legislation on energy trading, transport of nuclear waste and contaminated materials, and their storage. Governments might subsidize nuclear energy and arrange international treaties and trade agreements about the import and export of nuclear technology, electricity, nuclear waste, and uranium.\nSince about 2001 the term nuclear renaissance has been used to refer to a possible nuclear power industry revival, but nuclear electricity generation in 2012 was at its lowest level since 1999.\nFollowing the March 2011 Fukushima I nuclear accidents, China, Germany, Switzerland, Israel, Malaysia, Thailand, United Kingdom, and the Philippines are reviewing their nuclear power programs. Indonesia and Vietnam still plan to build nuclear power plants. Thirty-one countries operate nuclear power stations, and there are a considerable number of new reactors being built in China, South Korea, India, and Russia. As of June 2011, countries such as Australia, Austria, Denmark, Greece, Ireland, Latvia, Lichtenstein, Luxembourg, Malta, Portugal, Israel, Malaysia, and Norway have no nuclear power stations and remain opposed to nuclear power.\nSince nuclear energy and nuclear weapons technologies are closely related, military aspirations can act as a factor in energy policy decisions. The fear of nuclear proliferation influences some international nuclear energy policies.", "title": "Nuclear energy policy"}