{"summary": "Nuclear proliferation is when a country starts making nuclear objects.", "full_text": "Nuclear proliferation is the spread of nuclear weapons, fissionable material, and weapons-applicable nuclear technology and information to nations not recognized as \"Nuclear Weapon States\" by the Treaty on the Nonproliferation of Nuclear Weapons, also known as the Nuclear Nonproliferation Treaty or NPT. Leading experts on nuclear proliferation, such as Etel Solingen of the University of California, Irvine, suggest that states' decisions to build nuclear weapons is largely determined by the interests of their governing domestic coalitions.\nProliferation has been opposed by many nations with and without nuclear weapons, the governments of which fear that more countries with nuclear weapons may increase the possibility of nuclear warfare , de-stabilize international or regional relations, or infringe upon the national sovereignty of states.\nFour countries besides the five recognized Nuclear Weapons States have acquired, or are presumed to have acquired, nuclear weapons: India, Pakistan, North Korea, and Israel. None of these four is a party to the NPT, although North Korea acceded to the NPT in 1985, then withdrew in 2003 and conducted announced nuclear tests in 2006, 2009, and 2013. One critique of the NPT is that it is discriminatory in recognizing as nuclear weapon states only those countries that tested nuclear weapons before 1968 and requiring all other states joining the treaty to forswear nuclear weapons.\nResearch into the development of nuclear weapons was undertaken during World War II by the United States , Germany, Japan, and the USSR. The United States was the first and is the only country to have used a nuclear weapon in war, when it used two bombs against Japan in August 1945. With their loss during the war, Germany and Japan ceased to be involved in any nuclear weapon research. In August 1949, the USSR tested a nuclear weapon. The United Kingdom tested a nuclear weapon in October 1952. France developed a nuclear weapon in 1960. The People's Republic of China detonated a nuclear weapon in 1964. India exploded a nuclear device in 1974, and Pakistan tested a weapon in 1998. In 2006, North Korea conducted a nuclear test.\n^ Nash, Gary B., Julie Roy Jeffrey, John R. Howe, Peter J. Frederick, Allen F. Davis, Allan M. Winkler, Charlene Mires, and Carla Gardina Pestana. The American People, Concise Edition Creating a Nation and a Society, Combined Volume . New York: Longman, 2007.", "title": "Nuclear proliferation"}