{"summary": "Nuclear magnetic resonance  is the physical phenomenon in which magnetic nuclei in a magnetic field absorb, then re-emit electromagnetic radiation.", "full_text": "Nuclear magnetic resonance  is a physical phenomenon in which nuclei in a magnetic field absorb and re-emit electromagnetic radiation. This energy is at a specific resonance frequency which depends on the strength of the magnetic field and the magnetic properties of the isotope of the atoms; in practical applications, the frequency is similar to VHF and UHF television broadcasts . NMR allows the observation of specific quantum mechanical magnetic properties of the atomic nucleus. Many scientific techniques exploit NMR phenomena to study molecular physics, crystals, and non-crystalline materials through NMR spectroscopy. NMR is also routinely used in advanced medical imaging techniques, such as in magnetic resonance imaging .\nAll isotopes that contain an odd number of protons and/or of neutrons  have an intrinsic magnetic moment and angular momentum, in other words a nonzero spin, while all nuclides with even numbers of both have a total spin of zero. The most commonly studied nuclei are 1H and 13C, although nuclei from isotopes of many other elements  have been studied by high-field NMR spectroscopy as well.\nA key feature of NMR is that the resonance frequency of a particular substance is directly proportional to the strength of the applied magnetic field. It is this feature that is exploited in imaging techniques; if a sample is placed in a non-uniform magnetic field then the resonance frequencies of the sample's nuclei depend on where in the field they are located. Since the resolution of the imaging technique depends on the magnitude of magnetic field gradient, many efforts are made to develop increased field strength, often using superconductors. The effectiveness of NMR can also be improved using hyperpolarization, and/or using two-dimensional, three-dimensional and higher-dimensional multi-frequency techniques.\nThe principle of NMR usually involves two sequential steps:\nThe alignment  of the magnetic nuclear spins in an applied, constant magnetic field B0.\nThe perturbation of this alignment of the nuclear spins by employing an electro-magnetic, usually radio frequency  pulse. The required perturbing frequency is dependent upon the static magnetic field  and the nuclei of observation.\nThe two fields are usually chosen to be perpendicular to each other as this maximizes the NMR signal strength. The resulting response by the total magnetization  of the nuclear spins is the phenomenon that is exploited in NMR spectroscopy and magnetic resonance imaging. Both use intense applied magnetic fields  in order to achieve dispersion and very high stability to deliver spectral resolution, the details of which are described by chemical shifts, the Zeeman effect, and Knight shifts .\nNMR phenomena are also utilized in low-field NMR, NMR spectroscopy and MRI in the Earth's magnetic field , and in several types of magnetometers.", "title": "Nuclear magnetic resonance"}