{"summary": "By now, the most serious nuclear accident has been the Chernobyl disaster in 1986. Other serious nuclear accidents include Fukushima Daiichi Nuclear Power Plant accident, Three Mile Island accident, the Windscale fire, Mayak accident, and the SL-1 accident.", "full_text": "A nuclear and radiation accident is defined by the International Atomic Energy Agency  as \"an event that has led to significant consequences to people, the environment or the facility.\" Examples include lethal effects to individuals, large radioactivity release to the environment, or reactor core melt.\" The prime example of a \"major nuclear accident\" is one in which a reactor core is damaged and significant amounts of radioactivity are released, such as in the Chernobyl disaster in 1986.\nThe impact of nuclear accidents has been a topic of debate practically since the first nuclear reactors were constructed in 1954. It has also been a key factor in public concern about nuclear facilities. Some technical measures to reduce the risk of accidents or to minimize the amount of radioactivity released to the environment have been adopted. Despite the use of such measures, human error remains, and \"there have been many accidents with varying impacts as well near misses and incidents\".\nWorldwide there have been 99 accidents at nuclear power plants. Fifty-seven accidents have occurred since the Chernobyl disaster, and 57%  of all nuclear-related accidents have occurred in the USA. Serious nuclear power plant accidents include the Fukushima Daiichi nuclear disaster , Chernobyl disaster , Three Mile Island accident , and the SL-1 accident .\nNuclear-powered submarine core meltdown and other mishaps include the K-19 , K-11 , K-27 , K-140 , K-429 , K-222 , K-314 , and K-431 . Serious radiation accidents include the Kyshtym disaster, Windscale fire, radiotherapy accident in Costa Rica, radiotherapy accident in Zaragoza, radiation accident in Morocco, Goiania accident, radiation accident in Mexico City, radiotherapy unit accident in Thailand, and the Mayapuri radiological accident in India.\nThe IAEA maintains a website reporting recent accidents.", "title": "Nuclear accidents"}