{"summary": "Ocean County is a county in New Jersey that contains most of the Jersey Shore.", "full_text": "Ocean County is a county located along the Jersey Shore in the U.S. state of New Jersey. Its county seat is Toms River, which, like the county itself, has been one of the fastest growing areas of the state since the 1990s. As of the 2010 United States Census, the population was 576,567, having increased by 65,651  from the 2000 Census population of 510,916, surpassing Union County to become the fifth-most populous county in the state and making Ocean County the fastest growing in the state of New Jersey in terms of increase in the number of residents and second-highest in percentage growth. Ocean County was established on February 15, 1850, from portions of Monmouth County, with the addition of Little Egg Harbor Township which was annexed from Burlington County on March 30, 1891. The most populous place was Lakewood Township, with 92,843 residents at the time of the 2010 Census , while Jackson Township, covered 100.62 square miles , the largest total area of any municipality in the county.\nOcean County is located 50 miles  east of Philadelphia, 70 miles  south of New York City, and 25 miles  north of Atlantic City, making it a prime destination for residents of these cities during the summer. As with the entire Jersey Shore, summer traffic routinely clogs local roadways throughout the season.\nOcean County is part of the New York metropolitan area, and is home to many tourist attractions frequently visited by Delaware Valley residents, especially the beachfront communities of Seaside Heights, Long Beach Island, Point Pleasant Beach, as well as Six Flags Great Adventure, which is the home of the world's tallest and formerly fastest roller coaster, Kingda Ka. Ocean County is also a gateway to New Jersey's Pine Barrens, one of the largest protected pieces of land on the East Coast.\n^ a b Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 201. Accessed January 21, 2013.\n^ a b Ocean County, NJ, National Association of Counties. Accessed January 21, 2013.\n^ a b DP1 - Profile of General Population and Housing Characteristics: 2010 Demographic Profile Data for Middlesex County, New Jersey, United States Census Bureau. Accessed January 23, 2013.\n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ \n^ NJ Labor Market Views, New Jersey Department of Labor and Workforce Development, March 15, 2011. Accessed October 6, 2013.\n^", "title": "Ocean County, New Jersey"}