{"summary": "The October Revolution refers to the seizing of power in Russia by the Bolsheviks led by Vladimir Ilyich Lenin and Leon Trotsky.", "full_text": "The October Revolution , officially known in the Soviet literature as the Great October Socialist Revolution , and commonly referred to as Red October, the October Uprising or the Bolshevik Revolution, was a seizure of state power instrumental in the larger Russian Revolution of 1917. It took place with an armed insurrection in Petrograd traditionally dated to 25 October 1917 .\nIt followed and capitalized on the February Revolution of the same year, which overthrew the Tsarist autocracy and established a provisional government composed predominantly of former nobles and aristocrats. During this time, urban workers began to organize into councils  wherein revolutionaries criticized the provisional government and its actions. The October Revolution in Petrograd overthrew the provisional government and gave the power to the local soviets. The Bolshevik party was heavily supported by the soviets. After the Congress of Soviets, now the governing body, had its second session, it elected members of the Bolsheviks and other leftist groups such as the Left Socialist Revolutionaries to key positions within the new state of affairs. This immediately initiated the establishment of the Russian Socialist Federative Soviet Republic, the world's first self-proclaimed socialist state.\nThe revolution was led by the Bolsheviks, who used their influence in the Petrograd Soviet to organize the armed forces. Bolshevik Red Guards forces under the Military Revolutionary Committee began the takeover of government buildings on 24 October 1917 . The following day, the Winter Palace , was captured.\nThe long-awaited Constituent Assembly elections were held on 12 November 1917. The Bolsheviks only won 175 seats in the 715 seat legislative body, coming in second behind the Socialist Revolutionary party, which won 370 seats. The Constituent Assembly was to first meet on 28 November 1917, but its convocation was delayed until 5 January 1918 by the Bolsheviks. On its first and only day in session, the body rejected Soviet decrees on peace and land, and was dissolved the next day by order of the Congress of Soviets.\nAs the revolution was not universally recognized, there followed the struggles of the Russian Civil War  and the creation of the Soviet Union in 1922.\n\n", "title": "October Revolution"}