{"summary": "The Ohio State University  is a public university in Columbus, Ohio, USA.", "full_text": "The Ohio State University, commonly referred to as Ohio State or OSU, is a public research university in Columbus, Ohio. Founded in 1870, as a land-grant university and ninth university in Ohio with the Morrill Act of 1862, the university was originally known as the Ohio Agricultural and Mechanical College. The college began with a focus on training students in various agricultural and mechanical disciplines but was developed into a comprehensive university under the direction of Governor Rutherford B. Hayes and in 1878 the Ohio General Assembly passed a law changing the name to \"The Ohio State University\". It has since grown into the third largest university campus in the United States. Along with its main campus in Columbus, Ohio State also operates a regional campus system with regional campuses in Lima, Mansfield, Marion, Newark, and Wooster.\nThe university is also home to an extensive student life program, with over 1,000 student organizations; intercollegiate, club and recreational sports programs; student media organizations and publications, fraternities and sororities; and three active student governments. Ohio State athletic teams compete in Division I  of the NCAA and are known as the Ohio State Buckeyes. The university is a member of the Big Ten Conference for the majority of sports. The Ohio State Buckeyes men's ice hockey program competes in the Big Ten Conference, while its women's hockey program competes in the Western Collegiate Hockey Association. In addition, the OSU men's volleyball team is a member of the Midwestern Intercollegiate Volleyball Association . OSU is one of only fourteen universities in the nation that plays Division I FBS football and Division I ice hockey. Alumni and former students have gone on to prominent careers in government, business, science, medicine, education, sports, and entertainment.\nMichael V. Drake, former chancellor of the University of California, Irvine, assumed the role of university president on June 30, 2014.", "title": "Ohio State University"}