{"summary": "The Oklahoma City bombing was a terrorist attack on April 19, 1995 on the U.S.", "full_text": "The Oklahoma City bombing was a domestic terrorist bomb attack on the Alfred P. Murrah Federal Building in downtown Oklahoma City on April 19, 1995. Carried out by Timothy McVeigh and Terry Nichols, the bombing killed 168 people and injured more than 680 others. The blast destroyed or damaged 324 buildings within a 16-block radius, destroyed or burned 86 cars, and shattered glass in 258 nearby buildings, causing an estimated $652 million worth of damage. Extensive rescue efforts were undertaken by local, state, federal, and worldwide agencies in the wake of the bombing, and substantial donations were received from across the country. The Federal Emergency Management Agency  activated eleven of its Urban Search and Rescue Task Forces, consisting of 665 rescue workers who assisted in rescue and recovery operations.\nWithin 90 minutes of the explosion, McVeigh was stopped by Oklahoma State Trooper Charlie Hanger for driving without a license plate and arrested for illegal weapons possession. Forensic evidence quickly linked McVeigh and Nichols to the attack; Nichols was arrested, and within days both were charged. Michael and Lori Fortier were later identified as accomplices. McVeigh, a U.S. militia movement sympathizer who was a Gulf War veteran, had detonated a Ryder rental truck full of explosives parked in front of the building. McVeigh's co-conspirator, Nichols, had assisted in the bomb preparation. Motivated by his hatred of the federal government and angered by its handling of the 1993 Waco siege and the Ruby Ridge incident in 1992, McVeigh timed his attack to coincide with the second anniversary of the deadly fire that ended the siege at Waco.\nThe official investigation, known as \"OKBOMB\", saw FBI agents conduct 28,000 interviews, amass 3.5 short tons  of evidence, and collect nearly one billion pieces of information. The bombers were tried and convicted in 1997. McVeigh was executed by lethal injection on June 11, 2001, and Nichols was sentenced to life in prison in 2004. Michael and Lori Fortier testified against McVeigh and Nichols; Michael was sentenced to 12 years in prison for failing to warn the United States government, and Lori received immunity from prosecution in exchange for her testimony.\nAs a result of the bombing, the U.S. Congress passed the Antiterrorism and Effective Death Penalty Act of 1996, which tightened the standards for habeas corpus in the United States, as well as legislation designed to increase the protection around federal buildings to deter future terrorist attacks. On April 19, 2000, the Oklahoma City National Memorial was dedicated on the site of the Murrah Federal Building, commemorating the victims of the bombing. Annual remembrance services are held at the same time of day as the explosion occurred.", "title": "Oklahoma City bombing"}