{"summary": "Oliver Wolf Sacks, CBE  was a British neurologist, writer, and amateur chemist.", "full_text": "Oliver Wolf Sacks, CBE, FRCP  was a British neurologist, naturalist and author who spent his professional life in the United States. He felt that the brain was the \"most incredible thing in the universe\" and therefore important to study. He became widely known for writing best-selling case histories about his patients' disorders, with some of his books adapted for film and stage.\nAfter Sacks received his medical degree from The Queen's College, Oxford in 1960, he interned at Middlesex Hospital  and moved to the U.S. He then interned at Mount Zion Hospital in San Francisco and completed his residency in neurology and neuropathology at the University of California, Los Angeles . He relocated to New York in 1965, where he became professor of neurology at New York University School of Medicine. Between 2007 and 2012, he was professor of neurology and psychiatry at Columbia University, where he also held the position of \"Columbia Artist\", which recognized his contributions to art and science. He was also a faculty member at Yeshiva University's Albert Einstein College of Medicine, and a visiting professor at the University of Warwick.\nSacks was the author of numerous best-selling books, mostly collections of case studies of people with neurological disorders. His writings have been featured in a wide range of media; the New York Times called him a \"poet laureate of contemporary medicine\", and \"one of the great clinical writers of the twentieth century\". His books included a wealth of narrative detail about his experiences with patients, and how they coped with their conditions, often illuminating how the normal brain deals with perception, memory and individuality.\nAwakenings , an autobiographical account of his efforts to help people with encephalitis lethargica regain proper neurological function, was adapted into the Academy Award-nominated film in 1990, starring Robin Williams and Robert De Niro. He and his book Musicophilia: Tales of Music and the Brain were the subject of \"Musical Minds\", an episode of the PBS series Nova. In 2008 Sacks was awarded a CBE for services to literature during the Queen's Birthday Honours.", "title": "Oliver Sacks"}