{"summary": "The Sultanate of Oman is a country in the southwestern part of Asia, on the southeast coast of the Arabian Peninsula.", "full_text": "Oman , officially the Sultanate of Oman , is an Arab country in the southeastern coast of the Arabian Peninsula. Holding a strategically important position at the mouth of the Persian Gulf, the nation is bordered by the United Arab Emirates to the northwest, Saudi Arabia to the west, and Yemen to the southwest, and shares marine borders with Iran and Pakistan. The coast is formed by the Arabian Sea on the southeast and the Gulf of Oman on the northeast. The Madha and Musandam exclaves are surrounded by the UAE on their land borders, with the Strait of Hormuz and Gulf of Oman forming Musandam's coastal boundaries.\nFrom the late 17th century, the Omani Sultanate was a powerful empire, vying with Portugal and Britain for influence in the Persian Gulf and Indian Ocean. At its peak in the 19th century, Omani influence or control extended across the Strait of Hormuz to modern-day Iran and Pakistan, and as far south as Zanzibar . As its power declined in the 20th century, the sultanate came under the influence of the United Kingdom. Historically, Muscat was the principal trading port of the Persian Gulf region. Muscat was also among the most important trading ports of the Indian Ocean. Oman's official religion is Islam.\nOman is an absolute monarchy. The Sultan Qaboos bin Said al Said has been the hereditary leader of the country since 1970. Sultan Qaboos is the longest-serving ruler in the Middle East. Oman's human rights record has been the subject of criticism.\nUnlike its resource-rich neighbors, Oman has modest oil reserves, ranking 25th globally. Nevertheless, in 2010 the UNDP ranked Oman as the most improved nation in the world in terms of development during the preceding 40 years. Oman is categorized as a high-income economy and ranks as the 59th most peaceful country in the world according to the Global Peace Index.", "title": "Oman"}