{"summary": "The One World Trade Center  is the main building of the new World Trade Center complex in Lower Manhattan, New York City.", "full_text": "One World Trade Center  refers to the main building of the new World Trade Center complex in Lower Manhattan, New York City. It is the tallest skyscraper in the Western Hemisphere, and the sixth-tallest in the world. The 104-story supertall structure shares a numeric name with the North Tower of the original World Trade Center, which was destroyed in the terrorist attacks of September 11, 2001. The new skyscraper stands on the northwest corner of the 16-acre  World Trade Center site, on the site of the original 6 World Trade Center. The building is bounded by West Street to the west, Vesey Street to the north, Fulton Street to the south, and Washington Street to the east.\nThe building's architect was David Childs, whose firm Skidmore, Owings & Merrill  also designed the Burj Khalifa and the Willis Tower. The construction of below-ground utility relocations, footings, and foundations for the new building began on April 27, 2006. One World Trade Center became the tallest structure in New York City on April 30, 2012, when it surpassed the height of the Empire State Building. The tower's steel structure was topped out on August 30, 2012. On May 10, 2013, the final component of the skyscraper's spire was installed, making the building, including its spire, reach a total height of 1,776 feet . Its height in feet is a deliberate reference to the year when the United States Declaration of Independence was signed. The building opened on November 3, 2014.\nOn March 30, 2009, the Port Authority of New York and New Jersey  confirmed that the building would be officially known by its legal name of \"One World Trade Center\", rather than its colloquial name of \"Freedom Tower\". The building is 104 standard floors high, but the tower has only 94 actual stories.\nThe new World Trade Center complex will eventually include five high-rise office buildings built along Greenwich Street, as well as the National September 11 Memorial & Museum, located just south of One World Trade Center where the original Twin Towers stood. The construction of the new building is part of an effort to memorialize and rebuild following the destruction of the original World Trade Center complex.", "title": "One World Trade Center"}