{"summary": "The Open University  is a distance learning and research university founded by Royal Charter in the United Kingdom.", "full_text": "The Open University  is a public distance learning and research university, and one of the biggest universities in the UK for undergraduate education. The majority of the OU's undergraduate students are based throughout the United Kingdom and principally study off-campus; many of its courses  can also be studied anywhere in the world. There is also a number of full-time postgraduate research students based on the 48-hectare university campus where they use the OU facilities for research, as well as more than 1000 members of academic and research staff and over 2500 administrative, operational and support staff. The OU was established in 1969 and the first students enrolled in January 1971. The University administration is based at Walton Hall, Milton Keynes in Buckinghamshire, but has regional centres in each of its thirteen regions around the United Kingdom. It also has offices and regional examination centres in many other European countries. The university awards undergraduate and postgraduate degrees, as well as non-degree qualifications such as diplomas and certificates or continuing education units.\nWith more than 250,000 students enrolled, including around 32,000 aged under 25 and more than 50,000 overseas students, it is the largest academic institution in the United Kingdom  by student number, and qualifies as one of the world's largest universities. Since it was founded, more than 1.5 million students have studied its courses. It was rated top university in England and Wales for student satisfaction in the 2005, 2006 and 2012 United Kingdom government national student satisfaction survey, and second in the 2007 survey. Out of 132 universities and colleges, the OU was ranked 43rd  in the Times Higher Education Table of Excellence in 2008, between the University of Reading and University of the Arts London; it was rated highly in Design, Art History, English, Earth and Environmental Sciences, Computer Science, Development Studies, Social Policy and Social Work and Sociology. It was ranked overall as a nationally top forty, and globally top five hundred university by the Academic Ranking of World Universities in 2011, as well as being ranked 247 for citations of its academics.\nThe Open University is also one of only three United Kingdom higher education institutions to gain accreditation in the United States of America by the Middle States Commission on Higher Education, an institutional accrediting agency, recognized by the United States Secretary of Education and the Council for Higher Education Accreditation.", "title": "Open University"}