{"summary": "The British Armed Forces are the armed forces of the United Kingdom.", "full_text": "Operation Hurricane was the test of the first UK atomic device on 3 October 1952. A plutonium implosion device was detonated in the lagoon between the Montebello Islands, Western Australia, just over three years after the Soviet Union detonated a similar plutonium implosion device in September 1949.\nSeveral key British scientists had worked on the Manhattan Project and after returning to the UK worked on the British atom bomb project, so unsurprisingly the weapon had a close similarity to the Fat Man  weapon, although the McMahon Atomic Energy Act of 1946 prevented any British access to the US design data. The design used a hollow core, unlike the gadget tested at Trinity. This increased the expected yield of the bomb to 30 kilotons, although the actual yield was closer to 25 kilotons. The bomb core used 7 kg of plutonium produced mainly at Windscale  in Cumbria with a low Pu-240 content of only 2%.\nPu-240 is an unavoidable contaminant of Pu-239 produced by irradiation of uranium in a thermal reactor; its effect in a bomb core is to increase the risk of a \"fizzle\" or pre-detonation. The only way to keep it within acceptable limits at that time was to limit the time the reactor fuel was exposed in the reactors. The Canadian Chalk River plant supplied 5 kg of plutonium by April 1952, and by August 1952 the Windscale plant had supplied 18 kg. No records exist to show whether any of the Canadian material was used in the Hurricane test device; more than one fissile core was prepared for the trial, each to a different design.\nTo test the effects of a ship-smuggled bomb , Hurricane was exploded inside the hull of HMS Plym  which was anchored in 12 metres  of water, 350 metres  off Trimouille Island. The explosion occurred 2.7 metres  below the water line, and left a saucer-shaped crater on the seabed 6 metres  deep and 300 metres  across.\n^ a b c d e f g h The National Archives, London, ES 1/11.\n^ \"British nuclear test Operation Hurricane - secret reports to Winston Churchill and civil defense data obtained\". Internet Archive. Retrieved 16 October 2015.", "title": "Operation Hurricane"}