{"summary": "May 15 is the 135th day of the year  in the Gregorian calendar.", "full_text": "Operation Grapple, and operations Grapple X, Grapple Y and Grapple Z, were the names of British nuclear weapons tests of very-early hydrogen bombs. These tests were carried out from 1956 until 1958 at Malden Island and Christmas Island in the Central Pacific Ocean. Nine nuclear explosions were executed during these series of nuclear weapon tests, culminating in the United Kingdom's becoming the third recognised possessor of thermonuclear weapons.\nAll of these nuclear bombs were exploded high in the atmosphere, rather than being detonated on the ground, in order to reduce the production of nuclear fallout.\nThe unproven H-bomb designs being developed by British weaponeers required full-scale testing of their capabilities, hence Operation Grapple was carried out as a massive military operation in the Central Pacific, and this was the largest British military operation carried out since World War II. The preparations for Operation Grapple, including building the necessary structures on Kiritimati, began at the end of May 1956. About 1,200 civilians and servicemen were sent to Kiritimati during 1956.\nThe first deliveries to Kiritimati were made by the troopship Devonshire, which steamed to the Central Pacific from East Asia and took construction troops aboard at Fiji. These men had flown there from the UK on commercial airliners. The first project on Kiritimati, which was finished in October, was to rebuild the main runway at the airport . The majority of troops and civilians were then flown in from the UK, via Canada and Hawaii, in chartered airliners. The original troops began to be flown out in mid-1957.\nWhile Kiritimati was the main base, three other islands supported Operation Grapple. The area around Malden Island, located about 330 kilometres south of Kiritimati, was to be the site for the bomber-dropped tests, and Penrhyn Island, 320 kilometres farther south was used as a technical monitoring site and as a weather station. Air deliveries of cargo for Operation Grapple were generally sent via Hickam Air Force Base  in the American Territory of Hawaii, where a transport group of the Royal Air Force was assigned.\nSeaborne supplies for Operation Grapple were usually shipped via Australia or New Zealand, using freighters of the Royal Fleet Auxiliary . The British Royal Navy built a seawater processing plant on Kiritimati early during Operation Grapple, and this provided freshwater for drinking and cooking, and semi-saline water for bathing.", "title": "Operation Grapple"}