{"summary": "An oscilloscope  is a piece of electronic test equipment that allows signal voltages to be viewed.", "full_text": "An oscilloscope, previously called an oscillograph, and informally known as a scope, CRO , or DSO , is a type of electronic test instrument that allows observation of constantly varying signal voltages, usually as a two-dimensional plot of one or more signals as a function of time. Other signals  can be converted to voltages and displayed.\nOscilloscopes are used to observe the change of an electrical signal over time, such that voltage and time describe a shape which is continuously graphed against a calibrated scale. The observed waveform can be analyzed for such properties as amplitude, frequency, rise time, time interval, distortion and others. Modern digital instruments may calculate and display these properties directly. Originally, calculation of these values required manually measuring the waveform against the scales built into the screen of the instrument.\nThe oscilloscope can be adjusted so that repetitive signals can be observed as a continuous shape on the screen. A storage oscilloscope allows single events to be captured by the instrument and displayed for a relatively long time, allowing observation of events too fast to be directly perceptible.\nOscilloscopes are used in the sciences, medicine, engineering, and telecommunications industry. General-purpose instruments are used for maintenance of electronic equipment and laboratory work. Special-purpose oscilloscopes may be used for such purposes as analyzing an automotive ignition system or to display the waveform of the heartbeat as an electrocardiogram.\nBefore the advent of digital electronics, oscilloscopes used cathode ray tubes  as their display element  and linear amplifiers for signal processing. Storage oscilloscopes used special storage CRTs to maintain a steady display of a single brief signal. CROs were later largely superseded by digital storage oscilloscopes  with thin panel displays, fast analog-to-digital converters and digital signal processors. DSOs without integrated displays  are available at lower cost and use a general-purpose digital computer to process and display waveforms.", "title": "Oscilloscope"}