{"summary": "Owen James Hart  was a Canadian professional wrestler.", "full_text": "Owen James Hart  was a Canadian professional and amateur wrestler who worked for several promotions including Stampede Wrestling, New Japan Pro Wrestling , World Championship Wrestling , and most notably, the World Wrestling Federation , where he wrestled under both his own name, and ring name The Blue Blazer. A member of the Hart wrestling family, Hart was born in Calgary, Alberta, the youngest of 12 children of Stampede Wrestling promoter and WWE Hall of Famer Stu Hart and Helen Hart.\nAmong other accolades, Hart was a one-time world champion, having held the USWA Unified World Heavyweight Championship during the USWA's partnership with the WWF, a two-time WWF Intercontinental Champion, a one-time IWGP Junior Heavyweight Champion, a one-time WWF European Champion, and a four-time WWF World Tag Team Champion. He was also the winner of the 1994 WWF King of the Ring. A staple of the WWF's In Your House pay-per-view series from 1995 to 1998, Hart wrestled more matches at those events than any other performer with 22, including three headlining slots. He also main-evented SummerSlam 1994 in a steel cage match against older brother Bret Hart for the WWF Championship, which remains one of five WWF matches in history awarded a full five stars in the Wrestling Observer Newsletter.\nRegarded by a number of peers as one of the WWF's greatest professional wrestlers, Hart died on May 23, 1999, when an equipment malfunction occurred during his entrance from the rafters of Kemper Arena in Kansas City, Missouri, U.S., at the WWF's Over the Edge pay-per-view event.\nIn 2015 over 16 years after his death, WWE will release a 3-disc DVD set on Hart's life and career called \"Owen: Hart of Gold\" which will contain his best matches and a documentary on Hart himself.\n^ a b c d e f g h i \"Owen Hart Profile\". Online World Of Wrestling. Retrieved April 27, 2008. \n^ \"1984\". \n^ \"Owen Hart\". \n^ See: In Your House 9: International Incident, In Your House 16: Canadian Stampede and No Way Out of Texas: In Your House.\n^ \"SummerSlam 1994: Main Event\". WWE. Retrieved June 16, 2014. \n^ \"Top Rated Matches of All Time\". Internet Wrestling Database. Retrieved October 6, 2014. \n^ Hart, Bret . \"Remembering Owen\". Calgary Sun. \n^ \n^ http://www.wrestlingdvdnetwork.com/wwe-changes-owen-hart-cover-first-2016-dvds/101795/", "title": "Owen Hart"}