{"summary": "The Apollo Lunar Module  is the spidery-looking landing vehicle on the moon.", "full_text": "An oxygen tank is an oxygen storage vessel for oxygen, which is either held under pressure in gas cylinders or as liquid oxygen in a cryogenic storage tank.\nOxygen tanks are used to store gas for:\nindustrial processes including the manufacture of steel and monel\noxyacetylene welding equipment, glass lampworking torches, and some gas cutting torches\nuse as the liquid rocket propellants for rocket engines\nmedical breathing gas at medical facilities and at home\nbreathing at altitude in aviation, either in an uncontrolled decompression emergency, or constantly \noxygen first aid kits\ngas blending for creating diving breathing mixes such as nitrox, trimix and heliox\nopen-circuit scuba sets - mainly used for accelerated decompression in technical diving\nsome types of diving rebreather: oxygen rebreathers and fully closed circuit rebreathers\nBreathing oxygen is delivered from the storage tank to the users by use of the following methods: oxygen mask, nasal cannula, full face diving mask, demand valve, oxygen rebreather, built in breathing system , oxygen tent, and hyperbaric oxygen chamber.\nContrary to popular belief scuba divers very rarely carry oxygen tanks. The vast majority of divers breathe air or nitrox stored in a diving cylinder. A small minority breathe trimix, heliox or other exotic gases. Some of these may carry pure oxygen for accelerated decompression or as a component of a rebreather. Some shallow divers, particularly naval divers, use oxygen rebreathers or have done so historically.\nOxygen is rarely held at pressures higher than 200 bar / 3000 psi due to the risks of fire triggered by high temperatures caused by adiabatic heating when the gas changes pressure when moving from one vessel to another.\nAll equipment coming into contact with high pressure oxygen must be \"oxygen clean\" and \"oxygen compatible\" to reduce the risk of fire. \"Oxygen clean\" means the removal of any substance that could act as a source of ignition. \"Oxygen compatible\" means that internal components must not burn readily or degrade easily in a high pressure oxygen environment.\nIn some countries there are legal and insurance requirements and restrictions on the use, storage and transport of pure oxygen. Oxygen tanks are normally stored in well ventilated locations, far from potential sources of fire and concentrations of people.", "title": "Oxygen tank"}