{"summary": "Pakistan is a country in southern Asia.", "full_text": "Pakistan , officially the Islamic Republic of Pakistan , is a sovereign country in South Asia. With a population exceeding 199 million people, it is the sixth most populous country and with an area covering 796,095 km2 , it is the 36th largest country in the world in terms of area. Pakistan has a 1,046-kilometre  coastline along the Arabian Sea and the Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest and China in the far northeast respectively. It is separated from Tajikistan by Afghanistan's narrow Wakhan Corridor in the north, and also shares a maritime border with Oman.\nThe territory that now constitutes Pakistan was previously home to several ancient cultures, including the Mehrgarh of the Neolithic and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Indian Mauryan Empire, the Persian Achaemenid Empire, Alexander of Macedonia, the Arab Umayyad Caliphate, the Mongol Empire, the Mughal Empire, the Durrani Empire, the Sikh Empire and the British Empire. As a result of the Pakistan Movement led by Muhammad Ali Jinnah and the subcontinent's struggle for independence, Pakistan was created in 1947 as an independent nation for Muslims from the regions in the east and west of Subcontinent where there was a Muslim majority. Initially a dominion, Pakistan adopted a new constitution in 1956, becoming an Islamic republic. A civil war in 1971 resulted in the secession of East Pakistan as the new country of Bangladesh.\nPakistan is a federal parliamentary republic consisting of four provinces and four federal territories. It is an ethnically and linguistically diverse country, with a similar variation in its geography and wildlife. A regional and middle power, Pakistan has the seventh largest standing armed forces in the world and is also a nuclear power as well as a declared nuclear-weapons state, being the only nation in the Muslim world, and the second in South Asia, to have that status. It has a semi-industrialised economy with a well-integrated agriculture sector, its economy is the 26th largest in the world in terms of purchasing power and 45th largest in terms of nominal GDP and is also characterized among the emerging and growth-leading economies of the world.\nThe post-independence history of Pakistan has been characterised by periods of military rule, political instability and conflicts with neighbouring India. The country continues to face challenging problems, including overpopulation, terrorism, poverty, illiteracy, and corruption. Despite these factors it maintains strategic endowments and development potential while it has made substantial progress in reducing poverty giving it the second lowest headcount poverty rate in South Asia. It is ranked 16th on the 2012 Happy Planet Index, while its stock exchange has been among the highest performing in Asia. It is a member of the United Nations, the Commonwealth of Nations, the Next Eleven Economies, Shanghai Cooperation Organisation, ECO, UfC, D8, Cairns Group, Kyoto Protocol, ICCPR, RCD, UNCHR, Asian Infrastructure Investment Bank, Group of Eleven, CPFTA, Group of 24, the G20 developing nations, ECOSOC, founding member of the Organisation of Islamic Cooperation, SAARC and CERN.", "title": "Pakistan"}