{"summary": "Iran , once known as Persia, is a country in Western Asia.", "full_text": "Pakistan is one of nine states to possess nuclear weapons, and the only Muslim majority country to do so. Pakistan began development of nuclear weapons in January 1972 under Prime Minister Zulfikar Ali Bhutto, who delegated the program to the Chairman of PAEC Munir Ahmad Khan with a commitment to have the bomb ready by the end of 1976. Since PAEC, consisting of over twenty laboratories and projects under nuclear engineer, Munir Ahmad Khan was falling behind schedule and having considerable difficulty producing fissile material, Abdul Qadeer Khan was brought from Europe by Zulfikar Ali Bhutto at the end of 1974. As pointed out by Houston Wood, Professor of Mechanical & Aerospace Engineering, University of Virginia, Charlottesville, USA in his article on gas centrifuges, \"The most difficult step in building a nuclear weapon is the production of fissile material\", so this work in producing fissile material as head of the Kahuta Project was pivotal to Pakistan developing the capability to detonate a nuclear bomb by the end of 1984.\nThe Kahuta Project started under the supervision of a coordination board that oversaw the activities of ERL and the Pakistan Atomic Energy Commission . The Board consisted of Mr A G N Kazi , Mr Ghulam Ishaq Khan  and Mr Agha Shahi  and reported directly to Prime Minister Zulfikar Ali Bhutto. Mr. Ghulam Ishaq Khan and General Tikka Khan  appointed military engineer, Major General Ali Nawab to the program. Eventually, the supervison passed to Lt General Zahid Ali Akbar in President General Muhammad Zia-ul-Haq's Administration. Moderate uranium enrichment for the production of fissile material was achieved at KRL by April 1978.\nPakistan's nuclear weapons development was in response to neighboring India's development of its nuclear programme. Bhutto called a meeting of senior scientists and engineers on 20 January 1972, in Multan, which came to known as \"Multan meeting\". Bhutto was the main architect of this programme, and it was here that Bhutto orchestrated nuclear weapons programme and rallied Pakistan's academic scientists to build the atomic bomb in three years for national survival. At the Multan meeting, Bhutto also appointed Munir Ahmad Khan as chairman of Pakistan Atomic Energy Commission , who, until then, had been working as Director at the nuclear power and Reactor Division of the International Atomic Energy Agency , in Vienna, Austria. In December 1972, Abdus Salam led the establishment of Theoretical Physics Group  as he called scientists working at ICTP to report to Munir Ahmad Khan. This marked the beginning of Pakistan's pursuit of nuclear deterrence capability. Following India's surprise nuclear test, codenamed Smiling Buddha in 1974, the first confirmed nuclear test by a nation outside the permanent five members of the United Nations Security Council, the goal to develop nuclear weapons received considerable impetus.\nFinally, on 28 May 1998, a few weeks after India's second nuclear test , Pakistan detonated five nuclear devices in the Ras Koh Hills in the Chagai district, Balochistan. This operation was named Chagai-I by Pakistan, the underground iron-steel tunnel having been long-constructed by provincial martial law administrator General Rahimuddin Khan during the 1980s. The last test of Pakistan was conducted at the sandy Kharan Desert under the codename Chagai-II, also in Balochistan, on 30 May 1998. Pakistan's fissile material production takes place at Nilore, Kahuta, and Khushab/Jauharabad, where weapons-grade plutonium is refined. Pakistan thus became the seventh country in the world to successfully develop and test nuclear weapons. Although, according to a letter sent by A.Q. Khan to General Zia, the capability to detonate a nuclear bomb using highly enriched uranium as fissile material produced at KRL had been achieved by KRL in 1984.\n\n", "title": "Pakistan and weapons of mass destruction"}