{"summary": "Pakistan Navy  is the naval branch of the military of Pakistan.", "full_text": "The Pakistan Navy   is the naval warfare branch of Pakistan Armed Forces, responsible for Pakistan's 1,046 kilometres  of coastline along the Arabian Sea, and the defence of important civilian harbours and military bases. The Pakistan Navy came into the existence after the independence of Pakistan in 1947, and is headed by Admiral Muhammed Zakaullah. Navy Day is celebrated on 8 September in commemoration of the Indo-Pakistani War of 1965.\nThe Pakistan Navy's current and primary role is to protect the country's economic and military interests at home and abroad, executing the foreign and defence policies of the Government of Pakistan through the exercise of military effect, diplomatic activities and other activities in support of these objectives. In the 21st century, the Pakistan Navy also focuses on limited overseas operations, and has played a vital role in the establishment of the Pakistan Antarctic Programme.\nThe Pakistan Navy is supported by the Pakistan Coast Guard, Pakistan Marines, and the Maritime Security Agency , the combat paramilitary division of the Pakistan Navy.\nThe Navy is undergoing extensive modernisation and expansion as part of Pakistan's role in the War on Terror. Since 2001, the Pakistan Navy has increased and expanded its operational scope, and has been given greater national and international responsibility in countering the threat of sea-based global terrorism, drug smuggling, and piracy. In 2004, Pakistan Navy became a member of the primarily NATO Combined Task Forces CTF-150 and CTF-151.\nThe Constitution of Pakistan makes the President of Pakistan the civilian Commander-in-Chief. The Chief of Naval Staff , by statute a four star admiral, is appointed by the President with the consultation and confirmation needed from the Prime Minister of Pakistan. The Chief of Naval Staff is subordinate to the civilian Defence Minister and Secretary of Defence, and commands the Navy.", "title": "Pakistan Navy"}