{"summary": "Palmyra was an ancient Arabian city in central Syria.", "full_text": "Palmyra  is an ancient Semitic city in present-day Homs Governorate, Syria. Archaeological finds date back to the Neolithic period and the city was first documented in the early second millennium BC. Palmyra changed hands between the different empires that ruled the area, becoming a subject of the Roman Empire in the first century AD.\nPalmyra's wealth enabled the construction of monumental projects, such as the Great Colonnade, the Temple of Bel and the distinctive tower tombs. Palmyra grew wealthy from trade caravans; the Palmyrenes, renowned merchants, established colonies along the Silk Road and operated throughout the Roman Empire. The Palmyrenes were a mix of Amorites, Arameans and Arabs. The city's social structure was tribal, and its inhabitants spoke Palmyrene ; Greek was used for commercial and diplomatic purposes. The culture of Palmyra, influenced by Greco-Roman culture, produced distinctive art and architecture that combined eastern and western traditions. The city's inhabitants worshiped local deities and Mesopotamian and Arab gods.\nBy the third century AD, Palmyra was a prosperous regional center reaching the apex of its power in the 260s, when the Palmyrene king Odaenathus defeated the Persian emperor Shapur I. The king was succeeded by the regent Queen Zenobia, who rebelled against Rome and established the Palmyrene Empire. In 273, the Roman emperor Aurelian destroyed the city, which was later restored by Diocletian, but at a reduced size. The Palmyrenes converted to Christianity during the fourth century and to Islam in the second half of the first millennium, after which the Palmyrene and Greek languages were replaced by Arabic.\nBefore 273 AD, Palmyra enjoyed autonomy and was attached to the Roman province of Syria having its political organization influenced by the Greek city-state model during the first two centuries AD. The city became a colonia during the third century leading to the incorporation of Roman governing institutions before becoming a monarchy in 260. Following its Roman destruction, Palmyra became a minor center under the Byzantines and later empires. Its destruction by the Timurids in 1400 reduced it to a small village. Under French Mandatory rule, in 1932, the inhabitants were moved into the new village of Tadmur and the ancient site became available for excavations. In 2015, Palmyra came under the control of the Islamic State of Iraq and the Levant , which later destroyed a number of the site's buildings.\n\n", "title": "Palmyra"}