{"summary": "The Paralympic Games are a major international sports event.", "full_text": "The Paralympic Games is a major international multi-sport event, involving athletes with a range of physical disabilities, including impaired muscle power , impaired passive range of movement, limb deficiency , leg length difference, short stature, hypertonia, ataxia, athetosis, vision impairment and intellectual impairment. There are Winter and Summer Paralympic Games, which since the 1988 Summer Games in Seoul, South Korea, are held almost immediately following the respective Olympic Games. All Paralympic Games are governed by the International Paralympic Committee .\nThe Paralympics has grown from a small gathering of British World War II veterans in 1948 to become one of the largest international sporting events by the early 21st century. Paralympians strive for equal treatment with non-disabled Olympic athletes, but there is a large funding gap between Olympic and Paralympic athletes.\nThe Paralympic Games are organized in parallel with the Olympic Games, while the IOC-recognized Special Olympics World Games include athletes with intellectual disabilities, and the Deaflympics include deaf athletes.\nGiven the wide variety of disabilities that Paralympic athletes have, there are several categories in which the athletes compete. The allowable disabilities are broken down into ten eligible impairment types. The categories are impaired muscle power, impaired passive range of movement, limb deficiency, leg length difference, short stature, hypertonia, ataxia, athetosis, vision impairment and intellectual impairment. These categories are further broken down into classifications, which vary from sport to sport. The classification system has led to cheating controversies revolving around athletes who over-stated their disabilities, in addition to the use of performance-enhancing drugs seen in other events.\n^ The World Games for the Deaf and the Paralympic Games, International Committee of Sports for the Deaf , December, 1996\n^ Special Olympics and the Olympic Movement, Official website of the Special Olympics, 2006\n^ http://www.paralympic.org/classification", "title": "Paralympics"}