{"summary": "Parkinson's disease  is a slow damaging disease of the central nervous system in which a substance in the brain called dopamine is lost.", "full_text": "Parkinson's disease  is a degenerative disorder of the central nervous system mainly affecting the motor system. The motor symptoms of Parkinson's disease result from the death of dopamine-generating cells in the substantia nigra, a region of the midbrain. The causes of this cell death are poorly understood. Early in the course of the disease, the most obvious symptoms are movement-related; these include shaking, rigidity, slowness of movement and difficulty with walking and gait. Later, thinking and behavioral problems may arise, with dementia commonly occurring in the advanced stages of the disease, and depression is the most common psychiatric symptom. Other symptoms include sensory, sleep and emotional problems. Parkinson's disease is more common in older people, with most cases occurring after the age of 50; when it is seen in young adults, it is called young onset PD.\nThe main motor symptoms are collectively called parkinsonism, or a \"parkinsonian syndrome\". The disease can be either primary or secondary. Primary Parkinson's disease is referred to as idiopathic , although some atypical cases have a genetic origin, while secondary parkinsonism is due to known causes like toxins. Many risks and protective factors have been investigated: the clearest evidence is for an increased risk of PD in people exposed to certain pesticides and a reduced risk in tobacco smokers. The pathology of the disease is characterized by the accumulation of proteins into Lewy bodies in neurons, and insufficient formation and activity of dopamine in certain parts of the midbrain. Where the Lewy bodies are located is often related to the expression and degree of the symptoms of an individual. Diagnosis of typical cases is mainly based on symptoms, with tests such as neuroimaging being used for confirmation.\nTreatments, typically the antiparkinson medications L-DOPA and dopamine agonists, improve the early symptoms of the disease. As the disease progresses and dopaminergic neurons continue to be lost, these drugs eventually become ineffective whilst at the same time produce a complication marked by involuntary writhing movements. Diet and some forms of rehabilitation have shown some effectiveness at improving symptoms. Surgery and deep brain stimulation have been used to reduce motor symptoms as a last resort in severe cases where drugs are ineffective. Research directions include investigations into new animal models of the disease and of the potential usefulness of gene therapy, stem cell transplants and neuroprotective agents. Medications to treat non-movement-related symptoms of PD, such as sleep disturbances and emotional problems, also exist.\nIn 2013 PD resulted in about 103,000 deaths globally, up from 44,000 deaths in 1990. The disease is named after the English doctor James Parkinson, who published the first detailed description in An Essay on the Shaking Palsy in 1817. Several major organizations promote research and improvement of quality of life of those with the disease and their families. Public awareness campaigns include Parkinson's disease day  and the use of a red tulip as the symbol of the disease. People with parkinsonism who have increased the public's awareness of the condition include actor Michael J. Fox, Olympic cyclist Davis Phinney, and professional boxer Muhammad Ali.", "title": "Parkinson's disease"}