{"summary": "A passport is a travel document that says that the person who owns it is a citizen of the country on the passport.", "full_text": "A passport is a travel document, usually issued by a country's government, that certifies the identity and nationality of its holder for the purpose of international travel. Standard passports contain the holder's name, place and date of birth, photograph, signature, and other identifying information. Passports are moving towards including biometric information in a microchip embedded in the document, making them machine-readable and difficult to counterfeit.\nA passport specifies nationality, but not necessarily citizenship or the place of residence of the passport holder. A passport holder is normally entitled to enter the country that issued the passport, though some people entitled to a passport may not be full citizens with right of abode. A passport is a document certifying identity and nationality; having the document does not of itself grant any rights, such as protection by the consulate of the issuing country, although it may indicate that the holder has such rights. Some passports attest to status as a diplomat or other official, entitled to rights and privileges such as immunity from arrest or prosecution, arising from international treaties.\nMany countries normally allow entry to holders of passports of other countries, sometimes requiring a visa also to be held, but this is not an automatic right. Many other additional conditions, such as not being likely to become a public charge for financial or other reasons, and the holder not having been convicted of a crime, may be applicable. Where a country does not recognise another, or is in dispute with it, it may prohibit the use of their passport for travel to that other country, or may prohibit entry to holders of that other country's passports, and sometimes to others who have, for example, visited the other country.\nSome countries and international organisations issue travel documents which are not standard passports, but enable the holder to travel internationally to countries that recognise the documents. For example, stateless persons are not normally issued a national passport, but may be able to obtain a refugee travel document or the earlier \"Nansen passport\" which enables them to travel to countries which recognise them, and sometimes to return to the issuing country. A country may issue a passport to any person, including non-nationals.\nA passport is often accepted, in its country of issue and elsewhere, as reliable proof of identity, unrelated to travel.", "title": "Passport"}