{"summary": "Patricia Ryan Nixon  was the wife of Richard Nixon and served as the First Lady of the United States from 1969 to 1974 and Second Lady of the United States from 1953 to 1961.", "full_text": "Thelma Catherine \"Pat\" Nixon  was the wife of Richard Nixon, 37th President of the United States, and First Lady of the United States from 1969 to 1974.\nBorn in Ely, Nevada, she grew up with her two brothers in what is now Cerritos, California, graduating from high school in 1929. She attended Fullerton Junior College and later the University of Southern California. She paid for her schooling by working multiple jobs, including pharmacy manager, typist, radiographer, and retail clerk. In 1940, she married lawyer Richard Nixon and they had two daughters. Nixon campaigned for her husband in his successful congressional campaigns of 1946 and 1948. Richard Nixon was elected Vice President in the Eisenhower administration, whereupon Pat undertook many missions of goodwill with her husband and gained favorable media coverage. She assisted her husband in both his unsuccessful 1960 presidential campaign and later in his successful 1968 presidential campaign.\nAs First Lady, Pat Nixon promoted a number of charitable causes, including volunteerism. She oversaw the collection of more than 600 pieces of historic art and furnishings for the White House, an acquisition larger than that of any other administration. She was the most traveled First Lady in U.S. history, a record unsurpassed until twenty-five years later. She accompanied the President as the first First Lady to visit China and the Soviet Union and her solo trips to Africa and South America gained her recognition as \"Madame Ambassador\"; she was the first First Lady to enter a combat zone as well. These trips gained her favorable reception in the media and the host countries. Her tenure ended when, after being re-elected in a landslide victory in 1972, President Nixon resigned two years later amid the Watergate scandal.\nHer public appearances became increasingly rare later in life. She and her husband returned to California, and later moved to New Jersey. She suffered two strokes, one in 1976 and another in 1983, then was diagnosed with lung cancer in 1992. She died in 1993, aged 81.", "title": "Pat Nixon"}