{"summary": "Pat Robertson  is an American evangelist and host of the 700 Club, a Christian news and talk show on television.", "full_text": "Marion Gordon \"Pat\" Robertson  is an American media mogul, executive chairman, and a former Southern Baptist minister, who generally supports conservative Christian ideals. He presently serves as chancellor and CEO of Regent University and chairman of the Christian Broadcasting Network.\nSpanning over five decades, Robertson has a career as the founder of several major organizations and corporations as well as a university: The Christian Broadcasting Network , the International Family Entertainment Inc. , Regent University, the American Center for Law & Justice , the Founders Inn and Conference Center, the Christian Coalition, an L-1011 Flying Hospital, Operation Blessing International Relief and Development Corporation, and CBN Asia. He is a best-selling author and the host of The 700 Club, a Christian News and TV program broadcast live weekdays on the ABC Family Channel via satellite from CBN studios, as well as on channels throughout the United States, and on CBN network affiliates worldwide.\nThe son of U.S. Senator A. Willis Robertson, Robertson is a Southern Baptist and was active as an ordained minister with that denomination for many years, but holds to a charismatic theology not traditionally common among Southern Baptists. He unsuccessfully campaigned to become the Republican Party's nominee in the 1988 presidential election. As a result of his seeking political office, he no longer serves in an official role for any church. His media and financial resources make him a recognized, influential, and controversial public voice for conservative Christianity in the United States.\n^ a b c \"Official biography\". Retrieved 2007-03-31. \n^ \"About Us\". Christian Coalition. Archived from the original on March 8, 2007. Retrieved 2007-03-31. \n^ Sherrard, Brooke . \"Review of: David John Marley, Pat Robertson: An American Life\". The Journal of Southern Religion. Retrieved 17 November 2014. \n^ New York Times: Pat Robertson: A Candidate of Contradictions. February 27, 1988.\n^ OurCampaigns: 1988 Republican Primary results. February 01, 1988\n^ David John Marley. Pat Robertson: An American Life. ISBN 978-0-7425-5295-1", "title": "Pat Robertson"}