{"summary": "Paul Anthony Samuelson  was an American economist.", "full_text": "Paul Anthony Samuelson  was an American economist, and the first American to win the Nobel Memorial Prize in Economic Sciences. The Swedish Royal Academies stated, when awarding the prize, that he \"has done more than any other contemporary economist to raise the level of scientific analysis in economic theory\". Economic historian Randall E. Parker calls him the \"Father of Modern Economics\", and The New York Times considered him to be the \"foremost academic economist of the 20th century\".\nSamuelson was likely the most influential economist of the later 20th century. He was author of the best-selling economics textbook of all time: Economics: An Introductory Analysis, first published in 1948. It was the second American textbook to explain the principles of Keynesian economics and how to think about economics, and the first one to be successful, and is now in its 19th edition, having sold nearly 4 million copies in 40 languages. James Poterba, former head of MIT's Department of Economics, noted that by his book, Samuelson \"leaves an immense legacy, as a researcher and a teacher, as one of the giants on whose shoulders every contemporary economist stands\". In 1996, when he was awarded the National Medal of Science, considered America's top science honor, President Bill Clinton commended Samuelson for his \"fundamental contributions to economic science\" for over 60 years.\nHe entered the University of Chicago at age 16, during the depths of the Great Depression, and received his PhD in economics from Harvard. After graduating, he became an assistant professor of economics at Massachusetts Institute of Technology  when he was 25 years of age and a full professor at age 32. In 1966, he was named Institute Professor, MIT's highest faculty honor. He spent his career at MIT where he was instrumental in turning its Department of Economics into a world-renowned institution by attracting other noted economists to join the faculty, including Robert M. Solow, Franco Modigliani, Robert C. Merton, Joseph E. Stiglitz, and Paul Krugman, all of whom went on to win Nobel Prizes.\nHe served as an advisor to Presidents John F. Kennedy and Lyndon B. Johnson, and was a consultant to the United States Treasury, the Bureau of the Budget and the President's Council of Economic Advisers. Samuelson wrote a weekly column for Newsweek magazine along with Chicago School economist Milton Friedman, where they represented opposing sides: Samuelson took the Keynesian perspective but adapted it accepting what he felt was good. By contrast Friedman represented the Monetarist perspective. Samuelson died on December 13, 2009, at the age of 94.\n^ a b c d Frost, Greg . \"Nobel-winning economist Paul A. Samuelson dies at age 94\". MIT News.  \"In a career that spanned seven decades, he transformed his field, influenced millions of students and turned MIT into an economics powerhouse\"\n^ Parker, Randall E. , Reflections on the Great Depression, Cheltenham: Edward Elgar, p. 25, ISBN 1-84376-335-4 \n^ Weinstein, Michael M. . \"Paul A. Samuelson, Economist, Dies at 94\". New York Times. \n^ a b Paul Samuelson\n^ Skousken, Mark, The Perseverance of Paul Samuelson's Economics  \n^ Samuelson's text was preceded by the 1947 The Elements of Economics by Lorie Tarshis, which did not ultimately prove successful; see discussion.\n^ Szenberg, Michael; Gottesman, Aron A.; Ramrattan, lall , Paul Samuelson: On Being an Economist, New York: Jorge Pinto Books, p. 18, ISBN 0-9742615-3-X", "title": "Paul Samuelson"}