{"summary": "The periodic table of the chemical elements is a list of known atoms.", "full_text": "The periodic table is a tabular arrangement of the chemical elements, ordered by their atomic number , electron configurations, and recurring chemical properties. The table also shows four rectangular blocks: s-, p- d- and f-block. In general, within one row  the elements are metals on the lefthand side, and non-metals on the righthand side.\nThe rows of the table are called periods; the columns are called groups. Six groups  have names as well as numbers: for example, group 17 elements are the halogens; and group 18, the noble gases. The periodic table can be used to derive relationships between the properties of the elements, and predict the properties of new elements yet to be discovered or synthesized. The periodic table provides a useful framework for analyzing chemical behavior, and is widely used in chemistry and other sciences.\nAlthough precursors exist, Dmitri Mendeleev is generally credited with the publication, in 1869, of the first widely recognized periodic table. He developed his table to illustrate periodic trends in the properties of the then-known elements. Mendeleev also predicted some properties of then-unknown elements that would be expected to fill gaps in this table. Most of his predictions were proved correct when the elements in question were subsequently discovered. Mendeleev's periodic table has since been expanded and refined with the discovery or synthesis of further new elements and the development of new theoretical models to explain chemical behavior.\nAll elements from atomic numbers 1  to 118  have been discovered or reportedly synthesized, with elements 113, 115, 117, and 118 having yet to be confirmed. The first 94 elements exist naturally, although some are found only in trace amounts and were synthesized in laboratories before being found in nature. Elements with atomic numbers from 95 to 118 have only been synthesized in laboratories. It has been shown that elements 95 to 100 once occurred in nature but currently do not. Synthesis of elements having higher atomic numbers is being pursued. Numerous synthetic radionuclides of naturally occurring elements have also been produced in laboratories.", "title": "Periodic table"}