{"summary": "The perihelion is the point in the orbit of a planet, asteroid or comet where it is nearest to the sun.", "full_text": "The perihelion is the point in the orbit of a planet, minor planet, or comet, where it is nearest to the Sun. It is the opposite of aphelion, which is the point in the orbit where the celestial body is farthest from the Sun.\nThe word perihelion stems from the Ancient Greek words \"peri\", meaning near, and \"helios\", meaning the Sun. Aphelion derives from the preposition apo, meaning away, off, apart. \nAccording to Kepler's First Law of Planetary Motion, all planets, comets and asteroids in our solar system have approximately elliptical orbits.  Thus, they all have a closest and a farthest point from the Sun: a perihelion and an aphelion, known collectively as apsides. Orbital eccentricity measures the flatness  of the orbit.\nEarth comes closest to the Sun every year around January 3. It is farthest from the Sun every year around July 4. \nWhen Earth is closest to the Sun, it is winter in the northern hemisphere and summer in the southern hemisphere. Thus Earth's distance from the Sun does not significantly affect what season occurs. Instead, Earth's seasons come and go because Earth does not rotate with its axis exactly upright with respect to the plane of its orbit around the Sun. Earth's axial tilt is 23.4 degrees. This puts the Sun farther south in December and January, so the north has winter and the south has summer. Thus winter falls on that part of the globe where sunlight strikes least directly, and summer falls where sunlight strikes most directly, regardless of the Earth's distance from the Sun.\nThe difference in distance between Earth's nearest point to the Sun in January and farthest point from the Sun in July is about 5 million kilometers . Earth is about 147.1 million kilometers  from the Sun at perihelion in early January, in contrast to about 152.1 million kilometers  at aphelion in early July. Because of the increased distance at aphelion, only 93.55% of the solar radiation from the Sun falls on a given square area of land than at perihelion. As winter also falls in the southern hemisphere at the same time as aphelion, this decrease in solar radiation due to the aphelion plus shorter periods of daylight causes, in general, less heat from the Sun to hit the southern hemisphere in winter than solar radiation hitting the northern hemisphere during its winter at perihelion six months later.", "title": "Perihelion"}