{"summary": "The 1991 Gulf War, or Persian Gulf War, was a conflict between Iraq and 34 other countries, led by the United States.", "full_text": "The Gulf War , codenamed Operation Desert Shield  for operations leading to the buildup of troops and defense of Saudi Arabia and Operation Desert Storm  in its combat phase, was a war - in the Persian Gulf region - waged by coalition forces from 34 nations led by the United States against Iraq in response to Iraq's invasion and annexation of Kuwait.\nThe war is also known under other names, such as the Persian Gulf War, First Gulf War, Gulf War I, Kuwait War, First Iraq War, or Iraq War before the term \"Iraq War\" became identified instead with the 2003 Iraq War . The Iraqi Army's occupation of Kuwait that began 2 August 1990 was met with international condemnation, and brought immediate economic sanctions against Iraq by members of the U.N. Security Council. U.S. President George H. W. Bush deployed U.S. forces into Saudi Arabia and urged other countries to send their own forces to the scene. An array of nations joined the Coalition, the largest military alliance since World War II. The great majority of the Coalition's military forces were from the U.S., with Saudi Arabia, the United Kingdom and Egypt as leading contributors, in that order. Saudi Arabia paid around US$36 billion of the US$60 billion cost.\nThe war was marked by the introduction of live news broadcasts from the front lines of the battle, principally by the U.S. network CNN. The war has also earned the nickname Video Game War after the daily broadcast of images from cameras on board U.S. bombers during Operation Desert Storm.\nThe initial conflict to expel Iraqi troops from Kuwait began with an aerial and naval bombardment on 17 January 1991, continuing for five weeks. This was followed by a ground assault on 24 February. This was a decisive victory for the Coalition forces, who drove the Iraqi military from Kuwait and advanced into Iraqi territory. The Coalition ceased its advance and declared a cease-fire 100 hours after the ground campaign started. Aerial and ground combat was confined to Iraq, Kuwait, and areas on Saudi Arabia's border. Iraq launched Scud missiles against Coalition military targets in Saudi Arabia and against Israel.", "title": "Persian Gulf War"}