{"summary": "There is also the movie Philadelphia .", "full_text": "Philadelphia  is the largest city in the Commonwealth of Pennsylvania and the fifth-most-populous in the United States. In the Northeastern United States, at the confluence of the Delaware and Schuylkill River, Philadelphia is the economic and cultural center of the Delaware Valley, and is the only World Heritage City in the United States. The estimated population in 2014 was 1,560,297.\nIn 1682, William Penn founded the city to serve as capital of the Pennsylvania Colony. Philadelphia played an instrumental role in the American Revolution as a meeting place for the Founding Fathers of the United States, who signed the Declaration of Independence in 1776 and the Constitution in 1787. Philadelphia was one of the nation's capitals in the Revolutionary War, and served as temporary U.S. capital while Washington, D.C., was under construction. In the 19th century, Philadelphia became a major industrial center and railroad hub that grew from an influx of European immigrants. It became a prime destination for African-Americans in the Great Migration and surpassed two million occupants by 1950. Based on the similar shifts underway the nation's economy after 1960, Philadelphia experienced a loss of manufacturing companies and/or jobs to lower taxed regions of the USA and often overseas. As a result, the economic base of Philadelphia, which had historically been manufacturing, declined significantly. In addition, consolidation in several American industries  reduced the number of companies headquartered in Philadelphia. The economic impact of these changes would reduce Philadelphia's tax base and the resources of local government. Philadelphia struggled through a long period of adjustment to these economic changes, coupled with significant demographic change as wealthier residents moved into the nearby suburbs and more immigrants moved into the city. The city in fact approached bankruptcy in the late 1980s. Revitalization began in the 1990s, with gentrification turning around many neighborhoods and reversing its decades-long trend of population loss.\nThe area's many universities and colleges make Philadelphia a top international study destination, as the city has evolved into an educational and economic hub. With a gross domestic product of $388 billion, Philadelphia ranks ninth among world cities and fourth in the nation. Philadelphia is the center of economic activity in Pennsylvania and is home to seven Fortune 1000 companies. The Philadelphia skyline is growing, with several nationally prominent skyscrapers. The city is known for its arts, culture, and history, attracting over 39 million domestic tourists in 2013. Philadelphia has more outdoor sculptures and murals than any other American city, and Fairmount Park is the largest landscaped urban park in the world. The 67 National Historic Landmarks in the city helped account for the $10 billion generated by tourism. Philadelphia is the birthplace of the United States Marine Corps, and is also the home of many U.S. firsts, including the first library , first hospital  and medical school , first Capitol , first stock exchange , first zoo , and first business school .", "title": "Philadelphia"}