{"summary": "The Phoney War was a name of months after Poland was defeated in September 1939 and before France was invaded in May 1940, during World War II.", "full_text": "The Phoney War refers to the relatively quiet eight-month period at the start of World War II between the declaration of war by the Western Allies  against Nazi Germany on 3 September 1939 just after the Invasion of Poland and the German Blitzkrieg in May 1940, that was marked by a lack of major military land operations by the Allies on Germany's Western Front.\nEven though Poland was overrun in about five weeks in the German and Soviet Invasion of Poland beginning on 1 September 1939, the Western Allies did nothing: this was the start of the Phoney War . War had been declared by each side, but no Western power committed to launching a significant land offensive, notwithstanding the terms of the Anglo-Polish and Franco-Polish military alliances which obliged the United Kingdom and France to assist Poland.\nThe quiet of the Phoney War was punctuated by a few actions by the Allies. In the Saar Offensive in September, the French attacked Germany with the intention of assisting Poland, but this fizzled within days and they withdrew. In November, the Soviets attacked Finland in the Winter War, resulting in much debate in France and Britain about an offensive to help Finland, but the forces finally assembled for this campaign were delayed until the Winter War ended in March. The Allied discussions about a Scandinavian campaign caused concern in Germany and resulted in the German invasion of Denmark and Norway in April, and the Allied troops previously assembled for Finland were redirected to Norway instead. Fighting there continued until June when the Allies evacuated, ceding Norway to Germany in response to the German invasion of France.\nOn the other side, the Germans launched attacks at sea in the fall and winter against several British aircraft carriers and destroyers, sinking several including the carrier HMS Courageous with the loss of 518 lives. Action in the air began on 16 October 1939 when the Luftwaffe launched air raids on British warships. There were various minor bombing raids and reconnaissance flights on both sides.", "title": "Phoney War"}