{"summary": "For the Lady Gaga song, see Telephone .", "full_text": "A telephone, or phone, is a telecommunications device that permits two or more users to conduct a conversation when they are too far apart to be heard directly. A telephone converts sound, typically and most efficiently the human voice, into electronic signals suitable for transmission via cables or other transmission media over long distances, and replays such signals simultaneously in audible form to its user.\nIn 1876, Scottish emigrant Alexander Graham Bell was the first to be granted a United States patent for a device that produced clearly intelligible replication of the human voice. This instrument was further developed by many others. The telephone was the first device in history that enabled people to talk directly with each other across large distances. Telephones rapidly became indispensable to businesses, government, and households, and are today some of the most widely used small appliances.\nThe essential elements of a telephone are a microphone  to speak into and an earphone  which reproduces the voice in a distant location. In addition, most telephones contain a ringer which produces a sound to announce an incoming telephone call, and a dial or keypad used to enter a telephone number when initiating a call to another telephone. Until approximately the 1970s most telephones used a rotary dial, which was superseded by the modern DTMF push-button dial, first introduced to the public by AT&T in 1963. The receiver and transmitter are usually built into a handset which is held up to the ear and mouth during conversation. The dial may be located either on the handset, or on a base unit to which the handset is connected. The transmitter converts the sound waves to electrical signals which are sent through the telephone network to the receiving phone. The receiving telephone converts the signals into audible sound in the receiver, or sometimes a loudspeaker. Telephones permit duplex communication, meaning they allow the people on both ends to talk simultaneously.\nThe first telephones were directly connected to each other from one customer's office or residence to another customer's location. Being impractical beyond just a few customers, these systems were quickly replaced by manually operated centrally located switchboards. This gave rise to landline telephone service in which each telephone is connected by a pair of dedicated wires to a local central office switching system, which developed into fully automated systems starting in the early 1900s. As greater mobility was desired for commerce and convenience, various radio systems were developed for transmission between mobile customer stations on ships and automobiles from the 1930s by the mid-1900s. Radio systems evolved into various cellular topologies until the first hand-held mobile phone was introduced for personal service starting in 1973 by Motorola. By the late 1970s several mobile telephone networks operated around the world. In 1983, the Advanced Mobile Phone System  was launched in the U.S. and in other countries soon after, and offered a standardized technology providing portability for user's within a region far beyond the personal residence or office location. These analog cellular system evolved into digital networks with better security, greater capacity, better regional coverage, and lower cost. The public switched telephone network, with its hierarchical system of many switching centers, interconnects telephones around the world for communication with each other. With the standardized international numbering system, E.164, each telephone line has an identifying telephone number, that may be called from any authorized telephone on the network.\nAlthough originally designed for simple voice communications, convergence has enabled most modern cell phones to have many additional capabilities. They may be able to record spoken messages, send and receive text messages, take and display photographs or video, play music or games, surf the Internet, do road navigation or immerse the user in virtual reality. Since 1999, the trend for mobile phones is smartphones that integrate all mobile communication and computing needs.", "title": "Phone"}