{"summary": "The quantum state of something is a mathematical tool that describes everything that can be physically measured about that thing.", "full_text": "In physics, physical information refers generally to the information that is contained in a physical system. Its usage in quantum mechanics  is important, for example in the concept of quantum entanglement to describe effectively direct or causal relationships between apparently distinct or spatially separated particles.\nInformation itself may be loosely defined as \"that which can distinguish one thing from another\". The information embodied by a thing can thus be said to be the identity of the particular thing itself, that is, all of its properties, all that makes it distinct from other  things. It is a complete description of the thing, but in a sense that is divorced from any particular language.\nWhen clarifying the subject of information, care should be taken to distinguish between the following specific cases:\nThe phrase instance of information refers to the specific instantiation of information  that is associated with the being of a particular example of a thing. \nA holder of information is a variable or mutable instance that can have different forms at different times .\nA piece of information is a particular fact about a thing's identity or properties, i.e., a portion of its instance.\nA pattern of information  is the pattern or content of an instance or piece of information. Many separate pieces of information may share the same form. We can say that those pieces are perfectly correlated or say that they are copies of each other, as in copies of a book.\nAn embodiment of information is the thing whose essence is a given instance of information.\nA representation of information is an encoding of some pattern of information within some other pattern or instance.\nAn interpretation of information is a decoding of a pattern of information as being a representation of another specific pattern or fact.\nA subject of information is the thing that is identified or described by a given instance or piece of information. \nAn amount of information is a quantification of how large a given instance, piece, or pattern of information is, or how much of a given system's information content  has a given attribute, such as being known or unknown. Amounts of information are most naturally characterized in logarithmic units.\nThe above usages are clearly all conceptually distinct from each other. However, many people insist on overloading the word \"information\"  to denote  several of these concepts simultaneously. ", "title": "Physical information"}