{"summary": "In physics, a physical body  is a collection of masses, when you look at them as one object only.", "full_text": "In physics, a physical body or physical object  is an identifiable collection of matter, which may be more or less constrained to move together by translation or rotation, in 3-dimensional space.\nIn common usage an object is a collection of matter within a defined contiguous boundary in 3-dimensional space. The boundary must be defined and identified by the properties of the material. The boundary may change over time. The boundary is usually the visible or tangible surface of the object. The matter in the object is constrained  to move as one object. The boundary may move in space relative to other objects that it is not attached to . An objects boundary may also deform and change over time in other ways.\nAlso in common usage an object is not constrained to consist of the same collection of matter. Atoms or parts of an object may change over time. An object is defined by the simplest representation of the boundary consistent with the observations. However the laws of Physics only apply directly to objects that consist of the same collection of matter.\nEach object has a unique identity, independent of any other properties. Two objects may be identical, in all properties except position, but still remain distinguishable. In most cases the boundaries of two objects may not overlap at any point in time. The property of identity allows objects to be counted.\nExamples of models of physical bodies include, but are not limited to a particle, several interacting smaller bodies , and continuous media.\nThe common conception of physical objects includes that they have extension in the physical world, although there do exist theories of quantum physics and cosmology which may challenge this. In modern physics, \"extension\" is understood in terms of the spacetime: roughly speaking, it means that for a given moment of time the body has some location in the space, although not necessarily a point. A physical body as a whole is assumed to have such quantitative properties as mass, momentum, electric charge, other conserving quantities, and possibly other quantities.\nA body with known composition and described in an adequate physical theory is an example of physical system.", "title": "Physical body"}