{"summary": "Joseph Philippe Pierre Yves Elliott Trudeau,PC, CC, CH, QC, MSRC,  was the 15th Canadian Prime Minister during the 1970s , and then again from 1980 - 1984. He is thought by many Canadian citizens today as having been the greatest Canadian Prime Minister ever.", "full_text": "Joseph Philippe Pierre Yves Elliott Trudeau PC CC CH QC FRSC , usually known as Pierre Trudeau or Pierre Elliott Trudeau, was a Canadian politician who served as the 15th Prime Minister of Canada from April 20, 1968, to June 4, 1979, and again from March 3, 1980, to June 30, 1984.\nTrudeau began his political career as a lawyer, intellectual, and activist in Quebec politics. In the 1960s he entered federal politics by joining the Liberal Party of Canada. He was appointed as Lester B. Pearson's Parliamentary Secretary and later became his Minister of Justice. Trudeau became a media sensation, inspiring \"Trudeaumania\", and took charge of the Liberals in 1968. From the late 1960s until the mid-1980s, his personality dominated the political scene to an extent never before seen in Canadian political life, arousing passionate and polarizing reactions throughout Canada. \"Reason before passion\" was his personal motto. He retired from politics in 1984, and John Turner succeeded him as Prime Minister. His eldest son, Justin Trudeau, is currently serving as the 23rd Prime Minister as a result of the 2015 federal election.This led him to become the First Prime Minister to have a relative who became Prime Minister.\nAdmirers praise the force of Trudeau's intellect and salute his political acumen in preserving national unity against the Quebec sovereignty movement, suppressing a violent revolt, fostering a pan-Canadian identity, and in achieving sweeping institutional reform, including the implementation of official bilingualism, patriation of the Constitution, and the establishment of the Charter of Rights and Freedoms. Critics accuse him of arrogance, of economic mismanagement, and of unduly centralizing Canadian decision-making to the detriment of Quebec's culture and the economy of the Prairies. While public opinion of him remains divided, scholars consistently rank him as one of the greatest Canadian prime ministers and even regard Trudeau as the \"father of modern Canada.\"", "title": "Pierre Trudeau"}