{"summary": "Pittsburgh, previously known as Pittsburg, is a city in the American state of Pennsylvania.", "full_text": "Pittsburgh  is the second-largest city in the Commonwealth of Pennsylvania with a population of 305,842 and the county seat of Allegheny County. Only Philadelphia is larger. The Combined Statistical Area  population of 2,659,937 is the largest in both the Ohio Valley and Appalachia and the 20th-largest in the U.S. Pittsburgh is known as both \"the Steel City\" for its more than 300 steel-related businesses, as well as \"the City of Bridges\" for its 446 bridges. The city features 30 skyscrapers, 2 inclines, a pre-revolutionary fortification and the source of the Ohio River at the confluence of the Monongahela and Allegheny rivers. This vital link of the Atlantic coast and Midwest through the mineral-rich Alleghenies made the area coveted by the French and British Empires, Virginia, Whiskey Rebels, Civil War raiders and media networks.\nAside from steel, Pittsburgh has led in aluminum, glass, shipbuilding, petroleum, foods, sports, transportation, computing, autos, and electronics. For much of the 20th century, Pittsburgh was behind only New York and Chicago in corporate headquarters employment, second to New York in bank assets and with the most U.S. stockholders per capita. America's 1980s deindustrialization laid off area blue-collar workers and thousands of downtown white-collar workers when the longtime Pittsburgh-based world headquarters of Gulf Oil, Sunbeam, Rockwell and Westinghouse moved. This heritage left the area with renowned museums, medical centers, parks, research centers, libraries, a diverse cultural district and the most bars per capita in the U.S. In 2015, Pittsburgh was named on a list of the \"eleven most livable cities in the world.\"\nGoogle, Apple, Bosch, Disney, Uber, Intel and IBM are among 1,600 technology firms generating $20.7 billion in annual Pittsburgh payrolls, with the area serving as the long-time federal agency headquarters for cyber defense, software engineering, robotics, energy research and the nuclear navy. The area is home to 68 colleges and universities including research and development leaders Carnegie Mellon University and the University of Pittsburgh. The nation's fifth-largest bank, eight Fortune 500 companies, and six of the top 300 US law firms make their global headquarters in the Pittsburgh area, while RAND, BNY Mellon, Nova, FedEx, Bayer and NIOSH have regional bases that helped Pittsburgh become the sixth-best area for U.S. job growth.\nThe region is a hub for both Leadership in Energy and Environmental Design, sustainable energy, and energy extraction.", "title": "Pittsburgh"}