{"summary": "A plastic is a material that can change its shape, so many things can be made of plastic.", "full_text": "Plastic is a material consisting of any of a wide range of synthetic or semi-synthetic organics that are malleable and can be molded into solid objects of diverse shapes. Plastics are typically organic polymers of high molecular mass, but they often contain other substances. They are usually synthetic, most commonly derived from petrochemicals, but many are partially natural. Plasticity is the general property of all materials that are able to irreversibly deform without breaking, but this occurs to such a degree with this class of moldable polymers that their name is an emphasis on this ability.\nDue to their relatively low cost, ease of manufacture, versatility, and imperviousness to water, plastics are used in an enormous and expanding range of products, from paper clips to spaceships. They have already displaced many traditional materials, such as wood, stone, horn and bone, leather, paper, metal, glass, and ceramic, in most of their former uses. In developed countries, about a third of plastic is used in packaging and another third in buildings such as piping used in plumbing or vinyl siding. Other uses include automobiles , furniture, and toys. In the developing world, the ratios may be different - for example, reportedly 42% of India's consumption is used in packaging. Plastics have many uses in the medical field as well, to include polymer implants, however the field of plastic surgery is not named for use of plastic material, but rather the more generic meaning of the word plasticity in regards to the reshaping of flesh.\nThe world's first fully synthetic plastic was bakelite, invented in New York in 1907 by Leo Baekeland who coined the term 'plastics'. Many chemists contributed to the materials science of plastics, including Nobel laureate Hermann Staudinger who has been called \"the father of polymer chemistry\" and Herman Mark, known as \"the father of polymer physics\". The success and dominance of plastics starting in the early 20th century led to environmental concerns regarding its slow decomposition rate after being discarded as trash due to its composition of very large molecules. Toward the end of the century, one approach to this problem was met with wide efforts toward recycling.", "title": "Plastics"}