{"summary": "Plate tectonics  is a theory of geology.", "full_text": "Plate tectonics  is a scientific theory that describes the large-scale motion of Earth's lithosphere. This theoretical model builds on the concept of continental drift which was developed during the first few decades of the 20th century. The geoscientific community accepted plate-tectonic theory after seafloor spreading was validated in the late 1950s and early 1960s.\nThe lithosphere, which is the rigid outermost shell of a planet , is broken up into tectonic plates. The Earth's lithosphere is composed of seven or eight major plates  and many minor plates. Where the plates meet, their relative motion determines the type of boundary: convergent, divergent, or transform. Earthquakes, volcanic activity, mountain-building, and oceanic trench formation occur along these plate boundaries. The lateral relative movement of the plates typically ranges from zero to 100 mm annually.\nTectonic plates are composed of oceanic lithosphere and thicker continental lithosphere, each topped by its own kind of crust. Along convergent boundaries, subduction carries plates into the mantle; the material lost is roughly balanced by the formation of new  crust along divergent margins by seafloor spreading. In this way, the total surface of the globe remains the same. This prediction of plate tectonics is also referred to as the conveyor belt principle. Earlier theories  propose gradual shrinking  or gradual expansion of the globe.\nTectonic plates are able to move because the Earth's lithosphere has greater strength than the underlying asthenosphere. Lateral density variations in the mantle result in convection. Plate movement is thought to be driven by a combination of the motion of the seafloor away from the spreading ridge  and drag, with downward suction, at the subduction zones. Another explanation lies in the different forces generated by tidal forces of the Sun and Moon. The relative importance of each of these factors and their relationship to each other is unclear, and still the subject of much debate.", "title": "Plate tectonics"}