{"summary": "Poker is a game which people play with a normal set  of 52 cards.", "full_text": "Poker is a family of gambling card games. All poker variants involve betting as an intrinsic part of play, and determine the winner of each hand according to the combinations of players' cards, at least some of which remain hidden until the end of the hand. Poker games vary in the number of cards dealt, the number of shared or \"community\" cards, the number of cards that remain hidden, and the betting procedures.\nIn most modern poker games, the first round of betting begins with one or more of the players making some form of a forced bet . In standard poker, each player bets according to the rank he believes his hand is worth as compared to the other players. The action then proceeds clockwise as each player in turn must either match, or \"call\", the maximum previous bet or fold, losing the amount bet so far and all further interest in the hand. A player who matches a bet may also \"raise\", or increase the bet. The betting round ends when all players have either matched the last bet or folded. If all but one player folds on any round, the remaining player collects the pot without being required to reveal their hand. If more than one player remains in contention after the final betting round, the hands are revealed, and the player with the winning hand takes the pot.\nWith the exception of initial forced bets, money is only placed into the pot voluntarily by a player who either believes the bet has positive expected value or who is trying to bluff other players for various strategic reasons. Thus, while the outcome of any particular hand significantly involves chance, the long-run expectations of the players are determined by their actions chosen on the basis of probability, psychology, and game theory.\nPoker has gained in popularity since the beginning of the twentieth century and has gone from being primarily a recreational activity confined to small groups of enthusiasts to a widely popular activity, both for participants and spectators, including online, with many professional players and multimillion-dollar tournament prizes.", "title": "Poker"}