{"summary": "Poliomyelitis or polio is a virus that causes a serious disease.", "full_text": "Poliomyelitis, often called polio or infantile paralysis, is an infectious disease caused by the poliovirus. In about 0.5% of cases there is muscle weakness resulting in an inability to move. This can occur over a few hours to few days. The weakness most often involves the legs but may less commonly involve the muscles of the head, neck and diaphragm. Many but not all people fully recover. In those with muscle weakness about 2% to 5% of children and 15% to 30% of adults die. Another 25% of people have minor symptoms such as fever and a sore throat and up to 5% have headache, neck stiffness and pains in the arms and legs. These people are usually back to normal within one or two weeks. In up to 70% of infections there are no symptoms. Years after recovery post-polio syndrome may occur, with a slow development of muscle weakness similar to what the person had during the initial infection.\nPoliovirus is usually spread from person to person through infected feces entering the mouth. It may also be spread by food or water containing human feces and less commonly from infected saliva. Those who are infected may spread the disease for up to six weeks even if no symptoms are present. The disease may be diagnosed by finding the virus in the feces or detecting antibodies against it in the blood.\nThe disease is preventable with the polio vaccine; however, a number of doses are required for it to be effective. The United States Center for Disease Control recommends polio vaccination boosters for travelers and those who live in countries where the disease is occurring. Once infected there is no specific treatment. In 2013 polio affected 416 people down from 350,000 cases in 1988. In 2014 the disease was only spreading between people in Afghanistan, Nigeria, and Pakistan. In 2015 Nigeria had stopped the spread of wild poliovirus.\nPoliomyelitis has existed for thousands of years, with depictions of the disease in ancient art. The disease was first recognized as a distinct condition by Michael Underwood in 1789 and the virus that causes it was first identified in 1908 by Karl Landsteiner. Major outbreaks started to occur in the late 19th century in Europe and the United States. In the 20th century it became one of the most worrying childhood diseases in these areas. The first polio vaccine was developed in the 1950s by Jonas Salk. It is hoped that vaccination efforts and early detection of cases will result in global eradication of the disease by 2018. In 2013; however, there were reports of new cases in Syria and in May 2014, the World Health Organization declared a public health emergency of international concern due to outbreaks of the disease in Asia, Africa and the Middle East. The disease does not naturally occur in any other animals.", "title": "Polio"}