{"summary": "Political science is a branch of social science that is concerned with theory, description, analysis and prediction of political behavior, political systems and politics.", "full_text": "Political science is a social science discipline that deals with systems of government and the analysis of political activity and political behavior. It deals extensively with the theory and practice of politics which is commonly thought of as the determining of the distribution of power and resources. Political scientists \"see themselves engaged in revealing the relationships underlying political events and conditions, and from these revelations they attempt to construct general principles about the way the world of politics works.\"\nPolitical science draws upon the fields of economics, law, sociology, history, anthropology, public administration, public policy, national politics, international relations, comparative politics, psychology, political organization, and political theory.\nAlthough it was codified in the 19th century, when all the social sciences were established, the study of political science has ancient roots that can be traced back to the works of Chanakya, Plato and Aristotle which were written nearly 2,500 years ago. Political science is commonly divided into distinct sub-disciplines which together constitute the field:\nComparative politics\nInternational relations\nPolitical theory\nPublic administration\nPublic law\nPolitical methodology\nPolitical theory is more concerned with contributions of various classical thinkers such as Chanakya, Aristotle, Machiavelli, Cicero, Plato and many others.\nComparative politics is the science of comparison and teaching of different types of constitutions, political actors, legislature and associated fields, all of them from an intrastate perspective.\nInternational relations deals with the interaction between nation-states as well as intergovernmental and transnational organizations.\nPolitical science is methodologically diverse and appropriates many methods originating in social research. Approaches include positivism, interpretivism, rational choice theory, behavioralism, structuralism, post-structuralism, realism, institutionalism, and pluralism. Political science, as one of the social sciences, uses methods and techniques that relate to the kinds of inquiries sought: primary sources such as historical documents and official records, secondary sources such as scholarly journal articles, survey research, statistical analysis, case studies, experimental research and model building.", "title": "Political science"}