{"summary": "The United States is a federal constitutional republic, in which the President of the United States , Congress, and judiciary share powers reserved to the national government, and the federal government shares sovereignty with the state governments.", "full_text": "The United States is a federal constitutional republic, in which the President of the United States , Congress, and judiciary share powers reserved to the national government, and the federal government shares sovereignty with the state governments.\nThe executive branch is headed by the President and is independent of both the legislature and the judiciary. Legislative power is vested in the two chambers of Congress, the Senate and the House of Representatives. The judicial branch , composed of the Supreme Court and lower federal courts, exercises judicial power . The judiciary's function is to interpret the United States Constitution and federal laws and regulations. This includes resolving disputes between the executive and legislative branches. The federal government's layout is explained in the Constitution. Two political parties, the Democratic Party and the Republican Party, have dominated American politics since the American Civil War, although there are also smaller parties like the Libertarian Party, the Green Party, and the Constitution Party.\nThere are major differences between the political system of the United States and that of most other developed democracies. These include greater power in the upper house of the legislature, a wider scope of power held by the Supreme Court, the separation of powers between the legislature and the executive, and the dominance of only two main parties. Third parties have less political influence in the United States than in other developed country democracies; this is because of a combination of stringent historic controls. These controls take shape in the form of state and federal laws, informal media prohibitions, and winner-take-all elections, and include ballot access issues and exclusive debate rules.\nThe federal entity created by the U.S. Constitution is the dominant feature of the American governmental system. However, most people are also subject to a state government, and all are subject to various units of local government. The latter include counties, municipalities, and special districts.\nThis multiplicity of jurisdictions reflects the country's history. The federal government was created by the states, which as colonies were established separately and governed themselves independently of the others. Units of local government were created by the colonies to efficiently carry out various state functions. As the country expanded, it admitted new states modeled on the existing ones.", "title": "Politics of the United States"}