{"summary": "An American state is one of the states of the United States of America.", "full_text": "Political divisions of the United States or Administrative divisions of the United States are the various governing entities that together form the United States. The first subdivision of the United States is the state. The admission of states into the United States, beyond the original thirteen states, is authorized under Article IV, Section 3, of the Constitution of the United States. Most of the states admitted to the union after the original 13 have been formed within territories of the United States  that were organized by an act or resolution of the United States Congress, subject to the Congress' plenary powers under the territorial clause of Article IV, sec. 3, of the U.S. Constitution.\nWhile state governments within the United States may enact their own laws and prosecute crimes pursuant thereto, they are not sovereign in the Westphalian sense in international law which says that each State has sovereignty over its territory and domestic affairs, to the exclusion of all external powers, on the principle of non-interference in another State's domestic affairs, and that each State  is equal in international law. Additionally, the member states of the United States do not possess international legal sovereignty, meaning that they are not recognized by other sovereign States such as, for example, France, Germany or the United Kingdom, nor do they possess full interdependence sovereignty, meaning that they cannot control movement of persons across state borders.\nMember states of the United States are then typically subdivided into counties. Louisiana uses the term parish and Alaska uses the term borough for what the Census terms county-equivalents in those states.\nTerritories, except the Minor Outlying Islands, are subdivided into municipalities. Guam uses the term Village and the U.S. Virgin Islands uses the term Districts, American Samoa uses the terms district and Unorganized atolls.\nWhile not explicitly part of the U.S.'s political divisional makeup, as Associated States, the Federated States of Micronesia and Palau are divided into states . The Marshall Islands is divided into atolls and islands. While Micronesia is a federation, Palau and the Marshall Islands are both unitary states.\nEach Indian Reservation is subdivided in various ways. For example, the Navajo Nation is subdivided into agencies and Chapter houses. While the Blackfeet Nation is subdivided into Communities.\nCounties and county equivalents may be further subdivided into townships. Towns in New York and New England are treated as equivalents to townships by the United States Census Bureau. Towns or townships are used as subdivisions of a county in 20 states, mostly in the Northeast and Midwest.\nPopulation centers may be organized into incorporated cities, towns, villages, and other types of municipalities. Municipalities are typically subordinate to a county government, with some exceptions. Certain cities, for example, have consolidated with their county government as consolidated city-counties. In Virginia, cities are completely independent from the county in which they would otherwise be a part. In some states, particularly in New England, towns form the primary unit of local government below the state level, in some cases eliminating the need for county government entirely.\nOther divisions include the federal district, insular areas administered by the Federal government, and American Indian reservations. The Federal government also maintains exclusive jurisdiction over military installations and American embassies and consulates located in foreign countries. Other special purpose divisions exist separately from those for general governance, examples of which include conservation districts and Congressional districts.", "title": "Political divisions of the United States"}