{"summary": "The Portland Trail Blazers are a team in the National Basketball Association from Portland, Oregon.", "full_text": "The Portland Trail Blazers, commonly known as the Blazers, are an American professional basketball team based in Portland, Oregon. They play in the Northwest Division of the Western Conference in the National Basketball Association . The Trail Blazers played their home games in the Memorial Coliseum before moving to Moda Center in 1995 . The franchise entered the league in 1970, and Portland has been its only home city. The franchise has enjoyed a strong following; from 1977 through 1995, the team sold out 814 consecutive home games, the longest such streak in American major professional sports at the time, only since surpassed by the Cleveland Indians and the Boston Red Sox. The Trail Blazers have been the only NBA team based in the binational Pacific Northwest, after the Vancouver Grizzlies relocated to Memphis and became the Memphis Grizzlies in 2001, and the Seattle SuperSonics relocated to Oklahoma City and became the Oklahoma City Thunder in 2008.\nThe team has advanced to the NBA Finals three times, winning the NBA Championship once in 1977. Their other NBA Finals appearances were in 1990 and 1992. The team has qualified for the playoffs in 31 seasons of their 45-season existence, including a streak of 21 straight appearances from 1983 through 2003, the second longest streak in NBA history. The Trail Blazers' 31 playoff appearances rank third in the NBA only behind the Los Angeles Lakers and San Antonio Spurs since the team's inception in 1970. Six Hall of Fame players have played for the Trail Blazers . Bill Walton is the franchise's most decorated player; he was the NBA Finals Most Valuable Player in 1977, and the regular season MVP the following year. Four Blazer rookies  have won the NBA Rookie of the Year award. Two Hall of Fame coaches, Lenny Wilkens and Jack Ramsay, have patrolled the sidelines for the Blazers, and two others, Mike Schuler and Mike Dunleavy, have won the NBA Coach of the Year award with the team.", "title": "Portland Trail Blazers"}