{"summary": "Portsmouth is a city in the south of England, in the county of Hampshire.", "full_text": "Portsmouth  is the second largest city in the ceremonial county of Hampshire on the south coast of England. Located mainly on Portsea Island, it is the United Kingdom's only island city. Portsmouth is situated 64 miles  south west of London and 19 miles  south east of Southampton. The city has a population of 205,400 and is the only city in the United Kingdom with a greater population density than London. The City of Portsmouth and Portsmouth Football Club are both nicknamed \"Pompey\".\nAs a significant naval port for centuries, Portsmouth has the world's oldest continuously used dry dock and is home to some famous ships, including HMS Warrior, the Tudor carrack Mary Rose and Lord Nelson's flagship, HMS Victory . By the 19th century, Portsmouth was one of the most fortified cities in the world. During the Second World War, the city served as a pivotal embarkation point for the D-Day landings and was also chosen as the headquarters for the Supreme Allied Commander, Dwight D. Eisenhower. The city was bombed extensively during what was known as the Portsmouth Blitz, which resulted in the deaths of 930 people. Although smaller than in its heyday, the naval base at HMNB Portsmouth remains largest dockyard for the Royal Navy and is home to two-thirds of the entire surface fleet.\nThe waterfront area and Portsmouth Harbour is dominated by the Spinnaker Tower, a 560 feet  landmark which stands as the United Kingdom's eleventh tallest structure as well as the tallest outside London. The former HMS Vernon naval shore establishment has since been redeveloped as an area of retail outlets, restaurants, clubs and bars known as Gunwharf Quays. As well as the naval base, Portsmouth International Port is a commercial cruise ship and ferry port which serves international destinations for freight and passenger traffic. Portsmouth forms part of the South Hampshire built-up area which also covers Southampton, Havant, Waterlooville, Eastleigh, Fareham and Gosport. With approximately 860,000 residents, it is the 6th largest urban area in England and the largest in South East England, forming the centre of one of the United Kingdom's most populous metropolitan areas with a population in excess of one million.", "title": "Portsmouth"}