{"summary": "Pearl S.", "full_text": "The history of postal service of the United States began with the delivery of stampless letters, whose cost was borne by the receiving person, later also encompassed pre-paid letters carried by private mail carriers and provisional post offices, and culminated in a system of universal pre-payment that required all letters to bear nationally issued adhesive postage stamps.\nIn the earliest days, Ship captains arriving in port with stampless mail would advertise in the local newspaper names of those having mail and for them to come collect and pay for it, if not already paid for by the sender. Postal delivery in the United States was a matter of haphazard local organization until after the Revolutionary War, when eventually a national postal system was established. Stampless letters, paid for by the receiver, and private postal systems, were gradually phased out after the introduction of adhesive postage stamps, first issued by the U.S. government post office July 1, 1847 in the denominations of five and ten cents, with the use of stamps made mandatory in 1855.\nThe issue and use of adhesive postage stamps continued during the 19th century primarily for first class mail. Each of these stamps generally bore the face or bust of an American president or another historically important statesman. However, once the Post Office realized during the 1890s that it could increase revenues by selling stamps as \"collectibles,\" it began issuing commemorative stamps, first in connection with important national expositions, later for the anniversaries of significant American historical events. Continued technological innovation subsequently prompted the introduction of special stamps, such as those for use with airmail, zeppelin mail, registered mail, certified mail, and so on. Postage due stamps were issued for some time and were pasted by the post office to letters having insufficient postage with the postage due to be paid to the postal carrier at the receiving address.\nToday, stamps issued by the post office are self-adhesive, and no longer require that the stamps be \"licked\" to dissolve the glue on their back. In many cases, post office clerks now use Postal Value Indicators , which are computer labels, instead of stamps.\nWhere for a century-and-a-half or so, stamps were almost invariably denominated with their values  the United States post office now sells non-denominated \"forever\" stamps for use on first-class and international mail. These stamps are still valid even if there is a rate increase. However, for other uses, adhesive stamps with denomination indicators are still available and sold.", "title": "Postage stamps and postal history of the United States"}