{"summary": "Postage stamps are pieces of paper, with glue or adhesive on the back.", "full_text": "Postage stamp may also refer to a formatting artifact in the display of film or video: Windowbox.\n\nA postage stamp is a small piece of paper that is purchased and displayed on an item of mail as evidence of payment of postage. Typically, stamps are printed on special custom-made paper, show a national designation and a denomination  on the front, and have an adhesive gum on the back or are self-adhesive. Postage stamps are purchased from a postal administration or other authorized vendor, and are used to pay for the costs involved in moving mail, as well as other business necessities such as insurance and registration. They are sometimes a source of net profit to the issuing agency, especially when sold to collectors who will not actually use them for postage.\nStamps are usually rectangular, but triangles or other shapes are occasionally used. The stamp is affixed to an envelope or other postal cover  the customer wishes to send. The item is then processed by the postal system, where a postmark, sometimes known as a cancellation mark, is usually applied in overlapping manner to stamp and cover. This procedure marks the stamp as used to prevent its reuse. In modern usage, postmarks generally indicate the date and point of origin of the mailing. The mailed item is then delivered to the address the customer has applied to the envelope or parcel.\nPostage stamps have facilitated the delivery of mail since the 1840s. Before then, ink and hand-stamps , usually made from wood or cork, were often used to frank the mail and confirm the payment of postage. The first adhesive postage stamp, commonly referred to as the Penny Black, was issued in the United Kingdom in 1840. The invention of the stamp was part of an attempt to reform and improve the postal system in the United Kingdom of Great Britain and Ireland, which, in the early 19th century, was in disarray and rife with corruption. There are varying accounts of the inventor or inventors of the stamp.\nBefore the introduction of postage stamps, mail in the UK was paid for by the recipient, a system that was associated with an irresolvable problem: the costs of delivering mail were not recoverable by the postal service when recipients were unable or unwilling to pay for delivered items, and senders had no incentive to restrict the number, size, or weight of items sent, whether or not they would ultimately be paid for. The postage stamp resolved this issue in a simple and elegant manner, with the additional benefit of room for an element of beauty to be introduced. Concurrently with the first stamps, the UK offered wrappers for mail. Later related inventions include postal stationery such as prepaid-postage envelopes, post cards, lettercards, aerogrammes, postage meters, and, more recently, specialty boxes and envelopes provided free to the customer by the U.S. postal service for priority or express mailing.\nThe postage stamp afforded convenience for both the mailer and postal officials, more effectively recovered costs for the postal service, and ultimately resulted in a better, faster postal system. With the conveniences stamps offered, their use resulted in greatly increased mailings during the 19th and 20th centuries. Postage stamps during this era were the most popular way of paying for mail; however, by the end of the 20th century were rapidly being eclipsed by the use of metered postage and bulk mailing by businesses.\nAs postage stamps with their engraved imagery began to appear on a widespread basis, historians and collectors began to take notice. The study of postage stamps and their use is referred to as philately. Stamp collecting can be both a hobby and a form of historical study and reference, as government-issued postage stamps and their mailing systems have always been involved with the history of nations.", "title": "Postage stamp"}