{"summary": "Potassium is a chemical element in the periodic table.", "full_text": "Potassium is a chemical element with symbol K  and atomic number 19. It was first isolated from potash, the ashes of plants, from which its name is derived. In the Periodic table, potassium is one of seven elements in column  1 : they all have a single valence electron in their outer electron shell, which they readily give up to create an atom with a positive charge - a cation, and combine with anions to form salts. Potassium in nature occurs only in ionic salts. Elemental potassium is a soft silvery-white alkali metal that oxidizes rapidly in air and reacts vigorously with water, generating sufficient heat to ignite hydrogen emitted in the reaction and burning with a lilac flame. It is found dissolved in sea water , and is part of many minerals. Naturally occurring potassium is composed of three isotopes, one of which, 40K, is radioactive. Traces of 40K are found in all potassium, and it is the most common radioisotope in the human body.\nPotassium is chemically very similar to sodium, which is also in column 1 of the Periodic table, and is in row 3, adjacent to potassium in row 4. They have a similar ionization energy, which allows for each atom to give up its sole outer electron. The fact that they are different elements, each combining with the same anions to make similar salts, was suspected in 1702, and was proven in 1807 using electrolysis.\nMost industrial applications of potassium exploit the high solubility in water of potassium compounds, such as potassium soaps. Heavy crop production rapidly depletes soils of potassium, and this depletion is prevented and remedied with agricultural fertilizers containing potassium, which account for 95% of global potassium chemical production.\nPotassium ions are necessary for the function of all living cells. Potassium ion shifts across nerve cell membranes are necessary for normal nerve transmission: potassium depletion or excess can result in numerous abnormalities, including an abnormal heart rhythm and various electrocardiographic  abnormalities. Fresh fruits and vegetables are good dietary sources of potassium. The body responds to the influx of dietary potassium, which raises serum potassium levels, with a shift of potassium from outside to inside cells, and an increase in potassium excretion by the kidney.", "title": "Potassium"}