{"summary": "The pre-Columbian era means the history and prehistory of the Americas before there were important European influences on the American continent.", "full_text": "The pre-Columbian era incorporates all period subdivisions in the history and prehistory of the Americas before the appearance of significant European influences on the American continents, spanning the time of the original settlement in the Upper Paleolithic period to European colonization during the Early Modern period.\nWhile the phrase \"pre-Columbian era\" literally refers only to the time preceding Christopher Columbus's voyages of 1492, in practice the phrase usually is used to denote the entire history of indigenous Americas cultures until those cultures were significantly influenced by Europeans, even if this happened decades or centuries after Columbus's first landing. For this reason the alternative terms of Precontact Americas, Pre-Colonial Americas or Prehistoric Americas are also in use. In areas of Latin America the term usually used is Pre-Hispanic.\nMany pre-Columbian civilizations established hallmarks which included permanent settlements, cities, agriculture, civic and monumental architecture, major earthworks, and complex societal hierarchies. Some of these civilizations had long faded by the time of the first permanent European and African arrivals , and are known only through archaeological investigations and oral history. Other civilizations were contemporary with the colonial period and were described in European historical accounts of the time. A few, such as the Maya civilization, had their own written records. Because many Christian Europeans of the time viewed such texts as heretical, men like Diego de Landa destroyed many texts in pyres, even while seeking to preserve native histories. Only a few hidden documents have survived in their original languages, while others were transcribed or dictated into Spanish, giving modern historians glimpses of ancient culture and knowledge.\nIndigenous American cultures continue to evolve after the pre-Columbian era. Many of these peoples and their descendants continue traditional practices, while evolving and adapting new cultural practices and technologies into their lives.", "title": "Pre-Columbian"}