{"summary": "Presbyterianism is a kind of Protestant Christianity.", "full_text": "Presbyterianism is a part of the Reformed tradition within Protestantism which traces its origins to the British Isles. Presbyterian churches derive their name from the presbyterian form of church government, which is government by representative assemblies of elders. Many Reformed churches are organized this way, but the word \"Presbyterian,\" when capitalized, is often applied uniquely to the churches that trace their roots to the Scottish and English churches that bore that name and English political groups that formed during the English Civil War. Presbyterian theology typically emphasizes the sovereignty of God, the authority of the Scriptures, and the necessity of grace through faith in Christ. Presbyterian church government was ensured in Scotland by the Acts of Union in 1707 which created the kingdom of Great Britain. In fact, most Presbyterians found in England can trace a Scottish connection, and the Presbyterian denomination was also taken to North America mostly by Scots and Scots-Irish  immigrants. The Presbyterian denominations in Scotland hold to the theology of John Calvin and his immediate successors, although there are a range of theological views within contemporary Presbyterianism.\nLocal congregations of churches which use presbyterian polity are governed by sessions made up of representatives of the congregation ; a conciliar approach which is found at other levels of decision-making .\nThe roots of Presbyterianism lie in the European Reformation of the 16th century; the example of John Calvin's Geneva being particularly influential. Most Reformed churches which trace their history back to Scotland are either presbyterian or congregationalist in government. In the twentieth century, some Presbyterians played an important role in the ecumenical movement, including the World Council of Churches. Many Presbyterian denominations have found ways of working together with other Reformed denominations and Christians of other traditions, especially in the World Communion of Reformed Churches. Some Presbyterian churches have entered into unions with other churches, such as Congregationalists, Lutherans, Anglicans, and Methodists.", "title": "Presbyterian"}