{"summary": "A president is the leader of a country or a company or other group.", "full_text": "A presidential system is a system of government where a head of government is also head of state and leads an executive branch that is separate from the legislative branch. The United States, for instance, has a presidential system. The executive is elected and often titled \"president\" and is not responsible to the legislature and cannot, in normal circumstances, dismiss it. The legislature may have the right, in extreme cases, to dismiss the executive, often through impeachment. However, such dismissals are seen as so rare as not to contradict a central tenet of presidentialism, that in normal circumstances using normal means the legislature cannot dismiss the executive.\nThe title president has persisted from a time when such person personally presided over the government body, as with the US President of the Continental Congress, before the executive function was split into a separate branch of government and could no longer preside over the legislative body.\nPresidential systems are numerous and diverse, but the following are generally true:\nThe executive can veto legislative acts and, in turn, a supermajority of lawmakers may override the veto. The veto is generally derived from the British tradition of royal assent in which an act of parliament can only be enacted with the assent of the monarch.\nThe president has a fixed term of office. Elections are held at regular times and cannot be triggered by a vote of confidence or other parliamentary procedures. Although in some countries there is an exception, which provides for the removal of a president who is found to have broken a law.\nThe executive branch is unipersonal. Members of the cabinet serve at the pleasure of the president and must carry out the policies of the executive and legislative branches. Cabinet ministers or executive departmental chiefs are not members of the legislature. However, presidential systems often need legislative approval of executive nominations to the cabinet, judiciary, and various lower governmental posts. A president generally can direct members of the cabinet, military, or any officer or employee of the executive branch, but cannot direct or dismiss judges.\nThe president can often pardon or commute sentences of convicted criminals.\nCountries that feature a presidential system of government are not the exclusive users of the title of President. For example, a dictator, who may or may not have been popularly or legitimately elected may be and often is called a president. Likewise, leaders of one-party states are often called presidents. Most parliamentary republics have presidents, but this position is largely ceremonial; notable examples include Germany, India, Ireland, Israel and Italy. The title is also used in parliamentary republics with an executive presidency, and also in semi-presidential systems.", "title": "Presidential system"}