{"summary": "The Royal Society is a society for science and scientists.", "full_text": "The President of the Royal Society  is the elected director of the Royal Society of London who presides over meetings of the society's council.\nAfter informal meetings at Gresham College, the Royal Society was officially founded on 28 November 1660 when a group of academics decided to found \"a Colledge for the Promoting of Physico-Mathematicall Experimentall Learning\", acquiring a Royal Charter on 15 July 1662. The Royal Charter nominated William Brouncker as president, and stipulated that future presidents should be elected by the Council and Fellows of the society at anniversary meetings each year on St. Andrew's Day .\nThe details of the presidency were described by the second Royal Charter, which did not set any limit on how long a president could serve. There were considerable fluctuations in the president's term of office until well into the 19th century. By then, sentiment had turned against electing wealthy amateurs solely because they might become patrons of the society, and in 1847 the society decided that Fellows would be elected solely on scientific merit. Since the 1870s it has been usual  for each President to serve for exactly five years. Under the current statutes, a president cannot serve for more than five years.\nThe current President is Venkatraman Ramakrishnan who began his 5 year tenure in 2015. Historically, the duties of the president have been both formal and social. Under the Cruelty to Animals Act 1876, the President was one of only a few people authorised to certify that a particular experiment on an animal was justified, and in addition he acted as the government's chief  advisor for scientific matters. At the same time, the President was tasked with entertaining distinguished foreign guests and scientists.\nThe changeover of presidents occurs on the Royal Society Anniversary Day, the weekday on or nearest to 30 November, after the departing President's Anniversary Address.", "title": "President of the Royal Society"}