{"summary": "The President of Ukraine  is the Ukrainian head of state.", "full_text": "The President of Ukraine  is the Ukrainian head of state. The President represents the nation in international relations, administers the foreign political activity of the state, conducts negotiations and concludes international treaties. The President is directly elected by the citizens of Ukraine for a five-year term of office , limited to two terms consecutively.\nThe President's official residence is the Mariyinsky Palace, located in the Pechersk district of the capital Kyiv. Other official residences include the House with Chimaeras and the House of the Weeping Widow, which are used for official visits by foreign representatives. The Presidential Administration of Ukraine, unofficially known as \"Bankova\" in reference to the street it is located on, serves as the Presidential administration, advising the President in the domestic, foreign and legal matters.\nSince the office's formation on July 5, 1991, there have been five Presidents of Ukraine. Leonid Kravchuk was the inaugural president, serving three years from 1991 until his resignation in 1994. Leonid Kuchma was the only President to have served two consecutive terms in office. Both Viktor Yushchenko and Viktor Yanukovych served one term, with the latter being replaced by acting president Oleksandr Turchynov, who then also served as Chairman of the Ukrainian Parliament, on February 21, 2014. Oleksandr Turchynov was the only acting president in Ukraine's modern history, unlike in the US where the vice president inherits all powers of the presidency the powers of an acting president in Ukraine are severely limited. On 18 June 2015 Yanukovych was officially deprived of the title of President of Ukraine. The current president is Petro Poroshenko who took the oath of office on June 7, 2014. The Government of Ukraine utilizes a Semi-presidential system in which the roles of the head of state and head of government are separate, thus the president of Ukraine is not the nation's head of government. The prime minister serves as the head of government, a role currently filled by Arseniy Yatsenyuk who was re-appointed to the position following the October 2014 Ukrainian parliamentary election.", "title": "President of Ukraine"}