{"summary": "Princeton is a community in Mercer County, New Jersey, United States.", "full_text": "Princeton is a municipality with a borough form of government in Mercer County, New Jersey, United States, that was established in its current form on January 1, 2013, through the consolidation of the Borough of Princeton and Princeton Township. As of the 2010 United States Census, the municipality's population was 28,572, reflecting the former township's population of 16,265, along with the 12,307 in the former borough.\nPrinceton was founded before the American Revolution and is best known as the location of Princeton University, located in the community since 1756. Although its association with the university is primarily what makes Princeton a college town, other important institutions in the area include the Institute for Advanced Study, Westminster Choir College, Princeton Plasma Physics Laboratory, Princeton Theological Seminary, Opinion Research Corporation, Siemens Corporate Research, SRI International, FMC Corporation, The Robert Wood Johnson Foundation, Amrep, Church and Dwight, Berlitz International, and Dow Jones & Company.\nPrinceton is roughly equidistant from New York City and Philadelphia. Princeton is close to many major highways that serve both cities, and receives major television and radio broadcasts from each.\nNew Jersey's capital is the city of Trenton, but the governor's official residence has been in Princeton since 1945, when Morven in the borough became the first Governor's mansion. It was later replaced by the larger Drumthwacket, a colonial mansion located in the township. Morven became a museum property of the New Jersey Historical Society.\nPrinceton was ranked 15th of the top 100 towns in the United States to Live and Work In by Money Magazine in 2005.\nAlthough residents of Princeton  traditionally have a strong community-wide identity, the community had been composed of two separate municipalities: a township and a borough. The central borough was completely surrounded by the township. The Borough seceded from the Township in 1894 in a dispute over school taxes; the two municipalities later formed the Princeton Public Schools, and some other public services were conducted together before they were reunited into a single Princeton in January 2013. The Borough contained Nassau Street, the main commercial street, most of the University campus, and incorporated most of the urban area until the postwar suburbanization. The Borough and Township had roughly equal populations.", "title": "Princeton, New Jersey"}