{"summary": "NASA or the National Aeronautics and Space Administration is the part of the United States government that deals with space exploration and aeronautics, the operating and designing of planes.", "full_text": "Project Mercury was the first human spaceflight program of the United States running from 1958 through 1963. An early highlight of the Space Race, its goal was to put a human into Earth orbit and return the person safely, ideally before the Soviet Union. Taken over from the U.S. Air Force by the newly created civilian space agency NASA, it spanned twenty unmanned developmental missions involving test animals, and successful missions completed by six of the seven Mercury astronauts.\nThe Space Race had begun with the 1957 launch of the Soviet satellite Sputnik 1. This came as a shock to the American public, and led to the creation of NASA to expedite existing U.S. space exploration efforts, and place most of them under civilian control. After the successful launch of the Explorer 1 satellite in 1958, manned spaceflight became the next goal.\nThe Soviet Union put the first human, cosmonaut Yuri Gagarin, into a single orbit aboard Vostok 1 on April 12, 1961. Shortly after this, on May 5, the U.S. launched its first astronaut, Alan Shepard, on a suborbital flight. Soviet Gherman Titov followed with a day-long orbital flight in August, 1961. The U.S. reached its orbital goal on February 20, 1962, when John Glenn made three orbits around the Earth. When Mercury ended in May 1963, both nations had sent six people into space, but the U.S. was still behind the Soviets in terms of total time spent in space.\nThe Mercury spacecraft was produced by McDonnell Aircraft, and carried supplies of water, food and oxygen for about one day in a pressurized cabin. Mercury flights were launched from Cape Canaveral, Florida, on modified Redstone and Atlas D missiles. The capsule was fitted with an escape rocket to carry it safely away from the launch rocket in case of a failure of the latter. The flight was designed to be controlled from the ground via the Manned Space Flight Network, a system of tracking and communications stations; back-up controls were outfitted on board. Small retrorockets were used to bring the spacecraft out of its orbit, after which an ablative heat shield protected the spacecraft from the heat of atmospheric reentry. Finally, a parachute slowed the craft for a water landing. Both astronaut and capsule were recovered by helicopters deployed from the nearest suitable U.S. Navy ship.\nThe program took its name from the wing-footed, fleet god of travel in Roman mythology, and is estimated to have cost $1.74 billion  and to have involved the work of 2 million people. The astronauts were collectively known as the \"Mercury Seven\", and each spacecraft was given a name ending with a \"7\" by its pilot.\nAfter a slow start riddled with humiliating mistakes, the Mercury Project gained popularity, its missions followed by millions on radio and TV around the world. Its success laid the groundwork for Project Gemini, which carried two astronauts in each capsule and perfected space docking maneuvers essential for lunar travel, and the subsequent Apollo Moon-landing program announced a few weeks after the first manned Mercury flight.", "title": "Project Mercury"}