{"summary": "Promethium is a chemical element that has the symbol Pm on the periodic table.", "full_text": "Promethium, originally prometheum, is a chemical element with the symbol Pm and atomic number 61. All of its isotopes are radioactive; it is one of only two such elements that are followed in the periodic table by elements with stable forms, a distinction shared with technetium. Chemically, promethium is a lanthanide, which forms salts when combined with other elements. Promethium shows only one stable oxidation state of +3; however, a few +2 compounds may exist.\nIn 1902, Bohuslav Brauner suggested there was an element with properties intermediate between those of the known elements neodymium  and samarium ; this was confirmed in 1914 by Henry Moseley who, having measured the atomic numbers of all the elements then known, found there was no element with atomic number 61. In 1926, an Italian and an American group claimed to have isolated a sample of element 61; both \"discoveries\" were soon proven to be false. In 1938, during a nuclear experiment conducted at Ohio State University, a few radioactive nuclides were produced that certainly were not radioisotopes of neodymium or samarium, but there was a lack of chemical proof that element 61 was produced, and the discovery was not generally recognized. Promethium was first produced and characterized at Oak Ridge National Laboratory in 1945 by the separation and analysis of the fission products of uranium fuel irradiated in a graphite reactor. The discoverers proposed the name \"prometheum\" , derived from Prometheus, the Titan in Greek mythology who stole fire from Mount Olympus and brought it down to humans, to symbolize \"both the daring and the possible misuse of mankind's intellect.\" However, a sample of the metal was made only in 1963.\nThere are two possible sources for natural promethium: rare decays of natural europium-151 , and uranium . Practical applications exist only for chemical compounds of promethium-147, which are used in luminous paint, atomic batteries and thickness measurement devices, even though promethium-145 is the most stable promethium isotope. Because natural promethium is exceedingly scarce, it is typically synthesized by bombarding uranium-235  with thermal neutrons to produce promethium-147.", "title": "Promethium"}