{"summary": "Public transport  is the transport of passengers.", "full_text": "Public transport  is a shared passenger transport service which is available for use by the general public, as distinct from modes such as taxicab, carpooling or hired buses which are not shared by strangers without private arrangement.\nPublic transport modes include city buses, trolleybuses, trams  and passenger trains, rapid transit  and ferries. Public transport between cities is dominated by airlines, coaches, and intercity rail. High-speed rail networks are being developed in many parts of the world. Most public transport runs to a scheduled timetable with the most frequent services running to a headway . Share taxis offer on-demand services in many parts of the world, and some services will wait until the vehicle is full before it starts. Paratransit is sometimes used in areas of low-demand and for people who need a door-to-door service.\nThere are distinct differences in urban public transit between Asia, North America, and Europe. In Asia, mass transit operations are predominantly run by profit-driven privately owned and publicly traded mass transit and real estate conglomerates. In North America, mass transit operations are predominantly run by municipal transit authorities. In Europe, mass transit operations are predominantly run by state-owned companies. Public transport services can be profit-driven by use of pay-by-the-distance fares or funded by government subsidies in which flat rate fares are charged to each passenger. Services can be fully profitable through high ridership numbers and high farebox recovery ratios, or can be regulated and possibly subsidized from local or national tax revenue. Fully subsidized, zero-fare  services operate in some towns and cities.\nFor historical and economic reasons, there are differences internationally regarding use and extent of public transport. While countries in the Old World tend to have extensive and frequent systems serving their old and dense cities, many cities of the New World have more sprawl and much less comprehensive public transport. The International Association of Public Transport  is the international network for public transport authorities and operators, policy decision-makers, scientific institutes and the public transport supply and service industry. It has 3,400 members from 92 countries.", "title": "Public transportation"}