{"summary": "Public Administration has two meanings.", "full_text": "Public administration is the implementation of government policy and also an academic discipline that studies this implementation and prepares civil servants for working in the public service. As a \"field of inquiry with a diverse scope\" its \"fundamental goal... is to advance management and policies so that government can function.\" Some of the various definitions which have been offered for the term are: \"the management of public programs\"; the \"translation of politics into the reality that citizens see every day\"; and \"the study of government decision making, the analysis of the policies themselves, the various inputs that have produced them, and the inputs necessary to produce alternative policies.\"\nPublic administration is \"centrally concerned with the organization of government policies and programmes as well as the behavior of officials  formally responsible for their conduct\" Many unelected public servants can be considered to be public administrators, including heads of city, county, regional, state and federal departments such as municipal budget directors, human resources  administrators, city managers, census managers, state mental health directors, and cabinet secretaries. Public administrators are public servants working in public departments and agencies, at all levels of government.\nIn the US, civil servants and academics such as Woodrow Wilson promoted American civil service reform in the 1880s, moving public administration into academia. However, \"until the mid-20th century and the dissemination of the German sociologist Max Weber's theory of bureaucracy\" there was not \"much interest in a theory of public administration.\" The field is multidisciplinary in character; one of the various proposals for public administration's sub-fields sets out six pillars, including human resources, organizational theory, policy analysis and statistics, budgeting, and ethics.", "title": "Public administration"}