{"summary": "Quantum mechanics  is the part of physics that tells us how the things that make up atoms work.", "full_text": "In theoretical physics, quantum nonlocality is the phenomenon by which measurements made at a microscopic level contradict a collection of notions known as local realism that are regarded as intuitively true in classical mechanics. Rigorously, quantum nonlocality refers to quantum mechanical predictions of many-system measurement correlations that cannot be simulated by any local hidden variable theory. Many entangled quantum states produce such correlations when measured, as demonstrated by Bell's theorem.\nExperiments have generally favoured quantum mechanics as a description of nature, over local hidden variable theories. Any physical theory that supersedes or replaces quantum theory must make similar experimental predictions and must therefore also be nonlocal in this sense; quantum nonlocality is a property of the universe that is independent of our description of nature.\nThe terms however must be defined properly. Using the proper physical definition of locality, special relativity has the principle of locality included in its very definition. Therefore, this principle is also included in relativistic quantum field theories as the \"principle of locality\" saying mainly that on two regions of spacetime, separated by a space-like interval, the observables defined on each of the two regions commute, therefore are independent and can be defined simultaneously in an experiment. This is the generally accepted definition of locality. Phenomena like entanglement or quantum superposition are in perfect agreement with this definition of locality and are therefore strictly local. The rest of this article discusses quantum correlation effects which are not to be associated to the principle of locality. In fact, any relativistic form of quantum mechanics is fundamentally local.\nWhilst quantum nonlocality improves the efficiency of various computational tasks, it does not allow for faster-than-light communication, and hence is compatible with special relativity. However, it prompts many of the foundational discussions concerning quantum theory.", "title": "Quantum nonlocality"}