{"summary": "A quark is a tiny particle which makes up protons and neutrons.", "full_text": "A quark  is an elementary particle and a fundamental constituent of matter. Quarks combine to form composite particles called hadrons, the most stable of which are protons and neutrons, the components of atomic nuclei. Due to a phenomenon known as color confinement, quarks are never directly observed or found in isolation; they can be found only within hadrons, such as baryons , and mesons. For this reason, much of what is known about quarks has been drawn from observations of the hadrons themselves.\nQuarks have various intrinsic properties, including electric charge, mass, color charge and spin. Quarks are the only elementary particles in the Standard Model of particle physics to experience all four fundamental interactions, also known as fundamental forces , as well as the only known particles whose electric charges are not integer multiples of the elementary charge.\nThere are six types of quarks, known as flavors: up, down, strange, charm, top, and bottom. Up and down quarks have the lowest masses of all quarks. The heavier quarks rapidly change into up and down quarks through a process of particle decay: the transformation from a higher mass state to a lower mass state. Because of this, up and down quarks are generally stable and the most common in the universe, whereas strange, charm, bottom, and top quarks can only be produced in high energy collisions . For every quark flavor there is a corresponding type of antiparticle, known as an antiquark, that differs from the quark only in that some of its properties have equal magnitude but opposite sign.\nThe quark model was independently proposed by physicists Murray Gell-Mann and George Zweig in 1964. Quarks were introduced as parts of an ordering scheme for hadrons, and there was little evidence for their physical existence until deep inelastic scattering experiments at the Stanford Linear Accelerator Center in 1968. Accelerator experiments have provided evidence for all six flavors. The top quark was the last to be discovered at Fermilab in 1995.", "title": "Quark"}