{"summary": "The Qur'an, sometimes spelled Koran,  is the holy book of Islam.", "full_text": "The Quran  is the central religious text of Islam, which Muslims believe to be a revelation from God . It is widely regarded as the finest piece of literature in the Arabic language. Quranic chapters are called suras and verses, ayahs.\n\nMuslims believe the Quran was verbally revealed by God to Muhammad through the angel Gabriel , gradually over a period of approximately 23 years, beginning on 22 December 609 CE, when Muhammad was 40, and concluding in 632, the year of his death. Muslims regard the Quran as the most important miracle of Muhammad, a proof of his prophethood, and the culmination of a series of divine messages that started with the messages revealed to Adam and ended with Muhammad. The word \"Quran\" is mentioned some 70 times in the text of Quran, though different names and words are also said to be references to the Quran.\nAccording to the traditional narrative, several companions of Muhammad served as scribes and were responsible for writing down the revelations. Shortly after Muhammad's death, the Quran was compiled by his companions who wrote down and memorized parts of it. These codices had differences that motivated the Caliph Uthman to establish a standard version now known as Uthman's codex, which is generally considered the archetype of the Quran we have today. There are, however, variant readings, with mostly minor differences in meaning.\nThe Quran assumes familiarity with major narratives recounted in the Jewish and Christian scriptures. It summarizes some, dwells at length on others and, in some cases, presents alternative accounts and interpretations of events. The Quran describes itself as a book of guidance. It sometimes offers detailed accounts of specific historical events, and it often emphasizes the moral significance of an event over its narrative sequence. The Quran is used along with the hadith to interpret sharia law. During prayers, the Quran is recited only in Arabic.\nSomeone who has memorized the entire Quran is called a hafiz. Some Muslims read Quranic ayah  with elocution, which is often called tajwid. During the month of Ramadan, Muslims typically complete the recitation of the whole Quran during tarawih prayers. In order to extrapolate the meaning of a particular Quranic verse, most Muslims rely on the tafsir.", "title": "Qur'an"}