{"summary": "R.E.M.", "full_text": "R.E.M. was an American rock band from Athens, Georgia, formed in 1980 by lead singer Michael Stipe, lead guitarist Peter Buck, bassist Mike Mills, and drummer Bill Berry. One of the first popular alternative rock bands, R.E.M. gained early attention due to Buck's ringing, arpeggiated guitar style and Stipe's unclear vocals. R.E.M. released their first single, \"Radio Free Europe\", in 1981 on the independent record label Hib-Tone. The single was followed by the Chronic Town EP in 1982, the band's first release on I.R.S. Records. In 1983, the group released its critically acclaimed debut album, Murmur, and built its reputation over the next few years through subsequent releases, constant touring, and the support of college radio. Following years of underground success, R.E.M. achieved a mainstream hit in 1987 with the single \"The One I Love\". The group signed to Warner Bros. Records in 1988, and began to espouse political and environmental concerns while playing large arenas worldwide.\nBy the early 1990s, when alternative rock began to experience broad mainstream success, R.E.M. was viewed by subsequent acts such as Nirvana and Pavement as a pioneer of the genre and released its two most commercially successful albums, catapulting it to international fame, Out of Time  and Automatic for the People , which veered from the band's established sound. R.E.M.'s 1994 release, Monster, was a return to a more rock-oriented sound, but still continued its run of success. The band began its first tour in six years to support the album; the tour was marred by medical emergencies suffered by three band members. In 1996, R.E.M. re-signed with Warner Bros. for a reported US$80 million, at the time the most expensive recording contract in history. Its 1996 release, New Adventures in Hi-Fi, though critically acclaimed, fared worse commercially than expected. The following year, Bill Berry left the band, while Buck, Mills, and Stipe continued the group as a trio. Through some changes in musical style, the band continued its career into the next decade with mixed critical and commercial success, despite having sold more than 85 million records worldwide and becoming one of the world's best-selling music artists of all time. In 2007, the band was inducted into the Rock and Roll Hall of Fame. R.E.M. disbanded amicably in September 2011, announcing the split on its website.", "title": "R.E.M. (band)"}