{"summary": "Radio is a way to send electromagnetic signals over a long distance, to deliver information from one place to another.", "full_text": "Radio is the radiation  of electromagnetic energy through space. The biggest use of radio waves is to carry information, such as sound, by systematically changing  some property of the radiated waves, such as their amplitude, frequency, phase, or pulse width. When radio waves strike an electrical conductor, the oscillating fields induce an alternating current in the conductor. The information in the waves can be extracted and transformed back into its original form.\nRadio systems need a transmitter to modulate  some property of the energy produced to impress a signal on it, for example using amplitude modulation or angle modulation . Radio systems also need an antenna to convert electric currents into radio waves, and vice versa. An antenna can be used for both transmitting and receiving. The electrical resonance of tuned circuits in radios allow individual stations to be selected. The electromagnetic wave is intercepted by a tuned receiving antenna. A radio receiver receives its input from an antenna and converts it into a form usable for the consumer, such as sound, pictures, digital data, measurement values, navigational positions, etc. Radio frequencies occupy the range from a 3 kHz to 300 GHz, although commercially important uses of radio use only a small part of this spectrum.\nA radio communication system sends signals by radio. The radio equipment involved in communication systems includes a transmitter and a receiver, each having an antenna and appropriate terminal equipment such as a microphone at the transmitter and a loudspeaker at the receiver in the case of a voice-communication system.\n^ Dictionary of Electronics By Rudolf F. Graf . Page 467.\n^ \"Radio-Electronics, ''Radio Receiver Technology''\". Radio-electronics.com. Retrieved 2014-08-02. \n^ The Electromagnetic Spectrum, University of Tennessee, Dept. of Physics and Astronomy\n^ Clint Smith, Curt Gervelis . Wireless Network Performance Handbook. McGraw-Hill Professional. ISBN 0-07-140655-7. \n^ R. K. Puri . Solid State Physics and Electronics. S. Chand. ISBN 81-219-1475-2.", "title": "Radio"}