{"summary": "A railway track or railway line is a set of two parallel rows of long pieces of steel.", "full_text": "Rail transport is a means of conveyance of passengers and goods, by way of wheeled vehicles running on rails.\nIt is also commonly referred to as train transport. In contrast to road transport, where vehicles run on a prepared flat surface, rail vehicles are also directionally guided by the tracks on which they run. Track usually consists of steel rails, installed on ties  and ballast, on which the rolling stock, usually fitted with metal wheels, moves. Other variations are also possible, such as slab track where the rails are fastened to a concrete foundation resting on a prepared subsurface.\nRolling stock in railway transport systems generally has lower frictional resistance when compared with highway vehicles and the passenger and freight cars  can be coupled into longer trains. The operation is carried out by a railway company, providing transport between train stations or freight customer facilities. Power is provided by locomotives which either draw electric power from a railway electrification system or produce their own power, usually by diesel engines. Most tracks are accompanied by a signalling system. Railways are a safe land transport system when compared to other forms of transport. Railway transport is capable of high levels of passenger and cargo utilization and energy efficiency, but is often less flexible and more capital-intensive than highway transport is, when lower traffic levels are considered.\nThe oldest, man-hauled railways date back to the 6th century B.C, with Periander, one of the Seven Sages of Greece, credited with its invention. Rail transport blossomed after the British development of the steam locomotive as a viable source of the power in the 18th and 19th centuries. With steam engines, it was possible to construct mainline railways, which were a key component of the Industrial Revolution. Also, railways reduced the costs of shipping, and allowed for fewer lost goods, compared with shipping, which faced occasional sinking of ships. The change from canals to railways allowed for \"national markets\" in which prices varied very little from city to city. The invention and development of the railway in Europe was one of the most important technological inventions of the late 19th century; for the United States, it is estimated that without rail, GDP would have been lower by 7% in 1890.\nIn the 1880s, electrified trains were introduced, and also the first tramways and rapid transit systems came into being. Starting during the 1940s, the non-electrified railways in most countries had their steam locomotives replaced by diesel-electric locomotives, with the process being almost complete by 2000. During the 1960s, electrified high-speed railway systems were introduced in Japan and later in some other countries. Other forms of guided ground transport outside the traditional railway definitions, such as monorail or maglev, have been tried but have seen limited use.", "title": "Railroad"}