{"summary": "Ralph Bakshi  is an American director of animated and live-action movies.", "full_text": "Ralph Bakshi  is an American director of animated and live-action films. In the 1970s, he established an alternative to mainstream animation through independent and adult-oriented productions. Between 1972 and 1992, he directed nine theatrically released feature films, five of which he wrote. He has been involved in numerous television projects as director, writer, producer and animator.\nBeginning his career at the Terrytoons television cartoon studio as a cel polisher, Bakshi was eventually promoted to director. He moved to the animation division of Paramount Pictures in 1967 and started his own studio, Bakshi Productions, in 1968. Through producer Steve Krantz, Bakshi made his debut feature film, Fritz the Cat, released in 1972. It was the first animated film to receive an X rating from the Motion Picture Association of America, and the most successful independent animated feature of all time.\nOver the next eleven years, Bakshi directed seven additional animated features. He is well known for such films as Wizards , The Lord of the Rings , American Pop  and Fire and Ice . In 1987, Bakshi returned to television work, producing the series Mighty Mouse: The New Adventures, which ran for two years. After a nine-year hiatus from feature films, he directed Cool World , which was largely rewritten during production and received poor reviews. Bakshi returned to television with the live-action film Cool and the Crazy  and the anthology series Spicy City .\nHe founded the Bakshi School of Animation and Cartooning in 2003. During the 2000s, he has focused largely on painting. He has received several awards for his work, including the 1980 Golden Gryphon for The Lord of the Rings at the Giffoni Film Festival, the 1988 Annie Award for Distinguished Contribution to the Art of Animation, and the 2003 Maverick Tribute Award at the Cinequest Film Festival.", "title": "Ralph Bakshi"}