{"summary": "The Reconstruction was after the American Civil War.", "full_text": "The term Reconstruction Era, in the context of the history of the United States, has two senses: the first covers the complete history of the entire country from 1865 to 1877 following the Civil War; the second sense focuses on the transformation of the Southern United States from 1863 to 1877, as directed by Congress, with the reconstruction of state and society.\nFrom 1863 to 1865, Presidents Abraham Lincoln and Andrew Johnson both took moderate positions designed to bring the South back to normal as quickly as possible, while the Radical Republicans used Congress to block any moderate approaches, impose harsh terms, and upgrade the rights of the freedmen. Johnson followed a lenient policy toward ex-Confederates much like Lincoln's. Lincoln's last speeches show that he was leaning toward supporting the enfranchisement of some freedmen, whereas Johnson was opposed to this.\nJohnson's interpretations of Lincoln's policies prevailed until the Congressional elections of 1866 in the North, which enabled the Radicals to take control of policy, remove former Confederates from power, and enfranchise the freedmen. A Republican coalition came to power in nearly all the southern states and set out to transform the society by setting up a free labor economy, using the U.S. Army and the Freedmen's Bureau. The Bureau protected the legal rights of freedmen, negotiated labor contracts, and set up schools and even churches for them. Thousands of Northerners came South, as missionaries, teachers, businessmen and politicians; hostile elements called them \"Carpetbaggers\". Rebuilding the rundown railroad system was a major strategy, but it collapsed when a nationwide depression  struck the economy. The Radicals, frustrated by Johnson's opposition to Congressional Reconstruction, filed impeachment charges but the action failed by one vote in the Senate.\nPresident Ulysses S. Grant supported Radical Reconstruction and enforced the protection of African Americans in the South through the use of the Enforcement Acts passed by Congress. Grant suppressed the Ku Klux Klan, but was unable to resolve the escalating tensions inside the Republican party between the Carpetbaggers and the Scalawags . Meanwhile, self-styled Conservatives  strongly opposed Republican rule. They alleged widespread corruption by the Carpetbaggers, excessive state spending and ruinous taxes. The opposition violently counterattacked and regained power in each \"redeemed\" Southern state by 1877. Meanwhile, public support for Reconstruction policies faded in the North, as voters decided the Civil War was over and slavery was dead. The Democrats, who strongly opposed Reconstruction, regained control of the House of Representatives in 1874; the presidential electoral vote in 1876 was very close and confused, forcing Congress to make the final decision. The deployment of the U.S. Army was central to the survival of Republican state governments; they collapsed when the Army was removed in 1877 as part of a Congressional bargain to elect Republican Rutherford B. Hayes as president.\nReconstruction was a significant chapter in the history of civil rights in the United States, but most historians consider it a failure because the South became a poverty-stricken backwater attached to agriculture, while white Southerners attempted to re-establish dominance through violence, intimidation and discrimination, forcing freedmen into second class citizenship with limited rights, and excluding them from the political process. Historian Eric Foner argues, \"What remains certain is that Reconstruction failed, and that for blacks its failure was a disaster whose magnitude cannot be obscured by the genuine accomplishments that did endure.\"", "title": "Reconstruction era of the United States"}