{"summary": "The Reichstag fire  was an arson  on the Reichstag building, the meeting place of the German Parliament, in Berlin on 27 February 1933. It was an important event in the creation of Nazi Germany.", "full_text": "The Reichstag fire  was an arson attack on the Reichstag building in Berlin on 27 February 1933. Marinus van der Lubbe, a young Dutch council communist, was caught at the scene of the fire and arrested for the crime. Van der Lubbe was an unemployed bricklayer who had recently arrived in Germany. He declared that he had started the fire and was tried and sentenced to death. The fire was used as evidence by the Nazi Party that communists were plotting against the German government. The event is seen as pivotal in the establishment of Nazi Germany.\nThe fire started in the Session Chamber of the Reichstag building, the assembly location of the German Parliament. A Berlin fire station received an alarm call that the building was on fire at 21:25. By the time the police and firemen arrived, the main Chamber of Deputies was engulfed in flames. The police conducted a thorough search inside the building and found Van der Lubbe. He was arrested, as were four communist leaders soon after.\nAdolf Hitler, who was sworn in as Chancellor of Germany four weeks before, on 30 January, urged President Paul von Hindenburg to pass an emergency decree to suspend civil liberties in order to counter the ruthless confrontation of the Communist Party of Germany. After passing the decree, the government instituted mass arrests of communists, including all of the Communist Party parliamentary delegates. With their bitter rival communists gone and their seats empty, the Nazi Party went from being a plurality party to the majority; this enabled Hitler to consolidate his power.\nIn February 1933, three men were arrested who were to play pivotal roles during the Leipzig Trial, known also as the \"Reichstag Fire Trial\": Bulgarians Georgi Dimitrov, Vasil Tanev and Blagoi Popov. The Bulgarians were known to the Prussian police as senior Comintern operatives, but the police had no idea how senior they were: Dimitrov was head of all Comintern operations in Western Europe.\nThe responsibility for the Reichstag fire remains an ongoing topic of debate and research. Historians disagree as to whether Van der Lubbe acted alone, as he said, to protest the condition of the German working class. The Nazis accused the Comintern of the act. A few historians endorse the conspiracy theory proposed by the Communist Party; that the arson was planned and ordered by the Nazis as a false flag operation. Whatever the truth, the Nazis used the fire to solidify their power and eliminate the communists as political rivals.", "title": "Reichstag fire"}