{"summary": "Quantum mechanics  is the part of physics that tells us how the things that make up atoms work.", "full_text": "This article is intended for those already familiar with quantum mechanics and its attendant interpretational difficulties. Readers who are new to the subject may first want to read the introduction to quantum mechanics.\nRelational quantum mechanics  is an interpretation of quantum mechanics which treats the state of a quantum system as being observer-dependent, that is, the state is the relation between the observer and the system. This interpretation was first delineated by Carlo Rovelli in a 1994 preprint, and has since been expanded upon by a number of theorists. It is inspired by the key idea behind Special Relativity, that the details of an observation depend on the reference frame of the observer, and uses some ideas from Wheeler on quantum information.\nThe physical content of the theory is not to do with objects themselves, but the relations between them. As Rovelli puts it: \"Quantum mechanics is a theory about the physical description of physical systems relative to other systems, and this is a complete description of the world\".\nThe essential idea behind RQM is that different observers may give different accounts of the same series of events: for example, to one observer at a given point in time, a system may be in a single, \"collapsed\" eigenstate, while to another observer at the same time, it may appear to be in a superposition of two or more states. Consequently, if quantum mechanics is to be a complete theory, RQM argues that the notion of \"state\" describes not the observed system itself, but the relationship, or correlation, between the system and its observer. The state vector of conventional quantum mechanics becomes a description of the correlation of some degrees of freedom in the observer, with respect to the observed system. However, it is held by RQM that this applies to all physical objects, whether or not they are conscious or macroscopic . Any \"measurement event\" is seen simply as an ordinary physical interaction, an establishment of the sort of correlation discussed above. The proponents of the relational interpretation argue that the approach clears up a number of traditional interpretational difficulties with quantum mechanics, while being simultaneously conceptually elegant and ontologically parsimonious.", "title": "Relational quantum mechanics"}