{"summary": "Religious conversion is the adoption of a new religious identity, or a change from one religious identity to another.", "full_text": "Religious conversion is the adoption of a set of beliefs identified with one particular religious denomination to the exclusion of others. Thus \"religious conversion\" would describe the abandoning of adherence to one denomination and affiliating with another. This might be from one to another denomination within the same religion, for example, Christian Baptist to Methodist or Catholic, Muslim Shi'a to Sunni. In some cases, religious conversion \"marks a transformation of religious identity and is symbolized by special rituals\".\nPeople convert to a different religion for various reasons, including: active conversion by free choice due to a change in beliefs, secondary conversion, deathbed conversion, conversion for convenience and marital conversion, and forced conversion such as conversion by violence or charity.\nConversion or reaffiliation for convenience is an insincere act, sometimes for relatively trivial reasons such as a parent converting to enable a child to be admitted to a good school associated with a religion, or a person adopting a religion more in keeping with the social class he or she aspires to. When people marry one spouse may convert to the religion of the other.\nForced conversion is adoption of a different religion under duress. The convert may secretly retain the previous beliefs and continue, covertly, with the practices of the original religion, while outwardly maintaining the forms of the new religion. Over generations a family forced against their will to convert may wholeheartedly adopt the new religion.\nProselytism is the act of attempting to convert by persuasion another individual from a different religion or belief system. .\nApostate is a term used by members of a religion or denomination to refer to someone who has left that religion or denomination.", "title": "Religious conversion"}