{"summary": "Relations between religion and homosexuality change with time, place, and religion.", "full_text": "The relationship between religion and homosexuality has varied greatly across time and place, within and between different religions and denominations, and regarding different forms of homosexuality and bisexuality. Present day doctrines of the world's major religions vary vastly generally and by denomination on attitudes toward these sexual orientations.\nAmong those denominations that generally are negative towards these orientations, there are many different types of actions they may take: this can range from quietly discouraging homosexual activity, explicitly forbidding same-sex sexual practices among adherents and actively opposing social acceptance of homosexuality, to execution. Religious fundamentalism has been found to correlate positively with anti-homosexual bias. Many argue that it is homosexual actions which are sinful, rather than the state of being homosexual itself. To this end, some discourage labeling individuals according to sexual orientation. Several organizations exist that assert that conversion therapy can help diminish same-sex attraction.\nHowever, some adherents of many religions view the two sexual orientations positively, and some religious denominations may bless same-sex marriages and support LGBT rights, and the amount of those that do are continuously increasing around the world as much of the developed world enacts laws supporting LGBT rights.\nHistorically, some cultures and religions accommodated, institutionalized, or revered, same-sex love and sexuality; such mythologies and traditions can be found around the world. For example, Hinduism does not view homosexuality as a religious sin. In 2009, the Hindu Council UK became one of the first major religious organizations to support LGBT rights when they issued a statement \"Hinduism does not condemn homosexuality\".\nRegardless of their position on homosexuality, many people of faith look to both sacred texts and tradition for guidance on this issue. However, the authority of various traditions or scriptural passages and the correctness of translations and interpretations are continually disputed.", "title": "Religion and homosexuality"}