{"summary": "Kenneth Geddes Wilson  was an American theoretical physicist and Nobel Prize winner.", "full_text": "In theoretical physics, the renormalization group  refers to a mathematical apparatus that allows systematic investigation of the changes of a physical system as viewed at different distance scales. In particle physics, it reflects the changes in the underlying force laws  as the energy scale at which physical processes occur varies, energy/momentum and resolution distance scales being effectively conjugate under the uncertainty principle .\nA change in scale is called a \"scale transformation\". The renormalization group is intimately related to \"scale invariance\" and \"conformal invariance\", symmetries in which a system appears the same at all scales . \nAs the scale varies, it is as if one is changing the magnifying power of a notional microscope viewing the system. In so-called renormalizable theories, the system at one scale will generally be seen to consist of self-similar copies of itself when viewed at a smaller scale, with different parameters describing the components of the system. The components, or fundamental variables, may relate to atoms, elementary particles, atomic spins, etc. The parameters of the theory typically describe the interactions of the components. These may be variable \"couplings\" which measure the strength of various forces, or mass parameters themselves. The components themselves may appear to be composed of more of the self-same components as one goes to shorter distances.\nFor example, in quantum electrodynamics , an electron appears to be composed of electrons, positrons  and photons, as one views it at higher resolution, at very short distances. The electron at such short distances has a slightly different electric charge than does the \"dressed electron\" seen at large distances, and this change, or \"running,\" in the value of the electric charge is determined by the renormalization group equation.", "title": "Renormalization group"}