{"summary": "A resignation is when someone quits or gives up the office they hold.", "full_text": "A resignation is the formal act of giving up or quitting one's office or position. A resignation can occur when a person holding a position gained by election or appointment steps down, but leaving a position upon the expiration of a term is not considered resignation. When an employee chooses to leave a position, it is considered a resignation, as opposed to involuntary termination, which occurs when the employee involuntarily loses a job. Whether an employee resigned or was terminated is sometimes a topic of dispute, because in many situations, a terminated employee is eligible for severance pay and/or unemployment benefits, whereas one who voluntarily resigns may not be eligible. Abdication is the equivalent of resignation of a reigning monarch or pope, or other holder of a non-political, hereditary or similar position.\n\nA resignation is a personal decision to exit a position, though outside pressure exists in many cases. For example, Richard Nixon resigned from the office of President of the United States in August 1974 following the Watergate scandal, when he was almost certain to have been impeached by the United States Congress.\nResignation can be used as a political manoeuvre, as in the Philippines in July 2005, when ten cabinet officials resigned en masse to pressure President Gloria Macapagal Arroyo to follow suit over allegations of electoral fraud. Arroyo's predecessor, Joseph Estrada, was successfully forced out of office during the EDSA Revolution of 2001 as he faced the first impeachment trial held in the country's history.\nIn 1995, the British Prime Minister, John Major, resigned as Leader of the Conservative Party in order to contest a leadership election with the aim of silencing his critics within the party and reasserting his authority. Having resigned, he stood again and was re-elected. He continued to serve as prime minister until he was defeated in 1997 elections.\nAlthough government officials may tender their resignations, they are not always accepted. This could be a gesture of confidence in the official, as with US President George W. Bush's refusal of his Secretary of Defense Donald Rumsfeld's twice-offered resignation during the Abu Ghraib prison abuse scandal.\nHowever, refusing a resignation can be a method of severe censure if it is followed by dismissal; Alberto Fujimori attempted to resign as President of Peru, but his resignation was refused in order that Congress could impeach him.\nFor many public figures, primarily departing politicians, resignation is an opportunity to deliver a valedictory resignation speech in which they can elucidate the circumstances of their exit from office and in many cases deliver a powerful speech which often commands much attention. This can be used to great political effect, particularly as, subsequent to resigning, government ministers are no longer bound by collective responsibility and can speak with greater freedom about current issues.\nIn academia, a university president or the editor of a scientific journal may also resign, particularly in cases where an idea which runs counter to the mainstream is being promoted. In 2006, Harvard president Lawrence Summers resigned after making the provocative suggestion that the underrepresentation of female academics in math and science  could be due to factors other than sheer discrimination, such as personal inclination or innate ability.", "title": "Resignation"}