{"summary": "Retirement is when people stop working.", "full_text": "Retirement is the point where a person stops employment completely. A person may also semi-retire by reducing work hours.\nAn increasing number of individuals are choosing to put off this point of total retirement, by selecting to exist in the emerging state of Pre-tirement.\nMany people choose to retire when they are eligible for private or public pension benefits, although some are forced to retire when physical conditions no longer allow the person to work any longer  or as a result of legislation concerning their position. In most countries, the idea of retirement is of recent origin, being introduced during the late 19th and early 20th centuries. Previously, low life expectancy and the absence of pension arrangements meant that most workers continued to work until death. Germany was the first country to introduce retirement, in 1889.\nNowadays most developed countries have systems to provide pensions on retirement in old age, which may be sponsored by employers and/or the state. In many poorer countries, support for the old is still mainly provided through the family. Today, retirement with a pension is considered a right of the worker in many societies, and hard ideological, social, cultural and political battles have been fought over whether this is a right. In many western countries this right is mentioned in national constitutions.\n^ \"Retire: To withdraw from one's occupation, business, or office; stop working.\" American Heritage Dictionary\n^ \"Retire: Leave one's job and cease to work, especially because one has reached a particular age. Compact Oxford Dictionary\n^ \"Britons opt for Pre-tirement over Total Retirement\"\n^ For example, in the United States, a person holding the rank of general or admiral must retire after 40 years of service unless he or she is reappointed to serve longer. \n^ \"The German Precedent\" Social Security History, US Social Security Administration", "title": "Retirement"}