{"summary": "October 26 is the 299th day of the year  in the Gregorian calendar.", "full_text": "Rex Gildo  was a German singer of Schlager ballads who reached the height of his popularity in the 1960s and 1970s, selling over 25 million records and starring in film and television roles.\nGildo was born Ludwig Franz Hirtreiter in Straubing, Bavaria; in the mid-fifties he adopted the stage name Alexander Gildo, later shortening it to Rex Gildo. For years he claimed that he had been a member of the Regensburger Domspatzen choir before attending acting school, while a documentary on German TV in 2009 revealed that in fact he had worked in a decorating apprenticeship before he met Fred Miekley, who would become his manager and longtime companion and presumably paid for Gildo's acting, dancing and singing lessons. Gildo's first performance was with the Munich Kammerspiele theatre group in 1956, but he quickly moved into television and film, as well as performing as a singer, most famously duetting with Danish singer Gitte Haenning as \"Gitte & Rex\".\nHis most popular songs, such as Speedy Gonzales , Goodbye Susanna , and Fiesta Mexicana , were popular during the 1960s and 1970s in Germany. His music and films sold well there but less so abroad. He also starred in his own television program, Gestatten - Rex Gildo.\nIn 1974, Gildo married his cousin Marion Ohlsen. The couple had no children and separated in 1990.\nDuring the 1980s and 1990s, Gildo's popularity decreased. His appearances were mainly at folk festivals, shopping centres and other similar venues; he was also reported to have problems with alcoholism, although this may have been due to medication he was taking. His final performance, on the day of his suicide attempt, was in front of more than 3000 people at a furniture shop outside Frankfurt.\nGildo died in 1999 aged 63, having spent three days in an artificially-induced coma after attempting suicide by jumping from the window of his apartment building. He was said to have been suffering psychological problems. After his death, it was reported that he was homosexual and involved in a relationship with Dave Klingeberg, his secretary with whom he lived, for seven years.", "title": "Rex Gildo"}