{"summary": "The Rhind papyrus in the British Museum is the best example of Egyptian mathematics.", "full_text": "The Rhind Mathematical Papyrus , is the best example of Egyptian mathematics. It is named after Alexander Henry Rhind, a Scottish antiquarian, who purchased the papyrus in 1858 in Luxor, Egypt; it was apparently found during illegal excavations in or near the Ramesseum. It dates to around 1650 BC. The British Museum, where the majority of papyrus is now kept, acquired it in 1865 along with the Egyptian Mathematical Leather Roll, also owned by Henry Rhind; there are a few small fragments held by the Brooklyn Museum in New York and an 18 cm central section is missing. It is one of the two well-known Mathematical Papyri along with the Moscow Mathematical Papyrus. The Rhind Papyrus is larger than the Moscow Mathematical Papyrus, while the latter is older than the former.\nThe Rhind Mathematical Papyrus dates to the Second Intermediate Period of Egypt. It was copied by the scribe Ahmes , from a now-lost text from the reign of king Amenemhat III . Written in the hieratic script, this Egyptian manuscript is 33 cm tall and consists of multiple parts which in total make it over 5m long. The papyrus began to be transliterated and mathematically translated in the late 19th century. In 2008, the mathematical translation aspect remains incomplete in several respects. The document is dated to Year 33 of the Hyksos king Apophis and also contains a separate later Year 11 on its verso likely from his successor, Khamudi.\nIn the opening paragraphs of the papyrus, Ahmes presents the papyrus as giving \"Accurate reckoning for inquiring into things, and the knowledge of all things, mysteries...all secrets\". He continues with:\n\nThis book was copied in regnal year 33, month 4 of Akhet, under the majesty of the King of Upper and Lower Egypt, Awserre, given life, from an ancient copy made in the time of the King of Upper and Lower Egypt Nimaatre . The scribe Ahmose writes this copy.\n\nSeveral books and articles about the Rhind Mathematical Papyrus have been published, and a handful of these stand out. The Rhind Papyrus was published in 1923 by Peet and contains a discussion of the text that followed Griffith's Book I, II and III outline  Chace published a compendium in 1927/29 which included photographs of the text. A more recent overview of the Rhind Papyrus was published in 1987 by Robins and Shute.", "title": "Rhind Papyrus"}