{"summary": "Riots happen when many people meet to be violent.", "full_text": "A riot  is a form of civil disorder commonly characterized by a group lashing out in a violent public disturbance against authority, property or people. Riots typically involve vandalism and the destruction of property, public or private. The property targeted varies depending on the riot and the inclinations of those involved. Targets can include shops, cars, restaurants, state-owned institutions, and religious buildings.\nRiots often occur in reaction to a perceived grievance or out of dissent. Historically, riots have occurred due to poor working or living conditions, governmental oppression, taxation or conscription, conflicts between ethnic groups,  or religions , the outcome of a sporting event  or frustration with legal channels through which to air grievances.\nWhile individuals may attempt to lead or control a riot, riots typically consist of disorganized groups that are frequently \"chaotic and exhibit herd behavior.\" However, there is a growing body of evidence to suggest that riots are not irrational, herd-like behavior, but actually follow inverted social norms.\nT. S. Ashton, in his study of food riots among colliers, noted that \"the turbulence of the colliers is, of course, to be accounted for by something more elementary than politics: it was the instinctive reaction of virility to hunger.\" Charles Wilson noted, \"Spasmodic rises in food prices provoked keelmen on the Tyne to riot in 1709, tin miners to plunder granaries at Falmouth in 1727.\"\nToday, some rioters have an improved understanding of the tactics used by police in riot situations. Manuals for successful rioting are available on the internet, with tips such as encouraging rioters to get the press involved, as there is more safety and attention with the cameras rolling. Citizens with video cameras may also have an effect on both rioters and police.\nDealing with riots is often a difficult task for police forces. They may use tear gas or CS gas to control rioters. Riot police may use less-than-lethal methods of control, such as shotguns that fire flexible baton rounds to injure or otherwise incapacitate rioters for easier arrest.", "title": "Riot"}