{"summary": "The RMS Lusitania was a British cruise-liner.", "full_text": "RMS Lusitania was a British ocean liner, holder of the Blue Riband, and briefly the world's largest passenger ship until the completion of her running mate Mauretania. She was launched by the Cunard Line in 1906, at a time of fierce competition for the North Atlantic trade. On 7 May 1915, she was torpedoed and sunk by a German U-boat, causing the deaths of 1,198 passengers and crew. She had made a total of 202 trans-Atlantic crossings.\nGerman shipping lines were aggressive competitors in the transatlantic trade, and Cunard responded by trying to outdo them in speed, capacity and luxury. Lusitania and Mauretania were fitted with revolutionary new turbine engines, able to maintain a service speed of 25 knots . Equipped with lifts, wireless telegraph and electric light, they provided 50% more passenger space than any other ship, and the first class decks were noted for their sumptuous furnishings.\nWhen RMS Lusitania left New York for Liverpool on what would be her final voyage on 1 May 1915, submarine warfare was intensifying in the Atlantic. Germany had declared the seas around the United Kingdom a war zone, and the German embassy in the United States had placed a newspaper advertisement warning people of the dangers of sailing on Lusitania. On the afternoon of 7 May, Lusitania was torpedoed by a German U-Boat, 11 mi  off the southern coast of Ireland and inside the declared \"zone of war\". A second internal explosion sent her to the bottom in 18 minutes.\nIn firing on a non-military ship without warning, the Germans had breached the international laws known as the Cruiser Rules. Although the Germans had reasons for treating Lusitania as a naval vessel, including the facts that the ship was carrying war munitions and the British had been breaching the Cruiser Rules, the sinking caused a storm of protest in the United States, as 128 Americans were among the dead. The ship's sinking provided Britain with a propaganda opportunity, which helped shift public opinion in the United States against Germany and strongly influenced America's eventual declaration of war two years later, in 1917.", "title": "RMS Lusitania"}