{"summary": "Robert William Holley  was an American biochemist.", "full_text": "Robert William Holley  was an American biochemist. He shared the Nobel Prize in Physiology or Medicine in 1968  for describing the structure of alanine transfer RNA, linking DNA and protein synthesis.\nHolley was born in Urbana, Illinois, and graduated from Urbana High School in 1938. He went on to study chemistry at the University of Illinois at Urbana-Champaign, graduating in 1942 and commencing his PhD studies in organic chemistry at Cornell University. During World War II Holley spent two years working under Professor Vincent du Vigneaud at Cornell University Medical College, where he was involved in the first chemical synthesis of penicillin. Holley completed his PhD studies in 1947.*USDA ARS.\nFollowing his graduate studies Holley remained associated with Cornell. He became an Assistant Professor of organic chemistry in 1948, and was appointed as Professor of Biochemistry in 1962. He began his research on RNA after spending a year's sabbatical  studying with James F. Bonner at the California Institute of Technology.\nHolley's research on RNA focused first on isolating transfer RNA , and later on determining the sequence and structure of alanine tRNA, the molecule that incorporates the amino acid alanine into proteins. Holley's team of researchers determined the tRNA's structure by using two ribonucleases to split the tRNA molecule into pieces. Each enzyme split the molecule at location points for specific nucleotides. By a process of \"puzzling out\" the structure of the pieces split by the two different enzymes, then comparing the pieces from both enzyme splits, the team eventually determined the entire structure of the molecule.\nThe structure was completed in 1964, and was a key discovery in explaining the synthesis of proteins from messenger RNA. It was also the first nucleotide sequence of a ribonucleic acid ever determined. Holley was awarded the Nobel Prize in Physiology or Medicine in 1968 for this discovery, and Har Gobind Khorana and Marshall W. Nirenberg were also awarded the prize that year for contributions to the understanding of protein synthesis.\nUsing the Holley team's method, other scientists determined the structures of the remaining tRNA's. A few years later the method was modified to help track the sequence of nucleotides in various bacterial, plant, and human viruses.\nIn 1968 Holley became a resident fellow at the Salk Institute for Biological Studies in La Jolla, California.\nHolley was married to Ann Dworkin .", "title": "Robert W. Holley"}