{"summary": "Texas is the second largest state in the United States.", "full_text": "Robert Lee is a city in and the county seat of Coke County, Texas, United States. The population was 1,049 at the 2010 census.\nThe founders named the city after Robert E. Lee who is thought to have set up camp for a time near the current townsite on the Colorado River. Lee served in Texas from 1856 to 1861 as a lieutenant colonel in the U.S. Army Second Cavalry, during which time he distinguished himself as a scout and engineer.\nThe town of Robert Lee is located on the Colorado River. Just upstream from the town is E.V. Spence Reservoir, managed by the Colorado River Municipal Water District. From the mid-1960s until approximately 1996, the reservoir's population of striped bass attracted sportsmen from across the southwestern U.S., providing significant income to the town. In the late 1990s, however, water use policies changed and the reservoir water levels were continually lowered until the striped bass population could no longer be sustained.\nIn addition to a once-great fishery, the area around Robert Lee supports a significant population of white-tailed deer, which can be a nuisance to local ranchers and farmers, but attracts large numbers of hunters during the annual hunting seasons. A very diverse set of wildlife occurs in the area, both native and migratory. Several species of birds, reptiles, and mammals make this part of Texas their home on either a temporary or permanent basis.\nRobert Lee and the surrounding area has a rich Native American history. Indian relics and artifacts such as arrowheads, spearpoints, and other tools are commonly found throughout the area.\n^ \"American FactFinder\". United States Census Bureau. Retrieved 2008-01-31. \n^ \"US Board on Geographic Names\". United States Geological Survey. 2007-10-25. Retrieved 2008-01-31. \n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ \"Profile of General Population and Housing Characteristics: 2010 Demographic Profile Data : Robert Lee city, Texas\". U.S. Census Bureau, American Factfinder. Retrieved March 28, 2012.", "title": "Robert Lee, Texas"}