{"summary": "Robert Michael Gates  was the 22nd United States Secretary of Defense.", "full_text": "Robert Michael Gates  is an American statesman, scholar and university president who served as the 22nd United States Secretary of Defense from 2006 to 2011. Gates served for 26 years in the Central Intelligence Agency and the National Security Council, and was Director of Central Intelligence under President George H. W. Bush. Gates was also an officer in the United States Air Force and during the early part of his military career, he was recruited by the CIA. After leaving the CIA, Gates became president of Texas A&M University and was a member of several corporate boards. Gates served as a member of the Iraq Study Group, the bipartisan commission co-chaired by James A. Baker III and Lee H. Hamilton, that studied the lessons of the Iraq War.\nGates was nominated by Republican President George W. Bush as Secretary of Defense after the 2006 election, replacing Donald Rumsfeld. He was confirmed with bipartisan support. In a 2007 profile written by former National Security Advisor Zbigniew Brzezinski, Time named Gates one of the year's most influential people. In 2008, Gates was named one of America's Best Leaders by U.S. News & World Report. He continued to serve as Secretary of Defense in President Barack Obama's administration. He retired in 2011. \"He'll be remembered for making us aware of the danger of over-reliance on military intervention as an instrument of American foreign policy,\" said former Senator David L. Boren. Gates was presented the Presidential Medal of Freedom, the nation's highest civilian award, by President Obama during his retirement ceremony. According to a Washington Post book review, he is \"widely considered the best defense secretary of the post-World War II era\".\nSince leaving the Obama Administration, Gates has been elected President of the Boy Scouts of America, served as Chancellor of the College of William & Mary, and become a member of several corporate boards.", "title": "Robert Gates"}