{"summary": "Rochester is the third-largest city in the U.S.", "full_text": "Rochester  is a city and the county seat of Monroe County, bordering the southern shore of Lake Ontario in the western portion of the U.S. state of New York. Throughout its history, Rochester has acquired several nicknames; it has been known as \"the World's Image Center\", \"the Flour City\", \"the Flower City\", and most recently as \"the Photonics Capital of the world\". It hosts the Lilac Festival every year to celebrate its history as \"the Flower City\".\nRochester's city population according to the 2010 census is approximately 210,565, making it New York's third most populous city after New York City and Buffalo. It is at the center of a larger metropolitan area which encompasses and extends beyond Monroe County and includes Genesee County, Livingston County, Ontario County, Orleans County and Wayne County. This area, which is part of the Western New York region, had a population of 1,079,671 people at the time of the 2010 Census. As of July 1, 2012 estimates indicated that this population rose to 1,082,284. Rochester was one of America's first \"boomtowns\" and rose to prominence initially as the site of many flour mills located on the Genesee River, then as a major manufacturing hub. Rochester is now an international center of higher education, as well as medical and technological development. The region is known for many acclaimed universities, and several of them  are nationally renowned for their research programs. In addition, Rochester has been and continues to be the site of many important inventions and innovations in consumer products. The Rochester area is the birthplace to corporations such as Kodak, Bausch & Lomb and Xerox that conduct extensive research and manufacturing in the fields of industrial and consumer products. Until 2010, the Rochester metropolitan area was the second largest regional economy in New York State according to the U.S. Internal Revenue Service, after the New York City metropolitan area. Rochester's GMP has since ranked just below that of Buffalo, New York, while still exceeding it in per-capita income.\nRochester was ranked as the \"most livable city\" among 379 U.S. metropolitan areas in the 25th edition  of the Places Rated Almanac. In 2010 Forbes rated Rochester as the third best place to raise a family. In 2012 Kiplinger rated Rochester as the fifth best city for families, citing low cost of living, top public schools, and a low jobless rate.", "title": "Rochester, New York"}