{"summary": "Rod Stewart  is a British pop singer.", "full_text": "Roderick David \"Rod\" Stewart, CBE  is a British rock singer-songwriter. Born and raised in London, he is of English and Scottish ancestry. Stewart is one of the best-selling music artists of all time, having sold over 100 million records worldwide.\nHe has had six consecutive number one albums in the UK, and his tally of 62 UK hit singles includes 31 that reached the top 10, six of which gained the number one position. He has had 16 top ten singles in the US, with four reaching number one on the Billboard Hot 100. In 2007, he received a CBE at Buckingham Palace for services to music.\nWith his distinctive raspy singing voice, Stewart came to prominence in the late 1960s and early 1970s with The Jeff Beck Group and then with Faces, though his music career had begun in 1962 when he took up busking with a harmonica. In October 1963 he joined the Dimensions as a harmonica player and part-time vocalist, then in 1964 he joined Long John Baldry and the All Stars. Later, in August 1964, he also signed a solo contract, releasing his first solo single, \"Good Morning Little Schoolgirl\", in October of the same year. He maintained a solo career alongside a group career, releasing his debut solo album An Old Raincoat Won't Ever Let You Down , in 1969. His early albums were a fusion of rock, folk music, soul music and R&B. His aggressive blues work with The Jeff Beck Group and the Faces influenced heavy metal genres. From the late 1970s through the 1990s, Stewart's music often took on a new wave or soft rock/middle-of-the-road quality, and in the early 2000s he released a series of successful albums interpreting the Great American Songbook.\nIn 2008, Billboard magazine ranked him the 17th most successful artist on the \"Billboard Hot 100 All-Time Top Artists\". A Grammy and Brit Award recipient, he was voted at No. 33 in Q Magazine's list of the top 100 Greatest Singers of all time, and No. 59 on Rolling Stone 100 Greatest Singers of all time. As a solo artist, Stewart was inducted into the US Rock and Roll Hall of Fame in 1994, the UK Music Hall of Fame in 2006 and was inducted a second time into the US Rock and Roll Hall of Fame in 2012, as a member of the Faces.\n\n", "title": "Rod Stewart"}