{"summary": "Rodents are a very successful group of mammals.", "full_text": "Rodents  are mammals of the order Rodentia, which are characterized by a single pair of unremittingly growing incisors in each of the upper and lower jaws. About forty percent of all mammal species are rodents; they are found in vast numbers on all continents except Antarctica. They are the most diversified mammalian order and live in a variety of terrestrial habitats, including human-made environments. There are species that are arboreal, fossorial , and semiaquatic. Well-known rodents include mice, rats, squirrels, prairie dogs, porcupines, beavers, guinea pigs, hamsters, and capybaras. Other animals such as rabbits, hares and pikas were once included with them, but are now considered to be in a separate order, Lagomorpha.\nMost rodents are small animals with robust bodies, short limbs and long tails. They use their sharp incisors to gnaw food, excavate burrows and defend themselves. Most eat seeds or other plant material, but some have more varied diets. They tend to be social animals and many species live in societies with complex ways of communicating with each other. Mating among rodents can vary from monogamy, to polygyny, to promiscuity. Many have litters of underdeveloped, altricial young, while others have precocial young that are relatively well developed at birth.\nThe rodent fossil record dates back to the Paleocene on the supercontinent of Laurasia. They greatly diversified in the Eocene, as they spread across continents, sometimes even finding means to cross oceans. Rodents reached both South America and Madagascar from Africa, and were the only terrestrial placental mammals to reach and colonize Australia.\nRodents have been used as food, for clothing, as pets and as laboratory animals in research. Some species, in particular the brown rat, the black rat, and the house mouse are serious pests, eating and spoiling food stored by humans, and spreading diseases. Accidentally introduced species of rodents are often considered to be invasive, as they sometimes threaten the survival of native species, such as island birds, previously isolated from land-based predators.", "title": "Rodents"}