{"summary": "Roger Federer  is a professional Swiss tennis player.", "full_text": "Roger Federer  is a Swiss professional tennis player who is currently ranked world No. 3 by the Association of Tennis Professionals . Many commentators and players regard Federer as the greatest tennis player of all time. Federer turned professional in 1998 and has been continuously ranked inside the top 10 since October 2002.\nFederer holds several records of the Open Era: holding the world No. 1 position for 302 weeks ; winning 17 Grand Slam singles titles; reaching each Grand Slam final at least five times ; and reaching the Wimbledon final ten times. He is among the seven men  to capture a career Grand Slam. Federer shares an Open Era record for most titles at Wimbledon with Pete Sampras  and at the US Open with Jimmy Connors and Sampras .\nFederer has reached 27 men's singles Grand Slam finals, including 10 in a row from the 2005 Wimbledon Championships to the 2007 US Open, both statistics being records. He also appeared in 18 of 19 finals from the 2005 Wimbledon through to the 2010 Australian Open. He reached the semifinals at 23 consecutive Grand Slam tournaments, from the 2004 Wimbledon Championships through the 2010 Australian Open. At the 2015 US Open, he played in a record 64th consecutive Grand Slam tournament, reached a record 46th Grand Slam quarterfinal, a record 38th Grand Slam semifinal and a record 27th Grand Slam final. Earlier at the 2013 French Open, Federer reached a record 36th consecutive Grand Slam quarterfinal. Federer has won the most matches in Grand Slams  and is the first to record 65+ wins at each Grand Slam tournament.\nFederer's ATP tournament records include winning a record six ATP World Tour Finals, playing in the finals at all nine ATP Masters 1000 tournaments , and having won the most prize money of any player in history. He also won the Olympic gold medal in doubles with his compatriot Stan Wawrinka at the 2008 Summer Olympic Games and the Olympic silver medal in singles at the 2012 Summer Olympic Games. Representing Switzerland, he was a part of the 2014 winning Davis Cup team. He spent eight years  continuously in the top 2 in the year-end men's rankings and ten  in the top 3. He was named the Laureus World Sportsman of the Year for a record four consecutive years .\n\n", "title": "Roger Federer"}