{"summary": "Romansh  is one of Switzerland's four national languages.", "full_text": "Romansh  is a Romance language spoken predominantly in the southeastern Swiss canton of Grisons , where it has official status alongside German and Italian and is used as the medium of instruction of schools in Romansh-speaking areas. Romansh has also been recognized as a national language of Switzerland since 1938 and as an official language along with German, French and Italian since 1996. It is sometimes grouped with Ladin and Friulian as a Rhaeto-Romance language, though this is disputed.\nRomansh is a descendant of the spoken Latin language of the Roman Empire, which by the 5th century AD replaced the Celtic and Raetic languages previously spoken in the area, although Romansh retains a small number of words from these languages. Romansh has also been heavily influenced by German in vocabulary and morphosyntax. The language gradually retreated to its current area over the centuries, being replaced by Alemannic and Bavarian dialects. The earliest writing identified as Romansh dates from the 10th or 11th century, although major works do not appear until the 16th century when several regional written varieties began to develop. The 19th century saw a further shrinkage of the language area but also a literary revival and the start of a language movement dedicated to halting the decline of the language.\nIn the 2000 Swiss census, 35,095 people  indicated Romansh as the language of \"best command\", and 61,815 as a \"regularly spoken\" language. In 2010, Switzerland switched to a yearly system which uses a combination of municipal citizen records and a limited number of surveys. Based on this yearly system, the number of people aged 15 and above reporting Romansh as their main language was 36,622 in 2012. Spoken by around 0.9% of Switzerland's 7.7 million inhabitants, Romansh is Switzerland's least-used national language in terms of number of speakers and the eleventh most spoken language in Switzerland overall. The language area and number of speakers of Romansh has been continually shrinking over the past, though language use remains vigorous in certain regions.\nRomansh is divided into five different regional dialects , each with its own standardized written language. In addition, a pan-regional variety called Rumantsch Grischun was introduced in 1982, which is controversial among Romansh speakers.", "title": "Romansh language"}