{"summary": "The Roman Republic was a phase in history of the Ancient Roman Civilization.", "full_text": "The Roman Republic  was the period of ancient Roman civilization beginning with the overthrow of the Roman Kingdom, traditionally dated to 509 BC, and ending in 27 BC with the establishment of the Roman Empire. It was during this period that Rome's control expanded from the city's immediate surroundings to hegemony over the entire Mediterranean world. During the first two centuries of its existence the Roman Republic expanded through a combination of conquest and alliance, from central Italy to the entire Italian peninsula. By the following century it included North Africa, Spain, and what is now southern France. Two centuries after that, towards the end of the 1st century BC, it included the rest of modern France, Greece, and much of the eastern Mediterranean. By this time, internal tensions led to a series of civil wars, culminating with the assassination of Julius Caesar, which led to the transition from republic to empire. The exact date of transition can be a matter of interpretation. Historians have variously proposed Julius Caesar's crossing of the Rubicon River in 49 BC, Caesar's appointment as dictator for life in 44 BC, and the defeat of Mark Antony and Cleopatra at the Battle of Actium in 31 BC. However, most use the same date as did the ancient Romans themselves, the Roman Senate's grant of extraordinary powers to Octavian and his adopting the title Augustus in 27 BC, as the defining event ending the Republic.\nRoman government was headed by two consuls, elected annually by the citizens and advised by a senate composed of appointed magistrates. As Roman society was very hierarchical by modern standards, the evolution of the Roman government was heavily influenced by the struggle between the patricians, Rome's land-holding aristocracy, who traced their ancestry to the founding of Rome, and the plebeians, the far more numerous citizen-commoners. Over time, the laws that gave patricians exclusive rights to Rome's highest offices were repealed or weakened, and leading plebeian families became full members of the aristocracy. The leaders of the Republic developed a strong tradition and morality requiring public service and patronage in peace and war, making military and political success inextricably linked. Many of Rome's legal and legislative structures  can still be observed throughout Europe and much of the world in modern nation states and international organizations.", "title": "Roman Republic"}