{"summary": "The Catholic Church is a denomination of Christianity.", "full_text": "The Catholic Church, also known as the Roman Catholic Church, is the largest Christian church, with more than 1.25 billion members worldwide. One of the oldest religious institutions in the world, it has played a prominent role in the development and history of Western civilisation. Headed by the Bishop of Rome, known as the Pope, its doctrines are summarised in the Nicene Creed. The Catholic Church is also distinguished by its celebration of the seven sacraments.\nThe Catholic Church teaches that it is the one true church founded by Jesus Christ, that its bishops are the successors of Christ's apostles, and that the Pope is the successor to Saint Peter. The Church maintains that the doctrine on faith and morals that it declares as definitive is infallible. The Latin Church, the autonomous Eastern Catholic Churches and religious institutes such as the Jesuits, mendicant orders and enclosed monastic orders, reflect a variety of theological emphases in the Church.\nOf the seven sacraments, the principal one is the Eucharist, celebrated liturgically in the Mass. The church teaches that through consecration by a priest, bread and wine become the body and blood of Christ. The Catholic Church practises closed communion, with only baptised members in a state of grace ordinarily permitted to receive it.\nThe Catholic Church venerates Mary as Mother of God and Queen of Heaven and practises numerous Marian devotions. It has defined four Marian dogmatic teachings: her immaculate conception without original sin, her status as the Mother of God, her perpetual virginity and her bodily assumption into Heaven at the end of her earthly life.\nCatholic spiritual teaching includes spreading the Gospel while Catholic social teaching emphasises support for the sick, the poor and the afflicted through corporal works of mercy. The Catholic Church is the largest non-government provider of education and medical services in the world.\nIn the late 20th century, the Catholic Church was criticised for its doctrines on sexuality and the ordination of women and its handling of sexual abuse cases.", "title": "Roman Catholic Church"}