{"summary": "A Christian calendar can be any calendar used by various Christian Churches for the Church year, called \"liturgical year\".", "full_text": "For historical forms of the General Roman Calendar, see Tridentine Calendar, General Roman Calendar of 1954, General Roman Calendar of Pope Pius XII, General Roman Calendar of 1960, and General Roman Calendar of 1969.\nThe General Roman Calendar is the liturgical calendar that indicates the dates of celebrations of saints and \"mysteries of the Lord\" in the Roman Rite, wherever this liturgical rite is in use. These celebrations may be linked to a fixed date or may be related to a particular day of the week  or to the date of Easter . National and diocesan liturgical calendars, including that of the diocese of Rome itself, as well as the calendars of religious institutes and even of continents, add other saints and mysteries or transfer the celebration of a particular saint or mystery from the date assigned in the General Calendar to another date.\nThese liturgical calendars also indicate the degree or rank of each celebration: Memorial , Feast or Solemnity. Among other differences, the Gloria is said or sung at the Mass of a Feast, but not at that of a Memorial, and the Creed is added on Solemnities.\nThe last general revision of the General Roman Calendar was in 1969 and was authorized by the motu proprio Mysterii Paschalis of Pope Paul VI. The motu proprio and the decree of promulgation were included in the book Calendarium Romanum, published in the same year by Libreria Editrice Vaticana. This contained also the official document Universal Norms on the Liturgical Year and the Calendar, and the list of celebrations of the General Roman Calendar. Both these documents are also printed in the Roman Missal, after General Instruction of the Roman Missal. The 1969 book also provided a detailed unofficial commentary on that year's revision of the calendar, on which see the Wikipedia article on the motu proprio.\nThe contents of the General Roman Calendar and the names in English of the celebrations included in it are here indicated in the official English version of the Roman Missal.", "title": "Roman Catholic calendar of saints"}