{"summary": "Rosa Louise McCauley Parks  was an African-American civil rights activist.", "full_text": "Rosa Louise McCauley Parks  was an African-American Civil Rights activist, whom the United States Congress called \"the first lady of civil rights\" and \"the mother of the freedom movement\". Her birthday, February 4, and the day she was arrested, December 1, have both become Rosa Parks Day, commemorated in both California and Ohio.\nOn December 1, 1955, in Montgomery, Alabama, Parks refused to obey bus driver James F. Blake's order to give up her seat in the colored section to a white passenger, after the white section was filled. Parks was not the first person to resist bus segregation. Others had taken similar steps, including Bayard Rustin in 1942, Irene Morgan in 1946, Sarah Louise Keys in 1952, and the members of the ultimately successful Browder v. Gayle lawsuit  who were arrested in Montgomery for not giving up their bus seats months before Parks. NAACP organizers believed that Parks was the best candidate for seeing through a court challenge after her arrest for civil disobedience in violating Alabama segregation laws, although eventually her case became bogged down in the state courts while the Browder v. Gayle case succeeded.\nParks' act of defiance and the Montgomery Bus Boycott became important symbols of the modern Civil Rights Movement. She became an international icon of resistance to racial segregation. She organized and collaborated with civil rights leaders, including Edgar Nixon, president of the local chapter of the NAACP; and Martin Luther King, Jr., a new minister in town who gained national prominence in the civil rights movement.\nAt the time, Parks was secretary of the Montgomery chapter of the NAACP. She had recently attended the Highlander Folk School, a Tennessee center for training activists for workers' rights and racial equality. She acted as a private citizen \"tired of giving in\". Although widely honored in later years, she also suffered for her act; she was fired from her job as a seamstress in a local department store, and received death threats for years afterwards. Her situation also opened doors.\nShortly after the boycott, she moved to Detroit, where she briefly found similar work. From 1965 to 1988 she served as secretary and receptionist to John Conyers, an African-American U.S. Representative. She was also active in the Black Power movement and the support of political prisoners in the US.\nAfter retirement, Parks wrote her autobiography and lived a largely private life in Detroit. In her final years, she suffered from dementia. Parks received national recognition, including the NAACP's 1979 Spingarn Medal, the Presidential Medal of Freedom, the Congressional Gold Medal, and a posthumous statue in the United States Capitol's National Statuary Hall. Upon her death in 2005, she was the first woman and third non-U.S. government official to lie in honor at the Capitol Rotunda.\n\n", "title": "Rosa Parks"}