{"summary": "Roy Kaur Orbison  was an American singer.", "full_text": "Roy Kelton Orbison , also known by his nickname The Big O, was an American singer-songwriter and musician, best known for his trademark sunglasses, distinctive, powerful voice, complex compositions, and dark emotional ballads. Orbison grew up in Texas and began singing in a rockabilly/country and western band in high school until he was signed by Sun Records in Memphis. His greatest success came with Monument Records between 1960 and 1964, when 22 of his songs placed on the Billboard Top 40, including \"Only the Lonely\", \"Crying\", and \"Oh, Pretty Woman\". His career stagnated through the 1970s, but was revived by several covers of his songs and the use of \"In Dreams\" in David Lynch's film Blue Velvet .\nIn 1988, he joined the Traveling Wilburys supergroup with George Harrison, Bob Dylan, Tom Petty, and Jeff Lynne and also released a new solo album. He died of a heart attack in December that year, at the zenith of his resurgence. His life was marred by tragedy, including the death of his first wife and his two eldest sons in separate accidents.\nOrbison's vocal instrument bridged the gap between baritone and tenor, and music scholars have suggested that he had a three- or four-octave range. The combination of Orbison's powerful, impassioned voice and complex musical arrangements led many critics to refer to his music as operatic, giving him the sobriquet \"the Caruso of Rock\". Elvis Presley as well as Petty and Dylan, have stated his voice was, respectively, the greatest and most distinctive they had ever heard. While most male performers in rock and roll in the 1950s and 1960s projected a defiant masculinity, many of Orbison's songs instead conveyed a quiet, desperate vulnerability. He was known for performing while standing still and solitary and for wearing black clothes and dark sunglasses, which lent an air of mystery to his persona.\nOrbison was initiated into the second class of the Rock and Roll Hall of Fame in 1987 by longtime admirer Bruce Springsteen. The same year he was inducted into the Nashville Songwriters Hall of Fame, and the Songwriters Hall of Fame two years later. Rolling Stone placed Orbison at number 37 on their list of The Greatest Artists of All Time, and number 13 on their list of The 100 Greatest Singers of All Time. In 2002, Billboard magazine listed Orbison at number 74 in the Top 600 recording artists. In 2014, Orbison was elected to America's Pop Music Hall of Fame.", "title": "Roy Orbison"}