{"summary": "Rugby union is a ball sport.", "full_text": "Rugby union, or simply rugby, is a contact team sport which originated in England in the first half of the 19th century. One of the two codes of rugby football, it is based on running with the ball in hand. In its most common form, a game is between two teams of 15 players using an oval-shaped ball on a rectangular field with H-shaped goalposts on each try line.\nIn 1845, the first football laws were written by Rugby School pupils; other significant events in the early development of rugby include the Blackheath Club's decision to leave the Football Association in 1863 and the split between rugby union and rugby league in 1895. Historically an amateur sport, in 1995 restrictions on payments to players were removed, making the game openly professional at the highest level for the first time.\nWorld Rugby, originally the International Rugby Football Board  and from 1998 to 2014 the International Rugby Board , has been the governing body for rugby union since 1886. Rugby union spread from the Home Nations of Great Britain and Ireland, and was absorbed by many of the countries associated with the British Empire. Early exponents of the sport included Australia, New Zealand, South Africa and France. Countries that have adopted rugby union as their de facto national sport include Fiji, Georgia, Madagascar, New Zealand, Samoa, Tonga and Wales. Rugby union is played in over 100 countries across six continents; there are 101 full members and 18 associate members of World Rugby.\nThe Rugby World Cup, first held in 1987, takes place every four years with the winner of the tournament receiving the Webb Ellis Cup. The Six Nations Championship in Europe and The Rugby Championship in the Southern Hemisphere are major annual competitions.\nMajor domestic competitions include the English Premiership in England, Top 14 in France, the ITM Cup in New Zealand and the Currie Cup in South Africa. Other transnational competitions include the Pro12, involving Irish, Italian, Scottish and Welsh teams; the European Rugby Champions Cup, involving the top European teams from their respective domestic competitions; and Super Rugby, involving Australian, New Zealand and South African teams and set to add teams in Argentina and Japan in 2016.", "title": "Rugby union"}