{"summary": "Chen-Ning Franklin Yang , also known as Yang Zhenning, is a Chinese-born American physicist and mathematician.", "full_text": "Founded in 1796, the Rumford Prize, awarded by the American Academy of Arts and Sciences, is one of the oldest scientific prizes in the United States. The prize recognizes contributions by scientists to the fields of heat and light. These terms are widely interpreted; awards range from discoveries in thermodynamics to improvements in the construction of steam boilers.\nThe award was created through the endowment of US$5,000 to the Academy by Benjamin Thompson, who held the title \"Count Rumford of the United Kingdom\", in 1796. The terms state that the award be given to \"authors of discoverie's in any part of the Continent of America, or in any of the American islands\". Although it was founded in 1796, the first prize was not given until 1839, as the academy could not find anyone who, in their judgement, deserved the award. The academy found the terms of the prize to be too restrictive, and in 1832 the Supreme Court of Massachusetts allowed the Academy to change some of the provisions; mainly, the award was to be given annually instead of biennially, and the Academy was allowed to award the prize as it saw fit, whereas before it had to give it yearly. The first award was given to Robert Hare, for his invention of the oxy-hydrogen blowpipe, in 1839. Twenty-three years elapsed before the award was given a second time, to John Ericsson.\nThe prize is awarded whenever the academy recognizes a significant achievement in either of the two fields. It has been given 62 times to 79 individuals, and once to a tri-group committee of 21 people. Awardees receive a gold-and-silver medal. Previous prizewinners include Thomas Alva Edison, for his investigations in electric lighting; Enrico Fermi, for his studies of radiation theory and nuclear energy; and Charles H. Townes, for his development of the laser. One man, Samuel Pierpont Langley, has won both the Rumford Prize and the related Rumford Medal , both in 1886. Because the prize is awarded by the American Academy of Arts and Sciences, all of the recipients are American, except for one, John Stanley Plaskett, who is from British Columbia. The most recent award was given in 2008 to Sidney D. Drell, Sam Nunn, William J. Perry, and George P. Shultz \"for their efforts to reduce the global threat of nuclear weapons\".", "title": "Rumford Prize"}