{"summary": "August 31 is the 243rd day of the year  in the Gregorian calendar.", "full_text": "The Russian apartment bombings were a series of explosions that hit four apartment blocks in the Russian cities of Buynaksk, Moscow and Volgodonsk in September 1999, killing 307 and injuring more than 1700 people and spreading a wave of fear across the country. The bombings, together with the Dagestan War, led the country into the Second Chechen War.\nThe blasts hit Buynaksk on 4 September, Moscow on 9 September and 13 September and Volgodonsk on 16 September. A similar explosive device was found and defused in an apartment block in the Russian city of Ryazan on 22 September. The next day Prime Minister of Russia Vladimir Putin praised the vigilance of the inhabitants of Ryazan and ordered the air bombing of Grozny, which marked the beginning of the Second Chechen War. According to the official version and sentences of judicial authorities of Russia, acts of terrorism were organized and financed by heads of the illegal armed group Islamic institute \"Caucasus\". Thirty-six hours later, three FSB agents who had planted this device were arrested by the local police. The incident was declared to be a training exercise. These events led to allegations that the bombings were a \"false flag\" attack perpetrated by the FSB in order to legitimize the resumption of military activities in Chechnya and bring Vladimir Putin to the presidency.\nParliament member Yuri Shchekochikhin filed two motions for a parliamentary investigation of the events, but the motions were rejected by the Russian Duma in March 2000. An independent public commission to investigate the bombings was chaired by Duma deputy Sergei Kovalev. The commission was rendered ineffective because of government refusal to respond to its inquiries. Two key members of the Kovalev Commission, Sergei Yushenkov and Yuri Shchekochikhin, have since died in apparent assassinations. The Commission's lawyer Mikhail Trepashkin was arrested.\nThe official Russian investigation of the bombings was completed in 2002 and concluded that all the bombings were organized and led by Achemez Gochiyaev, who remains at large, and ordered by Islamist warlords Ibn Al-Khattab and Abu Omar al-Saif, who have been killed. Five other suspects have been killed and six have been convicted by Russian courts on terrorism-related charges.\nYury Felshtinsky, Alexander Litvinenko, Boris Berezovsky, David Satter, Boris Kagarlitsky, Vladimir Pribylovsky, and the secessionist Chechen authorities claimed that the 1999 bombings were a false flag attack coordinated by the FSB in order to win public support for a new full-scale war in Chechnya, which boosted Prime Minister and former FSB Director Vladimir Putin's popularity, and brought the pro-war Unity Party to the State Duma and Putin to the presidency within a few months. This theory has been criticized by Robert Bruce Ware, Henry Plater-Zyberk, and Simon Saradzhyan.", "title": "Russian apartment bombings"}