{"summary": "Ryan White  is a Canadian professional ice hockey centre currently with the Montreal Canadiens organization of the National Hockey League .", "full_text": "Ryan Wayne White  was an American teenager from Kokomo, Indiana, who became a national poster child for HIV/AIDS in the United States after being expelled from middle school because of his infection. As a hemophiliac, he became infected with HIV from a contaminated blood treatment and, when diagnosed in December 1984, was given six months to live. Doctors said he posed no risk to other students, but AIDS was poorly understood at the time. When White tried to return to school, many parents and teachers in Kokomo rallied against his attendance due to concerns of the disease spreading through bodily fluid transfer. Western School was actually located in Russiaville outside of Kokomo and was not part of the local Kokomo school system. A lengthy legal battle with the school system ensued, and media coverage of the case made White into a national celebrity and spokesman for AIDS research and public education. Surprising his doctors, White lived five years longer than predicted but died in April 1990, one month before his high school graduation.\nBefore White, AIDS was a disease widely associated with the male gay community, because it was first diagnosed among gay men. That perception shifted as White and other prominent HIV-infected people such as Magic Johnson, Arthur Ashe, the Ray brothers, and Kimberly Bergalis appeared in the media to advocate for more AIDS research and public education to address the epidemic. The U.S. Congress passed a major piece of AIDS legislation, the Ryan White Care Act, shortly after White's death. The Act has been reauthorized twice; Ryan White Programs are the largest provider of services for people living with HIV/AIDS in the United States.\n^ \"A Timeline of Key Events in Ryan's Life\". Ryanwhite.com. Archived from the original on 2007-10-12. Retrieved 2009-12-02. \n^", "title": "Ryan White"}