{"summary": "Quantum mechanics  is the part of physics that tells us how the things that make up atoms work.", "full_text": "The Rydberg formula is used in atomic physics to describe the wavelengths of spectral lines of many chemical elements. It was formulated by the Swedish physicist Johannes Rydberg, and presented on 5 November 1888.\nIn 1880, Rydberg worked on a formula describing the relation between the wavelengths in spectral lines of alkali metals. He noticed that lines came in series and he found that he could simplify his calculations by using the wavenumber  as his unit of measurement. He plotted the wavenumbers  of successive lines in each series against consecutive integers which represented the order of the lines in that particular series. Finding that the resulting curves were similarly shaped, he sought a single function which could generate all of them, when appropriate constants were inserted.\nFirst he tried the formula: , where n is the line's wavenumber, n0 is the series limit, m is the line's ordinal number in the series, m' is a constant different for different series and C0 is a universal constant. This did not work very well.\nRydberg was trying:  when he became aware of Balmer's formula for the hydrogen spectrum  In this equation, m is an integer and h is a constant .\nRydberg therefore rewrote Balmer's formula in terms of wavenumbers, as .\nThis suggested that the Balmer formula for hydrogen might be a special case with  and , where , the reciprocal of Balmer's constant .\nThe term Co was found to be a universal constant common to all elements, equal to 4/h. This constant is now known as the Rydberg constant, and m' is known as the quantum defect.\nAs stressed by Niels Bohr, expressing results in terms of wavenumber, not wavelength, was the key to Rydberg's discovery. The fundamental role of wavenumbers was also emphasized by the Rydberg-Ritz combination principle of 1908. The fundamental reason for this lies in quantum mechanics. Light's wavenumber is proportional to frequency , and therefore also proportional to light's quantum energy E. Thus, . Modern understanding is that Rydberg's findings were a reflection of the underlying simplicity of the behavior of spectral lines, in terms of fixed  energy differences between electron orbitals in atoms. Rydberg's 1888 classical expression for the form of the spectral series was not accompanied by a physical explanation. Ritz's pre-quantum 1908 explanation for the mechanism underlying the spectral series was that atomic electrons behaved like magnets and that the magnets could vibrate with respect to the atomic nucleus  to produce electromagnetic radiation, but this theory was superseded in 1913 by Niels Bohr's model of the atom.\nIn Bohr's conception of the atom, the integer Rydberg  n numbers represent electron orbitals at different integral distances from the atom. A frequency  emitted in a transition from n1 to n2 therefore represents the photon energy emitted or absorbed when an electron makes a jump from orbital 1 to orbital 2.\nLater models found that the values for n1 and n2 corresponded to the principal quantum numbers of the two orbitals.\n\n", "title": "Rydberg formula"}