{"summary": "Sabine Lisicki  is a German professional tennis player.", "full_text": "Sabine Katharina Lisicki ; born 22 September 1989 is a German professional tennis player who is currently ranked world no. 30 by the WTA. She turned professional in 2006 and her breakthrough came in 2009 when she reached the quarterfinals of the Wimbledon Championships and won her first WTA title, the Family Circle Cup, against Caroline Wozniacki. In March 2010, she suffered an ankle injury at the Indian Wells Masters that kept her out of competition for five months and saw her fall out of the top 200.\nLisicki rebounded in 2011 and won the Aegon Classic before entering the Wimbledon Championships as a wildcard and going on to reach the semifinals, where she lost to Maria Sharapova. In doing so she became only the second woman in Wimbledon history to make it to the semifinals while entering the tournament as a wildcard. She followed that two months later by winning her third WTA tournament, the Texas Open. In 2012, she achieved her highest career world ranking, 12th, and again reached the quarterfinals of Wimbledon. Again, in 2012 she suffered from another ankle injury that prevented her from having better results on tour. Lisicki reached the final of the 2013 Wimbledon Championships, losing to Marion Bartoli. The following year, she reached another quarterfinal at the 2014 Wimbledon Championships and won her first title in 3 years when she won the 2014 Hong Kong Tennis Open.\nIn doubles, Lisicki won the Porsche Tennis Grand Prix in 2011 with Samantha Stosur and in 2013 with Mona Barthel and the 2014 Sony Open with coach Martina Hingis. She also reached the doubles final at Wimbledon in 2011 with Stosur and came fourth in the mixed doubles event at the 2012 London Olympics with Christopher Kas.\nLisicki currently holds the world record for the fastest serve by a female tennis player. She clocked a 131.0 mph  serve during her first-round encounter against Ana Ivanovic at the 2014 Bank of the West Classic. She also holds the record for the most aces in a singles match, hitting 27 aces during her second-round encounter against Belinda Bencic at the 2015 Aegon Classic.", "title": "Sabine Lisicki"}