{"summary": "Samuel \"Sam\" Houston  was an American statesman, politician, and soldier.", "full_text": "Samuel \"Sam\" Houston  was an American politician and soldier, best known for his role in bringing Texas into the United States as a constituent state. His victory at the Battle of San Jacinto secured the independence of Texas from Mexico. The only American to be elected governor of two different states , he was also the only governor within a future Confederate state to oppose secession  and to refuse an oath of allegiance to the Confederacy, a decision that led to his removal from office by the Texas secession convention.\nHouston was born at Timber Ridge Plantation in Rockbridge County of Virginia, of Scots-Irish descent. After moving to Tennessee from Virginia, he spent time with the Cherokee Nation , military service in the War of 1812, and successful participation in Tennessee politics. In 1827, Houston was elected Governor of Tennessee as a Jacksonian. In 1829, he resigned as governor and relocated to Arkansas Territory. In 1832, Houston was involved in an altercation with a U.S. Congressman, followed by a high-profile trial.\nShortly afterwards, he relocated to Coahuila y Tejas, then a Mexican state, and became a leader of the Texas Revolution. After the war, Houston became a key figure in Texas and was elected as the first and third President of the Republic of Texas. He supported annexation by the United States and after annexation in 1845, he became a U.S. Senator and finally a governor of Texas in 1859, whereby Houston became the only person to have become the governor of two different U.S. states through popular election, as well as the only state governor to have been a foreign head of state.\nAs governor, he refused to swear loyalty to the Confederacy when Texas seceded from the Union in 1861 with the outbreak of the American Civil War, and was removed from office. To avoid bloodshed, he refused an offer of a Union army to put down the Confederate rebellion. Instead, he retired to Huntsville, Texas, where he died before the end of the Civil War.\nThe namesake of the city which, since the 1980s, has become the fourth largest city in the U.S., Houston's reputation was sufficiently large that he was honored in numerous ways after his death, among them: a memorial museum, five U.S. naval vessels named USS Houston , a U.S. Army base, a national forest, a historical park, a university, and a prominent roadside statue outside of Huntsville.", "title": "Sam Houston"}