{"summary": "The state of Texas is divided into 254 counties.", "full_text": "Samuel Rhoads Fisher was the secretary of the Navy of the Republic of Texas.\nHe was born in Pennsylvania on December 31, 1794 and settled in Texas in 1830 with his wife and four children as a member of Austin's Third Colony. He represented Matagorda Municipality in the Convention of 1836 at Washington-on-the-Brazos where he signed the Texas Declaration of Independence. President Sam Houston nominated Fisher as Secretary of the Texas Navy and the appointment was confirmed by the Senate on October 28, 1836.\nA letter to presidential candidate Mirabeau B. Lamar in August 1838 from George Wheelwright urged reconsideration of Fisher for Secretary for the good of the navy and defense of the Republic and Houston suspended Fisher from office in October 1837, to secure \"harmony and efficiency\". Many in the senate opposed the move and the Senate ordered Fisher's reinstatement on October 18, 1837. This event was a major incident in the early days of the Republic of Texas and added to the severe split between the various factions in the government.\nSam Houston Dixon in \"The Men Who Made Texas Free\" wrote that \"when Mr. Fisher died, Richard Ellis, who was president of the convention which declared Texas independent of Mexico, said from the floor of the Senate: 'In the death of Rhodes Fisher the Republic has lost one of its wisest defenders. He was a man of poise even midst times of stress and excitement. Well do some of us remember his cool and deliberate consideration of our acts at Old Washington, March, 1836; how his voice of caution rang out as men of zeal vied with one another in their precipitous rush to complete their labors of establishing a government and returning to their homes. So earnestly did he plead and so logical was his appeal that we were persuaded to follow his advice........There was nothing of the braggadocio about him and he did not lack courage to express his opinions.'\"\nFisher died on March 14, 1839, and was buried at Matagorda. Fisher County, established in 1876, was named after him.", "title": "Samuel Rhoads Fisher"}