{"summary": "1990  was a common year starting on Monday of the Gregorian calendar.", "full_text": "Samuel Kanyon Doe  was a Liberian politician who served as the leader of Liberia from 1980 to 1990. Then Master sergeant Doe served as chairman of the People's Redemption Council and de facto head of state after staging a violent coup d'etat in 1980; he killed President William R. Tolbert, Jr., and executed many of his True Whig Party supporters.\nDoe disbanded the constitution and headed the country's military junta for the next five years. In 1985 he ordered an election and officially became the 21st President of Liberia. The election was marked by controversy as there was evidence of election fraud. Doe enjoyed decisive support from the United States; it was a strategic alliance due to his anti-Soviet stance taken during the years of the Cold War prior to 1989 and the collapse of the Soviet Union.\nDoe, a member of the Krahn tribe from inland Liberia, was the first indigenous head of state in Liberian history. His people are a largely rural minority ethnic group and indigenous, like 95% of Liberians. Historically indigenous Liberians had been marginalized in the colonial-style society developed by the group known as the Americo-Liberians, made up of immigrants and their descendants. They were descended from the free-born and formerly enslaved blacks, primarily from the United States, who founded Liberia in 1847 after it had been started as a colony in the late 1820s.\nDoe opened Liberian ports to Canadian, Chinese and European ships. This brought in considerable foreign investment from foreign shipping firms and earned Liberia a reputation as a tax haven.\nDoe attempted to legitimize his regime with passage of a new constitution in 1984 and elections in 1985. However, opposition to his rule increased, especially after the 1985 elections, which were declared to be fraudulent by most foreign observers. For political reasons, the US continued to support him.\nIn the late 1980s, as the US government adopted more fiscal austerity and the threat of Communism declined with the waning of the Cold War, the U.S. became disenchanted with the entrenched corruption of Doe's government. It began cutting off critical foreign aid to Doe. This, combined with the popular anger generated by Doe's favoritism toward his native Krahn tribe, placed him in a very precarious position.\nA civil war began in December 1989, when rebels entered Liberia through Ivory Coast with the intent of capturing Doe. He was captured and overthrown on 9 September 1990. He was tortured during interrogation and executed.", "title": "Samuel Doe"}