{"summary": "March 22 is the 81st day of the year  in the Gregorian calendar.", "full_text": "Satanic ritual abuse  was the subject of a moral panic that originated in the United States in the 1980s, spreading throughout the country and eventually to many parts of the world, before mostly diminishing in the late 1990s. Allegations of SRA involved reports of physical and sexual abuse of people in the context of occult or Satanic rituals. In its most extreme form, SRA involved a supposed worldwide conspiracy involving the wealthy and powerful of the world elite in which children were abducted or bred for sacrifices, pornography and prostitution.\nNearly every aspect of SRA was controversial, including its definition, the source of the allegations and proof thereof, testimonials of alleged victims, and court cases involving the allegations and criminal investigations. The panic affected lawyers', therapists', and social workers' handling of allegations of child sexual abuse. Allegations initially brought together widely dissimilar groups, including religious fundamentalists, police investigators, child advocates, therapists and clients in psychotherapy. The movement gradually secularized, dropping or deprecating the \"satanic\" aspects of the allegations in favor of names that were less overtly religious such as \"sadistic\" or simply \"ritual abuse\" and becoming more associated with dissociative identity disorder and anti-government conspiracy theories.\nThe panic was influenced to a large extent by testimony of children and adults that were obtained using therapeutic and interrogation techniques now considered discredited. Initial publicity generated was by the now-discredited autobiography Michelle Remembers , and sustained and popularized throughout the decade by the McMartin preschool trial. Testimonials, symptom lists, rumors and techniques to investigate or uncover memories of SRA were disseminated through professional, popular and religious conferences, as well as through the attention of talk shows, sustaining and spreading the moral panic further throughout the United States and beyond. In some cases allegations resulted in criminal trials with varying results; after seven years in court, the McMartin trial resulted in no convictions for any of the accused, while other cases resulted in lengthy sentences, some of which were later reversed. Scholarly interest in the topic slowly built, eventually resulting in the conclusion that the phenomenon was a moral panic, with little or no validity beyond paranoia.\nOfficial investigations produced no evidence of widespread conspiracies or of the slaughter of thousands; only a small number of verified crimes have even remote similarities to tales of SRA. In the latter half of the 1990s interest in SRA declined and skepticism became the default position, with very few researchers giving any credence to the existence of SRA.", "title": "Satanic ritual abuse"}