{"summary": "A scientific law is an equation or statement that most scientists agree is true.", "full_text": "A scientific law is a statement based on repeated experimental observations that describes some aspects of the universe. A scientific law always applies under the same conditions, and implies that there is a causal relationship involving its elements. Factual and well-confirmed statements like \"Mercury is liquid at standard temperature and pressure\" are considered too specific to qualify as scientific laws. A central problem in the philosophy of science, going back to David Hume, is that of distinguishing causal relationships  from principles that arise due to constant conjunction.\nLaws differ from scientific theories in that they do not posit a mechanism or explanation of phenomena: they are merely distillations of the results of repeated observation. As such, a law is limited in applicability to circumstances resembling those already observed, and may be found false when extrapolated. Ohm's law only applies to linear networks, Newton's law of universal gravitation only applies in weak gravitational fields, the early laws of aerodynamics such as Bernoulli's principle do not apply in case of compressible flow such as occurs in transonic and supersonic flight, Hooke's law only applies to strain below the elastic limit, etc. These laws remain useful, but only under the conditions where they apply.\nMany laws take mathematical forms, and thus can be stated as an equation; for example, the Law of Conservation of Energy can be written as , where E is the total amount of energy in the universe. Similarly, the First Law of Thermodynamics can be written as .\nThe term \"scientific law\" is traditionally associated with the natural sciences, though the social sciences also contain laws. An example of a scientific law in social sciences is Zipf's law.\nLike theories and hypotheses, laws make predictions , and can be falsified if they are found in contradiction with new data.", "title": "Scientific law"}