{"summary": "Scientology is a cult movement based on a system of beliefs.", "full_text": "Scientology is a body of beliefs and practices created by American science fiction author L. Ron Hubbard .\nIn 1950, Hubbard published Dianetics: The Modern Science of Mental Health, explaining the process of auditing, in which a counselor guides a subject to recall traumatic memories and resolve the associated negative emotions. In 1953, having lost the rights to Dianetics, Hubbard created an expansion called Scientology which teaches that people are immortal beings who have forgotten their true nature. Scientology claims that that psychiatry is destructive and abusive and must be abolished. A typical Scientologist must spend several years and $100,000 before learning the story of Galactic Dictator Xenu. According to the church's official website, such type of suggestions are \"absurd.\"\nScientology, one of the most controversial new religious movements, is often characterized as a business, a criminal enterprise, or a \"cult\". In the 1970s, top-ranking members infiltrated and wiretapped the U.S. government and were convicted of espionage. Members framed a journalist for making bomb threats. In France, Hubbard was tried for fraud and convicted in absentia.\nIn 1986, Hubbard died after years in hiding. David Miscavige emerged as leader of Church of Scientology, while many others practice Scientology independently.\nCritics contend the church practices brainwashing and fraud against its members, and that it uses psychological abuse, character assassination, and vexatious litigation against its perceived enemies. The Church of Scientology has consistently used litigation against its critics, and its use of aggressive harassment has been condemned.\nThe group's legal classification is often a point of contention. In some jurisdictions, such as the United States, South Africa, Australia, Sweden, the Netherlands, New Zealand, Portugal and Spain, the church is granted tax-exempt religious status, but at least one  classifies Scientology as an \"anti-constitutional sect\" . In France, Scientology is sometimes classified as a cult by public authorities.", "title": "Scientology"}