{"summary": "Sebastian Vettel  is a German race car driver.", "full_text": "Sebastian Vettel  is a German racing driver, currently driving in Formula One for Scuderia Ferrari. He is contracted to remain in that role until at least the end of 2017. He is a four-time Formula One World Champion, having won the championship in 2010, 2011, 2012, and 2013 with Red Bull Racing. He is among the most successful F1 drivers of all time. He is one of only four drivers to have won four or more drivers' titles.\nIn his first year driving for Red Bull in 2009, Vettel finished the season as the youngest-ever World Drivers' Championship runner-up. The following year he went on to become the youngest driver ever to win the World Drivers' Championship, aged 23. In the same year he helped Red Bull win the team's first World Constructors' Championship. He followed up his first championship with three more titles, becoming the youngest double, triple and quadruple world champion in Formula One. The 2010 and 2012 titles were decided in the final round, in 2010 coming out on top over Fernando Alonso and Ferrari in a four-way title battle at Abu Dhabi, whilst in 2012 defeating Alonso and Ferrari again by three points. The 2011 and 2013 titles saw Vettel dominating the seasons and wrapping up the titles early.\nVettel left Red Bull Racing and ended his long-term association with the company after the 2014 season and signed a contract with Ferrari for 2015, after activating a clause to terminate his Red Bull contract early. After his winless 2014 season he returned to winning ways in his first Ferrari season, being the closest challenger to the dominant Mercedes cars and winning three races.\nVettel has held numerous other \"youngest\" Formula One records, among them: the youngest driver to have taken part in an official practice session of a Grand Prix , to score championship points , to lead a race, to secure pole position and to win a race. With 1,896 points, he now currently holds the record with the most number of championship points in his career, surpassing rival Fernando Alonso at the 2015 Italian Grand Prix. He is also currently in fourth place among all time race winners.", "title": "Sebastian Vettel"}