{"summary": "The Republic of Serbia  is a country in Southeastern Europe.", "full_text": "Serbia , officially the Republic of Serbia , is a sovereign state situated at the crossroads between Central and Southeast Europe, covering the southern part of the Pannonian Plain and the central Balkans. Serbia is landlocked and borders Hungary to the north; Romania and Bulgaria to the east; Macedonia to the south; and Croatia, Bosnia, and Montenegro to the west; it also claims a border with Albania through the disputed territory of Kosovo. The capital of Serbia, Belgrade, is one of the largest cities in Southeast Europe. As of a 2011 census, Serbia  had a total population of 7.2 million.\nFollowing the Slavic migrations to the Balkans from the 6th century onwards, Serbs established several states in the early Middle Ages. The Serbian Kingdom obtained recognition by Rome and Constantinople in 1217; it reached its peak in 1346 as a relatively short-lived Serbian Empire. By the mid-16th century, the entire territory of modern-day Serbia was annexed by the Ottoman Empire, at times interrupted by the Habsburgs. In the early 19th century, the Serbian Revolution established the nation-state as the region's first constitutional monarchy, which subsequently expanded its territory. Following disastrous casualties in World War I, and subsequent unification of Habsburg crownland of Vojvodina with Serbia, the country co-founded Yugoslavia with other South Slavic peoples, which would exist in various political formations until the Yugoslav Wars of the 1990s, which had devastating effects for the region. As a result, Serbia formed a union with Montenegro in 1992, which broke apart in 2006, when Serbia again became an independent country. In 2008 the parliament of Kosovo, Serbia's southern province with an Albanian ethnic majority, declared independence, with mixed responses from the international community.\nSerbia is a member of the UN, CoE, OSCE, PfP, BSEC, and CEFTA. As a membership candidate, Serbia is currently negotiating its EU accession. The country is acceding to the WTO and is a militarily neutral state. Serbia is an upper-middle income economy with dominant service sector, followed by the industrial sector and agriculture. The country ranks high in Social Progress Index  and Global Peace Index .", "title": "Serbia"}