{"summary": "Sex education is telling people about sexual intercourse.", "full_text": "Sex education is instruction on issues relating to human sexuality, including human sexual anatomy, sexual reproduction, sexual activity, reproductive health, emotional relations, reproductive rights and responsibilities, sexual abstinence, and birth control. Common avenues for sex education are parents or caregivers, formal school programs, and public health campaigns.\nTraditionally, adolescents in many cultures were not given any information on sexual matters, with the discussion of these issues being considered taboo. Such instruction, as was given, was traditionally left to a child's parents, and often this was put off until just before a child's marriage. The progressive education movement of the late 19th century, however, led to the introduction of \"social hygiene\" in North American school curricula and the advent of school-based sex education. Despite early inroads of school-based sex education, most of the information on sexual matters in the mid-20th century was obtained informally from friends and the media, and much of this information was deficient or dubious value, especially during the period following puberty when curiosity about sexual matters was the most acute. This deficiency became increasingly evident by the increasing incidence of teenage pregnancies, particularly in Western countries after the 1960s. As part of each country's efforts to reduce such pregnancies, programs of sex education were instituted, initially over strong opposition from parent and religious groups.\nThe outbreak of AIDS has given a new sense of urgency to sex education. In many African countries, where AIDS is at epidemic levels , sex education is seen by most scientists as a vital public health strategy. Some international organizations such as Planned Parenthood consider that broad sex education programs have global benefits, such as controlling the risk of overpopulation and the advancement of women's rights . The use of mass media campaigns has sometimes resulted in high levels of \"awareness\" coupled with essentially superficial knowledge of HIV transmission.\nAccording to SIECUS, the Sexuality Information and Education Council of the United States, 93% of adults they surveyed support sexuality education in high school and 84% support it in junior high school. In fact, 88% of parents of junior high school students and 80% of parents of secondary school students believe that sex education in school makes it easier for them to talk to their adolescents about sex. Also, 92% of adolescents report that they want both to talk to their parents about sex and to have comprehensive in-school sex education. Furthermore, a \"...study, conducted by Mathematica Policy Research on behalf of the U.S. Department of Health and Human Services, found that abstinence-only-until-marriage programs are ineffective.\"", "title": "Sex education"}