{"summary": "Sexual intercourse  is the insertion and thrusting of a male's penis into a female's vagina.", "full_text": "Sexual intercourse, or coitus or copulation, is principally the insertion and thrusting of a male's penis, usually when erect, into a female's vagina for the purposes of sexual pleasure, reproduction, or both. This is also known as vaginal intercourse or vaginal sex. Other forms of penetrative sexual intercourse include penetration of the anus by the penis , penetration of the mouth by the penis or oral penetration of the female genitalia , sexual penetration by the fingers , and penetration by use of a dildo . These activities involve physical intimacy between two or more individuals and are usually used among humans solely for physical or emotional pleasure and commonly contribute to human bonding.\nA variety of views concern what constitutes sexual intercourse or other sexual activity, which can also impact views on sexual health. Although the term sexual intercourse, particularly the variant coitus, generally denotes penile-vaginal penetration and the possibility of creating offspring , it also commonly denotes penetrative oral sex and particularly penile-anal sex. Non-penetrative sex acts, such as non-penetrative forms of cunnilingus or mutual masturbation, have been termed outercourse, but may additionally be considered sexual intercourse. The term sex, often a shorthand for sexual intercourse, can mean any form of sexual activity. Because people can be at risk of contracting sexually transmitted infections during sexual activities, though the transmission risk is significantly reduced during non-penetrative sex, safe sex practices are advised.\nVarious jurisdictions have placed restrictive laws against certain sexual acts, such as incest, sexual activity with minors, extramarital sex, prostitution, sodomy, rape and zoophilia. Religious beliefs also play a role in personal decisions about sexual intercourse or other sexual activity, such as decisions about virginity, or legal and public policy matters. Religious views on sexuality vary significantly between different religions and sects of the same religion, though there are common themes, such as prohibition of adultery.\nReproductive sexual intercourse between non-human animals is more often termed copulation, and sperm may be introduced into the female's reproductive tract in non-vaginal ways among the animals, such as by cloacal copulation. For most non-human mammals, mating and copulation occur at the point of estrus , which increases the chances of successful impregnation. However, bonobos, dolphins and chimpanzees are known to engage in sexual intercourse regardless of whether or not the female is in estrus, and to engage in sex acts with same-sex partners. Like humans engaging in sexual activity primarily for pleasure, this behavior in the aforementioned animals is also presumed to be for pleasure, and a contributing factor to strengthening their social bonds.", "title": "Sexual intercourse"}