{"summary": "Sid Vicious  was an English punk musician.", "full_text": "Sid Vicious, born John Simon Ritchie, later named John Beverley , was an English bass guitarist, drummer and vocalist, most famous as a member of the influential punk rock band the Sex Pistols, and notorious for his arrest for the murder of his girlfriend, Nancy Spungen.\nVicious joined the Sex Pistols in early 1977 to replace Glen Matlock, who had fallen out of favour with the rest of the group. Due to intravenous drug use, Vicious was hospitalized with hepatitis during the recording of the band's only studio album Never Mind the Bollocks. Accordingly, his bass is only partially featured on one song from the album. Vicious would later appear as a lead vocalist, performing three cover songs, on the soundtrack to The Great Rock 'n' Roll Swindle, a largely fictionalized documentary about the Sex Pistols, produced by the group's former manager Malcolm McLaren and directed by Julien Temple.\nDuring the Sex Pistols' brief, chaotic ascendancy, Vicious met eventual girlfriend and manager Nancy Spungen, and the pair entered a destructive codependent relationship based on drug use. This culminated in Spungen's death from an apparent stab wound while staying in New York City's Hotel Chelsea with Vicious. Under suspicion of having committed Spungen's murder, Vicious was released on bail; he was later arrested again for assaulting Todd Smith, brother of Patti Smith, at a night club, and underwent drug rehabilitation on Rikers Island. In celebration of Vicious' release from prison, his mother hosted a party for him at his girlfriend's residence in Greenwich Village, which was attended notably by the Misfits bassist Jerry Only. Vicious' mother had been supplying him with drugs and paraphernalia since he was young; late that night she assisted him in procuring heroin, and he died in his sleep after overdosing on it.\nLess than four weeks after Vicious' death, the soundtrack album of The Great Rock 'n' Roll Swindle was released. On 15 December of that year, a compilation of live material recorded during his brief solo career was packaged and released as Sid Sings.\nIn the 1986 feature-film Sid and Nancy, Gary Oldman gave a much-acclaimed performance as Sid.", "title": "Sid Vicious"}