{"summary": "Sidney Lumet  was an American movie director, producer and screenwriter.", "full_text": "Sidney Arthur Lumet  was an American director, producer and screenwriter with over 50 films to his credit. He was nominated for the Academy Award as Best Director for 12 Angry Men , Dog Day Afternoon , Network  and The Verdict . He did not win an individual Academy Award, but he did receive an Academy Honorary Award and 14 of his films were nominated for various Oscars, such as Network, which was nominated for ten, winning four.\nThe Encyclopedia of Hollywood states that Lumet was one of the most prolific filmmakers of the modern era, having directed more than one movie a year on average since his directorial debut in 1957. He was noted by Turner Classic Movies for his \"strong direction of actors,\" \"vigorous storytelling\" and the \"social realism\" in his best work. Film critic Roger Ebert described him as having been \"one of the finest craftsmen and warmest humanitarians among all film directors.\" Lumet was also known as an \"actor's director,\" having worked with the best of them during his career, probably more than \"any other director.\" Sean Connery, who acted in five of his films, considered him one of his favorite directors, and a director who had that \"vision thing.\"\nA member of the maiden cohort of New York's Actors Studio, Lumet began his directorial career in Off-Broadway productions, then became a highly efficient TV director. His first movie was typical of his best work: a well-acted, tightly written, deeply considered \"problem picture,\" 12 Angry Men . From that point on Lumet divided his energies among other idealistic problem pictures along with literate adaptations of plays and novels, big stylish pictures, New York-based black comedies, and realistic crime dramas, including Serpico and Prince of the City. As a result of directing 12 Angry Men, he was also responsible for leading the first wave of directors who made a successful transition from TV to movies.\nIn 2005, Lumet received an Academy Award for Lifetime Achievement for his \"brilliant services to screenwriters, performers, and the art of the motion picture.\" Two years later, he concluded his career with the acclaimed drama Before the Devil Knows You're Dead . A few months after Lumet's death in April 2011, a retrospective celebration of his work was held at New York's Lincoln Center with the appearance of numerous speakers and film stars.\n\n", "title": "Sidney Lumet"}