{"summary": "A siege is what happens when a group of people surround another group of people and stop them from escaping, or getting food and water.", "full_text": "A siege is a military blockade of a city or fortress with the intent of conquering by attrition or assault. The term derives from sedere, Latin for \"to sit\". Siege warfare is a form of constant, low-intensity conflict characterized by one party holding a strong, static defensive position. Consequently, an opportunity for negotiation between combatants is not uncommon, as proximity and fluctuating advantage can encourage diplomacy.\nA siege occurs when an attacker encounters a city or fortress that cannot be easily taken by a coup de main and refuses to surrender. Sieges involve surrounding the target and blocking the reinforcement or escape of troops or provision of supplies , typically coupled with attempts to reduce the fortifications by means of siege engines, artillery bombardment, mining , or the use of deception or treachery to bypass defences. Failing a military outcome, sieges can often be decided by starvation, thirst, or disease, which can afflict either the attacker or defender. This form of siege, though, can take many months or even years, depending upon the size of the stores of food the fortified position holds. During the process of circumvallation, the attacking force can be set upon by another force of enemies due to the lengthy amount of time required to starve a position. A defensive ring of forts outside the ring of circumvallated forts, called contravallation, is also sometimes used to defend the attackers from outside enemy forces.\nSieges probably pre-date the development of cities as large population centres. Ancient cities in the Middle East show archaeological evidence of having had fortified city walls. During the Warring States era of ancient China, there is both textual and archaeological evidence of prolonged sieges and siege machinery used against the defenders of city walls. Siege machinery was also a tradition of the ancient Greco-Roman world. During the Renaissance and the early modern period, siege warfare dominated the conduct of war in Europe. Leonardo da Vinci gained as much of his renown from the design of fortifications as from his artwork.\nMedieval campaigns were generally designed around a succession of sieges. In the Napoleonic era, increasing use of ever more powerful cannon reduced the value of fortifications. In the 20th century, the significance of the classical siege declined. With the advent of mobile warfare, a single fortified stronghold is no longer as decisive as it once was. While traditional sieges do still occur, they are not as common as they once were due to changes in modes of battle, principally the ease by which huge volumes of destructive power can be directed onto a static target. Modern sieges are more commonly the result of smaller hostage, militant, or extreme resisting arrest situations.", "title": "Siege"}