{"summary": "Sierra Leone is a country in West Africa.", "full_text": "Sierra Leone , officially the Republic of Sierra Leone, is a country in West Africa. It is bordered by Guinea on the north, Liberia in the south-east, and the Atlantic Ocean in the south-west. Sierra Leone has a tropical climate, with a diverse environment ranging from savannah to rainforests. Sierra Leone has a total area of 71,740 km2  and an estimated population of 6 million . Freetown is the capital, largest city, and its economic and political centre. Bo is the second largest city. The other major cities in the country with a population above 100,000 are Kenema, Makeni and Koidu Town. Sierra Leone is divided into four geographical regions: the Northern Province, Eastern Province, Southern Province and the Western Area, which are further divided into fourteen districts.\nAbout sixteen ethnic groups inhabit Sierra Leone, each with their own language and customs. The two largest and most influential are the Temne and the Mende people. The Temne are predominantly found in the north of the country, while the Mende are predominant in the south-east. Although English is the official language spoken at schools and government administration, the Krio language is the most widely spoken language in the country and unites all the different ethnic groups in the country, especially in their trade and social interaction with each other.\nSierra Leone is a nominally Muslim country, though with an influential Christian minority. Technically, religious affiliation is 60% Muslim, 30% indigenous beliefs, and 10% Christian. However, there is a high degree of synchronicity of the indigenous beliefs into the organised religions. Sierra Leone is regarded as one of the most religiously tolerant nations in the world. Muslims and Christians collaborate and interact with each other peacefully. Religious violence is very rare in the country.\nSierra Leone has relied on mining, especially diamonds, for its economic base. It is also among the largest producers of titanium and bauxite, a major producer of gold, and has one of the world's largest deposits of rutile. Sierra Leone is home to the third-largest natural harbour in the world. Despite exploitation of this natural wealth, 70% of its people live in poverty.\nSierra Leone became independent in 1961. Government corruption and mismanagement of the country's natural resources contributed to the Sierra Leone Civil War , which over more than a decade devastated the country. This proxy war left more than 50,000 people dead, much of the country's infrastructure destroyed, and over two million people displaced as refugees in neighbouring countries.\nMore recently, the 2014 Ebola outbreak overburdened the weak healthcare infrastructure, leading to more deaths from medical neglect than Ebola itself. It created a humanitarian crisis situation and a negative spiral of weaker economic growth. The country has an extremely low life expectancy at 57.8 years.\nSierra Leone is a member of many international organisations, including the United Nations, the African Union, the Economic Community of West African States , the Mano River Union, the Commonwealth of Nations, the African Development Bank, and the Organisation of Islamic Cooperation.\n\n", "title": "Sierra Leone"}