{"summary": "Silicon is element 14 on the periodic table.", "full_text": "Silicon is a chemical element with symbol Si and atomic number 14. It is a tetravalent metalloid, more reactive than germanium, the metalloid directly below it in the table. Controversy about silicon's character dates to its discovery. It was first prepared and characterized in pure form in 1823. In 1808, it was given the name silicium , with an -ium word-ending to suggest a metal, a name which the element retains in several non-English languages. However, its final English name, first suggested in 1817, reflects the more physically similar elements carbon and boron.\nSilicon is the eighth most common element in the universe by mass, but very rarely occurs as the pure free element in nature. It is most widely distributed in dusts, sands, planetoids, and planets as various forms of silicon dioxide  or silicates. Over 90% of the Earth's crust is composed of silicate minerals, making silicon the second most abundant element in the Earth's crust  after oxygen.\nMost silicon is used commercially without being separated, and indeed often with little processing of compounds from nature. These include direct industrial building-use of clays, silica sand and stone. Silicate goes into Portland cement for mortar and stucco, and mixed with silica sand and gravel to make concrete. Silicates are also in whiteware ceramics such as porcelain, and in traditional quartz-based soda-lime glass and many other specialty glasses. More modern silicon compounds such as silicon carbide form abrasives and high-strength ceramics. Silicon is the basis of the widely used synthetic polymers called silicones.\nElemental silicon also has a large impact on the modern world economy. Although most free silicon is used in the steel refining, aluminium-casting, and fine chemical industries , the relatively small portion of very highly purified silicon that is used in semiconductor electronics  is perhaps even more critical. Because of wide use of silicon in integrated circuits, the basis of most computers, a great deal of modern technology depends on it.\nSilicon is an essential element in biology, although only tiny traces of it appear to be required by animals. However, various sea sponges as well as microorganisms like diatoms and radiolaria secrete skeletal structures made of silica. Silica is often deposited in plant tissues, such as in the bark and wood of Chrysobalanaceae and the silica cells and silicified trichomes of Cannabis sativa, horsetails and many grasses.", "title": "Silicon"}