{"summary": "During the history of slavery there were many different forms of human exploitation across many cultures.", "full_text": "The history of slavery spans nearly every culture, nationality and religion and from ancient times to the present day. While slavery has existed for thousands of years, the social, economic, and legal position of slaves was vastly different in different systems of slavery in different times and places.\nSlavery can be traced back to the earliest records, such as the Code of Hammurabi , which refers to it as an established institution. Slavery is rare among hunter-gatherer populations, as it is developed as a system of social stratification. Slavery was known in civilizations as old as Sumer, as well as almost every other ancient civilization. The Byzantine-Ottoman wars and the Ottoman wars in Europe resulted in the taking of large numbers of Christian slaves. Similarly, Christians sold Muslim slaves captured in war and also the Islamic World was engaged in slavery. Slavery became common within the British Isles during the Middle Ages. Britain played a prominent role in the Atlantic slave trade, especially after 1600. Slavery was a legal institution in all of the 13 American colonies and Canada . David P. Forsythe wrote: \"The fact remained that at the beginning of the nineteenth century an estimated three-quarters of all people alive were trapped in bondage against their will either in some form of slavery or serfdom.\" Denmark-Norway was the first European country to ban the slave trade.\nAlthough slavery is no longer legal anywhere in the world, human trafficking remains an international problem and an estimated 29.8 million persons are living in illegal slavery today. During the Second Sudanese Civil War people were taken into slavery. In Mauritania it is estimated that up to 600,000 men, women and children, or 20% of the population, are currently enslaved, many of them used as bonded labor. Slavery in Mauritania was criminalized in August 2007. Evidence emerged in the late 1990s of systematic slavery in cacao plantations in West Africa; see the chocolate and slavery article.", "title": "Slave trade"}