{"summary": "Tobacco is a plant of the nightshade family, found mainly in North America and South America.", "full_text": "Smoking is a practice in which a substance is burned and the resulting smoke breathed in to be tasted and absorbed into the bloodstream. Most commonly the substance is the dried leaves of the tobacco plant which have been rolled into a small square of rice paper to create a small, round cylinder called a \"cigarette\". Smoking is primarily practiced as a route of administration for recreational drug use because the combustion of the dried plant leaves vaporizes and delivers active substances into the lungs where they are rapidly absorbed into the bloodstream and reach bodily tissue. In the case of cigarette smoking these substances are contained in a mixture of aerosol particles and gasses and include the pharmacologically active alkaloid nicotine; the vaporization creates heated aerosol and gas to form that allows inhalation and deep penetration into the lungs where absorption into the bloodstream of the active substances occurs. In some cultures, smoking is also carried out as a part of various rituals, where participants use it to help induce trance-like states that, they believe, can lead them to \"spiritual enlightenment\".\nCigarettes are primarily industrially manufactured but also can be hand-rolled from loose tobacco and rolling paper. Other smoking implements include pipes, cigars, bidis, hookahs, vaporizers, and bongs. Smoking-related diseases have been shown to kill approximately half of long term smokers when compared to average mortality rates faced by non-smokers. A 2007 report states that, each year, about 4.9 million people worldwide die as a result of smoking.\nSmoking is one of the most common forms of recreational drug use. Tobacco smoking is the most popular form, being practiced by over one billion people globally, of whom the majority are in the developing world. Less common drugs for smoking include cannabis and opium. Some of the substances are classified as hard narcotics, like heroin, but the use of these is very limited as they are usually not commercially available.\nThe history of smoking can be dated to as early as 5000 BC, and has been recorded in many different cultures across the world. Early smoking evolved in association with religious ceremonies; as offerings to deities, in cleansing rituals or to allow shamans and priests to alter their minds for purposes of divination or spiritual enlightenment. After the European exploration and conquest of the Americas, the practice of smoking tobacco quickly spread to the rest of the world. In regions like India and Sub-Saharan Africa, it merged with existing practices of smoking . In Europe, it introduced a new type of social activity and a form of drug intake which previously had been unknown.\nPerception surrounding smoking has varied over time and from one place to another: holy and sinful, sophisticated and vulgar, a panacea and deadly health hazard. In the 20th century smoking came to be viewed in a decidedly negative light, especially in Western countries. This is due to smoking tobacco being among the leading causes of many diseases such as lung cancer, heart attacks, COPD, erectile dysfunction, and birth defects. The health hazards of smoking have caused many countries to institute high taxes on tobacco products, run ads to discourage use, limit ads that promote use, and provide help with quitting for those who do smoke.", "title": "Smoking"}