{"summary": "Sociology is the study of societies and how humans act in groups.", "full_text": "Sociology is the scientific study of social behavior or society, including its origins, development, organization, networks, and institutions. It is a social science that uses various methods of empirical investigation and critical analysis to develop a body of knowledge about social order, social disorder and social change. Many sociologists aim to conduct research that may be applied directly to social policy and welfare, while others focus primarily on refining the theoretical understanding of social processes. Subject matter ranges from the micro level of individual agency and interaction to the macro level of systems and the social structure.\nThe traditional focuses of sociology include social stratification, social class, social mobility, religion, secularization, law, sexuality and deviance. As all spheres of human activity are affected by the interplay between social structure and individual agency, sociology has gradually expanded its focus to further subjects, such as health, medical, military and penal institutions, the Internet, education, and the role of social activity in the development of scientific knowledge.\nThe range of social scientific methods has also expanded. Social researchers draw upon a variety of qualitative and quantitative techniques. The linguistic and cultural turns of the mid-twentieth century led to increasingly interpretative, hermeneutic, and philosophic approaches towards the analysis of society. Conversely, the end of the 1990s and the beginning of 2000s have seen the rise of new analytically, mathematically and computationally rigorous techniques, such as agent-based modelling and social network analysis.\nSocial research informs politicians and policy makers, educators, planners, lawmakers, administrators, developers, business magnates, managers, social workers, non-governmental organizations, non-profit organizations, and people interested in resolving social issues in general. There is often a great deal of crossover between social research, market research, and other statistical fields.\n^ sociology. . The American Heritage Science Dictionary. Retrieved 13 July 2013, from Dictionary.com website: http://dictionary.reference.com/browse/sociology\n^ http://www.dummies.com/how-to/content/sociology-for-dummies-cheat-sheet.html\n^ http://www.pasadena.edu/studentservices/counseling/graduation/documents/aa-t_sociology.pdf\n^ https://www.colgate.edu/docs/default-source/default-document-library/sociology-a-21st-century-major.pdf?sfvrsn=0\n^ http://www.asanet.org/introtosociology/Documents/Field%20of%20sociology033108.htm#whatissociology\n^ \n^ \n^ \n^ \n^ \n^ Lynn R. Kahle, Pierre Valette-Florence . Marketplace Lifestyles in an Age of Social Media. New York: M.E. Sharpe, Inc. ISBN 978-0-7656-2561-8.", "title": "Sociology"}