{"summary": "Soft drinks  are carbonated drinks made from concentrates and sugar.", "full_text": "A soft drink  is a drink that typically contains carbonated water, a sweetener and a natural or artificial flavoring. The sweetener may be sugar, high-fructose corn syrup, fruit juice, sugar substitutes  or some combination of these. Soft drinks may also contain caffeine, colorings, preservatives and other ingredients.\nSoft drinks are called \"soft\" in contrast to \"hard drinks\" . Small amounts of alcohol may be present in a soft drink, but the alcohol content must be less than 0.5% of the total volume if the drink is to be considered non-alcoholic. Fruit juice, tea and other such non-alcoholic beverages are technically soft drinks by this definition but are not generally referred to as such.\nSoft drinks may be served chilled, over ice cubes or at room temperature. In rare cases, some soft drinks, such as Dr Pepper, can be served warm. Soft drinks are available in many formats, including cans, glass bottles and plastic bottles . Soft drinks are also widely available at fast food restaurants, movie theaters, convenience stores, casual dining restaurants, and bars from soda fountain machines. Soda fountain drinks are typically served in paper or plastic disposable cups in the first three venues. In casual dining restaurants and bars, soft drinks are often served in glasses. Soft drinks may be drunk with straws or sipped directly from the cups.\nSoft drinks are mixed with other ingredients in several contexts. In Western countries, in bars and other places where alcohol is served  many mixed drinks are made by blending a soft drink with hard liquor and serving the drink over ice. One well-known example is the rum and coke, which may also contain lime juice. Some homemade fruit punch recipes, which may or may not contain alcohol, contain a mixture of various fruit juices and soda pop . At ice cream parlours and 1950s-themed diners, ice cream floats are often sold. Two popular ice cream floats are the coke float and the root beer float, which consist of a scoop of ice cream placed in a tall glass of the respectively named soft drinks.", "title": "Soft drink"}