{"summary": "Soil  is the combination of rock, mineral fragments , organic matter , water and air.", "full_text": "Soil is the mixture of minerals, organic matter, gases, liquids, and the countless organisms that together support life on Earth. Soil is a natural body known as the pedosphere and which performs four important functions: it is a medium for plant growth; it is a means of water storage, supply and purification; it is a modifier of Earth's atmosphere; it is a habitat for organisms; all of which, in turn, modify the soil.\nSoil is considered to be the \"skin of the Earth\" and interfaces with its lithosphere, hydrosphere, atmosphere, and biosphere. Soil consists of a solid phase  as well as a porous phase that holds gases and water. Accordingly, soils are often treated as a three-state system.\nSoil is the end product of the influence of the climate, relief , organisms, and parent materials  interacting over time. Soil continually undergoes development by way of numerous physical, chemical and biological processes, which include weathering with associated erosion.\nMost soils have a density between 1 and 2 g/cm3. Little of the soil of planet Earth is older than the Pleistocene and none is older than the Cenozoic, although fossilized soils are preserved from as far back as the Archean.\nSoil science has two basic branches of study: edaphology and pedology. Pedology is focused on the formation, description , and classification of soils in their natural environment, whereas edaphology is concerned with the influence of soils on organisms. In engineering terms, soil is referred to as regolith, or loose rock material that lies above the 'solid geology'. Soil is commonly referred to as \"earth\" or \"dirt\"; technically, the term \"dirt\" should be restricted to displaced soil.\nAs soil resources serve as a basis for food security, the international community advocates for its sustainable and responsible use through different types of Soil Governance.", "title": "Soil"}