{"summary": "Lee Van Cleef  was an American actor.", "full_text": "Somerville is a borough in Somerset County, New Jersey, United States. As of the 2010 United States Census, the borough's population was 12,098, reflecting a decline of 325  from the 12,423 counted in the 2000 Census, which had in turn increased by 791  from the 11,632 counted in the 1990 Census. It is the county seat of Somerset County.\nSomerville was originally formed as a town on March 25, 1863, within a portion of Bridgewater Township. Somerville was incorporated as a borough by an act of the New Jersey Legislature on April 16, 1909, based on the results of a referendum held on May 4, 1909, at which point it was fully set off from Bridgewater Township.\nThe borough is named for Somerset in England.\n^ a b c d e 2010 Census Gazetteer Files: New Jersey County Subdivisions, United States Census Bureau. Accessed May 21, 2015.\n^ US Gazetteer files: 2010, 2000, and 1990, United States Census Bureau. Accessed September 4, 2014.\n^ 2015 New Jersey Mayors Directory, New Jersey Department of Community Affairs, as of October 20, 2015. Accessed November 15, 2015.\n^ \n^ Clerk-Administrator/Vital Records, Borough of Somerville. Accessed April 4, 2011.\n^ \n^ U.S. Geological Survey Geographic Names Information System: Borough of Somerville, Geographic Names Information System. Accessed March 14, 2013.\n^ a b DP-1 - Profile of General Population and Housing Characteristics: 2010 for Somerville borough, Somerset County, New Jersey, United States Census Bureau. Accessed May 3, 2012.\n^ \n^ a b Table DP-1. Profile of General Demographic Characteristics: 2010 for Somerville borough, New Jersey Department of Labor and Workforce Development. Accessed May 3, 2012.\n^ \n^ a b GCT-PH1 Population, Housing Units, Area, and Density: 2010 - State -- County Subdivision from the 2010 Census Summary File 1 for New Jersey, United States Census Bureau. Accessed February 14, 2013.\n^ Look Up a ZIP Code for Somerville, NJ, United States Postal Service. Accessed May 3, 2012.\n^ Zip Codes, State of New Jersey. Accessed August 30, 2013.\n^ Area Code Lookup - NPA NXX for Somerville, NJ, Area-Codes.com. Accessed August 30, 2013.\n^ American FactFinder, United States Census Bureau. Accessed September 4, 2014.\n^ A Cure for the Common Codes: New Jersey, Missouri Census Data Center. Accessed November 26, 2012.\n^ US Board on Geographic Names, United States Geological Survey. Accessed September 4, 2014.\n^ Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010, New Jersey Department of Labor and Workforce Development, February 2011. Accessed February 14, 2013.\n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ Somerset County, NJ, National Association of Counties. Accessed January 21, 2013.\n^ Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 225. Accessed May 3, 2012.\n^ Somerville History, Borough of Somerville. Accessed August 3, 2006.\n^ Hutchinson, Viola L. The Origin of New Jersey Place Names, New Jersey Public Library Commission, May 1945. Accessed August 21, 2015.\n^ Gannett, Henry. The Origin of Certain Place Names in the United States, p. 286. United States Government Printing Office, 1905. Accessed August 21, 2015. \"Somerset; counties in Maine, New Jersey, and Pennsylvania, named from the county in England.\"", "title": "Somerville, New Jersey"}