{"summary": "A songwriter is a writer who creates songs.", "full_text": "A songwriter is an individual who writes the lyrics, melodies and chord progressions for songs, typically for a popular music genre such as pop music or country music. A songwriter can also be called a composer, although the latter term tends to be mainly used for individuals from the classical music genre. The pressure from the music industry to produce popular hits means that songwriting is often an activity for which the task are distributed between a number of people. For example, a songwriter who excels at writing lyrics might be paired with a songwriter for a gift for creating original melodies. Pop songs may be written by group members from the band or by staff writers: songwriters directly employed by music publishers. Some songwriters serve as their own music publishers, while others have outside publishers. In the 2010s, songwriters are no longer dependent on labels to support their music. Technology has advanced to the point where songwriters can record at home with a laptop and a good-quality microphone.\nThe old-style apprenticeship approach to learning how to write songs is being supplemented by university degrees and college diplomas and \"rock schools.\" A knowledge of modern music technology , songwriting elements, and business skills are necessary requirements to make a songwriting career. Several music colleges offer songwriting diplomas and degrees with music business modules. Since songwriting and publishing royalties can be a substantial source of income, particularly if a song becomes a hit record, legally, in the US, songs written after 1934 may only be copied by the authors. The legal power to grant these permissions may be bought, sold or transferred. This is governed by international copyright law.\nProfessional songwriters can either be employed to write either the lyrics or the music directly for or alongside a performing artist, or they present songs to A&R, publishers, agents and managers for consideration. Song pitching can be done on a songwriter's behalf by their publisher or independently using tip sheets like RowFax, the MusicRow publication, and SongQuarters. Skills associated with song-writing include entrepreneurism and creativity.\n^ a b c d e f g \"How to pitch your songs to industry insiders.\". EMusician. 1 July 2007. Retrieved Aug 25, 2010. \n^ The quaternary entrepreneur, Gian Paolo Prandstraller - 2009", "title": "Songwriter"}