{"summary": "The South Bank is an area of London.", "full_text": "The South Bank is an entertainment and commercial district of Central London, England, next to the River Thames opposite the City of Westminster. It forms a narrow, unequal strip of riverside land within the London Borough of Lambeth and the London Borough of Southwark where it joins Bankside. As with most central London districts its edges evolve and are informally defined however its central area is bounded by Westminster Bridge and Blackfriars Bridge. Its name was adopted during the Festival of Britain over the local less attractive name of 'Lambeth Marsh'; it includes the County Hall, complex with the Sea Life London Aquarium, the London Dungeon, Jubilee Gardens and the London Eye, the Southbank Centre, Royal Festival Hall and National Theatre, among its long list of attractions. Both the County Hall and the Shell Centre contain major residential parts.\nSouth Bank developed later than the north bank of the river due to its formerly often waterlogged condition in winter, and throughout its history has twice functioned as an entertainment district, interspersed by around a hundred years of wharfs, domestic industry and manufacturing being its main use. Restoration began in 1917 with the construction of County Hall at Lambeth replacing the Lion Brewery, its Coade stone symbol was retained and placed on a pedestal at Westminster Bridge and is known as the South Bank Lion. The pedestrianised embankment is The Queen's Walk which is part of the Albert Embankment built not only for public drainage but to raise the whole tract of land and prevent flooding.\nIn 1951 the Festival of Britain redefined the area as a place for arts and entertainment. It now forms a significant tourist district in central London, stretching from the Blackfriars Bridge in the east to Westminster Bridge in the west. A series of central London bridges connect the area to the northern bank of the Thames Golden Jubilee and Waterloo Bridge.", "title": "South Bank"}