{"summary": "South Australia is one of the six states of Australia.", "full_text": "South Australia  is a state in the southern central part of Australia. It covers some of the most arid parts of the continent. With a total land area of 983,482 square kilometres , it is the fourth largest of Australia's states and territories.\nSouth Australia shares borders with all of the other mainland states, and with the Northern Territory; it is bordered to the west by Western Australia, to the north by the Northern Territory, to the north-east by Queensland, to the east by New South Wales, to the south-east by Victoria, and to the south by the Great Australian Bight and the Indian Ocean. With over 1.6 million people, the state comprises less than 8% of the Australian population and ranks fifth in population among the six states and two territories. The majority of its people reside in the state capital, Adelaide. Most of the remainder are settled in fertile areas along the south-eastern coast and River Murray. The state's colonial origins are unique in Australia as a freely settled, planned British province, rather than as a convict settlement. Official settlement began on 28 December 1836, when the colony was proclaimed at the Old Gum Tree by Governor John Hindmarsh.\nAs with the rest of the continent, the region had been long occupied by the indigenous Aboriginal peoples, who were organised into numerous tribes and languages. The first British settlement to be established was Kingscote, Kangaroo Island, on 26 July 1836, five months before Adelaide was founded. The guiding principle behind settlement was that of systematic colonisation, a theory espoused by Edward Gibbon Wakefield that was later employed by the New Zealand Company. The goal was to establish the province as a centre of civilisation for free immigrants, promising civil liberties and religious tolerance. Although its history is marked by economic hardship, South Australia has remained politically innovative and culturally vibrant. Today, it is known for its fine wine and numerous cultural festivals. The state's economy is dominated by the agricultural, manufacturing and mining industries. The state has an increasingly significant finance sector as well.", "title": "South Australia"}