{"summary": "The Southwestern United States  is a region of the western United States.", "full_text": "The Southwestern United States  is the United States portion of the Southwest . It is a region of the United States defined in different ways by different sources. The definition of what constitutes the American Southwest has evolved over the last one hundred and fifty years, moving steadily farther south and west, as well as becoming more confined in scope. Broad definitions have included nearly a quarter of the United States, including Arizona, California, Colorado, Nevada, New Mexico, Oklahoma, Texas, and Utah. Narrowly defined, the \"core\" Southwest is centered on Arizona and western New Mexico, the extreme western part of Texas, and the very southern parts of Colorado and Utah. This is one of the most common definitions of the term, as exemplified by archeologists such as Erik Reed and geologists such as D. W. Meinig. The other variations are discussed in separate section, the main article will deal with this core definition, which includes all of Arizona, the western portion of New Mexico, bordered on the east by the Llano Estacado, the southern portions of Colorado and Utah below the 39th parallel, the \"horn\" of Texas , the southernmost triangle of Nevada, and the very most southeastern portion of California, which encompasses the Mojave and Colorado Deserts.\nThe total population of the area is over 11 million people, with over half that in Arizona; the top five most populous cities in the Southwest  are: Phoenix, El Paso, Las Vegas, Albuquerque, and Tucson. Six of the top ten most populated cities in the Southwest are located in Arizona. Most of the area was a part of the Viceroyalty of New Spain, in the Spanish Empire, during the Modern Era, as well as being part of Mexico, after it won its freedom from European interests. The area became part of the United States through land acquired in the Treaty of Guadalupe Hidalgo and the Gadsden Purchase.", "title": "Southwestern United States"}