{"summary": "South Dakota is a state in the United States.", "full_text": "South Dakota  is a state located in the Midwestern region of the United States. It is named after the Lakota and Dakota Sioux Native American tribes. South Dakota is the 17th most extensive, but the 5th least populous and the 5th least densely populated of the 50 United States. Once the southern portion of the Dakota Territory, South Dakota became a state on November 2, 1889, simultaneously with North Dakota. Pierre is the state capital and Sioux Falls, with a population of about 165,000, is South Dakota's largest city.\nSouth Dakota is bordered by the states of North Dakota, Minnesota, Iowa, Nebraska, Wyoming, and Montana. The state is bisected by the Missouri River, dividing South Dakota into two geographically and socially distinct halves, known to residents as \"East River\" and \"West River\". Eastern South Dakota is home to most of the state's population, and fertile soil in this area is used to grow a variety of crops. West of the Missouri, ranching is the predominant agricultural activity, and the economy is more dependent on tourism and defense spending. The Black Hills, a group of low pine-covered mountains sacred to the Sioux, are located in the southwest part of the state. Mount Rushmore, a major tourist destination, is located there. South Dakota experiences a temperate continental climate, with four distinct seasons and precipitation ranging from moderate in the east to semi-arid in the west. The ecology of the state features species typical of a North American grassland biome.\nHumans have inhabited the area for several millennia, with the Sioux becoming dominant by the early 19th century. In the late 19th century, European-American settlement intensified after a gold rush in the Black Hills and the construction of railroads from the east. Encroaching miners and settlers triggered a number of Indian wars, ending with the Wounded Knee Massacre in 1890. Key events in the 20th century included the Dust Bowl and Great Depression, increased federal spending during the 1940s and 50s for agriculture and defense, and an industrialization of agriculture which has much reduced family farming.\nWhile several Democratic senators have represented South Dakota for multiple terms at the federal level, the state government is largely controlled by the Republican Party, whose nominees have carried South Dakota in each of the last 12 presidential elections. Historically dominated by an agricultural economy and a rural lifestyle, South Dakota has recently sought to diversify its economy in areas to attract and retain residents. South Dakota's history and rural character still strongly influence the culture of the state.", "title": "South Dakota"}