{"summary": "The Spitzer Space Telescope is a telescope launched into space by NASA in 2003. It is the fourth telescope in the Great Observatories program .", "full_text": "The Spitzer Space Telescope , formerly the Space Infrared Telescope Facility , is an infrared space observatory launched in 2003. It is the fourth and final of the NASA Great Observatories program.\nThe planned mission period was to be 2.5 years with a pre-launch expectation that the mission could extend to five or slightly more years until the onboard liquid helium supply was exhausted. This occurred on 15 May 2009. Without liquid helium to cool the telescope to the very low temperatures needed to operate, most of the instruments are no longer usable. However, the two shortest-wavelength modules of the IRAC camera are still operable with the same sensitivity as before the cryogen was exhausted, and will continue to be used in the Spitzer Warm Mission. All Spitzer data, from both the primary and warm phases, are archived at the Infrared Science Archive .\nIn keeping with NASA tradition, the telescope was renamed after its successful demonstration of operation, on 18 December 2003. Unlike most telescopes that are named after famous deceased astronomers by a board of scientists, the new name for SIRTF was obtained from a contest open to the general public.\nThe contest led to the telescope being named in honor of astronomer Lyman Spitzer, who had promoted the concept of space telescopes in the 1940s. Spitzer wrote a 1946 report for RAND Corporation describing the advantages of an extraterrestrial observatory and how it could be realized with available or upcoming technology. He has been cited for his pioneering contributions to rocketry and astronomy, as well as \"his vision and leadership in articulating the advantages and benefits to be realized from the Space Telescope Program.\"\nThe US$800 million Spitzer was launched from Cape Canaveral Air Force Station, on a Delta II 7920H ELV rocket, Monday, 25 August 2003 at 13:35:39 UTC-5 .\nIt follows a heliocentric instead of geocentric orbit, trailing and drifting away from Earth's orbit at approximately 0.1 astronomical unit per year . The primary mirror is 85 centimeters  in diameter, f/12, made of beryllium and was cooled to 5.5 K . The satellite contains three instruments that allow it to perform astronomical imaging and photometry from 3.6 to 160 micrometers, spectroscopy from 5.2 to 38 micrometers, and spectrophotometry from 5 to 100 micrometers.", "title": "Spitzer Space Telescope"}