{"summary": "Espionage or spying is a practice of getting information about an organization, society, or country that is meant to be secret or confidential, without permission.", "full_text": "Espionage or, casually, spying involves a spy ring, government and company/firm or individual obtaining information considered secret or confidential without the permission of the holder of the information. Espionage is inherently clandestine, as it is by definition unwelcome and in many cases illegal and punishable by law. Espionage is a subset of \"intelligence\" gathering, which includes espionage as well as information gathering from public sources.\nEspionage is often part of an institutional effort by a government or commercial concern. However, the term is generally associated with state spying on potential or actual enemies primarily for military purposes. Spying involving corporations is known as industrial espionage.\nOne of the most effective ways to gather data and information about the enemy  is by infiltrating the enemy's ranks. This is the job of the spy . Spies can bring back all sorts of information concerning the size and strength of enemy forces. They can also find dissidents within the enemy's forces and influence them to defect. In times of crisis, spies can also be used to steal technology and to sabotage the enemy in various ways. Counterintelligence operatives can feed false information to enemy spies, protecting important domestic secrets, and preventing attempts at subversion. Nearly every country has very strict laws concerning espionage, and the penalty for being caught is often severe. However, the benefits that can be gained through espionage are generally great enough that most governments and many large corporations make use of it to varying degrees.\nFurther information on clandestine HUMINT  information collection techniques is available, including discussions of operational techniques, asset recruiting, and the tradecraft used to collect this information.", "title": "Spy"}