{"summary": "In its broadest sense, Star Trek is a collection of science fiction video entertainments, owned by Paramount and CBS, as well as various spin-offs.", "full_text": "Star Trek is an American science fiction entertainment franchise created by Gene Roddenberry and owned by CBS and Paramount Pictures. Star Trek: The Original Series and its live-action TV spin-off series, Star Trek: The Next Generation, Star Trek: Deep Space Nine, Star Trek: Voyager, and Star Trek: Enterprise as well as the Star Trek film franchise make up the main canon. The canonicity of Star Trek: The Animated Series is debated, and the expansive library of Star Trek novels and comics is generally considered non-canon, although still part of the franchise.\nThe first series, now referred to as The Original Series, debuted in 1966 and ran for three seasons on NBC. It followed the interstellar adventures of James T. Kirk and the crew of the starship Enterprise, an exploration vessel of a 23rd-century interstellar \"United Federation of Planets\". In creating the first Star Trek, Roddenberry was inspired by Westerns such as Wagon Train, the Horatio Hornblower novels and Gulliver's Travels. In fact, the original series was almost titled Wagon Train to the Stars. These adventures continued in the short-lived Star Trek: The Animated Series and six feature films. Four spin-off television series were eventually produced: Star Trek: The Next Generation followed the crew of a new starship Enterprise set a century after the original series; Star Trek: Deep Space Nine and Star Trek: Voyager, set contemporaneously with The Next Generation; and Star Trek: Enterprise, set before the original series, in the early days of human interstellar travel. Four additional The Next Generation feature films were produced. In 2009, the film franchise underwent a relaunch with a prequel to the original series set in an alternate timeline titled simply Star Trek. This film featured a new cast portraying younger versions of the crew from the original show. A sequel to this film, Star Trek Into Darkness, premiered on May 16, 2013. A thirteenth theatrical feature, a sequel to Into Darkness, has been confirmed for release in July 2016, to coincide with the franchise's 50th anniversary. In November 2015, CBS announced the development of a new Star Trek TV series to be shown on a digital platform from January 2017.\nStar Trek has been a cult phenomenon for decades. Fans of the franchise are called Trekkies or Trekkers. The franchise spans a wide range of spin-offs including games, figurines, novels, toys, and comics. Star Trek had a themed attraction in Las Vegas that opened in 1998 and closed in September 2008. At least two museum exhibits of props travel the world. The series has its own full-fledged constructed language, Klingon. Several parodies have been made of Star Trek. In addition, viewers have produced several fan productions.\nStar Trek is noted for its influence on the world outside of science fiction. It has been cited as an inspiration for several technological inventions such as the cell phone. Moreover, the franchise is noted for its progressive era civil rights stances. The original series included one of television's first multiracial casts. Star Trek references can be found throughout popular culture from movies such as the submarine thriller Crimson Tide to the animated series South Park.", "title": "Star Trek"}