{"summary": "A stopwatch is a tool used to measure the amount of time something takes.", "full_text": "A stopwatch is a handheld timepiece designed to measure the amount of time elapsed from a particular time when it is activated to the time when the piece is deactivated. A large digital version of a stopwatch designed for viewing at a distance, as in a sports stadium, is called a stopclock.\n\nThe timing functions are traditionally controlled by two buttons on the case. Pressing the top button starts the timer running, and pressing the button a second time stops it, leaving the elapsed time displayed. A press of the second button then resets the stopwatch to zero. The second button is also used to record split times or lap times. When the split time button is pressed while the watch is running, the display freezes, allowing the elapsed time to that point to be read, but the watch mechanism continues running to record total elapsed time. Pressing the split button a second time allows the watch to resume display of total time.\nMechanical stopwatches are powered by a mainspring, which must be periodically wound up by turning the knurled knob at the top of the watch.\nDigital electronic stopwatches are available which, due to their crystal oscillator timing element, are much more accurate than mechanical timepieces. Because they contain a microchip, they often include date and time-of-day functions as well. Some may have a connector for external sensors, allowing the stopwatch to be triggered by external events, thus measuring elapsed time far more accurately than is possible by pressing the buttons with one's finger. Stopwatches that count by 1/100 of a second are commonly mistaken as counting milliseconds, rather than centiseconds. The first digital timer used in organized sports was the Digitimer, developed by Cox Electronic Systems, Inc. of Salt Lake City Utah . It utilized a Nixie-tube readout and provided a resolution of 1/1000 second. Its first use was in ski racing, but was later used by the World University Games in Moscow, Russia, the U.S. NCAA, and in the Olympic trials.\nThe device is used when time periods must be measured precisely and with a minimum of complications. Laboratory experiments and sporting events like sprints are good examples.\nThe stopwatch function is also present as an additional function of many digital wristwatches, cell phones, portable music players, and computers.", "title": "Stopwatch"}