{"summary": "The strong interaction  is a force that acts between particles in the nucleus of an atom.", "full_text": "In particle physics, the strong interaction is the mechanism responsible for the strong nuclear force , one of the four known fundamental interactions of nature, the others being electromagnetism, the weak interaction and gravitation. Despite only operating at a distance of a femtometer, it is the strongest force, being approximately 100 times stronger than electromagnetism, a million times stronger than weak interaction and 1038 times stronger than gravitation at that range. It ensures the stability of ordinary matter, confining quarks into hadron particles, such as the proton and neutron, the largest components of the mass of ordinary matter. Furthermore, most of the mass-energy of a common proton or neutron is in the form of the strong force field energy; the individual quarks provide only about 1% of the mass-energy of a proton.\nThe strong interaction is observable in two areas: on a larger scale , it is the force that binds protons and neutrons  together to form the nucleus of an atom. On the smaller scale , it is the force  that holds quarks together to form protons, neutrons, and other hadron particles. The strong force inherently has such a high strength that hadrons bound by the strong force can produce new massive particles. Thus, if hadrons are struck by high-energy particles, they give rise to new hadrons instead of emitting freely moving radiation . This property of the strong force is called color confinement, and it prevents the free \"emission\" of the strong force: instead, in practice, jets of massive particles are observed.\nIn the context of binding protons and neutrons together to form atomic nuclei, the strong interaction is called the nuclear force . In this case, it is the residuum of the strong interaction between the quarks that make up the protons and neutrons. As such, the residual strong interaction obeys a quite different distance-dependent behavior between nucleons, from when it is acting to bind quarks within nucleons. The binding energy that is partly released on the breakup of a nucleus is related to the residual strong force and is harnessed in nuclear power and fission-type nuclear weapons.\nThe strong interaction is hypothesized to be mediated by massless particles called gluons, that are exchanged between quarks, antiquarks, and other gluons. Gluons, in turn, are thought to interact with quarks and gluons as all carry a type of charge called color charge. Color charge is analogous to electromagnetic charge, but it comes in three types rather than one  that results in a different type of force, with different rules of behavior. These rules are detailed in the theory of quantum chromodynamics , which is the theory of quark-gluon interactions.\nAfter the Big Bang, during the electroweak epoch, the electroweak force separated from the strong force. Although it is expected that a Grand Unified Theory exists to describe this, no such theory has been successfully formulated, and the unification remains an unsolved problem in physics.", "title": "Strong force"}