{"summary": "James Strom Thurmond  was an American politician.", "full_text": "James Strom Thurmond  was an American politician who served for 48 years as a United States Senator from South Carolina. He ran for president in 1948 as the States Rights Democratic Party candidate, receiving 2.4% of the popular vote and 39 electoral votes. Thurmond represented South Carolina in the United States Senate from 1954 until 2003, at first as a Democrat and, after 1964, as a Republican.\nA magnet for controversy during his nearly half-century Senate career, Thurmond switched parties because of his opposition to the 1964 Civil Rights Act, disaffection with the liberalism of the national party, and his support for the conservatism of the Republican presidential candidate Senator Barry Goldwater. He left office as the only member of either house of Congress to reach the age of 100 while still in office, and as the oldest-serving and longest-serving senator in U.S. history . Thurmond holds the record as the longest-serving member of Congress to serve exclusively in the Senate. He is also the longest-serving Republican member of Congress in U.S. history. At 14 years, he was also the longest-serving Dean of the United States Senate in U.S. history.\nIn opposition to the Civil Rights Act of 1957, he conducted the longest filibuster ever by a lone senator, at 24 hours and 18 minutes in length, nonstop. In the 1960s, he opposed the civil rights legislation of 1964 and 1965 to end segregation and enforce the constitutional rights of African-American citizens, including suffrage. He always insisted he had never been a racist, but was opposed to excessive federal authority. He attributed the movement to practice constitutional rights to Communist agitators. In 1948, Thurmond stated:\n\nall the laws of Washington and all the bayonets of the Army cannot force the Negro into our homes, into our schools, our churches and our places of recreation and amusement.\n\nStarting in the 1970s, he moderated his position on race, but continued to defend his early segregationist campaigns on the basis of states' rights in the context of Southern society at the time. He never fully renounced his earlier viewpoints.\nSix months after Thurmond died in 2003, his mixed-race, grown daughter Essie Mae Washington-Williams revealed that he was her father. Her mother Carrie Butler had been 16 years old and working as his family's maid when she became involved with Thurmond, who was 22. Although Thurmond never publicly acknowledged Essie Mae Washington, he paid for her education at a historically black college and passed other money to her for some time. She said that she kept silent out of respect for her father and denied that the two had agreed that she would not reveal her connection to Thurmond. His children by his marriage eventually acknowledged her. Her name has since been added as one of his children to his memorial at the state capital.", "title": "Strom Thurmond"}