{"summary": "Sulfur  is a chemical element.", "full_text": "Sulfur or sulphur  is a chemical element with symbol S and atomic number 16. It is an abundant, multivalent non-metal. Under normal conditions, sulfur atoms form cyclic octatomic molecules with chemical formula S8. Elemental sulfur is a bright yellow crystalline solid at room temperature. Chemically, sulfur reacts with all elements except for nitrogen and the noble gases.\nElemental sulfur occurs naturally as the element , but most commonly occurs in combined forms as sulfide and sulfate minerals. Being abundant in native form, sulfur was known in ancient times, being mentioned for its uses in ancient India, ancient Greece, China, and Egypt. Sulfur is referred to in the Bible as brimstone. Today, almost all elemental sulfur is produced as a byproduct of removing sulfur-containing contaminants from natural gas and petroleum. The element's largest commercial use  is to produce sulfate and phosphate fertilizers, because of the relatively high requirement of plants for sulfur and phosphorus. Sulfuric acid is also a primary industrial chemical outside fertilizer manufacture. Other uses for the element are in matches, insecticides and fungicides. Many sulfur compounds are odoriferous, and the smell of odorized natural gas, skunk scent, grapefruit, and garlic is due to organosulfur compounds. Hydrogen sulfide imparts the characteristic odor to rotting eggs and other biological processes.\nSulfur is an essential element for all life, but almost always in the form of organosulfur compounds or metal sulfides. Three amino acids  and two vitamins  are organosulfur compounds. Many cofactors also contain sulfur including glutathione and thioredoxin and iron-sulfur proteins. Disulfides, S-S bonds, confer mechanical strength and insolubility of the protein keratin, found in outer skin, hair, and feathers. Elemental sulfur is not common in higher forms of life, but is both a product and an oxidant for various bacteria.", "title": "Sulfur"}