{"summary": "The Supermarine Spitfire is a British single-seat fighter aircraft.", "full_text": "The Supermarine Spitfire is a British single-seat fighter aircraft that was used by the Royal Air Force and many other Allied countries before, during and after the Second World War. The Spitfire was built in many variants, using several wing configurations, and was produced in greater numbers than any other British aircraft. It was also the only British fighter to be in continuous production throughout the war. The Spitfire continues to be popular among enthusiasts, with approximately 53 Spitfires being airworthy, while many more are static exhibits in aviation museums throughout the world.\nThe Spitfire was designed as a short-range, high-performance interceptor aircraft by R. J. Mitchell, chief designer at Supermarine Aviation Works . In accordance with its role as an interceptor, Mitchell supported the development of the Spitfire's distinctive elliptical wing  to have the thinnest possible cross-section; this thin wing enabled the Spitfire to have a higher top speed than several contemporary fighters, including the Hawker Hurricane. Mitchell continued to refine the design until his death in 1937, whereupon his colleague Joseph Smith took over as chief designer, overseeing the development of the Spitfire through its multitude of variants.\nDuring the Battle of Britain, from July to October 1940, the Spitfire was perceived by the public to be the RAF fighter, though the more numerous Hawker Hurricane shouldered a greater proportion of the burden against the Nazi German air force, the Luftwaffe. Spitfire units, however, had a lower attrition rate and a higher victory-to-loss ratio than those flying Hurricanes because of its higher performance. Spitfires in general were tasked with engaging the Luftwaffe fighters during the Battle.\nAfter the Battle of Britain the Spitfire superseded the Hurricane to become the backbone of RAF Fighter Command, and saw action in the European, Mediterranean, Pacific and the South-East Asian theatres. Much loved by its pilots, the Spitfire served in several roles, including interceptor, photo-reconnaissance, fighter-bomber and trainer, and it continued to serve in these roles until the 1950s. The Seafire was a carrier-based adaptation of the Spitfire which served in the Fleet Air Arm from 1942 through to the mid-1950s. Although the original airframe was designed to be powered by a Rolls-Royce Merlin engine producing 1,030 hp , it was strong enough and adaptable enough to use increasingly powerful Merlins and, in later marks, Rolls-Royce Griffon engines producing up to 2,340 hp ; as a consequence of this the Spitfire's performance and capabilities improved over the course of its life.\n^ \n^ \"Ireland Air Force.\" aeroflight.co. Retrieved 27 September 2009.\n^ \n^", "title": "Supermarine Spitfire"}