{"summary": "A supercomputer is a computer with great speed and memory.", "full_text": "A supercomputer is a computer with a high-level computational capacity compared to a general-purpose computer. Performance of a supercomputer is measured in floating-point operations per second  instead of million instructions per second . As of 2015, there are supercomputers which can perform up to quadrillions of FLOPS.\nSupercomputers were introduced in the 1960s, made initially, and for decades primarily, by Seymour Cray at Control Data Corporation , Cray Research and subsequent companies bearing his name or monogram. While the supercomputers of the 1970s used only a few processors, in the 1990s machines with thousands of processors began to appear and, by the end of the 20th century, massively parallel supercomputers with tens of thousands of \"off-the-shelf\" processors were the norm. Since its introduction in June 2013, China's Tianhe-2 supercomputer is currently the fastest in the world at 33.86 petaFLOPS , or 33.86 quadrillions of FLOPS.\nSupercomputers play an important role in the field of computational science, and are used for a wide range of computationally intensive tasks in various fields, including quantum mechanics, weather forecasting, climate research, oil and gas exploration, molecular modeling , and physical simulations . Throughout their history, they have been essential in the field of cryptanalysis.\nSystems with massive numbers of processors generally take one of the two paths: in one approach , a large number of discrete computers  distributed across a network  devote some or all of their time to solving a common problem; each individual computer  receives and completes many small tasks, reporting the results to a central server which integrates the task results from all the clients into the overall solution. In another approach, a large number of dedicated processors are placed in close proximity to each other ; this saves considerable time moving data around and makes it possible for the processors to work together , for example in mesh and hypercube architectures.\nThe use of multi-core processors combined with centralization is an emerging trend; one can think of this as a small cluster  that both depends upon and contributes to the cloud.", "title": "Supercomputer"}