{"summary": "Superman is a famous comic book character.", "full_text": "Superman is a fictional superhero appearing in American comic books published by DC Comics. He was created by writer Jerry Siegel and artist Joe Shuster in 1933; later, in 1938, the character was sold to Detective Comics, Inc. . Superman first appeared in Action Comics #1  and subsequently appeared in various radio serials, newspaper strips, television programs, films, and video games. With this success, Superman helped to create the superhero genre and establish its primacy within the American comic book.\nSuperman's appearance is distinctive and iconic; he usually wears a blue costume, red cape, and stylized red-and-yellow \"S\" shield on his chest. This shield is used in a myriad of media to symbolize the character. The origin story of Superman relates that he was born Kal-El on the planet Krypton, before being rocketed to Earth as an infant by his scientist father Jor-El, moments before Krypton's destruction. Discovered and adopted by a Kansas farmer and his wife, the child is raised as Clark Kent and imbued with a strong moral compass. Very early on he started to display various superhuman abilities, which, upon reaching maturity, he resolved to use for the benefit of humanity through a secret \"Superman\" identity . Superman resides and operates in the fictional American city of Metropolis. As Clark Kent, he is a journalist for the Daily Planet, a Metropolis newspaper. Superman's love interest is generally Lois Lane, and his archenemy is supervillain Lex Luthor. Like other characters in the DC Universe, several alternative versions of Superman have been produced.\nSuperman is widely considered an American cultural icon He has fascinated scholars, with cultural theorists, commentators, and critics alike exploring the character's impact and role in the United States and worldwide. The character's ownership has often been the subject of dispute, with Siegel and Shuster twice suing for the return of rights. Superman is listed as the greatest comic-book hero by IGN, where editors noted that the character was the blueprint for subsequent superheroes.\n\n", "title": "Superman"}