{"summary": "In this Japanese name, the family name is Tonegawa.", "full_text": "Susumu Tonegawa  is a Japanese scientist who won the Nobel Prize for Physiology or Medicine in 1987 for his discovery of the genetic mechanism that produces antibody diversity. Although he won the Nobel Prize for his work in immunology, Tonegawa is a molecular biologist by training. In his later years, he has turned his attention to the molecular and cellular basis of memory formation.\nTonegawa is best known for figuring out the genetic mechanism of the adaptive immune system. One early idea was that each gene produces one protein. There are under 19,000 genes in the human body. However, the human body can produce millions of antibodies. Tonegawa showed in experiments beginning in 1976, genetic material rearranges itself to form millions of antibodies. Comparing the DNA of B cells  in embryonic and adult mice, he observed that genes in the mature B cells of the adult mice are moved around, recombined, and deleted to form the diversity of the variable region of antibodies.\nTonegawa was born in Nagoya, Japan and attended the Hibiya High School in Tokyo. He received his bachelor's degree from Kyoto University in 1963. He received his doctorate from the University of California, San Diego where he worked with Dr Masaki Hayashi. He did post-doctoral work at the Salk Institute in San Diego in the laboratory of Renato Dulbecco, then worked at the Basel Institute for Immunology in Basel, Switzerland, where he performed his landmark immunology experiments. In 1981, he became a professor at the Massachusetts Institute of Technology, and founded and directed what is now called the Picower Institute for Learning and Memory at MIT. In 1982, he was awarded the Louisa Gross Horwitz Prize from Columbia University together with Barbara McClintock, another Nobel Prize winner in 1983. He is a member of the Scientific Board of Governors at The Scripps Research Institute. He is currently the director of the RIKEN-MIT Center for Neural Circuit Genetics at MIT. While he heads a full research laboratory at MIT, as of April 1, 2009, he serves as the director of the RIKEN Brain Science Institute  in Wako-shi, Japan.\nHis son Satto committed suicide in his dorm room on October 24, 2011 while attending MIT.\nRecently a research report published by his group in Nature demonstrated that the activation of a specific sub-population of rat hippocampal neurons, labelled during an auditory fear conditioning paradigm, but not the conditioned tone cue due to drug-induced retrograde amnesia, is sufficient to evoke a behavioural response correlated with a precise memory trace. This shows for the first time that retrograde amnesia produced by protein synthesis inhibition likely does not impair the storage of episodic memories, but rather impairs the organism's ability to recover this memory.", "title": "Susumu Tonegawa"}