{"summary": "Taiwan  officially the Republic of China , is a state in East Asia.", "full_text": "Taiwan , officially the Republic of China , is a sovereign state in East Asia. The Republic of China, originally based in mainland China, now governs the island of Taiwan, which constitutes more than 99% of its territory, as well as Penghu, Kinmen, Matsu, and other minor islands, following its loss of the mainland China territory in 1949 in the Chinese Civil War. This remaining area is also constitutionally called the \"Free Area of the Republic of China\" which is free from Communist rule.\nNeighboring states include the People's Republic of China  to the west , Japan to the east and northeast, and the Philippines to the south. Taiwan is one of the most densely populated countries in the world with a population density of 648 people per km2 in July 2015. Taipei is the seat of the central government, and together with the surrounding cities of New Taipei and Keelung forms the largest metropolitan area on the island.\nThe island of Taiwan  was mainly inhabited by Taiwanese aborigines until the Dutch and Spanish settlement during the Age of Discovery in the 17th century, when Han Chinese began immigrating to the island. In 1662, the pro-Ming loyalist Koxinga expelled the Dutch and established the first Han Chinese polity on the island, the Kingdom of Tungning. The Qing dynasty of China later defeated the kingdom and annexed Taiwan. By the time Taiwan was ceded to Japan in 1895, the majority of Taiwan's inhabitants were Han Chinese either by ancestry or by assimilation. The Republic of China  was established in mainland China in 1912. After Japan's surrender in 1945, the ROC assumed its control of Taiwan. Following the Chinese civil war, the Communist Party of China took full control of mainland China and founded the People's Republic of China  in 1949. The ROC relocated its government to Taiwan, and its jurisdiction became limited to Taiwan and its surrounding islands, with the main island making up 99% of its de facto territory. Despite this, the ROC continued to represent China at the United Nations until 1971, when the PRC assumed China's seat via Resolution 2758 and the ROC lost its UN membership. International recognition of the ROC has gradually eroded as most countries switched recognition to the PRC. 21 UN member states and the Holy See currently maintain official diplomatic relations with the ROC. It has unofficial ties with most other states via its representative offices.\nOngoing issues of Cross-Strait relations as well as the political status of Taiwan are major factors of contention in Taiwanese politics and a cause of social and political division among political parties and their respective supporters within the country. Constitutionally, there is dispute over whether the ROC still lays claim to the sovereignty over all of \"China\", in a definition that includes mainland China and Outer Mongolia based on its pre-1949 territories. Since 1992, the ROC has not made retaking mainland China a political goal. However, the government's stance on defining its political position of relation with China largely depends on which political coalition is in charge. Meanwhile, the PRC also asserts itself to be the sole legal representation of China and claims Taiwan as its 23rd province to be under its sovereignty, denying the status and existence of ROC as a sovereign state. The PRC has threatened the use of military force as a response to any formal declaration of Taiwanese independence, or if it deems peaceful reunification no longer possible.\nDuring the latter half of the 20th century, Taiwan experienced rapid economic growth and industrialization and is now an advanced industrial economy. In the 1980s and early 1990s, Taiwan evolved into a multi-party democracy with universal suffrage. Taiwan is one of the Four Asian Tigers and a member of the WTO and APEC. The 21st-largest economy in the world, its high-tech industry plays a key role in the global economy. Taiwan is ranked highly in terms of freedom of the press, health care, public education, economic freedom, and human development.", "title": "Taiwan"}