{"summary": "Tajikistan is a country in South-central Asia.", "full_text": "Tajikistan , officially the Republic of Tajikistan , is a mountainous landlocked sovereign country in Central Asia. With an estimated 8 million people in 2013, it is the 98th most populous country and with an area of 143,100 km2 , it is the 96th largest country in the world. It is bordered by Afghanistan to the south, Uzbekistan to the west, Kyrgyzstan to the north, and China to the east. Pakistan lies to the south separated by the narrow Wakhan Corridor. Traditional homelands of Tajik people included present-day Tajikistan, Afghanistan and Uzbekistan.\nThe territory that now constitutes Tajikistan was previously home to several ancient cultures, including the city of Sarazm of the Neolithic and the Bronze Age, and was later home to kingdoms ruled by people of different faiths and cultures, including the Oxus civilization, Andronovo culture, Buddhism, Nestorian Christianity, Zoroastrianism, and Manichaeism. The area has been ruled by numerous empires and dynasties, including the Achaemenid Empire, Sassanian Empire, Hephthalite Empire, Samanid Empire, Mongol Empire, Timurid dynasty, and the Russian Empire. As a result of the breakup of the Soviet Union Tajikistan became an independent nation in 1991. A civil war was fought almost immediately after independence, lasting from 1992 to 1997. Since the end of the war, newly established political stability and foreign aid have allowed the country's economy to grow.\nTajikistan is a presidential republic consisting of four provinces. Most of Tajikistan's 8 million people belong to the Tajik ethnic group, who speak Tajik, a dialect of Modern Persian, although many people also speak Russian. Mountains cover more than 90% of the country. It has a transition economy that is dependent on aluminium and cotton production. Its economy is the 126th largest in the world in terms of purchasing power and 136th largest in terms of nominal GDP.", "title": "Tajikistan"}