{"summary": "Tehran , is the capital of Iran and the center of Tehran Province.", "full_text": "Tehran  is the capital of Iran and Tehran Province. With a population of around 9 million in the city and 16 million in the wider metropolitan area, Tehran is the largest city and urban area of Iran, the second largest city in Western Asia, and the 3rd largest in the Middle East. It is ranked 29th in the world by the population of its metropolitan area.\nIn the Classical era, part of the present-day city of Tehran was occupied by a Median city which in the Avesta occurs as Rhaga. It was destroyed by the Mongols in the early 13th century, and remains now as a city in Tehran Province, located towards the south end of the modern-day city of Tehran.\nTehran was first chosen as the capital of Iran by Agha Mohammad Khan of the Qajar dynasty in 1796, in order to remain in close reach of Iran's territories in the Caucasus, at that time still part of Iran, and to avoid vying factions of previous Iranian dynasties. The capital has been moved several times throughout the history, and Tehran is the 32nd national capital of Iran.\nThe city was the seat of Qajars and Pahlavis, the two last imperial dynasties of the country. It is home to many historical collections, such as the royal complexes of Golestan, Saadabad, and Niavaran, as well as the country's most important governmental buildings of the modern period.\nLarge scale demolition and rebuilding began in the 1920s, and Tehran has been subject of mass migration of people from all over Iran, since the 20th century.\nThe most famous landmarks of the city include the Azadi Tower, a memorial built during the Pahlavi period, and the Milad Tower, the world's 17th tallest freestanding structure which was built in 2007. The newly built Tabiat Bridge is considered as the 3rd symbol of the city.\nMajority of the people of Tehran are Persian-speaking people who identify themselves as Persians, and roughly 99% of the population understand and speak Persian; but there are also populations of other Iranian ethnicities such as Azerbaijanis, Armenians, Lurs, and Kurds who speak Persian as their second language.\nTehran is served by the Mehrabad and Khomeini international airports, a central railway station, the rapid transit rail system of Tehran Metro, as well as trolleybus and BRT systems, and has a huge network of highways.\nThere have been plans to relocate Iran's capital from Tehran to another area; due mainly to air pollution and the city's exposure to earthquakes.", "title": "Tehran"}