{"summary": "A telephone numbering plan is a system used in telecommunications to give telephone numbers to customers and to route telephone calls in a telephone network.", "full_text": "A telephone numbering plan is a type of numbering scheme used in telecommunication to assign telephone numbers to subscriber telephones or other telephony endpoints. Telephone numbers are the addresses of participants in a telephone network, reachable by a system of destination code routing. Telephone numbering plans are defined in each of administrative regions of the public switched telephone network  and they are also present in private telephone networks.\nNumbering plans may follow a variety of design strategies which have often arisen from the historical evolution of individual telephone networks and local requirements. A broad division is commonly recognized, distinguishing open numbering plans and closed numbering plans. A closed numbering plan imposes a fixed number of digits to every telephone number, while an open numbering plan allows variance in the numbers of digits. Many numbering plans subdivide their territory of service into geographic regions designated by an area code, which is a fixed-length or variable-length set of digits forming the most-significant part of the dialing sequence to reach a telephone subscriber.\nThe North American Numbering Plan is a closed numbering plan which prescribes ten digits for each complete destination routing code that is divided into three parts. The most significant part is a three-digit Numbering Plan Area  code . Within each plan area central offices are numbered with a three-digit central office  code, the second part. The remaining four digits number the specific line assigned to each telephone. Other countries with open numbering plans may use variable-length numbers; in some, such as Finland, subscriber numbers may vary in length even within a local exchange.\nThe International Telecommunication Union  has established a comprehensive numbering plan, designated E.164, for uniform interoperability of the networks of its member state or regional administrations. It is an open numbering plan, however, imposing a maximum length of 15 digits to telephone numbers. The standard defines a country calling code  for each state or region which is prefixed to each national numbering plan telephone number for international destination routing.\nPrivate numbering plans exist in telephone networks that are privately operated in an enterprise or organizational campus. Such systems may be supported by a private branch exchange  which controls internal communications between telephone extensions.\nIn contrast to numbering plans, which determine telephone numbers assigned to subscriber stations, a dial plan establishes the customer dialing procedures, i.e. the sequence of digits users are required to dial to reach a destination. Even in closed numbering plans, it is not always necessary to dial all digits of a number. For example, an area code may often be omitted when the destination is in the same area as the calling station.", "title": "Telephone numbering plan"}