{"summary": "A television  is a machine with a screen.", "full_text": "A television, commonly referred to as TV, telly or the tube, is a telecommunication medium used for transmitting sound with moving images in monochrome , or in colour, and in two or three dimensions. It can refer to a television set, a television program, or the medium of television transmission. Television is a mass medium, for entertainment, education, news and advertising.\nTelevision became available in crude experimental forms in the late 1920s. After World War II, an improved form became popular in the United States and Britain, and television sets became commonplace in homes, businesses, and institutions. During the 1950s, television was the primary medium for influencing public opinion. In the mid-1960s, color broadcasting was introduced in the US and most other developed countries. The availability of storage media such as VHS tape , DVDs , and high-definition Blu-ray Discs  enabled viewers to watch recorded material such as movies. At the end of the first decade of the 2000s, digital television transmissions greatly increased in popularity. Another development was the move from standard-definition television   to high-definition television , which provides a resolution that is substantially higher. HDTV may be transmitted in various formats: 1080p, 1080i and 720p. Since 2010, with the invention of smart television, Internet television has increased the availability of television programs and movies via the Internet through services such as Netflix, iPlayer, Hulu, Roku and Chromecast.\nIn 2013, 79% of the world's households owned a television set. The replacement of early bulky, high-voltage cathode ray tube  screen displays with compact, energy-efficient, flat-panel alternative technologies such as plasma displays, LCDs , and OLED displays was a hardware revolution that began with computer monitors in the late 1990s. Most TV sets sold in the 2000s were flat-panel, mainly LEDs. Major manufacturers announced the discontinuation of CRT, DLP, plasma, and even fluorescent-backlit LCDs by the mid-2010s. LEDs are expected to be replaced gradually by OLEDs in the near future. Also, major manufacturers have announced that they will increasingly produce smart TV sets in the mid-2010s. Smart TVs with integrated Internet and Web 2.0 functions are beaome the dominant form of television by the late 2010s.\nTelevision signals were initially distributed only as terrestrial television using high-powered radio-frequency transmitters to broadcast the signal to individual television receivers. Alternatively television signals are distributed by co-axial cable or optical fibre, satellite systems and via the Internet. Until the early 2000s, these were transmitted as analog signals but countries started switching to digital, this transition is expected to be completed worldwide by late 2010s. A standard television set is composed of multiple internal electronic circuits, including a tuner for receiving and decoding broadcast signals. A visual display device which lacks a tuner is correctly called a video monitor rather than a television.", "title": "Television"}