{"summary": "Tennessee is a state in the United States.", "full_text": "Tennessee   is a U.S. state located in the Southeastern United States. Tennessee is the 36th largest and the 17th most populous of the 50 United States. Tennessee is bordered by Kentucky and Virginia to the north, North Carolina to the east, Georgia, Alabama, and Mississippi to the south, and Arkansas and Missouri to the west. The Appalachian Mountains dominate the eastern part of the state, and the Mississippi River forms the state's western border. Tennessee's capital and second largest city is Nashville, which has a population of 601,222. Memphis is the state's largest city, with a population of 653,450.\nThe state of Tennessee is rooted in the Watauga Association, a 1772 frontier pact generally regarded as the first constitutional government west of the Appalachians. What is now Tennessee was initially part of North Carolina, and later part of the Southwest Territory. Tennessee was admitted to the Union as the 16th state on June 1, 1796. Tennessee was the last state to leave the Union and join the Confederacy at the outbreak of the U.S. Civil War in 1861. Occupied by Union forces from 1862, it was the first state to be readmitted to the Union at the end of the war.\nTennessee furnished more soldiers for the Confederate Army than any other state, and more soldiers for the Union Army than any other Southern state. Beginning during Reconstruction, it had competitive party politics, but a Democratic takeover in the late 1880s resulted in passage of disfranchisement laws that excluded most blacks and many poor whites from voting. This sharply reduced competition in politics in the state until after passage of civil rights legislation in the mid-20th century. In the 20th century, Tennessee transitioned from an agrarian economy to a more diversified economy, aided by massive federal investment in the Tennessee Valley Authority and, in the early 1940s, the city of Oak Ridge. This city was established to house the Manhattan Project's uranium enrichment facilities, helping to build the world's first atomic bomb, which was used during World War II.\nTennessee has played a critical role in the development of many forms of American popular music, including rock and roll, blues, country, and rockabilly. Beale Street in Memphis is considered by many to be the birthplace of the blues, with musicians such as W.C. Handy performing in its clubs as early as 1909. Memphis is also home to Sun Records, where musicians such as Elvis Presley, Johnny Cash, Carl Perkins, Jerry Lee Lewis, Roy Orbison, and Charlie Rich began their recording careers, and where rock and roll took shape in the 1950s. The 1927 Victor recording sessions in Bristol generally mark the beginning of the country music genre and the rise of the Grand Ole Opry in the 1930s helped make Nashville the center of the country music recording industry. Three brick-and-mortar museums recognize Tennessee's role in nurturing various forms of popular music: the Memphis Rock N' Soul Museum, the Country Music Hall of Fame and Museum in Nashville, and the International Rock-A-Billy Museum in Jackson. Moreover, the Rockabilly Hall of Fame, an online site recognizing the development of rockabilly in which Tennessee played a crucial role, is based in Nashville.\nTennessee's major industries include agriculture, manufacturing, and tourism. Poultry, soybeans, and cattle are the state's primary agricultural products, and major manufacturing exports include chemicals, transportation equipment, and electrical equipment. The Great Smoky Mountains National Park, the nation's most visited national park, is headquartered in the eastern part of the state, and a section of the Appalachian Trail roughly follows the Tennessee-North Carolina border. Other major tourist attractions include the Tennessee Aquarium in Chattanooga; Dollywood in Pigeon Forge; the Parthenon, the Country Music Hall of Fame and Museum, and Ryman Auditorium in Nashville; the Jack Daniel's Distillery in Lynchburg; and Elvis Presley's Graceland residence and tomb, the Memphis Zoo, and the National Civil Rights Museum in Memphis.", "title": "Tennessee"}