{"summary": "Terminator 2: Judgment Day  is a 1991 American action-science fiction movie set in Los Angeles.", "full_text": "Terminator 2: Judgment Day  is a 1991 American science fiction action film co-written, produced and directed by James Cameron. The film stars Arnold Schwarzenegger, Linda Hamilton, Robert Patrick and Edward Furlong. It is the sequel to the 1984 film The Terminator, and the second installment in the Terminator franchise. Terminator 2 follows Sarah Connor  and her ten-year-old son John  as they are pursued by a new, more advanced Terminator, the liquid metal, shapeshifting T-1000 , sent back in time to kill John Connor and prevent him from becoming the leader of the human resistance. A second, less advanced Terminator  is also sent back in time to protect John.\nAfter a troubled pre-production characterized by legal disputes, Mario Kassar of Carolco Pictures emerged with the franchise's property rights in early 1990. This paved the way for the completion of the screenplay by a Cameron-led production team, and the October 1990 start of a shortened 186-day filming schedule. The production of Terminator 2 required a $102 million budget making it the most expensive film made up to that point. Much of the film's massive budget was spent on filming and special effects. The film was released on July 3, 1991, in time for the U.S. Independence Day weekend.\nThe film's visual effects saw breakthroughs in computer-generated imagery, including the first use of natural human motion for a computer-generated character and the first partially computer-generated main character. Terminator 2 was a critical and commercial success and influenced popular culture, especially the use of visual effects in films. It received many accolades, including four Academy Awards for Best Sound Editing, Best Sound Mixing, Best Makeup, and Best Visual Effects. The highest-grossing film of 1991 and Schwarzenegger's career, Terminator 2 has since been ranked by several publications such as the American Film Institute as one of the greatest action films, science fiction films and sequels of all time.\n\n", "title": "Terminator 2: Judgment Day"}