{"summary": "The following is a list of the current governors of the states and territories of the United States.", "full_text": "The territories of the United States are directly overseen by the United States federal government, in contrast to the states, which share sovereignty with the federal government. The five major territories are self-governing with locally elected governors, territorial legislatures and delegate Members of Congress.\nHistorically, territories were created to govern newly acquired land while the borders of the United States were still evolving. Most territories eventually attained statehood. Other territories administered by the United States went on to become independent countries, such as the Federated States of Micronesia , Marshall Islands and Palau. FSM, Marshall Islands and Palau gained independence under the Compact of Free Association, which allows the U.S. full authority over aid and defense in exchange for continued access to U.S. health care, government services such as the FCC and United States Postal Service, and the right for COFA citizens to work freely in the United States and vice versa.\nCurrently, there are sixteen territories of the United States, five of which are permanently inhabited: Puerto Rico, Guam, Northern Mariana Islands, the U.S. Virgin Islands, and American Samoa. Ten territories are small islands, atolls and reefs, spread across the Caribbean and Pacific, with no native or permanent populations: Palmyra Atoll, Baker Island, Howland Island, Jarvis Island, Johnston Atoll, Kingman Reef, Wake Island, Midway Islands, Navassa Island and Serranilla Bank. Uninhabited Bajo Nuevo Bank is administered by Colombia, but claimed by the United States under the Guano Islands Act.\nTerritories can be classified by whether they are incorporated  and whether they have an organized government through an Organic Act passed by the U.S. Congress.\nMany organized incorporated territories of the United States existed from 1789 to 1959 , through which 31 territories applied for and achieved statehood. In the process of organizing and promoting territories to statehood, some areas of a territory demographically lacking sufficient development and population densities were temporarily orphaned from parts of a larger territory at the time a vote was taken petitioning Congress for statehood rights. For example, when a portion of the Missouri Territory became the state of Missouri, the remaining portion of the territory, consisting of the present states of Iowa, Nebraska and the Dakotas, most of Kansas, Wyoming, and Montana, and parts of Colorado and Minnesota, effectively became an unorganized territory.", "title": "Territories of the United States"}