{"summary": "Thabo Mvuyelwa Mbeki  is a South African politician.", "full_text": "Thabo Mvuyelwa Mbeki  is a South African politician who served nine years as the second post-apartheid President of South Africa from 14 June 1999 to 24 September 2008. On 20 September 2008, with about nine months left in his second term, Mbeki announced his resignation after being recalled by the National Executive Committee of the ANC, following a conclusion by judge C. R. Nicholson of improper interference in the National Prosecuting Authority , including the prosecution of Jacob Zuma for corruption. On 12 January 2009, the Supreme Court of Appeal unanimously overturned judge Nicholson's judgment but the resignation stood.\nDuring his time in office the economy grew at an average rate of 4.5% per year. Mbeki created employment in the middle sectors of the economy and oversaw a fast-growing black middle class with the implementation of Black Economic Empowerment . This growth exacerbated the demand for trained professionals strained by emigration due to violent crime, but failed to address unemployment amongst the unskilled bulk of the population. He attracted the bulk of Africa's Foreign Direct Investment  and made South Africa the focal point of African growth. He was the architect of NEPAD whose aim is to develop an integrated socio-economic development framework for Africa. He also oversaw the successful building of economic bridges to BRIC  nations with the eventual formation of the India-Brazil-South Africa  Dialogue Forum to \"further political consultation and co-ordination as well as strengthening sectoral co-operation, and economic relations\".\nMbeki has mediated in difficult and complex issues on the African continent including Burundi, Democratic Republic of Congo , Ivory Coast, and some important peace agreements. He oversaw the transition from the Organisation of African Unity  to the African Union . His \"quiet diplomacy\" in Zimbabwe, however, is blamed for protracting the survival of Robert Mugabe's regime at the cost of thousands of lives and intense economic pressure on Zimbabwe's neighbours. He became a vocal leader of the Non-Aligned Movement in the United Nations, and, while leveraging South Africa's seat on the Security Council, he agitated for reform of that body.\nMbeki has received worldwide criticism for his stance on AIDS. He questions the link between HIV and AIDS and believes that the correlation between poverty and the AIDS rate in Africa was a challenge to the viral theory of AIDS. His fate was not helped by Health Minister Manto Tshabalala-Msimang and the overhaul of the pharmaceutical industry in South Africa. His ban of antiretroviral drugs in public hospitals was responsible for the premature deaths of between 330,000 and 365,000 people. Thabo Mbeki has also been criticised for responding to negative comments made about his government by accusing critics of racism.", "title": "Thabo Mbeki"}