{"summary": "The Kinks were an English rock band.", "full_text": "The Kinks were an English rock band formed in Muswell Hill, North London, in 1963 by brothers Dave and Ray Davies. They are regarded as one of the most important and influential rock groups of the era. The band emerged in 1964 during the height of British rhythm and blues and Merseybeat, and were briefly part of the British Invasion of the US until their touring ban in 1965. Their third single, the Ray Davies penned \"You Really Got Me\", became an international hit, topping the charts in the United Kingdom and reaching the Top 10 in the United States. Between the mid-1960s and early 1970s, the group released a string of hit singles; studio albums drew good reviews but sold less than compilations of their singles. They gained a reputation for reflecting English culture and lifestyle, fuelled by Ray Davies' observational writing style. Albums such as Face to Face, Something Else, The Kinks Are the Village Green Preservation Society, Arthur, Lola Versus Powerman and the Moneygoround and Muswell Hillbillies, along with their accompanying singles, are considered among the most influential recordings of the period.\nAfter a fallow period in the mid Seventies, the band experienced a revival during the late 1970s and early 1980s with albums Sleepwalker, Misfits, Low Budget, Give the People What They Want and State of Confusion. In addition, groups such as Van Halen, the Jam, the Knack, the Pretenders and the Fall covered their songs, helping to boost the Kinks' record sales. In the 1990s, Britpop acts such as Blur and Oasis cited the band as a major influence. The Kinks broke up in 1996, a result of the commercial failures of their last few albums and creative tension between the Davies brothers.\nTheir music was influenced by a wide range of genres, including rhythm and blues, British music hall, folk and country. Ray Davies  and Dave Davies  remained members throughout the group's 32-year run. Longest serving member Mick Avory  was replaced by Bob Henrit formerly of Argent in 1984. Original bassist Pete Quaife was replaced by John Dalton in 1969 and Dalton was in turn replaced by Jim Rodford in 1978. Session keyboardist Nicky Hopkins accompanied the band in the studio for many of their recordings in the mid-late 1960s. In 1969 keyboardist John Gosling joined the band, making them an official five-piece, while Ian Gibbons replaced him in 1979, playing in the band until its eventual demise.\nThe group had five Top 10 singles on the US Billboard chart. Nine of their albums charted in the Top 40. In the UK, the group had seventeen Top 20 singles and five Top 10 albums. Four of their albums have been certified gold by the RIAA. Among numerous honours, they received the Ivor Novello Award for \"Outstanding Service to British Music\". In 1990, the original four members of the Kinks were inducted into the Rock & Roll Hall of Fame, as well as the UK Music Hall of Fame in November 2005.", "title": "The Kinks"}