{"summary": "The Beatles were an English rock band, started in Liverpool, England in 1960. They were, and still are, one of the most successful and influential bands in the history of modern music.", "full_text": "The Beatles were an English rock band, formed in Liverpool in 1960. With members John Lennon, Paul McCartney, George Harrison and Ringo Starr, they became widely regarded as the foremost and most influential act of the rock era. Rooted in skiffle, beat, and 1950s rock and roll, the Beatles later experimented with several genres, ranging from pop ballads and Indian music to psychedelia and hard rock, often incorporating classical elements in innovative ways. In the early 1960s, their enormous popularity first emerged as \"Beatlemania\", but as the group's music grew in sophistication, led by primary songwriters Lennon and McCartney, they came to be perceived as an embodiment of the ideals shared by the counterculture of the 1960s.\nThe Beatles built their reputation playing clubs in Liverpool and Hamburg over a three-year period from 1960, with Stuart Sutcliffe initially serving as bass player. The core of Lennon, McCartney and Harrison went through a succession of drummers, most notably Pete Best, before settling on Starr. Manager Brian Epstein moulded them into a professional act and producer George Martin enhanced their musical potential. They gained popularity in the United Kingdom after their first hit, \"Love Me Do\", in late 1962. They acquired the nickname \"the Fab Four\" as Beatlemania grew in Britain over the following year, and by early 1964 they had become international stars, leading the \"British Invasion\" of the United States pop market. From 1965 onwards, the Beatles produced what many consider their finest material, including the innovative and widely influential albums Rubber Soul , Revolver , Sgt. Pepper's Lonely Hearts Club Band , The Beatles  and Abbey Road .\nAfter their break-up in 1970, they each enjoyed successful musical careers of varying lengths. McCartney and Starr, the surviving members, remain musically active. Lennon was shot and killed in December 1980, and Harrison died of lung cancer in November 2001.\nAccording to the RIAA, the Beatles are the best-selling music artists in the United States, with 178 million certified units. They have had more number-one albums on the British charts and sold more singles in the UK than any other act. In 2008, the group topped Billboard magazine's list of the all-time most successful \"Hot 100\" artists; as of 2015, they hold the record for most number-one hits on the Hot 100 chart with twenty. They have received ten Grammy Awards, an Academy Award for Best Original Song Score and fifteen Ivor Novello Awards. Collectively included in Time magazine's compilation of the twentieth century's 100 most influential people, they are the best-selling band in history, with estimated sales of over 600 million records worldwide. The group was inducted into the Rock and Roll Hall of Fame in 1988, with all four being inducted individually as well from 1994 to 2015.\n^ Unterberger, Richie. The Beatles at AllMusic. Retrieved 5 July 2013.\n^ Staff Writers, CNNMoney.com . \"Beatles' remastered box set, video game out\". CNNMoney.com. Retrieved 1 December 2011. \n^ Hotten, Russell . \"The Beatles at 50: From Fab Four to fabulously wealthy\". BBC News. Retrieved 28 January 2013.", "title": "The Beatles"}