{"summary": "Margaret Eleanor Atwood, OC  is a Canadian writer.", "full_text": "The Edible Woman is a 1969 novel that helped to establish Margaret Atwood as a prose writer of major significance. It is the story of a young woman whose sane, structured, consumer-oriented world starts to slip out of focus. Following her engagement, Marian feels her body and her self are becoming separated. As Marian begins endowing food with human qualities that cause her to identify with it, she finds herself unable to eat, repelled by metaphorical cannibalism. In a foreword written in 1979 for the Virago edition of The Edible Woman, Atwood described the work as protofeminist rather than feminist.\nAtwood explores gender stereotypes through characters who strictly adhere to them  and those who defy their constraints . The narrative point of view shifts from first to third person, accentuating Marian's slow detachment from reality. At the conclusion, first person narration returns, consistent with the character's willingness to take control of her life again. Food and clothing are major symbols used by the author to explore themes and grant the reader insight on each of the characters' personalities, moods and motivations.\nSetting is used to identify differences between the characters; for example, Duncan is encountered in a mundane laundromat, gloomy theatre or sleazy hotel. In comparison, Peter inhabits genteel bars and a sparkling new apartment. However these changing environments are also used to explore different angles of existence, contrasting a freer, wilder glimpse of life, with a civilised, gilded cage. This highlights the difficulties presented to women in the era, where freedom was synonymous with uncertainty but marriage presented problems of its own.\nThis novel's publication coincided with the rise of the women's movement in North America, but is described by Atwood as \"protofeminist\" because it was written in 1965 and thus anticipated second wave feminism.\nThe Edible Woman has been adapted for stage by Canadian playwright Dave Carley.", "title": "The Edible Woman"}