{"summary": "The Texas Chainsaw Massacre is a 1974 American horror movie, based on real events.", "full_text": "The Texas Chain Saw Massacre is a 1974 American slasher film, directed and produced by Tobe Hooper, who cowrote it with Kim Henkel. It stars Marilyn Burns, Paul A. Partain, Edwin Neal, Jim Siedow and Gunnar Hansen, who respectively portray Sally Hardesty, Franklin Hardesty, the hitchhiker, the proprietor, and Leatherface, the main antagonist. The film follows a group of friends who fall victim to a family of cannibals while on their way to visit an old homestead. Although it was marketed as a true story to attract a wider audience and as a subtle commentary on the era's political climate, its plot is entirely fictional; however, the character of Leatherface and minor plot details were inspired by the crimes of real-life murderer Ed Gein.\nHooper produced the film for less than $300,000 and used a cast of relatively unknown actors drawn mainly from central Texas, where the film was shot. The limited budget forced Hooper to film for long hours seven days a week, so that he could finish as quickly as possible and reduce equipment rental costs. Due to the film's violent content, Hooper struggled to find a distributor. Louis Perano of Bryanston Pictures eventually purchased the distribution rights. Hooper limited the quantity of onscreen gore in hopes of securing a PG rating, but the Motion Picture Association of America  rated it R. The film faced similar difficulties internationally.\nUpon its October 1974 release, The Texas Chain Saw Massacre was banned outright in several countries, and numerous theaters later stopped showing the film in response to complaints about its violence. While it initially drew a mixed reception from critics, it was enormously profitable, grossing over $30 million at the domestic box office. It has since received a positive reappraisal and gained a reputation as one of the best horror films in cinema history. It is credited with originating several elements common in the slasher genre, including the use of power tools as murder weapons and the characterization of the killer as a large, hulking, faceless figure. The popularity of the film led to a franchise that continued the story of Leatherface and his family through sequels, remakes, one prequel, comic books and video games.", "title": "The Texas Chainsaw Massacre"}