{"summary": "The Beach Boys are an American pop/surf rock group from Hawthorne, California.", "full_text": "The Beach Boys are an American rock band formed in Hawthorne, California in 1961. The group's original lineup consisted of brothers Brian, Dennis, and Carl Wilson, their cousin Mike Love, and their friend Al Jardine. Emerging at the vanguard of the \"California Sound\", the band's early music gained international popularity for distinct vocal harmonies and lyrics that evoked a southern California youth culture of surfing, cars, and romance. Influenced by jazz-based vocal groups, 1950s rock and roll, and doo-wop, Brian led the band to experiment with several genres ranging from pop ballads to psychedelic and baroque, while devising novel approaches to music production and arranging. While initially managed by the Wilsons' father Murry, Brian's creative ambitions and sophisticated songwriting abilities dominated the group's musical direction.\nReleased in 1966, the Pet Sounds album and the \"Good Vibrations\" single featured an intricate and multi-layered sound that represented a departure from the simple surf rock of the Beach Boys' early years. Soon after the dissolution of Smile, Brian gradually ceded control to the rest of the band, reducing his input because of mental health and substance abuse issues. Though the more democratic incarnation of the Beach Boys recorded a string of albums in various musical styles that garnered international critical success, the group struggled to reclaim their commercial momentum in America. Since the 1980s, much-publicized legal wrangling over royalties, songwriting credits and use of the band's name transpired.\nDennis drowned in 1983 and Carl died of lung cancer in 1998. After Carl's death, many live configurations of the band fronted by Mike Love and Bruce Johnston continued to tour into the 2000s while other members pursued solo projects. For the band's 50th anniversary, the surviving co-founders briefly reunited for a new studio album and world tour.\nThe Beach Boys are regarded as the most iconic American band and one of the most critically acclaimed, commercially successful, and widely influential bands of all time, while AllMusic stated that their \"unerring ability... made them America's first, best rock band.\" The group had over eighty songs chart worldwide, thirty-six of them US Top 40 hits , four reaching number-one on the Billboard Hot 100 chart. The Beach Boys have sold in excess of 100 million records worldwide, making them one of the world's best-selling bands of all time and are listed at number 12 on Rolling Stone magazine's 2004 list of the \"100 Greatest Artists of All Time\". They have received one Grammy Award for The Smile Sessions . The core quintet of the three Wilsons, Love and Jardine were inducted into the Rock and Roll Hall of Fame in 1988.\n\n", "title": "The Beach Boys"}