{"summary": "The Young and the Restless is a very popular American soap opera.", "full_text": "The Young and the Restless  is an American television soap opera created by William J. Bell and Lee Phillip Bell for CBS. The show is set in a fictional Wisconsin town called Genoa City, which is unlike and unrelated to the real life village of the same name, Genoa City, Wisconsin. First broadcast on March 26, 1973, The Young and the Restless was originally broadcast as half-hour episodes, five times a week. The show expanded to one hour episodes on February 4, 1980. In 2006, the series began airing encore episodes weeknights on SOAPnet until 2013, when Y&R moved to TVGN . Pop still airs the encore episodes on weeknights, starting July 1, 2013. The series is also syndicated internationally.\nThe Young and the Restless originally focused on two core families: the wealthy Brooks family and the working class Foster family. After a series of recasts and departures in the early 1980s, all the original characters except Jill Foster Abbott were written out. Bell replaced them with the new core families, the Abbotts and the Williamses. Over the years, other families such as the Newmans, Winters, and the Baldwin-Fishers were introduced. Despite these changes, one storyline that has endured through almost the show's entire run is the feud between Jill Abbott Fenmore and Katherine Chancellor, the longest rivalry on any American soap opera.\nSince its debut, The Young and the Restless has won eight Daytime Emmy Awards for Outstanding Drama Series. It is also currently the highest-rated daytime drama on American television. As of 2008, it had appeared at the top of the weekly Nielsen ratings in that category for more than 1,000 weeks since 1988. As of December 12, 2013, according to Nielsen ratings, The Young and the Restless was the leading daytime drama for an unprecedented 1,300 weeks, or 25 years. On January 15, 2014, the series was in the middle of its final year of its 2010 contract, and was renewed by CBS through 2017. Y&R is also a sister show to the Bells' other soap opera The Bold and the Beautiful, as several actors have crossed over between shows.", "title": "The Young and The Restless"}