{"summary": "The Temptations are a successful R&B singing group.", "full_text": "The Temptations are an American vocal group known for their success with Motown Records during the 1960s and 1970s. Known for their choreography, distinct harmonies, and flashy wardrobe, the group was highly influential to the evolution of R&B and soul music. Having sold tens of millions of albums, the Temptations are one of the most successful groups in music history. As of 2015, the Temptations continue to perform with one living original member, Otis Williams, still in the lineup.\nFeaturing five male vocalists and dancers , the group formed in 1960 in Detroit, Michigan under the name \"The Elgins\". The original founding members were originally members of two rival Detroit vocal groups: Otis Williams, Elbridge \"Al\" Bryant, and Melvin Franklin of Otis Williams & the Distants, and Eddie Kendricks and Paul Williams of the Primes. In 1964, Bryant was replaced by David Ruffin, who was the lead vocalist on a number of the group's biggest hits, including \"My Girl\" , \"Ain't Too Proud to Beg\" , and \"I Wish It Would Rain\" . Ruffin was replaced in 1968 by Dennis Edwards, with whom the group continued to record hit records such as \"Cloud Nine\"  and \"Ball of Confusion \" . The group's lineup has changed frequently since the departures of Kendricks and Paul Williams from the act in 1971. Later members of the group have included singers such as Richard Street, Damon Harris, Ron Tyson, and Ali-Ollie Woodson, with whom the group scored a late-period hit in 1984 with \"Treat Her Like a Lady\".\nOver the course of their career, the Temptations have released four Billboard Hot 100 number-one singles and fourteen R&B number-one singles, and their material has earned them three Grammy Awards. The Temptations were the first Motown recording act to win a Grammy Award - for \"Cloud Nine\" in 1969 - and in 2013 received the Grammy Lifetime Achievement Award. Six of the Temptations  were inducted to the Rock and Roll Hall of Fame in 1989. Three classic Temptations songs, \"My Girl\", \"Just My Imagination \", and \"Papa Was a Rollin' Stone\", are among The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll. The Temptations were also ranked at #68 on Rolling Stone magazine's list of the 100 Greatest Artists of all time.", "title": "The Temptations"}