{"summary": "A theory is a group of linked ideas intended to explain something.", "full_text": "Theory is a contemplative and rational type of abstract or generalizing thinking, or the results of such thinking. Depending on the context, the results might for example include generalized explanations of how nature works. The word has its roots in ancient Greek, but in modern use it has taken on several different related meanings. A theory is not the same as a hypothesis. A theory provides an explanatory framework for some observation, and from the assumptions of the explanation follows a number of possible hypotheses that can be tested in order to provide support for, or challenge, the theory.\nA theory can be normative , meaning a postulation about what ought to be. It provides \"goals, norms, and standards\". A theory can be a body of knowledge, which may or may not be associated with particular explanatory models. To theorize is to develop this body of knowledge.\nAs already in Aristotle's definitions, theory is very often contrasted to \"practice\"  a Greek term for \"doing\", which is opposed to theory because pure theory involves no doing apart from itself. A classical example of the distinction between \"theoretical\" and \"practical\" uses the discipline of medicine: medical theory involves trying to understand the causes and nature of health and sickness, while the practical side of medicine is trying to make people healthy. These two things are related but can be independent, because it is possible to research health and sickness without curing specific patients, and it is possible to cure a patient without knowing how the cure worked.\nIn modern science, the term \"theory\" refers to scientific theories, a well-confirmed type of explanation of nature, made in a way consistent with scientific method, and fulfilling the criteria required by modern science. Such theories are described in such a way that any scientist in the field is in a position to understand and either provide empirical support  or empirically contradict  it. Scientific theories are the most reliable, rigorous, and comprehensive form of scientific knowledge, in contrast to more common uses of the word \"theory\" that imply that something is unproven or speculative . Scientific theories are distinguished from hypotheses, which are individual empirically testable conjectures, and scientific laws, which are descriptive accounts of how nature will behave under certain conditions.", "title": "Theory"}