{"summary": "Theodore \"Teddy\" Roosevelt , was the 26th president of the United States.", "full_text": "Theodore Roosevelt , often referred to as Teddy or TR, was an American statesman, author, explorer, soldier, naturalist, and reformer who served as the 26th President of the United States, from 1901 to 1909. A leader of the Republican Party, he was a leading force of the Progressive Era. Born a sickly child with debilitating asthma, Roosevelt embraced a strenuous lifestyle and successfully regained his health. He integrated his exuberant personality, vast range of interests, and world-famous achievements into a \"cowboy\" persona defined by robust masculinity. Home-schooled, he became a lifelong naturalist before attending Harvard College. His first of many books, The Naval War of 1812 , established his reputation as both a learned historian and a popular writer. He entered politics, becoming the leader of the reform faction of Republicans in New York's state legislature. Following the deaths of his wife and mother, he escaped to the wilderness and operated a cattle ranch in the Dakotas. He returned to run unsuccessfully for Mayor of New York City in 1886. He served as Assistant Secretary of the Navy under William McKinley, resigning after one year to serve with the Rough Riders, gaining national fame for courage during the War in Cuba. Returning a war hero, he was elected governor of New York in 1898. A frustrated party establishment made him McKinley's running mate in the election of 1900. He campaigned vigorously across the country, helping McKinley win reelection by a landslide on a platform of peace, prosperity, and conservatism.\nThe assassination of President McKinley in September 1901 meant that at age 42, Roosevelt became the youngest United States President in history. Leading his party and country into the Progressive Era, he championed his \"Square Deal\" domestic policies, promising the average citizen fairness, breaking of trusts, regulation of railroads, and pure food and drugs. Making conservation a top priority, he established myriad new national parks, forests, and monuments in order to preserve the nation's natural resources. In foreign policy, he concentrated on Central America, where he began construction of the Panama Canal. He also greatly expanded the United States Navy and sent the Great White Fleet on a world tour to project the United States' naval power. His successful efforts to end the Russo-Japanese War won him the 1906 Nobel Peace Prize.\nElected in 1904 to a full term, he continued pursuit of progressive policies, eventually culminating in blockage of his legislative agenda in Congress. Roosevelt successfully groomed his close friend, William Howard Taft, for the presidency. After leaving office, he went on safari in Africa and toured Europe. Returning to the USA, he became frustrated with Taft's approach as his successor, trying, but failing to win the nomination in 1912. He founded his own party, the Progressive \"Bull Moose\" Party, and called for wide-ranging progressive reforms. The split allowed the Democrats to win the White House and Congress in 1912; those Republicans aligned with Taft would control the Republican Party for decades.\nFrustrated at home, Roosevelt led a two-year expedition in the Amazon, nearly dying of tropical disease. During World War I, he opposed President Wilson for keeping the U.S. out of the war against Germany, and offered his military services, which were never summoned. Although he planned to run again for president in 1920, his health quickly deteriorated, and he died in early 1919. Roosevelt has consistently been ranked by scholars as one of the greatest U.S. presidents. His face adorns Mount Rushmore alongside those of George Washington, Thomas Jefferson, and Abraham Lincoln.", "title": "Theodore Roosevelt"}