{"summary": "Nuclear fusion is the process of making a single heavy nucleus  from two lighter nuclei.", "full_text": "In nuclear physics, nuclear fusion is a nuclear reaction in which two or more atomic nuclei come very close and then collide at a very high speed and join to form a new nucleus. During this process, matter is not conserved because some of the matter of the fusing nuclei is converted to photons . Fusion is the process that powers active or \"main sequence\" stars.\nThe fusion of two nuclei with lower masses than iron-56  generally releases energy, while the fusion of nuclei heavier than iron absorbs energy. The opposite is true for the reverse process, nuclear fission. This means that generally only lighter elements are fusable, such as Hydrogen and Helium, and likewise, that generally only heavier elements are fissionable, such as Uranium and Plutonium. There are extreme astrophysical events that can lead to short periods of fusion with heavier nuclei. This is the process that gives rise to nucleosynthesis, the creation of the heavy elements during events such as supernova.\nFollowing the discovery of quantum tunneling by physicist Friedrich Hund, in 1929 Robert Atkinson and Fritz Houtermans used the measured masses of light elements to predict that large amounts of energy could be released by fusing small nuclei. Building upon the nuclear transmutation experiments by Ernest Rutherford, carried out several years earlier, the laboratory fusion of hydrogen isotopes was first accomplished by Mark Oliphant in 1932. During the remainder of that decade the steps of the main cycle of nuclear fusion in stars were worked out by Hans Bethe. Research into fusion for military purposes began in the early 1940s as part of the Manhattan Project. Fusion was accomplished in 1951 with the Greenhouse Item nuclear test. Nuclear fusion on a large scale in an explosion was first carried out on November 1, 1952, in the Ivy Mike hydrogen bomb test.\nResearch into developing controlled thermonuclear fusion for civil purposes also began in earnest in the 1950s, and it continues to this day. The present article is about the theory of fusion. For details of the quest for controlled fusion and its history, see the article Fusion power.\n\n", "title": "Thermonuclear reaction"}