{"summary": "Thin Lizzy are an Irish hard rock band that started in Dublin in 1969. Up to 1984 the band were led by bassist, songwriter and singer Phil Lynott .", "full_text": "Thin Lizzy are an Irish rock band formed in Dublin in 1969. Two of the founding members, drummer Brian Downey and bass guitarist and vocalist Phil Lynott, met while still in school. Lynott assumed the role of frontman and led them throughout their recording career of twelve studio albums. Thin Lizzy's most successful songs, \"Whiskey in the Jar\", \"Jailbreak\" and \"The Boys Are Back in Town\", were all major international hits which are still played regularly on hard rock and classic rock radio stations. After Lynott's death in 1986, various incarnations of the band have emerged over the years based initially around guitarists Scott Gorham and John Sykes, though Sykes left the band in 2009. Gorham later continued with a new line-up including Downey.\nLynott, Thin Lizzy's de facto leader, was composer or co-composer of almost all of the band's songs, and the first black Irishman to achieve commercial success in the field of rock music. Thin Lizzy boasted some of the most critically acclaimed guitarists throughout their history, with Downey and Lynott as the rhythm section, on the drums and bass guitar. As well as being multiracial, the band drew their members not only from both sides of the Irish border but also from both the Catholic and Protestant communities during The Troubles. Their music reflects a wide range of influences, including blues, soul music, psychedelic rock, and traditional Irish folk music, but is generally classified as hard rock or sometimes heavy metal. Rolling Stone magazine describes the band as distinctly hard rock, \"far apart from the braying mid-70s metal pack\".\nAllMusic critic John Dougan has written that \"As the band's creative force, Lynott was a more insightful and intelligent writer than many of his ilk, preferring slice-of-life working-class dramas of love and hate influenced by Bob Dylan, Van Morrison, Bruce Springsteen, and virtually all of the Irish literary tradition.\" Van Morrison, Jeff Beck and Jimi Hendrix were major influences during the early days of the band, and later influences included the pioneering twin lead guitars found in Wishbone Ash and American artists Little Feat and Bob Seger.\nIn 2012, Gorham and Downey decided against recording new material as Thin Lizzy so a new band, Black Star Riders, was formed to tour and produce new releases such as the All Hell Breaks Loose album. Thin Lizzy plan to reunite for occasional concerts.", "title": "Thin Lizzy"}