{"summary": "The Thirteen Colonies were British North American colonies in which is now the eastern seaboard of the United States.", "full_text": "The Thirteen Colonies, as of 1775, were British colonies on the east coast of North America which had been founded between 1607  and 1732 , stretching from New England to the northern border of the Floridas . They had very similar political, constitutional and legal systems, and were dominated by Protestant English-speakers. As part of the British Empire, the colonies engaged in numerous wars against France , but France was expelled from North America in 1763. Most external connections were with Britain until the 1750s, when the colonies began collaborating with each other at the Albany Congress of 1754 to demand protection of their traditional rights as Englishmen, especially the principle of \"no taxation without representation\". Benjamin Franklin of Pennsylvania and other leaders began promoting a sense of American identity, originally as part of the shared British identity. Responding to popular grievances against London, they set up a Continental Congress in 1774, which declared independence from Great Britain in 1776, set up state governments, and formed a new nation, the United States. The thirteen were: Delaware, Pennsylvania, New Jersey, Georgia, Connecticut, Massachusetts Bay, Maryland, South Carolina, New Hampshire, Virginia, New York, North Carolina, and Rhode Island and Providence Plantations. The states of Massachusetts, Rhode Island, Connecticut, and New Jersey were formed by mergers of previous colonies. The states of Vermont and Kentucky were broken off from the former colonies of New York and Virginia respectively, in the early days of the republic.\nSeveral colonies, which were originally begun as charter colonies or proprietary colonies were converted to royal colonies and saw increased direct British government involvement in colonial policy. All the colonies also had a high degree of self-government and, in later years, most white men could and did vote for local legislative officials. The colonies were comparatively prosperous and had high growth rates based on immigration from Britain and Germany, together with ample food supplies and land for new settlers. Most families operated subsistence farms. All the colonies had legal slavery, with slave-based plantations in the South producing valuable exports such as tobacco and rice. The Northern and Middle colonies concentrated on trade. The frontier districts often confronted Indian wars, but by 1700 the colonists greatly outnumbered the Indians.\nThe government of the Kingdom of Great Britain in London practiced a policy of mercantilism. It administered the colonies for the benefit of the mother country, while the colonists after 1760 resisted British demands for more control, especially over taxes. The colonies were religiously diverse, though overwhelmingly Protestant with the Anglican Church of England officially established in most of the South, but there were no bishops and the churches had only local roles. Education was widespread in the northern colonies, which had established colleges such as Harvard College, Princeton College, and Yale College, while the College of William and Mary trained the elite in Virginia.", "title": "Thirteen Colonies"}