{"summary": "The Nobel Prize in Physiology or Medicine is one of the Nobel Prizes which were created by Alfred Nobel.", "full_text": "Thomas Huckle Weller  was an American virologist. He, John Franklin Enders and Frederick Chapman Robbins were awarded a Nobel Prize in Physiology or Medicine in 1954 for showing how to cultivate poliomyelitis viruses in a test tube, using a combination of human embryonic skin and muscle tissue.\nWeller was born and grew up in Ann Arbor, Michigan, and then went to the University of Michigan, where his father Carl Vernon Weller was a professor in the Department of Pathology. At Michigan, he studied medical zoology and received a B.S. and an M.S., with his masters thesis on fish parasites. In 1936, Weller entered Harvard Medical School, and in 1939 began working under John Franklin Enders, with whom he would later  share the Nobel Prize. It was Enders who got Weller involved in researching viruses and tissue-culture techniques for determining infectious disease causes. Weller received his MD in 1940, and went to work at Children's Hospital in Boston. In 1942, during World War II, he entered the Army Medical Corps and was stationed at the Antilles Medical Laboratory in Puerto Rico, earning the rank of Major and heading the facility's Departments of Bacteriology, Virology and Parasitology. After the War, he returned to Children's Hospital in Boston, and it was there in 1947, that he rejoined Enders in the newly created Research Division of Infectious Diseases. After several leading positions, in July 1954, he was appointed Tropical Public Health Department Head at the Harvard School of Public Health. Weller also served from 1953 to 1959 as Director of the Commission on Parasitic Diseases of the American Armed Forces Epidemiological Board. In 1954 he was awarded the George Ledlie prize in recognition of his research on rubella, polio and cytomegalovirus viruses.\nIn addition to his research on polio, for which he won the Nobel Prize, Weller also contributed to treating schistosomiasis, and Coxsackie viruses. He was also the first to isolate the virus responsible for varicella.\nIn 1945, Weller married Kathleen Fahey. They had two sons and two daughters.\n^ Thomas Weller, 93; Won Nobel Prize for Polio, Boston Globe, August 25, 2008", "title": "Thomas Huckle Weller"}