{"summary": "The 1979 Three Mile Island accident at the Three Mile Island Nuclear Power Plant in Pennsylvania was \"the single most important event in the fifty-year history of nuclear power regulation in the United States\".", "full_text": "The Three Mile Island accident was a partial nuclear meltdown that occurred on March 28, 1979, in one of the two Three Mile Island nuclear reactors in Dauphin County, Pennsylvania, United States. It was the worst accident in U.S. commercial nuclear power plant history. The incident was rated a five on the seven-point International Nuclear Event Scale: Accident With Wider Consequences.\nThe accident began with failures in the non-nuclear secondary system, followed by a stuck-open pilot-operated relief valve in the primary system, which allowed large amounts of nuclear reactor coolant to escape. The mechanical failures were compounded by the initial failure of plant operators to recognize the situation as a loss-of-coolant accident due to inadequate training and human factors, such as human-computer interaction design oversights relating to ambiguous control room indicators in the power plant's user interface. In particular, a hidden indicator light led to an operator manually overriding the automatic emergency cooling system of the reactor because the operator mistakenly believed that there was too much coolant water present in the reactor and causing the steam pressure release.\nThe accident crystallized anti-nuclear safety concerns among activists and the general public, resulted in new regulations for the nuclear industry, and has been cited as a contributor to the decline of a new reactor construction program that was already underway in the 1970s. The partial meltdown resulted in the release of unknown amounts of radioactive gases and radioactive iodine into the environment. Dire predictions were made by anti-nuclear movement activists; however epidemiological studies analyzing the rate of cancer in and around the area since the accident, determined there was a small statistically non-significant increase in the rate and thus no causal connection linking the accident with these cancers can be made. Cleanup started in August 1979, and officially ended in December 1993, with a total cleanup cost of about $1 billion.", "title": "Three Mile Island accident"}