{"summary": "A throne is the official chair or seat upon which a monarch  is seated on state or ceremonial occasions.", "full_text": "A throne is the seat of state of a potentate or dignitary, especially the seat occupied by a sovereign on state occasions; or the seat occupied by a pope or bishop on ceremonial occasions. \"Throne\" in an abstract sense can also refer to the monarchy or the Crown itself, an instance of metonymy, and is also used in many expressions such as \"the power behind the throne\".\nWhen used in a political or governmental sense, throne typically refers to a civilization, nation, tribe, or other politically designated group that is organized or governed under an authoritarian system. Throughout much of human history societies have been governed under authoritative systems, in particular dictatorial or autocratic systems, resulting in a wide variety of thrones that have been used by given heads of state. These have ranged from stools in places such as a Africa to ornate chairs and bench-like designs in Europe and Asia, respectively. Often, but not always, a throne is tied to a philosophical or religious ideology held by the nation or people in question, which serves a dual role in unifying the people under the reigning monarch and connecting the monarch upon the throne to his or her predecessors, who sat upon the throne previously. Accordingly, many thrones are typically held to have been constructed or fabricated out of rare or hard to find materials that may be valuable or important to the land in question. Depending on the size of the throne in question it may be large and ornately designed as an emplaced instrument of a nation's power, or it may be symbolic chair with little or no precious materials incorporated into the design.\nWhen used in a religious sense, throne can refer to one of two distinct uses. The first use derives from the practice in churches of having a bishop or higher ranking religious official  sit on a special chair which in church referred to by written sources as a \"throne\", and is intended to allow such high ranking religious officials a place to sit in their place of worship. The other use for throne refers to a belief among many of the world's monotheistic and polytheistic religions that the deity or deities that they worship are seated on a throne. Such beliefs go back to ancient times, and can be seen in surviving artwork and texts which discuss the idea of ancient gods  seated on thrones. In the major Abrahamic religions of Judaism, Christianity, and Islam, the Throne of God is attested to in religious scriptures and teachings, although the origin, nature, and idea of the Throne of God in these religions differs according to the given religious ideology practiced.\nIn the west, a throne is most identified as the seat upon which a person holding the title King, Queen, Emperor, or Empress sits in a nation using a monarchy political system, although there are a few exceptions, notably with regards to religious officials such as the Pope and bishops of various sects of the Christian faith. Changing geo-political tides have resulted in the collapse of several dictatorial and autocratic governments, which in turn have left a number of throne chairs empty, however the significance of a throne chair is such that many of these thrones - such as China's Dragon Throne - survive today as historic examples of nation's previous government.\n^ Oxford English Dictionary, ISBN 0-19-861186-2", "title": "Throne"}