{"summary": "Timbuktu is a city in Tombouctou Region, Mali.", "full_text": "Timbuktu , also spelled Timbuctoo and Timbuktoo, is a city in the West African nation of Mali situated 20 km  north of the River Niger on the southern edge of the Sahara Desert. The town is the capital of the Timbuktu Region, one of the eight administrative regions of Mali. It had a population of 54,453 in the 2009 census.\nStarting out as a seasonal settlement, Timbuktu became a permanent settlement early in the 12th century. After a shift in trading routes, Timbuktu flourished from the trade in salt, gold, ivory and slaves. It became part of the Mali Empire early in the 14th century. In the first half of the 15th century the Tuareg tribes took control of the city for a short period until the expanding Songhai Empire absorbed the city in 1468. A Moroccan army defeated the Songhai in 1591, and made Timbuktu, rather than Gao, their capital.\nThe invaders established a new ruling class, the arma, who after 1612 became virtually independent of Morocco. However, the golden age of the city was over and it entered a long period of decline. Different tribes governed until the French took over in 1893, a situation that lasted until it became part of the current Republic of Mali in 1960. Presently, Timbuktu is impoverished and suffers from desertification.\nIn its Golden Age, the town's numerous Islamic scholars and extensive trading network made possible an important book trade: together with the campuses of the Sankore Madrasah, an Islamic university, this established Timbuktu as a scholarly centre in Africa. Several notable historic writers, such as Shabeni and Leo Africanus, have described Timbuktu. These stories fueled speculation in Europe, where the city's reputation shifted from being extremely rich to being mysterious. This reputation overshadows the town itself in modern times, to the point where it is best known in Western culture as an expression for a distant or outlandish place.\n\n", "title": "Timbuktu"}