{"summary": "Yamaha is a Japanese company that makes different products, including musical instruments such as keyboards.", "full_text": "Torakusu Yamaha  was a Japanese entrepreneur who was the founder of the Yamaha Corporation.\nYamaha was a watchmaker who built his first portable reed organ in 1887. Then, he became the president of Nippon Gakki Co.  which makes Yamaha motorcycles and musical instruments.\nThe Yamaha brand trademark, YAMAHA, comes from the name of its founder Torakusu Yamaha who pioneered the production of Western musical instruments in Japan. Born to a family of a Kishu Tokugawa  clansman, Torakusu was captivated by Western science and technology from early on. Fascinated by the watches that were gaining popularity in Osaka at the time, he took up watchmaking, studying business along the way. Over time, Torakusu began repairing medical equipment and was invited to visit a hospital in Hamamatsu, Shizuoka Prefecture.\nOn one occasion, the hospital asked him if he would try to repair a reed organ. He agreed and was able to repair it successfully, marking the first step toward the birth of the Yamaha brand. Recognising its business potential, while repairing the organ, Torakusu created a blueprint for the inside of the organ, later creating his own prototype organ. To deliver it to the then Music Institute , Torakusu slung his creation over his shoulder on a carrying pole and crossed the mountains of Hakone. This historic trek was later immortalised as a bas-relief.\nThe organ, however, was criticised harshly for its poor tuning. Undaunted, and starting from zero, Torakusu began studying music theory and tuning. After four months of seemingly endless struggles from early morning to late at night, he was finally able to complete the organ. It is easy to see how he came up with the concept of the tuning fork mark, inspired by the difficult experience of studying tuning while holding a tuning fork in his hand.\nThis information is supplied by the Yamaha Corporation website.*", "title": "Torakusu Yamaha"}