{"summary": "\"Toxic\" is the second single released off of Britney Spears' fourth studio album In the Zone.", "full_text": "\"Toxic\" is a recorded song by American singer Britney Spears for her fourth studio album, In the Zone . It was written and produced by Christian Karlsson and Pontus Winnberg , with additional writing from Cathy Dennis and Henrik Jonback. The song released on January 13, 2004, by Jive Records, as the second single from the album. After trying to choose between \" Boom Boom\" and \"Outrageous\" to be the second single from In the Zone, Spears selected \"Toxic\" instead. A dance-pop song with electropop influences, \"Toxic\" features varied instrumentation, such as drums, synthesizers and surf guitar. It is accompanied by high-pitched Bollywood strings and breathy vocals. Its lyrics draw an extended metaphor of a lover as a dangerous yet addictive drug. The song has received critical acclaim by music critics, who deemed it as the strongest track of In the Zone and praised its hook and chorus.\n\"Toxic\" attained worldwide success, reaching the top-five in 15 countries, while topping the charts in Australia, Canada, Hungary, Ireland, Norway and the United Kingdom. In the United States, it became her fourth Top 10 single. The accompanying music video for the song was directed by Joseph Kahn and features references to Blade Runner, The Seven Year Itch and the films of John Woo. It portrays Spears as a secret agent in the search of a vial of green liquid. After she steals it, she enters an apartment and poisons her unfaithful boyfriend. The video also includes interspersed scenes of Spears naked with diamonds over her body. After Janet Jackson's Super Bowl incident, the video was considered too racy for MTV and was moved to late-night programming.\nSpears has performed \"Toxic\" in a number of live appearances, including the 2004 NRJ Music Awards and in three of her concert tours. It was the opening number of The Onyx Hotel Tour , where she sang atop of a bus wearing a black catsuit; Spears also performed remixed versions of the song at The Circus Starring Britney Spears , the Femme Fatale Tour  and Britney: Piece of Me . \"Toxic\" has been covered by artists such as Mark Ronson, A Static Lullaby, Reece Mastin and Ingrid Michaelson, and in television series Glee. The song has also appeared in feature films such as Knocked Up, You Again and television series Doctor Who. \"Toxic\" won Spears her first Grammy at the 2005 ceremony in the category of Best Dance Recording, while gaining her credibility amongst critics. The song has been included in lists by Pitchfork, NME and Rolling Stone as one of the best songs of the decade.", "title": "Toxic (song)"}