{"summary": "A trades union  is an organisation or group of workers who join together to negotiate pay, hours, benefits, and working conditions.", "full_text": "A trade union , labour union , or labor union  is an organization of workers who have come together to achieve common goals such as protecting the integrity of its trade, improving safety standards, achieving higher pay and benefits such as health care and retirement, increasing the number of employees an employer assigns to complete the work, and better working conditions. The trade union, through its leadership, bargains with the employer on behalf of union members  and negotiates labour contracts  with employers. The most common purpose of these associations or unions is \"maintaining or improving the conditions of their employment\". This may include the negotiation of wages, work rules, complaint procedures, rules governing hiring, firing and promotion of workers, benefits, workplace safety and policies.\nUnions may organise a particular section of skilled workers , a cross-section of workers from various trades , or attempt to organize all workers within a particular industry . The agreements negotiated by a union are binding on the rank and file members and the employer and in some cases on other non-member workers. Trade unions traditionally have a constitution which details the governance of their bargaining unit and also have governance at various levels of government depending on the industry that binds them legally to their negotiations and functioning.\nOriginating in Great Britain, trade unions became popular in many countries during the Industrial Revolution. Trade unions may be composed of individual workers, professionals, past workers, students, apprentices and/or the unemployed.\n^ Webb, Sidney; Webb, Beatrice . History of Trade Unionism. Longmans and Co. London.  ch. I\n^ Poole, M., 1986. Industrial Relations: Origins and Patterns of National Diversity. London UK: Routledge.", "title": "Trade union"}