{"summary": "A tribe is a group of people who live and work together.", "full_text": "A tribe is viewed, historically or developmentally, as a social group existing before the development of, or outside of, states. A tribe is a distinct people, dependent on their land for their livelihood, who are largely self-sufficient, and not integrated into the national society. It is perhaps the term most readily understood and used by the general public. Stephen Corry, director of Survival International, the world's only organisation dedicated to indigenous rights, has defined tribal people as \"those which have followed ways of life for many generations that are largely self-sufficient, and are clearly different from the mainstream and dominant society\". This definition, however, would not apply in countries in the Middle East such as Iraq, where the entire population is a member of one tribe or another and therefore tribalism itself is dominant and mainstream.\nThere are an estimated one hundred and fifty million tribal individuals worldwide, constituting around forty percent of indigenous individuals. However, although nearly all tribal people are also indigenous, there are some who are not indigenous to the areas where they live now.\nIt is important to make the distinction between tribal and indigenous because tribal peoples have a special status acknowledged in international law as well as problems in addition to those faced by the wider category of indigenous peoples.\nMany people used the term \"tribal society\" to refer to societies organized largely on the basis of social, especially familial, descent groups . A customary tribe in these terms is a face-to-face community, relatively bound by kinship relations, reciprocal exchange, and strong ties to place.\n\"Tribe\" is a contested term due to its roots in colonialism. The word has no shared referent, whether in political form, kinship relations or shared culture. Some argue that it conveys a negative connotation of a timeless unchanging past. To avoid these implications, some have chosen to use the terms \"ethnic group\", or nation instead.\nIn some places, such as North America and India, tribes are polities that have been granted legal recognition and limited autonomy by the state.", "title": "Tribe"}