{"summary": "In the Christian religion the Trinity is an idea, used to explain that three different people are called God in the Bible: God the Father, God the Son, and God the Holy Spirit .", "full_text": "The Christian doctrine of the Trinity  defines God as three consubstantial persons, expressions, or hypostases: the Father, the Son , and the Holy Spirit; \"one God in three persons\". The three persons are distinct, yet are one \"substance, essence or nature\". In this context, a \"nature\" is what one is, while a \"person\" is who one is.\nAccording to this central mystery of most Christian faiths, there is only one God in three persons: while distinct from one another in their relations of origin  and in their relations with one another, they are stated to be one in all else, co-equal, co-eternal and consubstantial, and \"each is God, whole and entire\". Accordingly, the whole work of creation and grace is seen as a single operation common to all three divine persons, in which each shows forth what is proper to him in the Trinity, so that all things are \"from the Father\", \"through the Son\" and \"in the Holy Spirit\".\nWhile the Fathers of the Church saw even Old Testament elements such as the appearance of three men to Abraham in Book of Genesis, chapter 18, as foreshadowings of the Trinity, it was the New Testament that they saw as a basis for developing the concept of the Trinity. The most influential of the New Testament texts seen as implying the teaching of the Trinity was Matthew 28:19, which mandated baptizing \"in the name of the Father, and of the Son, and of the Holy Spirit\". Reflection, proclamation and dialogue led to the formulation of the doctrine that was felt to correspond to the data in the Bible. The simplest outline of the doctrine was formulated in the 4th century, largely in terms of rejection of what was considered not to be consonant with general Christian belief. Further elaboration continued in the succeeding centuries.\nScripture contains neither the word Trinity, nor an expressly formulated doctrine of the Trinity. Rather, according to the Christian theology, it \"bears witness to\" the activity of a God who can only be understood in trinitarian terms. The doctrine did not take its definitive shape until late in the fourth century. During the intervening period, various tentative solutions, some more and some less satisfactory were proposed. Trinitarianism contrasts with nontrinitarian positions which include Binitarianism , Unitarianism , Oneness Pentecostalism or Modalism .\n\n^ Oxford Dictionaries\n^ The Family Bible Encyclopedia, 1972 p. 3790\n^ \n^ \n^ \n^ \n^ \n^ \n^ \n^ \n^ \"Trinity, doctrine of\" in The Oxford Dictionary of the Christian Church \n^ Matt Slick, \"The word Trinity is not found in the Bible\"\n^ \n^ \n^", "title": "Trinity"}