{"summary": "Trinity College is a college of the University of Cambridge in Cambridge, England.", "full_text": "Trinity College is a constituent college of the University of Cambridge in England. With around 600 undergraduates, 300 graduates, and over 180 fellows, it is the largest college in either of the Oxbridge universities. By student numbers, it is second to Homerton College, Cambridge.\nMembers of Trinity have won 32 Nobel Prizes out of the 91 won by members of Cambridge University, the highest number of any college. Five Fields Medals in mathematics were won by members of the college  and one Abel Prize was won.\nTrinity alumni include six British prime ministers , physicists Isaac Newton, James Clerk Maxwell, Ernest Rutherford and Niels Bohr, the poet Lord Byron, philosophers Ludwig Wittgenstein and Bertrand Russell , and Soviet spies Kim Philby, Guy Burgess, and Anthony Blunt.\nTwo members of the British Royal Family have studied at Trinity and been awarded degrees as a result: Prince William of Gloucester and Edinburgh, who gained an MA in 1790, and Prince Charles, who was awarded a lower second class BA in 1970. Other British Royal family members have studied there without obtaining degrees, including King Edward VII, King George VI, and Prince Henry, Duke of Gloucester.\nTrinity has many college societies, including the Trinity Mathematical Society, which is the oldest mathematical university society in the United Kingdom, and the First and Third Trinity Boat Club, its rowing club, which gives its name to the college's May Ball. Along with Christ's, Jesus, King's and St John's colleges, it has also provided several of the well known members of the Apostles, an intellectual secret society.\nIn 1848, Trinity hosted the meeting at which Cambridge undergraduates representing private schools such as Westminster drew up the first formal rules of football, known as the Cambridge Rules.\nTrinity's sister college in Oxford is Christ Church. Like that college, Trinity has been linked with Westminster School since the school's re-foundation in 1560, and its Master is an ex officio governor of the school.", "title": "Trinity College, Cambridge"}