{"summary": "A tsunami is a series of fast moving waves in the ocean caused by powerful earthquakes or volcanic eruptions.", "full_text": "A tsunami  , also known as a seismic sea wave, is a series of waves in a water body caused by the displacement of a large volume of water, generally in an ocean or a large lake. Earthquakes, volcanic eruptions and other underwater explosions , landslides, glacier calvings, meteorite impacts and other disturbances above or below water all have the potential to generate a tsunami. Unlike normal ocean waves which are generated by wind or tides which are generated by the gravitational pull of the Moon and Sun, a tsunami is generated by the displacement of water.\nTsunami waves do not resemble normal sea waves, because their wavelength is far longer. Rather than appearing as a breaking wave, a tsunami may instead initially resemble a rapidly rising tide, and for this reason they are often referred to as tidal waves, although this usage is not favored by the scientific community because tsunamis are not tidal in nature. Tsunamis generally consist of a series of waves with periods ranging from minutes to hours, arriving in a so-called \"wave train\". Wave heights of tens of meters can be generated by large events. Although the impact of tsunamis is limited to coastal areas, their destructive power can be enormous and they can affect entire ocean basins; the 2004 Indian Ocean tsunami was among the deadliest natural disasters in human history with at least 230,000 people killed or missing in 14 countries bordering the Indian Ocean.\nThe Greek historian Thucydides suggested in his late-5th century BC History of the Peloponnesian War, that tsunamis were related to submarine earthquakes, but the understanding of a tsunami's nature remained slim until the 20th century and much remains unknown. Major areas of current research include trying to determine why some large earthquakes do not generate tsunamis while other smaller ones do; trying to accurately forecast the passage of tsunamis across the oceans; and also to forecast how tsunami waves interact with specific shorelines.", "title": "Tsunami"}