{"summary": "Turin is a major industrial city on the west bank of the Po river in Piedmont, northwest Italy.", "full_text": "Turin  is a city and an important business and cultural centre in northern Italy, capital of the Piedmont region, located mainly on the left bank of the Po River, in front of Susa Valley and surrounded by the western Alpine arch. The population of the city proper is 911,823  while the population of the urban area is estimated by Eurostat to be 1.7 million inhabitants. The Turin metropolitan area is estimated by the OECD to have a population of 2.2 million.\nThe city has a rich culture and history, and is known for its numerous art galleries, restaurants, churches, palaces, opera houses, piazzas, parks, gardens, theatres, libraries, museums and other venues. Turin is well known for its renaissance, baroque, rococo, neo-classical, and art nouveau architecture.\nMuch of the city's public squares, castles, gardens and elegant palazzi such as Palazzo Madama, were built in the 16th and 18th century, after the capital of the Duchy of Savoy  was moved to Turin from Chambery  as part of the urban expansion.\nTurin is sometimes called the cradle of Italian liberty, for having been the birthplace and home of notable politicians and people who contributed to the Risorgimento, such as Cavour. The city currently hosts some of Italy's best universities, colleges, academies, lycea and gymnasia, such as the six-century-old University of Turin and the Turin Polytechnic. Prestigious and important museums, such as the Museo Egizio and the Mole Antonelliana are also found in the city. Turin's several monuments and sights make it one of the world's top 250 tourist destinations, and the tenth most visited city in Italy in 2008.\nThe city used to be a major European political centre, being Italy's first capital city in 1861 and being home to the House of Savoy, Italy's royal family. Even though much of its political significance and importance had been lost by World War II, it became a major European crossroad for industry, commerce and trade, and currently is one of Italy's main industrial centres, being part of the famous \"industrial triangle\", along with Milan and Genoa. Turin is ranked third in Italy, after Milan and Rome, for economic strength. With a GDP of $58 billion, Turin is the world's 78th richest city by purchasing power, and as of 2010 has been ranked by GaWC as a Gamma- world city. Turin is also home to much of the Italian automotive industry.\nTurin is well known as the home of the Shroud of Turin, the football teams Juventus F.C. and Torino F.C., the headquarters of automobile manufacturers FIAT, Lancia and Alfa Romeo, Iveco and as host of the 2006 Winter Olympics and, in the same year, the 37th Chess Olympiad. Several International Space Station modules, such as Harmony and Columbus, were also manufactured in Turin. It was the capital of the Duchy of Savoy from 1563, then of the Kingdom of Sardinia ruled by the Royal House of Savoy and finally the first capital of the unified Italy.\nIt is often referred to as the Capital of the Alps. Other popular epithets are the Automobile Capital of Italy and the Detroit of Italy, as it is the home of FIAT; in Italy it is also dubbed la capitale Sabauda .\n\n", "title": "Turin"}