{"summary": "Ukraine  is a country in Eastern Europe.", "full_text": "Ukraine  is a country in Eastern Europe, bordered by Russia to the east and northeast, Belarus to the northwest, Poland and Slovakia to the west, Hungary, Romania, and Moldova to the southwest, and the Black Sea and Sea of Azov to the south and southeast, respectively. It is currently in dispute with Russia over the Crimean peninsula which Russia annexed in 2014 but Ukraine and most of the international community still recognise as Ukrainian. Including Crimea, Ukraine has an area of 603,628 km2 , making it the largest country entirely within Europe and the 46th largest country in the world, and a population of about 44.5 million, making it the 32nd most populous country in the world.\nThe territory of modern Ukraine has been inhabited since 32,000 BC. During the Middle Ages, the area was a key centre of East Slavic culture, with the powerful state of Kievan Rus' forming the basis of Ukrainian identity. Following its fragmentation in the 13th century, the territory was contested, ruled and divided by a variety of powers, including Lithuania, Poland, the Ottoman Empire, Austria-Hungary, and Russia. A Cossack republic emerged and prospered during the 17th and 18th centuries, but its territory was eventually split between Poland and the Russian Empire, and later submerged fully into Russia. Two brief periods of independence occurred during the 20th century, once near the end of World War I and another during World War II, but both occasions would ultimately see Ukraine's territories conquered and consolidated into a Soviet republic, a situation that persisted until 1991, when Ukraine gained its independence from the Soviet Union in the aftermath of its dissolution at the end of the Cold War.\nFollowing independence, Ukraine declared itself a neutral state. but nonetheless formed a limited military partnership with the Russian Federation, other CIS countries and a partnership with NATO since 1994. In the 2000s, the government began leaning towards NATO, and a deeper cooperation with the alliance was set by the NATO-Ukraine Action Plan signed in 2002. It was later agreed that the question of joining NATO should be answered by a national referendum at some point in the future. Former President Viktor Yanukovych considered the current level of co-operation between Ukraine and NATO sufficient, and was against Ukraine joining NATO. In 2013, protests against the government of President Yanukovych broke out in downtown Kiev after the government made the decision to suspend the Ukraine-European Union Association Agreement and seek closer economic ties with Russia, this began a several months long wave of demonstrations and protests known as the Euromaidan, of which later escalated into a full on revolution that ultimately resulted in the overthrowing of Yanukovych and the establishment of a new government. These events precipitated the breakout of the Crimean Crisis with Russia in February 2014, and the War in Donbass in March 2014; both are still ongoing as of September 2015. On January 1, 2016, Ukraine will join the Deep and Comprehensive Free Trade Area with European Union.\nUkraine has long been a global breadbasket because of its extensive, fertile farmlands, and it remains one of the world's largest grain exporters. The diversified economy of Ukraine includes a large heavy industry sector, particularly in aerospace and industrial equipment.\nUkraine is a unitary republic under a semi-presidential system with separate powers: legislative, executive, and judicial branches. Its capital and largest city is Kiev. Ukraine maintains the second-largest military in Europe, after that of Russia, when reserves and paramilitary personnel are taken into account. The country is home to 45.4 million people , 77.8% of whom are Ukrainians by ethnicity, followed by a sizeable minority of Russians  as well as Romanians/Moldovans, Belarusians, Crimean Tatars, and Hungarians. Ukrainian is the official language of Ukraine; its alphabet is Cyrillic. The dominant religion in the country is Eastern Orthodoxy, which has strongly influenced Ukrainian architecture, literature and music.\n\n", "title": "Ukraine"}