{"summary": "Uncle Tom's Cabin; or, Life Among the Lowly is an anti-slavery novel by Harriet Beecher Stowe.", "full_text": "Uncle Tom's Cabin; or, Life Among the Lowly, is an anti-slavery novel by American author Harriet Beecher Stowe. Published in 1852, the novel \"helped lay the groundwork for the Civil War\", according to Will Kaufman.\nStowe, a Connecticut-born teacher at the Hartford Female Seminary and an active abolitionist, featured the character of Uncle Tom, a long-suffering black slave around whom the stories of other characters revolve. The sentimental novel depicts the reality of slavery while also asserting that Christian love can overcome something as destructive as enslavement of fellow human beings.\nUncle Tom's Cabin was the best-selling novel of the 19th century and the second best-selling book of that century, following the Bible. It is credited with helping fuel the abolitionist cause in the 1850s. In the first year after it was published, 300,000 copies of the book were sold in the United States; one million copies in Great Britain. In 1855, three years after it was published, it was called \"the most popular novel of our day.\" The impact attributed to the book is great, reinforced by a story that when Abraham Lincoln met Stowe at the start of the Civil War, Lincoln declared, \"So this is the little lady who started this great war.\" The quote is apocryphal; it did not appear in print until 1896, and it has been argued that \"The long-term durability of Lincoln's greeting as an anecdote in literary studies and Stowe scholarship can perhaps be explained in part by the desire among many contemporary intellectuals ... to affirm the role of literature as an agent of social change.\"\nThe book and the plays it inspired helped popularize a number of stereotypes about black people. These include the affectionate, dark-skinned \"mammy\"; the \"pickaninny\" stereotype of black children; and the \"Uncle Tom\", or dutiful, long-suffering servant faithful to his white master or mistress. In recent years, the negative associations with Uncle Tom's Cabin have, to an extent, overshadowed the historical impact of the book as a \"vital antislavery tool.\"", "title": "Uncle Tom's Cabin"}