{"summary": "Unemployment is when a person who is of normal working age  does not have a paid job.", "full_text": "Unemployment occurs when people are without work and actively seeking work. The unemployment rate is a measure of the prevalence of unemployment and it is calculated as a percentage by dividing the number of unemployed individuals by all individuals currently in the labor force. During periods of recession, an economy usually experiences a relatively high unemployment rate. According to International Labour Organization report, more than 200 million people globally or 6% of the world's workforce were without a job in 2012.\nThere remains considerable theoretical debate regarding the causes, consequences and solutions for unemployment. Classical economics, New classical economics, and the Austrian School of economics argue that market mechanisms are reliable means of resolving unemployment. These theories argue against interventions imposed on the labor market from the outside, such as unionization, bureaucratic work rules, minimum wage laws, taxes, and other regulations that they claim discourage the hiring of workers.\nKeynesian economics emphasizes the cyclical nature of unemployment and recommends government interventions in the economy that it claims will reduce unemployment during recessions. This theory focuses on recurrent shocks that suddenly reduce aggregate demand for goods and services and thus reduce demand for workers. Keynesian models recommend government interventions designed to increase demand for workers; these can include financial stimuli, publicly funded job creation, and expansionist monetary policies. Its namesake, economist John Maynard Keynes, believed that the root cause of unemployment is the desire of investors to receive more money rather than produce more products, which is not possible without public bodies producing new money.\nIn addition to these comprehensive theories of unemployment, there are a few categorizations of unemployment that are used to more precisely model the effects of unemployment within the economic system. The main types of unemployment include structural unemployment which focuses on structural problems in the economy and inefficiencies inherent in labour markets, including a mismatch between the supply and demand of laborers with necessary skill sets. Structural arguments emphasize causes and solutions related to disruptive technologies and globalization. Discussions of frictional unemployment focus on voluntary decisions to work based on each individuals' valuation of their own work and how that compares to current wage rates plus the time and effort required to find a job. Causes and solutions for frictional unemployment often address job entry threshold and wage rates. Behavioral economists highlight individual biases in decision making, and often involve problems and solutions concerning sticky wages and efficiency wages.", "title": "Unemployment"}