{"summary": "The Whig Party was a political party of the United States.", "full_text": "The Whig Party was a political party active in the middle of the 19th century in the United States of America. Many of the early Presidents of the United States were members of the Whig Party. Along with the rival Democratic Party, it was central to the Second Party System from the early 1830s to the mid-1850s. It formed in opposition to the policies of President Andrew Jackson  and his Democratic Party. In particular, the Whigs supported the supremacy of Congress over the Presidency and favored a program of modernization, banking and economic protectionism to stimulate manufacturing. It appealed to entrepreneurs and planters, but had few subsistence farmers or unskilled workers. It included many active Protestants, and voiced a moralistic opposition to the Jacksonian Indian removal policies. The \"Whig\" name was chosen to echo the American Whigs of 1776, who fought for independence. \"Whig\" meant opposing tyranny. Historian Frank Towers has specified a deep ideological divide:\nDemocrats stood for the 'sovereignty of the people' as expressed in popular demonstrations, constitutional conventions, and majority rule as a general principle of governing, whereas Whigs advocated the rule of law, written and unchanging constitutions, and protections for minority interests against majority tyranny.\nThe Whig Party nominated for president such national political luminaries as Daniel Webster and their preeminent leader, Henry Clay of Kentucky. The Whig Party also nominated for president war-hero generals William Henry Harrison , Zachary Taylor , and Winfield Scott . In its two decades of existence, the Whig Party had two of its candidates, William Henry Harrison and Zachary Taylor, elected President. Both died in office. John Tyler succeeded to the Presidency after Harrison's death in 1841, but he was expelled from the party. Millard Fillmore, who became President after Taylor's death in 1850, was the last president under the Whig label.\nThe party self-destructed because of the internal tension over the expansion of slavery to the territories. With deep fissures in the party on this question, the anti-slavery faction prevented the nomination for a full-term of its own incumbent, President Fillmore, in the 1852 presidential election; instead, the party nominated General Winfield Scott. Most Whig Party leaders eventually quit politics  or changed parties. The northern voter-base mostly gravitated to the new Republican Party. By the 1856 presidential election, the Whig Party had become defunct. The Constitutional Union Party enjoyed a moderate measure of success from conservative former Whigs  in the 1860 presidential election. In the South the party vanished, but Whig ideology as a policy orientation persisted for decades and played a major role in shaping the modernizing policies of the state governments during Reconstruction.\n\n", "title": "United States Whig Party"}