{"summary": "The United States Navy is part of the United States Armed Forces .", "full_text": "The United States Navy  is the naval warfare service branch of the United States Armed Forces and one of the seven uniformed services of the United States. The U.S. Navy is the largest, most capable navy in the world, with the highest combined battle fleet tonnage. The U.S. Navy has the world's largest aircraft carrier fleet, with ten in service, two in the reserve fleet, and three new class carriers under construction. The service has 328,186 personnel on active duty and 110,882 in the Navy Reserve. It has 272 deployable combat vessels and more than 3,700 aircraft in active service as of September 2015.\nThe U.S. Navy traces its origins to the Continental Navy, which was established during the American Revolutionary War and was essentially disbanded as a separate entity shortly thereafter. It played a major role in the American Civil War by blockading the Confederacy and seizing control of its rivers. It played the central role in the World War II defeat of Japan. The 21st century U.S. Navy maintains a sizable global presence, deploying in such areas as East Asia, the Mediterranean, and the Middle East. It is a blue-water navy with the ability to project force onto the littoral regions of the world, engage in forward areas during peacetime, and rapidly respond to regional crises, making it an active player in U.S. foreign and defense policy.\nThe Navy is administratively managed by the Department of the Navy, which is headed by the civilian Secretary of the Navy. The Department of the Navy is itself a division of the Department of Defense, which is headed by the Secretary of Defense. The Chief of Naval Operations  is a four-star admiral and the senior naval officer of the Department of the Navy. However, the CNO may not be the highest ranking naval officer in the armed forces if the Chairman or the Vice Chairman of the Joint Chiefs of Staff are Navy officers, who by law, outrank the CNO.\n\n", "title": "United States Navy"}