{"summary": "The United States Secretary of Agriculture is the head of the United States Department of Agriculture.", "full_text": "The United States Secretary of Agriculture is the head of the U.S. Department of Agriculture. The current secretary is Tom Vilsack, who was confirmed by the U.S. Senate on 20 January 2009.  The position carries similar responsibilities to those of agriculture ministers in other governments.\nThe department includes several organizations. The 297,000 mi2  of national forests and grasslands are managed by the United States Forest Service. The safety of food produced that are produced in the United States and sold here is ensured by the United States Food Safety and Inspection Service. The Food Stamp Program works with the states to provide food to low-income people. Advice for farmers and gardeners is provided by the United States Cooperative State Research, Education, and Extension Service.\nThe line of succession for the Secretary of Agriculture is as follows:\nDeputy Secretary of Agriculture\nUnder Secretary of Agriculture for Farm and Foreign Agriculture Services\nUnder Secretary of Agriculture for Marketing and Regulatory Programs\nUnder Secretary of Agriculture for Rural Development\nUnder Secretary of Agriculture for Food, Nutrition, and Consumer Services\nUnder Secretary of Agriculture for Natural Resources and Environment\nUnder Secretary of Agriculture for Research, Education, and Economics\nUnder Secretary of Agriculture for Food Safety\nGeneral Counsel of the Department of Agriculture\nAssistant Secretary of Agriculture for Administration\nAssistant Secretary of Agriculture for Congressional Relations\n\n^ Jalonick, Mary Clare . \"Senate Confirms Secretary of Agriculture\". AP. Retrieved 2009-01-20. \n^ \"USDA Forest Service - Caring for the land and serving people.\". Retrieved 2005-09-24. \n^ \"Home\". Retrieved 2005-09-24. \n^ \"FNS Food Stamp Program Home Page\". Retrieved 2005-09-24. \n^ \"Cooperative State Research, Education, and Extension Service \". Retrieved 2005-09-24. \n^ \"Executive Order on Succession at Department of Agriculture\". Retrieved 2005-09-24.", "title": "United States Secretary of Agriculture"}