{"summary": "The United States Air Force  is the aerial warfare branch of the United States armed forces and one of the seven uniformed services.", "full_text": "The United States Air Force  is the aerial warfare service branch of the United States Armed Forces and one of the seven American uniformed services. Initially part of the United States Army, the USAF was formed as a separate branch of the military on 18 September 1947 under the National Security Act of 1947. It is the most recent branch of the U.S. military to be formed, and is the largest and one of the world's most technologically advanced air forces. The USAF articulates its core functions as Nuclear Deterrence Operations, Special Operations, Air Superiority, Global Integrated ISR, Space Superiority, Command and Control, Cyberspace Superiority, Personnel Recovery, Global Precision Attack, Building Partnerships, Rapid Global Mobility and Agile Combat Support.\nThe U.S. Air Force is a military service organized within the Department of the Air Force, one of the three military departments of the Department of Defense. The Air Force is headed by the civilian Secretary of the Air Force, who reports to the Secretary of Defense, and is appointed by the President with Senate confirmation. The highest-ranking military officer in the Department of the Air Force is the Chief of Staff of the Air Force, who exercises supervision over Air Force units, and serves as a member of the Joint Chiefs of Staff. Air Force combat and mobility forces are assigned, as directed by the Secretary of Defense, to the Combatant Commanders, and neither the Secretary of the Air Force nor the Chief of Staff have operational command authority over them.\nThe U.S. Air Force provides air support for surface forces and aids in the recovery of troops in the field. As of 2012, the service operates more than 5,638 military aircraft, 450 ICBMs and 63 military satellites. It has a $140 billion budget with 309,339 active duty personnel, 185,522 civilian personnel, 71,400 Air Force Reserve personnel, and 106,700 Air National Guard personnel.", "title": "United States Air Force"}