{"summary": "The United States Marine Corps  is one of the five branches of the military of the United States in the United States Department of Defense.", "full_text": "The United States Marine Corps  is a branch of the United States Armed Forces responsible for providing power projection, using the mobility of the United States Navy to, by Congressional mandate, rapidly-deliver combined-arms task forces on land, at sea and in the air. The U.S. Marine Corps is one of the four armed service branches in the U.S. Department of Defense and one of the seven uniformed services of the United States. The current Chairman of the Joint Chiefs of Staff, the highest-ranking military officer in the U.S. armed forces, is a Marine Corps general.\nThe Marine Corps has been a component of the U.S. Department of the Navy since 1834, working closely with naval forces for training, transportation, and logistics. The USMC operates posts on land and aboard sea-going amphibious warfare ships around the world, and several of the Marines' tactical aviation squadrons, primarily Marine Fighter Attack squadrons, are also embedded in Navy carrier air wings and operate from the Navy's nuclear-powered aircraft carriers.\nTwo battalions of Continental Marines were formed on 10 November 1775 in Philadelphia as a service branch of infantry troops capable of fighting for independence both at sea and on shore. The role of the Corps has since grown and evolved, expanding to aerial warfare and earning popular titles such as, \"America's third air force\", and, \"second land army\". The United States Marine Corps has distinguished itself as it has served in the majority of American wars and armed conflicts, from its inception to the modern era, and attained prominence in the 20th century when its theories and practices of amphibious warfare proved prescient and ultimately formed the cornerstone of the Pacific theater of World War II.\nBy the mid-20th century, the U.S. Marine Corps had become a major theorist and the dominant practitioner of amphibious warfare. Its ability to rapidly respond on short notice to expeditionary crises gives it a strong role in the implementation and execution of American foreign policy. The USMC has around 194,000 active duty members and just under 40,000 reserve Marines as of 2010. It is the smallest of the U.S. armed forces within the U.S. DoD.", "title": "United States Marine Corps"}