{"summary": "Measurement is a process that uses numbers to describe things based on what we can observe about them.", "full_text": "A unit of measurement is a definite magnitude of a physical quantity, defined and adopted by convention or by law, that is used as a standard for measurement of the same physical quantity. Any other value of the physical quantity can be expressed as a simple multiple of the unit of measurement.\nFor example, length is a physical quantity. The metre is a unit of length that represents a definite predetermined length. When we say 10 metres , we actually mean 10 times the definite predetermined length called \"metre\".\nThe definition, agreement, and practical use of units of measurement have played a crucial role in human endeavour from early ages up to this day. Different systems of units used to be very common. Now there is a global standard, the International System of Units , the modern form of the metric system.\nIn trade, weights and measures is often a subject of governmental regulation, to ensure fairness and transparency. The International Bureau of Weights and Measures  is tasked with ensuring worldwide uniformity of measurements and their traceability to the International System of Units .\nMetrology is the science for developing nationally and internationally accepted units of weights and measures.\nIn physics and metrology, units are standards for measurement of physical quantities that need clear definitions to be useful. Reproducibility of experimental results is central to the scientific method. A standard system of units facilitates this. Scientific systems of units are a refinement of the concept of weights and measures developed long ago for commercial purposes.\nScience, medicine, and engineering often use larger and smaller units of measurement than those used in everyday life and indicate them more precisely. The judicious selection of the units of measurement can aid researchers in problem solving .\nIn the social sciences, there are no standard units of measurement and the theory and practice of measurement is studied in psychometrics and the theory of conjoint measurement.", "title": "Units of measurement"}