{"summary": "The United States Constitution is the highest law of the United States of America.", "full_text": "The United States Constitution is the supreme law of the United States of America. The Constitution, originally comprising seven articles, delineates the national frame of government. Its first three articles entrench the doctrine of the separation of powers, whereby the federal government is divided into three branches: the legislative, consisting of the bicameral Congress; the executive, consisting of the President; and the judicial, consisting of the Supreme Court and other federal courts. Articles Four, Five and Six entrench concepts of federalism, describing the rights and responsibilities of state governments and of the states in relationship to the federal government. Article Seven establishes the procedure subsequently used by the thirteen States to ratify it.\nSince the Constitution came into force in 1789, it has been amended twenty-seven times. In general, the first ten amendments, known collectively as the Bill of Rights, offer specific protections of individual liberty and justice and place restrictions on the powers of government. The majority of the seventeen later amendments expand individual civil rights. Others address issues related to federal authority or modify government processes and procedures. Amendments to the United States Constitution, unlike ones made to many constitutions world-wide, are appended to the end of the document. At seven articles and twenty-seven amendments, it is the shortest written constitution in force. All five pages of the original U.S. Constitution are written on parchment.\nThe Constitution is interpreted, supplemented, and implemented by a large body of constitutional law. The Constitution of the United States is the first constitution of its kind, and has influenced the constitutions of other nations.\n^ Maier 2010, p. 35\n^ United States Senate . \"Amendments to the Constitution of the United States of America\" . The Constitution of the United States of America: Analysis and Interpretation . U.S. Government Printing Office. p. 25 n.2. ISBN 9780160632686. \n^ Ritchie, Donald. \"Bill of Rights\". Annenberg Classroom - Glossary. Leonore Annenberg Institute for Civics of the Annenberg Public Policy Center of the University of Pennsylvania. Retrieved September 21, 2014. \n^ Lloyd, Gordon. \"Introduction to the Bill of Rights\". TeachingAmericanHistory.org. The Ashbrook Center at Ashland University. Retrieved September 21, 2014. \n^ \"National Constitution Center\". Independence Hall Association. Retrieved April 22, 2010. \n^ What's the difference between parchment, vellum, and paper?", "title": "United States Constitution"}