{"summary": "Aberdeen is a city on the north east coast of Scotland where the rivers Dee and Don flow into the North Sea.", "full_text": "The University of Aberdeen is a public research university in the city of Aberdeen, Scotland. It is an ancient university founded in 1495 when William Elphinstone, Bishop of Aberdeen, petitioned Pope Alexander VI on behalf of James IV, King of Scots to create King's College. This makes it Scotland's third-oldest university  and fifth-oldest in the English-speaking world. The university as it is today was formed in 1860 by a merger between King's College  and Marischal College, a second university founded in 1593 in Aberdeen city centre as a Protestant alternative to King's College. Today, the University of Aberdeen is consistently ranked among the top 150 universities in the world and is one of two universities in Aberdeen, the other being The Robert Gordon University.\nThe university's iconic buildings act as symbols of the City of Aberdeen, particularly Marischal College in the city centre and the spire of King's College in Old Aberdeen. There are two campuses; the main King's College campus is at Old Aberdeen approximately two miles north of the city centre, around the original site of King's College, although most campus buildings were constructed in the 20th century during a period of expansion. The university's Foresterhill campus is located next to Aberdeen Royal Infirmary and houses the School of Medicine and Dentistry and School of Medical Sciences.\nThe University has approximately 13,500 students from undergraduate to doctoral level, including many international students. In addition, the university's Centre for Lifelong Learning acts as an extension college, offering higher education courses to the local community even for those without the usual qualifications for admission to degree-level study. A full range of disciplines are offered and in 2012 the university offered over 650 undergraduate degree programmes.\nFive Nobel Prize winners are associated with the University. Other academics and graduates of the University include many distinguished figures, including: physicist James Clerk Maxwell; Thomas Reid, the founder of the Scottish School of Common Sense and an important figure in the Scottish Enlightenment; philosopher Robert Adamson; educationalist and philosopher Alexander Bain; and theologian William Robinson Clark.", "title": "University of Aberdeen"}