{"summary": "The University of Michigan, Ann Arbor  is a public university in the state of Michigan.", "full_text": "The University of Michigan , frequently referred to simply as Michigan, is a public research university located in Ann Arbor, Michigan, United States. Originally, founded in 1817 in Detroit as the Catholepistemiad, or University of Michigania, 20 years before the Michigan Territory officially became a state, the University of Michigan is the state's oldest university. The university moved to Ann Arbor in 1837 onto 40 acres  of what is now known as Central Campus. Since its establishment in Ann Arbor, the university campus has expanded to include more than 584 major buildings with a combined area of more than 34 million gross square feet , and has two satellite campuses located in Flint and Dearborn. The University was one of the founding members of the Association of American Universities.\nConsidered one of the foremost research universities in the United States, the university has very high research activity and its comprehensive graduate program offers doctoral degrees in the humanities, social sciences, and STEM fields  as well as professional degrees in architecture, business, medicine, law, pharmacy, nursing, social work and dentistry. Michigan's body of living alumni  comprises more than 500,000. Besides academic life, Michigan's athletic teams compete in Division I of the NCAA and are collectively known as the Wolverines. They are members of the Big Ten Conference.\n^ As of June 30, 2015.\"University of Michigan 2015 Annual Report\" . University of Michigan, Board of Regents. p. 48. \n^ \"University of Michigan - Ann Arbor: Faculty Headcount by Rank, Gender, and Race/Ethnicity\" . University of Michigan. November 11, 2014. p. 15. Retrieved January 10, 2015. \n^ \"University of Michigan - Ann Arbor: Staff Headcounts by Gender, Race/Ethnicity & Job Family\" . University of Michigan. November 13, 2014. p. 3. Retrieved January 10, 2015. \n^ \n^ \"Environmental Stewardship at the University of Michigan\" . University of Michigan Occupational Safety and Environmental Health. 2006. Archived from the original  on June 15, 2007. Retrieved April 29, 2007. \n^ \"Style Guide: Colors\". Office of Global Communications, University of Michigan. July 7, 2015. Retrieved July 7, 2015. \n^ \"University of Michigan\". Encyclopedia Britannica. 2006. Retrieved December 7, 2014.", "title": "University Of Michigan"}