{"summary": "A university is an institution where teaching and research is done.", "full_text": "Fictional colleges are perennially popular in modern novels, allowing the author much greater licence when describing the more intimate activities of a Cambridge college and a way of placing events that might not be permitted by actual Cambridge geography.\nBelow is a list of some of the fictional colleges of the University of Cambridge.\nAll Saints College - In The Green Man by Kingsley Amis; mentioned briefly in Dirk Gently's Holistic Detective Agency by Douglas Adams and in Dreaming of the Bones by Deborah Crombie.\nBoniface College, Cambridge - Pendennis by William Thackeray, inspired by his time at Cambridge and home to the poet Sprott.\nBrakespeare College - Manalive by G. K. Chesterton.\nCanterbury College - The Mezzotint by M. R. James.\nFisher College - The Cambridge Murders by Dilwyn Rees, situated between real-life St John's College and Trinity College.\nFlopsy College - In the episode Return of the Mummy of children's spy series M.I. High\nHaworth College - Dr Rose Fenemore in Stormy Petrel by Mary Stewart is described as the College's English tutor, though most of the novel is set on the Isle of Mull.\nHumber College - Hugo Lamb, narrator of the second chapter in David Mitchell's novel The Bone Clocks, is an undergraduate at Humber, a medieval college in the city centre.\nLancaster College - various books by Simon Raven. Bears more than a passing resemblance to King's College, founded by Henry VI of the House of Lancaster.\nLauds College - various books by Susan Howatch. Fictionally contains Cambridge Cathedral, so is similar to Christ Church, Oxford. Charles Ashworth was a fellow of the College and many other characters studied there. Named after William Laud, controversial 17th century Archbishop of Canterbury.\nPelby College - spoof college that Cambridge students use as an \"unmistakable landmark\" when giving directions to tourists. By convention it is located somewhere between Magdalene and St John's.\nPorterhouse College - Porterhouse Blue and Grantchester Grind by Tom Sharpe. The name suggests Peterhouse, though it is also a pun on college porters and porterhouse steaks. It is also reputedly based loosely on Pembroke, Sharpe's alma mater or Corpus Christi which is next door and its location is somewhere near Peterhouse and Pembroke. Despite this, however, filming for the television series took place at Sidney Sussex College. A Porterhouse College in the  University of Carrbridge, Inverness-shire has been used in University of Cambridge mathematics exam questions.\nRachel Ambrose College, Christminster - Culture Shock  by Valerie Grosvenor Myer, a graduate of Newnham, and sometime Associate of Lucy Cavendish, which, as a college for mature women students, it most resembles.\nSt Agatha's College - The Wyndham Case , A Piece of Justice , Debts of Dishonour  and The Bad Quarto  by Jill Paton Walsh, located between Castle Mound and Chesterton Lane.\nSt Alupent's College - in the novels of Mary Selby/Joanna Bell. The College is the setting of her book \"Gargoyles and Port,' in which its very existence comes under threat from the neighbouring, rival College, largely thanks to an ancient contract signed by the founder, St Alupent himself. The author studied at Gonville and Caius College.\nSt Angelicus College - The Gate of Angels  by Penelope Fitzgerald. Situated not far from Christ's Pieces.\nSt Barnabas' College - Tomorrow's Ghost  by Anthony Price.\nSt Bartholemew's College - Nights in White Satin  by Michelle Spring. Located near the police station and New Square, with murders investigated by Laura Principal of Newnham College.\nSt Bernard's College - Darkness at Pemberley by T. H. White. Loosely disguised version of Queens' College.\nSt Botolph's College - Example college in Cambridge University Computing Service documentation.\nSt Bride's College - the setting for much of Charlie Cochrane's Cambridge Fellows Mysteries.\nSt Cedd's College - Various works by Douglas Adams. Based on St. John's College, the alma mater of Douglas Adams.\nSt Dunstan's College, Cambridge - College of Professor Austin Herring, who appears in Chris Addison's The Ape That Got Lucky and Civilisation\nSt Ignatius' College - the university that Albert Campion went to, according to the novels of Margery Allingham; see his minibiography in Sweet Danger.\nSt Margaret's College - The Cambridge Theorem by Tony Cape\nSt Martha's College - Matricide at St. Martha's by Ruth Dudley Edwards.\nSt Martin's College - War Game by Anthony Price\nSt Mary's College - The Hills of Varna by Geoffrey Trease.\nSt Matthew's College - The Green Man by Kingsley Amis, next door to St Catharine's College. Also in various works by Stephen Fry - in which it is a loosely disguised version of Queens' College, revealed by names of bridges and courts.\nSt Paul's College - located on St Andrew's Street, between Christ's and Emmanuel, in The Pink and the Grey by Anthony Camber.\nSt Radegund's College - an all-female college in Hearts and Mind by Rosy Thornton.\nSt Stephen's College - For the Sake of Elena by Elizabeth George, located between Trinity College and Trinity Hall, modelled on the latter. In the BBC adaptation of the Inspector Lynley Mysteries, St John's College was used as the setting.\nSt Swithin's College - In James Hilton's Random Harvest, the college attended by Charles Ranier, the main character, and a decade later by Harrison, the narrator. Founded in the latter 16th century.\nTudor College - the home of the main characters in The Night Climbers by Ivo Stourton.\nWeirdsister College - Magical college, setting of a sequel to The Worst Witch.\nWetmarsh College - subject of an operetta by Mark Wainwright and Roland Anderson entitled Wetmarsh College, or, Dr Middlebottom, first staged at the ADC Theatre, Cambridge, in 2005 .\nAn unnamed college in C. P. Snow's novel The Masters and other novels in the Strangers and Brothers series. Snow disparaged what he called the 'Christminster' convention of the naming of fictitious colleges.\nAn unnamed college in the BBC Radio 4 comedy series High Table, Lower Orders.\nPrussian-Nationalist College - Briefly mentioned in the book \"Prussian Education In Our Time\" by Bismarck.\n\n", "title": "University of Inverness"}