{"summary": "The University of Pennsylvania is a private Ivy League university in West Philadelphia, Pennsylvania.", "full_text": "The University of Pennsylvania  is a private Ivy League research university located in Philadelphia. Incorporated as The Trustees of the University of Pennsylvania, Penn is one of 14 founding members of the Association of American Universities and one of the nine original Colonial Colleges. Penn claims to be the first university in the United States of America.\nBenjamin Franklin, Penn's founder, advocated an educational program that focused as much on practical education for commerce and public service as on the classics and theology although Franklin's curriculum was never adopted. The university coat of arms features a dolphin on the red chief, adopted directly from the Franklin family's own coat of arms. Penn was one of the first academic institutions to follow a multidisciplinary model pioneered by several European universities, concentrating multiple \"faculties\"  into one institution. It was also home to many other educational innovations. The first school of medicine in North America , the first collegiate business school  and the first \"student union\" building and organization  were all born at Penn.\nPenn offers a broad range of academic departments, an extensive research enterprise and a number of community outreach and public service programs. It is particularly well known for its medical school, dental school, design school, business school, law school, engineering school, communications school, nursing school, veterinary school, its social sciences and humanities programs, as well as its biomedical teaching and research capabilities. Its undergraduate program is also among the most selective in the country, with an acceptance rate of 10 percent. One of Penn's most well known academic qualities is its emphasis on interdisciplinary education, which it promotes through numerous double degree programs, research centers and professorships, a unified campus, and the ability for students to take classes from any of Penn's schools .\nAll of Penn's schools exhibit very high research activity. Penn is consistently ranked among the top research universities in the world, for both quality and quantity of research. In fiscal year 2015, Penn's academic research budget was $851 million, involving more than 4,300 faculty, 1,100 postdoctoral fellows and 5,500 support staff/graduate assistants. As one of the most active and prolific research institutions, Penn is associated with several important innovations and discoveries in many fields of science and the humanities. Among them are the first general purpose electronic computer , the rubella and hepatitis B vaccines, Retin-A, cognitive therapy, conjoint analysis and others.\nPenn's academic and research programs are led by a large and highly productive faculty. 28 Nobel laureates have been affiliated with Penn. Over its long history the university has also produced many distinguished alumni. These include twelve heads of state , three United States Supreme Court justices, and supreme court justices of other states, founders of technology companies, international law firms and global financial institutions, and university presidents. According to a 2014 study, the University of Pennsylvania has produced the most billionaires of any university at the undergraduate level. Penn's endowment, at $9.6 billion in 2014, is the tenth-largest university endowment in the United States and the thirtieth-largest on a per-student basis.", "title": "University of Pennsylvania"}