{"summary": "A university is an institution where teaching and research is done.", "full_text": "The University of British Columbia, commonly referred to as UBC, is a public research university with campuses and facilities in British Columbia, Canada. Founded in 1908 as the McGill University College of British Columbia, the University became independent and adopted its current name in 1915. It is the oldest institution of higher learning in British Columbia and enrolls over 58,000 students at its Vancouver and Okanagan Valley campuses. UBC's 4.02 km2  Vancouver campus is located within the University Endowment Lands, about 10 km  west of Downtown Vancouver. The 2.09 km2  Okanagan campus, acquired in 2005, is located in Kelowna.\nThe University offers degrees and diplomas in over 300 fields of study, and in 2014 granted 12,421 degrees. Most students are enrolled in five larger Faculties, namely Arts, Science, Medicine, Applied Science and the Sauder School of Business. As of the 2014-2015 school year, UBC and its donors provided $35 million in scholarships annually. Estimated at $21,790 per student, the University maintains one of the largest endowments among Canadian universities on a per-student basis. With a research budget valued at $564 million, UBC funds 8,442 projects as of 2014.\nAccording to Maclean's UBC has the second highest average entering grade among Canadian universities, with an average undergraduate entrance grade of 89.6%, only behind McGill University with 90.3%. UBC faculty, alumni, and researchers have won seven Nobel Prizes, 69 Rhodes Scholarships, 65 Olympic medals, 195 fellowships to the Royal Society of Canada, and alumni include three Canadian prime ministers. The University is ranked 33rd in the world in U.S. News & World Report's 2016 rankings, 34th in the world in the 2015-2016 Times Higher Education World University Rankings, 50th in the world in the 2015-2016 QS World University Rankings and eighth among universities outside the United States by Newsweek.\nUBC is a non-sectarian and coeducational institution, with more than 300,000 living alumni in 120 countries. The University is a member of Universitas 21, the Association of Universities and Colleges of Canada, the Association of Southeast Asian Institutions of Higher Learning, the International Association of Universities, the U15 and the only Canadian member of the Association of Pacific Rim Universities. The University's varsity teams, known as the Thunderbirds in Vancouver and the Heat in the Okanagan, compete in the Canada West Universities Athletic Association of the Canadian Interuniversity Sport.", "title": "University of British Columbia"}