{"summary": "The University of Chicago is a university in Chicago, Illinois.", "full_text": "The University of Chicago  is a private research university in Chicago, Illinois and one of the world's leading and influential institutions of higher learning, with top ten positions in numerous rankings and measures.\nThe University, established in 1890, consists of The College, various graduate programs, interdisciplinary committees organized into four academic research divisions and seven professional schools. Beyond the arts and sciences, Chicago is also well known for its professional schools, which include the Pritzker School of Medicine, the University of Chicago Booth School of Business, the Law School, the School of Social Service Administration, the Harris School of Public Policy Studies, the Graham School of Continuing Liberal and Professional Studies and the Divinity School. The university currently enrolls approximately 5,000 students in the College and around 15,000 students overall.\nUniversity of Chicago scholars have played a major role in the development of various academic disciplines, including: the Chicago school of economics, the Chicago school of sociology, the law and economics movement in legal analysis, the Chicago school of literary criticism, the Chicago school of religion, and the behavioralism school of political science. Chicago's physics department helped develop the world's first man-made, self-sustaining nuclear reaction beneath the university's Stagg Field. Chicago's research pursuits have been aided by unique affiliations with world-renowned institutions like the nearby Fermilab and Argonne National Laboratory, as well as the Marine Biological Laboratory. The university is also home to the University of Chicago Press, the largest university press in the United States. With an estimated completion date of 2020, the Barack Obama Presidential Center will be housed at the University of Chicago and include both the Obama presidential library and offices of the Obama Foundation.\nFounded by the American Baptist Education Society with a donation from oil magnate and wealthiest man in history John D. Rockefeller, the University of Chicago was incorporated in 1890; William Rainey Harper became the university's first president in 1891, and the first classes were held in 1892. Both Harper and future president Robert Maynard Hutchins advocated for Chicago's curriculum to be based upon theoretical and perennial issues rather than on applied sciences and commercial utility. With Harper's vision in mind, the University of Chicago also became one of the 14 founding members of the Association of American Universities, an international organization of leading research universities, in 1900.\nThe University of Chicago is home to many prominent alumni. 89 Nobel laureates have been affiliated with the university as visiting professors, students, faculty, or staff, the fourth most of any institution in the world. In addition, Chicago's alumni include 49 Rhodes Scholars, 21 Marshall Scholars, 9 Fields Medalists, 13 National Humanities Medalists, 13 billionaire graduates, and a plethora of members of the United States Congress and heads of state of countries all over the world.", "title": "University of Chicago"}