{"summary": "Pope Urban VIII , born Maffeo Barberini, was an Italian cleric of the Roman Catholic Church and the 236th Pope from 1623 to 1644.", "full_text": "The University of Pisa  is an Italian public research university located in Pisa, Italy. It was founded in 1343 by an edict of Pope Clement VI. It is the 19th oldest extant university in the world and the 10th oldest in Italy. The prestigious university is ranked between first and third places nationally, in the top 30 in Europe and the top 300 in the world. It houses the Orto botanico di Pisa, Europe's oldest academic botanical garden, which was founded in 1544.\nThe University of Pisa is part of the Pisa University System, which includes the Scuola Normale Superiore and the Sant'Anna School of Advanced Studies. The university has about 57,000 students .\nIn the fields of philology and cultural studies, the University of Pisa is a leading member of ICoN, an inter-university consortium of 21 Italian universities supported by the Ministry of Education, Universities and Research, as well as a member of the European University Association, the Partnership of a European Group of Aeronautics and Space Universities network and the Cineca consortium. It's the only university in Italy which has become a member of the prestigious Universities Research Association.\nAmong its notable graduates there are several national and foreign political leaders including two Italian presidents, five Popes, five Italian prime ministers and three Nobel Laureates as students, faculty or staff affiliates.\nPisa has an intense athletic rivalry with the University of Pavia, which traditionally culminates in the Pisa-Pavia Regatta , the oldest competition of this kind in Italy, and second in Europe only to the Oxford Cambridge boat race.\nIn 2013, the University of Pisa finished with La Sapienza University of Rome in first place among the Italian universities, according to the Academic Ranking of World Universities.", "title": "University of Pisa"}