{"summary": "The University of Oslo  is the oldest and largest university in Norway.", "full_text": "The University of Oslo , until 1939 named the Royal Frederick University , is the oldest, largest and most prestigious university in Norway, located in the Norwegian capital of Oslo. The university is recognized as one of Northern Europe's most prestigious universities. The Academic Ranking of World Universities has ranked it the 58th best university in the world.\nThe university has approximately 27,700 students and employs around 6,000 people. Its faculties include  Theology , Law, Medicine, Humanities, Mathematics, natural sciences, social sciences, Dentistry, and Education. The university's original neoclassical campus is located in the centre of Oslo; it is currently occupied by the Faculty of Law. Most of the university's other faculties are located at the newer Blindern campus in the suburban West End. The Faculty of Medicine is split between several university hospitals in the Oslo area.\nThe university was founded in 1811 and was modelled after the University of Copenhagen and the recently established University of Berlin. It was originally named for King Frederick VI of Denmark and Norway, and received its current name in 1939. The university is informally also known as Universitetet , having been the only university in Norway until 1946, and was commonly referred to as \"The Royal Frederick's\"  prior to the name change.\nThe University of Oslo is home to five Nobel Prize winners. The Nobel Peace Prize was awarded in the university's Atrium from 1947 to 1989. Since 2003, the Abel Prize is awarded in the Atrium.\n^ \"SCANDINAVIAN INSTITUTE OF MARITIME LAW, UNIVERSITY OF OSLO  AT OSLO, NORWAY\". EduMaritime.com. Retrieved 31 May 2015. \n^ Bothwell, Ellie . \"Academic Ranking of World Universities 2015 results\". timeshighereducation.co.uk. Retrieved 15 August 2015. \n^ \"Nobel Prize Laureates\". Retrieved 2013-06-14. \n^ \"Prisutdelingen\". Royal Swedish Academy of Sciences. Retrieved 4 November 2012.", "title": "University of Oslo"}