{"summary": "The University of London is a federal mega-university made up of 31 affiliates: 19 separate university institutions, and 12 research institutes.", "full_text": "The University of London  is a collegiate research university located in London, England, consisting of 18 constituent colleges, 10 research institutes and a number of central bodies.\nThe university is the second largest university by number of full-time students in the United Kingdom, with 111,975 campus-based students and over 50,000 distance learning students in the University of London International Programmes. The university was established by Royal Charter in 1836, as a degree-awarding examination board for students holding certificates from London University  and King's College, London and \"other such other Institutions, corporate or unincorporated, as shall be established for the purpose of Education, whether within the Metropolis or elsewhere within our United Kingdom\". The university moved to a federal structure in 1900.\nFor most practical purposes, ranging from admissions to funding, the constituent colleges operate on a semi-independent basis, with some recently obtaining the power to award their own degrees whilst remaining in the federal university. The nine largest colleges of the university are King's College London; University College London; Birkbeck; Goldsmiths; the London Business School; Queen Mary; Royal Holloway; SOAS; and the London School of Economics and Political Science. The specialist colleges of the university include Heythrop College, specialising in philosophy and theology, and St George's, specialising in medicine. Imperial College London was formerly a member before it left the University of London in 2007. On 16 July 2015 it was announced that City University London would join the federal University of London, becoming one of its constituent colleges from August 2016.\nMany notable individuals have passed through the university, either as staff or students, including at least 4 monarchs, 52 presidents or prime ministers, 74 Nobel laureates, 6 Grammy winners, 2 Oscar winners and 3 Olympic gold medalists.\nIn post-nominals, the University of London is commonly abbreviated as Lond. or, more rarely, Londin., from the Latin Universitas Londiniensis after their degree abbreviations.", "title": "University of London"}