{"summary": "In mathematics, an unknown is a number we do not know.", "full_text": "In mathematics, an equation is an equality containing one or more variables. Solving the equation consists of determining which values of the variables make the equality true. In this situation, variables are also known as unknowns and the values which satisfy the equality are known as solutions. An equation differs from an identity in that an equation is not necessarily true for all possible values of the variable.\nThere are many types of equations, and they are found in all areas of mathematics; the techniques used to examine them differ according to their type.\nAlgebra studies two main families of equations: polynomial equations and, among them, linear equations. Polynomial equations have the form P = 0, where P is a polynomial. Linear equations have the form a + b = 0, where a is a linear function and b is a vector. To solve them, one uses algorithmic or geometric techniques, coming from linear algebra or mathematical analysis. Changing the domain of a function can change the problem considerably. Algebra also studies Diophantine equations where the coefficients and solutions are integers. The techniques used are different and come from number theory. These equations are difficult in general; one often searches just to find the existence or absence of a solution, and, if they exist, to count the number of solutions.\nGeometry uses equations to describe geometric figures. The objective is now different, as equations are used to describe geometric properties. In this context, there are two large families of equations, Cartesian equations and parametric equations.\nDifferential equations are equations involving one or more functions and their derivatives. They are solved by finding an expression for the function that does not involve derivatives. Differential equations are used to model real-life processes in areas such as physics, chemistry, biology, and economics.\nThe \"=\" symbol was invented in 1557 by Robert Recorde, who considered that nothing could be more equal than parallel straight lines with the same length.\n\n", "title": "Unknown (math)"}