{"summary": "A vacuum tube, also called a valve in British English, is an electronic device used in many older model radios, television sets, and amplifiers.", "full_text": "In electronics, a vacuum tube, an electron tube, or just a tube , or valve  is a device that controls electric current between electrodes in an evacuated container. Vacuum tubes mostly rely on thermionic emission of electrons from a hot filament or a cathode heated by the filament. This type is called a thermionic tube or thermionic valve. A phototube, however, achieves electron emission through the photoelectric effect. Not all electronic circuit valves/electron tubes are vacuum tubes ; gas-filled tubes are similar devices containing a gas, typically at low pressure, which exploit phenomena related to electric discharge in gases, usually without a heater.\nThe simplest vacuum tube, the diode, contains only a heater, a heated electron-emitting cathode , and a plate . Current can only flow in one direction through the device between the two electrodes, as electrons emitted by the cathode travel through the tube and are collected by the anode. Adding one or more control grids within the tube allows the current between the cathode and anode to be controlled by the voltage on the grid or grids. Tubes with grids can be used for many purposes, including amplification, rectification, switching, oscillation, and display.\nInvented in 1904 by John Ambrose Fleming, vacuum tubes were a basic component for electronics throughout the first half of the twentieth century, which saw the diffusion of radio, television, radar, sound reinforcement, sound recording and reproduction, large telephone networks, analog and digital computers, and industrial process control. Although some applications had counterparts using earlier technologies such as the spark gap transmitter or mechanical computers, it was the invention of the vacuum tube that made these technologies widespread and practical. In the 1940s the invention of semiconductor devices made it possible to produce solid-state devices, which are smaller, more efficient, more reliable, more durable, and cheaper than tubes. Hence, from the mid-1950s solid-state devices such as transistors gradually replaced tubes. The cathode-ray tube  remained the basis for televisions and video monitors until superseded in the 21st century. However, there are still a few applications for which tubes are preferred to semiconductors; for example, the magnetron used in microwave ovens, and certain high frequency amplifiers.", "title": "Vacuum tube"}