{"summary": "Year 1945 was a year that started on a Monday.", "full_text": "Sir George Ivan Morrison, Jr., OBE  is a Northern Irish singer, songwriter and musician. He has received six Grammy Awards, the 1994 Brit Award for Outstanding Contribution to Music, and has been inducted into both the Rock and Roll Hall of Fame and the Songwriters Hall of Fame. In 2015 he was knighted for his musical achievements and his services to tourism and charitable causes in Northern Ireland.\nKnown as \"Van the Man\" to his fans, Morrison started his professional career when, as a teenager in the late 1950s, he played a variety of instruments including guitar, harmonica, keyboards and saxophone for various Irish showbands covering the popular hits of the day. He rose to prominence in the mid-1960s as the lead singer of the Northern Irish R&B band Them, with whom he recorded the garage band classic \"Gloria\". His solo career began under the pop-hit oriented guidance of Bert Berns with the release of the hit single \"Brown Eyed Girl\" in 1967. After Berns' death, Warner Bros. Records bought out his contract and allowed him three sessions to record Astral Weeks in 1968. Even though this album would gradually garner high praise, it was initially a poor seller; however, the next one, Moondance, established Morrison as a major artist, and throughout the 1970s he built on his reputation with a series of critically acclaimed albums and live performances. Morrison continues to record and tour, producing albums and live performances that sell well and are generally warmly received, sometimes collaborating with other artists, such as Georgie Fame and the Chieftains. In 2008 he performed Astral Weeks live for the first time since 1968.\nMuch of Morrison's music is structured around the conventions of soul music and R&B, such as the popular singles \"Brown Eyed Girl\", \"Jackie Wilson Said \", \"Domino\" and \"Wild Night\". An equal part of his catalogue consists of lengthy, loosely connected, spiritually inspired musical journeys that show the influence of Celtic tradition, jazz, and stream-of-consciousness narrative, such as Astral Weeks and lesser-known works such as Veedon Fleece and Common One. The two strains together are sometimes referred to as \"Celtic soul\".", "title": "Van Morrison"}