{"summary": "Vermont is a state in the United States.", "full_text": "Vermont  is a New England state in the northeastern United States. Forests cover approximately 75% of its total land area. Vermont is the leading producer of maple syrup in the United States.\nLake Champlain forms half of Vermont's western border, which it shares with the state of New York. The Green Mountains are within the state. Vermont is bordered by Massachusetts to the south, New Hampshire to the east across the Connecticut River, New York to the west, and the Canadian province of Quebec to the north.The state capital is Montpelier with a population of 7,855, making it the least populous state capital in the country. Vermont's most populous city is Burlington, with a 2013 population of 42,284, which makes it the least populous city in the United States to be the largest city within a state. Burlington's metropolitan area has a population of 214,796. Vermont is one of the most racially homogeneous states; 94.3% of its population identified as white in 2010.\nVermont is the 6th smallest in area and the 2nd least populous of the 50 United States. It is the only New England state not bordering the Atlantic Ocean.\nOriginally inhabited by two major Native American tribes , much of the territory that is now Vermont was claimed by France during its early colonial period. France ceded the territory to the Kingdom of Great Britain after being defeated in 1763 in the Seven Years' War . For many years, the nearby colonies, especially New Hampshire and New York, disputed control of the area . Settlers who held land titles granted by these colonies were opposed by the Green Mountain Boys militia, which eventually prevailed in creating an independent state, the Vermont Republic. Founded in 1777 during the Revolutionary War, the republic lasted for fourteen years. Aside from the Thirteen Colonies, Vermont is one of only four U.S. states that was previously a sovereign state . In 1791, Vermont joined the United States as the 14th state, the first in addition to the original 13 colonies. Vermont was the first state to partially abolish slavery while still independent and played an important geographical role in the Underground Railroad, which helped American slaves escape to Canada.", "title": "Vermont"}