{"summary": "The Vice President of the United States of America is the second-in-command to the President.", "full_text": "The Vice President of the United States  is the second-highest position in the executive branch of the United States, after the president. The executive power of both the vice president and the president is granted under Article Two, Section One of the Constitution. The vice president is indirectly elected, together with the president, to a four-year term of office by the people of the United States through the Electoral College. The vice president is the first person in the presidential line of succession, and would normally ascend to presidency upon the death, resignation, or removal of the president.\nThe vice president is also president of the United States Senate. In that capacity, as the Leader of the Senate, he or she is allowed to vote in the Senate only when necessary to break a tie. While Senate customs have created supermajority rules that have diminished this constitutional tie-breaking authority, the vice president still retains the ability to influence legislation; for example, the Deficit Reduction Act of 2005 was passed in the Senate by a tie-breaking vice presidential vote. Additionally, pursuant to the Twelfth Amendment, the vice president presides over the joint session of Congress when it convenes to count the vote of the Electoral College.\nWhile the vice president's only constitutionally prescribed functions aside from presidential succession relate to his role as President of the Senate, the office is commonly viewed as a component of the executive branch of the federal government. The United States Constitution does not expressly assign the office to any one branch, causing a dispute among scholars whether it belongs to the executive branch, the legislative branch, or both. The modern view of the vice president as a member of the executive branch is due in part to the assignment of executive duties to the vice president by either the president or Congress, though such activities are only recent historical developments.", "title": "Vice President (United States)"}