{"summary": "Viktor Andriyovych Yushchenko   is a previous President of Ukraine.", "full_text": "Viktor Andriyovych Yushchenko  is a Ukrainian politician who was the third President of Ukraine from 23 January 2005 to 25 February 2010.\nAs an informal leader of the Ukrainian opposition coalition, he was one of the two main candidates in the 2004 Ukrainian presidential election. Yushchenko won the presidency through a repeat runoff election between him and Prime Minister Viktor Yanukovych. The Ukrainian Supreme Court called for the runoff election to be repeated because of widespread electoral fraud in favor of Viktor Yanukovych in the original vote. Yushchenko won in the revote . Public protests prompted by the electoral fraud played a major role in that presidential election and led to Ukraine's Orange Revolution.\nFollowing an assassination attempt in late 2004 during his election campaign, Yushchenko was confirmed to have ingested hazardous amounts of TCDD, the most potent dioxin and a contaminant in Agent Orange. He suffered disfigurement as a result of the poisoning, but has been slowly recovering.\nBefore his election as President, Yushchenko already had a career in Ukrainian politics. In 1993, he became Governor  of the National Bank of Ukraine. From 1999 to 2001 he was Prime Minister. After his dismissal as Prime Minister, Yushchenko went into opposition to President Leonid Kuchma and he founded the Our Ukraine bloc, which at the 2002 parliamentary election became Ukraine's most popular political force, with 23.57% of the votes.\nAfter Yushchenko's election in 2004 to the presidency, this alliance was unable to continue this success, garnering only 13.95% of the votes in 2006 and 14.15% of the votes in the 2007 parliamentary election. Yushchenko failed to secure a run-off spot during the 2010 Ukrainian presidential election; gaining 5.5% of the vote. During the 2012 Ukrainian parliamentary elections, Yushchenko headed the election list of Our Ukraine. The party won 1.11% of the national votes and no constituencies, and thus failed to win parliamentary representation.", "title": "Viktor Yushchenko"}