{"summary": "Viktor Fedorovych Yanukovych   is a Ukrainian politician who was the 4th President of Ukraine from 2010 to 2014; he was Prime Minister of Ukraine from November 2002 until December 2004 .", "full_text": "Viktor Fedorovych Yanukovych  is a Ukrainian politician who served as the fourth President of Ukraine from February 2010 until his removal from power in February 2014. Yanukovych served as the governor of Donetsk Oblast, a province in eastern Ukraine, from 1997 to 2002. He was Prime Minister of Ukraine from 21 November 2002 to 31 December 2004, under President Leonid Kuchma. Yanukovych first ran for president in 2004: he advanced to the runoff election, and initially defeated his opponent. However, the election was fraught with allegations of fraud and voter intimidation. This caused widespread citizen protests and Kiev's Independence Square was occupied in what became known as the Orange Revolution. The Ukrainian Supreme Court nullified the runoff election, and ordered a second runoff. Yanukovych lost this second runoff election to Viktor Yushchenko. Yanukovych served as Prime Minister for a second time from 4 August 2006 to 18 December 2007, under President Yushchenko.\nYanukovych was elected president in 2010, defeating Yulia Tymoshenko. November 2013 saw the beginning of a series of events that led to his ousting as president. Yanukovych rejected a pending EU association agreement, choosing instead to pursue a Russian loan bailout and closer ties with Russia. This led to popular protests and the occupation of Kiev's Independence Square, a series of events dubbed the \"Euromaidan\" by young pro-European Union Ukrainians. In January 2014, this developed into deadly clashes in Independence Square and in other areas across Ukraine, as Ukrainian citizens confronted the Berkut and other special police units. In February 2014, Ukraine appeared to be on the brink of civil war, as violent clashes between protesters and special police forces led to many deaths and injuries. On 21 February 2014, Yanukovych claimed that, after lengthy discussions, he had reached an agreement with the opposition. Later that day, however, he fled the capital for Kharkiv, travelling next to Crimea, and eventually to exile in southern Russia.\nOn 22 February, the Ukrainian parliament voted to remove him from his post, on the grounds that he was unable to fulfill his duties. Although the legislative removal by an impeachment procedure would have lacked the number of votes required by Ukraine's then-current constitution, the resolution did not follow the impeachment procedure but instead established that Yanukovych \"withdrew from his duties in an unconstitutional manner\" and citing \"circumstances of extreme urgency\", a situation for which there was no stipulation in the then-current Ukrainian constitution. Parliament set 25 May as the date for the special election to select his replacement, and, two days later, issued a warrant for his arrest, accusing him of \"mass killing of civilians.\"\nSince his departure, Yanukovych has conducted several press conferences. In one of these, he has declared himself to remain \"the legitimate head of the Ukrainian state elected in a free vote by Ukrainian citizens\". On 3 October 2014, several news agencies reported that according to a Facebook post made by the aide to the Ukrainian Interior Minister, Anton Gerashchenko, Viktor Yanukovych had been granted Russian citizenship by a \"secret decree\" of Vladimir Putin. On the same day, Russian presidential spokesman Dmitry Peskov said that he didn't know anything about this and hadn't seen such a decree. In January 2015, Interpol placed Yanukovych on its wanted list. On 16 July 2015, Yanukovych was removed from this list with the Red Notice request for Yanukovich from the Ukrainian government pending further review. On 18 June 2015, Yanukovych was officially deprived of the title of President of Ukraine.", "title": "Viktor Yanukovych"}