{"summary": "The violin is a string instrument which is played with a bow.", "full_text": "The violin, also called a fiddle, is a string instrument, usually with four strings tuned in perfect fifths. It is the smallest, highest-pitched member of the violin family of string instruments , which also includes the viola, the cello, and the string bass.\nThe modern word is derived from the Italian word violino, literally meaning 'small viola'.\nSomeone who plays the violin is called a violinist or a fiddler. The violinist produces sound by drawing a bow across one or more strings , by plucking the strings , or by a variety of other techniques. The violin is played by musicians in a wide variety of musical genres, including Baroque music, classical, jazz, country music, bluegrass music, folk music, metal, rock and roll, and soft rock. The violin has come to be played in many non-Western music cultures all over the world. The violin is sometimes informally called a fiddle, regardless of the type of music played on it.\nThe violin was first known in 16th-century Italy, with some further modifications occurring in the 18th and 19th centuries. In Europe it served as the basis for stringed instruments used in western classical music, the viola and the violin. Violinists and collectors particularly prize the instruments made by the Stradivari, Guarneri and Amati families from the 16th to the 18th century in Brescia and Cremona and by Jacob Stainer in Austria. According to their reputation, the quality of their sound has defied attempts to explain or equal it, though this belief is disputed. Great numbers of instruments have come from the hands of \"lesser\" makers, as well as still greater numbers of mass-produced commercial \"trade violins\" coming from cottage industries in places such as Saxony, Bohemia, and Mirecourt. Many of these trade instruments were formerly sold by Sears, Roebuck and Co. and other mass merchandisers.\nA person who makes or repairs violins is called a luthier. The parts of a violin are usually made from different types of wood , and it is usually strung with gut, Perlon or other synthetic, or steel strings.", "title": "Violinist"}