{"summary": "March 22 is the 81st day of the year  in the Gregorian calendar.", "full_text": "Virginia Grey  was an American actress and singer. She was born in Los Angeles, California, the daughter of director Ray Grey. One of her early babysitters was movie star Gloria Swanson. Grey debuted at the age of ten in the silent film Uncle Tom's Cabin  as Little Eva. She continued acting for a few more years, but then left movies in order to finish her education.\nGrey returned to films in the 1930s with bit parts and extra work, but she eventually signed a contract with Metro-Goldwyn-Mayer and appeared in several films, including The Hardys Ride High , Another Thin Man , Hullabaloo , and The Big Store . She left MGM in 1942, and signed with several different studios over the years, working steadily. During the 1950s and 1960s, producer Ross Hunter frequently included Grey in his popular soap melodramas, such as All That Heaven Allows, Back Street and Madame X.\nShe had an on again/off again relationship with Clark Gable in the 1940s. After his wife Carole Lombard died and he returned from military service, Clark and Virginia were often seen at restaurants and nightclubs together. Many, including Virginia herself, expected him to marry her. The tabloids were all expecting the wedding announcement. It was a great surprise when he hastily married Lady Sylvia Ashley in 1949. Virginia was heartbroken. Clark and Sylvia divorced in 1952 but, much to Virginia's dismay, her brief romance with Clark was never rekindled. Her friends say that her hoping and waiting for Clark was the reason she never married.\nShe was a regular on television in the 1950s and 1960s, appearing on Playhouse 90, U.S. Marshal, General Electric Theater, The DuPont Show with June Allyson, Your Show of Shows, Red Skelton, Wagon Train, Bonanza, Marcus Welby, M.D., Love, American Style, Burke's Law, The Virginian, Peter Gunn, Ironside and many others.\nShe was portrayed by Anna Torv in the HBO Mini-series The Pacific.", "title": "Virginia Grey"}