{"summary": "Vitamin D is not actually a vitamin.", "full_text": "Vitamin D refers to a group of fat-soluble secosteroids responsible for enhancing intestinal absorption of calcium, iron, magnesium, phosphate and zinc. In humans, the most important compounds in this group are vitamin D3  and vitamin D2 . Cholecalciferol and ergocalciferol can be ingested from the diet and from supplements. Very few foods contain vitamin D; synthesis of vitamin D  in the skin is the major natural source of the vitamin. Dermal synthesis of vitamin D from cholesterol is dependent on sun exposure .\nVitamin D from the diet or dermal synthesis from sunlight is biologically inactive; activation requires enzymatic conversion  in the liver and kidney. Evidence indicates the synthesis of vitamin D from sun exposure is regulated by a negative feedback loop that prevents toxicity, but because of uncertainty about the cancer risk from sunlight, no recommendations are issued by the Institute of Medicine , for the amount of sun exposure required to meet vitamin D requirements. Accordingly, the Dietary Reference Intake for vitamin D assumes no synthesis occurs and all of a person's vitamin D is from food intake, although that will rarely occur in practice. As vitamin D is synthesized in adequate amounts by most mammals exposed to sunlight, it is not strictly a vitamin, and may be considered a hormone as its synthesis and activity occur in different locations. Vitamin D has a significant role in calcium homeostasis and metabolism. Its discovery was due to effort to find the dietary substance lacking in rickets .\nBeyond its use to prevent osteomalacia or rickets, the evidence for other health effects of vitamin D supplementation in the general population is inconsistent. The best evidence of benefit is for bone health. The effect of vitamin D supplementation on mortality is not clear, with one meta-analysis finding a decrease in mortality in elderly people, and another concluding no clear justification exists for recommending vitamin D. Because it found mounting evidence for a benefit to bone health, though it had not found good evidence of other benefits, the Food and Drug Administration of the United States has proposed requiring manufacturers to declare the amount of Vitamin D on nutrition facts labels, as \"nutrients of public health significance\". As of August 2015, this is currently still open for public comment.\nIn the liver, cholecalciferol  is converted to calcidiol, which is also known as calcifediol , 25-hydroxycholecalciferol . Ergocalciferol  is converted in the liver to 25-hydroxyergocalciferol . These two specific vitamin D metabolites are measured in serum to determine a person's vitamin D status. Part of the calcidiol is converted by the kidneys to calcitriol, the biologically active form of vitamin D. Calcitriol circulates as a hormone in the blood, regulating the concentration of calcium and phosphate in the bloodstream and promoting the healthy growth and remodeling of bone. Calcitriol also affects neuromuscular and immune function.", "title": "Vitamin D"}