{"summary": "February 7 is the 38th day of the year in the Gregorian calendar.", "full_text": "Voting in Switzerland  is the process by which Swiss citizens make decisions about governance and elect officials. The polling stations are opened on Sunday mornings but most people vote by post in advance ; at noon on that day, voting ends and the results are usually known at the end of the afternoon.\nSwitzerland's voting system is unique among modern democratic nations in that Switzerland practices direct democracy in parallel with representative democracy. That's why the Swiss system is called semi-direct democracy. Direct democracy allows any citizen may challenge any law approved by the parliament or, at any time, propose a modification of the federal Constitution. In addition, in most cantons all votes are cast using paper ballots that are manually counted. At the federal level, voting can be organised for:\nElections \nMandatory referendums \nOptional referendums \nFederal popular initiatives \nApproximately four times a year, voting occurs over various issues; these include both initiatives and referendums, where policies are directly voted on by people, and elections, where the populace votes for officials. Federal, cantonal and municipal issues are polled simultaneously, and the majority of people cast their votes by mail. Between January 1995 and June 2005, Swiss citizens voted 31 times, to answer 103 questions . The most frequent themes are healthcare, taxes, welfare, drug policy, public transport, immigration, asylum and education.\nVoter turnout in parliamentary elections saw a continuous decline since the 1970s, down to an all-time low of 42.2% in 1995. In recent years however, voter participation has been slowly growing again and was at 48.5% in 2011. The average turnout for referendums was at 49.2% in 2011. Federal popular initiatives of little public appeal sometimes cause participation of less than 30% of the electorate, but controversial issues such as a proposed abolition of the Swiss army or a possible accession of Switzerland into the European Union have seen turnouts over 60%.", "title": "Voting in Switzerland"}