{"summary": "Wake Island is an atoll  in the Pacific Ocean, near Hawaii.", "full_text": "Wake Island  is a coral atoll located in the western Pacific Ocean in the northeastern area of the Micronesia subregion, 2,416 km  east of Guam, 3,698 km  west of Honolulu and 3,205 km  southeast of Tokyo. The island is an unorganized, unincorporated territory of the United States, but claimed by the Marshall Islands. Wake Island is one of the most isolated islands in the world and the nearest inhabited island is Utirik Atoll in the Marshall Islands, 952 km  to the southeast.\nWake Island is administered by the United States Air Force, under agreement with the Department of the Interior. The center of activity on the atoll is at Wake Island Airfield  which is primarily used as a mid-Pacific refueling stop for military aircraft and as an emergency landing area. The 9,800-foot  runway is the longest strategic runway in the Pacific islands. Located south of the runway is a missile launch facility operated by the United States Army Space and Missile Defense Command and the Missile Defense Agency. The Base Operations Support contractor at Wake is Chugach Alaska Corporation. There are about 94 people living on Wake Island and access to the island is restricted.\nOn December 11, 1941, Wake Island was the site of Japan's first military setback against American forces during World War II when Marines, Navy and some civilian personnel on the island repelled an attempted Japanese invasion, sinking two destroyers and a transport. The island subsequently fell to Japanese forces 12 days later after a successful second invasion attempt on December 23, 1941, this time with extensive support from Japanese carrier-based aircraft returning from the attack on Pearl Harbor. Wake Island remained occupied by Japanese forces until the end of the war; the garrison surrendered the island back to United States forces on September 4, 1945.\nOn January 5, 2009, President George W. Bush included the submerged and emergent lands at the atoll as a unit of the Pacific Remote Islands Marine National Monument. For statistical purposes, Wake Island is grouped as one of the United States Minor Outlying Islands  by the International Organization for Standardization .", "title": "Wake Island"}