{"summary": "Edward VIII  was King of the United Kingdom, from 20 January 1936 until 11 December 1936.", "full_text": "Wallis, Duchess of Windsor  was an American socialite. Her third husband, Prince Edward, Duke of Windsor, formerly King Edward VIII, abdicated his throne to marry her.\nWallis's father died shortly after her birth, and she and her widowed mother were partly supported by their wealthier relatives. Her first marriage, to U.S. naval officer Win Spencer, was punctuated with periods of separation and eventually ended in divorce. In 1934, during her second marriage, to Ernest Simpson, she allegedly became the mistress of Edward, Prince of Wales. Two years later, after Edward's accession as king, Wallis divorced her second husband in order to marry Edward.\nThe King's desire to marry a woman who had two living ex-husbands threatened to cause a constitutional crisis in the United Kingdom and the Dominions, and ultimately led to his abdication in December 1936 to marry \"the woman I love\". After the abdication, the former king was created Duke of Windsor by his brother and successor, King George VI. Edward married Wallis six months later, after which she was formally known as the Duchess of Windsor, without the style \"Her Royal Highness\". She was instead styled as \"Her Grace\", a style normally reserved only for non-royal dukes and duchesses.\nBefore, during, and after World War II, the Duke and Duchess of Windsor were suspected by many in government and society of being Nazi sympathisers. In the 1950s and 1960s, she and the Duke shuttled between Europe and the United States, living a life of leisure as society celebrities. After the Duke's death in 1972, the Duchess lived in seclusion, and was rarely seen in public. Her private life has been a source of much speculation, and she remains a controversial figure in British history.\n^ a b According to 1900 census returns, she was born in June 1895, which author Charles Higham says was before her parents' marriage . Author Greg King, noted that, though Higham's \"scandalous assertion of illegitimacy enlivens the telling of the Duchess's life\", \"the evidence to support it is slim indeed\", and that it \"strains credulity\" .\n^ Edward sued one author, Geoffrey Dennis, who claimed that Wallis and Edward were lovers before their marriage, and won .\n^ Duke of Windsor, p. 413", "title": "Wallis, Duchess of Windsor"}