{"summary": "The Washington National Cathedral is a cathedral of the Episcopal Church in the United States.", "full_text": "The Cathedral Church of Saint Peter and Saint Paul in the City and Diocese of Washington, operated under the more familiar name of Washington National Cathedral, is a cathedral of the Episcopal Church located in Washington, D.C., the capital of the United States. Of Neo-Gothic design closely modeled on English Gothic style of the late fourteenth century, it is the sixth-largest cathedral in the world, the second-largest in the United States, and the highest as well as the fourth-tallest structure in Washington, D.C. The cathedral is the seat of both the Presiding Bishop of the Episcopal Church, Michael Bruce Curry, and the Bishop of the Diocese of Washington, Mariann Edgar Budde. In 2009, nearly 400,000 visitors toured the structure. Average attendance at Sunday services in 2009 was 1,667, the highest of all domestic parishes in the Episcopal Church that year.\nThe Protestant Episcopal Cathedral Foundation, under the first seven Bishops of Washington, erected the cathedral under a charter passed by the United States Congress on January 6, 1893. Construction began on September 29, 1907, when the foundation stone was laid in the presence of President Theodore Roosevelt and a crowd of more than 20,000, and ended 83 years later when the \"final finial\" was placed in the presence of President George H. W. Bush in 1990. Decorative work, such as carvings and statuary, is ongoing as of 2011. The Foundation is the legal entity of which all institutions on the Cathedral Close are a part; its corporate staff provides services for the institutions to help enable their missions, conducts work of the Foundation itself that is not done by the other entities, and serves as staff for the Board of Trustees.\nThe Cathedral stands at Massachusetts and Wisconsin Avenues in the northwest quadrant of Washington. It is an associate member of the recently organized inter-denominational Washington Theological Consortium. It is listed on the National Register of Historic Places. In 2007, it was ranked third on the List of America's Favorite Architecture by the American Institute of Architects.", "title": "Washington National Cathedral"}