{"summary": "A watch is a small clock carried or worn by a person.", "full_text": "A watch is a small timepiece intended to be carried or worn by a person. It is designed to keep working despite the motions caused by the person's activities. A wristwatch is designed to be worn on a wrist, attached by a watch strap or other type of bracelet. A pocket watch is designed for a person to carry in a pocket.\nWatches evolved in the 17th century from spring-powered clocks, which appeared as early as the 14th century. The first watches were strictly mechanical, driven by clockwork. As technology progressed, mechanical devices, used to control the speed of the watch, were largely superseded by vibrating quartz crystals that produce accurately timed electronic pulses. Some watches use radio clock technology to regularly correct the time. The first digital electronic watch was developed in 1970.\nMost inexpensive and medium-priced watches, used mainly for timekeeping, are electronic watches with quartz movements. Expensive collectible watches, valued more for their elaborate craftsmanship, aesthetic appeal and glamorous design than for simple timekeeping, often have purely mechanical movements and are powered by springs, even though these movements are generally less accurate and more expensive than electronic ones. Various extra features, called \"complications\", such as moon-phase displays and the different types of tourbillon, are sometimes included. Modern watches often display the day, date, month and year, and electronic watches may have many other functions. Time-related features such as timers, chronographs and alarm functions are common. Some modern designs incorporate calculators, GPS and Bluetooth technology or have heart-rate monitoring capabilities. Watches incorporating GPS receivers use them not only to determine their position. They also receive and use time signals from the satellites, which make them essentially perfectly accurate timekeepers, even over long periods of time.\nRecent developments include smartwatches, which are elaborate computer-like electronic devices designed to be worn on a wrist. They generally incorporate timekeeping functions, but these are only small fractions of what the watch can do.\nThe study of timekeeping is known as horology.\n^ a b \"The History of Watches\". SteelWatch.co. Archived from the original on 7 July 2011. \n^ Pulsar LED Smithsonian\n^ Wikipedia: sections under Functions.\n^ \"Epson announces world's lightest GPS watch\". The Verge. Retrieved 14 April 2012.", "title": "Watch"}