{"summary": "The Watergate scandal happened when United States President Richard Nixon, a Republican, was tied to a crime in which former FBI and CIA agents broke into the offices of the Democratic Party and George McGovern .", "full_text": "The Watergate scandal was a major political scandal that occurred in the United States in the 1970s as a result of the June 17, 1972 break-in at the Democratic National Committee  headquarters at the Watergate office complex in Washington, D.C., and President Richard Nixon's administration's attempted cover-up of its involvement. When the conspiracy was discovered and investigated by the U.S. Congress, the Nixon administration's resistance to its probes led to a constitutional crisis. The term Watergate has come to encompass an array of clandestine and often illegal activities undertaken by members of the Nixon administration. Those activities included such \"dirty tricks\" as bugging the offices of political opponents and people of whom Nixon or his officials were suspicious. Nixon and his close aides ordered harassment of activist groups and political figures, using the Federal Bureau of Investigation , the Central Intelligence Agency , and the Internal Revenue Service . The scandal led to the discovery of multiple abuses of power by the Nixon administration, articles of impeachment, and the resignation of Nixon as President of the United States in August 1974. The scandal also resulted in the indictment of 69 people, with trials or pleas resulting in 48 being found guilty and incarcerated, many of whom were Nixon's top administration officials.\nThe affair began with the arrest of five men for breaking and entering into the DNC headquarters at the Watergate complex on Saturday, June 17, 1972. The FBI investigated and discovered a connection between cash found on the burglars and a slush fund used by the Committee for the Re-Election of the President , the official organization of Nixon's campaign. In July 1973, evidence mounted against the President's staff, including testimony provided by former staff members in an investigation conducted by the Senate Watergate Committee. The investigation revealed that President Nixon had a tape-recording system in his offices and that he had recorded many conversations. After a protracted series of bitter court battles, the U.S. Supreme Court unanimously ruled that the president had to release the tapes to government investigators, and he eventually complied. These audio recordings implicated the president, revealing he had attempted to cover up activities that took place after the break-in and to use federal officials to deflect the investigation. Facing near-certain impeachment in the House of Representatives and equally certain conviction by the Senate, Nixon resigned the presidency on August 9, 1974. On September 8, 1974, his successor, Gerald Ford, pardoned him.\nThe name \"Watergate\" and the suffix \"-gate\" have since become synonymous with political scandals in the United States and in other English- and non-English-speaking nations.", "title": "Watergate scandal"}