{"summary": "A municipal corporation is a term used by the local government.", "full_text": "Issues that affect water supply and sanitation in the United States include water scarcity, pollution, a backlog of investment, concerns about the affordability of water for the poorest, and a rapidly retiring workforce. Increased variability and intensity of rainfall as a result of climate change is expected to produce both more severe droughts and flooding, with potentially serious consequences for water supply and for pollution from combined sewer overflows. Droughts are likely to particularly affect the 66 percent of Americans whose communities depend on surface water. As for drinking water quality, there are concerns about disinfection by-products, lead, perchlorates and pharmaceutical substances, but generally drinking water quality in the U.S. is good.\nCities, utilities, state governments and the federal government have addressed the above issues in various ways. To keep pace with demand from an increasing population, utilities traditionally have augmented supplies. However, faced with increasing costs and droughts, water conservation is beginning to receive more attention and is being supported through the federal WaterSense program. The reuse of treated wastewater for non-potable uses is also becoming increasingly common. Pollution through wastewater discharges, a major issue in the 1960s, has been brought largely under control.\nMost Americans are served by publicly owned water and sewer utilities. Eleven percent of Americans receive water from private  utilities. In rural areas, cooperatives often provide drinking water. Finally, up to 15 percent of Americans are served by their own wells. Water supply and wastewater systems are regulated by state governments and the federal government. At the state level, health and environmental regulation is entrusted to the corresponding state-level departments. Public Utilities Commissions or Public Service Commissions regulate tariffs charged by private utilities. In some states they also regulate tariffs by public utilities. At the federal level, drinking water quality and wastewater discharges are regulated by the United States Environmental Protection Agency, which also provides funding to utilities through State Revolving Funds.\nWater consumption in the United States is more than double that in Central Europe, with large variations among the states. In 2002 the average American family spent $474 on water and sewerage charges, which is about the same level as in Europe. The median household spent about 1.1 percent of its income on water and sewerage.", "title": "Water supply and sanitation in the United States"}