{"summary": "The weight of an object  is the measure of the intensity of the force imposed on this object by the local gravitational field.", "full_text": "In science and engineering, the weight of an object is usually taken to be the force on the object due to gravity. Weight is a vector whose magnitude , often denoted by an italic letter W, is the product of the mass m of the object and the magnitude of the local gravitational acceleration g; thus: W = mg. The unit of measurement for weight is that of force, which in the International System of Units  is the newton. For example, an object with a mass of one kilogram has a weight of about 9.8 newtons on the surface of the Earth, and about one-sixth as much on the Moon. In this sense of weight, a body can be weightless only if it is far away  from any other mass. Although weight and mass are scientifically distinct quantities, the terms are often confused with each other in everyday use.\nThere is also a rival tradition within Newtonian physics and engineering which sees weight as that which is measured when one uses scales. There the weight is a measure of the magnitude of the reaction force exerted on a body. Typically, in measuring an object's weight, the object is placed on scales at rest with respect to the earth, but the definition can be extended to other states of motion. Thus, in a state of free fall, the weight would be zero. In this second sense of weight, terrestrial objects can be weightless. Ignoring air resistance, the famous apple falling from the tree, on its way to meet the ground near Isaac Newton, is weightless.\nFurther complications in elucidating the various concepts of weight have to do with the theory of relativity according to which gravity is modelled as a consequence of the curvature of spacetime. In the teaching community, a considerable debate has existed for over half a century on how to define weight for their students. The current situation is that a multiple set of concepts co-exist and find use in their various contexts.", "title": "Weight"}