{"summary": "The Western Roman Empire was the western half of the Roman Empire, from its division by Diocletian in 286; the other half of the Roman Empire became known as the Eastern Roman Empire, today widely known as the Byzantine Empire.", "full_text": "In historiography, the Western Roman Empire consists of the western provinces of the Roman Empire at any one time during which they were administered by a separate independent Imperial court, coequal with  that administering the eastern half. Both \"Western Roman Empire\" and \"Eastern Roman Empire\"  are modern terms describing de facto independent entities; however, at no point did Romans consider the Empire split into two, but rather considered it a single state governed by two separate Imperial courts out of administrative expediency. The view that the Empire was impossible to govern by one emperor was established by Diocletian following the disastrous civil wars and disintegration of the Crisis of the 3rd century, and was instituted in Roman law by his introduction of the Tetrarchy in AD 285, a form of government which was legally to endure in one form or another for centuries. The Western Court was periodically abolished and recreated for the next two centuries until final abolition by the Emperor Zeno in 480, by which time there was little effective central control left in the area legally administered by the Western Court.\nA Western Roman Empire existed intermittently in several periods between the 3rd and 5th centuries, after Diocletian's Tetrarchy and the reunifications associated with Constantine the Great and Julian the Apostate . Theodosius I divided the Empire upon his death  between his two sons. Finally, eighty-five years later, Emperor Zeno of the Eastern Court recognized the reality of the Western Empire's reduced domain  after the death of Western Emperor Julius Nepos, and proclaimed himself sole emperor of the Roman Empire.\nThe rise of Odoacer of the Foederati to rule over Italy in 476 was popularized by eighteenth-century historian Edward Gibbon as a demarcating event for the end of the Western Empire and is sometimes used to mark the transition from Antiquity to the Middle Ages.\nImperial rule was reimposed in large parts of the West in the sixth century by the armies of the Eastern Roman Empire but political upheaval in the East Roman heartlands saw the Western provinces slip away once more, this time for good. Doctrinal issues in the eighth century saw a major breakdown in relations between the Eastern Emperor and the Pope, eventually leading the latter to unilaterally declare the Frankish King Charlemagne to be the true successor of the Western Emperors in 800. This new imperial line would evolve in time into the Holy Roman Empire, which revived the imperial title but was otherwise in no meaningful sense an extension of Roman traditions or institutions.", "title": "Western Roman Empire"}