{"summary": "A wormhole is a theoretical connection between a black hole and a white hole creating a shortcut through time and space.", "full_text": "In general relativity, a white hole is a hypothetical region of spacetime which cannot be entered from the outside, although matter and light can escape from it. In this sense, it is the reverse of a black hole, which can only be entered from the outside and from which matter and light cannot escape. White holes appear in the theory of eternal black holes. In addition to a black hole region in the future, such a solution of the Einstein field equations has a white hole region in its past. However, this region does not exist for black holes that have formed through gravitational collapse, nor are there any known physical processes through which a white hole could be formed. No white hole has ever been observed. Also, the laws of thermodynamics say that the net entropy in the universe can either increase or remain constant. This rule is violated by white holes, as they tend to decrease entropy.\nLike black holes, white holes have properties like mass, charge, and angular momentum. They attract matter like any other mass, but objects falling towards a white hole would never actually reach the white hole's event horizon . Imagine a gravitational field, without a surface. Acceleration due to gravity is the greatest on the surface of any body. But since black holes lack a surface, acceleration due to gravity increases exponentially, but never reaches a final value as there is no considered surface in a singularity.\nIn quantum mechanics, the black hole emits Hawking radiation and so can come to thermal equilibrium with a gas of radiation. Because a thermal-equilibrium state is time-reversal-invariant, Stephen Hawking argued that the time reverse of a black hole in thermal equilibrium is again a black hole in thermal equilibrium. This may imply that black holes and white holes are the same object. The Hawking radiation from an ordinary black hole is then identified with the white-hole emission. Hawking's semi-classical argument is reproduced in a quantum mechanical AdS/CFT treatment, where a black hole in anti-de Sitter space is described by a thermal gas in a gauge theory, whose time reversal is the same as itself.", "title": "White hole"}