{"summary": "1991  was a common year starting on Tuesday of the Gregorian calendar.", "full_text": "Gerina Dunwich  is a professional astrologer, occult historian, and New Age author, best known for her books on Wicca and various occult subjects. She is also involved in paranormal research and is the founder of the Paranormal Animal Research Group, which investigates cases of alleged hauntings by animal spirits.\nHer first newspaper article was published in October 1976. It was an interview with singer/songwriter Jim Peterik from the local Chicago band, the Ides of March . By the spring of 1980 Dunwich was publishing a small press literary journal called Golden Isis, a one-woman operation that specialized in Goddess-inspired poetry and off-beat fiction.\nIn December 1993 she moved to Fort Covington, Franklin County, New York, where she opened a small shop on High Street called \"The Country Witch\" , which sold antiques, curios and various occult supplies. She officially established Coven Mandragora on Candlemas 1996 and served as its High Priestess. That same year she established the Wheel of Wisdom School  and the Pagan Poets Society , along with a local networking organization known as North Country Wicca. In February 1998 she received a ministerial license from the Universal Life Church.\nA respected spokesperson for the Wiccan/Pagan community, Dunwich has been a guest on numerous radio talk shows throughout the United States and Canada. She has lectured and presented workshops at festivals and gatherings across the country, such as the CraftWise Pagan Gathering , the Real Witches' Ball , and Panpipes' Pagan Day Festival .\nA member of the Fellowship of Isis, Circle, the Pagan Poets Society, the Authors Guild, and the Authors League of America, Dunwich's biography can be found in such reference works as Who's Who in the East, Personalities of America, The Wicca Source Book, The Modern Witch's Complete Sourcebook, and Crossroads: Who's Who of the Magickal Community . Dunwich is also mentioned in the book, Goddesses and Wise Women by Anne Carson and in other works. Her articles, poetry, and reviews have appeared in numerous publications, including Sage Woman, Magical Blend, Circle Network News, Pagan Free Press, and American Woman.\n^ Ghostvillage.com Interview by Lee Prosser\n^ The Wiccan/Pagan Times\n^ Kensington Books\n^ Kensington Books\n^ Universal Life Church\n^ Gerina Dunwich's Biography", "title": "Wicca Craft"}