{"summary": "Wicca, or the Craft, is a Neo-pagan  religion popularized by a British man named Gerald Gardner in the 1940s.", "full_text": "Wicca , also termed Pagan Witchcraft, is a contemporary Pagan new religious movement. It was developed in England during the first half of the 20th century and was introduced to the public in 1954 by Gerald Gardner, a retired British civil servant. Wicca draws upon a diverse set of ancient pagan and 20th century hermetic motifs for its theological structure and ritual practice.\nWicca has no central authority. Its traditional core beliefs, principles and practices were originally outlined in the 1940s and 1950s by Gardner and Doreen Valiente, both in published books as well as in secret written and oral teachings passed along to their initiates. There are many variations on the core structure, and the religion grows and evolves over time. It is divided into a number of diverse lineages, sects and denominations, referred to as traditions, each with its own organizational structure and level of centralisation. Due to its decentralized nature, there is some disagreement over what actually constitutes Wicca. Some traditions, collectively referred to as British Traditional Wicca, strictly follow the initiatory lineage of Gardner and consider the term Wicca to apply only to similar traditions, while newer eclectic traditions do not.\nWicca is typically duotheistic, worshipping a Goddess and a God. These are traditionally viewed as the Moon Goddess and the Horned God, respectively. These deities may be regarded in a henotheistic way, as having many different divine aspects which can in turn be identified with many diverse pagan deities from different historical pantheons. For this reason, they are sometimes referred to as the \"Great Goddess\" and the \"Great Horned God\", with the adjective \"great\" connoting a deity that contains many other deities within their own nature. These two deities are sometimes viewed as facets of a greater pantheistic divinity, which is regarded as an impersonal force or process rather than a personal deity. While duotheism or bitheism is traditional in Wicca, broader Wiccan beliefs range from polytheism to pantheism or monism, even to Goddess monotheism.\nWiccan celebrations follow both the cycles of the Moon, known as esbats and associated with the Goddess, and the cycles of the Sun, seasonally based festivals known as Sabbats and associated with the Horned God. An unattributed statement known as the Wiccan Rede is a popular expression of Wiccan morality, although it is not accepted by all Wiccans. Wicca often involves the ritual practice of magic, though it is not always necessary.", "title": "Wicca"}