{"summary": "William Howard Taft  was the 27th President of the United States from March 4, 1909 to March 3, 1913. He is well known for being the heaviest President in U.S.", "full_text": "William Howard Taft  was an American jurist and statesman who served as both the 27th President of the United States  and later the 10th Chief Justice of the United States . A leader during the Progressive Era, Taft and his conservative allies took control of the Republican Party away from Theodore Roosevelt and the liberals. He is the only person to have presided over both the executive and judicial branches of the United States federal government.\nBefore becoming President, Taft served as Solicitor General of the United States and as a judge on the United States Court of Appeals for the Sixth Circuit. In 1900, President William McKinley appointed Taft Governor-General of the Philippines. In 1904, President Theodore Roosevelt appointed Taft Secretary of War in an effort to groom Taft, then his close political ally, into his handpicked presidential successor. Taft assumed a prominent role in problem solving, assuming on some occasions the role of acting Secretary of State, while declining repeated offers from Roosevelt to serve on the Supreme Court.\nRiding a wave of popular support for fellow Republican Roosevelt, Taft won an easy victory in his 1908 bid for the presidency. In his only term, Taft's domestic agenda emphasized trust-busting, civil service reform, strengthening the Interstate Commerce Commission, improving the performance of the postal service, and passage of the Sixteenth Amendment. Abroad, Taft sought to further the economic development of nations in Latin America and Asia through \"Dollar Diplomacy\", and showed decisiveness and restraint in response to revolution in Mexico. The task-oriented Taft was oblivious to the political ramifications of his decisions, often alienated his own key constituencies, and was overwhelmingly defeated in his bid for a second term in the presidential election of 1912. In surveys of presidential scholars, Taft is usually ranked near the middle of lists of all American Presidents.\nAfter leaving office, Taft spent his time in academia, arbitration, and the pursuit of world peace through his self-founded League to Enforce Peace. In 1921, President Warren G. Harding appointed Taft Chief Justice of the United States. He emphasized conservative policies and efficient management.\n\n", "title": "William Howard Taft"}