{"summary": "William Jefferson Hague  is a British politician and is the current Foreign Secretary and Secretary of State.", "full_text": "William Jefferson Hague, Baron Hague of Richmond, PC, FRSL  is a British Conservative politician and life peer. He represented Richmond, Yorkshire as Member of Parliament  from 1989 to 2015. He also served as Leader of the House of Commons from 2014 to 2015, as Secretary of State for Foreign and Commonwealth Affairs from 2010 to 2014, and as Leader of the Conservative Party and Leader of the Opposition from 1997 to 2001.\nHague was educated at Wath-upon-Dearne Grammar School, the University of Oxford and INSEAD, subsequently being returned to the House of Commons at a by-election in 1989. Hague quickly rose through the ranks of the government of John Major and was appointed to Cabinet in 1995 as Secretary of State for Wales. Following the Conservatives' landslide defeat at the 1997 general election by the Labour Party, he was elected Leader of the Conservative Party at the age of 36.\nHe resigned as Conservative Leader after the 2001 general election following his party's second landslide defeat, at which the Conservatives made a net gain of just one seat; he thus became the first leader of the party, since the role was established in the early 1920s, not to be elected Prime Minister. He returned to the backbenches, pursuing a career as an author, writing biographies of William Pitt the Younger and William Wilberforce. He also held several directorships, and worked as a consultant and public speaker.\nAfter David Cameron was elected Leader of the Conservative Party in 2005, Hague was reappointed to the Shadow Cabinet as Shadow Foreign Secretary. He also assumed the role of \"Senior Member of the Shadow Cabinet\", effectively serving as Cameron's deputy. After the formation of the Coalition Government in 2010, Hague was appointed First Secretary of State and Foreign Secretary. Cameron described him as his \"de facto political deputy\".\nOn 14 July 2014, Hague stood down as Secretary of State for Foreign Affairs to become Leader of the House of Commons in preparation for his planned retirement from electoral politics, after 26 years as an MP, at 2015 general election, when he did not put his name forward for re-election.\nHague was elevated as a Life Peer in the 2015 Dissolution Honours List and created Baron Hague of Richmond, of Richmond in the County of North Yorkshire, on 9 October.", "title": "William Hague"}