{"summary": "Wind is the flow of gases.", "full_text": "Wind is the flow of gases on a large scale. On the surface of the Earth, wind consists of the bulk movement of air. In outer space, solar wind is the movement of gases or charged particles from the Sun through space, while planetary wind is the outgassing of light chemical elements from a planet's atmosphere into space. Winds are commonly classified by their spatial scale, their speed, the types of forces that cause them, the regions in which they occur, and their effect. The strongest observed winds on a planet in our solar system occur on Neptune and Saturn. Winds have various aspects, an important one being its velocity; another the density of the gas involved; another is the energy content or wind energy of a wind.\nIn meteorology, winds are often referred to according to their strength, and the direction from which the wind is blowing. Short bursts of high speed wind are termed gusts. Strong winds of intermediate duration  are termed squalls. Long-duration winds have various names associated with their average strength, such as breeze, gale, storm, and hurricane. Wind occurs on a range of scales, from thunderstorm flows lasting tens of minutes, to local breezes generated by heating of land surfaces and lasting a few hours, to global winds resulting from the difference in absorption of solar energy between the climate zones on Earth. The two main causes of large-scale atmospheric circulation are the differential heating between the equator and the poles, and the rotation of the planet . Within the tropics, thermal low circulations over terrain and high plateaus can drive monsoon circulations. In coastal areas the sea breeze/land breeze cycle can define local winds; in areas that have variable terrain, mountain and valley breezes can dominate local winds.\nIn human civilization, wind has inspired mythology, influenced the events of history, expanded the range of transport and warfare, and provided a power source for mechanical work, electricity and recreation. Wind powers the voyages of sailing ships across Earth's oceans. Hot air balloons use the wind to take short trips, and powered flight uses it to increase lift and reduce fuel consumption. Areas of wind shear caused by various weather phenomena can lead to dangerous situations for aircraft. When winds become strong, trees and man-made structures are damaged or destroyed.\nWinds can shape landforms, via a variety of aeolian processes such as the formation of fertile soils, such as loess, and by erosion. Dust from large deserts can be moved great distances from its source region by the prevailing winds; winds that are accelerated by rough topography and associated with dust outbreaks have been assigned regional names in various parts of the world because of their significant effects on those regions. Wind also affects the spread of wildfires. Winds can disperse seeds from various plants, enabling the survival and dispersal of those plant species, as well as flying insect populations. When combined with cold temperatures, wind has a negative impact on livestock. Wind affects animals' food stores, as well as their hunting and defensive strategies.", "title": "Wind"}