{"summary": "Roscoe Lee Browne  was an American television, stage, voice, and movie actor, narrator, and director.", "full_text": "Woodbury is a city in Gloucester County, New Jersey, in the United States. As of the 2010 United States Census the city's population was 10,174, reflecting a decline of 133  from the 10,307 counted in the 2000 Census, which had in turn declined by 597  from the 10,904 counted in the 1990 Census. Woodbury is the county seat of Gloucester County.\nWoodbury was originally formed as a borough on March 27, 1854, within Deptford Township, based on the results of a referendum held on March 22, 1854. On January 2, 1871, Woodbury was reincorporated as a city, based on the results of a referendum held that day.\nThe Inspira Health Network is based in Woodbury. The now-defunct Woodbury Country Club operated in Woodbury from 1897 to 2010, closing due to declining membership and mounting debt that led to a bankruptcy filing by the club.\n^ a b c d e 2010 Census Gazetteer Files: New Jersey County Subdivisions, United States Census Bureau. Accessed May 21, 2015.\n^ US Gazetteer files: 2010, 2000, and 1990, United States Census Bureau. Accessed September 4, 2014.\n^ 2015 New Jersey Mayors Directory, New Jersey Department of Community Affairs, as of October 20, 2015. Accessed November 15, 2015.\n^ a b City Officials, City of Woodbury. Accessed July 9, 2012.\n^ \n^ U.S. Geological Survey Geographic Names Information System: City of Woodbury, Geographic Names Information System. Accessed March 14, 2013.\n^ a b DP-1 - Profile of General Population and Housing Characteristics: 2010 for Woodbury city, Gloucester County, New Jersey, United States Census Bureau. Accessed July 9, 2012.\n^ \n^ a b Profile of General Demographic Characteristics: 2010 for Woodbury city, New Jersey Department of Labor and Workforce Development. Accessed July 9, 2012.\n^ \n^ a b GCT-PH1 Population, Housing Units, Area, and Density: 2010 - State -- County Subdivision from the 2010 Census Summary File 1 for New Jersey, United States Census Bureau. Accessed November 10, 2012.\n^ Look Up a ZIP Code for Woodbury, NJ, United States Postal Service. Accessed July 9, 2012.\n^ Zip Codes, State of New Jersey. Accessed November 12, 2013.\n^ Area Code Lookup - NPA NXX for Woodbury, NJ, Area-Codes.com. Accessed November 11, 2013.\n^ American FactFinder, United States Census Bureau. Accessed September 4, 2014.\n^ A Cure for the Common Codes: New Jersey, Missouri Census Data Center. Accessed July 9, 2012.\n^ US Board on Geographic Names, United States Geological Survey. Accessed September 4, 2014.\n^ Table 7. Population for the Counties and Municipalities in New Jersey: 1990, 2000 and 2010, New Jersey Department of Labor and Workforce Development, February 2011. Accessed July 9, 2012.\n^ \"Find a County\". National Association of Counties. Retrieved 2011-06-07. \n^ Gloucester County, NJ, National Association of Counties. Accessed January 20, 2013.\n^ Snyder, John P. The Story of New Jersey's Civil Boundaries: 1606-1968, Bureau of Geology and Topography; Trenton, New Jersey; 1969. p. 141. Accessed July 9, 2012.\n^ Inspira Medical Center Woodbury, Inspira Health Network. Accessed November 12, 2013.\n^ Conaboy, Chelsea. \"Plan would put houses on defunct Woodbury Country Club\", The Philadelphia Inquirer, August 23, 2010. Accessed November 12, 2013. \"The country club, which was founded in 1897, filed for bankruptcy last summer, citing about $2.88 million in debt, then closed in October. Membership had been declining for years and couldn't support debt from a 1991 renovation.\"", "title": "Woodbury, New Jersey"}