{"summary": "World War I reparations means the payments and transfers of property and equipment that Germany was forced to make after its defeat during World War I.", "full_text": "World War I reparations were compensation imposed during the Paris Peace Conference upon the Central Powers following their defeat in the First World War by the Allied and Associate Powers. Each of the defeated powers was required to make payments in either cash or kind. Because of the financial situation Austria, Hungary, and Turkey found themselves in after the war, few to no reparations were paid and the requirements for reparations were cancelled. Bulgaria, having paid only a fraction of what was required, saw her reparation figure reduced and then cancelled. Historians have recognized the German requirement to pay reparations as the \"chief battleground of the post-war era\" and \"the focus of the power struggle between France and Germany over whether the Versailles Treaty was to be enforced or revised\".\nThe Treaty of Versailles and the 1921 London Schedule of Payments required Germany to pay 132 billion gold marks  in reparations to cover civilian damage caused during the war. This figure was divided into three categories of bonds: A, B, and C. Of these, Germany was only required to pay towards 'A' and 'B' bonds totalling 50 billion marks . The remaining 'C' bonds, which Germany did not have to pay, were designed to deceive the Anglo-French public into believing Germany was being heavily fined and punished for the war.\nBecause of the lack of reparation payments by Germany, France occupied the Ruhr in 1923 to enforce payments, causing an international crisis that resulted in the implementation of the Dawes Plan in 1924. This plan outlined a new payment method and raised international loans to help Germany to meet her reparation commitments. Despite this, by 1928 Germany called for a new payment plan, resulting in the Young Plan that established the German reparation requirements at 112 billion marks  and created a schedule of payments that would see Germany complete payments by 1988. With the collapse of the German economy in 1931, reparations were suspended for a year and in 1932 during the Lausanne Conference they were cancelled altogether. Between 1919 and 1932, Germany paid less than 21 billion marks in reparations.\nThe German people saw reparations as a national humiliation; the German Government worked to undermine the validity of the Treaty of Versailles and the requirement to pay. British economist John Maynard Keynes called the treaty a Carthaginian peace that would economically destroy Germany. His arguments had a profound effect on historians, politicians, and the public at large. Despite Keynes' arguments and those by later historians supporting or reinforcing Keynes' views, the consensus of contemporary historians is that reparations were not as intolerable as the Germans or Keynes had suggested and were within Germany's capacity to pay had there been the political will to do so.", "title": "World War I reparations"}