{"summary": "Riccardo Giacconi  is an Italian-American astrophysicist and educator.", "full_text": "X-ray astronomy is an observational branch of astronomy which deals with the study of X-ray observation and detection from astronomical objects. X-radiation is absorbed by the Earth's atmosphere, so instruments to detect X-rays must be taken to high altitude by balloons, sounding rockets, and satellites. X-ray astronomy is the space science related to a type of space telescope that can see farther than standard light-absorption telescopes, such as the Mauna Kea Observatories, via x-ray radiation.\nX-ray emission is expected from astronomical objects that contain extremely hot gasses at temperatures from about a million kelvin  to hundreds of millions of kelvin . Although X-rays have been observed emanating from the Sun since the 1940s, the discovery in 1962 of the first cosmic X-ray source was a surprise. This source is called Scorpius X-1 , the first X-ray source found in the constellation Scorpius. The X-ray emission of Scorpius X-1 is 10,000 times greater than its visual emission, whereas that of the Sun is about a million times less. In addition, the energy output in X-rays is 100,000 times greater than the total emission of the Sun in all wavelengths. Based on discoveries in this new field of X-ray astronomy, starting with Scorpius X-1, Riccardo Giacconi received the Nobel Prize in Physics in 2002. It is now known that such X-ray sources as Sco X-1 are compact stars, such as neutron stars or black holes. Material falling into a black hole may emit X-rays, but the black hole itself does not. The energy source for the X-ray emission is gravity. Infalling gas and dust is heated by the strong gravitational fields of these and other celestial objects.\nMany thousands of X-ray sources are known. In addition, the space between galaxies in galaxy clusters is filled with a very hot, but very dilute gas at a temperature between 10 and 100 megakelvins . The total amount of hot gas is five to ten times the total mass in the visible galaxies.", "title": "X-ray astronomy"}