{"summary": "Yale University is a private university in New Haven, Connecticut.", "full_text": "Yale University is a private Ivy League research university in New Haven, Connecticut. Founded in 1701 in Saybrook Colony as the Collegiate School, the University is the third-oldest institution of higher education in the United States. In 1718, the school was renamed Yale College in recognition of a gift from Elihu Yale, a governor of the British East India Company and in 1731 received a further gift of land and slaves from Bishop Berkeley. Established to train Congregationalist ministers in theology and sacred languages, by 1777 the school's curriculum began to incorporate humanities and sciences and in the 19th century gradually incorporated graduate and professional instruction, awarding the first Ph.D. in the United States in 1861 and organizing as a university in 1887.\nYale is organized into twelve constituent schools: the original undergraduate college, the Yale Graduate School of Arts and Sciences, and ten professional schools. While the university is governed by the Yale Corporation, each school's faculty oversees its curriculum and degree programs. In addition to a central campus in downtown New Haven, the University owns athletic facilities in western New Haven, including the Yale Bowl, a campus in West Haven, Connecticut, and forest and nature preserves throughout New England. The university's assets include an endowment valued at $25.6 billion as of September 2015, the second largest of any educational institution in the world.\nYale College undergraduates follow a liberal arts curriculum with departmental majors and are organized into a system of residential colleges. Almost all faculty teach undergraduate courses, more than 2,000 of which are offered annually. The Yale University Library, serving all twelve schools, holds more than 15 million volumes and is the third-largest academic library in the United States. Outside of academic studies, students compete intercollegiately as the Yale Bulldogs in the NCAA Division I Ivy League.\nYale has graduated many notable alumni, including five U.S. Presidents, 19 U.S. Supreme Court Justices, 13 living billionaires, and many foreign heads of state. In addition, Yale has graduated hundreds of members of Congress and many high-level U.S. diplomats, including former U.S. Secretary of State Hillary Clinton and current Secretary of State John Kerry. Fifty-two Nobel laureates, 230 Rhodes Scholars, and 118 Marshall Scholars have been affiliated with the University.", "title": "Yale University"}