{"summary": "The Yazidi  are a ethnoreligious group with Indo-Iranian roots.", "full_text": "The Yazidis  are an ethno-religious group whose syncretic and ancient religion Yazidism  is linked to Zoroastrianism and ancient Mesopotamian religions; however Yazidis form a distinct and independent religious community and have their own culture. They live primarily in the Nineveh Province of Iraq. Additional communities in Armenia, Georgia, Turkey, Iran, and Syria have been in decline since the 1990s as a result of significant migration to Europe, especially to Germany. In Armenia, the Yazidis are recognized as a distinct ethnic group and generally do not consider themselves to be Kurdish. The issue is controversial and highly politicized.\nThe Yazidis are monotheists, believing in God as creator of the world, which he has placed under the care of seven holy beings or angels, the chief of whom is Melek Taus, the Peacock Angel. The Peacock Angel, as world-ruler, causes both good and bad to befall individuals, and this ambivalent character is reflected in myths of his own temporary fall from God's favour, before his remorseful tears extinguished the fires of his hellish prison and he was reconciled with God.\nThis belief builds on Sufi mystical reflections on the Jinn Iblis, who proudly refused to violate monotheism by worshipping Adam and Eve despite God's expressed command to do so. Because of this connection to the Sufi Iblis tradition, some followers of other monotheistic religions of the region equate the Peacock Angel with their own unredeemed evil spirit Satan, which has incited centuries of persecution of the Yazidis as \"devil worshippers.\" Persecution of Yazidis has continued in their home communities within the borders of modern Iraq, under fundamentalist Sunni Muslim revolutionaries.\nStarting in August 2014, the Yazidis were targeted by the Islamic State of Iraq and the Levant in its campaign to \"purify\" Iraq and neighbouring countries of non-Islamic influences.", "title": "Yazidi"}