{"summary": "The Year 2000 problem  was a problem that happened because of the way in which some early computer programs were made.", "full_text": "The Year 2000 problem  was a problem for both digital  and non-digital documentation and data storage situations that resulted from the practice of truncating a four-digit year to two digits. This made year 2000 indistinguishable from 1900. The former assumption that a twentieth-century date was always understood caused various errors concerning, in particular, the display of dates and the automated ordering of dated records or real-time events.\nIn 1997, the British Standards Institute  developed a standard, DISC PD2000-1, which defines \"Year 2000 Conformity requirements\" as four rules:\nNo valid date will cause any interruption in operations.\nCalculation of durations between, or the sequence of, pairs of dates will be correct whether any dates are in different centuries.\nIn all interfaces and in all storage, the century must be unambiguous, either specified, or calculable by algorithm.\nYear 2000 must be recognized as a leap year.\nIt identifies two problems that may exist in many computer programs.\nFirstly, the practice of representing the year with two digits becomes problematic with logical error arising upon \"rollover\" from x99 to x00. This has caused some date-related processing to operate incorrectly for dates and times on and after 1 January 2000, and on other critical dates which were billed \"event horizons\". Without corrective action, long-working systems would break down when the \"... 97, 98, 99, 00 ...\" ascending numbering assumption suddenly became invalid.\nSecondly, some programmers had misunderstood the Gregorian rule that determines whether years that are exactly divisible by 100 are not leap years, and assumed the year 2000 would not be a leap year. Although 3 out of 4 years divisible by 100 are not leap years, if they are divisible by 400 then they are. Thus the year 2000 was a leap year.\nCompanies and organizations worldwide checked, fixed, and upgraded their computer systems.\nThe number of computer failures that occurred when the clocks rolled over into 2000 in spite of remedial work is not known; among other reasons is the reluctance of organisations to report problems.", "title": "Year 2000 problem"}