{"summary": "Yoko Ono  is a Japanese musician and artist.", "full_text": "Yoko Ono  is a Japanese multimedia artist, singer and peace activist who is also known for her work in performance art, music and filmmaking. She is the widow and second wife of John Lennon.\nOno grew up in Tokyo, and studied at Gakushuin. She withdrew from her course after two years and rejoined her family in New York in 1953. She spent some time at Sarah Lawrence College, and then became involved in New York City's downtown artists scene, including the Fluxus group. She first met Lennon in 1966 at her own art exhibition in London, and they became a couple in 1968. Ono and Lennon famously used their honeymoon as a stage for public protests against the Vietnam War with their performance, Bed-Ins for Peace, in Amsterdam and Montreal in 1969. She brought feminism to the forefront in her music, influencing artists as diverse as the B-52s and Meredith Monk. Ono achieved commercial and critical acclaim in 1980 with the chart-topping album Double Fantasy, released with Lennon three weeks before his death.\n\nPublic appreciation of Ono's work has shifted over time, helped by a retrospective at a Whitney Museum branch in 1989 and the 1992 release of the six-disc box set Onobox. Retrospectives of her artwork have also been presented at the Japan Society in New York City in 2001, in Bielefeld, Germany, and the UK in 2008, and Frankfurt, and Bilbao, Spain, in 2013. She received a Golden Lion Award for lifetime achievement from the Venice Biennale in 2009 and the 2012 Oskar Kokoschka Prize, Austria's highest award for applied contemporary art.\nAs Lennon's widow, Ono works to preserve his legacy. She funded Strawberry Fields in New York City, the Imagine Peace Tower in Iceland, and the John Lennon Museum in Saitama, Japan . She has made significant philanthropic contributions to the arts, peace, Philippine and Japan disaster relief, and other causes. Ono continues her social activism, inaugurating a biennial $50,000 LennonOno Grant for Peace in 2002 and co-founding the group Artists Against Fracking in 2012. She has a daughter, Kyoko Chan Cox, from her marriage to Anthony Cox and a son, Sean Taro Ono Lennon, with whom she collaborates musically, from her marriage to Lennon.", "title": "Yoko Ono"}