{"summary": "\"You Oughta Know\" is a song from Alanis Morissette from her third studio album Jagged Little Pill.", "full_text": "\"You Oughta Know\" is a song by Canadian-American recording artist and songwriter Alanis Morissette, released as the lead single from her third studio album, Jagged Little Pill  on July 7, 1995. After releasing two commercially successful studio albums through MCA Records Canada, Morissette left MCA Records Canada and was introduced to manager Scott Welch. Morissette began working on new music after moving from her hometown of Ottawa to Toronto, but did not make much progress until travelling to Los Angeles, where she met Glen Ballard. Alanis and Ballard co-wrote the song with the latter producing it, while musicians Flea and Dave Navarro of the Red Hot Chili Peppers played bass and guitar on the track.\nThe song was the first released track that saw Morissette's departure from bubblegum pop to the alternative rock sound she was later known for. Released to positive reviews from critics, the single managed to outperform the label's initial expectations. KROQ-FM, an influential Los Angeles modern rock radio station, began playing \"You Oughta Know\", leading to the single receiving commercial success, reaching the top ten in Australia and the United States, where it was a multiformat hit in several different genre charts, and making the top forty in Canada, Sweden, New Zealand, Belgium, the Netherlands, and the United Kingdom.\nIn order to promote the song, an accompanying video was directed by Nick Egan. The single was added in the set list for Morissette's concert tour, Jagged Little Pill World Tour ; since then, it has been included in her albums MTV Unplugged , Feast on Scraps , and The Collection, as well as 1997 Grammys and the MTV Unplugged compilation albums. The song went on to receive numerous accolades; in the 1996, the single was nominated for three Grammy Awards, winning the awards for Best Rock Song and Best Female Rock Vocal Performance.", "title": "You Oughta Know"}