{"summary": "Young's modulus is the measure of how much force is needed to stretch or compress a substance.", "full_text": "Young's modulus, which is also known as the elastic modulus, is a mechanical property of linear elastic solid materials. It defines the relationship between stress  and strain  in a material.\nYoung's modulus is named after the 19th-century British scientist Thomas Young. However, the concept was developed in 1727 by Leonhard Euler, and the first experiments that used the concept of Young's modulus in its current form were performed by the Italian scientist Giordano Riccati in 1782, pre-dating Young's work by 25 years. The term modulus is the diminutive of the Latin term modus which means measure.\nA solid body deforms when a load is applied to it. If the material is elastic, the body returns to its original shape after the load is removed. The material is linear if the ratio of load to deformation remains constant during the loading process. Not many materials are linear and elastic beyond a small amount of deformation. A constant Young's modulus applies only to linear elastic materials. A perfectly rigid material has an infinite Young's modulus because an infinite force is needed to deform such a material. A material whose Young's modulus is very high can be approximated as rigid.\nA stiff material needs more force to deform compared to a soft material. Therefore, the Young's modulus is a measure of the stiffness of a solid material. Do not confuse:\nstiffness and strength: the strength of material is the amount of force it can withstand and still recover its original shape;\nmaterial stiffness and geometric stiffness: the geometric stiffness depends on shape, e.g. the stiffness of an I beam is much higher than that of a spring made of the same steel thus having the same rigidity;\nstiffness and hardness: the hardness of a material defines the relative resistance that its surface imposes against the penetration of a harder body;\nstiffness and toughness: toughness is the amount of energy that a material can absorb before fracturing.", "title": "Young's modulus"}