{"summary": "The Zimmermann Telegram  was a telegram sent to Mexico from Germany on January 16, 1917. It was what made America enter World War I.", "full_text": "The Zimmermann Telegram  was an internal diplomatic communication issued from the German Foreign Office in January, 1917 that proposed a military alliance between Germany and Mexico in the event of the United States entering World War I against Germany. The proposal was intercepted and decoded by British intelligence. Revelation of the contents outraged American public opinion and helped generate support for the United States declaration of war on Germany in April of the same year.\nThe message came in the form of a coded telegram dispatched by the Foreign Secretary of the German Empire, Arthur Zimmermann, on 11 January 1917. The message was sent to the German ambassador to Mexico, Heinrich von Eckardt. Zimmermann sent the telegram in anticipation of the resumption of unrestricted submarine warfare by Germany on 1 February, an act the German government presumed would almost certainly lead to war with the United States. The telegram instructed Ambassador Eckardt that if the United States appeared certain to enter the war, he was to approach the Mexican Government with a proposal for military alliance with funding from Germany.\nThe text of the telegram read as follows:\n\"We intend to begin on the first of February unrestricted submarine warfare. We shall endeavor in spite of this to keep the United States of America neutral. In the event of this not succeeding, we make Mexico a proposal of alliance on the following basis: make war together, make peace together, generous financial support and an understanding on our part that Mexico is to reconquer the lost territory in Texas, New Mexico, and Arizona. The settlement in detail is left to you. You will inform the President of the above most secretly as soon as the outbreak of war with the United States of America is certain and add the suggestion that he should, on his own initiative, invite Japan to immediate adherence and at the same time mediate between Japan and ourselves. Please call the President's attention to the fact that the ruthless employment of our submarines now offers the prospect of compelling England in a few months to make peace.\" Signed, ZIMMERMANN", "title": "Zimmerman Telegram"}