{"summary": "Zinc, sometimes called spelter, is a chemical element.", "full_text": "Zinc, in commerce also spelter, is a chemical element with symbol Zn and atomic number 30. It is the first element of group 12 of the periodic table. In some respects zinc is chemically similar to magnesium: its ion is of similar size and its only common oxidation state is +2. Zinc is the 24th most abundant element in Earth's crust and has five stable isotopes. The most common zinc ore is sphalerite , a zinc sulfide mineral. The largest mineable amounts are found in Australia, Asia, and the United States. Zinc production includes froth flotation of the ore, roasting, and final extraction using electricity .\nBrass, which is an alloy of copper and zinc, has been used since at least the 10th century BC in Judea and by the 7th century BC in Ancient Greece. Zinc metal was not produced on a large scale until the 12th century in India and was unknown to Europe until the end of the 16th century. The mines of Rajasthan have given definite evidence of zinc production going back to the 6th century BC. To date, the oldest evidence of pure zinc comes from Zawar, in Rajasthan, as early as the 9th century AD when a distillation process was employed to make pure zinc. Alchemists burned zinc in air to form what they called \"philosopher's wool\" or \"white snow\".\nThe element was probably named by the alchemist Paracelsus after the German word Zinke. German chemist Andreas Sigismund Marggraf is credited with discovering pure metallic zinc in 1746. Work by Luigi Galvani and Alessandro Volta uncovered the electrochemical properties of zinc by 1800. Corrosion-resistant zinc plating of iron  is the major application for zinc. Other applications are in batteries, small non-structural castings, and alloys, such as brass. A variety of zinc compounds are commonly used, such as zinc carbonate and zinc gluconate , zinc chloride , zinc pyrithione , zinc sulfide , and zinc methyl or zinc diethyl in the organic laboratory.\nZinc is an essential mineral perceived by the public today as being of \"exceptional biologic and public health importance\", especially regarding prenatal and postnatal development. Zinc deficiency affects about two billion people in the developing world and is associated with many diseases. In children it causes growth retardation, delayed sexual maturation, infection susceptibility, and diarrhea. Enzymes with a zinc atom in the reactive center are widespread in biochemistry, such as alcohol dehydrogenase in humans. Consumption of excess zinc can cause ataxia, lethargy and copper deficiency.", "title": "Zinc"}