{"summary": "Zionism is the nationalist movement of the Jewish people to create a Jewish state  in the Holy Land .", "full_text": "Zionism  is a nationalist and political movement of Jews and Jewish culture that supports the re-establishment of a Jewish homeland in the territory defined as the historic Land of Israel . Zionism emerged in the late 19th century in central and eastern Europe as a national revival movement, called Hovevei Tziyon. Soon after this most leaders of the movement associated the main goal with creating the desired state in Palestine, then an area controlled by the Ottoman Empire.\nThe primary goals of Zionism until 1948, were the re-establishment of Jewish sovereignty in the Land of Israel , ingathering of the exiles, and liberation of Jews from the antisemitic discrimination and persecution that occurred in their diaspora. Since the establishment of the State of Israel in 1948, Zionism continues primarily to advocate on behalf of Israel and address threats to its continued existence and security.\nA religious variety of Zionism supports Jews upholding their Jewish identity defined as adherence to religious Judaism, opposes the assimilation of Jews into other societies, and has advocated the return of Jews to Israel as a means for Jews to be a majority nation in their own state. A variety of Zionism, called cultural Zionism, founded and represented most prominently by Ahad Ha'am, fostered a secular vision of a Jewish \"spiritual center\" in Israel. Unlike Herzl, the founder of political Zionism, Ahad Ha'am strived for Israel to be \"a Jewish state and not merely a state of Jews\". Another less common meaning is the political support for the State of Israel by non-Jews.\nAdvocates of Zionism view it as a national liberation movement for the repatriation of a persecuted people residing as minorities in a variety of nations, to the homeland to which they had a historical connection. Critics of Zionism view it as a colonialist, racist and exceptionalist ideology that led advocates to violence during Mandatory Palestine, followed by the forced exodus of Palestinians, and the subsequent denial of their human rights.", "title": "Zionism"}